{
  "ticker": "A",
  "cik": "0001090872",
  "company_name": "Agilent Technologies",
  "corrected_name": "Agilent Technologies",
  "wiki_title_used": "Agilent Technologies",
  "exists": true,
  "raw_text": "Agilent Technologies, Inc. is an American global company headquartered in Santa Clara, California, that provides instruments, software, services, and consumables for laboratories. Agilent was established in 1999 as a spin-off from Hewlett-Packard. The resulting IPO of Agilent stock was the largest in the history of Silicon Valley at the time. From 1999 to 2014, the company produced optics (LED, laser), semiconductors, EDA software and test and measurement equipment for electronics; that division was spun off to form Keysight. Since then, the company has continued to expand into pharmaceutical, diagnostics & clinical, and academia & government (research) markets.\n\nHistory\nIn 1965, Hewlett-Packard branched out into scientific equipment by acquiring F&M Scientific, maker of gas chromatographs. Agilent Technologies was created in 1999 as a spin-off of several business units of Hewlett-Packard including test & measurement, optics, instrumentation and chemical analysis, electronic components, and medical equipment product lines.  The split was predicated on the difficulty of growing HP's revenue stream and on the competitive vigor of smaller, more agile competitors.  The company's launch slogan was \"Innovating the HP Way\", which capitalized on the strong HP corporate culture called The HP Way.  The starburst logo was selected to reflect \"a burst of insight\" (or \"spark of insight\") and the name \"Agilent\" aimed to invoke the notion of agility as a trait of the new firm.  The Agilent spin-off was accompanied by an initial public offering which raised $2.1 billion, setting a record at the time.\n\n2000–2009\nIn the early 2000s, \"economic uncertainty\" depressed demand for Agilent's products, including slow sales of health care products to hospitals in the United States, which accounted for 60% of the company's revenue at the time.  The downturn also struck sales in the communications and semiconductor markets, where orders amounting to $500 million were canceled by buyers.  These poor economic conditions prompted large reductions in force with 18,500 positions cut in 2003.  In 2001, in midst of this downsizing, Agilent sold its health care and medical products organization to Philips Medical Systems, and was noted as having a valuation of about $11 billion. HP Medical Products had been the second oldest part of Hewlett-Packard, acquired in the 1950s.\nIn August 2005, Agilent announced the sale of its business which produced semiconductor integrated circuits (known as \"chips\") for consumer and industrial uses to Kohlberg Kravis Roberts and Silver Lake Partners for $2.66 billion.  This move would involve termination of about 1,300 of the company's 28,000 employees.  The group operated as a private company, Avago Technologies, until August 2009, when it was brought public in an IPO. After purchasing Broadcom Corporation in 2016, Avago changed its name to Broadcom Limited.\nAlso in August 2005, Agilent sold its 47% stake in the light-emitting diode manufacturer Lumileds to Philips for $1 billion.  Lumileds originally started as Hewlett-Packard's optoelectronics division.\nAlso in August 2005, Agilent announced a plan to divest its semiconductor test business, composed of both the system-on-chip and memory test market areas. Agilent listed the new company as Verigy on the Nasdaq in mid-2006.\n\n2010 onwards\nIn 2009, Agilent announced the closure of a subsection of its Test & Measurement division. The product lines affected included the automated optical inspection, solder paste inspection, and automated X-ray products [5DX] in 2004. In 2011, the company, along with the University of California, Davis, announced that it would be establishing the \"Davis Millimeter Wave Research Center\". Agilent announced it would increase its life sciences engagement through the acquisition of Halo Genomics, based in Uppsala, Sweden, which was involved in next-generation sequencing technology development.\nOn May 17, 2012, Agilent agreed to buy Dako, a Danish cancer diagnostics company, for $2.2 billion, to expand its presence in the life sciences industry.\nOn September 19, 2013, Agilent announced its decision to separate into two publicly traded companies: Agilent, a life sciences, diagnostics, and applied markets company, and an electronic measurement company. The life sciences company retained the Agilent name and the electronic measurement company was called Keysight Technologies. On October 14, 2014, the company announced that it is exiting its Nuclear Magnetic Resonance business. On November 1, the formal separation of Agilent and Keysight Technologies was completed. Agilent announced it had completed the spin-off of its electronic measurement business, Keysight Technologies.\nIn September 2015, the company announced it would acquire Seahorse Bioscience for $235 million.\nOn July 7, 2016, Agilent announced that they had acquired U.K. based Cobalt Light Systems, which develops and manufactures Raman spectroscopy instruments, for £40 million in cash. In December the company acquired Multiplicom N.V.\nIn January 2018, the company announced it would acquire Luxcel Biosciences, increasing the company's cell analysis portfolio. In May, Agilent acquired Lasergen, Inc. after the end of its two-year option on a prior investment. In the same month it acquired digital laboratory management company, Genohm, Ultra Scientific, provider of chemical standards and reference materials and Advanced Analytical Technologies, Inc. (AATI), provider of capillary electrophoresis-based molecules for $250 million in cash. In August the company announced it would acquire glycan reagent producer, ProZyme, Inc. and South Korean instrument distributor, Young In Scientific Co. Ltd. In September Agilent acquired ACEA Biosciences for $250 million increasing the company's presence in cell analysis technologies. In August 2019, Agilent acquired US-based BioTek Instruments, a designer, manufacturer, and distributor of life science instrumentation, for $1.165 billion.\nOn May 1, 2024, Padraig McDonnell succeeded Mike McMullen as CEO.\n\nProducts and services\nAgilent serves analytical laboratories and the clinical and routine diagnostics markets with a full suite of technology platforms. These include: automation, bioreagents, FISH probes, gas and liquid chromatography, immunohistochemistry, informatics, mass spectrometry, microarrays, spectroscopy, target enrichment, and vacuum technologies.\nAgilent also provides lab management services, including enterprise asset management, laboratory business intelligence, equipment management and service, software maintenance, regulatory compliance, sample preparation, genomics and cloning, GC and HPLC columns, spectrometry and spectroscopy supplies, and consumables. The company is known for investing in R&D within its own research labs and those of leading universities to advance the state of knowledge in the life sciences, diagnostics, and chemical analysis space.\nIn recent years, the company has advanced digital lab instrumentation and technology that improves lab workflow and overall efficiency and productivity. In 2020, Agilent introduced CrossLab Virtual Assist, a mobile app that facilities high-quality remote technical support. Agilent’s digital advancements, including CrossLab Connect, have also improved lab optimization and sustainability by providing more efficient utilization of instruments, which can lower a lab’s energy consumption.\nAgilent is also a pioneer of the target enrichment used as part of a NGS workflow. The portfolio also includes sample prep, QA/QC instrumentation, 2100 bioanalyzers, and automation tools.\nIn early 2023, the company announced a $725 million expansion of its nucleic acid-based therapeutics manufacturing facility in Frederick, Colorado.\n\nNotes\nReferences\nFurther reading\nBooks\nLeflar, James A. (2001). Practical TPM: Successful Equipment Management at Agilent Technologies. Portland, Oregon: Productivity Press. ISBN 9781563272424. OCLC 45493253 – via Google Books (preview).\n\nNews items\nFrank, Steve (10 September 2000). \"Playing the Net\". Santa Cruz Sentinel. Retrieved 2015-07-28 – via Newspapers.com. Q: Last month I purchased shares of Agilent Technologies and the price has gone up and down since then.  Are its future prospects solid?\n\nExternal links\nOfficial website\n\n\"History Links: HP, Agilent, EDS, Compaq, Tandem...\" Hewlett-Packard Alumni Association, Inc. Retrieved 19 December 2014.\n\"Patents assigned to Agilent\". US Patent and Trademark Office. Archived from the original on 3 May 2017. Retrieved 19 December 2014.\n\nBusiness data for Agilent Technologies:",
  "clean_text": "Agilent Technologies, Inc. is an American global company headquartered in Santa Clara, California, that provides instruments, software, services, and consumables for laboratories. Agilent was established in 1999 as a spin-off from Hewlett-Packard. The resulting IPO of Agilent stock was the largest in the history of Silicon Valley at the time. From 1999 to 2014, the company produced optics (LED, laser), semiconductors, EDA software and test and measurement equipment for electronics; that division was spun off to form Keysight. Since then, the company has continued to expand into pharmaceutical, diagnostics & clinical, and academia & government (research) markets. History In 1965, Hewlett-Packard branched out into scientific equipment by acquiring F&M Scientific, maker of gas chromatographs. Agilent Technologies was created in 1999 as a spin-off of several business units of Hewlett-Packard including test & measurement, optics, instrumentation and chemical analysis, electronic components, and medical equipment product lines. The split was predicated on the difficulty of growing HP's revenue stream and on the competitive vigor of smaller, more agile competitors. The company's launch slogan was \"Innovating the HP Way\", which capitalized on the strong HP corporate culture called The HP Way. The starburst logo was selected to reflect \"a burst of insight\" (or \"spark of insight\") and the name \"Agilent\" aimed to invoke the notion of agility as a trait of the new firm. The Agilent spin-off was accompanied by an initial public offering which raised $2.1 billion, setting a record at the time. 2000–2009 In the early 2000s, \"economic uncertainty\" depressed demand for Agilent's products, including slow sales of health care products to hospitals in the United States, which accounted for 60% of the company's revenue at the time. The downturn also struck sales in the communications and semiconductor markets, where orders amounting to $500 million were canceled by buyers. These poor economic conditions prompted large reductions in force with 18,500 positions cut in 2003. In 2001, in midst of this downsizing, Agilent sold its health care and medical products organization to Philips Medical Systems, and was noted as having a valuation of about $11 billion. HP Medical Products had been the second oldest part of Hewlett-Packard, acquired in the 1950s. In August 2005, Agilent announced the sale of its business which produced semiconductor integrated circuits (known as \"chips\") for consumer and industrial uses to Kohlberg Kravis Roberts and Silver Lake Partners for $2.66 billion. This move would involve termination of about 1,300 of the company's 28,000 employees. The group operated as a private company, Avago Technologies, until August 2009, when it was brought public in an IPO. After purchasing Broadcom Corporation in 2016, Avago changed its name to Broadcom Limited. Also in August 2005, Agilent sold its 47% stake in the light-emitting diode manufacturer Lumileds to Philips for $1 billion. Lumileds originally started as Hewlett-Packard's optoelectronics division. Also in August 2005, Agilent announced a plan to divest its semiconductor test business, composed of both the system-on-chip and memory test market areas. Agilent listed the new company as Verigy on the Nasdaq in mid-2006. 2010 onwards In 2009, Agilent announced the closure of a subsection of its Test & Measurement division. The product lines affected included the automated optical inspection, solder paste inspection, and automated X-ray products [5DX] in 2004. In 2011, the company, along with the University of California, Davis, announced that it would be establishing the \"Davis Millimeter Wave Research Center\". Agilent announced it would increase its life sciences engagement through the acquisition of Halo Genomics, based in Uppsala, Sweden, which was involved in next-generation sequencing technology development. On May 17, 2012, Agilent agreed to buy Dako, a Danish cancer diagnostics company, for $2.2 billion, to expand its presence in the life sciences industry. On September 19, 2013, Agilent announced its decision to separate into two publicly traded companies: Agilent, a life sciences, diagnostics, and applied markets company, and an electronic measurement company. The life sciences company retained the Agilent name and the electronic measurement company was called Keysight Technologies. On October 14, 2014, the company announced that it is exiting its Nuclear Magnetic Resonance business. On November 1, the formal separation of Agilent and Keysight Technologies was completed. Agilent announced it had completed the spin-off of its electronic measurement business, Keysight Technologies. In September 2015, the company announced it would acquire Seahorse Bioscience for $235 million. On July 7, 2016, Agilent announced that they had acquired U.K. based Cobalt Light Systems, which develops and manufactures Raman spectroscopy instruments, for £40 million in cash. In December the company acquired Multiplicom N.V. In January 2018, the company announced it would acquire Luxcel Biosciences, increasing the company's cell analysis portfolio. In May, Agilent acquired Lasergen, Inc. after the end of its two-year option on a prior investment. In the same month it acquired digital laboratory management company, Genohm, Ultra Scientific, provider of chemical standards and reference materials and Advanced Analytical Technologies, Inc. (AATI), provider of capillary electrophoresis-based molecules for $250 million in cash. In August the company announced it would acquire glycan reagent producer, ProZyme, Inc. and South Korean instrument distributor, Young In Scientific Co. Ltd. In September Agilent acquired ACEA Biosciences for $250 million increasing the company's presence in cell analysis technologies. In August 2019, Agilent acquired US-based BioTek Instruments, a designer, manufacturer, and distributor of life science instrumentation, for $1.165 billion. On May 1, 2024, Padraig McDonnell succeeded Mike McMullen as CEO. Products and services Agilent serves analytical laboratories and the clinical and routine diagnostics markets with a full suite of technology platforms. These include: automation, bioreagents, FISH probes, gas and liquid chromatography, immunohistochemistry, informatics, mass spectrometry, microarrays, spectroscopy, target enrichment, and vacuum technologies. Agilent also provides lab management services, including enterprise asset management, laboratory business intelligence, equipment management and service, software maintenance, regulatory compliance, sample preparation, genomics and cloning, GC and HPLC columns, spectrometry and spectroscopy supplies, and consumables. The company is known for investing in R&D within its own research labs and those of leading universities to advance the state of knowledge in the life sciences, diagnostics, and chemical analysis space. In recent years, the company has advanced digital lab instrumentation and technology that improves lab workflow and overall efficiency and productivity. In 2020, Agilent introduced CrossLab Virtual Assist, a mobile app that facilities high-quality remote technical support. Agilent’s digital advancements, including CrossLab Connect, have also improved lab optimization and sustainability by providing more efficient utilization of instruments, which can lower a lab’s energy consumption. Agilent is also a pioneer of the target enrichment used as part of a NGS workflow. The portfolio also includes sample prep, QA/QC instrumentation, 2100 bioanalyzers, and automation tools. In early 2023, the company announced a $725 million expansion of its nucleic acid-based therapeutics manufacturing facility in Frederick, Colorado. Notes"
}