{
  "ticker": "ABBV",
  "cik": "0001551152",
  "company_name": "AbbVie",
  "corrected_name": "AbbVie",
  "wiki_title_used": "AbbVie",
  "exists": true,
  "raw_text": "AbbVie Inc. is an American pharmaceutical company headquartered in North Chicago, Illinois. They have produced drugs to treat a wide range of medical issues. \nThe company is ranked sixth on the list of largest biomedical companies by revenue. It is ranked 77th on the Fortune 500 and 108th on the Forbes Global 2000.\nThe name \"AbbVie\" is derived from a combination of \"Abbott\", the name of its former parent company, with \"vie\", intended as a reference to a Latin root meaning 'life'.\n\nHistory\nAbbVie was formed in 2012 as a corporate spin-off from Abbott Laboratories. It became a public company in January 2013.\nIn January 2014, the company acquired ImmuVen, a startup incubated at the University of Illinois Urbana-Champaign and focused on biotherapeutics to treat cancer, infectious disease, and autoimmune disorders.\nIn September 2014, AbbVie and Infinity Pharmaceuticals entered into a collaboration to develop and commercialize duvelisib, Infinity's PI3K inhibitor for the treatment of patients with cancer. On the same day, AbbVie and Calico entered into a R&D collaboration intended to discover, develop and bring to market new therapies for patients with aging-associated diseasess including neurodegeneration and cancer. California Life Company, operating as Calico, is an Alphabet Inc. subsidiary focused on aging and age-related diseases, and led by former Genentech chairman and CEO of Arthur D. Levinson and former Genentech EVP and chief medical officer Hal V. Barron (who subsequently left the company).\nIn October 2014, AbbVie ended its efforts to acquire Shire, which would have been one of the largest M&A deals of that year and one of the largest tax inversions in history, due to changes in the US tax code by the US Treasury; AbbVie had to pay a $1.6 billion breakup fee.\nIn May 2015, AbbVie acquired oncology firm Pharmacyclics and its treatment for blood cancers, ibrutinib; AstraZeneca had also been bidding to acquire Pharmacyclics. The Pharmacyclics name was retained, and it operated as a subsidiary of AbbVie from its previous Sunnyvale, California headquarters until the consolidation of AbbVie Bay Area sites in a new building in South San Francisco. \nIn June 2015, AbbVie and Halozyme Therapeutics entered into a global collaboration and licensing agreement to develop and commercialize products that combine AbbVie's treatments and Halozyme's ENHANZE drug-delivery technology, this was terminated in November 2016.\nIn February 2016, AbbVie and Cambridge, Massachusetts-based Synlogic announced a multi-year R&D collaboration. Synlogic is a synthetic biology company built on research from the labs of James Collins and Tim Lu at MIT. As part of the collaboration, AbbVie is getting worldwide rights to Synlogic's probiotic-based technology for treating inflammatory bowel disease, and the research teams will focus on Crohn's disease and ulcerative colitis.\nIn April 2016, the company announced it would acquire Stemcentrx for up to $9.8 billion. A day later, the company announced an expansion of a two and a half-year-old cystic fibrosis deal with Galapagos NV, potentially doubling milestone payments to $600 million.\nAlso in April 2016, the company partnered with the University of Chicago to investigate several areas of oncology: breast, lung, prostate, colorectal and hematological cancers. \nAlso in April 2016, the company announced it would co-commercialize Argenx's preclinical immunotherapy, ARGX-115. ARGX-115 is a first-in-class immunotherapy targeting GARP (glycoprotein A repetitions predominant), a membrane protein believed to enhance the immunosuppressive effects of T cells. The company also announced a deal to co-develop/commercialize at least one of CytomX Probody's conjugates against CD71 (transferrin receptor 1).\nIn June 2019, AbbVie announced it would acquire Irish-based Allergan plc for about $63 billion; however the transaction was not structured as a tax inversion; AbbVie remained legally domiciled in the U.S. for tax purposes. To gain FTC approval, the company divested Allergan's late-stage gastrointestinal candidate brazikumab to AstraZeneca as well as two pancreatic replacement enzymes, Zenpep and Viokace, to Nestlé.\nIn July 2019, the company announced it would acquire Mavupharma, boosting its cancer drug pipeline.\nIn March 2020, during the COVID-19 pandemic, AbbVie announced plans to evaluate the Kaletra/Aluvia HIV medicine as possible COVID-19 treatment. The company entered into various partnerships with health authorities in different countries to investigate the efficacy of the medication. However, the first non-blinded, randomized trial found the drug not useful to treat severe COVID-19. The Israeli government announced that it would force AbbVie to license its patents for Kaletra, the brand name of lopinavir/ritonavir, a fixed dose combination medication for the treatment and prevention of HIV/AIDS which was also thought to have some applicability to fighting COVID-19. In response, AbbVie announced that it would cease enforcing its patents on the drug entirely.\nIn May 2021, Allergan Aesthetics announced the acquisition of Soliton. In June, Abbvie acquired TeneoOne and its lead compound TNB-383B. The compound is a BCMA-targeting immunotherapeutic for relapsed or refractory multiple myeloma.\nIn March 2022, AbbVie acquired Syndesi Therapeutics for up to $1 billion and its portfolio of novel modulators of the synaptic vesicle protein 2A and lead compound SDI-118. In October, the company acquired DJS Antibodies for $225 million, giving it access to an experimental drug for an aggressive lung disease as well as technology to develop certain antibody medicines.\nIn January 2023, Humira began facing competition from biosimilars.\nIn February 2024, AbbVie acquired ImmunoGen for $10.1 billion, aiming to expedite its entry into the ovarian cancer treatment market with ImmunoGen's drug Elahere.\nAlso in February 2024, AbbVie and Tentarix Biotherapeutics announced the beginning of a long-term collaboration in the discovery and development of opportunistic, multi-specific biological candidates in oncology and immunology. AbbVie provides expertise in these areas, and will also provide Tentarix with option advances worth $64 million for two programs, and Tentarix will provide its patented Tentarix Tentacles™platform. AbbVie also received an option to purchase the software in full. \nIn March 2024, the company announced it would acquire Landos Biopharma for over $200 million.\nIn June 2024, Robert Michael replaced Richard Gonzalez as CEO of AbbVie. Gonzalez became the executive chairman.\nIn August 2024, AbbVie acquired neuroscience drugmaker Cerevel Therapeutics for $8.7 billion, in an attempt to expand its drug pipeline.\nIn September 2024, AbbVie filed a lawsuit against BeiGene accusing it of stealing trade secrets to develop a competing therapy to treat blood and bone marrow cancers related to the growth of \"B cells\" after BeiGene hired a former longtime senior AbbVie scientist. \nIn October 2024, AbbVie acquired Aliada Therapeutics for $1.4 billion to expand its neuroscience pipeline. \nIn January 2025, AbbVie acquired Nimble Therapeutics, a Roche spinout working to develop oral peptide treatments in the autoimmune area, for $200 million.\nAlso in January 2025, AbbVie announced a $1.64 billion partnership with Neomorph to develop new molecular glue degraders for multiple targets across oncology and immunology. In the same month, it announced a $1 billion partnership with Simcere Zaiming to develop an investigational drug candidate for multiple myeloma.\nIn May 2025, AbbVie entered into a collaboration and license option deal with ADARx Pharmaceuticals to develop a new type of RNA technology for disease areas like neuroscience, immunology and oncology.\n\nMajor products\nThe company's major products are: Humira (adalimumab) ($9 billion in 2024 revenues, 16% of total revenues), approved to treat autoimmune diseases including rheumatoid arthritis, juvenile idiopathic arthritis, psoriatic arthritis, plaque psoriasis, crohn's disease and ulcerative colitis and administered via injection; Skyrizi (Risankizumab) ($11.7 billion in 2024 revenues, 21% of total revenues), an interleukin-23 (IL-23) inhibitor also used to treat autoimmune diseases; Rinvoq (Upadacitinib) ($6.0 billion in 2023 revenues, 11% of total revenues), used to treat arthritis; and Botox ($6.0 billion in 2024 revenues, 11% of total revenues). Its other major products include Imbruvica (Ibrutinib) to treat cancer ($3.3 billion in 2024 revenues), Vraylar (Cariprazine) to treat schizophrenia and bipolar disorder ($3.3 billion in 2024 revenues), Venclexta (Venetoclax) to treat leukemia and lymphoma ($2.6 billion in 2024 revenues), Mavyret (Glecaprevir/pibrentasvir) to treat Hepatitis C ($1.3 billion in 2024 revenues), and Epkinly (epcoritamab), a blood-cancer therapy developed in partnership with Genmab ($0.1 billion in 2024 revenues). The company is also committed to product development for other treatments of cancer, neurologic diseases, eye care, and cystic fibrosis. The company's pipeline also includes drug candidates for Parkinson's disease including Vyalev (Foscarbidopa/foslevodopa) and tavapadon.\n\nAcquisition history\nLegal issues\nAnti-competitive practices\nAbbVie has been accused of using anti-competitive patent thickets to prevent potentially cheaper biosimilars from entering the market.\nAbbVie and Alvotech, filed lawsuits against each other regarding a Humira biosimilar introduced by Alvotech. The lawsuits were was settled out of court in 2022.\nForest Laboratories, a subsidiary of AbbVie, was accused of using unlawful deals to prevent generic versions of its Alzheimer's disease drug, Namenda, from entering the market.\nIn 2018, AbbVie agreed to pay $25 million to resolve allegations that it used kickback schemes to promote its cholesterol drug TriCor (fenofibrate).\nIn 2020, AbbVie agreed to pay $24 million to resolve allegations that it used kickback schemes to promote Humira using \"nurse ambassadors\".\nA report from the House Oversight and Reform Committee found that \"AbbVie pursued a variety of tactics to increase drug sales while raising prices for Americans, including exploiting the patent system to extend its market monopoly, abusing orphan drug protections to further block competition, and engaging in anticompetitive pricing practices\". Pursuant to the Inflation Reduction Act, the price of Imbruvica was reduced by 38%, to $9,319 per month, effective in 2026.\n\nTax avoidance\nIn June 2021, the United States Senate Finance Committee, under Chair Ron Wyden (D-OR), began an investigation to determine if the company took advantage of loopholes in the Tax Cuts and Jobs Act of 2017 to significantly reduce its tax liability. In a letter to AbbVie CEO Richard Gonzalez, Wyden noted the company suffered a 2020 pretax loss in the US of $4.5 billion and an overseas pretax profit of $7.9 billion the same year. The report, released in July 2022, showed that AbbVie was able to dodge U.S. taxes by registering intellectual property in offshore jurisdictions such as Bermuda. As a result, while AbbVie received 75% of its sales of Humira in the United States, it only reported 1% of that income for U.S. tax purposes.\n\nMarketing of opioid painkillers\nIn July 2022 the company agreed to pay up to $2.37 billion to settle U.S. lawsuits against its Allergan unit over the marketing of opioid analgesics. AbbVie denied any wrongdoing.\n\nLitigation by the company against the NHS\nIn 2018, AbbVie sued NHS England in the Technology and Construction Court claiming that the agency breached procurement rules and had not treated the company fairly when seeking suppliers for hepatitis C treatments. In 2019, a UK court dismissed AbbVie's case against the NHS.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for AbbVie Inc.:",
  "clean_text": "AbbVie Inc. is an American pharmaceutical company headquartered in North Chicago, Illinois. They have produced drugs to treat a wide range of medical issues. The company is ranked sixth on the list of largest biomedical companies by revenue. It is ranked 77th on the Fortune 500 and 108th on the Forbes Global 2000. The name \"AbbVie\" is derived from a combination of \"Abbott\", the name of its former parent company, with \"vie\", intended as a reference to a Latin root meaning 'life'. History AbbVie was formed in 2012 as a corporate spin-off from Abbott Laboratories. It became a public company in January 2013. In January 2014, the company acquired ImmuVen, a startup incubated at the University of Illinois Urbana-Champaign and focused on biotherapeutics to treat cancer, infectious disease, and autoimmune disorders. In September 2014, AbbVie and Infinity Pharmaceuticals entered into a collaboration to develop and commercialize duvelisib, Infinity's PI3K inhibitor for the treatment of patients with cancer. On the same day, AbbVie and Calico entered into a R&D collaboration intended to discover, develop and bring to market new therapies for patients with aging-associated diseasess including neurodegeneration and cancer. California Life Company, operating as Calico, is an Alphabet Inc. subsidiary focused on aging and age-related diseases, and led by former Genentech chairman and CEO of Arthur D. Levinson and former Genentech EVP and chief medical officer Hal V. Barron (who subsequently left the company). In October 2014, AbbVie ended its efforts to acquire Shire, which would have been one of the largest M&A deals of that year and one of the largest tax inversions in history, due to changes in the US tax code by the US Treasury; AbbVie had to pay a $1.6 billion breakup fee. In May 2015, AbbVie acquired oncology firm Pharmacyclics and its treatment for blood cancers, ibrutinib; AstraZeneca had also been bidding to acquire Pharmacyclics. The Pharmacyclics name was retained, and it operated as a subsidiary of AbbVie from its previous Sunnyvale, California headquarters until the consolidation of AbbVie Bay Area sites in a new building in South San Francisco. In June 2015, AbbVie and Halozyme Therapeutics entered into a global collaboration and licensing agreement to develop and commercialize products that combine AbbVie's treatments and Halozyme's ENHANZE drug-delivery technology, this was terminated in November 2016. In February 2016, AbbVie and Cambridge, Massachusetts-based Synlogic announced a multi-year R&D collaboration. Synlogic is a synthetic biology company built on research from the labs of James Collins and Tim Lu at MIT. As part of the collaboration, AbbVie is getting worldwide rights to Synlogic's probiotic-based technology for treating inflammatory bowel disease, and the research teams will focus on Crohn's disease and ulcerative colitis. In April 2016, the company announced it would acquire Stemcentrx for up to $9.8 billion. A day later, the company announced an expansion of a two and a half-year-old cystic fibrosis deal with Galapagos NV, potentially doubling milestone payments to $600 million. Also in April 2016, the company partnered with the University of Chicago to investigate several areas of oncology: breast, lung, prostate, colorectal and hematological cancers. Also in April 2016, the company announced it would co-commercialize Argenx's preclinical immunotherapy, ARGX-115. ARGX-115 is a first-in-class immunotherapy targeting GARP (glycoprotein A repetitions predominant), a membrane protein believed to enhance the immunosuppressive effects of T cells. The company also announced a deal to co-develop/commercialize at least one of CytomX Probody's conjugates against CD71 (transferrin receptor 1). In June 2019, AbbVie announced it would acquire Irish-based Allergan plc for about $63 billion; however the transaction was not structured as a tax inversion; AbbVie remained legally domiciled in the U.S. for tax purposes. To gain FTC approval, the company divested Allergan's late-stage gastrointestinal candidate brazikumab to AstraZeneca as well as two pancreatic replacement enzymes, Zenpep and Viokace, to Nestlé. In July 2019, the company announced it would acquire Mavupharma, boosting its cancer drug pipeline. In March 2020, during the COVID-19 pandemic, AbbVie announced plans to evaluate the Kaletra/Aluvia HIV medicine as possible COVID-19 treatment. The company entered into various partnerships with health authorities in different countries to investigate the efficacy of the medication. However, the first non-blinded, randomized trial found the drug not useful to treat severe COVID-19. The Israeli government announced that it would force AbbVie to license its patents for Kaletra, the brand name of lopinavir/ritonavir, a fixed dose combination medication for the treatment and prevention of HIV/AIDS which was also thought to have some applicability to fighting COVID-19. In response, AbbVie announced that it would cease enforcing its patents on the drug entirely. In May 2021, Allergan Aesthetics announced the acquisition of Soliton. In June, Abbvie acquired TeneoOne and its lead compound TNB-383B. The compound is a BCMA-targeting immunotherapeutic for relapsed or refractory multiple myeloma. In March 2022, AbbVie acquired Syndesi Therapeutics for up to $1 billion and its portfolio of novel modulators of the synaptic vesicle protein 2A and lead compound SDI-118. In October, the company acquired DJS Antibodies for $225 million, giving it access to an experimental drug for an aggressive lung disease as well as technology to develop certain antibody medicines. In January 2023, Humira began facing competition from biosimilars. In February 2024, AbbVie acquired ImmunoGen for $10.1 billion, aiming to expedite its entry into the ovarian cancer treatment market with ImmunoGen's drug Elahere. Also in February 2024, AbbVie and Tentarix Biotherapeutics announced the beginning of a long-term collaboration in the discovery and development of opportunistic, multi-specific biological candidates in oncology and immunology. AbbVie provides expertise in these areas, and will also provide Tentarix with option advances worth $64 million for two programs, and Tentarix will provide its patented Tentarix Tentacles™platform. AbbVie also received an option to purchase the software in full. In March 2024, the company announced it would acquire Landos Biopharma for over $200 million. In June 2024, Robert Michael replaced Richard Gonzalez as CEO of AbbVie. Gonzalez became the executive chairman. In August 2024, AbbVie acquired neuroscience drugmaker Cerevel Therapeutics for $8.7 billion, in an attempt to expand its drug pipeline. In September 2024, AbbVie filed a lawsuit against BeiGene accusing it of stealing trade secrets to develop a competing therapy to treat blood and bone marrow cancers related to the growth of \"B cells\" after BeiGene hired a former longtime senior AbbVie scientist. In October 2024, AbbVie acquired Aliada Therapeutics for $1.4 billion to expand its neuroscience pipeline. In January 2025, AbbVie acquired Nimble Therapeutics, a Roche spinout working to develop oral peptide treatments in the autoimmune area, for $200 million. Also in January 2025, AbbVie announced a $1.64 billion partnership with Neomorph to develop new molecular glue degraders for multiple targets across oncology and immunology. In the same month, it announced a $1 billion partnership with Simcere Zaiming to develop an investigational drug candidate for multiple myeloma. In May 2025, AbbVie entered into a collaboration and license option deal with ADARx Pharmaceuticals to develop a new type of RNA technology for disease areas like neuroscience, immunology and oncology. Major products The company's major products are: Humira (adalimumab) ($9 billion in 2024 revenues, 16% of total revenues), approved to treat autoimmune diseases including rheumatoid arthritis, juvenile idiopathic arthritis, psoriatic arthritis, plaque psoriasis, crohn's disease and ulcerative colitis and administered via injection; Skyrizi (Risankizumab) ($11.7 billion in 2024 revenues, 21% of total revenues), an interleukin-23 (IL-23) inhibitor also used to treat autoimmune diseases; Rinvoq (Upadacitinib) ($6.0 billion in 2023 revenues, 11% of total revenues), used to treat arthritis; and Botox ($6.0 billion in 2024 revenues, 11% of total revenues). Its other major products include Imbruvica (Ibrutinib) to treat cancer ($3.3 billion in 2024 revenues), Vraylar (Cariprazine) to treat schizophrenia and bipolar disorder ($3.3 billion in 2024 revenues), Venclexta (Venetoclax) to treat leukemia and lymphoma ($2.6 billion in 2024 revenues), Mavyret (Glecaprevir/pibrentasvir) to treat Hepatitis C ($1.3 billion in 2024 revenues), and Epkinly (epcoritamab), a blood-cancer therapy developed in partnership with Genmab ($0.1 billion in 2024 revenues). The company is also committed to product development for other treatments of cancer, neurologic diseases, eye care, and cystic fibrosis. The company's pipeline also includes drug candidates for Parkinson's disease including Vyalev (Foscarbidopa/foslevodopa) and tavapadon. Acquisition history Legal issues Anti-competitive practices AbbVie has been accused of using anti-competitive patent thickets to prevent potentially cheaper biosimilars from entering the market. AbbVie and Alvotech, filed lawsuits against each other regarding a Humira biosimilar introduced by Alvotech. The lawsuits were was settled out of court in 2022. Forest Laboratories, a subsidiary of AbbVie, was accused of using unlawful deals to prevent generic versions of its Alzheimer's disease drug, Namenda, from entering the market. In 2018, AbbVie agreed to pay $25 million to resolve allegations that it used kickback schemes to promote its cholesterol drug TriCor (fenofibrate). In 2020, AbbVie agreed to pay $24 million to resolve allegations that it used kickback schemes to promote Humira using \"nurse ambassadors\". A report from the House Oversight and Reform Committee found that \"AbbVie pursued a variety of tactics to increase drug sales while raising prices for Americans, including exploiting the patent system to extend its market monopoly, abusing orphan drug protections to further block competition, and engaging in anticompetitive pricing practices\". Pursuant to the Inflation Reduction Act, the price of Imbruvica was reduced by 38%, to $9,319 per month, effective in 2026. Tax avoidance In June 2021, the United States Senate Finance Committee, under Chair Ron Wyden (D-OR), began an investigation to determine if the company took advantage of loopholes in the Tax Cuts and Jobs Act of 2017 to significantly reduce its tax liability. In a letter to AbbVie CEO Richard Gonzalez, Wyden noted the company suffered a 2020 pretax loss in the US of $4.5 billion and an overseas pretax profit of $7.9 billion the same year. The report, released in July 2022, showed that AbbVie was able to dodge U.S. taxes by registering intellectual property in offshore jurisdictions such as Bermuda. As a result, while AbbVie received 75% of its sales of Humira in the United States, it only reported 1% of that income for U.S. tax purposes. Marketing of opioid painkillers In July 2022 the company agreed to pay up to $2.37 billion to settle U.S. lawsuits against its Allergan unit over the marketing of opioid analgesics. AbbVie denied any wrongdoing. Litigation by the company against the NHS In 2018, AbbVie sued NHS England in the Technology and Construction Court claiming that the agency breached procurement rules and had not treated the company fairly when seeking suppliers for hepatitis C treatments. In 2019, a UK court dismissed AbbVie's case against the NHS."
}