{
  "ticker": "ACGL",
  "cik": "0000947484",
  "company_name": "Arch Capital Group",
  "corrected_name": "Arch Capital Group",
  "wiki_title_used": "Arch Capital Group",
  "exists": true,
  "raw_text": "Arch Capital Group Ltd. (Arch Capital or ACGL) is a Bermuda exempted public company which writes insurance, reinsurance and mortgage insurance on a worldwide basis, with a focus on specialty lines, the segment of the insurance industry where the more difficult and unusual risks are written. The company is headquartered in Bermuda and operates globally in 60 offices in North America, Europe, Asia and Australia.\n\nHistory\nThe company was founded in May 2000 by Robert Clements and Peter A. Appel, with Appel as president and CEO. The company's predecessor entity, Risk Capital Holdings had previously sold substantially all of the reinsurance operations of Risk Capital Reinsurance Co., its wholly owned subsidiary, to Folksamerica Reinsurance Co., and the surviving vehicle was the entity used to form Arch Capital.\nFollowing the event of September 11, 2001, Arch Capital launched an underwriting initiative to address the global demand for insurance and reinsurance capacity.\nIn October 2001, Paul Ingrey joined the company to oversee its reinsurance operations and in January 2002, Dinos Iordanou was hired to run the company's insurance business. In 2003, Iordanou succeeded Appel as Arch Capital's President and CEO, and, in 2018, Marc Grandisson, succeeded Iordanou  and Arch Capital's current CEO, Nicolas Papadopoulo, succeeded Grandisson in 2024, upon his retirement.\nArch Capital entered the mortgage insurance business in 2015 with the formation of Arch Mortgage Guaranty and, in August 2016, it bought United Guaranty, AIG's mortgage insurance unit, for US$3.4 billion, making the company the world's largest mortgage insurer.\nIn 2022, Arch Capital was added to the Standard & Poor's (S&P) 500 Index, replacing Twitter (now X).\nAs of 2025, Arch employs nearly 7,200 people worldwide.\n\nNotable employees\nMeredith Whitney (born 1969), businesswoman\n\nReferences\nExternal links\nOfficial website\nBusiness data for Arch Capital Group Ltd.:",
  "clean_text": "Arch Capital Group Ltd. (Arch Capital or ACGL) is a Bermuda exempted public company which writes insurance, reinsurance and mortgage insurance on a worldwide basis, with a focus on specialty lines, the segment of the insurance industry where the more difficult and unusual risks are written. The company is headquartered in Bermuda and operates globally in 60 offices in North America, Europe, Asia and Australia. History The company was founded in May 2000 by Robert Clements and Peter A. Appel, with Appel as president and CEO. The company's predecessor entity, Risk Capital Holdings had previously sold substantially all of the reinsurance operations of Risk Capital Reinsurance Co., its wholly owned subsidiary, to Folksamerica Reinsurance Co., and the surviving vehicle was the entity used to form Arch Capital. Following the event of September 11, 2001, Arch Capital launched an underwriting initiative to address the global demand for insurance and reinsurance capacity. In October 2001, Paul Ingrey joined the company to oversee its reinsurance operations and in January 2002, Dinos Iordanou was hired to run the company's insurance business. In 2003, Iordanou succeeded Appel as Arch Capital's President and CEO, and, in 2018, Marc Grandisson, succeeded Iordanou and Arch Capital's current CEO, Nicolas Papadopoulo, succeeded Grandisson in 2024, upon his retirement. Arch Capital entered the mortgage insurance business in 2015 with the formation of Arch Mortgage Guaranty and, in August 2016, it bought United Guaranty, AIG's mortgage insurance unit, for US$3.4 billion, making the company the world's largest mortgage insurer. In 2022, Arch Capital was added to the Standard & Poor's (S&P) 500 Index, replacing Twitter (now X). As of 2025, Arch employs nearly 7,200 people worldwide. Notable employees Meredith Whitney (born 1969), businesswoman"
}