{
  "ticker": "ADM",
  "cik": "0000007084",
  "company_name": "Archer Daniels Midland",
  "corrected_name": "Archer Daniels Midland",
  "wiki_title_used": "Archer Daniels Midland",
  "exists": true,
  "raw_text": "The Archer-Daniels-Midland Company, commonly known as ADM, is an American multinational food processing and commodities trading corporation founded in 1902 and headquartered in Chicago, Illinois. The company operates more than 270 plants and 420 crop procurement facilities worldwide, where cereal grains and oilseeds are processed into products used in food, beverage, nutraceutical, industrial, and animal feed markets worldwide.\nADM ranked No. 35 in the 2023 Fortune 500 list of the largest United States corporations.\nThe company also provides agricultural storage and transportation services. The American River Transportation Company along with ADM Trucking, Inc., are subsidiaries of ADM.\nADM has been the subject of significant media attention and infamy over the years with its various scandals, one inspiring a novel and subsequent film The Informant!.\n\nHistory\nEarly history\nIn 1902, John W. Daniels started a linseed crushing business in Minneapolis, Minnesota.\nGeorge A. Archer joined the operation the next year, and in 1905 the firm's name officially became the Archer-Daniels Linseed Company.  In 1923, Archer-Daniels Linseed Company acquired Midland Linseed Products Company and then incorporated as the Archer Daniels Midland Company. The new corporation had total assets exceeding $11 million and controlled just over a third (35%) of the total linseed mill capacity within the United States.\nIn 1924, ADM was listed on the New York Stock Exchange. A series of acquisitions over the next several years expanded the company's oil processing capabilities and agricultural operations, and a grain division was established in 1927. In 1930, ADM purchased control of the flour milling company Commander-Larabee Corp., which was capable of producing 32,000 barrels of flour per day. In 1934 the company began operating its first continuous solvent extraction plant in Chicago, Illinois and could now produce soybean oil. The rapid development of similar extraction plants soon followed.\nBy 1952, Archer Daniel Midland's workforce had expanded to 5,000 employees, and by 1952 the company was operating overseas and manufacturing over 700 products.\nIn 1962, the company acquired a trademark for \"ADM\" and began referring to itself by those initials. In 1965, ADM registered the original patent for textured vegetable protein and began producing the soy flour product at its Decatur East Plant by 1966.\nIn 1966, Dwayne Andreas and his brother Lowell Andreas became minority shareholders in ADM. In 1969, ADM relocated its headquarters from Minneapolis to Decatur, Illinois, a location closer to the company's soybean processing operations. At this time, it was already considered one of the world's largest agribusiness company, with a labor force of more than 24,000 employees.\n\nDwayne Andreas period (1970–1997)\nDwayne Andreas was named CEO of ADM in 1970, and two years later was elected chairman of the company's board. Under his leadership, Archer Daniels Midland acquired many smaller agricultural companies and expanded into international markets,  eventually becoming one of the world's largest agricultural processing companies. During this period, the company's soybean exports increased from $1.5 billion to $7 billion.  \n\nIn 1974, ADM made its first expansion into Europe and South America when the company acquired soybean plants in Holland and Brazil. \nIn 1982, ADM established international grain operations when it purchased a portion of Toepfer International, a Germany-based grain trading firm. \nIn 1989, ADM purchased Collingwood Grain Inc. based in Hutchinson Kansas, adding 48 million bushels of grain storage at 36 terminal elevators.  \nDwayne Andreas stepped down from his position as CEO in 1997 and was succeeded by his nephew G. Allen Andreas. The transition occurred a year after the company pleaded guilty to price-fixing.\n\n2001–present\nIn 2001, Paul B. Mulhollem became the company's president. In December 2001, ADM completed the first U.S. commercial sale to Cuba since the embargo was imposed in October 1960. The next year\nADM sponsored a major agribusiness show in Havana, where the company signed a $10 million contract with Cuba’s food import agency, Alimport, to deliver rice, cooking oil, and soy.\nIn March 2006, G. Allen Andreas announced he was stepping down as CEO. Later, in May 2006, Patricia A. Woertz became the company's chief executive officer. In February 2007, Woertz was elected chairman of the board at ADM.\nIn 2012, the company sought to acquire strategic holdings to support serving Asian markets through the acquisition of GrainCorp, an Australian grain firm with a network of storage and port facilities in Australia. On November 28, 2013, the acquisition was blocked by the Australian Treasurer Joe Hockey after Australia's Foreign Investment Review Board failed to reach a consensus recommendation.\nThe company moved its headquarters to Chicago in 2014. \nThat same year, ADM completed its acquisition of Toepfer International, Germany's largest grain trader, and renamed the company ADM Germany GmbH. The company also announced that it would buy Swiss-German natural ingredient company Wild Flavors for $3 billion, a move aimed at expanding ADM into health-oriented food sectors.\nADM announced the appointment of current CEO Juan R. Luciano on November 5, 2014. Luciano initially joined the company in 2011 as chief operating officer. Under Luciano's leadership, the company restructured its business segments and pursued an aggressive strategy of acquisitions that expanded its human and animal nutrition business.\nIn October 2015, ADM announced the sale of its global cocoa business to Olam International. The sale was valued at about $1.2 billion. Approximately 1,500 employees transferred to Olam with the sale. In January 2017, ADM agreed to sell its crop risk services (insurance) unit to Validus Holdings for $127.5 million. \nIn October 2016, ADM launched its venture capital arm, ADM Ventures, which focused initially on alternative proteins.\nThe Wall Street Journal reported in January 2018 that ADM had approached Bunge Ltd. about a takeover, with details \"unclear\" at the time. At that point, Bunge had a market value of about $9.8 billion, and was also being pursued by Glencore PLC for acquisition, since May 2017. In January 2019, Juan Luciano clarified the company didn't need a \"monster transformational transaction\" and a deal was never made.\nIn March 2018, ADM restructured its business segments into four units: carbohydrate solutions, nutrition, oilseeds, and origination or ag services. The next year, the company announced it was consolidating the ag services and oilseed units. \nIn September 2021, ADM acquired a 75% stake in four pet food companies for a total of $450 million, including PetDine, Pedigree Ovens, NutraDine, and The Pound Bakery. Later that year in November, ADM acquired Serbian soy agribusiness Sojaprotein, and completed its acquisition of Deerland Probiotics & Enzymes.\nIn 2022, ADM saw rising profits due to the Russian invasion of Ukraine and the global food crisis.\n\nEnvironmental record\nThe company has been the subject of several major federal lawsuits related to air pollution. In 2001, it agreed to pay a $1.46 million fine for violating federal and Illinois clean-air regulations at its Decatur feed plant and to spend $1.6 million to reduce air pollution there. \nIn 2003, the company settled federal air pollution complaints related to its efforts to avoid New Source Review provisions of the Clean Air Act that require pollution control upgrades when a plant is modernized. The company paid $4.5 million in penalties and more than $6 million to support environmental projects. In addition, ADM agreed to eliminate more than 60,000 tons of emissions of carbon monoxide, particulate matter, volatile organic compounds, and other pollutants from 42 plants in 17 states, at a cost of hundreds of millions of dollars.\n\nCarbon footprint\nADM reported Total CO2e emissions (Direct + Indirect) for the twelve months ending December 2022 at 15,630 Kt (-370 year over year). In April 2020, ADM announced that by 2035, the company intends to have reduced its greenhouse gas emissions by 25%, and its energy intensity by 15%.\n\nUnderground CO2 storage\nThe American Recovery and Reinvestment Act of 2009, the economic stimulus package developed in response to the Great Recession, included a $3.4 billion allocation for the Department of Energy's office of fossil fuel, the majority of which was slated for the Industrial Carbon Capture and Storage (ICCS) program. Through this ICCS initiative, the Department of Energy co-sponsored two large-scale capture and storage projects at ADM facilities in Illinois. These projects were intended to test the feasibility of underground disposal of carbon dioxide emissions.\nIn November 2011, the first of these projects, the Illinois Basin - Decatur Project (IBDP), began operation. The project involved injecting carbon captured at an ADM biofuel facility into Mount Simon Sandstone, a saline reservoir. This project was carried out by the Midwest Geological Sequestration Consortium at the University of Illinois. The Department of Energy provided $66.7 million in funding, with other funding coming from private partners.\nAfter three years of injection, it was determined that the sandstone was accepting CO2 in an easier fashion than was originally expected. In 2017, operations began on a larger project,  the Illinois Industrial Carbon Capture and Storage Project (IL-CCS), which again involved injecting carbon into Mount Simon Sandstone, but this time at a different location and at a much higher volume. Whereas the first project involved injecting one million tons of carbon underground over three years, the IL-CCS project involved storing that same amount in only one year. The Department of Energy contributed $141 million to the project, while the private sector cost share amounted to over $66 million. Other partners included Richland Community College and the Illinois State Geological Survey.\nIn November 2020, Investigate Midwest reported that the Illinois Industrial Carbon Capture and Storage Project had not reached its milestone of one million tons stored and had only stored approximately half that amount, and that carbon emissions from the Decatur facility had actually increased from 4.2 million tons of carbon dioxide in 2016, the year before the project launched, to 4.4 million in 2019. The United States Department of Energy responded that the agency wasn't concerned about the project reaching the stated goals, as ADM successfully demonstrated that the storage technologies work and could be utilized for future projects. \nIn August 2021, ADM announced that its US flour milling operations had achieved net carbon neutral status, in part due to the Decatur capture and storage project.\nIn March 2023, the Decatur City Council voted unanimously to allow ADM to expand its carbon sequestration program onto city land, with the company paying the city $450 per acre of land. The agreement enabled ADM to inject liquified carbon dioxide into \"pore space\" 1.25 miles under land owned by the city of Decatur. On September 19, 2023, the EPA issued a Proposed Enforcement Order to Archer Daniels Midland Co., following a previously issued Notice of Violation of the Safe Drinking Water Act. Roughly 8,000 metric tons of liquid carbon dioxide and other ground fluids were leaked, equivalent to approximately three days worth of fluid injection according to ADM. According to ADM, an inspection of the facility uncovered additional anomalies, and injections were suspended pending further investigation.\n\nRegenerative agriculture\nIn September 2022, PepsiCo and ADM established a partnership on regenerative agriculture projects that would increase the practice across their North American supply chains and help the companies meet carbon reduction goals. In July 2023, ADM launched an expansion of the program, which offers producers financial incentives and technical support to implement regenerative practices. As of December 2023, the company had allocated nearly 2 million acres of land within its supply chain for the program.\n\nProducts\nProducts include oils and meal from soybeans, cottonseed, sunflower seeds, canola, peanuts, flaxseed, Palm kernel, and DAG oil, as well as corn germ, corn gluten feed pellets, syrup, starch, glucose, dextrose, crystalline dextrose, high fructose corn syrup sweeteners, chocolate, ethanol, and wheat flour. End uses are consumption by people, livestock, and additives for fuel. In January 2008, ADM signed a three-year memorandum of understanding with Daimler AG and Bayer CropScience to explore the use of jatropha as a feedstock for biofuel. Natural flavors were added to ADM's product portfolio with the 2014 acquisition of Wild Flavors and vanilla products were added through the acquisition of Rodelle in 2018. \nLong known as a food and ingredients company, it has also invested in fuel production. ADM nearly doubled capital spending in its 2007 budget to an estimated $1.12 billion. The increase is planned for bioenergy projects, focusing on bioethanol and biodiesel.\n\nOilseeds processing\nThe oilseeds processing segment includes global activities related to the origination, merchandising, crushing, and further processing of oilseeds such as soybeans and soft seeds (cottonseed, sunflower seed, canola, and flaxseed) into vegetable oils and protein meals.\nThe first quarter of 2020, during the COVID-19 pandemic, saw the operating profit of Ag Services and Oilseeds (ADM's biggest revenue segment) rise $422 million, or 1.2%.\n\nCorn processing\nADM's corn processing segment is engaged in corn wet milling and dry milling activities, with its asset base primarily located in the central part of the United States. The Corn Processing segment converts corn into sweeteners and starches, and bioproducts. Its products include ingredients used in the food and beverage industry including sweeteners, starch, syrup, glucose (dextrose). Dextrose and starch are used by the Corn Processing segment as feedstocks for its bioproducts operations. In 2021, ADM was ranked second on the Top 50 Global Sweetener Companies list by FoodTalks.\n\nAgricultural services\nADM's agricultural services segment uses its U.S. grain elevator, global transportation network, and port operations to buy, store, clean, and transport agricultural commodities, such as oilseeds, corn, wheat, milo, oats, rice, and barley, and resells these commodities primarily as food and feed ingredients and as raw materials for the agricultural processing industry.\n\nInvestor services\nADM investor services, Inc. is a registered futures commission merchant and a clearing member of all principal commodities exchanges in the U.S. ADM Investor Services International, Ltd., a member of commodity exchanges and clearing houses in Europe, and ADMIS Hong Kong Limited, offer broker services in Europe and Asia.\n\nScandals\nSherman antitrust violation\nIn 1920 the US Department of Justice brought suit against the National Linseed Oil Trust for violating the Sherman Antitrust Act. Several co-defendants were named, including the Archer-Daniels Manufacturing Company. The suit alleged all of these companies were acting in collusion to raise prices, citing a spike in linseed oil costs between 1916 and 1918, when the price rose from $.50 per gallon to $1.80.\n\nPrice fixing\nIn 1993, the company was the subject of a lysine price-fixing investigation by the U.S. Justice Department. Senior ADM executives were indicted on criminal charges for engaging in price-fixing within the international lysine market. In a tape played at the trial, ADM's President said that a single phrase inspired the company: \"Our competitors are our friends. Our customers are the enemy.\" Three of ADM's top officials, including vice chairman Michael Andreas were eventually sentenced to federal prison in 1999. Moreover, in 1997, the company was fined $100 million, the largest antitrust fine in U.S. history at the time. Mark Whitacre, FBI informant and whistleblower of the lysine price-fixing conspiracy, would also find himself in legal trouble for embezzling money from ADM during his time as an informant for the FBI. In addition ADM's 2005 annual report revealed that earlier that year the company settled a class-action antitrust suit for a payment of $400 million. The Informant is a nonfiction thriller book based on this event, which was later adapted into the 2009 film The Informant!.\n\nTax dodging\nA noteworthy case of transfer mispricing came to light in 2011 in Argentina involving the world's four largest grain traders: ADM, Bunge, Cargill and LDC. Argentina's revenue and customs service began an investigation into the four companies when prices for agricultural commodities spiked in 2008 and yet very little profit for the four companies had been reported to the office. As a result of the investigation, it was alleged that the companies had submitted false declarations of sales and routed profits through tax havens or through their headquarters. In some cases, they were said to have used phantom firms to buy grain and had inflated costs in Argentina in order to reduce the recorded profits earned in the country. According to the country's revenue and customs service, the outstanding taxes amounted to almost US$1 billion. The companies involved have denied the allegations. To date, the Argentinian tax authorities have not replied to the Swiss NGO Public Eye’s request regarding the current state of the case. In its 2018 annual report to the US Securities and Exchange Commission (SEC), Bunge mentioned provisions which suggest that the case is still ongoing: \"[A]s of December 31, 2018, Bunge's Argentine subsidiary had received income tax assessments relating to 2006 through 2009 of approximately 1,276 million Argentine pesos (approximately $34 million), plus applicable interest on the outstanding amount of approximately 4,246 million Argentine pesos (approximately $113 million).\"\n\nViolation of the Foreign Corrupt Practices Act\nOn December 20, 2013, the SEC announced that it had charged ADM for failing to prevent illicit payments (bribes) made by its foreign subsidiaries to Ukrainian government officials in violation of the FCPA. Alfred C. Toepfer International Ukraine Ltd. (ACTI Ukraine), plead guilty in the Central District of Illinois to one count of conspiracy in violation of the anti-bribery sections of the FCPA. They agreed to pay $17.8 million in fines. The Department of Justice also entered into a non-prosecution agreement with ADM due to the company's failure to implement a system of internal financial controls, addressing improper payments both in Ukraine and by an ADM joint venture in Venezuela. ADM agreed to pay more than $36 million to settle the SEC's charges, bringing the total amount paid to over $54 million.\nThe Swiss NGO Public Eye elaborated the case.\n\nSonny Perdue land sale\nIn 2021, an investigation by the Washington Post found that ADM had sold land to incoming Secretary of Agriculture Sonny Perdue in 2017 at a fraction of its estimated value. Ethics lawyers had legal and ethical concerns about the sale, questioning whether it amounted to bribery. According to the Post, ADM \"sold the land at a small fraction of its estimated value just as it stood to benefit from a friendly secretary of agriculture.\"\n\nAccounting practices\nIn 2020, ADM's board agreed to have bonuses of senior executives tied to the nutrition segment's success—a unit which accounts for less than 10 percent of the company's revenue—replacing the standard practice of tying the award to adjusted earnings. In January 2023, its seven top executives collectively received shares worth about $72 million for exceeding those performance metrics.\nIn January 2024, ADM disclosed that the SEC requested information regarding its accounting practices at its nutrition business on \"intersegment transactions.\" ADM suspended its CFO, postponed its quarterly earnings report and annual filings, and said it was cooperating with the SEC investigation. In March 2024, FBI agents delivered grand jury subpoenas to current and former employees of ADM, authorized by officials at the U.S. attorney's Manhattan office.\n\nSee also\nList of Illinois companies\nList of S&P 500 companies\n\nReferences\nExternal links\nOfficial website \nBusiness data for Archer-Daniels-Midland Company: \n\"Patents owned by Archer Daniels Midland\". U.S. Patent and Trademark Office. Archived from the original on November 9, 2020. Retrieved December 6, 2005.\nShurtleff, William; Aoyagi, Akiko (2020). History of ADM (Archer Daniels Midland Co.) and the Andreas Family's Work with Soybeans and Soyfoods (1884-2020) (PDF). Lafayette, CA: Soyinfo Center. ISBN 9781948436236.",
  "clean_text": "The Archer-Daniels-Midland Company, commonly known as ADM, is an American multinational food processing and commodities trading corporation founded in 1902 and headquartered in Chicago, Illinois. The company operates more than 270 plants and 420 crop procurement facilities worldwide, where cereal grains and oilseeds are processed into products used in food, beverage, nutraceutical, industrial, and animal feed markets worldwide. ADM ranked No. 35 in the 2023 Fortune 500 list of the largest United States corporations. The company also provides agricultural storage and transportation services. The American River Transportation Company along with ADM Trucking, Inc., are subsidiaries of ADM. ADM has been the subject of significant media attention and infamy over the years with its various scandals, one inspiring a novel and subsequent film The Informant!. History Early history In 1902, John W. Daniels started a linseed crushing business in Minneapolis, Minnesota. George A. Archer joined the operation the next year, and in 1905 the firm's name officially became the Archer-Daniels Linseed Company. In 1923, Archer-Daniels Linseed Company acquired Midland Linseed Products Company and then incorporated as the Archer Daniels Midland Company. The new corporation had total assets exceeding $11 million and controlled just over a third (35%) of the total linseed mill capacity within the United States. In 1924, ADM was listed on the New York Stock Exchange. A series of acquisitions over the next several years expanded the company's oil processing capabilities and agricultural operations, and a grain division was established in 1927. In 1930, ADM purchased control of the flour milling company Commander-Larabee Corp., which was capable of producing 32,000 barrels of flour per day. In 1934 the company began operating its first continuous solvent extraction plant in Chicago, Illinois and could now produce soybean oil. The rapid development of similar extraction plants soon followed. By 1952, Archer Daniel Midland's workforce had expanded to 5,000 employees, and by 1952 the company was operating overseas and manufacturing over 700 products. In 1962, the company acquired a trademark for \"ADM\" and began referring to itself by those initials. In 1965, ADM registered the original patent for textured vegetable protein and began producing the soy flour product at its Decatur East Plant by 1966. In 1966, Dwayne Andreas and his brother Lowell Andreas became minority shareholders in ADM. In 1969, ADM relocated its headquarters from Minneapolis to Decatur, Illinois, a location closer to the company's soybean processing operations. At this time, it was already considered one of the world's largest agribusiness company, with a labor force of more than 24,000 employees. Dwayne Andreas period (1970–1997) Dwayne Andreas was named CEO of ADM in 1970, and two years later was elected chairman of the company's board. Under his leadership, Archer Daniels Midland acquired many smaller agricultural companies and expanded into international markets, eventually becoming one of the world's largest agricultural processing companies. During this period, the company's soybean exports increased from $1.5 billion to $7 billion. In 1974, ADM made its first expansion into Europe and South America when the company acquired soybean plants in Holland and Brazil. In 1982, ADM established international grain operations when it purchased a portion of Toepfer International, a Germany-based grain trading firm. In 1989, ADM purchased Collingwood Grain Inc. based in Hutchinson Kansas, adding 48 million bushels of grain storage at 36 terminal elevators. Dwayne Andreas stepped down from his position as CEO in 1997 and was succeeded by his nephew G. Allen Andreas. The transition occurred a year after the company pleaded guilty to price-fixing. 2001–present In 2001, Paul B. Mulhollem became the company's president. In December 2001, ADM completed the first U.S. commercial sale to Cuba since the embargo was imposed in October 1960. The next year ADM sponsored a major agribusiness show in Havana, where the company signed a $10 million contract with Cuba’s food import agency, Alimport, to deliver rice, cooking oil, and soy. In March 2006, G. Allen Andreas announced he was stepping down as CEO. Later, in May 2006, Patricia A. Woertz became the company's chief executive officer. In February 2007, Woertz was elected chairman of the board at ADM. In 2012, the company sought to acquire strategic holdings to support serving Asian markets through the acquisition of GrainCorp, an Australian grain firm with a network of storage and port facilities in Australia. On November 28, 2013, the acquisition was blocked by the Australian Treasurer Joe Hockey after Australia's Foreign Investment Review Board failed to reach a consensus recommendation. The company moved its headquarters to Chicago in 2014. That same year, ADM completed its acquisition of Toepfer International, Germany's largest grain trader, and renamed the company ADM Germany GmbH. The company also announced that it would buy Swiss-German natural ingredient company Wild Flavors for $3 billion, a move aimed at expanding ADM into health-oriented food sectors. ADM announced the appointment of current CEO Juan R. Luciano on November 5, 2014. Luciano initially joined the company in 2011 as chief operating officer. Under Luciano's leadership, the company restructured its business segments and pursued an aggressive strategy of acquisitions that expanded its human and animal nutrition business. In October 2015, ADM announced the sale of its global cocoa business to Olam International. The sale was valued at about $1.2 billion. Approximately 1,500 employees transferred to Olam with the sale. In January 2017, ADM agreed to sell its crop risk services (insurance) unit to Validus Holdings for $127.5 million. In October 2016, ADM launched its venture capital arm, ADM Ventures, which focused initially on alternative proteins. The Wall Street Journal reported in January 2018 that ADM had approached Bunge Ltd. about a takeover, with details \"unclear\" at the time. At that point, Bunge had a market value of about $9.8 billion, and was also being pursued by Glencore PLC for acquisition, since May 2017. In January 2019, Juan Luciano clarified the company didn't need a \"monster transformational transaction\" and a deal was never made. In March 2018, ADM restructured its business segments into four units: carbohydrate solutions, nutrition, oilseeds, and origination or ag services. The next year, the company announced it was consolidating the ag services and oilseed units. In September 2021, ADM acquired a 75% stake in four pet food companies for a total of $450 million, including PetDine, Pedigree Ovens, NutraDine, and The Pound Bakery. Later that year in November, ADM acquired Serbian soy agribusiness Sojaprotein, and completed its acquisition of Deerland Probiotics & Enzymes. In 2022, ADM saw rising profits due to the Russian invasion of Ukraine and the global food crisis. Environmental record The company has been the subject of several major federal lawsuits related to air pollution. In 2001, it agreed to pay a $1.46 million fine for violating federal and Illinois clean-air regulations at its Decatur feed plant and to spend $1.6 million to reduce air pollution there. In 2003, the company settled federal air pollution complaints related to its efforts to avoid New Source Review provisions of the Clean Air Act that require pollution control upgrades when a plant is modernized. The company paid $4.5 million in penalties and more than $6 million to support environmental projects. In addition, ADM agreed to eliminate more than 60,000 tons of emissions of carbon monoxide, particulate matter, volatile organic compounds, and other pollutants from 42 plants in 17 states, at a cost of hundreds of millions of dollars. Carbon footprint ADM reported Total CO2e emissions (Direct + Indirect) for the twelve months ending December 2022 at 15,630 Kt (-370 year over year). In April 2020, ADM announced that by 2035, the company intends to have reduced its greenhouse gas emissions by 25%, and its energy intensity by 15%. Underground CO2 storage The American Recovery and Reinvestment Act of 2009, the economic stimulus package developed in response to the Great Recession, included a $3.4 billion allocation for the Department of Energy's office of fossil fuel, the majority of which was slated for the Industrial Carbon Capture and Storage (ICCS) program. Through this ICCS initiative, the Department of Energy co-sponsored two large-scale capture and storage projects at ADM facilities in Illinois. These projects were intended to test the feasibility of underground disposal of carbon dioxide emissions. In November 2011, the first of these projects, the Illinois Basin - Decatur Project (IBDP), began operation. The project involved injecting carbon captured at an ADM biofuel facility into Mount Simon Sandstone, a saline reservoir. This project was carried out by the Midwest Geological Sequestration Consortium at the University of Illinois. The Department of Energy provided $66.7 million in funding, with other funding coming from private partners. After three years of injection, it was determined that the sandstone was accepting CO2 in an easier fashion than was originally expected. In 2017, operations began on a larger project, the Illinois Industrial Carbon Capture and Storage Project (IL-CCS), which again involved injecting carbon into Mount Simon Sandstone, but this time at a different location and at a much higher volume. Whereas the first project involved injecting one million tons of carbon underground over three years, the IL-CCS project involved storing that same amount in only one year. The Department of Energy contributed $141 million to the project, while the private sector cost share amounted to over $66 million. Other partners included Richland Community College and the Illinois State Geological Survey. In November 2020, Investigate Midwest reported that the Illinois Industrial Carbon Capture and Storage Project had not reached its milestone of one million tons stored and had only stored approximately half that amount, and that carbon emissions from the Decatur facility had actually increased from 4.2 million tons of carbon dioxide in 2016, the year before the project launched, to 4.4 million in 2019. The United States Department of Energy responded that the agency wasn't concerned about the project reaching the stated goals, as ADM successfully demonstrated that the storage technologies work and could be utilized for future projects. In August 2021, ADM announced that its US flour milling operations had achieved net carbon neutral status, in part due to the Decatur capture and storage project. In March 2023, the Decatur City Council voted unanimously to allow ADM to expand its carbon sequestration program onto city land, with the company paying the city $450 per acre of land. The agreement enabled ADM to inject liquified carbon dioxide into \"pore space\" 1.25 miles under land owned by the city of Decatur. On September 19, 2023, the EPA issued a Proposed Enforcement Order to Archer Daniels Midland Co., following a previously issued Notice of Violation of the Safe Drinking Water Act. Roughly 8,000 metric tons of liquid carbon dioxide and other ground fluids were leaked, equivalent to approximately three days worth of fluid injection according to ADM. According to ADM, an inspection of the facility uncovered additional anomalies, and injections were suspended pending further investigation. Regenerative agriculture In September 2022, PepsiCo and ADM established a partnership on regenerative agriculture projects that would increase the practice across their North American supply chains and help the companies meet carbon reduction goals. In July 2023, ADM launched an expansion of the program, which offers producers financial incentives and technical support to implement regenerative practices. As of December 2023, the company had allocated nearly 2 million acres of land within its supply chain for the program. Products Products include oils and meal from soybeans, cottonseed, sunflower seeds, canola, peanuts, flaxseed, Palm kernel, and DAG oil, as well as corn germ, corn gluten feed pellets, syrup, starch, glucose, dextrose, crystalline dextrose, high fructose corn syrup sweeteners, chocolate, ethanol, and wheat flour. End uses are consumption by people, livestock, and additives for fuel. In January 2008, ADM signed a three-year memorandum of understanding with Daimler AG and Bayer CropScience to explore the use of jatropha as a feedstock for biofuel. Natural flavors were added to ADM's product portfolio with the 2014 acquisition of Wild Flavors and vanilla products were added through the acquisition of Rodelle in 2018. Long known as a food and ingredients company, it has also invested in fuel production. ADM nearly doubled capital spending in its 2007 budget to an estimated $1.12 billion. The increase is planned for bioenergy projects, focusing on bioethanol and biodiesel. Oilseeds processing The oilseeds processing segment includes global activities related to the origination, merchandising, crushing, and further processing of oilseeds such as soybeans and soft seeds (cottonseed, sunflower seed, canola, and flaxseed) into vegetable oils and protein meals. The first quarter of 2020, during the COVID-19 pandemic, saw the operating profit of Ag Services and Oilseeds (ADM's biggest revenue segment) rise $422 million, or 1.2%. Corn processing ADM's corn processing segment is engaged in corn wet milling and dry milling activities, with its asset base primarily located in the central part of the United States. The Corn Processing segment converts corn into sweeteners and starches, and bioproducts. Its products include ingredients used in the food and beverage industry including sweeteners, starch, syrup, glucose (dextrose). Dextrose and starch are used by the Corn Processing segment as feedstocks for its bioproducts operations. In 2021, ADM was ranked second on the Top 50 Global Sweetener Companies list by FoodTalks. Agricultural services ADM's agricultural services segment uses its U.S. grain elevator, global transportation network, and port operations to buy, store, clean, and transport agricultural commodities, such as oilseeds, corn, wheat, milo, oats, rice, and barley, and resells these commodities primarily as food and feed ingredients and as raw materials for the agricultural processing industry. Investor services ADM investor services, Inc. is a registered futures commission merchant and a clearing member of all principal commodities exchanges in the U.S. ADM Investor Services International, Ltd., a member of commodity exchanges and clearing houses in Europe, and ADMIS Hong Kong Limited, offer broker services in Europe and Asia. Scandals Sherman antitrust violation In 1920 the US Department of Justice brought suit against the National Linseed Oil Trust for violating the Sherman Antitrust Act. Several co-defendants were named, including the Archer-Daniels Manufacturing Company. The suit alleged all of these companies were acting in collusion to raise prices, citing a spike in linseed oil costs between 1916 and 1918, when the price rose from $.50 per gallon to $1.80. Price fixing In 1993, the company was the subject of a lysine price-fixing investigation by the U.S. Justice Department. Senior ADM executives were indicted on criminal charges for engaging in price-fixing within the international lysine market. In a tape played at the trial, ADM's President said that a single phrase inspired the company: \"Our competitors are our friends. Our customers are the enemy.\" Three of ADM's top officials, including vice chairman Michael Andreas were eventually sentenced to federal prison in 1999. Moreover, in 1997, the company was fined $100 million, the largest antitrust fine in U.S. history at the time. Mark Whitacre, FBI informant and whistleblower of the lysine price-fixing conspiracy, would also find himself in legal trouble for embezzling money from ADM during his time as an informant for the FBI. In addition ADM's 2005 annual report revealed that earlier that year the company settled a class-action antitrust suit for a payment of $400 million. The Informant is a nonfiction thriller book based on this event, which was later adapted into the 2009 film The Informant!. Tax dodging A noteworthy case of transfer mispricing came to light in 2011 in Argentina involving the world's four largest grain traders: ADM, Bunge, Cargill and LDC. Argentina's revenue and customs service began an investigation into the four companies when prices for agricultural commodities spiked in 2008 and yet very little profit for the four companies had been reported to the office. As a result of the investigation, it was alleged that the companies had submitted false declarations of sales and routed profits through tax havens or through their headquarters. In some cases, they were said to have used phantom firms to buy grain and had inflated costs in Argentina in order to reduce the recorded profits earned in the country. According to the country's revenue and customs service, the outstanding taxes amounted to almost US$1 billion. The companies involved have denied the allegations. To date, the Argentinian tax authorities have not replied to the Swiss NGO Public Eye’s request regarding the current state of the case. In its 2018 annual report to the US Securities and Exchange Commission (SEC), Bunge mentioned provisions which suggest that the case is still ongoing: \"[A]s of December 31, 2018, Bunge's Argentine subsidiary had received income tax assessments relating to 2006 through 2009 of approximately 1,276 million Argentine pesos (approximately $34 million), plus applicable interest on the outstanding amount of approximately 4,246 million Argentine pesos (approximately $113 million).\" Violation of the Foreign Corrupt Practices Act On December 20, 2013, the SEC announced that it had charged ADM for failing to prevent illicit payments (bribes) made by its foreign subsidiaries to Ukrainian government officials in violation of the FCPA. Alfred C. Toepfer International Ukraine Ltd. (ACTI Ukraine), plead guilty in the Central District of Illinois to one count of conspiracy in violation of the anti-bribery sections of the FCPA. They agreed to pay $17.8 million in fines. The Department of Justice also entered into a non-prosecution agreement with ADM due to the company's failure to implement a system of internal financial controls, addressing improper payments both in Ukraine and by an ADM joint venture in Venezuela. ADM agreed to pay more than $36 million to settle the SEC's charges, bringing the total amount paid to over $54 million. The Swiss NGO Public Eye elaborated the case. Sonny Perdue land sale In 2021, an investigation by the Washington Post found that ADM had sold land to incoming Secretary of Agriculture Sonny Perdue in 2017 at a fraction of its estimated value. Ethics lawyers had legal and ethical concerns about the sale, questioning whether it amounted to bribery. According to the Post, ADM \"sold the land at a small fraction of its estimated value just as it stood to benefit from a friendly secretary of agriculture.\" Accounting practices In 2020, ADM's board agreed to have bonuses of senior executives tied to the nutrition segment's success—a unit which accounts for less than 10 percent of the company's revenue—replacing the standard practice of tying the award to adjusted earnings. In January 2023, its seven top executives collectively received shares worth about $72 million for exceeding those performance metrics. In January 2024, ADM disclosed that the SEC requested information regarding its accounting practices at its nutrition business on \"intersegment transactions.\" ADM suspended its CFO, postponed its quarterly earnings report and annual filings, and said it was cooperating with the SEC investigation. In March 2024, FBI agents delivered grand jury subpoenas to current and former employees of ADM, authorized by officials at the U.S. attorney's Manhattan office."
}