{
  "ticker": "ADP",
  "cik": "0000008670",
  "company_name": "Automatic Data Processing",
  "corrected_name": "Automatic Data Processing",
  "wiki_title_used": "Automatic Data Processing",
  "exists": true,
  "raw_text": "Automatic Data Processing, Inc. (ADP) is an American provider of human resources management software and services, headquartered in Roseland, New Jersey.\n\nHistory\nIn 1949, Henry Taub founded Automatic Payrolls, Inc. as a manual payroll processing business with his brother Joe Taub. Frank Lautenberg joined the brothers in the company's infancy. In 1957, Lautenberg, after successfully serving in sales and marketing, became a full-fledged partner with the two brothers. In 1961, the company changed its name to Automatic Data Processing, Inc. (ADP), and began using punched card machines, check printing machines, and mainframe computers.  ADP went public in 1961 with 300 clients, 125 employees, and revenues of approximately US$400,000. The company established a subsidiary in the United Kingdom in 1965. In 1970, Lautenberg was noted as being the president of the company. Also in 1970, the company's stock transitioned from trading on American Stock Exchange to trading on the New York Stock Exchange. Lautenberg continued in his roles as chairman and CEO until elected to the United States Senate from New Jersey in 1982.\nFrom 1985 onward, ADP's annual revenues exceeded the $1 billion mark, with paychecks processed for about 20% of the U.S. workforce. In the 1990s, ADP began acting as a professional employer organization (PEO) making several related acquisitions.\nOn October 21, 2008, ADP switched its stock listing to the NASDAQ Global Select Market.\nIn 2020, ADP was ranked 227 on the Fortune 500 list of the largest United States corporations by revenue. ADP has also been included on Fortune Magazine's \"World's Most Admired Companies\" List for 14 consecutive years and has earned recognition from DiversityInc as one of the top companies for diversity and inclusion in the United States for 11 consecutive years.\nADP has about 67,000 employees worldwide and its fiscal year 2025 revenues were $20.6 billion.\n\nAcquisitions\nADP acquired the pioneering online computer services company Time Sharing Limited (TSL) in 1974 and Cyphernetics in 1975.\nAs ADP became a professional employer organization, it made several acquisitions. In 1995, the company acquired the German company Autonom and the payroll and human resource services company GSI, among others. In September 1998, ADP acquired UK-based Chessington Computer Centre that supplied administration services to the UK Government.\nIn 2006, ADP acquired Kerridge Computer Co. Ltd., a dealer management systems (DMS) provider to auto dealers, primarily in the UK. In 2007, the ADP Brokerage Service Group was spun off to form Broadridge Financial Solutions, Inc. In January 2017, ADP acquired The Marcus Buckingham Company (TMBC). In October 2017, ADP acquired Global Cash Card, a digital payments facilitator.\nIn January 2018, ADP acquired WorkMarket, a New York City–based software platform company that helps businesses manage freelancers, contractors, and consultants. Later that same year, the company announced the acquisition of Celergo, a global payroll management service company.\nIn 2023, ADP acquired workflow automation tool Sora.\nIn October 2024, ADP acquired WorkForce Software, a management services provider.\n\nDivisions and spinoffs\nBroadridge Financial Solutions\nIn 2007, the ADP Brokerage Service Group was spun off to form Broadridge Financial Solutions, Inc., removing about US$2 billion from ADP's total yearly revenue.  ADP distributed one share of Broadridge common stock for every four shares of ADP common stock held by shareholders of record as of the close of business on March 23, 2007.\n\nCDK Global, LLC\nFormerly called ADP Dealer Services, CDK Global was formed October 1, 2014, and provides technology services to automotive dealerships, as well as vehicle manufacturers.\nIn 2010, ADP acquired the automotive marketing company Cobalt.\nBZ Results, winner of AutoSuccess magazine's 2005 \"Innovative Company of the Year\" award, was purchased by ADP in 2006. At the time, BZ Results was valued at $125 million. On April 7, 2014, ADP laid off several Dealer Services associates in a reorganization and 3 days later announced plans to spin off the Dealer Services division as a standalone company. On August 19, 2014, ADP Dealer Services announced that the name of the new company, post-spinoff, would be CDK Global (an acronym for Cobalt, Dealer Services, Kerridge).\nBoth S&P and Moody's downgraded ADP to AA in April 2014, after the dealer services unit was spun off.\n\nEmployment data\nADP has been used as a source of private-sector employment data in addition to or in place of United States Bureau of Labor Statistics reports. ADP's National Employment Report launches the day before BLS reports. In 2022, it was redesigned in collaboration with Stanford's Digital Economy Lab.\nAs early as 2018, ADP employment and earnings data were used by the Federal Reserve. In mid-2025, ADP stopped providing data to the Federal Reserve.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Automatic Data Processing, Inc.:",
  "clean_text": "Automatic Data Processing, Inc. (ADP) is an American provider of human resources management software and services, headquartered in Roseland, New Jersey. History In 1949, Henry Taub founded Automatic Payrolls, Inc. as a manual payroll processing business with his brother Joe Taub. Frank Lautenberg joined the brothers in the company's infancy. In 1957, Lautenberg, after successfully serving in sales and marketing, became a full-fledged partner with the two brothers. In 1961, the company changed its name to Automatic Data Processing, Inc. (ADP), and began using punched card machines, check printing machines, and mainframe computers. ADP went public in 1961 with 300 clients, 125 employees, and revenues of approximately US$400,000. The company established a subsidiary in the United Kingdom in 1965. In 1970, Lautenberg was noted as being the president of the company. Also in 1970, the company's stock transitioned from trading on American Stock Exchange to trading on the New York Stock Exchange. Lautenberg continued in his roles as chairman and CEO until elected to the United States Senate from New Jersey in 1982. From 1985 onward, ADP's annual revenues exceeded the $1 billion mark, with paychecks processed for about 20% of the U.S. workforce. In the 1990s, ADP began acting as a professional employer organization (PEO) making several related acquisitions. On October 21, 2008, ADP switched its stock listing to the NASDAQ Global Select Market. In 2020, ADP was ranked 227 on the Fortune 500 list of the largest United States corporations by revenue. ADP has also been included on Fortune Magazine's \"World's Most Admired Companies\" List for 14 consecutive years and has earned recognition from DiversityInc as one of the top companies for diversity and inclusion in the United States for 11 consecutive years. ADP has about 67,000 employees worldwide and its fiscal year 2025 revenues were $20.6 billion. Acquisitions ADP acquired the pioneering online computer services company Time Sharing Limited (TSL) in 1974 and Cyphernetics in 1975. As ADP became a professional employer organization, it made several acquisitions. In 1995, the company acquired the German company Autonom and the payroll and human resource services company GSI, among others. In September 1998, ADP acquired UK-based Chessington Computer Centre that supplied administration services to the UK Government. In 2006, ADP acquired Kerridge Computer Co. Ltd., a dealer management systems (DMS) provider to auto dealers, primarily in the UK. In 2007, the ADP Brokerage Service Group was spun off to form Broadridge Financial Solutions, Inc. In January 2017, ADP acquired The Marcus Buckingham Company (TMBC). In October 2017, ADP acquired Global Cash Card, a digital payments facilitator. In January 2018, ADP acquired WorkMarket, a New York City–based software platform company that helps businesses manage freelancers, contractors, and consultants. Later that same year, the company announced the acquisition of Celergo, a global payroll management service company. In 2023, ADP acquired workflow automation tool Sora. In October 2024, ADP acquired WorkForce Software, a management services provider. Divisions and spinoffs Broadridge Financial Solutions In 2007, the ADP Brokerage Service Group was spun off to form Broadridge Financial Solutions, Inc., removing about US$2 billion from ADP's total yearly revenue. ADP distributed one share of Broadridge common stock for every four shares of ADP common stock held by shareholders of record as of the close of business on March 23, 2007. CDK Global, LLC Formerly called ADP Dealer Services, CDK Global was formed October 1, 2014, and provides technology services to automotive dealerships, as well as vehicle manufacturers. In 2010, ADP acquired the automotive marketing company Cobalt. BZ Results, winner of AutoSuccess magazine's 2005 \"Innovative Company of the Year\" award, was purchased by ADP in 2006. At the time, BZ Results was valued at $125 million. On April 7, 2014, ADP laid off several Dealer Services associates in a reorganization and 3 days later announced plans to spin off the Dealer Services division as a standalone company. On August 19, 2014, ADP Dealer Services announced that the name of the new company, post-spinoff, would be CDK Global (an acronym for Cobalt, Dealer Services, Kerridge). Both S&P and Moody's downgraded ADP to AA in April 2014, after the dealer services unit was spun off. Employment data ADP has been used as a source of private-sector employment data in addition to or in place of United States Bureau of Labor Statistics reports. ADP's National Employment Report launches the day before BLS reports. In 2022, it was redesigned in collaboration with Stanford's Digital Economy Lab. As early as 2018, ADP employment and earnings data were used by the Federal Reserve. In mid-2025, ADP stopped providing data to the Federal Reserve."
}