{
  "ticker": "AEE",
  "cik": "0001002910",
  "company_name": "Ameren",
  "corrected_name": "Ameren",
  "wiki_title_used": "Ameren",
  "exists": true,
  "raw_text": "Ameren Corporation is an American power company created December 31, 1997, by the merger of Union Electric Company (formerly NYSE: UEP) of St. Louis, Missouri and the neighboring Central Illinois Public Service Company (CIPSCO Inc. holding, formerly NYSE: CIP) of Springfield, Illinois. It is now a holding company for several power companies and energy companies. The company is based in St. Louis, with 2.4 million electric, and 900,000 natural gas customers across 64,000 square miles in central and eastern Missouri and the southern four-fifths of Illinois by area.\nAmeren is the holding company for the following:\n\nAmeren Missouri\nAmeren Illinois\nAmeren Transmission Company\nAmeren Services\nThe Ameren Missouri subsidiary owns Bagnell Dam on the Osage River, which forms the Lake of the Ozarks. Ameren Missouri is responsible for managing water levels on the lake according to federal regulations.\n\nHistory\nOrigins\nPrior to the formation of Ameren, the first major development in the history of its constituent parts occurred in 1929, when the Bagnell Dam was completed on the Osage River and generated almost 175 megawatts of hydroelectricity for Missouri's Union Electric Company. The dam also created the Lake of the Ozarks with 1,400 miles (2,300 km) of shoreline.\nIn 1931, Union Electric Light and Power sought additional generating sources (interurbans being one need) and the company began buying power from the Keokuk, IA dam, 150 miles (240 km) north of St. Louis.  Union Electric later bought the dam, providing 134 megawatts of hydroelectricity carried over a longer distance than had ever been achieved before.\nBy the 1950s Union Electric owned gas operations in and around Alton, Illinois, and acquired other utilities to become the third largest distributor of natural gas in Missouri.\nIn 1952, Ameren's second major constituent, the Central Illinois Public Service Company, became a major pooled energy power distributor with its future Ameren mate, Union Electric Company. The arrangement formed the Midwest Power Pool system. The CIPS Meredosia, Illinois Power Station became a key contributor to the pool, which also included the later Ameren subsidiary Illinois Power Company.\nIn 1963 Union Electric completed construction of one of the largest pumped storage plants at that time, the then-350-megawatt Taum Sauk Plant, in Reynolds County, Missouri.\nIn 1984 Union Electric added nuclear energy to the mix, when the Callaway Nuclear Generating Station began providing 1,143 megawatts of power from Callaway County, Missouri.\n\nAmeren history\nIn 1995 shareholders of both CIPSCO Inc. and of its neighboring utility of twice its size, the S&P 500-listed Union Electric Company, approved the merger of the two companies, which were to then be combined as Ameren Corporation. Both of those former utilities had traded publicly on the New York Stock Exchange, under ticker symbol CIP and UEP, respectively. At the time of the merger, Union Electric had assets of nearly US$600 million, but still carried nearly US$1.8 billion in long-term debt, although down from US$2.5 billion which it had accumulated by the 1980s. CIPSCO had assets of about US$210 million, but still carried nearly half of US$1 billion in long-term debt, which it had also accumulated by the 1980s.\nThe merger was completed on December 31, 1997, when the two public companies became one, as Ameren Corporation, which then began to trade publicly on the New York Stock Exchange with the ticker symbol AEE.\nThe name Ameren comes from the combination of American energy/\nFollowing the merger, Union Electric began doing business as AmerenUE, now known as Ameren Missouri. Today, with nine power plants Ameren Missouri serves 1.2 million power customers and 110,000 gas customers, primarily in Missouri, where more than half of its customers reside in the St. Louis metropolitan area. It also served Iowa as well through the mid-1990s, and served adjoining parts of Illinois until 2010.\nThe former CIPSCO Inc. utility, Central Illinois Public Service Company, became Ameren's other operating company, doing business as AmerenCIPS.\nIn 2000, Ameren formed the holding company, AmerenEnergy Resources. It contained two further subsidiaries, AmerenEnergy Marketing, and AmerenEnergy Generating.\nIn 2002, Ameren Corporation announced a voluntary retirement program, which was offered to approximately 1,000 of Ameren's 7,400 current employees, expecting to realize significant long-term savings.\nIn 2003, Ameren acquired Peoria-based CILCORP, Inc. and its leading subsidiary, Central Illinois Light Company, from AES Corporation. CILCORP had traded on the NYSE with ticker symbol CER prior to its acquisition by AES, and by the mid-1990s had become a member of the S&P Small Cap 600 index. CILCO had been another pioneer utility in the region, which had paid a dividend since 1921. By 1996, it had grown to over US$150 million in assets, and carried US$330 million in long-term debt. Following the 2003 Ameren acquisition, that utility began doing business as AmerenCILCO.\nAt the end of 2003, Ameren's chairman and chief executive, Charles Mueller, retired and was succeeded in both positions by Gary Rainwater, the company's president and chief operating officer the past two years.\nIn 2004, Ameren acquired the third partner from the 1952 Midwest Power Pool system, Illinois Power Company, from Dynegy Inc. That utility had traded publicly on the NYSE under the ticker symbol IPC through the 1980s, and paid dividends since 1947. As of the late 1980s, the company generated electricity and natural gas, almost entirely from coal plants, with less than 1% fueled from oil and gas. By then, with about $360 million in assets, it carried long-term debt of over US$2 billion. In 1991, Illinois Power reorganized as a holding company, Illinova Corporation, which traded on the NYSE with ticker symbol ILN. Illinova had grown to an S&P Midcap 400 stock by 1996, with over US$415 million in assets, and had brought the IP utility's debt down to US$1.8 billion by then. In a merger completed February 1, 2000, Illinova became a wholly owned subsidiary of Dynegy Inc. (NYSE: DYN), in which Chevron Corporation also took a 28% stake. Dynegy in turn had been created in June 1998, from the merger of Chevron's natural gas and natural gas liquids businesses with Dynegy's predecessor, NGC Corp. (former ticker NGL). NGC had been an integrated natural gas services company around since 1994. Following Ameren's acquisition of Illinois Power, that subsidiary began doing business as AmerenIP. The IP acquisition made Ameren the major investor-owned power company in downstate Illinois.\nIn December 2004, Ameren announced that Patrick T. Stokes, the president and chief executive officer of Anheuser-Busch Cos., Inc., was elected to the Ameren board of directors.\nIn 2009, AmerenUE signed an agreement to purchase 102 megawatts (MW) of wind power from phase II of Horizon Wind Energy's Pioneer Prairie Wind Farm in Iowa, which is enough to power 26,000 households.  The power AmerenUE is purchasing will tie into the Midwest Independent System Operator (MISO) transmission grid, of which the company is a member, fulfilling AmerenUE's commitment to add 100 megawatts of renewable capacity to serve its Missouri customers by 2010.\nOn October 1, 2010 Ameren's three Illinois operating companies merged to become Ameren Illinois Company. The merger resulted in a single operating company providing power to most of downstate Illinois. However, the Ameren Illinois service territory is split into three rate zones corresponding to the service territories of the three former Illinois operating companies—Zone I (the former AmerenCIPS), Zone II (the former AmerenCILCO) and Zone III (the former AmerenIP). On the same date, AmerenUE changed its name to Ameren Missouri Company. The former Illinois portion of the AmerenUE territory was transferred to Ameren Illinois Zone I.\nIn 2015, Ameren became the first major energy company to open an Innovation Center at the Research Park, University of Illinois at Urbana-Champaign.\nIn 2016, Ameren was named 10th on Business Insider’s 10 best energy companies to work for in America list. In the report, seventy four percent of employees said their job has high meaning.\n\nAmeren Transmission\nAmeren owns and operates transmission lines at the following voltages: 345kV, 230kV, 161kV, 138kV, 69kV and 34.5kV.\n\nService area\nAs of 2021, Ameren Illinois and Ameren Missouri distribute electricity and natural gas to most of central and southern Illinois and to much of northern and eastern Missouri.  This service area includes the cities of St. Louis and East Saint Louis and surrounding suburbs.  It excludes almost all of the Chicago metropolitan area, where about three quarters of Illinois's population resides.\n\nOwnership\nAs of 2017 Ameren shares are mainly held by institutional investors (Vanguard group, BlackRock, State Street Corporation, among others).\n\nTaum Sauk pumped storage plant\nAmeren Missouri owns the Taum Sauk pumped storage plant, which failed on December 14, 2005, causing extensive damage to the east fork of the Black River and to Johnson's Shut-Ins State Park.  Consequently, FERC fined Ameren $15 million.  The State of Missouri has sued Ameren for actual and punitive damages, alleging Ameren recklessly operated the plant and put financial considerations from sale of power to other companies over safety, maintenance and engineering.  The plant was operated by remote control with no one onsite during pumping operations. Rebuilding the upper reservoir of the AmerenUE Taum Sauk pumped-storage hydroelectric plant cost $450 million.  The upper reservoir was constructed with roller compacted concrete (RCC); and online in 2010, this 54.5-acre (221,000 m2) reservoir is the largest RCC dam in North America.\nThe 450-megawatt Taum Sauk pumped storage hydroelectric plant began generating electricity again on April 21, 2010.\n\nEnvironmental issues\nClean Air Act\nIn 2011 the United States Environmental Protection Agency (EPA) filed suit (Case No. 4:11 CV 77 RWS) against Ameren Missouri concerning excess sulfur (SO2) emissions from the Rush Island Plant in Festus, Missouri United States v. Ameren Missouri, 229 F.Supp.3d 906 (2017) 48295 (D.C., E.D. Missouri, Eastern Division. January 23, 2017). \nEPA alleged Ameren violated the Clean Air Act, the Missouri State Implementation Plan, and Ameren's Rush Island Plant Title V Permit when it undertook major modifications at the Rush Island Plant in 2007 through 2010 without obtaining the required permits under the Prevention of Significant Deterioration (PSD) provisions of the New Source Review (NSR) program.\nIn January 2017 the District Court found that Ameren \"...violated the Clean Air Act without obtaining the necessary permits, installing best-available pollution technology, and otherwise meeting applicable requirements.\" Judge Rodney Sippel entered a finding of liability in January 2017 and ordered a remedy that called for the company to equip its Rush Island coal plant in Jefferson County, Missouri, with scrubbers. Ameren instead decided to close the plant in 2024, 15 years ahead of schedule. Sippel also ordered Ameren to install sulfur dioxide scrubbers on its Labadie plant, also in Missouri, but a federal appeals court overturned that condition even though “the government never provided notice of or alleged” that the plant committed a Clean Air Act violation.\n\nElectric vehicles\nAmeren has a history of supporting the adoption of electric vehicles. In 2016, the company attempted to launch a pilot program to install electric vehicle charging stations but state utility regulators turned down oversight of the project. As a result, Ameren canceled the program because it would not recover its investments. However, in early 2018 Ameren tried again, this time launching a program called \"Charge Ahead\" which incentivizes the installation of around 1,200 charging stations. In addition, the program creates incentives for the adoption of commercial electric vehicles.\n\nFormer manufactured gas plant\nIn the nineteenth and twentieth centuries a local utility company operated a coal gasification plant at the corner of Ash and Orr streets in Columbia, Missouri, that was subsequently demolished. The company was purchased by the Ameren Corporation. The gasification process contaminated the soil and some groundwater in the area with carcinogenic chemicals. In June 2014 Ameren was removing contaminated soil from the area, and expected to finish by September 2014. As of 2019 the city is considering purchasing the lot to create a public park. Ameren has been criticized by the North Village Board of Directors for owning \"a whole city block that is in disrepair and for an aversion to commerce.\"\n\nLake of the Ozarks\nAmeren Missouri sponsors the Adopt-the-Shoreline program, which enables people to “adopt” portions of the shoreline for litter control. They also control other shoreline activities in the Lake of the Ozarks such as the regulation of boat docks, seawalls and other structures within the Osage Project boundary on the lake and downstream from Bagnell Dam.  The company maintains the Lake and Shoreline Protection Hotline that anyone who wishes can use to report neglected docks or other concerns they may have about the lake.\n\nLabadie Energy Center\nUnlike most coal energy plants, the Labadie coal plant in Franklin County, Missouri, does not have sulfur dioxide scrubbers, making it the country's highest emitter of the pollutant, according to a St. Louis Post-Dispatch report. Even if Labadie’s SO2 emissions were cut in half, it would still emit more than all but two coal plants in the country. \nIn 2023, a Sierra Club report included Ameren's Labadie Energy Center among the 17 deadliest coal plants in the US, with calls to the EPA to pass regulations on harmful emissions contributing to regional haze affecting neighboring communities. Labadie is also the second-largest producer of greenhouse gases among the nation’s coal plants, according to EPA data. A study published in the journal Science used Medicare records to estimate the number of deaths tied to air pollution from coal plants, estimating that from 1999 to 2020, about 4,000 deaths were linked to “fine particulate matter” from Labadie, far more than any other coal plant across seven Midwestern states. \nLabadie received notice of Clean Air Act violations from the EPA in at least 2010 and 2011, being cited for “major modifications that caused a significant net emissions increase” without first obtaining proper permits.\n\nAmeren UE Tower\nThe Ameren UE Tower is a unique combination of an electricity pylon and a radio tower located near Ameren's headquarters in St. Louis, Missouri, USA at 38.623313 N 90.210840 W. It is a 106.5-metres (with antennas on top 111 metres) tall lattice steel structure, which was built in 2009. It carries two 138 kV circuits on three crossbars approximately in half height.\nUnlike other electricity pylons that carries antennas, the height of the Ameren UE Tower is not determined by its function as electricity pylon, but rather by its task as radio tower, which requires a significantly greater height than a pour use as an electricity pylon. The design of the Ameren UE Tower has the disadvantage that the installation of larger antennas with a crane or pulley is significantly hampered by the crossbars and power conductors, requiring the shutdown of the high-voltage circuits. [1], [2]\n\nReferences\nExternal links\nOfficial website\nBusiness data for Ameren Corporation:\n\nTaum Sauk\nFERC Taum Sauk Page - Reports, Charges and Settlement available here\nMissouri Attorney General Press Release with link to Petition for lawsuit against Ameren for breach",
  "clean_text": "Ameren Corporation is an American power company created December 31, 1997, by the merger of Union Electric Company (formerly NYSE: UEP) of St. Louis, Missouri and the neighboring Central Illinois Public Service Company (CIPSCO Inc. holding, formerly NYSE: CIP) of Springfield, Illinois. It is now a holding company for several power companies and energy companies. The company is based in St. Louis, with 2.4 million electric, and 900,000 natural gas customers across 64,000 square miles in central and eastern Missouri and the southern four-fifths of Illinois by area. Ameren is the holding company for the following: Ameren Missouri Ameren Illinois Ameren Transmission Company Ameren Services The Ameren Missouri subsidiary owns Bagnell Dam on the Osage River, which forms the Lake of the Ozarks. Ameren Missouri is responsible for managing water levels on the lake according to federal regulations. History Origins Prior to the formation of Ameren, the first major development in the history of its constituent parts occurred in 1929, when the Bagnell Dam was completed on the Osage River and generated almost 175 megawatts of hydroelectricity for Missouri's Union Electric Company. The dam also created the Lake of the Ozarks with 1,400 miles (2,300 km) of shoreline. In 1931, Union Electric Light and Power sought additional generating sources (interurbans being one need) and the company began buying power from the Keokuk, IA dam, 150 miles (240 km) north of St. Louis. Union Electric later bought the dam, providing 134 megawatts of hydroelectricity carried over a longer distance than had ever been achieved before. By the 1950s Union Electric owned gas operations in and around Alton, Illinois, and acquired other utilities to become the third largest distributor of natural gas in Missouri. In 1952, Ameren's second major constituent, the Central Illinois Public Service Company, became a major pooled energy power distributor with its future Ameren mate, Union Electric Company. The arrangement formed the Midwest Power Pool system. The CIPS Meredosia, Illinois Power Station became a key contributor to the pool, which also included the later Ameren subsidiary Illinois Power Company. In 1963 Union Electric completed construction of one of the largest pumped storage plants at that time, the then-350-megawatt Taum Sauk Plant, in Reynolds County, Missouri. In 1984 Union Electric added nuclear energy to the mix, when the Callaway Nuclear Generating Station began providing 1,143 megawatts of power from Callaway County, Missouri. Ameren history In 1995 shareholders of both CIPSCO Inc. and of its neighboring utility of twice its size, the S&P 500-listed Union Electric Company, approved the merger of the two companies, which were to then be combined as Ameren Corporation. Both of those former utilities had traded publicly on the New York Stock Exchange, under ticker symbol CIP and UEP, respectively. At the time of the merger, Union Electric had assets of nearly US$600 million, but still carried nearly US$1.8 billion in long-term debt, although down from US$2.5 billion which it had accumulated by the 1980s. CIPSCO had assets of about US$210 million, but still carried nearly half of US$1 billion in long-term debt, which it had also accumulated by the 1980s. The merger was completed on December 31, 1997, when the two public companies became one, as Ameren Corporation, which then began to trade publicly on the New York Stock Exchange with the ticker symbol AEE. The name Ameren comes from the combination of American energy/ Following the merger, Union Electric began doing business as AmerenUE, now known as Ameren Missouri. Today, with nine power plants Ameren Missouri serves 1.2 million power customers and 110,000 gas customers, primarily in Missouri, where more than half of its customers reside in the St. Louis metropolitan area. It also served Iowa as well through the mid-1990s, and served adjoining parts of Illinois until 2010. The former CIPSCO Inc. utility, Central Illinois Public Service Company, became Ameren's other operating company, doing business as AmerenCIPS. In 2000, Ameren formed the holding company, AmerenEnergy Resources. It contained two further subsidiaries, AmerenEnergy Marketing, and AmerenEnergy Generating. In 2002, Ameren Corporation announced a voluntary retirement program, which was offered to approximately 1,000 of Ameren's 7,400 current employees, expecting to realize significant long-term savings. In 2003, Ameren acquired Peoria-based CILCORP, Inc. and its leading subsidiary, Central Illinois Light Company, from AES Corporation. CILCORP had traded on the NYSE with ticker symbol CER prior to its acquisition by AES, and by the mid-1990s had become a member of the S&P Small Cap 600 index. CILCO had been another pioneer utility in the region, which had paid a dividend since 1921. By 1996, it had grown to over US$150 million in assets, and carried US$330 million in long-term debt. Following the 2003 Ameren acquisition, that utility began doing business as AmerenCILCO. At the end of 2003, Ameren's chairman and chief executive, Charles Mueller, retired and was succeeded in both positions by Gary Rainwater, the company's president and chief operating officer the past two years. In 2004, Ameren acquired the third partner from the 1952 Midwest Power Pool system, Illinois Power Company, from Dynegy Inc. That utility had traded publicly on the NYSE under the ticker symbol IPC through the 1980s, and paid dividends since 1947. As of the late 1980s, the company generated electricity and natural gas, almost entirely from coal plants, with less than 1% fueled from oil and gas. By then, with about $360 million in assets, it carried long-term debt of over US$2 billion. In 1991, Illinois Power reorganized as a holding company, Illinova Corporation, which traded on the NYSE with ticker symbol ILN. Illinova had grown to an S&P Midcap 400 stock by 1996, with over US$415 million in assets, and had brought the IP utility's debt down to US$1.8 billion by then. In a merger completed February 1, 2000, Illinova became a wholly owned subsidiary of Dynegy Inc. (NYSE: DYN), in which Chevron Corporation also took a 28% stake. Dynegy in turn had been created in June 1998, from the merger of Chevron's natural gas and natural gas liquids businesses with Dynegy's predecessor, NGC Corp. (former ticker NGL). NGC had been an integrated natural gas services company around since 1994. Following Ameren's acquisition of Illinois Power, that subsidiary began doing business as AmerenIP. The IP acquisition made Ameren the major investor-owned power company in downstate Illinois. In December 2004, Ameren announced that Patrick T. Stokes, the president and chief executive officer of Anheuser-Busch Cos., Inc., was elected to the Ameren board of directors. In 2009, AmerenUE signed an agreement to purchase 102 megawatts (MW) of wind power from phase II of Horizon Wind Energy's Pioneer Prairie Wind Farm in Iowa, which is enough to power 26,000 households. The power AmerenUE is purchasing will tie into the Midwest Independent System Operator (MISO) transmission grid, of which the company is a member, fulfilling AmerenUE's commitment to add 100 megawatts of renewable capacity to serve its Missouri customers by 2010. On October 1, 2010 Ameren's three Illinois operating companies merged to become Ameren Illinois Company. The merger resulted in a single operating company providing power to most of downstate Illinois. However, the Ameren Illinois service territory is split into three rate zones corresponding to the service territories of the three former Illinois operating companies—Zone I (the former AmerenCIPS), Zone II (the former AmerenCILCO) and Zone III (the former AmerenIP). On the same date, AmerenUE changed its name to Ameren Missouri Company. The former Illinois portion of the AmerenUE territory was transferred to Ameren Illinois Zone I. In 2015, Ameren became the first major energy company to open an Innovation Center at the Research Park, University of Illinois at Urbana-Champaign. In 2016, Ameren was named 10th on Business Insider’s 10 best energy companies to work for in America list. In the report, seventy four percent of employees said their job has high meaning. Ameren Transmission Ameren owns and operates transmission lines at the following voltages: 345kV, 230kV, 161kV, 138kV, 69kV and 34.5kV. Service area As of 2021, Ameren Illinois and Ameren Missouri distribute electricity and natural gas to most of central and southern Illinois and to much of northern and eastern Missouri. This service area includes the cities of St. Louis and East Saint Louis and surrounding suburbs. It excludes almost all of the Chicago metropolitan area, where about three quarters of Illinois's population resides. Ownership As of 2017 Ameren shares are mainly held by institutional investors (Vanguard group, BlackRock, State Street Corporation, among others). Taum Sauk pumped storage plant Ameren Missouri owns the Taum Sauk pumped storage plant, which failed on December 14, 2005, causing extensive damage to the east fork of the Black River and to Johnson's Shut-Ins State Park. Consequently, FERC fined Ameren $15 million. The State of Missouri has sued Ameren for actual and punitive damages, alleging Ameren recklessly operated the plant and put financial considerations from sale of power to other companies over safety, maintenance and engineering. The plant was operated by remote control with no one onsite during pumping operations. Rebuilding the upper reservoir of the AmerenUE Taum Sauk pumped-storage hydroelectric plant cost $450 million. The upper reservoir was constructed with roller compacted concrete (RCC); and online in 2010, this 54.5-acre (221,000 m2) reservoir is the largest RCC dam in North America. The 450-megawatt Taum Sauk pumped storage hydroelectric plant began generating electricity again on April 21, 2010. Environmental issues Clean Air Act In 2011 the United States Environmental Protection Agency (EPA) filed suit (Case No. 4:11 CV 77 RWS) against Ameren Missouri concerning excess sulfur (SO2) emissions from the Rush Island Plant in Festus, Missouri United States v. Ameren Missouri, 229 F.Supp.3d 906 (2017) 48295 (D.C., E.D. Missouri, Eastern Division. January 23, 2017). EPA alleged Ameren violated the Clean Air Act, the Missouri State Implementation Plan, and Ameren's Rush Island Plant Title V Permit when it undertook major modifications at the Rush Island Plant in 2007 through 2010 without obtaining the required permits under the Prevention of Significant Deterioration (PSD) provisions of the New Source Review (NSR) program. In January 2017 the District Court found that Ameren \"...violated the Clean Air Act without obtaining the necessary permits, installing best-available pollution technology, and otherwise meeting applicable requirements.\" Judge Rodney Sippel entered a finding of liability in January 2017 and ordered a remedy that called for the company to equip its Rush Island coal plant in Jefferson County, Missouri, with scrubbers. Ameren instead decided to close the plant in 2024, 15 years ahead of schedule. Sippel also ordered Ameren to install sulfur dioxide scrubbers on its Labadie plant, also in Missouri, but a federal appeals court overturned that condition even though “the government never provided notice of or alleged” that the plant committed a Clean Air Act violation. Electric vehicles Ameren has a history of supporting the adoption of electric vehicles. In 2016, the company attempted to launch a pilot program to install electric vehicle charging stations but state utility regulators turned down oversight of the project. As a result, Ameren canceled the program because it would not recover its investments. However, in early 2018 Ameren tried again, this time launching a program called \"Charge Ahead\" which incentivizes the installation of around 1,200 charging stations. In addition, the program creates incentives for the adoption of commercial electric vehicles. Former manufactured gas plant In the nineteenth and twentieth centuries a local utility company operated a coal gasification plant at the corner of Ash and Orr streets in Columbia, Missouri, that was subsequently demolished. The company was purchased by the Ameren Corporation. The gasification process contaminated the soil and some groundwater in the area with carcinogenic chemicals. In June 2014 Ameren was removing contaminated soil from the area, and expected to finish by September 2014. As of 2019 the city is considering purchasing the lot to create a public park. Ameren has been criticized by the North Village Board of Directors for owning \"a whole city block that is in disrepair and for an aversion to commerce.\" Lake of the Ozarks Ameren Missouri sponsors the Adopt-the-Shoreline program, which enables people to “adopt” portions of the shoreline for litter control. They also control other shoreline activities in the Lake of the Ozarks such as the regulation of boat docks, seawalls and other structures within the Osage Project boundary on the lake and downstream from Bagnell Dam. The company maintains the Lake and Shoreline Protection Hotline that anyone who wishes can use to report neglected docks or other concerns they may have about the lake. Labadie Energy Center Unlike most coal energy plants, the Labadie coal plant in Franklin County, Missouri, does not have sulfur dioxide scrubbers, making it the country's highest emitter of the pollutant, according to a St. Louis Post-Dispatch report. Even if Labadie’s SO2 emissions were cut in half, it would still emit more than all but two coal plants in the country. In 2023, a Sierra Club report included Ameren's Labadie Energy Center among the 17 deadliest coal plants in the US, with calls to the EPA to pass regulations on harmful emissions contributing to regional haze affecting neighboring communities. Labadie is also the second-largest producer of greenhouse gases among the nation’s coal plants, according to EPA data. A study published in the journal Science used Medicare records to estimate the number of deaths tied to air pollution from coal plants, estimating that from 1999 to 2020, about 4,000 deaths were linked to “fine particulate matter” from Labadie, far more than any other coal plant across seven Midwestern states. Labadie received notice of Clean Air Act violations from the EPA in at least 2010 and 2011, being cited for “major modifications that caused a significant net emissions increase” without first obtaining proper permits. Ameren UE Tower The Ameren UE Tower is a unique combination of an electricity pylon and a radio tower located near Ameren's headquarters in St. Louis, Missouri, USA at 38.623313 N 90.210840 W. It is a 106.5-metres (with antennas on top 111 metres) tall lattice steel structure, which was built in 2009. It carries two 138 kV circuits on three crossbars approximately in half height. Unlike other electricity pylons that carries antennas, the height of the Ameren UE Tower is not determined by its function as electricity pylon, but rather by its task as radio tower, which requires a significantly greater height than a pour use as an electricity pylon. The design of the Ameren UE Tower has the disadvantage that the installation of larger antennas with a crane or pulley is significantly hampered by the crossbars and power conductors, requiring the shutdown of the high-voltage circuits. ,"
}