{
  "ticker": "AEP",
  "cik": "0000004904",
  "company_name": "American Electric Power",
  "corrected_name": "American Electric Power",
  "wiki_title_used": "American Electric Power",
  "exists": true,
  "raw_text": "American Electric Power Company, Inc. (AEP; railcar reporting mark: AEPX) is an American domestic electric utility company in the United States. It is one of the largest electric utility companies in the country, with more than five million customers in 11 states.\nAmerican Electric Power Company is one of the nation's largest generators of electricity, owning nearly 38,000 megawatts of generating capacity in the United States. AEP also owns the nation's largest electricity transmission system, a nearly 39,000-mile (63,000 km) network that includes more 765 kilovolt ultra-high voltage transmission lines than all other U.S. transmission systems combined. AEP's transmission system directly or indirectly provides about 10 percent of the electricity demand in the Eastern Interconnection, the interconnected transmission system that covers 38 eastern and central U.S. states and eastern Canada, and approximately 11 percent of the electricity demand in the Electric Reliability Council of Texas, the transmission system that covers much of Texas.\nAEP's utility units operate as AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia, and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana and east Texas). AEP's headquarters are in Columbus, Ohio.\nAmerican Electric Power was the first utility to utilize 345 kV transmission lines which took place in 1953.\nThe company ranked 185th on the 2018 Fortune 500 of the largest United States corporations by revenue.\n\nSubsidiaries\nThe company is divided into seven major geographic local operating companies:\n\nAEP Ohio\nAEP Ohio serves 1.5 million customers in central, southern and northwestern Ohio.  For years, it consisted of two operating companies, Ohio Power and Columbus Southern Power.  However, in 2014, Columbus Southern was merged into Ohio Power, leaving Ohio Power as the legal operating company for regulatory purposes.\n\nAEP Texas\nAEP Texas was formed from a merger of various predecessor utilities, and joined AEP as part of its acquisition of Central and South West Corporation in 1997. It consists of AEP Texas North Company (formerly West Texas Utilities), which operates in west Texas, and AEP Texas Central Company (formerly Central Power and Light), which operates in south Texas.\n\nAppalachian Power\nAppalachian Power (APCO) is based in Charleston, West Virginia. APCO serves about one million customers in central and Southern West Virginia, the Northern Panhandle of West Virginia, Southwest Virginia and parts of Northeast Tennessee, specifically Kingsport.  Cities in the Appalachian Power service territory include Wheeling, Charleston and Huntington, West Virginia; Roanoke, Virginia, Lynchburg, Virginia, and Kingsport.\nUntil the 21st century, AEP's operations in Tennessee were part of a separate operating company, Kingsport Power Company.  However, since the turn of the millennium, Kingsport Power's operations have been almost completely merged with those of Appalachian Power. While Kingsport Power still legally exists, the Kingsport Power name is almost never used anymore except for regulatory formality. AEP considers Appalachian Power to be the operating company in Kingsport.\nWheeling Power, based in Wheeling, was long treated as a de facto part of Ohio Power, but is now treated as part of Appalachian Power.\n\nIndiana Michigan Power\nIndiana Michigan Power (I&M) serves northeastern and east-central Indiana, including Muncie and Fort Wayne; and parts of north-central Indiana and southwest Michigan, including South Bend, St. Joseph, Benton Harbor and Three Rivers. The Donald C. Cook nuclear power plant is located in I&M's territory.\n\nKentucky Power\nKentucky Power serves most of Eastern Kentucky, the area abutting the Appalachian Power service area, including communities of Pikeville, Hazard and Ashland. Kentucky Power headquarters is in Ashland and they maintain a government relations office in Frankfort.\nOn October 26, 2021, the Liberty Utilities subsidiary of Algonquin Power & Utilities agreed to acquire AEP's Kentucky operations in a transaction valued at $2.8 billion (US). The purchase was expected to close in the second quarter of 2022, pending regulatory approval.\nOn April 17, 2023, the sale was terminated. The sale drew criticism from the Kentucky Attorney General and Kentucky lawmakers. In May 2022, Kentucky's Public Service Commission approved the sale, but only with modifications made to the sale. In December 2022, the U.S. Federal Energy Regulatory Commission refused approval, stating \"the sales’ parties did not provide enough evidence to show the deal wouldn't have an adverse effect on rate payers.\" Although AEP and Liberty Utilities reapplied in February 2023, they later announced the termination of the sale.\n\nPublic Service Company of Oklahoma (PSO)\nPSO was one of the four CSW operating companies when CSW merged with AEP. Incorporated in 1913, PSO serves approximately 540,000 customers in eastern and southwestern Oklahoma. Its headquarters are in Tulsa. PSO has 4,269 megawatts of generating capacity and provides electricity to 232 cities and towns across a service area encompassing 30,000 square miles.\nIn April 2014, Oklahoma Governor Mary Fallin signed into law an AEP-backed bill that would add a tax onto anyone in the state who adopted rooftop solar. This legislation was headed by Rep. Mike Turner (Oklahoma politician) (R. Edmond), known for his support of ending rooftop solar.\n\nSouthwestern Electric Power Company\nOften called SWEPCO, the Southwestern Electric Power Company serves most of western Arkansas, northwestern Louisiana, and northeastern Texas. Like PSO, it was one of the four CSW Operating Companies.\nBetween 2013 and 2014, AEP, under subsidiary SWEPCO, tried to eliminate a fundamental solar policy, net metering, at the LPSC several times, and failed each time. SWEPCO also backed openly anti-solar candidate Eric Skrmetta, who has been widely criticized for receiving 2/3 of his campaign contributions from entities he regulates.\nIn Arkansas, SWEPCO is expected in 2015 to ask regulators to allow them to pass along the costs of building and running the John W. Turk Jr. Coal Plant, the most expensive project in state history, to Arkansas ratepayers. This process is expected to elicit similar controversy to what has plagued the plant since construction.\nSWEPCO operated Dolet Hills Power Station was scheduled for closure in Louisiana in 2021, due to pressure by Beyond Coal.\n\nOther subsidiaries\nAEP also bought much of the town of Cheshire, Ohio, where the Gavin Power Plant is located, due to pollution issues.\nIn 2004, AEP announced their plans to build one, or more, integrated gasification combined cycle (IGCC) coal-fired power plant which is expected to reduce emissions while providing additional electricity capacity to the customers served by AEP.\nIn August 2008, AEP formed a joint venture company with Duke Energy to build and own new electric transmission assets.\nIt is the largest shareholder in the Ohio Valley Electric Corporation (OVEC). OVEC is an associate company of AEP, not a subsidiary, because AEP owns less than half of it.\n\nNuclear\nAEP owns and operates the Donald C. Cook nuclear power plant. This accounts for 6% of the generation portfolio.\n\nHybrid technology\nAEP is expanding its green efforts to include 18 more International DuraStar hybrid diesel trucks. AEP is also teaming with Ford for the integration of a Vehicle-To-Power grid communication system, which allows hybrid vehicles to communicate with power companies to determine where, how long, and what it would cost to re-charge a hybrid during travel.\n\nSolar and wind energy\nIn 2009, AEP signed a deal with Wyandot Solar LLC to purchase power from one of the largest solar fields in the eastern United States of America, based in Upper Sandusky, Ohio.\nAEP owns and operates the Desert Sky Wind Farm and the Trent Wind Farm.\nIn 2009, AEP partnered with other energy companies in commissioning a study of how to transmit wind energy generated in the Upper Midwest to consumers in the East.\nIn 2017, Invenergy and GE announced plans for the $4.5 billion, 2,000 MW Wind Catcher (a/k/a Windcatcher) project on a 300,000-acre site in Cimarron and Texas counties in the Oklahoma Panhandle, which would have been among the world's largest wind farms when completed in 2020.  AEP utility subsidiaries PSO and SWEPCO asked utility regulators in Louisiana, Arkansas, Texas and Oklahoma to approve plans to purchase the wind farm from Invenergy upon completion of construction.  However, the project ran into opposition and was finally canceled in July 2018.\nPSO was approved in early 2020 by regulators in Oklahoma to own a 45.5% share (675 MW) of a massive 1,485 megawatt wind project known as the North Central Energy Facilities (\"NCEF\"), with SWEPCO owning the remaining 810 MW.   The project includes three wind farms covering areas in Alfalfa, Blaine, Custer, Kingfisher, Garfield, Major and Woods counties of Oklahoma.  Approval followed in Arkansas and Louisiana in May; however, the Texas Public Utility Commission denied the plan for the 309 megawatts intended for that state.  Nevertheless, PSO and SWEPCO decided to go forward with the project, with Oklahoma to receive 675 megawatts, Louisiana 464 megawatts, and Arkansas 268 megawatts.  The projects were to be completed in the 2020-2021 timeframe.  The NCEF project differed from the abandoned Wind Catcher plan in that Wind Catcher envisioned a new 765-kilovolt transmission line which would have run hundreds of miles in Oklahoma, while the NCEF facilities are near an existing PSO/SWEPCO transmission system. Also, NCEF was scalable, so that the states which approved the project could increase the number of megawatts allocated to them if/when another state rejected the proposal.  The 199 MW Sundance project, located northwest of Aline in Woods County, was completed in April 2021. The 287 MW Maverick and the 999 MW Traverse projects are scheduled to be in service later in 2021 and in early 2022, respectively.\n\nPATH proposal\nIn 2007, AEP teamed with Allegheny Energy to propose the US$1.8 billion (changed to US$2.1 billion in 2011) Potomac-Appalachian Transmission Highline (PATH), a 290-mile (470 km), 765 kilovolt transmission line that would run through West Virginia, Virginia, and Maryland. According to Joe Denault, a volunteer spokesperson for the proposal, the PATH proposal would incorporate new technology to reduce carbon dioxide emissions by 380,000 short tons (340,000 t) a year; allow for the transmission of renewable energy sources, such as wind, solar, and hydroelectric; and generate 5,700 jobs, with $420 million in employee compensation annually. However, many of these claims are disputed and the proposal must pass several legal hurdles before moving forward. On August 24, 2012, PJM Interconnection officially removed the PATH project from its long-range expansion plans, citing a slow economy for reducing the projected growth in electricity use.\n\nHistory\nThe American Gas and Electric Company, which would be renamed American Electric Power in 1958, was incorporated in 1906. It replaced Electric Company of America, a holding company that had existed since 1899. It built \"the first plant in the world to reheat steam to do double duty in the process of generating electricity\" at the Philo Power Plant in Philo, Ohio in 1923. Several of its holdings were divested following the passage of the Public Utility Holding Company Act in 1935; these holdings would include Atlantic City Electric (now a subsidiary of Exelon) and Scranton Electric (since absorbed by PPL). However, it retained its Central System, which ran between Michigan and Virginia. It moved its headquarters from New York City to Columbus, Ohio in the 1980s. On May 1, 1999, The North American electric power industry tested and cleared 75 percent of the U.S. electricity system for compliance with the Year 2000 computer glitch. On August 31, 2004, American Electric Power Company's $10 billion acquisition of the Central and South West Corporation was approved.\n\nAcquisitions\n1922 Indiana and Michigan Electric\n1924 American Electric Power Company, a Philadelphia holding company\n1925 Appalachian Power Company\n1948 Indiana Service Corporation of Fort Wayne\n1980 Columbus and Southern Ohio Electric Company\n1997 Central and South West Corporation (completed in 2000)\n\nOwnership\nAs of 2017, American Electric Power shares are mainly held by institutional investors, and large Single Family Offices (Vanguard group, BlackRock, State Street Corporation, and others)\n\nEnvironmental record\nThe Political Economy Research Institute ranks American Electric Power 55th among corporations emitting airborne pollutants in the United States. The ranking is based on the quantity (2,240,000,000 pounds (1,020,000 t) in 2018) of toxic air released, as well as the toxicity and population exposure of the emissions. Major pollutants include sulfuric and hydrochloric acids, and chromium, manganese and nickel compounds. Overall, electric power plants, such as those operated by AEP, account for almost \"70 percent of sulfur dioxide emissions each year and 30 percent of nitrogen oxides emissions.\" Individually, these pollutants cause serious respiratory damage and other illnesses; when combined, they create what's known as acid rain, which causes long term damage to the environment and deterioration of natural and man-made structures. Environmental Protection Agency has named American Electric a potentially responsible party at the Green River Disposal Inc. Superfund toxic waste site.\nIn February 2018, AEP announced plans to reduce carbon emissions 80 percent by 2050 through increased use of renewables, natural gas and energy efficiency.\nIn August 2018, AEP started a program in Ohio that incentivizes the installation of electric vehicle infrastructure by investing $10 million for the installation of up to 375 electric vehicle charging stations. According to Utility DIVE, \"The program is part of a wave of EV charging rollouts utilities are spearheading in an effort to spur EV adoption.\"\n\nJustice Department lawsuit\nThe United States Justice Department filed a lawsuit on November 3, 1999, against AEP and six other companies for violating the Clean Air Act. On October 8, 2007, AEP agreed to install US$4.6 billion in equipment to reduce emission, as well as pay a US$15 million civil fine and provide US$36 million for environmental projects and $24 million for environmental mitigation.\nThe company will cut 813,000 short tons (738,000 t) of air pollutants annually once all of the controls are installed. According to the press release, the agreement imposes caps on emissions of pollutants from 16 plants located in five states.  The facilities are located in Moundsville (two facilities), St. Albans, Glasgow, and New Haven (two facilities), West Virginia; Louisa, Kentucky;  Glen Lyn and Carbo, Virginia; Brilliant, Conesville, Cheshire, Lockbourne, and Beverly, Ohio; and Rockport and Lawrenceburg, Indiana.\n\nAttempt to halt solar energy\nAEP has come under criticism in many of the states they operate in for attacking rooftop solar. They have specifically attempted to halt distributed solar in Louisiana, Arkansas, Oklahoma, West Virginia, Indiana, Kentucky, and Ohio.\n\nCarbon footprint\nAEP reported Total CO2e emissions (Direct + Indirect) for the twelve months ending December 31, 2020, at 49,681 Kt (-29,610 /-37.3% y-o-y) and aims to reach net zero emissions by 2045.\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for American Electric Power, Inc.: \nAEP River Operations",
  "clean_text": "American Electric Power Company, Inc. (AEP; railcar reporting mark: AEPX) is an American domestic electric utility company in the United States. It is one of the largest electric utility companies in the country, with more than five million customers in 11 states. American Electric Power Company is one of the nation's largest generators of electricity, owning nearly 38,000 megawatts of generating capacity in the United States. AEP also owns the nation's largest electricity transmission system, a nearly 39,000-mile (63,000 km) network that includes more 765 kilovolt ultra-high voltage transmission lines than all other U.S. transmission systems combined. AEP's transmission system directly or indirectly provides about 10 percent of the electricity demand in the Eastern Interconnection, the interconnected transmission system that covers 38 eastern and central U.S. states and eastern Canada, and approximately 11 percent of the electricity demand in the Electric Reliability Council of Texas, the transmission system that covers much of Texas. AEP's utility units operate as AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia, and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana and east Texas). AEP's headquarters are in Columbus, Ohio. American Electric Power was the first utility to utilize 345 kV transmission lines which took place in 1953. The company ranked 185th on the 2018 Fortune 500 of the largest United States corporations by revenue. Subsidiaries The company is divided into seven major geographic local operating companies: AEP Ohio AEP Ohio serves 1.5 million customers in central, southern and northwestern Ohio. For years, it consisted of two operating companies, Ohio Power and Columbus Southern Power. However, in 2014, Columbus Southern was merged into Ohio Power, leaving Ohio Power as the legal operating company for regulatory purposes. AEP Texas AEP Texas was formed from a merger of various predecessor utilities, and joined AEP as part of its acquisition of Central and South West Corporation in 1997. It consists of AEP Texas North Company (formerly West Texas Utilities), which operates in west Texas, and AEP Texas Central Company (formerly Central Power and Light), which operates in south Texas. Appalachian Power Appalachian Power (APCO) is based in Charleston, West Virginia. APCO serves about one million customers in central and Southern West Virginia, the Northern Panhandle of West Virginia, Southwest Virginia and parts of Northeast Tennessee, specifically Kingsport. Cities in the Appalachian Power service territory include Wheeling, Charleston and Huntington, West Virginia; Roanoke, Virginia, Lynchburg, Virginia, and Kingsport. Until the 21st century, AEP's operations in Tennessee were part of a separate operating company, Kingsport Power Company. However, since the turn of the millennium, Kingsport Power's operations have been almost completely merged with those of Appalachian Power. While Kingsport Power still legally exists, the Kingsport Power name is almost never used anymore except for regulatory formality. AEP considers Appalachian Power to be the operating company in Kingsport. Wheeling Power, based in Wheeling, was long treated as a de facto part of Ohio Power, but is now treated as part of Appalachian Power. Indiana Michigan Power Indiana Michigan Power (I&M) serves northeastern and east-central Indiana, including Muncie and Fort Wayne; and parts of north-central Indiana and southwest Michigan, including South Bend, St. Joseph, Benton Harbor and Three Rivers. The Donald C. Cook nuclear power plant is located in I&M's territory. Kentucky Power Kentucky Power serves most of Eastern Kentucky, the area abutting the Appalachian Power service area, including communities of Pikeville, Hazard and Ashland. Kentucky Power headquarters is in Ashland and they maintain a government relations office in Frankfort. On October 26, 2021, the Liberty Utilities subsidiary of Algonquin Power & Utilities agreed to acquire AEP's Kentucky operations in a transaction valued at $2.8 billion (US). The purchase was expected to close in the second quarter of 2022, pending regulatory approval. On April 17, 2023, the sale was terminated. The sale drew criticism from the Kentucky Attorney General and Kentucky lawmakers. In May 2022, Kentucky's Public Service Commission approved the sale, but only with modifications made to the sale. In December 2022, the U.S. Federal Energy Regulatory Commission refused approval, stating \"the sales’ parties did not provide enough evidence to show the deal wouldn't have an adverse effect on rate payers.\" Although AEP and Liberty Utilities reapplied in February 2023, they later announced the termination of the sale. Public Service Company of Oklahoma (PSO) PSO was one of the four CSW operating companies when CSW merged with AEP. Incorporated in 1913, PSO serves approximately 540,000 customers in eastern and southwestern Oklahoma. Its headquarters are in Tulsa. PSO has 4,269 megawatts of generating capacity and provides electricity to 232 cities and towns across a service area encompassing 30,000 square miles. In April 2014, Oklahoma Governor Mary Fallin signed into law an AEP-backed bill that would add a tax onto anyone in the state who adopted rooftop solar. This legislation was headed by Rep. Mike Turner (Oklahoma politician) (R. Edmond), known for his support of ending rooftop solar. Southwestern Electric Power Company Often called SWEPCO, the Southwestern Electric Power Company serves most of western Arkansas, northwestern Louisiana, and northeastern Texas. Like PSO, it was one of the four CSW Operating Companies. Between 2013 and 2014, AEP, under subsidiary SWEPCO, tried to eliminate a fundamental solar policy, net metering, at the LPSC several times, and failed each time. SWEPCO also backed openly anti-solar candidate Eric Skrmetta, who has been widely criticized for receiving 2/3 of his campaign contributions from entities he regulates. In Arkansas, SWEPCO is expected in 2015 to ask regulators to allow them to pass along the costs of building and running the John W. Turk Jr. Coal Plant, the most expensive project in state history, to Arkansas ratepayers. This process is expected to elicit similar controversy to what has plagued the plant since construction. SWEPCO operated Dolet Hills Power Station was scheduled for closure in Louisiana in 2021, due to pressure by Beyond Coal. Other subsidiaries AEP also bought much of the town of Cheshire, Ohio, where the Gavin Power Plant is located, due to pollution issues. In 2004, AEP announced their plans to build one, or more, integrated gasification combined cycle (IGCC) coal-fired power plant which is expected to reduce emissions while providing additional electricity capacity to the customers served by AEP. In August 2008, AEP formed a joint venture company with Duke Energy to build and own new electric transmission assets. It is the largest shareholder in the Ohio Valley Electric Corporation (OVEC). OVEC is an associate company of AEP, not a subsidiary, because AEP owns less than half of it. Nuclear AEP owns and operates the Donald C. Cook nuclear power plant. This accounts for 6% of the generation portfolio. Hybrid technology AEP is expanding its green efforts to include 18 more International DuraStar hybrid diesel trucks. AEP is also teaming with Ford for the integration of a Vehicle-To-Power grid communication system, which allows hybrid vehicles to communicate with power companies to determine where, how long, and what it would cost to re-charge a hybrid during travel. Solar and wind energy In 2009, AEP signed a deal with Wyandot Solar LLC to purchase power from one of the largest solar fields in the eastern United States of America, based in Upper Sandusky, Ohio. AEP owns and operates the Desert Sky Wind Farm and the Trent Wind Farm. In 2009, AEP partnered with other energy companies in commissioning a study of how to transmit wind energy generated in the Upper Midwest to consumers in the East. In 2017, Invenergy and GE announced plans for the $4.5 billion, 2,000 MW Wind Catcher (a/k/a Windcatcher) project on a 300,000-acre site in Cimarron and Texas counties in the Oklahoma Panhandle, which would have been among the world's largest wind farms when completed in 2020. AEP utility subsidiaries PSO and SWEPCO asked utility regulators in Louisiana, Arkansas, Texas and Oklahoma to approve plans to purchase the wind farm from Invenergy upon completion of construction. However, the project ran into opposition and was finally canceled in July 2018. PSO was approved in early 2020 by regulators in Oklahoma to own a 45.5% share (675 MW) of a massive 1,485 megawatt wind project known as the North Central Energy Facilities (\"NCEF\"), with SWEPCO owning the remaining 810 MW. The project includes three wind farms covering areas in Alfalfa, Blaine, Custer, Kingfisher, Garfield, Major and Woods counties of Oklahoma. Approval followed in Arkansas and Louisiana in May; however, the Texas Public Utility Commission denied the plan for the 309 megawatts intended for that state. Nevertheless, PSO and SWEPCO decided to go forward with the project, with Oklahoma to receive 675 megawatts, Louisiana 464 megawatts, and Arkansas 268 megawatts. The projects were to be completed in the 2020-2021 timeframe. The NCEF project differed from the abandoned Wind Catcher plan in that Wind Catcher envisioned a new 765-kilovolt transmission line which would have run hundreds of miles in Oklahoma, while the NCEF facilities are near an existing PSO/SWEPCO transmission system. Also, NCEF was scalable, so that the states which approved the project could increase the number of megawatts allocated to them if/when another state rejected the proposal. The 199 MW Sundance project, located northwest of Aline in Woods County, was completed in April 2021. The 287 MW Maverick and the 999 MW Traverse projects are scheduled to be in service later in 2021 and in early 2022, respectively. PATH proposal In 2007, AEP teamed with Allegheny Energy to propose the US$1.8 billion (changed to US$2.1 billion in 2011) Potomac-Appalachian Transmission Highline (PATH), a 290-mile (470 km), 765 kilovolt transmission line that would run through West Virginia, Virginia, and Maryland. According to Joe Denault, a volunteer spokesperson for the proposal, the PATH proposal would incorporate new technology to reduce carbon dioxide emissions by 380,000 short tons (340,000 t) a year; allow for the transmission of renewable energy sources, such as wind, solar, and hydroelectric; and generate 5,700 jobs, with $420 million in employee compensation annually. However, many of these claims are disputed and the proposal must pass several legal hurdles before moving forward. On August 24, 2012, PJM Interconnection officially removed the PATH project from its long-range expansion plans, citing a slow economy for reducing the projected growth in electricity use. History The American Gas and Electric Company, which would be renamed American Electric Power in 1958, was incorporated in 1906. It replaced Electric Company of America, a holding company that had existed since 1899. It built \"the first plant in the world to reheat steam to do double duty in the process of generating electricity\" at the Philo Power Plant in Philo, Ohio in 1923. Several of its holdings were divested following the passage of the Public Utility Holding Company Act in 1935; these holdings would include Atlantic City Electric (now a subsidiary of Exelon) and Scranton Electric (since absorbed by PPL). However, it retained its Central System, which ran between Michigan and Virginia. It moved its headquarters from New York City to Columbus, Ohio in the 1980s. On May 1, 1999, The North American electric power industry tested and cleared 75 percent of the U.S. electricity system for compliance with the Year 2000 computer glitch. On August 31, 2004, American Electric Power Company's $10 billion acquisition of the Central and South West Corporation was approved. Acquisitions 1922 Indiana and Michigan Electric 1924 American Electric Power Company, a Philadelphia holding company 1925 Appalachian Power Company 1948 Indiana Service Corporation of Fort Wayne 1980 Columbus and Southern Ohio Electric Company 1997 Central and South West Corporation (completed in 2000) Ownership As of 2017, American Electric Power shares are mainly held by institutional investors, and large Single Family Offices (Vanguard group, BlackRock, State Street Corporation, and others) Environmental record The Political Economy Research Institute ranks American Electric Power 55th among corporations emitting airborne pollutants in the United States. The ranking is based on the quantity (2,240,000,000 pounds (1,020,000 t) in 2018) of toxic air released, as well as the toxicity and population exposure of the emissions. Major pollutants include sulfuric and hydrochloric acids, and chromium, manganese and nickel compounds. Overall, electric power plants, such as those operated by AEP, account for almost \"70 percent of sulfur dioxide emissions each year and 30 percent of nitrogen oxides emissions.\" Individually, these pollutants cause serious respiratory damage and other illnesses; when combined, they create what's known as acid rain, which causes long term damage to the environment and deterioration of natural and man-made structures. Environmental Protection Agency has named American Electric a potentially responsible party at the Green River Disposal Inc. Superfund toxic waste site. In February 2018, AEP announced plans to reduce carbon emissions 80 percent by 2050 through increased use of renewables, natural gas and energy efficiency. In August 2018, AEP started a program in Ohio that incentivizes the installation of electric vehicle infrastructure by investing $10 million for the installation of up to 375 electric vehicle charging stations. According to Utility DIVE, \"The program is part of a wave of EV charging rollouts utilities are spearheading in an effort to spur EV adoption.\" Justice Department lawsuit The United States Justice Department filed a lawsuit on November 3, 1999, against AEP and six other companies for violating the Clean Air Act. On October 8, 2007, AEP agreed to install US$4.6 billion in equipment to reduce emission, as well as pay a US$15 million civil fine and provide US$36 million for environmental projects and $24 million for environmental mitigation. The company will cut 813,000 short tons (738,000 t) of air pollutants annually once all of the controls are installed. According to the press release, the agreement imposes caps on emissions of pollutants from 16 plants located in five states. The facilities are located in Moundsville (two facilities), St. Albans, Glasgow, and New Haven (two facilities), West Virginia; Louisa, Kentucky; Glen Lyn and Carbo, Virginia; Brilliant, Conesville, Cheshire, Lockbourne, and Beverly, Ohio; and Rockport and Lawrenceburg, Indiana. Attempt to halt solar energy AEP has come under criticism in many of the states they operate in for attacking rooftop solar. They have specifically attempted to halt distributed solar in Louisiana, Arkansas, Oklahoma, West Virginia, Indiana, Kentucky, and Ohio. Carbon footprint AEP reported Total CO2e emissions (Direct + Indirect) for the twelve months ending December 31, 2020, at 49,681 Kt (-29,610 /-37.3% y-o-y) and aims to reach net zero emissions by 2045."
}