{
  "ticker": "AES",
  "cik": "0000874761",
  "company_name": "AES Corporation",
  "corrected_name": "AES Corporation",
  "wiki_title_used": "AES Corporation",
  "exists": true,
  "raw_text": "The AES Corporation is an American utility and power generation company. It owns and operates power plants, which it uses to generate and sell electricity to end users and intermediaries like utilities and industrial facilities. AES, headquartered in Arlington, Virginia, is one of the world's leading power companies, generating and distributing electric power in 15 countries and employing 10,500 people worldwide. AES Corporation is a global Fortune 500 power company. AES Ranks in the Top Ten of Fast Company's 2022 Best Workplaces for Innovators.\n\nHistory\n20th century\nThe company was founded on January 28, 1981, as Applied Energy Services by Roger Sant and Dennis Bakke, two appointees of the Federal Energy Administration under president Richard Nixon. The company was initially a consulting firm; it became AES Corporation, which went public in 1991. Sant was chairman, CEO, and president and Bakke was executive vice president until assuming the position of president in 1987. Bakke later became the company's CEO in 1994, serving for eight years until his resignation in 2002 in the midst of a liquidity crisis that followed the collapse of the energy giant Enron.\n\n21st century\nSant remained as executive chairman until 2003 and as a member of the board until 2006. Paul Hanrahan was appointed president and CEO and remained for ten years, overseeing the stabilization of the company. Until the early 2000s, the company followed self-management, delegating much responsibility to ordinary employees. In 2012, Hanrahan resigned his position as president and CEO of the company, and he was succeeded by Andres Gluski. As CEO, Gluski has implemented a strategy of reducing the number of countries in which AES does business, from 28 to 16, for the purpose of consolidating operations and reducing costs. Additionally, he began a program of reducing the company's total carbon emission intensity.\nBakke and Sant oversaw much of AES's initial global expansion, building power plants in 29 countries and expanding its staff from 1,400 to 32,000 employees, and also instilled a system of decentralized management that emphasized social responsibility above profit. In recent years, AES has signaled a commitment to providing its consumers and clients with renewable forms of energy, and its operations across the world increasingly have focused on the construction and provision of solar and wind-based energy storage systems.\nAES acquired the assets of Indianapolis Power & Light, Ipalco, in 2000. In February 2021, Indianapolis Power & Light rebranded as AES Indiana.\nAES acquired the Chilean-based subsidiary Gener in 2000 and acquired DPL Inc., then known as Dayton Power & Light, in 2011. Although retaining its name for legal purposes, the company was rebranded as AES Ohio in February 2021.\nIn fiscal 2015, AES's total revenue was $15 billion.\nIn 2018, AES acquired the subsidiary sPower.\nIn December 2021, AES acquired Community Energy Solar (Community Energy) to help deliver 4 GW of renewables in the U.S.\n\nMajor projects\nFluence\nLaunched during January 2018, Fluence is a joint venture between AES Energy Storage and Siemens that is focused on the development of, and expansion of energy storage technologies and services. Chaired by former AES vice-president for energy storage platforms Stephen Coughlin, and headquartered in Washington D.C., Fluence aims to implement AES's extensive research into the potential of lithium-ion powered energy sources by relying upon Siemens' expansive global presence in the industrial sector; for the purpose of addressing the rapidly rising demand for clean energy technologies. Fluence has been deployed in 16 countries, with major projects including the following:\n\nThe creation of a new 40 megawatt storage facility on behalf of San Diego Gas & Electric's new 40 MW storage facility.\nThree solar powered projects throughout Arizona and two 10 MW projects in the Dominican Republic.\nThe installation of six storage projects across Germany that will provide grid stabilization.\nThe construction of a hybrid microgrid on the Mediterranean Island of Ventotene. Said microgrid will be developed as per an agreement between Fluence and the Italian energy utility Enel, and will combine diesel generators with renewables in order to aid in the efforts to reduce carbon costs and emissions. The key technology platforms developed by Fluence include the following.\n\nKey Fluence technologies\nFluence is expected to employ three different types of grid technology. WP:Crystal\ni):SIESTORAGE: An electrical energy storage system fueled predominantly by wind and solar energy. Siestorage relies upon the closed-loop controls and pulse modulation built into its semiconductors, in order to provide consumers with increased dependability.\nii):Advancion: A storage system that is made up of several small, modular nodes and powered by lithium-ion batteries, which enables the Advancion energy store system to provide consumers with a heightened degree of consistency in performance.\niii): Sunflux Energy: Announced in January 2018, Sunflex was developed for the purpose of expanding upon the possibilities offered by photovoltaic solar energy. This technology is built to capture energy during peak solar hours in order to expand energy delivery.\n\nProjected ventures using Fluence technologies\nPresently, the biggest project in Fluence's portfolio is a 100–400 Mwh \"power center energy storage project\" for Southern California Edison. This system will be housed within AES's power center in Los Alamitos, California.\nDuring January 2018, the subsidiary AES India, working in partnership with Mitsubishi, commenced construction of a 10 MW energy storage solution that will be located in Rohini. This storage solution, which shall operate off Fluence's Advancion technology, is projected to be the first utility-scale system to be in India.\n\nsPower\nHeadquartered in Salt Lake City and acquired from Fir Tree Partners Inc in a purchase during 2017 as part of a joint acquisition with Alberta Investment Management Corporation, sPower is a large developer of utility-scale solar in the United States, operating across 11 states, and with particular focus on the states of California and North Carolina. Its current operating portfolio includes 1.3 GW worth of solar and wind based properties, in addition to over 10,000 MW worth of projects that are in the developmental stage.\n\nInvestment in drone technologies\nAs part of an effort by AES to protect its employees from industry hazards and to improve workplace safety, the company announced a partnership with drone provider Measure to inspect their various energy infrastructures sites across 17 countries.\n\nMajor properties and subsidiaries\nProperties and subsidiaries in North America\nAES Ohio, branding for DPL Inc. – Dayton Power and Light Company\nAES Indiana, formerly IPL – Indianapolis Power & Light Company\nPremier Power\nAES Energy Storage. AES Energy Storage has provided some of the largest battery storage power station in the world.\nAES Puerto Rico\nAES Colón power station, Panama\n\nProperties in South America\nBased in Argentina\nTermoAndes: Located in the province of Salta, and acquired by AES in 2000. This hybrid plants utilizes both gasoline and diesel fuels and has a production capacity of 643 MW.\nAlicura: Acquired by AES in the year 2000. This hydro powered plant is one of Andes' most important alternative energy assets, boasting 1,000 megawatts of generation capacity.\nGuillermo Brown: Located in the province of Buenos Aires, and acquired by AES in 2016. This gas turbine utilizes both natural gas and diesel fuels and has a generation capacity of 576 MW.\nLos Caracoles: Owned by AES Argentina, and located in [Buenos Aires]. This hydroelectric plant produces 12 MW. Although AES owns the property, the equity is publicly owned, and operations are carried out through various managerial and Observation and Measurement agreements.\nParaná-GT: Purchased by AES Argentina in 2001, and located in San Nicolás de los Arroyos. This plant uses both gasoline and diesel as fuel sources, and has a total capacity of 845 megawatts.\nCarba Corral: Based in the province of [Salta], and owned by AES Argentina, who purchased the property in 1995. This plant has an installed capacity of 102 MW, and runs on hydro power.\nSarmiento Power Plant: Owned by AES Andes, and located in San Juan Province, Argentina. This plant was acquired by AES in 1996, and runs off both gas and diesel fuel. It has an installed capacity of 33 MW, and runs off 3 Electrical gas turbines, all of which measure 11 MW.\n\nBased in Brazil\nAES Brazil: Founded in 1997. Ownership is divided between AES and the Brazilian Development Bank.\n\nAES Tietê – Brazil\n\nBased in Chile\nAES Andes\n\nProperties and subsidiaries in Europe\nBased in United Kingdom\nBallyumford Power Station: Located on the northwestern end of Islandmagee in County Antrim. This property, purchased by AES in 2010, is the largest power station on the Irish mainland, boasting a generating capacity of 1017 megawatts. \nKilroot Power Station: Acquired by AES in 1992 deal that included Belfast Power Station West. The company was named NIGEN and distinguished by the fact that it was the first purchase the company made outside of the United States, this property is located on the north shore of Belfast Lough in, and was acquired by AES in 1992. This station has an installed generating capacity of 560 megawatts, and operates using generators that run off both oil and gas, as well as via turbines that provide it with an additional 142 MW. Belfast Power Station West was a 240MW coal fired plant comprising 13 chain grate stoker boilers and 5 Parsons turbo generators 2X30MW and 3x60MW\nArray: An energy storage system located at the Kilroot Power station, and operating off Fluence's Advancion model. This system is the largest advanced energy storage system in the United Kingdom, providing 10 megawatts of interconnected storage energy.\n\nBased in Bulgaria\nMaritsa Iztok: The largest energy complex in Southeast Europe, the Maritsa Iztok Complex is a 690 coal plant located in Galabovo. It was acquired by AES in 2011.\nSt. Nikola: St. Nikola is a 156 MW wind generator located near the town of Kavarna. Built in 2009, it is considered the largest wind farm in the country. As part of the high efficiency standards maintained throughout the development and construction of this generator, AES Geo Energy was awarded both the 2008 \"Sustainable Energy Deal of the Year\" Prize from EMEA Finance Magazine as well as the \"Investor of 2009\" in the Energy Sector by the Bulgarian Investment Agency for Production of Electric Power from RES.).\n\nBased in the Netherlands\nNetherlands ES: Located in Vlissingen, this energy storage system was built using AES's Advancion technology. This system, which produces a total of 10 MW, is designed to provide a low-battery based alternative to traditional power plants and hydroelectric storages.\nFormerly - Elsta: Located in the Dutch province of Zeeland, near Terneuzen. AES acquired 50% of the interests in this facility in 1998, as part of a transaction that divided ownership between it, DELTA, and Essent. This combined heat and power facility is powered by a trio of natural gas turbines, and can produce up to 630 MW of power. Sold, as of 2024 property of Dow Terneuzen.\n\nProperties and subsidiaries in Asia\nProperties and subsidiaries in the Middle East\nBased in Jordan\n'The Amman East Power Plant' MW a 380 MW combined cycle gas-fired power plant located Al Manakher. The plant was commissioned in 2009, and is a shared subsidiary of AES and Mitsui & Co. In 2011 Qatar Electricity & Water Corporation announced it will buy a stake in the power plant.\n\nProperties and subsidiaries in Central Asia\nBased in Kazakhstan\nUst-Kamenorgorsk: Active since 1947 and purchased megawatt AES in 1997, CHP is a 1,372 MW coal power plant located in the East Kazakhstan Region.\nSogrinsk CHP: Acquired by AES in 1997 and operated by the power generation company CHP LLP, this coal based plant has a total capacity of 345 MW. It is located in the East Kazakhstan Region.\nFormerly - Shulbinsk HPP: Acquired by AES in 1997, Shulbinsk is a 702 MW hydro power plant. It is located in Semey.\nFormerly - Ust-Kamenogorsk HPP: Located on the Irtysch River near Ust-Kamenogorsk in the East Kazakhstan Region, and purchased by AES in 1997. This is a hydroelectric plant that operates using 4 individual turbines, with nominal output of 83 MW, total generation capacity of 340 MW.\n\nProperties and subsidiaries in Southeast Asia\nBased in the Philippines\nMasinloc Power Plant: Located in the Zambales Province in Luzon, and purchased for $930 million from Masinloc Power Partners Co. Ltd. in 2009. This project, a 630 MW coal power plant, derives its resources from its proximity to the Pacific Rim, and has a stable infrastructure amendable to further megawatt additions.\nMasinloc ES: Located in the Zambales Province in Luzon, and launched by AES subsidiary Masin-AES Pte. Ltd during 2016. This storage generator provides 10 MW to the Luzon grid, and is the first battery based energy system in the country.\n\nBased in Vietnam\nMong Duong 2: Located in Cam Pha, this 1,240 MW coal fired plant became commercially operational in 2015. This plant, constructed under a Build-Operate Transfer (BOT) agreement between AES and state owned entities Electricity of Vietnam (EVN) and Vinacomin, is the largest power project in the nation's private sector.\n\nProperties and subsidiaries in India\nOPGC Plant: Acquired by AES in 1998, this coal power plant has a total capacity of 420 MW. It is located in Odisha.\nOPGC II: Currently under construction, this coal powered plant is expected to boast 1,300 MW capacity.\n\nReferences\nExternal links\nOfficial website\nBusiness data for The AES Corporation:",
  "clean_text": "The AES Corporation is an American utility and power generation company. It owns and operates power plants, which it uses to generate and sell electricity to end users and intermediaries like utilities and industrial facilities. AES, headquartered in Arlington, Virginia, is one of the world's leading power companies, generating and distributing electric power in 15 countries and employing 10,500 people worldwide. AES Corporation is a global Fortune 500 power company. AES Ranks in the Top Ten of Fast Company's 2022 Best Workplaces for Innovators. History 20th century The company was founded on January 28, 1981, as Applied Energy Services by Roger Sant and Dennis Bakke, two appointees of the Federal Energy Administration under president Richard Nixon. The company was initially a consulting firm; it became AES Corporation, which went public in 1991. Sant was chairman, CEO, and president and Bakke was executive vice president until assuming the position of president in 1987. Bakke later became the company's CEO in 1994, serving for eight years until his resignation in 2002 in the midst of a liquidity crisis that followed the collapse of the energy giant Enron. 21st century Sant remained as executive chairman until 2003 and as a member of the board until 2006. Paul Hanrahan was appointed president and CEO and remained for ten years, overseeing the stabilization of the company. Until the early 2000s, the company followed self-management, delegating much responsibility to ordinary employees. In 2012, Hanrahan resigned his position as president and CEO of the company, and he was succeeded by Andres Gluski. As CEO, Gluski has implemented a strategy of reducing the number of countries in which AES does business, from 28 to 16, for the purpose of consolidating operations and reducing costs. Additionally, he began a program of reducing the company's total carbon emission intensity. Bakke and Sant oversaw much of AES's initial global expansion, building power plants in 29 countries and expanding its staff from 1,400 to 32,000 employees, and also instilled a system of decentralized management that emphasized social responsibility above profit. In recent years, AES has signaled a commitment to providing its consumers and clients with renewable forms of energy, and its operations across the world increasingly have focused on the construction and provision of solar and wind-based energy storage systems. AES acquired the assets of Indianapolis Power & Light, Ipalco, in 2000. In February 2021, Indianapolis Power & Light rebranded as AES Indiana. AES acquired the Chilean-based subsidiary Gener in 2000 and acquired DPL Inc., then known as Dayton Power & Light, in 2011. Although retaining its name for legal purposes, the company was rebranded as AES Ohio in February 2021. In fiscal 2015, AES's total revenue was $15 billion. In 2018, AES acquired the subsidiary sPower. In December 2021, AES acquired Community Energy Solar (Community Energy) to help deliver 4 GW of renewables in the U.S. Major projects Fluence Launched during January 2018, Fluence is a joint venture between AES Energy Storage and Siemens that is focused on the development of, and expansion of energy storage technologies and services. Chaired by former AES vice-president for energy storage platforms Stephen Coughlin, and headquartered in Washington D.C., Fluence aims to implement AES's extensive research into the potential of lithium-ion powered energy sources by relying upon Siemens' expansive global presence in the industrial sector; for the purpose of addressing the rapidly rising demand for clean energy technologies. Fluence has been deployed in 16 countries, with major projects including the following: The creation of a new 40 megawatt storage facility on behalf of San Diego Gas & Electric's new 40 MW storage facility. Three solar powered projects throughout Arizona and two 10 MW projects in the Dominican Republic. The installation of six storage projects across Germany that will provide grid stabilization. The construction of a hybrid microgrid on the Mediterranean Island of Ventotene. Said microgrid will be developed as per an agreement between Fluence and the Italian energy utility Enel, and will combine diesel generators with renewables in order to aid in the efforts to reduce carbon costs and emissions. The key technology platforms developed by Fluence include the following. Key Fluence technologies Fluence is expected to employ three different types of grid technology. WP:Crystal i):SIESTORAGE: An electrical energy storage system fueled predominantly by wind and solar energy. Siestorage relies upon the closed-loop controls and pulse modulation built into its semiconductors, in order to provide consumers with increased dependability. ii):Advancion: A storage system that is made up of several small, modular nodes and powered by lithium-ion batteries, which enables the Advancion energy store system to provide consumers with a heightened degree of consistency in performance. iii): Sunflux Energy: Announced in January 2018, Sunflex was developed for the purpose of expanding upon the possibilities offered by photovoltaic solar energy. This technology is built to capture energy during peak solar hours in order to expand energy delivery. Projected ventures using Fluence technologies Presently, the biggest project in Fluence's portfolio is a 100–400 Mwh \"power center energy storage project\" for Southern California Edison. This system will be housed within AES's power center in Los Alamitos, California. During January 2018, the subsidiary AES India, working in partnership with Mitsubishi, commenced construction of a 10 MW energy storage solution that will be located in Rohini. This storage solution, which shall operate off Fluence's Advancion technology, is projected to be the first utility-scale system to be in India. sPower Headquartered in Salt Lake City and acquired from Fir Tree Partners Inc in a purchase during 2017 as part of a joint acquisition with Alberta Investment Management Corporation, sPower is a large developer of utility-scale solar in the United States, operating across 11 states, and with particular focus on the states of California and North Carolina. Its current operating portfolio includes 1.3 GW worth of solar and wind based properties, in addition to over 10,000 MW worth of projects that are in the developmental stage. Investment in drone technologies As part of an effort by AES to protect its employees from industry hazards and to improve workplace safety, the company announced a partnership with drone provider Measure to inspect their various energy infrastructures sites across 17 countries. Major properties and subsidiaries Properties and subsidiaries in North America AES Ohio, branding for DPL Inc. – Dayton Power and Light Company AES Indiana, formerly IPL – Indianapolis Power & Light Company Premier Power AES Energy Storage. AES Energy Storage has provided some of the largest battery storage power station in the world. AES Puerto Rico AES Colón power station, Panama Properties in South America Based in Argentina TermoAndes: Located in the province of Salta, and acquired by AES in 2000. This hybrid plants utilizes both gasoline and diesel fuels and has a production capacity of 643 MW. Alicura: Acquired by AES in the year 2000. This hydro powered plant is one of Andes' most important alternative energy assets, boasting 1,000 megawatts of generation capacity. Guillermo Brown: Located in the province of Buenos Aires, and acquired by AES in 2016. This gas turbine utilizes both natural gas and diesel fuels and has a generation capacity of 576 MW. Los Caracoles: Owned by AES Argentina, and located in [Buenos Aires]. This hydroelectric plant produces 12 MW. Although AES owns the property, the equity is publicly owned, and operations are carried out through various managerial and Observation and Measurement agreements. Paraná-GT: Purchased by AES Argentina in 2001, and located in San Nicolás de los Arroyos. This plant uses both gasoline and diesel as fuel sources, and has a total capacity of 845 megawatts. Carba Corral: Based in the province of [Salta], and owned by AES Argentina, who purchased the property in 1995. This plant has an installed capacity of 102 MW, and runs on hydro power. Sarmiento Power Plant: Owned by AES Andes, and located in San Juan Province, Argentina. This plant was acquired by AES in 1996, and runs off both gas and diesel fuel. It has an installed capacity of 33 MW, and runs off 3 Electrical gas turbines, all of which measure 11 MW. Based in Brazil AES Brazil: Founded in 1997. Ownership is divided between AES and the Brazilian Development Bank. AES Tietê – Brazil Based in Chile AES Andes Properties and subsidiaries in Europe Based in United Kingdom Ballyumford Power Station: Located on the northwestern end of Islandmagee in County Antrim. This property, purchased by AES in 2010, is the largest power station on the Irish mainland, boasting a generating capacity of 1017 megawatts. Kilroot Power Station: Acquired by AES in 1992 deal that included Belfast Power Station West. The company was named NIGEN and distinguished by the fact that it was the first purchase the company made outside of the United States, this property is located on the north shore of Belfast Lough in, and was acquired by AES in 1992. This station has an installed generating capacity of 560 megawatts, and operates using generators that run off both oil and gas, as well as via turbines that provide it with an additional 142 MW. Belfast Power Station West was a 240MW coal fired plant comprising 13 chain grate stoker boilers and 5 Parsons turbo generators 2X30MW and 3x60MW Array: An energy storage system located at the Kilroot Power station, and operating off Fluence's Advancion model. This system is the largest advanced energy storage system in the United Kingdom, providing 10 megawatts of interconnected storage energy. Based in Bulgaria Maritsa Iztok: The largest energy complex in Southeast Europe, the Maritsa Iztok Complex is a 690 coal plant located in Galabovo. It was acquired by AES in 2011. St. Nikola: St. Nikola is a 156 MW wind generator located near the town of Kavarna. Built in 2009, it is considered the largest wind farm in the country. As part of the high efficiency standards maintained throughout the development and construction of this generator, AES Geo Energy was awarded both the 2008 \"Sustainable Energy Deal of the Year\" Prize from EMEA Finance Magazine as well as the \"Investor of 2009\" in the Energy Sector by the Bulgarian Investment Agency for Production of Electric Power from RES.). Based in the Netherlands Netherlands ES: Located in Vlissingen, this energy storage system was built using AES's Advancion technology. This system, which produces a total of 10 MW, is designed to provide a low-battery based alternative to traditional power plants and hydroelectric storages. Formerly - Elsta: Located in the Dutch province of Zeeland, near Terneuzen. AES acquired 50% of the interests in this facility in 1998, as part of a transaction that divided ownership between it, DELTA, and Essent. This combined heat and power facility is powered by a trio of natural gas turbines, and can produce up to 630 MW of power. Sold, as of 2024 property of Dow Terneuzen. Properties and subsidiaries in Asia Properties and subsidiaries in the Middle East Based in Jordan 'The Amman East Power Plant' MW a 380 MW combined cycle gas-fired power plant located Al Manakher. The plant was commissioned in 2009, and is a shared subsidiary of AES and Mitsui & Co. In 2011 Qatar Electricity & Water Corporation announced it will buy a stake in the power plant. Properties and subsidiaries in Central Asia Based in Kazakhstan Ust-Kamenorgorsk: Active since 1947 and purchased megawatt AES in 1997, CHP is a 1,372 MW coal power plant located in the East Kazakhstan Region. Sogrinsk CHP: Acquired by AES in 1997 and operated by the power generation company CHP LLP, this coal based plant has a total capacity of 345 MW. It is located in the East Kazakhstan Region. Formerly - Shulbinsk HPP: Acquired by AES in 1997, Shulbinsk is a 702 MW hydro power plant. It is located in Semey. Formerly - Ust-Kamenogorsk HPP: Located on the Irtysch River near Ust-Kamenogorsk in the East Kazakhstan Region, and purchased by AES in 1997. This is a hydroelectric plant that operates using 4 individual turbines, with nominal output of 83 MW, total generation capacity of 340 MW. Properties and subsidiaries in Southeast Asia Based in the Philippines Masinloc Power Plant: Located in the Zambales Province in Luzon, and purchased for $930 million from Masinloc Power Partners Co. Ltd. in 2009. This project, a 630 MW coal power plant, derives its resources from its proximity to the Pacific Rim, and has a stable infrastructure amendable to further megawatt additions. Masinloc ES: Located in the Zambales Province in Luzon, and launched by AES subsidiary Masin-AES Pte. Ltd during 2016. This storage generator provides 10 MW to the Luzon grid, and is the first battery based energy system in the country. Based in Vietnam Mong Duong 2: Located in Cam Pha, this 1,240 MW coal fired plant became commercially operational in 2015. This plant, constructed under a Build-Operate Transfer (BOT) agreement between AES and state owned entities Electricity of Vietnam (EVN) and Vinacomin, is the largest power project in the nation's private sector. Properties and subsidiaries in India OPGC Plant: Acquired by AES in 1998, this coal power plant has a total capacity of 420 MW. It is located in Odisha. OPGC II: Currently under construction, this coal powered plant is expected to boast 1,300 MW capacity."
}