{
  "ticker": "AFL",
  "cik": "0000004977",
  "company_name": "Aflac",
  "corrected_name": "Aflac",
  "wiki_title_used": "Aflac",
  "exists": true,
  "raw_text": "Aflac Incorporated  (American Family Life Assurance Company) is an American insurance company and is the largest provider of supplemental insurance in the United States. It was founded in 1955 and is based in Columbus, Georgia. In the U.S., it underwrites a wide range of insurance policies, but is perhaps more known for its payroll deduction insurance coverage, which pays cash benefits when a policyholder has a covered accident or illness. The company states it \"provides financial protection to more than 50 million people worldwide\".\nIn 2009, Aflac acquired Continental American Insurance Company for $100 million, enabling them to sell supplemental insurance on both the individual and group platforms. As of June 30, 2012, it was represented by approximately 19,300 sales agencies in Japan and 76,900 licensed sales associates in the U.S.\n\nHistory\nThe company was founded by brothers John, Paul (died 2014), and William Amos in Columbus, Georgia, in 1955, as American Family Life Insurance Company of Columbus. In 1964, the company name was changed to American Family Life Assurance Company of Columbus. The company had an initial public offering in 1974 and was listed on the New York Stock Exchange. In 1990, the company adopted the Aflac acronym, although the official name of the underwriting subsidiary remains American Family Life Assurance Company of Columbus. Aflac announced the appointment of Frederick J. Crawford as Chief Financial Officer and Executive Vice President in June 2015.\nThe company signed 6,426 policyholders in its first year. Aflac pioneered cancer insurance in 1958. Beginning in 1964, the company decided to focus sales on worksite settings, eventually through policies sponsored by employers and funded through payroll deductions. By 2003, more than 98% of Aflac policies in the United States were issued on a payroll deduction basis, making the company a leader in that approach to policy distribution.\n\nBusiness\nAflac operates in the United States and Japan, and has its worldwide headquarters and corporate offices in an eighteen-story tower just east of Downtown Columbus, Georgia, in an area known as MidTown. The Aflac tower is the tallest building in the city. As of June 30, 2015, the corporation's total assets were more than $103 billion, and the company insured more than 50 million people worldwide.\nAflac is the largest provider of guaranteed-renewable insurance in the United States and the largest insurance company overall in Japan, when measured by individual insurance policies in force.\nThe company now offers several types of insurance policies in the United States, including the following:\n\nAccident\nCancer/Specified Disease\nDental\nHospital Confinement Indemnity\nHospital Confinement Sickness Indemnity\nHospital Intensive Care\nLife\nLump Sum Cancer\nLump Sum Cancer Critical Illness\nSpecified Health Event\nShort Term Disability\nVision\nAflac also offers un-reimbursed medical, dependent day-care, and transportation flexible spending accounts. The company additionally offers human resources services for HIPAA and COBRA. From 1979 to 1997, the company owned several television stations, most of them in small and medium markets. It sold the broadcasting division (including flagship station WTVM) to what became Raycom Media in 1997.\nAflac is ranked 137th in the Fortune 500 list of largest United States corporations by revenue.\n\nCritics of cancer policies\nConsumer groups and some government officials say that cancer insurance returns fewer premium dollars to policyholders than standard insurance. A United States General Accounting Office study found that the policies paid back as little as 35% of premiums (Aflac said its cancer insurance paid back 62.4%). In comparison, New York State requires most major-medical policies to pay back 82% and group policies to pay back 75%. New York State does not allow stand-alone cancer policies.\nIn 1997, AFLAC spent $175,000 on lobbyists and campaign contributions to change the law. New York State lifted its ban in 1998 for purchasers who already have basic coverage. Consumer Reports recommended that policyholders use the money instead to buy lower-deductible insurance.\n\nThe Aflac Duck\nSince December 1999, the company's identity and brand has become more widely recognized in the United States as the result of TV commercials featuring the Aflac Duck, who quacks the company's name with frustration to unsuspecting prospective policy holders. The duck concept and all of the commercials to date have been created by Kaplan Thaler Group, an advertising agency based in New York City. Metzer Farms, a Gonzales, California waterfowl and gamebird hatchery, supplied them with the initial ducklings that each grew into the famous duck. Struggling to come up with a concept to make the big but relatively obscure insurance company's name memorable, one of the agency's art directors stumbled upon the duck idea while walking around Central Park at lunchtime uttering, \"Aflac, Aflac.\" He soon realized how much the company's name sounded like a duck's quack. The Aflac Duck character has now starred in more than 30 commercials. In many of these commercials, character actor Earl Billings also appears. The Aflac Duck is enshrined on Madison Avenue's Walk of Fame as one of America's Favorite Advertising Icons.\nFrom 2003 to 2006, when both NASCAR on NBC and NASCAR on TNT were scheduled to televise the second half of the Cup Series Season, they ran a 30-second segment in certain parts of each and every race they broadcast, called, \"The Aflac Trivia Quiz\". The segment would always begin when NASCAR on NBC-TNT Commentator/Cup Series Champion Benny Parsons would segue the topics he would be talking about by saying, \"Cue the Duck!\"\nCelebrities have starred in the Aflac ads, including Chevy Chase (2003); Yogi Berra; Yao Ming; future First Lady of the United States, Melania Trump (2005); NASCAR Cup Series driver Carl Edwards (2008–2014); the United States Olympic synchronized swimming team (2004); and Wayne Newton playing at Stardust Hotel and Casino for the 2003 commercial. The duck also appeared with Bugs Bunny, Daffy Duck, Wile E. Coyote and the Road Runner, and Rudolph the Red-Nosed Reindeer. In 2005, the company logo was changed to incorporate the duck. The first commercial using the new logo featured Gilbert Gottfried at a pet store because the duck kept saying, \"Aflac!\" and he had to trade in the duck for a parrot, saying, \"If you're hurt and can't work\".\nThe duck was originally voiced by comedian Gilbert Gottfried, who also voiced Digit on the PBS Kids series Cyberchase and Iago in the Disney film Aladdin. After 11 years as the voice of the Aflac duck, Gottfried was dismissed on March 14, 2011, due to jokes on Gottfried's Twitter account referencing the Tōhoku earthquake and tsunami. The company's chief marketing officer stated that \"Gilbert's recent comments about the crisis in Japan were lacking in humor, and certainly do not represent the thoughts and feelings of anyone at Aflac.\"\nOn March 23, 2011, Aflac announced that the company was taking applications for the new voice of the Aflac Duck through QuackAflac.com until April 1. Commercials requesting the submissions, first aired in 2006 but updated, resemble a silent movie. On April 26, 2011, it was announced that Daniel McKeague, a television advertising sales manager from Hugo, Minnesota, would be the new voice of the Aflac duck. The first Aflac commercial featuring the duck's new voice aired on May 1, 2011.\nIn 2017, an Aflac ad inserted an animated Aflac duck into the opening credits of the DuckTales reboot.\n\nCorporate philanthropy and social responsibility\nThe company states that through a partnership with Children's Healthcare of Atlanta, Aflac has contributed more than $100 million to childhood cancer research and treatment.\nAflac employees are formally involved in an array of charitable organizations such as Habitat for Humanity International, the Easter Seals, and the United Way.\nAflac's stated objectives include the decrease of its environmental impact, for which the company is into a partnership with the Clean Air Campaign to encourage employees to engage with greater frequency in alternate commuting methods.\n\nPartnership with Macy's\nStarting in 2001, Aflac and Macy's have partnered to sell the annual Aflac holiday plush duck in select Macy's stores nationwide. Net proceeds from each duck sold are donated to the participating children's cancer facility nearest to where it is purchased. Since 2001, more than $3 million has been raised from the sale of the ducks.\nAflac has participated in the Macy's Thanksgiving Day Parade from 2011 to 2019.\n\nAward programs\nAflac National High School Baseball Player of the Year, which was first presented in 2004.\nThe Jackie Robinson Award is given to the high-school player who is entering his senior year and who best displays character, leadership, and the values of being a student athlete in academics and community affairs. The award is presented at an annual All-American Awards banquet, which was first held in 2003. The banquet follows the annual All-American Baseball Classic, an East-West all-star game featuring the 38 best players from around the nation who are entering their senior year of high school. First held in 2003, the game is played at Petco Park, San Diego, California. Proceeds from the game and banquet are donated to Rady Children's Hospital in San Diego and its fight against childhood cancer.\nIn 2011, the name of the all-star game was changed to the Perfect Game All-American Classic.\n\nSee also\nList of United States insurance companies\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Aflac Incorporated:",
  "clean_text": "Aflac Incorporated (American Family Life Assurance Company) is an American insurance company and is the largest provider of supplemental insurance in the United States. It was founded in 1955 and is based in Columbus, Georgia. In the U.S., it underwrites a wide range of insurance policies, but is perhaps more known for its payroll deduction insurance coverage, which pays cash benefits when a policyholder has a covered accident or illness. The company states it \"provides financial protection to more than 50 million people worldwide\". In 2009, Aflac acquired Continental American Insurance Company for $100 million, enabling them to sell supplemental insurance on both the individual and group platforms. As of June 30, 2012, it was represented by approximately 19,300 sales agencies in Japan and 76,900 licensed sales associates in the U.S. History The company was founded by brothers John, Paul (died 2014), and William Amos in Columbus, Georgia, in 1955, as American Family Life Insurance Company of Columbus. In 1964, the company name was changed to American Family Life Assurance Company of Columbus. The company had an initial public offering in 1974 and was listed on the New York Stock Exchange. In 1990, the company adopted the Aflac acronym, although the official name of the underwriting subsidiary remains American Family Life Assurance Company of Columbus. Aflac announced the appointment of Frederick J. Crawford as Chief Financial Officer and Executive Vice President in June 2015. The company signed 6,426 policyholders in its first year. Aflac pioneered cancer insurance in 1958. Beginning in 1964, the company decided to focus sales on worksite settings, eventually through policies sponsored by employers and funded through payroll deductions. By 2003, more than 98% of Aflac policies in the United States were issued on a payroll deduction basis, making the company a leader in that approach to policy distribution. Business Aflac operates in the United States and Japan, and has its worldwide headquarters and corporate offices in an eighteen-story tower just east of Downtown Columbus, Georgia, in an area known as MidTown. The Aflac tower is the tallest building in the city. As of June 30, 2015, the corporation's total assets were more than $103 billion, and the company insured more than 50 million people worldwide. Aflac is the largest provider of guaranteed-renewable insurance in the United States and the largest insurance company overall in Japan, when measured by individual insurance policies in force. The company now offers several types of insurance policies in the United States, including the following: Accident Cancer/Specified Disease Dental Hospital Confinement Indemnity Hospital Confinement Sickness Indemnity Hospital Intensive Care Life Lump Sum Cancer Lump Sum Cancer Critical Illness Specified Health Event Short Term Disability Vision Aflac also offers un-reimbursed medical, dependent day-care, and transportation flexible spending accounts. The company additionally offers human resources services for HIPAA and COBRA. From 1979 to 1997, the company owned several television stations, most of them in small and medium markets. It sold the broadcasting division (including flagship station WTVM) to what became Raycom Media in 1997. Aflac is ranked 137th in the Fortune 500 list of largest United States corporations by revenue. Critics of cancer policies Consumer groups and some government officials say that cancer insurance returns fewer premium dollars to policyholders than standard insurance. A United States General Accounting Office study found that the policies paid back as little as 35% of premiums (Aflac said its cancer insurance paid back 62.4%). In comparison, New York State requires most major-medical policies to pay back 82% and group policies to pay back 75%. New York State does not allow stand-alone cancer policies. In 1997, AFLAC spent $175,000 on lobbyists and campaign contributions to change the law. New York State lifted its ban in 1998 for purchasers who already have basic coverage. Consumer Reports recommended that policyholders use the money instead to buy lower-deductible insurance. The Aflac Duck Since December 1999, the company's identity and brand has become more widely recognized in the United States as the result of TV commercials featuring the Aflac Duck, who quacks the company's name with frustration to unsuspecting prospective policy holders. The duck concept and all of the commercials to date have been created by Kaplan Thaler Group, an advertising agency based in New York City. Metzer Farms, a Gonzales, California waterfowl and gamebird hatchery, supplied them with the initial ducklings that each grew into the famous duck. Struggling to come up with a concept to make the big but relatively obscure insurance company's name memorable, one of the agency's art directors stumbled upon the duck idea while walking around Central Park at lunchtime uttering, \"Aflac, Aflac.\" He soon realized how much the company's name sounded like a duck's quack. The Aflac Duck character has now starred in more than 30 commercials. In many of these commercials, character actor Earl Billings also appears. The Aflac Duck is enshrined on Madison Avenue's Walk of Fame as one of America's Favorite Advertising Icons. From 2003 to 2006, when both NASCAR on NBC and NASCAR on TNT were scheduled to televise the second half of the Cup Series Season, they ran a 30-second segment in certain parts of each and every race they broadcast, called, \"The Aflac Trivia Quiz\". The segment would always begin when NASCAR on NBC-TNT Commentator/Cup Series Champion Benny Parsons would segue the topics he would be talking about by saying, \"Cue the Duck!\" Celebrities have starred in the Aflac ads, including Chevy Chase (2003); Yogi Berra; Yao Ming; future First Lady of the United States, Melania Trump (2005); NASCAR Cup Series driver Carl Edwards (2008–2014); the United States Olympic synchronized swimming team (2004); and Wayne Newton playing at Stardust Hotel and Casino for the 2003 commercial. The duck also appeared with Bugs Bunny, Daffy Duck, Wile E. Coyote and the Road Runner, and Rudolph the Red-Nosed Reindeer. In 2005, the company logo was changed to incorporate the duck. The first commercial using the new logo featured Gilbert Gottfried at a pet store because the duck kept saying, \"Aflac!\" and he had to trade in the duck for a parrot, saying, \"If you're hurt and can't work\". The duck was originally voiced by comedian Gilbert Gottfried, who also voiced Digit on the PBS Kids series Cyberchase and Iago in the Disney film Aladdin. After 11 years as the voice of the Aflac duck, Gottfried was dismissed on March 14, 2011, due to jokes on Gottfried's Twitter account referencing the Tōhoku earthquake and tsunami. The company's chief marketing officer stated that \"Gilbert's recent comments about the crisis in Japan were lacking in humor, and certainly do not represent the thoughts and feelings of anyone at Aflac.\" On March 23, 2011, Aflac announced that the company was taking applications for the new voice of the Aflac Duck through QuackAflac.com until April 1. Commercials requesting the submissions, first aired in 2006 but updated, resemble a silent movie. On April 26, 2011, it was announced that Daniel McKeague, a television advertising sales manager from Hugo, Minnesota, would be the new voice of the Aflac duck. The first Aflac commercial featuring the duck's new voice aired on May 1, 2011. In 2017, an Aflac ad inserted an animated Aflac duck into the opening credits of the DuckTales reboot. Corporate philanthropy and social responsibility The company states that through a partnership with Children's Healthcare of Atlanta, Aflac has contributed more than $100 million to childhood cancer research and treatment. Aflac employees are formally involved in an array of charitable organizations such as Habitat for Humanity International, the Easter Seals, and the United Way. Aflac's stated objectives include the decrease of its environmental impact, for which the company is into a partnership with the Clean Air Campaign to encourage employees to engage with greater frequency in alternate commuting methods. Partnership with Macy's Starting in 2001, Aflac and Macy's have partnered to sell the annual Aflac holiday plush duck in select Macy's stores nationwide. Net proceeds from each duck sold are donated to the participating children's cancer facility nearest to where it is purchased. Since 2001, more than $3 million has been raised from the sale of the ducks. Aflac has participated in the Macy's Thanksgiving Day Parade from 2011 to 2019. Award programs Aflac National High School Baseball Player of the Year, which was first presented in 2004. The Jackie Robinson Award is given to the high-school player who is entering his senior year and who best displays character, leadership, and the values of being a student athlete in academics and community affairs. The award is presented at an annual All-American Awards banquet, which was first held in 2003. The banquet follows the annual All-American Baseball Classic, an East-West all-star game featuring the 38 best players from around the nation who are entering their senior year of high school. First held in 2003, the game is played at Petco Park, San Diego, California. Proceeds from the game and banquet are donated to Rady Children's Hospital in San Diego and its fight against childhood cancer. In 2011, the name of the all-star game was changed to the Perfect Game All-American Classic."
}