{
  "ticker": "AIZ",
  "cik": "0001267238",
  "company_name": "Assurant",
  "corrected_name": "Assurant",
  "wiki_title_used": "Assurant",
  "exists": true,
  "raw_text": "Assurant, Inc. is a global provider of risk management products and services with headquarters in Atlanta. Its businesses provide a diverse set of specialty, niche-market insurance products in the property, casualty, extended device protection, and preneed insurance sectors. The company's main operating segments are Global Housing and Global Lifestyle.\nThe company, formerly known as Fortis, Inc., was spun off from Dutch and Belgian financial-services company Fortis Insurance N.V. in 2004. The company's initial public offering on Feb. 5, 2004 at $1.76 billion was the fourth largest that year. In connection with the public offering, the company changed its name to Assurant, Inc.\nAssurant is 325 on the Fortune 500 list of the largest companies in the United States by revenue as of 2022.\n\nHistory\nAssurant can trace its roots back to the founding of the La Crosse Mutual Aid Association, which was established to sell disability insurance in Wisconsin in the early 1890s. La Crosse Mutual Aid Association would later become the Time Insurance Company.\nIn 1978, N.V. AMEV of the Netherlands acquired the Time Insurance Company via its U.S. holding company AMEV Holdings, Inc. During the next 12 years, AMEV Holdings, Inc. would expand through acquisition, buying American Security Insurance (credit-related insurance); United Family (funeral insurance); Western Insurance Company (mutual funds); and Superior Insurance (auto insurance).\nIn 1990, N.V. AMEV of the Netherlands acquired VSB Groep NV bank to become the Netherlands first financial conglomerate combining an insurer and a bank, creating Fortis.\nIn 1991, AMEV acquired the group life, accident and health insurance of Mutual Benefit Life Insurance Company. AMEV Holdings, Inc. was rebranded Fortis, Inc. in 1991. Superior Insurance was sold in 1996. Fortis acquired John Alden in 1998 and American Bankers Insurance in 1999.\nFortis Inc. sold its life insurance to The Hartford in 2001. Fortis' American business was subsequently renamed as Assurant and spun off from the parent company in 2004.\nOn June 10, 2015, Assurant announced an exit from the health insurance marketplace to focus on housing and lifestyle specialty protection products and services, and would be winding down its Assurant Health business. In October 2015, Assurant announced it had completed the sale of Assurant Health's existing supplemental and self-funded business lines to National General Holdings Corporation. Assurant began to wind down its major medical operations and did not participate in the next Affordable Care Act open enrollment period beginning in November 2015. Assurant sold its HSA assets and other medical-account assets to SelectAccount in March 2016. In 2015 Assurant also announced it was exiting the employee benefits marketplace. Sun Life Financial agreed to acquire Assurant Employee Benefits for $940 million in September 2015, and closed the sale in March 2016.\n\nOperations\nAssurant operates two main segments:\n\nGlobal Housing, which offers lender-placed insurance, multi-family housing, and mortgage services.\nGlobal Lifestyle, which offers mobile device protection services and extended service contracts for consumer electronics and appliances, vehicle protection services, and credit and other insurance.\n\nAssurant Health policy claim denials and cancellations\nAssurant Health (now divested from Assurant) was repeatedly found to cancel health policies for some customers that had serious medical conditions, and 12 states criticized the firm for denying claims, with most of the states levying fines against Assurant. A number of individual cases have been reported.\nIn September 2009, the South Carolina Supreme Court upheld a lower court's verdict that the firm (then known as \"Fortis\") wrongly revoked the health insurance policy of a holder who had contracted HIV subsequent to getting an insurance policy, and ordered the firm to pay $10 million to the plaintiff. The court found that:\n\nPursuant to company policy in cases involving long-term disease, Fortis launched an investigation to determine whether [the plaintiff] had failed to disclose a pre-existing condition on his policy application...A Fortis investigator reviewed the records and discovered [an] erroneously-dated intake note in [the doctor’s] files. That information was then forwarded to [a] Fortis Senior Underwriter...for review. [The underwriter]...recommended that [the plaintiff’s] policy be rescinded on the grounds that he had misrepresented his HIV positive status.\nA Reuters report on the ruling stated that Fortis had a company policy to target every recently diagnosed HIV-positive policyholder for an automatic fraud investigation as a pretext to rescind their policy, according to undisclosed records. As in that case, their insurance policies often were canceled on incorrect information, flimsy evidence, or for no reason at all. In March 2010, the U.S. Supreme Court rejected the firm's appeal of the ruling.\nIn February 2010, a Boulder, Colorado jury found that Assurant Health had breached its contract with a woman who was severely injured in a hit-and-run accident, and awarded her $183,551 for medical bills and approximately $37.1 million in punitive damages. This was described as \"one of the largest bad-faith judgments in Colorado history\".\n\nReferences\nExternal links\nOfficial website\nBusiness data for Assurant, Inc.:",
  "clean_text": "Assurant, Inc. is a global provider of risk management products and services with headquarters in Atlanta. Its businesses provide a diverse set of specialty, niche-market insurance products in the property, casualty, extended device protection, and preneed insurance sectors. The company's main operating segments are Global Housing and Global Lifestyle. The company, formerly known as Fortis, Inc., was spun off from Dutch and Belgian financial-services company Fortis Insurance N.V. in 2004. The company's initial public offering on Feb. 5, 2004 at $1.76 billion was the fourth largest that year. In connection with the public offering, the company changed its name to Assurant, Inc. Assurant is 325 on the Fortune 500 list of the largest companies in the United States by revenue as of 2022. History Assurant can trace its roots back to the founding of the La Crosse Mutual Aid Association, which was established to sell disability insurance in Wisconsin in the early 1890s. La Crosse Mutual Aid Association would later become the Time Insurance Company. In 1978, N.V. AMEV of the Netherlands acquired the Time Insurance Company via its U.S. holding company AMEV Holdings, Inc. During the next 12 years, AMEV Holdings, Inc. would expand through acquisition, buying American Security Insurance (credit-related insurance); United Family (funeral insurance); Western Insurance Company (mutual funds); and Superior Insurance (auto insurance). In 1990, N.V. AMEV of the Netherlands acquired VSB Groep NV bank to become the Netherlands first financial conglomerate combining an insurer and a bank, creating Fortis. In 1991, AMEV acquired the group life, accident and health insurance of Mutual Benefit Life Insurance Company. AMEV Holdings, Inc. was rebranded Fortis, Inc. in 1991. Superior Insurance was sold in 1996. Fortis acquired John Alden in 1998 and American Bankers Insurance in 1999. Fortis Inc. sold its life insurance to The Hartford in 2001. Fortis' American business was subsequently renamed as Assurant and spun off from the parent company in 2004. On June 10, 2015, Assurant announced an exit from the health insurance marketplace to focus on housing and lifestyle specialty protection products and services, and would be winding down its Assurant Health business. In October 2015, Assurant announced it had completed the sale of Assurant Health's existing supplemental and self-funded business lines to National General Holdings Corporation. Assurant began to wind down its major medical operations and did not participate in the next Affordable Care Act open enrollment period beginning in November 2015. Assurant sold its HSA assets and other medical-account assets to SelectAccount in March 2016. In 2015 Assurant also announced it was exiting the employee benefits marketplace. Sun Life Financial agreed to acquire Assurant Employee Benefits for $940 million in September 2015, and closed the sale in March 2016. Operations Assurant operates two main segments: Global Housing, which offers lender-placed insurance, multi-family housing, and mortgage services. Global Lifestyle, which offers mobile device protection services and extended service contracts for consumer electronics and appliances, vehicle protection services, and credit and other insurance. Assurant Health policy claim denials and cancellations Assurant Health (now divested from Assurant) was repeatedly found to cancel health policies for some customers that had serious medical conditions, and 12 states criticized the firm for denying claims, with most of the states levying fines against Assurant. A number of individual cases have been reported. In September 2009, the South Carolina Supreme Court upheld a lower court's verdict that the firm (then known as \"Fortis\") wrongly revoked the health insurance policy of a holder who had contracted HIV subsequent to getting an insurance policy, and ordered the firm to pay $10 million to the plaintiff. The court found that: Pursuant to company policy in cases involving long-term disease, Fortis launched an investigation to determine whether [the plaintiff] had failed to disclose a pre-existing condition on his policy application...A Fortis investigator reviewed the records and discovered [an] erroneously-dated intake note in [the doctor’s] files. That information was then forwarded to [a] Fortis Senior Underwriter...for review. [The underwriter]...recommended that [the plaintiff’s] policy be rescinded on the grounds that he had misrepresented his HIV positive status. A Reuters report on the ruling stated that Fortis had a company policy to target every recently diagnosed HIV-positive policyholder for an automatic fraud investigation as a pretext to rescind their policy, according to undisclosed records. As in that case, their insurance policies often were canceled on incorrect information, flimsy evidence, or for no reason at all. In March 2010, the U.S. Supreme Court rejected the firm's appeal of the ruling. In February 2010, a Boulder, Colorado jury found that Assurant Health had breached its contract with a woman who was severely injured in a hit-and-run accident, and awarded her $183,551 for medical bills and approximately $37.1 million in punitive damages. This was described as \"one of the largest bad-faith judgments in Colorado history\"."
}