{
  "ticker": "AJG",
  "cik": "0000354190",
  "company_name": "Arthur J. Gallagher & Co.",
  "corrected_name": "Arthur J. Gallagher & Co.",
  "wiki_title_used": "Arthur J. Gallagher & Co.",
  "exists": true,
  "raw_text": "Arthur J. Gallagher & Co. (Gallagher) is an insurance brokerage and risk management services company based in Rolling Meadows, Illinois, a suburb of Chicago. The company provides insurance brokerage (86% of 2024 revenues) and risk management services (14% of 2024 revenues), which primarily includes processing of workers compensation and automobile insurance claims via the company's adjusters.\nThe company is ranked 367th on the Fortune 500 and 192nd on the Forbes Global 2000.\nFounded in 1927, the company ranks among the world's largest insurance brokers.\n\nHistory\nEarly years\nThe company that would become Gallagher was established in 1927 as an insurance agency by Arthur Gallagher in Chicago.\nIn 1938, Gallagher contributed to the development of The Hartford Group’s Retrospective Rating Program, a plan designed to provide financial incentives to policyholders who maintained lower loss records. He also authored what is noted as Chicago’s first large-deductible fire insurance policy, issued to Bowman Dairy Co. At the time, both initiatives were regarded as innovative within the insurance industry.\nAfter World War II, in 1945, Arthur Gallagher’s three sons—Jim, Bob, and John—joined the business.\nIn 1950, the company was formally incorporated, and each of the three sons was granted an equity stake in the firm.\n\n1980s-present\nDuring the 1980s and 1990s, the company faced significant competitive pressures within the crowded domestic insurance market in the United States.\nFrom 1990 through 2000, the company reported double-digit growth in all but three years, indicating a period of substantial expansion.\nIn 2000, Gallagher acquired 16 smaller insurance brokerages, which expanded its presence across the United States, eventually leading to operations in all 50 states.\nThe company began international expansion in 2002 with entry into India and Asia.\nOn February 17, 2010, Gallagher has acquired Securitas Re, a reinsurance brokerage firm based in São Paulo, Brazil, from Estater Gestão de Investimentos Ltda. The financial terms of the acquisition were not publicly disclosed. Following the acquisition, the Brazilian operation began conducting business internationally as Gallagher Brazil, operating as a licensed facultative reinsurance broker. The entity maintained a focus on the petrochemical, energy, and construction industries, providing property/casualty, surety, construction, and directors and officers (D&O) insurance coverages while also assisting Brazilian ceding companies in securing facultative reinsurance support.\nIn 2011, Gallagher established operations in Singapore.\nIn December 2013, the company purchased Norwegian specialty insurance broker Bergvall Marine AS.\nThe company expanded to Australia in 2014.\nIn July 2015, Gallagher was ranked third in Best's Review's listing of the world's largest brokerage firms.\nIn 2016, Gallagher acquired an 85% stake in Swedish specialist insurance and reinsurance broker Brim AB, with company statements indicating that Scandinavia represented a strategic area for development.\nOn August 18, 2017, Gallagher acquired Ballard Benefit Works, a Michigan-based employee benefits brokerage. Ballard Benefit Works was founded in 2009 by Justin Spewock and provides employee-benefit and healthcare finance brokerage services. The company offers consulting services to public, private, and Not-For-Profit clients, with primary operations in Michigan, Washington, D.C., and Florida. Following the acquisition, Spewock and his employees continued to operate the business under the leadership of John Neumaier, who serves as Gallagher's head of Great Lakes employee benefits consulting and brokerage operations.\nIn February 2020, Gallagher acquired Affiliated Benefit Consultants, Inc., a benefits consulting firm headquartered in Oak Brook, Illinois. Founded in 1986, Affiliated Benefit Consultants provided comprehensive employee benefits consulting services to clients across the United States. Financial terms of the transaction were not disclosed.\nOn September 26, 2020, Gallagher reported a ransomware incident affecting certain internal systems. In response to the security event, the company implemented precautionary measures including taking all global systems offline, initiating response protocols, launching an investigation, engaging external cybersecurity professionals, and activating business continuity plans to minimize disruption to customers. By September 28, 2020, the company indicated that it had restarted or was in the process of restarting most of its business systems. At that time, Gallagher stated that based on available information, it did not anticipate the incident would have a material impact on its business operations, financial condition, or overall performance.\nOn February 23, 2021, Gallagher was included in Ethisphere's list of World's Most Ethical Companies for the tenth consecutive year. The firm, which operates as an insurance brokerage, risk management, and consulting services company, was the only insurance broker among the honorees. The recognition was determined through Ethisphere's assessment process, which evaluates organizations based on culture, environmental and social practices, ethics and compliance activities, governance, diversity, and value chain initiatives.\nIn July 2022, Gallagher acquired Four Corners Group Inc., an executive search firm based in Toronto, Canada. Founded in 2007, Four Corners Group operated as an executive search practice serving clients across Canada and the United States in various industries including business services, technology, consumer goods, manufacturing, retail, supply chain, real estate, financial services, healthcare, and professional services sectors. Following the acquisition, Kelly Farrell and her team continued operations from their existing location under the supervision of Melanie Jeannotte, who served as CEO of Gallagher's Benefit and HR Consulting Division in Canada. J. Patrick Gallagher Jr., chairman and CEO of Gallagher, stated the acquisition would expand the company's global talent and leadership advisory services.\nIn April 2023, Gallagher acquired BCHR Holdings, L.P., operating as Buck, an organization specializing in human resources, pension, and employee benefits consulting services. The transaction, initially announced in December 2022 and valued at $660 million, represented Gallagher's largest acquisition in the human resources and benefits sector to that date. Buck maintained approximately 2,300 employees across operations in the United States, Canada, and the United Kingdom. Following the acquisition, Buck's operations were integrated under William F. Ziebell, who leads Gallagher's employee benefits consulting and brokerage division. The combined entity expanded capabilities in retirement services, benefits consulting, administration, and technology solutions.\nOn September 21, 2023, Gallagher acquired Eastern Insurance Group, LLC, a Massachusetts-based insurance provider that operates as a subsidiary of Eastern Bank. Eastern Insurance specializes in commercial property and casualty insurance, personal lines products, and employee benefits consulting services for clients across the Northeastern United States. Under the terms of the agreement, Gallagher agreed to purchase the assets of Eastern Insurance for $510 million, net of specified seller-funded expenses. Following the acquisition, Tim Lodge and the Eastern Insurance team were expected to remain at their current location under the leadership of Patrick Kennedy, who heads Gallagher's Northeast region retail property/casualty brokerage operations, and John Neumaier, who leads Gallagher's East region employee benefits consulting and brokerage operations.\nIn October 2023, Gallagher acquired Cadence Bank's insurance brokerage unit for $904 million, as announced on October 24, 2023. The transaction represented Cadence Bank's strategic move to narrow its business focus and redeploy capital toward its core banking operations.\nIn October 2025, Gallagher acquired Meadowbrook Insurance Agency, a retail insurance broker headquartered in Southfield, Michigan. The terms of the transaction were not disclosed. Meadowbrook Insurance Agency operated as a retail insurance broker providing property and casualty insurance and group benefits services to clients in Michigan and Florida. As part of the acquisition, Gallagher also acquired The Protection Center, an affiliated company also based in Michigan.\nIn August 2025, Gallagher acquired AssuredPartners, a U.S. insurance broker, for $13.45 billion ($12.45 billion net of tax benefits) in the largest sale of a U.S. insurance broker to a strategic acquirer in industry history.\n\nInternational business\nEurope\nSweden\nOn July 6, 2016, Gallagher acquired an 85% stake in Brim AB, a Stockholm-based specialty insurance and reinsurance brokerage firm. The transaction involved approximately $11 million in annualized revenue, with specific financial terms remaining undisclosed. Brim AB, established in 2001, operated as a specialist broker providing commercial property and casualty insurance, credit and political risk insurance, and affinity insurance products to Scandinavian and international clients. The company's credit and political risk division offered financing support for major infrastructure projects, while its construction practice served residential and commercial building development sectors.\n\nNorway\nOn December 17, 2013, Gallagher completed the acquisition of Bergvall Marine, an insurance brokerage firm based in Oslo, Norway. The transaction involved a company with annualized revenues of approximately $5 million, though other financial terms were not disclosed. Established in 1896, Bergvall Marine operated as a retail insurance broker specializing in marine insurance products and risk management services for international clients. The firm provided coverage solutions for ship owners and managers, offshore contractors, shipyards, and financial institutions, offering both standard insurance products and customized solutions.\n\nUnited Kingdom\nOn March 29, 2010, Gallagher announced an agreement to acquire substantially all of the insurance brokerage operations of FirstCity Partnership Ltd., a London-based firm. The transaction was anticipated to finalize during April 2010, with financial terms remaining undisclosed. FirstCity Partnership Ltd. operated as a Financial Services Authority (FSA) authorized Lloyd's insurance broker and advisory organization. The company specialized in providing insurance coverage for various sectors of the financial services industry, along with professional risk coverage, asset protection services, trade and political risk insurance, fine art specie coverage, and contingency and special risk solutions for international clients.\nOn September 5, 2023, Gallagher announced the acquisition of Lifesure Group Limited, a United Kingdom-based personal lines insurance broking service. The financial terms of the transaction were not disclosed. Lifesure primarily serves the vacation, holiday, and leisure industry, offering insurance products for park homes, motorhomes, caravans, and leisure homes. The acquisition also included Barnes Commercial, an affiliated company of Lifesure that provides insurance brokerage services to small and medium-sized businesses. Following the transaction, Paul Reid and his team joined Gallagher's UK & Ireland Retail division.\n\nOceania\nAustralia\nOn December 1, 2014, Gallagher announced the expansion of its brand presence in Australia through the rebranding of OAMPS Insurance Brokers, following its acquisition of the firm in June of the same year. The rebranded operation encompassed over 30 branches nationwide, employing approximately 1,000 staff to serve more than 120,000 clients, ranging from small businesses to multinational corporations. This integration leveraged Gallagher’s global infrastructure, which included operations in over 140 countries and a workforce exceeding 20,000 employees.\n\nNew Zealand\nOn December 18, 2015, Gallagher, through its New Zealand subsidiary Crombie Lockwood, acquired Reid Manson, an insurance brokerage based in the central region of the South Island. Founded in Timaru in 1985, Reid Manson operated offices in Timaru and Ashburton, providing insurance services for marine, aviation, rural, and livestock industries, as well as risk management solutions including risk identification, policy negotiation, and renewal management for commercial clients. The acquisition retained Reid Manson's nine employees, led by David Reid, under the oversight of Crombie Lockwood CEO Carl O'Shea. Financial terms were not disclosed. Crombie Lockwood, established as a two-person firm in Napier in 1978, had expanded to 24 locations nationwide through organic growth and acquisitions following its purchase by Gallagher in 2014. The integration of Reid Manson's offices brought Crombie Lockwood's South Island locations to nine.\n\nNorth America\nOn November 5, 2015, Gallagher announced the acquisition of Christie Phoenix (Victoria) Ltd. and its affiliate Discovery Insurance Services Ltd., both based in Victoria, British Columbia. The financial terms of the transaction were not disclosed. Christie Phoenix, established over forty years prior to the acquisition, operated as a retail insurance broker offering commercial property and casualty insurance as well as personal lines services to middle-market clients and individuals across British Columbia. The firm specialized in customized insurance programs for commercial real estate and provided small business insurance packages along with coverage for automobiles, homes, marine assets, and travel. Discovery Insurance Services, founded more than twenty years before the acquisition, provided insurance products across similar business categories.\nOn June 28, 2016, Gallagher announced that several Canadian brokerages operating under the Noraxis group would rebrand to Gallagher. Gallagher stated the rebranding from Noraxis was part of its strategy to become the leading insurance brokerage in Canada. The majority of Noraxis Capital Corp. was acquired by Gallagher from Roins Financial Services Ltd. in 2014. Roins Financial Services Ltd. is the owner of the RSA Canada group of companies. Brokerages included in the rebranding were CG&B Group Inc., Stevenson & Hunt, Amherst Commercial Insurance, Bell & Grant Insurance, Crain & Schooley Commercial Insurance, Fraser & Hoyt, Renfrew Insurance, and Ranger Insurance. Prior to this announcement, Gallagher had stated that Ranger, its prairie division, acquired B.R. Rhymer Insurance Agencies Ltd. of Winnipeg. This agreement transitioned Rhymer from a franchise arrangement to full ownership by Gallagher. Blaine Rhymer retired from the market following this acquisition.\n\nSouth America\nBrazil\nOn December 29, 2022, Gallagher announced the acquisition of Interbrok Group, a retail insurance brokerage firm based in São Paulo, Brazil. The purchase price was not disclosed. Interbrok Group, established in 1976, provides commercial and personal insurance products and services to clients across Brazil. J. Patrick Gallagher, Jr., stated that Interbrok Group would contribute to expanding the company's presence in Brazil. He also expressed welcome to the Interbrok team joining Gallagher.\n\nIn media\nRobert E. Gallagher and Alison Kittrell, The Gallagher Way, released jointly by Marketing Counsel and iUniverse in 2005.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Arthur J. Gallagher & Co.:",
  "clean_text": "Arthur J. Gallagher & Co. (Gallagher) is an insurance brokerage and risk management services company based in Rolling Meadows, Illinois, a suburb of Chicago. The company provides insurance brokerage (86% of 2024 revenues) and risk management services (14% of 2024 revenues), which primarily includes processing of workers compensation and automobile insurance claims via the company's adjusters. The company is ranked 367th on the Fortune 500 and 192nd on the Forbes Global 2000. Founded in 1927, the company ranks among the world's largest insurance brokers. History Early years The company that would become Gallagher was established in 1927 as an insurance agency by Arthur Gallagher in Chicago. In 1938, Gallagher contributed to the development of The Hartford Group’s Retrospective Rating Program, a plan designed to provide financial incentives to policyholders who maintained lower loss records. He also authored what is noted as Chicago’s first large-deductible fire insurance policy, issued to Bowman Dairy Co. At the time, both initiatives were regarded as innovative within the insurance industry. After World War II, in 1945, Arthur Gallagher’s three sons—Jim, Bob, and John—joined the business. In 1950, the company was formally incorporated, and each of the three sons was granted an equity stake in the firm. 1980s-present During the 1980s and 1990s, the company faced significant competitive pressures within the crowded domestic insurance market in the United States. From 1990 through 2000, the company reported double-digit growth in all but three years, indicating a period of substantial expansion. In 2000, Gallagher acquired 16 smaller insurance brokerages, which expanded its presence across the United States, eventually leading to operations in all 50 states. The company began international expansion in 2002 with entry into India and Asia. On February 17, 2010, Gallagher has acquired Securitas Re, a reinsurance brokerage firm based in São Paulo, Brazil, from Estater Gestão de Investimentos Ltda. The financial terms of the acquisition were not publicly disclosed. Following the acquisition, the Brazilian operation began conducting business internationally as Gallagher Brazil, operating as a licensed facultative reinsurance broker. The entity maintained a focus on the petrochemical, energy, and construction industries, providing property/casualty, surety, construction, and directors and officers (D&O) insurance coverages while also assisting Brazilian ceding companies in securing facultative reinsurance support. In 2011, Gallagher established operations in Singapore. In December 2013, the company purchased Norwegian specialty insurance broker Bergvall Marine AS. The company expanded to Australia in 2014. In July 2015, Gallagher was ranked third in Best's Review's listing of the world's largest brokerage firms. In 2016, Gallagher acquired an 85% stake in Swedish specialist insurance and reinsurance broker Brim AB, with company statements indicating that Scandinavia represented a strategic area for development. On August 18, 2017, Gallagher acquired Ballard Benefit Works, a Michigan-based employee benefits brokerage. Ballard Benefit Works was founded in 2009 by Justin Spewock and provides employee-benefit and healthcare finance brokerage services. The company offers consulting services to public, private, and Not-For-Profit clients, with primary operations in Michigan, Washington, D.C., and Florida. Following the acquisition, Spewock and his employees continued to operate the business under the leadership of John Neumaier, who serves as Gallagher's head of Great Lakes employee benefits consulting and brokerage operations. In February 2020, Gallagher acquired Affiliated Benefit Consultants, Inc., a benefits consulting firm headquartered in Oak Brook, Illinois. Founded in 1986, Affiliated Benefit Consultants provided comprehensive employee benefits consulting services to clients across the United States. Financial terms of the transaction were not disclosed. On September 26, 2020, Gallagher reported a ransomware incident affecting certain internal systems. In response to the security event, the company implemented precautionary measures including taking all global systems offline, initiating response protocols, launching an investigation, engaging external cybersecurity professionals, and activating business continuity plans to minimize disruption to customers. By September 28, 2020, the company indicated that it had restarted or was in the process of restarting most of its business systems. At that time, Gallagher stated that based on available information, it did not anticipate the incident would have a material impact on its business operations, financial condition, or overall performance. On February 23, 2021, Gallagher was included in Ethisphere's list of World's Most Ethical Companies for the tenth consecutive year. The firm, which operates as an insurance brokerage, risk management, and consulting services company, was the only insurance broker among the honorees. The recognition was determined through Ethisphere's assessment process, which evaluates organizations based on culture, environmental and social practices, ethics and compliance activities, governance, diversity, and value chain initiatives. In July 2022, Gallagher acquired Four Corners Group Inc., an executive search firm based in Toronto, Canada. Founded in 2007, Four Corners Group operated as an executive search practice serving clients across Canada and the United States in various industries including business services, technology, consumer goods, manufacturing, retail, supply chain, real estate, financial services, healthcare, and professional services sectors. Following the acquisition, Kelly Farrell and her team continued operations from their existing location under the supervision of Melanie Jeannotte, who served as CEO of Gallagher's Benefit and HR Consulting Division in Canada. J. Patrick Gallagher Jr., chairman and CEO of Gallagher, stated the acquisition would expand the company's global talent and leadership advisory services. In April 2023, Gallagher acquired BCHR Holdings, L.P., operating as Buck, an organization specializing in human resources, pension, and employee benefits consulting services. The transaction, initially announced in December 2022 and valued at $660 million, represented Gallagher's largest acquisition in the human resources and benefits sector to that date. Buck maintained approximately 2,300 employees across operations in the United States, Canada, and the United Kingdom. Following the acquisition, Buck's operations were integrated under William F. Ziebell, who leads Gallagher's employee benefits consulting and brokerage division. The combined entity expanded capabilities in retirement services, benefits consulting, administration, and technology solutions. On September 21, 2023, Gallagher acquired Eastern Insurance Group, LLC, a Massachusetts-based insurance provider that operates as a subsidiary of Eastern Bank. Eastern Insurance specializes in commercial property and casualty insurance, personal lines products, and employee benefits consulting services for clients across the Northeastern United States. Under the terms of the agreement, Gallagher agreed to purchase the assets of Eastern Insurance for $510 million, net of specified seller-funded expenses. Following the acquisition, Tim Lodge and the Eastern Insurance team were expected to remain at their current location under the leadership of Patrick Kennedy, who heads Gallagher's Northeast region retail property/casualty brokerage operations, and John Neumaier, who leads Gallagher's East region employee benefits consulting and brokerage operations. In October 2023, Gallagher acquired Cadence Bank's insurance brokerage unit for $904 million, as announced on October 24, 2023. The transaction represented Cadence Bank's strategic move to narrow its business focus and redeploy capital toward its core banking operations. In October 2025, Gallagher acquired Meadowbrook Insurance Agency, a retail insurance broker headquartered in Southfield, Michigan. The terms of the transaction were not disclosed. Meadowbrook Insurance Agency operated as a retail insurance broker providing property and casualty insurance and group benefits services to clients in Michigan and Florida. As part of the acquisition, Gallagher also acquired The Protection Center, an affiliated company also based in Michigan. In August 2025, Gallagher acquired AssuredPartners, a U.S. insurance broker, for $13.45 billion ($12.45 billion net of tax benefits) in the largest sale of a U.S. insurance broker to a strategic acquirer in industry history. International business Europe Sweden On July 6, 2016, Gallagher acquired an 85% stake in Brim AB, a Stockholm-based specialty insurance and reinsurance brokerage firm. The transaction involved approximately $11 million in annualized revenue, with specific financial terms remaining undisclosed. Brim AB, established in 2001, operated as a specialist broker providing commercial property and casualty insurance, credit and political risk insurance, and affinity insurance products to Scandinavian and international clients. The company's credit and political risk division offered financing support for major infrastructure projects, while its construction practice served residential and commercial building development sectors. Norway On December 17, 2013, Gallagher completed the acquisition of Bergvall Marine, an insurance brokerage firm based in Oslo, Norway. The transaction involved a company with annualized revenues of approximately $5 million, though other financial terms were not disclosed. Established in 1896, Bergvall Marine operated as a retail insurance broker specializing in marine insurance products and risk management services for international clients. The firm provided coverage solutions for ship owners and managers, offshore contractors, shipyards, and financial institutions, offering both standard insurance products and customized solutions. United Kingdom On March 29, 2010, Gallagher announced an agreement to acquire substantially all of the insurance brokerage operations of FirstCity Partnership Ltd., a London-based firm. The transaction was anticipated to finalize during April 2010, with financial terms remaining undisclosed. FirstCity Partnership Ltd. operated as a Financial Services Authority (FSA) authorized Lloyd's insurance broker and advisory organization. The company specialized in providing insurance coverage for various sectors of the financial services industry, along with professional risk coverage, asset protection services, trade and political risk insurance, fine art specie coverage, and contingency and special risk solutions for international clients. On September 5, 2023, Gallagher announced the acquisition of Lifesure Group Limited, a United Kingdom-based personal lines insurance broking service. The financial terms of the transaction were not disclosed. Lifesure primarily serves the vacation, holiday, and leisure industry, offering insurance products for park homes, motorhomes, caravans, and leisure homes. The acquisition also included Barnes Commercial, an affiliated company of Lifesure that provides insurance brokerage services to small and medium-sized businesses. Following the transaction, Paul Reid and his team joined Gallagher's UK & Ireland Retail division. Oceania Australia On December 1, 2014, Gallagher announced the expansion of its brand presence in Australia through the rebranding of OAMPS Insurance Brokers, following its acquisition of the firm in June of the same year. The rebranded operation encompassed over 30 branches nationwide, employing approximately 1,000 staff to serve more than 120,000 clients, ranging from small businesses to multinational corporations. This integration leveraged Gallagher’s global infrastructure, which included operations in over 140 countries and a workforce exceeding 20,000 employees. New Zealand On December 18, 2015, Gallagher, through its New Zealand subsidiary Crombie Lockwood, acquired Reid Manson, an insurance brokerage based in the central region of the South Island. Founded in Timaru in 1985, Reid Manson operated offices in Timaru and Ashburton, providing insurance services for marine, aviation, rural, and livestock industries, as well as risk management solutions including risk identification, policy negotiation, and renewal management for commercial clients. The acquisition retained Reid Manson's nine employees, led by David Reid, under the oversight of Crombie Lockwood CEO Carl O'Shea. Financial terms were not disclosed. Crombie Lockwood, established as a two-person firm in Napier in 1978, had expanded to 24 locations nationwide through organic growth and acquisitions following its purchase by Gallagher in 2014. The integration of Reid Manson's offices brought Crombie Lockwood's South Island locations to nine. North America On November 5, 2015, Gallagher announced the acquisition of Christie Phoenix (Victoria) Ltd. and its affiliate Discovery Insurance Services Ltd., both based in Victoria, British Columbia. The financial terms of the transaction were not disclosed. Christie Phoenix, established over forty years prior to the acquisition, operated as a retail insurance broker offering commercial property and casualty insurance as well as personal lines services to middle-market clients and individuals across British Columbia. The firm specialized in customized insurance programs for commercial real estate and provided small business insurance packages along with coverage for automobiles, homes, marine assets, and travel. Discovery Insurance Services, founded more than twenty years before the acquisition, provided insurance products across similar business categories. On June 28, 2016, Gallagher announced that several Canadian brokerages operating under the Noraxis group would rebrand to Gallagher. Gallagher stated the rebranding from Noraxis was part of its strategy to become the leading insurance brokerage in Canada. The majority of Noraxis Capital Corp. was acquired by Gallagher from Roins Financial Services Ltd. in 2014. Roins Financial Services Ltd. is the owner of the RSA Canada group of companies. Brokerages included in the rebranding were CG&B Group Inc., Stevenson & Hunt, Amherst Commercial Insurance, Bell & Grant Insurance, Crain & Schooley Commercial Insurance, Fraser & Hoyt, Renfrew Insurance, and Ranger Insurance. Prior to this announcement, Gallagher had stated that Ranger, its prairie division, acquired B.R. Rhymer Insurance Agencies Ltd. of Winnipeg. This agreement transitioned Rhymer from a franchise arrangement to full ownership by Gallagher. Blaine Rhymer retired from the market following this acquisition. South America Brazil On December 29, 2022, Gallagher announced the acquisition of Interbrok Group, a retail insurance brokerage firm based in São Paulo, Brazil. The purchase price was not disclosed. Interbrok Group, established in 1976, provides commercial and personal insurance products and services to clients across Brazil. J. Patrick Gallagher, Jr., stated that Interbrok Group would contribute to expanding the company's presence in Brazil. He also expressed welcome to the Interbrok team joining Gallagher. In media Robert E. Gallagher and Alison Kittrell, The Gallagher Way, released jointly by Marketing Counsel and iUniverse in 2005."
}