{
  "ticker": "ALB",
  "cik": "0000915913",
  "company_name": "Albemarle Corporation",
  "corrected_name": "Albemarle Corporation",
  "wiki_title_used": "Albemarle Corporation",
  "exists": true,
  "raw_text": "Albemarle Corporation is an American specialty chemicals manufacturing company based in Charlotte, North Carolina. It serves several different industries including Agriculture/Food, Automotive/EV, Aviation/Aerospace, Building/Construction, Conventional Energy, Electronics, Grid Storage, and Industrial Processes. The company reported over $5.4 Billion in revenue in 2024.\nAs of April 2025, Albemarle was the fourth highest grossing producer of Lithium, falling behind Rio Tinto, Sociedad Química y Minera, and Ganfeng Lithium.\nAlbemarle is a large developer of flame retardant chemicals technologies, with production plants in the United States, China, the Netherlands, Belgium, Germany, France, Austria, and the United Kingdom. It also has a line of antioxidants and blends which concentrate on improving storage life and stability of fuel and other lubricant products. It produces products used in rigid and flexible polyurethane foam applications and ammonium polyphosphate products, pigments for paper applications, aluminium oxides used for flame-retardant, polishing, catalyst, and niche ceramic applications, as well as magnesium hydroxide mainly used as a flame-retardant. It is one of the largest producers of hydro processing catalysts (HPC) and fluid catalytic cracking (FCC) catalysts used in the petroleum refining industry. Production locations (excluding joint ventures in Brazil and Japan) are: Bayport, Texas and Amsterdam, Netherlands. Albemarle also produces fine chemicals and chemical services for the pharmaceutical and life sciences industries. The Alternative Fuel Technologies division participates in the market for biofuels, gas to liquids, and coal liquefaction.\nThe company is ranked 412 on the Fortune 500as of March 2024.\n\nHistory\nIn February 1994, Ethyl Corporation completed the corporate spin-off of its chemical businesses to form Albemarle Corporation. Albemarle was headquartered in Richmond, Virginia, until 2008 when it announced plans to move its corporate headquarters to Baton Rouge, Louisiana.\nIn July 1994, the company acquired the Asano Corporation, a sales and marketing company headquartered in Tokyo, Japan.\nIn 1998, the company bought a custom manufacturing and oilfield chemicals plant in Teesport, England. Also in 1998, a joint venture was signed by the company, Jordan Dead Sea Industries Company, and Arab Potash.\nIn January 2000, the company acquired Ferro Corporation's PYRO-CHEK flame retardant business.\nIn June 2000, the company formed a joint venture with Jinhai Chemical and Industry Company, based in China.\nIn August 2000, the company launched PolymerAdditives.com, a business-to-business internet joint venture with Cytec Industries and General Electric to provide materials faster and more efficiently directly from trusted suppliers.\nIn 2001, it acquired Martinswerk GmbH, which it sold in 2016. It also acquired the custom and fine chemicals businesses of ChemFirst Inc. for $74 million.\nIn 2003, it acquired the fuel and lubricant antioxidants business of Ethyl Corporation. It also acquired the phosphorus-based polyurethane flame retardants businesses of Rhodia. It also acquired the bromine fine chemicals business of Atofina S.A.\nIn January 2004, the company acquired Asian flame retardants distributor Taerim International based in Seoul, South Korea.\nIn July 2004, Albemarle acquired the refinery catalysts platform from AkzoNobel, with sites and/or joint ventures in the Netherlands, Houston, France, Brazil, Japan and Singapore, for €615.7 million.\nIn 2006, in partnership with UOP, a subsidiary of Honeywell, Albemarle created the Hydroprocessing Alliance to deliver integrated refinery solutions and hydroprocessing technologies and catalysts to the refining industry. The partnership was ended in 2016.\nIn May 2007, Albemarle opened a regional sales office in Dubai to meet growing market needs in India and the Middle East.\nIn 2008, Albemarle and Sinobrom, a marketer of bromine derivatives in China, formed Sinobrom Albemarle Bromine Chemicals (Shandong) Company Ltd., a bromine-related joint venture.\nIn 2008, Albemarle acquired Sorbent Technologies Corporation, whose technology controls mercury emissions from coal-fired power plants, for $22.5 million.\nIn 2009, Albemarle and TAYF, an affiliate of SABIC, created a catalysts joint venture to build a world-scale organometallics production facility in Jubail.\nIn January 2012, Albemarle expanded its production capabilities for finished polyolefin catalysts in Baton Rouge.\nAlbemarle also expanded its South Haven API production site and upgraded its multi-product cGMP active pharmaceutical ingredient (API) manufacturing facility.\nIn September 2012, Albemarle was one of the three chemical companies that backed the Citizens for Fire Safety industry group that lobbied for use of flame retardant in consumer products including furniture and baby products.\nIn 2014, Albemarle completed the sale of its antioxidant, ibuprofen and propofol businesses to SI Group.\nIn January 2015, Albemarle acquired Rockwood Holdings for $6.2 billion in stock. Albemarle then announced it would realign its global business units: Chemetall Surface Treatment, Refining Solutions and Performance Chemicals.\nIn August 2015, the company announced the relocation of its headquarters from Baton Rouge, Louisiana to Charlotte, North Carolina.\nIn October 2015, Albemarle announced the separation of the bromine and lithium businesses, previously together under Performance Chemicals.\nIn December 2016, the company sold the Chemetall Surface Treatment business to BASF for $3.2 billion.\nIn January 2017, the company acquired the Jiangli New Materials Science and Technology Co. lithium business for $145 million.\nIn October 2019, the company formed a lithium joint venture with Mineral Resources.\nIn June, 2021, Albermarle completed the sale of its Fine Chemistry Services (FCS) business to W. R. Grace & Co. for approximately $570 million. This sale included Albemarle's operations in Tyrone, Pennsylvania and South Haven, Michigan.\n\nOperations\nSalar De Atacama, Chile\nChile is one of the world’s highest Lithium producing countries. Annually, the country produces approximately 49,000 metric tons of lithium, which is the second highest globally only falling behind Australia. The production of Lithium in the Salt Flats of Chile has increased steadily since 2020, rising about 127%. The most common method of extraction is that of accessing lithium brine deposits. In April of 2023 there were plans by the Chilean government to nationalize the lithium industry, and to gain controlling stakes in the industry through a state-owned mining company called Codelco.\nAlbemarle has a mine in this area which extracts lithium from lithium brine deposits. The process of doing this includes pumping the core of the Salar de Atacama, extracting this lithium-rich brine, and moving it to wells where it can then evaporate in the sun, until the lithium concentrations reach approximately 6%. This concentrated brine is then moved by cistern trucks to a plant owned by Albemarle in Antofagasta where it is converted chemically into usable forms of lithium. These forms include technical and battery grade lithium chloride and lithium carbonate.\nThere are several important environmental impacts that lithium mining in the Salar de Atacama has. The first of these being the fact that the Salar de Atacama only receives about 15mm of water per year. The process of brine extraction especially, depletes water in desert, wetland, and altiplano ecosystems, all of which are present in the Salar de Atacama. The depletion of water reserves in the area could have the capacity to degrade habitats of animals including three types of flamingos, migratory water birds, lizards, bats, foxes, and many species of rodents. Additionally, the water-intensive process of brine extraction has been known to degrade surface vegetation, and to elevate daytime surface temperatures, as well as lower moisture levels in soil.\nThe small scale subsistence farmers who have lived in this region for far longer than the foreign lithium extraction business has been present are facing several environmental injustices because of the industry . In San Pedro de Atacama specifically, many houses have raised black flags outside of their homes to indicate the fact that they are mourning the many changes made in the area without their consent. However, because of the lack of water caused by brine extraction, the community’s crops are failing. Additionally, livestock are getting ill. This is because of the lack of water in the area as a result of the brine extraction process.\nShould this continue, then the traditional ways of life of people in this area may disappear, according to locals from San Pedro de Atacama who claim that this is a major concern of theirs They have explained that \"We could very easily disappear. That's everybody's fear, I think, that we cease to exist, that we disappear entirely as a culture”, one local said in an interview with NPR. Additionally, the Chilean government plans to expand the lithium mining business until the year 2060. \nAlbemarle processes the lithium in the industrial complex of La Negra near the coast and 27 km southeast of the port city of Antofagasta.\n\nSilver Peak, Nevada\nAlbemarle’s Silver Peak Lithium extraction site in Silver Peak, Nevada acts as the United States’ only active Lithium resource. The site began operations approximately 50 years ago and currently employs 60 people in order to produce technical grade lithium carbonate and lithium hydroxide. Similarly to their site in Chile, Albemarle utilizes brine extraction to obtain lithium in the area. This process involves pumping of aquifers between 300 and 2000 ft. below the surface, allowing brine water to evaporate until its lithium concentration is high enough. Once the concentration is high enough the lithium will be refined at separate sites.\nSilver Peak Nevada is home to many different species of plants and animals, who inhabit a wide range of habitats. These include alluvial plains, canyons, dense pinion and juniper woodlands. Other plant species include greasewood, low saltbush vegetation, and low sage brush communities. There are many large animal species present, including mule deer, bighorn sheep, raptor species like the burrowing owl and golden eagle, and rodents. Lithium mining threatens over 2,000 acres of nesting sites for various species, while also encroaching on the habitat of the federally protected Tiehm’s buckwheat wildflower, an endangered wildflower that evolved to survive on inhospitable lithium-boron rich soil.  \nThe Biden administration’s focus on transitioning from carbon-based energies provides subsidies for lithium extraction companies, which has led to the construction of the Silver Peak lithium mine. However, this initiative poses no limits on water consumption of lithium mining corporations, and very few restrictions on mining practices. Like the Chilean Salt Flats, Silver Peak is an area that receives very little rainfall during the year and is incredibly dry. The area only receives about 4.45 inches of precipitation per year which is substantially less than other, more temperate states such as Pennsylvania which receives an average of over 41.53 inches of precipitation per year. In fact, Nevada is the driest state in America. Albemarle’s lithium extraction site utilizes over 4 billion gallons of water per year in order to meet its quota. The depletion of water has important environmental justice implications. Many people in this area are dependent on water resources to farm and raise cattle. The depletion of water, similarly to the Salar de Atacama, can erase traditional ways of life for people, endangering livelihoods and threatening the preservation of people’s cultures as a whole. “The community needs the water,” said a county commissioner from the area, “They don’t need to take away from our area to be able to produce green energy. We should be able to survive .”\n\nKing's Mountain, North Carolina\nCurrently there are plans in place by Albemarle to reopen a previously existing mine located in King’s Mountain, North Carolina. This area is a well-known Lithium resource and represents one of the few hard rock lithium deposits in the United States. It is part of the Carolina Tin-Spodumene belt within the Inner Piedmont terrane. It is believed to contain one of the largest hard-rock lithium resources on the planet. Hard rock deposits of lithium often can be mined in a more cost-effective manner since extraction is less labor intensive than salt flats or brine pools. Currently, Albemarle is seeking permission to reopen and expand the existing site. The initial permit application would allow the site to become active for a further 10 years.\nCommunity members in King’s Mountain have argued against reopening the mine because of several issues resulting from lithium mining’s legacy there. Previously, the mine was operated from the 1950’s until the 1980’s and this history has resulted in elevated levels of pollutants that are uncommon, and as such are not federally regulated. This includes lithium. However, the history of lithium extraction processes in this area have also resulted in elevated levels of both cesium and rubidium. It is estimated that the resurgence of lithium extraction in the area could increase the presence of these metals in drinking water systems. These metals, cesium and rubidium can cause skin irritation, as well as can become toxic if ingested in large quantities.\nThere are already certain adverse effects caused by Albemarle’s lithium extraction in the area where the proposed mine is located. In Cleveland County, near King’s Mountain, Albemarle has begun to drain the old mine to reopen it, which has caused a process called turnover to occur. Turnover is the process by which surface water is cooled by the air, and then water sinks because it is denser. This causes the displacement of water at the bottom of the lake in which there are decomposed materials from historic lithium mining in the area. This causes the release of hydrogen sulfide gas into the air which results in a foul smell  locals have been complaining about [54]. One local even said of the smell, “I’ve been around marshes and the beaches my whole life, all over, and never smelt the strength of this odor anywhere .” \nThe area in which this mine is being proposed is home to many different examples of wildlife which include white-tail deer, birds, frogs, as well as opossums, raccoons, bats, and other nocturnal creatures. There are over 542 species of plants that are present in the area as well. Lithium mining in the area has several concerns with the environment including the pollution of air and water which can endanger the health of animals, and degrade soil making it inhabitable for native plant species. As well as this, lithium mining can destroy habitats for wildlife, or erode healthy soil.\n\nLawsuits and settlements\nExploitation of aquifers in Atacama Desert\nStarting in 2022 indigenous Atacameño people sued Albemarle, Minera Escondida and Minera Zaldívar over damages to the Monturaqui-Negrillar-Tilopozo Aquifer. The lawsuit was joined by the Chilean state's Consejo de Defensa del Estado. Minera Escondida argued for its part that any effects of its water extraction have not had time to manifest downstream at the observation sites, due to the slow movement of groundwater, and hence that it was the extraction of the other two companies that had impacted it. In its defense Albemarle asserted that its extracts only surface water from a spring and that its use is minimal compared to the other companies. The lawsuit ended in December 2024 in a conciliation agreement in which Albemarle and the other two companies were to compensate for damages to the meadows of Tilopozo and the lakes of La Punta and La Brava. Also, the companies were to compensate economically, socially and environmentally the indigenous community Comunidad de Peine.\n\nSeptember 2023 Securities and Exchange Commission FCPA Violation\nIn September of 2023, the Albemarle corporation agreed to pay over $103.6 million to the Security and Exchange commission due to the fact that it violated anti-bribery, recordkeeping, and internal accounting controls provisions. These boundaries were laid out in Foreign Corrupt Policies Act. The specifics of these violations included actions such as using agents from at least 2009 through 2017 to pay bribes to obtain sales of refinery catalysts to public-sector oil refineries in Vietnam, India, and Indonesia and to private-sector oil refineries in India. The Commission found that Albemarle also failed to devise and maintain a sufficient system of internal accounting controls to provide reasonable assurances that payments made to agents in Vietnam, Indonesia, India, China, and the United Arab Emirates were for legitimate services. According to Charles Cain, the Chief of the SEC’s enforcement division, “Despite repeated and glaring bribery-related red flags, Albemarle failed for many years to implement sufficient internal accounting controls relevant to the use of agents by its global refining solutions business to make sales to state-owned customers around the world. This failure set the stage for wide-ranging misconduct.” \nThe United States Department of Justice also announced on September 29, 2023 that it had entered into a non-prosecution agreement with Albemarle. Under this agreement, Albemarle would pay a criminal fine of $99 million, and the company would pay a forfeiture of approximately $98 million. $81.8 million of this would be satisfied by Albemarle’s payment to the Security and Exchange Commission.\nThe agreement to pay these fines was made by Albemarle. The payments were consented to and the violations made by Albemarle were agreed upon. The corporation did not deny these violations had been committed.\n\nEPA Environmental Violations\nSince 2000, the Albemarle Corporation has paid a large sum of money to the EPA for violations related to several environmental concerns. These concerns either pose issues for people in the areas of Albemarle’s operations, the wildlife in the area, or to their own workers. In total Albemarle has paid $1,037,728 for 27 total various environment-related violations. These include violations to the National Emission Standard for hazardous air pollutants, inventory update violations, Emergency Planning and Community Right to Know violations relating to reporting requirements, Clean Air Act violations related to stratospheric ozone protection, and FIFRA violations including those related to microbial concerns. In addition to such violations, the company has been fined for damage to water quality, air quality, improper disposal of hazardous waste, workplace safety and health concerns, and railroad safety concerns.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Albemarle Corporation:",
  "clean_text": "Albemarle Corporation is an American specialty chemicals manufacturing company based in Charlotte, North Carolina. It serves several different industries including Agriculture/Food, Automotive/EV, Aviation/Aerospace, Building/Construction, Conventional Energy, Electronics, Grid Storage, and Industrial Processes. The company reported over $5.4 Billion in revenue in 2024. As of April 2025, Albemarle was the fourth highest grossing producer of Lithium, falling behind Rio Tinto, Sociedad Química y Minera, and Ganfeng Lithium. Albemarle is a large developer of flame retardant chemicals technologies, with production plants in the United States, China, the Netherlands, Belgium, Germany, France, Austria, and the United Kingdom. It also has a line of antioxidants and blends which concentrate on improving storage life and stability of fuel and other lubricant products. It produces products used in rigid and flexible polyurethane foam applications and ammonium polyphosphate products, pigments for paper applications, aluminium oxides used for flame-retardant, polishing, catalyst, and niche ceramic applications, as well as magnesium hydroxide mainly used as a flame-retardant. It is one of the largest producers of hydro processing catalysts (HPC) and fluid catalytic cracking (FCC) catalysts used in the petroleum refining industry. Production locations (excluding joint ventures in Brazil and Japan) are: Bayport, Texas and Amsterdam, Netherlands. Albemarle also produces fine chemicals and chemical services for the pharmaceutical and life sciences industries. The Alternative Fuel Technologies division participates in the market for biofuels, gas to liquids, and coal liquefaction. The company is ranked 412 on the Fortune 500as of March 2024. History In February 1994, Ethyl Corporation completed the corporate spin-off of its chemical businesses to form Albemarle Corporation. Albemarle was headquartered in Richmond, Virginia, until 2008 when it announced plans to move its corporate headquarters to Baton Rouge, Louisiana. In July 1994, the company acquired the Asano Corporation, a sales and marketing company headquartered in Tokyo, Japan. In 1998, the company bought a custom manufacturing and oilfield chemicals plant in Teesport, England. Also in 1998, a joint venture was signed by the company, Jordan Dead Sea Industries Company, and Arab Potash. In January 2000, the company acquired Ferro Corporation's PYRO-CHEK flame retardant business. In June 2000, the company formed a joint venture with Jinhai Chemical and Industry Company, based in China. In August 2000, the company launched PolymerAdditives.com, a business-to-business internet joint venture with Cytec Industries and General Electric to provide materials faster and more efficiently directly from trusted suppliers. In 2001, it acquired Martinswerk GmbH, which it sold in 2016. It also acquired the custom and fine chemicals businesses of ChemFirst Inc. for $74 million. In 2003, it acquired the fuel and lubricant antioxidants business of Ethyl Corporation. It also acquired the phosphorus-based polyurethane flame retardants businesses of Rhodia. It also acquired the bromine fine chemicals business of Atofina S.A. In January 2004, the company acquired Asian flame retardants distributor Taerim International based in Seoul, South Korea. In July 2004, Albemarle acquired the refinery catalysts platform from AkzoNobel, with sites and/or joint ventures in the Netherlands, Houston, France, Brazil, Japan and Singapore, for €615.7 million. In 2006, in partnership with UOP, a subsidiary of Honeywell, Albemarle created the Hydroprocessing Alliance to deliver integrated refinery solutions and hydroprocessing technologies and catalysts to the refining industry. The partnership was ended in 2016. In May 2007, Albemarle opened a regional sales office in Dubai to meet growing market needs in India and the Middle East. In 2008, Albemarle and Sinobrom, a marketer of bromine derivatives in China, formed Sinobrom Albemarle Bromine Chemicals (Shandong) Company Ltd., a bromine-related joint venture. In 2008, Albemarle acquired Sorbent Technologies Corporation, whose technology controls mercury emissions from coal-fired power plants, for $22.5 million. In 2009, Albemarle and TAYF, an affiliate of SABIC, created a catalysts joint venture to build a world-scale organometallics production facility in Jubail. In January 2012, Albemarle expanded its production capabilities for finished polyolefin catalysts in Baton Rouge. Albemarle also expanded its South Haven API production site and upgraded its multi-product cGMP active pharmaceutical ingredient (API) manufacturing facility. In September 2012, Albemarle was one of the three chemical companies that backed the Citizens for Fire Safety industry group that lobbied for use of flame retardant in consumer products including furniture and baby products. In 2014, Albemarle completed the sale of its antioxidant, ibuprofen and propofol businesses to SI Group. In January 2015, Albemarle acquired Rockwood Holdings for $6.2 billion in stock. Albemarle then announced it would realign its global business units: Chemetall Surface Treatment, Refining Solutions and Performance Chemicals. In August 2015, the company announced the relocation of its headquarters from Baton Rouge, Louisiana to Charlotte, North Carolina. In October 2015, Albemarle announced the separation of the bromine and lithium businesses, previously together under Performance Chemicals. In December 2016, the company sold the Chemetall Surface Treatment business to BASF for $3.2 billion. In January 2017, the company acquired the Jiangli New Materials Science and Technology Co. lithium business for $145 million. In October 2019, the company formed a lithium joint venture with Mineral Resources. In June, 2021, Albermarle completed the sale of its Fine Chemistry Services (FCS) business to W. R. Grace & Co. for approximately $570 million. This sale included Albemarle's operations in Tyrone, Pennsylvania and South Haven, Michigan. Operations Salar De Atacama, Chile Chile is one of the world’s highest Lithium producing countries. Annually, the country produces approximately 49,000 metric tons of lithium, which is the second highest globally only falling behind Australia. The production of Lithium in the Salt Flats of Chile has increased steadily since 2020, rising about 127%. The most common method of extraction is that of accessing lithium brine deposits. In April of 2023 there were plans by the Chilean government to nationalize the lithium industry, and to gain controlling stakes in the industry through a state-owned mining company called Codelco. Albemarle has a mine in this area which extracts lithium from lithium brine deposits. The process of doing this includes pumping the core of the Salar de Atacama, extracting this lithium-rich brine, and moving it to wells where it can then evaporate in the sun, until the lithium concentrations reach approximately 6%. This concentrated brine is then moved by cistern trucks to a plant owned by Albemarle in Antofagasta where it is converted chemically into usable forms of lithium. These forms include technical and battery grade lithium chloride and lithium carbonate. There are several important environmental impacts that lithium mining in the Salar de Atacama has. The first of these being the fact that the Salar de Atacama only receives about 15mm of water per year. The process of brine extraction especially, depletes water in desert, wetland, and altiplano ecosystems, all of which are present in the Salar de Atacama. The depletion of water reserves in the area could have the capacity to degrade habitats of animals including three types of flamingos, migratory water birds, lizards, bats, foxes, and many species of rodents. Additionally, the water-intensive process of brine extraction has been known to degrade surface vegetation, and to elevate daytime surface temperatures, as well as lower moisture levels in soil. The small scale subsistence farmers who have lived in this region for far longer than the foreign lithium extraction business has been present are facing several environmental injustices because of the industry . In San Pedro de Atacama specifically, many houses have raised black flags outside of their homes to indicate the fact that they are mourning the many changes made in the area without their consent. However, because of the lack of water caused by brine extraction, the community’s crops are failing. Additionally, livestock are getting ill. This is because of the lack of water in the area as a result of the brine extraction process. Should this continue, then the traditional ways of life of people in this area may disappear, according to locals from San Pedro de Atacama who claim that this is a major concern of theirs They have explained that \"We could very easily disappear. That's everybody's fear, I think, that we cease to exist, that we disappear entirely as a culture”, one local said in an interview with NPR. Additionally, the Chilean government plans to expand the lithium mining business until the year 2060. Albemarle processes the lithium in the industrial complex of La Negra near the coast and 27 km southeast of the port city of Antofagasta. Silver Peak, Nevada Albemarle’s Silver Peak Lithium extraction site in Silver Peak, Nevada acts as the United States’ only active Lithium resource. The site began operations approximately 50 years ago and currently employs 60 people in order to produce technical grade lithium carbonate and lithium hydroxide. Similarly to their site in Chile, Albemarle utilizes brine extraction to obtain lithium in the area. This process involves pumping of aquifers between 300 and 2000 ft. below the surface, allowing brine water to evaporate until its lithium concentration is high enough. Once the concentration is high enough the lithium will be refined at separate sites. Silver Peak Nevada is home to many different species of plants and animals, who inhabit a wide range of habitats. These include alluvial plains, canyons, dense pinion and juniper woodlands. Other plant species include greasewood, low saltbush vegetation, and low sage brush communities. There are many large animal species present, including mule deer, bighorn sheep, raptor species like the burrowing owl and golden eagle, and rodents. Lithium mining threatens over 2,000 acres of nesting sites for various species, while also encroaching on the habitat of the federally protected Tiehm’s buckwheat wildflower, an endangered wildflower that evolved to survive on inhospitable lithium-boron rich soil. The Biden administration’s focus on transitioning from carbon-based energies provides subsidies for lithium extraction companies, which has led to the construction of the Silver Peak lithium mine. However, this initiative poses no limits on water consumption of lithium mining corporations, and very few restrictions on mining practices. Like the Chilean Salt Flats, Silver Peak is an area that receives very little rainfall during the year and is incredibly dry. The area only receives about 4.45 inches of precipitation per year which is substantially less than other, more temperate states such as Pennsylvania which receives an average of over 41.53 inches of precipitation per year. In fact, Nevada is the driest state in America. Albemarle’s lithium extraction site utilizes over 4 billion gallons of water per year in order to meet its quota. The depletion of water has important environmental justice implications. Many people in this area are dependent on water resources to farm and raise cattle. The depletion of water, similarly to the Salar de Atacama, can erase traditional ways of life for people, endangering livelihoods and threatening the preservation of people’s cultures as a whole. “The community needs the water,” said a county commissioner from the area, “They don’t need to take away from our area to be able to produce green energy. We should be able to survive .” King's Mountain, North Carolina Currently there are plans in place by Albemarle to reopen a previously existing mine located in King’s Mountain, North Carolina. This area is a well-known Lithium resource and represents one of the few hard rock lithium deposits in the United States. It is part of the Carolina Tin-Spodumene belt within the Inner Piedmont terrane. It is believed to contain one of the largest hard-rock lithium resources on the planet. Hard rock deposits of lithium often can be mined in a more cost-effective manner since extraction is less labor intensive than salt flats or brine pools. Currently, Albemarle is seeking permission to reopen and expand the existing site. The initial permit application would allow the site to become active for a further 10 years. Community members in King’s Mountain have argued against reopening the mine because of several issues resulting from lithium mining’s legacy there. Previously, the mine was operated from the 1950’s until the 1980’s and this history has resulted in elevated levels of pollutants that are uncommon, and as such are not federally regulated. This includes lithium. However, the history of lithium extraction processes in this area have also resulted in elevated levels of both cesium and rubidium. It is estimated that the resurgence of lithium extraction in the area could increase the presence of these metals in drinking water systems. These metals, cesium and rubidium can cause skin irritation, as well as can become toxic if ingested in large quantities. There are already certain adverse effects caused by Albemarle’s lithium extraction in the area where the proposed mine is located. In Cleveland County, near King’s Mountain, Albemarle has begun to drain the old mine to reopen it, which has caused a process called turnover to occur. Turnover is the process by which surface water is cooled by the air, and then water sinks because it is denser. This causes the displacement of water at the bottom of the lake in which there are decomposed materials from historic lithium mining in the area. This causes the release of hydrogen sulfide gas into the air which results in a foul smell locals have been complaining about . One local even said of the smell, “I’ve been around marshes and the beaches my whole life, all over, and never smelt the strength of this odor anywhere .” The area in which this mine is being proposed is home to many different examples of wildlife which include white-tail deer, birds, frogs, as well as opossums, raccoons, bats, and other nocturnal creatures. There are over 542 species of plants that are present in the area as well. Lithium mining in the area has several concerns with the environment including the pollution of air and water which can endanger the health of animals, and degrade soil making it inhabitable for native plant species. As well as this, lithium mining can destroy habitats for wildlife, or erode healthy soil. Lawsuits and settlements Exploitation of aquifers in Atacama Desert Starting in 2022 indigenous Atacameño people sued Albemarle, Minera Escondida and Minera Zaldívar over damages to the Monturaqui-Negrillar-Tilopozo Aquifer. The lawsuit was joined by the Chilean state's Consejo de Defensa del Estado. Minera Escondida argued for its part that any effects of its water extraction have not had time to manifest downstream at the observation sites, due to the slow movement of groundwater, and hence that it was the extraction of the other two companies that had impacted it. In its defense Albemarle asserted that its extracts only surface water from a spring and that its use is minimal compared to the other companies. The lawsuit ended in December 2024 in a conciliation agreement in which Albemarle and the other two companies were to compensate for damages to the meadows of Tilopozo and the lakes of La Punta and La Brava. Also, the companies were to compensate economically, socially and environmentally the indigenous community Comunidad de Peine. September 2023 Securities and Exchange Commission FCPA Violation In September of 2023, the Albemarle corporation agreed to pay over $103.6 million to the Security and Exchange commission due to the fact that it violated anti-bribery, recordkeeping, and internal accounting controls provisions. These boundaries were laid out in Foreign Corrupt Policies Act. The specifics of these violations included actions such as using agents from at least 2009 through 2017 to pay bribes to obtain sales of refinery catalysts to public-sector oil refineries in Vietnam, India, and Indonesia and to private-sector oil refineries in India. The Commission found that Albemarle also failed to devise and maintain a sufficient system of internal accounting controls to provide reasonable assurances that payments made to agents in Vietnam, Indonesia, India, China, and the United Arab Emirates were for legitimate services. According to Charles Cain, the Chief of the SEC’s enforcement division, “Despite repeated and glaring bribery-related red flags, Albemarle failed for many years to implement sufficient internal accounting controls relevant to the use of agents by its global refining solutions business to make sales to state-owned customers around the world. This failure set the stage for wide-ranging misconduct.” The United States Department of Justice also announced on September 29, 2023 that it had entered into a non-prosecution agreement with Albemarle. Under this agreement, Albemarle would pay a criminal fine of $99 million, and the company would pay a forfeiture of approximately $98 million. $81.8 million of this would be satisfied by Albemarle’s payment to the Security and Exchange Commission. The agreement to pay these fines was made by Albemarle. The payments were consented to and the violations made by Albemarle were agreed upon. The corporation did not deny these violations had been committed. EPA Environmental Violations Since 2000, the Albemarle Corporation has paid a large sum of money to the EPA for violations related to several environmental concerns. These concerns either pose issues for people in the areas of Albemarle’s operations, the wildlife in the area, or to their own workers. In total Albemarle has paid $1,037,728 for 27 total various environment-related violations. These include violations to the National Emission Standard for hazardous air pollutants, inventory update violations, Emergency Planning and Community Right to Know violations relating to reporting requirements, Clean Air Act violations related to stratospheric ozone protection, and FIFRA violations including those related to microbial concerns. In addition to such violations, the company has been fined for damage to water quality, air quality, improper disposal of hazardous waste, workplace safety and health concerns, and railroad safety concerns."
}