{
  "ticker": "ALGN",
  "cik": "0001097149",
  "company_name": "Align Technology",
  "corrected_name": "Align Technology",
  "wiki_title_used": "Align Technology",
  "exists": true,
  "raw_text": "Align Technology, Inc. is an American manufacturer of 3D digital scanners and Invisalign clear aligners used in orthodontics and restorative workflow. It was founded in 1997 and is headquartered in Tempe, Arizona. The company manufactures the aligners in Juarez, Mexico, and its scanners in Israel and China. The company is best known for its Invisalign system, which is a clear aligner treatment used to straighten teeth.\n\nInvisalign\nInvisalign is a brand of clear aligners manufactured by Align Technology. The clear align system has been used to treat more than 18 million patients.\nAlign Technology founder Zia Chishti conceived of the basic design of Invisalign while an adult orthodontics patient. During his treatment with a retainer intended to complete his treatment, he posited that a series of such devices could effect a large final placement in a series of small movements. He partnered with Kelsey Wirth to seek developers.\nInvisalign was approved by the Food and Drug Administration in 1998, and sales began in the U.S. in 1999. Orthodontists were resistant to adopting Invisalign at first, in particular because the founders had no orthodontic credentials or expertise, but the product became popular among consumers. The company raised about $140 million in funding over four rounds from 1997 to 2000. In 2000 Align Technology planned a $31 million television advertising campaign that The New York Times said would be \"the most aggressive consumer advertising plan the dental profession has ever seen\".  In 2001, $130 million in additional funding was raised through an initial public offering on NASDAQ. By 2001, 75 percent of the 8,500 orthodontists in North America had been trained on the Invisalign system. That same year, Align Technology made Invisalign available to general dentists following a class-action lawsuit that alleged making the system available only to orthodontists resulted in unfair competition for dentists.\nIn the early 2000s, Align Technology was spending nearly all of its revenues on marketing and advertising, and losing about $18 million per year. Cofounders Wirth and Chishti resigned from Align Technology in 2001 and 2003 respectively, with Thomas Prescott replacing Chishti as CEO in March 2002. Prescott re-focused the company on North America and cut the marketing budget to about one-third its original size.\nThe Invisalign system grew from 80,000 patients in 2002 to 175,000 in 2004. It won several awards for stereolithography, medical design and fast growth. Align Technology was profitable for the first time in 2003. In 2005 the company expanded into Japan, and acquired General Orthodontic, an orthodontics firm that supported doctors prescribing the Invisalign system. Later that year, the Harvard School of Dental Medicine began requiring that its orthodontic graduate students complete Invisalign certification before they graduate.\nThe Invisalign Express 10, which uses 10 aligners, was introduced in 2005. Invisalign 1.5 was released in 2009. It was followed by Invisalign G3 in 2010 and G4 in 2011. Invisalign G3 and G4 were designed for more complex treatments. An Invisalign Express 5 version, which uses 5 aligners, was introduced in 2012. In February 2014, Align Technology released a G5 product designed to treat deep bites.\nSupport, software engineering, pre-production and administrative functions are done from Align Technology's headquarters in California. The manufacturing of Invisalign aligners is performed in Mexico, and treatment plans are created in Costa Rica. Align Technology also operates separate subsidiaries in Hong Kong and Australia that sell Invisalign in their respective markets. Align Technology provides training and certification to doctors.\nIn 2007 the Academy of General Dentistry approved Align Technology's Program Approval for Continuing Education (PACE) program. The company also created the AlignTech Institute, which provides educational resources to doctors. In March 2011 Align Technology acquired Cadent System, Inc., a dentist firm, for $190 million.\n\nHistory\nAlign Technology was founded by Zia Chishti and Kelsey Wirth in 1997 and began working on the development of a clear aligner.  Align received FDA clearance to market the Invisalign system in 1998, and it was first marketed in 2000.  Align Technology went public on January 26, 2001, on the Nasdaq Stock Market.\nIn March 2011 Align acquired the Israeli company Cadent for $190 million; Cadent manufactured intraoral scanners that included 3D imaging, as well as software to display the acquired images and to plan treatment.\nJoseph M. Hogan joined Align in June 2015, and is CEO and president.\nThe company's sales reached $1 billion for the first time in 2016 and its products were being used in about 8% of people who got braces.  In 2017 the company was faced with the challenge of the expiration of its patents on its Invisalign system starting in October 2017 and the beginning of generic competition.\nIn March 2020, Align Technology announced that it has signed a definitive agreement to acquire exocad Global Holdings for approximately $418.7 million.\nAs of February 2023, Align Technology has assisted over 234,000 doctors and over 14.5 million patients worldwide.\nIn September 2023, it was announced Align Technology had acquired the Vienna-headquartered 3D printing technology and materials company, Cubicure GmbH.\n\nCriticism\nDuring and following the 2022 Russian invasion of Ukraine, Align Technology faced criticism by Western media for refusing to exit the Russian market. Research from Yale University published on May 26, 2022 identifying how companies were reacting to Russia's invasion identified Align Technology in the worst category of \"Digging in\", meaning Defying Demands for Exit: companies defying demands for exit/reduction of activities.\n\nSee also\nList of S&P 500 companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for Align Technology:",
  "clean_text": "Align Technology, Inc. is an American manufacturer of 3D digital scanners and Invisalign clear aligners used in orthodontics and restorative workflow. It was founded in 1997 and is headquartered in Tempe, Arizona. The company manufactures the aligners in Juarez, Mexico, and its scanners in Israel and China. The company is best known for its Invisalign system, which is a clear aligner treatment used to straighten teeth. Invisalign Invisalign is a brand of clear aligners manufactured by Align Technology. The clear align system has been used to treat more than 18 million patients. Align Technology founder Zia Chishti conceived of the basic design of Invisalign while an adult orthodontics patient. During his treatment with a retainer intended to complete his treatment, he posited that a series of such devices could effect a large final placement in a series of small movements. He partnered with Kelsey Wirth to seek developers. Invisalign was approved by the Food and Drug Administration in 1998, and sales began in the U.S. in 1999. Orthodontists were resistant to adopting Invisalign at first, in particular because the founders had no orthodontic credentials or expertise, but the product became popular among consumers. The company raised about $140 million in funding over four rounds from 1997 to 2000. In 2000 Align Technology planned a $31 million television advertising campaign that The New York Times said would be \"the most aggressive consumer advertising plan the dental profession has ever seen\". In 2001, $130 million in additional funding was raised through an initial public offering on NASDAQ. By 2001, 75 percent of the 8,500 orthodontists in North America had been trained on the Invisalign system. That same year, Align Technology made Invisalign available to general dentists following a class-action lawsuit that alleged making the system available only to orthodontists resulted in unfair competition for dentists. In the early 2000s, Align Technology was spending nearly all of its revenues on marketing and advertising, and losing about $18 million per year. Cofounders Wirth and Chishti resigned from Align Technology in 2001 and 2003 respectively, with Thomas Prescott replacing Chishti as CEO in March 2002. Prescott re-focused the company on North America and cut the marketing budget to about one-third its original size. The Invisalign system grew from 80,000 patients in 2002 to 175,000 in 2004. It won several awards for stereolithography, medical design and fast growth. Align Technology was profitable for the first time in 2003. In 2005 the company expanded into Japan, and acquired General Orthodontic, an orthodontics firm that supported doctors prescribing the Invisalign system. Later that year, the Harvard School of Dental Medicine began requiring that its orthodontic graduate students complete Invisalign certification before they graduate. The Invisalign Express 10, which uses 10 aligners, was introduced in 2005. Invisalign 1.5 was released in 2009. It was followed by Invisalign G3 in 2010 and G4 in 2011. Invisalign G3 and G4 were designed for more complex treatments. An Invisalign Express 5 version, which uses 5 aligners, was introduced in 2012. In February 2014, Align Technology released a G5 product designed to treat deep bites. Support, software engineering, pre-production and administrative functions are done from Align Technology's headquarters in California. The manufacturing of Invisalign aligners is performed in Mexico, and treatment plans are created in Costa Rica. Align Technology also operates separate subsidiaries in Hong Kong and Australia that sell Invisalign in their respective markets. Align Technology provides training and certification to doctors. In 2007 the Academy of General Dentistry approved Align Technology's Program Approval for Continuing Education (PACE) program. The company also created the AlignTech Institute, which provides educational resources to doctors. In March 2011 Align Technology acquired Cadent System, Inc., a dentist firm, for $190 million. History Align Technology was founded by Zia Chishti and Kelsey Wirth in 1997 and began working on the development of a clear aligner. Align received FDA clearance to market the Invisalign system in 1998, and it was first marketed in 2000. Align Technology went public on January 26, 2001, on the Nasdaq Stock Market. In March 2011 Align acquired the Israeli company Cadent for $190 million; Cadent manufactured intraoral scanners that included 3D imaging, as well as software to display the acquired images and to plan treatment. Joseph M. Hogan joined Align in June 2015, and is CEO and president. The company's sales reached $1 billion for the first time in 2016 and its products were being used in about 8% of people who got braces. In 2017 the company was faced with the challenge of the expiration of its patents on its Invisalign system starting in October 2017 and the beginning of generic competition. In March 2020, Align Technology announced that it has signed a definitive agreement to acquire exocad Global Holdings for approximately $418.7 million. As of February 2023, Align Technology has assisted over 234,000 doctors and over 14.5 million patients worldwide. In September 2023, it was announced Align Technology had acquired the Vienna-headquartered 3D printing technology and materials company, Cubicure GmbH. Criticism During and following the 2022 Russian invasion of Ukraine, Align Technology faced criticism by Western media for refusing to exit the Russian market. Research from Yale University published on May 26, 2022 identifying how companies were reacting to Russia's invasion identified Align Technology in the worst category of \"Digging in\", meaning Defying Demands for Exit: companies defying demands for exit/reduction of activities."
}