{
  "ticker": "ALL",
  "cik": "0000899051",
  "company_name": "Allstate",
  "corrected_name": "Allstate",
  "wiki_title_used": "Allstate",
  "exists": true,
  "raw_text": "The Allstate Corporation is an American insurance company, headquartered in Glenview, Illinois (with a Northbrook, Illinois address) since 2022. Founded in 1931 as part of Sears, Roebuck and Co., it was spun off in 1993, but was still partially owned by Sears until it became an independent company completely in June 1995.  The company also has personal line insurance operations in Canada.\nAllstate is a large corporation, and with 2018 revenues of $39.8 billion, it ranked 79th in the 2019 Fortune 500 list of the largest United States corporations by total revenue. Its long-running advertising campaign, in use since 1950, asks, \"Are you in good hands?\", and the recognizable logo portrays a pair of human hands.\n\nHistory\nIn 1925, Sears held a national contest to decide the name of a new brand of car tires. After 2,253,746 name submissions from 937,886 participants, \"Allstate\" was chosen.  Hans Simonson of Bismarck, North Dakota, received a $5,000 cash prize for his winning entry among a list of 31 he submitted. The trademark was officially registered on April 19, 1927, and the tires' new name made its debut in the spring 1927 Sears catalog. \nThe idea for Allstate Insurance Company came when insurance broker Carl L. Odell proposed to Robert E. Wood, his neighbor, the idea of selling auto insurance by direct mail. The idea appealed to Wood, and the proposal was sent to the Sears board of directors, which approved it. Allstate Insurance Company, named after Sears' tire line, went into business on April 17, 1931, offering auto insurance by direct mail and through the Sears catalog.  This was in line with one of the objectives of a company to sell automobile insurance in the same manner as Sears sold its merchandise.\nLessing J. Rosenwald was Allstate's first board chairman, and Odell was named vice president and secretary.\nIn 1933, at the Century of Progress World's Fair in Chicago, Allstate's Richard E. Roskam sold insurance at a booth in the Sears pavilion. In 1934, Allstate opened its first permanent sales office in a Chicago Sears store.\nIn 1941, only about a quarter of US drivers had auto liability insurance. This led to the state of New York passing a law that established the financial responsibility of drivers for damage or injuries resulting from auto mishaps. That law inspired legislation in other states, and by the mid-1950s, nearly every state had some sort of financial responsibility law on its books.\nIn 1949, the Allstate Headquarters Building was completed at 3246 W. Arthington Street in Chicago as a part of the Sears, Roebuck and Company Complex.  The midrise building is vacant (as of 2013) and in danger of demolition.  The building is noted for its early postwar midrise construction.  This location was vacated when the company relocated in the postwar years.\nThe company's \"You're in Good Hands with Allstate\" slogan was created in 1950 by Allstate's general sales manager Davis W. Ellis.  At the end of the decade, it was used in the company's first network-television advertising campaign, which featured actor Ed Reimers.\nAllstate added products throughout the 1950s, including fire insurance in 1954 and homeowners and life insurance in 1957.  Allstate began selling insurance to Canadians in 1953. Allstate Insurance Company of Canada was incorporated in 1964. (In 1952 and 1953, Sears also sold an automobile called Allstate.)\nIn 1967, the company's home office was moved from Skokie to Northbrook, Illinois. Allstate continued to sell additional types of insurance to customers throughout the decade, including worker's-compensation insurance in 1964, surety bonds in 1966, inland-marine coverage in 1967, and a business package policy in 1969.\nThe brand itself expanded in the 1950s and 1960s and could be found on a variety of products such as fire extinguishers and motor scooters. In 1952, an Allstate car was produced, but it was a flop; it was pulled from stores by 1953. The automobile was based on the Henry J car manufactured by Kaiser Motors. The Allstate brand was eventually limited to insurance, tires, and car batteries by the late 1960s, before becoming insurance only in the mid-1970s.\nIn 1991, the company went public. In June 1993, 19.8% of Allstate became public through a stock offering. Allstate became completely independent in June 1995, when Sears spun off the remaining 80% stake in the company, distributing 350.5 million shares of Allstate stock to its stockholders.  At the time, it was the largest IPO to date.\nIn 1999, Allstate purchased the personal-lines division of CNA Financial and subsequently renamed it to Encompass Insurance Company.\nIn 2003, actor Dennis Haysbert became Allstate's spokesman, using the tagline \"That’s Allstate’s stand.\"\nIn May 2011, Allstate announced that it was purchasing Esurance and rate-comparison site Answer Financial for about $1 billion.\nIn 2012, Allstate Solutions Private Limited (also called Allstate India) was inaugurated in Bangalore; it is a technology and operations center to provide software development and business process outsourcing services to its US parent. \nIn January 2017, Allstate acquired SquareTrade, a consumer electronics and appliance protection plan provider. The acquisition cost a reported $1.4 billion from a group of shareholders.\nIn July 2020, Allstate announced it was acquiring National General for $4 billion. The deal closed in January 2021.\nIn 2021 Allstate completed sale of its life insurance and annuity businesses.  One of the divested businesses was Allstate Life Insurance Company of New York, which became part of Wilton Reassurance Life Company of New York. Another was the similarly named Allstate Life Insurance Company, purchased by Everlake Holdings and renamed Everlake Life Insurance Company. A third divested business was Allstate Assurance Co, also purchased by Everlake Holdings.\nIn 2025, Chief Information Officer Zulfi Jeevanjee spoke about Allstate's use of AI to generate emails to customers that would sound less confusing and more understanding: \"When these emails used to go out, even though we had standards and so on, they would include a lot of insurance jargon. They weren’t very empathetic…Claims agents would get frustrated, and so it wasn’t necessarily great communication.\" He added, \"The claim agent still looks at them just to make sure they’re accurate, but they’re not writing them anymore.\" After Futurism reported on this, a spokesperson from Allstate's media relations team contacted them demanding that they take down the blog post in question.\n\nCorporate leadership\nThe people in this section are members of corporate leadership.\n\nCEOs\nSince its IPO in 1993:\n\nThomas J. Wilson (2007–present)\nEdward Liddy (1999–2006)\nJerry D. Choate (1995–1999)\nWayne E. Hedien (1993–1994)\n\nCurrent leadership\nThomas J. Wilson - chairman, CEO, President of The Allstate Corporation\nSteven E. Shebik - Vice Chairman of The Allstate Corporation and CEO of Allstate Life Insurance Company\nBrian Bohaty - Executive VP of Corporate Business Transformation\nDon Civgin - President of Allstate Service Businesses\nJohn Dugenske - Executive VP, Chief Investment and Strategy Officer of The Allstate Corporation and President of Allstate Investments\nMary Jane Fortin - President of Allstate Financial\nSuren Gupta - Executive VP of Allstate Technology & Strategic Ventures\nGuy Hill - Executive VP of Product Integration & Management\nSusan Lees - Executive VP, General Counsel, and Secretary\nJess Merten - Executive VP and Chief Risk Officer of Allstate Insurance Company\nDavid Prendergast - President of Allstate East Territory\nMario Rizzo - Executive VP and Chief Financial Officer of The Allstate Corporation\nKen Rosen - Executive VP and Chief Claims Officer\n\nAdvertising\n\"Good hands\"\nAllstate's slogan \"You're in good hands\" was created in the 1950s by Allstate Insurance Company's sales executive, Davis W. Ellis, based on a similar phrase he used to reassure his wife about a doctor caring for their child. It has been the slogan ever since 1950. Allstate also refer to themselves as the \"Good Hands People\".\nIn the 1960s and 1970s, TV, print and radio advertising featured Allstate's spokesman, Ed Reimers.  Reimers was often shown making the cupped-hand gesture.  For 22 years, he remained the spokesman.\nThis 1975 commercial that the egg rolls on the table, then it fell down and it almost cracked all the way down to the floor, but it was finally saved by the hand before placing it in the nest gently.\nA study in 2000 by Northwestern University's Medill Graduate Department of Integrated Marketing Communications found that the Allstate slogan \"You're in good hands\" ranked as the most recognizable in America.\n\nLogo\nAllstate's original hands logo was designed by Theodore Conterio in the 1950s. The employees were told whoever could come up with the best logo would win $50. Theodore Conterio came up with the design based on the slogan, \"You're in good hands,\" and won the $50 prize.\n\n\"Allstate's stand\"\nBeginning in 2003, as policy growth slowed, Allstate's television commercials used spokesman Dennis Haysbert. The ads were intended to carry the message that Allstate's service was superior to that from low-cost providers GEICO and Progressive. Haysbert appeared in more than 250 commercials between 2003 and 2016.\n\nMayhem\nMayhem was created by Leo Burnett Worldwide. Burnett pitched the character to Allstate as \"Mr. Mayhem\", comparing him to the character Mr. White from the 1992 film Reservoir Dogs played by Harvey Keitel.\nMayhem has been played by Dean Winters since the campaign was launched in April 2010. The character wears a black suit, white dress shirt, and black necktie and his face is usually bruised, scarred, or wearing a butterfly bandage.\nThe formula for almost every Mayhem commercial has been the same. To begin the commercial, Mayhem identifies the risk he is portraying. He gives context into the situation and hints at an impending disaster that he will cause, which then takes place. For instance, a 2015 ad features Mayhem playing a portable grill hastily loaded into a car before being fully extinguished, which leads to an explosion when the still-burning embers ignite an enormous bottle of lighter fluid. Once the disaster's result is revealed, Mayhem warns that certain \"cut-rate\" policies lack coverage for the situation he has caused, advising the viewers to get their insurance policies through Allstate. Each commercial ends with Mayhem telling the viewers that by having Allstate, they will be \"better protected from mayhem...like me.\" Damage to his clothing and injuries to his person carry over from one commercial to the next.\nIn some ads, Mayhem also has advised against going without roadside assistance. In separate advertisements, he described what could happen in the face of a catastrophe while driving; these consisted of having to stay in a creepy roadside motel overnight because one's car ran out of fuel, being forced to change a tire in a heavy downpour, being forced to stay at an awkward family gathering because one's car battery died, and potentially becoming a victim of crime due to a breakdown in the wrong neighborhood.\nA series of ads in early 2018 featured Mayhem with a New Year's resolution to help keep people and property safe. He took the role of various pieces of safety equipment, such as a lightning rod mounted on a house's roof to protect it during storms or a flare placed to warn drivers of a roadside vehicle breakdown. However, less than a month into the new year, he broke his resolution and returned to his old habit of causing chaos and damage.\nAllstate developed the campaign \"Mayhem\" and the character (Mayhem) in response to being ranked fourth in advertising spending behind GEICO, State Farm, and Progressive. Allstate had an existing campaign called \"Our Stand\" featuring Dennis Haysbert that targeted \"older, more traditional customers\", and the company sought to develop a campaign that would skew toward younger customers. Nina Abnee, executive vice president at Burnett, said \"We wanted to kick Flo's ass.\" The campaign was first launched in mid-June 2010. The character was featured in TV and radio spots as well as on billboards and Internet banners. Some ads were adjusted to capture local details. By mid-2011, Allstate had won around 80 industry awards for the campaign.\nThere is a Hispanic version named La Mala Suerte (meaning Bad Luck) for the Spanish-speaking market portrayed by Alberto Mateo.\n\nRecognition\nAdvertising Age reported in February 2011 that Mayhem rose to third as most-recognized insurance advertising character, behind the GEICO gecko and Flo from Progressive Insurance. An online survey showed that the GEICO gecko and Flo were each tied to their respective companies over 90% of the time. For Mayhem, the Age said, \"After the top two, the most-recognized ad description was Allstate, with 65% of consumers saying they knew the ad. When those same consumers were asked to associate it with a brand, 63% correctly matched Mayhem with Allstate. Overall, among the total sample, Mayhem clocked in with only 41% of respondents being able to link him to Allstate.\n\nSocial media\nIn January 2011, Allstate released The Lines, a multi-episode TV drama web series starring actors Teresa Cesario, Kyle Sandgate-Blix, Jackson Schultz, Bridgette Pechman, Chase Maser, and Corey Doyle cast as High-School seniors. The series, filmed in the style of a television drama, depicts the cast in common situations facing teens with respect to driving (Texting while driving in particular). The series appears aimed at promoting interest and support in favor of responsible teen driving and road safety in general. Allstate and other large corporations are attracted to the rapid growth of social media for use in their advertising campaigns.\n\nOrganization\nAllstate Corporation owns and operates over 19 companies around the United States, United Kingdom, Canada and India.\nBased in San Francisco, California:\n\nEsurance, Inc.\nBased in Northbrook, Illinois:\n\nAllstate Fire and Casualty Insurance Company\nAllstate Insurance Company\nAllstate Indemnity Company\nAllstate Life Insurance Company\nAllstate Property and Casualty Insurance Company\nEncompass Insurance Company\nAllstate North American Insurance Company\nAllstate Vehicle and Property Insurance Company\nBased in Bridgewater, New Jersey:\n\nAllstate New Jersey Insurance Company\nAllstate New Jersey Property and Casualty Insurance Company\nBased in St. Petersburg, Florida:\n\nCastle Key Insurance Company\nCastle Key Indemnity Company\nBased in Irving, Texas:\n\nAllstate County Mutual Insurance Company\nAllstate Texas Lloyd's\nBased in Jacksonville, Florida:\n\nAmerican Heritage Life Insurance Company\nBased in Northern Ireland, United Kingdom:\n\nAllstate Northern Ireland (ANI)\nBased in Markham, Ontario:\n\nAllstate Insurance Company of Canada\nBased in Bangalore, India:\n\nAllstate Solutions Private Limited\nBased in Pune, India:\n\nAllstate Solutions Private Limited\n\nSponsorship\nAllstate Arena\nAllstate holds naming rights to the Allstate Arena in Rosemont, Illinois, near the company's headquarters.\n\nCollege football\nAllstate sponsors branded field goal nets at over 67 colleges and universities. For each field goal and extra point kicked, Allstate donates into collegiate general scholarship funds. To date, those donations exceed $2.9 million. Allstate also sponsors branded nets during field goals and extra points at over 20 college bowl games, including the Allstate Sugar Bowl and the BCS National Championship Game.\nAdditionally, Allstate is a partner of the Southeastern Conference and its 20 sports, including football.\n\nSugar Bowl\nSince 2007, Allstate has been the title sponsor of the Sugar Bowl, one of the four games that make up the Bowl Championship Series. The game is played at the Mercedes-Benz Superdome, which is also the home of the New Orleans Saints. Allstate is also a sponsor of the New Orleans Saints.\nThe 2012 Allstate BCS National Championship Game was played on January 9, 2012, and broadcast on ESPN.\n\nAllstate Wrigleyville Classic\nThe Northwestern Wildcats and the Illinois Fighting Illini played a collegiate football game at Wrigley Field on November 20, 2010. It was the first football game at Wrigley Field since 1970 and the first collegiate football game at Wrigley Field since 1938 when DePaul University played its regular games at Wrigley. Allstate title sponsored this game.\n\nAllstate AFCA Good Works Team\nAllstate advertises through the American Football Coaches Association \"Good Works Team\" in which local Allstate agents surprise players with trophies in key Allstate marketing regions.\n\nSoccer\nIn 2007, Allstate became a sponsor of the Mexico National Team, and in 2011 partnered with Major League Soccer and the United States Soccer Federation.\n\nNASCAR\nAllstate was a sponsor of the Allstate 400 at the Brickyard from 2005 to 2009 – the annual NASCAR Sprint Cup Series race held at Indianapolis Motor Speedway in late summer. Driver Kasey Kahne was featured in advertisements.\n\nCriticism\nIn July 2008, the American Association for Justice ranked Allstate No. 1 among nation's worst insurers.  This ranking was given because: \"While Allstate publicly touts its 'good hands' approach, it has instead privately instructed its agents to employ a 'boxing gloves' strategy against its policyholders,\" said American Association for Justice CEO Jon Haber. Allstate criticized the report, with a spokesman noting that \"The personal injury lawyers behind this report provide no evidence for their statements other than decade old recycled allegations that have been shown to be without merit in courts of law.\"\nIn 2009, Allstate successfully fought for federal government TARP fund eligibility only to decline it once they obtained eligibility.\n\nAuto insurance claims\nAn investigative report in February 2007 by CNN revealed that major car insurance companies, like Allstate, are increasingly disputing auto insurance claims from individuals injured by their insured members.  In 2010 Allstate commanded 18% of the auto insurance market in the United States.\n\nHomeowners claims\nThe PBS television program Now, in conjunction with Bloomberg Markets magazine, did an exposé regarding Allstate and other major insurers' homeowners insurance policies.\n\nCatastrophe exposure management\nAllstate has stated intentions of reducing its exposure in hurricane-prone Florida. In November 2006, the company did not renew 120,000 policies that were expiring at that time. Governor Charlie Crist and the Florida Cabinet passed a 90-day emergency order to temporarily prevent insurance companies from not renewing policies.\nOn February 20, 2007, Florida Insurance Commissioner Kevin McCarty clarified the order, stating that insurance companies can nonrenew policies if they satisfy certain conditions, including filing new, lower rates with the state and give customers 100 days’ notice.\n\nFrom Good Hands to Boxing Gloves\nFrom Good Hands to Boxing Gloves is a non-fiction work on the company written by David Berardinelli, Michael Freeman, and Aaron DeShaw with a foreword by Eugene R. Anderson. The book relates profit-boosting strategies that consulting firm McKinsey & Company presented to Allstate to maximize profits and diminish the amount of money sent to clients who put in a claim. McKinsey specializes in redesigning product delivery systems for Fortune 100 companies (including controversial clients such as Enron) to maximize profits. McKinsey's recommendation to Allstate, according to Berardinelli, was to low-ball claims so that desperate customers in dire straits would be more likely to accept a settlement offer while Allstate continued to make a profit and collect interest on the insurance payment. Allstate would offer its \"good hands\" in the way of a low-ball claim and, if the customer did not accept, to get out \"boxing gloves.\" According to a 2006 review in Business Week magazine, Allstate responded to Berardinelli's allegations by claiming that Berardinelli's allegations were \"unfounded and unproven.\" Legal decisions on the issues outlined in the book have led to varied outcomes in court. According to the Business Week article, \"Courts and regulators in a number of states, including New York, Pennsylvania, and Washington, have forced Allstate to halt or change its practice of handing out a controversial 'Do I Need an Attorney?' form to people involved in accidents.\" On the other hand, the article also states that seven court rulings had rejected attacks on the practice. While many of the cost-reduction strategies McKinsey recommended at Allstate remain in place, some were ended by legal and regulatory challenges.\n\nUse of Colossus\nMany criticisms leveled against Allstate (and other insurers), including Barardinelli's book, involved the use of a software program called \"Colossus\" to process claims.  In 2010, Allstate paid a $10 million fine to settle a lawsuit brought by 41 states concerning inconsistencies in the manner in which Colossus was used.  It also agreed to standardize its use of the software. However, “it is important to note that we found no systemic underpayment of bodily injury claims,” New York Insurance Superintendent James J. Wrynn said in a press release.\n\nSee also\nSEC Community Service Team\nLaureus Sport for Good Award\nAllstate Arena\nList of United States insurance companies\nAllstate Northern Ireland\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for The Allstate Corporation:",
  "clean_text": "The Allstate Corporation is an American insurance company, headquartered in Glenview, Illinois (with a Northbrook, Illinois address) since 2022. Founded in 1931 as part of Sears, Roebuck and Co., it was spun off in 1993, but was still partially owned by Sears until it became an independent company completely in June 1995. The company also has personal line insurance operations in Canada. Allstate is a large corporation, and with 2018 revenues of $39.8 billion, it ranked 79th in the 2019 Fortune 500 list of the largest United States corporations by total revenue. Its long-running advertising campaign, in use since 1950, asks, \"Are you in good hands?\", and the recognizable logo portrays a pair of human hands. History In 1925, Sears held a national contest to decide the name of a new brand of car tires. After 2,253,746 name submissions from 937,886 participants, \"Allstate\" was chosen. Hans Simonson of Bismarck, North Dakota, received a $5,000 cash prize for his winning entry among a list of 31 he submitted. The trademark was officially registered on April 19, 1927, and the tires' new name made its debut in the spring 1927 Sears catalog. The idea for Allstate Insurance Company came when insurance broker Carl L. Odell proposed to Robert E. Wood, his neighbor, the idea of selling auto insurance by direct mail. The idea appealed to Wood, and the proposal was sent to the Sears board of directors, which approved it. Allstate Insurance Company, named after Sears' tire line, went into business on April 17, 1931, offering auto insurance by direct mail and through the Sears catalog. This was in line with one of the objectives of a company to sell automobile insurance in the same manner as Sears sold its merchandise. Lessing J. Rosenwald was Allstate's first board chairman, and Odell was named vice president and secretary. In 1933, at the Century of Progress World's Fair in Chicago, Allstate's Richard E. Roskam sold insurance at a booth in the Sears pavilion. In 1934, Allstate opened its first permanent sales office in a Chicago Sears store. In 1941, only about a quarter of US drivers had auto liability insurance. This led to the state of New York passing a law that established the financial responsibility of drivers for damage or injuries resulting from auto mishaps. That law inspired legislation in other states, and by the mid-1950s, nearly every state had some sort of financial responsibility law on its books. In 1949, the Allstate Headquarters Building was completed at 3246 W. Arthington Street in Chicago as a part of the Sears, Roebuck and Company Complex. The midrise building is vacant (as of 2013) and in danger of demolition. The building is noted for its early postwar midrise construction. This location was vacated when the company relocated in the postwar years. The company's \"You're in Good Hands with Allstate\" slogan was created in 1950 by Allstate's general sales manager Davis W. Ellis. At the end of the decade, it was used in the company's first network-television advertising campaign, which featured actor Ed Reimers. Allstate added products throughout the 1950s, including fire insurance in 1954 and homeowners and life insurance in 1957. Allstate began selling insurance to Canadians in 1953. Allstate Insurance Company of Canada was incorporated in 1964. (In 1952 and 1953, Sears also sold an automobile called Allstate.) In 1967, the company's home office was moved from Skokie to Northbrook, Illinois. Allstate continued to sell additional types of insurance to customers throughout the decade, including worker's-compensation insurance in 1964, surety bonds in 1966, inland-marine coverage in 1967, and a business package policy in 1969. The brand itself expanded in the 1950s and 1960s and could be found on a variety of products such as fire extinguishers and motor scooters. In 1952, an Allstate car was produced, but it was a flop; it was pulled from stores by 1953. The automobile was based on the Henry J car manufactured by Kaiser Motors. The Allstate brand was eventually limited to insurance, tires, and car batteries by the late 1960s, before becoming insurance only in the mid-1970s. In 1991, the company went public. In June 1993, 19.8% of Allstate became public through a stock offering. Allstate became completely independent in June 1995, when Sears spun off the remaining 80% stake in the company, distributing 350.5 million shares of Allstate stock to its stockholders. At the time, it was the largest IPO to date. In 1999, Allstate purchased the personal-lines division of CNA Financial and subsequently renamed it to Encompass Insurance Company. In 2003, actor Dennis Haysbert became Allstate's spokesman, using the tagline \"That’s Allstate’s stand.\" In May 2011, Allstate announced that it was purchasing Esurance and rate-comparison site Answer Financial for about $1 billion. In 2012, Allstate Solutions Private Limited (also called Allstate India) was inaugurated in Bangalore; it is a technology and operations center to provide software development and business process outsourcing services to its US parent. In January 2017, Allstate acquired SquareTrade, a consumer electronics and appliance protection plan provider. The acquisition cost a reported $1.4 billion from a group of shareholders. In July 2020, Allstate announced it was acquiring National General for $4 billion. The deal closed in January 2021. In 2021 Allstate completed sale of its life insurance and annuity businesses. One of the divested businesses was Allstate Life Insurance Company of New York, which became part of Wilton Reassurance Life Company of New York. Another was the similarly named Allstate Life Insurance Company, purchased by Everlake Holdings and renamed Everlake Life Insurance Company. A third divested business was Allstate Assurance Co, also purchased by Everlake Holdings. In 2025, Chief Information Officer Zulfi Jeevanjee spoke about Allstate's use of AI to generate emails to customers that would sound less confusing and more understanding: \"When these emails used to go out, even though we had standards and so on, they would include a lot of insurance jargon. They weren’t very empathetic…Claims agents would get frustrated, and so it wasn’t necessarily great communication.\" He added, \"The claim agent still looks at them just to make sure they’re accurate, but they’re not writing them anymore.\" After Futurism reported on this, a spokesperson from Allstate's media relations team contacted them demanding that they take down the blog post in question. Corporate leadership The people in this section are members of corporate leadership. CEOs Since its IPO in 1993: Thomas J. Wilson (2007–present) Edward Liddy (1999–2006) Jerry D. Choate (1995–1999) Wayne E. Hedien (1993–1994) Current leadership Thomas J. Wilson - chairman, CEO, President of The Allstate Corporation Steven E. Shebik - Vice Chairman of The Allstate Corporation and CEO of Allstate Life Insurance Company Brian Bohaty - Executive VP of Corporate Business Transformation Don Civgin - President of Allstate Service Businesses John Dugenske - Executive VP, Chief Investment and Strategy Officer of The Allstate Corporation and President of Allstate Investments Mary Jane Fortin - President of Allstate Financial Suren Gupta - Executive VP of Allstate Technology & Strategic Ventures Guy Hill - Executive VP of Product Integration & Management Susan Lees - Executive VP, General Counsel, and Secretary Jess Merten - Executive VP and Chief Risk Officer of Allstate Insurance Company David Prendergast - President of Allstate East Territory Mario Rizzo - Executive VP and Chief Financial Officer of The Allstate Corporation Ken Rosen - Executive VP and Chief Claims Officer Advertising \"Good hands\" Allstate's slogan \"You're in good hands\" was created in the 1950s by Allstate Insurance Company's sales executive, Davis W. Ellis, based on a similar phrase he used to reassure his wife about a doctor caring for their child. It has been the slogan ever since 1950. Allstate also refer to themselves as the \"Good Hands People\". In the 1960s and 1970s, TV, print and radio advertising featured Allstate's spokesman, Ed Reimers. Reimers was often shown making the cupped-hand gesture. For 22 years, he remained the spokesman. This 1975 commercial that the egg rolls on the table, then it fell down and it almost cracked all the way down to the floor, but it was finally saved by the hand before placing it in the nest gently. A study in 2000 by Northwestern University's Medill Graduate Department of Integrated Marketing Communications found that the Allstate slogan \"You're in good hands\" ranked as the most recognizable in America. Logo Allstate's original hands logo was designed by Theodore Conterio in the 1950s. The employees were told whoever could come up with the best logo would win $50. Theodore Conterio came up with the design based on the slogan, \"You're in good hands,\" and won the $50 prize. \"Allstate's stand\" Beginning in 2003, as policy growth slowed, Allstate's television commercials used spokesman Dennis Haysbert. The ads were intended to carry the message that Allstate's service was superior to that from low-cost providers GEICO and Progressive. Haysbert appeared in more than 250 commercials between 2003 and 2016. Mayhem Mayhem was created by Leo Burnett Worldwide. Burnett pitched the character to Allstate as \"Mr. Mayhem\", comparing him to the character Mr. White from the 1992 film Reservoir Dogs played by Harvey Keitel. Mayhem has been played by Dean Winters since the campaign was launched in April 2010. The character wears a black suit, white dress shirt, and black necktie and his face is usually bruised, scarred, or wearing a butterfly bandage. The formula for almost every Mayhem commercial has been the same. To begin the commercial, Mayhem identifies the risk he is portraying. He gives context into the situation and hints at an impending disaster that he will cause, which then takes place. For instance, a 2015 ad features Mayhem playing a portable grill hastily loaded into a car before being fully extinguished, which leads to an explosion when the still-burning embers ignite an enormous bottle of lighter fluid. Once the disaster's result is revealed, Mayhem warns that certain \"cut-rate\" policies lack coverage for the situation he has caused, advising the viewers to get their insurance policies through Allstate. Each commercial ends with Mayhem telling the viewers that by having Allstate, they will be \"better protected from mayhem...like me.\" Damage to his clothing and injuries to his person carry over from one commercial to the next. In some ads, Mayhem also has advised against going without roadside assistance. In separate advertisements, he described what could happen in the face of a catastrophe while driving; these consisted of having to stay in a creepy roadside motel overnight because one's car ran out of fuel, being forced to change a tire in a heavy downpour, being forced to stay at an awkward family gathering because one's car battery died, and potentially becoming a victim of crime due to a breakdown in the wrong neighborhood. A series of ads in early 2018 featured Mayhem with a New Year's resolution to help keep people and property safe. He took the role of various pieces of safety equipment, such as a lightning rod mounted on a house's roof to protect it during storms or a flare placed to warn drivers of a roadside vehicle breakdown. However, less than a month into the new year, he broke his resolution and returned to his old habit of causing chaos and damage. Allstate developed the campaign \"Mayhem\" and the character (Mayhem) in response to being ranked fourth in advertising spending behind GEICO, State Farm, and Progressive. Allstate had an existing campaign called \"Our Stand\" featuring Dennis Haysbert that targeted \"older, more traditional customers\", and the company sought to develop a campaign that would skew toward younger customers. Nina Abnee, executive vice president at Burnett, said \"We wanted to kick Flo's ass.\" The campaign was first launched in mid-June 2010. The character was featured in TV and radio spots as well as on billboards and Internet banners. Some ads were adjusted to capture local details. By mid-2011, Allstate had won around 80 industry awards for the campaign. There is a Hispanic version named La Mala Suerte (meaning Bad Luck) for the Spanish-speaking market portrayed by Alberto Mateo. Recognition Advertising Age reported in February 2011 that Mayhem rose to third as most-recognized insurance advertising character, behind the GEICO gecko and Flo from Progressive Insurance. An online survey showed that the GEICO gecko and Flo were each tied to their respective companies over 90% of the time. For Mayhem, the Age said, \"After the top two, the most-recognized ad description was Allstate, with 65% of consumers saying they knew the ad. When those same consumers were asked to associate it with a brand, 63% correctly matched Mayhem with Allstate. Overall, among the total sample, Mayhem clocked in with only 41% of respondents being able to link him to Allstate. Social media In January 2011, Allstate released The Lines, a multi-episode TV drama web series starring actors Teresa Cesario, Kyle Sandgate-Blix, Jackson Schultz, Bridgette Pechman, Chase Maser, and Corey Doyle cast as High-School seniors. The series, filmed in the style of a television drama, depicts the cast in common situations facing teens with respect to driving (Texting while driving in particular). The series appears aimed at promoting interest and support in favor of responsible teen driving and road safety in general. Allstate and other large corporations are attracted to the rapid growth of social media for use in their advertising campaigns. Organization Allstate Corporation owns and operates over 19 companies around the United States, United Kingdom, Canada and India. Based in San Francisco, California: Esurance, Inc. Based in Northbrook, Illinois: Allstate Fire and Casualty Insurance Company Allstate Insurance Company Allstate Indemnity Company Allstate Life Insurance Company Allstate Property and Casualty Insurance Company Encompass Insurance Company Allstate North American Insurance Company Allstate Vehicle and Property Insurance Company Based in Bridgewater, New Jersey: Allstate New Jersey Insurance Company Allstate New Jersey Property and Casualty Insurance Company Based in St. Petersburg, Florida: Castle Key Insurance Company Castle Key Indemnity Company Based in Irving, Texas: Allstate County Mutual Insurance Company Allstate Texas Lloyd's Based in Jacksonville, Florida: American Heritage Life Insurance Company Based in Northern Ireland, United Kingdom: Allstate Northern Ireland (ANI) Based in Markham, Ontario: Allstate Insurance Company of Canada Based in Bangalore, India: Allstate Solutions Private Limited Based in Pune, India: Allstate Solutions Private Limited Sponsorship Allstate Arena Allstate holds naming rights to the Allstate Arena in Rosemont, Illinois, near the company's headquarters. College football Allstate sponsors branded field goal nets at over 67 colleges and universities. For each field goal and extra point kicked, Allstate donates into collegiate general scholarship funds. To date, those donations exceed $2.9 million. Allstate also sponsors branded nets during field goals and extra points at over 20 college bowl games, including the Allstate Sugar Bowl and the BCS National Championship Game. Additionally, Allstate is a partner of the Southeastern Conference and its 20 sports, including football. Sugar Bowl Since 2007, Allstate has been the title sponsor of the Sugar Bowl, one of the four games that make up the Bowl Championship Series. The game is played at the Mercedes-Benz Superdome, which is also the home of the New Orleans Saints. Allstate is also a sponsor of the New Orleans Saints. The 2012 Allstate BCS National Championship Game was played on January 9, 2012, and broadcast on ESPN. Allstate Wrigleyville Classic The Northwestern Wildcats and the Illinois Fighting Illini played a collegiate football game at Wrigley Field on November 20, 2010. It was the first football game at Wrigley Field since 1970 and the first collegiate football game at Wrigley Field since 1938 when DePaul University played its regular games at Wrigley. Allstate title sponsored this game. Allstate AFCA Good Works Team Allstate advertises through the American Football Coaches Association \"Good Works Team\" in which local Allstate agents surprise players with trophies in key Allstate marketing regions. Soccer In 2007, Allstate became a sponsor of the Mexico National Team, and in 2011 partnered with Major League Soccer and the United States Soccer Federation. NASCAR Allstate was a sponsor of the Allstate 400 at the Brickyard from 2005 to 2009 – the annual NASCAR Sprint Cup Series race held at Indianapolis Motor Speedway in late summer. Driver Kasey Kahne was featured in advertisements. Criticism In July 2008, the American Association for Justice ranked Allstate No. 1 among nation's worst insurers. This ranking was given because: \"While Allstate publicly touts its 'good hands' approach, it has instead privately instructed its agents to employ a 'boxing gloves' strategy against its policyholders,\" said American Association for Justice CEO Jon Haber. Allstate criticized the report, with a spokesman noting that \"The personal injury lawyers behind this report provide no evidence for their statements other than decade old recycled allegations that have been shown to be without merit in courts of law.\" In 2009, Allstate successfully fought for federal government TARP fund eligibility only to decline it once they obtained eligibility. Auto insurance claims An investigative report in February 2007 by CNN revealed that major car insurance companies, like Allstate, are increasingly disputing auto insurance claims from individuals injured by their insured members. In 2010 Allstate commanded 18% of the auto insurance market in the United States. Homeowners claims The PBS television program Now, in conjunction with Bloomberg Markets magazine, did an exposé regarding Allstate and other major insurers' homeowners insurance policies. Catastrophe exposure management Allstate has stated intentions of reducing its exposure in hurricane-prone Florida. In November 2006, the company did not renew 120,000 policies that were expiring at that time. Governor Charlie Crist and the Florida Cabinet passed a 90-day emergency order to temporarily prevent insurance companies from not renewing policies. On February 20, 2007, Florida Insurance Commissioner Kevin McCarty clarified the order, stating that insurance companies can nonrenew policies if they satisfy certain conditions, including filing new, lower rates with the state and give customers 100 days’ notice. From Good Hands to Boxing Gloves From Good Hands to Boxing Gloves is a non-fiction work on the company written by David Berardinelli, Michael Freeman, and Aaron DeShaw with a foreword by Eugene R. Anderson. The book relates profit-boosting strategies that consulting firm McKinsey & Company presented to Allstate to maximize profits and diminish the amount of money sent to clients who put in a claim. McKinsey specializes in redesigning product delivery systems for Fortune 100 companies (including controversial clients such as Enron) to maximize profits. McKinsey's recommendation to Allstate, according to Berardinelli, was to low-ball claims so that desperate customers in dire straits would be more likely to accept a settlement offer while Allstate continued to make a profit and collect interest on the insurance payment. Allstate would offer its \"good hands\" in the way of a low-ball claim and, if the customer did not accept, to get out \"boxing gloves.\" According to a 2006 review in Business Week magazine, Allstate responded to Berardinelli's allegations by claiming that Berardinelli's allegations were \"unfounded and unproven.\" Legal decisions on the issues outlined in the book have led to varied outcomes in court. According to the Business Week article, \"Courts and regulators in a number of states, including New York, Pennsylvania, and Washington, have forced Allstate to halt or change its practice of handing out a controversial 'Do I Need an Attorney?' form to people involved in accidents.\" On the other hand, the article also states that seven court rulings had rejected attacks on the practice. While many of the cost-reduction strategies McKinsey recommended at Allstate remain in place, some were ended by legal and regulatory challenges. Use of Colossus Many criticisms leveled against Allstate (and other insurers), including Barardinelli's book, involved the use of a software program called \"Colossus\" to process claims. In 2010, Allstate paid a $10 million fine to settle a lawsuit brought by 41 states concerning inconsistencies in the manner in which Colossus was used. It also agreed to standardize its use of the software. However, “it is important to note that we found no systemic underpayment of bodily injury claims,” New York Insurance Superintendent James J. Wrynn said in a press release."
}