{
  "ticker": "ALLE",
  "cik": "0001579241",
  "company_name": "Allegion",
  "corrected_name": "Allegion",
  "wiki_title_used": "Allegion",
  "exists": true,
  "raw_text": "Allegion plc is an American Irish-domiciled provider of security products for homes and businesses.\nThough it comprises thirty-one global brands, including CISA, Interflex, LCN, Schlage and Von Duprin, the company operates through two main sections: Allegion International and Allegion Americas. The company employs around 12,000 people, sells its products in more than 130 countries across the world and in 2022 generated revenues of US$3.27 billion.\nIt is part of the S&P 500 and headquartered in Dublin.\n\nHistory\nAllegion spun off from Ingersoll Rand Plc on 1 December 2013, and became a standalone, publicly traded company. This placed Allegion on the S&P 500, where it replaced JC Penney.\nDavid D. Petratis was announced chairman of the board, chief executive officer and president of the company, in August 2013. As of 2022, John H. Stone became the president and chief executive officer of the company. Petratis remains the chairman of the board until Jan 2, 2023.\n\nMergers and subsidiaries\nOn 8 January 2014, Allegion acquired certain assets of Schlage Lock de Colombia S.A., the second largest mechanical lock manufacturer in Colombia, with revenues of US$12 million. The acquisition gave Allegion a 45,000 square foot integrated plant in Bogota, Colombia, and approximately 350 new employees.\nOn 22 April 2022, Allegion acquired Stanley Access Technologies LLC\n\nCorporate affairs\nManagement and leadership\nThe company is managed by President and CEO, John H. Stone. Prior to his appointment as CEO of Allegion, Stone held the position of President within Deere & Company’s Worldwide Construction, Forestry and Power Systems business.\nStone is responsible for the strategic direction of the company alongside an Executive Team comprising 10 members.\n\nLocations\nAllegion is headquartered in Dublin, Ireland. Its regional offices for the Americas are in Carmel, Indiana, United States. Its European regional offices are in Faenza, Italy, and the company's Asian headquarters are in Tower B of City Center of Shanghai in Shanghai, China.\nProduction facilities are located in Colombia, Mexico, Europe, the Middle East, Australasia, the U.S. and New Zealand.\n\nOwnership\nAs of 2017, Allegion shares are mainly held by institutional investors (T. Rowe Price, Vanguard Group, JPMorgan Chase and others).\n\nBrands and subsidiaries\nAllegion Ventures\nIn March 2018, the company launched the venture capital fund, Allegion Ventures. The aim is to invest in early stage companies in the sectors security and smart access. The initial funding was $50 million. The following companies are part of the Allegion Ventures Programme:\n\nConneqtech (GPS Tracking)\niDevices (Smart home devices, exited 2017)\nNuki (Smart lock)\nMint House\nMapped, raised $6.5M Seed II in 2021\n\nProducts and services\nAllegion manufactures and supplies electronic (including biometric) and mechanical security products to a range of end-users worldwide, including government, healthcare, hospitality, education, commercial, institutional, single and multi-family residential markets.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Allegion plc:",
  "clean_text": "Allegion plc is an American Irish-domiciled provider of security products for homes and businesses. Though it comprises thirty-one global brands, including CISA, Interflex, LCN, Schlage and Von Duprin, the company operates through two main sections: Allegion International and Allegion Americas. The company employs around 12,000 people, sells its products in more than 130 countries across the world and in 2022 generated revenues of US$3.27 billion. It is part of the S&P 500 and headquartered in Dublin. History Allegion spun off from Ingersoll Rand Plc on 1 December 2013, and became a standalone, publicly traded company. This placed Allegion on the S&P 500, where it replaced JC Penney. David D. Petratis was announced chairman of the board, chief executive officer and president of the company, in August 2013. As of 2022, John H. Stone became the president and chief executive officer of the company. Petratis remains the chairman of the board until Jan 2, 2023. Mergers and subsidiaries On 8 January 2014, Allegion acquired certain assets of Schlage Lock de Colombia S.A., the second largest mechanical lock manufacturer in Colombia, with revenues of US$12 million. The acquisition gave Allegion a 45,000 square foot integrated plant in Bogota, Colombia, and approximately 350 new employees. On 22 April 2022, Allegion acquired Stanley Access Technologies LLC Corporate affairs Management and leadership The company is managed by President and CEO, John H. Stone. Prior to his appointment as CEO of Allegion, Stone held the position of President within Deere & Company’s Worldwide Construction, Forestry and Power Systems business. Stone is responsible for the strategic direction of the company alongside an Executive Team comprising 10 members. Locations Allegion is headquartered in Dublin, Ireland. Its regional offices for the Americas are in Carmel, Indiana, United States. Its European regional offices are in Faenza, Italy, and the company's Asian headquarters are in Tower B of City Center of Shanghai in Shanghai, China. Production facilities are located in Colombia, Mexico, Europe, the Middle East, Australasia, the U.S. and New Zealand. Ownership As of 2017, Allegion shares are mainly held by institutional investors (T. Rowe Price, Vanguard Group, JPMorgan Chase and others). Brands and subsidiaries Allegion Ventures In March 2018, the company launched the venture capital fund, Allegion Ventures. The aim is to invest in early stage companies in the sectors security and smart access. The initial funding was $50 million. The following companies are part of the Allegion Ventures Programme: Conneqtech (GPS Tracking) iDevices (Smart home devices, exited 2017) Nuki (Smart lock) Mint House Mapped, raised $6.5M Seed II in 2021 Products and services Allegion manufactures and supplies electronic (including biometric) and mechanical security products to a range of end-users worldwide, including government, healthcare, hospitality, education, commercial, institutional, single and multi-family residential markets."
}