{
  "ticker": "AMCR",
  "cik": "0001748790",
  "company_name": "Amcor",
  "corrected_name": "Amcor",
  "wiki_title_used": "Amcor",
  "exists": true,
  "raw_text": "Amcor plc is an Australian-founded Jersey-domiciled global packaging company based in Switzerland. It develops and produces flexible packaging, rigid containers, specialty cartons, closures and services for food, beverage, pharmaceutical, medical-device, home and personal-care, and other products.\nThe company originated in paper milling businesses established in and around Melbourne, Australia, during the 1860s which were consolidated as the Australian Paper Mills Company Pty. Ltd., in 1896.\nAmcor is a cross-listed company, being listed on the Australian Securities Exchange as \"AMC\" and New York Stock Exchange as \"AMCR\". As of 30 June 2025, the company employed 77,000 people and generated US$15 billion in sales from operations in some 210 locations in over 36 countries.\n\nHistory\nAustralian Paper Manufacturers was renamed Amcor Limited in 1986. Previously, the company manufactured pulp paper and paperboard products, along with metal can and flexible packaging.\n\n2000s\nThe printing paper divisions were spun-off into a new company, named Paperlinx, in April 2000. This demerger was intended to enable Amcor to focus on global packaging.\nAmcor's 45 percent interest in Kimberly-Clark Australia, a tissue and personal-care products company, was divested in June 2002.\n\nIn July 2002, Amcor acquired the rigid packaging and closures businesses of Schmalbach-Lubeca, headquartered in Ratingen, Germany. This acquisition, at a cost of around $2.875 billion, made Amcor the largest manufacturer of PET (Polyethylene terephthalate) containers, globally.\nIn 2007, Amcor sold its European PET business to La Seda, a Spain-based manufacturer.\n\n2010s\nIn February 2008, Amcor announced the construction of a 400,000-tonnes per annum recycled paper mill located at its existing paper mill in Botany, New South Wales. The 'B9' paper machine, so named as it was the ninth paper machine to operate at the Botany Mill, was commissioned in 2012 and was officially opened by the Premier of New South Wales, Barry O'Farrell, on 1 February 2013. The B9 paper machine produced enough paper to fulfill the company's Australasian paper requirements, and as a result, Amcor's other recycled paper mill in Fairfield, Victoria, closed in late 2012.\nIn 2010, Amcor completed the acquisition of Alcan's food (Europe and Asia) and global pharmaceutical and tobacco businesses from Rio Tinto for US$2.03 billion. In 2011, Amcor acquired Marfred Industries, one of the largest independently owned packaging manufacturers and distributors in the United States. In 2012, Amcor acquired the business assets of Carter & Associates, a major distributor of Amcor glass wine, champagne and spirit bottles in New Zealand. In 2012, Amcor acquired the Aperio Group packaging company, adding further capability in Australia, New Zealand and Thailand. This company also acquired Uniglobe Packaging, a business based in Daman, north of Mumbai, India, in the same year.\nIn December 2013, Amcor demerged its Australasia and Packaging Distribution (AAPD) business into a separate company called Orora, which is listed on the Australian Securities Exchange. The spin-off allowed Amcor to focus on making flexible- and rigid-plastic packaging and tobacco packaging, mostly for overseas markets.\nIn 2015, Amcor's chairman, Graeme Liebelt, advised that Ken MacKenzie would retire as CEO effective 17 April 2015 and would be succeeded by Ron Delia.\nIn July 2015, Nampak Flexibles, a flexible packaging business in South Africa was acquired by Amcor for US$22 million. In September 2015, the US$30 million acquisition of Souza Cruz's internal tobacco packaging operations in Brazil was completed. This acquisition aligned with Amcor's objective of growing in Latin America. In October 2015, the US$55 million acquisition of Encon, a privately owned preform manufacturing business in the United States, was completed. In December 2015, the US$45 million acquisition of Deluxe Packages was completed. The business operated one manufacturing plant in Yuba City, California.\nIn May 2016, Amcor acquired Canadian company Plastics Moulders Limited for US$32 million. The rigid plastics business manufactured containers and closures for the food, home, and personal-care markets in North America from a single plant in Toronto. In June 2016, Amcor acquired Alusa, the largest flexible packaging business in South America for a purchase price of US$435 million. It was the largest flexible packaging manufacturer and supplier in Chile and Peru, and a participant in Colombia and Argentina, with one plant in each of these four countries. In November 2016, the specialty containers business of Sonoco Products Company, a manufacturer of specialty rigid plastic containers, was acquired by Amcor for US$280 million. The former Sonoco business had six production sites in the United States and one in Canada.\nIn January 2017, Amcor acquired Qite for US$28 million. The North China business produced flexible packaging products to large domestic customers in the dairy and food segments. In May 2017, Amcor acquired Plasticos, a specialty container business, from a leading food producer in Colombia. The acquisition expanded Amcor’s specialty container product offerings in Latin America, including thin-wall injection moulding and in-mould labelling.\nIn August 2018, Amcor announced the acquisition of Bemis Company, a US-based manufacturer, through the acquisition of US$5.25 billion in shares.\nAmcor purchased Marfred Industries in 2018, making it one of the largest independently held package makers and distributors in the United States.\n\n2020s\nIn August 2023, it was announced Amcor had acquired the Gujarat-based flexible packaging company, Phoenix Flexibles, for an undisclosed amount.\nIn November 2024, Amcor entered into an agreement to acquire US-based Berry Global for A$13 billion in stock.\n\nStructure\nAmcor has two reporting segments: Flexibles Packaging and Rigid Plastics.\nFlexibles Packaging develops and supplies flexible packaging and specialty folding cartons. It has four business units: Flexibles Europe, Middle East and Africa; Flexibles Americas; Flexibles Asia Pacific; and Specialty Cartons.\nRigid Plastics is one of the world's largest suppliers of rigid plastic packaging. It has four business units: North America Beverages; North America Specialty Containers; Latin America; and Bericap Closures.\n\nProducts\nAmcor develops and produces packaging for use with snacks and confectionery, cheese and yoghurt, fresh produce, beverage and pet food products, and rigid-plastic containers for brands in the food, beverage, pharmaceutical, and personal and home-care segments.\nThe company's global pharmaceutical packaging addresses requirements for unit doses, safety, patient compliance, anti-counterfeiting and sustainability.\nAmcor's specialty cartons made from plastic materials are used for a variety of end markets, including pharmaceutical, healthcare, food, spirits and wine, personal and home-care products. Amcor also develops and makes wine and spirit closures.\nIn February 2018, the company commercialised its Liquiform technology, which uses the packaged product instead of compressed air to simultaneously form and fill plastic containers and eliminates costs associated with traditional blow-molding, as well as handling, transporting, and warehousing empty containers.\n\nControversies\nIn 2001, Amcor was fined A$10,000 by EPA Victoria for pollution.\nIn 2006, a Four Corners story, titled \"The A Team\", revealed the controversial methods used by Amcor to influence forestry policies.\nIn 2007, following investigations by the Australian Competition & Consumer Commission, Amcor and Visy were found to have engaged in price fixing and market sharing in the market for the supply of corrugated fibreboard packaging. In 2007, Amcor was convicted by the Heidelberg Magistrates' Court for releasing oil to the Yarra River from its Alphington plant and fined $80,000.\nIn 2021, Amcor was ranked seventh on Michael West's \"Top 40 Tax Dodgers in Australia\".\n\nReferences\nFurther reading\nE.K. Sinclair, \"The Spreading Tree, A history of APM and Amcor 1844-1989\", Allen & Unwin, 1990\nAmcor's History Archived 26 September 2017 at the Wayback Machine\n\nExternal links\nOfficial website\nBusiness data for Amcor plc:",
  "clean_text": "Amcor plc is an Australian-founded Jersey-domiciled global packaging company based in Switzerland. It develops and produces flexible packaging, rigid containers, specialty cartons, closures and services for food, beverage, pharmaceutical, medical-device, home and personal-care, and other products. The company originated in paper milling businesses established in and around Melbourne, Australia, during the 1860s which were consolidated as the Australian Paper Mills Company Pty. Ltd., in 1896. Amcor is a cross-listed company, being listed on the Australian Securities Exchange as \"AMC\" and New York Stock Exchange as \"AMCR\". As of 30 June 2025, the company employed 77,000 people and generated US$15 billion in sales from operations in some 210 locations in over 36 countries. History Australian Paper Manufacturers was renamed Amcor Limited in 1986. Previously, the company manufactured pulp paper and paperboard products, along with metal can and flexible packaging. 2000s The printing paper divisions were spun-off into a new company, named Paperlinx, in April 2000. This demerger was intended to enable Amcor to focus on global packaging. Amcor's 45 percent interest in Kimberly-Clark Australia, a tissue and personal-care products company, was divested in June 2002. In July 2002, Amcor acquired the rigid packaging and closures businesses of Schmalbach-Lubeca, headquartered in Ratingen, Germany. This acquisition, at a cost of around $2.875 billion, made Amcor the largest manufacturer of PET (Polyethylene terephthalate) containers, globally. In 2007, Amcor sold its European PET business to La Seda, a Spain-based manufacturer. 2010s In February 2008, Amcor announced the construction of a 400,000-tonnes per annum recycled paper mill located at its existing paper mill in Botany, New South Wales. The 'B9' paper machine, so named as it was the ninth paper machine to operate at the Botany Mill, was commissioned in 2012 and was officially opened by the Premier of New South Wales, Barry O'Farrell, on 1 February 2013. The B9 paper machine produced enough paper to fulfill the company's Australasian paper requirements, and as a result, Amcor's other recycled paper mill in Fairfield, Victoria, closed in late 2012. In 2010, Amcor completed the acquisition of Alcan's food (Europe and Asia) and global pharmaceutical and tobacco businesses from Rio Tinto for US$2.03 billion. In 2011, Amcor acquired Marfred Industries, one of the largest independently owned packaging manufacturers and distributors in the United States. In 2012, Amcor acquired the business assets of Carter & Associates, a major distributor of Amcor glass wine, champagne and spirit bottles in New Zealand. In 2012, Amcor acquired the Aperio Group packaging company, adding further capability in Australia, New Zealand and Thailand. This company also acquired Uniglobe Packaging, a business based in Daman, north of Mumbai, India, in the same year. In December 2013, Amcor demerged its Australasia and Packaging Distribution (AAPD) business into a separate company called Orora, which is listed on the Australian Securities Exchange. The spin-off allowed Amcor to focus on making flexible- and rigid-plastic packaging and tobacco packaging, mostly for overseas markets. In 2015, Amcor's chairman, Graeme Liebelt, advised that Ken MacKenzie would retire as CEO effective 17 April 2015 and would be succeeded by Ron Delia. In July 2015, Nampak Flexibles, a flexible packaging business in South Africa was acquired by Amcor for US$22 million. In September 2015, the US$30 million acquisition of Souza Cruz's internal tobacco packaging operations in Brazil was completed. This acquisition aligned with Amcor's objective of growing in Latin America. In October 2015, the US$55 million acquisition of Encon, a privately owned preform manufacturing business in the United States, was completed. In December 2015, the US$45 million acquisition of Deluxe Packages was completed. The business operated one manufacturing plant in Yuba City, California. In May 2016, Amcor acquired Canadian company Plastics Moulders Limited for US$32 million. The rigid plastics business manufactured containers and closures for the food, home, and personal-care markets in North America from a single plant in Toronto. In June 2016, Amcor acquired Alusa, the largest flexible packaging business in South America for a purchase price of US$435 million. It was the largest flexible packaging manufacturer and supplier in Chile and Peru, and a participant in Colombia and Argentina, with one plant in each of these four countries. In November 2016, the specialty containers business of Sonoco Products Company, a manufacturer of specialty rigid plastic containers, was acquired by Amcor for US$280 million. The former Sonoco business had six production sites in the United States and one in Canada. In January 2017, Amcor acquired Qite for US$28 million. The North China business produced flexible packaging products to large domestic customers in the dairy and food segments. In May 2017, Amcor acquired Plasticos, a specialty container business, from a leading food producer in Colombia. The acquisition expanded Amcor’s specialty container product offerings in Latin America, including thin-wall injection moulding and in-mould labelling. In August 2018, Amcor announced the acquisition of Bemis Company, a US-based manufacturer, through the acquisition of US$5.25 billion in shares. Amcor purchased Marfred Industries in 2018, making it one of the largest independently held package makers and distributors in the United States. 2020s In August 2023, it was announced Amcor had acquired the Gujarat-based flexible packaging company, Phoenix Flexibles, for an undisclosed amount. In November 2024, Amcor entered into an agreement to acquire US-based Berry Global for A$13 billion in stock. Structure Amcor has two reporting segments: Flexibles Packaging and Rigid Plastics. Flexibles Packaging develops and supplies flexible packaging and specialty folding cartons. It has four business units: Flexibles Europe, Middle East and Africa; Flexibles Americas; Flexibles Asia Pacific; and Specialty Cartons. Rigid Plastics is one of the world's largest suppliers of rigid plastic packaging. It has four business units: North America Beverages; North America Specialty Containers; Latin America; and Bericap Closures. Products Amcor develops and produces packaging for use with snacks and confectionery, cheese and yoghurt, fresh produce, beverage and pet food products, and rigid-plastic containers for brands in the food, beverage, pharmaceutical, and personal and home-care segments. The company's global pharmaceutical packaging addresses requirements for unit doses, safety, patient compliance, anti-counterfeiting and sustainability. Amcor's specialty cartons made from plastic materials are used for a variety of end markets, including pharmaceutical, healthcare, food, spirits and wine, personal and home-care products. Amcor also develops and makes wine and spirit closures. In February 2018, the company commercialised its Liquiform technology, which uses the packaged product instead of compressed air to simultaneously form and fill plastic containers and eliminates costs associated with traditional blow-molding, as well as handling, transporting, and warehousing empty containers. Controversies In 2001, Amcor was fined A$10,000 by EPA Victoria for pollution. In 2006, a Four Corners story, titled \"The A Team\", revealed the controversial methods used by Amcor to influence forestry policies. In 2007, following investigations by the Australian Competition & Consumer Commission, Amcor and Visy were found to have engaged in price fixing and market sharing in the market for the supply of corrugated fibreboard packaging. In 2007, Amcor was convicted by the Heidelberg Magistrates' Court for releasing oil to the Yarra River from its Alphington plant and fined $80,000. In 2021, Amcor was ranked seventh on Michael West's \"Top 40 Tax Dodgers in Australia\"."
}