{
  "ticker": "AME",
  "cik": "0001037868",
  "company_name": "Ametek",
  "corrected_name": "Ametek",
  "wiki_title_used": "Ametek",
  "exists": true,
  "raw_text": "AMETEK, Inc. is an American multinational conglomerate and global designer and manufacturer of electronic instruments and electromechanical devices with headquarters in the United States and over 150 sites worldwide.\nThe company was founded in 1930. The company's original name, American Machine and Metals, was changed to AMETEK in the early 1960s, reflecting its evolution from a provider of heavy machinery to a manufacturer of analytical instruments, precision components and specialty materials.\nAMETEK has been ranked as high as 402 on the Fortune 500. The firm has also consistently been on the Fortune 1000 rankings list as well as the Fortune Global 2000.\nThe overall strategy for the organization is made up of 4 components: Operational Excellence (cost control), New Product Development, International/Market Expansion, and Acquisitions.\nThe firm has two operating groups (the Electronic Instruments Group and the Electromechanical Group). Together, these groups and their divisions comprise over 100 brands, including analytical instruments, monitoring, testing and calibration devices as well as electrical motors, pumps and interconnects. The company's headquarters is in Berwyn, Pennsylvania.\nAMETEK is listed on the New York Stock Exchange. Its common stock is a component of the S&P 500 index and the Russell 1000 index.\n\nAcquisition history\nHistory prior to 1999 is incomplete.\n\nDivisions\nAbaco Systems\nRugged embedded electronics used in various industries.\nAerospace & Defense\nEngine and avionics. Other aviation products and components.\n\nCreaform\nCreaform manufactures metrology and 3D engineering devices for use in shop-floor environments It is based in Lévis, Quebec, Canada.  The company was founded in 2002 by Martin Lamontagne and two co-workers at Modelex. It began with a $200,000 loan from the Business Development Bank of Canada.  In 2009, the company sold its 1000th laser scanner, priced from $50 –100,000. Creaform was acquired by Ametek in 2013 for $120 million in cash. At the time, Creaform had annual sales of $52 million. In 2017, Creaform opened a new, $20 million, headquarters in Levis. The 76,000 square foot  headquarters is double the size of the old one, allowing Creaform to triple its production.\nHeavy Vehicle and OEM\nMotors, blowers, pumps, and other parts for heavy trucks and vehicles.\nMaterials Analysis and Imaging\nIncludes imaging products used in TV and movie production and tools such as Ion Mass spectrometers, electron Probe Microanalysis, Low-energy electron induced X-ray emission spectrometry, and atom Probe tomography.\nRauland\nHealthcare (hospitals) and Education (schools) communication systems.\nOil & Gas / Power\nProducts for use in refineries and labs. Includes process analyzers, fuel analyzers, sample conditioning and heated and jacketed tubing.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Ametek: \n\nCompany profile at Reuters\nCompany history at Fundinguniverse\nCreaform website",
  "clean_text": "AMETEK, Inc. is an American multinational conglomerate and global designer and manufacturer of electronic instruments and electromechanical devices with headquarters in the United States and over 150 sites worldwide. The company was founded in 1930. The company's original name, American Machine and Metals, was changed to AMETEK in the early 1960s, reflecting its evolution from a provider of heavy machinery to a manufacturer of analytical instruments, precision components and specialty materials. AMETEK has been ranked as high as 402 on the Fortune 500. The firm has also consistently been on the Fortune 1000 rankings list as well as the Fortune Global 2000. The overall strategy for the organization is made up of 4 components: Operational Excellence (cost control), New Product Development, International/Market Expansion, and Acquisitions. The firm has two operating groups (the Electronic Instruments Group and the Electromechanical Group). Together, these groups and their divisions comprise over 100 brands, including analytical instruments, monitoring, testing and calibration devices as well as electrical motors, pumps and interconnects. The company's headquarters is in Berwyn, Pennsylvania. AMETEK is listed on the New York Stock Exchange. Its common stock is a component of the S&P 500 index and the Russell 1000 index. Acquisition history History prior to 1999 is incomplete. Divisions Abaco Systems Rugged embedded electronics used in various industries. Aerospace & Defense Engine and avionics. Other aviation products and components. Creaform Creaform manufactures metrology and 3D engineering devices for use in shop-floor environments It is based in Lévis, Quebec, Canada. The company was founded in 2002 by Martin Lamontagne and two co-workers at Modelex. It began with a $200,000 loan from the Business Development Bank of Canada. In 2009, the company sold its 1000th laser scanner, priced from $50 –100,000. Creaform was acquired by Ametek in 2013 for $120 million in cash. At the time, Creaform had annual sales of $52 million. In 2017, Creaform opened a new, $20 million, headquarters in Levis. The 76,000 square foot headquarters is double the size of the old one, allowing Creaform to triple its production. Heavy Vehicle and OEM Motors, blowers, pumps, and other parts for heavy trucks and vehicles. Materials Analysis and Imaging Includes imaging products used in TV and movie production and tools such as Ion Mass spectrometers, electron Probe Microanalysis, Low-energy electron induced X-ray emission spectrometry, and atom Probe tomography. Rauland Healthcare (hospitals) and Education (schools) communication systems. Oil & Gas / Power Products for use in refineries and labs. Includes process analyzers, fuel analyzers, sample conditioning and heated and jacketed tubing."
}