{
  "ticker": "AMGN",
  "cik": "0000318154",
  "company_name": "Amgen",
  "corrected_name": "Amgen",
  "wiki_title_used": "Amgen",
  "exists": true,
  "raw_text": "Amgen Inc. is an American multinational biopharmaceutical company headquartered in Thousand Oaks, California. The company is ranked 18th on the list of largest biomedical companies by revenue. The name \"AMGen\" is a portmanteau of the company's original name, Applied Molecular Genetics.\nThe company's major products are Prolia and XGEVA (Denosumab) for treatment of osteoporosis and bone diseases ($6.7 billion in total 2024 revenues), Enbrel (Etanercept) for treatment of autoimmune diseases ($3.3 billion in 2024 revenues), Repatha (evolocumab) for treatment of hyperlipidemia ($2.3 billion in 2024 revenues), Otezla (apremilast) for treatment of psoriasis and psoriatic arthritis ($2.1 billion in 2024 revenues), Tepezza (teprotumumab) to treat Graves' ophthalmopathy ($1.8 billion in 2024 revenues), Evenity (romosozumab) to treat osteoporosis ($1.5 billion in 2024 revenues), Kyprolis (carfilzomib) to treat cancer ($1.5 billion in 2024 revenues), Nplate (romiplostim) to regulate platelet production ($1.4 billion in 2024 revenues), and Aranesp (darbepoetin alfa) to stimulate erythropoiesis ($1.3 billion in 2024 revenues).\nAmgen has 17 clinical programs underway in Phase III, eight in Phase II, and 19 in Phase I. Its pipeline includes MariTide, an anti-obesity medication administered once per month by injection.\nThe company receives approximately 80% of its revenues from sales to the three large U.S. drug wholesalers: McKesson Corporation, Cencora, and Cardinal Health.\nThe company is ranked 134th on the Fortune 500 and 202nd on the Forbes Global 2000.\n\nHistory\nIn April 1980, Amgen was founded in Thousand Oaks as Applied Molecular Genetics. Amgen was backed by a small group of venture capitalists, and its early focus was on recombinant DNA technology and recombinant human insulin.\nIts initial scientific advisory board consisted of Norman Davidson, Leroy Hood, Arnold Berk, John Carbon, Robert Schimke, Arno Motulsky, Marvin H. Caruthers, and Dave Gibson. In October 1980, Amgen named George Rathmann its first president and chief executive officer.\nOn June 17, 1983, Amgen became a public company via an initial public offering, selling two million common shares and raising nearly $40 million. That same year, after more than two years of work, an Amgen research team led by Fu-Kuen Lin found and cloned the erythropoietin gene, a protein created in the kidney that stimulates red blood cell production. Lin's team created what would become Epogen (epoetin alfa).\nIn June 1984, Amgen and Kirin formed a joint venture giving Kirin the rights to Epogen in Japan. A year later, Amgen researcher Larry Souza and his team cloned granulocyte colony-stimulating factor (G-CSF), leading to the development of Neupogen (filgrastim).\nIn October 1988, Gordon Binder was named CEO, succeeding George Rathmann. The following year, in 1989, Amgen received approval for the first recombinant human erythropoetin product, Epogen (epoetin alfa).\nIn February 1991, Amgen received FDA approval for Neupogen for the prevention of infections in patients whose immune systems are suppressed due to cancer chemotherapy.\nAmgen opened a new manufacturing facility in Puerto Rico, in March 1993, which later became the company's flagship manufacturing site.\nIn 1994, Amgen became the fifth company to receive the National Medal of Technology and Innovation from the United States Department of Commerce, in recognition of its work developing medicines to improve quality of life for kidney and cancer patients. Also around this time, Amgen researcher Steve Elliott and his team added more sugar molecules to erythropoietin, causing it to remain in the body longer. This led to the development of Aranesp (darbepoetin alfa).\n\n2000–2014\nBinder was succeeded as CEO by Kevin W. Sharer in 2000. Robert A. Bradway became Amgen's president and chief executive officer in May 2012, following Sharer's retirement.\nIn June 2010, Amgen received approval by the Food and Drug Administration for Prolia, a protein drug for the treatment of post-menopausal osteoporosis. In clinical trials, Prolia reduced the rate of vertebral fractures by 61% and the risk of hip fractures by 40%. In November 2010, the FDA approved Xgeva for the prevention of complications of bone metastases in patients with solid tumors. The clinical trials primarily enrolled patients with breast or prostate cancer.\nIn March 2011, Amgen acquired a manufacturing facility near Dublin, Ireland.\nAmgen opened an affiliate in China in 2013.\nIn November 2014, the company halted all trials of rilotumumab in advanced gastric cancer patients after one of the trials found more deaths in those who took the compound with chemotherapy, than those without. Also in November 2014, the company, in conjunction with AstraZeneca, reported positive results for brodalumab in a Phase III trial comparing the compound with ustekinumab and a placebo in treating psoriasis. In the same month, construction was completed on Amgen's next-generation biomanufacturing facility in Singapore. Blincyto (blinatumomab) was approved by the FDA in December of that year.\n\n2015–2020\nIn March 2015, the company announced that it would license its Phase II candidate drug AMG 714 to Celimmune, which will develop the anti-IL-15 monoclonal antibody for treatment against diet nonresponsive celiac disease and refractory celiac disease. In August 2015, Repatha (evolocumab) was approved by the FDA.\nIn September 2016, the company announced it would purchase the rights to Boehringer Ingelheims Phase I bispecific T-cell engager compound (BI 836909, now AMG 420) for use in the treatment of multiple myeloma. Also in September, the FDA approved Amjevita (adalimumab-atto). The FDA approved Parsabiv in February 2017 and Mvasi (bevacizumab-awwb) in September.\nIn July 2018, Amgen began constructing a biomanufacturing plant at its campus in West Greenwich, Rhode Island.\nIn January 2019, Evenity (romosozumab) received approval in Japan, followed by FDA approval in April. In June, Kanjinti (trastuzumab-anns) was approved by the FDA.\nIn December 2019, the FDA approved Avsola (infliximab-axxq).\nIn September 2019, FDA granted fast track designation to sotorasib for the treatment of metastatic non-small-cell lung carcinoma (NSCLC) with the KRAS G12C mutation.\nIn April 2020, Amgen established Amgen K.K. as the company's wholly owned affiliate in Japan. The company announced in July that the United States Court of Appeals for the Federal Circuit had upheld the validity of two Amgen patents that described and claimed Enbrel and methods for making it. The appellate court affirmed an August 2019 decision by the United States District Court for the District of New Jersey and rejected Sandoz's attempt to invalidate the patents on Enbrel.\nIn August 2020, Amgen, Takeda Pharmaceutical Company, and AbbVie, as part of a COVID-19 research and development (R&D) alliance, announced the first patients enrolled in the I-SPY COVID clinical trial. The trial evaluated the efficacy of Otezla and two other medicines in severely ill, hospitalized COVID-19 patients who required high-flow oxygen.\nIn September 2020, Amgen and Eli Lilly and Company announced a global manufacturing collaboration for COVID-19 antibody therapies.\nIn October 2020, Amgen announced positive topline Phase 2 results from the CodeBreaK 100 clinical study, evaluating sotorasib in 126 patients with KRAS G12C-mutant advanced NSCLC who had failed three or fewer prior lines of anti-cancer therapies (including immunotherapy and/or chemotherapy). Amgen, the Global Coalition for Adaptive Research, and Eisai Co., Ltd. also announced enrollment of the first patient in a study testing multiple interventions for the treatment of patients hospitalized with COVID-19.\nIn November 2020, Amgen, Takeda, and UCB, as part of the COVID R&D alliance, announced the first patient enrolled in another trial evaluating Otezla and two other drugs as treatments for COVID-19. Amgen also announced that it would terminate its collaboration with Cytokinetics and transition the development and commercialization rights for omecamtiv mecarbil and AMG 594. Amgen and AstraZeneca announced positive topline results from a Phase 3 trial in which the investigational medicine tezepelumab demonstrated a statistically significant reduction in exacerbations in patients with severe asthma.\nIn December 2020, the FDA granted breakthrough therapy designation to sotorasib for advanced or metastatic non-small cell lung cancer patients with KRAS G12C mutation. Also in December 2020, the FDA approved Riabni (rituximab-arrx), a biosimilar to Rituxan.\nIn April 2021, the company acquired Five Prime Therapeutics and its lead candidate, bemarituzumab, for $1.9 billion.\nIn the March 2021, Amgen acquired Rodeo Therapeutics for $720 million.\nIn May 2021, sotorasib received accelerated approval from FDA for treatment of adult patients with NSCLC whose tumors have a KRAS G12C mutation and who have received at least one prior systemic therapy; this was the first approved targeted therapy for tumors with any KRAS mutation. Similar approvals for sotorasib in NSCLC followed in January 2022 in Europe and Japan. The FDA approved Amgen's Lumakras in May for treatment of patients with KRAS-G12C-mutated non-small cell lung cancer.\nIn June 2021, Amgen and Kyowa Kirin announced joint plans to develop and commercialize a treatment for atopic dermatitis. In October, Amgen and Neumora Therapeutics announced a research and development collaboration focused on novel precision therapies for certain brain diseases. Amgen began construction on a new biomanufacturing plant in New Albany, Ohio, in November. In December, the FDA approved Amgen and AstraZeneca's Tezspire (tezepelumab) for severe asthma. The FDA also approved Amgen's Otezla for adults with plaque psoriasis of any severity level.\nAmgen announced a research collaboration in January 2022 with Generate Biomedicines across multiple modalities and several therapeutic areas for up to $1.9 billion. The company also launched a multi-target collaboration with Arrakis Therapeutics to identify novel targeted RNA degrader therapeutics. The next month, Amgen entered a multi-year collaboration with Plexium to discover novel targeted protein degradation therapies. Also in February, Amgen issued its first green bond to fund various environmentally friendly initiatives across the company. The company broke ground on a new manufacturing facility in Holly Springs, North Carolina, in March.\nIn September 2022, data from a late-stage study showed the company's cancer pill Lumakras (sotorasib) beating out chemotherapy. This was the first approved drug in the set of treatments that target KRAS, among the most common generic mutations found in cancers. The drug was approved in 2021 with a list price of $17,900 per month.\nIn October 2022, the company acquired ChemoCentryx, the maker of Tavneos—a drug treatment for rare diseases called anti-neutrophil cytoplasmic autoantibody-associated vasculitis, for $3.7 billion in an all-cash deal.\nIn October 2023, Amgen acquired Horizon Therapeutics, specializing in drugs for rare diseases, for $27.8 billion.\nIn November 2023, Amgen announced plans to use artificial intelligence in partnership with Amazon Web Services to help discover and create medicines and use the Amazon SageMaker machine learning service to help with the manufacturing process.\nIn March 2025, data for the drug Tezspire (tezepelumab), showed the best results for treating chronic rhinosinusitis with nasal polyps. \nAlso in March 2025, Amgen announced the start of two late-stage trials for MariTide, an anti-obesity medication candidate. In June 2025, the company noted that it had to reduce the dosage of the drug to avoid side effects such as vomiting. However, patients that continued to take the drug lost approximately 20% of their body weight.\nIn April 2025, the company announced a $900 million expansion of its facility in New Albany, Ohio. In September 2025, it announced plans to build a $600 million research center in Thousand Oaks, California.\n\nAcquisition history\nCorporate affairs\nSponsorships\nIn December 2023, Amgen became the title sponsor of the Irish Open in golf, renaming it the Amgen Irish Open.\n\nPhilanthropy\nIn October 2017, the Amgen Foundation pledged $3 million to Khan Academy to support the development of free online biology lessons. In July 2020, Amgen granted an additional $3 million Khan Academy to support educational equity and science learning.\nIn January 2020, the Amgen Foundation and Harvard University debuted LabXchange, a free online science education platform. Amgen and the Amgen Foundation announced a commitment of up to $12.5 million to support COVID-19 relief efforts in March.\nIn November 2021, Amgen awarded a $2 million grant to the CDC Foundation to launch the latter's EmPOWERED Health Program, promoting patient engagement in decision making for cancer treatments.\n\nPolitics\nThe company spends approximately $10 million per year on lobbying in the United States. Political contributions have mostly been to individuals and organizations associated with the Democratic Party.\n\nProducts\nAmgen's approved drugs or therapeutic biologicals include:\n\nAimovig (erenumab-aooe) for migraine headaches (FDA approved May 2018)\nAmjevita (adalimumab) (FDA approved September 2016)\nAranesp (darbepoetin alfa) for anemia (FDA approval in September 2001)\nBlincyto (blinatumomab for the treatment of acute lymphoblastic leukemia)\nCorlanor (ivabradine)\nEnbrel (etanercept) for various forms of arthritis\nEpogen (erythropoietin) for anemia\nEvenity (romosozumab-aqqg) for osteoporosis\nImlygic (talimogene laherparepvec) for local treatment of unresectable cutaneous, subcutaneous, and nodal lesions in melanoma recurrent after initial surgery (FDA approved October 2015)\nKanjinti (trastuzumab-anns) (FDA approved June 2019)\nKrystexxa (pegloticase)\nKyprolis (carfilzomib)\nLumakras (sotorasib)\nMvasi (bevacizumab-awwb)\nNeulasta (pegfilgrastim) for neutropenia (FDA approved 2002)\nNeupogen (granulocyte colony-stimulating factor) for neutropenia\nNplate (romiplostim) for chronic immune thrombocytopenic purpura (FDA approved 2008)\nOtezla (apremilast)\nParsabiv (etelcalcetide)\nProlia (denosumab) for postmenopausal osteoporosis\nRepatha (evolocumab)\nRiabni (rituximab-arrx)\nSensipar/Mimpara (cinacalcet for primary and secondary hyperparathyroidism, a mineral metabolism complication common in patients with kidney failure) (FDA approved 2004)\nTepezza (teprotumumab)\nTezspire (tezepelumab-ekko)\nTavneos (avacopan)\nUplizna (inebilizumab)\nVectibix (panitumumab for colon cancer) (FDA approved 2006)\nXgeva (denosumab) for the prevention of skeletal-related events (pathological fracture, radiation to bone, spinal cord compression or surgery to bone in adults with bone metastases from solid tumors)\n\nProducts developed and then sold\nKepivance (palifermin for oral mucositis, sold to Biovitrium, now Swedish Orphan Biovitrum, in December 2008\nStemGen (ancestim) for use in combination with filgrastim for mobilizing peripheral hematopoietic stem cells) (sold to Biovitrium, now Swedish Orphan Biovitrum, in December 2008)\nKineret (anakinra) for rheumatoid arthritis, exclusively licensed to Biovitrium, now Swedish Orphan Biovitrum, in December 2008\n\nLegal issues\nIn December 2012, Amgen plead guilty and agreed to pay $150 million in criminal penalty and $612 million to resolve 11 related whistleblower complaint related to improper marketing of anemia drug Aranesp. According to the United States Department of Justice, Amgen sold the drug for off-label uses at dosages that the FDA had rejected or never approved.\nIn May 2025, a jury ruled that Amgen owes Regeneron $406 million for engaging in anticompetitive practices to increase sales of its cholesterol-reduction drug Repatha at the expense of Regeneron's Praluent.\n\nSee also\nKirin-Amgen v Hoechst Marion Roussel, a UK patent case decided by the House of Lords\nAmgen Inc. v. Harris, a United States Supreme Court case on employment law.\nEvolocumab\nAmgen Inc v. Sanofi, a United States Supreme Court case on patent enablement.\n\nReferences\nExternal links\n\nOfficial website\nAmgen on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nBusiness data for Amgen:",
  "clean_text": "Amgen Inc. is an American multinational biopharmaceutical company headquartered in Thousand Oaks, California. The company is ranked 18th on the list of largest biomedical companies by revenue. The name \"AMGen\" is a portmanteau of the company's original name, Applied Molecular Genetics. The company's major products are Prolia and XGEVA (Denosumab) for treatment of osteoporosis and bone diseases ($6.7 billion in total 2024 revenues), Enbrel (Etanercept) for treatment of autoimmune diseases ($3.3 billion in 2024 revenues), Repatha (evolocumab) for treatment of hyperlipidemia ($2.3 billion in 2024 revenues), Otezla (apremilast) for treatment of psoriasis and psoriatic arthritis ($2.1 billion in 2024 revenues), Tepezza (teprotumumab) to treat Graves' ophthalmopathy ($1.8 billion in 2024 revenues), Evenity (romosozumab) to treat osteoporosis ($1.5 billion in 2024 revenues), Kyprolis (carfilzomib) to treat cancer ($1.5 billion in 2024 revenues), Nplate (romiplostim) to regulate platelet production ($1.4 billion in 2024 revenues), and Aranesp (darbepoetin alfa) to stimulate erythropoiesis ($1.3 billion in 2024 revenues). Amgen has 17 clinical programs underway in Phase III, eight in Phase II, and 19 in Phase I. Its pipeline includes MariTide, an anti-obesity medication administered once per month by injection. The company receives approximately 80% of its revenues from sales to the three large U.S. drug wholesalers: McKesson Corporation, Cencora, and Cardinal Health. The company is ranked 134th on the Fortune 500 and 202nd on the Forbes Global 2000. History In April 1980, Amgen was founded in Thousand Oaks as Applied Molecular Genetics. Amgen was backed by a small group of venture capitalists, and its early focus was on recombinant DNA technology and recombinant human insulin. Its initial scientific advisory board consisted of Norman Davidson, Leroy Hood, Arnold Berk, John Carbon, Robert Schimke, Arno Motulsky, Marvin H. Caruthers, and Dave Gibson. In October 1980, Amgen named George Rathmann its first president and chief executive officer. On June 17, 1983, Amgen became a public company via an initial public offering, selling two million common shares and raising nearly $40 million. That same year, after more than two years of work, an Amgen research team led by Fu-Kuen Lin found and cloned the erythropoietin gene, a protein created in the kidney that stimulates red blood cell production. Lin's team created what would become Epogen (epoetin alfa). In June 1984, Amgen and Kirin formed a joint venture giving Kirin the rights to Epogen in Japan. A year later, Amgen researcher Larry Souza and his team cloned granulocyte colony-stimulating factor (G-CSF), leading to the development of Neupogen (filgrastim). In October 1988, Gordon Binder was named CEO, succeeding George Rathmann. The following year, in 1989, Amgen received approval for the first recombinant human erythropoetin product, Epogen (epoetin alfa). In February 1991, Amgen received FDA approval for Neupogen for the prevention of infections in patients whose immune systems are suppressed due to cancer chemotherapy. Amgen opened a new manufacturing facility in Puerto Rico, in March 1993, which later became the company's flagship manufacturing site. In 1994, Amgen became the fifth company to receive the National Medal of Technology and Innovation from the United States Department of Commerce, in recognition of its work developing medicines to improve quality of life for kidney and cancer patients. Also around this time, Amgen researcher Steve Elliott and his team added more sugar molecules to erythropoietin, causing it to remain in the body longer. This led to the development of Aranesp (darbepoetin alfa). 2000–2014 Binder was succeeded as CEO by Kevin W. Sharer in 2000. Robert A. Bradway became Amgen's president and chief executive officer in May 2012, following Sharer's retirement. In June 2010, Amgen received approval by the Food and Drug Administration for Prolia, a protein drug for the treatment of post-menopausal osteoporosis. In clinical trials, Prolia reduced the rate of vertebral fractures by 61% and the risk of hip fractures by 40%. In November 2010, the FDA approved Xgeva for the prevention of complications of bone metastases in patients with solid tumors. The clinical trials primarily enrolled patients with breast or prostate cancer. In March 2011, Amgen acquired a manufacturing facility near Dublin, Ireland. Amgen opened an affiliate in China in 2013. In November 2014, the company halted all trials of rilotumumab in advanced gastric cancer patients after one of the trials found more deaths in those who took the compound with chemotherapy, than those without. Also in November 2014, the company, in conjunction with AstraZeneca, reported positive results for brodalumab in a Phase III trial comparing the compound with ustekinumab and a placebo in treating psoriasis. In the same month, construction was completed on Amgen's next-generation biomanufacturing facility in Singapore. Blincyto (blinatumomab) was approved by the FDA in December of that year. 2015–2020 In March 2015, the company announced that it would license its Phase II candidate drug AMG 714 to Celimmune, which will develop the anti-IL-15 monoclonal antibody for treatment against diet nonresponsive celiac disease and refractory celiac disease. In August 2015, Repatha (evolocumab) was approved by the FDA. In September 2016, the company announced it would purchase the rights to Boehringer Ingelheims Phase I bispecific T-cell engager compound (BI 836909, now AMG 420) for use in the treatment of multiple myeloma. Also in September, the FDA approved Amjevita (adalimumab-atto). The FDA approved Parsabiv in February 2017 and Mvasi (bevacizumab-awwb) in September. In July 2018, Amgen began constructing a biomanufacturing plant at its campus in West Greenwich, Rhode Island. In January 2019, Evenity (romosozumab) received approval in Japan, followed by FDA approval in April. In June, Kanjinti (trastuzumab-anns) was approved by the FDA. In December 2019, the FDA approved Avsola (infliximab-axxq). In September 2019, FDA granted fast track designation to sotorasib for the treatment of metastatic non-small-cell lung carcinoma (NSCLC) with the KRAS G12C mutation. In April 2020, Amgen established Amgen K.K. as the company's wholly owned affiliate in Japan. The company announced in July that the United States Court of Appeals for the Federal Circuit had upheld the validity of two Amgen patents that described and claimed Enbrel and methods for making it. The appellate court affirmed an August 2019 decision by the United States District Court for the District of New Jersey and rejected Sandoz's attempt to invalidate the patents on Enbrel. In August 2020, Amgen, Takeda Pharmaceutical Company, and AbbVie, as part of a COVID-19 research and development (R&D) alliance, announced the first patients enrolled in the I-SPY COVID clinical trial. The trial evaluated the efficacy of Otezla and two other medicines in severely ill, hospitalized COVID-19 patients who required high-flow oxygen. In September 2020, Amgen and Eli Lilly and Company announced a global manufacturing collaboration for COVID-19 antibody therapies. In October 2020, Amgen announced positive topline Phase 2 results from the CodeBreaK 100 clinical study, evaluating sotorasib in 126 patients with KRAS G12C-mutant advanced NSCLC who had failed three or fewer prior lines of anti-cancer therapies (including immunotherapy and/or chemotherapy). Amgen, the Global Coalition for Adaptive Research, and Eisai Co., Ltd. also announced enrollment of the first patient in a study testing multiple interventions for the treatment of patients hospitalized with COVID-19. In November 2020, Amgen, Takeda, and UCB, as part of the COVID R&D alliance, announced the first patient enrolled in another trial evaluating Otezla and two other drugs as treatments for COVID-19. Amgen also announced that it would terminate its collaboration with Cytokinetics and transition the development and commercialization rights for omecamtiv mecarbil and AMG 594. Amgen and AstraZeneca announced positive topline results from a Phase 3 trial in which the investigational medicine tezepelumab demonstrated a statistically significant reduction in exacerbations in patients with severe asthma. In December 2020, the FDA granted breakthrough therapy designation to sotorasib for advanced or metastatic non-small cell lung cancer patients with KRAS G12C mutation. Also in December 2020, the FDA approved Riabni (rituximab-arrx), a biosimilar to Rituxan. In April 2021, the company acquired Five Prime Therapeutics and its lead candidate, bemarituzumab, for $1.9 billion. In the March 2021, Amgen acquired Rodeo Therapeutics for $720 million. In May 2021, sotorasib received accelerated approval from FDA for treatment of adult patients with NSCLC whose tumors have a KRAS G12C mutation and who have received at least one prior systemic therapy; this was the first approved targeted therapy for tumors with any KRAS mutation. Similar approvals for sotorasib in NSCLC followed in January 2022 in Europe and Japan. The FDA approved Amgen's Lumakras in May for treatment of patients with KRAS-G12C-mutated non-small cell lung cancer. In June 2021, Amgen and Kyowa Kirin announced joint plans to develop and commercialize a treatment for atopic dermatitis. In October, Amgen and Neumora Therapeutics announced a research and development collaboration focused on novel precision therapies for certain brain diseases. Amgen began construction on a new biomanufacturing plant in New Albany, Ohio, in November. In December, the FDA approved Amgen and AstraZeneca's Tezspire (tezepelumab) for severe asthma. The FDA also approved Amgen's Otezla for adults with plaque psoriasis of any severity level. Amgen announced a research collaboration in January 2022 with Generate Biomedicines across multiple modalities and several therapeutic areas for up to $1.9 billion. The company also launched a multi-target collaboration with Arrakis Therapeutics to identify novel targeted RNA degrader therapeutics. The next month, Amgen entered a multi-year collaboration with Plexium to discover novel targeted protein degradation therapies. Also in February, Amgen issued its first green bond to fund various environmentally friendly initiatives across the company. The company broke ground on a new manufacturing facility in Holly Springs, North Carolina, in March. In September 2022, data from a late-stage study showed the company's cancer pill Lumakras (sotorasib) beating out chemotherapy. This was the first approved drug in the set of treatments that target KRAS, among the most common generic mutations found in cancers. The drug was approved in 2021 with a list price of $17,900 per month. In October 2022, the company acquired ChemoCentryx, the maker of Tavneos—a drug treatment for rare diseases called anti-neutrophil cytoplasmic autoantibody-associated vasculitis, for $3.7 billion in an all-cash deal. In October 2023, Amgen acquired Horizon Therapeutics, specializing in drugs for rare diseases, for $27.8 billion. In November 2023, Amgen announced plans to use artificial intelligence in partnership with Amazon Web Services to help discover and create medicines and use the Amazon SageMaker machine learning service to help with the manufacturing process. In March 2025, data for the drug Tezspire (tezepelumab), showed the best results for treating chronic rhinosinusitis with nasal polyps. Also in March 2025, Amgen announced the start of two late-stage trials for MariTide, an anti-obesity medication candidate. In June 2025, the company noted that it had to reduce the dosage of the drug to avoid side effects such as vomiting. However, patients that continued to take the drug lost approximately 20% of their body weight. In April 2025, the company announced a $900 million expansion of its facility in New Albany, Ohio. In September 2025, it announced plans to build a $600 million research center in Thousand Oaks, California. Acquisition history Corporate affairs Sponsorships In December 2023, Amgen became the title sponsor of the Irish Open in golf, renaming it the Amgen Irish Open. Philanthropy In October 2017, the Amgen Foundation pledged $3 million to Khan Academy to support the development of free online biology lessons. In July 2020, Amgen granted an additional $3 million Khan Academy to support educational equity and science learning. In January 2020, the Amgen Foundation and Harvard University debuted LabXchange, a free online science education platform. Amgen and the Amgen Foundation announced a commitment of up to $12.5 million to support COVID-19 relief efforts in March. In November 2021, Amgen awarded a $2 million grant to the CDC Foundation to launch the latter's EmPOWERED Health Program, promoting patient engagement in decision making for cancer treatments. Politics The company spends approximately $10 million per year on lobbying in the United States. Political contributions have mostly been to individuals and organizations associated with the Democratic Party. Products Amgen's approved drugs or therapeutic biologicals include: Aimovig (erenumab-aooe) for migraine headaches (FDA approved May 2018) Amjevita (adalimumab) (FDA approved September 2016) Aranesp (darbepoetin alfa) for anemia (FDA approval in September 2001) Blincyto (blinatumomab for the treatment of acute lymphoblastic leukemia) Corlanor (ivabradine) Enbrel (etanercept) for various forms of arthritis Epogen (erythropoietin) for anemia Evenity (romosozumab-aqqg) for osteoporosis Imlygic (talimogene laherparepvec) for local treatment of unresectable cutaneous, subcutaneous, and nodal lesions in melanoma recurrent after initial surgery (FDA approved October 2015) Kanjinti (trastuzumab-anns) (FDA approved June 2019) Krystexxa (pegloticase) Kyprolis (carfilzomib) Lumakras (sotorasib) Mvasi (bevacizumab-awwb) Neulasta (pegfilgrastim) for neutropenia (FDA approved 2002) Neupogen (granulocyte colony-stimulating factor) for neutropenia Nplate (romiplostim) for chronic immune thrombocytopenic purpura (FDA approved 2008) Otezla (apremilast) Parsabiv (etelcalcetide) Prolia (denosumab) for postmenopausal osteoporosis Repatha (evolocumab) Riabni (rituximab-arrx) Sensipar/Mimpara (cinacalcet for primary and secondary hyperparathyroidism, a mineral metabolism complication common in patients with kidney failure) (FDA approved 2004) Tepezza (teprotumumab) Tezspire (tezepelumab-ekko) Tavneos (avacopan) Uplizna (inebilizumab) Vectibix (panitumumab for colon cancer) (FDA approved 2006) Xgeva (denosumab) for the prevention of skeletal-related events (pathological fracture, radiation to bone, spinal cord compression or surgery to bone in adults with bone metastases from solid tumors) Products developed and then sold Kepivance (palifermin for oral mucositis, sold to Biovitrium, now Swedish Orphan Biovitrum, in December 2008 StemGen (ancestim) for use in combination with filgrastim for mobilizing peripheral hematopoietic stem cells) (sold to Biovitrium, now Swedish Orphan Biovitrum, in December 2008) Kineret (anakinra) for rheumatoid arthritis, exclusively licensed to Biovitrium, now Swedish Orphan Biovitrum, in December 2008 Legal issues In December 2012, Amgen plead guilty and agreed to pay $150 million in criminal penalty and $612 million to resolve 11 related whistleblower complaint related to improper marketing of anemia drug Aranesp. According to the United States Department of Justice, Amgen sold the drug for off-label uses at dosages that the FDA had rejected or never approved. In May 2025, a jury ruled that Amgen owes Regeneron $406 million for engaging in anticompetitive practices to increase sales of its cholesterol-reduction drug Repatha at the expense of Regeneron's Praluent."
}