{
  "ticker": "AMP",
  "cik": "0000820027",
  "company_name": "Ameriprise Financial",
  "corrected_name": "Ameriprise Financial",
  "wiki_title_used": "Ameriprise Financial",
  "exists": true,
  "raw_text": "Ameriprise Financial, Inc. is an American diversified financial services company and bank holding company based in Minneapolis, Minnesota. It provides financial planning products and services, including wealth management, asset management, insurance, annuities, and estate planning.\nAs of April 2022, more than 80% of the company's revenue came from wealth management.\nAmeriprise was formerly a division of American Express, which completed the corporate spin-off of the company in September 2005.\nThe company is ranked 254th on the Fortune 500. It is on the list of largest banks in the United States and was ranked the 9th largest independent broker-dealer based on assets under management. It is one of the largest financial planning companies in the United States and ranks among the 25 largest asset managers globally. It is ranked 8th in long-term mutual fund assets in the U.S., fourth in retail funds in the U.K., and 27th in global assets under management.\n\nCurrent operations\nThe company specializes in retirement-related financial planning for affluent clients. It offers variable annuities and life and disability insurance. It also operates Ameriprise Bank, FSB, which offers a range of consumer banking and lending products, as well as personal trust and related services. Since 2015, its asset management arm has operated under the name Columbia Threadneedle Investments. The company uses three principal brands for its businesses in the United States: Ameriprise Financial, Columbia Management, and RiverSource. \nAmeriprise Financial Services, a financial planning and retail distribution subsidiary, is a registered broker-dealer and registered investment adviser. It has an integrated model of comprehensive and personalized financial planning, diversified product manufacturing, and affiliated and unaffiliated distribution through its network of financial advisors and registered representatives. The retail products and services that use the Ameriprise Financial brand include those that the company provides through its affiliated advisors (e.g., financial planning, investment advisory accounts, retail brokerage services and banking products) and products and services that it markets directly to consumers). RiverSource is the brand for the company's annuities products and for the protection products issued by the RiverSource Life companies, including life and disability income insurance products.\n\nSubsidiaries\nSource:\n\nColumbia Threadneedle Investments\nAmeriprise Advisors\n\nHistory\nThe company, known initially as Investors Syndicate, was founded in Minneapolis in 1894 by John Elliott Tappan.\nIn 1925, West Coast businessman J. R. Ridgway merged his investment firm with Investors Syndicate, and took over as president.\nIn 1937, upon the death of then 50-year-old J. R. Ridgway from leukemia, 23-year-old J. R. Ridgway, Jr. was appointed president.\nIn 1940, Investors Syndicate introduced one of the first mutual funds, the Investors Mutual Fund, giving clients new investing options and two advantages: diversification and professional management. In 1949, Investors Syndicate changed its name to Investors Diversified Services, Inc. (IDS).\nIn 1958, IDS founded the Investors Syndicate Life Insurance and Annuity Company (now known as RiverSource Life Insurance Company).\nBy the 1960s, Investors Mutual Fund was the largest balanced mutual fund in the world.\nIn 1974, the IDS Centre (now IDS Center) was opened in downtown Minneapolis as the company's headquarters. In 1979, the Ridgway family sold the last of its ownership interest. IDS became a wholly owned subsidiary of Alleghany Corporation pursuant to a merger.\nIn 1984, American Express acquired IDS Financial Services from Alleghany Corporation. In 1986, IDS acquired Wisconsin Employers Casualty Company of Green Bay, Wisconsin and renamed it IDS Property Casualty Insurance Company.\nEffective January 1, 1995, IDS changed its name to American Express Financial Corporation, doing business as American Express Financial Advisors (AEFA).\nIn October 2003, AEFA acquired London-based Threadneedle Asset Management Holdings. In September 2005, American Express completed the corporate spin-off of AEFA as Ameriprise Financial, Inc., a public company. In September 2006, the company launched Ameriprise Bank, FSB. In February 2008, Threadneedle acquired Invesco Perpetual's full-service defined contribution pension business, which had total assets of £470 million. In November 2008, the company acquired H&R Block Financial Advisors for $315 million, and the asset management firm J. & W. Seligman & Co. for $440 million. In 2009, Ameriprise acquired Standard Chartered Bank's World Express Funds investment funds business, providing Threadneedle with an established Luxembourg-based SICAV platform with over US$2.38 billion worth assets under management.\nIn May 2010, Ameriprise Financial acquired Columbia Management, the long-term asset management business of Bank of America, for $1 billion.\nIn August 2011, Threadneedle announced the acquisition of the £8 billion in investment assets of LV=.\nDuring the Great Recession, the company declined an investment by the United States Department of the Treasury under the Troubled Asset Relief Program.\nOn April 25, 2011, Ameriprise announced that it was seeking an \"appropriate buyer\" for Securities America Financial Corporation, allowing its registered representatives to focus on growth opportunities. In November 2011, Ameriprise completed the sale of Securities America to Ladenburg Thalmann Financial Services for $150 million in cash and potential future payments. \nIn January 2012, the company opened services to individuals in India with US$40,000 equivalent minimum income. Ameriprise also established an insurance brokerage entity in India that\nwas licensed to deal in insurance products by India's Insurance Regulatory and Development Authority (IRDA). Ameriprise India established offices in Delhi, Gurgaon, Greater Noida, Mumbai & Pune. In May 2014, Ameriprise shut down the nascent financial planning division in India, citing poor prospects for fee-based advisory services.\nIn January 2013, the company completed the conversion of its federal savings bank subsidiary, Ameriprise Bank, FSB, to a limited powers national trust bank, which conversion included changing the name of this subsidiary to Ameriprise National Trust Bank.\nIn 2015, Threadneedle rebranded as Columbia Threadneedle.\nIn 2017, the company acquired Investment Professionals, Inc.\nIn 2019, the company sold Ameriprise Auto & Home Insurance to American Family Insurance for $1.05 billion.\nIn May 2022, Ameriprise announced that Phoenix-based financial advisory organisation, Phoenix Wealth Management, had joined Ameriprise Financial. The director of Phoenix Wealth Management, Christine Gustafson, and her team joined the organisation with more than $450 million in client assets, including assets from individuals, family offices, and charitable foundations.\n\nCriticism and controversy\nIn July 2005, New Hampshire reached a $7.4 million settlement with Ameriprise Financial Advisors, alleging the company had violated the law by rewarding its financial advisers for recommending underperforming in-house mutual funds to clients.\nIn December 2005, Ameriprise agreed to pay $12.3 million to settle NASD charges relating to favorable treatment allegedly given to some mutual funds in exchange for brokerage business.\nIn December 2005, the company agreed to pay $15 million to settle charges of market timing by the U.S. Securities and Exchange Commission. The Minnesota Department of Commerce levied $2 million in fines for similar market timing violations and the National Association of Securities Dealers fined Ameriprise an additional $12.3 million for unsuitable share sales. Ameriprise had not revealed which funds were timed, or the names of the people involved, and the exact nature of the disciplinary action taken. Morningstar, Inc. temporarily reduced the stewardship grade for Ameriprise's funds, although it did not impact the fund's overall star ratings from that firm.\nIn September 2006, Securities America reached a $16.3 million settlement with a group of ExxonMobil retirees for failing to supervise an associated broker.\nIn December 2006, a NASD arbitration panel awarded $9.3 million to three retired American Airlines pilots against Securities America and a formerly associated broker for allegedly mishandling their savings.\nAlso in December 2006, the company settled charges related to a stolen laptop containing data on approximately 230,000 customers.\nOn July 11, 2007, the NASD fined Securities America $375,000 for improperly sharing directed brokerage commissions from a mutual fund company with a former Securities America broker.\nIn September 2008, the company volunteered to pay as much as $33 million to cover investor losses in the Reserve Primary Fund.\nOn July 10, 2009, the company agreed to pay $17.3 million after the Securities and Exchange Commission (SEC) announced an enforcement action against the company for receiving millions of dollars in undisclosed revenue sharing as a condition for selling certain real estate investment trusts (REITs) to its brokerage customers before the spin-off from American Express.\nOn April 15, 2011, Securities America, Inc. (SAI) and its holding company, Securities America Financial Corporation, entered into settlement agreements related to the sale of private placement securities issued by Medical Capital and Provident Royalties that resulted in a $118 million pre-tax charge in the first quarter of 2011. The charge is in addition to a $40 million pre-tax charge in the fourth quarter of 2010.\nIn April 2008, the company agreed to pay New Hampshire $3.8 million to settle allegations that its Portsmouth agents forged clients' signatures to cut corners and increase their income.\nIn October 2010, Michael Loscalso, a branch manager in West Conshohocken, Pennsylvania who earned $260,000 per year, sued the company after being fired, allegedly for raising serious allegations about the firm's oversight of brokers.\nIn March 2015, the company paid $27.5 million to settle a lawsuit that it charged its own employees high fees for funds in its 401(k) program.\nIn December 2016, the company settled with the U.S. Department of Labor, agreeing to pay $128,200 in back wages for discriminating against 20 black employees by paying them less than similarly situated white workers.\nIn February 2018, the company paid $230,000 to settle allegations by the U.S. Securities and Exchange Commission that it put customers into higher fee funds.\nIn August 2018, the company paid $4.5 million to settle charges that it failed to safeguard retail investor assets from theft by its representatives after five Ameriprise representatives committed fraudulent acts, including forging client documents and stealing more than $1 million in client funds over four years.\n\nReferences\nExternal links\nBusiness data for Ameriprise Financial, Inc.:",
  "clean_text": "Ameriprise Financial, Inc. is an American diversified financial services company and bank holding company based in Minneapolis, Minnesota. It provides financial planning products and services, including wealth management, asset management, insurance, annuities, and estate planning. As of April 2022, more than 80% of the company's revenue came from wealth management. Ameriprise was formerly a division of American Express, which completed the corporate spin-off of the company in September 2005. The company is ranked 254th on the Fortune 500. It is on the list of largest banks in the United States and was ranked the 9th largest independent broker-dealer based on assets under management. It is one of the largest financial planning companies in the United States and ranks among the 25 largest asset managers globally. It is ranked 8th in long-term mutual fund assets in the U.S., fourth in retail funds in the U.K., and 27th in global assets under management. Current operations The company specializes in retirement-related financial planning for affluent clients. It offers variable annuities and life and disability insurance. It also operates Ameriprise Bank, FSB, which offers a range of consumer banking and lending products, as well as personal trust and related services. Since 2015, its asset management arm has operated under the name Columbia Threadneedle Investments. The company uses three principal brands for its businesses in the United States: Ameriprise Financial, Columbia Management, and RiverSource. Ameriprise Financial Services, a financial planning and retail distribution subsidiary, is a registered broker-dealer and registered investment adviser. It has an integrated model of comprehensive and personalized financial planning, diversified product manufacturing, and affiliated and unaffiliated distribution through its network of financial advisors and registered representatives. The retail products and services that use the Ameriprise Financial brand include those that the company provides through its affiliated advisors (e.g., financial planning, investment advisory accounts, retail brokerage services and banking products) and products and services that it markets directly to consumers). RiverSource is the brand for the company's annuities products and for the protection products issued by the RiverSource Life companies, including life and disability income insurance products. Subsidiaries Source: Columbia Threadneedle Investments Ameriprise Advisors History The company, known initially as Investors Syndicate, was founded in Minneapolis in 1894 by John Elliott Tappan. In 1925, West Coast businessman J. R. Ridgway merged his investment firm with Investors Syndicate, and took over as president. In 1937, upon the death of then 50-year-old J. R. Ridgway from leukemia, 23-year-old J. R. Ridgway, Jr. was appointed president. In 1940, Investors Syndicate introduced one of the first mutual funds, the Investors Mutual Fund, giving clients new investing options and two advantages: diversification and professional management. In 1949, Investors Syndicate changed its name to Investors Diversified Services, Inc. (IDS). In 1958, IDS founded the Investors Syndicate Life Insurance and Annuity Company (now known as RiverSource Life Insurance Company). By the 1960s, Investors Mutual Fund was the largest balanced mutual fund in the world. In 1974, the IDS Centre (now IDS Center) was opened in downtown Minneapolis as the company's headquarters. In 1979, the Ridgway family sold the last of its ownership interest. IDS became a wholly owned subsidiary of Alleghany Corporation pursuant to a merger. In 1984, American Express acquired IDS Financial Services from Alleghany Corporation. In 1986, IDS acquired Wisconsin Employers Casualty Company of Green Bay, Wisconsin and renamed it IDS Property Casualty Insurance Company. Effective January 1, 1995, IDS changed its name to American Express Financial Corporation, doing business as American Express Financial Advisors (AEFA). In October 2003, AEFA acquired London-based Threadneedle Asset Management Holdings. In September 2005, American Express completed the corporate spin-off of AEFA as Ameriprise Financial, Inc., a public company. In September 2006, the company launched Ameriprise Bank, FSB. In February 2008, Threadneedle acquired Invesco Perpetual's full-service defined contribution pension business, which had total assets of £470 million. In November 2008, the company acquired H&R Block Financial Advisors for $315 million, and the asset management firm J. & W. Seligman & Co. for $440 million. In 2009, Ameriprise acquired Standard Chartered Bank's World Express Funds investment funds business, providing Threadneedle with an established Luxembourg-based SICAV platform with over US$2.38 billion worth assets under management. In May 2010, Ameriprise Financial acquired Columbia Management, the long-term asset management business of Bank of America, for $1 billion. In August 2011, Threadneedle announced the acquisition of the £8 billion in investment assets of LV=. During the Great Recession, the company declined an investment by the United States Department of the Treasury under the Troubled Asset Relief Program. On April 25, 2011, Ameriprise announced that it was seeking an \"appropriate buyer\" for Securities America Financial Corporation, allowing its registered representatives to focus on growth opportunities. In November 2011, Ameriprise completed the sale of Securities America to Ladenburg Thalmann Financial Services for $150 million in cash and potential future payments. In January 2012, the company opened services to individuals in India with US$40,000 equivalent minimum income. Ameriprise also established an insurance brokerage entity in India that was licensed to deal in insurance products by India's Insurance Regulatory and Development Authority (IRDA). Ameriprise India established offices in Delhi, Gurgaon, Greater Noida, Mumbai & Pune. In May 2014, Ameriprise shut down the nascent financial planning division in India, citing poor prospects for fee-based advisory services. In January 2013, the company completed the conversion of its federal savings bank subsidiary, Ameriprise Bank, FSB, to a limited powers national trust bank, which conversion included changing the name of this subsidiary to Ameriprise National Trust Bank. In 2015, Threadneedle rebranded as Columbia Threadneedle. In 2017, the company acquired Investment Professionals, Inc. In 2019, the company sold Ameriprise Auto & Home Insurance to American Family Insurance for $1.05 billion. In May 2022, Ameriprise announced that Phoenix-based financial advisory organisation, Phoenix Wealth Management, had joined Ameriprise Financial. The director of Phoenix Wealth Management, Christine Gustafson, and her team joined the organisation with more than $450 million in client assets, including assets from individuals, family offices, and charitable foundations. Criticism and controversy In July 2005, New Hampshire reached a $7.4 million settlement with Ameriprise Financial Advisors, alleging the company had violated the law by rewarding its financial advisers for recommending underperforming in-house mutual funds to clients. In December 2005, Ameriprise agreed to pay $12.3 million to settle NASD charges relating to favorable treatment allegedly given to some mutual funds in exchange for brokerage business. In December 2005, the company agreed to pay $15 million to settle charges of market timing by the U.S. Securities and Exchange Commission. The Minnesota Department of Commerce levied $2 million in fines for similar market timing violations and the National Association of Securities Dealers fined Ameriprise an additional $12.3 million for unsuitable share sales. Ameriprise had not revealed which funds were timed, or the names of the people involved, and the exact nature of the disciplinary action taken. Morningstar, Inc. temporarily reduced the stewardship grade for Ameriprise's funds, although it did not impact the fund's overall star ratings from that firm. In September 2006, Securities America reached a $16.3 million settlement with a group of ExxonMobil retirees for failing to supervise an associated broker. In December 2006, a NASD arbitration panel awarded $9.3 million to three retired American Airlines pilots against Securities America and a formerly associated broker for allegedly mishandling their savings. Also in December 2006, the company settled charges related to a stolen laptop containing data on approximately 230,000 customers. On July 11, 2007, the NASD fined Securities America $375,000 for improperly sharing directed brokerage commissions from a mutual fund company with a former Securities America broker. In September 2008, the company volunteered to pay as much as $33 million to cover investor losses in the Reserve Primary Fund. On July 10, 2009, the company agreed to pay $17.3 million after the Securities and Exchange Commission (SEC) announced an enforcement action against the company for receiving millions of dollars in undisclosed revenue sharing as a condition for selling certain real estate investment trusts (REITs) to its brokerage customers before the spin-off from American Express. On April 15, 2011, Securities America, Inc. (SAI) and its holding company, Securities America Financial Corporation, entered into settlement agreements related to the sale of private placement securities issued by Medical Capital and Provident Royalties that resulted in a $118 million pre-tax charge in the first quarter of 2011. The charge is in addition to a $40 million pre-tax charge in the fourth quarter of 2010. In April 2008, the company agreed to pay New Hampshire $3.8 million to settle allegations that its Portsmouth agents forged clients' signatures to cut corners and increase their income. In October 2010, Michael Loscalso, a branch manager in West Conshohocken, Pennsylvania who earned $260,000 per year, sued the company after being fired, allegedly for raising serious allegations about the firm's oversight of brokers. In March 2015, the company paid $27.5 million to settle a lawsuit that it charged its own employees high fees for funds in its 401(k) program. In December 2016, the company settled with the U.S. Department of Labor, agreeing to pay $128,200 in back wages for discriminating against 20 black employees by paying them less than similarly situated white workers. In February 2018, the company paid $230,000 to settle allegations by the U.S. Securities and Exchange Commission that it put customers into higher fee funds. In August 2018, the company paid $4.5 million to settle charges that it failed to safeguard retail investor assets from theft by its representatives after five Ameriprise representatives committed fraudulent acts, including forging client documents and stealing more than $1 million in client funds over four years."
}