{
  "ticker": "AMT",
  "cik": "0001053507",
  "company_name": "American Tower",
  "corrected_name": "American Tower",
  "wiki_title_used": "American Tower",
  "exists": true,
  "raw_text": "American Tower Corporation (also referred to as American Tower or ATC) is an American real estate investment trust which owns, develops and operates wireless and broadcast communications infrastructure in several countries. It is headquartered in Boston, Massachusetts.\nAs of December 31, 2024, the company owns 148,957 communications sites, including 42,222 sites in the U.S. and Canada, 26,642 sites in Asia-Pacific and Africa, 31,786 sites in Europe, and 48,307 sites in Latin America.\n\nHistory\nThe company was formed in 1995 as a unit of American Radio Systems. In 1998, American Radio Systems merged with CBS Corporation and spun off of American Tower. Its first CEO was Steven B. Dodge, remaining in the position until resigning in 2004. Following the merger, American Tower began international expansion by establishing operations in Mexico, in 1998, then in Brazil, in 1999.\nAround 2000, the company began purchasing numerous AT&T Long Lines microwave telephone relay towers from the since defunct AT&T Communications, Inc., and repurposing them as cell towers. American Tower also leased antenna space to various U.S. cell phone providers and to private industries. Most of the former AT&T Long Lines sites had their horn antennas removed, either by helicopter or by crane, to make room for more antennas. Since AT&T's Long Lines Program was decommissioned in the 1980s, and the company no longer had any use for the towers themselves, American Tower now owns most of these tower structures across the U.S., totaling 42,965 in 2022.\nIn 2004 James D. Taiclet was named CEO and held the title until 2020.\nIn 2005, American Tower acquired SpectraSite Communications, expanding its global portfolio to over 22,000 owned communications sites, including over 21,000 wireless towers, 400 broadcast towers and 100 in-building DAS (Distributed Antenna System) sites. The merger helped establish the company as one of the largest tower owners and operators in North America.\nBetween 2007 and 2012, the company expanded internationally with operations in India, Peru, Chile, Colombia, South Africa, Ghana, and Uganda.\nIn 2013, the company acquired Global Tower Partners for $4.8 billion. This acquisition added sites to the U.S. portfolio and added operations in Costa Rica and Panama.\nIn 2020, Tom Bartlett was named President and CEO after Taiclet left to become the CEO of Lockheed Martin.\nIn 2021, the company agreed to acquire the European and Latin American tower divisions of Telxius from parent company Telefonica, comprising approximately 31,000 communications sites in Spain, Germany, Argentina, Brazil, Chile, and Peru, for $9.6 billion. Later in 2021, American Tower acquired CoreSite for $10.4 billion, with its carrier-neutral data center facilities in the U.S., to strengthen its position in 5G.\nIn early 2023, the company announced plans to erect 4,000 new towers worldwide, mainly in Africa, India and Latin America. Soon after, it divested from fiber optics in Mexico, selling subsidiary ATC Fibra México to Flō Network.\nBartlett retired as president, CEO, and a director of the company on February 1, 2024, and was succeeded by Steven Vondran.\nAmerican Tower divested from its largest international market, after 17 years, selling its ATC India operation to Brookfield Asset Management via Data Infrastructure Trust in September 2024, for $2.5 billion.\nIn 2025, American Tower topped the list of the \"Top 100 Tower Companies in the U.S.\" and is ranked 363rd on the Fortune 500.\n\nSee also\nList of public REITs in the United States\n\nReferences\nExternal links\nOfficial website\nBusiness data for American Tower Corporation:",
  "clean_text": "American Tower Corporation (also referred to as American Tower or ATC) is an American real estate investment trust which owns, develops and operates wireless and broadcast communications infrastructure in several countries. It is headquartered in Boston, Massachusetts. As of December 31, 2024, the company owns 148,957 communications sites, including 42,222 sites in the U.S. and Canada, 26,642 sites in Asia-Pacific and Africa, 31,786 sites in Europe, and 48,307 sites in Latin America. History The company was formed in 1995 as a unit of American Radio Systems. In 1998, American Radio Systems merged with CBS Corporation and spun off of American Tower. Its first CEO was Steven B. Dodge, remaining in the position until resigning in 2004. Following the merger, American Tower began international expansion by establishing operations in Mexico, in 1998, then in Brazil, in 1999. Around 2000, the company began purchasing numerous AT&T Long Lines microwave telephone relay towers from the since defunct AT&T Communications, Inc., and repurposing them as cell towers. American Tower also leased antenna space to various U.S. cell phone providers and to private industries. Most of the former AT&T Long Lines sites had their horn antennas removed, either by helicopter or by crane, to make room for more antennas. Since AT&T's Long Lines Program was decommissioned in the 1980s, and the company no longer had any use for the towers themselves, American Tower now owns most of these tower structures across the U.S., totaling 42,965 in 2022. In 2004 James D. Taiclet was named CEO and held the title until 2020. In 2005, American Tower acquired SpectraSite Communications, expanding its global portfolio to over 22,000 owned communications sites, including over 21,000 wireless towers, 400 broadcast towers and 100 in-building DAS (Distributed Antenna System) sites. The merger helped establish the company as one of the largest tower owners and operators in North America. Between 2007 and 2012, the company expanded internationally with operations in India, Peru, Chile, Colombia, South Africa, Ghana, and Uganda. In 2013, the company acquired Global Tower Partners for $4.8 billion. This acquisition added sites to the U.S. portfolio and added operations in Costa Rica and Panama. In 2020, Tom Bartlett was named President and CEO after Taiclet left to become the CEO of Lockheed Martin. In 2021, the company agreed to acquire the European and Latin American tower divisions of Telxius from parent company Telefonica, comprising approximately 31,000 communications sites in Spain, Germany, Argentina, Brazil, Chile, and Peru, for $9.6 billion. Later in 2021, American Tower acquired CoreSite for $10.4 billion, with its carrier-neutral data center facilities in the U.S., to strengthen its position in 5G. In early 2023, the company announced plans to erect 4,000 new towers worldwide, mainly in Africa, India and Latin America. Soon after, it divested from fiber optics in Mexico, selling subsidiary ATC Fibra México to Flō Network. Bartlett retired as president, CEO, and a director of the company on February 1, 2024, and was succeeded by Steven Vondran. American Tower divested from its largest international market, after 17 years, selling its ATC India operation to Brookfield Asset Management via Data Infrastructure Trust in September 2024, for $2.5 billion. In 2025, American Tower topped the list of the \"Top 100 Tower Companies in the U.S.\" and is ranked 363rd on the Fortune 500."
}