{
  "ticker": "ANET",
  "cik": "0001596532",
  "company_name": "Arista Networks",
  "corrected_name": "Arista Networks",
  "wiki_title_used": "Arista Networks",
  "exists": true,
  "raw_text": "Arista Networks, Inc. (formerly Arastra) is an American computer networking company headquartered in Santa Clara, California. The company designs and sells multilayer network switches to deliver software-defined networking (SDN) for large datacenter, cloud computing, high-performance computing, and high-frequency trading environments. These products include 10/25/40/50/100/200/400/800 gigabit low-latency cut-through Ethernet switches. Arista's Linux-based network operating system, Extensible Operating System (EOS), runs on all Arista products.\n\nCorporate history\nIn 2004, Andy Bechtolsheim, Kenneth Duda and David Cheriton founded Arastra (later renamed Arista). Bechtolsheim and Cheriton were able to fund the company themselves. In May 2008, Jayshree Ullal left Cisco after 15 years at the firm. She was appointed CEO of Arista in October 2008.\nIn June 2014, Arista Networks had its initial public offering on the New York Stock Exchange under the symbol ANET.\nIn December 2014, Cisco filed two lawsuits against Arista alleging intellectual property infringement., and the United States International Trade Commission issued limited exclusion and cease-and-desist orders concerning two of the features patented by Cisco and upheld an import ban on infringing products. In 2016, on appeal, the ban was reversed following product changes and two overturned Cisco patents, and Cisco's claim was dismissed. In August 2018, Arista agreed to pay Cisco US$400 million as part of a settlement that included a release for all claims of infringement by Cisco, dismissal of Arista's antitrust claims against Cisco, and a 5-year stand-down between the companies.\nIn August 2018, Arista Networks acquired Mojo Networks. In September 2018, Arista Networks acquired Metamako and integrated their low latency product line as the 7130 series. In February 2020, Arista acquired Big Switch Networks. In October 2020, Arista acquired Awake Security.\nArista's CEO, Jayshree Ullal, was named to Barron's list of World's Best CEOs in 2018 and 2019.\nIn August 2022, Arista Networks acquired Pluribus Networks, a unified cloud network company, for an undisclosed sum.\nIn July of 2025 Arista expanded its AI-driven campus and branch networking offerings and acquired the VeloCloud SD-WAN portfolio from Broadcom. This combination of innovations will bring operational ease through zero touch operations, proactive monitoring, and automated troubleshooting across the broad set of client-to-cloud networking domains.\n\nProducts\nExtensible Operating System\nEOS is Arista's network operating system, and comes as one image that runs across all Arista devices or in a virtual machine (VM). EOS runs on an unmodified Linux kernel with a userland that is initially Fedora-based. The userland has since been rebased on CentOS and later, AlmaLinux. There are more than 100 independent regular processes, called agents, responsible for different aspects and features of the switch, including drivers that manage the switching application-specific integrated circuit (ASICs), the command-line interface (CLI), Simple Network Management Protocol (SNMP), Spanning Tree Protocol, and various routing protocols. All the state of the switch and its various protocols is centralized in another process, called Sysdb. Separating processing (carried by the agents) from the state (in Sysdb) gives EOS two important properties. The first is software fault containment, which means that if a software fault occurs, any damage is limited to one agent. The second is stateful restarts, since the state is stored in Sysdb, when an agent restarts it picks up where it left off. Since agents are independent processes, they can also be upgraded while the switch is running (a feature called ISSU – In-Service Software Upgrade).\nThe fact that EOS runs on Linux allows the usage of common Linux tools on the switch itself, such as tcpdump or configuration management systems. EOS provides extensive application programming interfaces (APIs) to communicate with and control all aspects of the switch. To showcase EOS' extensibility, Arista developed a module named CloudVision that extends the CLI to use Extensible Messaging and Presence Protocol (XMPP) as a shared message bus to manage and configure switches. This was implemented simply by integrating an existing open-source XMPP Python library with the CLI.\n\nProgrammability\nIn addition to all the standard programming and scripting abilities traditionally available in a Linux environment, EOS can be programmed using different mechanisms:\n\nAdvanced Event Management can be used to react to various events and automatically trigger CLI commands, execute arbitrary scripts or send alerts when state changes occur in the switch, such as an interface going down or a virtual machine migrating to another host.\nEvent Monitor tracks changes made to the medium access control (MAC), Address Resolution Protocol (ARP), and routing table in a local SQLite database for later querying using standard Structured Query Language (SQL) queries.\neAPI (External API) offers a versioned JSON-RPC interface to execute CLI commands and retrieve their output in structured JSON objects.\n\nEthernet switches\nArista's product line can be separated into different product families:\n\n7500R series: Modular chassis with a virtual output queueing (VOQ) fabric supporting from 4 to 16 store and forward line cards delivering line-rate non-blocking 10GbE, 40GbE, and 100GbE performance in a 150 Tbit/s fabric supporting a maximum of 576 100GbE ports with 384 GB of packet buffer. Each 100GbE ports can also operate as 40GbE or 4x10GbE ports, thus effectively providing 2304 line-rate 10GbE ports with large routing tables.\n7300X, 7300X3 and 7320X series: Modular chassis with 4 or 8 line cards in a choice of 10G, 40G and 100G options with 6.4 Tbit/s of capacity per line card, for a fabric totaling up to 50 Tbit/s of capacity for up to 1024 10GbE ports. Unlike the 7500 series, 10GBASE-T is available on 7300 series line cards.\n7280R series: 1U and 2U systems with a common architecture to the 7500R Series, deep buffer VOQ and large routing tables. Many different speed and port combinations from 10GbE to 100GbE.\n7200X series: 2U low-latency high-density line-rate 100GbE and 40GbE switches, with up to 12.8 Tbit/s of forwarding capacity.\n7170 Series: High Performance Multi-function Programmable Platforms, a set of fixed 100G platforms based on Barefoot Tofino packet processor enabling the data plane to be customized using EOS and P4 profiles.\n7160 series: 1U programmable high performance range of 10 GbE, 25 GbE and 100 GbE with the support for AlgoMatch technology and a software upgradeable packet processor\n7150S series: 1U ultra-low latency cut-through line-rate 10 Gb switches. Port-to-port latency is sub-380ns, regardless of the frame size. Unlike the earlier 7100 series, the switch silicon can be re-programmed to add new features that work at wire-speed, such as Virtual Extensible LAN (VXLAN) or network address translation (NAT/PAT).\n7130 series (7130, 7130L, 7130E): 1U and 2U ultra-low latency Layer 1 switch and programmable switches. Layer 1 switching enables mirroring and software-defined port routing with port-to-port latency starting from 4ns, depending on physical distance. The E and L variants allow running custom FPGA applications directly on the switch with a port-to-FPGA latency as low as 3ns. This series comes from the original Metamako product line acquired by Arista Networks in 2018 and runs a combination of MOS and Arista EOS operating systems.\n7050X and 7060X series: 1U and 2U low-latency cut-through line-rate 10GbE/25GbE, 40GbE and 100GbE switches. This product line offers higher port density than the 7150 series, in a wider choice of port options and interface speeds at the expense of slightly increased latency (1µs or less). The 7050X and 7060X Series are based on Broadcom Trident and Tomahawk merchant silicon.\n7020R series: 1U store and forward line-rate with a choice of either a 1 Gb top-of-rack switch, with 6x10 Gb uplinks or a 10G with 100G uplinks. These switches use a Deep Buffer architecture, with 3 GB of packet memory.\n7010 series: 1U low power (52W) line-rate 1 Gb top-of-rack switch, with 4x10 Gb uplinks.\nThe low-latency of Arista switches has made them prevalent in high-frequency trading environments, such as the Chicago Board Options Exchange (largest U.S. options exchange) and RBC Capital Markets. As of October 2009, one third of its customers were big Wall Street firms.\nArista's devices are multilayer switches, which support a range of layer 3 protocols, including IGMP, Virtual Router Redundancy Protocol (VRRP), Routing Information Protocol (RIP), Border Gateway Protocol (BGP), Open Shortest Path First (OSPF), IS-IS, and OpenFlow. The switches are also capable of layer 3 or layer 4 equal-cost multi-path routing (ECMP), and applying per-port L3/L4 access-control lists (ACLs) entirely in hardware.\nIn November 2013, Arista Networks introduced the Spline network, combining leaf and spine architectures into a single-tier network, aiming to cut operating costs.\n\nArista Community Central\nArista Community Central is a centralized resource created by Arista Networks for customers, partners, and technical professionals. The community serves as a platform for sharing knowledge, engaging in discussions, and accessing various technical resources related to Arista’s networking technologies.\nThe community utilizes a search engine powered by AI to provide the most relevant results and to enhance user experience.\n\nWhat the Community Offers\nKnowledge Base: A comprehensive Knowledge Base that includes technical articles, guides, and best practices for Arista products and solutions. It covers topics such as troubleshooting, tech tips, and configuration articles organized by technology, aiding users in managing and supporting their Arista products.\nCommunity Forum: The forum allows users to ask questions and participate in discussions related to Arista’s products. While the forum is publicly available, participation is limited to registered users, ensuring focused and expert-driven dialogue.\nVideos & Webinars: Arista Community Central also provides access to recorded webinarsand technology-related videos hosted on the Community YouTube channelaimed at deepening users’ understanding of Arista’s technology offerings.\n\nMajor competitors\nCisco Systems\nExtreme Networks\nHewlett Packard Enterprise (Aruba Networks division)\nJuniper Networks\nNokia\n\nReferences\nExternal links\nOfficial website \nArista Community Central\nArista Community Central YouTube Channel\nBusiness data for Arista Networks, Inc.:",
  "clean_text": "Arista Networks, Inc. (formerly Arastra) is an American computer networking company headquartered in Santa Clara, California. The company designs and sells multilayer network switches to deliver software-defined networking (SDN) for large datacenter, cloud computing, high-performance computing, and high-frequency trading environments. These products include 10/25/40/50/100/200/400/800 gigabit low-latency cut-through Ethernet switches. Arista's Linux-based network operating system, Extensible Operating System (EOS), runs on all Arista products. Corporate history In 2004, Andy Bechtolsheim, Kenneth Duda and David Cheriton founded Arastra (later renamed Arista). Bechtolsheim and Cheriton were able to fund the company themselves. In May 2008, Jayshree Ullal left Cisco after 15 years at the firm. She was appointed CEO of Arista in October 2008. In June 2014, Arista Networks had its initial public offering on the New York Stock Exchange under the symbol ANET. In December 2014, Cisco filed two lawsuits against Arista alleging intellectual property infringement., and the United States International Trade Commission issued limited exclusion and cease-and-desist orders concerning two of the features patented by Cisco and upheld an import ban on infringing products. In 2016, on appeal, the ban was reversed following product changes and two overturned Cisco patents, and Cisco's claim was dismissed. In August 2018, Arista agreed to pay Cisco US$400 million as part of a settlement that included a release for all claims of infringement by Cisco, dismissal of Arista's antitrust claims against Cisco, and a 5-year stand-down between the companies. In August 2018, Arista Networks acquired Mojo Networks. In September 2018, Arista Networks acquired Metamako and integrated their low latency product line as the 7130 series. In February 2020, Arista acquired Big Switch Networks. In October 2020, Arista acquired Awake Security. Arista's CEO, Jayshree Ullal, was named to Barron's list of World's Best CEOs in 2018 and 2019. In August 2022, Arista Networks acquired Pluribus Networks, a unified cloud network company, for an undisclosed sum. In July of 2025 Arista expanded its AI-driven campus and branch networking offerings and acquired the VeloCloud SD-WAN portfolio from Broadcom. This combination of innovations will bring operational ease through zero touch operations, proactive monitoring, and automated troubleshooting across the broad set of client-to-cloud networking domains. Products Extensible Operating System EOS is Arista's network operating system, and comes as one image that runs across all Arista devices or in a virtual machine (VM). EOS runs on an unmodified Linux kernel with a userland that is initially Fedora-based. The userland has since been rebased on CentOS and later, AlmaLinux. There are more than 100 independent regular processes, called agents, responsible for different aspects and features of the switch, including drivers that manage the switching application-specific integrated circuit (ASICs), the command-line interface (CLI), Simple Network Management Protocol (SNMP), Spanning Tree Protocol, and various routing protocols. All the state of the switch and its various protocols is centralized in another process, called Sysdb. Separating processing (carried by the agents) from the state (in Sysdb) gives EOS two important properties. The first is software fault containment, which means that if a software fault occurs, any damage is limited to one agent. The second is stateful restarts, since the state is stored in Sysdb, when an agent restarts it picks up where it left off. Since agents are independent processes, they can also be upgraded while the switch is running (a feature called ISSU – In-Service Software Upgrade). The fact that EOS runs on Linux allows the usage of common Linux tools on the switch itself, such as tcpdump or configuration management systems. EOS provides extensive application programming interfaces (APIs) to communicate with and control all aspects of the switch. To showcase EOS' extensibility, Arista developed a module named CloudVision that extends the CLI to use Extensible Messaging and Presence Protocol (XMPP) as a shared message bus to manage and configure switches. This was implemented simply by integrating an existing open-source XMPP Python library with the CLI. Programmability In addition to all the standard programming and scripting abilities traditionally available in a Linux environment, EOS can be programmed using different mechanisms: Advanced Event Management can be used to react to various events and automatically trigger CLI commands, execute arbitrary scripts or send alerts when state changes occur in the switch, such as an interface going down or a virtual machine migrating to another host. Event Monitor tracks changes made to the medium access control (MAC), Address Resolution Protocol (ARP), and routing table in a local SQLite database for later querying using standard Structured Query Language (SQL) queries. eAPI (External API) offers a versioned JSON-RPC interface to execute CLI commands and retrieve their output in structured JSON objects. Ethernet switches Arista's product line can be separated into different product families: 7500R series: Modular chassis with a virtual output queueing (VOQ) fabric supporting from 4 to 16 store and forward line cards delivering line-rate non-blocking 10GbE, 40GbE, and 100GbE performance in a 150 Tbit/s fabric supporting a maximum of 576 100GbE ports with 384 GB of packet buffer. Each 100GbE ports can also operate as 40GbE or 4x10GbE ports, thus effectively providing 2304 line-rate 10GbE ports with large routing tables. 7300X, 7300X3 and 7320X series: Modular chassis with 4 or 8 line cards in a choice of 10G, 40G and 100G options with 6.4 Tbit/s of capacity per line card, for a fabric totaling up to 50 Tbit/s of capacity for up to 1024 10GbE ports. Unlike the 7500 series, 10GBASE-T is available on 7300 series line cards. 7280R series: 1U and 2U systems with a common architecture to the 7500R Series, deep buffer VOQ and large routing tables. Many different speed and port combinations from 10GbE to 100GbE. 7200X series: 2U low-latency high-density line-rate 100GbE and 40GbE switches, with up to 12.8 Tbit/s of forwarding capacity. 7170 Series: High Performance Multi-function Programmable Platforms, a set of fixed 100G platforms based on Barefoot Tofino packet processor enabling the data plane to be customized using EOS and P4 profiles. 7160 series: 1U programmable high performance range of 10 GbE, 25 GbE and 100 GbE with the support for AlgoMatch technology and a software upgradeable packet processor 7150S series: 1U ultra-low latency cut-through line-rate 10 Gb switches. Port-to-port latency is sub-380ns, regardless of the frame size. Unlike the earlier 7100 series, the switch silicon can be re-programmed to add new features that work at wire-speed, such as Virtual Extensible LAN (VXLAN) or network address translation (NAT/PAT). 7130 series (7130, 7130L, 7130E): 1U and 2U ultra-low latency Layer 1 switch and programmable switches. Layer 1 switching enables mirroring and software-defined port routing with port-to-port latency starting from 4ns, depending on physical distance. The E and L variants allow running custom FPGA applications directly on the switch with a port-to-FPGA latency as low as 3ns. This series comes from the original Metamako product line acquired by Arista Networks in 2018 and runs a combination of MOS and Arista EOS operating systems. 7050X and 7060X series: 1U and 2U low-latency cut-through line-rate 10GbE/25GbE, 40GbE and 100GbE switches. This product line offers higher port density than the 7150 series, in a wider choice of port options and interface speeds at the expense of slightly increased latency (1µs or less). The 7050X and 7060X Series are based on Broadcom Trident and Tomahawk merchant silicon. 7020R series: 1U store and forward line-rate with a choice of either a 1 Gb top-of-rack switch, with 6x10 Gb uplinks or a 10G with 100G uplinks. These switches use a Deep Buffer architecture, with 3 GB of packet memory. 7010 series: 1U low power (52W) line-rate 1 Gb top-of-rack switch, with 4x10 Gb uplinks. The low-latency of Arista switches has made them prevalent in high-frequency trading environments, such as the Chicago Board Options Exchange (largest U.S. options exchange) and RBC Capital Markets. As of October 2009, one third of its customers were big Wall Street firms. Arista's devices are multilayer switches, which support a range of layer 3 protocols, including IGMP, Virtual Router Redundancy Protocol (VRRP), Routing Information Protocol (RIP), Border Gateway Protocol (BGP), Open Shortest Path First (OSPF), IS-IS, and OpenFlow. The switches are also capable of layer 3 or layer 4 equal-cost multi-path routing (ECMP), and applying per-port L3/L4 access-control lists (ACLs) entirely in hardware. In November 2013, Arista Networks introduced the Spline network, combining leaf and spine architectures into a single-tier network, aiming to cut operating costs. Arista Community Central Arista Community Central is a centralized resource created by Arista Networks for customers, partners, and technical professionals. The community serves as a platform for sharing knowledge, engaging in discussions, and accessing various technical resources related to Arista’s networking technologies. The community utilizes a search engine powered by AI to provide the most relevant results and to enhance user experience. What the Community Offers Knowledge Base: A comprehensive Knowledge Base that includes technical articles, guides, and best practices for Arista products and solutions. It covers topics such as troubleshooting, tech tips, and configuration articles organized by technology, aiding users in managing and supporting their Arista products. Community Forum: The forum allows users to ask questions and participate in discussions related to Arista’s products. While the forum is publicly available, participation is limited to registered users, ensuring focused and expert-driven dialogue. Videos & Webinars: Arista Community Central also provides access to recorded webinarsand technology-related videos hosted on the Community YouTube channelaimed at deepening users’ understanding of Arista’s technology offerings. Major competitors Cisco Systems Extreme Networks Hewlett Packard Enterprise (Aruba Networks division) Juniper Networks Nokia"
}