{
  "ticker": "AON",
  "cik": "0000315293",
  "company_name": "Aon plc",
  "corrected_name": "Aon plc",
  "wiki_title_used": "Aon plc",
  "exists": true,
  "raw_text": "Aon plc (English: ) is a British-American professional services firm. The company operates two divisions: Risk Capital (67% of 2024 revenues), which provides brokerage and consulting services for risk management and insurance and reinsurance, and Human Capital (33% of 2024 revenues), which provides services for health insurance, retirement plans, pension plans, and talent advisory.\nIt is the second largest insurance broker worldwide.\nThe company is ranked 300th on the Fortune 500 and 388th on the Forbes Global 2000.\nFounded in Chicago by Patrick Ryan, Aon was created in 1982 when the Ryan Insurance Group merged with the Combined Insurance Company of America under W. Clement Stone. In 1987, the holding company was renamed Aon from aon, a Gaelic word meaning \"one\". The company is globally headquartered in London with its North America operations based in Chicago at the Aon Center.\n\nHistory\nW. Clement Stone's mother bought a small Detroit insurance agency, and in 1918 brought her son into the business. Mr. Stone sold low-cost, low-benefit accident insurance, underwriting and issuing policies on-site. The next year he founded his own agency, the Combined Registry Co.\nAs the Great Depression began, Stone reduced his workforce and improved training. Forced by his son's respiratory illness to winter in the South, Stone moved to Arkansas and Texas. In 1939 he bought American Casualty Insurance Co. of Dallas, Texas. It was consolidated with other purchases as the Combined Insurance Co. of America in 1947. The company continued through the 1950s and 1960s, continuing to sell health and accident policies. In the 1970s, Combined expanded overseas despite being hit hard by the recession.\nIn 1982, after 10 years of stagnation under Clement Stone Jr., the elder Stone, then 79, resumed control until the completion of a merger with Ryan Insurance Co. allowed him to transfer control to Patrick Ryan. Ryan, the son of a Ford dealer in Wisconsin and a graduate of Northwestern University, had started his company as an auto credit insurer in 1964. In 1976, the company bought the insurance brokerage units of the Esmark conglomerate. Ryan focused on insurance brokering and added more upscale insurance products. He also trimmed staff and took other cost-cutting measures, and in 1987 he changed Combined's name to Aon. In 1992, he bought Dutch insurance broker Hudig-Langeveldt. In 1995, the company sold its remaining direct life insurance holdings to General Electric to focus on consulting.\nIn June 1995, Aon acquired the Garden City based travel insurance firm Berkely Arm, Inc (also known as BerkelyCare Ltd. and The Berkely Group), known for providing travel insurance offerings to cruise lines and tour operators in the United States. This division eventually became known as Aon Affinity Travel Practice.\nAon built a global presence through purchases. In 1997, it bought The Minet Group, as well as the insurance brokerage A&A Services, Inc., founded by Alexander Howden in the late 19th century. It was then that insurance broker David Howden reclaimed the family brand name for the Howden Group. These transactions made Aon (temporarily) the largest insurance broker worldwide. The firm made no US buys in 1998, but doubled its employee base with purchases including Spain's largest retail insurance broker, Gil y Carvajal, and the formation of Aon Korea.\nResponding to industry demands, Aon announced its new fee disclosure policy in 1999, and the company reorganised to focus on buying personal line insurance firms and to integrate its acquisitions. That year it bought Nikols Sedgwick Group, an Italian insurance firm, and formed RiskAttack (with Zurich US), a risk analysis and financial management concern aimed at technology companies. The cost of integrating its numerous purchases, however, hammered profits in 1999.\nDespite its troubles, in 2000 Aon bought Reliance Group's accident and health insurance business, as well as Actuarial Sciences Associates, a compensation and employee benefits consulting company. Later in that year, however, the company decided to cut 6% of its workforce as part of a restructuring effort. In 2003, the company saw revenues increase primarily because of rate hikes in the insurance industry. Also that year, Endurance Specialty, a Bermuda-based underwriting operation that Aon helped to establish in November 2001 along with other investors, went public. The next year Aon sold most of its holdings in Endurance.\nAon's New York offices were on the 92nd and 98th–105th floors of the South Tower of the World Trade Center at the time of the September 11 attacks. When the North Tower was struck by American Airlines Flight 11 at 8:46 a.m., an evacuation of Aon's offices was quickly initiated by executive Eric Eisenberg, and 924 of the estimated 1,100 Aon employees present at the time managed to get below the 77th floor before United Airlines Flight 175 crashed between Floors 77 and 85 at 9:03 a.m. Many, however, did not manage to get beneath in the 17 minutes they had between the two impacts. As a result, 176 employees of Aon were killed in the crash or died in the eventual collapse of the tower or from smoke inhalation. At 9:59 a.m., the tower collapsed, killing any survivors still within, including Eisenberg and Kevin Cosgrove.\nIn 2004–2005, Aon, along with other brokers including Marsh & McLennan and Willis, fell under regulatory investigation under New York Attorney General Eliot Spitzer and other state attorneys general. At issue was the practice of insurance companies' payments to brokers (known as contingent commissions). The payments were thought to bring a conflict of interest, swaying broker decisions on behalf of carriers, rather than customers. In the spring of 2005, without acknowledging any wrongdoing, Aon agreed to a $190 million settlement, payable over 30 months.\nIn the late 2007, Aon divested its two major underwriting subsidiaries: Combined Insurance Company of America (acquired by ACE Limited for $2.4 billion) and Sterling Life Insurance Company (purchased by Munich Re Group for $352 million) sold due to their low margin and capital-intensive nature.\nIn November 2008, Aon acquired reinsurance intermediary and capital advisor Benfield Group Limited for $1.75 billion. The acquisition amplified the firm's broking capabilities, positioning Aon one of the largest players in the reinsurance brokerage industry.\nIn 2010, Aon acquired Hewitt Associates for $4.9 billion. Aside from drastically boosting Aon's human resources consulting capacity and entering the firm into the business process outsourcing industry, the move added 23,000 colleagues and more than $3 billion in revenue.\nIn January 2012, Aon announced that its headquarters would be moved to London, although North American operations and jobs remained in Chicago.\n\nIn February 2017, Aon sold its employee benefits outsourcing business to private equity firm The Blackstone Group for US$4.8 billion (£3.8 billion).\nIn February 2020, Aon named Eric Andersen as president of Aon.\nIn 2021, Aon agreed to merge with Willis Towers Watson; the merger agreement was terminated due to regulatory concerns.\n\nLegal issues\nUK regulatory breach\nIn January 2009, Aon was fined £5.69 million in the UK by the Financial Services Authority, who stated that the fine related to the company's inadequate bribery and corruption controls, claiming that between 14 January 2005 and 30 September 2007 Aon had failed to properly assess the risks involved in its dealings with overseas firms and individuals. The Authority did not find that any money had actually made its way to illegal organisations. Aon qualified for a 30% discount on the fine as a result of its cooperation with the investigation. Aon said its conduct was not deliberate, adding it had since \"significantly strengthened and enhanced its controls around the usage of third parties\".\n\nUS Foreign Corrupt Practices Act violations\nIn December 2011, Aon Corporation paid a $16.26 million penalty to the U.S. Securities and Exchange Commission and the U.S. Department of Justice for violations of the US Foreign Corrupt Practices Act.\nAccording to the Securities and Exchange Commission, Aon's subsidiaries made improper payments of over $3.6 million to government officials and third-party facilitators in Costa Rica, Egypt, Vietnam, Indonesia, the United Arab Emirates, Myanmar and Bangladesh, between 1983 and 2007, to obtain and retain insurance contracts.\n\nMajor acquisitions\nIn January 2007, Aon announced that its Aon Affinity group had acquired the WedSafe Wedding Insurance program.\nIn August 2008, Aon announced that it had acquired London-based Benfield Group. The acquiring price was US$1.75 billion or £935 million, with US$170 million of debt.\nIn March 2010, Hewitt Associates announced that it acquired Senior Educators Ltd. The acquisition offers companies a new way to address retiree medical insurance commitments.\nIn July 2010, Aon announced that it had agreed to buy Lincolnshire, Illinois-based Hewitt Associates for $4.9 billion in cash and stock.\nIn April 2011, Aon announced that it had acquired Johannesburg, South Africa-based Glenrand MIB.\nIn July 2011, Aon announced that it bought Westfield Financial, the owner of insurance-industry consulting firm Ward Financial Group, from Ohio Farmers Insurance Co.\nIn October 2012, Aon announced that it agreed to buy OmniPoint, Inc, a Workday consulting firm. Financial terms were not disclosed.\nIn June 2014, Aon announced that it agreed to buy National Flood Services, Inc., a large processor of flood insurance, from Stoneriver Group, L.P.\nIn October 2016, Aon's Aon Risk Solutions acquired Stroz Friedberg LLC, a specialised risk management firm focusing on cybersecurity.\nIn November 2016, Aon acquired CoCubes an online Indian Assessment firm, facilitating hiring of entry-level engineering graduates.\nIn February 2017, Aon plc agreed to sell its human resources outsourcing platform for US$4.8 billion (£3.8 billion) to Blackstone Group L.P. (BX.N), creating a new company called Alight Solutions.\nIn September 2017, Aon announced its intent to purchase real estate investment management firm The Townsend Group from Colony NorthStar for $475 million, expanding Aon's property investment management portfolio.\nIn December 2023, Aon agreed to acquire NFP, a middle-market provider of risk, benefits, wealth and retirement plan advisory services company, for $13.4 billion.\nIn March 2024, Aon plc acquired the technology assets and intellectual property of Humn.ai, an AI-powered platform. This will enhance its commercial fleet proposition.\n\nSponsorship of Manchester United\nIn June 2009, Aon signed a four-year shirt sponsorship deal with Manchester United F.C.. On 1 June 2010, Aon replaced American International Group as the principal sponsor of the club. The Aon logo was prominently displayed on the front of the club's shirts until the 2014/2015 season when Aon was replaced by Chevrolet. The deal was said to be worth £80 million over four years, replacing United's deal with AIG as the most lucrative shirt deal in history at the time.\nFrom 2013 to 2021 Aon owned the naming rights to the Trafford Training Centre and sponsored the club's training kits, reportedly worth £180 million to the club.\n\nAwards\nAon was awarded Investment Consultancy of the Year and Fiduciary Manager of the Year at the FT's 2014 Pension and Investment Provider Awards\nAon received a perfect score on the Human Rights Campaign's 2013 Corporate Equality Index\nAon was named to Working Mother's list of the 100 Best Companies for 2012\nAon Risk Solutions was the most recommended broker in 2012 for service and expertise by middle market buyers in Business Insurance's Buyers Choice Awards\nAon Risk Solutions was named Broker of the Year and Training Programme of the Year in 2012 by Insurance Times\nAon Benfield was named 2012 European Reinsurance Broker of the Year, Best European Property Reinsurance Broker and Best European Casualty Reinsurance Broker at the European Intelligent Insurer Awards\nAon Benfield was named Best Global Reinsurance Broking Company for Analytics at Reactions Global Awards 2012\nAon Hewitt was named Top Retirement Consultant of 2012 by PLANSPONSOR Magazine2\nAon Hewitt was named Actuarial and Investment Consultant of the Year for 2012 at the Professional Pensions Awards\n\nReferences\nExternal links\nOfficial website \n\nBusiness data for Aon plc:",
  "clean_text": "Aon plc (English: ) is a British-American professional services firm. The company operates two divisions: Risk Capital (67% of 2024 revenues), which provides brokerage and consulting services for risk management and insurance and reinsurance, and Human Capital (33% of 2024 revenues), which provides services for health insurance, retirement plans, pension plans, and talent advisory. It is the second largest insurance broker worldwide. The company is ranked 300th on the Fortune 500 and 388th on the Forbes Global 2000. Founded in Chicago by Patrick Ryan, Aon was created in 1982 when the Ryan Insurance Group merged with the Combined Insurance Company of America under W. Clement Stone. In 1987, the holding company was renamed Aon from aon, a Gaelic word meaning \"one\". The company is globally headquartered in London with its North America operations based in Chicago at the Aon Center. History W. Clement Stone's mother bought a small Detroit insurance agency, and in 1918 brought her son into the business. Mr. Stone sold low-cost, low-benefit accident insurance, underwriting and issuing policies on-site. The next year he founded his own agency, the Combined Registry Co. As the Great Depression began, Stone reduced his workforce and improved training. Forced by his son's respiratory illness to winter in the South, Stone moved to Arkansas and Texas. In 1939 he bought American Casualty Insurance Co. of Dallas, Texas. It was consolidated with other purchases as the Combined Insurance Co. of America in 1947. The company continued through the 1950s and 1960s, continuing to sell health and accident policies. In the 1970s, Combined expanded overseas despite being hit hard by the recession. In 1982, after 10 years of stagnation under Clement Stone Jr., the elder Stone, then 79, resumed control until the completion of a merger with Ryan Insurance Co. allowed him to transfer control to Patrick Ryan. Ryan, the son of a Ford dealer in Wisconsin and a graduate of Northwestern University, had started his company as an auto credit insurer in 1964. In 1976, the company bought the insurance brokerage units of the Esmark conglomerate. Ryan focused on insurance brokering and added more upscale insurance products. He also trimmed staff and took other cost-cutting measures, and in 1987 he changed Combined's name to Aon. In 1992, he bought Dutch insurance broker Hudig-Langeveldt. In 1995, the company sold its remaining direct life insurance holdings to General Electric to focus on consulting. In June 1995, Aon acquired the Garden City based travel insurance firm Berkely Arm, Inc (also known as BerkelyCare Ltd. and The Berkely Group), known for providing travel insurance offerings to cruise lines and tour operators in the United States. This division eventually became known as Aon Affinity Travel Practice. Aon built a global presence through purchases. In 1997, it bought The Minet Group, as well as the insurance brokerage A&A Services, Inc., founded by Alexander Howden in the late 19th century. It was then that insurance broker David Howden reclaimed the family brand name for the Howden Group. These transactions made Aon (temporarily) the largest insurance broker worldwide. The firm made no US buys in 1998, but doubled its employee base with purchases including Spain's largest retail insurance broker, Gil y Carvajal, and the formation of Aon Korea. Responding to industry demands, Aon announced its new fee disclosure policy in 1999, and the company reorganised to focus on buying personal line insurance firms and to integrate its acquisitions. That year it bought Nikols Sedgwick Group, an Italian insurance firm, and formed RiskAttack (with Zurich US), a risk analysis and financial management concern aimed at technology companies. The cost of integrating its numerous purchases, however, hammered profits in 1999. Despite its troubles, in 2000 Aon bought Reliance Group's accident and health insurance business, as well as Actuarial Sciences Associates, a compensation and employee benefits consulting company. Later in that year, however, the company decided to cut 6% of its workforce as part of a restructuring effort. In 2003, the company saw revenues increase primarily because of rate hikes in the insurance industry. Also that year, Endurance Specialty, a Bermuda-based underwriting operation that Aon helped to establish in November 2001 along with other investors, went public. The next year Aon sold most of its holdings in Endurance. Aon's New York offices were on the 92nd and 98th–105th floors of the South Tower of the World Trade Center at the time of the September 11 attacks. When the North Tower was struck by American Airlines Flight 11 at 8:46 a.m., an evacuation of Aon's offices was quickly initiated by executive Eric Eisenberg, and 924 of the estimated 1,100 Aon employees present at the time managed to get below the 77th floor before United Airlines Flight 175 crashed between Floors 77 and 85 at 9:03 a.m. Many, however, did not manage to get beneath in the 17 minutes they had between the two impacts. As a result, 176 employees of Aon were killed in the crash or died in the eventual collapse of the tower or from smoke inhalation. At 9:59 a.m., the tower collapsed, killing any survivors still within, including Eisenberg and Kevin Cosgrove. In 2004–2005, Aon, along with other brokers including Marsh & McLennan and Willis, fell under regulatory investigation under New York Attorney General Eliot Spitzer and other state attorneys general. At issue was the practice of insurance companies' payments to brokers (known as contingent commissions). The payments were thought to bring a conflict of interest, swaying broker decisions on behalf of carriers, rather than customers. In the spring of 2005, without acknowledging any wrongdoing, Aon agreed to a $190 million settlement, payable over 30 months. In the late 2007, Aon divested its two major underwriting subsidiaries: Combined Insurance Company of America (acquired by ACE Limited for $2.4 billion) and Sterling Life Insurance Company (purchased by Munich Re Group for $352 million) sold due to their low margin and capital-intensive nature. In November 2008, Aon acquired reinsurance intermediary and capital advisor Benfield Group Limited for $1.75 billion. The acquisition amplified the firm's broking capabilities, positioning Aon one of the largest players in the reinsurance brokerage industry. In 2010, Aon acquired Hewitt Associates for $4.9 billion. Aside from drastically boosting Aon's human resources consulting capacity and entering the firm into the business process outsourcing industry, the move added 23,000 colleagues and more than $3 billion in revenue. In January 2012, Aon announced that its headquarters would be moved to London, although North American operations and jobs remained in Chicago. In February 2017, Aon sold its employee benefits outsourcing business to private equity firm The Blackstone Group for US$4.8 billion (£3.8 billion). In February 2020, Aon named Eric Andersen as president of Aon. In 2021, Aon agreed to merge with Willis Towers Watson; the merger agreement was terminated due to regulatory concerns. Legal issues UK regulatory breach In January 2009, Aon was fined £5.69 million in the UK by the Financial Services Authority, who stated that the fine related to the company's inadequate bribery and corruption controls, claiming that between 14 January 2005 and 30 September 2007 Aon had failed to properly assess the risks involved in its dealings with overseas firms and individuals. The Authority did not find that any money had actually made its way to illegal organisations. Aon qualified for a 30% discount on the fine as a result of its cooperation with the investigation. Aon said its conduct was not deliberate, adding it had since \"significantly strengthened and enhanced its controls around the usage of third parties\". US Foreign Corrupt Practices Act violations In December 2011, Aon Corporation paid a $16.26 million penalty to the U.S. Securities and Exchange Commission and the U.S. Department of Justice for violations of the US Foreign Corrupt Practices Act. According to the Securities and Exchange Commission, Aon's subsidiaries made improper payments of over $3.6 million to government officials and third-party facilitators in Costa Rica, Egypt, Vietnam, Indonesia, the United Arab Emirates, Myanmar and Bangladesh, between 1983 and 2007, to obtain and retain insurance contracts. Major acquisitions In January 2007, Aon announced that its Aon Affinity group had acquired the WedSafe Wedding Insurance program. In August 2008, Aon announced that it had acquired London-based Benfield Group. The acquiring price was US$1.75 billion or £935 million, with US$170 million of debt. In March 2010, Hewitt Associates announced that it acquired Senior Educators Ltd. The acquisition offers companies a new way to address retiree medical insurance commitments. In July 2010, Aon announced that it had agreed to buy Lincolnshire, Illinois-based Hewitt Associates for $4.9 billion in cash and stock. In April 2011, Aon announced that it had acquired Johannesburg, South Africa-based Glenrand MIB. In July 2011, Aon announced that it bought Westfield Financial, the owner of insurance-industry consulting firm Ward Financial Group, from Ohio Farmers Insurance Co. In October 2012, Aon announced that it agreed to buy OmniPoint, Inc, a Workday consulting firm. Financial terms were not disclosed. In June 2014, Aon announced that it agreed to buy National Flood Services, Inc., a large processor of flood insurance, from Stoneriver Group, L.P. In October 2016, Aon's Aon Risk Solutions acquired Stroz Friedberg LLC, a specialised risk management firm focusing on cybersecurity. In November 2016, Aon acquired CoCubes an online Indian Assessment firm, facilitating hiring of entry-level engineering graduates. In February 2017, Aon plc agreed to sell its human resources outsourcing platform for US$4.8 billion (£3.8 billion) to Blackstone Group L.P. (BX.N), creating a new company called Alight Solutions. In September 2017, Aon announced its intent to purchase real estate investment management firm The Townsend Group from Colony NorthStar for $475 million, expanding Aon's property investment management portfolio. In December 2023, Aon agreed to acquire NFP, a middle-market provider of risk, benefits, wealth and retirement plan advisory services company, for $13.4 billion. In March 2024, Aon plc acquired the technology assets and intellectual property of Humn.ai, an AI-powered platform. This will enhance its commercial fleet proposition. Sponsorship of Manchester United In June 2009, Aon signed a four-year shirt sponsorship deal with Manchester United F.C.. On 1 June 2010, Aon replaced American International Group as the principal sponsor of the club. The Aon logo was prominently displayed on the front of the club's shirts until the 2014/2015 season when Aon was replaced by Chevrolet. The deal was said to be worth £80 million over four years, replacing United's deal with AIG as the most lucrative shirt deal in history at the time. From 2013 to 2021 Aon owned the naming rights to the Trafford Training Centre and sponsored the club's training kits, reportedly worth £180 million to the club. Awards Aon was awarded Investment Consultancy of the Year and Fiduciary Manager of the Year at the FT's 2014 Pension and Investment Provider Awards Aon received a perfect score on the Human Rights Campaign's 2013 Corporate Equality Index Aon was named to Working Mother's list of the 100 Best Companies for 2012 Aon Risk Solutions was the most recommended broker in 2012 for service and expertise by middle market buyers in Business Insurance's Buyers Choice Awards Aon Risk Solutions was named Broker of the Year and Training Programme of the Year in 2012 by Insurance Times Aon Benfield was named 2012 European Reinsurance Broker of the Year, Best European Property Reinsurance Broker and Best European Casualty Reinsurance Broker at the European Intelligent Insurer Awards Aon Benfield was named Best Global Reinsurance Broking Company for Analytics at Reactions Global Awards 2012 Aon Hewitt was named Top Retirement Consultant of 2012 by PLANSPONSOR Magazine2 Aon Hewitt was named Actuarial and Investment Consultant of the Year for 2012 at the Professional Pensions Awards"
}