{
  "ticker": "AOS",
  "cik": "0000091142",
  "company_name": "A. O. Smith",
  "corrected_name": "A. O. Smith",
  "wiki_title_used": "A. O. Smith",
  "exists": true,
  "raw_text": "A. O. Smith Corporation is an American manufacturer of both residential and commercial water heaters and boilers, and the largest manufacturer and marketer of water heaters in North America. It also supplies water treatment and water purification products in the Asian market. The company has 27 locations worldwide, including five manufacturing facilities in North America, as well as plants in Bengaluru in India, Nanjing in China and Veldhoven in The Netherlands.\nIn the past, A. O. Smith has had numerous other product lines.  Among them, it was the largest bomb maker in the United States by the end of World War I. Smith ranked 74th among United States corporations in the value of World War II military production contracts.\n\nHistory\nThe company today known as the A. O. Smith Corporation was founded in 1874 by Charles Jeremiah Smith as C. J. Smith and Sons, a baby carriage and bicycle parts manufacturer. It began forming steel tubing from sheet metal to make bicycle frames. By 1895, the company was the largest bicycle parts manufacturer. In 1899, Arthur Oliver Smith, a son of the founder, developed the world's first pressed steel vehicle frame and he later began making frames for the Peerless Automobile Company, Cadillac, and Ford Motor Company. In 1904, the company incorporated in Milwaukee, Wisconsin, as A. O. Smith Company.\nIn 1913, Lloyd Raymond Smith took over, and in 1914, the company introduced the Smith Motor Wheel, a gasoline-powered device for bicycles.\nIn 1915, it began manufacturing the Smith Flyer automobile, which it later sold to Briggs & Stratton of Milwaukee. A year later in 1916, A. O. Smith was incorporated in New York. In 1917, it began manufacturing bomb casings for World War I.\nIn the 1920s, company engineers developed the coated welding rod which they used in manufacturing until 1965, as well as the world's first fully automated automobile frame factory, with the capability of making a frame every eight seconds, until 1958, the first arc-welded, high-pressure vessel used to refine oil, which the company produced until 1963, and oil supply line pipes, until 1972.\nIn 1933, the company used the process of fusing glass to steel to make a large single-piece glass-lined brewery tank. Over the next 32 years, it made more than 11,000 glass-lined tanks. In 1936, the company patented the glass-lined water heater. Three years later, it began mass-producing residential water heaters, but shifted all production to war-time use during World War II.\nIn 1940, the company acquired Sawyer Electric of Los Angeles, California, a manufacturer of electric motors. In 1942, it once again began to produce bomb casings, as well as aircraft propellers, undercarriages, torpedoes, and air flasks. By 1945, the company had built 4.5 million bombs, 16,750 sets of landing gear, and 46,700 propeller blades. It also built nose frames for the B-25 bomber, water heaters, jeep frames, and components for the atomic bomb project. In 1946, it built a 400,000 square foot residential water heater plant in Kankakee, Illinois. From this plant, it also made water heaters with the Kenmore name. In 1948, it entered the commercial water heater market after acquiring The Burkay Company of Toledo, Ohio. In 1949, the company began producing Harvestore, a glass-fused-to-steel silo, targeted at dairy and livestock operations.\nIn the 1950s, A. O. Smith acquired Whirl-A-Way Motors of Dayton, Ohio, and consolidated its electric motor manufacturing operations there. The motor division later introduced the hermetic motor, a critical component of air conditioning and refrigeration compressors. Its water heater division introduced the first glass-lined commercial water heater, the A. O. Smith Burkay B-65, and later the company established a glass fiber division to replace steel in many applications. It also expanded into supplying oil field pipe and pipe for service stations, eventually becoming Smith Fiberglass Products in 1986.\nIn the early 1960s, the company opened a commercial water heater and boiler plant in Stratford, Ontario, Canada. In 1965, the Motor division invented the enclosed canopy, two-compartment motor, a design that improved the reliability in pool pump motors by separating the switching components from the motor windings. In 1967, fourth generation Smith family member, Lloyd B. Smith, was elected chairman and chief executive officer of the company. By 1969, the company had produced its 10 millionth residential water heater, and by 1972 had expanded to Europe. In 1974, the Conservationist line of residential water heaters was introduced. In 1976, the Motor division opened a plant in Bray, Ireland, to supply hermetic motors. In 1978, A. O. Smith began manufacturing storage tanks, beginning with Aquastore, a glass-fused-to-steel tank.\n\nBy the early 1980s, the Automotive Products unit had manufactured over 100 million passenger car frames, and 50 million truck frames, in Milwaukee, and soon after the company opened its first electric motor assembly operations in Ciudad Juárez and Ciudad Acuña, Mexico. In 1990, it developed the first hermetic motor insulation system compatible with R-134a non-ozone-depleting refrigerant. In 1995, they acquired Peabody TecTank of Parsons, Kansas, allowing A. O. Smith to enter the bulk dry storage market. That same year the company expanded into Asia by entering multiple joint-venture agreements: Smith Fiberglass Products and Harbin Composites Corporation to make fiberglass pipes for China's petroleum industry, and Water Products Company and Yuhan Water Heater to make residential water heaters. In 1996, the Water Products division introduced the Cyclone XHE commercial water heater. In 1997, after 90 years in the automotive industry, A. O. Smith sold its Automotive Products Company to Tower International. In 1997, they acquired UPPCO, Inc., making A. O Smith the world's leading manufacturer of C-frame subfractional horsepower motors. In 1998, they acquired General Electric’s domestic compressor motor business, as well as the electric motor division of Magnetek. By the end of the decade, Water Products Company had bought out its joint venture partner in Asia, and had opened a plant in Nanjing, China.\nIn the 2000s, A. O. Smith made a number of acquisitions, by acquiring State Industries, Inc., and its subsidiary APCOM Inc., Shenzhen Speeda Industrial Co. Ltd., and Athens Products, a supplier of hermetic motors for scroll compressor applications, as well as The Changheng Group of Changzhou, China, a manufacturer of fractional horsepower motors for HVAC applications, Taicang Special Motor Company, Ltd., of Suzhou, China, Yueyang Zhongmin Special Electrical Machinery Co. Ltd., Lochinvar Corporation, a manufacturer of high efficiency condensing boilers for hot water and hydronic heating applications, and in 2006, GSW Inc. a water heaters manufacturer for the Canadian market, and The American Water Heater Company, the exclusive supplier of water heaters to Lowe's, carrying the Whirlpool brand. In 2009, the company entered the water purification industry with a new venture, A. O. Smith (Shanghai) Water Treatment Products Co. Ltd. In 2010, A. O. Smith opened a 76,000 square foot residential water heater manufacturing plant in Bengaluru, India, which later expanded to 297000 sq ft operation with expansion to manufacture of water purification products. Takagi Industrial Company's North American operations were acquired in 2010.. In 2011, A. O. Smith sold its electric motor business to Regal-Beloit.\nOn August 8, 2016, A. O.Smith, acquired Austin-based water filtration company Aquasana (previously known as Sun Water Systems) from L' Catterton for $87 Million.\nIn November 2024, A. O.Smith finalized the acquisition of Pureit, the water purification business of Hindustan Unilever for ₹600 crore.\n\nBrands\nA. O. Smith operates under the following brand names around the world: A. O. Smith (United States, Canada, China, Europe, Turkey, India and Vietnam), GSW (Canada), John Wood (Canada), State Water Heaters, American Water Heaters, Reliance Water Heaters, Lochinvar, Takagi, Giant Factories Inc. and U.S. Craftmaster Water Heaters.\n\nProducts\nA. O. Smith Water Products Company is headquartered in Milwaukee, Wisconsin. The Ashland City, Tennessee location is home of the world's largest water heater factory. A. O. Smith Corporation manufactures the following types of water heaters for residential uses: gas and propane, hybrid, electric, tankless, and solar. The company manufactures the following types of water heaters for commercial uses: oil-fired, gas and electric, as well as boilers, storage tanks, and skid systems. It also provide the following accessories: pump tanks, and expansion tanks.\n\nA. O. Smith Foundation\nThe A. O. Smith Foundation is a private, nonprofit organization, founded in 1955, that has contributed nearly $50 million to qualifying charitable, educational, scientific, literary, and civic organizations located primarily in communities where A. O. Smith Corporation has facilities. The support for the Foundation comes from the profits of A. O. Smith Corporation.\n\nSee also\nList of S&P 500 companies\n\nReferences\nExternal links\nOfficial website \nBusiness data for A. O. Smith:",
  "clean_text": "A. O. Smith Corporation is an American manufacturer of both residential and commercial water heaters and boilers, and the largest manufacturer and marketer of water heaters in North America. It also supplies water treatment and water purification products in the Asian market. The company has 27 locations worldwide, including five manufacturing facilities in North America, as well as plants in Bengaluru in India, Nanjing in China and Veldhoven in The Netherlands. In the past, A. O. Smith has had numerous other product lines. Among them, it was the largest bomb maker in the United States by the end of World War I. Smith ranked 74th among United States corporations in the value of World War II military production contracts. History The company today known as the A. O. Smith Corporation was founded in 1874 by Charles Jeremiah Smith as C. J. Smith and Sons, a baby carriage and bicycle parts manufacturer. It began forming steel tubing from sheet metal to make bicycle frames. By 1895, the company was the largest bicycle parts manufacturer. In 1899, Arthur Oliver Smith, a son of the founder, developed the world's first pressed steel vehicle frame and he later began making frames for the Peerless Automobile Company, Cadillac, and Ford Motor Company. In 1904, the company incorporated in Milwaukee, Wisconsin, as A. O. Smith Company. In 1913, Lloyd Raymond Smith took over, and in 1914, the company introduced the Smith Motor Wheel, a gasoline-powered device for bicycles. In 1915, it began manufacturing the Smith Flyer automobile, which it later sold to Briggs & Stratton of Milwaukee. A year later in 1916, A. O. Smith was incorporated in New York. In 1917, it began manufacturing bomb casings for World War I. In the 1920s, company engineers developed the coated welding rod which they used in manufacturing until 1965, as well as the world's first fully automated automobile frame factory, with the capability of making a frame every eight seconds, until 1958, the first arc-welded, high-pressure vessel used to refine oil, which the company produced until 1963, and oil supply line pipes, until 1972. In 1933, the company used the process of fusing glass to steel to make a large single-piece glass-lined brewery tank. Over the next 32 years, it made more than 11,000 glass-lined tanks. In 1936, the company patented the glass-lined water heater. Three years later, it began mass-producing residential water heaters, but shifted all production to war-time use during World War II. In 1940, the company acquired Sawyer Electric of Los Angeles, California, a manufacturer of electric motors. In 1942, it once again began to produce bomb casings, as well as aircraft propellers, undercarriages, torpedoes, and air flasks. By 1945, the company had built 4.5 million bombs, 16,750 sets of landing gear, and 46,700 propeller blades. It also built nose frames for the B-25 bomber, water heaters, jeep frames, and components for the atomic bomb project. In 1946, it built a 400,000 square foot residential water heater plant in Kankakee, Illinois. From this plant, it also made water heaters with the Kenmore name. In 1948, it entered the commercial water heater market after acquiring The Burkay Company of Toledo, Ohio. In 1949, the company began producing Harvestore, a glass-fused-to-steel silo, targeted at dairy and livestock operations. In the 1950s, A. O. Smith acquired Whirl-A-Way Motors of Dayton, Ohio, and consolidated its electric motor manufacturing operations there. The motor division later introduced the hermetic motor, a critical component of air conditioning and refrigeration compressors. Its water heater division introduced the first glass-lined commercial water heater, the A. O. Smith Burkay B-65, and later the company established a glass fiber division to replace steel in many applications. It also expanded into supplying oil field pipe and pipe for service stations, eventually becoming Smith Fiberglass Products in 1986. In the early 1960s, the company opened a commercial water heater and boiler plant in Stratford, Ontario, Canada. In 1965, the Motor division invented the enclosed canopy, two-compartment motor, a design that improved the reliability in pool pump motors by separating the switching components from the motor windings. In 1967, fourth generation Smith family member, Lloyd B. Smith, was elected chairman and chief executive officer of the company. By 1969, the company had produced its 10 millionth residential water heater, and by 1972 had expanded to Europe. In 1974, the Conservationist line of residential water heaters was introduced. In 1976, the Motor division opened a plant in Bray, Ireland, to supply hermetic motors. In 1978, A. O. Smith began manufacturing storage tanks, beginning with Aquastore, a glass-fused-to-steel tank. By the early 1980s, the Automotive Products unit had manufactured over 100 million passenger car frames, and 50 million truck frames, in Milwaukee, and soon after the company opened its first electric motor assembly operations in Ciudad Juárez and Ciudad Acuña, Mexico. In 1990, it developed the first hermetic motor insulation system compatible with R-134a non-ozone-depleting refrigerant. In 1995, they acquired Peabody TecTank of Parsons, Kansas, allowing A. O. Smith to enter the bulk dry storage market. That same year the company expanded into Asia by entering multiple joint-venture agreements: Smith Fiberglass Products and Harbin Composites Corporation to make fiberglass pipes for China's petroleum industry, and Water Products Company and Yuhan Water Heater to make residential water heaters. In 1996, the Water Products division introduced the Cyclone XHE commercial water heater. In 1997, after 90 years in the automotive industry, A. O. Smith sold its Automotive Products Company to Tower International. In 1997, they acquired UPPCO, Inc., making A. O Smith the world's leading manufacturer of C-frame subfractional horsepower motors. In 1998, they acquired General Electric’s domestic compressor motor business, as well as the electric motor division of Magnetek. By the end of the decade, Water Products Company had bought out its joint venture partner in Asia, and had opened a plant in Nanjing, China. In the 2000s, A. O. Smith made a number of acquisitions, by acquiring State Industries, Inc., and its subsidiary APCOM Inc., Shenzhen Speeda Industrial Co. Ltd., and Athens Products, a supplier of hermetic motors for scroll compressor applications, as well as The Changheng Group of Changzhou, China, a manufacturer of fractional horsepower motors for HVAC applications, Taicang Special Motor Company, Ltd., of Suzhou, China, Yueyang Zhongmin Special Electrical Machinery Co. Ltd., Lochinvar Corporation, a manufacturer of high efficiency condensing boilers for hot water and hydronic heating applications, and in 2006, GSW Inc. a water heaters manufacturer for the Canadian market, and The American Water Heater Company, the exclusive supplier of water heaters to Lowe's, carrying the Whirlpool brand. In 2009, the company entered the water purification industry with a new venture, A. O. Smith (Shanghai) Water Treatment Products Co. Ltd. In 2010, A. O. Smith opened a 76,000 square foot residential water heater manufacturing plant in Bengaluru, India, which later expanded to 297000 sq ft operation with expansion to manufacture of water purification products. Takagi Industrial Company's North American operations were acquired in 2010.. In 2011, A. O. Smith sold its electric motor business to Regal-Beloit. On August 8, 2016, A. O.Smith, acquired Austin-based water filtration company Aquasana (previously known as Sun Water Systems) from L' Catterton for $87 Million. In November 2024, A. O.Smith finalized the acquisition of Pureit, the water purification business of Hindustan Unilever for ₹600 crore. Brands A. O. Smith operates under the following brand names around the world: A. O. Smith (United States, Canada, China, Europe, Turkey, India and Vietnam), GSW (Canada), John Wood (Canada), State Water Heaters, American Water Heaters, Reliance Water Heaters, Lochinvar, Takagi, Giant Factories Inc. and U.S. Craftmaster Water Heaters. Products A. O. Smith Water Products Company is headquartered in Milwaukee, Wisconsin. The Ashland City, Tennessee location is home of the world's largest water heater factory. A. O. Smith Corporation manufactures the following types of water heaters for residential uses: gas and propane, hybrid, electric, tankless, and solar. The company manufactures the following types of water heaters for commercial uses: oil-fired, gas and electric, as well as boilers, storage tanks, and skid systems. It also provide the following accessories: pump tanks, and expansion tanks. A. O. Smith Foundation The A. O. Smith Foundation is a private, nonprofit organization, founded in 1955, that has contributed nearly $50 million to qualifying charitable, educational, scientific, literary, and civic organizations located primarily in communities where A. O. Smith Corporation has facilities. The support for the Foundation comes from the profits of A. O. Smith Corporation."
}