{
  "ticker": "APA",
  "cik": "0001841666",
  "company_name": "APA Corporation",
  "corrected_name": "APA Corporation",
  "wiki_title_used": "APA Corporation",
  "exists": true,
  "raw_text": "APA Corporation is the holding company for Apache Corporation, an American company engaged in hydrocarbon exploration. It is organized in Delaware and headquartered in Houston. The company is ranked 431st on the Fortune 500.\n\nHistory\nIn 1954, the Apache Oil Corporation was founded in Minneapolis, Minnesota, by Truman Anderson, Raymond Plank and Charles Arnao with $250,000 in funding.\nIn 1955, the first wells were drilled in the Cushing field, between Tulsa and Oklahoma City.\nIn 1960, the company acquired interests in the Foshay Tower, a Minneapolis landmark. The 32-story imitation of the Washington Monument, became the company's headquarters from the early 1960s until 1984.\nIn 1967, the oil well Fagerness #1 was drilled, yielding the company's first major discovery.\nIn 1969, the company became a public company via an initial public offering.\nIn 1970, the company diversified into agriculture with the acquisition of the S&J Ranch in California. The ranch produced citrus fruit, figs, pistachios, olives, and almonds. It was sold in 1987 to Castle & Cooke.\nIn 1971, the company formed Apache Exploration Company (subsequently \"Apexco\") as its oil and gas operating company.\nIn 1977, the company sold Apexco and its non-petroleum holdings, including the ranch, and reinvested into a farm-in agreement with GHK to operate its wells in the Anadarko Basin.\nIn 1980, the company acquired a non-operating interest, via a participation in a Royal Dutch Shell joint venture, in operations in the Gulf Of Mexico.\nIn 1981, the company created Apache Petroleum Company (APC), the first public master limited partnership in the United States.\nIn 1985, the company acquired oil and gas wells in eight states from David Holdings for $200 million. In 1986, the company acquired oil and gas assets in the Gulf of Mexico from Occidental Petroleum.\nIn 1987, the company moved its headquarters from Minneapolis to Denver.\nIn 1991, the company doubled its reserves by acquiring assets from Amoco, including a position in the Permian Basin of West Texas, for $515 million and 2 million shares of the company.\nIn 1992, the company moved its headquarters to Houston, Texas and signed a lease for 220,000 square feet of office space.\nIn 1993, the company acquired Hadson Energy Resources in a $58 million transaction, expanding its assets to offshore Western Australia.\nIn 1994, the company began operations in Egypt by acquiring a 25 percent non-operated interest in the Qarun Concession, operated by the Phoenix Resource Companies. Production began in December 1995.\nIn 1995, the company acquired Dekalb Energy Canada, marking the company's return to Canada, in a $285 million stock transaction.\nIn 1995, the company also acquired 315 oil and gas fields in the Permian Basin, the Texas-Louisiana Gulf Coast, western Oklahoma, East Texas, the Rocky Mountains and the Gulf of Mexico from Texaco.\nIn 1996, the company acquired Phoenix Resources and took over operations of the Qarun Concession in Egypt.\nIn 1999, the company acquired fields and leases in the Gulf of Mexico from Royal Dutch Shell for $715 million in cash, plus 1 million shares of stock.\nIn 2001, the company acquired operations in the Libyan Desert of Egypt from Repsol for $410 million.\nIn 2002, the company drilled its first deepwater wells in the West Mediterranean Concession of offshore Egypt.\nIn 2003, the company acquired the Forties oilfield, the largest field ever discovered in the United Kingdom North Sea as well as assets in the Gulf of Mexico from BP for $1.3 billion.\nIn May 2005, the company and ExxonMobil completed a series of agreements that provided for transfers and joint ventures across a broad range of properties in Western Canada.\nIn October 2005, the company sold its 55% stake in the deepwater section of Egypt's concession for $413 million to Hess Corporation.\nIn April 2006, the company acquired Gulf of Mexico Shelf properties from BP.\nIn June 2006, the company sold its oil production interest in China to Australia-based Roc Oil Company for US$260 million.\nIn 2007, A test horizontal well at the Van Gogh project, in Exmouth Gulf, Western Australia, produced 9,694 barrels per day.\nIn February 2010, the company started production from the Van Gogh development offshore Western Australia.\nIn March 2010, a Federal judge upheld the company's decision to exclude from its annual meeting ballot a corporate governance proposal from a person who had not proven on a timely basis that he actually was one of the company's shareholders.\nIn June 2010, the company acquired assets in the Gulf of Mexico from Devon Energy for $1.05 billion.\nIn July 2010, the company acquired assets from BP in Texas, southeast New Mexico, western Canada, and Egypt for $7 billion.\nIn November 2010, the company acquired Mariner Energy for $2.7 billion.\nIn 2011, the company discovered eight oil wells in Egypt's Faghur Basin.\nIn January 2012, the company acquired assets in the Beryl field in the North Sea from ExxonMobil.\nIn May 2012, the company acquired Cordillera Energy Partners for $2.5 billion in cash and 6.3 million shares of common stock. The acquisition added approximately 71 million barrels of oil equivalent (430,000,000 GJ) to Apache's reserves and strengthened its position across western Oklahoma and the Texas Panhandle.\nIn November 2013, the company sold a non-controlling 1/3 share of its Egyptian assets to Sinopec\nIn 2015, the company sold its assets in Western Australia for $2.1 billion.\nIn 2016, the company sold its interest in the Scottish Area Gas Evacuation pipeline.\nIn 2017, the company sold its assets in Canada to Paramount Resources for C$459.5 million.\nIn 2020, the company declared its 'Alpine High' discovery to be a failure despite spending $3 billion on the play. Steven Keenan, VP of global exploration and Lead Geologist on the play resigned.\nIn January 2021, the company redid its agreement with the Egyptian General Petroleum Corporation.\nIn March 2021, the company reorganized its legal structure, with APA Corporation becoming the holding company for all of its subsidiaries.\nIn January 2024, APA Corporation and Callon Petroleum Company have recently inked a definitive agreement, paving the way for APA to acquire Callon in an all-stock transaction valued at approximately $4.5 billion, inclusive of Callon's net debt.\n\nOperations\nIn 2021, the company's total production was 388 thousand barrels of oil equivalent (2,370,000 GJ) per day, of which 59% was in the United States, 29% was in Egypt, and 12% was in the North Sea.\nAs of December 31, 2021, the company had 912 million barrels of oil equivalent (5.58×109 GJ) of estimated proved reserves, of which 68% was in the United States, 20% was in Egypt, and 12% was in the North Sea.\nAlmost all of the company's reserves in the United States are in the Permian Basin. The company also has reserves in western Oklahoma, the Texas Panhandle, and south Texas.\nThe company has been operating in remote areas of the Libyan Desert in Egypt since 1994 and has not experienced disruptions from political turmoil.\nThe company has been operating in the North Sea since 2003, predominantly in the Forties oilfield.\n\nControversies\n2013 toxic waste spill\nOn June 1, 2013, a pipeline in northern Alberta, Canada was noticed to have ruptured, spilling 60,000 barrels (9.5 million litres) of toxic waste in what was cited as one of the largest of such disasters in recent history in North America.\n\nPipeline explosion\nIn June 2008, the natural gas pipeline explosion at the company's processing hub on Varanus Island led to the 2008 Western Australian gas crisis. The Australian government was forced to drop charges as a result of a technicality.\n\nAttempts to limit shareholder proposals\nIn 2007, CEO G. Steven Farris wrote to the U.S. Securities and Exchange Commission in favor of limits on nonbinding shareholder proposals at public company annual meetings.\n\nReferences\nExternal links\nOfficial website\nBusiness data for APA Corporation:",
  "clean_text": "APA Corporation is the holding company for Apache Corporation, an American company engaged in hydrocarbon exploration. It is organized in Delaware and headquartered in Houston. The company is ranked 431st on the Fortune 500. History In 1954, the Apache Oil Corporation was founded in Minneapolis, Minnesota, by Truman Anderson, Raymond Plank and Charles Arnao with $250,000 in funding. In 1955, the first wells were drilled in the Cushing field, between Tulsa and Oklahoma City. In 1960, the company acquired interests in the Foshay Tower, a Minneapolis landmark. The 32-story imitation of the Washington Monument, became the company's headquarters from the early 1960s until 1984. In 1967, the oil well Fagerness #1 was drilled, yielding the company's first major discovery. In 1969, the company became a public company via an initial public offering. In 1970, the company diversified into agriculture with the acquisition of the S&J Ranch in California. The ranch produced citrus fruit, figs, pistachios, olives, and almonds. It was sold in 1987 to Castle & Cooke. In 1971, the company formed Apache Exploration Company (subsequently \"Apexco\") as its oil and gas operating company. In 1977, the company sold Apexco and its non-petroleum holdings, including the ranch, and reinvested into a farm-in agreement with GHK to operate its wells in the Anadarko Basin. In 1980, the company acquired a non-operating interest, via a participation in a Royal Dutch Shell joint venture, in operations in the Gulf Of Mexico. In 1981, the company created Apache Petroleum Company (APC), the first public master limited partnership in the United States. In 1985, the company acquired oil and gas wells in eight states from David Holdings for $200 million. In 1986, the company acquired oil and gas assets in the Gulf of Mexico from Occidental Petroleum. In 1987, the company moved its headquarters from Minneapolis to Denver. In 1991, the company doubled its reserves by acquiring assets from Amoco, including a position in the Permian Basin of West Texas, for $515 million and 2 million shares of the company. In 1992, the company moved its headquarters to Houston, Texas and signed a lease for 220,000 square feet of office space. In 1993, the company acquired Hadson Energy Resources in a $58 million transaction, expanding its assets to offshore Western Australia. In 1994, the company began operations in Egypt by acquiring a 25 percent non-operated interest in the Qarun Concession, operated by the Phoenix Resource Companies. Production began in December 1995. In 1995, the company acquired Dekalb Energy Canada, marking the company's return to Canada, in a $285 million stock transaction. In 1995, the company also acquired 315 oil and gas fields in the Permian Basin, the Texas-Louisiana Gulf Coast, western Oklahoma, East Texas, the Rocky Mountains and the Gulf of Mexico from Texaco. In 1996, the company acquired Phoenix Resources and took over operations of the Qarun Concession in Egypt. In 1999, the company acquired fields and leases in the Gulf of Mexico from Royal Dutch Shell for $715 million in cash, plus 1 million shares of stock. In 2001, the company acquired operations in the Libyan Desert of Egypt from Repsol for $410 million. In 2002, the company drilled its first deepwater wells in the West Mediterranean Concession of offshore Egypt. In 2003, the company acquired the Forties oilfield, the largest field ever discovered in the United Kingdom North Sea as well as assets in the Gulf of Mexico from BP for $1.3 billion. In May 2005, the company and ExxonMobil completed a series of agreements that provided for transfers and joint ventures across a broad range of properties in Western Canada. In October 2005, the company sold its 55% stake in the deepwater section of Egypt's concession for $413 million to Hess Corporation. In April 2006, the company acquired Gulf of Mexico Shelf properties from BP. In June 2006, the company sold its oil production interest in China to Australia-based Roc Oil Company for US$260 million. In 2007, A test horizontal well at the Van Gogh project, in Exmouth Gulf, Western Australia, produced 9,694 barrels per day. In February 2010, the company started production from the Van Gogh development offshore Western Australia. In March 2010, a Federal judge upheld the company's decision to exclude from its annual meeting ballot a corporate governance proposal from a person who had not proven on a timely basis that he actually was one of the company's shareholders. In June 2010, the company acquired assets in the Gulf of Mexico from Devon Energy for $1.05 billion. In July 2010, the company acquired assets from BP in Texas, southeast New Mexico, western Canada, and Egypt for $7 billion. In November 2010, the company acquired Mariner Energy for $2.7 billion. In 2011, the company discovered eight oil wells in Egypt's Faghur Basin. In January 2012, the company acquired assets in the Beryl field in the North Sea from ExxonMobil. In May 2012, the company acquired Cordillera Energy Partners for $2.5 billion in cash and 6.3 million shares of common stock. The acquisition added approximately 71 million barrels of oil equivalent (430,000,000 GJ) to Apache's reserves and strengthened its position across western Oklahoma and the Texas Panhandle. In November 2013, the company sold a non-controlling 1/3 share of its Egyptian assets to Sinopec In 2015, the company sold its assets in Western Australia for $2.1 billion. In 2016, the company sold its interest in the Scottish Area Gas Evacuation pipeline. In 2017, the company sold its assets in Canada to Paramount Resources for C$459.5 million. In 2020, the company declared its 'Alpine High' discovery to be a failure despite spending $3 billion on the play. Steven Keenan, VP of global exploration and Lead Geologist on the play resigned. In January 2021, the company redid its agreement with the Egyptian General Petroleum Corporation. In March 2021, the company reorganized its legal structure, with APA Corporation becoming the holding company for all of its subsidiaries. In January 2024, APA Corporation and Callon Petroleum Company have recently inked a definitive agreement, paving the way for APA to acquire Callon in an all-stock transaction valued at approximately $4.5 billion, inclusive of Callon's net debt. Operations In 2021, the company's total production was 388 thousand barrels of oil equivalent (2,370,000 GJ) per day, of which 59% was in the United States, 29% was in Egypt, and 12% was in the North Sea. As of December 31, 2021, the company had 912 million barrels of oil equivalent (5.58×109 GJ) of estimated proved reserves, of which 68% was in the United States, 20% was in Egypt, and 12% was in the North Sea. Almost all of the company's reserves in the United States are in the Permian Basin. The company also has reserves in western Oklahoma, the Texas Panhandle, and south Texas. The company has been operating in remote areas of the Libyan Desert in Egypt since 1994 and has not experienced disruptions from political turmoil. The company has been operating in the North Sea since 2003, predominantly in the Forties oilfield. Controversies 2013 toxic waste spill On June 1, 2013, a pipeline in northern Alberta, Canada was noticed to have ruptured, spilling 60,000 barrels (9.5 million litres) of toxic waste in what was cited as one of the largest of such disasters in recent history in North America. Pipeline explosion In June 2008, the natural gas pipeline explosion at the company's processing hub on Varanus Island led to the 2008 Western Australian gas crisis. The Australian government was forced to drop charges as a result of a technicality. Attempts to limit shareholder proposals In 2007, CEO G. Steven Farris wrote to the U.S. Securities and Exchange Commission in favor of limits on nonbinding shareholder proposals at public company annual meetings."
}