{
  "ticker": "APD",
  "cik": "0000002969",
  "company_name": "Air Products",
  "corrected_name": "Air Products",
  "wiki_title_used": "Air Products",
  "exists": true,
  "raw_text": "Air Products and Chemicals, Inc. is a U.S.-based international corporation whose principal business is selling gases and chemicals for industrial use. Air Products is headquartered in Trexlertown, Pennsylvania, in the Lehigh Valley region of eastern Pennsylvania.\nAs of 2024, Air Products is the fifth-largest employer in the Lehigh Valley.\n\nHistory\n20th century\nAir Products was founded in Detroit in 1940 by Leonard Parker Pool with the objective of establishing on-site production and sales of various forms of industrial gas.\nThe following year, in 1941, the U.S. entered World War II, and Air Products began manufacturing mobile generators for the production of oxygen used in high elevation military flights and necessary to meet the needs of the U.S. Air Force and allied air forces.\nIn 1944, the company relocated its headquarters from Detroit to Chattanooga, Tennessee, where it expanded its oxygen production manufacturing capacity to meet the needs of the U.S. military and its allies in their war against Nazi Germany and the Axis powers.\nFollowing the end of World War II, the company relocated its headquarters and operations to Emmaus, Pennsylvania in the manufacturing-intensive Lehigh Valley region of eastern Pennsylvania. In the late 1950s, it completed the development of its current corporate headquarters in neighboring Trexlertown.\nAir Products serves customers in technology, energy, healthcare, food, and industrial markets worldwide with atmospheric industrial gases, including oxygen, nitrogen, argon, hydrogen, and carbon dioxide, process and specialty gases, performance materials, and chemical intermediates.\nAir Products produces refinery hydrogen, liquified natural gas technologies and equipment, epoxy additives, gas cabinets, advanced coatings, and adhesives.\n\n21st century\nIn 2001, Air Products Received an Award of Merit from the WateReuse Association for Outstanding Water Conservation Efforts for conserving 62 million US gallons (230,000 m3) of drinking water annually by converting to recycled water for the cooling process at its Santa Clara, California manufacturing facility. The award was presented during the 25th Annual WateReuse Symposium. WRA recognizes projects that have advanced the acceptance of water reuse through education, sound science, and technology using reclamation, recycling, reuse, or desalination for the benefit of the public and the environment.\nAir Products provided the liquid hydrogen and liquid oxygen fuel for the Space Shuttle external tank. Air Products has had a working relationship with NASA for five decades, supplying the liquid hydrogen used for every Space Shuttle launch and the Mercury and Apollo missions.\nAir Products is included on the Dow Jones Sustainability North America Index as one of the best performing sustainable companies for the period of 2008 to 2011.\nIn January 2004, Air Products (NYSE: APD) was named a Maplecroft Climate Innovation Indexes (CIIs) Leader, the 17th largest U.S.-based company that has undergone evaluation of its climate-related innovation and carbon management programs. Air Products is currently working on several preeminent carbon capture and storage demonstration projects around the world.\nIn 2010, Air Products was awarded the Rushlight Hydrogen and Fuel Cells industry award for the Series 10 hydrogen fuelling station, which celebrates the leading environmental technologies and innovations by organizations throughout the United Kingdom and Ireland by promoting development in hydrogen and fuel cells and enabling further development and funding to be granted toward reducing carbon emissions.\nIn March 2010, Corporate Responsibility magazine named Air Products to its 100 Best Corporate Citizens List.\nIn 2013, Air Products' high purity built-in purifier argon was used to determine a more accurate value for the Boltzmann constant.\nIn September 2015, Air Products announced its intent to spin off its Materials Technologies business. This new stand alone company was named Versum Materials. The spinoff was completed on October 3, 2016. Versum was later acquired by pharmaceutical company Merck.\nIn January 2017, Air Products completed the sale of its Performance Materials division to Evonik, leaving the company focused on its industrial gases business.\nAir Products initially refused to cease operations in Russia in response to the 2022 invasion of Ukraine and the international sanctions subsequently levied against Russia.  However, according to Yale School of Management, the company reversed its position and has since divested its interests in Russia.\nIn 2022, Air Products announced plans for the development of a green hydrogen production plan in the United Kingdom, located in the Humberside region. In June 2025, the company withdrew its involvement and investment following a 'lack of commitment' by the British government.\n\nCorporate affairs\nChief executives\nLeonard Pool: 1940-1973\nEd Donley: 1973-1986\nDexter Baker: 1986-1992\nHap Wagner: 1992-2000\nJP Jones: 2000-2008\nJohn McGlade: 2008 -2014\nSeifi Ghasemi: 2014 - 2025\nEduardo Menezes: 2025 - present\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Air Products and Chemicals, Inc.:",
  "clean_text": "Air Products and Chemicals, Inc. is a U.S.-based international corporation whose principal business is selling gases and chemicals for industrial use. Air Products is headquartered in Trexlertown, Pennsylvania, in the Lehigh Valley region of eastern Pennsylvania. As of 2024, Air Products is the fifth-largest employer in the Lehigh Valley. History 20th century Air Products was founded in Detroit in 1940 by Leonard Parker Pool with the objective of establishing on-site production and sales of various forms of industrial gas. The following year, in 1941, the U.S. entered World War II, and Air Products began manufacturing mobile generators for the production of oxygen used in high elevation military flights and necessary to meet the needs of the U.S. Air Force and allied air forces. In 1944, the company relocated its headquarters from Detroit to Chattanooga, Tennessee, where it expanded its oxygen production manufacturing capacity to meet the needs of the U.S. military and its allies in their war against Nazi Germany and the Axis powers. Following the end of World War II, the company relocated its headquarters and operations to Emmaus, Pennsylvania in the manufacturing-intensive Lehigh Valley region of eastern Pennsylvania. In the late 1950s, it completed the development of its current corporate headquarters in neighboring Trexlertown. Air Products serves customers in technology, energy, healthcare, food, and industrial markets worldwide with atmospheric industrial gases, including oxygen, nitrogen, argon, hydrogen, and carbon dioxide, process and specialty gases, performance materials, and chemical intermediates. Air Products produces refinery hydrogen, liquified natural gas technologies and equipment, epoxy additives, gas cabinets, advanced coatings, and adhesives. 21st century In 2001, Air Products Received an Award of Merit from the WateReuse Association for Outstanding Water Conservation Efforts for conserving 62 million US gallons (230,000 m3) of drinking water annually by converting to recycled water for the cooling process at its Santa Clara, California manufacturing facility. The award was presented during the 25th Annual WateReuse Symposium. WRA recognizes projects that have advanced the acceptance of water reuse through education, sound science, and technology using reclamation, recycling, reuse, or desalination for the benefit of the public and the environment. Air Products provided the liquid hydrogen and liquid oxygen fuel for the Space Shuttle external tank. Air Products has had a working relationship with NASA for five decades, supplying the liquid hydrogen used for every Space Shuttle launch and the Mercury and Apollo missions. Air Products is included on the Dow Jones Sustainability North America Index as one of the best performing sustainable companies for the period of 2008 to 2011. In January 2004, Air Products (NYSE: APD) was named a Maplecroft Climate Innovation Indexes (CIIs) Leader, the 17th largest U.S.-based company that has undergone evaluation of its climate-related innovation and carbon management programs. Air Products is currently working on several preeminent carbon capture and storage demonstration projects around the world. In 2010, Air Products was awarded the Rushlight Hydrogen and Fuel Cells industry award for the Series 10 hydrogen fuelling station, which celebrates the leading environmental technologies and innovations by organizations throughout the United Kingdom and Ireland by promoting development in hydrogen and fuel cells and enabling further development and funding to be granted toward reducing carbon emissions. In March 2010, Corporate Responsibility magazine named Air Products to its 100 Best Corporate Citizens List. In 2013, Air Products' high purity built-in purifier argon was used to determine a more accurate value for the Boltzmann constant. In September 2015, Air Products announced its intent to spin off its Materials Technologies business. This new stand alone company was named Versum Materials. The spinoff was completed on October 3, 2016. Versum was later acquired by pharmaceutical company Merck. In January 2017, Air Products completed the sale of its Performance Materials division to Evonik, leaving the company focused on its industrial gases business. Air Products initially refused to cease operations in Russia in response to the 2022 invasion of Ukraine and the international sanctions subsequently levied against Russia. However, according to Yale School of Management, the company reversed its position and has since divested its interests in Russia. In 2022, Air Products announced plans for the development of a green hydrogen production plan in the United Kingdom, located in the Humberside region. In June 2025, the company withdrew its involvement and investment following a 'lack of commitment' by the British government. Corporate affairs Chief executives Leonard Pool: 1940-1973 Ed Donley: 1973-1986 Dexter Baker: 1986-1992 Hap Wagner: 1992-2000 JP Jones: 2000-2008 John McGlade: 2008 -2014 Seifi Ghasemi: 2014 - 2025 Eduardo Menezes: 2025 - present"
}