{
  "ticker": "APH",
  "cik": "0000820313",
  "company_name": "Amphenol",
  "corrected_name": "Amphenol",
  "wiki_title_used": "Amphenol",
  "exists": true,
  "raw_text": "Amphenol Corporation is an American producer of electronic and fiber optic connectors, cable and interconnect systems such as coaxial cables. Amphenol is a portmanteau from the corporation's original name, American Phenolic Corp.\n\nHistory\nAmphenol was founded in Chicago in 1932 by entrepreneur Arthur J. Schmitt, whose first product was a tube socket for radio tubes (valveholder bases).  Amphenol expanded significantly during World War II, when the company became the primary manufacturer of connectors used in military hardware, including airplanes and radios. From 1967 to 1982 it was part of Bunker Ramo Corporation.\nThe company sells its products into diverse electronics markets, including military-aerospace, industrial, automotive, information technology, mobile phones, wireless infrastructure, broadband, medical, and pro audio. Operations are located in more than 60 locations around the world.\nAmphenol's world headquarters is located in Wallingford, Connecticut. The largest division of Amphenol is Amphenol Aerospace (formerly Bendix Corporation) in Sidney, New York. This is the birthplace of the MIL-DTL-38999 cylindrical connector. Amphenol engineers also invented the commonly used BNC connector (\"Bayonet Neill-Concelman\").\nAmphenol Fiber Systems International is a fiber optic company started in 1993 that specializes in the fabrication and manufacturing of fiber optic connectivity products and systems. AFSI provides communication systems rooted in fiber optic interconnect technology. AFSI employs over 250 people at its 94,000 square foot facility in the heart of the telecom corridor in Allen, just north of Dallas, Texas.\nThe Amphenol Cables on Demanda division launched in December 2006, specializing in distributing standard cable assemblies via an e-commerce storefront selling over 2500 audio, video, computer, and networking cables. Offices are located in New York, California, Florida, Toronto, and China.\n\nAcquisitions\nIn 1986, Amphenol acquired Socapex, a French manufacturer of connectors and interconnect systems based in Thyez. The company manufactures a variety of electrical and fiber optic connectors, contacts and accessories for the Defense, Aviation, Rail Mass Transit, Energy, Entertainment and Space industries.\nIn May 2005, Amphenol acquired SV Microwave, a manufacturer of RF connectors, components and cable assemblies.\nOn October 10, 2005, Teradyne and Amphenol announced that Amphenol would acquire Teradyne Connection Systems, for about USD $390 million in cash. TCS, based in Nashua, New Hampshire, manufactures high-density electronic connectors, complete backplanes, and systems packaging, a product line that complements Amphenol's existing lines of business.\nIn February 2008, Amphenol acquired SEFEE, a French electronic manufacturer, the next year in 2009 it acquired Jaybeam Wireless. Jaybeam Wireless became Amphenol Jaybeam and is now Amphenol Antenna Solutions.\nOn November 15, 2013, Amphenol announced it had entered an agreement to acquire Advanced Sensors Business of GE for approx. $318 million.\nIn December 2013, Amphenol acquired Tecvox OEM Solutions LLC, a business started by Raj Khanijow based in Huntsville AL. Tecvox is a leader in automotive OEM USB connectivity products. Tecvox was the first automotive company to release the OEM USB based media hub and charger.\nOn January 8, 2016, Amphenol finalized its deal to acquire FCI Asia Pte Ltd an interconnect company specializing in the telecom, datacom and wireless communications markets.\nIn July 2016, Amphenol acquired AUXELFTG (AUXEL), a French manufacturer  of power busbars and power interconnect solutions.\nIn January 2017, Amphenol acquired Phitek Ltd, a New Zealand-based manufacturer and the world's leading supplier of electronic noise-cancellation, audio enhancement and other electronic touch point devices in the aircraft cabin.\nIn June 2017, Amphenol acquired Wilcoxon Research (US), Piezo Technologies (US) and Piher Sensors and Controls (Spain), three Industrial Sensing businesses from the  British engineering group Meggitt PLC.\nIn January 2020, Amphenol acquired Exa Thermometrics India Pvt Ltd, an NTC thermistor based sensing solutions company based in Bangalore, India.\nIn December 2020, Amphenol announced it had reached an agreement to acquire MTS Systems Corporation in an acquisition completed on April 7, 2021.\nIn December 2021, Amphenol announced that it had acquired Halo Technology Limited for approximately $715 million.\nIn May 2024, Amphenol announced that it had acquired Carlisle Interconnect Technology for $2 Billions.\nIn July 2024, Amphenol announced it would acquire CommScope’s Outdoor Wireless Networks (OWN) and Distributed Antenna Systems (DAS) businesses for $2.1 billion in cash. Amphenol subsequently highlighted the return of the ANDREW brand name. In August 2025, Amphenol agreed to buy CommScope's connectivity and cable business unit for $10.5 billion.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Amphenol Corporation:",
  "clean_text": "Amphenol Corporation is an American producer of electronic and fiber optic connectors, cable and interconnect systems such as coaxial cables. Amphenol is a portmanteau from the corporation's original name, American Phenolic Corp. History Amphenol was founded in Chicago in 1932 by entrepreneur Arthur J. Schmitt, whose first product was a tube socket for radio tubes (valveholder bases). Amphenol expanded significantly during World War II, when the company became the primary manufacturer of connectors used in military hardware, including airplanes and radios. From 1967 to 1982 it was part of Bunker Ramo Corporation. The company sells its products into diverse electronics markets, including military-aerospace, industrial, automotive, information technology, mobile phones, wireless infrastructure, broadband, medical, and pro audio. Operations are located in more than 60 locations around the world. Amphenol's world headquarters is located in Wallingford, Connecticut. The largest division of Amphenol is Amphenol Aerospace (formerly Bendix Corporation) in Sidney, New York. This is the birthplace of the MIL-DTL-38999 cylindrical connector. Amphenol engineers also invented the commonly used BNC connector (\"Bayonet Neill-Concelman\"). Amphenol Fiber Systems International is a fiber optic company started in 1993 that specializes in the fabrication and manufacturing of fiber optic connectivity products and systems. AFSI provides communication systems rooted in fiber optic interconnect technology. AFSI employs over 250 people at its 94,000 square foot facility in the heart of the telecom corridor in Allen, just north of Dallas, Texas. The Amphenol Cables on Demanda division launched in December 2006, specializing in distributing standard cable assemblies via an e-commerce storefront selling over 2500 audio, video, computer, and networking cables. Offices are located in New York, California, Florida, Toronto, and China. Acquisitions In 1986, Amphenol acquired Socapex, a French manufacturer of connectors and interconnect systems based in Thyez. The company manufactures a variety of electrical and fiber optic connectors, contacts and accessories for the Defense, Aviation, Rail Mass Transit, Energy, Entertainment and Space industries. In May 2005, Amphenol acquired SV Microwave, a manufacturer of RF connectors, components and cable assemblies. On October 10, 2005, Teradyne and Amphenol announced that Amphenol would acquire Teradyne Connection Systems, for about USD $390 million in cash. TCS, based in Nashua, New Hampshire, manufactures high-density electronic connectors, complete backplanes, and systems packaging, a product line that complements Amphenol's existing lines of business. In February 2008, Amphenol acquired SEFEE, a French electronic manufacturer, the next year in 2009 it acquired Jaybeam Wireless. Jaybeam Wireless became Amphenol Jaybeam and is now Amphenol Antenna Solutions. On November 15, 2013, Amphenol announced it had entered an agreement to acquire Advanced Sensors Business of GE for approx. $318 million. In December 2013, Amphenol acquired Tecvox OEM Solutions LLC, a business started by Raj Khanijow based in Huntsville AL. Tecvox is a leader in automotive OEM USB connectivity products. Tecvox was the first automotive company to release the OEM USB based media hub and charger. On January 8, 2016, Amphenol finalized its deal to acquire FCI Asia Pte Ltd an interconnect company specializing in the telecom, datacom and wireless communications markets. In July 2016, Amphenol acquired AUXELFTG (AUXEL), a French manufacturer of power busbars and power interconnect solutions. In January 2017, Amphenol acquired Phitek Ltd, a New Zealand-based manufacturer and the world's leading supplier of electronic noise-cancellation, audio enhancement and other electronic touch point devices in the aircraft cabin. In June 2017, Amphenol acquired Wilcoxon Research (US), Piezo Technologies (US) and Piher Sensors and Controls (Spain), three Industrial Sensing businesses from the British engineering group Meggitt PLC. In January 2020, Amphenol acquired Exa Thermometrics India Pvt Ltd, an NTC thermistor based sensing solutions company based in Bangalore, India. In December 2020, Amphenol announced it had reached an agreement to acquire MTS Systems Corporation in an acquisition completed on April 7, 2021. In December 2021, Amphenol announced that it had acquired Halo Technology Limited for approximately $715 million. In May 2024, Amphenol announced that it had acquired Carlisle Interconnect Technology for $2 Billions. In July 2024, Amphenol announced it would acquire CommScope’s Outdoor Wireless Networks (OWN) and Distributed Antenna Systems (DAS) businesses for $2.1 billion in cash. Amphenol subsequently highlighted the return of the ANDREW brand name. In August 2025, Amphenol agreed to buy CommScope's connectivity and cable business unit for $10.5 billion."
}