{
  "ticker": "APO",
  "cik": "0001858681",
  "company_name": "Apollo Global Management",
  "corrected_name": "Apollo Global Management",
  "wiki_title_used": "Apollo Global Management",
  "exists": true,
  "raw_text": "Apollo Global Management, Inc. is an American asset management firm that primarily invests in alternative assets. As of 2025, the company had $840 billion of assets under management, including $392 billion invested in credit, including mezzanine capital, hedge funds, non-performing loans, and collateralized loan obligations, $99 billion invested in private equity, and $46.2 billion invested in real assets, which includes real estate and infrastructure. The company invests money on behalf of pension funds, financial endowments, and sovereign wealth funds, as well as other institutional and individual investors.\nApollo was founded in 1990 by Leon Black, Josh Harris, and Marc Rowan, former investment bankers at the defunct Drexel Burnham Lambert. The company is headquartered in the Solow Building in New York City, with offices across North America, Europe, and Asia. Founder and CEO Leon Black resigned as CEO in 2021 in the wake of sexual misconduct allegations and revelations that he had paid $158 million to Jeffrey Epstein.\nIn addition to its private funds, Apollo operates Apollo Investment Corporation (AIC), a US-domiciled publicly traded, private-equity, closed-end fund and Business Development Company. AIC provides mezzanine debt, senior secured loans, and equity investments to middle-market companies, including public companies, although it historically has not invested in companies controlled by Apollo's private-equity funds.\nIn June 2024, Apollo Global Management ranked 29th in Private Equity International's PEI 300 ranking among the world's largest private equity firms.\n\nHistory\nApollo, originally referred to as Apollo Advisors, was founded after the collapse of Drexel Burnham Lambert in 1990 by Leon Black, the former head of Drexel's mergers and acquisitions department, along with Josh Harris and Marc Rowan. Tony Ressler, another former senior Drexel executive, was also among the firm's original members.\nWithin six months after the collapse of Drexel, Apollo launched Apollo Investment Fund L.P., the first of its private-equity investment funds, formed to make investments in distressed companies. Apollo raised around $400 million of investor commitments based on Leon Black's reputation as a prominent lieutenant of Michael Milken and a key player in the buyout boom of the 1980s.\nLion Advisors (or Lion Capital) was founded in 1990 to provide investment services to Credit Lyonnais and foreign institutions, seeking to profit from depressed prices in the high-yield market. In 1992, Lion entered into a more formal arrangement to manage the $3 billion high-yield portfolio for Credit Lyonnais which together with a consortium of other international investors provided the capital for Lion's investment activities. Lion Advisors was replaced by Ares Management.\n\n1990s\nAt the time of Apollo's founding, little financing was available for new leveraged buyouts and Apollo turned, instead, to a strategy of distressed-to-control takeovers. Apollo purchased distressed securities, which could be converted into a controlling interest in the equity of the company through a bankruptcy reorganization or other restructuring. Apollo used distressed debt as an entry point, enabling the firm to invest in such firms as Vail Resorts, Walter Industries, Culligan, and Samsonite.\nApollo acquired interests in companies that Drexel had helped finance by purchasing high-yield bonds from failed savings and loans and insurance companies. Apollo acquired several large portfolios of assets from the U.S. government's Resolution Trust Corporation. One of Apollo's earliest and most successful deals involved the acquisition of Executive Life Insurance Company's bond portfolio. Using this vehicle, Apollo purchased the Executive Life portfolio, profiting when the value of high-yield bonds recovered, but also resulting in a variety of state regulatory issues for Apollo and Credit Lyonnais over the purchase.\n\nIn 1993, Apollo Real Estate Advisers was founded in collaboration with William Mack to seek opportunities in the U.S. property markets.\nIn April 1993, Apollo Real Estate Investment Fund, L.P., the first in a family of real estate \"opportunity funds\", was closed with $500 million of investor commitments. In 2000, Apollo exited the partnership, which continued to operate as Apollo Real Estate Advisers until changing its name to AREA Property Partners effective January 15, 2009. That firm was then owned and controlled by its remaining principals, including William Mack, Lee Neibart, William Benjamin, John Jacobsson, Stuart Koenig, and Richard Mack.\nIn 1995, Apollo raised its third private-equity fund, Apollo Investment Fund III, with $1.5 billion of investor commitments from investors that included CalPERS and the General Motors pension fund. Fund III was only an average performer for private-equity funds of its vintage. Among the investments made in Fund III (invested through 1998) were: Alliance Imaging, Allied Waste Industries, Breuners Home Furnishings, Levitz Furniture, Communications Corporation of America, Dominick's, Ralphs (acquired Apollo's Food-4-Less), Move.com, NRT Incorporated, Pillowtex Corporation, Telemundo, and WMC Mortgage Corporation.\nAlso in 1995, Apollo's founding partner Craig Cogut left the firm to found Pegasus Capital Advisors. Since its inception, Pegasus has raised $1.8 billion in four private-equity funds focused on investments in middle-market companies in financial distress.\nIn 1997, Ares Management was founded by Antony Ressler and John H. Kissick, both partners at Apollo, as well as Bennett Rosenthal, who joined the group from the global leveraged finance group at Merrill Lynch, to manage a $1.2 billion market value collateralized debt obligation vehicle. Ares I and II which were raised were structured as market value CLOs. Ares III-Ares X were structured as cash flow CLOs. In 2002, Ares completed a corporate spin-off from Apollo management. Although technically the founders of Ares had completed a spinout with the formation of the firm in 1997, they had maintained a close relationship with Apollo over its first five years and operated as the West Coast affiliate of Apollo. Shortly thereafter, Ares completed fundraising for Ares Corporate Opportunities Fund, a special-situations investment fund with $750 million of capital under management.\nIn 1998, during the dot-com bubble, Apollo raised Apollo Investment Fund IV with $3.6 billion of investor commitments. As of April 8, 2008, the fund had generated a 10% IRR net of fees. Among the investments made in Fund IV (invested through 2001) were: Allied Waste Industries, AMC Entertainment, Berlitz International, Clark Retail Enterprises, Corporate Express (Buhrmann), Encompass Services Corporation, National Financial Partners, Pacer International, Rent-A-Center, Resolution Performance Products, Resolution Specialty Materials, Sirius Satellite Radio, SkyTerra Communications, United Rentals, and Wyndham Worldwide.\n\n2000–2005\nIn April 2001, Apollo raised Apollo Investment Fund V with $3.7 billion of investor commitments. As of April 8, 2008, the fund had generated a 54% IRR net of fees. Among the investments made in Fund V (invested through 2006) were Affinion Group, AMC Entertainment, Berry Plastics, Cablecom, Compass Minerals, General Nutrition Centers (GNC), Goodman Global, Hexion Specialty Chemicals (Borden), Intelsat, Linens 'n Things, Metals USA, Nalco Investment Holdings, Sourcecorp, Spectrasite Communications, and Unity Media. \nAlthough the founders of Ares had completed a corporate spin-off with the formation of the firm in 1997, they had initially maintained a close relationship with Apollo and operated as the West Coast affiliate of Apollo.. In 2002, when Ares raised its first corporate opportunities fund, the firm announced that it would separate from its former parent company. The timing of this separation also coincided with Apollo's legal difficulties with the State of California over its purchase of Executive Life Insurance Company in 1991. The same year, Attorney General of California Bill Lockyer accused Leon and an investor group led by French bank Credit Lyonnais of violating California law by having a foreign government-owned bank acquire the assets and bond portfolio of Executive Life Insurance.\nIn April 2004, Apollo raised $930 million through an initial public offering for a listed business development company, Apollo Investment Corporation. In September 2004, investment funds managed by Apollo and Sterling Partners acquired Connections Academy. It was sold in 2011 for $400 million.\n\n2005–2010\nIn 2005, Apollo formed Hexion Specialty Chemicals through the merger of Borden, Inc., Resolution Performance Products LLC, and Resolution Specialty Materials, LLC, and the acquisition of Bakelite AG. Hexion announced in July 2007 that it was acquiring Huntsman Corporation, a major specialty-chemicals company, in a $6.5 billion leveraged buyout. Hexion announced in June 2008 it would refuse to close the deal, prompting a series of legal actions. The transaction was terminated in December after a settlement between Hexion and Huntsman, wherein they were required to pay Huntsman $1 billion to drop fraud charges.\n\nBetween 2005 and 2007, the private equity market was booming. Among Apollo's most notable investments during this period were Harrah's Entertainment, Norwegian Cruise Line, Claire's Stores, and Realogy.\nIn 2006, Apollo acquired Rexnord Corporation for $1.825 billion, Berry Plastics for $2.25 billion, Momentive Performance Materials for approximately $3.8 billion, and TNT N.V. for $1.9 billion.\n\nIn August 2006, Apollo launched a $2 billion vehicle in Europe, AP Alternative Assets. It was a Guernsey-domiciled publicly traded, private-equity closed-end, limited partnership, managed by Apollo Alternative Assets, an affiliate of Apollo Management. Apollo initially attempted to raise $2.5 billion for the public vehicle, but fell short when it offered the shares in June 2006, raising only $1.5 billion. Apollo raised an additional $500 million via private placements in the weeks following that sale. AAA was formed to invest alongside Apollo's main private-equity funds and hedge funds. AAA's investment portfolio was made up of a mix of private-equity and capital-markets investments. It was liquidated in 2020.\nIn October 2006, Apollo announced a $990 million leveraged buyout of Jacuzzi Brands, a manufacturer of whirlpool baths. In 2006, Apollo acquired International Paper's coated paper and supercalendered paper business for $1.4 billion, renaming the business Verso Paper. Verso is the second-largest producer of the North American magazine publishing and catalog/commercial print markets. In May 2008, Verso became a public company via an IPO.\nIn February 2007, Apollo acquired Oceania Cruises for $850 million and provided additional capital to fund the expansion of the company with the purchase of two new cruise ships.\nIn February 2007, Apollo announced the acquisition of the Smart & Final chain of warehouse-style food and supply stores. In June 2007, Smart & Final completed the acquisition of the Henry's Marketplace chain of \"farmers market\" style food retailers from Wild Oats Markets as part of that company's acquisition by Whole Foods Market. In 2011, the Henry's chain was merged with Sprouts Farmers Market, which, like the Henry's markets, had been founded by Henry Boney.\nIn March 2007, Apollo announced the $3.1 billion leveraged buyouts of costume jewelry retailer Claire's Stores. In 2008, Claire's experienced financial difficulty amid the slump in consumer spending.\nIn April 2007, Apollo acquired Noranda Aluminum, the US aluminum business of Xstrata for $1.15 billion. Noranda Aluminum includes a primary smelter and three rolling mills in Tennessee, North Carolina, and Arkansas along with other operations.\nIn April 2007, Apollo acquired Realogy, a franchisor that owns Coldwell Banker, Century 21, and Sotheby's International Realty, for $8.5 billion. As the United States housing market correction accelerated in 2008, Realogy faced financial pressures due to its debt load. In November 2008, Realogy launched an exchange offer for a portion of its debt to provide additional flexibility, prompting a lawsuit from Carl Icahn. In 2013, Apollo sold out of this investment, making a profit of $1.3 billion.\nIn May 2007, Apollo acquired Countrywide plc, a provider of residential property-related services in the UK, formerly known as Hambro Countrywide (1988) and Countrywide Assured Group (1998) for $1.05 billion (not related to Countrywide Financial).\nIn November 2007, the company sold 9% of itself to the Abu Dhabi Investment Authority.\nIn January 2008, Apollo and TPG Capital acquired Harrah's Entertainment for $27.4 billion, including the assumption of existing debt.\nIn January 2008, Apollo invested $1 billion in Norwegian Cruise Line to support a recapitalization of the company's balance sheet. In December 2018, Apollo cashed out of this investment.\nIn February 2008, Apollo acquired Regent Seven Seas Cruises from Carlson Companies for $1 billion. Following the purchase, Apollo ordered a new ship for Regent.\nIn April 2008, Apollo, TPG Capital, and The Blackstone Group acquired $12.5 billion of bank loans from Citigroup. The portfolio comprised primarily senior secured loans that had been made to finance leveraged-buyout transactions at the peak of the market. Citigroup had been unable to syndicate the loans before the onset of the credit crunch. The loans were reported to have been sold in the \"mid-80 cents on the dollar\" relative to face value. In late 2008, Apollo received margin calls associated with the financing of its purchase of certain loan portfolios as the values of the loans decreased.\nIn April 2008, Apollo filed a Form S-1 with the U.S. Securities and Exchange Commission  in preparation for an IPO on the New York Stock Exchange.\nIn May 2008, Apollo invested in Vantium, a company that buys residential mortgage assets as part of a strategy to profit from the United States housing market correction.\nIn July 2008, the company closed a $758 million value-add fund.\nAlso in 2008, Apollo opened an office in India, its first office in Asia.\n\nDuring the 2008 financial crisis, several of Apollo's investments came under pressure. Apollo's 2005 investment in the struggling US retailer Linens 'n Things suffered from a significant debt burden and softening consumer demand. In May 2008, Linens filed for bankruptcy protection, costing Apollo all of its $365 million investment in the company. In 2009, the company was sued by a noteholder claiming mismanagement.\nApollo exercised its \"PIK toggle\" option at Claire's to shut off cash interest payments to its bondholders and instead issue more debt, to provide the company with additional financial flexibility.\nIn December 2008, Apollo completed fundraising for its latest fund, Apollo Investment Fund VII, with roughly $14.7 billion of investor commitments. Apollo had been targeting $15 billion, but had been in fundraising for more than 16 months, with the bulk of the capital raised in 2007.\nIn November 2009, Liberty Global acquired Unity Media GMBH; funds managed by Apollo owned a 31% interest.\nIn December 2009, Apollo announced the acquisition of Cedar Fair Entertainment Company for $635 million and assumed debt valuing the company at $2.4 billion. In April 2010, the deal was terminated due to poor shareholder response.\n\n2011–2017\nIn January 2011, Apollo acquired 51% of Alcan Engineered Products from Rio Tinto Group.\nOn March 29, 2011, Apollo became a public company via an IPO.\nIn June 2011, Apollo acquired CKx.\nIn March 2012, Apollo acquired the unprofitable Great Wolf Resorts for $703 million.\nIn November 2012, Apollo acquired McGraw-Hill Education for $2.5 billion.\nIn 2013, Apollo acquired Pitney Bowes Management Services (PBMS) for $400 million. From PBMS, Apollo formed Novitex Enterprise Solutions. Novitex is a document-outsourcing provider that manages business-critical services for over 500 companies across 10 industries. In 2017, it was merged into Exela Technologies.\nOn March 11, 2013, Apollo Global Management made the only bid for the snacks business of Hostess Brands, including Twinkies, for $410 million.\nIn December 2013, Apollo bought a portfolio of Irish home loans from Lloyds Bank for €307 million, less than half their face value. The shares were bought by an Apollo Global Management subsidiary, Tanager Limited.\nIn January 2014, Apollo acquired Chuck E. Cheese's for about $1 billion. Apollo owned the company until 2020, when it was purchased by Monarch Alternative Capital.\nIn October 2014, Apollo merged its Endemol television studio with 21st Century Fox's Shine Group. The merged company became Endemol Shine Group, with AGM and Fox each owning half of the studio.\nIn May 2015, Centerbridge Partners acquired Great Wolf Resorts from Apollo for $1.35 billion.\nIn June 2015, Apollo agreed to acquire OM Group for $1.03 billion.\nAlso in June 2015, Apollo won the bidding during an auction for Saint-Gobain's Verallia glass bottle-manufacturing unit for €2.95 billion.\nIn February 2016, Apollo agreed to acquire The ADT Corporation for $6.9 billion.\nIn April 2016, Apollo executive Stephanie Drescher donated $1000 to the presidential campaign of John Kasich, then Ohio governor. As governor, Kasich appointed a member to the Ohio state pension board. This donation violated an SEC pay-to-play pension rule. In 2019, the SEC chose not to enforce the rule.\nIn June 2016, funds managed by Apollo Global Management acquired Diamond Resorts International. It was sold to Hilton Worldwide in August 2021.\nIn November 2016, investment funds managed by Apollo acquired Rackspace.\nIn 2016, investment funds managed by Apollo acquired Constellis for $1 billion. Constellis is a private military contractor that was created as a result of a merger between rival contractors Triple Canopy and Academi in 2014. Academi, founded by Erik Prince and formerly known as Blackwater USA, is best known for its role in the Nisour Square massacre, where Blackwater guards killed 17 Iraqi civilians and injured 20.\nIn February 2017, Apollo Education Group, the parent company of the University of Phoenix, was acquired by investment funds managed by Apollo and the Vistria Group, for $1.14 billion.\nIn June 2017, investment funds managed by Apollo acquired 80.1% of Philips Lumileds division for $1.5 billion.\nIn October 2017, Apollo acquired West Corp for about $2 billion.\nIn November 2017, Apollo lent $184 million to Kushner Companies to refinance the mortgage on a Chicago skyscraper.\n\n2018–2019\nIn March 2018, Apollo acquired the Mexican-style restaurant chain Qdoba from Jack in the Box.\nIn June 2018, funds managed by Apollo and Värde Partners acquired a majority of OneMain Financial. Also in June 2018, Apollo acquired healthcare provider LifePoint Health for $5.6 billion. Following the acquisition, LifePoint merged with Apollo's RCCH HealthCare Partners.\nIn October 2018, funds managed by Apollo Global Management acquired a portfolio of $1 billion in energy investments from GE Capital's Energy Financial Services unit.\nIn February 2019, AGM was in talks to buy Nexstar Media Group for over $1 billion. However, on February 14, 2019, Cox Media Group announced that it was selling its 14 television stations to Apollo. In March 2019 filings with the Federal Communications Commission (FCC), Apollo disclosed that, through the newly formed Terrier Media, the Cox stations would be acquired for $3.1 billion (to be reduced by the value of a minority equity stake in Terrier that will be retained by Cox Enterprises); Terrier will also concurrently acquire Northwest Broadcasting, giving the company 25 television stations. On June 26, 2019, Cox announced that its 60 radio stations, as well as its national advertising business CoxReps, and local OTT advertising agency Gamut, would also be acquired by the new company, which concurrently announced that it would retain the Cox Media Group name instead of Terrier Media. On February 10, 2020, Cox Enterprises bought back the Ohio newspapers it sold to AGM. The FCC required Apollo to reduce the daily newspapers to three days or sell them.\nIn February 2019, Apollo acquired Aspen Insurance for $2.6 billion.\nOn April 16, 2019, Apollo announced that it would once again acquire Smart & Final for $1.1 billion.\nOn June 10, 2019, Apollo announced that it would acquire Shutterfly for $2.7 billion, as well as its competitor Snapfish in a separate transaction valued at around $300 million, with District Photo as a minority stakeholder.\nIn August 2019, Apollo agreed to provide around $1.8 billion of debt financing to support New Media Investment Group's acquisition of Gannett. On October 23, 2019, AGM announced it signed agreements to take a 48.6% stake in Italian gambling group Gamenet SPA.\nIn November 2019, investment funds managed by Apollo acquired Florida-based Tech Data Corp. for $5.4 billion from Warren Buffett's Berkshire Hathaway.\nIn December 2019, investment funds managed by Apollo acquired Northwest Broadcasting and Cox Media Group for $3 billion, acquiring Northwest's 12 television stations, Cox's 13 television stations, 54 radio stations, three newspapers, national television advertising business – CoxReps, and local OTT advertising business – Gamut. Smart Media.\n\n2020–present\nIn February 2020, investment funds managed by Apollo acquired Covis from Cerberus Capital Management. In April, AGM announced that it would invest $300 million in Cimpress, an Irish-domiciled printing group that owns Vistaprint.\nIn May 2020, Apollo purchased $1.75 billion of preferred stock in Albertsons Companies.\nIn July 2020, Apollo launched a $12 billion platform to make big loans. The same month, Apollo and The Walt Disney Company sold Endemol Shine Group to the French studio Banijay Group.\nIn September 2020, Apollo entered into a $5.5 billion real-estate investment partnership with the Abu Dhabi National Oil Company (ADNOC).\nIn March 2021, Apollo Investment Corporation closed a $110 million mezzanine credit facility between LendingPoint and MidCap Financial Trust. In the same month, Leon Black resigned as CEO and chairman after revelations that he paid Jeffrey Epstein $158 million for personal tax-related advice between 2012 and 2017; he was replaced as CEO by Marc Rowan.\nIn April 2021, Apollo launched Apollo Origination Partnership, a $1.8 billion direct-lending fund seeking unleveraged returns of 8-10% and 12-14% leveraged returns. The same month, funds managed by Apollo acquired The Michaels Companies, parent of Michaels.\nIn May 2021, Apollo's Gamenet acquired the Italian gaming businesses of International Game Technology for €950 million. In July, funds managed by Apollo acquired EmployBridge, a large industrial-staffing company that has been cited for dozens of safety violations and wage infractions.\nOn July 22, 2021, it was announced that Legendary Entertainment was looking for a merger instead of a SPAC. On January 31, 2022, a minority stake in Legendary was sold to Apollo Global Management, with Wanda Group still remaining the majority owner.\nIn August 2021, Apollo announced the acquisition of the incumbent local exchange carrier operations in 20 states from Lumen Technologies for $7.5 billion, including $1.4 billion of assumed debt. The same month, Apollo launched a $500 million fund to invest in SPACs.\nIn September 2021, investment funds managed by Apollo acquired 90% of Yahoo!.\nIn January 2022, Apollo acquired Athene, a retirement services business. The same month, co-founder Josh Harris left the company to focus on other business ventures.\nIn May 2022, Apollo acquired the US asset management business of Griffin Capital. In July, investment funds managed by Apollo acquired Tenneco for $7.1 billion.\nIn 2022, investment funds managed by Apollo acquired Chicago-based grocer Tony's Fresh Market, California-based grocer Cardenas, and Miller Homes from Bridgepoint Group. In 2023, Apollo announced it would acquire American industrial company Arconic.\nIn October 2023, Apollo acquired London-based restaurant group The Restaurant Group for £506 million ($623 million).\nIn June 2024, Apollo announced the acquisition of a 49% equity interest in a joint venture entity related to Intel Ireland's Fab 34 for €10.1 billion ($11 billion). Apollo Global and Kyndryl Holdings are in talks to jointly bid for DXC Technology, considering an offer of $22 to $25 per share, which boosted DXC's stock by 11%. DXC, dealing with declining revenues, is also exploring selling its insurance software business but may stay independent under its new CEO Raul Fernandez.\nIn November 2024, Apollo partnered with Shinhan Life, the life insurance arm of Shinhan Financial Group, and opened an office in Seoul as part of its Asia-Pacific expansion. In January 2025, Apollo acquired Barnes Group.\nIn February, Apollo announced that a fund managed by Apollo affiliates acquired a majority stake in Bold Productions Services, a production-linked provider. Also that month, Apollo agreed to acquire real-estate investment company Bridge Investment Group for $1.5 billion.\nIn July, Apollo-backed insurance company Athora purchased Pension Insurance Corporation for $7.8 billion. In September, Apollo announced plans to launch a £3.75bn investment vehicle focused on sport.\nIn October 2025, Apollo came and talked with Paramount Skydance about joining David Ellison's possible bid to buy Warner Bros. Discovery – a megadeal that could cost upwards of $60 billion.\nIn November 2025, Apollo acquired 55% of the shares of Atlético Madrid, becoming the majority shareholder of the club.\n\nPrivate-equity funds\nSince its inception in 1990, Apollo has raised ten flagship private equity funds, as follows:\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Apollo Global Management, Inc.:",
  "clean_text": "Apollo Global Management, Inc. is an American asset management firm that primarily invests in alternative assets. As of 2025, the company had $840 billion of assets under management, including $392 billion invested in credit, including mezzanine capital, hedge funds, non-performing loans, and collateralized loan obligations, $99 billion invested in private equity, and $46.2 billion invested in real assets, which includes real estate and infrastructure. The company invests money on behalf of pension funds, financial endowments, and sovereign wealth funds, as well as other institutional and individual investors. Apollo was founded in 1990 by Leon Black, Josh Harris, and Marc Rowan, former investment bankers at the defunct Drexel Burnham Lambert. The company is headquartered in the Solow Building in New York City, with offices across North America, Europe, and Asia. Founder and CEO Leon Black resigned as CEO in 2021 in the wake of sexual misconduct allegations and revelations that he had paid $158 million to Jeffrey Epstein. In addition to its private funds, Apollo operates Apollo Investment Corporation (AIC), a US-domiciled publicly traded, private-equity, closed-end fund and Business Development Company. AIC provides mezzanine debt, senior secured loans, and equity investments to middle-market companies, including public companies, although it historically has not invested in companies controlled by Apollo's private-equity funds. In June 2024, Apollo Global Management ranked 29th in Private Equity International's PEI 300 ranking among the world's largest private equity firms. History Apollo, originally referred to as Apollo Advisors, was founded after the collapse of Drexel Burnham Lambert in 1990 by Leon Black, the former head of Drexel's mergers and acquisitions department, along with Josh Harris and Marc Rowan. Tony Ressler, another former senior Drexel executive, was also among the firm's original members. Within six months after the collapse of Drexel, Apollo launched Apollo Investment Fund L.P., the first of its private-equity investment funds, formed to make investments in distressed companies. Apollo raised around $400 million of investor commitments based on Leon Black's reputation as a prominent lieutenant of Michael Milken and a key player in the buyout boom of the 1980s. Lion Advisors (or Lion Capital) was founded in 1990 to provide investment services to Credit Lyonnais and foreign institutions, seeking to profit from depressed prices in the high-yield market. In 1992, Lion entered into a more formal arrangement to manage the $3 billion high-yield portfolio for Credit Lyonnais which together with a consortium of other international investors provided the capital for Lion's investment activities. Lion Advisors was replaced by Ares Management. 1990s At the time of Apollo's founding, little financing was available for new leveraged buyouts and Apollo turned, instead, to a strategy of distressed-to-control takeovers. Apollo purchased distressed securities, which could be converted into a controlling interest in the equity of the company through a bankruptcy reorganization or other restructuring. Apollo used distressed debt as an entry point, enabling the firm to invest in such firms as Vail Resorts, Walter Industries, Culligan, and Samsonite. Apollo acquired interests in companies that Drexel had helped finance by purchasing high-yield bonds from failed savings and loans and insurance companies. Apollo acquired several large portfolios of assets from the U.S. government's Resolution Trust Corporation. One of Apollo's earliest and most successful deals involved the acquisition of Executive Life Insurance Company's bond portfolio. Using this vehicle, Apollo purchased the Executive Life portfolio, profiting when the value of high-yield bonds recovered, but also resulting in a variety of state regulatory issues for Apollo and Credit Lyonnais over the purchase. In 1993, Apollo Real Estate Advisers was founded in collaboration with William Mack to seek opportunities in the U.S. property markets. In April 1993, Apollo Real Estate Investment Fund, L.P., the first in a family of real estate \"opportunity funds\", was closed with $500 million of investor commitments. In 2000, Apollo exited the partnership, which continued to operate as Apollo Real Estate Advisers until changing its name to AREA Property Partners effective January 15, 2009. That firm was then owned and controlled by its remaining principals, including William Mack, Lee Neibart, William Benjamin, John Jacobsson, Stuart Koenig, and Richard Mack. In 1995, Apollo raised its third private-equity fund, Apollo Investment Fund III, with $1.5 billion of investor commitments from investors that included CalPERS and the General Motors pension fund. Fund III was only an average performer for private-equity funds of its vintage. Among the investments made in Fund III (invested through 1998) were: Alliance Imaging, Allied Waste Industries, Breuners Home Furnishings, Levitz Furniture, Communications Corporation of America, Dominick's, Ralphs (acquired Apollo's Food-4-Less), Move.com, NRT Incorporated, Pillowtex Corporation, Telemundo, and WMC Mortgage Corporation. Also in 1995, Apollo's founding partner Craig Cogut left the firm to found Pegasus Capital Advisors. Since its inception, Pegasus has raised $1.8 billion in four private-equity funds focused on investments in middle-market companies in financial distress. In 1997, Ares Management was founded by Antony Ressler and John H. Kissick, both partners at Apollo, as well as Bennett Rosenthal, who joined the group from the global leveraged finance group at Merrill Lynch, to manage a $1.2 billion market value collateralized debt obligation vehicle. Ares I and II which were raised were structured as market value CLOs. Ares III-Ares X were structured as cash flow CLOs. In 2002, Ares completed a corporate spin-off from Apollo management. Although technically the founders of Ares had completed a spinout with the formation of the firm in 1997, they had maintained a close relationship with Apollo over its first five years and operated as the West Coast affiliate of Apollo. Shortly thereafter, Ares completed fundraising for Ares Corporate Opportunities Fund, a special-situations investment fund with $750 million of capital under management. In 1998, during the dot-com bubble, Apollo raised Apollo Investment Fund IV with $3.6 billion of investor commitments. As of April 8, 2008, the fund had generated a 10% IRR net of fees. Among the investments made in Fund IV (invested through 2001) were: Allied Waste Industries, AMC Entertainment, Berlitz International, Clark Retail Enterprises, Corporate Express (Buhrmann), Encompass Services Corporation, National Financial Partners, Pacer International, Rent-A-Center, Resolution Performance Products, Resolution Specialty Materials, Sirius Satellite Radio, SkyTerra Communications, United Rentals, and Wyndham Worldwide. 2000–2005 In April 2001, Apollo raised Apollo Investment Fund V with $3.7 billion of investor commitments. As of April 8, 2008, the fund had generated a 54% IRR net of fees. Among the investments made in Fund V (invested through 2006) were Affinion Group, AMC Entertainment, Berry Plastics, Cablecom, Compass Minerals, General Nutrition Centers (GNC), Goodman Global, Hexion Specialty Chemicals (Borden), Intelsat, Linens 'n Things, Metals USA, Nalco Investment Holdings, Sourcecorp, Spectrasite Communications, and Unity Media. Although the founders of Ares had completed a corporate spin-off with the formation of the firm in 1997, they had initially maintained a close relationship with Apollo and operated as the West Coast affiliate of Apollo.. In 2002, when Ares raised its first corporate opportunities fund, the firm announced that it would separate from its former parent company. The timing of this separation also coincided with Apollo's legal difficulties with the State of California over its purchase of Executive Life Insurance Company in 1991. The same year, Attorney General of California Bill Lockyer accused Leon and an investor group led by French bank Credit Lyonnais of violating California law by having a foreign government-owned bank acquire the assets and bond portfolio of Executive Life Insurance. In April 2004, Apollo raised $930 million through an initial public offering for a listed business development company, Apollo Investment Corporation. In September 2004, investment funds managed by Apollo and Sterling Partners acquired Connections Academy. It was sold in 2011 for $400 million. 2005–2010 In 2005, Apollo formed Hexion Specialty Chemicals through the merger of Borden, Inc., Resolution Performance Products LLC, and Resolution Specialty Materials, LLC, and the acquisition of Bakelite AG. Hexion announced in July 2007 that it was acquiring Huntsman Corporation, a major specialty-chemicals company, in a $6.5 billion leveraged buyout. Hexion announced in June 2008 it would refuse to close the deal, prompting a series of legal actions. The transaction was terminated in December after a settlement between Hexion and Huntsman, wherein they were required to pay Huntsman $1 billion to drop fraud charges. Between 2005 and 2007, the private equity market was booming. Among Apollo's most notable investments during this period were Harrah's Entertainment, Norwegian Cruise Line, Claire's Stores, and Realogy. In 2006, Apollo acquired Rexnord Corporation for $1.825 billion, Berry Plastics for $2.25 billion, Momentive Performance Materials for approximately $3.8 billion, and TNT N.V. for $1.9 billion. In August 2006, Apollo launched a $2 billion vehicle in Europe, AP Alternative Assets. It was a Guernsey-domiciled publicly traded, private-equity closed-end, limited partnership, managed by Apollo Alternative Assets, an affiliate of Apollo Management. Apollo initially attempted to raise $2.5 billion for the public vehicle, but fell short when it offered the shares in June 2006, raising only $1.5 billion. Apollo raised an additional $500 million via private placements in the weeks following that sale. AAA was formed to invest alongside Apollo's main private-equity funds and hedge funds. AAA's investment portfolio was made up of a mix of private-equity and capital-markets investments. It was liquidated in 2020. In October 2006, Apollo announced a $990 million leveraged buyout of Jacuzzi Brands, a manufacturer of whirlpool baths. In 2006, Apollo acquired International Paper's coated paper and supercalendered paper business for $1.4 billion, renaming the business Verso Paper. Verso is the second-largest producer of the North American magazine publishing and catalog/commercial print markets. In May 2008, Verso became a public company via an IPO. In February 2007, Apollo acquired Oceania Cruises for $850 million and provided additional capital to fund the expansion of the company with the purchase of two new cruise ships. In February 2007, Apollo announced the acquisition of the Smart & Final chain of warehouse-style food and supply stores. In June 2007, Smart & Final completed the acquisition of the Henry's Marketplace chain of \"farmers market\" style food retailers from Wild Oats Markets as part of that company's acquisition by Whole Foods Market. In 2011, the Henry's chain was merged with Sprouts Farmers Market, which, like the Henry's markets, had been founded by Henry Boney. In March 2007, Apollo announced the $3.1 billion leveraged buyouts of costume jewelry retailer Claire's Stores. In 2008, Claire's experienced financial difficulty amid the slump in consumer spending. In April 2007, Apollo acquired Noranda Aluminum, the US aluminum business of Xstrata for $1.15 billion. Noranda Aluminum includes a primary smelter and three rolling mills in Tennessee, North Carolina, and Arkansas along with other operations. In April 2007, Apollo acquired Realogy, a franchisor that owns Coldwell Banker, Century 21, and Sotheby's International Realty, for $8.5 billion. As the United States housing market correction accelerated in 2008, Realogy faced financial pressures due to its debt load. In November 2008, Realogy launched an exchange offer for a portion of its debt to provide additional flexibility, prompting a lawsuit from Carl Icahn. In 2013, Apollo sold out of this investment, making a profit of $1.3 billion. In May 2007, Apollo acquired Countrywide plc, a provider of residential property-related services in the UK, formerly known as Hambro Countrywide (1988) and Countrywide Assured Group (1998) for $1.05 billion (not related to Countrywide Financial). In November 2007, the company sold 9% of itself to the Abu Dhabi Investment Authority. In January 2008, Apollo and TPG Capital acquired Harrah's Entertainment for $27.4 billion, including the assumption of existing debt. In January 2008, Apollo invested $1 billion in Norwegian Cruise Line to support a recapitalization of the company's balance sheet. In December 2018, Apollo cashed out of this investment. In February 2008, Apollo acquired Regent Seven Seas Cruises from Carlson Companies for $1 billion. Following the purchase, Apollo ordered a new ship for Regent. In April 2008, Apollo, TPG Capital, and The Blackstone Group acquired $12.5 billion of bank loans from Citigroup. The portfolio comprised primarily senior secured loans that had been made to finance leveraged-buyout transactions at the peak of the market. Citigroup had been unable to syndicate the loans before the onset of the credit crunch. The loans were reported to have been sold in the \"mid-80 cents on the dollar\" relative to face value. In late 2008, Apollo received margin calls associated with the financing of its purchase of certain loan portfolios as the values of the loans decreased. In April 2008, Apollo filed a Form S-1 with the U.S. Securities and Exchange Commission in preparation for an IPO on the New York Stock Exchange. In May 2008, Apollo invested in Vantium, a company that buys residential mortgage assets as part of a strategy to profit from the United States housing market correction. In July 2008, the company closed a $758 million value-add fund. Also in 2008, Apollo opened an office in India, its first office in Asia. During the 2008 financial crisis, several of Apollo's investments came under pressure. Apollo's 2005 investment in the struggling US retailer Linens 'n Things suffered from a significant debt burden and softening consumer demand. In May 2008, Linens filed for bankruptcy protection, costing Apollo all of its $365 million investment in the company. In 2009, the company was sued by a noteholder claiming mismanagement. Apollo exercised its \"PIK toggle\" option at Claire's to shut off cash interest payments to its bondholders and instead issue more debt, to provide the company with additional financial flexibility. In December 2008, Apollo completed fundraising for its latest fund, Apollo Investment Fund VII, with roughly $14.7 billion of investor commitments. Apollo had been targeting $15 billion, but had been in fundraising for more than 16 months, with the bulk of the capital raised in 2007. In November 2009, Liberty Global acquired Unity Media GMBH; funds managed by Apollo owned a 31% interest. In December 2009, Apollo announced the acquisition of Cedar Fair Entertainment Company for $635 million and assumed debt valuing the company at $2.4 billion. In April 2010, the deal was terminated due to poor shareholder response. 2011–2017 In January 2011, Apollo acquired 51% of Alcan Engineered Products from Rio Tinto Group. On March 29, 2011, Apollo became a public company via an IPO. In June 2011, Apollo acquired CKx. In March 2012, Apollo acquired the unprofitable Great Wolf Resorts for $703 million. In November 2012, Apollo acquired McGraw-Hill Education for $2.5 billion. In 2013, Apollo acquired Pitney Bowes Management Services (PBMS) for $400 million. From PBMS, Apollo formed Novitex Enterprise Solutions. Novitex is a document-outsourcing provider that manages business-critical services for over 500 companies across 10 industries. In 2017, it was merged into Exela Technologies. On March 11, 2013, Apollo Global Management made the only bid for the snacks business of Hostess Brands, including Twinkies, for $410 million. In December 2013, Apollo bought a portfolio of Irish home loans from Lloyds Bank for €307 million, less than half their face value. The shares were bought by an Apollo Global Management subsidiary, Tanager Limited. In January 2014, Apollo acquired Chuck E. Cheese's for about $1 billion. Apollo owned the company until 2020, when it was purchased by Monarch Alternative Capital. In October 2014, Apollo merged its Endemol television studio with 21st Century Fox's Shine Group. The merged company became Endemol Shine Group, with AGM and Fox each owning half of the studio. In May 2015, Centerbridge Partners acquired Great Wolf Resorts from Apollo for $1.35 billion. In June 2015, Apollo agreed to acquire OM Group for $1.03 billion. Also in June 2015, Apollo won the bidding during an auction for Saint-Gobain's Verallia glass bottle-manufacturing unit for €2.95 billion. In February 2016, Apollo agreed to acquire The ADT Corporation for $6.9 billion. In April 2016, Apollo executive Stephanie Drescher donated $1000 to the presidential campaign of John Kasich, then Ohio governor. As governor, Kasich appointed a member to the Ohio state pension board. This donation violated an SEC pay-to-play pension rule. In 2019, the SEC chose not to enforce the rule. In June 2016, funds managed by Apollo Global Management acquired Diamond Resorts International. It was sold to Hilton Worldwide in August 2021. In November 2016, investment funds managed by Apollo acquired Rackspace. In 2016, investment funds managed by Apollo acquired Constellis for $1 billion. Constellis is a private military contractor that was created as a result of a merger between rival contractors Triple Canopy and Academi in 2014. Academi, founded by Erik Prince and formerly known as Blackwater USA, is best known for its role in the Nisour Square massacre, where Blackwater guards killed 17 Iraqi civilians and injured 20. In February 2017, Apollo Education Group, the parent company of the University of Phoenix, was acquired by investment funds managed by Apollo and the Vistria Group, for $1.14 billion. In June 2017, investment funds managed by Apollo acquired 80.1% of Philips Lumileds division for $1.5 billion. In October 2017, Apollo acquired West Corp for about $2 billion. In November 2017, Apollo lent $184 million to Kushner Companies to refinance the mortgage on a Chicago skyscraper. 2018–2019 In March 2018, Apollo acquired the Mexican-style restaurant chain Qdoba from Jack in the Box. In June 2018, funds managed by Apollo and Värde Partners acquired a majority of OneMain Financial. Also in June 2018, Apollo acquired healthcare provider LifePoint Health for $5.6 billion. Following the acquisition, LifePoint merged with Apollo's RCCH HealthCare Partners. In October 2018, funds managed by Apollo Global Management acquired a portfolio of $1 billion in energy investments from GE Capital's Energy Financial Services unit. In February 2019, AGM was in talks to buy Nexstar Media Group for over $1 billion. However, on February 14, 2019, Cox Media Group announced that it was selling its 14 television stations to Apollo. In March 2019 filings with the Federal Communications Commission (FCC), Apollo disclosed that, through the newly formed Terrier Media, the Cox stations would be acquired for $3.1 billion (to be reduced by the value of a minority equity stake in Terrier that will be retained by Cox Enterprises); Terrier will also concurrently acquire Northwest Broadcasting, giving the company 25 television stations. On June 26, 2019, Cox announced that its 60 radio stations, as well as its national advertising business CoxReps, and local OTT advertising agency Gamut, would also be acquired by the new company, which concurrently announced that it would retain the Cox Media Group name instead of Terrier Media. On February 10, 2020, Cox Enterprises bought back the Ohio newspapers it sold to AGM. The FCC required Apollo to reduce the daily newspapers to three days or sell them. In February 2019, Apollo acquired Aspen Insurance for $2.6 billion. On April 16, 2019, Apollo announced that it would once again acquire Smart & Final for $1.1 billion. On June 10, 2019, Apollo announced that it would acquire Shutterfly for $2.7 billion, as well as its competitor Snapfish in a separate transaction valued at around $300 million, with District Photo as a minority stakeholder. In August 2019, Apollo agreed to provide around $1.8 billion of debt financing to support New Media Investment Group's acquisition of Gannett. On October 23, 2019, AGM announced it signed agreements to take a 48.6% stake in Italian gambling group Gamenet SPA. In November 2019, investment funds managed by Apollo acquired Florida-based Tech Data Corp. for $5.4 billion from Warren Buffett's Berkshire Hathaway. In December 2019, investment funds managed by Apollo acquired Northwest Broadcasting and Cox Media Group for $3 billion, acquiring Northwest's 12 television stations, Cox's 13 television stations, 54 radio stations, three newspapers, national television advertising business – CoxReps, and local OTT advertising business – Gamut. Smart Media. 2020–present In February 2020, investment funds managed by Apollo acquired Covis from Cerberus Capital Management. In April, AGM announced that it would invest $300 million in Cimpress, an Irish-domiciled printing group that owns Vistaprint. In May 2020, Apollo purchased $1.75 billion of preferred stock in Albertsons Companies. In July 2020, Apollo launched a $12 billion platform to make big loans. The same month, Apollo and The Walt Disney Company sold Endemol Shine Group to the French studio Banijay Group. In September 2020, Apollo entered into a $5.5 billion real-estate investment partnership with the Abu Dhabi National Oil Company (ADNOC). In March 2021, Apollo Investment Corporation closed a $110 million mezzanine credit facility between LendingPoint and MidCap Financial Trust. In the same month, Leon Black resigned as CEO and chairman after revelations that he paid Jeffrey Epstein $158 million for personal tax-related advice between 2012 and 2017; he was replaced as CEO by Marc Rowan. In April 2021, Apollo launched Apollo Origination Partnership, a $1.8 billion direct-lending fund seeking unleveraged returns of 8-10% and 12-14% leveraged returns. The same month, funds managed by Apollo acquired The Michaels Companies, parent of Michaels. In May 2021, Apollo's Gamenet acquired the Italian gaming businesses of International Game Technology for €950 million. In July, funds managed by Apollo acquired EmployBridge, a large industrial-staffing company that has been cited for dozens of safety violations and wage infractions. On July 22, 2021, it was announced that Legendary Entertainment was looking for a merger instead of a SPAC. On January 31, 2022, a minority stake in Legendary was sold to Apollo Global Management, with Wanda Group still remaining the majority owner. In August 2021, Apollo announced the acquisition of the incumbent local exchange carrier operations in 20 states from Lumen Technologies for $7.5 billion, including $1.4 billion of assumed debt. The same month, Apollo launched a $500 million fund to invest in SPACs. In September 2021, investment funds managed by Apollo acquired 90% of Yahoo!. In January 2022, Apollo acquired Athene, a retirement services business. The same month, co-founder Josh Harris left the company to focus on other business ventures. In May 2022, Apollo acquired the US asset management business of Griffin Capital. In July, investment funds managed by Apollo acquired Tenneco for $7.1 billion. In 2022, investment funds managed by Apollo acquired Chicago-based grocer Tony's Fresh Market, California-based grocer Cardenas, and Miller Homes from Bridgepoint Group. In 2023, Apollo announced it would acquire American industrial company Arconic. In October 2023, Apollo acquired London-based restaurant group The Restaurant Group for £506 million ($623 million). In June 2024, Apollo announced the acquisition of a 49% equity interest in a joint venture entity related to Intel Ireland's Fab 34 for €10.1 billion ($11 billion). Apollo Global and Kyndryl Holdings are in talks to jointly bid for DXC Technology, considering an offer of $22 to $25 per share, which boosted DXC's stock by 11%. DXC, dealing with declining revenues, is also exploring selling its insurance software business but may stay independent under its new CEO Raul Fernandez. In November 2024, Apollo partnered with Shinhan Life, the life insurance arm of Shinhan Financial Group, and opened an office in Seoul as part of its Asia-Pacific expansion. In January 2025, Apollo acquired Barnes Group. In February, Apollo announced that a fund managed by Apollo affiliates acquired a majority stake in Bold Productions Services, a production-linked provider. Also that month, Apollo agreed to acquire real-estate investment company Bridge Investment Group for $1.5 billion. In July, Apollo-backed insurance company Athora purchased Pension Insurance Corporation for $7.8 billion. In September, Apollo announced plans to launch a £3.75bn investment vehicle focused on sport. In October 2025, Apollo came and talked with Paramount Skydance about joining David Ellison's possible bid to buy Warner Bros. Discovery – a megadeal that could cost upwards of $60 billion. In November 2025, Apollo acquired 55% of the shares of Atlético Madrid, becoming the majority shareholder of the club. Private-equity funds Since its inception in 1990, Apollo has raised ten flagship private equity funds, as follows:"
}