{
  "ticker": "APTV",
  "cik": "0001521332",
  "company_name": "Aptiv",
  "corrected_name": "Aptiv",
  "wiki_title_used": "Aptiv",
  "exists": true,
  "raw_text": "Aptiv PLC is an American automotive technology supplier with headquarters in Schaffhausen, Switzerland. Aptiv grew out of the now-defunct American company, Delphi Automotive Systems, which itself was formerly a component of General Motors.\n\nHistory\nThe company was established as General Motors' Automotive Components Group in 1994, which changed its name to Delphi Automotive Systems in 1995.  G.M. also renamed the various divisions within the newly created Delphi unit. Packard Electric became Delphi Packard Electric Systems; Delco Chassis became Delphi Chassis Systems; Inland Fisher-Guide became Delphi Interior and Lighting Systems; Saginaw became Delphi Saginaw Steering Systems; Harrison Radiator became Delphi Harrison Thermal Systems, and AC Delco became Delphi Energy and Engine Management Systems.\nDelphi disclosed some irregular accounting practices in 2005. Many executives, including CFO Alan Dawes, resigned. Delphi Chairman J.T. Battenberg retired. Delphi then filed for Chapter 11 bankruptcy protection to reorganize its struggling U.S. operations. As a result of this action, the Securities and Exchange Commission granted an application by the New York Stock Exchange to delist Delphi's common stock and bonds.\nPlants in Puerto Real, Cádiz, Spain, closed, with a loss of 1,600 direct jobs, and more than 2,500 indirect jobs in February 2007, despite having agreed to continue its manufacturing operations until 2010 and receiving more than €25 million from various public administrations to guarantee its workers' jobs. The Regional Government of Andalusia announced it would begin legal action against the company for breach of local labor laws.\nDelphi sued its investors for US$2.55 billion in securities to aid Delphi as it sought to come out of bankruptcy in May 2008. U.S. Bankruptcy Judge Robert Drain in New York allowed Delphi to seek payments through a contract against Appaloosa Management LP as well as denying an investors' request for a cap of $250 million for damages. In April 2009, CoolIT Systems announced the acquisition of the assets of Delphi Thermal Liquid Cooling, including intellectual property, machinery, and equipment.\nA group of private investors purchased Delphi's core assets to create a new Delphi Corporation in October 2009. Some of its non-core steering operations were sold to General Motors Company, the successor to the bankrupt Motors Liquidation Company that was formerly General Motors Corporation. The stock was cancelled. The old Delphi Corporation was renamed DPH Holdings Corporation. The new Delphi was incorporated in the United Kingdom.\nDelphi sold its Thermal Business unit to Mahle-Behr GmbH in July 2015. Together, the Mahle-Behr and Delphi Thermal merger represented the second-largest supplier of automotive thermal management systems including interior HVAC components, under-hood powertrain cooling and compressors. The company announced improvements to self-driving technology under development in December 2015. In the same month, Delphi bought HellermannTyton for $1.7 billion.\nDelphi entered into a partnership agreement with Carbon in June 2016 to allow the use of Carbon's Continuous Liquid Interface Production technology and printers. The company then bought the self-driving startup NuTonomy for $450 million in October 2017.\nThe company divested its powertrain division and aftermarket related businesses (now Borg Warner's Delphi Technologies division) in December 2017 and changed its name to Aptiv PLC. In August 2019, Aptiv and Hyundai Motor Group announced plans to establish a $4 billion autonomous driving joint venture in which the firms would each have a 50% stake. The companies said the joint venture, which would have its headquarters in Boston, would focus on advancing the “design, development and commercialization of SAE Level 4 and 5 autonomous technologies.” The joint venture deal was completed in March 2020 and was named Motional in August 2020.\nIn January 2021, Aptiv revealed a new platform for automated driving that can be applied on various vehicles and that carmakers can upgrade wirelessly.\nOn 11 January 2022, Aptiv announced that they had acquired Wind River Systems, a company known for its development of real-time operating systems.\nThe company, which had relocated its headquarters from the United Kingdom to Ireland in 2018, reportedly \"[left] Ireland for Switzerland over tax\" in early 2025.\n\nOperations\nAs of December 2020, Aptiv has two diversified business segments:\n\n\"Signal and Power Solutions (Formerly Electrical/Electronic Architecture)\" provides complete vehicle electrical systems, integrating wiring and cable assemblies, electrical centers and connection systems.\n\"Advanced Safety and User Experience (Formerly Electronics & Safety)\" provides advanced software and sensing systems, computing platforms, advanced safety systems and automated driving, user experience and infotainment, as well as other vehicular electronic controls.\n\nControversies\nOn 4 March 2005, Delphi said it had fired its CFO and would restate earnings between 1999, when Delphi spun off from General Motors Corp (GM), and 2004 for improper reporting of rebates, credits, or other payments from suppliers. In June, 2006, Delphi said in a filing that it would restate its 2005 report, which would increase Delphi's reported 2004 net loss by $65 million. In 2013, Delphi became involved in an ongoing lawsuit against GM, because it manufactures ignition switches for the Chevrolet Cobalt, whose original design is alleged to be defective.\nIn 2009, as a result of its bankruptcy agreement, \"Delphi surrendered its pension obligations to the Pension Benefit Guaranty Corporation.\" A group of about 20,000 salaried employees, principally in Ohio, Michigan, New York and Indiana, have been involved in litigation since then seeking restoration of their full pension rights.\n\nJoint ventures\nIn August 2019, Aptiv and Hyundai Motor Group announced plans to establish a $4 billion autonomous driving joint venture in which the firms will each have a 50% stake. The companies said the joint venture, which will have headquarters in Boston, would focus on advancing the “design, development and commercialization of SAE Level 4 and 5 autonomous technologies.” The joint venture deal was completed in March 2020 and was named Motional in August 2020.\nEnerDel – started as a joint venture of Ener1 and Delphi. In August 2008, Ener1 bought exclusive ownership of EnerDel.\n\nEnvironmental record\nResearchers at the University of Massachusetts Amherst allegedly identified Delphi corp. as the 21st-largest corporate producer of air pollution in the United States in 2002. According to the study, the manufacturer's most toxic emissions included asbestos (542 lb/yr), chromium compounds (1,082 lb/yr), lead compounds (8,466 lb/yr), and sulfuric acid (17,600 lbs/year), while the most massive emissions were glycol ethers (111,520 lbs/year) and hydrochloric acid (80,000 lb/yr).\n\nReferences\nExternal links\nOfficial website\nSEC Litigation Release\nSlate article on bankruptcy\nDPH Holdings Corporation, archived website on the old Delphi Corporation and its bankruptcy case, 2005–2014\nDSRA - Delphi Salaried Retirees Association, fighting for full restoration of pensions for retirees\nBusiness data for Aptiv plc:",
  "clean_text": "Aptiv PLC is an American automotive technology supplier with headquarters in Schaffhausen, Switzerland. Aptiv grew out of the now-defunct American company, Delphi Automotive Systems, which itself was formerly a component of General Motors. History The company was established as General Motors' Automotive Components Group in 1994, which changed its name to Delphi Automotive Systems in 1995. G.M. also renamed the various divisions within the newly created Delphi unit. Packard Electric became Delphi Packard Electric Systems; Delco Chassis became Delphi Chassis Systems; Inland Fisher-Guide became Delphi Interior and Lighting Systems; Saginaw became Delphi Saginaw Steering Systems; Harrison Radiator became Delphi Harrison Thermal Systems, and AC Delco became Delphi Energy and Engine Management Systems. Delphi disclosed some irregular accounting practices in 2005. Many executives, including CFO Alan Dawes, resigned. Delphi Chairman J.T. Battenberg retired. Delphi then filed for Chapter 11 bankruptcy protection to reorganize its struggling U.S. operations. As a result of this action, the Securities and Exchange Commission granted an application by the New York Stock Exchange to delist Delphi's common stock and bonds. Plants in Puerto Real, Cádiz, Spain, closed, with a loss of 1,600 direct jobs, and more than 2,500 indirect jobs in February 2007, despite having agreed to continue its manufacturing operations until 2010 and receiving more than €25 million from various public administrations to guarantee its workers' jobs. The Regional Government of Andalusia announced it would begin legal action against the company for breach of local labor laws. Delphi sued its investors for US$2.55 billion in securities to aid Delphi as it sought to come out of bankruptcy in May 2008. U.S. Bankruptcy Judge Robert Drain in New York allowed Delphi to seek payments through a contract against Appaloosa Management LP as well as denying an investors' request for a cap of $250 million for damages. In April 2009, CoolIT Systems announced the acquisition of the assets of Delphi Thermal Liquid Cooling, including intellectual property, machinery, and equipment. A group of private investors purchased Delphi's core assets to create a new Delphi Corporation in October 2009. Some of its non-core steering operations were sold to General Motors Company, the successor to the bankrupt Motors Liquidation Company that was formerly General Motors Corporation. The stock was cancelled. The old Delphi Corporation was renamed DPH Holdings Corporation. The new Delphi was incorporated in the United Kingdom. Delphi sold its Thermal Business unit to Mahle-Behr GmbH in July 2015. Together, the Mahle-Behr and Delphi Thermal merger represented the second-largest supplier of automotive thermal management systems including interior HVAC components, under-hood powertrain cooling and compressors. The company announced improvements to self-driving technology under development in December 2015. In the same month, Delphi bought HellermannTyton for $1.7 billion. Delphi entered into a partnership agreement with Carbon in June 2016 to allow the use of Carbon's Continuous Liquid Interface Production technology and printers. The company then bought the self-driving startup NuTonomy for $450 million in October 2017. The company divested its powertrain division and aftermarket related businesses (now Borg Warner's Delphi Technologies division) in December 2017 and changed its name to Aptiv PLC. In August 2019, Aptiv and Hyundai Motor Group announced plans to establish a $4 billion autonomous driving joint venture in which the firms would each have a 50% stake. The companies said the joint venture, which would have its headquarters in Boston, would focus on advancing the “design, development and commercialization of SAE Level 4 and 5 autonomous technologies.” The joint venture deal was completed in March 2020 and was named Motional in August 2020. In January 2021, Aptiv revealed a new platform for automated driving that can be applied on various vehicles and that carmakers can upgrade wirelessly. On 11 January 2022, Aptiv announced that they had acquired Wind River Systems, a company known for its development of real-time operating systems. The company, which had relocated its headquarters from the United Kingdom to Ireland in 2018, reportedly \"[left] Ireland for Switzerland over tax\" in early 2025. Operations As of December 2020, Aptiv has two diversified business segments: \"Signal and Power Solutions (Formerly Electrical/Electronic Architecture)\" provides complete vehicle electrical systems, integrating wiring and cable assemblies, electrical centers and connection systems. \"Advanced Safety and User Experience (Formerly Electronics & Safety)\" provides advanced software and sensing systems, computing platforms, advanced safety systems and automated driving, user experience and infotainment, as well as other vehicular electronic controls. Controversies On 4 March 2005, Delphi said it had fired its CFO and would restate earnings between 1999, when Delphi spun off from General Motors Corp (GM), and 2004 for improper reporting of rebates, credits, or other payments from suppliers. In June, 2006, Delphi said in a filing that it would restate its 2005 report, which would increase Delphi's reported 2004 net loss by $65 million. In 2013, Delphi became involved in an ongoing lawsuit against GM, because it manufactures ignition switches for the Chevrolet Cobalt, whose original design is alleged to be defective. In 2009, as a result of its bankruptcy agreement, \"Delphi surrendered its pension obligations to the Pension Benefit Guaranty Corporation.\" A group of about 20,000 salaried employees, principally in Ohio, Michigan, New York and Indiana, have been involved in litigation since then seeking restoration of their full pension rights. Joint ventures In August 2019, Aptiv and Hyundai Motor Group announced plans to establish a $4 billion autonomous driving joint venture in which the firms will each have a 50% stake. The companies said the joint venture, which will have headquarters in Boston, would focus on advancing the “design, development and commercialization of SAE Level 4 and 5 autonomous technologies.” The joint venture deal was completed in March 2020 and was named Motional in August 2020. EnerDel – started as a joint venture of Ener1 and Delphi. In August 2008, Ener1 bought exclusive ownership of EnerDel. Environmental record Researchers at the University of Massachusetts Amherst allegedly identified Delphi corp. as the 21st-largest corporate producer of air pollution in the United States in 2002. According to the study, the manufacturer's most toxic emissions included asbestos (542 lb/yr), chromium compounds (1,082 lb/yr), lead compounds (8,466 lb/yr), and sulfuric acid (17,600 lbs/year), while the most massive emissions were glycol ethers (111,520 lbs/year) and hydrochloric acid (80,000 lb/yr)."
}