{
  "ticker": "ARE",
  "cik": "0001035443",
  "company_name": "Alexandria Real Estate Equities",
  "corrected_name": "Alexandria Real Estate Equities",
  "wiki_title_used": "Alexandria Real Estate Equities",
  "exists": true,
  "raw_text": "Alexandria Real Estate Equities, Inc. is a real estate investment trust based in Pasadena, California that invests in office buildings and laboratories leased to tenants in the life science and technology industries. Properties are generally located near universities to attract tenants. The company owns several major technology/biotechnology office campuses including the 740,972 square foot Alexandria Center for Life Science in Manhattan, and the 2,365,487 square foot Alexandria Center at Kendall Square and the 1,181,635 square foot Technology Square (Cambridge, Massachusetts) in the Boston area.\nThe company is dependent on the life sciences industry and funding for research by the United States Government.\nThe company also has a venture capital arm, Alexandria Venture Investments, which invests in life sciences firms.\nThe company is named after Alexandria, Egypt because of that city's connection to science.\n\nInvestments\nAs of December 31, 2024, the company owned or had investments in 391 properties containing 44.1 million square feet.\nThe company's largest tenants are as follows:\n\nThe company's revenues are derived in the following markets:\n\nHistory\nIn 1993, one of the partners of Jacobs Engineering Group, Jerry M. Sudarsky, was presented with a Business Plan written by Kendell R. Lang titled BioProperties Management Group, Inc., which was a plan to form a REIT dedicated to funding biotech properties. The initial business plan included founders Kendell Lang, Alan Gold, Gary Kreitzer, and Steven Stone as part of the initial management team. Jacobs approached Joel S. Marcus, a lawyer and CPA, with the idea of representing their interests in this company to oversee the management team who intended to provide laboratories and office space to biotech firms. Jacobs invested in the company with $5 million.\nIts first purchase was of 4 buildings in San Diego which had been negotiated and structured by Kendell R. Lang.\nIn 1997, it became a public company via an initial public offering, raising $155 million.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Alexandria Real Estate Equities, Inc.:",
  "clean_text": "Alexandria Real Estate Equities, Inc. is a real estate investment trust based in Pasadena, California that invests in office buildings and laboratories leased to tenants in the life science and technology industries. Properties are generally located near universities to attract tenants. The company owns several major technology/biotechnology office campuses including the 740,972 square foot Alexandria Center for Life Science in Manhattan, and the 2,365,487 square foot Alexandria Center at Kendall Square and the 1,181,635 square foot Technology Square (Cambridge, Massachusetts) in the Boston area. The company is dependent on the life sciences industry and funding for research by the United States Government. The company also has a venture capital arm, Alexandria Venture Investments, which invests in life sciences firms. The company is named after Alexandria, Egypt because of that city's connection to science. Investments As of December 31, 2024, the company owned or had investments in 391 properties containing 44.1 million square feet. The company's largest tenants are as follows: The company's revenues are derived in the following markets: History In 1993, one of the partners of Jacobs Engineering Group, Jerry M. Sudarsky, was presented with a Business Plan written by Kendell R. Lang titled BioProperties Management Group, Inc., which was a plan to form a REIT dedicated to funding biotech properties. The initial business plan included founders Kendell Lang, Alan Gold, Gary Kreitzer, and Steven Stone as part of the initial management team. Jacobs approached Joel S. Marcus, a lawyer and CPA, with the idea of representing their interests in this company to oversee the management team who intended to provide laboratories and office space to biotech firms. Jacobs invested in the company with $5 million. Its first purchase was of 4 buildings in San Diego which had been negotiated and structured by Kendell R. Lang. In 1997, it became a public company via an initial public offering, raising $155 million."
}