{
  "ticker": "ATO",
  "cik": "0000731802",
  "company_name": "Atmos Energy",
  "corrected_name": "Atmos Energy",
  "wiki_title_used": "Atmos Energy",
  "exists": true,
  "raw_text": "Atmos Energy Corporation, headquartered in Dallas, Texas, is one of the United States' largest natural-gas-only distributors, serving about three million natural gas distribution customers in over 1,400 communities in nine states from the Blue Ridge Mountains in the East to the Rocky Mountains in the West.\nAtmos Energy also manages company-owned natural gas pipeline and storage assets, including one of the largest intrastate natural gas pipeline systems in Texas.\n\nHistory\nAtmos Energy Corporation's history dates back to 1906 in the Panhandle of Texas. Over the years, through various business combinations and mergers, the company became known as Pioneer Corporation, a large diversified West Texas energy company. In 1981, the company was incorporated and became a fully regulated natural-gas-only distributor.\nIn 1983, Energas, the natural gas distribution division of Pioneer, was spun off and became an independent, publicly held natural gas distribution company. In October 1988, Energas changed its corporate name to Atmos Energy Corporation and its stock began trading on the New York Stock Exchange under the ticker symbol \"ATO\".\nAtmos Energy  has grown through acquisitions, its most recent acquisition was the distribution and pipeline operations of TXU Gas Company in October 2004. Today, Atmos Energy Corporation is one of the largest all-natural-gas distributors in the United States. Atmos sold the Gaffney, South Carolina operations of United Cities Gas to Piedmont Natural Gas in 2000. Atmos sold its Missouri, Iowa, Illinois, and Georgia operations to Liberty Utilities in 2012 and 2013.\n\nUtility Operations\nColorado-Kansas Division\nFormerly Greeley Gas, acquired 1993; added Kansas units of United Cities Gas in 1999\n\nKentucky/Mid-States Division\nWestern Kentucky Gas Company acquired 1989 from Texas American Energy; United Cities Gas acquired 1997\n\nLouisiana Division\nTrans Louisiana Gas acquired 1988, Louisiana Gas Service acquired 2001 from Citizens Utilities\n\nMid-Tex Division\nFormerly Lone Star Gas and TXU Gas, acquired 2004\n\nMississippi Division\nFormerly Mississippi Valley Gas, acquired 2001\n\nWest Texas Division\nFormerly Amarillo Gas, Pioneer Natural Gas, and Energas\n\nNon-Utility Operations\nAtmos Pipeline - Texas\nAtmos Pipeline - Texas is an intrastate natural gas transmission pipeline network which is connected to three major Texas market centers at Waha, Carthage, and Katy. The Atmos Pipeline - Texas Pipeline infrastructure is located at or near existing, new and proposed gas production fields including the Barnett Shale in north Texas and the Bossier Sand in east Texas. Atmos Pipeline - Texas' system includes approximately 6,000 miles of transmission pipelines within the state of Texas.\nThe Atmos Pipeline - Texas system transports gas to the largest local distribution company in the state of Texas along with other smaller utilities, industrial end-users, independent power plants, and other pipelines.\nGas Supply and Services\nAtmos Energy Gas Supply and Planning (Gas Supply) acquires the natural gas supply for the gas requirements of Atmos Energy's residential, commercial and industrial sales customers located in various states. Annual purchases are approximately 290-300 Bcf for its distribution customers. Gas Supply acquires natural gas from a diverse portfolio of wellhead producers and commercial suppliers utilizing a combination of long and short term commitments, including purchases from the daily spot market.\n\nCharles K. Vaughan Center\nNamed after the first chairman and CEO, the Charles K. Vaughan Center is a technical training facility designed for new technicians and veterans who must be certified and recertified on a regular basis. Located in Plano, TX, the most visible aspect of the Vaughan Center is Gas City, an area designed to enable employees to practice and enhance their professional and safety skills. The area was built to resemble a simulated community with houses, mini-apartments, commercial buildings along with city streets having natural gas infrastructure, and a short gas transmission pipeline with pig launchers.\n\nSee also\nList of S&P 500 companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for Atmos Energy Corporation:",
  "clean_text": "Atmos Energy Corporation, headquartered in Dallas, Texas, is one of the United States' largest natural-gas-only distributors, serving about three million natural gas distribution customers in over 1,400 communities in nine states from the Blue Ridge Mountains in the East to the Rocky Mountains in the West. Atmos Energy also manages company-owned natural gas pipeline and storage assets, including one of the largest intrastate natural gas pipeline systems in Texas. History Atmos Energy Corporation's history dates back to 1906 in the Panhandle of Texas. Over the years, through various business combinations and mergers, the company became known as Pioneer Corporation, a large diversified West Texas energy company. In 1981, the company was incorporated and became a fully regulated natural-gas-only distributor. In 1983, Energas, the natural gas distribution division of Pioneer, was spun off and became an independent, publicly held natural gas distribution company. In October 1988, Energas changed its corporate name to Atmos Energy Corporation and its stock began trading on the New York Stock Exchange under the ticker symbol \"ATO\". Atmos Energy has grown through acquisitions, its most recent acquisition was the distribution and pipeline operations of TXU Gas Company in October 2004. Today, Atmos Energy Corporation is one of the largest all-natural-gas distributors in the United States. Atmos sold the Gaffney, South Carolina operations of United Cities Gas to Piedmont Natural Gas in 2000. Atmos sold its Missouri, Iowa, Illinois, and Georgia operations to Liberty Utilities in 2012 and 2013. Utility Operations Colorado-Kansas Division Formerly Greeley Gas, acquired 1993; added Kansas units of United Cities Gas in 1999 Kentucky/Mid-States Division Western Kentucky Gas Company acquired 1989 from Texas American Energy; United Cities Gas acquired 1997 Louisiana Division Trans Louisiana Gas acquired 1988, Louisiana Gas Service acquired 2001 from Citizens Utilities Mid-Tex Division Formerly Lone Star Gas and TXU Gas, acquired 2004 Mississippi Division Formerly Mississippi Valley Gas, acquired 2001 West Texas Division Formerly Amarillo Gas, Pioneer Natural Gas, and Energas Non-Utility Operations Atmos Pipeline - Texas Atmos Pipeline - Texas is an intrastate natural gas transmission pipeline network which is connected to three major Texas market centers at Waha, Carthage, and Katy. The Atmos Pipeline - Texas Pipeline infrastructure is located at or near existing, new and proposed gas production fields including the Barnett Shale in north Texas and the Bossier Sand in east Texas. Atmos Pipeline - Texas' system includes approximately 6,000 miles of transmission pipelines within the state of Texas. The Atmos Pipeline - Texas system transports gas to the largest local distribution company in the state of Texas along with other smaller utilities, industrial end-users, independent power plants, and other pipelines. Gas Supply and Services Atmos Energy Gas Supply and Planning (Gas Supply) acquires the natural gas supply for the gas requirements of Atmos Energy's residential, commercial and industrial sales customers located in various states. Annual purchases are approximately 290-300 Bcf for its distribution customers. Gas Supply acquires natural gas from a diverse portfolio of wellhead producers and commercial suppliers utilizing a combination of long and short term commitments, including purchases from the daily spot market. Charles K. Vaughan Center Named after the first chairman and CEO, the Charles K. Vaughan Center is a technical training facility designed for new technicians and veterans who must be certified and recertified on a regular basis. Located in Plano, TX, the most visible aspect of the Vaughan Center is Gas City, an area designed to enable employees to practice and enhance their professional and safety skills. The area was built to resemble a simulated community with houses, mini-apartments, commercial buildings along with city streets having natural gas infrastructure, and a short gas transmission pipeline with pig launchers."
}