{
  "ticker": "AVB",
  "cik": "0000915912",
  "company_name": "AvalonBay Communities",
  "corrected_name": "AvalonBay Communities",
  "wiki_title_used": "AvalonBay Communities",
  "exists": true,
  "raw_text": "AvalonBay Communities, Inc. is a publicly traded real estate investment trust that invests in apartments.\nAs of January 31, 2021, the company owned 79,856 apartment units in New England, the New York City metropolitan area, the Washington, D.C. metropolitan area, Seattle and California. It is the 3rd largest owner of apartments in the United States.\n\nHistory\nThe company was formed by the 1998 merger between Avalon Properties Inc. and Bay Apartment Communities Inc. The merged company owned 40,506 apartment units. Avalon Properties was formed in 1993 as a spinoff from Trammell Crow Company and was led by Richard Michaux, as chairman and CEO, and Chuck Berman, president, COO and board member. Bay Apartment Communities was formed in 1994 from the apartment business established by Mike Meyer in 1978.\nIn February 2001, Bryce Blair was named CEO, and the additional role of Chairman in January 2002. In 2003, the company sold $450 million in assets to reinvest the proceeds in its development pipeline. In 2007, the company was added to the S&P 500. In 2011, Timothy J. Naughton was named CEO, and the additional role of chairman in January 2013.\nOn February 27, 2013, AvalonBay Communities and Equity Residential closed a $9 billion deal to acquire Archstone from Lehman Brothers.\nIn 2017, a lawsuit was filed by former tenants of Avalon at Edgewater, an AvalonBay community in Edgewater, New Jersey, who alleged that AvalonBay breached its duty of care by allegedly violating fire standards and safety procedures following a five-alarm fire at the community in 2015. The class action lawsuit by former Russell Building at the Avalon at Edgewater tenants was settled in 2017. Tenants were able to submit a claim for full losses from the fire by September 11, 2017.\nIn 2024, AvalonBay reported its intention to focus more resources on build-to-rent development and acquisitions during their 3rd quarter earnings call.\n\nReferences\nExternal links\nOfficial website\nBusiness data for AvalonBay Communities, Inc.:",
  "clean_text": "AvalonBay Communities, Inc. is a publicly traded real estate investment trust that invests in apartments. As of January 31, 2021, the company owned 79,856 apartment units in New England, the New York City metropolitan area, the Washington, D.C. metropolitan area, Seattle and California. It is the 3rd largest owner of apartments in the United States. History The company was formed by the 1998 merger between Avalon Properties Inc. and Bay Apartment Communities Inc. The merged company owned 40,506 apartment units. Avalon Properties was formed in 1993 as a spinoff from Trammell Crow Company and was led by Richard Michaux, as chairman and CEO, and Chuck Berman, president, COO and board member. Bay Apartment Communities was formed in 1994 from the apartment business established by Mike Meyer in 1978. In February 2001, Bryce Blair was named CEO, and the additional role of Chairman in January 2002. In 2003, the company sold $450 million in assets to reinvest the proceeds in its development pipeline. In 2007, the company was added to the S&P 500. In 2011, Timothy J. Naughton was named CEO, and the additional role of chairman in January 2013. On February 27, 2013, AvalonBay Communities and Equity Residential closed a $9 billion deal to acquire Archstone from Lehman Brothers. In 2017, a lawsuit was filed by former tenants of Avalon at Edgewater, an AvalonBay community in Edgewater, New Jersey, who alleged that AvalonBay breached its duty of care by allegedly violating fire standards and safety procedures following a five-alarm fire at the community in 2015. The class action lawsuit by former Russell Building at the Avalon at Edgewater tenants was settled in 2017. Tenants were able to submit a claim for full losses from the fire by September 11, 2017. In 2024, AvalonBay reported its intention to focus more resources on build-to-rent development and acquisitions during their 3rd quarter earnings call."
}