{
  "ticker": "AVGO",
  "cik": "0001730168",
  "company_name": "Broadcom",
  "corrected_name": "Broadcom",
  "wiki_title_used": "Broadcom",
  "exists": true,
  "raw_text": "Broadcom Inc. is an American multinational designer, developer, manufacturer, and global supplier of a wide range of semiconductor and infrastructure software products. Broadcom's product offerings serve the data center, networking, software, broadband, wireless, storage, and industrial markets. As of 2025—amid the AI boom—Broadcom is one of the largest companies globally, and could be considered part of the Big Tech group and the Magnificent Seven, replacing Tesla.\nIn December 2024, Broadcom became the 12th company to surpass a $1 trillion market cap, and as of September 2025, it remains the most recent company to reach that milestone. As of 2024, some 58% of Broadcom's revenue came from its semiconductor-based products and 42% from its infrastructure software products and services.\nTan Hock Eng is the company's president and CEO. The company is headquartered in Palo Alto, California. Avago Technologies Limited changed its name to Broadcom to acquire Broadcom Corporation in January 2016. Avago's ticker symbol AVGO now represents the merged entity. The Broadcom Corporation ticker symbol BRCM was retired. Initially the merged entity was known as Broadcom Limited, before assuming the current name in November 2017.\nIn October 2019, the European Union issued an interim antitrust order against Broadcom concerning anticompetitive business practices which allegedly violate European Union competition law.\nIn May 2022, Broadcom announced an agreement to acquire VMware in a cash-and-stock transaction valued at $69 billion. The acquisition was closed on November 22, 2023.\n\nHistory\nOrigin in Hewlett-Packard\nThe company that would later become Broadcom Inc. was established in 1961 as HP Associates, a semiconductor products division of Hewlett-Packard.\nThe division separated from Hewlett-Packard as part of the Agilent Technologies spinoff in 1999.\n\nFormation of Avago Technologies\nKKR and Silver Lake Partners acquired the Semiconductor Products Group of Agilent Technologies in 2005 for $2.6 billion and formed Avago Technologies. Avago Technologies agreed to sell its I/O solutions unit to PMC-Sierra for $42.5 million in October 2005.\nIn August 2008, the company filed an initial public offering of $400 million. In October 2008, Avago Technologies acquired Infineon Technologies' Munich-based bulk acoustic wave business for €21.5 million.\nOn 6 August 2009, Avago Technologies went public on NASDAQ with the ticker symbol AVGO.\n\nAvago Technologies announced its agreement to acquire CyOptics, an optical chip and component supplier, for $400 million in April 2013. The acquisition aimed to expand Avago Technologies' fiber optics product portfolio. In October 2013, Avago Technologies invested $5 million in Amantys, a power electronics technology provider, as part of a strategic investment agreement between the two companies.\nAvago Technologies announced its agreement to acquire LSI Corporation in December 2013 for $6.6 billion. The acquisition helped move Avago Technologies away from specialized products and towards a more mainstream industry, which included chips, especially storage for data centers.\nThe company sold its SSD controller business to Seagate Technology in May 2014. In August 2014, the company was the ninth-largest semiconductor company. Avago Technologies agreed to sell LSI's Axxia Networking business to Intel for $650 million. The company also agreed to buy PLX Technology, an integrated circuits designer, for $309 million. In February 2015, it was announced that Avago Technologies Limited had reached an agreement to acquire Emulex Corporation for $8 per share in cash.\n\nAcquisition of and change of name to Broadcom Limited\nOn 28 May 2015, Avago announced that it would buy Broadcom Corporation for $37 billion ($17 billion cash and $20 billion in shares). Avago was the nominal survivor, but the combined company would be named Broadcom Ltd. It would have annual revenue of $15 billion and a market value of $77 billion. Broadcom Corp. strengthened Avago Technologies' patent position significantly in sectors such as mobile, the data center, and the Internet of Things and made the company the ninth largest holder of patents among the top semiconductor vendors, according to an analysis by technology consulting firm LexInnova.\nIn May 2016, Cypress Semiconductor announced that it acquired Broadcom Corporation's full portfolio of IoT products for $550 million. Under the deal, Cypress acquired Broadcom's IoT products and intellectual property for Wi-Fi, Bluetooth and Zigbee connectivity, as well as Broadcom's WICED platform and SDK for developers. The deal combined Broadcom's developer tools and connectivity technologies for IoT devices with Cypress' own programmable system-on-a-chip (SoC) products that provide memory, computing and graphics processing for low-power devices.\n\nForeign investment reviews and change of name to Broadcom Inc.\nIn 2016, Broadcom proposed merging with Brocade Communications Systems. The acquisition proposal included a $5.5 billion price and was offered in cash. It was delayed for review by the Committee on Foreign Investment in the United States. On 2 November 2017, Broadcom announced it would relocate its legal address from Singapore to Delaware, which would avoid the review. This action was linked to the parent company being renamed from Broadcom Limited to Broadcom Inc. The pre-2016-merger Broadcom, Broadcom Corporation, remains a wholly owned subsidiary of the renamed parent Broadcom Inc.\n\nIn mid-November 2017, Broadcom proposed to purchase Qualcomm for US$130 billion, which was rebuffed by Qualcomm's board. The proposed hostile takeover, which was later revised to $117 billion, was blocked by the Trump administration by an executive order that cited national security concerns. Specifically, the Committee on Foreign Investment in the United States expressed concerns. Broadcom, then headquartered in Singapore, was considered too close to China and chipmaker Huawei. \"A shift to Chinese dominance in 5G would have substantial negative national security consequences for the United States,\" CFIUS said. \"While the United States remains dominant in the standards-setting space currently, China would likely compete robustly to fill any void left by Qualcomm as a result of this hostile takeover.\" However, critics of the move stated that the decision was motivated by competitiveness more than security concerns. Broadcom withdrew its takeover bid two days after the executive order. Observers have stated that President Trump's decision was as consistent with the balance of trade objectives as it was with security concerns.\n\nMove into software\nHistorically a semiconductor-based-only company, the failure of the Qualcomm bid led Broadcom and its CEO to look at acquiring infrastructure software as an alternative way of growing in size. On 11 July 2018, news sources reported that Broadcom and CA Technologies agreed on terms for an $18.9 billion acquisition. CA Technologies, formerly known as Computer Associates, was a longtime giant in software for mainframe computers that had expanded its offerings into software for cloud computing. And on 5 November 2018, Broadcom announced that it had completed the acquisition of CA Technologies.\nOn 9 August 2019, Broadcom acquired the enterprise security business of Symantec Corporation (the consumer software portion of which is now known as Gen Digital) for $10.7 billion in cash. The deal continued Broadcom's push into software critical for corporate infrastructure. And on 4 November 2019, Broadcom announced that it had completed the acquisition of the business, as well as the Symantec name and brand.\nIn 2019, Broadcom was the fifth best performing stock of the 2010s, with a total return of 1,956%.\n\nAnti-competitive practices investigations\nIn January 2018, it was reported that the FTC had been investigating Broadcom for several months for engaging in anti-competitive tactics while negotiating with customers. In 2021, Broadcom agreed to settle the antitrust complaint, in which the U.S. Federal Trade Commission claimed that the company abused its monopoly power using restrictive contract terms and threats of retaliation against customers the company deemed \"disloyal.\" \nIn October 2019, Broadcom was ordered by the European Commission to stop allegedly anticompetitive practices. \nIn 2021, Broadcom agreed to settle the antitrust complaint which claimed it had abused its monopoly power through restrictive contract terms and threats of retaliation against non-compliant customers. Such contract terms are alleged to stifle innovation and harm competition in the global supply market. European Competition Commissioner Margrethe Vestager said that Broadcom's contract terms with six main customers would \"create serious and irreversible harm to competition\" if no action were taken. The  company agreed to a commitment to suspend agreements containing exclusivity or quasi-exclusivity arrangements and a commitment not to enter into such agreements for seven years.\n\nPatent suits\nIn 2017, Broadcom filed patent suits against smart TV manufacturers. The U.S. International Trade Commission ruled in favor of the smart TV manufacturers.\nIn 2020, Broadcom sued Netflix over multiple patent infringements. Critics have argued that Broadcom is suing Netflix for being more successful, citing the declining number of traditional pay television subscribers due to the rise of streaming services. The Leichtman Research Group calculated that the largest pay TV providers in the U.S. – representing about 95% of the market – lost about 4,915,000 net video subscribers in 2019. Regular customers each pay $231 a year for their boxes, totaling almost $20 billion per year in profit for the cable industry.\n\n2020s\nOn January 7, 2020, Accenture PLC agreed to acquire Symantec's 300-person cybersecurity services division from Broadcom. In February 2020, Broadcom announced the world's first WiFi 6E client device, the BCM4389. In early 2020, Raspberry Pi Inc. revealed that their new boards would have a Broadcom BCM2711 chip.\nIn May 2022, Broadcom announced their deal to acquire the virtualization and cloud computing software vendor VMware for $61 billion in a combination of cash and stock, with Broadcom assuming $8 billion in VMware debt. In November 2022, the UK's Competition and Markets Authority regulator announced it would investigate whether the Broadcom Inc. acquisition of VMware Inc. would \"result in a substantial lessening of competition within any market or markets in the United Kingdom for goods or services\". The European Commission also said it was investigating the proposed acquisition, and as a result, Broadcom and VMware extended the planned completion date out to May 26, 2023. On May 19, 2023, as both UK and EU regulators had yet to complete their investigations, the completion date was formally extended to August 26, 2023, and was later further extended to as late as November 26, 2023.\nOn November 21, 2023, Broadcom Inc. announced its plan to finalize the $69 billion acquisition of VMware Inc. on the following Wednesday. This acquisition, one of the largest in the technology sector, received global regulatory scrutiny, including from China, which approved the deal with specific conditions. These conditions require VMware's server software to be compatible with local hardware and not restrict customers from using Broadcom's hardware products. Despite concerns over rising China-U.S. tensions, the approval from China, which was the last regulatory hurdle, allowed the deal to proceed. The transaction closed on November 22, 2023. On completion, CEO Hock Tan announced that the company would relocate its headquarters in San Jose to the VMware campus in Palo Alto, California. In February 2024, Broadcom sold the end-user computing division, which it inherited from the VMware acquisition, to KKR for $4 billion.\n\nCorporate affairs\nFinances\nFor the fiscal year 2023, Broadcom reported earnings of US$14.1 billion, with an annual revenue of US$35.8 billion, an increase of 7.9% over the previous fiscal cycle.\n\nOwnership\nThe 10 largest shareholders of Broadcom in early 2024 were:\n\nThe Vanguard Group (10.03%)\nBlackRock (7.63%)\nCapital World Investors (4.53%)\nCapital International Investors (4.04%)\nState Street Corporation (3.95%)\nGeode Capital Management (2.12%)\nInsiders (2.04%)\nCapital Research Global Investors (1.98%)\nFidelity Investments (1.94%)\nMorgan Stanley (1.52%)\nBank of America (1.46%)\n\nProducts\nBroadcom sells a range of semiconductor and infrastructure software applications that serve the data center (mainframes), networking, software, broadband, wireless, and storage and industrial markets. Common applications for its products include: data center networking, home connectivity, broadband access, telecommunications equipment, smartphones, base stations, data center servers and storage, factory automation, power generation and alternative energy systems, displays, and mainframe operations and management, and application software development.\nBroadcom's core technologies and franchise products include networking devices, optical technologies, network interface controllers and data storage.\n\nVendors have included Broadcom NICs in their products. For example, select Dell PowerEdge blade servers have Broadcom-powered Ethernet port adapters as an add-in card. Other vendors such as Apple, Hewlett Packard Enterprise, and Raspberry Pi also use Broadcom NICs.\n\nVulnerabilities in SoC WiFi stack\nIn April 2017, Google's Project Zero investigated Broadcom's SoC WiFi stack and found that it lacked \"all basic exploit mitigations - including stack cookies, safe unlinking and access permission protection,\" allowing \"full device takeover by Wi-Fi proximity alone, requiring no user interaction.\" Numerous smartphones, such as by Apple, Samsung and Google were affected.\n\nJericho2\nJericho2 is a programmable Ethernet switch chip that has up to 10 Tbit/s switching capacity per device.\n\nTomahawk 3\nTomahawk 3 series supports high-density, standards-based 400GbE, 200GbE, and 100GbE switching and routing for hyperscale cloud networks. Broadcom divulged that it is bringing two variants of the Tomahawk-3 to market. The first can provide up to 12.8 Tbit/s total chip bandwidth and contains 256 integrated SerDes, supporting 32 ports at 400 Gbit/s, 64 ports at 200 Gbit/s, and 128 ports at 100 Gbit/s. The second variant of the Tomahawk-3 has 160 of the 256 SerDes available and delivers 8 Tbit/s of aggregate bandwidth. Broadcom is suggesting 80 ports at 100 Gbit/s; or 48 ports at 100 Gbit/s plus either 8 ports at 400 Gbit/s or 16 ports at 200 Gbit/s; or 96 ports at 50 Gbit/s plus either 8 ports at 400 Gbit/s or 16 ports at 200 Gbit/s. The Tomahawk 4 reached a speed of 25.6 Tbit/s while the Tomahawk 5 has a maximum speed of 51.2 Tbit/s.\n\nSoftware\nBroadcom has expanded from its original hardware base and also offers enterprise software products.\n\nSymantec Enterprise Security\nBroadcom operates its enterprise security business under the Symantec brand. It purchased the suite of enterprise security products from Symantec Corporation in 2019, after which Symantec Corporation changed its name to NortonLifeLock.\n\nBizOps technology\nBroadcom also offers products for supporting BizOps, including:\n\nClarity – product portfolio management\nRally – agile development\nBlaze CT – Shift-left testing\nDX Operational Intelligence – AIOps\nAgile Requirements Designer – model-based testing optimization of processes\n\nXPU\nBroadcom uses the term XPU to refer to custom ASIC chips developed in collaboration with major hyperscale clients—such as Google, Meta Platforms and ByteDance—that are tailored for specialized AI workloads.\nBroadcom has co-developed Google's Tensor Processing Unit (TPU) chips by translating Google's architecture and specifications into manufacturable silicon, providing proprietary technologies like SerDes high-speed interfaces, overseeing ASIC design, and managing chip fabrication and packaging through third-party foundries such as TSMC, covering all generations since the program's inception. Similarly, Meta's Training and Inference Accelerator (MTIA) chips, first introduced in 2023, were co-developed by Broadcom. In 2024, Broadcom began collaborating with OpenAI to co-develop a custom inference chip, as part of an effort to diversify beyond reliance on Nvidia GPUs amid growing demand.\n\nReferences\nExternal links\nOfficial website \nBroadcom on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nBusiness data for Broadcom Inc.:",
  "clean_text": "Broadcom Inc. is an American multinational designer, developer, manufacturer, and global supplier of a wide range of semiconductor and infrastructure software products. Broadcom's product offerings serve the data center, networking, software, broadband, wireless, storage, and industrial markets. As of 2025—amid the AI boom—Broadcom is one of the largest companies globally, and could be considered part of the Big Tech group and the Magnificent Seven, replacing Tesla. In December 2024, Broadcom became the 12th company to surpass a $1 trillion market cap, and as of September 2025, it remains the most recent company to reach that milestone. As of 2024, some 58% of Broadcom's revenue came from its semiconductor-based products and 42% from its infrastructure software products and services. Tan Hock Eng is the company's president and CEO. The company is headquartered in Palo Alto, California. Avago Technologies Limited changed its name to Broadcom to acquire Broadcom Corporation in January 2016. Avago's ticker symbol AVGO now represents the merged entity. The Broadcom Corporation ticker symbol BRCM was retired. Initially the merged entity was known as Broadcom Limited, before assuming the current name in November 2017. In October 2019, the European Union issued an interim antitrust order against Broadcom concerning anticompetitive business practices which allegedly violate European Union competition law. In May 2022, Broadcom announced an agreement to acquire VMware in a cash-and-stock transaction valued at $69 billion. The acquisition was closed on November 22, 2023. History Origin in Hewlett-Packard The company that would later become Broadcom Inc. was established in 1961 as HP Associates, a semiconductor products division of Hewlett-Packard. The division separated from Hewlett-Packard as part of the Agilent Technologies spinoff in 1999. Formation of Avago Technologies KKR and Silver Lake Partners acquired the Semiconductor Products Group of Agilent Technologies in 2005 for $2.6 billion and formed Avago Technologies. Avago Technologies agreed to sell its I/O solutions unit to PMC-Sierra for $42.5 million in October 2005. In August 2008, the company filed an initial public offering of $400 million. In October 2008, Avago Technologies acquired Infineon Technologies' Munich-based bulk acoustic wave business for €21.5 million. On 6 August 2009, Avago Technologies went public on NASDAQ with the ticker symbol AVGO. Avago Technologies announced its agreement to acquire CyOptics, an optical chip and component supplier, for $400 million in April 2013. The acquisition aimed to expand Avago Technologies' fiber optics product portfolio. In October 2013, Avago Technologies invested $5 million in Amantys, a power electronics technology provider, as part of a strategic investment agreement between the two companies. Avago Technologies announced its agreement to acquire LSI Corporation in December 2013 for $6.6 billion. The acquisition helped move Avago Technologies away from specialized products and towards a more mainstream industry, which included chips, especially storage for data centers. The company sold its SSD controller business to Seagate Technology in May 2014. In August 2014, the company was the ninth-largest semiconductor company. Avago Technologies agreed to sell LSI's Axxia Networking business to Intel for $650 million. The company also agreed to buy PLX Technology, an integrated circuits designer, for $309 million. In February 2015, it was announced that Avago Technologies Limited had reached an agreement to acquire Emulex Corporation for $8 per share in cash. Acquisition of and change of name to Broadcom Limited On 28 May 2015, Avago announced that it would buy Broadcom Corporation for $37 billion ($17 billion cash and $20 billion in shares). Avago was the nominal survivor, but the combined company would be named Broadcom Ltd. It would have annual revenue of $15 billion and a market value of $77 billion. Broadcom Corp. strengthened Avago Technologies' patent position significantly in sectors such as mobile, the data center, and the Internet of Things and made the company the ninth largest holder of patents among the top semiconductor vendors, according to an analysis by technology consulting firm LexInnova. In May 2016, Cypress Semiconductor announced that it acquired Broadcom Corporation's full portfolio of IoT products for $550 million. Under the deal, Cypress acquired Broadcom's IoT products and intellectual property for Wi-Fi, Bluetooth and Zigbee connectivity, as well as Broadcom's WICED platform and SDK for developers. The deal combined Broadcom's developer tools and connectivity technologies for IoT devices with Cypress' own programmable system-on-a-chip (SoC) products that provide memory, computing and graphics processing for low-power devices. Foreign investment reviews and change of name to Broadcom Inc. In 2016, Broadcom proposed merging with Brocade Communications Systems. The acquisition proposal included a $5.5 billion price and was offered in cash. It was delayed for review by the Committee on Foreign Investment in the United States. On 2 November 2017, Broadcom announced it would relocate its legal address from Singapore to Delaware, which would avoid the review. This action was linked to the parent company being renamed from Broadcom Limited to Broadcom Inc. The pre-2016-merger Broadcom, Broadcom Corporation, remains a wholly owned subsidiary of the renamed parent Broadcom Inc. In mid-November 2017, Broadcom proposed to purchase Qualcomm for US$130 billion, which was rebuffed by Qualcomm's board. The proposed hostile takeover, which was later revised to $117 billion, was blocked by the Trump administration by an executive order that cited national security concerns. Specifically, the Committee on Foreign Investment in the United States expressed concerns. Broadcom, then headquartered in Singapore, was considered too close to China and chipmaker Huawei. \"A shift to Chinese dominance in 5G would have substantial negative national security consequences for the United States,\" CFIUS said. \"While the United States remains dominant in the standards-setting space currently, China would likely compete robustly to fill any void left by Qualcomm as a result of this hostile takeover.\" However, critics of the move stated that the decision was motivated by competitiveness more than security concerns. Broadcom withdrew its takeover bid two days after the executive order. Observers have stated that President Trump's decision was as consistent with the balance of trade objectives as it was with security concerns. Move into software Historically a semiconductor-based-only company, the failure of the Qualcomm bid led Broadcom and its CEO to look at acquiring infrastructure software as an alternative way of growing in size. On 11 July 2018, news sources reported that Broadcom and CA Technologies agreed on terms for an $18.9 billion acquisition. CA Technologies, formerly known as Computer Associates, was a longtime giant in software for mainframe computers that had expanded its offerings into software for cloud computing. And on 5 November 2018, Broadcom announced that it had completed the acquisition of CA Technologies. On 9 August 2019, Broadcom acquired the enterprise security business of Symantec Corporation (the consumer software portion of which is now known as Gen Digital) for $10.7 billion in cash. The deal continued Broadcom's push into software critical for corporate infrastructure. And on 4 November 2019, Broadcom announced that it had completed the acquisition of the business, as well as the Symantec name and brand. In 2019, Broadcom was the fifth best performing stock of the 2010s, with a total return of 1,956%. Anti-competitive practices investigations In January 2018, it was reported that the FTC had been investigating Broadcom for several months for engaging in anti-competitive tactics while negotiating with customers. In 2021, Broadcom agreed to settle the antitrust complaint, in which the U.S. Federal Trade Commission claimed that the company abused its monopoly power using restrictive contract terms and threats of retaliation against customers the company deemed \"disloyal.\" In October 2019, Broadcom was ordered by the European Commission to stop allegedly anticompetitive practices. In 2021, Broadcom agreed to settle the antitrust complaint which claimed it had abused its monopoly power through restrictive contract terms and threats of retaliation against non-compliant customers. Such contract terms are alleged to stifle innovation and harm competition in the global supply market. European Competition Commissioner Margrethe Vestager said that Broadcom's contract terms with six main customers would \"create serious and irreversible harm to competition\" if no action were taken. The company agreed to a commitment to suspend agreements containing exclusivity or quasi-exclusivity arrangements and a commitment not to enter into such agreements for seven years. Patent suits In 2017, Broadcom filed patent suits against smart TV manufacturers. The U.S. International Trade Commission ruled in favor of the smart TV manufacturers. In 2020, Broadcom sued Netflix over multiple patent infringements. Critics have argued that Broadcom is suing Netflix for being more successful, citing the declining number of traditional pay television subscribers due to the rise of streaming services. The Leichtman Research Group calculated that the largest pay TV providers in the U.S. – representing about 95% of the market – lost about 4,915,000 net video subscribers in 2019. Regular customers each pay $231 a year for their boxes, totaling almost $20 billion per year in profit for the cable industry. 2020s On January 7, 2020, Accenture PLC agreed to acquire Symantec's 300-person cybersecurity services division from Broadcom. In February 2020, Broadcom announced the world's first WiFi 6E client device, the BCM4389. In early 2020, Raspberry Pi Inc. revealed that their new boards would have a Broadcom BCM2711 chip. In May 2022, Broadcom announced their deal to acquire the virtualization and cloud computing software vendor VMware for $61 billion in a combination of cash and stock, with Broadcom assuming $8 billion in VMware debt. In November 2022, the UK's Competition and Markets Authority regulator announced it would investigate whether the Broadcom Inc. acquisition of VMware Inc. would \"result in a substantial lessening of competition within any market or markets in the United Kingdom for goods or services\". The European Commission also said it was investigating the proposed acquisition, and as a result, Broadcom and VMware extended the planned completion date out to May 26, 2023. On May 19, 2023, as both UK and EU regulators had yet to complete their investigations, the completion date was formally extended to August 26, 2023, and was later further extended to as late as November 26, 2023. On November 21, 2023, Broadcom Inc. announced its plan to finalize the $69 billion acquisition of VMware Inc. on the following Wednesday. This acquisition, one of the largest in the technology sector, received global regulatory scrutiny, including from China, which approved the deal with specific conditions. These conditions require VMware's server software to be compatible with local hardware and not restrict customers from using Broadcom's hardware products. Despite concerns over rising China-U.S. tensions, the approval from China, which was the last regulatory hurdle, allowed the deal to proceed. The transaction closed on November 22, 2023. On completion, CEO Hock Tan announced that the company would relocate its headquarters in San Jose to the VMware campus in Palo Alto, California. In February 2024, Broadcom sold the end-user computing division, which it inherited from the VMware acquisition, to KKR for $4 billion. Corporate affairs Finances For the fiscal year 2023, Broadcom reported earnings of US$14.1 billion, with an annual revenue of US$35.8 billion, an increase of 7.9% over the previous fiscal cycle. Ownership The 10 largest shareholders of Broadcom in early 2024 were: The Vanguard Group (10.03%) BlackRock (7.63%) Capital World Investors (4.53%) Capital International Investors (4.04%) State Street Corporation (3.95%) Geode Capital Management (2.12%) Insiders (2.04%) Capital Research Global Investors (1.98%) Fidelity Investments (1.94%) Morgan Stanley (1.52%) Bank of America (1.46%) Products Broadcom sells a range of semiconductor and infrastructure software applications that serve the data center (mainframes), networking, software, broadband, wireless, and storage and industrial markets. Common applications for its products include: data center networking, home connectivity, broadband access, telecommunications equipment, smartphones, base stations, data center servers and storage, factory automation, power generation and alternative energy systems, displays, and mainframe operations and management, and application software development. Broadcom's core technologies and franchise products include networking devices, optical technologies, network interface controllers and data storage. Vendors have included Broadcom NICs in their products. For example, select Dell PowerEdge blade servers have Broadcom-powered Ethernet port adapters as an add-in card. Other vendors such as Apple, Hewlett Packard Enterprise, and Raspberry Pi also use Broadcom NICs. Vulnerabilities in SoC WiFi stack In April 2017, Google's Project Zero investigated Broadcom's SoC WiFi stack and found that it lacked \"all basic exploit mitigations - including stack cookies, safe unlinking and access permission protection,\" allowing \"full device takeover by Wi-Fi proximity alone, requiring no user interaction.\" Numerous smartphones, such as by Apple, Samsung and Google were affected. Jericho2 Jericho2 is a programmable Ethernet switch chip that has up to 10 Tbit/s switching capacity per device. Tomahawk 3 Tomahawk 3 series supports high-density, standards-based 400GbE, 200GbE, and 100GbE switching and routing for hyperscale cloud networks. Broadcom divulged that it is bringing two variants of the Tomahawk-3 to market. The first can provide up to 12.8 Tbit/s total chip bandwidth and contains 256 integrated SerDes, supporting 32 ports at 400 Gbit/s, 64 ports at 200 Gbit/s, and 128 ports at 100 Gbit/s. The second variant of the Tomahawk-3 has 160 of the 256 SerDes available and delivers 8 Tbit/s of aggregate bandwidth. Broadcom is suggesting 80 ports at 100 Gbit/s; or 48 ports at 100 Gbit/s plus either 8 ports at 400 Gbit/s or 16 ports at 200 Gbit/s; or 96 ports at 50 Gbit/s plus either 8 ports at 400 Gbit/s or 16 ports at 200 Gbit/s. The Tomahawk 4 reached a speed of 25.6 Tbit/s while the Tomahawk 5 has a maximum speed of 51.2 Tbit/s. Software Broadcom has expanded from its original hardware base and also offers enterprise software products. Symantec Enterprise Security Broadcom operates its enterprise security business under the Symantec brand. It purchased the suite of enterprise security products from Symantec Corporation in 2019, after which Symantec Corporation changed its name to NortonLifeLock. BizOps technology Broadcom also offers products for supporting BizOps, including: Clarity – product portfolio management Rally – agile development Blaze CT – Shift-left testing DX Operational Intelligence – AIOps Agile Requirements Designer – model-based testing optimization of processes XPU Broadcom uses the term XPU to refer to custom ASIC chips developed in collaboration with major hyperscale clients—such as Google, Meta Platforms and ByteDance—that are tailored for specialized AI workloads. Broadcom has co-developed Google's Tensor Processing Unit (TPU) chips by translating Google's architecture and specifications into manufacturable silicon, providing proprietary technologies like SerDes high-speed interfaces, overseeing ASIC design, and managing chip fabrication and packaging through third-party foundries such as TSMC, covering all generations since the program's inception. Similarly, Meta's Training and Inference Accelerator (MTIA) chips, first introduced in 2023, were co-developed by Broadcom. In 2024, Broadcom began collaborating with OpenAI to co-develop a custom inference chip, as part of an effort to diversify beyond reliance on Nvidia GPUs amid growing demand."
}