{
  "ticker": "AVY",
  "cik": "0000008818",
  "company_name": "Avery Dennison",
  "corrected_name": "Avery Dennison",
  "wiki_title_used": "Avery Dennison",
  "exists": true,
  "raw_text": "Avery Dennison Corporation is a multinational manufacturer and distributor of pressure-sensitive adhesive materials (such as self-adhesive labels), apparel branding labels and tags, RFID inlays, and specialty medical products.  The company is a member of the Fortune 500 and is headquartered in Mentor, Ohio.\n\nHistory\nThe company was founded in Los Angeles, California, in 1935 as Kum Kleen Products, a partnership of Mr. and Mrs. Ray Stanton Avery. The name was changed to Avery Adhesives in 1937.  In 1946, the company was incorporated as Avery Adhesive Label Corp., and the name was subsequently changed to Avery Adhesive Products, Inc. in 1958, and to Avery Products Corporation in 1964.  The name was changed again to Avery International Corporation in 1976, and it became Avery Dennison after the company merged with the Dennison Manufacturing Company in 1990.\nH. Russell Smith, a college friend of Avery's, joined the company in 1946 as a one-third owner and for nearly 40 years was Avery's partner in entrepreneurship, serving at various times as the company's president, chief executive officer and chairman of the board.  Smith incorporated the 50-person company in 1946, started its core label materials business, expanded operations across the U.S. and into Europe, and opened a renowned research center. As the company's representative to the financial community, he led its listing on the New York Stock Exchange in 1967. At Smith's death in 2014, CEO Dean Scarborough noted that “our company owes its existence and character in large part to Russ Smith's business acumen, personal integrity and generosity of spirit.  He was the perfect partner for Stan Avery.” In 2022 the company won an ASC innovation award for \"Advanced Acrylics Technology for High Performance Pressure Sensitive Adhesive Applications\". \nYou can find the complete timeline in the history section of the corporate website, including the introduction to the New York Stock Exchange in 1969 and the inclusion on the Fortune 500 list in 1976.\n\nDennison Manufacturing\nThe Dennison Manufacturing Company was founded by Andrew Dennison and his son Aaron Lufkin Dennison, residents of Brunswick. Maine, in 1844, as a jewelry- and watch-box manufacturing company located in the Dunlap Block of Maine Street.  Five years later Aaron turned the Dennison Manufacturing Company over to his younger brother, Eliphalet Whorf Dennison, who took over and developed the company into a significant-size industrial enterprise. It was in 1898 that the business moved to a location in Framingham, Massachusetts. Aaron Dennison went on to co-found the Waltham Watch Company in 1850, a leader in the American system of watch manufacturing using interchangeable parts.\n\nOffice and Consumer Products\nAvery Dennison created a separate division for office products such as binders, file labels and name badges in 1982. The division and its products, sold under the Avery brand and logo, contrasted with the company's larger materials division in that its products were finished (“converted”) materials, and they were aimed at consumers as well as businesses. Over the next 30 years, the division grew, as personal computing created a market for printable media both at home and at work. However, with the rise of email and the decline in conventional mail, the office products market as a whole began to decline. On July 1, 2013, Avery Dennison completed the sale of Office and Consumer Products and a second business, Designed and Engineered Solutions, to CCL Industries. Avery Dennison retains its full name, history, brand and logo.\n\nOperations\nThe company is headquartered in Mentor, Ohio. It ranked number 421 on the 2023 Fortune 500 list with total sales of $8.4 billion. The company operates in more than 50 countries and employs 35,000 people worldwide. Its first overseas subsidiary was established in the Netherlands in 1955.\n\nDivisions\nThe company's operations are organized into two business segments: Materials Group and Solutions Group. With $5.8 billion in net sales in 2023, Materials Group manufactures and produces pressure-sensitive materials such as labels, graphics, reflective and functional. Solutions Group accounted for $2.6 billion in net sales in the same year, manufacturing solutions such as RFID, branded tag and embellishment, data management and identification and pricing and productivity.\nThe Solutions Group segment designs, manufactures, and sells various branding and information management products for apparel and general retail, including tickets, graphic, barcode and radio-frequency identification (RFID) tags, labels and inserts, woven and printed labels, external embellishments, price management systems, a variety of fasteners, and related supplies and equipment.\nThe branding and information management products that the business provides include RFID-based systems. In 2007 the company acquired Paxar, a manufacturer of identification and tracking systems for all aspects of the retail supply chain.\nIn 2016, Avery Dennison acquired Mactac, a European business, as well as Ink Mill Corporation, a U.S.-based business, in order to combine the latter's ink capabilities with the Avery Dennison portfolio for reflective media. Later that year, Avery Dennison invested in PragmatIC (flexible electronics) for the purpose of expansion in intelligent packaging.\nIn 2017, Avery Dennison acquired Finesse Medical, an Irish company that brought new products and manufacturing capabilities in the high-value healthcare materials business; Hanita Coatings, a pressure-sensitive materials manufacturer of specialty films and laminates; and Yongle Tape Company Ltd., a manufacturer of specialty tapes and related products. Additionally, Avery Dennison invested in Wrapify, looking to expand the car wrap industry.\nIn 2019, Avery Dennison joined Wiliot's original investor group in a $30 Million Series B funding round in a bid to focus on battery-free Bluetooth sensors that are paper-thin and can connect people with their products and packaging. In 2020, the company acquired the RFID transponder business from Smartrac and invested in Roadrunner Recycling.\nThe company launched atma.io, a \"digital product cloud to connect physical and digital worlds,\" in 2021. The focus of the platform is on creating and managing digital IDs for products. The same year, Avery Dennison also acquired ACPO Ltd, a leader in the manufacture of self-wound (linerless) pressure-sensitive overlaminate products in North America; Vestcom, a provider of pricing and branded labeling solutions for the retail shelf edge; JDC Solutions, U.S.-based manufacturer of pressure-sensitive specialty tapes;  and ZippyYum, a California-based startup that develops and sells software and hardware solutions for operational automation and inventory management for food retailers.\nIn February 2022, it was announced Avery Dennison had acquired the Frick, Switzerland-based company, TexTrace, a technology developer specializing in custom-made woven and knitted RFID products that can be sewn onto or inserted into garments. In March 2022, Avery Dennison announced it had acquired the linerless label technology developed by the UK company, Catchpoint Ltd. The purchase covers Catchpoint's patents and brand.\nThe company also operates Avery Dennison Medical, which provides products such as wearable sensors, barrier films, wound dressings and a variety of tapes and securement products for the healthcare industry.  Results for Vancive Medical Technologies are reported in Other specialty converting businesses. Vancive Medical Technologies products are sold to medical products and device manufacturers.\nEarly in 2023, Avery Dennison announced an investment in Circ for textile-to-textile recycling. In addition, the company acquired Thermopatch, a specialist in labeling, embellishments, and transfers for the sports, industrial laundry, workwear and hospitality industries, as well as Lion Brothers, a designer and manufacturer of apparel brand embellishments. In November 2023, Avery Dennison acquired Silver Crystal Group, a company that makes customized jerseys and apparel for sport organizations.\n\nMergers and acquisitions\n2007 - Paxar\n2016 - Mactac\n2016 - Ink Mill Corporation\n2016 - PragmatIC (investment)\n2017 - Finesse Medical\n2017 - Hanita Coatings\n2017 - Yongle Tape Company Ltd.\n2017 - Wrapify (investment)\n2019 - Wiliot (investment)\n2020 - RFID\n2023 - Circ (investment)\n2023 - Thermopatch\n2023 - Lion Brothers\n2023 - Silver Crystal Group\n\nPatent infringement\nIn 2012, Avery Dennison and 3M Company agreed to settle patent and antitrust litigation between the parties. The litigation began when 3M alleged that Avery Dennison infringed 3M's patents related to retroreflective sheeting used for road signs and other highway and transportation products and requested an injunction to prevent Avery Dennison from selling its OmniCube retroreflective product. The court denied 3M's request, and after Avery Dennison brought claims of its own against 3M for patent infringement and antitrust violations, the parties agreed to dismiss three pending cases.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Avery Dennison Corporation:",
  "clean_text": "Avery Dennison Corporation is a multinational manufacturer and distributor of pressure-sensitive adhesive materials (such as self-adhesive labels), apparel branding labels and tags, RFID inlays, and specialty medical products. The company is a member of the Fortune 500 and is headquartered in Mentor, Ohio. History The company was founded in Los Angeles, California, in 1935 as Kum Kleen Products, a partnership of Mr. and Mrs. Ray Stanton Avery. The name was changed to Avery Adhesives in 1937. In 1946, the company was incorporated as Avery Adhesive Label Corp., and the name was subsequently changed to Avery Adhesive Products, Inc. in 1958, and to Avery Products Corporation in 1964. The name was changed again to Avery International Corporation in 1976, and it became Avery Dennison after the company merged with the Dennison Manufacturing Company in 1990. H. Russell Smith, a college friend of Avery's, joined the company in 1946 as a one-third owner and for nearly 40 years was Avery's partner in entrepreneurship, serving at various times as the company's president, chief executive officer and chairman of the board. Smith incorporated the 50-person company in 1946, started its core label materials business, expanded operations across the U.S. and into Europe, and opened a renowned research center. As the company's representative to the financial community, he led its listing on the New York Stock Exchange in 1967. At Smith's death in 2014, CEO Dean Scarborough noted that “our company owes its existence and character in large part to Russ Smith's business acumen, personal integrity and generosity of spirit. He was the perfect partner for Stan Avery.” In 2022 the company won an ASC innovation award for \"Advanced Acrylics Technology for High Performance Pressure Sensitive Adhesive Applications\". You can find the complete timeline in the history section of the corporate website, including the introduction to the New York Stock Exchange in 1969 and the inclusion on the Fortune 500 list in 1976. Dennison Manufacturing The Dennison Manufacturing Company was founded by Andrew Dennison and his son Aaron Lufkin Dennison, residents of Brunswick. Maine, in 1844, as a jewelry- and watch-box manufacturing company located in the Dunlap Block of Maine Street. Five years later Aaron turned the Dennison Manufacturing Company over to his younger brother, Eliphalet Whorf Dennison, who took over and developed the company into a significant-size industrial enterprise. It was in 1898 that the business moved to a location in Framingham, Massachusetts. Aaron Dennison went on to co-found the Waltham Watch Company in 1850, a leader in the American system of watch manufacturing using interchangeable parts. Office and Consumer Products Avery Dennison created a separate division for office products such as binders, file labels and name badges in 1982. The division and its products, sold under the Avery brand and logo, contrasted with the company's larger materials division in that its products were finished (“converted”) materials, and they were aimed at consumers as well as businesses. Over the next 30 years, the division grew, as personal computing created a market for printable media both at home and at work. However, with the rise of email and the decline in conventional mail, the office products market as a whole began to decline. On July 1, 2013, Avery Dennison completed the sale of Office and Consumer Products and a second business, Designed and Engineered Solutions, to CCL Industries. Avery Dennison retains its full name, history, brand and logo. Operations The company is headquartered in Mentor, Ohio. It ranked number 421 on the 2023 Fortune 500 list with total sales of $8.4 billion. The company operates in more than 50 countries and employs 35,000 people worldwide. Its first overseas subsidiary was established in the Netherlands in 1955. Divisions The company's operations are organized into two business segments: Materials Group and Solutions Group. With $5.8 billion in net sales in 2023, Materials Group manufactures and produces pressure-sensitive materials such as labels, graphics, reflective and functional. Solutions Group accounted for $2.6 billion in net sales in the same year, manufacturing solutions such as RFID, branded tag and embellishment, data management and identification and pricing and productivity. The Solutions Group segment designs, manufactures, and sells various branding and information management products for apparel and general retail, including tickets, graphic, barcode and radio-frequency identification (RFID) tags, labels and inserts, woven and printed labels, external embellishments, price management systems, a variety of fasteners, and related supplies and equipment. The branding and information management products that the business provides include RFID-based systems. In 2007 the company acquired Paxar, a manufacturer of identification and tracking systems for all aspects of the retail supply chain. In 2016, Avery Dennison acquired Mactac, a European business, as well as Ink Mill Corporation, a U.S.-based business, in order to combine the latter's ink capabilities with the Avery Dennison portfolio for reflective media. Later that year, Avery Dennison invested in PragmatIC (flexible electronics) for the purpose of expansion in intelligent packaging. In 2017, Avery Dennison acquired Finesse Medical, an Irish company that brought new products and manufacturing capabilities in the high-value healthcare materials business; Hanita Coatings, a pressure-sensitive materials manufacturer of specialty films and laminates; and Yongle Tape Company Ltd., a manufacturer of specialty tapes and related products. Additionally, Avery Dennison invested in Wrapify, looking to expand the car wrap industry. In 2019, Avery Dennison joined Wiliot's original investor group in a $30 Million Series B funding round in a bid to focus on battery-free Bluetooth sensors that are paper-thin and can connect people with their products and packaging. In 2020, the company acquired the RFID transponder business from Smartrac and invested in Roadrunner Recycling. The company launched atma.io, a \"digital product cloud to connect physical and digital worlds,\" in 2021. The focus of the platform is on creating and managing digital IDs for products. The same year, Avery Dennison also acquired ACPO Ltd, a leader in the manufacture of self-wound (linerless) pressure-sensitive overlaminate products in North America; Vestcom, a provider of pricing and branded labeling solutions for the retail shelf edge; JDC Solutions, U.S.-based manufacturer of pressure-sensitive specialty tapes; and ZippyYum, a California-based startup that develops and sells software and hardware solutions for operational automation and inventory management for food retailers. In February 2022, it was announced Avery Dennison had acquired the Frick, Switzerland-based company, TexTrace, a technology developer specializing in custom-made woven and knitted RFID products that can be sewn onto or inserted into garments. In March 2022, Avery Dennison announced it had acquired the linerless label technology developed by the UK company, Catchpoint Ltd. The purchase covers Catchpoint's patents and brand. The company also operates Avery Dennison Medical, which provides products such as wearable sensors, barrier films, wound dressings and a variety of tapes and securement products for the healthcare industry. Results for Vancive Medical Technologies are reported in Other specialty converting businesses. Vancive Medical Technologies products are sold to medical products and device manufacturers. Early in 2023, Avery Dennison announced an investment in Circ for textile-to-textile recycling. In addition, the company acquired Thermopatch, a specialist in labeling, embellishments, and transfers for the sports, industrial laundry, workwear and hospitality industries, as well as Lion Brothers, a designer and manufacturer of apparel brand embellishments. In November 2023, Avery Dennison acquired Silver Crystal Group, a company that makes customized jerseys and apparel for sport organizations. Mergers and acquisitions 2007 - Paxar 2016 - Mactac 2016 - Ink Mill Corporation 2016 - PragmatIC (investment) 2017 - Finesse Medical 2017 - Hanita Coatings 2017 - Yongle Tape Company Ltd. 2017 - Wrapify (investment) 2019 - Wiliot (investment) 2020 - RFID 2023 - Circ (investment) 2023 - Thermopatch 2023 - Lion Brothers 2023 - Silver Crystal Group Patent infringement In 2012, Avery Dennison and 3M Company agreed to settle patent and antitrust litigation between the parties. The litigation began when 3M alleged that Avery Dennison infringed 3M's patents related to retroreflective sheeting used for road signs and other highway and transportation products and requested an injunction to prevent Avery Dennison from selling its OmniCube retroreflective product. The court denied 3M's request, and after Avery Dennison brought claims of its own against 3M for patent infringement and antitrust violations, the parties agreed to dismiss three pending cases."
}