{
  "ticker": "AWK",
  "cik": "0001410636",
  "company_name": "American Water Works",
  "corrected_name": "American Water Works",
  "wiki_title_used": "American Water Works",
  "exists": true,
  "raw_text": "American Water is an American public utility company that, through its subsidiaries, provides water and wastewater services in the United States. \nIts regulated operations provide water and wastewater services to approximately 1,700 communities in 14 states, serving a population of approximately 14 million. The company has 3.4 million customers which includes residential, commercial, fire service and private fire, industrial, government facilities, and other water and wastewater utilities.  \nThe shares are traded on the NYSE under the ticker AWK.\n\nHistory\nThe utility was founded in 1886 as the American Water Works & Guarantee Company. In 1914, American Water Works and Guarantee Company became American Water Works and Electric Company. In 1947 it was reorganized as American Water Works Company, Inc.\nSince December 2018, the company has its headquarters in Camden, New Jersey, and has about 6,700 professionals who provide drinking water, wastewater and related services to over 14 million people in 18 U.S. states.\nMost of American Water's services are locally managed utility subsidiaries that are regulated by the U.S. state in which each operates. American Water also owns subsidiaries that manage municipal drinking water and wastewater systems under contract and others that supply businesses and residential communities with water management products and services.  \nIn 2003, American Water established the American Water Military Services Group, which partners with the Department of Defense through the Utilities Privatization (UP) Program. Through this program, the company has a 50-year contract to provides water and wastewater utility services at 18 military installations in the U.S.\nIn 2023, American Water published its eighth Sustainability Report, showcasing the company's leadership and achievements in environmental, social, and governance (ESG) principles. By the second quarter of 2024, their capital investment plan reached  at $3.1 billion, with approximately 43,000 customer connections added through acquisitions and organic growth as of June 30.\nIn 2024, American Water reported earnings of $5.39 per share, up from $4.90 per share in 2023, and recorded a dividend growth of 8.1% for the year. It allocated $3.3 billion in capital towards addressing aging infrastructure, improving water quality, enhancing resiliency, and completing strategic acquisitions, which led to nearly 90,000 additional customer connections, 69,500 of which were through acquisitions. The company has maintained its long-term EPS and dividend growth targets of 7-9%. Additionally, CEO M. Susan Hardwick retired on May 14, 2025, and John Griffith, President of American Water, has succeed her.\nIn the first quarter of 2025, earnings were reported at $1.05 per share, up from $0.95 per share during the same period in 2024. The company maintained its earnings per share guidance for the year, projecting a range of $5.65 to $5.75. A quarterly cash dividend of $0.8275 per share was declared, scheduled for payment in June, reflecting an 8.2% increase from the previous dividend. In February, the company also issued $800 million in 5.250% senior notes set to mature in 2035. Revenue for the quarter ended March 2025 was $1.14 billion, compared to $1.01 billion a year earlier.\nIn the second quarter of 2025, American Water reported net income of $289 million, or $1.48 per share, compared with $277 million, or $1.42 per share, in the same period of 2024. Revenue increased to $1.28 billion from $1.15 billion, with the change attributed to its regulated businesses division. The company narrowed its 2025 earnings per share guidance to a range of $5.70 to $5.75, reaffirmed its long-term target of 7 to 9 percent annual growth in earnings and dividends, and declared a quarterly dividend of $0.83 per share.\nIn July 2025, the company participated in the National Association of Regulatory Utility Commissioners (NARUC) Summer Policy Summit.\nIn the third quarter of 2025, earnings were reported at $1.94 per share, up from $1.80 per share during the same period in 2024. The company affirmed long-term targets and 2025 EPS guidance, and initiates 2026 EPS guidance, reflecting growth of 8%, projecting a range of $6.02 to $6.12. The company also affirmed long-term targets, including long-term EPS and dividend per share compounded annual growth rates (CAGRs) of 7 to 9% and announced 2026-2030 capital plan of $19 to $20 billion and 2026-2035 capital plan of $46 to $48 billion.\n\nAcquisitions and mergers\nAmerican Water Works\nIn July 2025, the company announced an agreement to acquire Nexus Water Group, which operates in eight states and has about 87,000 customer connections under agreement.\nIn October 2025, the company agreed to acquire Essential Utilities in an all-stock merger, creating a combined company valued at $63 billion, including debt. Upon completion of the deal, expected in early 2027, American Water shareholders would own about 69% of the combined company, with Essential shareholders owning the remainder.\n\nCalifornia American Water\nIn July 2017, California American Water acquired the Oxbow Marina Mutual Water Company in Sacramento. In February 2020, the company acquired the operating assets of Fruitridge Vista Water Company, becoming the water provider for approximately 4,800 customers.\nIn September 2021, the company acquired East Pasadena Water Co., a family-owned utility serving homes and businesses in Pasadena. In September 2022, the company acquired Warring Water Services, Inc., a privately owned water utility in Piru, California, for $4.6 million.\nIn February 2025, the company completed its acquisition of the West San Martin Water Works system assets for $1.6 million. In May 2025, the company acquired the Mesa Del Sol water system in the Corral de Tierra area of Salinas. In August 2025, the company completed its acquisition of the Bass Lake Water Company system.\n\nIllinois American Water\nIn July 2017, Illinois American Water acquired the Forest Homes–Maple Park Public Water District. In September 2017, the company acquired the Piasa Township Sanitary District.\nIn November 2019, the company acquired the Village of Godfrey's wastewater system, adding approximately 6,200 wastewater customers to its Southern Illinois service area. In October 2020, the company acquired the City of Jerseyville's water and wastewater systems for $43.25 million. In December 2022, the company acquired the water distribution assets of the City of Rosiclare, Illinois, for $2.7 million.\n\nIndiana American Water\nIn November 2017, Indiana American Water acquired Georgetown Water, a municipal water utility in southern Indiana. In December 2018, the company announced the acquisition of the Town of Sheridan's water and wastewater systems in central Indiana.\n\nIowa American Water\nIn November 2022, Iowa American Water acquired the City of Blue Grass wastewater system for $2 million.\n\nMaryland American Water\nIn October 2024, Maryland American Water received approval from the Maryland Public Service Commission to acquire the drinking water assets of the Severn Water Company for about $1.6 million.\n\nMissouri American Water\nIn August 2022, Missouri American Water completed the acquisition of the City of Eureka's water and wastewater systems, serving approximately 4,000 water customers and 4,000 wastewater customers.\n\nNew Jersey American Water\nIn February 2022, New Jersey American Water acquired the wastewater collection system of the Borough of Bound Brook for $5 million.\nIn June 2023, the company completed the acquisition of the water and wastewater systems of Egg Harbor City, New Jersey, for $21.8 million. In October 2023, the company acquired the Borough of Somerville's wastewater collection system for $7 million.\nIn June 2024, the company completed the acquisition of Salem City's water and wastewater systems for $18 million. In November 2024, the company signed an agreement to acquire the Manville Sewer System for $6.5 million.\nIn March 2025, the company signed an agreement to acquire the South Orange Village water system for $19.7 million. In April 2025, the company acquired the Alfred Vail Mutual Association water system in Shrewsbury Township. In October 2025, the company agreed to acquire the Camden-based Gordon's Corner Water Co., a privately owned water company serving approximately 15,000 customers in parts of Colts Neck, Manalapan, and Marlboro Townships.\n\nPennsylvania American Water\nIn October 2016, Pennsylvania American Water completed the acquisition of New Cumberland's wastewater system. In October 2019, the company acquired the water assets of the Steelton Borough Authority. In November 2021, the company acquired the water and wastewater system assets of Valley Township, Chester County.\nIn May 2022, the company acquired the wastewater system assets for the City of York for $235.3 million. In June 2022, the company completed the acquisition of the wastewater system assets of Upper Pottsgrove Township, Montgomery County.\nIn September 2023, the company reached an agreement to acquire Appalachian Utilities, Inc. In the same year, the company acquired Audubon Water Company for $8 million. \nIn October 2024, the company completed the purchase of the Butler Area Sewer Authority wastewater system for $230 million. In November 2024, the company completed the acquisition of the Farmington Township water and wastewater system in Clarion County.\nIn June 2025,  the company completed the acquisition of Manwalamink Water and Sewer Company's water and wastewater systems. In the same month, the company signed an agreement to acquire the City of Pittston's wastewater collection system for $26.4 million. On July 1, 2025, the company entered into agreements to acquire the Indian Creek Valley Water Authority and the Sutersville-Sewickley Municipal Sewage Authority for a combined $36.05 million, involving approximately 2,700 water connections and 500 wastewater connections.\n\nVirginia American Water\nIn May 2013, Virginia American Water signed an agreement to acquire Dale Service Corporation, a wastewater utility serving Dale City. In August 2023, the company completed the acquisition of the water systems owned and operated by E.L. Goddard, Inc. for $375,000.\nIn April 2024, the company completed the acquisition of the Town of Cape Charles, Virginia's drinking water and wastewater system assets for $15 million.\n\nWest Virginia American Water\nIn September 2008, West Virginia American Water completed the acquisition of the Fayetteville water and wastewater systems. In July 2022, the company acquired Jefferson Utilities for $30 million.\nRecent significant acquisitions by State:\n\nMO = 8\nIL, NJ, WV = 3 each\nIA, IN = 2 each\nPA, VA = 1 each\nIn October 2024, American Water completed five acquisitions across Illinois, New Jersey, and Virginia, adding approximately 33,400 customer connections. Additionally, the company has agreements in place for 22 acquisitions in eight states—California, Indiana, Illinois, Maryland, Missouri, New Jersey, Pennsylvania, and West Virginia—which are expected to add about 43,400 customer connections upon completion.\n\nUtilities\nThe company owns 80 surface water treatment plants, 520 groundwater treatment plants, 190 wastewater treatment plants, 54,500 miles of pipes, 1,200 groundwater wells, 1,800 water and wastewater pumping stations, 1,100 treated water storage facilities, and 75 dams. The company serves 14 million people with regulated operations in 14 states and on 18 military installations. Services provided by American Water's utilities are subject to regulation by multiple state utility commissions or other entities engaged in utility regulation. Federal, state and local governments also regulate environmental, health and safety, and water quality and water accountability matters.\n\nAwards\n2024\nAmerican Water Ranks No. 1 in Utilities Industry on Forbes American's Best Large Employers 2024 List\nAmerican Water has been included in the top 10% of America's Most JUST Companies by JUST Capital and CNBC\n2024 Military Friendly Employers\n\n2023\nDisability Equality Index® (DEI) - Top Scoring Company for 5th consecutive year\nNewsweek's 2023 list of America's Most Responsible Companies #94\nRecognized as a 2023 Member of the Bloomberg Gender Equality Index - 5th straight year\nAmerican Water received the 2023 WaterSense Excellence Award from the U.S. Environmental Protection Agency in October and ranked 18 on the Barron's 100 Most Sustainable U.S. Companies 2023 list.\n\nFinancials\nSee also\nPublic services\n\nReferences\nExternal links\nOfficial website\nBusiness data for American Water Works Company, Inc.:",
  "clean_text": "American Water is an American public utility company that, through its subsidiaries, provides water and wastewater services in the United States. Its regulated operations provide water and wastewater services to approximately 1,700 communities in 14 states, serving a population of approximately 14 million. The company has 3.4 million customers which includes residential, commercial, fire service and private fire, industrial, government facilities, and other water and wastewater utilities. The shares are traded on the NYSE under the ticker AWK. History The utility was founded in 1886 as the American Water Works & Guarantee Company. In 1914, American Water Works and Guarantee Company became American Water Works and Electric Company. In 1947 it was reorganized as American Water Works Company, Inc. Since December 2018, the company has its headquarters in Camden, New Jersey, and has about 6,700 professionals who provide drinking water, wastewater and related services to over 14 million people in 18 U.S. states. Most of American Water's services are locally managed utility subsidiaries that are regulated by the U.S. state in which each operates. American Water also owns subsidiaries that manage municipal drinking water and wastewater systems under contract and others that supply businesses and residential communities with water management products and services. In 2003, American Water established the American Water Military Services Group, which partners with the Department of Defense through the Utilities Privatization (UP) Program. Through this program, the company has a 50-year contract to provides water and wastewater utility services at 18 military installations in the U.S. In 2023, American Water published its eighth Sustainability Report, showcasing the company's leadership and achievements in environmental, social, and governance (ESG) principles. By the second quarter of 2024, their capital investment plan reached at $3.1 billion, with approximately 43,000 customer connections added through acquisitions and organic growth as of June 30. In 2024, American Water reported earnings of $5.39 per share, up from $4.90 per share in 2023, and recorded a dividend growth of 8.1% for the year. It allocated $3.3 billion in capital towards addressing aging infrastructure, improving water quality, enhancing resiliency, and completing strategic acquisitions, which led to nearly 90,000 additional customer connections, 69,500 of which were through acquisitions. The company has maintained its long-term EPS and dividend growth targets of 7-9%. Additionally, CEO M. Susan Hardwick retired on May 14, 2025, and John Griffith, President of American Water, has succeed her. In the first quarter of 2025, earnings were reported at $1.05 per share, up from $0.95 per share during the same period in 2024. The company maintained its earnings per share guidance for the year, projecting a range of $5.65 to $5.75. A quarterly cash dividend of $0.8275 per share was declared, scheduled for payment in June, reflecting an 8.2% increase from the previous dividend. In February, the company also issued $800 million in 5.250% senior notes set to mature in 2035. Revenue for the quarter ended March 2025 was $1.14 billion, compared to $1.01 billion a year earlier. In the second quarter of 2025, American Water reported net income of $289 million, or $1.48 per share, compared with $277 million, or $1.42 per share, in the same period of 2024. Revenue increased to $1.28 billion from $1.15 billion, with the change attributed to its regulated businesses division. The company narrowed its 2025 earnings per share guidance to a range of $5.70 to $5.75, reaffirmed its long-term target of 7 to 9 percent annual growth in earnings and dividends, and declared a quarterly dividend of $0.83 per share. In July 2025, the company participated in the National Association of Regulatory Utility Commissioners (NARUC) Summer Policy Summit. In the third quarter of 2025, earnings were reported at $1.94 per share, up from $1.80 per share during the same period in 2024. The company affirmed long-term targets and 2025 EPS guidance, and initiates 2026 EPS guidance, reflecting growth of 8%, projecting a range of $6.02 to $6.12. The company also affirmed long-term targets, including long-term EPS and dividend per share compounded annual growth rates (CAGRs) of 7 to 9% and announced 2026-2030 capital plan of $19 to $20 billion and 2026-2035 capital plan of $46 to $48 billion. Acquisitions and mergers American Water Works In July 2025, the company announced an agreement to acquire Nexus Water Group, which operates in eight states and has about 87,000 customer connections under agreement. In October 2025, the company agreed to acquire Essential Utilities in an all-stock merger, creating a combined company valued at $63 billion, including debt. Upon completion of the deal, expected in early 2027, American Water shareholders would own about 69% of the combined company, with Essential shareholders owning the remainder. California American Water In July 2017, California American Water acquired the Oxbow Marina Mutual Water Company in Sacramento. In February 2020, the company acquired the operating assets of Fruitridge Vista Water Company, becoming the water provider for approximately 4,800 customers. In September 2021, the company acquired East Pasadena Water Co., a family-owned utility serving homes and businesses in Pasadena. In September 2022, the company acquired Warring Water Services, Inc., a privately owned water utility in Piru, California, for $4.6 million. In February 2025, the company completed its acquisition of the West San Martin Water Works system assets for $1.6 million. In May 2025, the company acquired the Mesa Del Sol water system in the Corral de Tierra area of Salinas. In August 2025, the company completed its acquisition of the Bass Lake Water Company system. Illinois American Water In July 2017, Illinois American Water acquired the Forest Homes–Maple Park Public Water District. In September 2017, the company acquired the Piasa Township Sanitary District. In November 2019, the company acquired the Village of Godfrey's wastewater system, adding approximately 6,200 wastewater customers to its Southern Illinois service area. In October 2020, the company acquired the City of Jerseyville's water and wastewater systems for $43.25 million. In December 2022, the company acquired the water distribution assets of the City of Rosiclare, Illinois, for $2.7 million. Indiana American Water In November 2017, Indiana American Water acquired Georgetown Water, a municipal water utility in southern Indiana. In December 2018, the company announced the acquisition of the Town of Sheridan's water and wastewater systems in central Indiana. Iowa American Water In November 2022, Iowa American Water acquired the City of Blue Grass wastewater system for $2 million. Maryland American Water In October 2024, Maryland American Water received approval from the Maryland Public Service Commission to acquire the drinking water assets of the Severn Water Company for about $1.6 million. Missouri American Water In August 2022, Missouri American Water completed the acquisition of the City of Eureka's water and wastewater systems, serving approximately 4,000 water customers and 4,000 wastewater customers. New Jersey American Water In February 2022, New Jersey American Water acquired the wastewater collection system of the Borough of Bound Brook for $5 million. In June 2023, the company completed the acquisition of the water and wastewater systems of Egg Harbor City, New Jersey, for $21.8 million. In October 2023, the company acquired the Borough of Somerville's wastewater collection system for $7 million. In June 2024, the company completed the acquisition of Salem City's water and wastewater systems for $18 million. In November 2024, the company signed an agreement to acquire the Manville Sewer System for $6.5 million. In March 2025, the company signed an agreement to acquire the South Orange Village water system for $19.7 million. In April 2025, the company acquired the Alfred Vail Mutual Association water system in Shrewsbury Township. In October 2025, the company agreed to acquire the Camden-based Gordon's Corner Water Co., a privately owned water company serving approximately 15,000 customers in parts of Colts Neck, Manalapan, and Marlboro Townships. Pennsylvania American Water In October 2016, Pennsylvania American Water completed the acquisition of New Cumberland's wastewater system. In October 2019, the company acquired the water assets of the Steelton Borough Authority. In November 2021, the company acquired the water and wastewater system assets of Valley Township, Chester County. In May 2022, the company acquired the wastewater system assets for the City of York for $235.3 million. In June 2022, the company completed the acquisition of the wastewater system assets of Upper Pottsgrove Township, Montgomery County. In September 2023, the company reached an agreement to acquire Appalachian Utilities, Inc. In the same year, the company acquired Audubon Water Company for $8 million. In October 2024, the company completed the purchase of the Butler Area Sewer Authority wastewater system for $230 million. In November 2024, the company completed the acquisition of the Farmington Township water and wastewater system in Clarion County. In June 2025, the company completed the acquisition of Manwalamink Water and Sewer Company's water and wastewater systems. In the same month, the company signed an agreement to acquire the City of Pittston's wastewater collection system for $26.4 million. On July 1, 2025, the company entered into agreements to acquire the Indian Creek Valley Water Authority and the Sutersville-Sewickley Municipal Sewage Authority for a combined $36.05 million, involving approximately 2,700 water connections and 500 wastewater connections. Virginia American Water In May 2013, Virginia American Water signed an agreement to acquire Dale Service Corporation, a wastewater utility serving Dale City. In August 2023, the company completed the acquisition of the water systems owned and operated by E.L. Goddard, Inc. for $375,000. In April 2024, the company completed the acquisition of the Town of Cape Charles, Virginia's drinking water and wastewater system assets for $15 million. West Virginia American Water In September 2008, West Virginia American Water completed the acquisition of the Fayetteville water and wastewater systems. In July 2022, the company acquired Jefferson Utilities for $30 million. Recent significant acquisitions by State: MO = 8 IL, NJ, WV = 3 each IA, IN = 2 each PA, VA = 1 each In October 2024, American Water completed five acquisitions across Illinois, New Jersey, and Virginia, adding approximately 33,400 customer connections. Additionally, the company has agreements in place for 22 acquisitions in eight states—California, Indiana, Illinois, Maryland, Missouri, New Jersey, Pennsylvania, and West Virginia—which are expected to add about 43,400 customer connections upon completion. Utilities The company owns 80 surface water treatment plants, 520 groundwater treatment plants, 190 wastewater treatment plants, 54,500 miles of pipes, 1,200 groundwater wells, 1,800 water and wastewater pumping stations, 1,100 treated water storage facilities, and 75 dams. The company serves 14 million people with regulated operations in 14 states and on 18 military installations. Services provided by American Water's utilities are subject to regulation by multiple state utility commissions or other entities engaged in utility regulation. Federal, state and local governments also regulate environmental, health and safety, and water quality and water accountability matters. Awards 2024 American Water Ranks No. 1 in Utilities Industry on Forbes American's Best Large Employers 2024 List American Water has been included in the top 10% of America's Most JUST Companies by JUST Capital and CNBC 2024 Military Friendly Employers 2023 Disability Equality Index® (DEI) - Top Scoring Company for 5th consecutive year Newsweek's 2023 list of America's Most Responsible Companies #94 Recognized as a 2023 Member of the Bloomberg Gender Equality Index - 5th straight year American Water received the 2023 WaterSense Excellence Award from the U.S. Environmental Protection Agency in October and ranked 18 on the Barron's 100 Most Sustainable U.S. Companies 2023 list. Financials"
}