{
  "ticker": "AXON",
  "cik": "0001069183",
  "company_name": "Axon Enterprise",
  "corrected_name": "Axon Enterprise",
  "wiki_title_used": "Axon Enterprise",
  "exists": true,
  "raw_text": "Axon Enterprise, Inc. (formerly TASER International) is an American company based in Scottsdale, Arizona, that develops weapons and technology products for military, law enforcement, and civilians.\nIts initial product and former namesake is the Taser, a line of electroshock weapons. The company has since diversified into technology products for military and law enforcement, including body-worn cameras, dashcams, computer-aided dispatch software, and Evidence.com, a cloud-based digital evidence platform. As of 2017, body-worn cameras and associated services comprised a quarter of Axon's overall business.\n\nHistory\nIn 1969, NASA researcher Jack Cover began to develop a non-lethal electric weapon to help police officers control suspects, as an alternative to firearms. By 1974, Cover had completed the device, which he named the \"Tom Swift Electric Rifle\" (TSER), referencing the 1911 novel Tom Swift and his Electric Rifle; to make it easier to pronounce as a word, Cover later added an \"A\" to the acronym to form \"TASER\". The Taser Public Defender used gunpowder as its propellant, which led the Bureau of Alcohol, Tobacco and Firearms to classify it as a firearm in 1976, a decision that limited sales. In 1980, the Los Angeles Police Department conducted a successful field test of an improved version (having reconsidered its earlier rejections of the technology after the shooting of Eula Love). Still, the device remained commercially unsuccessful and Cover's company, Taser Systems Inc., collapsed.\nIn 1993, Rick and Tom Smith (CEO Set Jet) formed AIR TASER, Inc. to, with Cover, design a version of the device that would use compressed nitrogen instead of gunpowder as a propellant. During development, the company faced competition from another vendor, Tasertron, whose product had become associated with its alleged ineffectiveness during the police confrontation of Rodney King.\nAfter nearly going bankrupt marketing other products such as an electroshock-based anti-theft system for automobiles known as \"Auto Taser\" in 1997, the company, later renamed TASER International, introduced its TASER M26 weapon in 1999. With a $6.8 million deficit in 2001, TASER International took steps to improve sales by offering to pay police officers to train others on how to use their products; this marketing technique helped enhance the company's market share, reaching $24.5 million in net sales by 2003, and nearly $68 million in 2004.  In May 2001, it filed for an initial public offering and began trading on NASDAQ under the stock symbol TASR.\nThe company also took significant action against competitors, acquiring the aforementioned Tasertron, and aggressively defending its patents. Patent lawsuits by TASER International led to the shutdown of Stinger Systems and its successor company, Karbon Arms; Robert Gruder founded both companies. Despite the controversies that have centered around the products (including deaths attributed to taser usage), the company maintained its dominant market position.\n\nPivot to bodycams and law enforcement technology\nIn 2005, TASER International began to offer an accessory for its taser products, TASER Cam, which added a grip-mounted camera that activated automatically when the safety was disengaged. By October 2010, at least 45,000 TASER Cams had been sold.\nIn 2008, the company unveiled its first body-worn camera, the Axon Pro. It was designed to be head-mounted, and upload footage for online storage on a web-based service known as Evidence.com. TASER's CEO Rick Smith explained that the products were designed to \"help provide revolutionary digital evidence collection, storage and retrieval for law enforcement\". The company piloted Axon Pro in various small cities and towns. In 2009, after prosecutor Daniel Shue exonerated Fort Smith police officer Brandon Davis based on footage from an Axon Pro camera, both Davis and Shue began to provide testimonials for the product in its marketing.\nEspecially in the wake of the Michael Brown shooting, the company's body-worn camera business saw significant growth. Smith argued that the company was \"not just about weapons, but about providing transparency and solving related data problems.\"  In April 2013, the Rialto Police Department released the results of a 12-month study on the impact of on-officer video using Axon Flex cameras. The study found an 88% drop in complaints filed against officers and nearly a 60% reduction in officer use-of-force incidents.\nTASER opened an office in Seattle in 2013, and a foreign office in Amsterdam, Netherlands in May 2014. In June 2015, the company announced the formation of a new Seattle-based division known as Axon, which would encompass the company's technology businesses, including body-worn cameras, digital evidence management, and analytics. Rick Smith explained that the branch was inspired by Microsoft's use of the Xbox brand to branch into entertainment businesses, stating that \"Axon was the name that we used for selling cameras historically, but we realized that brand had the room to grow and encompass all of our connected technologies.\" The Taser brand would still be used for the company's weapons products.\nOn April 5, 2017, TASER rebranded as Axon to reflect its expanded business. The company also announced an intent to offer free one-year trials of its body-worn camera products and Evidence.com services to U.S. law enforcement agencies. While the Taser product line still contributes to a significant portion of its revenue, the company's technologies business had seen major gains. As of 2017, they comprised a quarter of the company's business, while Axon cameras had a market share of 85% among police departments in the United States' major cities. The rebranding was also intended to help distance the company from the negative stigma surrounding the Taser brand, with Smith acknowledging that they were \"a bit of a distraction\" when recruiting employees for its technology business.\nIn May 2018, Axon acquired competitor VieVu for $4.6 million in cash and $2.5 million in common stock.\nIn 2022, an Ontario police officer was shot and killed with an Axon body-worn camera recording the death. This was the first case of a Canadian police officer being fatally shot while wearing a body camera.\nAxon's cloud services division accounts for 40% of the company's 2024 revenue.\nIn November 2025, Axon agreed to acquire Carbyne for $625 million in cash, intending to integrate Carbyne's AI-powered 911 technology into Axon's public safety ecosystem to enhance connected response capabilities.\n\nHardware\nTaser\nBody-worn cameras\nAxon Pro\nTaser's original body-worn camera, the Axon Pro, was introduced in 2009. The camera consists of three components, a head-mounted camera, a controller, and a monitor to review video recordings.\n\nSecond-generation models\nThe second generation of Axon body-worn cameras were simpler in form and function than the Axon Pro, removing the bulky monitor in favor of mobile phone integration. Many of the features introduced in these cameras, such as the pre-event buffer, a method of capturing video from before the record button was pressed, have become common requirements in body-worn camera requests for proposal. The Axon Flex and Body only record standard definition video.\n\nAxon Flex: Released in 2012, a point-of-view camera. The Flex camera system consists of a camera attached to an external battery pack / controller. In contrast to the Axon Pro, the Axon Flex lacks a screen for video playback. Instead, Axon offers a mobile application (Axon View) that connects to the camera using Bluetooth. Like the previous model, Axon Flex videos are stored in Evidence.com, Axon's cloud-hosted evidence management system. The camera features multiple mounting options, including a mount for Oakley, Inc.'s Flak Jacket eyewear, in addition to collar, epaulette, ball cap, and helmet mounts.\nAxon Body: Released in 2013, a single unit camera similar in function to the Axon Flex. It features a wider field of view than the Flex, and also has simpler mounting options than the two-piece Flex. Although simpler, the body mount prevents the camera from tracking where an officer is looking.\n\nThird-generation models\nAxon Body 2: Announced in 2015, features an Ambarella system-on-chip (SoC) video processor, 1080p (FHD) video, wireless activation, and other improvements over the original Body.\nAxon Flex 2: Announced in 2016, features a point-of-view camera attached to an external battery pack, similar to its predecessor.  Features high-definition video, improved 120° field of view, and other improvements over the original model.\nAxon Body 3: Announced in 2019, features enhanced low-light performance, motion blur correction, a display screen, and AES 128 bit encryption. Also features an LTE connection that enables real-time features like live streaming, as well as wireless activation.\nAxon Body 4: Announced in 2023, features a 1440p (QHD) camera, improved 160° field of view, added solid-state video storage, AES 256 bit encryption and improved battery life. An optional plug and play camera module similar to the Flex 2 can be installed, recording alongside the main camera.\n\nOther cameras\nIn addition to body-worn cameras, Axon also offers interview room and in-car video systems, known as Axon Interview and Axon Fleet respectively. These systems, like the body-worn cameras, integrate with the Evidence.com service.\nIn April 2025, Axon announced it would begin offering pole-mounted automated license-plate reader (ALPR) systems, as well as a method for retrofitting streetlights with similar technology.\n\nSoftware\nEvidence.com\nEvidence.com is a cloud-based digital evidence management system that allows law enforcement agencies to manage, review, and share digital evidence, particularly video evidence captured with Axon-branded cameras. It includes an automated redaction tool, audit trails for chain of custody purposes, and integrated evidence sharing features. A free application is offered specifically for prosecutors to receive and manage digital evidence.\n\nDraft One\nDraft One is a generative AI product that is intended to assist with the production of traditional written police reports. It uses an officer's body-worn audio recording to produce a transcript and summary of a reportable incident. Its use by police is opposed by the Electronic Frontier Foundation.\n\nEvidence Sync\nEvidence Sync is a desktop application that allows users to review and upload evidence from hardware devices and local files. It is also used to upload logs from Taser weapons to Evidence.com. It can also be used in offline mode to directly access files.\n\nAxon mobile apps\nTwo mobile apps integrate with the Axon cameras and Evidence.com. Axon View can be paired with an Axon body-worn camera to review, tag, and stream videos from the camera. The app can give an officer instant replay and on the spot evidence. This evidence can be crucial for officers and prosecutors. A new feature they added was GPS tagging. Officers can automatically map video evidence with real-time tagging of metadata. Axon Capture is an app that can be used to capture audio, photo, and video evidence and upload it to Evidence.com using an officer's mobile phone.\n\nAxon Signal\nAxon Signal is a range of products that are designed to automatically trigger recordings on Axon cameras in response to certain events, such as Signal Vehicle (which can trigger after the opening of doors or activation of sirens), Signal Performance Power Magazine (a successor to the TASER Cam accessory that triggers recordings when a Taser is armed), and Signal Sidearm (a sensor for handgun holsters which triggers recording when the gun is removed).\n\nAxon Citizen\nAxon Citizen is a cloud-based software solution that allows non-law enforcement personnel to share and upload information, including photos and video, directly to a law enforcement agency. Agencies are able to send links to any user, allowing them to upload evidence remotely. This functionality is supported by Axon's Evidence.com evidence management system. The product is described as incident-based system that seeks to \"structure\" and \"streamline\" the collection of crowd-sourced evidence.\n\nIncidents and concerns\nAxon has been identified as a chief proponent of the controversial diagnosis of excited delirium for the panicked stages of hypoxia, a cause of death that is seen only in people restrained by law enforcement, often after having been Tasered, and is widely thought to be a cover for positional asphyxia.\nThe company has noted that it has lost two product liability lawsuits:\n\nThis lawsuit represents the fifty-ninth (59th) wrongful death or injury lawsuit that has been dismissed or judgment entered in favor of TASER International. This number includes a small number of police officer training injury lawsuits that were settled and dismissed in cases where the settlement economics to TASER International were significantly less than the cost of litigation. One of these cases is that on Feb. 15, 2006, one officer Officer accidentally discharged TASER device on his daughter. TASER International has lost two product liability lawsuits.\nOn June 6, 2008, the company lost its first product-liability suit. The damages were reduced in the Court of Appeals in 2011.\nTASER lost its second product liability suit.\nIn 2007, Polish immigrant Robert Dziekański died in custody at the Vancouver International Airport after Royal Canadian Mounted Police (RCMP) officers used a Taser on him multiple times. A provincial inquiry found the use to be unjustified, and in 2013, the British Columbia Coroners Service ruled the death to be a homicide—citing a heart attack caused by the repeated jolts as cause of death. The incident provoked inquiries into law enforcement taser use in Canada.\nIn 2008, CBC News found that TASER X26 models manufactured before 2005 had a faulty fail-safe system.\nIn 2015, it was discovered that several TASER International employees had review bombed listings on Amazon and iTunes Store for Killing Them Safely, a documentary film by Nick Berardini which documented and investigated major incidents that resulted from taser usage.\nIn January 2016, TASER International was sued by Digital Ally for infringing its two U.S. patents on the automatic activation of law enforcement body-worn cameras. TASER International called the suit \"frivolous and egregious\".\nIn 2017, a California criminal defense lawyer noted that the Evidence.com terms of service gives the company a \"non-exclusive, transferable, irrevocable, royalty-free, sub-licensable, worldwide license\" to use photos and videos uploaded by its users, which may violate California privacy law, especially in regards to data involving juveniles.\nIn January 2020, the Federal Trade Commission (FTC) sued Axon to block its acquisition of VieVu, alleging that it would reduce competition in a concentrated market. Axon responded by suing the FTC, claiming that the structure of the FTC was unconstitutional in Axon Enterprise, Inc. v. Federal Trade Commission. In 2023, the FTC withdrew its complaint against Axon.\nIn June 2022, after Axon proposed a plan for taser-armed drones to stop school shootings, Axon's institutional review board expressed disagreement with the plan and issued a unanimous statement of concern. Nine members of the board resigned.\nIn November 2023, three US cities filed a proposed class action antitrust lawsuit against Axon, alleging that the company engaged in anticompetitive conduct and abused its market power by forcing cities to pay inflated prices for body cameras.\n\nNotes\nReferences\nAnglen, Robert. \"Taser tied to 'independent' study that backs stun gun.\" The Arizona Republic. May 21, 2005. [1]\nJohnson, Kevin. \"Taser contributes to police families.\" USA Today. April 24, 2005. [2]\n\"Taser research marred by conflicts.\" Vermont Huardian. May 23, 2005. [3]\nFrosch, Dan. \"Ex-Albuquerque Police Chief Accused of Violating Ethics Laws in Auditor’s Report\" The Wall Street Journal. April 30, 2015. [4]\n\nExternal links\nOfficial website\nBusiness data for Axon Enterprise, Inc.:",
  "clean_text": "Axon Enterprise, Inc. (formerly TASER International) is an American company based in Scottsdale, Arizona, that develops weapons and technology products for military, law enforcement, and civilians. Its initial product and former namesake is the Taser, a line of electroshock weapons. The company has since diversified into technology products for military and law enforcement, including body-worn cameras, dashcams, computer-aided dispatch software, and Evidence.com, a cloud-based digital evidence platform. As of 2017, body-worn cameras and associated services comprised a quarter of Axon's overall business. History In 1969, NASA researcher Jack Cover began to develop a non-lethal electric weapon to help police officers control suspects, as an alternative to firearms. By 1974, Cover had completed the device, which he named the \"Tom Swift Electric Rifle\" (TSER), referencing the 1911 novel Tom Swift and his Electric Rifle; to make it easier to pronounce as a word, Cover later added an \"A\" to the acronym to form \"TASER\". The Taser Public Defender used gunpowder as its propellant, which led the Bureau of Alcohol, Tobacco and Firearms to classify it as a firearm in 1976, a decision that limited sales. In 1980, the Los Angeles Police Department conducted a successful field test of an improved version (having reconsidered its earlier rejections of the technology after the shooting of Eula Love). Still, the device remained commercially unsuccessful and Cover's company, Taser Systems Inc., collapsed. In 1993, Rick and Tom Smith (CEO Set Jet) formed AIR TASER, Inc. to, with Cover, design a version of the device that would use compressed nitrogen instead of gunpowder as a propellant. During development, the company faced competition from another vendor, Tasertron, whose product had become associated with its alleged ineffectiveness during the police confrontation of Rodney King. After nearly going bankrupt marketing other products such as an electroshock-based anti-theft system for automobiles known as \"Auto Taser\" in 1997, the company, later renamed TASER International, introduced its TASER M26 weapon in 1999. With a $6.8 million deficit in 2001, TASER International took steps to improve sales by offering to pay police officers to train others on how to use their products; this marketing technique helped enhance the company's market share, reaching $24.5 million in net sales by 2003, and nearly $68 million in 2004. In May 2001, it filed for an initial public offering and began trading on NASDAQ under the stock symbol TASR. The company also took significant action against competitors, acquiring the aforementioned Tasertron, and aggressively defending its patents. Patent lawsuits by TASER International led to the shutdown of Stinger Systems and its successor company, Karbon Arms; Robert Gruder founded both companies. Despite the controversies that have centered around the products (including deaths attributed to taser usage), the company maintained its dominant market position. Pivot to bodycams and law enforcement technology In 2005, TASER International began to offer an accessory for its taser products, TASER Cam, which added a grip-mounted camera that activated automatically when the safety was disengaged. By October 2010, at least 45,000 TASER Cams had been sold. In 2008, the company unveiled its first body-worn camera, the Axon Pro. It was designed to be head-mounted, and upload footage for online storage on a web-based service known as Evidence.com. TASER's CEO Rick Smith explained that the products were designed to \"help provide revolutionary digital evidence collection, storage and retrieval for law enforcement\". The company piloted Axon Pro in various small cities and towns. In 2009, after prosecutor Daniel Shue exonerated Fort Smith police officer Brandon Davis based on footage from an Axon Pro camera, both Davis and Shue began to provide testimonials for the product in its marketing. Especially in the wake of the Michael Brown shooting, the company's body-worn camera business saw significant growth. Smith argued that the company was \"not just about weapons, but about providing transparency and solving related data problems.\" In April 2013, the Rialto Police Department released the results of a 12-month study on the impact of on-officer video using Axon Flex cameras. The study found an 88% drop in complaints filed against officers and nearly a 60% reduction in officer use-of-force incidents. TASER opened an office in Seattle in 2013, and a foreign office in Amsterdam, Netherlands in May 2014. In June 2015, the company announced the formation of a new Seattle-based division known as Axon, which would encompass the company's technology businesses, including body-worn cameras, digital evidence management, and analytics. Rick Smith explained that the branch was inspired by Microsoft's use of the Xbox brand to branch into entertainment businesses, stating that \"Axon was the name that we used for selling cameras historically, but we realized that brand had the room to grow and encompass all of our connected technologies.\" The Taser brand would still be used for the company's weapons products. On April 5, 2017, TASER rebranded as Axon to reflect its expanded business. The company also announced an intent to offer free one-year trials of its body-worn camera products and Evidence.com services to U.S. law enforcement agencies. While the Taser product line still contributes to a significant portion of its revenue, the company's technologies business had seen major gains. As of 2017, they comprised a quarter of the company's business, while Axon cameras had a market share of 85% among police departments in the United States' major cities. The rebranding was also intended to help distance the company from the negative stigma surrounding the Taser brand, with Smith acknowledging that they were \"a bit of a distraction\" when recruiting employees for its technology business. In May 2018, Axon acquired competitor VieVu for $4.6 million in cash and $2.5 million in common stock. In 2022, an Ontario police officer was shot and killed with an Axon body-worn camera recording the death. This was the first case of a Canadian police officer being fatally shot while wearing a body camera. Axon's cloud services division accounts for 40% of the company's 2024 revenue. In November 2025, Axon agreed to acquire Carbyne for $625 million in cash, intending to integrate Carbyne's AI-powered 911 technology into Axon's public safety ecosystem to enhance connected response capabilities. Hardware Taser Body-worn cameras Axon Pro Taser's original body-worn camera, the Axon Pro, was introduced in 2009. The camera consists of three components, a head-mounted camera, a controller, and a monitor to review video recordings. Second-generation models The second generation of Axon body-worn cameras were simpler in form and function than the Axon Pro, removing the bulky monitor in favor of mobile phone integration. Many of the features introduced in these cameras, such as the pre-event buffer, a method of capturing video from before the record button was pressed, have become common requirements in body-worn camera requests for proposal. The Axon Flex and Body only record standard definition video. Axon Flex: Released in 2012, a point-of-view camera. The Flex camera system consists of a camera attached to an external battery pack / controller. In contrast to the Axon Pro, the Axon Flex lacks a screen for video playback. Instead, Axon offers a mobile application (Axon View) that connects to the camera using Bluetooth. Like the previous model, Axon Flex videos are stored in Evidence.com, Axon's cloud-hosted evidence management system. The camera features multiple mounting options, including a mount for Oakley, Inc.'s Flak Jacket eyewear, in addition to collar, epaulette, ball cap, and helmet mounts. Axon Body: Released in 2013, a single unit camera similar in function to the Axon Flex. It features a wider field of view than the Flex, and also has simpler mounting options than the two-piece Flex. Although simpler, the body mount prevents the camera from tracking where an officer is looking. Third-generation models Axon Body 2: Announced in 2015, features an Ambarella system-on-chip (SoC) video processor, 1080p (FHD) video, wireless activation, and other improvements over the original Body. Axon Flex 2: Announced in 2016, features a point-of-view camera attached to an external battery pack, similar to its predecessor. Features high-definition video, improved 120° field of view, and other improvements over the original model. Axon Body 3: Announced in 2019, features enhanced low-light performance, motion blur correction, a display screen, and AES 128 bit encryption. Also features an LTE connection that enables real-time features like live streaming, as well as wireless activation. Axon Body 4: Announced in 2023, features a 1440p (QHD) camera, improved 160° field of view, added solid-state video storage, AES 256 bit encryption and improved battery life. An optional plug and play camera module similar to the Flex 2 can be installed, recording alongside the main camera. Other cameras In addition to body-worn cameras, Axon also offers interview room and in-car video systems, known as Axon Interview and Axon Fleet respectively. These systems, like the body-worn cameras, integrate with the Evidence.com service. In April 2025, Axon announced it would begin offering pole-mounted automated license-plate reader (ALPR) systems, as well as a method for retrofitting streetlights with similar technology. Software Evidence.com Evidence.com is a cloud-based digital evidence management system that allows law enforcement agencies to manage, review, and share digital evidence, particularly video evidence captured with Axon-branded cameras. It includes an automated redaction tool, audit trails for chain of custody purposes, and integrated evidence sharing features. A free application is offered specifically for prosecutors to receive and manage digital evidence. Draft One Draft One is a generative AI product that is intended to assist with the production of traditional written police reports. It uses an officer's body-worn audio recording to produce a transcript and summary of a reportable incident. Its use by police is opposed by the Electronic Frontier Foundation. Evidence Sync Evidence Sync is a desktop application that allows users to review and upload evidence from hardware devices and local files. It is also used to upload logs from Taser weapons to Evidence.com. It can also be used in offline mode to directly access files. Axon mobile apps Two mobile apps integrate with the Axon cameras and Evidence.com. Axon View can be paired with an Axon body-worn camera to review, tag, and stream videos from the camera. The app can give an officer instant replay and on the spot evidence. This evidence can be crucial for officers and prosecutors. A new feature they added was GPS tagging. Officers can automatically map video evidence with real-time tagging of metadata. Axon Capture is an app that can be used to capture audio, photo, and video evidence and upload it to Evidence.com using an officer's mobile phone. Axon Signal Axon Signal is a range of products that are designed to automatically trigger recordings on Axon cameras in response to certain events, such as Signal Vehicle (which can trigger after the opening of doors or activation of sirens), Signal Performance Power Magazine (a successor to the TASER Cam accessory that triggers recordings when a Taser is armed), and Signal Sidearm (a sensor for handgun holsters which triggers recording when the gun is removed). Axon Citizen Axon Citizen is a cloud-based software solution that allows non-law enforcement personnel to share and upload information, including photos and video, directly to a law enforcement agency. Agencies are able to send links to any user, allowing them to upload evidence remotely. This functionality is supported by Axon's Evidence.com evidence management system. The product is described as incident-based system that seeks to \"structure\" and \"streamline\" the collection of crowd-sourced evidence. Incidents and concerns Axon has been identified as a chief proponent of the controversial diagnosis of excited delirium for the panicked stages of hypoxia, a cause of death that is seen only in people restrained by law enforcement, often after having been Tasered, and is widely thought to be a cover for positional asphyxia. The company has noted that it has lost two product liability lawsuits: This lawsuit represents the fifty-ninth (59th) wrongful death or injury lawsuit that has been dismissed or judgment entered in favor of TASER International. This number includes a small number of police officer training injury lawsuits that were settled and dismissed in cases where the settlement economics to TASER International were significantly less than the cost of litigation. One of these cases is that on Feb. 15, 2006, one officer Officer accidentally discharged TASER device on his daughter. TASER International has lost two product liability lawsuits. On June 6, 2008, the company lost its first product-liability suit. The damages were reduced in the Court of Appeals in 2011. TASER lost its second product liability suit. In 2007, Polish immigrant Robert Dziekański died in custody at the Vancouver International Airport after Royal Canadian Mounted Police (RCMP) officers used a Taser on him multiple times. A provincial inquiry found the use to be unjustified, and in 2013, the British Columbia Coroners Service ruled the death to be a homicide—citing a heart attack caused by the repeated jolts as cause of death. The incident provoked inquiries into law enforcement taser use in Canada. In 2008, CBC News found that TASER X26 models manufactured before 2005 had a faulty fail-safe system. In 2015, it was discovered that several TASER International employees had review bombed listings on Amazon and iTunes Store for Killing Them Safely, a documentary film by Nick Berardini which documented and investigated major incidents that resulted from taser usage. In January 2016, TASER International was sued by Digital Ally for infringing its two U.S. patents on the automatic activation of law enforcement body-worn cameras. TASER International called the suit \"frivolous and egregious\". In 2017, a California criminal defense lawyer noted that the Evidence.com terms of service gives the company a \"non-exclusive, transferable, irrevocable, royalty-free, sub-licensable, worldwide license\" to use photos and videos uploaded by its users, which may violate California privacy law, especially in regards to data involving juveniles. In January 2020, the Federal Trade Commission (FTC) sued Axon to block its acquisition of VieVu, alleging that it would reduce competition in a concentrated market. Axon responded by suing the FTC, claiming that the structure of the FTC was unconstitutional in Axon Enterprise, Inc. v. Federal Trade Commission. In 2023, the FTC withdrew its complaint against Axon. In June 2022, after Axon proposed a plan for taser-armed drones to stop school shootings, Axon's institutional review board expressed disagreement with the plan and issued a unanimous statement of concern. Nine members of the board resigned. In November 2023, three US cities filed a proposed class action antitrust lawsuit against Axon, alleging that the company engaged in anticompetitive conduct and abused its market power by forcing cities to pay inflated prices for body cameras. Notes"
}