{
  "ticker": "AXP",
  "cik": "0000004962",
  "company_name": "American Express",
  "corrected_name": "American Express",
  "wiki_title_used": "American Express",
  "exists": true,
  "raw_text": "American Express Company or Amex is an American bank holding company and multinational financial services corporation that specializes in payment cards. It is headquartered at 200 Vesey Street, also known as American Express Tower, in the Battery Park City neighborhood of Lower Manhattan.\nAmex is the fourth-largest card network globally based on purchase volume, behind China UnionPay, Visa, and Mastercard. 141.2 million Amex cards were in force worldwide as of December 31, 2023, with an average annual spend per card member of US$24,059. That year, Amex handled over $1.7 trillion in purchase volume on its network. Amex is the 16th largest US bank, with a total of US$270 billion in assets or 1.1% of all assets insured by the FDIC. It is ranked 58th on the Fortune 500 and 28th on the list of the most valuable brands by Forbes. In 2023, it was ranked 63rd in the Forbes Global 2000. American Express National Bank is a direct bank owned by Amex.\nFounded in 1850 as a freight forwarding company, Amex introduced financial and travel services during the early 1900s. It developed its first paper charge card in 1958, gold card in 1966, green card in 1969, platinum card in 1984, and Centurion Card in 1999. The \"Don't Leave Home Without It\" advertising campaign was introduced in 1975 and renewed in 2005. In the 1980s, Amex acquired and then divested a stake in Shearson. In the 1990s, it stopped reducing interchange fees for merchants who exclusively accepted Amex cards and expanded market share through targeted marketing campaigns. Amex converted to a bank holding company during the 2008 financial crisis. Amex began operating airport lounges in 2013, offering access to certain cardholders.\nAmex had a 9% worldwide market share by transaction volume in 2023. While American Express credit cards are accepted at 99% of U.S. merchants that accept credit cards (Costco being a notable exception), they are much less accepted in Europe and Asia. American Express offers various types of cards including travel and dining cards, everyday spending points cards, and cash back cards. Each category has several card options with different benefits and reward structures. High-profile cards like the Green, Gold, and Platinum cards cater to frequent travelers and diners with perks tailored to these activities.\n\nHistory\nEarly history\nIn 1850, American Express was started as a freight forwarding company in Buffalo, New York. It was founded as a joint-stock corporation by the merger of the cash-in-transit companies owned by Henry Wells (Wells & Company), William G. Fargo (Livingston, Fargo & Company), and John Warren Butterfield (Wells, Butterfield & Company, the successor earlier in 1850 of Butterfield, Wasson & Company). Wells and Fargo also started Wells Fargo & Co. in 1852 when Butterfield and other directors objected to the proposal that American Express extend its operations to California.\n\nAmerican Express initially established its headquarters in a building at the intersection of Jay Street and Hudson Street in what was later called the Tribeca section of Manhattan. For years it enjoyed a virtual monopoly on the movement of express shipments (goods, securities, currency, etc.) throughout New York State. In 1874, American Express moved its headquarters to 65 Broadway in what was becoming the Financial District of Manhattan, a location it was to retain through two buildings. In 1854, the American Express Co. purchased a lot on Vesey Street in New York City as the site for its stables. The company's first New York headquarters was an 1858 marble Italianate palazzo at 55–61 Hudson Street, which had a busy freight depot on the ground story with a spur line from the Hudson River Railroad. A stable was constructed in 1867, five blocks north at 4–8 Hubert Street. The company prospered sufficiently that headquarters were moved in 1874 from the wholesale shipping district to the budding Financial District and into rented offices in two five-story brownstone commercial buildings at 63 and 65 Broadway that were owned by the Harmony family.\nIn 1880, American Express built a new warehouse behind the Broadway Building at 46 Trinity Place. The designer is unknown, but it has a façade of brick arches that are reminiscent of pre-skyscraper New York. American Express has long been out of this building, but it still bears a terracotta seal with the American Express Eagle. In 1890–91 the company constructed a new ten-story building by Edward H. Kendall on the site of its former headquarters on Hudson Street. By 1903, the company had assets of some $28 million, second only to the National City Bank of New York among financial institutions in the city. To reflect this, the company purchased the Broadway buildings and site.\nAt the end of the Wells–Fargo reign in 1914, an aggressive new president, George Chadbourne Taylor (1868–1923), who had worked his way up through the company over the previous thirty years, decided to build a new headquarters. The old buildings, dubbed by The New York Times as \"among the ancient landmarks\" of lower Broadway, were inadequate for such a rapidly expanding concern.\nAfter some delays due to the First World War, the 21-story neo-classical American Express Co. Building was constructed in 1916–17 to the design of J. Lawrence Aspinwall, of the firm of Renwick, Aspinwall & Tucker, the successor to the architectural practice of James Renwick Jr. The building consolidated the two lots of the former buildings with a single address: 65 Broadway. This building was part of the \"Express Row\" section of lower Broadway at the time. The building completed the continuous masonry wall of its block-front and assisted in transforming Broadway into the \"canyon\" of neo-classical masonry office towers familiar to this day. American Express sold this building in 1975, but retained travel services there. The building was also the headquarters over the years of other prominent firms, including investment bankers J.& W. Seligman & Co. (1940–74), the American Bureau of Shipping, a maritime concern (1977–86), and later J.J. Kenny, and Standard & Poor's, the latter of which renamed the building for itself.\n\nNational expansion\nAmerican Express extended its reach nationwide by arranging affiliations with other express companies (including Wells Fargo – the replacement for the two former companies that merged to form American Express), railroads, and steamship companies. In 1857, American Express started its expansion in the area of financial services by launching a money order business to compete with the United States Post Office's money orders. Sometime between 1888 and 1890, J. C. Fargo took a trip to Europe and returned frustrated and infuriated. Despite the fact that he was president of American Express and that he carried with him traditional letters of credit, he found it difficult to obtain cash anywhere except in major cities. Fargo went to Marcellus Flemming Berry and asked him to create a better solution than the letter of credit. Berry introduced the American Express Traveler's Cheque which was launched in 1891 in denominations of $10, $20, $50, and $100.\nTraveler's cheques established American Express as a truly international company. In 1914, at the onset of World War I, American Express in Europe was among the few companies to honor the letters of credit (issued by various banks) held by Americans in Europe, because other financial institutions refused to assist these stranded travelers. The British government appointed American Express its official agent at the beginning of World War I. They were to deliver letters, money, and relief parcels to British prisoners of war. Their employees went into camps to cash drafts for both British and French prisoners and arranged for them to receive money from home. By the end of the war they were delivering 150 tonnes of parcels per day to prisoners in six countries.\nIn 1915, American Express established a travel division and soon established its first travel agency. Albert K. Dawson was instrumental in expanding business operations overseas, even investing in tourist relations with the Soviet Union. During World War I, Dawson was a photographer and film correspondent with the German army.\n\nEnd of railroad express business\nAmerican Express was one of the monopolies that President Theodore Roosevelt had the Interstate Commerce Commission (ICC) investigate during his administration (1901–1909). The interest of the ICC was drawn to its strict control of the railroad express business. However, the solution did not come immediately to hand. The solution to this problem came as a coincidence to other problems during World War I. During the winter of 1917, the United States suffered a severe coal shortage and on December 26 President Woodrow Wilson commandeered the railroads on behalf of the United States government to move federal troops, their supplies, and coal. Treasury Secretary William Gibbs McAdoo was assigned the task of consolidating the railway lines for the war effort. All contracts between express companies and railroads were nullified and McAdoo proposed that all existing express companies be consolidated into a single company to serve the country's needs. This ended American Express's express business and removed them from the ICC's interest. The result was that a new company called the American Railway Express Agency formed in July 1918. The new entity took custody of all the pooled equipment and property of existing express companies (the largest share of which, 40%, came from American Express, who had owned the rights to the express business over 71,280 miles (114,710 km) of railroad lines, and had 10,000 offices, with over 30,000 employees).\n\n1920s–1970s\nAmerican Express executives discussed the possibility of launching a travel charge card as early as 1946, but it was not until Diners Club launched a card in March 1950, that American Express began to seriously consider the possibility. At the end of 1957, under American Express CEO Ralph Reed the company entered the business and by the launch date of October 1, 1958, public interest had become so significant that 250,000 cards were issued prior to the official launch date. The card was launched with an annual fee of $6, $1 higher than Diners Club, to be seen as a premium product. The first cards were made of paper, with the account number and card member's name typed. In 1959, American Express became the first company to issue embossed plastic cards.\nIn 1966, American Express introduced the Gold Card for \"big-spending members\".\nIn 1977, James D. Robinson III became chairman and CEO of the company.\nIn 1979, American Express acquired 50% of the cable subsidiary of Warner Communications, forming Warner-Amex Satellite Entertainment, for $175 million in cash and short-term notes. It owned two-thirds of Qube, an experimental two-way cable TV service, along with MTV, Nickelodeon, and The Movie Channel. The venture was unprofitable, and, in 1985, Amex sold its 50% interest to Viacom for $450 million.\n\n1980s and 1990s\nIn the 1980s, American Express embarked on an effort to become a financial services holding company and made several acquisitions, creating an investment banking arm. In mid-1981 it purchased Sanford I. Weill's Shearson Loeb Rhoades, the second-largest securities firm in the United States to form Shearson/American Express. Shearson Loeb Rhoades itself was the culmination of several mergers in the 1970s as Weill's Hayden, Stone & Co. merged with Shearson, Hammill & Co. in 1974, to form Shearson Hayden Stone. Shearson Hayden Stone then merged with Loeb, Rhoades, Hornblower & Co. (formerly Loeb, Rhoades & Co.) to form Shearson Loeb Rhoades in 1979. With capital totaling $250 million at the time of its acquisition, Shearson Loeb Rhoades was the second-largest brokerage firm, behind Merrill Lynch.\nAfter the purchase of Shearson, Weill was given the position of president of American Express in 1983. Weill grew increasingly unhappy with responsibilities within the company and his conflicts with CEO James D. Robinson III. Weill soon realized that he was not positioned to be named CEO and resigned in August 1985. In 1984, American Express acquired Lehman Brothers and added it to the Shearson family, creating Shearson Lehman/American Express. Lehman CEO and former trader Lewis Glucksman became CEO of Shearson Lehman/American Express. In 1984, Shearson/American Express acquired Investors Diversified Services (IDS), bringing with it a fleet of financial advisors and investment products. In 1988, Shearson Lehman acquired the E.F. Hutton & Co., a brokerage firm that was merged with the investment banking business. The investment banking arm was renamed Shearson Lehman Hutton, Inc.\nIn 1983, as part of Robinson's plan to expand into international banking of wealthy clients, Amex acquired Trade Development Bank of Geneva from Edmond Safra for US$550 million and Safra became a member of the board of directors of Amex. TDB executives were excluded from important company decisions and Safra unsuccessfully tried to repurchase the bank. Safra then opened a competing bank. In response, American Express launched an international smear campaign against Safra by inaccurately reporting to news and media outlets in that Safra was being investigated by the FBI for being involved in the Iran–Contra affair, along with drug trafficking and the mafia. All of the accusations were confirmed to be false and led to the resignation of Harry L. Freeman, public relations chief of American Express, after admitting to the entire scandal. In July 1989, American Express publicly apologized to Edmond Safra and donated $8 million to the charity of his choice. In 1990, American Express sold its Swiss banking operations to Compagnie de Banque et d'Investissements, which led to the creation of Union Bancaire Privée (UBP).\nIn 1984, Amex launched the Platinum Card, billed as an \"ultra-exclusive\" credit card with a $250 annual fee. It was offered by invitation only to American Express customers with at least two years of tenure, significant spending, and excellent payment history.\nIn 1987, American Express introduced the Optima card, its first credit card product that did not have to be paid in full at the end of the month.\nIn 1991, a group of restaurants in Boston, including some that were exclusive to Amex, stopped accepting American Express while accepting and encouraging the use of Visa and Mastercard. The rationale was due to far lower fees as compared to American Express' fees at the time (which were about 4% for each transaction versus around 1.2% for Visa and Mastercard). The revolt, known as the \"Boston Fee Party\" (alluding to the Boston Tea Party), spread to over 250 restaurants across the United States, including restaurants in other cities such as New York City, Chicago, and Los Angeles. Visa offered to pay the Fee Party's legal bills, and Discover Card was able to increase their acceptance among Boston restaurants by 375%. Kenneth Chenault, then head of Travel Related Services prior to becoming American Express CEO, cut fees to bring these restaurants back into the fold. American Express then shifted its focus from exclusivity to broadening acceptance, adding mainstream merchants like Walmart to the American Express network. American Express was, at the time, known for cutting its interchange fee to merchants and restaurants if they accepted only American Express and no other credit or charge cards. This prompted competitors such as Visa and Mastercard to file complaints as the tactics gave Amex exclusivity at restaurants. Capitalizing on this elitist image, American Express frequently mentioned such exclusive partnerships in its advertising. Aside from some holdouts including Neiman Marcus, which continued exclusivity until 2011, the practice largely ended in 1991.\nIn April 1992, American Express spun off First Data in an initial public offering.\nIn 1993, Harvey Golub became CEO of American Express. That year, American Express negotiated the sale of Shearson's retail brokerage and investment management business to Primerica. The Shearson business was merged with Primerica's Smith Barney to create Smith Barney Shearson.\nIn June 1994, American Express completed the spin-off of the remaining investment banking and institutional businesses as Lehman Brothers, ending its foray into the brokerage business.\nIn September 1994, the Optima True Grace card was introduced. The card was unique in that it offered a grace period on all purchases whether a balance was carried on the card or not, not charging interest on new purchases immediately for cards with unpaid balances. The card was discontinued a few years later.\nIn 1998, Amex launched the Blue credit card, targeted at young adults, in the UK after testing it in other countries. The card had a smart chip and users were encouraged to pay bills and get information via the company website. It launched in the US in 1999. A television media campaign for Blue adopted the 1979 UK Synthpop hit \"Cars\" by Gary Numan as its theme music.\nIn 1999, American Express introduced the high-fee Centurion Card, often referred to as the \"black card,\" which caters to an even more affluent customer segment. The card was initially available only to select users of the Platinum card. American Express created the card line amid rumors and urban legends in the 1980s that it produced an ultra-exclusive black card for elite users who could purchase anything with it.\n\n21st century\nIn December 2000, American Express agreed to acquire the $226 million credit card portfolio of Bank of Hawaii, then a division of Pacific Century Financial Corporation In January 2006, American Express sold its Bank of Hawaii card portfolio to Bank of America (MBNA).\nUntil 2004, Visa and Mastercard rules prohibited issuers of their cards from issuing American Express cards in the United States. This meant, as a practical matter, that U.S. banks could not issue American Express cards. These rules were struck down as a result of antitrust litigation brought by the United States Department of Justice. In January 2004, American Express reached a deal to have its cards issued by MBNA. Initially decried by Mastercard executives as nothing but an \"experiment\", the cards were issued beginning in October 2004. An agreement was reached regarding the acquisition of MBNA by Bank of America whereby Bank of America owned the customer loans and American Express processed the transactions. American Express dismissed Bank of America from its antitrust litigation against Visa, Mastercard, and other banks. The first card from the partnership, the Bank of America Rewards American Express card, was released on June 30, 2006.\n\nIn June 2005, American Express introduced ExpressPay, a contactless payment system based on wireless RFID. In July 2005, American Express issued the American Express Travelers Cheque Card, a stored-value card that serves the same purposes as a traveler's cheque, but can be used in stores like a credit card. Amex discontinued the card in October 2007.\nOn September 30, 2005, American Express completed the corporate spin-off of its American Express Financial Advisors unit, Ameriprise Financial, to its shareholders and RSM McGladrey acquired American Express Tax & Business Services (TBS).\nIn 2006, the UK division of American Express joined the Product Red coalition and issued a Red Card, donating with each purchase through The Global Fund to Fight AIDS, Tuberculosis and Malaria to help African women and children with HIV/AIDS, malaria, and other diseases.\nIn late 2007, the company announced the Plum Card for small business owners.\nIn March 2008, American Express acquired the Corporate Payment Services business of General Electric, which primarily focused on providing purchasing card solutions for large global clients, for $1.1 billion in cash. The transaction added V-Payment to its product portfolio. V-Payment enables a tightly controlled, single-use card number.\nIn March 2008, Standard Chartered Bank acquired American Express Bank Ltd, the international banking subsidiary of American Express for $823 million.\nOn November 10, 2008, during the 2008 financial crisis, the company received Federal Reserve System approval to convert to a bank holding company, making it eligible for government assistance under the Troubled Asset Relief Program (TARP). At that time, American Express had total consolidated assets of about $127 billion. In June 2009, $3.39 billion in TARP funds were repaid plus $74.4 million in dividend payments. In July 2009, the company ended its obligations under TARP by buying back $340 million in Treasury warrants. As part of the conversion, the company reduced or closed many business lines of credit.\nIn 2009, American Express introduced the ZYNC charge card, a white card targeting young adults. The card was later discontinued.\nIn November 2010, the UK division of American Express was cautioned by the Office of Fair Trading for the use of controversial charging orders against those in debt. The company was one of four companies who were allegedly encouraging customers to turn their unsecured credit card debts into a form of secured debt.\nIn November 2011, Neiman Marcus, which gave general-purpose card exclusivity to American Express since the 1980s, began accepting cards using the Visa and Mastercard payment networks. In 2011, Amex launched the Blue Cash Preferred Card credit card.\nIn October 2012, The Consumer Financial Protection Bureau (CFPB) required three American Express subsidiaries to refund an estimated $85 million to approximately 250,000 customers for illegal card practices between 2003 and 2012. Allegations included that American Express made misleading statements regarding signup bonuses, charged unlawful late fees, discriminated against applicants due to age, and failed to report consumer complaints to regulators. Also in October 2012, American Express and Walmart announced the launch of Bluebird, a prepaid debit card with roadside assistance and identity theft protection that can also be used as a substitute for a traditional transactional account whereby users can have payments deposited to the account and have insurance from the Federal Deposit Insurance Corporation.\nIn October 2013, Amex sold most of its publications: Travel + Leisure, Food & Wine, Executive Travel, Black Ink, and Departures magazines, to Time Inc. Time restructured the publications, which are now owned by Dotdash Meredith.\n\nIn 2013, the company opened its first airport lounge, offering access to certain cardmembers.\nIn March 2014, American Express announced the corporate spin-off its corporate travel business as American Express Global Business Travel and the sale of 50% of the business to an investor group led by Certares LP for $900 million.\nEffective in 2016 in the United States, and in 2015 in Canada, Costco ended its relationship with Amex that had provided co-branded Costco membership cards since 2004. The cards issued by Costco in the United States were an extension of an exclusive deal between Costco and American Express dating from 1999. Costco was the last major US merchant that accepted American Express cards exclusively. Costco's Canadian stores ended its exclusive deal with American Express in January 2015, in favor of one with Capital One and Mastercard. Citigroup became the exclusive issuer of Costco's credit cards and Visa replaced American Express as the exclusive credit card accepted at Costco's stores in the United States. All TrueEarnings card accounts and balances held by American Express were sold to Citigroup, and new Costco Anywhere Visa cards were sent to Costco members prior to the switch date. The Costco partnership represented 8%, or $80 billion, of American Express' billed business and about 20%, or about $14 billion, of its interest-bearing credit portfolio. The impact of losing the Costco card accounts was significant; in the first quarter without Costco cards, company profit dropped 10% and revenue dropped 5% compared to the previous year.\nOn March 1, 2017, ANZ announced that it was no longer issuing American Express cards, with them phased out entirely by August 5, 2017. In October 2017, American Express established a joint venture company, LianTong (连通), in China to operate its payment card brand locally. In June 2020, it obtained a local bank card clearing business license in China.\nIn a court case Ohio v. American Express Co. (2018), merchants filed a class action lawsuit against American Express and claimed that charging high fees to merchants is a violation of the Sherman Antitrust Act. According to the lawsuit, American Express charges significantly higher fees than other credit card providers. In January 2017, the 2nd U.S. Circuit Court of Appeals affirmed a lower court ruling that American Express could block merchants that accept its cards from steering customers to other cards, like those offered by Visa and Mastercard. In June 2018, the Supreme Court of the United States affirmed the 2nd Circuit's ruling.\nIn 2018, the Gold Card was converted to a credit card for UK residents, but remains a charge card in the US.\nIn March 2019, American Express acquired LoungeBuddy, a provider which offers pay-per-use access to select airport lounges worldwide. Also in March 2019, Amex reduced its presence in the European Union, due to changes to the EU's banking regulations. In July 2019, Amex acquired Acompay, a digital payment automation platform. In September 2019, Pedestrian Group acquired American Express Openair Cinemas, which facilitated outdoor showings of films at 10 locations in Australia and New Zealand and was operated by Fairfax Events.\nIn 2020, American Express acquired Kabbage. In June 2021, the company's first checking account for small businesses, Kabbage Checking, was launched. American Express also offers credit lines of $1,000 to $150,000 for small businesses, using Kabbage's automated underwriting software. In January 2023, the Kabbage brand was renamed American Express Business Blueprint.\nIn January 2021, the United States Department of the Treasury, the Federal Deposit Insurance Corporation, and the Federal Reserve launched an investigation into whether the company had misled potential corporate customers and used aggressive tactics while selling American Express cards in 2015 and 2016. In October 2021, Amex launched full-service business checking for small and mid-sized businesses under the American Express brand.\nIn March 2022, following the Russian invasion of Ukraine and related sanctions, American Express suspended all operations in Russia and Belarus.\nIn July 2023, Amex agreed to pay $15 million to the US Treasury to settle an investigation accusing the company of failing to govern and oversee a third-party affiliate and for violation of regulations in efforts to retain small business customers. Net income for 2023 was $8.4 billion, 14% higher than expected. Also in 2023, the company undertook a restructuring, costing up to $277 million.\nIn June 2024, Amex acquired Tock, a restaurant reservation platform, further expanding its portfolio in dining reservations following its earlier acquisition of Resy.\nIn January 2025, American Express announced that it will pay about $230 million to settle U.S. criminal and civil probes into alleged deceptive practices in selling credit card and wire transfer products to small business customers. The company has agreed to pay $138.4 million, which includes about $108 million in fines, and entered a non-prosecution agreement to end criminal and civil probes by the U.S. Department of Justice.\nIn September 2025, American Express increased its annual fee for its Platinum card for the first time since 2021, raising it to $895 from $695. The company announced new benefits for cardholders including statement credits for Lululemon, Oura Ring, Resy restaurants and an Uber One membership. It also increased credits for luxury hotel stays, streaming subscriptions (including the addition of Paramount+, YouTube Premium and YouTube TV) and a Clear membership.\n\nFinancial history\nAmex credit card benefits and fees\nSpecialized cards for businesses\nAmerican Express has a specialized corporate meeting credit card. Another specialized American Express business card is the American Express Corporate Purchasing Card, which can be assigned to individual employees or departments. Reconciliation and accounting services are available to make these functions easier for the corporation.\n\nNon-proprietary cards\nCitibank, First National Bank of Omaha, USAA, Navy Federal Credit Union, Synchrony Financial, and US Bancorp issue American Express cards. Citi issues the Macy's and Bloomingdale's American Express cards along with Citi-branded cards. US Bancorp issues American Express-branded cards for US Bank along with Elan Card Services, a subsidiary that issues credit cards on behalf of small to midsize banks. Some credit unions, including Pentagon Federal Credit Union, also issue American Express cards. Until August 2023, Wells Fargo issued American Express cards under their own brand and for Dillard's. JPMorgan Chase and Wells Fargo are the only Big Four banks in the U.S. that do not partner with American Express.\n\nMarketing and advertising\nCard design\nThe company logo, a gladiator or centurion, appears at the center of several cards. The figure and his pose evoke classical antiquity, demonstrate strength and stability, and the designs on these cards, especially the Green card, bear resemblance to those on the United States Federal Reserve Notes.\n\nAdvertising campaigns\n\"Don't Leave Home Without Them\"\nIn 1975, David Ogilvy of Ogilvy & Mather developed the highly successful \"Don't Leave Home Without Them\" ad campaign for American Express Traveler's Cheques, featuring Academy Award-winning actor Karl Malden. Malden served as the public face of American Express Travelers Cheques for 25 years. In the UK, the spokesman was Alan Whicker, a television personality.\nAfter Malden's departure, and as the card assumed importance over the traveler's cheques, American Express continued to use celebrities, such as Mel Blanc and ballerina Cynthia Gregory. A typical ad for the American Express Card began with a celebrity asking viewers: \"Do you know me?\" Although he/she gave hints to his/her identity, the star's name was never mentioned except as imprinted on an American Express Card, after which announcer Peter Thomas told viewers how to apply for it. Each ad concluded with the celebrity reminding viewers: \"Don't Leave Home Without It.\" The \"Don't Leave Home Without It\" slogan was revived in 2005.\n\nThe Adventures of Seinfeld & Superman\nAmerican Express uses celebrities in advertising. Some notable examples include a late 1990s ad campaign with comedian Jerry Seinfeld, including the two 2004 webisodes in a series entitled \"The Adventures of Seinfeld & Superman\".\n\n\"My life. My card. / Are You a Cardmember?\"\nIn late 2004, American Express launched the \"My life. My card.\" brand campaign, and later the \"Are You a Cardmember?\" brand campaign in 2007, both by Ogilvy & Mather, featuring celebrities that use American Express cards including:\n\nActors: Kate Winslet, Robert De Niro, Ken Watanabe, and Tina Fey;\nDuke University basketball coach Mike Krzyzewski;\nFashion designers Collette Dinnigan and Diane von Fürstenberg;\nComedian and talk show hostess Ellen DeGeneres;\nGolfer Tiger Woods;\nProfessional snowboarder Shaun White;\nTennis pros Venus Williams, Andy Roddick, and Andre Agassi;\nSurfer Laird Hamilton;\nChelsea manager José Mourinho;\nFilm directors Martin Scorsese, Wes Anderson, and M. Night Shyamalan;\nSingers Sheryl Crow, Alicia Keys and Beyoncé\n\nAnimals\nIn 2007, a two-minute black-and-white ad, titled \"Animals\" and starring Ellen DeGeneres, won the Emmy Award for Outstanding Commercial.\n\nC. F. Frost\nMany American Express credit card ads feature a sample American Express Card with the name \"C. F. Frost\" on the front. This is not a fabricated name; Charles F. Frost was an advertising executive at Ogilvy & Mather.\n\nCause marketing\nAmerican Express was one of the earliest users of cause marketing, to great success. A 1983 promotion advertised that for each purchase made with an American Express Card, American Express would contribute one penny to the renovation of the Statue of Liberty. The campaign generated contributions of $1.7 million to the Statue of Liberty restoration project. What would soon capture the attention of marketing departments of major corporations was that the promotion generated approximately a 28% increase in American Express card usage by consumers.\nIn May 2007, American Express launched an initiative called the Members Project. Cardholders were invited to submit ideas for projects, and were told American Express was funding the winning project.\n\nSponsorship\nSince 2011, American Express has a £100 million sponsorship agreement with football club Brighton & Hove Albion F.C. The agreement includes naming rights over Falmer Stadium, Brighton training facilities and shirt sponsorship over the kits of the men's, women's, youth and disability teams\n\nIn May 2024, American Express became the official partner of F1 Academy, a female-only single-seater racing series founded by Formula One, for the 2024 season. The partnership deal include American Express' branding to appear on Jessica Edgar's car livery and driver suit.\n\nAwards and recognition\nIn 2016, at the Corporate Art Awards, American Express received the award from pptArt for \"the best international restoration programme: World's Monument Watch\". American Express is a sponsor of \"World Monuments Watch\", launched in 1995 by World Monuments Fund.\n\nWorkplace\nOffices\nIn April 1986, American Express moved its headquarters to the 51-story Three World Financial Center in New York City. After the September 11 attacks, American Express had to leave its headquarters temporarily because it was located directly opposite the World Trade Center and was damaged during the fall of the towers. The company began gradually moving back into its rehabilitated building in 2002. The company maintains major offices in Sunrise, Florida; Salt Lake City, Utah; and Phoenix, Arizona, with its main data centers in North Carolina and Phoenix.\nAMEX Bank of Canada was founded in 1853, in Toronto. It has around 1,700 employees as of December 2020 in its head office at Sheppard, east of Highway 404 in Toronto (relocated from Markham, Ontario, a northern suburb of Toronto where it resided from 1985 to 2015), as well as an office in Hamilton, Ontario. The company began operations as a bank on July 1, 1990, following an order-in-council made by the Brian Mulroney government on November 21, 1988. This decision was not without controversy as federal banking policy at the time would not ordinarily have permitted American Express to operate as a bank. It is a member of the Canadian Bankers Association (CBA) and a registered member of the Canada Deposit Insurance Corporation (CDIC), the federal agency insuring deposits at all of Canada's chartered banks.\nAmerican Express has several offices in the UK, including a European Service Center in the Carlton Hill area of Brighton, England. The building was completed in 2012. It replaced American Express's former building, Amex House, a large white tower block built in 1977 and surrounded by several other smaller offices around the city. The American Express European Service Center deals with card servicing, sales, fraud and merchant servicing. Official Europe, Middle East, and Africa HQ is located in the Belgravia district of Westminster, in central London, at Belgrave House on Buckingham Palace Road, SW1; other UK offices are based in Sussex at Burgess Hill and Manchester. In November 2009, Brighton and Hove City Council granted planning permission for American Express to redevelop the Amex House site.\nThe Japan, Asia-Pacific, and Australian Headquarters are co-located in Singapore, at 16 Collyer Quay, and in Sydney's King Street Wharf area. The headquarters of Latin America and Caribbean division is in Fort Lauderdale, Florida.\nAmerican Express also has a significant presence in India. Its two centers are located at Gurgaon, Haryana (Cyber City) and Bangalore, Karnataka (Bagmane capital).The Indian operations of American Express revolve around the back office customer services operations apart from the credit card business for the domestic Indian Economy, arguably the American Express campus in Gurgaon is the largest employee location by headcount for Amex and supports business continuity objectives of Amex including during Hurricane Sandy, the center works 24/7 and includes a co-located second building which was recently transferred to a third party service provider but does much work for Amex.\n\nJob satisfaction\nThe company has consistently ranked highly on lists of best companies to work for compiled by Fortune and Mediacorp Canada Inc.\n\nList of CEOs\nHenry Wells (1850–1866)\nWilliam Fargo (1866–1881)\nJ. C. Fargo (1881–1914)\nGeorge C. Taylor (1914–1923)\nFrederick P. Small (1923–1944)\nRalph Reed (1944–1960)\nHoward L. Clark Sr. (1960–1977)\nJames D. Robinson III (1977–1993)\nHarvey Golub (1993–2001)\nKenneth Chenault (2001–2018)\nStephen Squeri (2018–present)\n\nSee also\n1995 \"Gold Card Dress\" of Lizzy Gardner\nSmall Business Saturday, a registered trademark of American Express\nJ.P. Morgan Reserve Card (Palladium Card) – a competitor to the Centurion Card\nMasterCard, Visa and Discover Card – major competitors\nCredit score in the United States\nBanking in the United States\nAmerican Express Community Stadium in East Sussex, England\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for American Express Company:",
  "clean_text": "American Express Company or Amex is an American bank holding company and multinational financial services corporation that specializes in payment cards. It is headquartered at 200 Vesey Street, also known as American Express Tower, in the Battery Park City neighborhood of Lower Manhattan. Amex is the fourth-largest card network globally based on purchase volume, behind China UnionPay, Visa, and Mastercard. 141.2 million Amex cards were in force worldwide as of December 31, 2023, with an average annual spend per card member of US$24,059. That year, Amex handled over $1.7 trillion in purchase volume on its network. Amex is the 16th largest US bank, with a total of US$270 billion in assets or 1.1% of all assets insured by the FDIC. It is ranked 58th on the Fortune 500 and 28th on the list of the most valuable brands by Forbes. In 2023, it was ranked 63rd in the Forbes Global 2000. American Express National Bank is a direct bank owned by Amex. Founded in 1850 as a freight forwarding company, Amex introduced financial and travel services during the early 1900s. It developed its first paper charge card in 1958, gold card in 1966, green card in 1969, platinum card in 1984, and Centurion Card in 1999. The \"Don't Leave Home Without It\" advertising campaign was introduced in 1975 and renewed in 2005. In the 1980s, Amex acquired and then divested a stake in Shearson. In the 1990s, it stopped reducing interchange fees for merchants who exclusively accepted Amex cards and expanded market share through targeted marketing campaigns. Amex converted to a bank holding company during the 2008 financial crisis. Amex began operating airport lounges in 2013, offering access to certain cardholders. Amex had a 9% worldwide market share by transaction volume in 2023. While American Express credit cards are accepted at 99% of U.S. merchants that accept credit cards (Costco being a notable exception), they are much less accepted in Europe and Asia. American Express offers various types of cards including travel and dining cards, everyday spending points cards, and cash back cards. Each category has several card options with different benefits and reward structures. High-profile cards like the Green, Gold, and Platinum cards cater to frequent travelers and diners with perks tailored to these activities. History Early history In 1850, American Express was started as a freight forwarding company in Buffalo, New York. It was founded as a joint-stock corporation by the merger of the cash-in-transit companies owned by Henry Wells (Wells & Company), William G. Fargo (Livingston, Fargo & Company), and John Warren Butterfield (Wells, Butterfield & Company, the successor earlier in 1850 of Butterfield, Wasson & Company). Wells and Fargo also started Wells Fargo & Co. in 1852 when Butterfield and other directors objected to the proposal that American Express extend its operations to California. American Express initially established its headquarters in a building at the intersection of Jay Street and Hudson Street in what was later called the Tribeca section of Manhattan. For years it enjoyed a virtual monopoly on the movement of express shipments (goods, securities, currency, etc.) throughout New York State. In 1874, American Express moved its headquarters to 65 Broadway in what was becoming the Financial District of Manhattan, a location it was to retain through two buildings. In 1854, the American Express Co. purchased a lot on Vesey Street in New York City as the site for its stables. The company's first New York headquarters was an 1858 marble Italianate palazzo at 55–61 Hudson Street, which had a busy freight depot on the ground story with a spur line from the Hudson River Railroad. A stable was constructed in 1867, five blocks north at 4–8 Hubert Street. The company prospered sufficiently that headquarters were moved in 1874 from the wholesale shipping district to the budding Financial District and into rented offices in two five-story brownstone commercial buildings at 63 and 65 Broadway that were owned by the Harmony family. In 1880, American Express built a new warehouse behind the Broadway Building at 46 Trinity Place. The designer is unknown, but it has a façade of brick arches that are reminiscent of pre-skyscraper New York. American Express has long been out of this building, but it still bears a terracotta seal with the American Express Eagle. In 1890–91 the company constructed a new ten-story building by Edward H. Kendall on the site of its former headquarters on Hudson Street. By 1903, the company had assets of some $28 million, second only to the National City Bank of New York among financial institutions in the city. To reflect this, the company purchased the Broadway buildings and site. At the end of the Wells–Fargo reign in 1914, an aggressive new president, George Chadbourne Taylor (1868–1923), who had worked his way up through the company over the previous thirty years, decided to build a new headquarters. The old buildings, dubbed by The New York Times as \"among the ancient landmarks\" of lower Broadway, were inadequate for such a rapidly expanding concern. After some delays due to the First World War, the 21-story neo-classical American Express Co. Building was constructed in 1916–17 to the design of J. Lawrence Aspinwall, of the firm of Renwick, Aspinwall & Tucker, the successor to the architectural practice of James Renwick Jr. The building consolidated the two lots of the former buildings with a single address: 65 Broadway. This building was part of the \"Express Row\" section of lower Broadway at the time. The building completed the continuous masonry wall of its block-front and assisted in transforming Broadway into the \"canyon\" of neo-classical masonry office towers familiar to this day. American Express sold this building in 1975, but retained travel services there. The building was also the headquarters over the years of other prominent firms, including investment bankers J.& W. Seligman & Co. (1940–74), the American Bureau of Shipping, a maritime concern (1977–86), and later J.J. Kenny, and Standard & Poor's, the latter of which renamed the building for itself. National expansion American Express extended its reach nationwide by arranging affiliations with other express companies (including Wells Fargo – the replacement for the two former companies that merged to form American Express), railroads, and steamship companies. In 1857, American Express started its expansion in the area of financial services by launching a money order business to compete with the United States Post Office's money orders. Sometime between 1888 and 1890, J. C. Fargo took a trip to Europe and returned frustrated and infuriated. Despite the fact that he was president of American Express and that he carried with him traditional letters of credit, he found it difficult to obtain cash anywhere except in major cities. Fargo went to Marcellus Flemming Berry and asked him to create a better solution than the letter of credit. Berry introduced the American Express Traveler's Cheque which was launched in 1891 in denominations of $10, $20, $50, and $100. Traveler's cheques established American Express as a truly international company. In 1914, at the onset of World War I, American Express in Europe was among the few companies to honor the letters of credit (issued by various banks) held by Americans in Europe, because other financial institutions refused to assist these stranded travelers. The British government appointed American Express its official agent at the beginning of World War I. They were to deliver letters, money, and relief parcels to British prisoners of war. Their employees went into camps to cash drafts for both British and French prisoners and arranged for them to receive money from home. By the end of the war they were delivering 150 tonnes of parcels per day to prisoners in six countries. In 1915, American Express established a travel division and soon established its first travel agency. Albert K. Dawson was instrumental in expanding business operations overseas, even investing in tourist relations with the Soviet Union. During World War I, Dawson was a photographer and film correspondent with the German army. End of railroad express business American Express was one of the monopolies that President Theodore Roosevelt had the Interstate Commerce Commission (ICC) investigate during his administration (1901–1909). The interest of the ICC was drawn to its strict control of the railroad express business. However, the solution did not come immediately to hand. The solution to this problem came as a coincidence to other problems during World War I. During the winter of 1917, the United States suffered a severe coal shortage and on December 26 President Woodrow Wilson commandeered the railroads on behalf of the United States government to move federal troops, their supplies, and coal. Treasury Secretary William Gibbs McAdoo was assigned the task of consolidating the railway lines for the war effort. All contracts between express companies and railroads were nullified and McAdoo proposed that all existing express companies be consolidated into a single company to serve the country's needs. This ended American Express's express business and removed them from the ICC's interest. The result was that a new company called the American Railway Express Agency formed in July 1918. The new entity took custody of all the pooled equipment and property of existing express companies (the largest share of which, 40%, came from American Express, who had owned the rights to the express business over 71,280 miles (114,710 km) of railroad lines, and had 10,000 offices, with over 30,000 employees). 1920s–1970s American Express executives discussed the possibility of launching a travel charge card as early as 1946, but it was not until Diners Club launched a card in March 1950, that American Express began to seriously consider the possibility. At the end of 1957, under American Express CEO Ralph Reed the company entered the business and by the launch date of October 1, 1958, public interest had become so significant that 250,000 cards were issued prior to the official launch date. The card was launched with an annual fee of $6, $1 higher than Diners Club, to be seen as a premium product. The first cards were made of paper, with the account number and card member's name typed. In 1959, American Express became the first company to issue embossed plastic cards. In 1966, American Express introduced the Gold Card for \"big-spending members\". In 1977, James D. Robinson III became chairman and CEO of the company. In 1979, American Express acquired 50% of the cable subsidiary of Warner Communications, forming Warner-Amex Satellite Entertainment, for $175 million in cash and short-term notes. It owned two-thirds of Qube, an experimental two-way cable TV service, along with MTV, Nickelodeon, and The Movie Channel. The venture was unprofitable, and, in 1985, Amex sold its 50% interest to Viacom for $450 million. 1980s and 1990s In the 1980s, American Express embarked on an effort to become a financial services holding company and made several acquisitions, creating an investment banking arm. In mid-1981 it purchased Sanford I. Weill's Shearson Loeb Rhoades, the second-largest securities firm in the United States to form Shearson/American Express. Shearson Loeb Rhoades itself was the culmination of several mergers in the 1970s as Weill's Hayden, Stone & Co. merged with Shearson, Hammill & Co. in 1974, to form Shearson Hayden Stone. Shearson Hayden Stone then merged with Loeb, Rhoades, Hornblower & Co. (formerly Loeb, Rhoades & Co.) to form Shearson Loeb Rhoades in 1979. With capital totaling $250 million at the time of its acquisition, Shearson Loeb Rhoades was the second-largest brokerage firm, behind Merrill Lynch. After the purchase of Shearson, Weill was given the position of president of American Express in 1983. Weill grew increasingly unhappy with responsibilities within the company and his conflicts with CEO James D. Robinson III. Weill soon realized that he was not positioned to be named CEO and resigned in August 1985. In 1984, American Express acquired Lehman Brothers and added it to the Shearson family, creating Shearson Lehman/American Express. Lehman CEO and former trader Lewis Glucksman became CEO of Shearson Lehman/American Express. In 1984, Shearson/American Express acquired Investors Diversified Services (IDS), bringing with it a fleet of financial advisors and investment products. In 1988, Shearson Lehman acquired the E.F. Hutton & Co., a brokerage firm that was merged with the investment banking business. The investment banking arm was renamed Shearson Lehman Hutton, Inc. In 1983, as part of Robinson's plan to expand into international banking of wealthy clients, Amex acquired Trade Development Bank of Geneva from Edmond Safra for US$550 million and Safra became a member of the board of directors of Amex. TDB executives were excluded from important company decisions and Safra unsuccessfully tried to repurchase the bank. Safra then opened a competing bank. In response, American Express launched an international smear campaign against Safra by inaccurately reporting to news and media outlets in that Safra was being investigated by the FBI for being involved in the Iran–Contra affair, along with drug trafficking and the mafia. All of the accusations were confirmed to be false and led to the resignation of Harry L. Freeman, public relations chief of American Express, after admitting to the entire scandal. In July 1989, American Express publicly apologized to Edmond Safra and donated $8 million to the charity of his choice. In 1990, American Express sold its Swiss banking operations to Compagnie de Banque et d'Investissements, which led to the creation of Union Bancaire Privée (UBP). In 1984, Amex launched the Platinum Card, billed as an \"ultra-exclusive\" credit card with a $250 annual fee. It was offered by invitation only to American Express customers with at least two years of tenure, significant spending, and excellent payment history. In 1987, American Express introduced the Optima card, its first credit card product that did not have to be paid in full at the end of the month. In 1991, a group of restaurants in Boston, including some that were exclusive to Amex, stopped accepting American Express while accepting and encouraging the use of Visa and Mastercard. The rationale was due to far lower fees as compared to American Express' fees at the time (which were about 4% for each transaction versus around 1.2% for Visa and Mastercard). The revolt, known as the \"Boston Fee Party\" (alluding to the Boston Tea Party), spread to over 250 restaurants across the United States, including restaurants in other cities such as New York City, Chicago, and Los Angeles. Visa offered to pay the Fee Party's legal bills, and Discover Card was able to increase their acceptance among Boston restaurants by 375%. Kenneth Chenault, then head of Travel Related Services prior to becoming American Express CEO, cut fees to bring these restaurants back into the fold. American Express then shifted its focus from exclusivity to broadening acceptance, adding mainstream merchants like Walmart to the American Express network. American Express was, at the time, known for cutting its interchange fee to merchants and restaurants if they accepted only American Express and no other credit or charge cards. This prompted competitors such as Visa and Mastercard to file complaints as the tactics gave Amex exclusivity at restaurants. Capitalizing on this elitist image, American Express frequently mentioned such exclusive partnerships in its advertising. Aside from some holdouts including Neiman Marcus, which continued exclusivity until 2011, the practice largely ended in 1991. In April 1992, American Express spun off First Data in an initial public offering. In 1993, Harvey Golub became CEO of American Express. That year, American Express negotiated the sale of Shearson's retail brokerage and investment management business to Primerica. The Shearson business was merged with Primerica's Smith Barney to create Smith Barney Shearson. In June 1994, American Express completed the spin-off of the remaining investment banking and institutional businesses as Lehman Brothers, ending its foray into the brokerage business. In September 1994, the Optima True Grace card was introduced. The card was unique in that it offered a grace period on all purchases whether a balance was carried on the card or not, not charging interest on new purchases immediately for cards with unpaid balances. The card was discontinued a few years later. In 1998, Amex launched the Blue credit card, targeted at young adults, in the UK after testing it in other countries. The card had a smart chip and users were encouraged to pay bills and get information via the company website. It launched in the US in 1999. A television media campaign for Blue adopted the 1979 UK Synthpop hit \"Cars\" by Gary Numan as its theme music. In 1999, American Express introduced the high-fee Centurion Card, often referred to as the \"black card,\" which caters to an even more affluent customer segment. The card was initially available only to select users of the Platinum card. American Express created the card line amid rumors and urban legends in the 1980s that it produced an ultra-exclusive black card for elite users who could purchase anything with it. 21st century In December 2000, American Express agreed to acquire the $226 million credit card portfolio of Bank of Hawaii, then a division of Pacific Century Financial Corporation In January 2006, American Express sold its Bank of Hawaii card portfolio to Bank of America (MBNA). Until 2004, Visa and Mastercard rules prohibited issuers of their cards from issuing American Express cards in the United States. This meant, as a practical matter, that U.S. banks could not issue American Express cards. These rules were struck down as a result of antitrust litigation brought by the United States Department of Justice. In January 2004, American Express reached a deal to have its cards issued by MBNA. Initially decried by Mastercard executives as nothing but an \"experiment\", the cards were issued beginning in October 2004. An agreement was reached regarding the acquisition of MBNA by Bank of America whereby Bank of America owned the customer loans and American Express processed the transactions. American Express dismissed Bank of America from its antitrust litigation against Visa, Mastercard, and other banks. The first card from the partnership, the Bank of America Rewards American Express card, was released on June 30, 2006. In June 2005, American Express introduced ExpressPay, a contactless payment system based on wireless RFID. In July 2005, American Express issued the American Express Travelers Cheque Card, a stored-value card that serves the same purposes as a traveler's cheque, but can be used in stores like a credit card. Amex discontinued the card in October 2007. On September 30, 2005, American Express completed the corporate spin-off of its American Express Financial Advisors unit, Ameriprise Financial, to its shareholders and RSM McGladrey acquired American Express Tax & Business Services (TBS). In 2006, the UK division of American Express joined the Product Red coalition and issued a Red Card, donating with each purchase through The Global Fund to Fight AIDS, Tuberculosis and Malaria to help African women and children with HIV/AIDS, malaria, and other diseases. In late 2007, the company announced the Plum Card for small business owners. In March 2008, American Express acquired the Corporate Payment Services business of General Electric, which primarily focused on providing purchasing card solutions for large global clients, for $1.1 billion in cash. The transaction added V-Payment to its product portfolio. V-Payment enables a tightly controlled, single-use card number. In March 2008, Standard Chartered Bank acquired American Express Bank Ltd, the international banking subsidiary of American Express for $823 million. On November 10, 2008, during the 2008 financial crisis, the company received Federal Reserve System approval to convert to a bank holding company, making it eligible for government assistance under the Troubled Asset Relief Program (TARP). At that time, American Express had total consolidated assets of about $127 billion. In June 2009, $3.39 billion in TARP funds were repaid plus $74.4 million in dividend payments. In July 2009, the company ended its obligations under TARP by buying back $340 million in Treasury warrants. As part of the conversion, the company reduced or closed many business lines of credit. In 2009, American Express introduced the ZYNC charge card, a white card targeting young adults. The card was later discontinued. In November 2010, the UK division of American Express was cautioned by the Office of Fair Trading for the use of controversial charging orders against those in debt. The company was one of four companies who were allegedly encouraging customers to turn their unsecured credit card debts into a form of secured debt. In November 2011, Neiman Marcus, which gave general-purpose card exclusivity to American Express since the 1980s, began accepting cards using the Visa and Mastercard payment networks. In 2011, Amex launched the Blue Cash Preferred Card credit card. In October 2012, The Consumer Financial Protection Bureau (CFPB) required three American Express subsidiaries to refund an estimated $85 million to approximately 250,000 customers for illegal card practices between 2003 and 2012. Allegations included that American Express made misleading statements regarding signup bonuses, charged unlawful late fees, discriminated against applicants due to age, and failed to report consumer complaints to regulators. Also in October 2012, American Express and Walmart announced the launch of Bluebird, a prepaid debit card with roadside assistance and identity theft protection that can also be used as a substitute for a traditional transactional account whereby users can have payments deposited to the account and have insurance from the Federal Deposit Insurance Corporation. In October 2013, Amex sold most of its publications: Travel + Leisure, Food & Wine, Executive Travel, Black Ink, and Departures magazines, to Time Inc. Time restructured the publications, which are now owned by Dotdash Meredith. In 2013, the company opened its first airport lounge, offering access to certain cardmembers. In March 2014, American Express announced the corporate spin-off its corporate travel business as American Express Global Business Travel and the sale of 50% of the business to an investor group led by Certares LP for $900 million. Effective in 2016 in the United States, and in 2015 in Canada, Costco ended its relationship with Amex that had provided co-branded Costco membership cards since 2004. The cards issued by Costco in the United States were an extension of an exclusive deal between Costco and American Express dating from 1999. Costco was the last major US merchant that accepted American Express cards exclusively. Costco's Canadian stores ended its exclusive deal with American Express in January 2015, in favor of one with Capital One and Mastercard. Citigroup became the exclusive issuer of Costco's credit cards and Visa replaced American Express as the exclusive credit card accepted at Costco's stores in the United States. All TrueEarnings card accounts and balances held by American Express were sold to Citigroup, and new Costco Anywhere Visa cards were sent to Costco members prior to the switch date. The Costco partnership represented 8%, or $80 billion, of American Express' billed business and about 20%, or about $14 billion, of its interest-bearing credit portfolio. The impact of losing the Costco card accounts was significant; in the first quarter without Costco cards, company profit dropped 10% and revenue dropped 5% compared to the previous year. On March 1, 2017, ANZ announced that it was no longer issuing American Express cards, with them phased out entirely by August 5, 2017. In October 2017, American Express established a joint venture company, LianTong (连通), in China to operate its payment card brand locally. In June 2020, it obtained a local bank card clearing business license in China. In a court case Ohio v. American Express Co. (2018), merchants filed a class action lawsuit against American Express and claimed that charging high fees to merchants is a violation of the Sherman Antitrust Act. According to the lawsuit, American Express charges significantly higher fees than other credit card providers. In January 2017, the 2nd U.S. Circuit Court of Appeals affirmed a lower court ruling that American Express could block merchants that accept its cards from steering customers to other cards, like those offered by Visa and Mastercard. In June 2018, the Supreme Court of the United States affirmed the 2nd Circuit's ruling. In 2018, the Gold Card was converted to a credit card for UK residents, but remains a charge card in the US. In March 2019, American Express acquired LoungeBuddy, a provider which offers pay-per-use access to select airport lounges worldwide. Also in March 2019, Amex reduced its presence in the European Union, due to changes to the EU's banking regulations. In July 2019, Amex acquired Acompay, a digital payment automation platform. In September 2019, Pedestrian Group acquired American Express Openair Cinemas, which facilitated outdoor showings of films at 10 locations in Australia and New Zealand and was operated by Fairfax Events. In 2020, American Express acquired Kabbage. In June 2021, the company's first checking account for small businesses, Kabbage Checking, was launched. American Express also offers credit lines of $1,000 to $150,000 for small businesses, using Kabbage's automated underwriting software. In January 2023, the Kabbage brand was renamed American Express Business Blueprint. In January 2021, the United States Department of the Treasury, the Federal Deposit Insurance Corporation, and the Federal Reserve launched an investigation into whether the company had misled potential corporate customers and used aggressive tactics while selling American Express cards in 2015 and 2016. In October 2021, Amex launched full-service business checking for small and mid-sized businesses under the American Express brand. In March 2022, following the Russian invasion of Ukraine and related sanctions, American Express suspended all operations in Russia and Belarus. In July 2023, Amex agreed to pay $15 million to the US Treasury to settle an investigation accusing the company of failing to govern and oversee a third-party affiliate and for violation of regulations in efforts to retain small business customers. Net income for 2023 was $8.4 billion, 14% higher than expected. Also in 2023, the company undertook a restructuring, costing up to $277 million. In June 2024, Amex acquired Tock, a restaurant reservation platform, further expanding its portfolio in dining reservations following its earlier acquisition of Resy. In January 2025, American Express announced that it will pay about $230 million to settle U.S. criminal and civil probes into alleged deceptive practices in selling credit card and wire transfer products to small business customers. The company has agreed to pay $138.4 million, which includes about $108 million in fines, and entered a non-prosecution agreement to end criminal and civil probes by the U.S. Department of Justice. In September 2025, American Express increased its annual fee for its Platinum card for the first time since 2021, raising it to $895 from $695. The company announced new benefits for cardholders including statement credits for Lululemon, Oura Ring, Resy restaurants and an Uber One membership. It also increased credits for luxury hotel stays, streaming subscriptions (including the addition of Paramount+, YouTube Premium and YouTube TV) and a Clear membership. Financial history Amex credit card benefits and fees Specialized cards for businesses American Express has a specialized corporate meeting credit card. Another specialized American Express business card is the American Express Corporate Purchasing Card, which can be assigned to individual employees or departments. Reconciliation and accounting services are available to make these functions easier for the corporation. Non-proprietary cards Citibank, First National Bank of Omaha, USAA, Navy Federal Credit Union, Synchrony Financial, and US Bancorp issue American Express cards. Citi issues the Macy's and Bloomingdale's American Express cards along with Citi-branded cards. US Bancorp issues American Express-branded cards for US Bank along with Elan Card Services, a subsidiary that issues credit cards on behalf of small to midsize banks. Some credit unions, including Pentagon Federal Credit Union, also issue American Express cards. Until August 2023, Wells Fargo issued American Express cards under their own brand and for Dillard's. JPMorgan Chase and Wells Fargo are the only Big Four banks in the U.S. that do not partner with American Express. Marketing and advertising Card design The company logo, a gladiator or centurion, appears at the center of several cards. The figure and his pose evoke classical antiquity, demonstrate strength and stability, and the designs on these cards, especially the Green card, bear resemblance to those on the United States Federal Reserve Notes. Advertising campaigns \"Don't Leave Home Without Them\" In 1975, David Ogilvy of Ogilvy & Mather developed the highly successful \"Don't Leave Home Without Them\" ad campaign for American Express Traveler's Cheques, featuring Academy Award-winning actor Karl Malden. Malden served as the public face of American Express Travelers Cheques for 25 years. In the UK, the spokesman was Alan Whicker, a television personality. After Malden's departure, and as the card assumed importance over the traveler's cheques, American Express continued to use celebrities, such as Mel Blanc and ballerina Cynthia Gregory. A typical ad for the American Express Card began with a celebrity asking viewers: \"Do you know me?\" Although he/she gave hints to his/her identity, the star's name was never mentioned except as imprinted on an American Express Card, after which announcer Peter Thomas told viewers how to apply for it. Each ad concluded with the celebrity reminding viewers: \"Don't Leave Home Without It.\" The \"Don't Leave Home Without It\" slogan was revived in 2005. The Adventures of Seinfeld & Superman American Express uses celebrities in advertising. Some notable examples include a late 1990s ad campaign with comedian Jerry Seinfeld, including the two 2004 webisodes in a series entitled \"The Adventures of Seinfeld & Superman\". \"My life. My card. / Are You a Cardmember?\" In late 2004, American Express launched the \"My life. My card.\" brand campaign, and later the \"Are You a Cardmember?\" brand campaign in 2007, both by Ogilvy & Mather, featuring celebrities that use American Express cards including: Actors: Kate Winslet, Robert De Niro, Ken Watanabe, and Tina Fey; Duke University basketball coach Mike Krzyzewski; Fashion designers Collette Dinnigan and Diane von Fürstenberg; Comedian and talk show hostess Ellen DeGeneres; Golfer Tiger Woods; Professional snowboarder Shaun White; Tennis pros Venus Williams, Andy Roddick, and Andre Agassi; Surfer Laird Hamilton; Chelsea manager José Mourinho; Film directors Martin Scorsese, Wes Anderson, and M. Night Shyamalan; Singers Sheryl Crow, Alicia Keys and Beyoncé Animals In 2007, a two-minute black-and-white ad, titled \"Animals\" and starring Ellen DeGeneres, won the Emmy Award for Outstanding Commercial. C. F. Frost Many American Express credit card ads feature a sample American Express Card with the name \"C. F. Frost\" on the front. This is not a fabricated name; Charles F. Frost was an advertising executive at Ogilvy & Mather. Cause marketing American Express was one of the earliest users of cause marketing, to great success. A 1983 promotion advertised that for each purchase made with an American Express Card, American Express would contribute one penny to the renovation of the Statue of Liberty. The campaign generated contributions of $1.7 million to the Statue of Liberty restoration project. What would soon capture the attention of marketing departments of major corporations was that the promotion generated approximately a 28% increase in American Express card usage by consumers. In May 2007, American Express launched an initiative called the Members Project. Cardholders were invited to submit ideas for projects, and were told American Express was funding the winning project. Sponsorship Since 2011, American Express has a £100 million sponsorship agreement with football club Brighton & Hove Albion F.C. The agreement includes naming rights over Falmer Stadium, Brighton training facilities and shirt sponsorship over the kits of the men's, women's, youth and disability teams In May 2024, American Express became the official partner of F1 Academy, a female-only single-seater racing series founded by Formula One, for the 2024 season. The partnership deal include American Express' branding to appear on Jessica Edgar's car livery and driver suit. Awards and recognition In 2016, at the Corporate Art Awards, American Express received the award from pptArt for \"the best international restoration programme: World's Monument Watch\". American Express is a sponsor of \"World Monuments Watch\", launched in 1995 by World Monuments Fund. Workplace Offices In April 1986, American Express moved its headquarters to the 51-story Three World Financial Center in New York City. After the September 11 attacks, American Express had to leave its headquarters temporarily because it was located directly opposite the World Trade Center and was damaged during the fall of the towers. The company began gradually moving back into its rehabilitated building in 2002. The company maintains major offices in Sunrise, Florida; Salt Lake City, Utah; and Phoenix, Arizona, with its main data centers in North Carolina and Phoenix. AMEX Bank of Canada was founded in 1853, in Toronto. It has around 1,700 employees as of December 2020 in its head office at Sheppard, east of Highway 404 in Toronto (relocated from Markham, Ontario, a northern suburb of Toronto where it resided from 1985 to 2015), as well as an office in Hamilton, Ontario. The company began operations as a bank on July 1, 1990, following an order-in-council made by the Brian Mulroney government on November 21, 1988. This decision was not without controversy as federal banking policy at the time would not ordinarily have permitted American Express to operate as a bank. It is a member of the Canadian Bankers Association (CBA) and a registered member of the Canada Deposit Insurance Corporation (CDIC), the federal agency insuring deposits at all of Canada's chartered banks. American Express has several offices in the UK, including a European Service Center in the Carlton Hill area of Brighton, England. The building was completed in 2012. It replaced American Express's former building, Amex House, a large white tower block built in 1977 and surrounded by several other smaller offices around the city. The American Express European Service Center deals with card servicing, sales, fraud and merchant servicing. Official Europe, Middle East, and Africa HQ is located in the Belgravia district of Westminster, in central London, at Belgrave House on Buckingham Palace Road, SW1; other UK offices are based in Sussex at Burgess Hill and Manchester. In November 2009, Brighton and Hove City Council granted planning permission for American Express to redevelop the Amex House site. The Japan, Asia-Pacific, and Australian Headquarters are co-located in Singapore, at 16 Collyer Quay, and in Sydney's King Street Wharf area. The headquarters of Latin America and Caribbean division is in Fort Lauderdale, Florida. American Express also has a significant presence in India. Its two centers are located at Gurgaon, Haryana (Cyber City) and Bangalore, Karnataka (Bagmane capital).The Indian operations of American Express revolve around the back office customer services operations apart from the credit card business for the domestic Indian Economy, arguably the American Express campus in Gurgaon is the largest employee location by headcount for Amex and supports business continuity objectives of Amex including during Hurricane Sandy, the center works 24/7 and includes a co-located second building which was recently transferred to a third party service provider but does much work for Amex. Job satisfaction The company has consistently ranked highly on lists of best companies to work for compiled by Fortune and Mediacorp Canada Inc. List of CEOs Henry Wells (1850–1866) William Fargo (1866–1881) J. C. Fargo (1881–1914) George C. Taylor (1914–1923) Frederick P. Small (1923–1944) Ralph Reed (1944–1960) Howard L. Clark Sr. (1960–1977) James D. Robinson III (1977–1993) Harvey Golub (1993–2001) Kenneth Chenault (2001–2018) Stephen Squeri (2018–present)"
}