{
  "ticker": "AZO",
  "cik": "0000866787",
  "company_name": "AutoZone",
  "corrected_name": "AutoZone",
  "wiki_title_used": "AutoZone",
  "exists": true,
  "raw_text": "AutoZone, Inc., doing business as AutoZone (and formerly known as Auto Shack from 1979 to 1987), is an American retailer of aftermarket automotive parts and accessories, the largest in the United States. Founded in 1979, AutoZone has 7,140 stores across the United States, Mexico, Puerto Rico, Brazil, and the US Virgin Islands. The company is based in Memphis, Tennessee.\n\nCompany History\nAuto Shack\nAutoZone was founded by J.R. \"Pitt\" Hyde III as the auto parts division of Malone & Hyde, a Memphis-based wholesale grocer founded by his family. After joining the board of directors at Wal-Mart in 1978, Hyde explored new ways to diversify his family's business. On July 4, 1979, the first store opened in Forrest City, Arkansas under the name of Auto Shack. Doc Crain was the store's first manager. Sales that first day totaled $300.00. Despite not knowing much about cars, Hyde's vision was to offer good customer service, and everyday low prices, in a clean, well designed, and brightly lit shop.\nBy 1980, the chain expanded to eight stores across five states, and then to 20 stores the year after. In 1981, the company opened its first Express Parts Service warehouse in Memphis, allowing customers to order hard to find parts not found in most stores. By 1983, Auto Shack opened its 100th store in Weslaco, Texas.\nBy 1984, it had 190 locations across 13 states. In 1984, Malone & Hyde was acquired in a management buyout that included Hyde, investment firm Kohlberg Kravis Roberts & Company, and other executives, taking the public company (including Auto Shack) private. Total stores were 194 in 13 states.\nIn 1985, Peter Formanek was named president. He oversaw the auto parts firm's daily operations and worked on growth strategy. In 1986, Auto Shack was spun off from Malone & Hyde, with Hyde and Formanek remaining in charge. Malone & Hyde was later sold to Fleming Companies in 1988.\nBy 1986, expansion had made the company grow into a large store chain across the South and the Midwest. Auto Shack debuted its Duralast auto parts line, starting with alternators and starters. The Loan-A-Tool program was also introduced, allowing customers to borrow specialty tools. The fourth distribution center in Greenville, South Carolina opened. The total number of stores was 339 in 15 states.\n\nAutoZone\nIn 1986, Auto Shack was sued by Radio Shack for trademark infringement. While a court initially ruled in favor of Auto Shack, Radio Shack ultimately won on appeal. In 1987 Auto Shack announced plans to change its name to AutoZone. The first AutoZone store was in Enid, Oklahoma. The company introduced an electronic catalog used to look up parts, check warranties, and view inventory. The total number of stores was 459 in 16 states.\n\n1990s\nIn 1991, Hyde and KKR took the company public. Its stock began trading on the New York Stock Exchange using the ticker symbol \"AZO.\" KKR initially held a majority of the stock, but began selling off its shares by 1993.\nIn 1994, AutoZone began using satellites to facilitate communication between stores and the corporate office. Sales hit $1.5 billion.\nIn 1995, AutoZone opened its 1,000th store in Louisville, Kentucky. Also, the Duralast trademark made its debut with the Duralast and Duralast Gold batteries. Total of stores is now 1,143 in 26 states.\nIn 1996, the company launched its website. It also spent $56 million to acquire ALLDATA, a software company based in Elk Grove, California that provides automotive diagnostic and repair information.\nCompany founder Pitt Hyde retired as chairman and CEO in 1997. John Adams became the new chairman and CEO. AutoZone made several acquisitions in 1998. In January, it acquired 112 Auto Palace stores in six states for $55 million. It also bought 43 TruckPro L.P. locations in May and 560 Chief Auto Parts stores across in June. In October, AutoZone bought 100 Express auto parts stores from Pep Boys. The company established its first international location when it opened a store in Nuevo Laredo, Mexico in December 1998. By January 1999, it announced plans to open additional stores in the country. AutoZone closed the 1990s by debuting at the Fortune 500 list in 1999.\n\n2000s\nIn 2000, AutoZone opened a data processing and support center, known as DataZone, in Chihuahua, Mexico. In the years to come, new departments, including Finance, Customer Service, IT, Merchandising, and Store Technical Support would be added.\nIn January 2001, Steve Odland was named chairman and CEO, replacing Adams. That May, the company opened its 3,000th store in Cicero, Illinois. In December, AutoZone sold TruckPro to Paratus Capital Management.\n\nIn 2002, AutoZone developed a network of \"hub, feeder, and satellite\" stores to have more product in the market area, while reducing inventory investment. Sales hit $5.33 billion.\nIn 2003, the Duralast tool line was introduced. In April, Midas announced it was exiting the parts distribution business and would instead contract AutoZone to be its official distributor. AutoZone de Mexico opens the first DC in Nuevo Laredo, Mexico. Total stores number 3,219 in 48 states and 49 in Mexico. In April 2004, AutoZone acquired 12 stores from ABC Discount Auto Parts, an auto parts chain headquartered in Cherry Hill, New Jersey. That year, founder J.R. \"Pitt\" Hyde III was inducted into the Automotive Hall of Fame.\nIn 2005, William C. Rhodes III was named president and CEO. Steve Odland left to become the chairman and CEO of Office Depot. AutoZone opened its first Puerto Rican location in Bayamon.\nIn June 2007, Bill Rhodes was also made chairman. The company also opened its 4,000th store in Houston, Texas. That year, AutoZone introduced its Z-net electronic parts catalog and repair a database. The system replaced the company's original text-based catalog.\n\n2010s\nIn May 2010, AutoZone announced a new “Buy Online Pick-Up In-Store” service. The in June, the company unveiled a new mobile app that provides iPhone users access to vehicle repair guides, product catalogs, pricing information, and store locations. On December 15, 2011, ALLDATA LLC, an operating unit of AutoZone, expanded its direct presence in Canada to better serve its growing customer base.\nOn August 17, 2012, AutoZone expanded into Alaska, the company's 49th state, by opening its 5,000th store in Wasilla, Alaska. The company announced in December that it had acquired online automotive retailer AutoAnything.com. In 2012, AutoZone entered the Brazilian market by opening a store in Sao Paulo, Brazil.\nIn December 2012, AutoZone purchased AutoAnything.com, an e-commerce leader in aftermarket automotive parts based in San Diego, California. In 2014, the company acquired Interamerican Motor Corporation, a distributor of imported replacement parts. The deal gave AutoZone access to European and Asian markets. By November 2015, the company had expanded its hub stores to include mega hubs in Atlanta, Chicago, Los Angeles, Memphis, and New Jersey.\nBetween 2012 and 2016, AutoZone's stock valuation doubled in value. By April 2017, AutoZone had been the largest retailer of automotive parts in North America for three consecutive years. As of August 2017, AutoZone had 5,465 locations in the United States, 524 locations in Mexico, and 46 locations in Brazil, for a total of 6,035. The company opened its 6,000th store, in Memphis, Tennessee, on August 25, 2017.\nIn February 2018, AutoZone announced it had sold IMC to Parts Authority and AutoAnything to Kingswood Capital. In September, the company introduced next-day home delivery on online orders in 83 US markets. The service included 100,000 products and expanded to 95 markets by the end of the year. On October 22, 2018, Pitt Hyde announced that he would be stepping down from AutoZone's board of directors. By June 2019, the company had 174 hub stores and 28 mega hubs, with plans to continue expanding.\n\n2020s\nIn March 2020, during the early days of the COVID-19 pandemic, AutoZone introduced free curbside pickup for all buy online and pickup in store orders. In late May, two AutoZone stores were destroyed by arson during the George Floyd protests in Minneapolis–Saint Paul. By September 2021, the company had 58 mega hubs and announced plans to open 20 more over the next year.\nIn 2023, after years functioning as a shared services center, DataZone was renamed to AutoZone Business and Technology Store Support Center. In June 2023, Rhodes announced his intention to step down as president and CEO in January 2024. Phillip Daniele was promoted to president and CEO, with Rhodes remaining as executive chairman. By May 2024, AutoZone opened over 100 mega hubs stores.\n\nCorporate affairs\nAutoZone is incorporated in the state of Nevada.\n\nHeadquarters\nSince October 1995, AutoZone has been headquartered in its J.R. Hyde, III Store Support Center (SSC), a 270,000-square-foot (25,000 m2), eight-story building in Downtown Memphis, Tennessee. As of 2013 there were over 1,200 employees there.\nThe project manager of the building's construction was Rob Norcross, a principal at LRK Inc. The building has the capability to withstand a 9.0 magnitude earthquake because it has a special base isolation system that had a price tag of $950,000.\n\nPrivate labels\nAutoZone sells lead-acid car batteries (manufactured primarily by Johnson Controls) and other automotive parts using its Valucraft and Duralast private label brands. AutoZone also sells tools under the Duralast brand.\n\nRetail stores\nAutoZone's 7,657 retail outlets as of August 30, 2025 throughout the United States, Mexico and Brazil stock a variety of aftermarket parts as well as some OEM parts. All AutoZone stores are corporately owned; the company does not have franchise operations.\n\nSponsorships\nIn 2004, AutoZone celebrated its 25th anniversary and announced a corporate sponsorship agreement with auto racing association NASCAR.\nIn 2007, AutoZone sponsored Kevin Harvick and Timothy Peters in the NASCAR Busch Series.\nAutoZone holds the naming rights to the downtown Memphis baseball stadium that is the home of the Memphis Redbirds of the Pacific Coast League. The company also sponsors the AutoZone Liberty Bowl. The AutoZone Liberty Bowl, alongside the College Football Playoff Foundation donated $250,136.03 to the St. Jude Children's Research Hospital. The AutoZone Liberty Bowl awarded 2018's Distinguished Citizen Award to Priscilla Presley.\nThey are an official sponsor of Bellator MMA, the world's second largest Mixed Martial Arts promotion.\n\nLawsuits\nState prosecutors and the district attorneys of San Bernardino, Monterey, San Diego, and San Joaquin counties sued AutoZone in 2005, accusing the company of mishandling used motor oil and overcharging customers. AutoZone agreed to pay $1.5 million to settle the case.\nAutoZone faced a lawsuit for gender discrimination in which the plaintiff alleged that men treated her differently when she was promoted and that she feared revealing a pregnancy to her superior. When the pregnancy was discovered, she alleges that her district manager pressured her to step down from her position. She was demoted in February 2006 and fired in November 2011. The jury on the case ruled in 2014 in favor of the plaintiff, awarding her $185 million in punitive damages as well as approximately $873,000 in back wages. AutoZone has announced its intention to appeal the verdict. The Wall Street Journal's Jacob Gershman suggested that the verdict would be scaled back.\nIn 2018, AutoZone paid $3.3 million to settle a lawsuit stemming from a 2016 crash that killed three after an AutoZone-owned truck rear-ended a stalled vehicle. The suit alleged that AutoZone was negligent in training the driver of the truck.\nA Georgia woman was fired after a customer insulted her and used multiple racial epithets against her. In 2018, she filed a lawsuit against the company for violating her civil rights, alleging that the district manager told her to \"suck it up.\"\nIn June 2019, AutoZone entered into an $11 million settlement against with the State of California to resolve allegations that the company had violated state laws governing hazardous waste, hazardous materials, and confidential consumer information. AutoZone is charged with illegally disposing of millions of hazardous waste items, including used motor oil and automotive fluids, at landfills not authorized to accept hazardous waste.\n\nSee also\nAdvance Auto Parts\nCarquest\nNational Automotive Parts Association (NAPA)\nO'Reilly Auto Parts\nPep Boys\nSCO v. AutoZone\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for AutoZone, Inc.: \n35.14231°N 90.05614°W﻿ / 35.14231; -90.05614",
  "clean_text": "AutoZone, Inc., doing business as AutoZone (and formerly known as Auto Shack from 1979 to 1987), is an American retailer of aftermarket automotive parts and accessories, the largest in the United States. Founded in 1979, AutoZone has 7,140 stores across the United States, Mexico, Puerto Rico, Brazil, and the US Virgin Islands. The company is based in Memphis, Tennessee. Company History Auto Shack AutoZone was founded by J.R. \"Pitt\" Hyde III as the auto parts division of Malone & Hyde, a Memphis-based wholesale grocer founded by his family. After joining the board of directors at Wal-Mart in 1978, Hyde explored new ways to diversify his family's business. On July 4, 1979, the first store opened in Forrest City, Arkansas under the name of Auto Shack. Doc Crain was the store's first manager. Sales that first day totaled $300.00. Despite not knowing much about cars, Hyde's vision was to offer good customer service, and everyday low prices, in a clean, well designed, and brightly lit shop. By 1980, the chain expanded to eight stores across five states, and then to 20 stores the year after. In 1981, the company opened its first Express Parts Service warehouse in Memphis, allowing customers to order hard to find parts not found in most stores. By 1983, Auto Shack opened its 100th store in Weslaco, Texas. By 1984, it had 190 locations across 13 states. In 1984, Malone & Hyde was acquired in a management buyout that included Hyde, investment firm Kohlberg Kravis Roberts & Company, and other executives, taking the public company (including Auto Shack) private. Total stores were 194 in 13 states. In 1985, Peter Formanek was named president. He oversaw the auto parts firm's daily operations and worked on growth strategy. In 1986, Auto Shack was spun off from Malone & Hyde, with Hyde and Formanek remaining in charge. Malone & Hyde was later sold to Fleming Companies in 1988. By 1986, expansion had made the company grow into a large store chain across the South and the Midwest. Auto Shack debuted its Duralast auto parts line, starting with alternators and starters. The Loan-A-Tool program was also introduced, allowing customers to borrow specialty tools. The fourth distribution center in Greenville, South Carolina opened. The total number of stores was 339 in 15 states. AutoZone In 1986, Auto Shack was sued by Radio Shack for trademark infringement. While a court initially ruled in favor of Auto Shack, Radio Shack ultimately won on appeal. In 1987 Auto Shack announced plans to change its name to AutoZone. The first AutoZone store was in Enid, Oklahoma. The company introduced an electronic catalog used to look up parts, check warranties, and view inventory. The total number of stores was 459 in 16 states. 1990s In 1991, Hyde and KKR took the company public. Its stock began trading on the New York Stock Exchange using the ticker symbol \"AZO.\" KKR initially held a majority of the stock, but began selling off its shares by 1993. In 1994, AutoZone began using satellites to facilitate communication between stores and the corporate office. Sales hit $1.5 billion. In 1995, AutoZone opened its 1,000th store in Louisville, Kentucky. Also, the Duralast trademark made its debut with the Duralast and Duralast Gold batteries. Total of stores is now 1,143 in 26 states. In 1996, the company launched its website. It also spent $56 million to acquire ALLDATA, a software company based in Elk Grove, California that provides automotive diagnostic and repair information. Company founder Pitt Hyde retired as chairman and CEO in 1997. John Adams became the new chairman and CEO. AutoZone made several acquisitions in 1998. In January, it acquired 112 Auto Palace stores in six states for $55 million. It also bought 43 TruckPro L.P. locations in May and 560 Chief Auto Parts stores across in June. In October, AutoZone bought 100 Express auto parts stores from Pep Boys. The company established its first international location when it opened a store in Nuevo Laredo, Mexico in December 1998. By January 1999, it announced plans to open additional stores in the country. AutoZone closed the 1990s by debuting at the Fortune 500 list in 1999. 2000s In 2000, AutoZone opened a data processing and support center, known as DataZone, in Chihuahua, Mexico. In the years to come, new departments, including Finance, Customer Service, IT, Merchandising, and Store Technical Support would be added. In January 2001, Steve Odland was named chairman and CEO, replacing Adams. That May, the company opened its 3,000th store in Cicero, Illinois. In December, AutoZone sold TruckPro to Paratus Capital Management. In 2002, AutoZone developed a network of \"hub, feeder, and satellite\" stores to have more product in the market area, while reducing inventory investment. Sales hit $5.33 billion. In 2003, the Duralast tool line was introduced. In April, Midas announced it was exiting the parts distribution business and would instead contract AutoZone to be its official distributor. AutoZone de Mexico opens the first DC in Nuevo Laredo, Mexico. Total stores number 3,219 in 48 states and 49 in Mexico. In April 2004, AutoZone acquired 12 stores from ABC Discount Auto Parts, an auto parts chain headquartered in Cherry Hill, New Jersey. That year, founder J.R. \"Pitt\" Hyde III was inducted into the Automotive Hall of Fame. In 2005, William C. Rhodes III was named president and CEO. Steve Odland left to become the chairman and CEO of Office Depot. AutoZone opened its first Puerto Rican location in Bayamon. In June 2007, Bill Rhodes was also made chairman. The company also opened its 4,000th store in Houston, Texas. That year, AutoZone introduced its Z-net electronic parts catalog and repair a database. The system replaced the company's original text-based catalog. 2010s In May 2010, AutoZone announced a new “Buy Online Pick-Up In-Store” service. The in June, the company unveiled a new mobile app that provides iPhone users access to vehicle repair guides, product catalogs, pricing information, and store locations. On December 15, 2011, ALLDATA LLC, an operating unit of AutoZone, expanded its direct presence in Canada to better serve its growing customer base. On August 17, 2012, AutoZone expanded into Alaska, the company's 49th state, by opening its 5,000th store in Wasilla, Alaska. The company announced in December that it had acquired online automotive retailer AutoAnything.com. In 2012, AutoZone entered the Brazilian market by opening a store in Sao Paulo, Brazil. In December 2012, AutoZone purchased AutoAnything.com, an e-commerce leader in aftermarket automotive parts based in San Diego, California. In 2014, the company acquired Interamerican Motor Corporation, a distributor of imported replacement parts. The deal gave AutoZone access to European and Asian markets. By November 2015, the company had expanded its hub stores to include mega hubs in Atlanta, Chicago, Los Angeles, Memphis, and New Jersey. Between 2012 and 2016, AutoZone's stock valuation doubled in value. By April 2017, AutoZone had been the largest retailer of automotive parts in North America for three consecutive years. As of August 2017, AutoZone had 5,465 locations in the United States, 524 locations in Mexico, and 46 locations in Brazil, for a total of 6,035. The company opened its 6,000th store, in Memphis, Tennessee, on August 25, 2017. In February 2018, AutoZone announced it had sold IMC to Parts Authority and AutoAnything to Kingswood Capital. In September, the company introduced next-day home delivery on online orders in 83 US markets. The service included 100,000 products and expanded to 95 markets by the end of the year. On October 22, 2018, Pitt Hyde announced that he would be stepping down from AutoZone's board of directors. By June 2019, the company had 174 hub stores and 28 mega hubs, with plans to continue expanding. 2020s In March 2020, during the early days of the COVID-19 pandemic, AutoZone introduced free curbside pickup for all buy online and pickup in store orders. In late May, two AutoZone stores were destroyed by arson during the George Floyd protests in Minneapolis–Saint Paul. By September 2021, the company had 58 mega hubs and announced plans to open 20 more over the next year. In 2023, after years functioning as a shared services center, DataZone was renamed to AutoZone Business and Technology Store Support Center. In June 2023, Rhodes announced his intention to step down as president and CEO in January 2024. Phillip Daniele was promoted to president and CEO, with Rhodes remaining as executive chairman. By May 2024, AutoZone opened over 100 mega hubs stores. Corporate affairs AutoZone is incorporated in the state of Nevada. Headquarters Since October 1995, AutoZone has been headquartered in its J.R. Hyde, III Store Support Center (SSC), a 270,000-square-foot (25,000 m2), eight-story building in Downtown Memphis, Tennessee. As of 2013 there were over 1,200 employees there. The project manager of the building's construction was Rob Norcross, a principal at LRK Inc. The building has the capability to withstand a 9.0 magnitude earthquake because it has a special base isolation system that had a price tag of $950,000. Private labels AutoZone sells lead-acid car batteries (manufactured primarily by Johnson Controls) and other automotive parts using its Valucraft and Duralast private label brands. AutoZone also sells tools under the Duralast brand. Retail stores AutoZone's 7,657 retail outlets as of August 30, 2025 throughout the United States, Mexico and Brazil stock a variety of aftermarket parts as well as some OEM parts. All AutoZone stores are corporately owned; the company does not have franchise operations. Sponsorships In 2004, AutoZone celebrated its 25th anniversary and announced a corporate sponsorship agreement with auto racing association NASCAR. In 2007, AutoZone sponsored Kevin Harvick and Timothy Peters in the NASCAR Busch Series. AutoZone holds the naming rights to the downtown Memphis baseball stadium that is the home of the Memphis Redbirds of the Pacific Coast League. The company also sponsors the AutoZone Liberty Bowl. The AutoZone Liberty Bowl, alongside the College Football Playoff Foundation donated $250,136.03 to the St. Jude Children's Research Hospital. The AutoZone Liberty Bowl awarded 2018's Distinguished Citizen Award to Priscilla Presley. They are an official sponsor of Bellator MMA, the world's second largest Mixed Martial Arts promotion. Lawsuits State prosecutors and the district attorneys of San Bernardino, Monterey, San Diego, and San Joaquin counties sued AutoZone in 2005, accusing the company of mishandling used motor oil and overcharging customers. AutoZone agreed to pay $1.5 million to settle the case. AutoZone faced a lawsuit for gender discrimination in which the plaintiff alleged that men treated her differently when she was promoted and that she feared revealing a pregnancy to her superior. When the pregnancy was discovered, she alleges that her district manager pressured her to step down from her position. She was demoted in February 2006 and fired in November 2011. The jury on the case ruled in 2014 in favor of the plaintiff, awarding her $185 million in punitive damages as well as approximately $873,000 in back wages. AutoZone has announced its intention to appeal the verdict. The Wall Street Journal's Jacob Gershman suggested that the verdict would be scaled back. In 2018, AutoZone paid $3.3 million to settle a lawsuit stemming from a 2016 crash that killed three after an AutoZone-owned truck rear-ended a stalled vehicle. The suit alleged that AutoZone was negligent in training the driver of the truck. A Georgia woman was fired after a customer insulted her and used multiple racial epithets against her. In 2018, she filed a lawsuit against the company for violating her civil rights, alleging that the district manager told her to \"suck it up.\" In June 2019, AutoZone entered into an $11 million settlement against with the State of California to resolve allegations that the company had violated state laws governing hazardous waste, hazardous materials, and confidential consumer information. AutoZone is charged with illegally disposing of millions of hazardous waste items, including used motor oil and automotive fluids, at landfills not authorized to accept hazardous waste."
}