{
  "ticker": "BALL",
  "cik": "0000009389",
  "company_name": "Ball Corporation",
  "corrected_name": "Ball Corporation",
  "wiki_title_used": "Ball Corporation",
  "exists": true,
  "raw_text": "Ball Corporation is an American aluminum manufacturing company headquartered in Westminster, Colorado. It is best known for its early production of glass jars, lids, and related products used for home canning. Since its founding in Buffalo, New York, in 1880, when it was known as the Wooden Jacket Can Company, the Ball company has expanded and diversified into other business ventures, including aerospace technology. It eventually became the world's largest manufacturer of recyclable aluminum packaging for a variety of beverage, home and personal care applications.\nThe Ball brothers renamed their business the Ball Brothers Glass Manufacturing Company, incorporated in 1886. Its headquarters, as well as its glass and metal manufacturing operations, were moved to Muncie, Indiana, by 1889. The business was renamed the Ball Brothers Company in 1922 and the Ball Corporation in 1969. It became a publicly traded stock company on the New York Stock Exchange under the ticker BLL in 1973. On May 10, 2022, the company changed its ticker symbol to BALL.\nBall no longer produces glass mason jars and left the home canning business altogether in 1996 by spinning off a former subsidiary (Alltrista) into a free-standing company, which renamed itself Jarden Corporation. In 2016, Jarden Corporation merged with Newell Rubbermaid to become Newell Brands who owns the Ball brand for mason jars and home canning supplies.\n\nHistory\nEarly years\nIn 1880, Frank C. and Edmund B. Ball borrowed close to $200 from George Harvey Ball, their uncle and founder and first president of Keuka College, to purchase the Wooden Jacket Can Company, a small manufacturing business located in Buffalo, New York. Soon, William, Lucius, and George Ball joined their brothers, Frank and Edmund, in Buffalo. (Years later, the brothers reciprocated their uncle's early assistance by providing financial support to Keuka College.)\nThe Ball brothers' company made tin cans encased in wooden jackets to hold kerosene, paints, or varnishes. Because the acid used to refine kerosene caused corrosion in tin, the brothers decided to use glass for the inserts of the wood-jacketed cans. Initially, they bought the glass containers from a factory in Poughkeepsie, New York. Around 1885 a group of Belgian glassblowers who were passing through Buffalo encouraged the Ball brothers to build their own factory. The Ball brothers purchased land in East Buffalo, where they built a two-story brick building for the stamping works and a one-story frame factory for the glass works. Although a fire destroyed an early glass factory in Buffalo, the brothers rebuilt and expanded the business. To keep the new factory's furnace operating at full capacity, the company introduced new products and made improvements to its glass and metal manufacturing processes.\nAround 1884, when the brothers discovered that the Mason Improved fruit jar patent was due to expire, their company began manufacturing canning jars in their glassworks. The Ball Brothers' jars, which were produced in half-gallon, pint, and midget sizes, were manufactured during 1884, 1885, and 1886. \"Buffalo\" jar lids were produced in a Ball Brother metal fabricating factory. The brothers decided to add their logo onto the surface of the glass jars, which were amber or aqua (blue-green) at the time.\nOn February 13, 1886, the five brothers incorporated the business under the name Ball Brothers Manufacturing Company. About the same time the factory in Buffalo was destroyed by fire in 1886, the brothers began to consider moving their business closer to natural gas supplies. While on a business trip in Cleveland, Ohio, Frank heard about the natural gas boom in Findlay, Ohio. After visiting the town, he told Edmund about the economic advantages of using natural gas instead of coal for manufacturing glass. Edmund visited several towns in the gas fields, including Muncie, Indiana. The two brothers decided to make a more extensive trip to investigate the possibility of establishing a glass factory closer to an abundant supply of natural gas. They briefly had doubts about extending beyond Buffalo, but decided to explore the use of natural gas as a means of expanding their glass-making business.\nFrank and Edmund first visited in Fostoria, Ohio, where they were enthusiastically welcomed. The next stop was Bowling Green, Ohio. After a night in town, Edmund returned to Buffalo, but Frank remained. After Frank had been in Bowling Green for about a week, he received a telegram from James Boyce, a Muncie businessman. Frank, who had become weary of Bowling Green, was ready for a change and \"decided to run down to Muncie and see what they had to offer.\" As Frank recalled his early discussions with Muncie's town leaders, \"There was nothing about the town that particularly appealed to me, but the men were all courteous, kind, and businesslike.\" Frank agreed to a proposal that offered the Ball brothers 7 acres (2.8 hectares) of land for a factory site, a gas well, and $5,000 in cash to encourage the move to Muncie. In addition, city officials agreed to provide a railroad connection to the brothers' new facilities. By September 1887 construction had begun on the Muncie factory and the Ball brothers began plans to move their glass manufacturing operations from New York. Frank remained in Muncie to get the factory up and running, while Edmund closed the glass factory in Buffalo, then moved to Muncie to join Frank. Their brothers, William and George, remained in Buffalo to operate the stamping works and a factory in Bath, New York.\nIn 1888 the company opened its first glass manufacturing facility in Muncie. On February 18 fires were started in the new factory's furnace; on March 1 its first glass products were made. The first products to be manufactured in the Muncie factory were oil containers and lamp chimneys, not fruit jars. By 1889 the Ball company's headquarters and its glass and metal manufacturing operations had moved to Muncie. The other Ball brothers moved to Indiana in the 1890s. George moved  to Muncie in 1893, William arrived in 1897, and Lucius, a company shareholder and a physician, moved to Muncie in 1894.\nIn the late nineteenth century, the company continued to grow and prosper, but not without experiencing some challenges. Fires at its Muncie factories and warehouses in 1891 and 1898 damaged its facilities, which were eventually rebuilt. Despite the economic panic of 1893, the company was able to produce 22 million fruit jars for the year beginning in September 1894, and 37 million jars by 1897. When natural gas supplies in the area began to diminish, the Ball brothers installed gas converters to use Indiana coal in their factories and continued manufacturing operations. The company's F. C. Ball machine, patented in 1898, introduced mass production into its glass-blowing process and gave it a competitive market advantage. By 1905 the company was producing 60 million canning jars per year and had acquired other glass manufacturers, expanding its operations to include seven factories in addition to its main facilities at Muncie.\nIn a continuation of the company's difficulties in Muncie, workers organized with Local 200 (Glass Workers) of the Industrial Workers of the World (IWW) at the main facility, and went on strike in March 1910 in advocacy of wage increases. A settlement was quickly reached on March 29, but company management reneged on the agreement and threatened to declare a lockout. The strike continued, but was weakened by the refusal of machinists affiliated with the American Federation of Labor to join the strike. By the end of April, the strike was over.\n\nDiversification\nFor over 90 years, Ball continued to be a family-owned business. Renamed the Ball Brothers Company in 1922, it remained well known for manufacturing fruit jars, lids, and related products for home canning. The company also entered into other business ventures. Because the four main components of their core product line of canning jars included glass, zinc, rubber, and paper, the Ball company acquired a zinc strip rolling mill to produce metal lids for their glass jars, manufactured rubber sealing rings for the jars, and acquired a paper mill to fabricate the packaging used in shipping their products. The company also acquired tin, steel, and later, plastic companies.\nThe Ball company faced additional challenges and opportunities during the Great Depression and World War II. Prior to 1933, Ball was the largest domestic manufacturer of home canning jars. In 1939 it manufactured 54% of all the canning jars made in the US. A drop in demand for the jars during the 1930s led the Ball brothers to begin manufacturing other types of jars and bottles for commercial use, and eventually expanding into other lines of business. During World War II the company's operations were converted to produce shells and machine parts for the military. \nAfter the war, Ball's glass-making business was hindered by an antitrust case in which the company was one of several defendants. The legal case was appealed to the U.S. Supreme Court. The final decision, which was handed down in 1947, restricted Ball's ability to acquire other glass manufacturers and other businesses producing glass-making machinery without prior court approval. In 1949 decreasing demand for canning jars caused the company to suffer its first net operating loss. With legal restrictions on the company's ability to expand its glass-making business and declining demand for its canning jars, Ball company executives decided to diversify the company to achieve growth.\nThroughout the 1950s the Ball company explored expanding into the aerospace industry. The Ball Brothers Research Corporation began operating laboratories in Boulder, Colorado, and in Muncie. The company first began manufacturing aerospace equipment around 1959. Its OSO-1 (Orbiting Solar Observatory) satellite, designed and built for the National Aeronautics and Space Administration (NASA) with $1.4 million in grants, launched into space on March 7, 1962, at Cape Canaveral, Florida. Its success led to additional contracts to build more satellites, a total of seven, but not without setbacks. An explosion killed three workers and damaged the company's OSO-2 satellite in 1964.\nThe company continued to expand into other areas including avionics, aerospace systems, and metal beverage and food containers. Renamed the Ball Corporation in 1969, it acquired Jeffco Manufacturing Company, a maker of recyclable aluminum beverage cans, and became the largest producer of recyclable beverage cans in the world. Although glass production in Muncie ceased in 1962, it continued at other Ball plants until its final glass manufacturing operations were sold in 1996.\nBall Corporation's stock went public on July 13, 1972. It became a publicly traded stock company on the New York Stock Exchange in 1973. The stock began trading at $26 per share (not split adjusted) on the NYSE on December 17, 1973. Ball stock has split two-for-one six times since going public. Ball's trading symbol is BALL.\nBall no longer produces its glass canning jars. In 1996, Ball exited the home-canning business when it established a subsidiary named Alltrista, which consisted of seven smaller Ball subsidiaries that included the Ball jar and other canning-related products. When Alltrista Corporation became a separate company in April 1993, Ball shareholders received one share of Alltrista stock for every four shares of Ball stock. Alltrista was renamed Jarden Corporation in 2001. In 2016, Jarden merged with Newell Rubbermaid to become Newell Brands. Today, Newell Brands has the license to use the Ball registered trademark on its line of home-canning products.\nBall became the largest supplier of cans in the Chinese market when it acquired M.C. Packaging Ltd. in China in 1997. In 1998, the Ball Corporation moved its corporate headquarters from Muncie to Broomfield, Colorado, where it would oversee global operations as a manufacturer of metal food and beverage containers, as well as a manufacturer of equipment and supplier of services to the aerospace industry.\nContinuing its growth through acquisition, in 2002, Ball acquired Schmalbach-Lubeca AG, a German-based metal-can beverage company and created Ball Packaging Europe. This move boosted Ball's beverage can sales by more than US$1 billion annually.\nSensing an opportunity to expand its packaging business in other categories, Ball entered the steel aerosol business in 2006 with the acquisition of U.S. Can, an U.S.-based steel aerosol and specialty metal packaging company.\n2009 brought two milestones to Ball Corporation. First, on March 6, 2009, the Ball Aerospace-built Kepler space telescope carrying the largest camera ever sent by NASA beyond Earth's orbit, was successfully launched aboard a Delta II rocket from Cape Canaveral, Florida. The second milestone arrived when Ball acquired four metal beverage can plants from AB InBev.\nJust one year later in 2010, Ball owned the title of the largest supplier of aluminum slugs in the world with two acquisitions of Neuman Aluminum and Aerocan S.A.S.\nIn 2016, Ball acquired British firm Rexam plc to become the world's largest producer of aluminum beverage cans.\nSpearheading innovation in the aluminum beverage space, Ball introduced its innovative lightweight Ball Aluminum Cup in 2019. The cup was recognized in Fast Company's 2020 World Changing Ideas Awards with an honorable mention in the consumer products category. The cup is popular in sports and entertainment arenas and venues.\nWith the opportunity in sports and entertainment ripe, in 2020, Ball acquired the naming rights of Pepsi Center in Downtown Denver and renamed it Ball Arena. The naming rights were sold to Ball as a part of a global multi-year agreement with Kroenke Sports & Entertainment (KSE).\nIn 2024, Ball Corporation left the aerospace business after selling Ball Aerospace to BAE Systems Inc. for $5.6 billion in cash. The move was strategic in allowing Ball to increase its focus on \"low-carbon, best-value aluminum packaging initiatives\", said CEO Dan Fisher at the time.\nIn Q1 of 2025, Ball announced the sale of its Ball Aluminum Cup business and the forming of a joint venture named Oasis Venture Holdings. The majority owner, Ayna.AI, a leading strategic advisory and implementation firm in the industrial technology space, will accelerate the continued development and growth of the Aluminum Cup category.\n\nCompany milestones\n1880, Frank and Edmund Ball acquired the Wood Jacket Can Company, the predecessor to the Ball Corporation, in Buffalo, New York\n1886, incorporated as Ball Brothers Glass Manufacturing Company\n1887, a new glass factory was built in Muncie, Indiana; metal manufacturing operations continued at Buffalo and Bath, New York\n1889, the company's metal fittings operations were moved to Muncie\n1897, F. C. Ball Machine, the world's first semiautomatic glass machine, was invented (U.S. patent number 610515, issued in 1898)\n1909, The Correct Method for Preserving Fruit, predecessor to The Ball Blue Book was published; it featured home-canning recipes and techniques.\n1922, name changed to Ball Brothers Company\n1945, fire causes $500,000 in damages to Ball's glass plant number one in Muncie\n1956, Ball formed Ball Brothers Research Corporation to produce goods and services for the aerospace sector. This was converted to a wholly owned subsidiary, Ball Aerospace & Technologies Corp., in 1995.\n1961, Ball purchased Industrial Rubber of St. Joseph, MI. which was later sold to Chardon Rubber in 1978.\n1962, Ball's Muncie glass plant is closed\n1969, company name is changed to the Ball Corporation\n1969, Ball enters beverage can manufacturing by acquiring Jeffco Manufacturing Co.\n1973, Ball became a publicly traded stock listed on New York Stock Exchange\n1993, Alltrista, a Ball subsidiary, was spun off into a separate corporation. Renamed the Jarden Corporation in 2002, Jarden merged with Newell Rubbermaid to become Newell Brands in 2016. Today, Newell Brands uses the Ball registered trademark on its line of home-canning products.\n1994, Ball began manufacturing PET plastic containers.\n1995, Ball created Ball-Foster Glass Container Co., a joint venture glass company with Saint-Gobain.\n1996, Ball exited the glass business, selling its interests in Ball-Foster to Saint-Gobain.\n1996, Ball enters the Brazilian beverage can manufacturing business forming the Ball-Embalagens Ltda joint-venture.\n1998, corporate headquarters relocated from Muncie, Indiana, to Broomfield, Colorado\n2002, Ball acquired Schmalbach-Lubeca AG, the German-based metal beverage container company, and created Ball Packaging Europe.\n2005, Ball celebrated its 125th anniversary.\n2006, Ball acquired U.S. Can, Inc., the largest U.S. manufacturer of aerosol cans.\n2008, Ball Corporation issued its first sustainability report.\n2010, Ball acquired Aerocan S.A.S., makers of aluminum aerosol cans and bottles, for $292 million.\n2010, Ball exits the plastics business, selling its interests to Amcor plc.\n2016, Ball acquired Rexam, a UK-based packaging company\n2020, Ball acquired Tubex Industria E Comercio de Embalagens Ltda in Brazil, for $80 million.\n2020, Ball acquired the naming rights of Pepsi Center in Downtown Denver and renamed it Ball Arena.\n2024, Ball divested Ball Aerospace to BAE Systems for $5.6 billion in cash, and acquired Alucan.\n2025, Ball acquired Florida Can Manufacturing and agreed to sell its Ball Aluminum Cup business to Ayna.Ai.\n\nEnvironmental record\nBall Corporation has made improvements to its environmental record since 2006, when the company began its first formal sustainability efforts. In 2008, Ball Corporation issued its first sustainability report and began releasing subsequent sustainability reports on its website including the most recent Combined Annual & Sustainability Report. The first report was an ACCA-Ceres North American Sustainability Awards cowinner of the Best First Time Reporter award in 2009.\nMost recently, Ball has been recognized as a sustainability leader by organizations and governing bodies such as TIME's list of the World's Most Sustainable Companies of 2024, USA Today and Statista's 2024 list of America's Climate Leaders, FTSE4Good's 2024 Index Series, S&P Global's Sustainability Yearbook in 2023 and 2024, Newsweek's 2020, 2021, 2022, 2023, and 2024 lists of America's Most Responsible Companies and the 2022 Dow Jones Sustainability Index (DJSI), among many others.\n\nSee also\nReferences\nNotes\n\nBibliography\n\nAfrica, Philip A. (1974). Keuka College: A History. Valley Forge, PA: Judson Press. OCLC 745947.\n\"Alltrista Corporation\". International Directory of Company Histories. Vol. 30. St. James Press. 2000. Archived from the original on April 3, 2014. Retrieved March 25, 2016 – via Funding Universe.\nBall, Edmund F. (1960). From Fruit Jars to Satellites: The Story of Ball Brothers Company, Incorporated. New York: Necomen Society in North America. OCLC 958552.\nBall, Frank Clayton (1937). Memoirs of Frank Clayton Ball. Muncie, IN: Scott Printing Company. OCLC 3918177.\n\"Ball Corp\". PERI: Toxic 100 Index. Political Economy Research Institute. August 2013. Retrieved March 25, 2016.\n\"Ball Corporation-Chemicals\". Political Economy Research Institute. Archived from the original on July 22, 2011. Retrieved July 22, 2010.\n\"Ball Corporation, Form 8-K, Current Report, Filing Date January 27, 1994\". secdatabase.com. Retrieved February 5, 2013.\n\"Ball Corporation, Form 10-K, Annual Report, Filing Date April 1, 1996\". secdatabase.com. Retrieved February 5, 2013.\n\"Ball Corporation, Form 10-K, Annual Report, Filing Date March 12, 2004\" (PDF). secdatabase.com. Retrieved February 5, 2013.\n\"Ball Corporation, Form 10-K, Annual Report, Filing Date February 22, 2012\" (PDF). secdatabase.com. Retrieved February 5, 2013.\nBall Corporation: 2014 Sustainability Report (PDF) (Report). Broomfield, CO: Ball Corporation. 2014. Archived from the original (PDF) on April 19, 2015. Retrieved April 8, 2016.\nBirmingham, Frederic Alexander (1980). Ball Corporation: The First Century. Indianapolis, IN: Curtis Publishing Company. ISBN 9780893870393.\nBoomhower, Ray (Winter 1995). \"Destination Indiana: Oakhurst, East-Central Indiana's Natural Beauty\". Traces of Indiana and Midwestern History. 7 (1). Indianapolis: Indiana Historical Society: 44.\nBrantley, William F. (1975). A Collector's Guide to Ball Jars. Muncie IN: Rosemary Humbert Martin. OCLC 3104299.\n\"Company History\". Jarden Corporation. Archived from the original on March 25, 2016. Retrieved March 25, 2016.\nConn, Earl (2003). Beneficence: Stories about the Ball Families of Muncie. Muncie, IN: Minnetrista Cultural Foundation. ISBN 1-884586-09-0.\nEdmonds, Anthony O.; Geelhoed, E. Bruce (2001). Ball State University: An Interpretive History. Bloomington, IN: Indiana University Press. ISBN 9780253340177.\nGelsi, Steve (December 8, 2010). \"Ball Corp. Acquiring Aerocan for $292 Million\". MarketWatch. Retrieved December 23, 2010.\nQuigley, Barbara (2015). Gugin, Linda C.; St. Clair, James E. (eds.). Indiana's 200: The People Who Shaped the Hoosier State. Indianapolis: Indiana Historical Society Press. ISBN 978-0-87195-387-2.\n\"Saint-Gobain buys out American partner\". The New York Times. Associated Press. September 17, 1996. Retrieved November 2, 2009.\n\"Saint-Gobain joins with Ball on glass venture\". The New York Times. Bloomberg News. June 28, 1995. Retrieved November 2, 2009.\nToward a Sustainable Future: Ball Corporation 2007 Sustainability Report (PDF) (Report). Broomfield, CO: Ball Corporation. 2008. Archived from the original (PDF) on October 29, 2014. Retrieved March 25, 2016.\n\"Toxic 100 Air Polluters Index: 2004 report, based on 2002 data\". Political Economy Research Institute. Archived from the original on May 7, 2013. Retrieved March 25, 2016.\n\"Toxic 100 Air Polluters Index: 2008 report, based on 2005 data\". Political Economy Research Institute. Archived from the original on March 26, 2016. Retrieved March 25, 2016.\n\"Toxic 100 Air Polluters, 2010 report\". Political Economy Research Institute. Archived from the original on March 4, 2016. Retrieved March 25, 2016.\nFurther reading\n\nGlass, James A. (December 2000). \"The Gas Boom of East Central Indiana\". Indiana Magazine of History. 96 (4). Bloomington: Indiana University: 313–335. Retrieved March 31, 2016.\nMyers, George E. (1965). The Story of Ball Brothers. Ball Brothers Company.\n\nExternal links\n\nOfficial website\nBusiness data for Ball Corporation:",
  "clean_text": "Ball Corporation is an American aluminum manufacturing company headquartered in Westminster, Colorado. It is best known for its early production of glass jars, lids, and related products used for home canning. Since its founding in Buffalo, New York, in 1880, when it was known as the Wooden Jacket Can Company, the Ball company has expanded and diversified into other business ventures, including aerospace technology. It eventually became the world's largest manufacturer of recyclable aluminum packaging for a variety of beverage, home and personal care applications. The Ball brothers renamed their business the Ball Brothers Glass Manufacturing Company, incorporated in 1886. Its headquarters, as well as its glass and metal manufacturing operations, were moved to Muncie, Indiana, by 1889. The business was renamed the Ball Brothers Company in 1922 and the Ball Corporation in 1969. It became a publicly traded stock company on the New York Stock Exchange under the ticker BLL in 1973. On May 10, 2022, the company changed its ticker symbol to BALL. Ball no longer produces glass mason jars and left the home canning business altogether in 1996 by spinning off a former subsidiary (Alltrista) into a free-standing company, which renamed itself Jarden Corporation. In 2016, Jarden Corporation merged with Newell Rubbermaid to become Newell Brands who owns the Ball brand for mason jars and home canning supplies. History Early years In 1880, Frank C. and Edmund B. Ball borrowed close to $200 from George Harvey Ball, their uncle and founder and first president of Keuka College, to purchase the Wooden Jacket Can Company, a small manufacturing business located in Buffalo, New York. Soon, William, Lucius, and George Ball joined their brothers, Frank and Edmund, in Buffalo. (Years later, the brothers reciprocated their uncle's early assistance by providing financial support to Keuka College.) The Ball brothers' company made tin cans encased in wooden jackets to hold kerosene, paints, or varnishes. Because the acid used to refine kerosene caused corrosion in tin, the brothers decided to use glass for the inserts of the wood-jacketed cans. Initially, they bought the glass containers from a factory in Poughkeepsie, New York. Around 1885 a group of Belgian glassblowers who were passing through Buffalo encouraged the Ball brothers to build their own factory. The Ball brothers purchased land in East Buffalo, where they built a two-story brick building for the stamping works and a one-story frame factory for the glass works. Although a fire destroyed an early glass factory in Buffalo, the brothers rebuilt and expanded the business. To keep the new factory's furnace operating at full capacity, the company introduced new products and made improvements to its glass and metal manufacturing processes. Around 1884, when the brothers discovered that the Mason Improved fruit jar patent was due to expire, their company began manufacturing canning jars in their glassworks. The Ball Brothers' jars, which were produced in half-gallon, pint, and midget sizes, were manufactured during 1884, 1885, and 1886. \"Buffalo\" jar lids were produced in a Ball Brother metal fabricating factory. The brothers decided to add their logo onto the surface of the glass jars, which were amber or aqua (blue-green) at the time. On February 13, 1886, the five brothers incorporated the business under the name Ball Brothers Manufacturing Company. About the same time the factory in Buffalo was destroyed by fire in 1886, the brothers began to consider moving their business closer to natural gas supplies. While on a business trip in Cleveland, Ohio, Frank heard about the natural gas boom in Findlay, Ohio. After visiting the town, he told Edmund about the economic advantages of using natural gas instead of coal for manufacturing glass. Edmund visited several towns in the gas fields, including Muncie, Indiana. The two brothers decided to make a more extensive trip to investigate the possibility of establishing a glass factory closer to an abundant supply of natural gas. They briefly had doubts about extending beyond Buffalo, but decided to explore the use of natural gas as a means of expanding their glass-making business. Frank and Edmund first visited in Fostoria, Ohio, where they were enthusiastically welcomed. The next stop was Bowling Green, Ohio. After a night in town, Edmund returned to Buffalo, but Frank remained. After Frank had been in Bowling Green for about a week, he received a telegram from James Boyce, a Muncie businessman. Frank, who had become weary of Bowling Green, was ready for a change and \"decided to run down to Muncie and see what they had to offer.\" As Frank recalled his early discussions with Muncie's town leaders, \"There was nothing about the town that particularly appealed to me, but the men were all courteous, kind, and businesslike.\" Frank agreed to a proposal that offered the Ball brothers 7 acres (2.8 hectares) of land for a factory site, a gas well, and $5,000 in cash to encourage the move to Muncie. In addition, city officials agreed to provide a railroad connection to the brothers' new facilities. By September 1887 construction had begun on the Muncie factory and the Ball brothers began plans to move their glass manufacturing operations from New York. Frank remained in Muncie to get the factory up and running, while Edmund closed the glass factory in Buffalo, then moved to Muncie to join Frank. Their brothers, William and George, remained in Buffalo to operate the stamping works and a factory in Bath, New York. In 1888 the company opened its first glass manufacturing facility in Muncie. On February 18 fires were started in the new factory's furnace; on March 1 its first glass products were made. The first products to be manufactured in the Muncie factory were oil containers and lamp chimneys, not fruit jars. By 1889 the Ball company's headquarters and its glass and metal manufacturing operations had moved to Muncie. The other Ball brothers moved to Indiana in the 1890s. George moved to Muncie in 1893, William arrived in 1897, and Lucius, a company shareholder and a physician, moved to Muncie in 1894. In the late nineteenth century, the company continued to grow and prosper, but not without experiencing some challenges. Fires at its Muncie factories and warehouses in 1891 and 1898 damaged its facilities, which were eventually rebuilt. Despite the economic panic of 1893, the company was able to produce 22 million fruit jars for the year beginning in September 1894, and 37 million jars by 1897. When natural gas supplies in the area began to diminish, the Ball brothers installed gas converters to use Indiana coal in their factories and continued manufacturing operations. The company's F. C. Ball machine, patented in 1898, introduced mass production into its glass-blowing process and gave it a competitive market advantage. By 1905 the company was producing 60 million canning jars per year and had acquired other glass manufacturers, expanding its operations to include seven factories in addition to its main facilities at Muncie. In a continuation of the company's difficulties in Muncie, workers organized with Local 200 (Glass Workers) of the Industrial Workers of the World (IWW) at the main facility, and went on strike in March 1910 in advocacy of wage increases. A settlement was quickly reached on March 29, but company management reneged on the agreement and threatened to declare a lockout. The strike continued, but was weakened by the refusal of machinists affiliated with the American Federation of Labor to join the strike. By the end of April, the strike was over. Diversification For over 90 years, Ball continued to be a family-owned business. Renamed the Ball Brothers Company in 1922, it remained well known for manufacturing fruit jars, lids, and related products for home canning. The company also entered into other business ventures. Because the four main components of their core product line of canning jars included glass, zinc, rubber, and paper, the Ball company acquired a zinc strip rolling mill to produce metal lids for their glass jars, manufactured rubber sealing rings for the jars, and acquired a paper mill to fabricate the packaging used in shipping their products. The company also acquired tin, steel, and later, plastic companies. The Ball company faced additional challenges and opportunities during the Great Depression and World War II. Prior to 1933, Ball was the largest domestic manufacturer of home canning jars. In 1939 it manufactured 54% of all the canning jars made in the US. A drop in demand for the jars during the 1930s led the Ball brothers to begin manufacturing other types of jars and bottles for commercial use, and eventually expanding into other lines of business. During World War II the company's operations were converted to produce shells and machine parts for the military. After the war, Ball's glass-making business was hindered by an antitrust case in which the company was one of several defendants. The legal case was appealed to the U.S. Supreme Court. The final decision, which was handed down in 1947, restricted Ball's ability to acquire other glass manufacturers and other businesses producing glass-making machinery without prior court approval. In 1949 decreasing demand for canning jars caused the company to suffer its first net operating loss. With legal restrictions on the company's ability to expand its glass-making business and declining demand for its canning jars, Ball company executives decided to diversify the company to achieve growth. Throughout the 1950s the Ball company explored expanding into the aerospace industry. The Ball Brothers Research Corporation began operating laboratories in Boulder, Colorado, and in Muncie. The company first began manufacturing aerospace equipment around 1959. Its OSO-1 (Orbiting Solar Observatory) satellite, designed and built for the National Aeronautics and Space Administration (NASA) with $1.4 million in grants, launched into space on March 7, 1962, at Cape Canaveral, Florida. Its success led to additional contracts to build more satellites, a total of seven, but not without setbacks. An explosion killed three workers and damaged the company's OSO-2 satellite in 1964. The company continued to expand into other areas including avionics, aerospace systems, and metal beverage and food containers. Renamed the Ball Corporation in 1969, it acquired Jeffco Manufacturing Company, a maker of recyclable aluminum beverage cans, and became the largest producer of recyclable beverage cans in the world. Although glass production in Muncie ceased in 1962, it continued at other Ball plants until its final glass manufacturing operations were sold in 1996. Ball Corporation's stock went public on July 13, 1972. It became a publicly traded stock company on the New York Stock Exchange in 1973. The stock began trading at $26 per share (not split adjusted) on the NYSE on December 17, 1973. Ball stock has split two-for-one six times since going public. Ball's trading symbol is BALL. Ball no longer produces its glass canning jars. In 1996, Ball exited the home-canning business when it established a subsidiary named Alltrista, which consisted of seven smaller Ball subsidiaries that included the Ball jar and other canning-related products. When Alltrista Corporation became a separate company in April 1993, Ball shareholders received one share of Alltrista stock for every four shares of Ball stock. Alltrista was renamed Jarden Corporation in 2001. In 2016, Jarden merged with Newell Rubbermaid to become Newell Brands. Today, Newell Brands has the license to use the Ball registered trademark on its line of home-canning products. Ball became the largest supplier of cans in the Chinese market when it acquired M.C. Packaging Ltd. in China in 1997. In 1998, the Ball Corporation moved its corporate headquarters from Muncie to Broomfield, Colorado, where it would oversee global operations as a manufacturer of metal food and beverage containers, as well as a manufacturer of equipment and supplier of services to the aerospace industry. Continuing its growth through acquisition, in 2002, Ball acquired Schmalbach-Lubeca AG, a German-based metal-can beverage company and created Ball Packaging Europe. This move boosted Ball's beverage can sales by more than US$1 billion annually. Sensing an opportunity to expand its packaging business in other categories, Ball entered the steel aerosol business in 2006 with the acquisition of U.S. Can, an U.S.-based steel aerosol and specialty metal packaging company. 2009 brought two milestones to Ball Corporation. First, on March 6, 2009, the Ball Aerospace-built Kepler space telescope carrying the largest camera ever sent by NASA beyond Earth's orbit, was successfully launched aboard a Delta II rocket from Cape Canaveral, Florida. The second milestone arrived when Ball acquired four metal beverage can plants from AB InBev. Just one year later in 2010, Ball owned the title of the largest supplier of aluminum slugs in the world with two acquisitions of Neuman Aluminum and Aerocan S.A.S. In 2016, Ball acquired British firm Rexam plc to become the world's largest producer of aluminum beverage cans. Spearheading innovation in the aluminum beverage space, Ball introduced its innovative lightweight Ball Aluminum Cup in 2019. The cup was recognized in Fast Company's 2020 World Changing Ideas Awards with an honorable mention in the consumer products category. The cup is popular in sports and entertainment arenas and venues. With the opportunity in sports and entertainment ripe, in 2020, Ball acquired the naming rights of Pepsi Center in Downtown Denver and renamed it Ball Arena. The naming rights were sold to Ball as a part of a global multi-year agreement with Kroenke Sports & Entertainment (KSE). In 2024, Ball Corporation left the aerospace business after selling Ball Aerospace to BAE Systems Inc. for $5.6 billion in cash. The move was strategic in allowing Ball to increase its focus on \"low-carbon, best-value aluminum packaging initiatives\", said CEO Dan Fisher at the time. In Q1 of 2025, Ball announced the sale of its Ball Aluminum Cup business and the forming of a joint venture named Oasis Venture Holdings. The majority owner, Ayna.AI, a leading strategic advisory and implementation firm in the industrial technology space, will accelerate the continued development and growth of the Aluminum Cup category. Company milestones 1880, Frank and Edmund Ball acquired the Wood Jacket Can Company, the predecessor to the Ball Corporation, in Buffalo, New York 1886, incorporated as Ball Brothers Glass Manufacturing Company 1887, a new glass factory was built in Muncie, Indiana; metal manufacturing operations continued at Buffalo and Bath, New York 1889, the company's metal fittings operations were moved to Muncie 1897, F. C. Ball Machine, the world's first semiautomatic glass machine, was invented (U.S. patent number 610515, issued in 1898) 1909, The Correct Method for Preserving Fruit, predecessor to The Ball Blue Book was published; it featured home-canning recipes and techniques. 1922, name changed to Ball Brothers Company 1945, fire causes $500,000 in damages to Ball's glass plant number one in Muncie 1956, Ball formed Ball Brothers Research Corporation to produce goods and services for the aerospace sector. This was converted to a wholly owned subsidiary, Ball Aerospace & Technologies Corp., in 1995. 1961, Ball purchased Industrial Rubber of St. Joseph, MI. which was later sold to Chardon Rubber in 1978. 1962, Ball's Muncie glass plant is closed 1969, company name is changed to the Ball Corporation 1969, Ball enters beverage can manufacturing by acquiring Jeffco Manufacturing Co. 1973, Ball became a publicly traded stock listed on New York Stock Exchange 1993, Alltrista, a Ball subsidiary, was spun off into a separate corporation. Renamed the Jarden Corporation in 2002, Jarden merged with Newell Rubbermaid to become Newell Brands in 2016. Today, Newell Brands uses the Ball registered trademark on its line of home-canning products. 1994, Ball began manufacturing PET plastic containers. 1995, Ball created Ball-Foster Glass Container Co., a joint venture glass company with Saint-Gobain. 1996, Ball exited the glass business, selling its interests in Ball-Foster to Saint-Gobain. 1996, Ball enters the Brazilian beverage can manufacturing business forming the Ball-Embalagens Ltda joint-venture. 1998, corporate headquarters relocated from Muncie, Indiana, to Broomfield, Colorado 2002, Ball acquired Schmalbach-Lubeca AG, the German-based metal beverage container company, and created Ball Packaging Europe. 2005, Ball celebrated its 125th anniversary. 2006, Ball acquired U.S. Can, Inc., the largest U.S. manufacturer of aerosol cans. 2008, Ball Corporation issued its first sustainability report. 2010, Ball acquired Aerocan S.A.S., makers of aluminum aerosol cans and bottles, for $292 million. 2010, Ball exits the plastics business, selling its interests to Amcor plc. 2016, Ball acquired Rexam, a UK-based packaging company 2020, Ball acquired Tubex Industria E Comercio de Embalagens Ltda in Brazil, for $80 million. 2020, Ball acquired the naming rights of Pepsi Center in Downtown Denver and renamed it Ball Arena. 2024, Ball divested Ball Aerospace to BAE Systems for $5.6 billion in cash, and acquired Alucan. 2025, Ball acquired Florida Can Manufacturing and agreed to sell its Ball Aluminum Cup business to Ayna.Ai. Environmental record Ball Corporation has made improvements to its environmental record since 2006, when the company began its first formal sustainability efforts. In 2008, Ball Corporation issued its first sustainability report and began releasing subsequent sustainability reports on its website including the most recent Combined Annual & Sustainability Report. The first report was an ACCA-Ceres North American Sustainability Awards cowinner of the Best First Time Reporter award in 2009. Most recently, Ball has been recognized as a sustainability leader by organizations and governing bodies such as TIME's list of the World's Most Sustainable Companies of 2024, USA Today and Statista's 2024 list of America's Climate Leaders, FTSE4Good's 2024 Index Series, S&P Global's Sustainability Yearbook in 2023 and 2024, Newsweek's 2020, 2021, 2022, 2023, and 2024 lists of America's Most Responsible Companies and the 2022 Dow Jones Sustainability Index (DJSI), among many others."
}