{
  "ticker": "BAX",
  "cik": "0000010456",
  "company_name": "Baxter International",
  "corrected_name": "Baxter International",
  "wiki_title_used": "Baxter International",
  "exists": true,
  "raw_text": "Baxter International Inc. is an American multinational healthcare company with headquarters in Deerfield, Illinois.\nThe company primarily focuses on products to treat chronic and acute medical conditions. The company had 2023 global net sales of $14.8 billion (+2% vs 2022), across three business: \"Medical Product and Therapies\", \"Healthcare Systems and Technologies\" and Pharmaceuticals. \nBaxter's Medical Product and Therapies business comprise two divisions: the first named \"Advanced Surgery\" that produce technologies to enhance surgeons' technique, increase efficiencies and improve outcomes. The second named \"Infusion Therapies and Technologies\" produces intravenous products and other products used in the delivery of fluids and drugs to patients.\nBaxter's Healthcare System and Technologies business has four divisions \"Front Line Care\", \"Digital Platform and Innovations\", \"Care and Connectivity Solutions\" and \"Global Services\".  \nBaxter's Pharmaceuticals business produce inhalational anaesthetics and other differentiated hospital pharmaceuticals in areas of pain, critical care, anti-infection and oncology.\n\nHistory\nBaxter International was founded in 1931 by Donald Baxter, a Los Angeles-based medical doctor, as a manufacturer and distributor of intravenous therapy solutions. Seeing a need for products closer to the Midwest, the company opened a manufacturing plant in Glenview, Illinois, in 1933. Baxter's interest was bought out in 1935 by Ralph Falk, who established a research and development function.  In 1939 the company developed a vacuum-type collection container, extending the shelf life of blood from hours to weeks.  In 1954, the company expanded operations outside of the United States by opening an office in Belgium. In 1956 Baxter International introduced the first functioning artificial kidney, and in 1971 became a member of the Fortune 500.\nIn 1971, Baxter built a major manufacturing plant in Ashdod, Israel. As a result, the company was placed on the Arab League boycott list in the early 1980s.\nThroughout the 1980s and 1990s, the company expanded to deliver a wider variety of products and services (including vaccines and a greater variety of blood products) through acquisitions of various companies.  Sales and production facilities also expanded throughout the world.\nIn 1982, Baxter acquired Medcom, Inc., a New York-based firm founded by Richard Fuisz and his brother, that had large markets in the United States and Saudi Arabia. Baxter chief executive Vernon Loucks fired Fuisz who then brought anti-boycott charges against Baxter to the U.S. Commerce Department Office of Anti-Boycott Compliance (OAC). Fuisz alleged that Baxter had sold their profitable Ashdod facility to Teva Pharmaceutical Industries in 1988 while simultaneously negotiating the construction of a similar plant in Syria in partnership with the Syrian military in order to be removed from the Arab League blacklist in 1989. In 1993 Baxter pleaded guilty to a felony in relation to an anti-boycott law in the United States.\nOn July 15, 1985, American Hospital Supply Corporation CEO Karl D. Bays and Baxter's then-CEO Vernon R. Loucks Jr. signed an agreement that merged two of the United States' \"largest producers of medical supplies\". This was a \"one-Baxter approach\" in which the company provided \"70% to 80% of what a hospital needed.\"\nIn 1991, Baxter's home infusion subsidiary, Caremark International, \"was accused by the government of paying doctors to steer patients to its intravenous drug service\" In 1992 Caremark spun off from Baxter International. Caremark was fined $160 million for the \"four-year-long federal mail-fraud and kickback\" scheme in which the \"home-infusion business unit made weekly payments to scores of doctors that averaged about $75 per patient for referring those patients to its services. Some doctors earned as much as $80,000 a year from the kickbacks, according to government documents.\"\nIn 1996, the company entered into a four-way, $640 million settlement with haemophiliacs 1999 in relation to blood clotting concentrates that were infected with HIV.  Under pressure from shareholders due to poor performance and an unsuccessful merger, Loucks was forced to resign.\nBaxter acquired medical device firm Baxa on November 10, 2011. In 2011, Hikma Pharmaceuticals PLC completed the acquisition of Baxter Healthcare Corporation's US generic injectables business (Multi-Source Injectables or MSI).\nIn July 2013, EU antitrust regulators approved Baxter's bid for Sweden's Gambro.\nIn March 2014, Baxter announced plans to create two independent global healthcare companies—one focused on developing and marketing bio-pharmaceuticals and the other on medical products. The medical products company retained the name Baxter International Inc. and the bio-pharmaceuticals company is named Baxalta and spun-off as a new public company that showed on trading boards as of July 1, 2015.\nIn July 2014, Baxter announced that it was exiting the vaccines business—divesting its commercial vaccine portfolio to Pfizer (with the sale expected to close by the end of the year) and exploring options for its vaccines R&D program, including influenza. In October 2015, José E. Almeida was named chairman and chief executive officer. In January 2016 Shire PLC agreed to acquire Baxalta for $32 billion.\nIn December 2016, Baxter announced it would acquire Claris Lifesciences injectables subsidiary, Claris Injectables, for $625 million.\nIn December 2019, the company announced it would acquire Seprafilm from Sanofi for $350 million.\nIn September 2021, Baxter announced it would acquire Hill-rom for $12.4 billion. The acquisition was completed in December 2021 for $12.5 billion.\n\nIn May 2023, Baxter announced it was selling its biopharma solutions business, which offers drugmakers support in the form of products like injectable delivery systems and services that include regulatory resources, help with drug formulation and development, and packaging capabilities, to private equity firms Warburg Pincus and Advent International for $4.25 billion in cash.\nIn August 2024, Baxter agreed to divest its kidney care business unit, Vantive, to private equity firm Carlyle Group for $3.8 billion.\nIn September 2024, Hurricane Helene caused significant flooding in North Carolina, affecting a Baxter International facility in Marion. This facility produces approximately 60% of the intravenous (IV) fluids used in the United States. The disruption led to nationwide IV fluid shortages, prompting hospitals to ration supplies and implement strategies to conserve fluids. This also prompted questions from medical professionals about why such a large portion of the country's IV manufacturing capacity is tied to a single facility. As of November 7, 2024, the facility resumed producing some IV fluids. However, with the onset of flu season, hospitals continued to prioritize conservation efforts.\n\nEnvironmental activities\nIn 1997, a report produced by the company indicated that changes made to reduce environmental impacts generated savings that exceeded their cost, producing a net profit.  Reporting was company-wide, with a variety of aggregation and reporting, including on the company's internet and intranet sites. The company was an early joiner in the \"green and greedy\" movement, which aims to lessen the environmental impacts of manufacturing its products while saving the company money.  In 2009 the company announced it had reached a variety of its environmentally friendly goals, and that it would continue to try to reduce waste, emissions, energy use and environmental incidents over the coming years.\n\nStructure\nThe company had 2014 sales of $16.7 billion, across two businesses: BioScience (2013 sales - $6.6 billion) and Medical Products ($8.7 billion). Sales in 2013 were 42% in the United States, 30% in Europe, 16% in Asia Pacific, 12% in Latin America and Canada. In 2011, Baxter had approximately 61,500 employees. The breakdown of regional employees in 2013 was 36% in the United States; 34% in Europe; 16% in Asia Pacific; 14% in Latin America and Canada. In 2013, Baxter International spent more than $1.2 billion on research and development. As of December 31, 2016, the company had approximately 48,000 employees.\n\nCorporate governance\nIn 1953 William Graham became the company's CEO.  Vernon Loucks became president and CEO in 1980. Loucks was forced to resign by shareholders.\n\nIn January, as Baxter International Inc.'s Vernon Loucks relinquished his CEO duties after 18 years, directors handed him a special stock-option grant of 950,000 shares \"for the specific purposes of motivating\" him \"to implement a smooth transition of his responsibilities.\" If Mr. Loucks sells all the 400,000 shares he can exercise at year end and Baxter's stock price remains at its current level, he will make more than $4 million.\nDuring the tenure of Vernon Loucks, who was Baxter's CEO from 1980 to 1998 and chairman from 1987 to 1999, company sales \"more than quadrupled to $5.7 billion while its workforce rose from 30,000 to 42,000.\" During that time, Loucks hired and groomed staff who went on to become CEOs elsewhere. Baxter alumni groomed by Loucks included Terry Mulligan of MedAssets, Lance Piccolo at Caremark, Mike Mussallem of Edwards Lifesciences Corp and CEOs of Boston Scientific Corp. and Cardinal Health.\nLoucks was succeeded by Harry Kraemer, who was succeeded by Robert Parkinson, who took the CEO position in 2004.\n\nH1N1 vaccine\nIn July 2009, Baxter International announced completion of the first commercial vaccine for the H1N1 (\"swine flu\") influenza. The company has been one of several working with the World Health Organization and United States Centers for Disease Control and Prevention on the vaccine, and uses a cell-based rather than egg-based technology that allows a shorter production time.\n\nPhilanthropy\nIn 2008, Baxter launched Science@Work: Expanding Minds with Real-World Science, which supports teacher training and student development in healthcare and biotechnology in Chicago Public Schools.\nIn 2013, the company was included in The Civic 50, a list of the most community-minded companies in America from The National Conference on Citizenship and Points of Light, published by Bloomberg.\nIn 2014, roughly 6,300 Baxter employees volunteered in their communities through The Baxter International Foundation's Dollars for Doers program, addressing local concerns such as healthcare, the environment and education. In 2014, Baxter and The Baxter International Foundation gave over $50 million.\nBaxter was included for the 13th year in Corporate Responsibility magazine's 100 Best Corporate Citizens list in 2014 for its social responsibility performance.\n\nProduct defects and contamination\nIn August 1975, Baxter / Travenol withdrew a clotting factor product Hemofil after the product was associated with an outbreak of hepatitis B.\nBaxter, unknown to the FDA, continued to use prison plasma in factor concentrate production until October 1983, despite having entered into an agreement with the FDA (11 months earlier) that they would no longer use US prison plasma, which posed a high risk of virus transmission.\nIt was announced in quarter 1 of 1996 that Baxter had agreed to settle a lawsuit involving 200 Japanese haemophilia patients who had become infected with HIV as a result of using contaminated haemophilia products which were unheated. The Japanese courts ordered for each victim to receive $411,460 by March 29 that year.\nIn 2010, a jury in Las Vegas, Nevada, ordered Baxter and Teva Pharmaceuticals to pay $144 million to patients who had been infected with hepatitis C after doctors wrongly reused dirty medical supplies to administer propofol to patients, although the label for propofol clearly states that it is for single-patient use only and that aseptic procedures should be used at all times. Per a 2009 indemnity agreement between Teva (the manufacturer) and Baxter (acting as a distributor on behalf of Teva), the litigation and related settlements were defended and paid by Teva.\nIn 2010, Baxter was ordered by the FDA to recall all of their Colleague infusion pumps from the market due to 87 recalls and deaths associated with the pump.\n\n2001 Althane disaster\nThe Baxter Althane disaster in autumn 2001 was a series of over 50 sudden deaths of kidney failure patients in Spain, Croatia, Italy, Germany, Taiwan, Colombia and the USA (mainly Nebraska and Texas). All had received hospital treatment with Althane hemodialysis equipment, a product range manufactured by Baxter International, USA.\n\n2008 Chinese heparin adulteration\nIn 2008, the quality of blood thinning products produced by Baxter was brought into question when they were linked to 81 deaths and 785 severe allergic reactions in the United States according to the FDA. Upon inspection, one of the raw ingredients used by Baxter was found to be contaminated – between 5 and 20 percent – with a substance that was similar, but not identical, to the ingredient itself. The company initiated a voluntary recall, temporarily suspended the manufacture of heparin, and launched an investigation.\nThe investigation into the contamination has focused on raw heparin produced by one of Baxter's subcontractors Changzhou Scientific Protein Laboratories, a China-based branch of Scientific Protein Laboratories, based in Waunakee, Wisconsin. Changzhou SPL's facilities were never subjected to inspection by US FDA officials. In addition, Changzhou SPL's products were also never certified as safe for use in pharmaceutical products by Chinese FDA officials, due to Changzhou SPL's registration as a chemical company rather than a pharmaceutical manufacturer.\nUpon investigation of these adverse events by the FDA, academic institutions, and the involved pharmaceutical companies, the contaminant was identified as an \"over-sulfated\" derivative of chondroitin sulfate, a closely related substance obtained from mammal or fish cartilage and often used as a treatment for arthritis. Since over-sulfated chondroitin is not a naturally occurring molecule, it costs a fraction of true heparin precursor chemical, and mimics the in-vitro properties of heparin, the counterfeit was almost certainly intentional as opposed to an accidental lapse in manufacturing.  The raw heparin batches were found to have been cut from 2–60% with the counterfeit substance, and motivation for the adulteration was attributed to a combination of cost effectiveness and a shortage of suitable pigs in Mainland China. In mid-January 2008 Baxter voluntarily recalled some lots of multi-dose vials of Heparin in February in consultation with the FDA Baxter recalled the rest of their Heparin products.\n\n2009 Avian flu contamination\nIn early 2009, samples of viral material supplied by Baxter International to a series of European laboratories were found to be contaminated with live Avian flu virus (Influenza A virus subtype H5N1). Samples of the less harmful seasonal flu virus (subtype H3N2) were found to be mixed with the deadly H5N1 strain after a vaccine made from the material killed test animals in a lab in the Czech Republic. Though the serious consequences were avoided by the lab in the Czech Republic, Baxter then claimed the failed controls over the distribution of the virus were 'stringent' and there was 'little chance' of the lethal virus harming humans.\n\n2009 drug cost inflation\nOn July 2, 2009, Kentucky Attorney General Jack Conway announced a settlement between the state and Baxter Healthcare Corporation, a subsidiary of Baxter International, worth $2 million. The company had been inflating the cost of the intravenous drugs sold to Kentucky Medicaid, at times as much as 1300%.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Baxter International Inc.:",
  "clean_text": "Baxter International Inc. is an American multinational healthcare company with headquarters in Deerfield, Illinois. The company primarily focuses on products to treat chronic and acute medical conditions. The company had 2023 global net sales of $14.8 billion (+2% vs 2022), across three business: \"Medical Product and Therapies\", \"Healthcare Systems and Technologies\" and Pharmaceuticals. Baxter's Medical Product and Therapies business comprise two divisions: the first named \"Advanced Surgery\" that produce technologies to enhance surgeons' technique, increase efficiencies and improve outcomes. The second named \"Infusion Therapies and Technologies\" produces intravenous products and other products used in the delivery of fluids and drugs to patients. Baxter's Healthcare System and Technologies business has four divisions \"Front Line Care\", \"Digital Platform and Innovations\", \"Care and Connectivity Solutions\" and \"Global Services\". Baxter's Pharmaceuticals business produce inhalational anaesthetics and other differentiated hospital pharmaceuticals in areas of pain, critical care, anti-infection and oncology. History Baxter International was founded in 1931 by Donald Baxter, a Los Angeles-based medical doctor, as a manufacturer and distributor of intravenous therapy solutions. Seeing a need for products closer to the Midwest, the company opened a manufacturing plant in Glenview, Illinois, in 1933. Baxter's interest was bought out in 1935 by Ralph Falk, who established a research and development function. In 1939 the company developed a vacuum-type collection container, extending the shelf life of blood from hours to weeks. In 1954, the company expanded operations outside of the United States by opening an office in Belgium. In 1956 Baxter International introduced the first functioning artificial kidney, and in 1971 became a member of the Fortune 500. In 1971, Baxter built a major manufacturing plant in Ashdod, Israel. As a result, the company was placed on the Arab League boycott list in the early 1980s. Throughout the 1980s and 1990s, the company expanded to deliver a wider variety of products and services (including vaccines and a greater variety of blood products) through acquisitions of various companies. Sales and production facilities also expanded throughout the world. In 1982, Baxter acquired Medcom, Inc., a New York-based firm founded by Richard Fuisz and his brother, that had large markets in the United States and Saudi Arabia. Baxter chief executive Vernon Loucks fired Fuisz who then brought anti-boycott charges against Baxter to the U.S. Commerce Department Office of Anti-Boycott Compliance (OAC). Fuisz alleged that Baxter had sold their profitable Ashdod facility to Teva Pharmaceutical Industries in 1988 while simultaneously negotiating the construction of a similar plant in Syria in partnership with the Syrian military in order to be removed from the Arab League blacklist in 1989. In 1993 Baxter pleaded guilty to a felony in relation to an anti-boycott law in the United States. On July 15, 1985, American Hospital Supply Corporation CEO Karl D. Bays and Baxter's then-CEO Vernon R. Loucks Jr. signed an agreement that merged two of the United States' \"largest producers of medical supplies\". This was a \"one-Baxter approach\" in which the company provided \"70% to 80% of what a hospital needed.\" In 1991, Baxter's home infusion subsidiary, Caremark International, \"was accused by the government of paying doctors to steer patients to its intravenous drug service\" In 1992 Caremark spun off from Baxter International. Caremark was fined $160 million for the \"four-year-long federal mail-fraud and kickback\" scheme in which the \"home-infusion business unit made weekly payments to scores of doctors that averaged about $75 per patient for referring those patients to its services. Some doctors earned as much as $80,000 a year from the kickbacks, according to government documents.\" In 1996, the company entered into a four-way, $640 million settlement with haemophiliacs 1999 in relation to blood clotting concentrates that were infected with HIV. Under pressure from shareholders due to poor performance and an unsuccessful merger, Loucks was forced to resign. Baxter acquired medical device firm Baxa on November 10, 2011. In 2011, Hikma Pharmaceuticals PLC completed the acquisition of Baxter Healthcare Corporation's US generic injectables business (Multi-Source Injectables or MSI). In July 2013, EU antitrust regulators approved Baxter's bid for Sweden's Gambro. In March 2014, Baxter announced plans to create two independent global healthcare companies—one focused on developing and marketing bio-pharmaceuticals and the other on medical products. The medical products company retained the name Baxter International Inc. and the bio-pharmaceuticals company is named Baxalta and spun-off as a new public company that showed on trading boards as of July 1, 2015. In July 2014, Baxter announced that it was exiting the vaccines business—divesting its commercial vaccine portfolio to Pfizer (with the sale expected to close by the end of the year) and exploring options for its vaccines R&D program, including influenza. In October 2015, José E. Almeida was named chairman and chief executive officer. In January 2016 Shire PLC agreed to acquire Baxalta for $32 billion. In December 2016, Baxter announced it would acquire Claris Lifesciences injectables subsidiary, Claris Injectables, for $625 million. In December 2019, the company announced it would acquire Seprafilm from Sanofi for $350 million. In September 2021, Baxter announced it would acquire Hill-rom for $12.4 billion. The acquisition was completed in December 2021 for $12.5 billion. In May 2023, Baxter announced it was selling its biopharma solutions business, which offers drugmakers support in the form of products like injectable delivery systems and services that include regulatory resources, help with drug formulation and development, and packaging capabilities, to private equity firms Warburg Pincus and Advent International for $4.25 billion in cash. In August 2024, Baxter agreed to divest its kidney care business unit, Vantive, to private equity firm Carlyle Group for $3.8 billion. In September 2024, Hurricane Helene caused significant flooding in North Carolina, affecting a Baxter International facility in Marion. This facility produces approximately 60% of the intravenous (IV) fluids used in the United States. The disruption led to nationwide IV fluid shortages, prompting hospitals to ration supplies and implement strategies to conserve fluids. This also prompted questions from medical professionals about why such a large portion of the country's IV manufacturing capacity is tied to a single facility. As of November 7, 2024, the facility resumed producing some IV fluids. However, with the onset of flu season, hospitals continued to prioritize conservation efforts. Environmental activities In 1997, a report produced by the company indicated that changes made to reduce environmental impacts generated savings that exceeded their cost, producing a net profit. Reporting was company-wide, with a variety of aggregation and reporting, including on the company's internet and intranet sites. The company was an early joiner in the \"green and greedy\" movement, which aims to lessen the environmental impacts of manufacturing its products while saving the company money. In 2009 the company announced it had reached a variety of its environmentally friendly goals, and that it would continue to try to reduce waste, emissions, energy use and environmental incidents over the coming years. Structure The company had 2014 sales of $16.7 billion, across two businesses: BioScience (2013 sales - $6.6 billion) and Medical Products ($8.7 billion). Sales in 2013 were 42% in the United States, 30% in Europe, 16% in Asia Pacific, 12% in Latin America and Canada. In 2011, Baxter had approximately 61,500 employees. The breakdown of regional employees in 2013 was 36% in the United States; 34% in Europe; 16% in Asia Pacific; 14% in Latin America and Canada. In 2013, Baxter International spent more than $1.2 billion on research and development. As of December 31, 2016, the company had approximately 48,000 employees. Corporate governance In 1953 William Graham became the company's CEO. Vernon Loucks became president and CEO in 1980. Loucks was forced to resign by shareholders. In January, as Baxter International Inc.'s Vernon Loucks relinquished his CEO duties after 18 years, directors handed him a special stock-option grant of 950,000 shares \"for the specific purposes of motivating\" him \"to implement a smooth transition of his responsibilities.\" If Mr. Loucks sells all the 400,000 shares he can exercise at year end and Baxter's stock price remains at its current level, he will make more than $4 million. During the tenure of Vernon Loucks, who was Baxter's CEO from 1980 to 1998 and chairman from 1987 to 1999, company sales \"more than quadrupled to $5.7 billion while its workforce rose from 30,000 to 42,000.\" During that time, Loucks hired and groomed staff who went on to become CEOs elsewhere. Baxter alumni groomed by Loucks included Terry Mulligan of MedAssets, Lance Piccolo at Caremark, Mike Mussallem of Edwards Lifesciences Corp and CEOs of Boston Scientific Corp. and Cardinal Health. Loucks was succeeded by Harry Kraemer, who was succeeded by Robert Parkinson, who took the CEO position in 2004. H1N1 vaccine In July 2009, Baxter International announced completion of the first commercial vaccine for the H1N1 (\"swine flu\") influenza. The company has been one of several working with the World Health Organization and United States Centers for Disease Control and Prevention on the vaccine, and uses a cell-based rather than egg-based technology that allows a shorter production time. Philanthropy In 2008, Baxter launched Science@Work: Expanding Minds with Real-World Science, which supports teacher training and student development in healthcare and biotechnology in Chicago Public Schools. In 2013, the company was included in The Civic 50, a list of the most community-minded companies in America from The National Conference on Citizenship and Points of Light, published by Bloomberg. In 2014, roughly 6,300 Baxter employees volunteered in their communities through The Baxter International Foundation's Dollars for Doers program, addressing local concerns such as healthcare, the environment and education. In 2014, Baxter and The Baxter International Foundation gave over $50 million. Baxter was included for the 13th year in Corporate Responsibility magazine's 100 Best Corporate Citizens list in 2014 for its social responsibility performance. Product defects and contamination In August 1975, Baxter / Travenol withdrew a clotting factor product Hemofil after the product was associated with an outbreak of hepatitis B. Baxter, unknown to the FDA, continued to use prison plasma in factor concentrate production until October 1983, despite having entered into an agreement with the FDA (11 months earlier) that they would no longer use US prison plasma, which posed a high risk of virus transmission. It was announced in quarter 1 of 1996 that Baxter had agreed to settle a lawsuit involving 200 Japanese haemophilia patients who had become infected with HIV as a result of using contaminated haemophilia products which were unheated. The Japanese courts ordered for each victim to receive $411,460 by March 29 that year. In 2010, a jury in Las Vegas, Nevada, ordered Baxter and Teva Pharmaceuticals to pay $144 million to patients who had been infected with hepatitis C after doctors wrongly reused dirty medical supplies to administer propofol to patients, although the label for propofol clearly states that it is for single-patient use only and that aseptic procedures should be used at all times. Per a 2009 indemnity agreement between Teva (the manufacturer) and Baxter (acting as a distributor on behalf of Teva), the litigation and related settlements were defended and paid by Teva. In 2010, Baxter was ordered by the FDA to recall all of their Colleague infusion pumps from the market due to 87 recalls and deaths associated with the pump. 2001 Althane disaster The Baxter Althane disaster in autumn 2001 was a series of over 50 sudden deaths of kidney failure patients in Spain, Croatia, Italy, Germany, Taiwan, Colombia and the USA (mainly Nebraska and Texas). All had received hospital treatment with Althane hemodialysis equipment, a product range manufactured by Baxter International, USA. 2008 Chinese heparin adulteration In 2008, the quality of blood thinning products produced by Baxter was brought into question when they were linked to 81 deaths and 785 severe allergic reactions in the United States according to the FDA. Upon inspection, one of the raw ingredients used by Baxter was found to be contaminated – between 5 and 20 percent – with a substance that was similar, but not identical, to the ingredient itself. The company initiated a voluntary recall, temporarily suspended the manufacture of heparin, and launched an investigation. The investigation into the contamination has focused on raw heparin produced by one of Baxter's subcontractors Changzhou Scientific Protein Laboratories, a China-based branch of Scientific Protein Laboratories, based in Waunakee, Wisconsin. Changzhou SPL's facilities were never subjected to inspection by US FDA officials. In addition, Changzhou SPL's products were also never certified as safe for use in pharmaceutical products by Chinese FDA officials, due to Changzhou SPL's registration as a chemical company rather than a pharmaceutical manufacturer. Upon investigation of these adverse events by the FDA, academic institutions, and the involved pharmaceutical companies, the contaminant was identified as an \"over-sulfated\" derivative of chondroitin sulfate, a closely related substance obtained from mammal or fish cartilage and often used as a treatment for arthritis. Since over-sulfated chondroitin is not a naturally occurring molecule, it costs a fraction of true heparin precursor chemical, and mimics the in-vitro properties of heparin, the counterfeit was almost certainly intentional as opposed to an accidental lapse in manufacturing. The raw heparin batches were found to have been cut from 2–60% with the counterfeit substance, and motivation for the adulteration was attributed to a combination of cost effectiveness and a shortage of suitable pigs in Mainland China. In mid-January 2008 Baxter voluntarily recalled some lots of multi-dose vials of Heparin in February in consultation with the FDA Baxter recalled the rest of their Heparin products. 2009 Avian flu contamination In early 2009, samples of viral material supplied by Baxter International to a series of European laboratories were found to be contaminated with live Avian flu virus (Influenza A virus subtype H5N1). Samples of the less harmful seasonal flu virus (subtype H3N2) were found to be mixed with the deadly H5N1 strain after a vaccine made from the material killed test animals in a lab in the Czech Republic. Though the serious consequences were avoided by the lab in the Czech Republic, Baxter then claimed the failed controls over the distribution of the virus were 'stringent' and there was 'little chance' of the lethal virus harming humans. 2009 drug cost inflation On July 2, 2009, Kentucky Attorney General Jack Conway announced a settlement between the state and Baxter Healthcare Corporation, a subsidiary of Baxter International, worth $2 million. The company had been inflating the cost of the intravenous drugs sold to Kentucky Medicaid, at times as much as 1300%."
}