{
  "ticker": "BBY",
  "cik": "0000764478",
  "company_name": "Best Buy",
  "corrected_name": "Best Buy",
  "wiki_title_used": "Best Buy",
  "exists": true,
  "raw_text": "Best Buy Co., Inc. is an American multinational consumer electronics retailer headquartered in Richfield, Minnesota. Originally founded by Richard M. Schulze and James Wheeler in 1966 as an audio specialty store called Sound of Music, it was rebranded under its current name with an emphasis on consumer electronics in 1983.\nBest Buy operates internationally in Canada, and formerly operated in China until February 2011 (when the faction was merged with Five Star) and in Mexico until December 2020 (due to the effects of the COVID-19 pandemic). The company also operated in Europe until 2012. Its subsidiaries include Geek Squad, Magnolia Audio Video, and Pacific Sales. Best Buy also operates the Best Buy Mobile and Insignia brands in North America, plus Five Star in China. Best Buy sells cellular phones from Verizon Wireless, AT&T Mobility, T-Mobile, Boost Mobile and Ting Mobile in the United States. In Canada, carriers include Bell Mobility, Rogers Wireless, Telus Mobility, their fighter brands, and competing smaller carriers, such as SaskTel.\nHubert Joly is executive chairman of Best Buy, having been succeeded as CEO by Corie Barry in June 2019. According to Yahoo! Finance, Best Buy is the largest specialty retailer in the United States consumer electronics retail industry. The company ranked number 72 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.\n\nHistory\nEarly history\nOn August 22, 1966, Richard M. Schulze and a business partner opened Sound of Music, an electronics store specializing in high fidelity stereos in St. Paul, Minnesota. Schulze financed the opening of his first store with his personal savings and a second mortgage he took out on his family's home. In 1967, Sound of Music acquired Kencraft Hi-Fi Company and Bergo Company. Sound of Music earned $1 million in revenue and made about $58,000 in profits in its first year. In 1969, Sound of Music had three stores and Schulze bought out his business partner.\nSound of Music operated nine stores throughout Minnesota by 1978. In 1981, the Roseville location, at the time the largest and most profitable Sound of Music store, was hit by a tornado. The store's roof was sheared off and showroom destroyed, but the storeroom was left intact. In response, Schulze decided to have a \"Tornado Sale\" of damaged and excess stock in the damaged store's parking lot. He poured the remainder of his marketing budget into advertising the sale, promising \"best buys\" on everything. Sound of Music made more money during the four-day sale than it did in a typical month.\n\nIn 1983, with seven stores and $10 million in annual sales, Sound of Music was renamed Best Buy Company, Inc. The company also expanded its product offerings to include home appliances and VCRs, in an attempt to expand beyond its then-core customer base of 15- to 18-year-old males. Later that year, Best Buy opened its first superstore in Burnsville, Minnesota. The Burnsville location featured a high-volume, low-price business model, which was borrowed partially from Schulze's successful Tornado Sale in 1981. In its first year, the Burnsville store out-performed all other Best Buy stores combined.\nBest Buy was taken public in 1985, and two years later it debuted on the New York Stock Exchange. In 1988, Best Buy was in a price and location war with Detroit-based appliance chain Highland Superstores, and Schulze attempted to sell the company to Circuit City for US$30 million. Circuit City rejected the offer, claiming they could open a store in Minneapolis and \"blow them away.\"\nIn 1988, the company introduced a new store concept dubbed \"Concept II\". Concept II replaced dimly lit industrial-style stores with brighter and more fashionably fixtured stores. Stores also began placing all stock on the sales floor rather than in a stock room, had fewer salespersons and provided more self-help product information for its customers. Best Buy also did away with commissioned salespeople. The commission-free sales environment \"created a more relaxed shopping environment free of the high-pressure sales tactics used in other stores,\" but was unpopular with salespersons and suppliers. Upset that their products would no longer be pushed by salespeople, some suppliers such as Maytag, Whirlpool, and Sony stopped selling in Best Buy stores altogether. The suppliers returned after Best Buy's sales and revenue grew following the roll-out of Concept II.\nIn 1992, the company achieved $1 billion in annual revenues. Its Midwest rival, Highland, would file for bankruptcy in the same year and close all locations by 1993.\nIn 1994, Best Buy debuted \"Concept III\" stores in several new markets including Los Angeles and Washington, D.C. Concept III stores were larger than previous stores and included expanded product offerings, \"Answer Center\" touchscreen kiosks that displayed product information for both customers and employees, and demonstration areas for products such as surround sound stereo systems and video games.\nBest Buy launched its \"Concept IV\" stores with its expansion into New England in 1998. Concept IV stores included an open layout with products organized by category, cash registers located throughout the store, and slightly smaller stores than Concept III stores. The stores also had large areas for demonstrating home theater systems and computer software.\nIn 1999, Best Buy was added to Standard & Poor's S&P 500.\n\n2000s\nIn 2000, Best Buy formed Redline Entertainment, an independent music label and action-sports video distributor. The company acquired Magnolia Hi-Fi, Inc., an audio-video retailer located in California, Washington, and Oregon, in December 2000.\nIn January 2001, Best Buy acquired Musicland Stores Corporation, a Minnetonka, Minnesota-based retailer that sold home-entertainment products under the Sam Goody, Suncoast Motion Picture Company, Media Play, and OnCue brands. Best Buy purchased the company for $425 million in cash and the assumption of $271 million of Musicland debt. Later that year, Best Buy acquired the British Columbia, Canada-based electronics-chain Future Shop Ltd., marking its entrance to the international marketplace. Under the deal, Future Shop was purchased for about US$377 million and continued to operate as subsidiary independent from Best Buy Canada.\nBrad Anderson succeeded Richard Schulze as Best Buy CEO in July 2002. Anderson had begun working at Best Buy in 1973 while attending seminary school. He was promoted to vice president in 1981 and executive vice president in 1986. Anderson had most recently served as president and COO of Best Buy, a position he had held since 1991. In September of that year, Best Buy opened the first Canadian Best Buy-branded store in Mississauga, Ontario. In October, Best Buy acquired Minneapolis-based Geek Squad, then a 24-hour residential computer repair business with offices in Minneapolis, Chicago, Los Angeles, and San Francisco.\nBest Buy stores in the U.S. surpassed the 600-store mark and the company opened its first global-sourcing office in Shanghai in 2003. In June, Best Buy divested itself of Musicland in a deal with Sun Capital Partners under which Sun Capital received all of Musicland's stock and debt. Best Buy launched its \"Reward Zone\" loyalty program in July following an 8-month test of the program in San Diego, California. Also in 2003, Best Buy's corporate offices were consolidated into a single campus in Richfield, Minnesota.\nIn January 2004, Best Buy hired Virtucom Group to revamp Best Buy's website and handle all of the company's online content. In May, the company launched its \"customer centricity\" program, which segmented its stores according to customer profiles. The program also called for employees to focus on specific customer groups rather than product categories. In October, Best Buy completed rolling out Geek Squad \"precincts\" in every American Best Buy store.\nIn April 2005, Best Buy began eliminating mail-in rebates in response to negative customer reaction against them, and instead started giving out instant rebates via notebook computers.\nIn May 2006, Best Buy acquired a majority interest in Chinese appliance retailer Jiangsu Five Star Appliance for $180 million. At the time of the deal, Jiangsu was the fourth-largest appliance chain in China with 193 stores across eight Chinese provinces. In June, the company opened Geek Squad precincts at Office Depot in Orlando, Florida. The market test was later expanded to Denver.\nIn January 2007, the first Best Buy-branded store in China officially opened in Shanghai. In March 2007, Best Buy acquired Speakeasy, a Seattle-based broadband VOIP, data, and IT services provider. The acquisition was worth $80 million, and under terms of the deal, Speakeasy began operating as a wholly owned subsidiary of Best Buy. The company's products also became part of Best Buy's For Business program. Best Buy also expanded its Geek Squad market tests in March, opening Geek Squad precincts in FedEx Kinkos stores located in Indianapolis and Charlotte, North Carolina. In October 2007, Best Buy became the first consumer-electronics retailer to exit the analog television market, carrying only digital products that became mandatory in June 2009 by the FCC.\nIn February 2008, Best Buy opened its first store in San Juan, Puerto Rico. Best Buy's Geek Squad market tests in Office Depot and FedEx Kinkos stores ended by March. Also in March, the company began promoting the Blu-ray optical-disc format over the HD DVD format, a move which ultimately contributed to Toshiba's decision to drop HD DVD. In May, the company agreed to buy 50% of the retail division of The Carphone Warehouse, a London, England-based mobile phone retailer. The deal was worth $2.1 billion.\nIn July 2008, Best Buy announced that it would start selling musical instruments and related gear in over 80 of its retail stores, making the company the second-largest musical-instrument distributor in the US. Best Buy became the first third-party retail seller of Apple's iPhone in September. Later that month, the company agreed to acquire Napster for $121 million. In December, Best Buy opened its first store in Mexico.\nIn February 2009, Best Buy leveraged its partnership with The Carphone Warehouse to launch Best Buy Mobile, a Best Buy-branded mobile retailer. Best Buy Mobile standalone stores were opened in shopping malls and urban downtowns. These Best Buy Mobile outlets were also added in all Best Buy-branded stores.\nIn June 2009, Brian J. Dunn became Best Buy CEO. Dunn replaced Brad Anderson, who was retiring. Dunn had joined Best Buy in 1985 as a sales associate. In 2000, Dunn became senior vice president of East Coast operations and president of North American retail operations in 2004. His most recent position was as president of Best Buy since 2006.\nIn November 2009, Best Buy partnered with Roxio's CinemaNow to launch an on-demand streaming service which allowed streaming from any Internet device sold by Best Buy.\nIn December 2009, Best Buy opened its first Turkish store in İzmir.\n\n2010s\nIn April 2010, Best Buy opened its first United Kingdom-based Best Buy-branded store in Thurrock. The company eventually opened 11 Best Buy stores in the United Kingdom, all of which were closed in early 2012. In November 2011, Best Buy purchased The Carphone Warehouse's share of Best Buy Mobile for $1.3 billion. Best Buy and The Carphone Warehouse maintained their Best Buy Europe joint venture, which at the time operated 2,500 mobile phone stores throughout Europe.\nThe company closed all of its Best Buy-branded stores in China by February 2011, when it merged Best Buy China's operations with Jiangsu Five Star, which had become a wholly owned subsidiary of Best Buy in 2009. In December 2011, Best Buy purchased mindSHIFT Technologies, a company that provided IT support for small and medium-sized businesses, for $167 million.\nIn 2012, in response to overall revenue decline, Best Buy announced plans to undergo a \"transformation strategy\". Stores began to adopt a redesigned \"Connected Store\" format, providing the Geek Squad with a centralized service desk and implementing a \"store-within-a-store\" concept for Pacific Kitchen & Bath and Magnolia Design Center.\nIn April 2012, Brian Dunn resigned as Best Buy's CEO during an internal company investigation into allegations of personal misconduct stemming from an inappropriate relationship with a female Best Buy employee. Best Buy named Director George L. Mikan III interim CEO following Dunn's resignation. The internal investigation was released in May 2012 and alleged that Best Buy founder and chairman Richard Schulze knew of Dunn's inappropriate relationship and failed to notify the Best Buy board. Schulze subsequently resigned his chairmanship of the company. Best Buy Director Hatim Tyabji replaced Schulze as Best Buy chairman.\nIn September 2012, Hubert Joly replaced Mikan as Best Buy CEO. Joly had previously served as CEO of Carlson, a hospitality conglomerate, since 2008. He led initiatives such as price matching, speeding up delivery times for online purchases, establishing \"store within a store\" sections for major brands such as Apple, Google, Microsoft, and Samsung, and giving more product training to employees.\nIn April 2013, Best Buy exited the European consumer electronics market when it sold its 50% stake in The Carphone Warehouse back to the UK-based mobile phone retailer. The sale was worth around $775 million.\nAn increasing trend towards online shopping began to erode revenues and profits in the 2010s. A 4% dip in sales for the June 30, 2014, quarter, marked the 10th quarter in a row where Best Buy's sales had declined. The company, in announcing the result, said it was focusing more on digital media in its marketing, moving away from newspaper, magazine, and television advertising.\nOn March 28, 2015, Best Buy announced the shutdown of the Future Shop chain in Canada; 65 of its 131 former locations were converted into Best Buy locations, while the rest (primarily those in close proximity to an existing Best Buy) were closed permanently.\nOn March 1, 2018, the company announced that it would shut down its 250 standalone Best Buy Mobile stores in the United States by the end of May, due to low revenue and high costs. The Best Buy Mobile stores were reported to account for 1% of the company's revenue.\nOn May 9, 2018, the company unveiled a new logo for the first time in nearly three decades.\nOn July 2, 2018, Best Buy announced it was cutting the amount of store space devoted to selling physical music, citing the popularity of streaming services as having reduced sales.\nOn April 15, 2019, Best Buy announced that in June 2019, its current CFO, Corie Barry, would replace Hubert Joly who held the position of CEO since August 2012. Joly subsequently became executive chairman of the company.\n\n2020s\nDespite an increase in sales of computer equipment due to an increase in remote work during the COVID-19 pandemic, Best Buy laid off over 5,000 employees in early 2021 and forced many others into part-time positions.\nIn August 2022, Best Buy said it would be laying off employees across the country after warnings of weaker sales, and the company cut its forecast for the remainder of 2022.\nOn October 13, 2023, Best Buy announced that it would phase out the sale of home video on physical media in early 2024, citing changes in the market due to the prevalence of streaming video on demand services.\nOn January 18, 2024, BCE Inc. announced an agreement with Best Buy's Canadian division, under which selected locations of its competing chain The Source (originally the Canadian franchises of RadioShack, which were later acquired by Circuit City and, in turn, Bell)—which primarily operates in malls and smaller markets—would be rebranded as Best Buy Express. The stores will receive inventory from Best Buy and integrate with its e-commerce operations, but will continue to otherwise be owned and operated by BCE under license, and exclusively offer wireless services from Bell Canada and its subsidiaries. The first location opened in Surrey, British Columbia in June 2024; 167 locations were converted to the new branding, and the remaining stores were closed permanently.\nIn January 2025, Best Buy announced plans to relaunch its online marketplace for third-party sellers by summer 2025. The retailer had previously operated a marketplace from 2011 to 2016. This time, Best Buy is partnering with Mirakl, a marketplace software provider, to build the platform.\n\nCorporate affairs\nBusiness operations\nBest Buy sells consumer electronics and a variety of related merchandise, including software, video games, music, mobile phones, digital cameras, car stereos, and video cameras, in addition to home appliances (washing machines, dryers, and refrigerators), in a noncommissioned sales environment. Under the Geek Squad brand, Best Buy offers computer repair, warranty service, and accidental service plans. Best Buy provides an online community forum for members, where consumers can discuss product experiences, ask questions, and get answers from other members or retail product experts.\nThe building exteriors of Best Buy-branded stores are typically light brown, with the entrance designed to look like a blue box emerging from the structure. Corporate employees operated under a results only work environment from 2005 until March 2013, when the management style was abandoned by Best Buy CEO Hubert Joly.\nAs of October 29, 2016, Best Buy operated 1,026 Best Buy, 331 Best Buy Mobile stand-alone stores, and 28 stand-alone Pacific Sales stores in the US. Best Buy also operated: 135 Best Buy and 53 Best Buy Mobile stand-alone stores in Canada; and 18 Best Buy stores and 5 Best Buy Express stores in Mexico. Best Buy exited the European market in April 2013, selling its stake in the business back to its partner Carphone Warehouse.\n\nHouse brands\nBest Buy also produces products under eight house brands:\n\nDynex – Discount electronic and computer equipment such as Blu-ray players, data and power cables, HDTVs, office supplies, storage media, and webcams\nInit – Storage products such as media storage, equipment bags, totes, and furniture for home theaters\nInsignia – Electronic equipment, small appliances, and accessories including adapters, cables, HDTVs, mini refrigerators, and tablets\nMagnolia Design Center (in select Best Buy stores) – design and installation of custom home theater setups\nMagnolia Home Theater (in select Best Buy stores) – High-end home theater selections for both audio and visual equipment, including 4K, 3D, and large televisions, projectors, receivers, and speakers\nModal – style-oriented mobile accessories, including Bluetooth speakers, cables, and cases\nPacific Sales (in select Best Buy stores) – High-end appliances\nPlatinum – Highest-quality in-house brand for the company, producing many products, such as cables, cell phone accessories, tablet accessories, and digital imaging equipment\nRocketFish – Cables primarily used with home-theater installation and setup, as well as on computer and gaming accessories\nRocketFish Mobile – Phone cases, gel skins, clips, and chargers for cell phones, GPS, and other exclusive high-end products\n\nControversies\nWarranty\nIn 2000, two Florida consumers brought a lawsuit against the company, alleging that it engaged in fraudulent business practices related to the sale of extended warranties (or, more accurately, service plans). The suit claimed that store employees had misrepresented the manufacturer's warranty to sell its own Product Service/Replacement Plan and that Best Buy had \"entered into a corporate-wide scheme to institute high-pressure sales techniques involving the extended warranties\" and that the company used \"artificial barriers to discourage consumers who purchased the 'complete extended warranties' from making legitimate claims.\" The company ultimately settled for $200,000, but admitted no wrongdoing.\nIn 2014, Best Buy settled for $4.55 million in a class-action lawsuit filed against them in April 2010 by consumers who claimed Best Buy was making unsolicited phone calls in contravention of the Telephone Consumer Protection Act.\n\nPricing\nIn the second quarter of 2007, Connecticut Attorney General Richard Blumenthal ordered an investigation into the company's use of an in-store website alleged to have misled customers on item sales prices. In December 2007, the Los Angeles Times reported on the same issue, in which some customers claimed they thought they were surfing the Internet version of bestbuy.com at an in-store kiosk only to learn that the site reflected in-store prices only. In response, company spokesperson Sue Busch indicated the in-store kiosks were not intended for price-match purposes and rather were a means to navigate in-store availability. Since the initial investigation, a banner was placed on the in-store site to make its customers more aware of the difference.\n\nAnalog televisions\nOn April 26, 2008, the U.S. Federal Communications Commission (FCC) fined the company $280,000 for not alerting customers that the analog televisions it sold would not receive over-the-air stations after the digital transition on June 12, 2009. The company challenged this ruling in May 2008 by the FCC saying it was and is in compliance with current FCC regulations pertaining to the digital transition.\n\nEnvironmental issues\nBest Buy was one of several companies named in a 2007 report by Greenpeace for purchasing raw materials or manufactured products derived thereof from logging companies that in the opinion of Greenpeace, contribute to unethical deforestation of taiga in Canada.\nSince that time, however, the company launched what it calls Greener Together to increase the energy efficiency of its products, and reduce consumer waste through more recyclable packaging and proper disposal of certain electronic components such as rechargeable batteries and empty ink cartridges.\nAs a way to improve its image and past environmental issues, the company introduced a recycling program in 2009 that has since collected nearly half-a-billion pounds of consumer electronics and e-waste, and is available at all their stores for a nominal fee. These items are then handed over to certified recyclers in the U.S. for proper recycling. The company's goal is to collect one billion pounds of recycling.\nIt also has been named to the U.S. Environmental Protection Agency top-50 list of the largest green-power purchasers. In 2011, the company purchased nearly 119 million kilowatt-hours of green power –  electricity generated from renewable resources, such as wind, solar, geothermal, biogas, biomass, and low-impact hydropower.\n\nFBI collaboration\nIn their attempt to combat child pornography, the FBI hired several Best Buy employees from the Geek Squad division to covertly work for them flagging potential targets. In one incident, a customer brought in his computer for troubleshooting, which a Best Buy employee flagged as containing images of child pornography and reported to the FBI. The customer was indicted for possession of child pornography, although the judge in the case later threw out nearly all the evidence against the defendant due to \"false and misleading statements\" made by an FBI agent while trying to secure a search warrant for the customer's house, and the government ultimately dropped the case.\n\nPrivacy\nOn October 20, 2023, CBC News released the results of a Marketplace investigation which found that Best Buy technicians had viewed private files, such as intimate photos, on customer devices. One technician was also caught copying photos onto a USB flash drive.\n\nLGBT issues\nIn March 2024, following threats of shareholder-related action from conservative advocacy groups, Best Buy agreed to block donations by employee resource groups to eight LGBT organizations, over their support for access to gender affirming care for trans minors. This was met with criticism by a number of groups, including GLAAD and the Human Rights Campaign.\n\nSee also\nRetail apocalypse\nList of retailers affected by the retail apocalypse\n\nReferences\nFurther reading\nVideos\n\n\"Will Best Buy Survive Amazon?\". CNBC. May 30, 2019. Archived from the original on December 21, 2021.\n\nExternal links\n\nOfficial website\nBusiness data for Best Buy Co., Inc.:",
  "clean_text": "Best Buy Co., Inc. is an American multinational consumer electronics retailer headquartered in Richfield, Minnesota. Originally founded by Richard M. Schulze and James Wheeler in 1966 as an audio specialty store called Sound of Music, it was rebranded under its current name with an emphasis on consumer electronics in 1983. Best Buy operates internationally in Canada, and formerly operated in China until February 2011 (when the faction was merged with Five Star) and in Mexico until December 2020 (due to the effects of the COVID-19 pandemic). The company also operated in Europe until 2012. Its subsidiaries include Geek Squad, Magnolia Audio Video, and Pacific Sales. Best Buy also operates the Best Buy Mobile and Insignia brands in North America, plus Five Star in China. Best Buy sells cellular phones from Verizon Wireless, AT&T Mobility, T-Mobile, Boost Mobile and Ting Mobile in the United States. In Canada, carriers include Bell Mobility, Rogers Wireless, Telus Mobility, their fighter brands, and competing smaller carriers, such as SaskTel. Hubert Joly is executive chairman of Best Buy, having been succeeded as CEO by Corie Barry in June 2019. According to Yahoo! Finance, Best Buy is the largest specialty retailer in the United States consumer electronics retail industry. The company ranked number 72 in the 2018 Fortune 500 list of the largest United States corporations by total revenue. History Early history On August 22, 1966, Richard M. Schulze and a business partner opened Sound of Music, an electronics store specializing in high fidelity stereos in St. Paul, Minnesota. Schulze financed the opening of his first store with his personal savings and a second mortgage he took out on his family's home. In 1967, Sound of Music acquired Kencraft Hi-Fi Company and Bergo Company. Sound of Music earned $1 million in revenue and made about $58,000 in profits in its first year. In 1969, Sound of Music had three stores and Schulze bought out his business partner. Sound of Music operated nine stores throughout Minnesota by 1978. In 1981, the Roseville location, at the time the largest and most profitable Sound of Music store, was hit by a tornado. The store's roof was sheared off and showroom destroyed, but the storeroom was left intact. In response, Schulze decided to have a \"Tornado Sale\" of damaged and excess stock in the damaged store's parking lot. He poured the remainder of his marketing budget into advertising the sale, promising \"best buys\" on everything. Sound of Music made more money during the four-day sale than it did in a typical month. In 1983, with seven stores and $10 million in annual sales, Sound of Music was renamed Best Buy Company, Inc. The company also expanded its product offerings to include home appliances and VCRs, in an attempt to expand beyond its then-core customer base of 15- to 18-year-old males. Later that year, Best Buy opened its first superstore in Burnsville, Minnesota. The Burnsville location featured a high-volume, low-price business model, which was borrowed partially from Schulze's successful Tornado Sale in 1981. In its first year, the Burnsville store out-performed all other Best Buy stores combined. Best Buy was taken public in 1985, and two years later it debuted on the New York Stock Exchange. In 1988, Best Buy was in a price and location war with Detroit-based appliance chain Highland Superstores, and Schulze attempted to sell the company to Circuit City for US$30 million. Circuit City rejected the offer, claiming they could open a store in Minneapolis and \"blow them away.\" In 1988, the company introduced a new store concept dubbed \"Concept II\". Concept II replaced dimly lit industrial-style stores with brighter and more fashionably fixtured stores. Stores also began placing all stock on the sales floor rather than in a stock room, had fewer salespersons and provided more self-help product information for its customers. Best Buy also did away with commissioned salespeople. The commission-free sales environment \"created a more relaxed shopping environment free of the high-pressure sales tactics used in other stores,\" but was unpopular with salespersons and suppliers. Upset that their products would no longer be pushed by salespeople, some suppliers such as Maytag, Whirlpool, and Sony stopped selling in Best Buy stores altogether. The suppliers returned after Best Buy's sales and revenue grew following the roll-out of Concept II. In 1992, the company achieved $1 billion in annual revenues. Its Midwest rival, Highland, would file for bankruptcy in the same year and close all locations by 1993. In 1994, Best Buy debuted \"Concept III\" stores in several new markets including Los Angeles and Washington, D.C. Concept III stores were larger than previous stores and included expanded product offerings, \"Answer Center\" touchscreen kiosks that displayed product information for both customers and employees, and demonstration areas for products such as surround sound stereo systems and video games. Best Buy launched its \"Concept IV\" stores with its expansion into New England in 1998. Concept IV stores included an open layout with products organized by category, cash registers located throughout the store, and slightly smaller stores than Concept III stores. The stores also had large areas for demonstrating home theater systems and computer software. In 1999, Best Buy was added to Standard & Poor's S&P 500. 2000s In 2000, Best Buy formed Redline Entertainment, an independent music label and action-sports video distributor. The company acquired Magnolia Hi-Fi, Inc., an audio-video retailer located in California, Washington, and Oregon, in December 2000. In January 2001, Best Buy acquired Musicland Stores Corporation, a Minnetonka, Minnesota-based retailer that sold home-entertainment products under the Sam Goody, Suncoast Motion Picture Company, Media Play, and OnCue brands. Best Buy purchased the company for $425 million in cash and the assumption of $271 million of Musicland debt. Later that year, Best Buy acquired the British Columbia, Canada-based electronics-chain Future Shop Ltd., marking its entrance to the international marketplace. Under the deal, Future Shop was purchased for about US$377 million and continued to operate as subsidiary independent from Best Buy Canada. Brad Anderson succeeded Richard Schulze as Best Buy CEO in July 2002. Anderson had begun working at Best Buy in 1973 while attending seminary school. He was promoted to vice president in 1981 and executive vice president in 1986. Anderson had most recently served as president and COO of Best Buy, a position he had held since 1991. In September of that year, Best Buy opened the first Canadian Best Buy-branded store in Mississauga, Ontario. In October, Best Buy acquired Minneapolis-based Geek Squad, then a 24-hour residential computer repair business with offices in Minneapolis, Chicago, Los Angeles, and San Francisco. Best Buy stores in the U.S. surpassed the 600-store mark and the company opened its first global-sourcing office in Shanghai in 2003. In June, Best Buy divested itself of Musicland in a deal with Sun Capital Partners under which Sun Capital received all of Musicland's stock and debt. Best Buy launched its \"Reward Zone\" loyalty program in July following an 8-month test of the program in San Diego, California. Also in 2003, Best Buy's corporate offices were consolidated into a single campus in Richfield, Minnesota. In January 2004, Best Buy hired Virtucom Group to revamp Best Buy's website and handle all of the company's online content. In May, the company launched its \"customer centricity\" program, which segmented its stores according to customer profiles. The program also called for employees to focus on specific customer groups rather than product categories. In October, Best Buy completed rolling out Geek Squad \"precincts\" in every American Best Buy store. In April 2005, Best Buy began eliminating mail-in rebates in response to negative customer reaction against them, and instead started giving out instant rebates via notebook computers. In May 2006, Best Buy acquired a majority interest in Chinese appliance retailer Jiangsu Five Star Appliance for $180 million. At the time of the deal, Jiangsu was the fourth-largest appliance chain in China with 193 stores across eight Chinese provinces. In June, the company opened Geek Squad precincts at Office Depot in Orlando, Florida. The market test was later expanded to Denver. In January 2007, the first Best Buy-branded store in China officially opened in Shanghai. In March 2007, Best Buy acquired Speakeasy, a Seattle-based broadband VOIP, data, and IT services provider. The acquisition was worth $80 million, and under terms of the deal, Speakeasy began operating as a wholly owned subsidiary of Best Buy. The company's products also became part of Best Buy's For Business program. Best Buy also expanded its Geek Squad market tests in March, opening Geek Squad precincts in FedEx Kinkos stores located in Indianapolis and Charlotte, North Carolina. In October 2007, Best Buy became the first consumer-electronics retailer to exit the analog television market, carrying only digital products that became mandatory in June 2009 by the FCC. In February 2008, Best Buy opened its first store in San Juan, Puerto Rico. Best Buy's Geek Squad market tests in Office Depot and FedEx Kinkos stores ended by March. Also in March, the company began promoting the Blu-ray optical-disc format over the HD DVD format, a move which ultimately contributed to Toshiba's decision to drop HD DVD. In May, the company agreed to buy 50% of the retail division of The Carphone Warehouse, a London, England-based mobile phone retailer. The deal was worth $2.1 billion. In July 2008, Best Buy announced that it would start selling musical instruments and related gear in over 80 of its retail stores, making the company the second-largest musical-instrument distributor in the US. Best Buy became the first third-party retail seller of Apple's iPhone in September. Later that month, the company agreed to acquire Napster for $121 million. In December, Best Buy opened its first store in Mexico. In February 2009, Best Buy leveraged its partnership with The Carphone Warehouse to launch Best Buy Mobile, a Best Buy-branded mobile retailer. Best Buy Mobile standalone stores were opened in shopping malls and urban downtowns. These Best Buy Mobile outlets were also added in all Best Buy-branded stores. In June 2009, Brian J. Dunn became Best Buy CEO. Dunn replaced Brad Anderson, who was retiring. Dunn had joined Best Buy in 1985 as a sales associate. In 2000, Dunn became senior vice president of East Coast operations and president of North American retail operations in 2004. His most recent position was as president of Best Buy since 2006. In November 2009, Best Buy partnered with Roxio's CinemaNow to launch an on-demand streaming service which allowed streaming from any Internet device sold by Best Buy. In December 2009, Best Buy opened its first Turkish store in İzmir. 2010s In April 2010, Best Buy opened its first United Kingdom-based Best Buy-branded store in Thurrock. The company eventually opened 11 Best Buy stores in the United Kingdom, all of which were closed in early 2012. In November 2011, Best Buy purchased The Carphone Warehouse's share of Best Buy Mobile for $1.3 billion. Best Buy and The Carphone Warehouse maintained their Best Buy Europe joint venture, which at the time operated 2,500 mobile phone stores throughout Europe. The company closed all of its Best Buy-branded stores in China by February 2011, when it merged Best Buy China's operations with Jiangsu Five Star, which had become a wholly owned subsidiary of Best Buy in 2009. In December 2011, Best Buy purchased mindSHIFT Technologies, a company that provided IT support for small and medium-sized businesses, for $167 million. In 2012, in response to overall revenue decline, Best Buy announced plans to undergo a \"transformation strategy\". Stores began to adopt a redesigned \"Connected Store\" format, providing the Geek Squad with a centralized service desk and implementing a \"store-within-a-store\" concept for Pacific Kitchen & Bath and Magnolia Design Center. In April 2012, Brian Dunn resigned as Best Buy's CEO during an internal company investigation into allegations of personal misconduct stemming from an inappropriate relationship with a female Best Buy employee. Best Buy named Director George L. Mikan III interim CEO following Dunn's resignation. The internal investigation was released in May 2012 and alleged that Best Buy founder and chairman Richard Schulze knew of Dunn's inappropriate relationship and failed to notify the Best Buy board. Schulze subsequently resigned his chairmanship of the company. Best Buy Director Hatim Tyabji replaced Schulze as Best Buy chairman. In September 2012, Hubert Joly replaced Mikan as Best Buy CEO. Joly had previously served as CEO of Carlson, a hospitality conglomerate, since 2008. He led initiatives such as price matching, speeding up delivery times for online purchases, establishing \"store within a store\" sections for major brands such as Apple, Google, Microsoft, and Samsung, and giving more product training to employees. In April 2013, Best Buy exited the European consumer electronics market when it sold its 50% stake in The Carphone Warehouse back to the UK-based mobile phone retailer. The sale was worth around $775 million. An increasing trend towards online shopping began to erode revenues and profits in the 2010s. A 4% dip in sales for the June 30, 2014, quarter, marked the 10th quarter in a row where Best Buy's sales had declined. The company, in announcing the result, said it was focusing more on digital media in its marketing, moving away from newspaper, magazine, and television advertising. On March 28, 2015, Best Buy announced the shutdown of the Future Shop chain in Canada; 65 of its 131 former locations were converted into Best Buy locations, while the rest (primarily those in close proximity to an existing Best Buy) were closed permanently. On March 1, 2018, the company announced that it would shut down its 250 standalone Best Buy Mobile stores in the United States by the end of May, due to low revenue and high costs. The Best Buy Mobile stores were reported to account for 1% of the company's revenue. On May 9, 2018, the company unveiled a new logo for the first time in nearly three decades. On July 2, 2018, Best Buy announced it was cutting the amount of store space devoted to selling physical music, citing the popularity of streaming services as having reduced sales. On April 15, 2019, Best Buy announced that in June 2019, its current CFO, Corie Barry, would replace Hubert Joly who held the position of CEO since August 2012. Joly subsequently became executive chairman of the company. 2020s Despite an increase in sales of computer equipment due to an increase in remote work during the COVID-19 pandemic, Best Buy laid off over 5,000 employees in early 2021 and forced many others into part-time positions. In August 2022, Best Buy said it would be laying off employees across the country after warnings of weaker sales, and the company cut its forecast for the remainder of 2022. On October 13, 2023, Best Buy announced that it would phase out the sale of home video on physical media in early 2024, citing changes in the market due to the prevalence of streaming video on demand services. On January 18, 2024, BCE Inc. announced an agreement with Best Buy's Canadian division, under which selected locations of its competing chain The Source (originally the Canadian franchises of RadioShack, which were later acquired by Circuit City and, in turn, Bell)—which primarily operates in malls and smaller markets—would be rebranded as Best Buy Express. The stores will receive inventory from Best Buy and integrate with its e-commerce operations, but will continue to otherwise be owned and operated by BCE under license, and exclusively offer wireless services from Bell Canada and its subsidiaries. The first location opened in Surrey, British Columbia in June 2024; 167 locations were converted to the new branding, and the remaining stores were closed permanently. In January 2025, Best Buy announced plans to relaunch its online marketplace for third-party sellers by summer 2025. The retailer had previously operated a marketplace from 2011 to 2016. This time, Best Buy is partnering with Mirakl, a marketplace software provider, to build the platform. Corporate affairs Business operations Best Buy sells consumer electronics and a variety of related merchandise, including software, video games, music, mobile phones, digital cameras, car stereos, and video cameras, in addition to home appliances (washing machines, dryers, and refrigerators), in a noncommissioned sales environment. Under the Geek Squad brand, Best Buy offers computer repair, warranty service, and accidental service plans. Best Buy provides an online community forum for members, where consumers can discuss product experiences, ask questions, and get answers from other members or retail product experts. The building exteriors of Best Buy-branded stores are typically light brown, with the entrance designed to look like a blue box emerging from the structure. Corporate employees operated under a results only work environment from 2005 until March 2013, when the management style was abandoned by Best Buy CEO Hubert Joly. As of October 29, 2016, Best Buy operated 1,026 Best Buy, 331 Best Buy Mobile stand-alone stores, and 28 stand-alone Pacific Sales stores in the US. Best Buy also operated: 135 Best Buy and 53 Best Buy Mobile stand-alone stores in Canada; and 18 Best Buy stores and 5 Best Buy Express stores in Mexico. Best Buy exited the European market in April 2013, selling its stake in the business back to its partner Carphone Warehouse. House brands Best Buy also produces products under eight house brands: Dynex – Discount electronic and computer equipment such as Blu-ray players, data and power cables, HDTVs, office supplies, storage media, and webcams Init – Storage products such as media storage, equipment bags, totes, and furniture for home theaters Insignia – Electronic equipment, small appliances, and accessories including adapters, cables, HDTVs, mini refrigerators, and tablets Magnolia Design Center (in select Best Buy stores) – design and installation of custom home theater setups Magnolia Home Theater (in select Best Buy stores) – High-end home theater selections for both audio and visual equipment, including 4K, 3D, and large televisions, projectors, receivers, and speakers Modal – style-oriented mobile accessories, including Bluetooth speakers, cables, and cases Pacific Sales (in select Best Buy stores) – High-end appliances Platinum – Highest-quality in-house brand for the company, producing many products, such as cables, cell phone accessories, tablet accessories, and digital imaging equipment RocketFish – Cables primarily used with home-theater installation and setup, as well as on computer and gaming accessories RocketFish Mobile – Phone cases, gel skins, clips, and chargers for cell phones, GPS, and other exclusive high-end products Controversies Warranty In 2000, two Florida consumers brought a lawsuit against the company, alleging that it engaged in fraudulent business practices related to the sale of extended warranties (or, more accurately, service plans). The suit claimed that store employees had misrepresented the manufacturer's warranty to sell its own Product Service/Replacement Plan and that Best Buy had \"entered into a corporate-wide scheme to institute high-pressure sales techniques involving the extended warranties\" and that the company used \"artificial barriers to discourage consumers who purchased the 'complete extended warranties' from making legitimate claims.\" The company ultimately settled for $200,000, but admitted no wrongdoing. In 2014, Best Buy settled for $4.55 million in a class-action lawsuit filed against them in April 2010 by consumers who claimed Best Buy was making unsolicited phone calls in contravention of the Telephone Consumer Protection Act. Pricing In the second quarter of 2007, Connecticut Attorney General Richard Blumenthal ordered an investigation into the company's use of an in-store website alleged to have misled customers on item sales prices. In December 2007, the Los Angeles Times reported on the same issue, in which some customers claimed they thought they were surfing the Internet version of bestbuy.com at an in-store kiosk only to learn that the site reflected in-store prices only. In response, company spokesperson Sue Busch indicated the in-store kiosks were not intended for price-match purposes and rather were a means to navigate in-store availability. Since the initial investigation, a banner was placed on the in-store site to make its customers more aware of the difference. Analog televisions On April 26, 2008, the U.S. Federal Communications Commission (FCC) fined the company $280,000 for not alerting customers that the analog televisions it sold would not receive over-the-air stations after the digital transition on June 12, 2009. The company challenged this ruling in May 2008 by the FCC saying it was and is in compliance with current FCC regulations pertaining to the digital transition. Environmental issues Best Buy was one of several companies named in a 2007 report by Greenpeace for purchasing raw materials or manufactured products derived thereof from logging companies that in the opinion of Greenpeace, contribute to unethical deforestation of taiga in Canada. Since that time, however, the company launched what it calls Greener Together to increase the energy efficiency of its products, and reduce consumer waste through more recyclable packaging and proper disposal of certain electronic components such as rechargeable batteries and empty ink cartridges. As a way to improve its image and past environmental issues, the company introduced a recycling program in 2009 that has since collected nearly half-a-billion pounds of consumer electronics and e-waste, and is available at all their stores for a nominal fee. These items are then handed over to certified recyclers in the U.S. for proper recycling. The company's goal is to collect one billion pounds of recycling. It also has been named to the U.S. Environmental Protection Agency top-50 list of the largest green-power purchasers. In 2011, the company purchased nearly 119 million kilowatt-hours of green power – electricity generated from renewable resources, such as wind, solar, geothermal, biogas, biomass, and low-impact hydropower. FBI collaboration In their attempt to combat child pornography, the FBI hired several Best Buy employees from the Geek Squad division to covertly work for them flagging potential targets. In one incident, a customer brought in his computer for troubleshooting, which a Best Buy employee flagged as containing images of child pornography and reported to the FBI. The customer was indicted for possession of child pornography, although the judge in the case later threw out nearly all the evidence against the defendant due to \"false and misleading statements\" made by an FBI agent while trying to secure a search warrant for the customer's house, and the government ultimately dropped the case. Privacy On October 20, 2023, CBC News released the results of a Marketplace investigation which found that Best Buy technicians had viewed private files, such as intimate photos, on customer devices. One technician was also caught copying photos onto a USB flash drive. LGBT issues In March 2024, following threats of shareholder-related action from conservative advocacy groups, Best Buy agreed to block donations by employee resource groups to eight LGBT organizations, over their support for access to gender affirming care for trans minors. This was met with criticism by a number of groups, including GLAAD and the Human Rights Campaign."
}