{
  "ticker": "BDX",
  "cik": "0000010795",
  "company_name": "Becton Dickinson",
  "corrected_name": "Becton Dickinson",
  "wiki_title_used": "Becton Dickinson",
  "exists": true,
  "raw_text": "Becton, Dickinson and Company (BD; also Becton Dickinson or Becton) is an American multinational medical technology company that manufactures and sells medical devices, instrument systems, and reagents. BD  also provides consulting and analytics services in certain areas.\nBD is ranked #211 in the 2024 Fortune 500 list based on its revenues for the fiscal year ending September 30, 2023.\n\nHistory\nThe company was founded in 1897 in New York City by Maxwell Becton and Fairleigh S. Dickinson. It later moved its headquarters to New Jersey.\nIn 2004, BD agreed to pay out US$100 million to settle allegations from competitor Retractable Technologies that it had engaged in anti-competitive behavior to prevent the distribution of Retractable's syringes, which are designed to prevent needlestick injury. The lawsuit touched off a series of legal conflicts between the companies. Retractable would accuse BD of patent infringement after BD released a retractable needle of its own. Later Retractable would claim BD was falsely advertising its own brand of retractable needle as the “world’s sharpest needle”.\nIn October 2014, the company agreed to acquire CareFusion for a price of US$12.2 billion in cash and stock.\nIn April 2017, Becton, Dickinson and Company announced it would acquire C. R. Bard. The transaction was completed later that year, and the company became a wholly-owned subsidiary of BD, rebranded as Bard.\nIn 2024, BD announced it would acquire Edwards Lifesciences' critical care unit for $4.2 billion.\n\nFinances\nFor the fiscal year 2017, Becton Dickinson reported earnings of US$1.030 billion, with an annual revenue of US$12.093 billion, an increase of 10.5% over the previous fiscal cycle. Becton Dickinson's shares traded at over US$192 per share, and its market capitalization was valued at over US$63 billion in November 2018.\n\nBusiness segments\nCurrently there are three business segments.\n\nBD Medical\nIn certain places, BD Medical also offers consulting and analytics related services. BD Medical's Consulting services are primarily targeted at hospitals, healthcare systems and networks of healthcare providers.\n\nBD Life Sciences\nBusiness units include Biosciences and Integrated Diagnostic Solutions.\nOfferings include preanalytical solutions for sample management; immunology research, including flow cytometry and multiomics tools; microbiology and molecular diagnostics; lab automation and informatics; and differentiated reagents and assays.\n\nBD Interventional\nThe company's line of plastic conical screwtop test tubes, known as 'Falcon tubes', is popular and the term is sometimes used as a generic term for such tubes.\n\nEnvironmental and social track record\nAs of February 2010, BD was ranked 18th in the EPA Fortune 500 List of Green Power Purchasers. BD was also listed among the top 100 companies in Newsweek's 2009 Green Rankings ranking of the 500 largest American corporations based on environmental performance, policies, and reputation. BD placed third in the health care sector and 83rd overall. In addition, BD has been a component of the Dow Jones Sustainability World Index and the Dow Jones Sustainability North America Index for the four and five consecutive years, respectively.\nPfitzer et al. (2013) identify BD's development of a needleless injection system as an example of leading businesses' role in creating shared value.\n\nHealth and safety issues\nIn April 2016, the Occupational Safety and Health Administration fined BD US$112,700 for safety violations. They found repeat and serious violations of health and safety law that had resulted in two employees having partial finger amputations.\nIn 2020, C.R. Bard, Inc. and its parent company BD were fined $60 million USD for failing to adequately inform patients about health risks related to their transvaginal mesh devices.\n\nRecalls\n2007 Discardit II incident in Poland\nIn mid-2007, the firm's Discardit II series of syringes numbered 0607186 was withdrawn from hospitals and other medical services around Poland, about half a year after the discovery of remains of dark dust in some syringes, which were alleged to have been from this series. The newspaper Dziennik Online claimed that other series such as 06022444, 0603266, and 0607297 were also suspected of being contaminated.  BD recalled and tested the syringes in question, and revealed sterile particulates in 0.013 percent of the products.\n\n2010 Q-Syte Luer and IV Catheter partial recall\nIn February 2010 BD announced a voluntary product recall of certain lots of BD Q-Syte Luer Access Devices and BD Nexiva Closed IV Catheter Systems. BD stated that the use of the affected devices may cause an air embolism or leakage of blood and/or therapy, which may result in serious injury or death. The approximately 2.8 million BD Q-Syte and 2.9 million BD Nexiva units containing 5 million BD Q-Syte devices that were recalled were distributed in the United States, Asia, Canada, Europe, Mexico, the Middle East, South Africa, and South America. The recall was initiated on Oct. 28, 2009 after BD received complaints of problems due to air entry through a part of the device. BD stated that the cause of the problem was manufacturing deviation and claimed that it corrected the problem. BD announced that it notified customers about the recall by letter and has been working with the U.S. Food and Drug Administration and worldwide health agencies to coordinate recall activities.\n\n2021 IV Giving Sets\nIn March 2021 BD announced a recall of infusion sets for CC, GP, VP, GW/GW800, SE, and IVAC 590 Alaris Pumps and gravity infusion sets and connectors following the news that a supplier falsified sterilisation documents going back ten years.\n\nSee also\nBecton, Dickinson and Company headquarters\nList of biotech and pharmaceutical companies in the New York metropolitan area\n\nReferences\nExternal links\nOfficial website\nBusiness data for Becton, Dickinson and Company:",
  "clean_text": "Becton, Dickinson and Company (BD; also Becton Dickinson or Becton) is an American multinational medical technology company that manufactures and sells medical devices, instrument systems, and reagents. BD also provides consulting and analytics services in certain areas. BD is ranked #211 in the 2024 Fortune 500 list based on its revenues for the fiscal year ending September 30, 2023. History The company was founded in 1897 in New York City by Maxwell Becton and Fairleigh S. Dickinson. It later moved its headquarters to New Jersey. In 2004, BD agreed to pay out US$100 million to settle allegations from competitor Retractable Technologies that it had engaged in anti-competitive behavior to prevent the distribution of Retractable's syringes, which are designed to prevent needlestick injury. The lawsuit touched off a series of legal conflicts between the companies. Retractable would accuse BD of patent infringement after BD released a retractable needle of its own. Later Retractable would claim BD was falsely advertising its own brand of retractable needle as the “world’s sharpest needle”. In October 2014, the company agreed to acquire CareFusion for a price of US$12.2 billion in cash and stock. In April 2017, Becton, Dickinson and Company announced it would acquire C. R. Bard. The transaction was completed later that year, and the company became a wholly-owned subsidiary of BD, rebranded as Bard. In 2024, BD announced it would acquire Edwards Lifesciences' critical care unit for $4.2 billion. Finances For the fiscal year 2017, Becton Dickinson reported earnings of US$1.030 billion, with an annual revenue of US$12.093 billion, an increase of 10.5% over the previous fiscal cycle. Becton Dickinson's shares traded at over US$192 per share, and its market capitalization was valued at over US$63 billion in November 2018. Business segments Currently there are three business segments. BD Medical In certain places, BD Medical also offers consulting and analytics related services. BD Medical's Consulting services are primarily targeted at hospitals, healthcare systems and networks of healthcare providers. BD Life Sciences Business units include Biosciences and Integrated Diagnostic Solutions. Offerings include preanalytical solutions for sample management; immunology research, including flow cytometry and multiomics tools; microbiology and molecular diagnostics; lab automation and informatics; and differentiated reagents and assays. BD Interventional The company's line of plastic conical screwtop test tubes, known as 'Falcon tubes', is popular and the term is sometimes used as a generic term for such tubes. Environmental and social track record As of February 2010, BD was ranked 18th in the EPA Fortune 500 List of Green Power Purchasers. BD was also listed among the top 100 companies in Newsweek's 2009 Green Rankings ranking of the 500 largest American corporations based on environmental performance, policies, and reputation. BD placed third in the health care sector and 83rd overall. In addition, BD has been a component of the Dow Jones Sustainability World Index and the Dow Jones Sustainability North America Index for the four and five consecutive years, respectively. Pfitzer et al. (2013) identify BD's development of a needleless injection system as an example of leading businesses' role in creating shared value. Health and safety issues In April 2016, the Occupational Safety and Health Administration fined BD US$112,700 for safety violations. They found repeat and serious violations of health and safety law that had resulted in two employees having partial finger amputations. In 2020, C.R. Bard, Inc. and its parent company BD were fined $60 million USD for failing to adequately inform patients about health risks related to their transvaginal mesh devices. Recalls 2007 Discardit II incident in Poland In mid-2007, the firm's Discardit II series of syringes numbered 0607186 was withdrawn from hospitals and other medical services around Poland, about half a year after the discovery of remains of dark dust in some syringes, which were alleged to have been from this series. The newspaper Dziennik Online claimed that other series such as 06022444, 0603266, and 0607297 were also suspected of being contaminated. BD recalled and tested the syringes in question, and revealed sterile particulates in 0.013 percent of the products. 2010 Q-Syte Luer and IV Catheter partial recall In February 2010 BD announced a voluntary product recall of certain lots of BD Q-Syte Luer Access Devices and BD Nexiva Closed IV Catheter Systems. BD stated that the use of the affected devices may cause an air embolism or leakage of blood and/or therapy, which may result in serious injury or death. The approximately 2.8 million BD Q-Syte and 2.9 million BD Nexiva units containing 5 million BD Q-Syte devices that were recalled were distributed in the United States, Asia, Canada, Europe, Mexico, the Middle East, South Africa, and South America. The recall was initiated on Oct. 28, 2009 after BD received complaints of problems due to air entry through a part of the device. BD stated that the cause of the problem was manufacturing deviation and claimed that it corrected the problem. BD announced that it notified customers about the recall by letter and has been working with the U.S. Food and Drug Administration and worldwide health agencies to coordinate recall activities. 2021 IV Giving Sets In March 2021 BD announced a recall of infusion sets for CC, GP, VP, GW/GW800, SE, and IVAC 590 Alaris Pumps and gravity infusion sets and connectors following the news that a supplier falsified sterilisation documents going back ten years."
}