{
  "ticker": "BIIB",
  "cik": "0000875045",
  "company_name": "Biogen",
  "corrected_name": "Biogen",
  "wiki_title_used": "Biogen",
  "exists": true,
  "raw_text": "Biogen Inc. is an American multinational biotechnology company based in Cambridge, Massachusetts, United States specializing in the treatment of neurological diseases. The company's primary products are dimethyl fumarate (Tecfidera), diroximel fumarate (Vumerity), interferon beta-1a (AVONEX), peginterferon beta-1a (Plegridy), and natalizumab (Tysabri), all for the treatment of multiple sclerosis (collectively 45% of 2024 revenues); nusinersen (Spinraza) for the treatment of spinal muscular atrophy (16.2% of 2024 revenues); omaveloxolone (Skyclarys) for the treatment of Friedreich's ataxia (4.0% of 2024 revenues); tofersen (Qalsody) for the treatment of ALS; and dimethyl fumarate (Fumaderm) for the treatment of severe plaque psoriasis. The company also produces 5 biosimilars (8.2% of 2024 revenues) and has collaborations with Genentech for several drugs (18.1% of 2024 revenues).\nThe company is ranked 424th on the Fortune 500 and 845th on the Forbes Global 2000.\n\nHistory\nBiogen was founded in 1978 in Geneva as Biotechnology Geneva by several prominent biologists, including Kenneth Murray from the University of Edinburgh, Phillip Allen Sharp from the Massachusetts Institute of Technology, Walter Gilbert from Harvard University (Gilbert served as CEO during the start-up phase of Biogen), Heinz Schaller from the University of Heidelberg, and Charles Weissmann from the University of Zurich (Weissmann contributed the first product interferon alpha). Gilbert and Sharp were subsequently honored with Nobel Prizes: Gilbert was recognized in 1980 with the Nobel Prize in Chemistry for his understanding of DNA sequencing and Sharp received the Nobel Prize in Physiology or Medicine in 1993 for his discovery of split genes.\nIn 2003, Biogen merged with San Diego, California-based IDEC Pharmaceuticals (formed in 1985 by University of California-San Diego's physicians and immunologists Ivor Royston and Robert E. Sobol, San Diego bio entrepreneur Howard Birndorf, and Stanford University cancer researchers Ron Levy and Richard Miller) and adopted the name Biogen Idec. After the merger, Biogen Idec became the 3rd largest Biotechnology company in the world.\nFollowing shifts in research core areas, the company has since shortened its name, reverting to simply Biogen.\nIn May 2006, the company announced it would acquire cancer specialist, Conforma Therapeutics for $250 million. Later in the same month, the company announced its intention to acquire Fumapharm AG, consolidating ownership of Fumaderm and BG-12, an oral fumarate, which was being studied for the treatment of multiple sclerosis and psoriasis.\nIn January 2007, the company announced it would acquire Syntonix Pharmaceuticals for up to $120 million, gaining Syntonix's lead product for hemophilia B as well as the technology for developing inhalable treatments.\nIn 2008, two new brain infection cases from Tysabri users surfaced in Europe that raised international concern about Tysabri and its effects with the progressive multifocal leukoencephalopathy (PML) brain condition. Biogen is one of the drug's producers.\nIn 2011, Biogen announced that its drug Fampyra received conditional marketing approval. Under the conditional approval, Biogen agrees to provide additional data on the long-term benefits and safety of Fampyra.\nOn December 10, 2012, Biogen announced its global collaboration agreement with Isis Pharmaceuticals to develop and research antisense drugs to treat neurological and neuromuscular diseases.\nIn February 2013, Bloomberg broke the news that Biogen was planning to pay Elan $3.25 billion for the full rights to Tysabri, used to treat multiple sclerosis.\nIn 2013, Biogen was the first U.S.-based biotechnology company to appear on the Dow Jones Sustainability World Index.\nIn January 2015, the company announced that it would acquire Convergence Pharmaceuticals for up to $675 million, with the acquisition aiming to accelerate the development of Convergence's pipeline, in particular CNV1014802 – a Phase II small molecule sodium channel blocking candidate. In October 2015, the company announced that it would lay off 11% of its workforce, effective immediately.\nOn May 3, 2016, Biogen announced plans to spin off its hemophilia business, known as Bioverativ as an independent publicly traded company. Bioverativ offered two hemophilia drugs in 2016, Alprolix and Eloctate, and plans on developing its Hemophilia-focused goals.\nIn 2016, Biogen released Spinraza (nusinersin), a treatment for Spinal Muscular Atrophy. The drug is among the most expensive treatments available, with a price of $750,000 for the first year of doses, and $375,000 for each subsequent year and likely for the rest of a patient's life. While there still isn't a cure, Spinraza significantly improves the quality of life in infants and adults.\nIn 2017, Biogen announced that its drug Fampyra converted from conditional marketing authorization to standard marketing approval. EU multiple sclerosis (MS) patients use Fampyra to improve walking.\nIn February 2020, Biogen and Sangamo Therapeutics announced a global licensing deal to develop compounds for neuromuscular and neurological diseases.\nIn September 2020, Biogen Inc. made a $10 million deposit in OneUnited Bank to provide more capital to fund home loans and commercial development in Black communities. In November, the company announced it would acquire a $650 million stake in Cambridge-based Sage Therapeutics and make an upfront payment of $875 million, in order to jointly develop depression treatments.\nIn July 2023, Biogen acquired Reata Pharmaceuticals, headquartered in Plano, Texas, for nearly $6.5 billion. That month, the company also cut 1,000 jobs, or 11% of its workforce.\nIn May 2024, Biogen acquired Human Immunology Biosciences (HI-Bio) for $1.15 billion.\nIn July 2025, the company announced a $2 billion investment in manufacturing facilities in Research Triangle Park.\nIn September 2025, the company agreed to acquire Alcyone Therapeutics for $85 million. In November 2025, it was announced the acquisition had been completed.\n\nAducanumab\nIn 2007, the company reached a licensing agreement with Neurimmune, a spin-off from the University of Zurich, for the Alzheimer's disease drug, Aducanumab, developed by this Swiss company. Later, Neurimmune sold its rights for license fees for $200 million to Biogen.\nIn December 2014, Biogen announced that Aducanumab for Alzheimer's treatment was preparing to go through a late-stage trial of its experimental Alzheimer's disease treatment after the medication dramatically improved cognition and reduced brain plaque levels in early-stage study.\nIn March 2015, Aducanumab became the first experimental Alzheimer's treatment to show significant results in regard to slowing down cognitive decline and reducing brain-destroying plaques. In July 2015, Biogen initiated two late-stage studies called ENGAGE and EMERGE, which will assess Aducanumab in adults with early Alzheimer's disease.\nIn 2016, Aducanumab decreased amoyloid-beta in the brains of people with early-stage Alzheimer's disease, according to a report published in Nature on August 31, 2016. On March 21, 2019, Biogen announced that the Phase 3 clinical trials of Aducanumab were halted. Biogen announced it would acquire Nightstar Therapeutics for $25.50 per share ($800 million in total). Nightstar focused on adeno-associated virus based gene-therapies for inherited retinal disorders. With a setback in their drug research, Biogen's shares fell sharply that same month. It ended the trial of Aducanumab, which it was making along with Eisai. In October 2019, however, they announced that they would pursue FDA approval together with Eisai.\nOn October 22, 2019, despite two Phase 3 clinical trials being previously halted for futility, Biogen announced its plan to submit for FDA's approval of Aducanumab. In May 2020, Biogen wrapped up construction on a state-of-the-art facility in Solothurn, Switzerland, which will produce Aducanumab by late 2021, alongside its North Carolina manufacturing facility. The monoclonal antibody, co-developed with Eisai, attracted considerable interest from biotech investors when Warren Buffett's Berkshire Hathaway bought 648,447 Biogen shares at a combined value of $192.4 million.\nOn July 8, 2020, Biogen and Eisai announced that both companies had together successfully submitted for Aducanumab's FDA regulatory and marketing approval.\nOn June 7, 2021, the FDA gave accelerated approval to Aducanumab under the name Aduhelm, which proved to be controversial. The drug was priced at $56,000 US dollars per year, but it was not covered by many insurers as they awaited further proof that the drug was effective. The US Government did not subsidise it outside clinical trials. According to the FDA's website, the drug was proven to reduce amyloid-beta plaques in the brain, which was likely to benefit patients. The FDA has stated that if the post-approval trial did not indicate that Aduhelm works, the drug may be taken out of the market.\nBiogen abandoned the drug in January 2024, for financial reasons.\n\nBioverativ\nIn January 2017, the company completed the corporate spin-off its hemophilia drug business (Eloctate and Alprolix) into a public company, later named Bioverativ. It was acquired by Sanofi in 2018 for $11.6 billion.\n\nAcquisition history\nThe following is an illustration of the company's major mergers and acquisitions and historical predecessors (this is not a comprehensive list):\n\nConference during COVID-19 pandemic that led to 300,000 cases\nOn March 5, 2020, Biogen reported that three individuals who met with their employees at a conference in Boston had tested positive for COVID-19 the previous week. On March 6, public health officials reported five new cases associated with the Biogen leadership meeting and by March 9, Massachusetts health officials had announced 30 new presumptive COVID-19 cases, all connected to the Biogen conference. Researchers first estimated that the conference would be linked to over 20,000 of the state's COVID-19 cases. Researchers later estimated that up to 300,000 cases worldwide had been caused by the Biogen conference, including 1.6% of all U.S. cases of COVID-19.\n\nFinances\nProducts\nPipeline\nInvestigational MS medicines:\n\nDaclizumab High-Yield Process (DAC HYP): is being developed as a potential once-monthly subcutaneous injection in the treatment of relapsing-remitting multiple sclerosis (RRMS). DAC HYP is being developed in collaboration with Abbvie, Inc. In June 2014, the companies announced positive top-line results from the Phase III DECIDE clinical trial, where DAC HYP demonstrated superiority over interferon beta-1a in annualized relapse rate.\nAnti-LINGO-1 (BIIB033) (Opicinumab): is the first candidate being investigated for its potential to remyelinate and repair neurons damaged by MS. Phase II trials were conducted in 2016 but failed to reach their goals.\nBiogen has several candidates in Phase 1 and 2 clinical trials in neurodegenerative and immunological diseases including MS, neuropathic pain, spinal muscular atrophy and lupus nephritis:\n\nPhase 2a: anti-LINGO-1 molecule (Opicinumab) in acute optic neuritis\nPhase 2b: anti-TWEAK monoclonal antibody in lupus nephritis\nPhase 2a: STX-100 in patients with idiopathic pulmonary fibrosis\nPhase 2: Neublastin for neuropathic pain in 2013\nPhase 1/2: BIIB067 (ISIS-SOD1Rx) for amyotrophic lateral sclerosis, in collaboration with Ionis\nBiogen also has several development agreements in place with Ionis Pharmaceuticals to collaborate to leverage antisense technology in advancing the treatment of neurological disorders.\nIn February 2012, Biogen formed a joint venture with Samsung, Samsung Bioepis. Samsung acquired Biogen's interest in the venture in January 2022 for up to $2.3 billion.\nIn early 2014, Biogen entered into an agreement with Eisai to jointly develop and commercialize two of their candidates for Alzheimer's disease, which have the potential to reduce Aβ plaques that form in the brains of patients, as well as to slow the formation of new plaques, potentially improving symptoms and suppressing disease progression.\nBiogen also has since 2015 an agreement with AGTC to develop gene therapy for several genetic diseases, including X-linked retinoschisis (XLRS) and X-linked Retinitis pigmentosa (XLRP) ophthalmologic diseases. Biogen paid AGTC $124 million, including an equity investment of $30 million, and offered up to $1.1 billion in future milestone payments.\nIn March 2019, Biogen halted Phase 3 trials of Alzheimer's disease drug Aducanumab after \"an independent group's analysis show[ed] that the trials were unlikely to 'meet their primary endpoint.'\" However, in October 2019 they reversed their plans and said that they would be pursuing US FDA approval for Aducanumab. The reversal came after Biogen said a new analysis of a larger patient pool showed promising results. In July 2020, Biogen completed submission of a Biologics license application (BLA) to the FDA for review, and requested accelerated review. However, an advisory panel for the FDA voted against approval of this drug. On June 7, 2021, the FDA granted approval of Aducanumab for the treatment of Alzheimer's disease. Aducanumab was approved using the accelerated approval pathway, and Biogen will be required to conduct a post-approval clinical trial to verify clinical benefit for continued approval.\n\nLawsuits\nIn September 2022, Biogen agreed to pay $900 million to the U.S. federal government, states, and a whistleblower. Biogen had bribed doctors between 2009 and 2014 to increase prescriptions of Avonex, Tysabri, and Tecfidera (all for multiple sclerosis).\n\nSee also\nNeurological diseases\nKenneth Murray\nEisai\nTim Harris (biochemist)\n\nReferences\nExternal links\nOfficial website \nBusiness data for Biogen Inc.:",
  "clean_text": "Biogen Inc. is an American multinational biotechnology company based in Cambridge, Massachusetts, United States specializing in the treatment of neurological diseases. The company's primary products are dimethyl fumarate (Tecfidera), diroximel fumarate (Vumerity), interferon beta-1a (AVONEX), peginterferon beta-1a (Plegridy), and natalizumab (Tysabri), all for the treatment of multiple sclerosis (collectively 45% of 2024 revenues); nusinersen (Spinraza) for the treatment of spinal muscular atrophy (16.2% of 2024 revenues); omaveloxolone (Skyclarys) for the treatment of Friedreich's ataxia (4.0% of 2024 revenues); tofersen (Qalsody) for the treatment of ALS; and dimethyl fumarate (Fumaderm) for the treatment of severe plaque psoriasis. The company also produces 5 biosimilars (8.2% of 2024 revenues) and has collaborations with Genentech for several drugs (18.1% of 2024 revenues). The company is ranked 424th on the Fortune 500 and 845th on the Forbes Global 2000. History Biogen was founded in 1978 in Geneva as Biotechnology Geneva by several prominent biologists, including Kenneth Murray from the University of Edinburgh, Phillip Allen Sharp from the Massachusetts Institute of Technology, Walter Gilbert from Harvard University (Gilbert served as CEO during the start-up phase of Biogen), Heinz Schaller from the University of Heidelberg, and Charles Weissmann from the University of Zurich (Weissmann contributed the first product interferon alpha). Gilbert and Sharp were subsequently honored with Nobel Prizes: Gilbert was recognized in 1980 with the Nobel Prize in Chemistry for his understanding of DNA sequencing and Sharp received the Nobel Prize in Physiology or Medicine in 1993 for his discovery of split genes. In 2003, Biogen merged with San Diego, California-based IDEC Pharmaceuticals (formed in 1985 by University of California-San Diego's physicians and immunologists Ivor Royston and Robert E. Sobol, San Diego bio entrepreneur Howard Birndorf, and Stanford University cancer researchers Ron Levy and Richard Miller) and adopted the name Biogen Idec. After the merger, Biogen Idec became the 3rd largest Biotechnology company in the world. Following shifts in research core areas, the company has since shortened its name, reverting to simply Biogen. In May 2006, the company announced it would acquire cancer specialist, Conforma Therapeutics for $250 million. Later in the same month, the company announced its intention to acquire Fumapharm AG, consolidating ownership of Fumaderm and BG-12, an oral fumarate, which was being studied for the treatment of multiple sclerosis and psoriasis. In January 2007, the company announced it would acquire Syntonix Pharmaceuticals for up to $120 million, gaining Syntonix's lead product for hemophilia B as well as the technology for developing inhalable treatments. In 2008, two new brain infection cases from Tysabri users surfaced in Europe that raised international concern about Tysabri and its effects with the progressive multifocal leukoencephalopathy (PML) brain condition. Biogen is one of the drug's producers. In 2011, Biogen announced that its drug Fampyra received conditional marketing approval. Under the conditional approval, Biogen agrees to provide additional data on the long-term benefits and safety of Fampyra. On December 10, 2012, Biogen announced its global collaboration agreement with Isis Pharmaceuticals to develop and research antisense drugs to treat neurological and neuromuscular diseases. In February 2013, Bloomberg broke the news that Biogen was planning to pay Elan $3.25 billion for the full rights to Tysabri, used to treat multiple sclerosis. In 2013, Biogen was the first U.S.-based biotechnology company to appear on the Dow Jones Sustainability World Index. In January 2015, the company announced that it would acquire Convergence Pharmaceuticals for up to $675 million, with the acquisition aiming to accelerate the development of Convergence's pipeline, in particular CNV1014802 – a Phase II small molecule sodium channel blocking candidate. In October 2015, the company announced that it would lay off 11% of its workforce, effective immediately. On May 3, 2016, Biogen announced plans to spin off its hemophilia business, known as Bioverativ as an independent publicly traded company. Bioverativ offered two hemophilia drugs in 2016, Alprolix and Eloctate, and plans on developing its Hemophilia-focused goals. In 2016, Biogen released Spinraza (nusinersin), a treatment for Spinal Muscular Atrophy. The drug is among the most expensive treatments available, with a price of $750,000 for the first year of doses, and $375,000 for each subsequent year and likely for the rest of a patient's life. While there still isn't a cure, Spinraza significantly improves the quality of life in infants and adults. In 2017, Biogen announced that its drug Fampyra converted from conditional marketing authorization to standard marketing approval. EU multiple sclerosis (MS) patients use Fampyra to improve walking. In February 2020, Biogen and Sangamo Therapeutics announced a global licensing deal to develop compounds for neuromuscular and neurological diseases. In September 2020, Biogen Inc. made a $10 million deposit in OneUnited Bank to provide more capital to fund home loans and commercial development in Black communities. In November, the company announced it would acquire a $650 million stake in Cambridge-based Sage Therapeutics and make an upfront payment of $875 million, in order to jointly develop depression treatments. In July 2023, Biogen acquired Reata Pharmaceuticals, headquartered in Plano, Texas, for nearly $6.5 billion. That month, the company also cut 1,000 jobs, or 11% of its workforce. In May 2024, Biogen acquired Human Immunology Biosciences (HI-Bio) for $1.15 billion. In July 2025, the company announced a $2 billion investment in manufacturing facilities in Research Triangle Park. In September 2025, the company agreed to acquire Alcyone Therapeutics for $85 million. In November 2025, it was announced the acquisition had been completed. Aducanumab In 2007, the company reached a licensing agreement with Neurimmune, a spin-off from the University of Zurich, for the Alzheimer's disease drug, Aducanumab, developed by this Swiss company. Later, Neurimmune sold its rights for license fees for $200 million to Biogen. In December 2014, Biogen announced that Aducanumab for Alzheimer's treatment was preparing to go through a late-stage trial of its experimental Alzheimer's disease treatment after the medication dramatically improved cognition and reduced brain plaque levels in early-stage study. In March 2015, Aducanumab became the first experimental Alzheimer's treatment to show significant results in regard to slowing down cognitive decline and reducing brain-destroying plaques. In July 2015, Biogen initiated two late-stage studies called ENGAGE and EMERGE, which will assess Aducanumab in adults with early Alzheimer's disease. In 2016, Aducanumab decreased amoyloid-beta in the brains of people with early-stage Alzheimer's disease, according to a report published in Nature on August 31, 2016. On March 21, 2019, Biogen announced that the Phase 3 clinical trials of Aducanumab were halted. Biogen announced it would acquire Nightstar Therapeutics for $25.50 per share ($800 million in total). Nightstar focused on adeno-associated virus based gene-therapies for inherited retinal disorders. With a setback in their drug research, Biogen's shares fell sharply that same month. It ended the trial of Aducanumab, which it was making along with Eisai. In October 2019, however, they announced that they would pursue FDA approval together with Eisai. On October 22, 2019, despite two Phase 3 clinical trials being previously halted for futility, Biogen announced its plan to submit for FDA's approval of Aducanumab. In May 2020, Biogen wrapped up construction on a state-of-the-art facility in Solothurn, Switzerland, which will produce Aducanumab by late 2021, alongside its North Carolina manufacturing facility. The monoclonal antibody, co-developed with Eisai, attracted considerable interest from biotech investors when Warren Buffett's Berkshire Hathaway bought 648,447 Biogen shares at a combined value of $192.4 million. On July 8, 2020, Biogen and Eisai announced that both companies had together successfully submitted for Aducanumab's FDA regulatory and marketing approval. On June 7, 2021, the FDA gave accelerated approval to Aducanumab under the name Aduhelm, which proved to be controversial. The drug was priced at $56,000 US dollars per year, but it was not covered by many insurers as they awaited further proof that the drug was effective. The US Government did not subsidise it outside clinical trials. According to the FDA's website, the drug was proven to reduce amyloid-beta plaques in the brain, which was likely to benefit patients. The FDA has stated that if the post-approval trial did not indicate that Aduhelm works, the drug may be taken out of the market. Biogen abandoned the drug in January 2024, for financial reasons. Bioverativ In January 2017, the company completed the corporate spin-off its hemophilia drug business (Eloctate and Alprolix) into a public company, later named Bioverativ. It was acquired by Sanofi in 2018 for $11.6 billion. Acquisition history The following is an illustration of the company's major mergers and acquisitions and historical predecessors (this is not a comprehensive list): Conference during COVID-19 pandemic that led to 300,000 cases On March 5, 2020, Biogen reported that three individuals who met with their employees at a conference in Boston had tested positive for COVID-19 the previous week. On March 6, public health officials reported five new cases associated with the Biogen leadership meeting and by March 9, Massachusetts health officials had announced 30 new presumptive COVID-19 cases, all connected to the Biogen conference. Researchers first estimated that the conference would be linked to over 20,000 of the state's COVID-19 cases. Researchers later estimated that up to 300,000 cases worldwide had been caused by the Biogen conference, including 1.6% of all U.S. cases of COVID-19. Finances Products Pipeline Investigational MS medicines: Daclizumab High-Yield Process (DAC HYP): is being developed as a potential once-monthly subcutaneous injection in the treatment of relapsing-remitting multiple sclerosis (RRMS). DAC HYP is being developed in collaboration with Abbvie, Inc. In June 2014, the companies announced positive top-line results from the Phase III DECIDE clinical trial, where DAC HYP demonstrated superiority over interferon beta-1a in annualized relapse rate. Anti-LINGO-1 (BIIB033) (Opicinumab): is the first candidate being investigated for its potential to remyelinate and repair neurons damaged by MS. Phase II trials were conducted in 2016 but failed to reach their goals. Biogen has several candidates in Phase 1 and 2 clinical trials in neurodegenerative and immunological diseases including MS, neuropathic pain, spinal muscular atrophy and lupus nephritis: Phase 2a: anti-LINGO-1 molecule (Opicinumab) in acute optic neuritis Phase 2b: anti-TWEAK monoclonal antibody in lupus nephritis Phase 2a: STX-100 in patients with idiopathic pulmonary fibrosis Phase 2: Neublastin for neuropathic pain in 2013 Phase 1/2: BIIB067 (ISIS-SOD1Rx) for amyotrophic lateral sclerosis, in collaboration with Ionis Biogen also has several development agreements in place with Ionis Pharmaceuticals to collaborate to leverage antisense technology in advancing the treatment of neurological disorders. In February 2012, Biogen formed a joint venture with Samsung, Samsung Bioepis. Samsung acquired Biogen's interest in the venture in January 2022 for up to $2.3 billion. In early 2014, Biogen entered into an agreement with Eisai to jointly develop and commercialize two of their candidates for Alzheimer's disease, which have the potential to reduce Aβ plaques that form in the brains of patients, as well as to slow the formation of new plaques, potentially improving symptoms and suppressing disease progression. Biogen also has since 2015 an agreement with AGTC to develop gene therapy for several genetic diseases, including X-linked retinoschisis (XLRS) and X-linked Retinitis pigmentosa (XLRP) ophthalmologic diseases. Biogen paid AGTC $124 million, including an equity investment of $30 million, and offered up to $1.1 billion in future milestone payments. In March 2019, Biogen halted Phase 3 trials of Alzheimer's disease drug Aducanumab after \"an independent group's analysis show[ed] that the trials were unlikely to 'meet their primary endpoint.'\" However, in October 2019 they reversed their plans and said that they would be pursuing US FDA approval for Aducanumab. The reversal came after Biogen said a new analysis of a larger patient pool showed promising results. In July 2020, Biogen completed submission of a Biologics license application (BLA) to the FDA for review, and requested accelerated review. However, an advisory panel for the FDA voted against approval of this drug. On June 7, 2021, the FDA granted approval of Aducanumab for the treatment of Alzheimer's disease. Aducanumab was approved using the accelerated approval pathway, and Biogen will be required to conduct a post-approval clinical trial to verify clinical benefit for continued approval. Lawsuits In September 2022, Biogen agreed to pay $900 million to the U.S. federal government, states, and a whistleblower. Biogen had bribed doctors between 2009 and 2014 to increase prescriptions of Avonex, Tysabri, and Tecfidera (all for multiple sclerosis)."
}