{
  "ticker": "BKNG",
  "cik": "0001075531",
  "company_name": "Booking Holdings",
  "corrected_name": "Booking Holdings",
  "wiki_title_used": "Booking Holdings",
  "exists": true,
  "raw_text": "Booking Holdings Inc. is an American travel technology company incorporated under Delaware General Corporation Law and located on 800 Connecticut Avenue in Norwalk, Connecticut, that owns and operates several travel fare aggregators and travel fare metasearch engines including namesake and flagship Booking.com, Priceline.com, Agoda, Kayak, Cheapflights, Rentalcars.com, Momondo, and OpenTable. It operates websites in about 40 languages and 200 countries.\nThe company is ranked 243rd on the Fortune 500 list of the largest United States corporations by revenue. The company primarily derives its revenue from commissions, with a small portion derived from advertising. In 2023, consumers booked 1,049 million room nights of accommodation, 74 million rental car days, and 36 million airplane tickets using websites owned by Booking Holdings.\n\nHistory\nIn 1996, Jay S. Walker founded the company in Stamford, Connecticut, which launched Priceline.com, an online travel site, that used a Name Your Own Price bidding model.\nIn 1999, the company became a public company via an initial public offering, making Walker, who owned a 35% stake in the company, a multi-billionaire. The company's launch on the NASDAQ National Market was on March 30; it first traded under the ticker symbol \"PCLN\".\nThe company experimented with selling other products and services such as groceries, gasoline, home mortgages, and cars, but these offerings were discontinued in 2000.\nIn July 2005, the company acquired Booking.com for $133 million. and was merged with ActiveHotels.com, a European online hotel reservation company, purchased by Priceline Group for $161 million in September 2004.\nIn October 2009, the company became a component of the Nasdaq-100 index.\nIn April 2014, the name of the company was changed from priceline.com Incorporated to The Priceline Group Inc.\nIn August 2017, Kayak acquired the assets of Mundi, a Brazilian metasearch company.\nIn February 2018, the company changed its name to Booking Holdings, and its ticker symbol was changed to \"BKNG\".\nThe company offered to acquire GoToGate; however, the deal was blocked by European regulators.\n\nManagement and finances\nCEOs\nJeffery H. Boyd was named chief executive officer in 2002 and remained in that role until becoming chairman in 2013.\nEffective January 2014, Darren Huston was named chief executive officer of the company, replacing Jeff Boyd. In April 2016, Huston was forced to resign following an undisclosed personal relationship with an employee, and Boyd was named interim CEO.\nEffective January 2017, Glenn D. Fogel was named chief executive officer and president.\n\nFinances\nThe key trends for Booking Holdings are (as at the financial year ending December 31):\n\nAcquisitions\nReferences\nExternal links\n\nOfficial website\nBusiness data for Booking Holdings Inc.:",
  "clean_text": "Booking Holdings Inc. is an American travel technology company incorporated under Delaware General Corporation Law and located on 800 Connecticut Avenue in Norwalk, Connecticut, that owns and operates several travel fare aggregators and travel fare metasearch engines including namesake and flagship Booking.com, Priceline.com, Agoda, Kayak, Cheapflights, Rentalcars.com, Momondo, and OpenTable. It operates websites in about 40 languages and 200 countries. The company is ranked 243rd on the Fortune 500 list of the largest United States corporations by revenue. The company primarily derives its revenue from commissions, with a small portion derived from advertising. In 2023, consumers booked 1,049 million room nights of accommodation, 74 million rental car days, and 36 million airplane tickets using websites owned by Booking Holdings. History In 1996, Jay S. Walker founded the company in Stamford, Connecticut, which launched Priceline.com, an online travel site, that used a Name Your Own Price bidding model. In 1999, the company became a public company via an initial public offering, making Walker, who owned a 35% stake in the company, a multi-billionaire. The company's launch on the NASDAQ National Market was on March 30; it first traded under the ticker symbol \"PCLN\". The company experimented with selling other products and services such as groceries, gasoline, home mortgages, and cars, but these offerings were discontinued in 2000. In July 2005, the company acquired Booking.com for $133 million. and was merged with ActiveHotels.com, a European online hotel reservation company, purchased by Priceline Group for $161 million in September 2004. In October 2009, the company became a component of the Nasdaq-100 index. In April 2014, the name of the company was changed from priceline.com Incorporated to The Priceline Group Inc. In August 2017, Kayak acquired the assets of Mundi, a Brazilian metasearch company. In February 2018, the company changed its name to Booking Holdings, and its ticker symbol was changed to \"BKNG\". The company offered to acquire GoToGate; however, the deal was blocked by European regulators. Management and finances CEOs Jeffery H. Boyd was named chief executive officer in 2002 and remained in that role until becoming chairman in 2013. Effective January 2014, Darren Huston was named chief executive officer of the company, replacing Jeff Boyd. In April 2016, Huston was forced to resign following an undisclosed personal relationship with an employee, and Boyd was named interim CEO. Effective January 2017, Glenn D. Fogel was named chief executive officer and president. Finances The key trends for Booking Holdings are (as at the financial year ending December 31): Acquisitions"
}