{
  "ticker": "BKR",
  "cik": "0001701605",
  "company_name": "Baker Hughes",
  "corrected_name": "Baker Hughes",
  "wiki_title_used": "Baker Hughes",
  "exists": true,
  "raw_text": "Baker Hughes Company is an American global energy technology company co-headquartered in Houston, Texas and London, UK. As one of the world's largest oil field services, industrial and energy technology companies, it provides products and services to the oil and gas industry for exploration and production, as well as other energy and industrial applications. It operates in over 120 countries, with facilities in Australia, Brazil, Singapore, Malaysia, India, Dubai, Saudi Arabia, Italy, Germany, Norway, the United Kingdom and the United States. \nBaker Hughes manufactures equipment which can also be used for industrial applications such as hydrogen production, geothermal energy resources, enhanced geothermal, and carbon capture utilization and storage, as part of the energy transition.\n\nDivisions\nThe company divides its organization into the following segments:\n\nOilfield Services and Equipment – provides drilling, completion, production, intervention, subsea systems, flexible pipes, and related services for petroleum and geothermal industries.\nIndustrial and Energy Technology – supplies equipment and services for mechanical drive, compression, power generation, and measurement, as well as climate-related technologies such as carbon capture, hydrogen, and emissions management.\nThe company has acquired many legacy brands and businesses over the years, including Bently Nevada.\n\nHistory\nBaker Hughes traces its roots to the 1987 merger of Hughes Tool Company and Baker Oil Tool Company and the company has subsequently grown via acquisitions.\n\nHughes Tool Company\nThe Hughes Tool Company was founded in 1908 by business partners Walter Benona Sharp and Howard R. Hughes, Sr., father of Howard Hughes, Jr. That year, Hughes, Sr. and Sharp developed the first two-cone drill bit, designed to enable rotary drilling in harder, deeper formations than was possible with earlier fishtail bits. They conducted two secret tests on a drilling rig in Goose Creek, Texas. Each time, Hughes asked the drilling crew to leave the rig floor, pulled the bit from a locked wooden box, and then his associates ran the bit into the hole. The drill pipe twisted off on the first test, but the second was extremely successful. Following these successful drill bit tests, the partners founded the Sharp-Hughes Tool Company in 1909. The first shop to manufacture the bit occupied a 20-foot by 40-foot rented space. On August 10, 1909, the United States Patent and Trademark Office granted a patent to Hughes.\nAfter Walter Sharp died in 1912, Hughes purchased Sharp's half of the business. The company was renamed Hughes Tool Company in 1915, and Hughes, Jr. inherited it after his father's death in 1924. In 1933, the company introduced the Tricone drill bit. Through the 1950s and 1960s, Hughes Tool Company remained a private enterprise, owned by Hughes. While Hughes was engaged in his Hollywood and aviation enterprises, managers in Houston, such as Fred W. Ayers and Maynard Ellsworth Montrose, kept the tool company growing through technical innovation and international expansion. In 1958, the Engineering and Research Laboratory was enlarged to accommodate six laboratory sections that housed specialized instruments, such as a direct reading spectrometer and x-ray diffractometer. In 1959, Hughes introduced self-lubricating, sealed bearing rock bits. After collecting data from thousands of bit runs, Hughes introduced the first comprehensive guides to efficient drilling practices in 1960; in 1964, X-Line rock bits were introduced, combining new cutting structure designs and hydraulic jets.\nHughes Tool Company acquired Brown Oil Tools in 1978. Brown Oil Tools was founded by Cicero C. Brown in 1929 in Houston and patented the first liner hanger in 1937. Liner hangers enable drillers to lengthen their casing strings without having the liner pipe extend all the way to the surface. This saves capital cost and reduces weight borne by offshore platforms.\nOil Base Inc. (OBI), founded by George Miller in 1942, was acquired by Hughes Tool Company in 1979, and renamed Hughes Drilling Fluids in 1982. In 1949, OBI introduced Black Magic SFT, a drilling fluid additive to free stuck pipe that is still sold today.\n\nBaker Oil Tool Company\nReuben C. Baker (1872–1957) was a farm boy who never advanced in school beyond the third grade. He followed his brother Aaron Alphonso Baker into the oil business. In 1895, he got a job in a California oilfield driving a horse team to haul oil for drillers. One year later, he became a drilling contractor. In July 1907, he was granted a U.S. patent for a casing shoe that enabled drillers to efficiently run casing and cement it in oil wells. The casing shoe revolutionized cable tool drilling by ensuring the uninterrupted flow of oil through the bottom of the casing in the well. In 1913, he founded Baker Casing Shoe Company. In the 1920s, it expanded into national and international markets. In 1928, Baker Casing Shoe Company changed its name to Baker Oil Tools, Inc. to reflect its product line of completion, cementing, and fishing equipment. Baker Oil Tools expanded to Houston in the 1920s.\nIn 1942, driven in part by the shortage of steel during World War II, the company introduced the Model D Packer, which enabled multiple completions in the same well. In 1943, the company earned the Army-Navy E Flag for its wartime manufacturing contributions.\nIn early 1956, during one of the most successful periods in the company's history, Baker retired as President of Baker Oil Tools and was succeeded by his long-time associate Ted Sutter. Baker died only a few weeks later after a brief illness at the age of 85. Although he only had three years of formal education, Baker received more than 150 patents in his lifetime. In 1962, it acquired Pressure Services. In 1963, it acquired Kobe, one of the largest manufacturers of hydraulic systems for oil well pumping.\nIn 1964, Sutter was succeeded by E.H. \"Hubie\" Clark, who became the first Baker Hughes chairman of the board in 1987. During its 80-year history prior to its merger with Baker Hughes, Baker Oil Tools had only three chief executive officers.\nIn 1970, Baker Oil Tools acquired Lynes, Inc., which produced liner hangers and other completion equipment. In 1978, Baker Oil Tools introduced the Bakerline casing liner hanger.  In 1985, the FlexLock Liner Hanger was introduced, extending the performance range and functionality of liner hanger systems. In 1987, the Brown liner hanger technology was merged into Baker Oil Tools. In 1992, Baker Oil Tools introduced the ZXP Liner Top Packer, with expandable metal seals, which set the stage for development of expandable screens, casing systems and liner hangers. In 1994, Baker Oil Tools introduced multilateral completion systems, which enabled operators to install completion tools and perform selective intervention work in multiple horizontal sections from a common main borehole.\nIn 1971, the company acquired Milchem, a provider of drilling fluids, for approximately $20 million in stock. In 1931, Max B. Miller devised a drilling mud using a white clay as a weighting material. To market the new mud, he formed The Milwhite Company in Texas. In the mid-1930s, the company mined barites in conjunction with the Magnet Cove Barium Corporation (later called Magcobar). After a hiatus during World War II, the company resumed grinding operations using barite from a mine in Missouri and conducted mud sales through independent distributors. After 1956, Milwhite Mud Sales Company built its own sales network. In 1963, the company acquired Aquaness, and in 1964 the combination became Milchem.\nIn 1972, the company acquired Exploration Logging Company (EXLOG), a leader in mud logging. EXLOG was founded in 1952 in Sacramento, California by Vern C. Jones, and had 800 employees.\nIn November 1975, the company acquired Reed Tool Company of Houston in a $120 million stock transaction.\nIn 1976, it became Baker International Corporation with almost all of its operations headquartered in Houston.\nIn 1985, Baker International acquired the drilling fluids division of Newpark Resources and merged it with Milchem's mud division to form Milpark.\n\nMerger to form Baker Hughes (1987)\nAs a result of the 1980s oil glut, in 1987, Baker International merged with Hughes Tool Company in a $728 million stock transaction to form Baker Hughes Incorporated. The merger required Baker to enter into a consent decree to divest Reed Tool Company, Reed's facility in Singapore, and its Baker Lift division. Hughes attempted to terminate the agreement after Baker entered into the consent decree; however, Baker sued Hughes for $1 billion and Hughes shareholders voted overwhelmingly to complete the transaction.\n\nViolation of Foreign Corrupt Practices Act (2001–2003)\nIn April 2007, the company pleaded guilty in U.S. federal court to violations of the Foreign Corrupt Practices Act (FCPA) and agreed to pay $44.1 million in fines and penalties for making $4.1 million in \"commission\" payments between 2001 and 2003 that allegedly resulted in an oil-services contract in the Karachaganak Field in Kazakhstan.\n\nLargest vessel in Gulf of Mexico (2001)\nIn 2001, the company introduced the largest fracking proppants vessel for deepwater work in the Gulf of Mexico. It was named after founder Howard R. Hughes Sr.\n\nThreat of strike action (2012)\nOn June 11, 2012, during the annual period of negotiations between trade unions, including SAFE, the Norwegian union for energy workers, and their employer counterparts in Norway, 114 Baker Hughes employees were called to a strike action, which would have affected over a dozen installations. On June 18, 2012, the strike was called off after the parties agreed to a new collective agreement.\n\nEmissions\nIn January 2019, Baker Hughes pledged to reduce carbon dioxide equivalent emissions by 50% by 2030, and 100% by 2050 from a 2012 baseline.\nIn June 2021, Baker Hughes signed a memorandum of understanding with Borg CO2 to develop carbon capture, liquefaction, and transportation technologies on a waste-to-energy plant in Sarpsborg.\n\nAcquisitions, divestures, and joint ventures\n1989–1990 acquisitions and divestitures\nIn 1989, the company acquired Bird Machine Company for $47.5 million, Vetco Services for $37 million, and EDECO Petroleum Services for $12.1 million. In 1990, the company acquired Eastman Christensen, a leader in directional drilling systems and diamond bit technology, for $600 million. It also acquired the instrumentation units of Tracor Holdings for $93.7 million in cash and Chemlink for $136 million in cash. In 1990, the company also sold Totco division of its Exlog subsidiary to NOV Inc. for $41 million in cash and stock.\n\nEastman Christensen (1990)\nIn 1929, H. John Eastman introduced \"controlled directional drilling\" in Huntington Beach, California, using whipstocks and magnetic survey instruments to deflect the drill pipe from shore-based rigs to reach oil deposits offshore. In 1934, Eastman Whipstock Inc. was founded by Eastman and Roman W. Hines, the same year the company drilled the world's first relief well to control a blowout in Conroe, Texas, that had been on fire for more than a year.\nIn 1957, Frank Christensen's Christensen Diamond Products opened a manufacturing plant in Celle, Germany. The facility built diamond core heads and drilling bits and soon began producing stabilizers, drilling jars and other equipment. In 1977, the Celle engineering and manufacturing team introduced the Navi-Drill line of downhole drilling motors, which has led the drilling industry in performance and reliability for three decades. Other innovations developed in Celle include the industry's first steerable motor system, and the AutoTrak Rotary Closed Loop System, a pioneering directional drilling tool. In 1978, Christensen Diamond Products was acquired by Norton Co. and changed its name to Norton Christensen. In 1986, Eastman Whipstock merged with Norton Christensen to form Eastman Christensen.\nIn 1990, Baker Hughes acquired Eastman Christensen from Norton Abrasives for $550 million. To receive approval from the United States Department of Justice, the company sold its Hughes Tool diamond bit business. Baker Hughes combined Eastman Christensen and the remainder of Hughes Tools to form Hughes Christensen.\nIn 1993, Hughes Christensen introduced the AR-Series PDC bits, anti-whirl bits with increased penetration rates up to 100% in some applications and extended bit life as much as four-fold, compared to previous bit designs. By 1995, Hughes Christensen's Gold Series PDC line increased drilling efficiency by reducing the frictional forces that can accumulate in front of the cutting edge, reducing the energy required to remove the rock. In 1996, patented ChipMaster PDCs, known for their efficiency and durability, were built on the success of the Eggbeater product line. Hughes Christensen next introduced the Genesis HCM bits for steerable motors with patented EZSteer depth-of-cut control technology. This same technology was adapted to Genesis HCR bits for rotary steerable systems, such as the Baker Hughes AutoTrak rotary closed loop system. Genesis ZX PDCs followed with new Zenith cutters.\n\nTeleco Oilfield Services (1992)\nIn April 1992, Baker Hughes acquired Teleco Oilfield Services, a provider of directional measurement-while-drilling technology, from Sonat for $200 million cash, preferred stock and royalty from future sales of Teleco's \"triple combo\" sensors. Teleco Oilfield Services was founded in 1972 and introduced the world's first MWD tool in 1978. Teleco had approximately 1,300 employees, including 430 in Meriden, Connecticut. In 1993, Baker Hughes INTEQ was formed by combining five of the company's oilfield divisions.\n\nPetrolite (1997)\nPetrolite was formed in 1930 from the merger of William Barnickel's Tret-O-Lite with Petroleum Rectifying Company of California (PETRECO). In 1997, Baker Hughes acquired Petrolite for $693 million in stock. At that time, Wm. S. Barnickel & Co. owned 47% of Petrolite.\nIn 2003, the division acquired Cornerstone Pipeline Inspection Group.\n\nDrilex (1997)\nIn 1997, the company acquired Drilex, a provider of drilling products and services, for $109 million in stock.\n\nWestern Rock Bit Company (1998)\nIn 1998, the company acquired Western Rock Bit Company, a Canadian bit distributor, for $30.8 million.\n\nWestern Atlas (1998)\nWestern Atlas, which specialized in finding oil by mapping geological formations with sound waves and using wires to manipulate tools and gauges in oil and natural-gas wells, was divested from Litton Industries in 1994. In 1995, Western Atlas acquired 50% of PetroAlliance Services Company, Ltd., which offered seismic, well-logging, and integrated project services in the Post-Soviet states. In May 1997, Western Atlas acquired Sungroup Energy Services, a Canadian well logging, production testing, and completion services provider. During the fourth quarter of 1997, Western Atlas acquired Geosignal, a seismic data processing company; Seismic Resources, a provider of nonexclusive seismic surveys; and ParaMagnetic Logging, a well-logging research company. In the fourth quarter of 1997, the company acquired Heartland Kingfisher, a Canadian well-logging company.\nOn August 10, 1998, Baker Hughes acquired Western Atlas for $5.5 billion in stock plus the assumption of $700 million in debt. The acquisition was made in part to prevent an acquisition of Western Atlas by Halliburton. The acquisition added strong seismic-data operations as well as downhole wireline and testing services.\n\nJoint venture with Schlumberger (2000–2006)\nIn 1999, the only new seismic technology that was being introduced was the 4-dimensional seismic survey monitoring.\nIn 2000, during a downturn in the petroleum industry, the company merged its Western Geophysical division with Schlumberger's Geco (Geophysical Company of Norway) to form WesternGeco.\nIn 2006, Baker Hughes sold its 30% share of WesternGeco to Schlumberger for $2.4 billion in cash.\n\nOCRE (2001)\nIn 2001, Baker Hughes acquired OCRE (Scotland) Ltd. from Maritime Well Service, a division of Aker ASA.\n\nNova Technology Corporation (2006)\nIn February 2006, Baker Hughes acquired Nova Technology Corporation, a supplier of permanent monitoring, chemical injection systems, and multiline services for deepwater and subsea oil and gas well applications, for $70 million in cash and assumed debt.\n\nJOA Oil and Gas BV (2010)\nIn October 2010, Baker Hughes acquired JOA Oil & Gas BV. JOA developed JewelSuite, a reservoir modelling software.\n\nBJ Services Company (2010–2017)\nIn 1990, the company sold a 71% stake in BJ Services via an initial public offering. On April 28, 2010, Baker Hughes re-acquired BJ Services. In 2017, after the division suffered market share losses, the company sold a majority interest in BJ Services to private equity firms to obtain approval for the merger with GE Oil and Gas.\n\nProposed acquisition by Halliburton (2016)\nIn November 2014, the company agreed to a merger with Halliburton valued at $34.6 billion. If consummated, it would have been the largest merger in the history of the petroleum industry. The merger was approved by both companies' stockholders; however, on April 6, 2016, the United States Department of Justice sued to block the transaction due to concerns that the merger would affect competition and prices in the oilfield service industry. On May 1, 2016, the companies terminated the merger agreement due to the regulatory opposition.\n\nMerger with GE Oil and Gas (2017)\nIn July 2017, the company merged with GE Oil and Gas. As part of the transaction, the company sold a 53.3% percent stake in the hydraulic fracturing and cementing business to CSL Capital Management and Goldman Sachs’ West Street Energy Partners for $325 million. General Electric announced plans to divest its stake by 2023; by year-end 2021, its remaining ownership was approximately 11.4%.\n\nSale of Reciprocating Compression division (2019)\nIn 2019, the company sold its Reciprocating Compression division to Arcline Investment Management, a private equity firm.\n\nSale of chemical manufacturing facility to Sterling Auxiliaries (2020)\nIn September 2020, Sterling Auxiliaries & Artek Surfin Chemicals acquired Baker Hughes' Sand Springs chemical manufacturing facility.\n\nCompact Carbon Capture (2020)\nIn November 2020, Baker Hughes acquired Compact Carbon Capture, a company developing solvent-based carbon capture patents.\n\nJoint venture with Aramco (2020)\nIn December 2020, Baker Hughes set up a joint venture with Aramco to create a non-metallic materials company called Novel Non-Metallic Solutions Manufacturing. Novel's facility is being developed at King Salman Energy Park.\n\nARMS Reliability (2021)\nIn 2021, Baker Hughes acquired ARMS Reliability, a company providing advisory services and software to several industries.\n\nSRI International (2021)\nIn March 2021, Baker Hughes acquired a license for the use of mixed-salt process technology for flue gas carbon capture from SRI International.\n\nJoint venture with Akastor (2021)\nIn March 2021, Baker Hughes announced the creation of a joint venture for drilling services with Akastor ASA's subsidiary, MHWirth AS.\n\nAltus Intervention (2022)\nin March 2022, Baker Hughes acquired Altus Intervention, an oilwell specialist company headquartered in Norway.\n\nSale of operations in Russia (2022)\nIn August 2022, after the 2022 Russian invasion of Ukraine, the company agreed to sell its operations in Russia to local management.\n\nQuest Integrity (2022)\nIn November 2022, the company acquired Quest Integrity from Team, Inc. for $279 million.\nChart Industries (2025)\nIn July 2025, Baker Hughes announced they were acquiring Chart Industries for $13.6 billion\n\nSee also\nList of oilfield service companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for Baker Hughes Company:",
  "clean_text": "Baker Hughes Company is an American global energy technology company co-headquartered in Houston, Texas and London, UK. As one of the world's largest oil field services, industrial and energy technology companies, it provides products and services to the oil and gas industry for exploration and production, as well as other energy and industrial applications. It operates in over 120 countries, with facilities in Australia, Brazil, Singapore, Malaysia, India, Dubai, Saudi Arabia, Italy, Germany, Norway, the United Kingdom and the United States. Baker Hughes manufactures equipment which can also be used for industrial applications such as hydrogen production, geothermal energy resources, enhanced geothermal, and carbon capture utilization and storage, as part of the energy transition. Divisions The company divides its organization into the following segments: Oilfield Services and Equipment – provides drilling, completion, production, intervention, subsea systems, flexible pipes, and related services for petroleum and geothermal industries. Industrial and Energy Technology – supplies equipment and services for mechanical drive, compression, power generation, and measurement, as well as climate-related technologies such as carbon capture, hydrogen, and emissions management. The company has acquired many legacy brands and businesses over the years, including Bently Nevada. History Baker Hughes traces its roots to the 1987 merger of Hughes Tool Company and Baker Oil Tool Company and the company has subsequently grown via acquisitions. Hughes Tool Company The Hughes Tool Company was founded in 1908 by business partners Walter Benona Sharp and Howard R. Hughes, Sr., father of Howard Hughes, Jr. That year, Hughes, Sr. and Sharp developed the first two-cone drill bit, designed to enable rotary drilling in harder, deeper formations than was possible with earlier fishtail bits. They conducted two secret tests on a drilling rig in Goose Creek, Texas. Each time, Hughes asked the drilling crew to leave the rig floor, pulled the bit from a locked wooden box, and then his associates ran the bit into the hole. The drill pipe twisted off on the first test, but the second was extremely successful. Following these successful drill bit tests, the partners founded the Sharp-Hughes Tool Company in 1909. The first shop to manufacture the bit occupied a 20-foot by 40-foot rented space. On August 10, 1909, the United States Patent and Trademark Office granted a patent to Hughes. After Walter Sharp died in 1912, Hughes purchased Sharp's half of the business. The company was renamed Hughes Tool Company in 1915, and Hughes, Jr. inherited it after his father's death in 1924. In 1933, the company introduced the Tricone drill bit. Through the 1950s and 1960s, Hughes Tool Company remained a private enterprise, owned by Hughes. While Hughes was engaged in his Hollywood and aviation enterprises, managers in Houston, such as Fred W. Ayers and Maynard Ellsworth Montrose, kept the tool company growing through technical innovation and international expansion. In 1958, the Engineering and Research Laboratory was enlarged to accommodate six laboratory sections that housed specialized instruments, such as a direct reading spectrometer and x-ray diffractometer. In 1959, Hughes introduced self-lubricating, sealed bearing rock bits. After collecting data from thousands of bit runs, Hughes introduced the first comprehensive guides to efficient drilling practices in 1960; in 1964, X-Line rock bits were introduced, combining new cutting structure designs and hydraulic jets. Hughes Tool Company acquired Brown Oil Tools in 1978. Brown Oil Tools was founded by Cicero C. Brown in 1929 in Houston and patented the first liner hanger in 1937. Liner hangers enable drillers to lengthen their casing strings without having the liner pipe extend all the way to the surface. This saves capital cost and reduces weight borne by offshore platforms. Oil Base Inc. (OBI), founded by George Miller in 1942, was acquired by Hughes Tool Company in 1979, and renamed Hughes Drilling Fluids in 1982. In 1949, OBI introduced Black Magic SFT, a drilling fluid additive to free stuck pipe that is still sold today. Baker Oil Tool Company Reuben C. Baker (1872–1957) was a farm boy who never advanced in school beyond the third grade. He followed his brother Aaron Alphonso Baker into the oil business. In 1895, he got a job in a California oilfield driving a horse team to haul oil for drillers. One year later, he became a drilling contractor. In July 1907, he was granted a U.S. patent for a casing shoe that enabled drillers to efficiently run casing and cement it in oil wells. The casing shoe revolutionized cable tool drilling by ensuring the uninterrupted flow of oil through the bottom of the casing in the well. In 1913, he founded Baker Casing Shoe Company. In the 1920s, it expanded into national and international markets. In 1928, Baker Casing Shoe Company changed its name to Baker Oil Tools, Inc. to reflect its product line of completion, cementing, and fishing equipment. Baker Oil Tools expanded to Houston in the 1920s. In 1942, driven in part by the shortage of steel during World War II, the company introduced the Model D Packer, which enabled multiple completions in the same well. In 1943, the company earned the Army-Navy E Flag for its wartime manufacturing contributions. In early 1956, during one of the most successful periods in the company's history, Baker retired as President of Baker Oil Tools and was succeeded by his long-time associate Ted Sutter. Baker died only a few weeks later after a brief illness at the age of 85. Although he only had three years of formal education, Baker received more than 150 patents in his lifetime. In 1962, it acquired Pressure Services. In 1963, it acquired Kobe, one of the largest manufacturers of hydraulic systems for oil well pumping. In 1964, Sutter was succeeded by E.H. \"Hubie\" Clark, who became the first Baker Hughes chairman of the board in 1987. During its 80-year history prior to its merger with Baker Hughes, Baker Oil Tools had only three chief executive officers. In 1970, Baker Oil Tools acquired Lynes, Inc., which produced liner hangers and other completion equipment. In 1978, Baker Oil Tools introduced the Bakerline casing liner hanger. In 1985, the FlexLock Liner Hanger was introduced, extending the performance range and functionality of liner hanger systems. In 1987, the Brown liner hanger technology was merged into Baker Oil Tools. In 1992, Baker Oil Tools introduced the ZXP Liner Top Packer, with expandable metal seals, which set the stage for development of expandable screens, casing systems and liner hangers. In 1994, Baker Oil Tools introduced multilateral completion systems, which enabled operators to install completion tools and perform selective intervention work in multiple horizontal sections from a common main borehole. In 1971, the company acquired Milchem, a provider of drilling fluids, for approximately $20 million in stock. In 1931, Max B. Miller devised a drilling mud using a white clay as a weighting material. To market the new mud, he formed The Milwhite Company in Texas. In the mid-1930s, the company mined barites in conjunction with the Magnet Cove Barium Corporation (later called Magcobar). After a hiatus during World War II, the company resumed grinding operations using barite from a mine in Missouri and conducted mud sales through independent distributors. After 1956, Milwhite Mud Sales Company built its own sales network. In 1963, the company acquired Aquaness, and in 1964 the combination became Milchem. In 1972, the company acquired Exploration Logging Company (EXLOG), a leader in mud logging. EXLOG was founded in 1952 in Sacramento, California by Vern C. Jones, and had 800 employees. In November 1975, the company acquired Reed Tool Company of Houston in a $120 million stock transaction. In 1976, it became Baker International Corporation with almost all of its operations headquartered in Houston. In 1985, Baker International acquired the drilling fluids division of Newpark Resources and merged it with Milchem's mud division to form Milpark. Merger to form Baker Hughes (1987) As a result of the 1980s oil glut, in 1987, Baker International merged with Hughes Tool Company in a $728 million stock transaction to form Baker Hughes Incorporated. The merger required Baker to enter into a consent decree to divest Reed Tool Company, Reed's facility in Singapore, and its Baker Lift division. Hughes attempted to terminate the agreement after Baker entered into the consent decree; however, Baker sued Hughes for $1 billion and Hughes shareholders voted overwhelmingly to complete the transaction. Violation of Foreign Corrupt Practices Act (2001–2003) In April 2007, the company pleaded guilty in U.S. federal court to violations of the Foreign Corrupt Practices Act (FCPA) and agreed to pay $44.1 million in fines and penalties for making $4.1 million in \"commission\" payments between 2001 and 2003 that allegedly resulted in an oil-services contract in the Karachaganak Field in Kazakhstan. Largest vessel in Gulf of Mexico (2001) In 2001, the company introduced the largest fracking proppants vessel for deepwater work in the Gulf of Mexico. It was named after founder Howard R. Hughes Sr. Threat of strike action (2012) On June 11, 2012, during the annual period of negotiations between trade unions, including SAFE, the Norwegian union for energy workers, and their employer counterparts in Norway, 114 Baker Hughes employees were called to a strike action, which would have affected over a dozen installations. On June 18, 2012, the strike was called off after the parties agreed to a new collective agreement. Emissions In January 2019, Baker Hughes pledged to reduce carbon dioxide equivalent emissions by 50% by 2030, and 100% by 2050 from a 2012 baseline. In June 2021, Baker Hughes signed a memorandum of understanding with Borg CO2 to develop carbon capture, liquefaction, and transportation technologies on a waste-to-energy plant in Sarpsborg. Acquisitions, divestures, and joint ventures 1989–1990 acquisitions and divestitures In 1989, the company acquired Bird Machine Company for $47.5 million, Vetco Services for $37 million, and EDECO Petroleum Services for $12.1 million. In 1990, the company acquired Eastman Christensen, a leader in directional drilling systems and diamond bit technology, for $600 million. It also acquired the instrumentation units of Tracor Holdings for $93.7 million in cash and Chemlink for $136 million in cash. In 1990, the company also sold Totco division of its Exlog subsidiary to NOV Inc. for $41 million in cash and stock. Eastman Christensen (1990) In 1929, H. John Eastman introduced \"controlled directional drilling\" in Huntington Beach, California, using whipstocks and magnetic survey instruments to deflect the drill pipe from shore-based rigs to reach oil deposits offshore. In 1934, Eastman Whipstock Inc. was founded by Eastman and Roman W. Hines, the same year the company drilled the world's first relief well to control a blowout in Conroe, Texas, that had been on fire for more than a year. In 1957, Frank Christensen's Christensen Diamond Products opened a manufacturing plant in Celle, Germany. The facility built diamond core heads and drilling bits and soon began producing stabilizers, drilling jars and other equipment. In 1977, the Celle engineering and manufacturing team introduced the Navi-Drill line of downhole drilling motors, which has led the drilling industry in performance and reliability for three decades. Other innovations developed in Celle include the industry's first steerable motor system, and the AutoTrak Rotary Closed Loop System, a pioneering directional drilling tool. In 1978, Christensen Diamond Products was acquired by Norton Co. and changed its name to Norton Christensen. In 1986, Eastman Whipstock merged with Norton Christensen to form Eastman Christensen. In 1990, Baker Hughes acquired Eastman Christensen from Norton Abrasives for $550 million. To receive approval from the United States Department of Justice, the company sold its Hughes Tool diamond bit business. Baker Hughes combined Eastman Christensen and the remainder of Hughes Tools to form Hughes Christensen. In 1993, Hughes Christensen introduced the AR-Series PDC bits, anti-whirl bits with increased penetration rates up to 100% in some applications and extended bit life as much as four-fold, compared to previous bit designs. By 1995, Hughes Christensen's Gold Series PDC line increased drilling efficiency by reducing the frictional forces that can accumulate in front of the cutting edge, reducing the energy required to remove the rock. In 1996, patented ChipMaster PDCs, known for their efficiency and durability, were built on the success of the Eggbeater product line. Hughes Christensen next introduced the Genesis HCM bits for steerable motors with patented EZSteer depth-of-cut control technology. This same technology was adapted to Genesis HCR bits for rotary steerable systems, such as the Baker Hughes AutoTrak rotary closed loop system. Genesis ZX PDCs followed with new Zenith cutters. Teleco Oilfield Services (1992) In April 1992, Baker Hughes acquired Teleco Oilfield Services, a provider of directional measurement-while-drilling technology, from Sonat for $200 million cash, preferred stock and royalty from future sales of Teleco's \"triple combo\" sensors. Teleco Oilfield Services was founded in 1972 and introduced the world's first MWD tool in 1978. Teleco had approximately 1,300 employees, including 430 in Meriden, Connecticut. In 1993, Baker Hughes INTEQ was formed by combining five of the company's oilfield divisions. Petrolite (1997) Petrolite was formed in 1930 from the merger of William Barnickel's Tret-O-Lite with Petroleum Rectifying Company of California (PETRECO). In 1997, Baker Hughes acquired Petrolite for $693 million in stock. At that time, Wm. S. Barnickel & Co. owned 47% of Petrolite. In 2003, the division acquired Cornerstone Pipeline Inspection Group. Drilex (1997) In 1997, the company acquired Drilex, a provider of drilling products and services, for $109 million in stock. Western Rock Bit Company (1998) In 1998, the company acquired Western Rock Bit Company, a Canadian bit distributor, for $30.8 million. Western Atlas (1998) Western Atlas, which specialized in finding oil by mapping geological formations with sound waves and using wires to manipulate tools and gauges in oil and natural-gas wells, was divested from Litton Industries in 1994. In 1995, Western Atlas acquired 50% of PetroAlliance Services Company, Ltd., which offered seismic, well-logging, and integrated project services in the Post-Soviet states. In May 1997, Western Atlas acquired Sungroup Energy Services, a Canadian well logging, production testing, and completion services provider. During the fourth quarter of 1997, Western Atlas acquired Geosignal, a seismic data processing company; Seismic Resources, a provider of nonexclusive seismic surveys; and ParaMagnetic Logging, a well-logging research company. In the fourth quarter of 1997, the company acquired Heartland Kingfisher, a Canadian well-logging company. On August 10, 1998, Baker Hughes acquired Western Atlas for $5.5 billion in stock plus the assumption of $700 million in debt. The acquisition was made in part to prevent an acquisition of Western Atlas by Halliburton. The acquisition added strong seismic-data operations as well as downhole wireline and testing services. Joint venture with Schlumberger (2000–2006) In 1999, the only new seismic technology that was being introduced was the 4-dimensional seismic survey monitoring. In 2000, during a downturn in the petroleum industry, the company merged its Western Geophysical division with Schlumberger's Geco (Geophysical Company of Norway) to form WesternGeco. In 2006, Baker Hughes sold its 30% share of WesternGeco to Schlumberger for $2.4 billion in cash. OCRE (2001) In 2001, Baker Hughes acquired OCRE (Scotland) Ltd. from Maritime Well Service, a division of Aker ASA. Nova Technology Corporation (2006) In February 2006, Baker Hughes acquired Nova Technology Corporation, a supplier of permanent monitoring, chemical injection systems, and multiline services for deepwater and subsea oil and gas well applications, for $70 million in cash and assumed debt. JOA Oil and Gas BV (2010) In October 2010, Baker Hughes acquired JOA Oil & Gas BV. JOA developed JewelSuite, a reservoir modelling software. BJ Services Company (2010–2017) In 1990, the company sold a 71% stake in BJ Services via an initial public offering. On April 28, 2010, Baker Hughes re-acquired BJ Services. In 2017, after the division suffered market share losses, the company sold a majority interest in BJ Services to private equity firms to obtain approval for the merger with GE Oil and Gas. Proposed acquisition by Halliburton (2016) In November 2014, the company agreed to a merger with Halliburton valued at $34.6 billion. If consummated, it would have been the largest merger in the history of the petroleum industry. The merger was approved by both companies' stockholders; however, on April 6, 2016, the United States Department of Justice sued to block the transaction due to concerns that the merger would affect competition and prices in the oilfield service industry. On May 1, 2016, the companies terminated the merger agreement due to the regulatory opposition. Merger with GE Oil and Gas (2017) In July 2017, the company merged with GE Oil and Gas. As part of the transaction, the company sold a 53.3% percent stake in the hydraulic fracturing and cementing business to CSL Capital Management and Goldman Sachs’ West Street Energy Partners for $325 million. General Electric announced plans to divest its stake by 2023; by year-end 2021, its remaining ownership was approximately 11.4%. Sale of Reciprocating Compression division (2019) In 2019, the company sold its Reciprocating Compression division to Arcline Investment Management, a private equity firm. Sale of chemical manufacturing facility to Sterling Auxiliaries (2020) In September 2020, Sterling Auxiliaries & Artek Surfin Chemicals acquired Baker Hughes' Sand Springs chemical manufacturing facility. Compact Carbon Capture (2020) In November 2020, Baker Hughes acquired Compact Carbon Capture, a company developing solvent-based carbon capture patents. Joint venture with Aramco (2020) In December 2020, Baker Hughes set up a joint venture with Aramco to create a non-metallic materials company called Novel Non-Metallic Solutions Manufacturing. Novel's facility is being developed at King Salman Energy Park. ARMS Reliability (2021) In 2021, Baker Hughes acquired ARMS Reliability, a company providing advisory services and software to several industries. SRI International (2021) In March 2021, Baker Hughes acquired a license for the use of mixed-salt process technology for flue gas carbon capture from SRI International. Joint venture with Akastor (2021) In March 2021, Baker Hughes announced the creation of a joint venture for drilling services with Akastor ASA's subsidiary, MHWirth AS. Altus Intervention (2022) in March 2022, Baker Hughes acquired Altus Intervention, an oilwell specialist company headquartered in Norway. Sale of operations in Russia (2022) In August 2022, after the 2022 Russian invasion of Ukraine, the company agreed to sell its operations in Russia to local management. Quest Integrity (2022) In November 2022, the company acquired Quest Integrity from Team, Inc. for $279 million. Chart Industries (2025) In July 2025, Baker Hughes announced they were acquiring Chart Industries for $13.6 billion"
}