{
  "ticker": "BLDR",
  "cik": "0001316835",
  "company_name": "Builders FirstSource",
  "corrected_name": "Builders FirstSource",
  "wiki_title_used": "Builders FirstSource",
  "exists": true,
  "raw_text": "Builders FirstSource, Inc. is a Fortune 500 company that is a manufacturer and supplier of building materials. The company is headquartered in Irving, Texas, and is the largest supplier of building products, prefabricated components and value-added services in the US. Builders FirstSource employs over 15,000 people throughout the USA.  They serve new residential construction, repair and remodeling professionals. The company was incorporated in March 1998. The company has about 550 locations in 40 US states.\nIn 2015, Builders FirstSource acquired ProBuild.  This acquisition resulted in a combined entity with $6.1 billion in combined 2014 revenue. In 2018, the revenue of the combined company was $7.7 Billion.\nIn December 2019, Builders FirstSource acquired Raney Components, LLC and Raney Construction, Inc, located in Groveland, Florida.\nIn January 2020, Builders FirstSource acquired Bianchi & Company, Inc, a millwork supplier and install company located in Charlotte, North Carolina. In September 2020, Builders FirstSource announced a merger with BMC Stock Holdings, in which the newly merged company would operate under the Builders FirstSource branding.\nIn January 2021, the company announced that former BMC president and CEO Dave Flitman was named president. Flitman was later named CEO of the company in April 2021 after a 90-day transition.\nBuilders FirstSource announced authorization of a new $1 billion stock repurchase plan on February 18, 2022. This announcement comes on the heels of the completion of $2 Billion stock repurchase programs initiated in 2021.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Builders FirstSource, Inc.:",
  "clean_text": "Builders FirstSource, Inc. is a Fortune 500 company that is a manufacturer and supplier of building materials. The company is headquartered in Irving, Texas, and is the largest supplier of building products, prefabricated components and value-added services in the US. Builders FirstSource employs over 15,000 people throughout the USA. They serve new residential construction, repair and remodeling professionals. The company was incorporated in March 1998. The company has about 550 locations in 40 US states. In 2015, Builders FirstSource acquired ProBuild. This acquisition resulted in a combined entity with $6.1 billion in combined 2014 revenue. In 2018, the revenue of the combined company was $7.7 Billion. In December 2019, Builders FirstSource acquired Raney Components, LLC and Raney Construction, Inc, located in Groveland, Florida. In January 2020, Builders FirstSource acquired Bianchi & Company, Inc, a millwork supplier and install company located in Charlotte, North Carolina. In September 2020, Builders FirstSource announced a merger with BMC Stock Holdings, in which the newly merged company would operate under the Builders FirstSource branding. In January 2021, the company announced that former BMC president and CEO Dave Flitman was named president. Flitman was later named CEO of the company in April 2021 after a 90-day transition. Builders FirstSource announced authorization of a new $1 billion stock repurchase plan on February 18, 2022. This announcement comes on the heels of the completion of $2 Billion stock repurchase programs initiated in 2021."
}