{
  "ticker": "BR",
  "cik": "0001383312",
  "company_name": "Broadridge Financial Solutions",
  "corrected_name": "Broadridge Financial Solutions",
  "wiki_title_used": "Broadridge Financial Solutions",
  "exists": true,
  "raw_text": "Broadridge Financial Solutions, Inc. is a public corporate services  and financial technology company. Headquartered in Lake Success, New York, the company was founded in 2007 as a spin-off from Automatic Data Processing. Broadridge supplies companies in the financial industry with financial documents such as proxy statements and annual reports, as well as shareholder communications solutions such as virtual annual meetings.\nOther products and services include financial software and infrastructure for corporate governance, proxy and regulatory communications, and investor communications. It also hosts trading platforms and provides software and infrastructure for asset and wealth management.\n\nHistory\n1962-2006\nBroadridge was founded in 1962 as ADP Brokerage Services Group, a business unit of the American payroll processing company Automatic Data Processing (ADP). Operating as ADP's shareholder communications division,  it initially served one client by processing an average of 300 trades per night.\n1970s legislation in the United States changed the industry by mandating two new processes for securities and their transfer: immobilization and dematerialization. These processes required physical stock certificates and other paper securities to be kept in bulk by intermediaries, with the sale and ownership of securities recorded through chains of transaction records instead of possession of paper certificates. These changes increased securities trading and led to a rapid rise in stock ownership, and also had the effect of putting intermediaries between companies and their shareholders. Before the new laws, banks and brokers had typically maintained in-house proxy departments to manage the shareholder voting process. The need for shareholders to vote by proxy through intermediaries, however, created a new industry to manage that voting process,  which remained in place even after electronic certificates eliminated the need for intermediaries. ADP Brokerage Services Group operated as one of those intermediaries, and by the mid-1990s, Automatic Data Processing dominated the proxy voting and shareholder communications services industry.\n\n2007-2018\nAt the end of March, 2007, ADP spun-out the entirety of their shareholder communications activities, resulting in the formation of Broadridge Financial Solutions. Operating as an independent public company, Broadridge was headquartered in Lake Success, New York with Rich Daly serving as CEO. Broadridge facilitated its first virtual annual meeting, for Intel Corp, in 2009. In 2010, the company processed about 350 billion shares for its clients. Congress evaluated aspects of corporate governance, including shareholder communications and proxy voting, during the 2008 financial crisis. In 2010 a report submitted to the House Committee on Financial Services by a coalition headed by Business Roundtable noted the near monopoly position of Broadridge in handling proxy voting. Broadridge had retained its predominant position in the proxy processing market by 2013.\nIn 2016, it facilitated virtual annual meetings for 154 companies, an increase of 71% from the year prior. Also in 2016, Broadridge acquired Spence Johnson, an institutional financial flow data intelligence firm. In the summer of 2016, Broadridge acquired the North America Customer Communications (NACC) unit of DST Systems, a Kansas City-based business services provider, which provided the company with addressing information for about 75% of all public company shareholders in the United States and Canada.  Later in 2016, Broadridge bought M&O Systems, a small Manhattan-based financial services company. In 2017, the company had 10,000 employees.  In a 2018 letter to the SEC, Broadridge stated its mailings reached 140 million investor accounts. In 2018, UBS Group AG's Wealth Management Americas unit became the first large client to begin using Broadridge's new software platform for \"front- and back-office tasks, like opening client accounts, trade routing and order management and asset servicing.\"\n\n2019-2024\nOn January 2, 2019, Tim Gokey succeeded Rich Daly as chief executive officer.  Daly became Executive Chairman of the Board. In November 2019, Broadridge acquired ClearStructure Financial Technology, which provided portfolio management solutions for the private debt markets. Broadridge acquired FundsLibrary, which specializes in fund document and data dissemination in Europe, in March 2020. It was combined with the Broadridge brand FundAssist and renamed Broadridge Fund Communication Solutions. In 2021, it had assets of US$8.119 billion, equity of $1.809 billion, net income of $547 million, operating income of $678 million, and revenue of $4.993 billion.\nThe company agreed in 2021 to acquire the Sweden-based Itiviti from Nordic Capital for $2.5 billion. In 2021, Broadridge announced that RBC Wealth Management-U.S. would be its second client utilizing its new advisor technology platform for wealth management. In September 2022, Cetera became the first company to use Broadridge's Wealth InFocus communications platform, which focused on communications related to wealth management.\nAfter Broadridge began testing the use of blockchain for proxy voting in 2018, by 2023, companies such as UBS and Société Générale were using Broadridge's VMWare Blockchain distributed ledger software to facilitate repurchase agreements. In 2023 Broadridge stated it had around 1,100 clients who were brokers, and that it provided proxy services for around 80% of outstanding shares in the United States. In June 2023, LTX, a corporate bond trading platform owned by Broadridge, launched BondGPT, a chatbot focused on bonds and utilizing OpenAI's GPT-4. In 2024, Broadridge ranked #3 on the IDC Fintech Rankings. Broadridge released its Sentry software, a loan portfolio management platform, in 2024, at which point specific offerings included “new mutual funds, ETFs, managed accounts, app-based trading, and zero-commission trading.\" It had also enabled “pass-through voting,” allowing shareholders to do proxy votes directly rather than through an investment manager, and a mobile app for proxy voting at annual meetings.\n\nList of acquisitions\nAccording to analysts at Evercore ISI, “Broadridge has a long history of successful tuck-in acquisitions,\" and between 2007 and 2018, the company made over 30 acquisitions in total. Among the largest were:\n\n2016 - The company acquired Spence Johnson, an institutional financial flow data intelligence firm.\n2016 - Broadridge acquired the North America Customer Communications (NACC) unit of DST Systems, a business services provider.\n2016 - Broadridge bought M&O Systems, a financial services company.\n2019 - Broadridge acquired ClearStructure Financial Technology, which provides portfolio management solutions.\n2020 - Broadridge acquired FundsLibrary, which specializes in fund document and data dissemination.\n2021 - Broadridge acquired Itiviti, a capital markets trading technology provider.\n\nPersonnel\nThe company has 14,000 employees as of 2024. In 2024, the CEO was Tim Gokey while Chris Perry served as president. The eleven-member board includes chairman Richard J. Daly, Leslie Brun, Annette Nazareth, Pamela Carter, Robert Deulks, Melvin Flowers, Tim Gokey, Brett Keller, Maura Markus, Eileen Murray, and Amit Zavery.\n\nSee also\nList of S&P 500 companies\nList of S&P 400 companies\nRussell 1000 Index\nList of the largest software companies\n\nReferences\nFurther reading\nKaul, Asha (2012). \"Chapter 2. Ardhanareshwar: Unison of Ultimate Reality\". In Kaul, Asha; Singh, Manjari (eds.). New Paradigms of Gender Inclusivity. New Delhi: PHI Learning. ISBN 9788120345133. OCLC 896478066 – via Google Books. Broadridge India, formerly a brokerage services division of Automatic Data Processing (ADP) Inc., began operating as an independent public company in India in March 2007. (opening sentence of chapter abstract)\n\nExternal links\nOfficial website\nBusiness data for Broadridge Financial Solutions, Inc.:",
  "clean_text": "Broadridge Financial Solutions, Inc. is a public corporate services and financial technology company. Headquartered in Lake Success, New York, the company was founded in 2007 as a spin-off from Automatic Data Processing. Broadridge supplies companies in the financial industry with financial documents such as proxy statements and annual reports, as well as shareholder communications solutions such as virtual annual meetings. Other products and services include financial software and infrastructure for corporate governance, proxy and regulatory communications, and investor communications. It also hosts trading platforms and provides software and infrastructure for asset and wealth management. History 1962-2006 Broadridge was founded in 1962 as ADP Brokerage Services Group, a business unit of the American payroll processing company Automatic Data Processing (ADP). Operating as ADP's shareholder communications division, it initially served one client by processing an average of 300 trades per night. 1970s legislation in the United States changed the industry by mandating two new processes for securities and their transfer: immobilization and dematerialization. These processes required physical stock certificates and other paper securities to be kept in bulk by intermediaries, with the sale and ownership of securities recorded through chains of transaction records instead of possession of paper certificates. These changes increased securities trading and led to a rapid rise in stock ownership, and also had the effect of putting intermediaries between companies and their shareholders. Before the new laws, banks and brokers had typically maintained in-house proxy departments to manage the shareholder voting process. The need for shareholders to vote by proxy through intermediaries, however, created a new industry to manage that voting process, which remained in place even after electronic certificates eliminated the need for intermediaries. ADP Brokerage Services Group operated as one of those intermediaries, and by the mid-1990s, Automatic Data Processing dominated the proxy voting and shareholder communications services industry. 2007-2018 At the end of March, 2007, ADP spun-out the entirety of their shareholder communications activities, resulting in the formation of Broadridge Financial Solutions. Operating as an independent public company, Broadridge was headquartered in Lake Success, New York with Rich Daly serving as CEO. Broadridge facilitated its first virtual annual meeting, for Intel Corp, in 2009. In 2010, the company processed about 350 billion shares for its clients. Congress evaluated aspects of corporate governance, including shareholder communications and proxy voting, during the 2008 financial crisis. In 2010 a report submitted to the House Committee on Financial Services by a coalition headed by Business Roundtable noted the near monopoly position of Broadridge in handling proxy voting. Broadridge had retained its predominant position in the proxy processing market by 2013. In 2016, it facilitated virtual annual meetings for 154 companies, an increase of 71% from the year prior. Also in 2016, Broadridge acquired Spence Johnson, an institutional financial flow data intelligence firm. In the summer of 2016, Broadridge acquired the North America Customer Communications (NACC) unit of DST Systems, a Kansas City-based business services provider, which provided the company with addressing information for about 75% of all public company shareholders in the United States and Canada. Later in 2016, Broadridge bought M&O Systems, a small Manhattan-based financial services company. In 2017, the company had 10,000 employees. In a 2018 letter to the SEC, Broadridge stated its mailings reached 140 million investor accounts. In 2018, UBS Group AG's Wealth Management Americas unit became the first large client to begin using Broadridge's new software platform for \"front- and back-office tasks, like opening client accounts, trade routing and order management and asset servicing.\" 2019-2024 On January 2, 2019, Tim Gokey succeeded Rich Daly as chief executive officer. Daly became Executive Chairman of the Board. In November 2019, Broadridge acquired ClearStructure Financial Technology, which provided portfolio management solutions for the private debt markets. Broadridge acquired FundsLibrary, which specializes in fund document and data dissemination in Europe, in March 2020. It was combined with the Broadridge brand FundAssist and renamed Broadridge Fund Communication Solutions. In 2021, it had assets of US$8.119 billion, equity of $1.809 billion, net income of $547 million, operating income of $678 million, and revenue of $4.993 billion. The company agreed in 2021 to acquire the Sweden-based Itiviti from Nordic Capital for $2.5 billion. In 2021, Broadridge announced that RBC Wealth Management-U.S. would be its second client utilizing its new advisor technology platform for wealth management. In September 2022, Cetera became the first company to use Broadridge's Wealth InFocus communications platform, which focused on communications related to wealth management. After Broadridge began testing the use of blockchain for proxy voting in 2018, by 2023, companies such as UBS and Société Générale were using Broadridge's VMWare Blockchain distributed ledger software to facilitate repurchase agreements. In 2023 Broadridge stated it had around 1,100 clients who were brokers, and that it provided proxy services for around 80% of outstanding shares in the United States. In June 2023, LTX, a corporate bond trading platform owned by Broadridge, launched BondGPT, a chatbot focused on bonds and utilizing OpenAI's GPT-4. In 2024, Broadridge ranked #3 on the IDC Fintech Rankings. Broadridge released its Sentry software, a loan portfolio management platform, in 2024, at which point specific offerings included “new mutual funds, ETFs, managed accounts, app-based trading, and zero-commission trading.\" It had also enabled “pass-through voting,” allowing shareholders to do proxy votes directly rather than through an investment manager, and a mobile app for proxy voting at annual meetings. List of acquisitions According to analysts at Evercore ISI, “Broadridge has a long history of successful tuck-in acquisitions,\" and between 2007 and 2018, the company made over 30 acquisitions in total. Among the largest were: 2016 - The company acquired Spence Johnson, an institutional financial flow data intelligence firm. 2016 - Broadridge acquired the North America Customer Communications (NACC) unit of DST Systems, a business services provider. 2016 - Broadridge bought M&O Systems, a financial services company. 2019 - Broadridge acquired ClearStructure Financial Technology, which provides portfolio management solutions. 2020 - Broadridge acquired FundsLibrary, which specializes in fund document and data dissemination. 2021 - Broadridge acquired Itiviti, a capital markets trading technology provider. Personnel The company has 14,000 employees as of 2024. In 2024, the CEO was Tim Gokey while Chris Perry served as president. The eleven-member board includes chairman Richard J. Daly, Leslie Brun, Annette Nazareth, Pamela Carter, Robert Deulks, Melvin Flowers, Tim Gokey, Brett Keller, Maura Markus, Eileen Murray, and Amit Zavery."
}