{
  "ticker": "BRO",
  "cik": "0000079282",
  "company_name": "Brown & Brown",
  "corrected_name": "Brown & Brown",
  "wiki_title_used": "Brown & Brown",
  "exists": true,
  "raw_text": "Brown & Brown, Inc. is an American insurance brokerage firm headquartered in Daytona Beach, Florida. It is one of the largest independent insurance intermediaries in the United States, providing risk management solutions, insurance products, and services to businesses, governmental institutions, professional organizations, trade associations, and individuals.\nAs of 2023, Brown & Brown is ranked among the top 10 largest insurance brokerages globally by revenue.\nThe company emphasizes a culture of integrity, innovation, superior capabilities and discipline.\n\nHistory\nBrown & Brown was founded in 1939 as a small insurance agency in Daytona Beach, Florida, by J. Adrian Brown, partnering with his cousin Charles \"Cov\" Owen. Originally named Brown & Owen, the firm quickly expanded its customer base in central Florida. J. Adrian's son, J. Hyatt Brown, joined the agency in 1959, bought the company and became CEO in 1961, and played a key role in its growth and modernization.\nIn 1980, Brown & Brown restructured to adopt a decentralized model, aiming to boost revenue and profit margins by giving more authority to local teams. This approach encouraged an entrepreneurial culture across the company.\nIn 1983, the firm changed its name to Brown & Brown, Inc. to reflect its focus on national expansion.\nIn 1993, the company merged with Poe & Associates. Also in 1993, the company went public, listing on the New York Stock Exchange under the ticker symbol BRO. The use of public stock for acquisitions enabled a deliberate expansion strategy focused on acquiring middle-market insurance brokers nationwide.\nJ. Hyatt Brown retired as CEO in 2009, but remains with the company as chairman. He was succeeded as CEO by his son J. Powell Brown. Subsequently, the company has pursued aggressive acquisition strategies and organic growth. It surpassed $1 billion in revenue in 2012.  It joined the S&P 500 index in 2021.\nIn 2021, new headquarters were completed at Daytona Beach, Florida, featuring an 11-story building on 13 acres facing the Halifax River.\n\nServices\nBrown & Brown operates through two major business segments:\n\nRetail: Offers property and casualty insurance and employee benefits products to commercial, public, and individual customers.\nArrowhead Intermediaries: A purpose-built platform with three distinct divisions, each serving the evolving needs of insurance carriers, brokers and customers worldwide:\nPrograms\nWholesale\nSpecialty divisions\nThe company serves customers in all 50 U.S. states and in select international markets.\n\nAcquisitions\nBrown & Brown has grown significantly through strategic acquisitions. Notable acquisitions include:\n\nHays Companies (2018) – A major employee benefits and risk management firm based in Minneapolis.\nCoverHound and CyberPolicy (2021) – Digital platforms offering small business and personal lines insurance.\nOrchid Underwriters and CrossCover Insurance Services (2023) – Expanding the company's E&S (excess and surplus) capabilities.\nGlobal Risk Partners (GRP) (2022) – A major U.K.-based insurance intermediary, marking significant expansion into the European market.\nO’Leary Insurances (2021) - An a comprehensive insurance broking service based in Ireland. The acquisition marked Brown & Brown’s strategic entry into the EU market.\nMcNamara Company (2024) - offering a range of insurance solutions for businesses, families, and individuals.\nAccession Risk Management Group, including Risk Strategies (2025) - a private American insurance brokerage and risk management advisor. This acquisition expands Brown & Brown’s presence in property & casualty, employee benefits, and middle-market broker services.\n\nRecognition\nGreat Place to Work certified.\nRanked No. 7 of the World’s 10 Largest Insurance Brokers.\n\nPublications\nGlobal Impact Report, published annually, and covers the ESG (Environmental, Social, Governance) priorities of the company, including covering teammates, communities, environment, and governance.\nAnnual reports\nNews releases and press announcements, including acquisitions, dividend announcements, earnings results, and strategic moves\n\nSee also\nList of United States insurance companies\nInsurance broker\nRisk management\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Brown & Brown, Inc.:",
  "clean_text": "Brown & Brown, Inc. is an American insurance brokerage firm headquartered in Daytona Beach, Florida. It is one of the largest independent insurance intermediaries in the United States, providing risk management solutions, insurance products, and services to businesses, governmental institutions, professional organizations, trade associations, and individuals. As of 2023, Brown & Brown is ranked among the top 10 largest insurance brokerages globally by revenue. The company emphasizes a culture of integrity, innovation, superior capabilities and discipline. History Brown & Brown was founded in 1939 as a small insurance agency in Daytona Beach, Florida, by J. Adrian Brown, partnering with his cousin Charles \"Cov\" Owen. Originally named Brown & Owen, the firm quickly expanded its customer base in central Florida. J. Adrian's son, J. Hyatt Brown, joined the agency in 1959, bought the company and became CEO in 1961, and played a key role in its growth and modernization. In 1980, Brown & Brown restructured to adopt a decentralized model, aiming to boost revenue and profit margins by giving more authority to local teams. This approach encouraged an entrepreneurial culture across the company. In 1983, the firm changed its name to Brown & Brown, Inc. to reflect its focus on national expansion. In 1993, the company merged with Poe & Associates. Also in 1993, the company went public, listing on the New York Stock Exchange under the ticker symbol BRO. The use of public stock for acquisitions enabled a deliberate expansion strategy focused on acquiring middle-market insurance brokers nationwide. J. Hyatt Brown retired as CEO in 2009, but remains with the company as chairman. He was succeeded as CEO by his son J. Powell Brown. Subsequently, the company has pursued aggressive acquisition strategies and organic growth. It surpassed $1 billion in revenue in 2012. It joined the S&P 500 index in 2021. In 2021, new headquarters were completed at Daytona Beach, Florida, featuring an 11-story building on 13 acres facing the Halifax River. Services Brown & Brown operates through two major business segments: Retail: Offers property and casualty insurance and employee benefits products to commercial, public, and individual customers. Arrowhead Intermediaries: A purpose-built platform with three distinct divisions, each serving the evolving needs of insurance carriers, brokers and customers worldwide: Programs Wholesale Specialty divisions The company serves customers in all 50 U.S. states and in select international markets. Acquisitions Brown & Brown has grown significantly through strategic acquisitions. Notable acquisitions include: Hays Companies (2018) – A major employee benefits and risk management firm based in Minneapolis. CoverHound and CyberPolicy (2021) – Digital platforms offering small business and personal lines insurance. Orchid Underwriters and CrossCover Insurance Services (2023) – Expanding the company's E&S (excess and surplus) capabilities. Global Risk Partners (GRP) (2022) – A major U.K.-based insurance intermediary, marking significant expansion into the European market. O’Leary Insurances (2021) - An a comprehensive insurance broking service based in Ireland. The acquisition marked Brown & Brown’s strategic entry into the EU market. McNamara Company (2024) - offering a range of insurance solutions for businesses, families, and individuals. Accession Risk Management Group, including Risk Strategies (2025) - a private American insurance brokerage and risk management advisor. This acquisition expands Brown & Brown’s presence in property & casualty, employee benefits, and middle-market broker services. Recognition Great Place to Work certified. Ranked No. 7 of the World’s 10 Largest Insurance Brokers. Publications Global Impact Report, published annually, and covers the ESG (Environmental, Social, Governance) priorities of the company, including covering teammates, communities, environment, and governance. Annual reports News releases and press announcements, including acquisitions, dividend announcements, earnings results, and strategic moves"
}