{
  "ticker": "BSX",
  "cik": "0000885725",
  "company_name": "Boston Scientific",
  "corrected_name": "Boston Scientific",
  "wiki_title_used": "Boston Scientific",
  "exists": true,
  "raw_text": "Boston Scientific Corporation (BSC) is an American biotechnology and biomedical engineering firm and multinational manufacturer of medical devices used in interventional medical specialties, including interventional radiology, interventional cardiology, peripheral interventions, neuromodulation, neurovascular intervention, electrophysiology, cardiac surgery, vascular surgery, endoscopy, oncology, urology and gynecology. \nThe company is known for the development of the Taxus Stent, a drug-eluting stent which is used to open clogged arteries. The company acquired Cameron Health in June 2012 and began to offer a minimally invasive implantable cardioverter-defibrillator (ICD) called the EMBLEM subcutaneous implantable defibrillator (S-ICD). \nOver the last 20 years, Boston Scientific has had some high-profile patent infringement cases. It has made extensive payouts, including $1.725 billion to Johnson & Johnson, $85 million to Nevro and $42 million to TissueGen. \nBSC is  headquartered in Marlborough, Massachusetts and incorporated in Delaware.\n\nHistory\nBoston Scientific was formed on June 29, 1979, in Watertown, Massachusetts, as a holding company for the medical products company Medi-Tech, Inc., and to position the company for growth in interventional medicine. Medi-Tech was the brainchild of Itzhak Bentov, a Czech-born émigré to Israel and then to the United States, who worked at the Arthur D. Little think tank in Cambridge, Massachusetts, and ran a contract research company from his rented house in Belmont, Massachusetts, a venture he founded in 1965 with a business friend, Dan Singer. \nIn 1967 Bentov was asked by Boston Beth Israel Hospital radiologists to design a steerable, remotely controlled catheter; a series of engineering designs, polymer improvements and prototypes led to the release of a new steerable angiography catheter in 1969. That year John Abele joined the small company with an option to buy. A year later he exercised his option with Cooper Labs as a business partner, and the operation was moved – out of Bentov's lab in the basement of the rectory of a Catholic church in Belmont – to Watertown. \nAfter a decade of steady growth, by chance Abele met Pete Nicholas in their neighborhood in Concord, Massachusetts. Their partnership hinged on Nicholas' goal to build business enterprises and Abele's predilection for the vision and potential in noninvasive surgical instrumentation; they gathered backers in the Boston banking community to buy out the Cooper Labs interest and form the new corporation.\nLess than a year later Kimray Medical Associates (later Mansfield Scientific, Inc.) was acquired, adding vena cava filters and cardiac output computers to the product line. By 1982 a renovated mill building in Watertown was transformed into a manufacturing plant. Acquisitions continued, with Endo-Tech (Microvasive, Inc.: gastrointestinal and pulmonary) in 1981 and then Van-Tec (urology) in 1988, and an international presence was expanded. Mansfield Scientific, Microvasive, and Medi-Tech merged into Boston Scientific December 31, 1988.\n\nInitial public offering (1992)\nOn May 19, 1992, Boston Scientific launched an initial public offering of 23.5 million shares, of which 18.8 million were offered in the U.S. and 4.7 million were offered outside the U.S. The initial offering amounted to 23% of Boston Scientific's outstanding stock. The opening price was $17 per share.\nGoldman, Sachs & Co. (lead) and PaineWebber Inc. were the underwriters and Abbott Laboratories held a 20% stake (23.5 million shares). The market capitalization was about $1.6 billion. The U.S. shares were listed on the New York Stock Exchange.\n\nPost–IPO\nFrom 1995 through 1997, Boston Scientific increased its technology R&D and product offerings following substantial acquisitions that included Cardiovascular Imaging Systems (intravascular ultrasound), SCIMED (cardiovascular), Vesica Medical (urology), Meadox (textile vascular prostheses), EP Technologies (cardiac ablation controllers), MinTec (abdominal aortic aneurysm grafts), Symbiosis Corporation (specialty medical product manufacture).\nOn November 3, 1998, Boston Scientific restated its financial results for 1997, as well as its quarterly results for the first three quarters of 1998, due to the occurrence of business irregularities in the operations of its Japanese subsidiary.\nIn 2001 Boston Scientific acquired Target Therapeutics (neurology) in a tax-free stock swap for about $1.1 billion, more than 10 times Target's total sales, in contrast to the usual multiple of 10 times earnings.\nThe Taxus Stent was approved in 2003 in Europe and other countries and, in the United States, by the FDA in March 2004. It was the second drug-eluting stent approved in the United States.\nIn April 2004 the company announced that it had exercised an exclusive option to acquire Precision Vascular Systems, Inc., as part of a series of agreements between Boston Scientific and Precision Vascular in 2002, for an undisclosed sum. In June Boston Scientific acquired Advanced Bionics Corporation for $740 million in cash, plus earn out payments. In December Boston Scientific completed its acquisition of Advanced Stent Technologies, Inc., for $120 million payable in Boston Scientific stock, plus the possibility of future contingent payments. AST had been developing stent and stent delivery systems specifically designed to address the anatomical needs of coronary artery disease in bifurcated vessels.\nIn April 2005, BSC exercised an exclusive option to acquire TriVascular, Inc., for an undisclosed sum and renamed it as Boston Scientific Santa Rosa Corporation, or BSSR. TriVascular was founded in January 1998 to develop less-invasive medical devices and procedures for treating abdominal aortic aneurysms, but BSC discontinued its endovascular aortic repair (EVAR) program in 2006. BSC also announced it had exercised its option to acquire CryoVascular Systems, Inc., and its proprietary angioplasty device to treat atherosclerotic disease of the legs and other peripheral arteries. In June Boston Scientific announced that its wholly owned subsidiary, Nemo I Acquisition, Inc., had successfully acquired Salt Lake City-based Rubicon Medical Corporation, with Rubicon became a wholly owned subsidiary of Boston Scientific.\nIn March 2008, BSC sold BSSR to TV2 Holding Company of Santa Rosa. Terms of the sale include $30 million in cash paid at the closing to BSC and a warrant allowing BSC to purchase a minority interest in TV2.\n\nGuidant merger\nIn January 2006, the company announced an offer for its longtime competitor, Guidant, for $72 per share or $25 billion. The offer, however, was rejected. On April 21, 2006, BSC acquired Guidant for $27.2 billion. Guidant was split between BSC and Abbott Laboratories. Four years later, in 2010, when moving its heart-rhythm business from its acquisition of Guidant, Boston Scientific eliminated 1300 jobs.\n\nPost-merger\nIn December 2007, Boston Scientific announced it would sell its Fluid Management and Venous Access businesses for $425 million to Avista Capital Partners.\nIn April 2008, the company acquired CryoCor, Inc., for $1.35 per share, $17.6 million in total. Navilyst Medical was formed in February 2008 from Boston Scientific's Fluid Management and Vascular Access business units.\nIn January 2009, Boston announced it would acquire Labcoat Limited, whose primary development was that of a development-stage drug-eluting stent – for an undisclosed sum.\nIn October 2010, the company was fined $600,000 by the US Department of Justice for paying a US Army doctor to use their devices and recommend them to others. In the same month Boston Scientific acquired Asthmatx, Inc., for $193.5 million, with payments of up to $250 million being paid on the achievement of specified revenue-based criteria through 2019.\nIn January 2011, Boston acquired Atritech, Inc., for $100 million plus additional potential payments of up to $275 million. Atritech developed a novel device called the Watchman® designed to close the left atrial appendage in patients with atrial fibrillation who are at risk for ischemic stroke. In the same month, Boston Scientific acquired Intelect Medical, Inc., for $78 million and the remaining 86% of Sadra Medical, Inc., not already owned for $193 million plus contingent payments. At the same time, the business divested its neurovascular business to Stryker Corporation for $1.5 billion.\nIn June 2012, Boston Scientific officially acquired Cameron Health for a total sum of $1.3 billion, paid out incrementally as various revenue milestones were achieved. In September the company announced it would acquire BridgePoint Medical, Inc., developer of a catheter-based system to treat coronary chronic total occlusions. In October, the company acquired Rhythmia Medical, Inc., developer of mapping and navigation methods for use in cardiac catheter ablations and other electrophysiology procedures. A month later the business acquired catheter-based renal denervation system developer, Vessix Vascular, Inc.\nIn November 2013, Boston announced it would acquire Bard EP, the electrophysiology business of C.R. Bard, Inc. for $275 million.\nIn May 2014, Boston acquired hysteroscopic intrauterine tissue removal specialist, IoGyn, Inc. In September, the business announced it would acquire the Interventional business of Bayer.\nIn March 2015, the company announced it would acquire Endo International Plc's American Medical Systems urology business for at least $1.6 billion, expanding the company's health and prostate treatments. In April, Boston announced its intention to acquire Xlumena, Inc. In October Boston announced it had invested further in percutaneous mitral valve replacement system developer, MValve Technologies, gaining a right to acquire the business in the future.\nAs of 2016, it operates in more than 100 countries, employs more than 24,000 people, and manufactures around 13,000 diverse products. In July 2016 the business acquired the manufacturer of radiofrequency ablation systems, Cosman Medical, Inc. In September, Boston announced it had acquired EndoChoice Holdings, Inc., becoming part of the Boston Scientific Endoscopy business for $8.00 per share or $210 million in total. In November the company acquired the gynecology and urology portfolio of Distal Access, LLC, a company that designs minimally invasive medical devices. In December 2016, the business acquired a 15% stake in Neovasc, Inc., for $75 million.\nIn 2016, Boston Scientific acquired EndoChoice, located in Alpharetta, Georgia.\nIn May 2017, the company acquired Symetis SA, a developer of minimally invasive transcatheter aortic valve implantation devices. In October, Boston acquired Apama Medical Inc. for up to $300 million.\nIn April 2018, Boston Scientific announced the triple closure of its acquisitions of women's health company, nVision Medical Corporation, NxThera and Securus Medical Group, Inc., for up to $50 million. In July, Boston Scientific announced it would acquire Cryterion Medical, Inc, Veniti, Inc., in August Augmenix, Inc., and Claret Medical, Inc.\nIn November Boston Scientific announced it would acquire UK medical device maker BTG plc for $4.2 billion. BTG, before being acquired, was publicly traded and a constituent of the FTSE 250 Index. In late December, the company announced it would acquire Millipede, Inc for $325 million, after previously investing $90 million in the company.\n\nIn May 2019, the company announced it would acquire Vertiflex, Inc., with the aim of increasing its interventional pain therapy offerings. Vertiflex principally developed treatment for lumbar spinal stenosis.\nIn January 2021, Boston announced it would acquire Minneapolis-based Preventice Solutions, Inc., and its portfolio of mobile cardiac health solutions for up to $1.2 billion. In March, the business announced it would acquire Lumenis Ltd. for $1 billion from an affiliate of Baring Private Equity Asia, who, in 2019, had acquired it from XIO Group. In June, the company announced it would acquire the 73% of Farapulse, Inc., it did not already own, for $295 million. Farapulse was a University of Iowa startup. The deal complimented Boston Scientific's existing electrophysiology portfolio. In September, the business announced it would acquire Devoro Medical, Inc., and its blood clot capturing technology. Boston Scientific had been a strategic investor in Devoro since 2019. In October, the company announced it would acquire Baylis Medical Company Inc. for $1.75 billion, expanding its electrophysiology and heart product portfolios (see Frank Baylis).\nIn June 2022, the business announced it would acquire M.I.Tech Co., Ltd., of South Korea, for around $230 million. The deal was cancelled in May 2023 citing regulatory hurdles. In August, Boston announced it would acquire Obsidio, Inc.\nIn June 2022, Boston Scientific announced that it would invest $62.5 million in a manufacturing and supply chain facility in Johns Creek, Georgia, a suburb of Atlanta. \nIn September 2023, Boston Scientific acquired Relievant Medsystems, Inc. for an upfront cash payment of $850 million and undisclosed additional contingent payments based on sales performance over the next three years.\nIn January 2024, the company announced it would acquire Axonics, Inc. for $3.7 billion.\n\nOrganizational culture\nBoston Scientific's goal to increase diversity among its employees — particularly among its managers, executives, and directors — has been chronicled by publications and organizations: \n\nForbes added the company in 2019 to its list of Best Employers For Diversity for its efforts to foster a corporate culture that welcomes and supports all employees. That year, BSC ranked 85th out of 500 companies. Forbes included BSC in its 2021 and 2022 lists as well – ranking it 6th in 2021 and 171st in 2022, out of 500 for both years.\nBloomberg recognized BSC for its inclusion in the Gender-Equality Index in 2019, which includes companies that publicly demonstrate their commitment to equality and the advancement of women in the workplace. The index lists a total of 230 companies from ten economic sectors and 36 countries and regions.\nThe U.S. magazine Working Mother, listed BSC for the first time in 2017, as one of the \"100 Best Companies for Working Mothers.\" The publication again listed BSC in 2018, 2019, and 2020.\nThe Human Rights Campaign (\"HRC\") named BSC as a Best Place to Work for LGBTQ Equality in its 2019 edition of the eponymous list. HRC has given BSC a ranking of 100 (of 100) every year from 2015 through 2021 in its annual CEI Index (Corporate Equality Index) rankings of Fortune 1000 companies.\nThe journal US Black Engineer & Information Technology (USBE & IT), in its \"2021 Top Supporters of HBCU Engineering,\" ranked BSC No. 6 among the \"Top 20 Industry Supporters.\"\n\nLitigation\nJohnson & Johnson patent litigation\nBeginning in 2003, Boston Scientific and Johnson & Johnson were involved in a series of litigations involving patents covering heart stent medical devices. Both parties claimed that the other had infringed upon their patents. The litigation was settled once Boston Scientific agreed to pay $716 million to Johnson & Johnson in September 2009 and an additional $1.73 billion in February 2010.\nIt was announced in November 2014 that Johnson & Johnson would have another chance for payback after a multibillion-dollar trial was set for November 20, 2014. A New York federal court judge would hear the case without a jury to decide whether Boston Scientific should be held liable for the contract breach.\n\nTransvaginal mesh\nBoston Scientific is one of several manufacturers of a medical device called transvaginal mesh, a type of surgical mesh used to treat pelvic organ prolapse. Experts concluded that the medical company had used cheap, counterfeit resin, which was both toxic and degraded when exposed to oxygen. When this was announced on 60 Minutes, Boston Scientific responded by saying the broadcast was \"irresponsible and misleading,\" citing a 2017 Food and Drug Administration (FDA) report stating that although they found variability in the polypropylene resin, \"these differences do not present new safety or effectiveness concerns.\" One woman, who sued in 2011, was awarded $100 million. Two operations had failed to remove all the parts of the mesh and she was still in pain. The company appealed the decision and had the amount reduced to $10M. In 2015, Boston Scientific announced it would pay $119 million to 2,970 lawsuit plaintiffs, who had been injured by the mesh. On March 23, 2021, the company agreed to pay $189 million to settle allegations that it had seriously misrepresented the risks related to the vaginal mesh. As of Jan. 27, 2021, around 54,000 lawsuits related to transvaginal meshes had been filed against Boston Scientific.\nIn April 2019, the FDA ordered Boston Scientific and Coloplast to remove all of their vaginal mesh products from the United States market. In 2020, Johnson & Johnson was required to pay $344 million for failing to disclose the serious product risks of its transvaginal mesh product.\n\nNIR stent\nIn 2005, Boston Scientific paid $74 million to settle allegations that it had continued to sell NIR stents (flexible stents) after learning that many of them were defective. Twenty-six injuries and one death may have been caused by malfunctioning stents.\n\nDefective defibrillators\nIn 2011, Guidant, a subsidiary of Boston Scientific, was criminally convicted of a failure to report defibrillator safety problems to the FDA. The company was forced to pay more than $296 million in criminal fines and had to submit to the supervision of the U.S. Probation Office for three years. \nEven though Guidant knew the devices were defective, they continued to sell the defibrillators anyway. Guidant LLC had also advised its sales representatives to tell physicians that nothing was wrong with the defibrillators, and told the FDA that the proposed corrections were not being done to correct life-threatening device flaws, but were rather to improve process throughout. Not until three deaths had occurred and ten months had passed did the company reveal the defects in 2005. The directives for these wrongdoings had been implemented prior to Boston Scientific's acquisition of Guidant in 2006.\nIn 2013, BSC and three of its subsidiaries – Guidant LLC, Guidant Sales LLC, and Cardiac Pacemakers, Inc. – agreed to pay $30 million to settle allegations that, according to the Justice Department, between 2002 and 2005, Guidant knowingly sold defective heart devices to health care facilities that in turn implanted the devices into Medicare patients.\n\nBribery allegations\nIn 2009, Boston Scientific agreed to pay $22 million to settle allegations that its subsidiary Guidant LLC had used kickback schemes to boost sales for its pacemakers (cardiac rhythm management or CRM devices) and defibrillators (implantable cardioverter-defibrillators or ICD devices). Allegedly, Guidant paid doctors between $1,000 and $1,500 each to participate in one of its four post-studies known as RaCE ($1,500), RaCE II ($1,000), RaCE III ($1,000), and MERITS ($1,000).\n\nObsidio Embolic recall\nIn April 2024, the FDA announced a recall of Boston Scientific's device Obsidio Embolic, which is used to stop hemorrhaging and excessive bleeding. It has been found that when the device is paired with the aliquot technique, it can lead to bowel ischemia, which can mean longer hospitalization or death for patients.\n\nNotable people\nDonald Steven Baim, MD (1946–2009), served Chief Medical and Scientific Officer for Boston Scientific from 2006 until his death in 2009.\nIan Meredith, MD, PhD, AM (born 1956), was Global Chief Medical Officer and Executive Vice President from 2017 to 2023.\nUrsula Burns (born 1958), who served as a Member of Boston Scientific's 13-seat Board of Directors since 2002, resigned after being named Chief Executive Officer of the Xerox Corporation, taking effect July 1, 2009, and becoming the first African-American female CEO of a Fortune 500 company.\nKristina M. Johnson (born 1957), PhD, who served as a Member of BSC's Board since May 2006, resigned in May 2009 after being confirmed by the U.S. Senate to serve as Under Secretary in the Department of Energy (see Under Secretary of Energy for Infrastructure & Under Secretary of Energy for Science and Innovation). Johnson was re-elected to BSC's board January 1, 2011, and served in that position until May 2017.\nYoshiaki Fujimori (born 1951), BSC Board Member since July 2016.\nJames Robert Tobin, Jr. (born 1944), President & CEO of BSC from 1999 through 2009.\nJohn Raymond Elliott \"Ray\" (born 1950), served as a Board Member from September 2007 to 2009, then, in July 2009, re-joined the Board and became President & CEO, a position he held until December 31, 2011. Before, he had served as Chairman of Zimmer Holdings, Inc., from August 6, 2001, to November 30, 2007, and President & CEO from March 20, 2001, to May 2007.\n\nHeadquarters and regional centers\nWorld headquarters: Marlborough, Massachusetts\nEurope headquarters: Voisins-le-Bretonneux, France\nAsia Pacific headquarters: Boston Scientific Asia Pacific Pte Ltd., Singapore\nU.S. Government Affairs office: Washington, D.C.\nLatin America headquarters: Weston, Florida\n\nNotes\nReferences\nExternal links\nOfficial website\nBusiness data for Boston Scientific:",
  "clean_text": "Boston Scientific Corporation (BSC) is an American biotechnology and biomedical engineering firm and multinational manufacturer of medical devices used in interventional medical specialties, including interventional radiology, interventional cardiology, peripheral interventions, neuromodulation, neurovascular intervention, electrophysiology, cardiac surgery, vascular surgery, endoscopy, oncology, urology and gynecology. The company is known for the development of the Taxus Stent, a drug-eluting stent which is used to open clogged arteries. The company acquired Cameron Health in June 2012 and began to offer a minimally invasive implantable cardioverter-defibrillator (ICD) called the EMBLEM subcutaneous implantable defibrillator (S-ICD). Over the last 20 years, Boston Scientific has had some high-profile patent infringement cases. It has made extensive payouts, including $1.725 billion to Johnson & Johnson, $85 million to Nevro and $42 million to TissueGen. BSC is headquartered in Marlborough, Massachusetts and incorporated in Delaware. History Boston Scientific was formed on June 29, 1979, in Watertown, Massachusetts, as a holding company for the medical products company Medi-Tech, Inc., and to position the company for growth in interventional medicine. Medi-Tech was the brainchild of Itzhak Bentov, a Czech-born émigré to Israel and then to the United States, who worked at the Arthur D. Little think tank in Cambridge, Massachusetts, and ran a contract research company from his rented house in Belmont, Massachusetts, a venture he founded in 1965 with a business friend, Dan Singer. In 1967 Bentov was asked by Boston Beth Israel Hospital radiologists to design a steerable, remotely controlled catheter; a series of engineering designs, polymer improvements and prototypes led to the release of a new steerable angiography catheter in 1969. That year John Abele joined the small company with an option to buy. A year later he exercised his option with Cooper Labs as a business partner, and the operation was moved – out of Bentov's lab in the basement of the rectory of a Catholic church in Belmont – to Watertown. After a decade of steady growth, by chance Abele met Pete Nicholas in their neighborhood in Concord, Massachusetts. Their partnership hinged on Nicholas' goal to build business enterprises and Abele's predilection for the vision and potential in noninvasive surgical instrumentation; they gathered backers in the Boston banking community to buy out the Cooper Labs interest and form the new corporation. Less than a year later Kimray Medical Associates (later Mansfield Scientific, Inc.) was acquired, adding vena cava filters and cardiac output computers to the product line. By 1982 a renovated mill building in Watertown was transformed into a manufacturing plant. Acquisitions continued, with Endo-Tech (Microvasive, Inc.: gastrointestinal and pulmonary) in 1981 and then Van-Tec (urology) in 1988, and an international presence was expanded. Mansfield Scientific, Microvasive, and Medi-Tech merged into Boston Scientific December 31, 1988. Initial public offering (1992) On May 19, 1992, Boston Scientific launched an initial public offering of 23.5 million shares, of which 18.8 million were offered in the U.S. and 4.7 million were offered outside the U.S. The initial offering amounted to 23% of Boston Scientific's outstanding stock. The opening price was $17 per share. Goldman, Sachs & Co. (lead) and PaineWebber Inc. were the underwriters and Abbott Laboratories held a 20% stake (23.5 million shares). The market capitalization was about $1.6 billion. The U.S. shares were listed on the New York Stock Exchange. Post–IPO From 1995 through 1997, Boston Scientific increased its technology R&D and product offerings following substantial acquisitions that included Cardiovascular Imaging Systems (intravascular ultrasound), SCIMED (cardiovascular), Vesica Medical (urology), Meadox (textile vascular prostheses), EP Technologies (cardiac ablation controllers), MinTec (abdominal aortic aneurysm grafts), Symbiosis Corporation (specialty medical product manufacture). On November 3, 1998, Boston Scientific restated its financial results for 1997, as well as its quarterly results for the first three quarters of 1998, due to the occurrence of business irregularities in the operations of its Japanese subsidiary. In 2001 Boston Scientific acquired Target Therapeutics (neurology) in a tax-free stock swap for about $1.1 billion, more than 10 times Target's total sales, in contrast to the usual multiple of 10 times earnings. The Taxus Stent was approved in 2003 in Europe and other countries and, in the United States, by the FDA in March 2004. It was the second drug-eluting stent approved in the United States. In April 2004 the company announced that it had exercised an exclusive option to acquire Precision Vascular Systems, Inc., as part of a series of agreements between Boston Scientific and Precision Vascular in 2002, for an undisclosed sum. In June Boston Scientific acquired Advanced Bionics Corporation for $740 million in cash, plus earn out payments. In December Boston Scientific completed its acquisition of Advanced Stent Technologies, Inc., for $120 million payable in Boston Scientific stock, plus the possibility of future contingent payments. AST had been developing stent and stent delivery systems specifically designed to address the anatomical needs of coronary artery disease in bifurcated vessels. In April 2005, BSC exercised an exclusive option to acquire TriVascular, Inc., for an undisclosed sum and renamed it as Boston Scientific Santa Rosa Corporation, or BSSR. TriVascular was founded in January 1998 to develop less-invasive medical devices and procedures for treating abdominal aortic aneurysms, but BSC discontinued its endovascular aortic repair (EVAR) program in 2006. BSC also announced it had exercised its option to acquire CryoVascular Systems, Inc., and its proprietary angioplasty device to treat atherosclerotic disease of the legs and other peripheral arteries. In June Boston Scientific announced that its wholly owned subsidiary, Nemo I Acquisition, Inc., had successfully acquired Salt Lake City-based Rubicon Medical Corporation, with Rubicon became a wholly owned subsidiary of Boston Scientific. In March 2008, BSC sold BSSR to TV2 Holding Company of Santa Rosa. Terms of the sale include $30 million in cash paid at the closing to BSC and a warrant allowing BSC to purchase a minority interest in TV2. Guidant merger In January 2006, the company announced an offer for its longtime competitor, Guidant, for $72 per share or $25 billion. The offer, however, was rejected. On April 21, 2006, BSC acquired Guidant for $27.2 billion. Guidant was split between BSC and Abbott Laboratories. Four years later, in 2010, when moving its heart-rhythm business from its acquisition of Guidant, Boston Scientific eliminated 1300 jobs. Post-merger In December 2007, Boston Scientific announced it would sell its Fluid Management and Venous Access businesses for $425 million to Avista Capital Partners. In April 2008, the company acquired CryoCor, Inc., for $1.35 per share, $17.6 million in total. Navilyst Medical was formed in February 2008 from Boston Scientific's Fluid Management and Vascular Access business units. In January 2009, Boston announced it would acquire Labcoat Limited, whose primary development was that of a development-stage drug-eluting stent – for an undisclosed sum. In October 2010, the company was fined $600,000 by the US Department of Justice for paying a US Army doctor to use their devices and recommend them to others. In the same month Boston Scientific acquired Asthmatx, Inc., for $193.5 million, with payments of up to $250 million being paid on the achievement of specified revenue-based criteria through 2019. In January 2011, Boston acquired Atritech, Inc., for $100 million plus additional potential payments of up to $275 million. Atritech developed a novel device called the Watchman® designed to close the left atrial appendage in patients with atrial fibrillation who are at risk for ischemic stroke. In the same month, Boston Scientific acquired Intelect Medical, Inc., for $78 million and the remaining 86% of Sadra Medical, Inc., not already owned for $193 million plus contingent payments. At the same time, the business divested its neurovascular business to Stryker Corporation for $1.5 billion. In June 2012, Boston Scientific officially acquired Cameron Health for a total sum of $1.3 billion, paid out incrementally as various revenue milestones were achieved. In September the company announced it would acquire BridgePoint Medical, Inc., developer of a catheter-based system to treat coronary chronic total occlusions. In October, the company acquired Rhythmia Medical, Inc., developer of mapping and navigation methods for use in cardiac catheter ablations and other electrophysiology procedures. A month later the business acquired catheter-based renal denervation system developer, Vessix Vascular, Inc. In November 2013, Boston announced it would acquire Bard EP, the electrophysiology business of C.R. Bard, Inc. for $275 million. In May 2014, Boston acquired hysteroscopic intrauterine tissue removal specialist, IoGyn, Inc. In September, the business announced it would acquire the Interventional business of Bayer. In March 2015, the company announced it would acquire Endo International Plc's American Medical Systems urology business for at least $1.6 billion, expanding the company's health and prostate treatments. In April, Boston announced its intention to acquire Xlumena, Inc. In October Boston announced it had invested further in percutaneous mitral valve replacement system developer, MValve Technologies, gaining a right to acquire the business in the future. As of 2016, it operates in more than 100 countries, employs more than 24,000 people, and manufactures around 13,000 diverse products. In July 2016 the business acquired the manufacturer of radiofrequency ablation systems, Cosman Medical, Inc. In September, Boston announced it had acquired EndoChoice Holdings, Inc., becoming part of the Boston Scientific Endoscopy business for $8.00 per share or $210 million in total. In November the company acquired the gynecology and urology portfolio of Distal Access, LLC, a company that designs minimally invasive medical devices. In December 2016, the business acquired a 15% stake in Neovasc, Inc., for $75 million. In 2016, Boston Scientific acquired EndoChoice, located in Alpharetta, Georgia. In May 2017, the company acquired Symetis SA, a developer of minimally invasive transcatheter aortic valve implantation devices. In October, Boston acquired Apama Medical Inc. for up to $300 million. In April 2018, Boston Scientific announced the triple closure of its acquisitions of women's health company, nVision Medical Corporation, NxThera and Securus Medical Group, Inc., for up to $50 million. In July, Boston Scientific announced it would acquire Cryterion Medical, Inc, Veniti, Inc., in August Augmenix, Inc., and Claret Medical, Inc. In November Boston Scientific announced it would acquire UK medical device maker BTG plc for $4.2 billion. BTG, before being acquired, was publicly traded and a constituent of the FTSE 250 Index. In late December, the company announced it would acquire Millipede, Inc for $325 million, after previously investing $90 million in the company. In May 2019, the company announced it would acquire Vertiflex, Inc., with the aim of increasing its interventional pain therapy offerings. Vertiflex principally developed treatment for lumbar spinal stenosis. In January 2021, Boston announced it would acquire Minneapolis-based Preventice Solutions, Inc., and its portfolio of mobile cardiac health solutions for up to $1.2 billion. In March, the business announced it would acquire Lumenis Ltd. for $1 billion from an affiliate of Baring Private Equity Asia, who, in 2019, had acquired it from XIO Group. In June, the company announced it would acquire the 73% of Farapulse, Inc., it did not already own, for $295 million. Farapulse was a University of Iowa startup. The deal complimented Boston Scientific's existing electrophysiology portfolio. In September, the business announced it would acquire Devoro Medical, Inc., and its blood clot capturing technology. Boston Scientific had been a strategic investor in Devoro since 2019. In October, the company announced it would acquire Baylis Medical Company Inc. for $1.75 billion, expanding its electrophysiology and heart product portfolios (see Frank Baylis). In June 2022, the business announced it would acquire M.I.Tech Co., Ltd., of South Korea, for around $230 million. The deal was cancelled in May 2023 citing regulatory hurdles. In August, Boston announced it would acquire Obsidio, Inc. In June 2022, Boston Scientific announced that it would invest $62.5 million in a manufacturing and supply chain facility in Johns Creek, Georgia, a suburb of Atlanta. In September 2023, Boston Scientific acquired Relievant Medsystems, Inc. for an upfront cash payment of $850 million and undisclosed additional contingent payments based on sales performance over the next three years. In January 2024, the company announced it would acquire Axonics, Inc. for $3.7 billion. Organizational culture Boston Scientific's goal to increase diversity among its employees — particularly among its managers, executives, and directors — has been chronicled by publications and organizations: Forbes added the company in 2019 to its list of Best Employers For Diversity for its efforts to foster a corporate culture that welcomes and supports all employees. That year, BSC ranked 85th out of 500 companies. Forbes included BSC in its 2021 and 2022 lists as well – ranking it 6th in 2021 and 171st in 2022, out of 500 for both years. Bloomberg recognized BSC for its inclusion in the Gender-Equality Index in 2019, which includes companies that publicly demonstrate their commitment to equality and the advancement of women in the workplace. The index lists a total of 230 companies from ten economic sectors and 36 countries and regions. The U.S. magazine Working Mother, listed BSC for the first time in 2017, as one of the \"100 Best Companies for Working Mothers.\" The publication again listed BSC in 2018, 2019, and 2020. The Human Rights Campaign (\"HRC\") named BSC as a Best Place to Work for LGBTQ Equality in its 2019 edition of the eponymous list. HRC has given BSC a ranking of 100 (of 100) every year from 2015 through 2021 in its annual CEI Index (Corporate Equality Index) rankings of Fortune 1000 companies. The journal US Black Engineer & Information Technology (USBE & IT), in its \"2021 Top Supporters of HBCU Engineering,\" ranked BSC No. 6 among the \"Top 20 Industry Supporters.\" Litigation Johnson & Johnson patent litigation Beginning in 2003, Boston Scientific and Johnson & Johnson were involved in a series of litigations involving patents covering heart stent medical devices. Both parties claimed that the other had infringed upon their patents. The litigation was settled once Boston Scientific agreed to pay $716 million to Johnson & Johnson in September 2009 and an additional $1.73 billion in February 2010. It was announced in November 2014 that Johnson & Johnson would have another chance for payback after a multibillion-dollar trial was set for November 20, 2014. A New York federal court judge would hear the case without a jury to decide whether Boston Scientific should be held liable for the contract breach. Transvaginal mesh Boston Scientific is one of several manufacturers of a medical device called transvaginal mesh, a type of surgical mesh used to treat pelvic organ prolapse. Experts concluded that the medical company had used cheap, counterfeit resin, which was both toxic and degraded when exposed to oxygen. When this was announced on 60 Minutes, Boston Scientific responded by saying the broadcast was \"irresponsible and misleading,\" citing a 2017 Food and Drug Administration (FDA) report stating that although they found variability in the polypropylene resin, \"these differences do not present new safety or effectiveness concerns.\" One woman, who sued in 2011, was awarded $100 million. Two operations had failed to remove all the parts of the mesh and she was still in pain. The company appealed the decision and had the amount reduced to $10M. In 2015, Boston Scientific announced it would pay $119 million to 2,970 lawsuit plaintiffs, who had been injured by the mesh. On March 23, 2021, the company agreed to pay $189 million to settle allegations that it had seriously misrepresented the risks related to the vaginal mesh. As of Jan. 27, 2021, around 54,000 lawsuits related to transvaginal meshes had been filed against Boston Scientific. In April 2019, the FDA ordered Boston Scientific and Coloplast to remove all of their vaginal mesh products from the United States market. In 2020, Johnson & Johnson was required to pay $344 million for failing to disclose the serious product risks of its transvaginal mesh product. NIR stent In 2005, Boston Scientific paid $74 million to settle allegations that it had continued to sell NIR stents (flexible stents) after learning that many of them were defective. Twenty-six injuries and one death may have been caused by malfunctioning stents. Defective defibrillators In 2011, Guidant, a subsidiary of Boston Scientific, was criminally convicted of a failure to report defibrillator safety problems to the FDA. The company was forced to pay more than $296 million in criminal fines and had to submit to the supervision of the U.S. Probation Office for three years. Even though Guidant knew the devices were defective, they continued to sell the defibrillators anyway. Guidant LLC had also advised its sales representatives to tell physicians that nothing was wrong with the defibrillators, and told the FDA that the proposed corrections were not being done to correct life-threatening device flaws, but were rather to improve process throughout. Not until three deaths had occurred and ten months had passed did the company reveal the defects in 2005. The directives for these wrongdoings had been implemented prior to Boston Scientific's acquisition of Guidant in 2006. In 2013, BSC and three of its subsidiaries – Guidant LLC, Guidant Sales LLC, and Cardiac Pacemakers, Inc. – agreed to pay $30 million to settle allegations that, according to the Justice Department, between 2002 and 2005, Guidant knowingly sold defective heart devices to health care facilities that in turn implanted the devices into Medicare patients. Bribery allegations In 2009, Boston Scientific agreed to pay $22 million to settle allegations that its subsidiary Guidant LLC had used kickback schemes to boost sales for its pacemakers (cardiac rhythm management or CRM devices) and defibrillators (implantable cardioverter-defibrillators or ICD devices). Allegedly, Guidant paid doctors between $1,000 and $1,500 each to participate in one of its four post-studies known as RaCE ($1,500), RaCE II ($1,000), RaCE III ($1,000), and MERITS ($1,000). Obsidio Embolic recall In April 2024, the FDA announced a recall of Boston Scientific's device Obsidio Embolic, which is used to stop hemorrhaging and excessive bleeding. It has been found that when the device is paired with the aliquot technique, it can lead to bowel ischemia, which can mean longer hospitalization or death for patients. Notable people Donald Steven Baim, MD (1946–2009), served Chief Medical and Scientific Officer for Boston Scientific from 2006 until his death in 2009. Ian Meredith, MD, PhD, AM (born 1956), was Global Chief Medical Officer and Executive Vice President from 2017 to 2023. Ursula Burns (born 1958), who served as a Member of Boston Scientific's 13-seat Board of Directors since 2002, resigned after being named Chief Executive Officer of the Xerox Corporation, taking effect July 1, 2009, and becoming the first African-American female CEO of a Fortune 500 company. Kristina M. Johnson (born 1957), PhD, who served as a Member of BSC's Board since May 2006, resigned in May 2009 after being confirmed by the U.S. Senate to serve as Under Secretary in the Department of Energy (see Under Secretary of Energy for Infrastructure & Under Secretary of Energy for Science and Innovation). Johnson was re-elected to BSC's board January 1, 2011, and served in that position until May 2017. Yoshiaki Fujimori (born 1951), BSC Board Member since July 2016. James Robert Tobin, Jr. (born 1944), President & CEO of BSC from 1999 through 2009. John Raymond Elliott \"Ray\" (born 1950), served as a Board Member from September 2007 to 2009, then, in July 2009, re-joined the Board and became President & CEO, a position he held until December 31, 2011. Before, he had served as Chairman of Zimmer Holdings, Inc., from August 6, 2001, to November 30, 2007, and President & CEO from March 20, 2001, to May 2007. Headquarters and regional centers World headquarters: Marlborough, Massachusetts Europe headquarters: Voisins-le-Bretonneux, France Asia Pacific headquarters: Boston Scientific Asia Pacific Pte Ltd., Singapore U.S. Government Affairs office: Washington, D.C. Latin America headquarters: Weston, Florida Notes"
}