{
  "ticker": "BX",
  "cik": "0001393818",
  "company_name": "Blackstone Inc.",
  "corrected_name": "Blackstone Inc.",
  "wiki_title_used": "Blackstone Inc.",
  "exists": true,
  "raw_text": "Blackstone Inc. is an American alternative investment management company based in New York City. It was founded in 1985 as a mergers and acquisitions firm by Peter Peterson and Stephen Schwarzman, who had previously worked together at Lehman Brothers. Blackstone's private equity business has been one of the largest investors in leveraged buyouts in the last three decades, while its real estate business has actively acquired commercial real estate across the globe. Blackstone is also active in credit, infrastructure, hedge funds, secondaries, growth equity, and insurance solutions. As of September 30, 2025, Blackstone has $1.2 trillion in total assets under management, making it the world's largest alternative investment firm.\n\nHistory\nFounding and early history\nBlackstone was founded in 1985 by Peter G. Peterson and Stephen A. Schwarzman with US$400,000 (equivalent to $1.2 million in 2024) in seed capital. The founders derived their firm's name from their names: \"Schwarz\" is German for \"black\"; \"Peter\", \"petros\" (πέτρος, masculine), or \"petra\" (πετρα, feminine) means \"stone\" or \"rock\" in Greek. The two founders had previously worked together at Lehman Brothers. There, Schwarzman served as head of global mergers and acquisitions business. Prominent investment banker Roger C. Altman, another Lehman veteran, left his position as a managing director of Lehman Brothers to join Peterson and Schwarzman at Blackstone in 1987, but left in 1992 to join the Clinton administration as Deputy Treasury Secretary and later founded advisory investment bank Evercore Partners in 1995.\nBlackstone was originally formed as a mergers and acquisitions advisory boutique. It advised on the 1987 merger of investment banks E. F. Hutton & Co. and Shearson Lehman Brothers, collecting a $3.5 million fee.\n\nFrom the outset in 1985, Schwarzman and Peterson planned to enter the private equity business but had difficulty in raising their first fund because neither had ever led a leveraged buyout. Blackstone finalized fundraising for its first private equity fund in the aftermath of Black Monday, the October 1987 global stock market crash. After two years of providing strictly advisory services, Blackstone decided to pursue a merchant banking model after its founders determined that many situations required an investment partner rather than just an advisor. The largest investors in the first fund included Prudential Insurance Company, Nikko Securities and the General Motors pension fund.\nBlackstone also ventured into other businesses, most notably investment management. In 1987 Blackstone entered into a 50–50 partnership with the founders of BlackRock, Larry Fink (current CEO of BlackRock), and Ralph Schlosstein (CEO of Evercore). The two founders, who had previously run the mortgage-backed securities divisions at First Boston and Lehman Brothers, respectively, initially joined Blackstone to manage an investment fund and provide advice to financial institutions. They also planned to use a Blackstone fund to invest in financial institutions and help build an asset management business specializing in fixed income investments.\nAs the business grew, Japanese bank Nikko Securities acquired a 20% interest in Blackstone for a $100 million investment in 1988 (valuing the firm at $500 million). Nikko's investment allowed for a major expansion of the firm and its investment activities. The growth firm also recruited politician and investment banker David Stockman from Salomon Brothers in 1988. Stockman led many key deals in his time at the firm but had a mixed record with his investments. He left Blackstone in 1999 to start his own private equity firm, Heartland Industrial Partners, based in Greenwich, Connecticut.\nThe firm advised CBS Corporation on its 1988 sale of CBS Records to Sony to form what would become Sony Music Entertainment. In June 1989, Blackstone acquired freight railroad operator CNW Corporation. The same year, Blackstone partnered with Salomon Brothers to raise $600 million to acquire distressed thrifts in the midst of the savings and loan crisis.\n\n1990s\nIn 1990, Blackstone launched its hedge funds business, initially intended to manage investments for Blackstone senior management. The same year, Blackstone formed a partnership with J. O. Hambro Magan in the UK and Indosuez in France. Blackstone and Silverman also acquired a 65% interest in Prime Motor Inn's Ramada and Howard Johnson franchises for $140 million, creating Hospitality Franchise Systems as a holding company.\nIn 1991, Blackstone created its Europe unit and launched its real estate investment business with the acquisition of a series of hotel businesses under Henry Silverman's leadership. In October 1991, Blackstone and Silverman added Days Inns of America for $250 million. In 1993, Hospitality Franchise Systems acquired Super 8 Motels for $125 million. Silverman left Blackstone to serve as CEO of HFS, which later became Cendant Corporation.\nBlackstone made a number of notable investments in the early and mid-1990s, including Great Lakes Dredge and Dock Company (1991), Six Flags (1991), US Radio (1994), Centerplate (1995), MEGA Brands (1996). Also, in 1996, Blackstone partnered with the Loewen Group, the second-largest funeral home and cemetery operator in North America, to acquire funeral home and cemetery businesses. The partnership's first acquisition was a $295 million buyout of Prime Succession from GTCR.\nIn 1995, Blackstone sold its stake in BlackRock to PNC Financial Services for $240 million. Between 1995 and 2014, PNC reported $12 billion in pretax revenues and capital gains from BlackRock. Schwarzman later described the selling of BlackRock as his worst business decision ever.\nIn 1997, Blackstone completed fundraising for its third private equity fund, with approximately $4 billion of investor commitments and a $1.1-billion real estate investment fund. Also in 1997, Blackstone made its first investment in Allied Waste. In 1998, Blackstone sold a 7% interest in its management company to AIG, valuing Blackstone at $2.1 billion. In 1999, Blackstone partnered with Apollo Management to provide capital for Allied Waste's acquisition of Browning-Ferris Industries. Blackstone's investment in Allied was one of its largest at that point in the firm's history.\nIn 1999, Blackstone launched its mezzanine capital business. It brought in five professionals, led by Howard Gellis from Nomura Holding America's Leveraged Capital Group, to manage the business.\nBlackstone's investments in the late 1990s included AMF Group (1996), Haynes International (1997), American Axle (1997), Premcor (1997), CommNet Cellular (1998), Graham Packaging (1998), Centennial Communications (1999), Bresnan Communications (1999), and PAETEC Holding Corp. (1999). Haynes and Republic Technologies International both had problems and ultimately filed bankruptcy.\nBlackstone's investments in telecommunications businesses—four cable TV systems in rural areas (TW Fanch 1 and 2, Bresnan Communications and Intermedia Partners IV) and a cell phone operator in the Rocky Mountain states (CommNet Cellular) were among the most successful of the era, generating $1.5 billion of profits for Blackstone's funds.\nBlackstone Real Estate Advisers, its real estate affiliate, bought the Watergate complex in Washington, D.C. in July 1998 for $39 million and sold it to Monument Realty in August 2004.\n\nEarly 2000s\nIn October 2000, Blackstone acquired the mortgage for 7 World Trade Center from the Teachers Insurance and Annuity Association.\n\nIn July 2002, Blackstone completed fundraising for a $6.45 billion private equity fund, Blackstone Capital Partners IV, the largest private equity fund at that time.\nWith a significant amount of capital in its new fund, Blackstone was one of a handful of private equity investors capable of completing large transactions in the adverse conditions of the early 2000s recession. At the end of 2002, Blackstone, Thomas H. Lee Partners, and Bain Capital acquired Houghton Mifflin Company for $1.28 billion. The transaction represented one of the first large club deals completed since the collapse of the dot-com bubble.\nIn 2002, Hamilton E. James joined Blackstone, where he serves as president and chief operating officer. He also serves on the firm's executive and management committees, and its board of directors. In late 2002, Blackstone acquired TRW Automotive in a $4.7 billion buyout, the largest private equity deal announced that year (the deal was completed in early 2003). TRW's parent was acquired by Northrop Grumman, while Blackstone purchased its automotive parts business, a major supplier of automotive systems. Blackstone also purchased a majority interest in Columbia House, a music-buying club, in mid-2002.\nBlackstone made a significant investment in Financial Guaranty Insurance Company (FGIC), a monoline bond insurer alongside PMI Group, The Cypress Group and CIVC Partners. FGIC incurred heavy losses, along with other bond insurers in the 2008 credit crisis.\nIn 2005, Blackstone was one of seven private equity firms involved in the buyout of SunGard, a transaction valued at $11.3 billion. Blackstone's partners in the acquisition were Silver Lake Partners, Bain Capital, Goldman Sachs Capital Partners, Kohlberg Kravis Roberts, Providence Equity Partners, and TPG Capital. This represented the largest leveraged buyout completed since the takeover of RJR Nabisco at the end of the 1980s leveraged buyout boom. Also, at the time of its announcement, SunGard was the largest buyout of a technology company in history, a distinction it ceded to the buyout of Freescale Semiconductor. The SunGard transaction is also notable for the number of firms involved, the largest club deal completed to that point. The involvement of seven firms in the consortium was criticized by investors in private equity who considered crossholdings among firms to be generally unattractive.\nIn 2006, Blackstone launched its long/short equity hedge fund business, Kailix Advisors. According to Blackstone, as of September 30, 2008, Kailix Advisors had $1.9 billion of assets under management. In December 2008, Blackstone announced that Kailix would be spun off to its management team to form a new fund as an independent entity backed by Blackstone.\nWhile Blackstone was active on the corporate investment side, it was also busy pursuing real estate investments. Blackstone acquired Prime Hospitality and Extended Stay America in 2004. Blackstone followed these investments with the acquisition of La Quinta Inns & Suites in 2005. Blackstone's largest transaction, the $26-billion buyout of Hilton Hotels Corporation, occurred in 2007 under the tenure of Hilton CFO Stephen Bollenbach. Extended Stay Hotels was sold to The Lightstone Group in July 2007 and Prime Hospitality's Wellesley Inns were folded into La Quinta. La Quinta Inns & Suites was spun out for IPO in 2014 and later acquired by Wyndham Hotels & Resorts.\n\nBuyouts (2005–2007)\nDuring the buyout boom of 2006 and 2007, Blackstone completed some of the largest leveraged buyouts. Its most notable transactions during this period included:\n\nInitial public offering in 2007\nIn 2004, Blackstone had explored the possibility of creating a business development company (BDC), Blackridge Investments, similar to vehicles pursued by Apollo Management. Blackstone failed to raise capital through an initial public offering that summer and the project were shelved. It also planned to raise a fund on the Amsterdam stock exchange in 2006, but its rival, Kohlberg Kravis Roberts & Co., launched a $5-billion fund there that soaked up all demand for such funds, and Blackstone abandoned its project.\nIn 2007, Blackstone acquired Alliant Insurance Services, an insurance brokerage firm. The company was sold to Kohlberg Kravis Roberts in 2012.\nOn June 21, 2007, Blackstone became a public company via an initial public offering, selling a 12.3% stake in the company for $4.13 billion, in the largest U.S. IPO since 2002.\n\n2008 to 2010\nDuring the 2008 financial crisis, Blackstone closed only a few transactions. In January 2008, Blackstone made a small co-investment alongside TPG Capital and Apollo Management in their buyout of Harrah's Entertainment, although that transaction had been announced during the buyout boom period. Other notable investments that Blackstone completed in 2008 and 2009 included AlliedBarton, Performance Food Group, Apria Healthcare, and CMS Computers.\nIn July 2008, Blackstone, NBC Universal, and Bain Capital acquired The Weather Channel from Landmark Communications for $3.5 billion. In 2015, the digital assets were sold to IBM for $2 billion. In 2018, the remainder of the company was sold to Byron Allen for $300 million.\nIn December 2009, Blackstone acquired Busch Entertainment Corporation from Anheuser-Busch InBev for $2.9 billion.\nIn November 2013, Merlin Entertainments, owned in part by Blackstone Group, became a public company via an initial public offering on the London Stock Exchange.\nIn August 2010, Blackstone announced it would buy Dynegy, an energy firm, for nearly $5 billion, but the acquisition was terminated in November 2010.\n\nInvestments 2011 to 2015\nIn February 2011, the company acquired Centro Properties Group US from Centro Retail Trust (now Vicinity Centres) for $9.4 billion. The company became Brixmor Property Group and Blackstone sold its remaining interest in the company in August 2016.\nIn November 2011, a fund managed by the company acquired medical biller Emdeon for $3 billion.\nIn late 2011, Blackstone Group LP acquired Jack Wolfskin, a German camping equipment company. In 2017, the company was handed over to its lenders.\nIn August 2012, Blackstone was part of a consortium that financed Knight Capital after a software glitch threatened Knight's ability to continue operations.\nIn October 2012, the company acquired G6 Hospitality, operator of Motel 6 & Studio 6 motels from AccorHotels, for $1.9 billion.\nIn November 2012, the company acquired a controlling interest in Vivint, Vivint Solar, and 2GIG Technologies. In February 2013, 2GIG was flipped to Nortek Security & Control, LLC for $135 million.\nIn April 2013, the company discussed buying Dell, but it did not pursue the acquisition.\nIn June 2013, Blackstone Real Estate Partners VII acquired an industrial portfolio from First Potomac Realty Trust for $241.5 million. Part of this portfolio was developed by StonebridgeCarras as Oakville Triangle (Now \"National Landing\")\nIn September 2013, Blackstone announced a strategic investment in ThoughtFocus Technologies LLC, an information technology service provider.\nIn August 2013, Blackstone acquired Strategic Partners, manager of secondaryfunds, from Credit Suisse.\nIn February 2014, Blackstone purchased a 20% stake in the Italian luxury brand Versace for €150 million.\nIn April 2014, Blackstone's charitable arm, the Blackstone Charitable Foundation, donated $4 million to create the Blackstone Entrepreneurs Network in Colorado. The program encourages increased collaboration among local business leaders with the goal of retaining high-growth companies in the state.\nIn May 2014, Blackstone Group acquired the Cosmopolitan of Las Vegas resort from Deutsche Bank for $1.73 billion.\nIn August 2014, Blackstone Energy Partners acquired Shell Oil's 50% stake in a shale-gas field in the Haynesville Shale for $1.2 billion.\nIn January 2015, Blackstone Real Estate Partners VI announced it would sell a Gold Fields House in Sydney to Dalian Wanda Group for A$415 million.\nIn June 2015, Blackstone acquired the Willis Tower in Chicago for $1.3 billion.\nIn July 2015, Blackstone acquired Excel Trust, a real estate investment trust, for around $2 billion.\nIn November 2015, the company agreed to sell facility management firm GCA Services Group to Goldman Sachs and Thomas H. Lee Partners.\n\nInvestments 2016 to 2020\nIn January 2016, Blackstone Real Estate Partners VIII L.P. acquired BioMed Realty Trust for $8 billion.\nIn February 2016, Blackstone sold four office buildings to Douglas Emmett for $1.34 billion.\nIn April 2016, Blackstone acquired 84% of Hewlett Packard Enterprise's stake in the Indian IT services firm Mphasis.\nOn January 4, 2017, Blackstone acquired SESAC, a music-rights organization.\nOn February 10, 2017, Aon PLC agreed to sell its human resources outsourcing platform for $4.3 billion to Blackstone Group L.P., creating a new company, Alight Solutions.\nOn June 19, 2017, Blackstone acquired a majority interest in The Office Group, valuing the company at $640 million.\nIn July 2017, the company announced an investment in Leonard Green & Partners.\nIn July 2017, Blackstone acquired Clarion Events, a global event and exhibition organizer, for 600 million pounds ($802 million).\nIn January 2018, the company acquired Pure Industrial, a Canadian real estate investment trust for C$2.5 billion.\nIn January 2018, the company announced acquisition agreement for 55% of Thomson Reuters Financial & Risk unit for $20 billion.\nIn March 2018, Blackstone Real Estate Income Trust, Inc. acquired a 22-million-square-foot portfolio of industrial properties from Cabot Properties for $1.8 billion.\nIn March 2018, Blackstone's Strategic Capital Holdings Fund invested in Rockpoint Group.\nIn March 2018, the company's Strategic Capital Holdings Fund announced an investment in Kohlberg & Company, a private equity firm.\nIn August 2018, PSAV was able to merge with Encore Global due to the help from an investment firm Blackstone.\nIn September 2018, the company acquires control of Luminor Bank in the Baltic countries.\nIn October 2018, Blackstone launched Refinitiv, the company resulting from its January deal for a 55% stake in Thomson Reuters Financial and Risk business.\nIn October 2018, Blackstone announced to buy Clarus. The deal includes assets worth $2.6 billion.\nIn March 2019, Blackstone purchased, with Yankee Global Enterprises, a minority stake in YES Network.\nIn April 2019, Blackstone acquired a majority stake in the tube packaging company, Essel Propack for $310 million.\nIn April 2019, Blackstone invested $480 million in Starfield, a shopping mall brand run by Shinsegae Group, securing a 17.15% stake.\nIn June 2019, Blackstone announced it had teamed with the Canada Pension Plan Investment Board and KIRKBI to buy Merlin Entertainment, the owners of Legoland in a deal worth £5.9 billion (about $7.5 billion). This was the second time Blackstone owned the company, having previously purchased it in 2005.\nOn July 15, 2019, Blackstone announced its plans to acquire Vungle Inc., a leading mobile performance marketing platform.\nIn September 2019, Blackstone announced it agreed to purchase 65% controlling interest in Great Wolf Resorts from Centerbridge Partners. They planned to form a joint venture worth $2.9 billion or more to own the company.\nOn November 8, 2019, Blackstone Group acquired a majority stake in MagicLab, the owner of dating app Bumble.\nBlackstone Group on November 15, 2019, invested $167 million in the holding company of Future Lifestyle Fashions Ltd., Ryka Commercial Ventures Pvt. Ltd.\nOn November 18, 2019, Blackstone Real Estate Income Trust, Inc. acquired the Bellagio resort in Las Vegas, Nevada, from MGM Resorts in a sale-leaseback transaction.\nOn November 25, 2019, Reuters reported that Blackstone planned to invest $400 million in a joint venture with Swiss drug company Ferring. The joint venture will work on gene therapy for bladder cancer. The investment represented Blackstone Group's largest investment in drug development to date.\nIn March 2020, Blackstone announced that it was buying a majority stake in HealthEdge, a health-care software company. The deal, worth $700 million, was completed on April 13, 2020.\nIn July 2020, Blackstone invested $200 million in the Swedish oat milk brand Oatly, for a 7% stake in the company, triggering outrage among some segments of its customer base.\nIn August 2020, Blackstone announced that it would buy a majority stake in Ancestry.com for $4.7 billion (including debt).\nIn August 2020, Blackstone acquired Takeda Consumer Healthcare for $2.3 billion.\nIn December 2020, Blackstone invested nearly $400 million in Liftoff, a mobile advertising company.\n\nInvestments since 2021\nIn January 2021, Blackstone acquired a majority shareholding in Bourne Leisure, a UK holiday and leisure company that owns Butlin's, Haven Holidays, and Warner Leisure, for £3 billion.\nIn March 2021, Blackstone made a $6.2-billion takeover bid for Australian casino operator Crown Resorts, offering a 20% premium to its closing share price at the time of the offer. At the time, Blackstone had a near 10% stake in the company.\nIn April 2021, Blackstone acquired eOne Music from Hasbro for $385 million.\nIn June 2021, Blackstone agreed to acquire datacenter operator Quality Technology Services for approximately $10 billion.\nIn July 2021, MGM Resorts International announced it sold Aria Resort and Casino and Vdara to Blackstone for $3.89 billion in a sale-leaseback transaction.\nIn July 2021, Blackstone Group and AIG announced that the company would acquire 9.9% of AIG's life and retirement insurance investment portfolio for $2.2 billion cash, during AIG's spin-off of the unit by IPO in 2022. The two firms also entered a long-term asset management agreement for about 25% of AIG's life and retirement portfolio, scheduled to increase in subsequent years.\nIn August 2021, the merger of two Blackstone portfolio companies, Vungle and Liftoff, was announced. Both companies are in mobile advertising.\nIn October 2021, the Blackstone Group acquired a majority stake of Spanx, Inc. The company was valued at $1.2 billion. The deal was prepared by an all-female investment team from Blackstone, and it was announced that the board of directors would be all female.\nIn October 2021, Blackstone acquired the Nucleus Network, Australia's premier clinical researcher, which is providing staple \"healthy\" volunteers large financial rewards for drug trials.\nOn February 14, 2022, Crown Resorts accepted Blackstone's takeover offer. Blackstone will pay $6.6 billion for 90% of shares outstanding.\nIn April 2022, Blackstone agreed to acquire the Austin-based American Campus Communities, Inc. for nearly $13 billion.\nIn April 2022, Blackstone announced that it would acquire PS Business Parks for $7.6 billion.\nIn October 2022, Emerson Electric agreed to sell a 55% stake in its climate technologies business to Blackstone in a $14-billion deal, including debt.\nIn June 2023, Blackstone acquired cloud-based event-software provider Cvent for $4.6 billion.\nIn October 2023, Blackstone announced that, as part of a club deal alongside private equity firm Vista Equity Partners, it would acquire leading energy market analytics and simulation software firm Energy Exemplar for approximately $1.6 billion.\nIn December 2023, Blackstone announced an agreement to acquire a majority stake in Sony Payment Services Inc. from Sony Bank.\nIn January 2024, Blackstone agreed to acquire Canadian real-estate company Tricon Residential for $3.5 billion.\nIn February 2024, Blackstone made a growth equity investment in American drive-thru coffeehouse chain 7 Brew.\nIn February 2024, Blackstone acquired online pet marketplace Rover.com for $2.3 billion in an all-cash deal that it first announced in November 2023.\nIn April 2024, Blackstone announced a deal for a 50.7% share in Irish turnkey data center developer Winthrop Technologies.\nIn April 2024, Blackstone made a $1.57 billion offer, outbidding Concord, to acquire British music IP investment and song management company Hipgnosis Songs Fund. The acquisition was completed in July.\nIn September 2024, Blackstone entered into a definitive agreement to acquire AirTrunk, a data center platform in the Asia-Pacific region, for an enterprise value of over A$24 billion.\nOn November 19, 2024, Blackstone announced it is acquiring Jersey Mike's Subs. The transaction is expected to close in early 2025.\nIn March 2025, Blackstone acquired a 22% stake in AGS Airports, which owns three airports in the UK, for £235 million.\nIn June 2025, Blackstone acquired Assent, an Ottawa-based compliance software company for the supply chain industry, for $1.3 billion.\nIn August 2025, Blackstone-backed Legence filed for a U.S. IPO after reporting losses that nearly tripled to $26.5M in the first half of 2025 despite revenue growth.\n\nJuly 2025 mass shooting\nIn July 2025, a mass shooting occurred at the Manhattan headquarters of Blackstone. The gunman, identified as 27-year-old Shane Devon Tamura, entered the building wearing body armor and carrying an AR-15–style rifle. He opened fire in the lobby, killing four people. The victims included Wesley LePatner, a senior managing director at Blackstone and CEO of the real estate fund BREIT, an off-duty New York City police officer working security, a security guard, and another employee in the building.\n\n2020s divestment\nIBS Software\nIn May 2023, Blackstone entered into an agreement to divest its stake in IBS Software, a Kerala-based software-as-a-service (SaaS) provider. The transaction, valued at $450 million, involved the sale of Blackstone's stake to the global private equity firm Apax.\n\nHotel Investment Partners\nIn October 2023, Blackstone divested its stake in the Spanish hotel conglomerate Hotel Investment Partners (HIP) to the Singaporean sovereign wealth fund GIC. As part of the agreement, GIC secured a 35% stake in HIP, with the deal establishing a valuation exceeding €4 billion for the company.\n\nEmbassy Office Parks\nIn December 2023, Blackstone announced its intention to divest its entire 23.59% stake, valued at $833 million, in Embassy Office Parks, India's largest real estate investment trust. The decision came four years after the initial listing of the REIT, as revealed in a term sheet disclosed by Reuters.\n\nHealthEdge\nIn April 2025, Blackstone sold its controlling stake in HealthEdge, a US software company, which it had owned since 2020. The company was acquired by Bain Capital in a deal that valued the company at $2.6 billion including debt.\n\nPersonnel\nIn November 2025, Kathleen McCarthy Baldwin, global co-head of real estate, announced that she will leave the firm at the end of the year. Baldwin is one of Wall Street’s highest-ranking female executives.\n\nOperations\nBlackstone operates through four primary departments: private equity, real estate, hedge funds, and credit.\n\nCorporate private equity\nAs of 2019, Blackstone was the world's largest private equity firm by capital commitments as ranked by Private Equity International's PEI 300 ranking. After dropping to second behind KKR in the 2022 ranking, it regained the top spot in 2023, and retained it in 2024, before slipping to third in the 2025 list. The firm invests through minority investments, corporate partnerships, and industry consolidations, and occasionally start-up investments. The firm focuses on friendly investments in large capitalization companies.\nBlackstone has primarily relied on private equity funds, pools of committed capital from pension funds, insurance companies, endowments, fund of funds, high-net-worth individuals, sovereign wealth funds, and other institutional investors. From 1987 to its IPO in 2007, Blackstone invested approximately $20 billion in 109 private equity transactions.\nBlackstone's most notable investments include Allied Waste, AlliedBarton Security Services, Graham Packaging, Celanese, Nalco, HealthMarkets, Houghton Mifflin, American Axle, TRW Automotive, Catalent Pharma Solutions, Prime Hospitality, Legoland, Madame Tussauds, Luxury Resorts (LXR), Pinnacle Foods, Hilton Hotels Corporation, Motel 6, Apria Healthcare, Travelport, The Weather Channel (United States) and The PortAventura Resort. In 2009, Blackstone purchased Busch Entertainment (comprising the Sea World Parks, Busch Garden Parks and the two water parks). In 2020 it acquired Ancestry.com.\nIn 2012, Blackstone acquired a controlling interest in Utah-based Vivint, Inc., a home automation, security, and energy company.\n\nReal estate\nBlackstone's most notable real estate investments have included QTS, EQ Office, Hilton Worldwide, Trizec Properties, Center Parcs UK, La Quinta Inns & Suites, Motel 6, Wyndham Worldwide, Southern Cross Healthcare and Vicinity Centres.\nThe purchase and subsequent IPO of Southern Cross led to controversy in the UK. Part of the purchase involved splitting the business into a property company, NHP, and a nursing home business, which Blackstone claimed would become \"the leading company in the elderly care market\". In May 2011, Southern Cross, now independent, was almost bankrupt, jeopardizing 31,000 elderly residents in 750 care homes. It denied blame, although Blackstone was widely accused in the media for selling on the company with an unsustainable business model and crippled with an impossible sale and leaseback strategy.\nAfter the 2007–2010 subprime mortgage crisis in the United States, Blackstone Group LP bought more than $5.5 billion worth of multi-family homes to rent and be sold when the prices rise.\nIn 2014, Blackstone sold Northern California office buildings for $3.5 billion. The buildings sold in San Francisco and Silicon Valley included 26 office buildings and two development parcels.\nIn 2018, Blackstone's Danish partner North 360 made a purchase agreement on several hundred apartments in Frederiksberg, Denmark, with Frederiksberg Boligfond, a nonprofit housing organization Frederiksberg Municipality established in 1930. After resistance by residents and questions about the purchase agreement's legality, Blackstone withdrew from it in October 2019.\nOn December 1, 2022, Blackstone restricted withdrawals from its $125-billion real estate investment fund BREIT (Blackstone Real Estate Investment Trust) due to a surge in redemption requests from investors. The move caused investor consternation and limited the ability to attract new capital for BREIT.\nIn November 2024, Blackstone acquired a group of four retail buildings in Soho for approximately $200 million from ASB Real Estate Investments. This transaction marked the largest Manhattan retail deal by an investor in over three years, signaling a resurgence in the retail asset class. The properties, which house tenants such as Patagonia and Amiri, were purchased with the strategy of increasing revenue by bringing below-market leases up to current rates. The deal included buildings at 61 Crosby Street, 72-76 Greene Street, 465 Broadway, and 415 West Broadway.\n\nMarketable alternative asset management\nIn 1990, Blackstone created a fund of hedge funds business to manage internal assets for Blackstone and its senior managers. This business evolved into Blackstone's marketable alternative asset management segment, which was opened to institutional investors. Among the investments included in this segment are funds of hedge funds, mezzanine funds, senior debt vehicles, proprietary hedge funds and closed-end mutual funds.\n\nIn March 2008, Blackstone acquired GSO Capital Partners, a credit-oriented alternative asset manager, for $620 million in cash and stock and up to $310 million through an earnout over the next five years based on earnings targets. The combined entity created one of the largest credit platforms in the alternative asset management business, with over $21 billion under management. GSO was founded in 2005 by Bennett Goodman, Tripp Smith, and Doug Ostrover. The GSO team had previously managed the leveraged finance businesses at Donaldson, Lufkin & Jenrette and later Credit Suisse First Boston, after it acquired DLJ. Blackstone was an original investor in GSO's funds. After the acquisition, Blackstone merged GSO's operations with its existing debt investment operations.\n\nControversies\nWarrantless disclosure of Motel 6  occupancies\nIn separate cases in 2018 and 2019, the hotel chain Motel 6, owned by Blackstone, agreed to settle for $19.6 million for giving guest lists to U.S. Immigration and Customs Enforcement (ICE) without a warrant.\n\nAncestry acquisition and data leaks\nIn 2020, Blackstone acquired a majority stake in Ancestry.com, which controls access to millions of people's genetic data, heightening concern about Blackstone's data privacy practices. This data was disclosed to Blackstone, and it has aggressively defended itself against class action litigation relating to misuse of the data of people who did not consent to genetic testing but were affected through direct biological relations or other means of identification.\n\nIllegal child labor\nAn investigation by the U.S. Department of Labor showed that more than 100 American children had been working illegally for Packers Sanitation Services Inc. (PSSI), a slaughterhouse cleaning firm owned by Blackstone. The investigation began after a Walnut Middle School teacher in Grand Island, Nebraska, reported a student with hydrochloric acid burns on his hands and knees to the Department of Labor. Under the Fair Labor Standards Act, the Labor Department fined PSSI $15,138 for each minor who was employed in breach of the law, totaling $1.5 million in civil money penalties.\n\nDeforestation of the Amazon rainforest\nBlackstone has invested in companies with links to the commercialization and deforestation of the Amazon rainforest.\n\nBusiness trends\nThe key trends for Blackstone are (as of the financial year ending December 31)\n\nSee also\nList of outdoor industry parent companies\nList of venture capital firms\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Blackstone Inc.:",
  "clean_text": "Blackstone Inc. is an American alternative investment management company based in New York City. It was founded in 1985 as a mergers and acquisitions firm by Peter Peterson and Stephen Schwarzman, who had previously worked together at Lehman Brothers. Blackstone's private equity business has been one of the largest investors in leveraged buyouts in the last three decades, while its real estate business has actively acquired commercial real estate across the globe. Blackstone is also active in credit, infrastructure, hedge funds, secondaries, growth equity, and insurance solutions. As of September 30, 2025, Blackstone has $1.2 trillion in total assets under management, making it the world's largest alternative investment firm. History Founding and early history Blackstone was founded in 1985 by Peter G. Peterson and Stephen A. Schwarzman with US$400,000 (equivalent to $1.2 million in 2024) in seed capital. The founders derived their firm's name from their names: \"Schwarz\" is German for \"black\"; \"Peter\", \"petros\" (πέτρος, masculine), or \"petra\" (πετρα, feminine) means \"stone\" or \"rock\" in Greek. The two founders had previously worked together at Lehman Brothers. There, Schwarzman served as head of global mergers and acquisitions business. Prominent investment banker Roger C. Altman, another Lehman veteran, left his position as a managing director of Lehman Brothers to join Peterson and Schwarzman at Blackstone in 1987, but left in 1992 to join the Clinton administration as Deputy Treasury Secretary and later founded advisory investment bank Evercore Partners in 1995. Blackstone was originally formed as a mergers and acquisitions advisory boutique. It advised on the 1987 merger of investment banks E. F. Hutton & Co. and Shearson Lehman Brothers, collecting a $3.5 million fee. From the outset in 1985, Schwarzman and Peterson planned to enter the private equity business but had difficulty in raising their first fund because neither had ever led a leveraged buyout. Blackstone finalized fundraising for its first private equity fund in the aftermath of Black Monday, the October 1987 global stock market crash. After two years of providing strictly advisory services, Blackstone decided to pursue a merchant banking model after its founders determined that many situations required an investment partner rather than just an advisor. The largest investors in the first fund included Prudential Insurance Company, Nikko Securities and the General Motors pension fund. Blackstone also ventured into other businesses, most notably investment management. In 1987 Blackstone entered into a 50–50 partnership with the founders of BlackRock, Larry Fink (current CEO of BlackRock), and Ralph Schlosstein (CEO of Evercore). The two founders, who had previously run the mortgage-backed securities divisions at First Boston and Lehman Brothers, respectively, initially joined Blackstone to manage an investment fund and provide advice to financial institutions. They also planned to use a Blackstone fund to invest in financial institutions and help build an asset management business specializing in fixed income investments. As the business grew, Japanese bank Nikko Securities acquired a 20% interest in Blackstone for a $100 million investment in 1988 (valuing the firm at $500 million). Nikko's investment allowed for a major expansion of the firm and its investment activities. The growth firm also recruited politician and investment banker David Stockman from Salomon Brothers in 1988. Stockman led many key deals in his time at the firm but had a mixed record with his investments. He left Blackstone in 1999 to start his own private equity firm, Heartland Industrial Partners, based in Greenwich, Connecticut. The firm advised CBS Corporation on its 1988 sale of CBS Records to Sony to form what would become Sony Music Entertainment. In June 1989, Blackstone acquired freight railroad operator CNW Corporation. The same year, Blackstone partnered with Salomon Brothers to raise $600 million to acquire distressed thrifts in the midst of the savings and loan crisis. 1990s In 1990, Blackstone launched its hedge funds business, initially intended to manage investments for Blackstone senior management. The same year, Blackstone formed a partnership with J. O. Hambro Magan in the UK and Indosuez in France. Blackstone and Silverman also acquired a 65% interest in Prime Motor Inn's Ramada and Howard Johnson franchises for $140 million, creating Hospitality Franchise Systems as a holding company. In 1991, Blackstone created its Europe unit and launched its real estate investment business with the acquisition of a series of hotel businesses under Henry Silverman's leadership. In October 1991, Blackstone and Silverman added Days Inns of America for $250 million. In 1993, Hospitality Franchise Systems acquired Super 8 Motels for $125 million. Silverman left Blackstone to serve as CEO of HFS, which later became Cendant Corporation. Blackstone made a number of notable investments in the early and mid-1990s, including Great Lakes Dredge and Dock Company (1991), Six Flags (1991), US Radio (1994), Centerplate (1995), MEGA Brands (1996). Also, in 1996, Blackstone partnered with the Loewen Group, the second-largest funeral home and cemetery operator in North America, to acquire funeral home and cemetery businesses. The partnership's first acquisition was a $295 million buyout of Prime Succession from GTCR. In 1995, Blackstone sold its stake in BlackRock to PNC Financial Services for $240 million. Between 1995 and 2014, PNC reported $12 billion in pretax revenues and capital gains from BlackRock. Schwarzman later described the selling of BlackRock as his worst business decision ever. In 1997, Blackstone completed fundraising for its third private equity fund, with approximately $4 billion of investor commitments and a $1.1-billion real estate investment fund. Also in 1997, Blackstone made its first investment in Allied Waste. In 1998, Blackstone sold a 7% interest in its management company to AIG, valuing Blackstone at $2.1 billion. In 1999, Blackstone partnered with Apollo Management to provide capital for Allied Waste's acquisition of Browning-Ferris Industries. Blackstone's investment in Allied was one of its largest at that point in the firm's history. In 1999, Blackstone launched its mezzanine capital business. It brought in five professionals, led by Howard Gellis from Nomura Holding America's Leveraged Capital Group, to manage the business. Blackstone's investments in the late 1990s included AMF Group (1996), Haynes International (1997), American Axle (1997), Premcor (1997), CommNet Cellular (1998), Graham Packaging (1998), Centennial Communications (1999), Bresnan Communications (1999), and PAETEC Holding Corp. (1999). Haynes and Republic Technologies International both had problems and ultimately filed bankruptcy. Blackstone's investments in telecommunications businesses—four cable TV systems in rural areas (TW Fanch 1 and 2, Bresnan Communications and Intermedia Partners IV) and a cell phone operator in the Rocky Mountain states (CommNet Cellular) were among the most successful of the era, generating $1.5 billion of profits for Blackstone's funds. Blackstone Real Estate Advisers, its real estate affiliate, bought the Watergate complex in Washington, D.C. in July 1998 for $39 million and sold it to Monument Realty in August 2004. Early 2000s In October 2000, Blackstone acquired the mortgage for 7 World Trade Center from the Teachers Insurance and Annuity Association. In July 2002, Blackstone completed fundraising for a $6.45 billion private equity fund, Blackstone Capital Partners IV, the largest private equity fund at that time. With a significant amount of capital in its new fund, Blackstone was one of a handful of private equity investors capable of completing large transactions in the adverse conditions of the early 2000s recession. At the end of 2002, Blackstone, Thomas H. Lee Partners, and Bain Capital acquired Houghton Mifflin Company for $1.28 billion. The transaction represented one of the first large club deals completed since the collapse of the dot-com bubble. In 2002, Hamilton E. James joined Blackstone, where he serves as president and chief operating officer. He also serves on the firm's executive and management committees, and its board of directors. In late 2002, Blackstone acquired TRW Automotive in a $4.7 billion buyout, the largest private equity deal announced that year (the deal was completed in early 2003). TRW's parent was acquired by Northrop Grumman, while Blackstone purchased its automotive parts business, a major supplier of automotive systems. Blackstone also purchased a majority interest in Columbia House, a music-buying club, in mid-2002. Blackstone made a significant investment in Financial Guaranty Insurance Company (FGIC), a monoline bond insurer alongside PMI Group, The Cypress Group and CIVC Partners. FGIC incurred heavy losses, along with other bond insurers in the 2008 credit crisis. In 2005, Blackstone was one of seven private equity firms involved in the buyout of SunGard, a transaction valued at $11.3 billion. Blackstone's partners in the acquisition were Silver Lake Partners, Bain Capital, Goldman Sachs Capital Partners, Kohlberg Kravis Roberts, Providence Equity Partners, and TPG Capital. This represented the largest leveraged buyout completed since the takeover of RJR Nabisco at the end of the 1980s leveraged buyout boom. Also, at the time of its announcement, SunGard was the largest buyout of a technology company in history, a distinction it ceded to the buyout of Freescale Semiconductor. The SunGard transaction is also notable for the number of firms involved, the largest club deal completed to that point. The involvement of seven firms in the consortium was criticized by investors in private equity who considered crossholdings among firms to be generally unattractive. In 2006, Blackstone launched its long/short equity hedge fund business, Kailix Advisors. According to Blackstone, as of September 30, 2008, Kailix Advisors had $1.9 billion of assets under management. In December 2008, Blackstone announced that Kailix would be spun off to its management team to form a new fund as an independent entity backed by Blackstone. While Blackstone was active on the corporate investment side, it was also busy pursuing real estate investments. Blackstone acquired Prime Hospitality and Extended Stay America in 2004. Blackstone followed these investments with the acquisition of La Quinta Inns & Suites in 2005. Blackstone's largest transaction, the $26-billion buyout of Hilton Hotels Corporation, occurred in 2007 under the tenure of Hilton CFO Stephen Bollenbach. Extended Stay Hotels was sold to The Lightstone Group in July 2007 and Prime Hospitality's Wellesley Inns were folded into La Quinta. La Quinta Inns & Suites was spun out for IPO in 2014 and later acquired by Wyndham Hotels & Resorts. Buyouts (2005–2007) During the buyout boom of 2006 and 2007, Blackstone completed some of the largest leveraged buyouts. Its most notable transactions during this period included: Initial public offering in 2007 In 2004, Blackstone had explored the possibility of creating a business development company (BDC), Blackridge Investments, similar to vehicles pursued by Apollo Management. Blackstone failed to raise capital through an initial public offering that summer and the project were shelved. It also planned to raise a fund on the Amsterdam stock exchange in 2006, but its rival, Kohlberg Kravis Roberts & Co., launched a $5-billion fund there that soaked up all demand for such funds, and Blackstone abandoned its project. In 2007, Blackstone acquired Alliant Insurance Services, an insurance brokerage firm. The company was sold to Kohlberg Kravis Roberts in 2012. On June 21, 2007, Blackstone became a public company via an initial public offering, selling a 12.3% stake in the company for $4.13 billion, in the largest U.S. IPO since 2002. 2008 to 2010 During the 2008 financial crisis, Blackstone closed only a few transactions. In January 2008, Blackstone made a small co-investment alongside TPG Capital and Apollo Management in their buyout of Harrah's Entertainment, although that transaction had been announced during the buyout boom period. Other notable investments that Blackstone completed in 2008 and 2009 included AlliedBarton, Performance Food Group, Apria Healthcare, and CMS Computers. In July 2008, Blackstone, NBC Universal, and Bain Capital acquired The Weather Channel from Landmark Communications for $3.5 billion. In 2015, the digital assets were sold to IBM for $2 billion. In 2018, the remainder of the company was sold to Byron Allen for $300 million. In December 2009, Blackstone acquired Busch Entertainment Corporation from Anheuser-Busch InBev for $2.9 billion. In November 2013, Merlin Entertainments, owned in part by Blackstone Group, became a public company via an initial public offering on the London Stock Exchange. In August 2010, Blackstone announced it would buy Dynegy, an energy firm, for nearly $5 billion, but the acquisition was terminated in November 2010. Investments 2011 to 2015 In February 2011, the company acquired Centro Properties Group US from Centro Retail Trust (now Vicinity Centres) for $9.4 billion. The company became Brixmor Property Group and Blackstone sold its remaining interest in the company in August 2016. In November 2011, a fund managed by the company acquired medical biller Emdeon for $3 billion. In late 2011, Blackstone Group LP acquired Jack Wolfskin, a German camping equipment company. In 2017, the company was handed over to its lenders. In August 2012, Blackstone was part of a consortium that financed Knight Capital after a software glitch threatened Knight's ability to continue operations. In October 2012, the company acquired G6 Hospitality, operator of Motel 6 & Studio 6 motels from AccorHotels, for $1.9 billion. In November 2012, the company acquired a controlling interest in Vivint, Vivint Solar, and 2GIG Technologies. In February 2013, 2GIG was flipped to Nortek Security & Control, LLC for $135 million. In April 2013, the company discussed buying Dell, but it did not pursue the acquisition. In June 2013, Blackstone Real Estate Partners VII acquired an industrial portfolio from First Potomac Realty Trust for $241.5 million. Part of this portfolio was developed by StonebridgeCarras as Oakville Triangle (Now \"National Landing\") In September 2013, Blackstone announced a strategic investment in ThoughtFocus Technologies LLC, an information technology service provider. In August 2013, Blackstone acquired Strategic Partners, manager of secondaryfunds, from Credit Suisse. In February 2014, Blackstone purchased a 20% stake in the Italian luxury brand Versace for €150 million. In April 2014, Blackstone's charitable arm, the Blackstone Charitable Foundation, donated $4 million to create the Blackstone Entrepreneurs Network in Colorado. The program encourages increased collaboration among local business leaders with the goal of retaining high-growth companies in the state. In May 2014, Blackstone Group acquired the Cosmopolitan of Las Vegas resort from Deutsche Bank for $1.73 billion. In August 2014, Blackstone Energy Partners acquired Shell Oil's 50% stake in a shale-gas field in the Haynesville Shale for $1.2 billion. In January 2015, Blackstone Real Estate Partners VI announced it would sell a Gold Fields House in Sydney to Dalian Wanda Group for A$415 million. In June 2015, Blackstone acquired the Willis Tower in Chicago for $1.3 billion. In July 2015, Blackstone acquired Excel Trust, a real estate investment trust, for around $2 billion. In November 2015, the company agreed to sell facility management firm GCA Services Group to Goldman Sachs and Thomas H. Lee Partners. Investments 2016 to 2020 In January 2016, Blackstone Real Estate Partners VIII L.P. acquired BioMed Realty Trust for $8 billion. In February 2016, Blackstone sold four office buildings to Douglas Emmett for $1.34 billion. In April 2016, Blackstone acquired 84% of Hewlett Packard Enterprise's stake in the Indian IT services firm Mphasis. On January 4, 2017, Blackstone acquired SESAC, a music-rights organization. On February 10, 2017, Aon PLC agreed to sell its human resources outsourcing platform for $4.3 billion to Blackstone Group L.P., creating a new company, Alight Solutions. On June 19, 2017, Blackstone acquired a majority interest in The Office Group, valuing the company at $640 million. In July 2017, the company announced an investment in Leonard Green & Partners. In July 2017, Blackstone acquired Clarion Events, a global event and exhibition organizer, for 600 million pounds ($802 million). In January 2018, the company acquired Pure Industrial, a Canadian real estate investment trust for C$2.5 billion. In January 2018, the company announced acquisition agreement for 55% of Thomson Reuters Financial & Risk unit for $20 billion. In March 2018, Blackstone Real Estate Income Trust, Inc. acquired a 22-million-square-foot portfolio of industrial properties from Cabot Properties for $1.8 billion. In March 2018, Blackstone's Strategic Capital Holdings Fund invested in Rockpoint Group. In March 2018, the company's Strategic Capital Holdings Fund announced an investment in Kohlberg & Company, a private equity firm. In August 2018, PSAV was able to merge with Encore Global due to the help from an investment firm Blackstone. In September 2018, the company acquires control of Luminor Bank in the Baltic countries. In October 2018, Blackstone launched Refinitiv, the company resulting from its January deal for a 55% stake in Thomson Reuters Financial and Risk business. In October 2018, Blackstone announced to buy Clarus. The deal includes assets worth $2.6 billion. In March 2019, Blackstone purchased, with Yankee Global Enterprises, a minority stake in YES Network. In April 2019, Blackstone acquired a majority stake in the tube packaging company, Essel Propack for $310 million. In April 2019, Blackstone invested $480 million in Starfield, a shopping mall brand run by Shinsegae Group, securing a 17.15% stake. In June 2019, Blackstone announced it had teamed with the Canada Pension Plan Investment Board and KIRKBI to buy Merlin Entertainment, the owners of Legoland in a deal worth £5.9 billion (about $7.5 billion). This was the second time Blackstone owned the company, having previously purchased it in 2005. On July 15, 2019, Blackstone announced its plans to acquire Vungle Inc., a leading mobile performance marketing platform. In September 2019, Blackstone announced it agreed to purchase 65% controlling interest in Great Wolf Resorts from Centerbridge Partners. They planned to form a joint venture worth $2.9 billion or more to own the company. On November 8, 2019, Blackstone Group acquired a majority stake in MagicLab, the owner of dating app Bumble. Blackstone Group on November 15, 2019, invested $167 million in the holding company of Future Lifestyle Fashions Ltd., Ryka Commercial Ventures Pvt. Ltd. On November 18, 2019, Blackstone Real Estate Income Trust, Inc. acquired the Bellagio resort in Las Vegas, Nevada, from MGM Resorts in a sale-leaseback transaction. On November 25, 2019, Reuters reported that Blackstone planned to invest $400 million in a joint venture with Swiss drug company Ferring. The joint venture will work on gene therapy for bladder cancer. The investment represented Blackstone Group's largest investment in drug development to date. In March 2020, Blackstone announced that it was buying a majority stake in HealthEdge, a health-care software company. The deal, worth $700 million, was completed on April 13, 2020. In July 2020, Blackstone invested $200 million in the Swedish oat milk brand Oatly, for a 7% stake in the company, triggering outrage among some segments of its customer base. In August 2020, Blackstone announced that it would buy a majority stake in Ancestry.com for $4.7 billion (including debt). In August 2020, Blackstone acquired Takeda Consumer Healthcare for $2.3 billion. In December 2020, Blackstone invested nearly $400 million in Liftoff, a mobile advertising company. Investments since 2021 In January 2021, Blackstone acquired a majority shareholding in Bourne Leisure, a UK holiday and leisure company that owns Butlin's, Haven Holidays, and Warner Leisure, for £3 billion. In March 2021, Blackstone made a $6.2-billion takeover bid for Australian casino operator Crown Resorts, offering a 20% premium to its closing share price at the time of the offer. At the time, Blackstone had a near 10% stake in the company. In April 2021, Blackstone acquired eOne Music from Hasbro for $385 million. In June 2021, Blackstone agreed to acquire datacenter operator Quality Technology Services for approximately $10 billion. In July 2021, MGM Resorts International announced it sold Aria Resort and Casino and Vdara to Blackstone for $3.89 billion in a sale-leaseback transaction. In July 2021, Blackstone Group and AIG announced that the company would acquire 9.9% of AIG's life and retirement insurance investment portfolio for $2.2 billion cash, during AIG's spin-off of the unit by IPO in 2022. The two firms also entered a long-term asset management agreement for about 25% of AIG's life and retirement portfolio, scheduled to increase in subsequent years. In August 2021, the merger of two Blackstone portfolio companies, Vungle and Liftoff, was announced. Both companies are in mobile advertising. In October 2021, the Blackstone Group acquired a majority stake of Spanx, Inc. The company was valued at $1.2 billion. The deal was prepared by an all-female investment team from Blackstone, and it was announced that the board of directors would be all female. In October 2021, Blackstone acquired the Nucleus Network, Australia's premier clinical researcher, which is providing staple \"healthy\" volunteers large financial rewards for drug trials. On February 14, 2022, Crown Resorts accepted Blackstone's takeover offer. Blackstone will pay $6.6 billion for 90% of shares outstanding. In April 2022, Blackstone agreed to acquire the Austin-based American Campus Communities, Inc. for nearly $13 billion. In April 2022, Blackstone announced that it would acquire PS Business Parks for $7.6 billion. In October 2022, Emerson Electric agreed to sell a 55% stake in its climate technologies business to Blackstone in a $14-billion deal, including debt. In June 2023, Blackstone acquired cloud-based event-software provider Cvent for $4.6 billion. In October 2023, Blackstone announced that, as part of a club deal alongside private equity firm Vista Equity Partners, it would acquire leading energy market analytics and simulation software firm Energy Exemplar for approximately $1.6 billion. In December 2023, Blackstone announced an agreement to acquire a majority stake in Sony Payment Services Inc. from Sony Bank. In January 2024, Blackstone agreed to acquire Canadian real-estate company Tricon Residential for $3.5 billion. In February 2024, Blackstone made a growth equity investment in American drive-thru coffeehouse chain 7 Brew. In February 2024, Blackstone acquired online pet marketplace Rover.com for $2.3 billion in an all-cash deal that it first announced in November 2023. In April 2024, Blackstone announced a deal for a 50.7% share in Irish turnkey data center developer Winthrop Technologies. In April 2024, Blackstone made a $1.57 billion offer, outbidding Concord, to acquire British music IP investment and song management company Hipgnosis Songs Fund. The acquisition was completed in July. In September 2024, Blackstone entered into a definitive agreement to acquire AirTrunk, a data center platform in the Asia-Pacific region, for an enterprise value of over A$24 billion. On November 19, 2024, Blackstone announced it is acquiring Jersey Mike's Subs. The transaction is expected to close in early 2025. In March 2025, Blackstone acquired a 22% stake in AGS Airports, which owns three airports in the UK, for £235 million. In June 2025, Blackstone acquired Assent, an Ottawa-based compliance software company for the supply chain industry, for $1.3 billion. In August 2025, Blackstone-backed Legence filed for a U.S. IPO after reporting losses that nearly tripled to $26.5M in the first half of 2025 despite revenue growth. July 2025 mass shooting In July 2025, a mass shooting occurred at the Manhattan headquarters of Blackstone. The gunman, identified as 27-year-old Shane Devon Tamura, entered the building wearing body armor and carrying an AR-15–style rifle. He opened fire in the lobby, killing four people. The victims included Wesley LePatner, a senior managing director at Blackstone and CEO of the real estate fund BREIT, an off-duty New York City police officer working security, a security guard, and another employee in the building. 2020s divestment IBS Software In May 2023, Blackstone entered into an agreement to divest its stake in IBS Software, a Kerala-based software-as-a-service (SaaS) provider. The transaction, valued at $450 million, involved the sale of Blackstone's stake to the global private equity firm Apax. Hotel Investment Partners In October 2023, Blackstone divested its stake in the Spanish hotel conglomerate Hotel Investment Partners (HIP) to the Singaporean sovereign wealth fund GIC. As part of the agreement, GIC secured a 35% stake in HIP, with the deal establishing a valuation exceeding €4 billion for the company. Embassy Office Parks In December 2023, Blackstone announced its intention to divest its entire 23.59% stake, valued at $833 million, in Embassy Office Parks, India's largest real estate investment trust. The decision came four years after the initial listing of the REIT, as revealed in a term sheet disclosed by Reuters. HealthEdge In April 2025, Blackstone sold its controlling stake in HealthEdge, a US software company, which it had owned since 2020. The company was acquired by Bain Capital in a deal that valued the company at $2.6 billion including debt. Personnel In November 2025, Kathleen McCarthy Baldwin, global co-head of real estate, announced that she will leave the firm at the end of the year. Baldwin is one of Wall Street’s highest-ranking female executives. Operations Blackstone operates through four primary departments: private equity, real estate, hedge funds, and credit. Corporate private equity As of 2019, Blackstone was the world's largest private equity firm by capital commitments as ranked by Private Equity International's PEI 300 ranking. After dropping to second behind KKR in the 2022 ranking, it regained the top spot in 2023, and retained it in 2024, before slipping to third in the 2025 list. The firm invests through minority investments, corporate partnerships, and industry consolidations, and occasionally start-up investments. The firm focuses on friendly investments in large capitalization companies. Blackstone has primarily relied on private equity funds, pools of committed capital from pension funds, insurance companies, endowments, fund of funds, high-net-worth individuals, sovereign wealth funds, and other institutional investors. From 1987 to its IPO in 2007, Blackstone invested approximately $20 billion in 109 private equity transactions. Blackstone's most notable investments include Allied Waste, AlliedBarton Security Services, Graham Packaging, Celanese, Nalco, HealthMarkets, Houghton Mifflin, American Axle, TRW Automotive, Catalent Pharma Solutions, Prime Hospitality, Legoland, Madame Tussauds, Luxury Resorts (LXR), Pinnacle Foods, Hilton Hotels Corporation, Motel 6, Apria Healthcare, Travelport, The Weather Channel (United States) and The PortAventura Resort. In 2009, Blackstone purchased Busch Entertainment (comprising the Sea World Parks, Busch Garden Parks and the two water parks). In 2020 it acquired Ancestry.com. In 2012, Blackstone acquired a controlling interest in Utah-based Vivint, Inc., a home automation, security, and energy company. Real estate Blackstone's most notable real estate investments have included QTS, EQ Office, Hilton Worldwide, Trizec Properties, Center Parcs UK, La Quinta Inns & Suites, Motel 6, Wyndham Worldwide, Southern Cross Healthcare and Vicinity Centres. The purchase and subsequent IPO of Southern Cross led to controversy in the UK. Part of the purchase involved splitting the business into a property company, NHP, and a nursing home business, which Blackstone claimed would become \"the leading company in the elderly care market\". In May 2011, Southern Cross, now independent, was almost bankrupt, jeopardizing 31,000 elderly residents in 750 care homes. It denied blame, although Blackstone was widely accused in the media for selling on the company with an unsustainable business model and crippled with an impossible sale and leaseback strategy. After the 2007–2010 subprime mortgage crisis in the United States, Blackstone Group LP bought more than $5.5 billion worth of multi-family homes to rent and be sold when the prices rise. In 2014, Blackstone sold Northern California office buildings for $3.5 billion. The buildings sold in San Francisco and Silicon Valley included 26 office buildings and two development parcels. In 2018, Blackstone's Danish partner North 360 made a purchase agreement on several hundred apartments in Frederiksberg, Denmark, with Frederiksberg Boligfond, a nonprofit housing organization Frederiksberg Municipality established in 1930. After resistance by residents and questions about the purchase agreement's legality, Blackstone withdrew from it in October 2019. On December 1, 2022, Blackstone restricted withdrawals from its $125-billion real estate investment fund BREIT (Blackstone Real Estate Investment Trust) due to a surge in redemption requests from investors. The move caused investor consternation and limited the ability to attract new capital for BREIT. In November 2024, Blackstone acquired a group of four retail buildings in Soho for approximately $200 million from ASB Real Estate Investments. This transaction marked the largest Manhattan retail deal by an investor in over three years, signaling a resurgence in the retail asset class. The properties, which house tenants such as Patagonia and Amiri, were purchased with the strategy of increasing revenue by bringing below-market leases up to current rates. The deal included buildings at 61 Crosby Street, 72-76 Greene Street, 465 Broadway, and 415 West Broadway. Marketable alternative asset management In 1990, Blackstone created a fund of hedge funds business to manage internal assets for Blackstone and its senior managers. This business evolved into Blackstone's marketable alternative asset management segment, which was opened to institutional investors. Among the investments included in this segment are funds of hedge funds, mezzanine funds, senior debt vehicles, proprietary hedge funds and closed-end mutual funds. In March 2008, Blackstone acquired GSO Capital Partners, a credit-oriented alternative asset manager, for $620 million in cash and stock and up to $310 million through an earnout over the next five years based on earnings targets. The combined entity created one of the largest credit platforms in the alternative asset management business, with over $21 billion under management. GSO was founded in 2005 by Bennett Goodman, Tripp Smith, and Doug Ostrover. The GSO team had previously managed the leveraged finance businesses at Donaldson, Lufkin & Jenrette and later Credit Suisse First Boston, after it acquired DLJ. Blackstone was an original investor in GSO's funds. After the acquisition, Blackstone merged GSO's operations with its existing debt investment operations. Controversies Warrantless disclosure of Motel 6 occupancies In separate cases in 2018 and 2019, the hotel chain Motel 6, owned by Blackstone, agreed to settle for $19.6 million for giving guest lists to U.S. Immigration and Customs Enforcement (ICE) without a warrant. Ancestry acquisition and data leaks In 2020, Blackstone acquired a majority stake in Ancestry.com, which controls access to millions of people's genetic data, heightening concern about Blackstone's data privacy practices. This data was disclosed to Blackstone, and it has aggressively defended itself against class action litigation relating to misuse of the data of people who did not consent to genetic testing but were affected through direct biological relations or other means of identification. Illegal child labor An investigation by the U.S. Department of Labor showed that more than 100 American children had been working illegally for Packers Sanitation Services Inc. (PSSI), a slaughterhouse cleaning firm owned by Blackstone. The investigation began after a Walnut Middle School teacher in Grand Island, Nebraska, reported a student with hydrochloric acid burns on his hands and knees to the Department of Labor. Under the Fair Labor Standards Act, the Labor Department fined PSSI $15,138 for each minor who was employed in breach of the law, totaling $1.5 million in civil money penalties. Deforestation of the Amazon rainforest Blackstone has invested in companies with links to the commercialization and deforestation of the Amazon rainforest. Business trends The key trends for Blackstone are (as of the financial year ending December 31)"
}