{
  "ticker": "BXP",
  "cik": "0001037540",
  "company_name": "BXP, Inc.",
  "corrected_name": "BXP, Inc.",
  "wiki_title_used": "BXP, Inc.",
  "exists": true,
  "raw_text": "BXP, Inc. (formerly Boston Properties, Inc.) is a publicly traded real estate investment trust which invests in premier workplaces in Boston, Los Angeles, New York City, San Francisco, Seattle, and Washington, D.C. As of December 31, 2023, the company owned or had interests in 188 commercial real estate properties, aggregating approximately 53.3 million net rentable square feet.\n\nHistory\nThe company was founded in 1970 by Mortimer B. Zuckerman and Edward H. Linde in Boston. In 1985, the company outbid Donald Trump to re-develop the New York Coliseum at Columbus Circle. However the company did not proceed with development and sold the property, it is now the site of the Time Warner Center. In 1986, the company completed 599 Lexington Avenue, its first development in New York City. In 1990, the company began construction of the NASA Headquarters. It was sold to Hana Financial Group in 2002.\nIn June 1997, the company became a public company via an initial public offering. In October 1997, the company acquired 100 East Pratt Street. In 1998, it acquired Embarcadero Center in San Francisco for about $1.22 billion and bought the Prudential Tower and The Shops at Prudential Center, both in Boston, for $519 million.\nIn 2000 and 2001, the company completed development of several office buildings in Reston Town Center. From 2002 to 2005, it built 901 New York Avenue NW in Washington, D.C. In June 2008, the company acquired the General Motors Building in New York City for $2.8 billion, the highest paid for an American office building.\nIn October 2010, the company acquired 200 Clarendon Street (formerly the John Hancock Tower) for $930 million. In 2012, the company partnered with Hines Interests Limited Partnership to develop the Salesforce Tower. By 2019, it had acquired 100% of the property.\n\nReferences\nExternal links\nOfficial website \nBusiness data for BXP, Inc.:",
  "clean_text": "BXP, Inc. (formerly Boston Properties, Inc.) is a publicly traded real estate investment trust which invests in premier workplaces in Boston, Los Angeles, New York City, San Francisco, Seattle, and Washington, D.C. As of December 31, 2023, the company owned or had interests in 188 commercial real estate properties, aggregating approximately 53.3 million net rentable square feet. History The company was founded in 1970 by Mortimer B. Zuckerman and Edward H. Linde in Boston. In 1985, the company outbid Donald Trump to re-develop the New York Coliseum at Columbus Circle. However the company did not proceed with development and sold the property, it is now the site of the Time Warner Center. In 1986, the company completed 599 Lexington Avenue, its first development in New York City. In 1990, the company began construction of the NASA Headquarters. It was sold to Hana Financial Group in 2002. In June 1997, the company became a public company via an initial public offering. In October 1997, the company acquired 100 East Pratt Street. In 1998, it acquired Embarcadero Center in San Francisco for about $1.22 billion and bought the Prudential Tower and The Shops at Prudential Center, both in Boston, for $519 million. In 2000 and 2001, the company completed development of several office buildings in Reston Town Center. From 2002 to 2005, it built 901 New York Avenue NW in Washington, D.C. In June 2008, the company acquired the General Motors Building in New York City for $2.8 billion, the highest paid for an American office building. In October 2010, the company acquired 200 Clarendon Street (formerly the John Hancock Tower) for $930 million. In 2012, the company partnered with Hines Interests Limited Partnership to develop the Salesforce Tower. By 2019, it had acquired 100% of the property."
}