{
  "ticker": "CAG",
  "cik": "0000023217",
  "company_name": "Conagra Brands",
  "corrected_name": "Conagra Brands",
  "wiki_title_used": "Conagra Brands",
  "exists": true,
  "raw_text": "Conagra Brands, Inc. (formerly ConAgra Foods) is an American consumer packaged goods holding company headquartered in Chicago, Illinois. Conagra makes and sells products under various brand names that are available in supermarkets, restaurants, and food service establishments. Based on its 2021 revenue, the company ranked 331st on the 2022 Fortune 500.\n\nHistory\n1919–1949: Founding and early history\nConagra was founded in September 1919 as Nebraska Consolidated Mills (NCM) by Alva Kinney. The company was a conglomerate of four grain milling companies headquartered in Grand Island, Nebraska. The company moved its headquarters to Omaha, Nebraska, in 1922 following the purchase of Updike Mill. That year, NCM posted a profit of $175,000, its first profit since its founding.\nIn 1941, the company opened a mill in Decatur, Alabama. It was NCM's first plant outside of Nebraska.\n\n1950–1970: Expansion and decline\nAfter researching new uses for its flour, NCM funded the establishment of the Duncan Hines brand of cake mixes in 1951 as a way to market more flour. It sold its Duncan Hines assets to Procter & Gamble in 1956. In 1957, NCM built its first mill outside the continental United States, constructing a plant in Puerto Rico. Conagra Brands would reacquire the Duncan Hines brand in 2018 through its acquisition of Pinnacle Foods, which had bought the brand from Procter & Gamble in 1997.\n\n1971–1999: Rebranding to ConAgra\nNCM changed its name to ConAgra in 1971. The name is a combination of the Latin words con (\"with\") and agrī  (\"soil\" or \"earth\"). It went public and began trading on the NYSE two years later. Losses suffered in 1974 from bad investments and commodities speculation had the company facing bankruptcy. ConAgra hired Pillsbury executive C. Michael Harper to be its chief operating officer in the fall of 1974 and tasked him with stabilizing the company.\nHarper began selling what he deemed to be unnecessary buildings and plots of land owned by the company, as well as entire divisions that did not align with ConAgra's new direction as a company that primarily dealt with basic food items. By 1976, now chief executive officer Harper, sold 25 assets and reduced the company debt by $35 million. In 1981, ConAgra's gross sales topped $1 billion for the first time and Harper was named Chairman.\nConAgra acquired approximately 200 companies over a 20-year period, including Banquet Foods in 1980, Peavey in 1982, Armour and Company in 1983, Monfort in 1987, Lamb Weston in 1988, and Beatrice Foods in 1990. The acquisitions of Monfort and Beatrice made ConAgra the world's largest meatpacker and second-largest food processor, respectively. During this time, the company created the Healthy Choice label, to market a line of frozen dinners.\nBy the mid-1980s, ConAgra was vertically integrated across the food supply chain, selling fertilizer, tires and clothing; with companies for animal and crop harvesting, and for exporting and trading.\nConAgra was found guilty of tampering with scales when measuring the weight of incoming birds from Alabama chicken farmers in 1989 and settled a class action suit in 1995 levied against ConAgra, Hormel Foods, and Delta Pride Catfish for conspiring with other companies to fix the price of catfish. Two years later, ConAgra pleaded guilty in a federal case to spraying water on grain in its Peavey unit, fraudulently increasing the grain's weight to boost profits, and bribing federal officials. The company was charged $8.3 million for the case. It also settled a civil suit with farmers in Indiana for $2 million.\nDuring this period, ConAgra was also criticized for some of its business practices, including the demolition of the Jobbers Canyon Historic District to build the company's new headquarters, the company's use of pesticides, sanitary and labor practices in its meat processing divisions and the pricing of consumer goods. In 1987, Harper threatened to move ConAgra's headquarters out of Omaha unless the city approved the demolition of Jobbers Canyon, a warehouse district located along the Missouri River. The district had been declared a historical site and its demolition was opposed by historical preservation groups, but the city ultimately capitulated, razing the district in 1989. As of 1994, it was the largest destruction of a historic site in the United States.\n\nBy 1992, ConAgra's annual sales had topped $21 billion. The company continued to make acquisitions and launch product lines throughout the 1990s, including Marie Callender's frozen product line in 1994 and GoodMark Foods in 1998. Also in 1998, ConAgra acquired several brands from RJR Nabisco, including Egg Beaters and Nabisco's table spread unit, which included margarines under the Parkay and Blue Bonnet brands.\n\n2000–2015: From meatpacking to packaged goods\nConAgra rebranded as ConAgra Foods in 2000. The first half of the ensuing decade was marked by the sale of the company's fresh and refrigerated meat units, beginning with the sale of its majority stake in Swift & Company to Hicks, Muse, Tate & Furst and Booth Creek Management in 2002. The Swift sale ended ConAgra's involvement in the fresh beef and pork industries. The same year, ConAgra joined a coalition of food producers and trade associations, including PepsiCo, General Mills, and CropLife International to defeat Oregon Ballot Measure 27, which would have required the labeling of genetically modified food in the state. \nIn July 2004, six people were killed in a shooting inside the ConAgra Foods plant in Kansas City, Kansas.\nIn 2006, the company sold its refrigerated meats divisions, including the Butterball, Eckrich, and Armour brands, to Smithfield Foods for $575 million. The same year, the company closed its Hunt-Wesson operations in Irvine, California, and split the unit between Omaha and Naperville, Illinois.\nIn 2008, ConAgra purchased Watts Brothers Farms from Don Watts and purchased Ralcorp in 2012. Also in 2012, the company joined with PepsiCo, Nestlé and other food firms to defeat Proposition 37, a California ballot measure which would have mandated the labeling of genetically modified foods. The following year, Conagra joined with Walmart and approximately 20 other companies to seek the establishment of national labeling standards for genetically modified foods. In 2012, ConAgra acquired the P.F. Chang's and Bertolli licensed brands from Unilever. In 2014, ConAgra acquired TaiMei Potato Industry Limited, an Inner Mongolian potato processor. ConAgra sold Ralcorp to TreeHouse Foods for $2.7 billion in 2015 and purchased Blake's All Natural Foods the same year. ConAgra spun off Lamb Weston into an independent company in 2016.\nDuring the 2000s and 2010s, ConAgra faced scrutiny for its environmental practices.\nOn January 7, 2014, a California Superior Court found that ConAgra and its co-defendants were liable in creating a public nuisance due to lead-based paint the companies sold. Ten local governments in California filed the suit and the court ordered Conagra, NL Industries and Sherwin-Williams to pay $1.15 billion to remove or abate the lead in homes located in those cities and counties. ConAgra was named a defendant in the suit as it had assumed the liabilities of W.P. Fuller & Co. following a series of mergers; after multiple appeals, the company reached a settlement amount of $305 million in 2019.\nConAgra also drew attention for its labor and health practices. A company plant in Colorado had been cited numerous times from 1999 to 2002 for violating worker safety. In May 2003, ConAgra and its subsidiary Gilroy Foods agreed to pay $1.5 million to settle charges of hiring discrimination brought by the Equal Employment Opportunity Commission (EEOC). The charges involved a July 1999 Teamsters strike at a Gilroy Foods plant in King City, California, then owned by Basic Vegetable Products LP but later purchased by ConAgra. In August 2001, the company and union negotiated an end to the two-year strike with a new contract, but the recall of workers excluded some workers who were on leave at the time of the purchase including those out due to work injury or pregnancy. Others were denied jobs due to a history of previous injury or illness, despite their having no restrictions on returning to work, according to the EEOC. Also according to the EEOC, most of the 39 workers who were excluded from the recall process had been working at the plant for \"10 to 20 years, some even longer,\" and were primarily Hispanic and female.\n\n2016–present: Relocation\nIn 2016, ConAgra cut 1,500 jobs, transferred its headquarters to Chicago, Illinois, and changed its name to \"Conagra Brands\".\nOn September 22, 2017, Conagra announced that it was acquiring Angie's Artisan Treats, maker of Angie's Boomchickapop popcorn. The company announced the acquisition was completed on October 23, 2017.\nOn June 27, 2018, Conagra Brands announced the acquisition of Pinnacle Foods for $8.1 billion. The acquisition closed on October 26, 2018.\nOn December 8, 2020, Conagra announced that it was selling the Peter Pan brand to Post Holdings. The company announced the transaction was completed on January 25, 2021.\nIn June 2021, Conagra announced its commitment to source 100% cage-free eggs by 2024.\nIn February 2022, ConAgra paid $18 million to settle a class action from over 8,000 food-processing workers in California who argued that the company had violated California wage law.\n\nProducts\nConagra produces a wide array of food products including cooking oil, frozen dinners, hot cocoa, hot dogs and peanut butter. Major brands include Act II, Hunt's, Healthy Choice, Marie Callender's, Udi's Gluten-Free, Orville Redenbacher's, Slim Jim, Reddi-wip, Egg Beaters, Pam, Angie's Boom Chicka Pop, Hebrew National, Chef Boyardee, and Bertolli ready meals.\n\nCompany overview\nAs of 2025, Conagra had 38 manufacturing facilities in the United States and employed approximately 18,300 people. It had net sales of $11.6 billion in fiscal year 2025. The company is a member of the Fortune 500. It is led by president and chief executive officer Sean M. Connolly.\n\nProduct incidents\n2002 E. coli outbreak\nConagra recalled 19 million pounds of ground beef in July 2002 with E. coli bacterial contamination. It was the second-largest recall up to that time. That meat was linked to the illnesses of 19 people in six Western and Midwestern states.\n\n2006–2007 Salmonella outbreak\nIn February 2007, Conagra recalled jars of Peter Pan and Great Value brand peanut butter with the product code \"2111\" on the lid, because they were linked to a Salmonella outbreak. Ultimately, the Centers for Disease Control and Prevention (CDC) documented more than 628 individuals who were stricken with Salmonella poisoning in 47 states that could be traced back to Peter Pan and Great Value peanut butter. Of those, 20% were hospitalized, according to the CDC, which reported no deaths associated with the outbreak.\nSince Peter Pan (but not Great Value) is only made at one plant, the recall included all Peter Pan jars sold in the U.S. between May 2006 and February 2007. In May 2015, the company agreed to plead guilty to releasing products tainted with Salmonella into interstate commerce. Sentencing was delayed by U.S. District Court Judge Willie Louis Sands, who ordered nationwide newspaper advertisements searching for victims of the outbreak so the government could supply Victim Impact Statements for inclusion in the pre-sentence report.\n\nDiacetyl\nOn September 4, 2007, the Flavor and Extract Manufacturers Association recommended reduction of diacetyl in butter-like flavorings, such as those used in popcorn, due to cases of the potentially fatal disease bronchiolitis obliterans or \"Popcorn Workers's Lung\" appearing among plant workers exposed to diacetyl fumes, as well as in one case that involved a popcorn consumer. The next day ConAgra Foods announced that it would soon remove diacetyl from its Jiffy Pop and Orville Redenbacher's popcorn products.\n\n2007 Salmonella outbreak\nIn October 2007, Conagra asked stores to pull the Banquet and generic brand chicken and turkey pot pies due to 152 cases of Salmonella poisoning in 31 states being linked to the consumption of Conagra pot pies, with 20 people hospitalized. At that time, both the USDA and Conagra decided in favor of a consumer advisory and against a recall. ConAgra said the issue stemmed from pies not being cooked thoroughly in older microwaves, and that the package's heating instructions would be changed to reflect different microwaves. However, the plant in Marshall, Missouri, where the pot pies were manufactured closed on October 11 as well.\nBy October 12, a full recall was announced, affecting all varieties of frozen pot pies sold under the brands Banquet, Albertson's, Food Lion, Great Value, Hill Country Fare, Kirkwood, Kroger, Meijer, and Western Family. The recalled pot pies included all varieties in 7-oz. single-serving packages bearing the number P-9 or \"Est. 1059\" printed on the side of the package. By October 14, 174 cases of Salmonella poisoning in 32 states were linked to consumption of the contaminated ConAgra pot pies, with 33 people hospitalized. Public interest groups criticized Conagra for the delay in issuing the recall, a decision which Conagra defended by saying the recall was a precaution. At the time of the recall, the USDA had still not identified the source of the Salmonella contamination.\nOn October 17, the Colorado Department of Public Health reported that \"An investigation by the Centers for Disease Control and Prevention and state public health departments involved a large cluster of illnesses caused by Salmonella that identified these products\" and stated that, \"Nationally, at least 211 individuals from 35 states have become ill.\"  From January 1 through December 31, 2007, the CDC identified a total of 401 cases in 41 states.\n\nSee also\nImpact of the COVID-19 pandemic on the meat industry in the United States\n2009 ConAgra Foods Plant explosion\n\nReferences\nExternal links\n\nOfficial website \n\"Key dates in Conagra Brands' 100-year history\". Omaha World Herald. October 6, 2019. Retrieved March 22, 2023.\nBusiness data for ConAgra Foods:",
  "clean_text": "Conagra Brands, Inc. (formerly ConAgra Foods) is an American consumer packaged goods holding company headquartered in Chicago, Illinois. Conagra makes and sells products under various brand names that are available in supermarkets, restaurants, and food service establishments. Based on its 2021 revenue, the company ranked 331st on the 2022 Fortune 500. History 1919–1949: Founding and early history Conagra was founded in September 1919 as Nebraska Consolidated Mills (NCM) by Alva Kinney. The company was a conglomerate of four grain milling companies headquartered in Grand Island, Nebraska. The company moved its headquarters to Omaha, Nebraska, in 1922 following the purchase of Updike Mill. That year, NCM posted a profit of $175,000, its first profit since its founding. In 1941, the company opened a mill in Decatur, Alabama. It was NCM's first plant outside of Nebraska. 1950–1970: Expansion and decline After researching new uses for its flour, NCM funded the establishment of the Duncan Hines brand of cake mixes in 1951 as a way to market more flour. It sold its Duncan Hines assets to Procter & Gamble in 1956. In 1957, NCM built its first mill outside the continental United States, constructing a plant in Puerto Rico. Conagra Brands would reacquire the Duncan Hines brand in 2018 through its acquisition of Pinnacle Foods, which had bought the brand from Procter & Gamble in 1997. 1971–1999: Rebranding to ConAgra NCM changed its name to ConAgra in 1971. The name is a combination of the Latin words con (\"with\") and agrī (\"soil\" or \"earth\"). It went public and began trading on the NYSE two years later. Losses suffered in 1974 from bad investments and commodities speculation had the company facing bankruptcy. ConAgra hired Pillsbury executive C. Michael Harper to be its chief operating officer in the fall of 1974 and tasked him with stabilizing the company. Harper began selling what he deemed to be unnecessary buildings and plots of land owned by the company, as well as entire divisions that did not align with ConAgra's new direction as a company that primarily dealt with basic food items. By 1976, now chief executive officer Harper, sold 25 assets and reduced the company debt by $35 million. In 1981, ConAgra's gross sales topped $1 billion for the first time and Harper was named Chairman. ConAgra acquired approximately 200 companies over a 20-year period, including Banquet Foods in 1980, Peavey in 1982, Armour and Company in 1983, Monfort in 1987, Lamb Weston in 1988, and Beatrice Foods in 1990. The acquisitions of Monfort and Beatrice made ConAgra the world's largest meatpacker and second-largest food processor, respectively. During this time, the company created the Healthy Choice label, to market a line of frozen dinners. By the mid-1980s, ConAgra was vertically integrated across the food supply chain, selling fertilizer, tires and clothing; with companies for animal and crop harvesting, and for exporting and trading. ConAgra was found guilty of tampering with scales when measuring the weight of incoming birds from Alabama chicken farmers in 1989 and settled a class action suit in 1995 levied against ConAgra, Hormel Foods, and Delta Pride Catfish for conspiring with other companies to fix the price of catfish. Two years later, ConAgra pleaded guilty in a federal case to spraying water on grain in its Peavey unit, fraudulently increasing the grain's weight to boost profits, and bribing federal officials. The company was charged $8.3 million for the case. It also settled a civil suit with farmers in Indiana for $2 million. During this period, ConAgra was also criticized for some of its business practices, including the demolition of the Jobbers Canyon Historic District to build the company's new headquarters, the company's use of pesticides, sanitary and labor practices in its meat processing divisions and the pricing of consumer goods. In 1987, Harper threatened to move ConAgra's headquarters out of Omaha unless the city approved the demolition of Jobbers Canyon, a warehouse district located along the Missouri River. The district had been declared a historical site and its demolition was opposed by historical preservation groups, but the city ultimately capitulated, razing the district in 1989. As of 1994, it was the largest destruction of a historic site in the United States. By 1992, ConAgra's annual sales had topped $21 billion. The company continued to make acquisitions and launch product lines throughout the 1990s, including Marie Callender's frozen product line in 1994 and GoodMark Foods in 1998. Also in 1998, ConAgra acquired several brands from RJR Nabisco, including Egg Beaters and Nabisco's table spread unit, which included margarines under the Parkay and Blue Bonnet brands. 2000–2015: From meatpacking to packaged goods ConAgra rebranded as ConAgra Foods in 2000. The first half of the ensuing decade was marked by the sale of the company's fresh and refrigerated meat units, beginning with the sale of its majority stake in Swift & Company to Hicks, Muse, Tate & Furst and Booth Creek Management in 2002. The Swift sale ended ConAgra's involvement in the fresh beef and pork industries. The same year, ConAgra joined a coalition of food producers and trade associations, including PepsiCo, General Mills, and CropLife International to defeat Oregon Ballot Measure 27, which would have required the labeling of genetically modified food in the state. In July 2004, six people were killed in a shooting inside the ConAgra Foods plant in Kansas City, Kansas. In 2006, the company sold its refrigerated meats divisions, including the Butterball, Eckrich, and Armour brands, to Smithfield Foods for $575 million. The same year, the company closed its Hunt-Wesson operations in Irvine, California, and split the unit between Omaha and Naperville, Illinois. In 2008, ConAgra purchased Watts Brothers Farms from Don Watts and purchased Ralcorp in 2012. Also in 2012, the company joined with PepsiCo, Nestlé and other food firms to defeat Proposition 37, a California ballot measure which would have mandated the labeling of genetically modified foods. The following year, Conagra joined with Walmart and approximately 20 other companies to seek the establishment of national labeling standards for genetically modified foods. In 2012, ConAgra acquired the P.F. Chang's and Bertolli licensed brands from Unilever. In 2014, ConAgra acquired TaiMei Potato Industry Limited, an Inner Mongolian potato processor. ConAgra sold Ralcorp to TreeHouse Foods for $2.7 billion in 2015 and purchased Blake's All Natural Foods the same year. ConAgra spun off Lamb Weston into an independent company in 2016. During the 2000s and 2010s, ConAgra faced scrutiny for its environmental practices. On January 7, 2014, a California Superior Court found that ConAgra and its co-defendants were liable in creating a public nuisance due to lead-based paint the companies sold. Ten local governments in California filed the suit and the court ordered Conagra, NL Industries and Sherwin-Williams to pay $1.15 billion to remove or abate the lead in homes located in those cities and counties. ConAgra was named a defendant in the suit as it had assumed the liabilities of W.P. Fuller & Co. following a series of mergers; after multiple appeals, the company reached a settlement amount of $305 million in 2019. ConAgra also drew attention for its labor and health practices. A company plant in Colorado had been cited numerous times from 1999 to 2002 for violating worker safety. In May 2003, ConAgra and its subsidiary Gilroy Foods agreed to pay $1.5 million to settle charges of hiring discrimination brought by the Equal Employment Opportunity Commission (EEOC). The charges involved a July 1999 Teamsters strike at a Gilroy Foods plant in King City, California, then owned by Basic Vegetable Products LP but later purchased by ConAgra. In August 2001, the company and union negotiated an end to the two-year strike with a new contract, but the recall of workers excluded some workers who were on leave at the time of the purchase including those out due to work injury or pregnancy. Others were denied jobs due to a history of previous injury or illness, despite their having no restrictions on returning to work, according to the EEOC. Also according to the EEOC, most of the 39 workers who were excluded from the recall process had been working at the plant for \"10 to 20 years, some even longer,\" and were primarily Hispanic and female. 2016–present: Relocation In 2016, ConAgra cut 1,500 jobs, transferred its headquarters to Chicago, Illinois, and changed its name to \"Conagra Brands\". On September 22, 2017, Conagra announced that it was acquiring Angie's Artisan Treats, maker of Angie's Boomchickapop popcorn. The company announced the acquisition was completed on October 23, 2017. On June 27, 2018, Conagra Brands announced the acquisition of Pinnacle Foods for $8.1 billion. The acquisition closed on October 26, 2018. On December 8, 2020, Conagra announced that it was selling the Peter Pan brand to Post Holdings. The company announced the transaction was completed on January 25, 2021. In June 2021, Conagra announced its commitment to source 100% cage-free eggs by 2024. In February 2022, ConAgra paid $18 million to settle a class action from over 8,000 food-processing workers in California who argued that the company had violated California wage law. Products Conagra produces a wide array of food products including cooking oil, frozen dinners, hot cocoa, hot dogs and peanut butter. Major brands include Act II, Hunt's, Healthy Choice, Marie Callender's, Udi's Gluten-Free, Orville Redenbacher's, Slim Jim, Reddi-wip, Egg Beaters, Pam, Angie's Boom Chicka Pop, Hebrew National, Chef Boyardee, and Bertolli ready meals. Company overview As of 2025, Conagra had 38 manufacturing facilities in the United States and employed approximately 18,300 people. It had net sales of $11.6 billion in fiscal year 2025. The company is a member of the Fortune 500. It is led by president and chief executive officer Sean M. Connolly. Product incidents 2002 E. coli outbreak Conagra recalled 19 million pounds of ground beef in July 2002 with E. coli bacterial contamination. It was the second-largest recall up to that time. That meat was linked to the illnesses of 19 people in six Western and Midwestern states. 2006–2007 Salmonella outbreak In February 2007, Conagra recalled jars of Peter Pan and Great Value brand peanut butter with the product code \"2111\" on the lid, because they were linked to a Salmonella outbreak. Ultimately, the Centers for Disease Control and Prevention (CDC) documented more than 628 individuals who were stricken with Salmonella poisoning in 47 states that could be traced back to Peter Pan and Great Value peanut butter. Of those, 20% were hospitalized, according to the CDC, which reported no deaths associated with the outbreak. Since Peter Pan (but not Great Value) is only made at one plant, the recall included all Peter Pan jars sold in the U.S. between May 2006 and February 2007. In May 2015, the company agreed to plead guilty to releasing products tainted with Salmonella into interstate commerce. Sentencing was delayed by U.S. District Court Judge Willie Louis Sands, who ordered nationwide newspaper advertisements searching for victims of the outbreak so the government could supply Victim Impact Statements for inclusion in the pre-sentence report. Diacetyl On September 4, 2007, the Flavor and Extract Manufacturers Association recommended reduction of diacetyl in butter-like flavorings, such as those used in popcorn, due to cases of the potentially fatal disease bronchiolitis obliterans or \"Popcorn Workers's Lung\" appearing among plant workers exposed to diacetyl fumes, as well as in one case that involved a popcorn consumer. The next day ConAgra Foods announced that it would soon remove diacetyl from its Jiffy Pop and Orville Redenbacher's popcorn products. 2007 Salmonella outbreak In October 2007, Conagra asked stores to pull the Banquet and generic brand chicken and turkey pot pies due to 152 cases of Salmonella poisoning in 31 states being linked to the consumption of Conagra pot pies, with 20 people hospitalized. At that time, both the USDA and Conagra decided in favor of a consumer advisory and against a recall. ConAgra said the issue stemmed from pies not being cooked thoroughly in older microwaves, and that the package's heating instructions would be changed to reflect different microwaves. However, the plant in Marshall, Missouri, where the pot pies were manufactured closed on October 11 as well. By October 12, a full recall was announced, affecting all varieties of frozen pot pies sold under the brands Banquet, Albertson's, Food Lion, Great Value, Hill Country Fare, Kirkwood, Kroger, Meijer, and Western Family. The recalled pot pies included all varieties in 7-oz. single-serving packages bearing the number P-9 or \"Est. 1059\" printed on the side of the package. By October 14, 174 cases of Salmonella poisoning in 32 states were linked to consumption of the contaminated ConAgra pot pies, with 33 people hospitalized. Public interest groups criticized Conagra for the delay in issuing the recall, a decision which Conagra defended by saying the recall was a precaution. At the time of the recall, the USDA had still not identified the source of the Salmonella contamination. On October 17, the Colorado Department of Public Health reported that \"An investigation by the Centers for Disease Control and Prevention and state public health departments involved a large cluster of illnesses caused by Salmonella that identified these products\" and stated that, \"Nationally, at least 211 individuals from 35 states have become ill.\" From January 1 through December 31, 2007, the CDC identified a total of 401 cases in 41 states."
}