{
  "ticker": "CAH",
  "cik": "0000721371",
  "company_name": "Cardinal Health",
  "corrected_name": "Cardinal Health",
  "wiki_title_used": "Cardinal Health",
  "exists": true,
  "raw_text": "Cardinal Health, Inc. is an American multinational health care services company, and the 15th highest revenue generating company in the United States. Headquartered in Dublin, Ohio, the company specializes in the distribution of pharmaceuticals and medical products, serving more than 100,000 locations. The company also manufactures medical and surgical product, including gloves, surgical apparel, and fluid management products. In addition, it operates one of the largest networks of radiopharmacies in the U.S. Cardinal Health provides medical products to over 75 percent of hospitals in the United States.\n\nHistory\nFounded in 1971 as Cardinal Foods by Robert D. Walter, the company was initially a food wholesaler. After acquiring the Bailey Drug Company in 1979, it began whole selling drugs. The company went public on the NASDAQ stock exchange in 1983.\nIn 1988, Walter sold Cardinal Health's food operations to Roundy's. From 1991 to 1996, the company's sales grew from $1.2 billion to $8.9 billion. The company changed its name to Cardinal Health in 1994, and became the third-largest pharmaceutical wholesaler in the United States.\n\n2000–2019\nR. Kerry Clark, a former executive and vice chairman at Procter & Gamble, was appointed president and CEO in April 2006, with Robert D. Walter retaining Chairmanship of the board. In September 2008, the company announced Clark and Walter would retire and George S. Barrett would become the chairman and CEO.\nIn 2009, Cardinal Health completed the spin-off of its clinical and medical products businesses into an independent medical technology company called CareFusion with David Schlotterbeck as CEO. Cardinal Health is now traded on the NYSE under symbol CAH. \nIn December 2013, it was announced that Cardinal Health would partner with CVS Caremark to form a generic drug sourcing operation in the United States. The venture was named Red Oak Sourcing and began operations in July 2014.\nBetween 2014 and 2016, Cardinal, alongside McKesson Corporation, and AmerisourceBergen, spent $13 million lobbying Congress to pass Congressman Tom Marino's \"Ensuring Patient Access and Effective Drug Enforcement Act\". The bill, which increases the burden of proof enforcers need to show against drug distributors, was signed into law by President Barack Obama in April 2016.\nIn January 2018, Michael Kaufmann assumed the role of CEO after serving as CFO of the company.\n\nOpioid lawsuits\nIn 2019, Cardinal was one of several drug distributors named in lawsuits related to the opioid crisis in the US. In July 2021, Cardinal Health and other pharmaceutical companies agreed to participate in a $26 billion settlement. Cardinal will pay $6.4 billion over 18 years.\nIn May 2020, Oklahoma Attorney General Mike Hunter sued Cardinal Health in Bryan County District Court, Oklahoma. The lawsuit alleged that the company's actions helped fuel Oklahoma's opioid crisis. The suit was filed along with lawsuits against AmerisourceBergen and McKesson, and the three lawsuits allege that the three companies provided \"enough opioids to Bryan County that every adult resident there could have had 144 hydrocodone tablets.\"\n\n2020–present\nAs of August 2021, it is ranked 14 on the Fortune 500 list with FY2020 annual revenue of $152.9 billion. The firm employs 57,000 people worldwide.\n\nAcquisitions\nIn 1995, Medicine Shoppe International, the country's largest franchiser of retail pharmacies, was acquired. The merger represented the first non-distribution acquisition by Cardinal Health.\nIn 1996, Cardinal Health acquired Pyxis Corporation, a company that developed automated pill dispensers for hospitals, for $867 million.\nIn 1997, Cardinal Health planned to purchase Bergen Brunswig Corp., to which McKesson Corporation responded with a bid to purchase Amerisource. Instead, Amerisource and Bergen merged into AmerisourceBergen. Later that year, Cardinal Health completed the acquisition of Owen Healthcare, the second-largest provider of pharmacy management services in the U.S. at the time.\nIn 1999, the firm acquired the Chicago-based medical products manufacturer and distributor, Allegiance Healthcare (formerly a division of Baxter Healthcare). In 2001, the company acquired Bindley Western Industries, a wholesale distributor of pharmaceuticals based in Indianapolis.\nIn April 2006, Cardinal Health purchased Niagara Falls-based ParMed Pharmaceuticals for $40.1 million. In June 2007, the firm announced the completion of a tender offer for VIASYS Healthcare.\nIn June 2010, Cardinal Health announced plans to purchase Healthcare Solutions Holding, a specialty pharmaceutical services company, for $517 million. In December 2010, the company acquired Kinray, an independent pharmaceutical wholesaler, increasing Cardinal Health's presence in the independent pharmacy market by 40 percent. From 2010 to 2014, Cardinal Health acquired 18 companies including Yong Yu, a Chinese drug distributor. Cardinal sold Yong Yu in 2017 to Shanghai Pharmaceuticals Holding Co. Ltd. for $1.2 billion. \nIn July 2014, Cardinal Health and CVS formed Red Oak Sourcing, the largest generic drug sourcing operation in the United States. The companies started buying generic drugs around the world to sell in U.S. markets.\nIn March 2015, Cardinal Health signed an agreement to acquire Johnson & Johnson's Cordis (medical) division, a cardiology and endovascular device manufacturer, for $1.94 billion. The acquisition was completed on October 4, 2015. Cardinal sold the division in August 2021 to Hellman & Friedman, a private equity firm, for $1 billion.\nIn April 2017, Cardinal Health announced the plan to acquire the patient product portfolio from Medtronic for $6.1 billion. The acquisition was completed on July 30, 2017.\nIn November 2024, Cardinal Health announced the plan to acquire Advanced Diabetes Supply Group (ADSG), a leading national direct-to-patient provider of diabetes medical supplies, for about $1.1 billion with plans to merge the company into its at-Home Solutions business.The at-Home Solutions business includes Edgepark Medical Supplies of Twinsburg, Ohio and United States Medical Supply (US MED) of Doral, Florida. The acquisition was complete by April 2024.\nIn August 2025, Cardinal Health announced that it would acquire a 75% stake in Solaris Health, the largest urology management services organization (MSO) in the United States, for $1.9 billion in cash.\n\nControversy\nRole in the Opioid epidemic\nMultiple legal settlements have demonstrated Cardinal Health's role in the US Opioid epidemic, though the company never admitted wrongdoing:\n\nDecember 2016: Cardinal Health settled for $44 million for violations of the Controlled Substances Act brought in allegations from United States Attorneys in districts from Maryland, New York, Florida and Washington.\nJuly 2021: Cardinal Health agreed to pay $6.4 billion to settle thousands of US lawsuits. They were one of four companies to pay $26 billion, including Johnson & Johnson, AmerisourceBergen and McKesson.\nMay 2022: Settled a derivative suit on behalf of shareholders for $124 million.\nAugust 2024: Settlement with various health plans including insurers and third-party payers for $92.7 million.\nAugust 2024: Settlement with the City of Baltimore for $152.5 million.\n\nRestatements\nIn September 2004, Cardinal Health announced plans to restate past results for fiscal 2001, 2002, 2003, and the first three quarters of 2004 downward, after an accounting review and an ongoing federal investigation. In 2005, in connection with the Audit Committee's conclusions reached in September and October 2004, the company made certain reclassification and restatement adjustments to its fiscal 2004 and prior historical consolidated financial statements. According to The Wall Street Journal, \"Analysts called the restatement decision troubling, yet limited in scope.\"\n\nFDA action\nIn August 2006, Cardinal Health ceased production of its Alaris SE infusion pump after approximately 1300 units were seized by the United States Food and Drug Administration (FDA). In February 2007, Cardinal Health signed a consent decree with the FDA which promised procedures to guarantee the safety of the Alaris SE. After FDA inspections, Cardinal Health entered into a further consent agreement with the FDA in 2009.\n\nDEA investigation into Oxycodone diversion\nIn 2008, Cardinal Health agreed to pay $34 million in civil penalties to settle DEA allegations that it failed to report suspicious orders of hydrocodone. The fine followed a 10-month DEA suspension of a Lakeland, Florida distribution facility and two others in New Jersey and Washington. On February 2, 2012, the Drug Enforcement Administration again suspended the license of the firm's Lakeland distribution center to distribute controlled substances on charges that it had allowed four Florida pharmacies to purchase excessive amounts of controlled substances, in particular oxycodone.\nCardinal Health obtained a restraining order against the suspension, but the suspension was upheld on February 29 by a Federal district court because the court agreed with the DEA that Cardinal Health's activities represented an \"imminent danger to the public.\" The company stated that it blocked two of the pharmacies, (Brooks Pharmacy in Bonita Springs, Florida, and Gulf Coast Medical in Panama City, Florida), and notified the corporate owners of the two pharmacies that were part of national chains, two CVS stores in Sanford, Florida.\nIn February 2012, Joseph Rannazzisi, chief of the Drug Enforcement Administration’s Office of Diversion Control, issued immediate suspension orders against Cardinal's supply of oxycodone to suspected pill mills. These orders were filed after Deputy Attorney General James M. Cole met with Rannazzisi to ask if he had met with Cardinal about the investigation. Cole stated that he believed “it made good sense to listen to what Cardinal had to say” regarding the investigation. That year, Cardinal and the DEA reached a settlement that suspended Cardinal's facility in Lakeland, Florida from selling pain killers or other drugs for two years. In 2016, Cardinal was fined $44 million for after the investigation concluded.\nIn January 2022, Cardinal Health, Johnson & Johnson, McKesson, and AmerisourceBergen agreed to pay $26 billion to settle with all but five of the states suing them. Had the states gone to court, the companies could have faced up to $95 billion in penalties.\n\nFinances\nAnnual financial statistics are displayed below:\n\nCardinal Health Foundation\nThe Cardinal Health Foundation is the charitable arm of Cardinal Health. The company makes annual product donations of over $9 million through international relief organizations and provides up to $1,000 in matching funds for every Cardinal Health employee that makes a charitable donation. In 2008, the foundation established its E3 Grant Program. Over the past seven years, the Foundation has invested more than $7.15 million in funding to 241 hospitals, health systems or other health-related organizations.\nCardinal Health also supports organizations such as Ronald McDonald House Charities, and was named Benefactor of the Year at the 2011 Corporate Caring Awards. In 2015, the foundation contributed $3 million to the Solutions for Patient Safety project, which has raised over $11 million nationally for efforts to improve safety initiatives in children's hospitals.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Cardinal Health, Inc.:",
  "clean_text": "Cardinal Health, Inc. is an American multinational health care services company, and the 15th highest revenue generating company in the United States. Headquartered in Dublin, Ohio, the company specializes in the distribution of pharmaceuticals and medical products, serving more than 100,000 locations. The company also manufactures medical and surgical product, including gloves, surgical apparel, and fluid management products. In addition, it operates one of the largest networks of radiopharmacies in the U.S. Cardinal Health provides medical products to over 75 percent of hospitals in the United States. History Founded in 1971 as Cardinal Foods by Robert D. Walter, the company was initially a food wholesaler. After acquiring the Bailey Drug Company in 1979, it began whole selling drugs. The company went public on the NASDAQ stock exchange in 1983. In 1988, Walter sold Cardinal Health's food operations to Roundy's. From 1991 to 1996, the company's sales grew from $1.2 billion to $8.9 billion. The company changed its name to Cardinal Health in 1994, and became the third-largest pharmaceutical wholesaler in the United States. 2000–2019 R. Kerry Clark, a former executive and vice chairman at Procter & Gamble, was appointed president and CEO in April 2006, with Robert D. Walter retaining Chairmanship of the board. In September 2008, the company announced Clark and Walter would retire and George S. Barrett would become the chairman and CEO. In 2009, Cardinal Health completed the spin-off of its clinical and medical products businesses into an independent medical technology company called CareFusion with David Schlotterbeck as CEO. Cardinal Health is now traded on the NYSE under symbol CAH. In December 2013, it was announced that Cardinal Health would partner with CVS Caremark to form a generic drug sourcing operation in the United States. The venture was named Red Oak Sourcing and began operations in July 2014. Between 2014 and 2016, Cardinal, alongside McKesson Corporation, and AmerisourceBergen, spent $13 million lobbying Congress to pass Congressman Tom Marino's \"Ensuring Patient Access and Effective Drug Enforcement Act\". The bill, which increases the burden of proof enforcers need to show against drug distributors, was signed into law by President Barack Obama in April 2016. In January 2018, Michael Kaufmann assumed the role of CEO after serving as CFO of the company. Opioid lawsuits In 2019, Cardinal was one of several drug distributors named in lawsuits related to the opioid crisis in the US. In July 2021, Cardinal Health and other pharmaceutical companies agreed to participate in a $26 billion settlement. Cardinal will pay $6.4 billion over 18 years. In May 2020, Oklahoma Attorney General Mike Hunter sued Cardinal Health in Bryan County District Court, Oklahoma. The lawsuit alleged that the company's actions helped fuel Oklahoma's opioid crisis. The suit was filed along with lawsuits against AmerisourceBergen and McKesson, and the three lawsuits allege that the three companies provided \"enough opioids to Bryan County that every adult resident there could have had 144 hydrocodone tablets.\" 2020–present As of August 2021, it is ranked 14 on the Fortune 500 list with FY2020 annual revenue of $152.9 billion. The firm employs 57,000 people worldwide. Acquisitions In 1995, Medicine Shoppe International, the country's largest franchiser of retail pharmacies, was acquired. The merger represented the first non-distribution acquisition by Cardinal Health. In 1996, Cardinal Health acquired Pyxis Corporation, a company that developed automated pill dispensers for hospitals, for $867 million. In 1997, Cardinal Health planned to purchase Bergen Brunswig Corp., to which McKesson Corporation responded with a bid to purchase Amerisource. Instead, Amerisource and Bergen merged into AmerisourceBergen. Later that year, Cardinal Health completed the acquisition of Owen Healthcare, the second-largest provider of pharmacy management services in the U.S. at the time. In 1999, the firm acquired the Chicago-based medical products manufacturer and distributor, Allegiance Healthcare (formerly a division of Baxter Healthcare). In 2001, the company acquired Bindley Western Industries, a wholesale distributor of pharmaceuticals based in Indianapolis. In April 2006, Cardinal Health purchased Niagara Falls-based ParMed Pharmaceuticals for $40.1 million. In June 2007, the firm announced the completion of a tender offer for VIASYS Healthcare. In June 2010, Cardinal Health announced plans to purchase Healthcare Solutions Holding, a specialty pharmaceutical services company, for $517 million. In December 2010, the company acquired Kinray, an independent pharmaceutical wholesaler, increasing Cardinal Health's presence in the independent pharmacy market by 40 percent. From 2010 to 2014, Cardinal Health acquired 18 companies including Yong Yu, a Chinese drug distributor. Cardinal sold Yong Yu in 2017 to Shanghai Pharmaceuticals Holding Co. Ltd. for $1.2 billion. In July 2014, Cardinal Health and CVS formed Red Oak Sourcing, the largest generic drug sourcing operation in the United States. The companies started buying generic drugs around the world to sell in U.S. markets. In March 2015, Cardinal Health signed an agreement to acquire Johnson & Johnson's Cordis (medical) division, a cardiology and endovascular device manufacturer, for $1.94 billion. The acquisition was completed on October 4, 2015. Cardinal sold the division in August 2021 to Hellman & Friedman, a private equity firm, for $1 billion. In April 2017, Cardinal Health announced the plan to acquire the patient product portfolio from Medtronic for $6.1 billion. The acquisition was completed on July 30, 2017. In November 2024, Cardinal Health announced the plan to acquire Advanced Diabetes Supply Group (ADSG), a leading national direct-to-patient provider of diabetes medical supplies, for about $1.1 billion with plans to merge the company into its at-Home Solutions business.The at-Home Solutions business includes Edgepark Medical Supplies of Twinsburg, Ohio and United States Medical Supply (US MED) of Doral, Florida. The acquisition was complete by April 2024. In August 2025, Cardinal Health announced that it would acquire a 75% stake in Solaris Health, the largest urology management services organization (MSO) in the United States, for $1.9 billion in cash. Controversy Role in the Opioid epidemic Multiple legal settlements have demonstrated Cardinal Health's role in the US Opioid epidemic, though the company never admitted wrongdoing: December 2016: Cardinal Health settled for $44 million for violations of the Controlled Substances Act brought in allegations from United States Attorneys in districts from Maryland, New York, Florida and Washington. July 2021: Cardinal Health agreed to pay $6.4 billion to settle thousands of US lawsuits. They were one of four companies to pay $26 billion, including Johnson & Johnson, AmerisourceBergen and McKesson. May 2022: Settled a derivative suit on behalf of shareholders for $124 million. August 2024: Settlement with various health plans including insurers and third-party payers for $92.7 million. August 2024: Settlement with the City of Baltimore for $152.5 million. Restatements In September 2004, Cardinal Health announced plans to restate past results for fiscal 2001, 2002, 2003, and the first three quarters of 2004 downward, after an accounting review and an ongoing federal investigation. In 2005, in connection with the Audit Committee's conclusions reached in September and October 2004, the company made certain reclassification and restatement adjustments to its fiscal 2004 and prior historical consolidated financial statements. According to The Wall Street Journal, \"Analysts called the restatement decision troubling, yet limited in scope.\" FDA action In August 2006, Cardinal Health ceased production of its Alaris SE infusion pump after approximately 1300 units were seized by the United States Food and Drug Administration (FDA). In February 2007, Cardinal Health signed a consent decree with the FDA which promised procedures to guarantee the safety of the Alaris SE. After FDA inspections, Cardinal Health entered into a further consent agreement with the FDA in 2009. DEA investigation into Oxycodone diversion In 2008, Cardinal Health agreed to pay $34 million in civil penalties to settle DEA allegations that it failed to report suspicious orders of hydrocodone. The fine followed a 10-month DEA suspension of a Lakeland, Florida distribution facility and two others in New Jersey and Washington. On February 2, 2012, the Drug Enforcement Administration again suspended the license of the firm's Lakeland distribution center to distribute controlled substances on charges that it had allowed four Florida pharmacies to purchase excessive amounts of controlled substances, in particular oxycodone. Cardinal Health obtained a restraining order against the suspension, but the suspension was upheld on February 29 by a Federal district court because the court agreed with the DEA that Cardinal Health's activities represented an \"imminent danger to the public.\" The company stated that it blocked two of the pharmacies, (Brooks Pharmacy in Bonita Springs, Florida, and Gulf Coast Medical in Panama City, Florida), and notified the corporate owners of the two pharmacies that were part of national chains, two CVS stores in Sanford, Florida. In February 2012, Joseph Rannazzisi, chief of the Drug Enforcement Administration’s Office of Diversion Control, issued immediate suspension orders against Cardinal's supply of oxycodone to suspected pill mills. These orders were filed after Deputy Attorney General James M. Cole met with Rannazzisi to ask if he had met with Cardinal about the investigation. Cole stated that he believed “it made good sense to listen to what Cardinal had to say” regarding the investigation. That year, Cardinal and the DEA reached a settlement that suspended Cardinal's facility in Lakeland, Florida from selling pain killers or other drugs for two years. In 2016, Cardinal was fined $44 million for after the investigation concluded. In January 2022, Cardinal Health, Johnson & Johnson, McKesson, and AmerisourceBergen agreed to pay $26 billion to settle with all but five of the states suing them. Had the states gone to court, the companies could have faced up to $95 billion in penalties. Finances Annual financial statistics are displayed below: Cardinal Health Foundation The Cardinal Health Foundation is the charitable arm of Cardinal Health. The company makes annual product donations of over $9 million through international relief organizations and provides up to $1,000 in matching funds for every Cardinal Health employee that makes a charitable donation. In 2008, the foundation established its E3 Grant Program. Over the past seven years, the Foundation has invested more than $7.15 million in funding to 241 hospitals, health systems or other health-related organizations. Cardinal Health also supports organizations such as Ronald McDonald House Charities, and was named Benefactor of the Year at the 2011 Corporate Caring Awards. In 2015, the foundation contributed $3 million to the Solutions for Patient Safety project, which has raised over $11 million nationally for efforts to improve safety initiatives in children's hospitals."
}