{
  "ticker": "CARR",
  "cik": "0001783180",
  "company_name": "Carrier Global",
  "corrected_name": "Carrier Global",
  "wiki_title_used": "Carrier Global",
  "exists": true,
  "raw_text": "Carrier Global Corporation is an American multinational heating, ventilation, and air conditioning (HVAC), refrigeration, and fire and security equipment corporation based in Palm Beach Gardens, Florida. Carrier was founded in 1915 as an independent company manufacturing and distributing HVAC systems, and has since expanded to include manufacturing commercial refrigeration and food service equipment, and fire and security technologies.\nAs of 2022, it was a $20.4 billion company with over 52,000 employees serving customers in 160 countries on six continents.\nCarrier was acquired by United Technologies in 1979, but it was spun off as an independent company 41 years later in 2020, as was the Otis Elevator Company.\n\nHistory\nWillis Carrier, a mechanical engineer working for Buffalo Forge, is credited with inventing modern air conditioning in July 1902.\nIn 1908, the Carrier Air Conditioner Company of America was created as a subsidiary of the Buffalo Forge Company, with Willis Carrier as its vice president.\nWith the onset of World War I in late 1914, the Buffalo Forge Company, where Carrier had been employed for 12 years, decided to confine its activities entirely to manufacturing. The result was that in 1915, Carrier and six other engineers pooled $32,600 to form the Carrier Engineering Corporation. They purchased their first factory in 1920, in Newark, New Jersey. The very next year, Carrier solved a problem that had vexed the Islington Studios (owned by Famous Players–Lasky and then Paramount Pictures) in London -- thick fog coming into the stage set and suspending filming. A pressurized system that cooled air at a rate of \"3,500,000 gallons per hour\" and then delivered the dehumidified air at the temperature set by a thermostat, kept the interior air clear and camera-ready.\nIn 1955, Carrier merged with Affiliated Gas Equipment, Inc., which owned the Bryant Heater Co., Day & Night Water Heater Co., and Payne Furnace & Supply Co.\nCarrier Corporation was acquired by United Technologies Corporation (UTC) in July 1979. Prior to the acquisition by UTC, Carrier Corporation was known as the Carrier Air Conditioning Company.\nInternational Comfort Products (ICP), headquartered in Lewisburg, Tennessee, was acquired by Carrier in 1999. In the 1990s, Carrier stopped using the \"Day & Night\" brand (which was the \"D\" in the BDP division, or Bryant-Day & Night-Payne) but it was revived in 2006 by ICP.\nIn 2001, Carrier was the \"world's largest manufacturer of air-conditioning, heating, and refrigerator equipment\" with a \"total employment of 42,600\" and a revenue of $8.9 billion. Carrier announced that it would be closing its DeWitt, New York plant. This led to the layoff of 1,000 employees.\nOn March 15, 2004, Carrier acquired the refrigeration subsidiary of Linde.\nIn 2006, Carrier acquired Sensitech, Inc., a provider of logistics and tracking technologies based in Beverly, Massachusetts.\n\nIn early 2008, Carrier acquired Environmental Market Solutions, Inc. (EMSI), an environmental and green building consulting company based in the United States. The company has received Leadership in Energy and Environmental Design (LEED) certification from the US Green Building Council for its factories in Charlotte, NC, and Huntington, IN (2009), Shanghai, China (2010), and Monterrey, Mexico (2011).\nIn September 2013, Carrier, Otis, and United Technologies Fire and Security were combined into one subsidiary, UTC Building & Industrial Systems. In 2016, Otis was split off, with the remainder becoming UTC Climate, Controls & Security.\nIn January 2016, Carrier announced it would lay off an unspecified number of employees at its research and development division in the town of DeWitt, New York.\nIn February 2016, Carrier announced it would close its Indianapolis factory and move production to Monterrey, Mexico. HVAC Systems and Services North America president Chris Nelson cited \"ongoing cost and pricing pressures\" and Carrier's \"existing infrastructure and a strong supplier base\" in Mexico, saying that the move would allow the company \"to operate more cost-effectively.\" The Carrier spokesperson told the crowd that there would be no immediate impact on jobs, that the move would take place over three years, and no jobs would be affected until mid-2017, with the move to be completed by the end of 2019.\nOver the November 2016 Thanksgiving holiday weekend, President-Elect Donald Trump tweeted that he was in talks with Carrier Management to keep the factory in Indiana and not move to Mexico.\nOn November 30, 2016, Carrier announced that it had negotiated an agreement with President-elect Trump and Vice President-elect Mike Pence to continue manufacturing gas furnaces in Indianapolis, in addition to retaining engineering and headquarters staff, preserving more than 1,000 jobs in Indianapolis. The agreement included a state incentive package of about $7 million over 10 years. The number of jobs saved was later revised down to 800.\nIn May 2017, as part of their previously announced plan, Carrier told the state of Indiana that it will cut 632 jobs from its Indianapolis factory. Layoffs began at the end of July 2017, with each worker receiving one week's salary for each year of employment, education and job training, plus 6 months of health insurance as part of the severance package.\nThe New York Times reported on August 10, 2018, that Carrier's Indianapolis furnace plant was plagued by low morale and absenteeism because \"employees share a looming sense that a factory shutdown is inevitable — that Carrier has merely postponed the closing until a more politically opportune moment.\"\nOn November 26, 2018, United Technologies announced that it would spin off UTC Climate, Controls & Security as an independent company known as Carrier Global Corporation.\nIn April 2020, United Technologies announced that the separation and spin-off of Carrier had been completed.\nOn April 25, 2023, Carrier Global announced that it intended to acquire the HVAC division Viessmann Climate Solutions from the Viessmann Group and divest its Commercial Refrigeration business and most of its Fire & Security businesses.\nIn December 2023, Carrier Global sold its security businesses LenelS2, Supra and Onity to Honeywell for approximately $5 billion.\nIn March 2025, Carrier Global  declared to sell its Industrial Fire division to Sentinel Capital Partners in a $1.43 billion deal.\n\nSite locations\nWillis Carrier moved his facilities from New Jersey to Syracuse, New York, in the 1930s. During the late 20th century, when it was acquired by UTC, it was Central New York State's largest manufacturer. Due to increasing labor and union costs in the Central New York area, Carrier has substantially downsized its presence in Syracuse, with manufacturing work being moved to a variety of domestic and international locations. Meanwhile, managerial employees were moved closer to UTC's corporate headquarters in Farmington, Connecticut, which represented a challenge to the local economy in Syracuse. Over the course of 2011, the majority of the manufacturing buildings of the Syracuse campus were demolished at a cost of nearly $14 million. Despite the loss of manufacturing jobs, the suburban Syracuse Campus, in DeWitt, New York, remained the primary engineering and design center for Carrier products, with over 1,000 employees and contractors on site. This site also houses the Customer Care Call Center for Carrier branded products.\nIn 1980, Carrier was allowed to name the Carrier Dome, the football and basketball arena at Syracuse University, after Mel Holm, the company's then-CEO chair of the university's board of trustees,  gave the university $2.75 million toward the facility's construction. Despite being named for an air conditioner manufacturer, the Carrier Dome was not air-conditioned for the first four decades of its lifespan, only having it installed during renovations that were completed in 2022. Despite finally installing air conditioning, Syracuse announced an end to the perpetual naming rights deal of the dome with Carrier Corp. and that nearby wireless company JMA Wireless would hold naming rights to the stadium moving forward.\nIn March 2020, Carrier quietly hinted at the relocation of its headquarters to Palm Beach Gardens, Florida, after posting 2019 revenues of nearly $19 billion.\n\nBusiness Units\nCarrier Residential\nCarrier Residential provides heating, cooling, and indoor air quality solutions for single-family homes and multi-family residences. Its portfolio includes energy-efficient air conditioners, furnaces, heat pumps, and smart thermostats designed to enhance comfort while helping lower energy bills. Carrier Residential supports homeowners through a network of Factory Authorized Dealers to ensure reliable installation and maintenance.\n\nCarrier Commercial\nCarrier Commercial delivers HVAC systems and building solutions for offices, retail spaces, schools, and other large facilities. Offerings range from rooftop units and chillers to advanced building automation and energy management technologies. The business focuses on helping organizations improve occupant comfort, optimize energy use, and meet sustainability targets.\n\nCarrier Cold Chain\nCarrier Cold Chain specializes in temperature-controlled transport and storage for perishable goods across food, healthcare, and pharmaceutical industries. Its products include refrigerated transport equipment, commercial refrigeration systems, and digital monitoring platforms that ensure product quality and safety. This unit supports global supply chains by reducing waste and maintaining precise temperature control from production to delivery.\n\nBrands\nHVAC\nAirquest\nArcoaire (formerly owned by Atlantic Richfield Company(ARCO))\nBeretta\nBryant\nCarlyle (founded by Willis Carrier & Joel Lyle)\nCarrier\nCIAT (Compagnie Industrielle d'Applications Thermiques)\nComfortmaker\nComfortPro\nDay & Night\nHeil\nIdeal Temp Signature\nKeeprite\nPayne\nRiello\nSLD Pumps & Power (founded as Scottish Land Development)\nSpot Coolers\nTempstar\nToshiba-Carrier (Toshiba founded as Tokyo Shibaura)\nTotaline\nViessmann\nWatkins Hire\nWeathermaker\nGCHV (Guangdong Carrier Heating, Ventilation & Air Conditioning Company Limited)\n\nBuilding automation and HVAC controls\nAutomated Logic Corporation\nCarrier Abound\nNORESCO (formerly Northeast Energy Services Company)\n\nRefrigeration\nCarrier\nCarrier Transicold\nSensitech\n\nFire and Security Controls\nUTEC (formerly United Technologies Electronic Controls)\n\nSee also\nCarrier Enterprise Canada\n\nReferences\nExternal links\nOfficial website \nCarrier brand homepage\nBusiness data for Carrier Global Corporation:",
  "clean_text": "Carrier Global Corporation is an American multinational heating, ventilation, and air conditioning (HVAC), refrigeration, and fire and security equipment corporation based in Palm Beach Gardens, Florida. Carrier was founded in 1915 as an independent company manufacturing and distributing HVAC systems, and has since expanded to include manufacturing commercial refrigeration and food service equipment, and fire and security technologies. As of 2022, it was a $20.4 billion company with over 52,000 employees serving customers in 160 countries on six continents. Carrier was acquired by United Technologies in 1979, but it was spun off as an independent company 41 years later in 2020, as was the Otis Elevator Company. History Willis Carrier, a mechanical engineer working for Buffalo Forge, is credited with inventing modern air conditioning in July 1902. In 1908, the Carrier Air Conditioner Company of America was created as a subsidiary of the Buffalo Forge Company, with Willis Carrier as its vice president. With the onset of World War I in late 1914, the Buffalo Forge Company, where Carrier had been employed for 12 years, decided to confine its activities entirely to manufacturing. The result was that in 1915, Carrier and six other engineers pooled $32,600 to form the Carrier Engineering Corporation. They purchased their first factory in 1920, in Newark, New Jersey. The very next year, Carrier solved a problem that had vexed the Islington Studios (owned by Famous Players–Lasky and then Paramount Pictures) in London -- thick fog coming into the stage set and suspending filming. A pressurized system that cooled air at a rate of \"3,500,000 gallons per hour\" and then delivered the dehumidified air at the temperature set by a thermostat, kept the interior air clear and camera-ready. In 1955, Carrier merged with Affiliated Gas Equipment, Inc., which owned the Bryant Heater Co., Day & Night Water Heater Co., and Payne Furnace & Supply Co. Carrier Corporation was acquired by United Technologies Corporation (UTC) in July 1979. Prior to the acquisition by UTC, Carrier Corporation was known as the Carrier Air Conditioning Company. International Comfort Products (ICP), headquartered in Lewisburg, Tennessee, was acquired by Carrier in 1999. In the 1990s, Carrier stopped using the \"Day & Night\" brand (which was the \"D\" in the BDP division, or Bryant-Day & Night-Payne) but it was revived in 2006 by ICP. In 2001, Carrier was the \"world's largest manufacturer of air-conditioning, heating, and refrigerator equipment\" with a \"total employment of 42,600\" and a revenue of $8.9 billion. Carrier announced that it would be closing its DeWitt, New York plant. This led to the layoff of 1,000 employees. On March 15, 2004, Carrier acquired the refrigeration subsidiary of Linde. In 2006, Carrier acquired Sensitech, Inc., a provider of logistics and tracking technologies based in Beverly, Massachusetts. In early 2008, Carrier acquired Environmental Market Solutions, Inc. (EMSI), an environmental and green building consulting company based in the United States. The company has received Leadership in Energy and Environmental Design (LEED) certification from the US Green Building Council for its factories in Charlotte, NC, and Huntington, IN (2009), Shanghai, China (2010), and Monterrey, Mexico (2011). In September 2013, Carrier, Otis, and United Technologies Fire and Security were combined into one subsidiary, UTC Building & Industrial Systems. In 2016, Otis was split off, with the remainder becoming UTC Climate, Controls & Security. In January 2016, Carrier announced it would lay off an unspecified number of employees at its research and development division in the town of DeWitt, New York. In February 2016, Carrier announced it would close its Indianapolis factory and move production to Monterrey, Mexico. HVAC Systems and Services North America president Chris Nelson cited \"ongoing cost and pricing pressures\" and Carrier's \"existing infrastructure and a strong supplier base\" in Mexico, saying that the move would allow the company \"to operate more cost-effectively.\" The Carrier spokesperson told the crowd that there would be no immediate impact on jobs, that the move would take place over three years, and no jobs would be affected until mid-2017, with the move to be completed by the end of 2019. Over the November 2016 Thanksgiving holiday weekend, President-Elect Donald Trump tweeted that he was in talks with Carrier Management to keep the factory in Indiana and not move to Mexico. On November 30, 2016, Carrier announced that it had negotiated an agreement with President-elect Trump and Vice President-elect Mike Pence to continue manufacturing gas furnaces in Indianapolis, in addition to retaining engineering and headquarters staff, preserving more than 1,000 jobs in Indianapolis. The agreement included a state incentive package of about $7 million over 10 years. The number of jobs saved was later revised down to 800. In May 2017, as part of their previously announced plan, Carrier told the state of Indiana that it will cut 632 jobs from its Indianapolis factory. Layoffs began at the end of July 2017, with each worker receiving one week's salary for each year of employment, education and job training, plus 6 months of health insurance as part of the severance package. The New York Times reported on August 10, 2018, that Carrier's Indianapolis furnace plant was plagued by low morale and absenteeism because \"employees share a looming sense that a factory shutdown is inevitable — that Carrier has merely postponed the closing until a more politically opportune moment.\" On November 26, 2018, United Technologies announced that it would spin off UTC Climate, Controls & Security as an independent company known as Carrier Global Corporation. In April 2020, United Technologies announced that the separation and spin-off of Carrier had been completed. On April 25, 2023, Carrier Global announced that it intended to acquire the HVAC division Viessmann Climate Solutions from the Viessmann Group and divest its Commercial Refrigeration business and most of its Fire & Security businesses. In December 2023, Carrier Global sold its security businesses LenelS2, Supra and Onity to Honeywell for approximately $5 billion. In March 2025, Carrier Global declared to sell its Industrial Fire division to Sentinel Capital Partners in a $1.43 billion deal. Site locations Willis Carrier moved his facilities from New Jersey to Syracuse, New York, in the 1930s. During the late 20th century, when it was acquired by UTC, it was Central New York State's largest manufacturer. Due to increasing labor and union costs in the Central New York area, Carrier has substantially downsized its presence in Syracuse, with manufacturing work being moved to a variety of domestic and international locations. Meanwhile, managerial employees were moved closer to UTC's corporate headquarters in Farmington, Connecticut, which represented a challenge to the local economy in Syracuse. Over the course of 2011, the majority of the manufacturing buildings of the Syracuse campus were demolished at a cost of nearly $14 million. Despite the loss of manufacturing jobs, the suburban Syracuse Campus, in DeWitt, New York, remained the primary engineering and design center for Carrier products, with over 1,000 employees and contractors on site. This site also houses the Customer Care Call Center for Carrier branded products. In 1980, Carrier was allowed to name the Carrier Dome, the football and basketball arena at Syracuse University, after Mel Holm, the company's then-CEO chair of the university's board of trustees, gave the university $2.75 million toward the facility's construction. Despite being named for an air conditioner manufacturer, the Carrier Dome was not air-conditioned for the first four decades of its lifespan, only having it installed during renovations that were completed in 2022. Despite finally installing air conditioning, Syracuse announced an end to the perpetual naming rights deal of the dome with Carrier Corp. and that nearby wireless company JMA Wireless would hold naming rights to the stadium moving forward. In March 2020, Carrier quietly hinted at the relocation of its headquarters to Palm Beach Gardens, Florida, after posting 2019 revenues of nearly $19 billion. Business Units Carrier Residential Carrier Residential provides heating, cooling, and indoor air quality solutions for single-family homes and multi-family residences. Its portfolio includes energy-efficient air conditioners, furnaces, heat pumps, and smart thermostats designed to enhance comfort while helping lower energy bills. Carrier Residential supports homeowners through a network of Factory Authorized Dealers to ensure reliable installation and maintenance. Carrier Commercial Carrier Commercial delivers HVAC systems and building solutions for offices, retail spaces, schools, and other large facilities. Offerings range from rooftop units and chillers to advanced building automation and energy management technologies. The business focuses on helping organizations improve occupant comfort, optimize energy use, and meet sustainability targets. Carrier Cold Chain Carrier Cold Chain specializes in temperature-controlled transport and storage for perishable goods across food, healthcare, and pharmaceutical industries. Its products include refrigerated transport equipment, commercial refrigeration systems, and digital monitoring platforms that ensure product quality and safety. This unit supports global supply chains by reducing waste and maintaining precise temperature control from production to delivery. Brands HVAC Airquest Arcoaire (formerly owned by Atlantic Richfield Company(ARCO)) Beretta Bryant Carlyle (founded by Willis Carrier & Joel Lyle) Carrier CIAT (Compagnie Industrielle d'Applications Thermiques) Comfortmaker ComfortPro Day & Night Heil Ideal Temp Signature Keeprite Payne Riello SLD Pumps & Power (founded as Scottish Land Development) Spot Coolers Tempstar Toshiba-Carrier (Toshiba founded as Tokyo Shibaura) Totaline Viessmann Watkins Hire Weathermaker GCHV (Guangdong Carrier Heating, Ventilation & Air Conditioning Company Limited) Building automation and HVAC controls Automated Logic Corporation Carrier Abound NORESCO (formerly Northeast Energy Services Company) Refrigeration Carrier Carrier Transicold Sensitech Fire and Security Controls UTEC (formerly United Technologies Electronic Controls)"
}