{
  "ticker": "CAT",
  "cik": "0000018230",
  "company_name": "Caterpillar Inc.",
  "corrected_name": "Caterpillar Inc.",
  "wiki_title_used": "Caterpillar Inc.",
  "exists": true,
  "raw_text": "Caterpillar Inc. is an American construction, mining and other engineering equipment manufacturer. The company is the world's largest manufacturer of construction equipment.\nIn 2018, Caterpillar was ranked number 73 on the Fortune 500 list and number 265 on the Global Fortune 500 list. Caterpillar stock is a component of the Dow Jones Industrial Average.\nCaterpillar Inc. traces its origins to the 1925 merger of the Holt Manufacturing Company and the C. L. Best Tractor Company, creating a new entity,  California-based Caterpillar Tractor Company. In 1986, the company reorganized itself as a Delaware corporation under the current name, Caterpillar Inc. It announced in January 2017 that over the course of that year, it would relocate its headquarters from Peoria, Illinois, to Deerfield, Illinois, scrapping plans from 2015 of building an $800 million new headquarters complex in downtown Peoria. Its headquarters are located in Irving, Texas, since 2022.\nThe company also licenses and markets a line of clothing and workwear boots under its Cat / Caterpillar name. Additionally, the company licensed the Cat phone brand of toughened mobile phones and rugged smartphones from 2012 to 2024. Caterpillar machinery and other company-branded products are recognizable by their trademark \"Caterpillar Yellow\" livery and the \"CAT\" logo.\n\nHistory\nOrigins\nThe company traces its roots to the steam tractor machines manufactured by the Holt Manufacturing Company in 1890. The steam tractors of the 1890s and early 1900s were extremely heavy, sometimes weighing 1,000 pounds (450 kg) per horsepower, and often sank into the earth of the San Joaquin Valley Delta farmland surrounding Stockton, California. Benjamin Holt attempted to fix the problem by increasing the size and width of the wheels up to 7.5 feet (2.3 m) tall and 6 feet (1.8 m) wide, producing a tractor 46 feet (14 m) wide, but this also made the tractors increasingly complex, expensive, and difficult to maintain.\nAnother solution considered was to lay a temporary plank road ahead of the steam tractor, but this was time-consuming, expensive, and interfered with earthmoving. Holt thought of wrapping the planks around the wheels. He replaced the wheels on a 40 horsepower (30 kW) Holt steamer, No. 77, with a set of wooden tracks bolted to chains. On Thanksgiving Day, November 24, 1904, he successfully tested the updated machine plowing the soggy delta land of Roberts Island.\nContemporaneously, Richard Hornsby & Sons in Grantham, Lincolnshire, England, developed a steel plate-tracked vehicle, which it patented in 1904. This tractor was the first to be steered using differential braking of the tracks, eliminating the forward tiller and steering wheel.  Several tractors were made and sold to operate in the Yukon, one example of which was in operation until 1927, and remnants of it still exist. Hornsby found a limited market for their tractor, so they sold their patent to Holt five years after its development.\nCompany photographer Charles Clements, looking at the machine's upside-down image through his camera lens, commented that the track rising and falling over the carrier rollers looked like a caterpillar, and Holt seized on the metaphor. \"Caterpillar it is. That's the name for it!\" Some sources, though, attribute this name to British soldiers who had witnessed trials of the Hornsby tractor in July 1907. Two years later, Holt sold his first steam-powered tractor crawlers for US$5,500, about US$185,000 in 2024. Each side featured a track frame measured 30 inches (760 mm) high by 42 inches (1,100 mm) wide and were 9 feet (2.7 m) long. The tracks were 3 inches (76 mm) by 4 inches (100 mm) redwood slats.\nHolt received the first patent for a practical continuous track for use with a tractor on December 7, 1907, for his improved \"Traction Engine\" (\"improvement in vehicles, and especially of the traction engine class; and included endless traveling platform supports upon which the engine is carried\").\n\nHeadquarters locations\nOn February 2, 1910, Holt opened up a plant in East Peoria, Illinois, led by his nephew Pliny Holt. There, Pliny met farm implement dealer Murray Baker, who knew of an empty factory that had been recently built to manufacture farm implements and steam traction engines. Baker, who later became the first executive vice president of what became Caterpillar Tractor Company, wrote to Holt headquarters in Stockton and described the plant of the bankrupt Colean Manufacturing Co. of East Peoria.\nOn October 25, 1909, Pliny Holt purchased the factory, and immediately began operations with 12 employees. Holt incorporated it as the Holt Caterpillar Company, although he did not trademark the name Caterpillar until August 2, 1910.\nThe addition of a plant in the Midwest, despite the hefty capital needed to retool the plant, proved so profitable that only two years later, the company employed 625 people and was exporting tractors to Argentina, Canada, and Mexico. Tractors were built in both Stockton and East Peoria.\nOn January 31, 2017, the company announced plans to move their headquarters from Peoria to Deerfield, Illinois, by the end of 2017. The new location at 500 Lake Cook Road is the former site of a Fiatallis plant that manufactured wheel loaders for many years.\nOn June 14, 2022, the company announced plans to move its global headquarters from Deerfield, Illinois, to Irving, Texas, beginning later in the year, citing \"the best strategic interest of the company.\"\n\nUse in World War I\nThe first tanks used in WWI were manufactured by William Foster & Co., also in Lincolnshire, England, and were introduced to the battlefield in 1916.  That company had collaborated with Hornsby in the development of the vehicles demonstrated to the British military in 1907, providing the paraffin (kerosene) engines.\nHolt's track-type tractors played a support role in World War I. Even before the U.S. formally entered WWI, Holt had shipped 1,200 tractors to England, France, and Russia for agricultural purposes. These governments, however, sent the tractors directly to the battlefront, where the military put them to work hauling artillery and supplies. When World War I broke out, the British War Office ordered a Holt tractor and put it through trials at Aldershot. The War Office was suitably impressed and chose it as a gun tractor. Over the next four years, the Holt tractor became a major artillery tractor, mainly used to haul medium guns such as the 6-inch howitzer, the 60-pounder, and later the 9.2-inch howitzer.\nHolt tractors were also the inspiration for the development of the British tank, which profoundly altered ground warfare tactics. Major Ernest Swinton, sent to France as an army war correspondent, very soon saw the potential of a track-laying tractor. Although the British later chose an English firm to build its first tanks, the Holt tractor became \"one of the most important military vehicles of all time.\"\n\nPostwar challenges\nHolt tractors had become well known during World War I. Military contracts formed the major part of the company's production. When the war ended, Holt's planned expansion to meet the military's needs was abruptly terminated. The heavy-duty tractors needed by the military were unsuitable for farmers. The company's situation worsened when artillery tractors were returned from Europe, depressing prices for new equipment and Holt's unsold inventory of military tractors. The company struggled with the transition from wartime boom to peacetime bust. To keep the company afloat, they borrowed heavily.\nC. L. Best Gas Tractor Company, formed by Clarence Leo Best in 1910, and Holt's primary competitor, had during the war received government support, enabling it to supply farmers with the smaller agricultural tractors they needed. As a result, Best had gained a considerable market advantage over Holt by war's end. Best also assumed considerable debt to allow it to continue expansion, especially the production of its new Best Model 60 \"Tracklayer\".\nBoth companies were adversely impacted by the transition from a wartime to a peacetime economy, which contributed to a nationwide depression, further inhibiting sales. On December 5, 1920, 71-year-old Benjamin Holt died after a month-long illness.\n\nCaterpillar company formed (1925)\nThe banks and bankers who held the company's large debt forced the Holt board of directors to accept their candidate, Thomas A. Baxter, to succeed Benjamin Holt. Baxter initially cut the large tractors from the company's product line and introduced smaller models focused on the agricultural market. When the Federal Aid Highway Act of 1921 funded a US$1 billion federal highway building program, Baxter began refocusing the company towards building road-construction equipment. Both companies also faced fierce competition from the Fordson company.\nBetween 1907 and 1918, Best and Holt had spent about US$1.5 million in legal fees fighting each other in a number of contractual, trademark, and patent infringement lawsuits. Harry H. Fair of the bond brokerage house of Pierce, Fair & Company of San Francisco had helped to finance C. L. Best's debt and Holt shareholders approached him about their company's financial difficulty. Fair recommended that the two companies should merge. In April and May 1925, the financially stronger C. L. Best merged with the market leader Holt Caterpillar to form the Caterpillar Tractor Co.\nThe new company was headquartered in San Leandro until 1930, when under the terms of the merger, it was moved to Peoria. Baxter had been removed as CEO earlier in 1925, and Clarence Leo Best assumed the title of CEO, and remained in that role until October 1951.\nThe Caterpillar company consolidated its product lines, offering only five track-type tractors: the 2 Ton, 5 Ton, and 10 Ton from the Holt Manufacturing Company's old product line and the Caterpillar 30 and Caterpillar 60 from the C. L. Best Tractor Co.'s former product line. The 10 Ton and 5 Ton models were discontinued in 1926. In 1928, the 2 Ton was discontinued. Sales the first year were US$13 million. By 1929, sales climbed to US$52.8 million, and Caterpillar continued to grow throughout the Great Depression of the 1930s.\nCaterpillar adopted the diesel engine to replace gasoline engines. During World War II, Caterpillar products found fame with the Seabees, construction battalions of the United States Navy, which built airfields and other facilities in the Pacific Theater of Operations. Caterpillar ranked 44th among United States corporations in the value of wartime military production contracts. During the postwar construction boom, the company grew at a rapid pace, and launched its first venture outside the U.S. in 1950, marking the beginning of Caterpillar's development into a multinational corporation.\nIn 2018, Caterpillar was in the process of restructuring, closing a demonstration center in Panama and an engine-manufacturing facility in Illinois.\n\nExpansion in developing markets\nCaterpillar built its first Russian facility in the town of Tosno, located near St. Petersburg, Russia. It was completed in 16 months, occupied in November 1999, and began fabricating machine components in 2000. It had the first electrical substation built in the Leningrad Oblast since the Communist government was dissolved on December 26, 1991. The facility was built under harsh winter conditions, where the temperature was below −13 °F (−25 °C). The facility construction was managed by the Lemminkäinen Group in Helsinki, Finland.\nIn May 2022, production at the Tosno plant was stopped. In November 2023, an agreement was reached on the sale of Caterpillar assets to the Russian company PSK - New Solutions, founded by people from Sberbank. Experts believe that the resumption of Caterpillar production is unlikely and the plant will be repurposed.\nThe $125 million Caterpillar Suzhou, People's Republic of China facility, manufactures medium-wheel loaders and motor graders, primarily for the Asian market. The first machine was scheduled for production in March 2009. URS Ausino, in San Francisco, California, manages facility construction.\nCaterpillar has manufactured in Brazil since 1960. In 2010 the company announced plans to further expand production of backhoe and small wheel loaders with a new factory.\nCaterpillar has been manufacturing machines, engines, and generator sets in India, as well. Caterpillar has three facilities in India, which are in Tamil Nadu (Thiruvallur and Hosur) and Maharastra (Aurangabad).\nIn August 2025, Caterpillar expected up to $1.5B in tariff costs for 2025, while Deere has already cut profit forecasts as farm equipment sales slump and tariff pressures intensify.\n\nAcquisitions\nIn addition to increasing sales of its core products, much of Caterpillar's growth has been through acquisitions, including:\n\nDivestitures\nCaterpillar occasionally divests assets that do not align with its core competencies.\n\nBusiness lines\nThrough fiscal year 2010, Caterpillar divided its products, services, and technologies into three principal lines of business: machinery, engines, and financial products for sale to private and governmental entities. As of 2022, Caterpillar reports its financials using four business segments: construction industries, resource industries, energy & transportation, and financial products.\n\nMachinery\nCaterpillar has a list of some 400 products for purchase through its dealer network. Caterpillar's line of machines range from tracked tractors to hydraulic excavators, backhoe loaders, motor graders, off-highway trucks, wheel loaders, agricultural tractors, and locomotives. Caterpillar machinery is used in the construction, road-building, mining, forestry, energy, transportation, and material-handling industries.\nCaterpillar is the world's largest manufacturer of wheel loaders. The small size wheel loaders (SWL) are designed and manufactured at facilities in Clayton, North Carolina. The medium size (MWL) and large size (LWL) are designed at their Aurora, Illinois facility. Medium wheel loaders are manufactured at: Aurora, Illinois; Sagamihara, Kanagawa, Japan; Piracicaba, São Paulo, Brazil; India; and the People's Republic of China. Large wheel loaders are manufactured exclusively in the United States on three separate assembly lines at Aurora, Illinois.\n\nOn-road trucks\nCaterpillar began selling a line of on-road trucks in 2011, the Cat CT660, a Class 8 vocational truck.\nAs of March 2016, Caterpillar has ceased production of on-highway vocational trucks stating that “Remaining a viable competitor in this market would require significant additional investment to develop and launch a complete portfolio of trucks, and upon an updated review, we determined there was not a sufficient market opportunity to justify the investment,” said Ramin Younessi, vice president with responsibility for Caterpillar's Industrial Power Systems Division. “We have not yet started truck production in Victoria, and this decision allows us to exit this business before the transition occurs.”\n\nEngines and gas turbines\nA portion of Caterpillar's business is in the manufacturing of diesel and natural gas engines and gas turbines which, in addition to their use in the company's own vehicles, are used as the prime movers in locomotives, semi trucks, marine vessels, and ships, as well as providing the power source for peak-load power plants and emergency generators.\nCaterpillar 3116 engine was used up until 1997, when Caterpillar introduced the inline 6 cylinder 7.2 litre Caterpillar 3126 engine as its first electronic diesel engine for light trucks and buses. Caterpillar decreased emissions and noise the next year in the 3126B version of the engine, and improved emissions further in 2002 with the 3126E which had an improved high-pressure oil pump and improved electronics. In 2003 Caterpillar started selling a new version of this engine called the C-7 to meet increased United States emission standards that came into effect in 2004; it had the same overall design as the 3126 version, but with improved fuel injectors and electronics which included its new Advanced Combustion Emissions Reduction Technology (ACERT) system. In 2007, as ultra-low-sulfur diesel became required in North America, Caterpillar updated the C7 to use common rail fuel injectors and improved ACERT electronics.\nIn 1998 Caterpillar purchased Perkins Engines of Peterborough, England, a maker of small diesel and gasoline engines.  Perkins engines are used in various applications.  Perkins engine products are dual branded with the Perkins nameplate for both loose and OEM engines, and the CAT nameplate for captive engines within Caterpillar products.\nIn June 2008, Caterpillar announced it would be exiting the on-highway diesel engine market in the United States before updated 2010 U.S. Environmental Protection Agency (EPA) emission standards took effect, as costly changes to the engines, which only constituted a small percentage of Caterpillar's total engine sales, would be likely.\nIn October 2010, Caterpillar announced it would buy German engine-manufacturer MWM GmbH from 3i for $810 million.\n\nCaterpillar Defense Products\nThe Caterpillar Defence Products subsidiary, headquartered in Shrewsbury, United Kingdom, provides diesel engines, automatic transmissions, and other parts for the UK's Titan armored bridge layer, Trojan combat engineering tank, Terrier combat engineering vehicles, and tank transporters; the Romanian MLI-84 armored personnel carrier; and the Swiss Piranha III light armored vehicle, which is currently being developed for use by American light armored formations; large fleets of military trucks in both the U.S. and UK; and the CV90 family of infantry fighting vehicles used by the armies of Sweden, Norway, Finland, Switzerland, the Netherlands, and Denmark.\nThis division also provides both propulsion engines and power generation systems to the naval shipbuilding industry, such as the Series 3512B turbocharged V-12 diesel engine for American Virginia-class nuclear submarines. Caterpillar diesel engines are also used in San Antonio-class amphibious transport docks, Spanish Álvaro de Bazán-class frigates, British River-class offshore patrol vessels, Mexican Sierra-class patrol boats, and Malaysian Kedah-class MEKO A-100 offshore patrol vessels. The poor network security of the Caterpillar engines put the United States' submarine force at risk for cyberattack. In a 2015 interview on cybersecurity, the United States Navy clarified that Caterpillar actually has some of the most secure control systems. It will be used as a model of how the Navy will design cyber protections into its control systems. The \n\nThe Israel Defense Forces' use of highly modified Caterpillar D9 bulldozers has led to Caterpillar being criticized by pro-Palestinian activists and some shareholders. In particular, the IDF Caterpillar D9 was involved in an incident in 2003, in which the American activist Rachel Corrie was killed by an Israeli soldier driving a bulldozer to demolish Gaza homes. A lawsuit against Caterpillar by her family and families of Palestinians, who were also killed by Caterpillar equipment, was unsuccessful. A lawsuit against Israel and Israeli Defense Ministry was rejected by an Israeli court, ruling that her death was an accident, caused by restricted field of view from the heavily armored operators' cabin. In 2014 Presbyterian Church (USA) sold its shares in Caterpillar citing the use of Caterpillar bulldozers involved in demolitions of Palestinian houses and Israeli surveillance activities in the West Bank. In August 2024, San Francisco State University announced that, as part of a deal with student activists, it would divest from four companies that supply weapons for the Israeli army, among them Caterpillar. On August 25, 2025, the Norwegian sovereign wealth fund announced that it was divesting from Caterpillar, selling its $2.4 billion worth of shares. It deplored \"There is no doubt that Caterpillar's products are being used to commit extensive and systematic violations of international humanitarian law\". The fund particularly criticized that the company had \"not implemented any measures to prevent such use\".\n\nCaterpillar Electronics\nThe Caterpillar Electronics business unit has formed Caterpillar Trimble Control Technologies LLC (CTCT), a 50:50 joint venture with Trimble Inc. CTCT develops positioning and control products for earthmoving and paving machines in the construction and mining industries, using technologies such as GNSS, optical total stations, lasers, and sonics. The products are used in a range of applications where the operator of the machine benefits from having accurate horizontal and vertical guidance. CTCT is based in Dayton, Ohio, and started its operations on April 1, 2002.\n\nAgriculture products\nCaterpillar introduced the Challenger range of agricultural tractors as the result of several development programs over a long period of time. The program started in the 1970s and involved both the D6-based units and the Grader power units. A parallel program was also developing wheeled high hp tractors based on using the articulated loading shovel chassis was later merged with the crawler team. The result was the Challenger Tractor and the \"Mobi-Trac\" system.\nThe Challenger has been marketed in Europe as Claas machines since 1997, with Caterpillar marketing the Claas-built Lexion combine range in the USA. Claas and Caterpillar formed a joint venture, Claas Omaha, to build combine harvesters in Omaha, Nebraska, USA under the CAT brand. In 2002, Cat sold its stake to Claas, and licensed the use of CAT and the CAT yellow livery to Claas. They are marketed as Lexion combines now.\nAlso in 2002, Caterpillar sold the Challenger tracked tractor business to AGCO and licensed the use of the Challenger and CAT names and livery to them. This ended Cat's venture into agriculture.\n\nFinancial products and brand licensing\nCaterpillar provides financing and insurance services to customers via Cat Financial and Caterpillar Insurance Services, both of which are subsidiaries of Caterpillar, Inc. Cat Financial provides retail and wholesale financing for Caterpillar products and services, in addition to other equipment provided or facilitated by the company. The company also generates income through the licensing of the Caterpillar and CAT trademarks and logos.\nCaterpillar sells the right to manufacture, market, and sell products bearing the Cat trademark to licensees worldwide. Wolverine World Wide is one example, a licensee since 1994 and currently the sole company licensed to produce Cat branded footwear. Other licensees sell items including scale models of Cat products, clothing, hats, luggage, watches, flashlights, shovels, knives, fans, gloves, smartphones, and other consumer products.\n\nOperations\nManufacturing\nCaterpillar products and components are manufactured in 110 facilities worldwide. 51 of the 110 plants are located in the United States and 59 of the 110 plants are located overseas in Australia (until 2015), Belgium, Brazil, Canada, China, Czech Republic, England, France, Germany, Hungary, India, Indonesia, Italy, Japan, Mexico, the Netherlands, Northern Ireland, Poland, Russia, Singapore, South Africa, and Sweden.\nCaterpillar's historical manufacturing home is in Peoria, Illinois, which also has been the location of Caterpillar's world headquarters and core research and development activities. Although Caterpillar has contracted much of its local parts production and warehousing to third parties, Caterpillar still has four major plants in the Peoria area: the Mapleton Foundry, where diesel engine blocks and other large parts are cast; the East Peoria factory, which has assembled Caterpillar tractors for over 70 years; the Mossville engine plant, built after World War II; and the Morton parts facility.\n\nRemanufacturing\nMajor facilities in Latin America:\n\nMexico: Oradel Industrial Center, Nuevo Laredo, Tamaulipas, México (Since 1988)\n\nDistribution\nCaterpillar products are distributed to end-users in nearly 200 countries through Caterpillar's worldwide network of 220 dealers. Caterpillar's dealers are independently owned and operated businesses with exclusive geographical territories. Dealers provide sales, maintenance and repair services, rental equipment, and parts distribution. Finning, a dealer based in Vancouver, Canada, is Caterpillar's largest global distributor. Gmmco Ltd is India's No. 1 Dealer for Caterpillar Machines. United Tractor & Equipment (Pvt) Limited also known as UTE is the sole authorized dealer of Caterpillar machines and heavy equipment in Sri Lanka.\nMost dealers use a management system called DBS for their day-to-day operations.\nAs of the first quarter of 2006, 66% of Caterpillar's sales are made by one of the 63 dealers in the United States, with the remaining 34% sold by one of Caterpillar's 157 overseas dealers.\n\nManagement\nCaterpillar has a corporate governance structure where the chairman of the board also acts as chief executive officer (CEO). The board of directors is fully independent and is made up of non-employee directors selected from outside the company. Several group presidents report to the CEO, and multiple vice presidents report to each group president.\nThe board has three committees: audit; compensation and human resources; governance and public policy.\nThe behavior of all employees is governed by a code of worldwide business conduct, first published in 1974 and last amended in 2005, which sets the corporate standard for honesty and ethical behavior. Management employees are retested on this code annually.\n\nCurrent board of directors\nAs of October 2023, the board of directors was composed as follows:\n\nOn January 1, 2017, Jim Umpleby succeeded Douglas R. Oberhelman as CEO and Dave Calhoun became non-executive chairman. On December 12, 2018, Umpleby was named chairman of the board as well, reversing Caterpillar's previous decision to split the CEO and chairman position. After eight years as CEO and nearly 45 years of service, Chairman and CEO D. James Umpleby III will become Executive Chairman of the Board effective May 1. Chief Operating Officer (COO) Joseph E. Creed, a 28-year Caterpillar veteran, will succeed him as CEO and join the Board of Directors May 1.\n\nWorkforce and labor relations\nAs of December 31, 2009, Caterpillar employed 93,813 persons of whom 50,562 are located outside the United States. Current employment figures represent a decline of 17,900 employees compared the third quarter of 2008. Due to the restructuring of business operations which began in the 1990s, there are 20,000 fewer union jobs in the Peoria, Illinois area while employment outside the U.S. has increased.\nIn 2020, it was reported that Caterpillar was planning to cut 700 jobs at its Northern Ireland operations.\n\nLabor practices\nCaterpillar came close to bankruptcy in the early 1980s, at one point losing almost US$1 million per day due to a sharp downturn in product demand as competition with Japanese rival Komatsu increased. (At the time, Komatsu used the internal slogan \"encircle Caterpillar\".) Caterpillar suffered further when the United States declared an embargo against the Soviet Union after the Soviet invasion of Afghanistan, causing the company to be unable to sell US$400 million worth of pipelaying machinery that had already been built.\nDue to the drastic drop in demand, Caterpillar initiated employee layoffs, which led to strikes, primarily by the members of the United Auto Workers, against Caterpillar facilities in Illinois and Pennsylvania. Several news reports at the time indicated that products were piling up so high in facilities that replacement workers could barely make their way to their work stations.\nIn 1992, the United Auto Workers conducted a five-month strike against Caterpillar. In response, Caterpillar threatened to replace Caterpillar's entire unionized work force. Over ten thousand UAW members struck again in 1994–1995 for 17 months, a record at that time. The strike ended with the UAW deciding to return to work without a contract despite record revenues and profits by Caterpillar. In 1994, Caterpillar offered a contract to the UAW members that would have raised the salary of top workers from $35,000 to $39,000 per year. However, the UAW was seeking the same top wage of $40,000 that was paid to workers at John Deere & Company in 1994.\nDuring the strikes, Caterpillar used management employees in an attempt to maintain production. It suspended research and development work, sending thousands of engineers and other non-bargained for employees into their manufacturing and assembly facilities to replace striking or locked out union members.\nRather than continuing to fight the United Auto Workers, Caterpillar chose to make itself less vulnerable to the traditional bargaining tactics of organized labor. One way was by outsourcing much of their parts production and warehouse work to outside firms. In another move, according to UAW officials and industry analysts, Caterpillar began to execute a \"southern strategy\". This involved opening new, smaller plants, termed \"focus facilities\", in right-to-work states. Caterpillar opened these new facilities in Clayton and Sanford, North Carolina; Fountain Inn, South Carolina; Corinth, Mississippi; Dyersburg, Tennessee; Griffin and LaGrange, Georgia; Seguin, Texas; and North Little Rock, Arkansas.\nIn 2012, the company locked out workers at a locomotive plant in London, Ontario, Canada and demanded some accept up to a 50% cut in pay, in order to become cost-competitive with comparable Caterpillar manufacturing facilities in the United States. The move created controversy in Canada, with some complaining the plant was acquired under false pretenses. Retail store Mark's Work Wearhouse began pulling Caterpillar boots from its shelves as a result.\nOn May 1, 2012, 780 members of the International Association of Machinists and Aerospace Workers Local Lodge 851 went on strike. An agreement was reached in August, resulting in a 6-year wage freeze. Striking workers expressed anger about the freeze given the company's record 2011 profits and CEO Oberhelman's 60% salary increase.\n\nCoerced labor in Xinjiang\nIn June 2020, it was reported that a Caterpillar clothing wholesaler, Summit Resource International, participates in a Chinese government-run labor transfer scheme that uses forced labor of Uyghurs in internment camps.\n\nEnvironmental record\nEnvironmental stewardship\nCaterpillar divisions have won Illinois Governor's Pollution Prevention Awards every year since 1997. Caterpillar was awarded the 2007 Illinois Governor's Pollution Prevention Award for three projects: The Hydraulics and Hydraulic Systems business unit in Joliet implemented a flame sprayed coating for its truck suspension system, replacing a chroming process, reducing hazardous waste by 700,000 pounds (320,000 kg) annually, and saving 14 million US gallons (53,000 m3) of water. Caterpillar's Cast Metals Organization in Mapleton worked with the American Foundry Society to help produce a rule to reduce hazardous waste in scrap metal that meet strict quality requirements, and also allow foundries to continue recycling certain types of scrap and maintain a competitive cost structure. Caterpillar's Mossville Engine Center formed a team to look at used oil reuse and recycle processes that forced MEC to send large amounts of used oil off-site for recycling, and developed an updated system for reclaiming it for reuse on-site. The resulting benefits included a usage reduction of about 208,000 US gallons (790 m3) of oil per year.\nIn 2004 Caterpillar participated in initiatives such as the United States Environmental Protection Agency's National Clean Diesel Campaign program, which encourages retrofitting fleets of older buses and trucks with newer diesel engines that meet higher emissions standards.\n\nIn 2005, Caterpillar donated $12 million to The Nature Conservancy in a joint effort to protect and preserve river systems in Brazil, U.S.A., and China.\nCaterpillar has, for many years, been a member of the World Business Council for Sustainable Development based in Geneva, Switzerland and has been listed on the Dow Jones Sustainability World Index each year since 2001.\n\nClean Air Act violation\nIn July 1999, Caterpillar and five other diesel engine manufacturers signed a consent decree with the Justice Department and the State of California, after governmental investigations revealed violations of the Clean Air Act. The violation involves over a million diesel engines sold with defeat devices, devices that regulated emissions during pre-sale tests, but that could be disabled in favor of better performance during subsequent highway driving. Consequently, these engines \"...emit up to triple the permissible level of smog-forming nitrogen oxides (NOx). In 1998 alone, these violating vehicles emitted 1,300,000 short tons (1,161,000 long tons; 1,179,000 t) of additional NOx – an amount equal to the emissions of 65 million cars.\" For this reason, Caterpillar was named the \"Clean Air Villain of the Month\" for August 2000 by the Clean Air Trust. The consent decree provided that $83 million be paid in civil penalties and determined new deadlines for meeting emissions standards. Caterpillar, however, was successful in lobbying for an extension of deadlines they considered too severe. Even so, in October 2002, Caterpillar – the only diesel engine company (of those that signed decrees) to fail to meet the new emissions standards deadline – was forced to pay $128 million in per-engine non-conformance penalties.\n\nCarbon footprint\nCaterpillar reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 1,521 Kt (-310 /-16.9% y-o-y). Caterpillar plans to reduce emissions 30% by 2030 from a 2018 base year.\n\nControversies\nTax deferral techniques\nIn March 2017, when US federal agents raided Caterpillar's headquarters in Peoria Ill., it was already evident that the company engaged in aggressive measures to control tax costs. Since April 2014, the company's tax policies have been investigated by a senate subcommittee headed by Senator Carl Levin. Those investigations uncovered significant changes in Caterpillar's offshore tax strategy, culminating in the creation of the new Swiss subsidiary Caterpillar SARL (CSARL) in Geneva. In 1999, former Caterpillar executive Daniel Schlicksup accused the company of funneling profits made on replacement parts into Switzerland, even though it had no warehouses or factories there. The Internal Revenue Service found the firm liable for a billion dollars of unpaid taxes for the years 2007 to 2009.\nAt the same time, the architect of Caterpillar's fiscal strategy, PricewaterhouseCoopers (PWC), came under scrutiny because of PWC's conflict of interest in acting as Caterpillar's controller as well as being its global tax consultant. The Senate uncovered documents from PWC saying the elaborate move was simply a way to evade American taxes. \"We are going to have to do some dancing\" one said. Another noted, \"What the heck, we will all be retired when this comes up on audit.\"\nIn January 2023, Caterpillar reached a settlement with the Internal Revenue Service and was not ordered to pay any penalties.\n\nIsrael Defense Forces sales\nThe sale of Caterpillar bulldozers to the Israeli military, and specifically the IDF Caterpillar D9, for use in the occupied Palestinian territories has long drawn criticism from human rights groups, society groups and responsible investment monitors.\nAmnesty International released a report in May 2004 on home demolition in Gaza and the west bank that noted the risk of complicity for Caterpillar in human rights violations. The Office of the UN High Commissioner on Human Rights also sent a warning letter to the company the next month about its sales of bulldozers to the Israel Defense Forces and their use to destroy Palestinian farms. Human Rights Watch reported the same year on the systematic use of D9 bulldozers in illegal demolitions throughout the occupied territories and called on Caterpillar to suspend its sales to Israel, citing the company's own code of conduct.\nThe pro-Palestinian group Jewish Voice for Peace and four Roman Catholic orders of nuns planned to introduce a resolution at a Caterpillar shareholder meeting subsequent to the human rights reports asking for an investigation into whether Israel's use of the company's bulldozer to destroy Palestinian homes conformed with the company's code of business conduct. In response, the pro-Israel advocacy group StandWithUs urged its members to buy Caterpillar stock and to write letters of support to the company.\nThe US investment indexer MSCI removed Caterpillar from three of its indices for socially responsible investments in 2012, citing the Israeli military's use of its bulldozers in the Palestinian territories. In 2017, documents emerged that showed Caterpillar had hired private investigators to spy on the family of Rachel Corrie, the American human rights activist who was killed by a D9 bulldozer in Rafah in early 2003. In 2022, Stop the Wall called Caterpillar, alongside Hyundai Heavy Industries, JCB and Volvo Group.\nIn August 2025, the Government Pension Fund of Norway pulled out of Caterpillar over what it says is its involvement in Israeli human rights abuses in Gaza and the occupied West Bank.\n\nTrademark claims\nCaterpillar Inc. has sought the revocations of registered trademarks in the United States incorporating the word \"Cat\" in markets unrelated to its machinery business, such as \"Cat & Cloud\" (a cafe in Santa Cruz, California), and Keyboard Cat. The company has faced criticism for this perceived \"bullying\", especially in cases where the likelihood of confusion is low.\n\nDefective engines\nIn 2014, Caterpillar paid $46M to settle claims that one of its engines caused a fiery explosion on a ship owned by Bender Shipbuilding and Repair Company Inc. In 2016 Caterpillar paid $60M to settle claims that its bus engines were prone to breakdowns and fires.\n\nAdvocacy, philanthropy, awards, and lobbying efforts\nCaterpillar is a member of the U.S. Global Leadership Coalition. A Washington D.C.–based coalition of over 400 major companies and NGOs that advocates for increased funding of American diplomatic and development efforts abroad through the International Affairs Budget. Economic development projects in developing countries (particularly in rural, agricultural regions) serve as new markets for Caterpillar products by improving political and economic stability and raising average incomes.\n2011 recipient of the Henry C. Turner Prize for Innovation in Construction Technology from the National Building Museum.\nIn 2025, Caterpillar was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom.\n\nLeadership\nPresident\nRaymond C. Force, 1925–1930\nByron Claude Heacock, 1930–1941\nLouis Bontz Neumiller, 1941–1954\nHarmon Sewell Eberhard, 1954–1962\nWilliam A. Blackie, 1962–1966\nWilliam Henry Franklin, 1966–1972\nLee L. Morgan, 1972–1977\nRobert E. Gilmore, 1977–1985\nPeter Paul Donis, 1985–1989\nDonald Vester Fites, 1989–1990office abolished July 1, 1990\n\nChairman of the Board\nLouis B. Neumiller, 1954–1962\nHarmon S. Eberhard, 1962–1966\nWilliam A. Blackie, 1966–1972\nW. H. Franklin, 1972–1975\nW. L. Naumann, 1975–1977\nLee L. Morgan, 1977–1985\nGeorge Anthony Schaefer, 1985–1990\nDonald Vester Fites, 1990–1999\nGlen A. Barton, 1999–2004\nJames W. Owens, 2004–2010\nDouglas Ray Oberhelman, 2010–2016\nDavid L. Calhoun, 2016–2018\nDonald James Umpleby III, 2018–present\n\nSee also\nG-numbers for U.S. Army Caterpillar tractors\nList of trucks\n\nReferences\nFurther reading\nOrlemann, Eric C. Caterpillar Chronicle, The History of the World's Greatest Earthmovers. Minneapolis, MN: MBI Publishing Company, 2000. ISBN 978-0-7603-3673-1\n\nExternal links\n\nOfficial website \nBusiness data for Caterpillar Inc.: \nCat Products Official Website\nAntique Caterpillar Machinery Owners Club\nAntique Caterpillar Machinery Enthusiasts\nPhotos of early Holt machinery\nCaterpillar Tractor Company Photograph Collection at Baker Library Historical Collections, Harvard Business School",
  "clean_text": "Caterpillar Inc. is an American construction, mining and other engineering equipment manufacturer. The company is the world's largest manufacturer of construction equipment. In 2018, Caterpillar was ranked number 73 on the Fortune 500 list and number 265 on the Global Fortune 500 list. Caterpillar stock is a component of the Dow Jones Industrial Average. Caterpillar Inc. traces its origins to the 1925 merger of the Holt Manufacturing Company and the C. L. Best Tractor Company, creating a new entity, California-based Caterpillar Tractor Company. In 1986, the company reorganized itself as a Delaware corporation under the current name, Caterpillar Inc. It announced in January 2017 that over the course of that year, it would relocate its headquarters from Peoria, Illinois, to Deerfield, Illinois, scrapping plans from 2015 of building an $800 million new headquarters complex in downtown Peoria. Its headquarters are located in Irving, Texas, since 2022. The company also licenses and markets a line of clothing and workwear boots under its Cat / Caterpillar name. Additionally, the company licensed the Cat phone brand of toughened mobile phones and rugged smartphones from 2012 to 2024. Caterpillar machinery and other company-branded products are recognizable by their trademark \"Caterpillar Yellow\" livery and the \"CAT\" logo. History Origins The company traces its roots to the steam tractor machines manufactured by the Holt Manufacturing Company in 1890. The steam tractors of the 1890s and early 1900s were extremely heavy, sometimes weighing 1,000 pounds (450 kg) per horsepower, and often sank into the earth of the San Joaquin Valley Delta farmland surrounding Stockton, California. Benjamin Holt attempted to fix the problem by increasing the size and width of the wheels up to 7.5 feet (2.3 m) tall and 6 feet (1.8 m) wide, producing a tractor 46 feet (14 m) wide, but this also made the tractors increasingly complex, expensive, and difficult to maintain. Another solution considered was to lay a temporary plank road ahead of the steam tractor, but this was time-consuming, expensive, and interfered with earthmoving. Holt thought of wrapping the planks around the wheels. He replaced the wheels on a 40 horsepower (30 kW) Holt steamer, No. 77, with a set of wooden tracks bolted to chains. On Thanksgiving Day, November 24, 1904, he successfully tested the updated machine plowing the soggy delta land of Roberts Island. Contemporaneously, Richard Hornsby & Sons in Grantham, Lincolnshire, England, developed a steel plate-tracked vehicle, which it patented in 1904. This tractor was the first to be steered using differential braking of the tracks, eliminating the forward tiller and steering wheel. Several tractors were made and sold to operate in the Yukon, one example of which was in operation until 1927, and remnants of it still exist. Hornsby found a limited market for their tractor, so they sold their patent to Holt five years after its development. Company photographer Charles Clements, looking at the machine's upside-down image through his camera lens, commented that the track rising and falling over the carrier rollers looked like a caterpillar, and Holt seized on the metaphor. \"Caterpillar it is. That's the name for it!\" Some sources, though, attribute this name to British soldiers who had witnessed trials of the Hornsby tractor in July 1907. Two years later, Holt sold his first steam-powered tractor crawlers for US$5,500, about US$185,000 in 2024. Each side featured a track frame measured 30 inches (760 mm) high by 42 inches (1,100 mm) wide and were 9 feet (2.7 m) long. The tracks were 3 inches (76 mm) by 4 inches (100 mm) redwood slats. Holt received the first patent for a practical continuous track for use with a tractor on December 7, 1907, for his improved \"Traction Engine\" (\"improvement in vehicles, and especially of the traction engine class; and included endless traveling platform supports upon which the engine is carried\"). Headquarters locations On February 2, 1910, Holt opened up a plant in East Peoria, Illinois, led by his nephew Pliny Holt. There, Pliny met farm implement dealer Murray Baker, who knew of an empty factory that had been recently built to manufacture farm implements and steam traction engines. Baker, who later became the first executive vice president of what became Caterpillar Tractor Company, wrote to Holt headquarters in Stockton and described the plant of the bankrupt Colean Manufacturing Co. of East Peoria. On October 25, 1909, Pliny Holt purchased the factory, and immediately began operations with 12 employees. Holt incorporated it as the Holt Caterpillar Company, although he did not trademark the name Caterpillar until August 2, 1910. The addition of a plant in the Midwest, despite the hefty capital needed to retool the plant, proved so profitable that only two years later, the company employed 625 people and was exporting tractors to Argentina, Canada, and Mexico. Tractors were built in both Stockton and East Peoria. On January 31, 2017, the company announced plans to move their headquarters from Peoria to Deerfield, Illinois, by the end of 2017. The new location at 500 Lake Cook Road is the former site of a Fiatallis plant that manufactured wheel loaders for many years. On June 14, 2022, the company announced plans to move its global headquarters from Deerfield, Illinois, to Irving, Texas, beginning later in the year, citing \"the best strategic interest of the company.\" Use in World War I The first tanks used in WWI were manufactured by William Foster & Co., also in Lincolnshire, England, and were introduced to the battlefield in 1916. That company had collaborated with Hornsby in the development of the vehicles demonstrated to the British military in 1907, providing the paraffin (kerosene) engines. Holt's track-type tractors played a support role in World War I. Even before the U.S. formally entered WWI, Holt had shipped 1,200 tractors to England, France, and Russia for agricultural purposes. These governments, however, sent the tractors directly to the battlefront, where the military put them to work hauling artillery and supplies. When World War I broke out, the British War Office ordered a Holt tractor and put it through trials at Aldershot. The War Office was suitably impressed and chose it as a gun tractor. Over the next four years, the Holt tractor became a major artillery tractor, mainly used to haul medium guns such as the 6-inch howitzer, the 60-pounder, and later the 9.2-inch howitzer. Holt tractors were also the inspiration for the development of the British tank, which profoundly altered ground warfare tactics. Major Ernest Swinton, sent to France as an army war correspondent, very soon saw the potential of a track-laying tractor. Although the British later chose an English firm to build its first tanks, the Holt tractor became \"one of the most important military vehicles of all time.\" Postwar challenges Holt tractors had become well known during World War I. Military contracts formed the major part of the company's production. When the war ended, Holt's planned expansion to meet the military's needs was abruptly terminated. The heavy-duty tractors needed by the military were unsuitable for farmers. The company's situation worsened when artillery tractors were returned from Europe, depressing prices for new equipment and Holt's unsold inventory of military tractors. The company struggled with the transition from wartime boom to peacetime bust. To keep the company afloat, they borrowed heavily. C. L. Best Gas Tractor Company, formed by Clarence Leo Best in 1910, and Holt's primary competitor, had during the war received government support, enabling it to supply farmers with the smaller agricultural tractors they needed. As a result, Best had gained a considerable market advantage over Holt by war's end. Best also assumed considerable debt to allow it to continue expansion, especially the production of its new Best Model 60 \"Tracklayer\". Both companies were adversely impacted by the transition from a wartime to a peacetime economy, which contributed to a nationwide depression, further inhibiting sales. On December 5, 1920, 71-year-old Benjamin Holt died after a month-long illness. Caterpillar company formed (1925) The banks and bankers who held the company's large debt forced the Holt board of directors to accept their candidate, Thomas A. Baxter, to succeed Benjamin Holt. Baxter initially cut the large tractors from the company's product line and introduced smaller models focused on the agricultural market. When the Federal Aid Highway Act of 1921 funded a US$1 billion federal highway building program, Baxter began refocusing the company towards building road-construction equipment. Both companies also faced fierce competition from the Fordson company. Between 1907 and 1918, Best and Holt had spent about US$1.5 million in legal fees fighting each other in a number of contractual, trademark, and patent infringement lawsuits. Harry H. Fair of the bond brokerage house of Pierce, Fair & Company of San Francisco had helped to finance C. L. Best's debt and Holt shareholders approached him about their company's financial difficulty. Fair recommended that the two companies should merge. In April and May 1925, the financially stronger C. L. Best merged with the market leader Holt Caterpillar to form the Caterpillar Tractor Co. The new company was headquartered in San Leandro until 1930, when under the terms of the merger, it was moved to Peoria. Baxter had been removed as CEO earlier in 1925, and Clarence Leo Best assumed the title of CEO, and remained in that role until October 1951. The Caterpillar company consolidated its product lines, offering only five track-type tractors: the 2 Ton, 5 Ton, and 10 Ton from the Holt Manufacturing Company's old product line and the Caterpillar 30 and Caterpillar 60 from the C. L. Best Tractor Co.'s former product line. The 10 Ton and 5 Ton models were discontinued in 1926. In 1928, the 2 Ton was discontinued. Sales the first year were US$13 million. By 1929, sales climbed to US$52.8 million, and Caterpillar continued to grow throughout the Great Depression of the 1930s. Caterpillar adopted the diesel engine to replace gasoline engines. During World War II, Caterpillar products found fame with the Seabees, construction battalions of the United States Navy, which built airfields and other facilities in the Pacific Theater of Operations. Caterpillar ranked 44th among United States corporations in the value of wartime military production contracts. During the postwar construction boom, the company grew at a rapid pace, and launched its first venture outside the U.S. in 1950, marking the beginning of Caterpillar's development into a multinational corporation. In 2018, Caterpillar was in the process of restructuring, closing a demonstration center in Panama and an engine-manufacturing facility in Illinois. Expansion in developing markets Caterpillar built its first Russian facility in the town of Tosno, located near St. Petersburg, Russia. It was completed in 16 months, occupied in November 1999, and began fabricating machine components in 2000. It had the first electrical substation built in the Leningrad Oblast since the Communist government was dissolved on December 26, 1991. The facility was built under harsh winter conditions, where the temperature was below −13 °F (−25 °C). The facility construction was managed by the Lemminkäinen Group in Helsinki, Finland. In May 2022, production at the Tosno plant was stopped. In November 2023, an agreement was reached on the sale of Caterpillar assets to the Russian company PSK - New Solutions, founded by people from Sberbank. Experts believe that the resumption of Caterpillar production is unlikely and the plant will be repurposed. The $125 million Caterpillar Suzhou, People's Republic of China facility, manufactures medium-wheel loaders and motor graders, primarily for the Asian market. The first machine was scheduled for production in March 2009. URS Ausino, in San Francisco, California, manages facility construction. Caterpillar has manufactured in Brazil since 1960. In 2010 the company announced plans to further expand production of backhoe and small wheel loaders with a new factory. Caterpillar has been manufacturing machines, engines, and generator sets in India, as well. Caterpillar has three facilities in India, which are in Tamil Nadu (Thiruvallur and Hosur) and Maharastra (Aurangabad). In August 2025, Caterpillar expected up to $1.5B in tariff costs for 2025, while Deere has already cut profit forecasts as farm equipment sales slump and tariff pressures intensify. Acquisitions In addition to increasing sales of its core products, much of Caterpillar's growth has been through acquisitions, including: Divestitures Caterpillar occasionally divests assets that do not align with its core competencies. Business lines Through fiscal year 2010, Caterpillar divided its products, services, and technologies into three principal lines of business: machinery, engines, and financial products for sale to private and governmental entities. As of 2022, Caterpillar reports its financials using four business segments: construction industries, resource industries, energy & transportation, and financial products. Machinery Caterpillar has a list of some 400 products for purchase through its dealer network. Caterpillar's line of machines range from tracked tractors to hydraulic excavators, backhoe loaders, motor graders, off-highway trucks, wheel loaders, agricultural tractors, and locomotives. Caterpillar machinery is used in the construction, road-building, mining, forestry, energy, transportation, and material-handling industries. Caterpillar is the world's largest manufacturer of wheel loaders. The small size wheel loaders (SWL) are designed and manufactured at facilities in Clayton, North Carolina. The medium size (MWL) and large size (LWL) are designed at their Aurora, Illinois facility. Medium wheel loaders are manufactured at: Aurora, Illinois; Sagamihara, Kanagawa, Japan; Piracicaba, São Paulo, Brazil; India; and the People's Republic of China. Large wheel loaders are manufactured exclusively in the United States on three separate assembly lines at Aurora, Illinois. On-road trucks Caterpillar began selling a line of on-road trucks in 2011, the Cat CT660, a Class 8 vocational truck. As of March 2016, Caterpillar has ceased production of on-highway vocational trucks stating that “Remaining a viable competitor in this market would require significant additional investment to develop and launch a complete portfolio of trucks, and upon an updated review, we determined there was not a sufficient market opportunity to justify the investment,” said Ramin Younessi, vice president with responsibility for Caterpillar's Industrial Power Systems Division. “We have not yet started truck production in Victoria, and this decision allows us to exit this business before the transition occurs.” Engines and gas turbines A portion of Caterpillar's business is in the manufacturing of diesel and natural gas engines and gas turbines which, in addition to their use in the company's own vehicles, are used as the prime movers in locomotives, semi trucks, marine vessels, and ships, as well as providing the power source for peak-load power plants and emergency generators. Caterpillar 3116 engine was used up until 1997, when Caterpillar introduced the inline 6 cylinder 7.2 litre Caterpillar 3126 engine as its first electronic diesel engine for light trucks and buses. Caterpillar decreased emissions and noise the next year in the 3126B version of the engine, and improved emissions further in 2002 with the 3126E which had an improved high-pressure oil pump and improved electronics. In 2003 Caterpillar started selling a new version of this engine called the C-7 to meet increased United States emission standards that came into effect in 2004; it had the same overall design as the 3126 version, but with improved fuel injectors and electronics which included its new Advanced Combustion Emissions Reduction Technology (ACERT) system. In 2007, as ultra-low-sulfur diesel became required in North America, Caterpillar updated the C7 to use common rail fuel injectors and improved ACERT electronics. In 1998 Caterpillar purchased Perkins Engines of Peterborough, England, a maker of small diesel and gasoline engines. Perkins engines are used in various applications. Perkins engine products are dual branded with the Perkins nameplate for both loose and OEM engines, and the CAT nameplate for captive engines within Caterpillar products. In June 2008, Caterpillar announced it would be exiting the on-highway diesel engine market in the United States before updated 2010 U.S. Environmental Protection Agency (EPA) emission standards took effect, as costly changes to the engines, which only constituted a small percentage of Caterpillar's total engine sales, would be likely. In October 2010, Caterpillar announced it would buy German engine-manufacturer MWM GmbH from 3i for $810 million. Caterpillar Defense Products The Caterpillar Defence Products subsidiary, headquartered in Shrewsbury, United Kingdom, provides diesel engines, automatic transmissions, and other parts for the UK's Titan armored bridge layer, Trojan combat engineering tank, Terrier combat engineering vehicles, and tank transporters; the Romanian MLI-84 armored personnel carrier; and the Swiss Piranha III light armored vehicle, which is currently being developed for use by American light armored formations; large fleets of military trucks in both the U.S. and UK; and the CV90 family of infantry fighting vehicles used by the armies of Sweden, Norway, Finland, Switzerland, the Netherlands, and Denmark. This division also provides both propulsion engines and power generation systems to the naval shipbuilding industry, such as the Series 3512B turbocharged V-12 diesel engine for American Virginia-class nuclear submarines. Caterpillar diesel engines are also used in San Antonio-class amphibious transport docks, Spanish Álvaro de Bazán-class frigates, British River-class offshore patrol vessels, Mexican Sierra-class patrol boats, and Malaysian Kedah-class MEKO A-100 offshore patrol vessels. The poor network security of the Caterpillar engines put the United States' submarine force at risk for cyberattack. In a 2015 interview on cybersecurity, the United States Navy clarified that Caterpillar actually has some of the most secure control systems. It will be used as a model of how the Navy will design cyber protections into its control systems. The The Israel Defense Forces' use of highly modified Caterpillar D9 bulldozers has led to Caterpillar being criticized by pro-Palestinian activists and some shareholders. In particular, the IDF Caterpillar D9 was involved in an incident in 2003, in which the American activist Rachel Corrie was killed by an Israeli soldier driving a bulldozer to demolish Gaza homes. A lawsuit against Caterpillar by her family and families of Palestinians, who were also killed by Caterpillar equipment, was unsuccessful. A lawsuit against Israel and Israeli Defense Ministry was rejected by an Israeli court, ruling that her death was an accident, caused by restricted field of view from the heavily armored operators' cabin. In 2014 Presbyterian Church (USA) sold its shares in Caterpillar citing the use of Caterpillar bulldozers involved in demolitions of Palestinian houses and Israeli surveillance activities in the West Bank. In August 2024, San Francisco State University announced that, as part of a deal with student activists, it would divest from four companies that supply weapons for the Israeli army, among them Caterpillar. On August 25, 2025, the Norwegian sovereign wealth fund announced that it was divesting from Caterpillar, selling its $2.4 billion worth of shares. It deplored \"There is no doubt that Caterpillar's products are being used to commit extensive and systematic violations of international humanitarian law\". The fund particularly criticized that the company had \"not implemented any measures to prevent such use\". Caterpillar Electronics The Caterpillar Electronics business unit has formed Caterpillar Trimble Control Technologies LLC (CTCT), a 50:50 joint venture with Trimble Inc. CTCT develops positioning and control products for earthmoving and paving machines in the construction and mining industries, using technologies such as GNSS, optical total stations, lasers, and sonics. The products are used in a range of applications where the operator of the machine benefits from having accurate horizontal and vertical guidance. CTCT is based in Dayton, Ohio, and started its operations on April 1, 2002. Agriculture products Caterpillar introduced the Challenger range of agricultural tractors as the result of several development programs over a long period of time. The program started in the 1970s and involved both the D6-based units and the Grader power units. A parallel program was also developing wheeled high hp tractors based on using the articulated loading shovel chassis was later merged with the crawler team. The result was the Challenger Tractor and the \"Mobi-Trac\" system. The Challenger has been marketed in Europe as Claas machines since 1997, with Caterpillar marketing the Claas-built Lexion combine range in the USA. Claas and Caterpillar formed a joint venture, Claas Omaha, to build combine harvesters in Omaha, Nebraska, USA under the CAT brand. In 2002, Cat sold its stake to Claas, and licensed the use of CAT and the CAT yellow livery to Claas. They are marketed as Lexion combines now. Also in 2002, Caterpillar sold the Challenger tracked tractor business to AGCO and licensed the use of the Challenger and CAT names and livery to them. This ended Cat's venture into agriculture. Financial products and brand licensing Caterpillar provides financing and insurance services to customers via Cat Financial and Caterpillar Insurance Services, both of which are subsidiaries of Caterpillar, Inc. Cat Financial provides retail and wholesale financing for Caterpillar products and services, in addition to other equipment provided or facilitated by the company. The company also generates income through the licensing of the Caterpillar and CAT trademarks and logos. Caterpillar sells the right to manufacture, market, and sell products bearing the Cat trademark to licensees worldwide. Wolverine World Wide is one example, a licensee since 1994 and currently the sole company licensed to produce Cat branded footwear. Other licensees sell items including scale models of Cat products, clothing, hats, luggage, watches, flashlights, shovels, knives, fans, gloves, smartphones, and other consumer products. Operations Manufacturing Caterpillar products and components are manufactured in 110 facilities worldwide. 51 of the 110 plants are located in the United States and 59 of the 110 plants are located overseas in Australia (until 2015), Belgium, Brazil, Canada, China, Czech Republic, England, France, Germany, Hungary, India, Indonesia, Italy, Japan, Mexico, the Netherlands, Northern Ireland, Poland, Russia, Singapore, South Africa, and Sweden. Caterpillar's historical manufacturing home is in Peoria, Illinois, which also has been the location of Caterpillar's world headquarters and core research and development activities. Although Caterpillar has contracted much of its local parts production and warehousing to third parties, Caterpillar still has four major plants in the Peoria area: the Mapleton Foundry, where diesel engine blocks and other large parts are cast; the East Peoria factory, which has assembled Caterpillar tractors for over 70 years; the Mossville engine plant, built after World War II; and the Morton parts facility. Remanufacturing Major facilities in Latin America: Mexico: Oradel Industrial Center, Nuevo Laredo, Tamaulipas, México (Since 1988) Distribution Caterpillar products are distributed to end-users in nearly 200 countries through Caterpillar's worldwide network of 220 dealers. Caterpillar's dealers are independently owned and operated businesses with exclusive geographical territories. Dealers provide sales, maintenance and repair services, rental equipment, and parts distribution. Finning, a dealer based in Vancouver, Canada, is Caterpillar's largest global distributor. Gmmco Ltd is India's No. 1 Dealer for Caterpillar Machines. United Tractor & Equipment (Pvt) Limited also known as UTE is the sole authorized dealer of Caterpillar machines and heavy equipment in Sri Lanka. Most dealers use a management system called DBS for their day-to-day operations. As of the first quarter of 2006, 66% of Caterpillar's sales are made by one of the 63 dealers in the United States, with the remaining 34% sold by one of Caterpillar's 157 overseas dealers. Management Caterpillar has a corporate governance structure where the chairman of the board also acts as chief executive officer (CEO). The board of directors is fully independent and is made up of non-employee directors selected from outside the company. Several group presidents report to the CEO, and multiple vice presidents report to each group president. The board has three committees: audit; compensation and human resources; governance and public policy. The behavior of all employees is governed by a code of worldwide business conduct, first published in 1974 and last amended in 2005, which sets the corporate standard for honesty and ethical behavior. Management employees are retested on this code annually. Current board of directors As of October 2023, the board of directors was composed as follows: On January 1, 2017, Jim Umpleby succeeded Douglas R. Oberhelman as CEO and Dave Calhoun became non-executive chairman. On December 12, 2018, Umpleby was named chairman of the board as well, reversing Caterpillar's previous decision to split the CEO and chairman position. After eight years as CEO and nearly 45 years of service, Chairman and CEO D. James Umpleby III will become Executive Chairman of the Board effective May 1. Chief Operating Officer (COO) Joseph E. Creed, a 28-year Caterpillar veteran, will succeed him as CEO and join the Board of Directors May 1. Workforce and labor relations As of December 31, 2009, Caterpillar employed 93,813 persons of whom 50,562 are located outside the United States. Current employment figures represent a decline of 17,900 employees compared the third quarter of 2008. Due to the restructuring of business operations which began in the 1990s, there are 20,000 fewer union jobs in the Peoria, Illinois area while employment outside the U.S. has increased. In 2020, it was reported that Caterpillar was planning to cut 700 jobs at its Northern Ireland operations. Labor practices Caterpillar came close to bankruptcy in the early 1980s, at one point losing almost US$1 million per day due to a sharp downturn in product demand as competition with Japanese rival Komatsu increased. (At the time, Komatsu used the internal slogan \"encircle Caterpillar\".) Caterpillar suffered further when the United States declared an embargo against the Soviet Union after the Soviet invasion of Afghanistan, causing the company to be unable to sell US$400 million worth of pipelaying machinery that had already been built. Due to the drastic drop in demand, Caterpillar initiated employee layoffs, which led to strikes, primarily by the members of the United Auto Workers, against Caterpillar facilities in Illinois and Pennsylvania. Several news reports at the time indicated that products were piling up so high in facilities that replacement workers could barely make their way to their work stations. In 1992, the United Auto Workers conducted a five-month strike against Caterpillar. In response, Caterpillar threatened to replace Caterpillar's entire unionized work force. Over ten thousand UAW members struck again in 1994–1995 for 17 months, a record at that time. The strike ended with the UAW deciding to return to work without a contract despite record revenues and profits by Caterpillar. In 1994, Caterpillar offered a contract to the UAW members that would have raised the salary of top workers from $35,000 to $39,000 per year. However, the UAW was seeking the same top wage of $40,000 that was paid to workers at John Deere & Company in 1994. During the strikes, Caterpillar used management employees in an attempt to maintain production. It suspended research and development work, sending thousands of engineers and other non-bargained for employees into their manufacturing and assembly facilities to replace striking or locked out union members. Rather than continuing to fight the United Auto Workers, Caterpillar chose to make itself less vulnerable to the traditional bargaining tactics of organized labor. One way was by outsourcing much of their parts production and warehouse work to outside firms. In another move, according to UAW officials and industry analysts, Caterpillar began to execute a \"southern strategy\". This involved opening new, smaller plants, termed \"focus facilities\", in right-to-work states. Caterpillar opened these new facilities in Clayton and Sanford, North Carolina; Fountain Inn, South Carolina; Corinth, Mississippi; Dyersburg, Tennessee; Griffin and LaGrange, Georgia; Seguin, Texas; and North Little Rock, Arkansas. In 2012, the company locked out workers at a locomotive plant in London, Ontario, Canada and demanded some accept up to a 50% cut in pay, in order to become cost-competitive with comparable Caterpillar manufacturing facilities in the United States. The move created controversy in Canada, with some complaining the plant was acquired under false pretenses. Retail store Mark's Work Wearhouse began pulling Caterpillar boots from its shelves as a result. On May 1, 2012, 780 members of the International Association of Machinists and Aerospace Workers Local Lodge 851 went on strike. An agreement was reached in August, resulting in a 6-year wage freeze. Striking workers expressed anger about the freeze given the company's record 2011 profits and CEO Oberhelman's 60% salary increase. Coerced labor in Xinjiang In June 2020, it was reported that a Caterpillar clothing wholesaler, Summit Resource International, participates in a Chinese government-run labor transfer scheme that uses forced labor of Uyghurs in internment camps. Environmental record Environmental stewardship Caterpillar divisions have won Illinois Governor's Pollution Prevention Awards every year since 1997. Caterpillar was awarded the 2007 Illinois Governor's Pollution Prevention Award for three projects: The Hydraulics and Hydraulic Systems business unit in Joliet implemented a flame sprayed coating for its truck suspension system, replacing a chroming process, reducing hazardous waste by 700,000 pounds (320,000 kg) annually, and saving 14 million US gallons (53,000 m3) of water. Caterpillar's Cast Metals Organization in Mapleton worked with the American Foundry Society to help produce a rule to reduce hazardous waste in scrap metal that meet strict quality requirements, and also allow foundries to continue recycling certain types of scrap and maintain a competitive cost structure. Caterpillar's Mossville Engine Center formed a team to look at used oil reuse and recycle processes that forced MEC to send large amounts of used oil off-site for recycling, and developed an updated system for reclaiming it for reuse on-site. The resulting benefits included a usage reduction of about 208,000 US gallons (790 m3) of oil per year. In 2004 Caterpillar participated in initiatives such as the United States Environmental Protection Agency's National Clean Diesel Campaign program, which encourages retrofitting fleets of older buses and trucks with newer diesel engines that meet higher emissions standards. In 2005, Caterpillar donated $12 million to The Nature Conservancy in a joint effort to protect and preserve river systems in Brazil, U.S.A., and China. Caterpillar has, for many years, been a member of the World Business Council for Sustainable Development based in Geneva, Switzerland and has been listed on the Dow Jones Sustainability World Index each year since 2001. Clean Air Act violation In July 1999, Caterpillar and five other diesel engine manufacturers signed a consent decree with the Justice Department and the State of California, after governmental investigations revealed violations of the Clean Air Act. The violation involves over a million diesel engines sold with defeat devices, devices that regulated emissions during pre-sale tests, but that could be disabled in favor of better performance during subsequent highway driving. Consequently, these engines \"...emit up to triple the permissible level of smog-forming nitrogen oxides (NOx). In 1998 alone, these violating vehicles emitted 1,300,000 short tons (1,161,000 long tons; 1,179,000 t) of additional NOx – an amount equal to the emissions of 65 million cars.\" For this reason, Caterpillar was named the \"Clean Air Villain of the Month\" for August 2000 by the Clean Air Trust. The consent decree provided that $83 million be paid in civil penalties and determined new deadlines for meeting emissions standards. Caterpillar, however, was successful in lobbying for an extension of deadlines they considered too severe. Even so, in October 2002, Caterpillar – the only diesel engine company (of those that signed decrees) to fail to meet the new emissions standards deadline – was forced to pay $128 million in per-engine non-conformance penalties. Carbon footprint Caterpillar reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 1,521 Kt (-310 /-16.9% y-o-y). Caterpillar plans to reduce emissions 30% by 2030 from a 2018 base year. Controversies Tax deferral techniques In March 2017, when US federal agents raided Caterpillar's headquarters in Peoria Ill., it was already evident that the company engaged in aggressive measures to control tax costs. Since April 2014, the company's tax policies have been investigated by a senate subcommittee headed by Senator Carl Levin. Those investigations uncovered significant changes in Caterpillar's offshore tax strategy, culminating in the creation of the new Swiss subsidiary Caterpillar SARL (CSARL) in Geneva. In 1999, former Caterpillar executive Daniel Schlicksup accused the company of funneling profits made on replacement parts into Switzerland, even though it had no warehouses or factories there. The Internal Revenue Service found the firm liable for a billion dollars of unpaid taxes for the years 2007 to 2009. At the same time, the architect of Caterpillar's fiscal strategy, PricewaterhouseCoopers (PWC), came under scrutiny because of PWC's conflict of interest in acting as Caterpillar's controller as well as being its global tax consultant. The Senate uncovered documents from PWC saying the elaborate move was simply a way to evade American taxes. \"We are going to have to do some dancing\" one said. Another noted, \"What the heck, we will all be retired when this comes up on audit.\" In January 2023, Caterpillar reached a settlement with the Internal Revenue Service and was not ordered to pay any penalties. Israel Defense Forces sales The sale of Caterpillar bulldozers to the Israeli military, and specifically the IDF Caterpillar D9, for use in the occupied Palestinian territories has long drawn criticism from human rights groups, society groups and responsible investment monitors. Amnesty International released a report in May 2004 on home demolition in Gaza and the west bank that noted the risk of complicity for Caterpillar in human rights violations. The Office of the UN High Commissioner on Human Rights also sent a warning letter to the company the next month about its sales of bulldozers to the Israel Defense Forces and their use to destroy Palestinian farms. Human Rights Watch reported the same year on the systematic use of D9 bulldozers in illegal demolitions throughout the occupied territories and called on Caterpillar to suspend its sales to Israel, citing the company's own code of conduct. The pro-Palestinian group Jewish Voice for Peace and four Roman Catholic orders of nuns planned to introduce a resolution at a Caterpillar shareholder meeting subsequent to the human rights reports asking for an investigation into whether Israel's use of the company's bulldozer to destroy Palestinian homes conformed with the company's code of business conduct. In response, the pro-Israel advocacy group StandWithUs urged its members to buy Caterpillar stock and to write letters of support to the company. The US investment indexer MSCI removed Caterpillar from three of its indices for socially responsible investments in 2012, citing the Israeli military's use of its bulldozers in the Palestinian territories. In 2017, documents emerged that showed Caterpillar had hired private investigators to spy on the family of Rachel Corrie, the American human rights activist who was killed by a D9 bulldozer in Rafah in early 2003. In 2022, Stop the Wall called Caterpillar, alongside Hyundai Heavy Industries, JCB and Volvo Group. In August 2025, the Government Pension Fund of Norway pulled out of Caterpillar over what it says is its involvement in Israeli human rights abuses in Gaza and the occupied West Bank. Trademark claims Caterpillar Inc. has sought the revocations of registered trademarks in the United States incorporating the word \"Cat\" in markets unrelated to its machinery business, such as \"Cat & Cloud\" (a cafe in Santa Cruz, California), and Keyboard Cat. The company has faced criticism for this perceived \"bullying\", especially in cases where the likelihood of confusion is low. Defective engines In 2014, Caterpillar paid $46M to settle claims that one of its engines caused a fiery explosion on a ship owned by Bender Shipbuilding and Repair Company Inc. In 2016 Caterpillar paid $60M to settle claims that its bus engines were prone to breakdowns and fires. Advocacy, philanthropy, awards, and lobbying efforts Caterpillar is a member of the U.S. Global Leadership Coalition. A Washington D.C.–based coalition of over 400 major companies and NGOs that advocates for increased funding of American diplomatic and development efforts abroad through the International Affairs Budget. Economic development projects in developing countries (particularly in rural, agricultural regions) serve as new markets for Caterpillar products by improving political and economic stability and raising average incomes. 2011 recipient of the Henry C. Turner Prize for Innovation in Construction Technology from the National Building Museum. In 2025, Caterpillar was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom. Leadership President Raymond C. Force, 1925–1930 Byron Claude Heacock, 1930–1941 Louis Bontz Neumiller, 1941–1954 Harmon Sewell Eberhard, 1954–1962 William A. Blackie, 1962–1966 William Henry Franklin, 1966–1972 Lee L. Morgan, 1972–1977 Robert E. Gilmore, 1977–1985 Peter Paul Donis, 1985–1989 Donald Vester Fites, 1989–1990office abolished July 1, 1990 Chairman of the Board Louis B. Neumiller, 1954–1962 Harmon S. Eberhard, 1962–1966 William A. Blackie, 1966–1972 W. H. Franklin, 1972–1975 W. L. Naumann, 1975–1977 Lee L. Morgan, 1977–1985 George Anthony Schaefer, 1985–1990 Donald Vester Fites, 1990–1999 Glen A. Barton, 1999–2004 James W. Owens, 2004–2010 Douglas Ray Oberhelman, 2010–2016 David L. Calhoun, 2016–2018 Donald James Umpleby III, 2018–present"
}