{
  "ticker": "CB",
  "cik": "0000896159",
  "company_name": "Chubb Limited",
  "corrected_name": "Chubb Limited",
  "wiki_title_used": "Chubb Limited",
  "exists": true,
  "raw_text": "Chubb Limited is an American–Swiss company incorporated in Zürich, and listed on the New York Stock Exchange (NYSE) where it is a component of the S&P 500. Chubb is a global provider of insurance products covering property and casualty, accident and health, reinsurance, and life insurance and is the largest publicly traded property and casualty insurance company in the world. Chubb operates in 55 countries and territories and in the Lloyd's insurance market in London. Clients of Chubb consist of multinational corporations and local businesses, individuals, and insurers seeking reinsurance coverage. Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance, and life insurance.\nIn 2018, the group had $174 billion in assets, $30.8 billion of gross written premiums and approximately 31,000 employees. Its core operating insurance companies are rated \"AA\" (Very Strong) for financial strength by Standard & Poor's and \"A++\" (Superior) by A. M. Best with stable outlooks from both agencies. Fitch rates Chubb Limited and its subsidiaries \"AA\" (Very Strong) for financial strength, \"AA−\" for issuer default and \"A+\" for senior debt. Moody's rates the U.S. companies \"A1\" and the unsecured loan notes \"A3\".\nOn 1 July 2015, property & casualty insurer Ace Limited (ACE) announced that it would acquire the original Chubb Corporation for $28.3 billion in cash and stock. ACE stated that Chubb's current headquarters in Warren, New Jersey, will have a substantial portion of the headquarters function for the combined company's North American Division. The combined company adopted the Chubb name in January 2016 after the acquisition was completed.\n\nHistory\nChubb\nIn 1882, Thomas Caldecot Chubb and his son Percy started a marine underwriting business in New York City. They collected $1,000 from 100 prominent merchants and focused on insuring ships and cargoes.\nThe Chubb Corporation was incorporated in 1967 and was listed on the New York Stock Exchange in 1984.\nBeginning in 1970, the corporation owned The Chubb Institute, a chain of commercial technical schools which grew out of the company's employee training program, but the schools were sold for $1 to a partnership of private equity firms Great Hill Partners and the High-Tech Institute in 2004.\nIn 2007, Chubb was named the Readers' Choice winner as \"Best Admitted Property/Casualty Insurance Company\" by Business Insurance. In 2010 Chubb was number five on Chicago Business \"Best Places to Work\" list.\n\nACE Limited\n1985–1999\nACE (American Casualty Excess) Limited was established in 1985 in response to the U.S. liability insurance crisis of the mid-1980s.  It was formed with the assistance of insurance broker Marsh & McLennan and funded by a group of 34 U.S. companies seeking difficult-to-obtain Excess Liability and Directors and Officers (D&O) insurance coverage.  That year, ACE and its Bermuda subsidiary, incorporated in the Cayman Islands and headquartered in Hamilton, Bermuda, wrote its first insurance policy with John Cox as its president and CEO.  In 1987 the company assumed management of Corporate Officers & Directors Assurance Limited (CODA), expanding ACE Bermuda's product line.\nWalter Scott became Chairman, President, and CEO of ACE in 1990 and saw the company listed on the New York Stock Exchange in 1993. Brian Duperreault succeeded Scott in 1994 as Chairman, President & CEO and worked for the next ten years as ACE went through a series of acquisitions and a diversification process that brought the ACE Group of Companies global status.  One of the multiple acquisitions made during this time was the global property and casualty business of Cigna Corporation (most significantly the Insurance Company of North America, known as INA), which was purchased for $3.45 billion in 1999.\n\n2000–2021\nIn 2004, Evan G. Greenberg became president and CEO of ACE Ltd. In 2004, ACE was also investigated by New York Attorney General Eliot Spitzer for participating in a bid rigging and price fixing scheme with insurance broker Marsh & McLennan.\nIn 2008, ACE purchased the accident and health insurance provider Combined Insurance Company of America (founded by W. Clement Stone in 1919) from Aon Corporation for $2.56 billion and the high-net-worth personal lines business of the Atlantic Companies.\nAlso in 2008, ACE relocated from the Cayman Islands to Zürich, Switzerland. Evan Greenberg described the move as a \"natural progression\" that would provide ACE with a \"better strategic flexibility…and a solid legal and regulatory environment…\" The re-domestication was completed in July that year.\nIn 2010, the ACE company ESIS Inc. was hired by BP to process claims made by the victims of the Deepwater Horizon oil spill.\nIn 2010, ACE Limited purchased Rain and Hail, LLC for $1.1 billion. Rain and Hail Insurance Service, headquartered in Johnston, Iowa, is an industry leader in crop insurance in the United States. ACE Limited also acquired the Hong Kong and Korea life insurance operations of New York Life.\nIn 2011, ACE Limited purchased agribusiness insurer Penn Millers.\nIn 2012, they purchased Indonesian insurer Asuransi Jaya Proteksi.\nIn 2013, they purchased Mexican Surety Lines Company Fianzas Monterrey and Mexican Personal Lines Insurer ABA Seguros.\nIn April 2014, ACE Limited acquired a majority stake in Siam Commercial Samaggi Insurance PCL from Siam Commercial Bank.  Following a subsequent tender offer in June 2014, ACE and its local partner owned 93.03% of the Samaggi.\nIn October 2014, ACE Limited acquired the large commercial property and casualty business of Itaú Unibanco Holding SA. The transaction made ACE the largest property and casualty insurer in Brazil.\nIn April 2015, ACE Limited acquired the Fireman's Fund high net-worth personal lines insurance business in the U.S. from Allianz for $365 million. ACE Private Risk Services is one of the largest high net worth insurers in the U.S.\nOn 1 September 2020, Chubb announced the introduction of the latest update of its Enterprise Guard Plus product for the emerging needs of Hong Kong business insurance.\nIn February 2021, Chubb Limited and the World Health Organization announced the roll out of a no-fault compensation scheme for COVID-19 vaccinations for low and middle-income countries.\n\nACE acquires Chubb\nOn 1 July 2015, ACE announced that it would acquire Chubb Corporation for $28.3 billion in cash and ACE stock. Upon completion, ACE shareholders held 70% while Chubb shareholders got 30% of the new combined company. The new company was to be based in Zürich, where ACE Limited's headquarters were. Evan Greenberg of ACE became the Chairman and CEO of the new company, while Chubb Chairman and CEO John Finnegan became Executive Vice Chairman for North America External Affairs. The company's board was expanded to 18, with 4 of them coming from Chubb. The new combined company then decided to adopt the Chubb name. The deal received ACE and Chubb shareholder approval and all required regulatory approval, and closed on 14 January 2016.\n\nControversies\n2004 Eliot Spitzer investigation\nIn 2004 New York Attorney General Eliot Spitzer conducted an investigation in the insurance industry. ACE, American International Group (AIG), Marsh & McLennan, and other large insurers and brokerages were named in Spitzer's investigation for possibly participating in questionable insurance practices including the payment of contingent commissions, bid-rigging, price-fixing, and improper accounting.\n\nSpitzer asserted that contingent commissions contributed to a widespread practice of \"bid-rigging\" where brokers solicited fake bids with deliberately less favorable terms for the consumer than the bid offered by the insurance company paying the highest commissions.\nAs part of an $80 million settlement that abated further inquiry, ACE signed an Assurance of Discontinuance in which they acknowledged their prior conduct and agreed to alter their business practices.  Evan Greenberg himself admitted no fault in Spitzer's allegations although a junior executive did plead guilty to criminal charges.\nSpitzer's insurance industry probe additionally looked in early 2005 into ACE Ltd's subsidiary ACE Tempest Re's reporting to the SEC of a series of reinsurance transactions, together with the SEC reporting of a further 16 unaffiliated re-insurers. Evan Greenberg said that his company's investigation should be completed within a month. According to Greenberg, contracts appeared \"generally structured in a way to provide for appropriate risk transfer and accounted for properly.\"\nThe Spitzer investigations also triggered civil litigation by policyholders who claim they were victimized by the bid rigging and commission schemes.\n\nSecuring bond for Donald Trump defamation appeal\nOn 8 March 2024, Federal Insurance Company, part of The Chubb Corporation, posted a $91.63 million bond for Donald Trump in the E. Jean Carroll v. Donald J. Trump case. Despite an estimated net worth of over $2 billion,   Trump needed a cash bond posted by Chubb in order to secure his appeal.  While President, Trump appointed Chubb CEO Evan G. Greenberg to the White House advisory committee for trade policy and negotiations.  When Chubb announced the securing of the bond, they claimed that this would be the only bond secured as Trump has another $454 million bond pending for his New York civil fraud case.  On 18 March 2024, Trump's lawyers notified the Appellate Division of Manhattan Supreme Court that he was unable to secure a bond for the civil fraud case, seeming to confirm Chubb's position on not underwriting additional bonds for Trump.\nOn 13 March 2024, CEO Evan Greenberg issued a letter to investors, customers, and brokers defending the move. Despite having deep personal connections to Trump, Greenberg claimed \"we frankly left our own personal feelings aside\" when deciding to issue the bond.\n\nReversal on coal pledge\nIn 2019, Chubb pledged not to insure energy companies that rely more than 30% on coal power. By 2025, Chubb had broken its pledge, as it insured a coal-fired power station.\n\nReferences\nExternal links\nBusiness data for Chubb Limited:",
  "clean_text": "Chubb Limited is an American–Swiss company incorporated in Zürich, and listed on the New York Stock Exchange (NYSE) where it is a component of the S&P 500. Chubb is a global provider of insurance products covering property and casualty, accident and health, reinsurance, and life insurance and is the largest publicly traded property and casualty insurance company in the world. Chubb operates in 55 countries and territories and in the Lloyd's insurance market in London. Clients of Chubb consist of multinational corporations and local businesses, individuals, and insurers seeking reinsurance coverage. Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance, and life insurance. In 2018, the group had $174 billion in assets, $30.8 billion of gross written premiums and approximately 31,000 employees. Its core operating insurance companies are rated \"AA\" (Very Strong) for financial strength by Standard & Poor's and \"A++\" (Superior) by A. M. Best with stable outlooks from both agencies. Fitch rates Chubb Limited and its subsidiaries \"AA\" (Very Strong) for financial strength, \"AA−\" for issuer default and \"A+\" for senior debt. Moody's rates the U.S. companies \"A1\" and the unsecured loan notes \"A3\". On 1 July 2015, property & casualty insurer Ace Limited (ACE) announced that it would acquire the original Chubb Corporation for $28.3 billion in cash and stock. ACE stated that Chubb's current headquarters in Warren, New Jersey, will have a substantial portion of the headquarters function for the combined company's North American Division. The combined company adopted the Chubb name in January 2016 after the acquisition was completed. History Chubb In 1882, Thomas Caldecot Chubb and his son Percy started a marine underwriting business in New York City. They collected $1,000 from 100 prominent merchants and focused on insuring ships and cargoes. The Chubb Corporation was incorporated in 1967 and was listed on the New York Stock Exchange in 1984. Beginning in 1970, the corporation owned The Chubb Institute, a chain of commercial technical schools which grew out of the company's employee training program, but the schools were sold for $1 to a partnership of private equity firms Great Hill Partners and the High-Tech Institute in 2004. In 2007, Chubb was named the Readers' Choice winner as \"Best Admitted Property/Casualty Insurance Company\" by Business Insurance. In 2010 Chubb was number five on Chicago Business \"Best Places to Work\" list. ACE Limited 1985–1999 ACE (American Casualty Excess) Limited was established in 1985 in response to the U.S. liability insurance crisis of the mid-1980s. It was formed with the assistance of insurance broker Marsh & McLennan and funded by a group of 34 U.S. companies seeking difficult-to-obtain Excess Liability and Directors and Officers (D&O) insurance coverage. That year, ACE and its Bermuda subsidiary, incorporated in the Cayman Islands and headquartered in Hamilton, Bermuda, wrote its first insurance policy with John Cox as its president and CEO. In 1987 the company assumed management of Corporate Officers & Directors Assurance Limited (CODA), expanding ACE Bermuda's product line. Walter Scott became Chairman, President, and CEO of ACE in 1990 and saw the company listed on the New York Stock Exchange in 1993. Brian Duperreault succeeded Scott in 1994 as Chairman, President & CEO and worked for the next ten years as ACE went through a series of acquisitions and a diversification process that brought the ACE Group of Companies global status. One of the multiple acquisitions made during this time was the global property and casualty business of Cigna Corporation (most significantly the Insurance Company of North America, known as INA), which was purchased for $3.45 billion in 1999. 2000–2021 In 2004, Evan G. Greenberg became president and CEO of ACE Ltd. In 2004, ACE was also investigated by New York Attorney General Eliot Spitzer for participating in a bid rigging and price fixing scheme with insurance broker Marsh & McLennan. In 2008, ACE purchased the accident and health insurance provider Combined Insurance Company of America (founded by W. Clement Stone in 1919) from Aon Corporation for $2.56 billion and the high-net-worth personal lines business of the Atlantic Companies. Also in 2008, ACE relocated from the Cayman Islands to Zürich, Switzerland. Evan Greenberg described the move as a \"natural progression\" that would provide ACE with a \"better strategic flexibility…and a solid legal and regulatory environment…\" The re-domestication was completed in July that year. In 2010, the ACE company ESIS Inc. was hired by BP to process claims made by the victims of the Deepwater Horizon oil spill. In 2010, ACE Limited purchased Rain and Hail, LLC for $1.1 billion. Rain and Hail Insurance Service, headquartered in Johnston, Iowa, is an industry leader in crop insurance in the United States. ACE Limited also acquired the Hong Kong and Korea life insurance operations of New York Life. In 2011, ACE Limited purchased agribusiness insurer Penn Millers. In 2012, they purchased Indonesian insurer Asuransi Jaya Proteksi. In 2013, they purchased Mexican Surety Lines Company Fianzas Monterrey and Mexican Personal Lines Insurer ABA Seguros. In April 2014, ACE Limited acquired a majority stake in Siam Commercial Samaggi Insurance PCL from Siam Commercial Bank. Following a subsequent tender offer in June 2014, ACE and its local partner owned 93.03% of the Samaggi. In October 2014, ACE Limited acquired the large commercial property and casualty business of Itaú Unibanco Holding SA. The transaction made ACE the largest property and casualty insurer in Brazil. In April 2015, ACE Limited acquired the Fireman's Fund high net-worth personal lines insurance business in the U.S. from Allianz for $365 million. ACE Private Risk Services is one of the largest high net worth insurers in the U.S. On 1 September 2020, Chubb announced the introduction of the latest update of its Enterprise Guard Plus product for the emerging needs of Hong Kong business insurance. In February 2021, Chubb Limited and the World Health Organization announced the roll out of a no-fault compensation scheme for COVID-19 vaccinations for low and middle-income countries. ACE acquires Chubb On 1 July 2015, ACE announced that it would acquire Chubb Corporation for $28.3 billion in cash and ACE stock. Upon completion, ACE shareholders held 70% while Chubb shareholders got 30% of the new combined company. The new company was to be based in Zürich, where ACE Limited's headquarters were. Evan Greenberg of ACE became the Chairman and CEO of the new company, while Chubb Chairman and CEO John Finnegan became Executive Vice Chairman for North America External Affairs. The company's board was expanded to 18, with 4 of them coming from Chubb. The new combined company then decided to adopt the Chubb name. The deal received ACE and Chubb shareholder approval and all required regulatory approval, and closed on 14 January 2016. Controversies 2004 Eliot Spitzer investigation In 2004 New York Attorney General Eliot Spitzer conducted an investigation in the insurance industry. ACE, American International Group (AIG), Marsh & McLennan, and other large insurers and brokerages were named in Spitzer's investigation for possibly participating in questionable insurance practices including the payment of contingent commissions, bid-rigging, price-fixing, and improper accounting. Spitzer asserted that contingent commissions contributed to a widespread practice of \"bid-rigging\" where brokers solicited fake bids with deliberately less favorable terms for the consumer than the bid offered by the insurance company paying the highest commissions. As part of an $80 million settlement that abated further inquiry, ACE signed an Assurance of Discontinuance in which they acknowledged their prior conduct and agreed to alter their business practices. Evan Greenberg himself admitted no fault in Spitzer's allegations although a junior executive did plead guilty to criminal charges. Spitzer's insurance industry probe additionally looked in early 2005 into ACE Ltd's subsidiary ACE Tempest Re's reporting to the SEC of a series of reinsurance transactions, together with the SEC reporting of a further 16 unaffiliated re-insurers. Evan Greenberg said that his company's investigation should be completed within a month. According to Greenberg, contracts appeared \"generally structured in a way to provide for appropriate risk transfer and accounted for properly.\" The Spitzer investigations also triggered civil litigation by policyholders who claim they were victimized by the bid rigging and commission schemes. Securing bond for Donald Trump defamation appeal On 8 March 2024, Federal Insurance Company, part of The Chubb Corporation, posted a $91.63 million bond for Donald Trump in the E. Jean Carroll v. Donald J. Trump case. Despite an estimated net worth of over $2 billion, Trump needed a cash bond posted by Chubb in order to secure his appeal. While President, Trump appointed Chubb CEO Evan G. Greenberg to the White House advisory committee for trade policy and negotiations. When Chubb announced the securing of the bond, they claimed that this would be the only bond secured as Trump has another $454 million bond pending for his New York civil fraud case. On 18 March 2024, Trump's lawyers notified the Appellate Division of Manhattan Supreme Court that he was unable to secure a bond for the civil fraud case, seeming to confirm Chubb's position on not underwriting additional bonds for Trump. On 13 March 2024, CEO Evan Greenberg issued a letter to investors, customers, and brokers defending the move. Despite having deep personal connections to Trump, Greenberg claimed \"we frankly left our own personal feelings aside\" when deciding to issue the bond. Reversal on coal pledge In 2019, Chubb pledged not to insure energy companies that rely more than 30% on coal power. By 2025, Chubb had broken its pledge, as it insured a coal-fired power station."
}