{
  "ticker": "CBOE",
  "cik": "0001374310",
  "company_name": "Cboe Global Markets",
  "corrected_name": "Cboe Global Markets",
  "wiki_title_used": "Cboe Global Markets",
  "exists": true,
  "raw_text": "Cboe Global Markets, Inc. (formerly CBOE Holdings) is an American financial exchange operator headquartered in Chicago. It owns and operates a portfolio of exchanges and trading venues across equities, options, futures, and digital assets. \nFounded in 1973 as the Chicago Board Options Exchange (CBOE), the company also owns the stock exchange operator BATS Global Markets. Cboe is known for products such as the VIX volatility index for operating markets in North America, Europe, and Asia-Pacific.\n\nHistory\nFounded by the Chicago Board of Trade in 1973  and member-owned for several decades, the Chicago Board Options Exchange was the first exchange to list standardized, exchange-traded stock options, and began its first day of trading on April 26, 1973, in celebration of the 125th birthday of the Chicago Board of Trade.\nIn 1969, the vice chairman of the Chicago Board of Trade, Edmund \"Eddie\" O'Connor, developed the idea for an options exchange. At that time, options on stocks were traded in a New York-based, over-the-counter market which required a direct link between the buyer and seller and complex terms of sale. The options exchange that O'Connor imagined would use a central clearinghouse to facilitate trades and stand behind contracts. The Chicago Board of Trade established a committee to evaluate the concept.\nThe options market idea faced resistance from officials at the Securities and Exchange Commission. The CBOT hired Joseph Sullivan to address regulator concerns and present the concept to the New York brokerage community. In October 1971, the SEC relented and approved the effort.\nIn February 1972, the Chicago Board Options Exchange was incorporated as an independent body with its own bylaws and governing board. Joseph Sullivan became the president of the organization. Trading commenced on the exchange on April 26, 1973, and was conducted in the former CBOT smoking lounge. During its first full month of operation, 34,599 contracts were traded. By 1976, the monthly volume of trades had increased to 1.5 million.\nOver the next decade CBOE continued to operate from its location within the CBOT building. In 1984, CBOE moved to its next headquarters across the street at 400 S. LaSalle Street.\nOn January 19, 1993, the Chicago Board Options Exchange introduced the CBOE Volatility Index (VIX), created by Vanderbilt University finance professor Robert E. Whaley to measure 30-day implied volatility of S&P 100 options. In 2003, the underlying benchmark for the VIX was changed to the S&P 500. The company launched tradable products using VIX as the underlying index. Cboe developed and launched a futures exchange, and in early 2004 the company began trading VIX futures, after a survey of Goldman Sachs salespeople showed interest in trading VIX futures.\nOn March 11, 2010, CBOE filed paperwork to launch an initial public offering and began trading on the NASDAQ stock exchange on June 15, 2010. The company delisted from the NASDAQ and listed its shares on its own exchange in 2018.\nIn October 2017, the company rebranded from CBOE Holdings to Cboe Global Markets.\nIn September 2019, Cboe Global Markets announced it was relocating its headquarters to the Old Chicago Main Post Office and that a new trading floor would be constructed in the Chicago Board of Trade building, which was the space the exchange originally occupied in the 1970s and 1980s. The new trading floor opened in June 2022.\nIn 2024, William Carlson, founder of Belvedere Trading, filed a complaint with the Illinois Attorney Registration and Disciplinary Commission (ARDC) against Mark Francis Duffy, a former director at CBOE Global Markets. Carlson alleged that Duffy did not act on significant evidence of financial misconduct at Belvedere Trading while serving as both the firm’s legal counsel and a CBOE director. The complaint further suggested that Duffy’s dual role may have hindered regulatory oversight and contributed to continued financial irregularities at the company.\nIn June 2025, Carson publicly accused individuals associated with Belvedere and Cboe of participating in a $35 million equity fraud and cover-up scheme. In a police complaint and related filings, Carlson alleged that Duffy was made aware of the misconduct as early as 2011 but failed to act despite being compensated to review the case. Carlson also claimed that Belvedere Trading, a Cboe member firm, and several implicated individuals were Cboe members, raising concerns about potential conflicts of interest and lapses in Cboe’s self-regulatory oversight.\n\nMergers and acquisitions\nIn September 2011, CBOE Stock Exchange, which was owned by CBOE Holdings, entered into an agreement to acquire the National Stock Exchange.  The acquisition was completed on December 30, 2011, with both exchanges continuing to operate under separate names. The National Stock Exchange continued to be based in Jersey City.  The National Stock Exchange ceased trading operations on May 30, 2014.\nIn August 2015, CBOE finalized its acquisition of the LiveVol platform, a market data services provider.\nIn January 2016, CBOE announced it had purchased a majority stake in Vest Financial, an investment adviser specializing in options-centric products.\nIn September 2016, CBOE announced that it was purchasing BATS Global Markets for approximately US$3.2 billion. BATS was then the second-largest US stock exchange by shares traded and was known for being technology focused. Business Insider noted that by buying BATS, \"CBOE is looking to extend its geographical reach and products while cutting costs.\" The deal was completed in March 2017. Over the next few  years CBOE migrated its exchanges onto the BATS technology platform.\nIn February 2020, Cboe completed its acquisition of two data analytics firms, Hanweck and FT Options. That same year, CBOE acquired Trade Alert, a New York-based order flow analysis service provider. Also in 2020, Cboe acquired EuroCCP, the Dutch clearing house. The company already owned 20% of the clearing house and purchased the remaining 80%. In May 2020, the company announced it was expanding into Canada, via acquisition of the Canadian stock trading platform, MATCHNow, which operated an alternative trading system (ATS). Cboe acquired another ATS operator, BIDS Trading, in October 2020.\nIn June 2021, Cboe announced that it had completed its acquisition of Chi-X Asia Pacific. Through the acquisition, Cboe established a significant presence in the Asia Pacific region for the first time by gaining access to two of the world's largest securities markets in Japan and Australia. In November 2021, Cboe announced it had agreed to acquire NEO, the Canadian stock exchange operator.\nIn May 2022, Cboe completed its acquisition of Eris Digital Holdings (ErisX), a US-based digital asset spot market, regulated futures exchange, and regulated clearinghouse.\n\nOperations\nCboe Global Markets operates in North America, Europe, and Asia-Pacific, offering platforms for trading options, futures, equities, and foreign exchange. It owns stock exchanges in the U.S., Canada, the Netherlands, and Australia. In Canada, Cboe Canada accounts for about 15% of trading volume in listed securities. Cboe Australia was established following the acquisition of Chi-X in Australia and Japan. Its European arm, Cboe Clear Europe, based in London and Amsterdam, operates the largest stock exchange group in Europe by volume, and ranks second in Canada and third in the U.S. \nThe company also runs clearing houses, including Cboe Clear Europe, and operates Cboe Digital, a cryptocurrency exchange acquired in 2021 as ErisX. It is headquartered in Chicago, where it maintains an open outcry trading floor. \nCboe's key index options include those on the VIX, which tracks market volatility, and on the S&P 500 Index (SPX), along with other indices like the Russell 2000. \nFredric Tomczyk served as CEO from 2023 to 2025 and was succeeded by Craig Donohue in May 2025.\n\nSee also\nDirect Edge\n\nReferences\nExternal links\nOfficial website \nBusiness data for Cboe Global Markets:",
  "clean_text": "Cboe Global Markets, Inc. (formerly CBOE Holdings) is an American financial exchange operator headquartered in Chicago. It owns and operates a portfolio of exchanges and trading venues across equities, options, futures, and digital assets. Founded in 1973 as the Chicago Board Options Exchange (CBOE), the company also owns the stock exchange operator BATS Global Markets. Cboe is known for products such as the VIX volatility index for operating markets in North America, Europe, and Asia-Pacific. History Founded by the Chicago Board of Trade in 1973 and member-owned for several decades, the Chicago Board Options Exchange was the first exchange to list standardized, exchange-traded stock options, and began its first day of trading on April 26, 1973, in celebration of the 125th birthday of the Chicago Board of Trade. In 1969, the vice chairman of the Chicago Board of Trade, Edmund \"Eddie\" O'Connor, developed the idea for an options exchange. At that time, options on stocks were traded in a New York-based, over-the-counter market which required a direct link between the buyer and seller and complex terms of sale. The options exchange that O'Connor imagined would use a central clearinghouse to facilitate trades and stand behind contracts. The Chicago Board of Trade established a committee to evaluate the concept. The options market idea faced resistance from officials at the Securities and Exchange Commission. The CBOT hired Joseph Sullivan to address regulator concerns and present the concept to the New York brokerage community. In October 1971, the SEC relented and approved the effort. In February 1972, the Chicago Board Options Exchange was incorporated as an independent body with its own bylaws and governing board. Joseph Sullivan became the president of the organization. Trading commenced on the exchange on April 26, 1973, and was conducted in the former CBOT smoking lounge. During its first full month of operation, 34,599 contracts were traded. By 1976, the monthly volume of trades had increased to 1.5 million. Over the next decade CBOE continued to operate from its location within the CBOT building. In 1984, CBOE moved to its next headquarters across the street at 400 S. LaSalle Street. On January 19, 1993, the Chicago Board Options Exchange introduced the CBOE Volatility Index (VIX), created by Vanderbilt University finance professor Robert E. Whaley to measure 30-day implied volatility of S&P 100 options. In 2003, the underlying benchmark for the VIX was changed to the S&P 500. The company launched tradable products using VIX as the underlying index. Cboe developed and launched a futures exchange, and in early 2004 the company began trading VIX futures, after a survey of Goldman Sachs salespeople showed interest in trading VIX futures. On March 11, 2010, CBOE filed paperwork to launch an initial public offering and began trading on the NASDAQ stock exchange on June 15, 2010. The company delisted from the NASDAQ and listed its shares on its own exchange in 2018. In October 2017, the company rebranded from CBOE Holdings to Cboe Global Markets. In September 2019, Cboe Global Markets announced it was relocating its headquarters to the Old Chicago Main Post Office and that a new trading floor would be constructed in the Chicago Board of Trade building, which was the space the exchange originally occupied in the 1970s and 1980s. The new trading floor opened in June 2022. In 2024, William Carlson, founder of Belvedere Trading, filed a complaint with the Illinois Attorney Registration and Disciplinary Commission (ARDC) against Mark Francis Duffy, a former director at CBOE Global Markets. Carlson alleged that Duffy did not act on significant evidence of financial misconduct at Belvedere Trading while serving as both the firm’s legal counsel and a CBOE director. The complaint further suggested that Duffy’s dual role may have hindered regulatory oversight and contributed to continued financial irregularities at the company. In June 2025, Carson publicly accused individuals associated with Belvedere and Cboe of participating in a $35 million equity fraud and cover-up scheme. In a police complaint and related filings, Carlson alleged that Duffy was made aware of the misconduct as early as 2011 but failed to act despite being compensated to review the case. Carlson also claimed that Belvedere Trading, a Cboe member firm, and several implicated individuals were Cboe members, raising concerns about potential conflicts of interest and lapses in Cboe’s self-regulatory oversight. Mergers and acquisitions In September 2011, CBOE Stock Exchange, which was owned by CBOE Holdings, entered into an agreement to acquire the National Stock Exchange. The acquisition was completed on December 30, 2011, with both exchanges continuing to operate under separate names. The National Stock Exchange continued to be based in Jersey City. The National Stock Exchange ceased trading operations on May 30, 2014. In August 2015, CBOE finalized its acquisition of the LiveVol platform, a market data services provider. In January 2016, CBOE announced it had purchased a majority stake in Vest Financial, an investment adviser specializing in options-centric products. In September 2016, CBOE announced that it was purchasing BATS Global Markets for approximately US$3.2 billion. BATS was then the second-largest US stock exchange by shares traded and was known for being technology focused. Business Insider noted that by buying BATS, \"CBOE is looking to extend its geographical reach and products while cutting costs.\" The deal was completed in March 2017. Over the next few years CBOE migrated its exchanges onto the BATS technology platform. In February 2020, Cboe completed its acquisition of two data analytics firms, Hanweck and FT Options. That same year, CBOE acquired Trade Alert, a New York-based order flow analysis service provider. Also in 2020, Cboe acquired EuroCCP, the Dutch clearing house. The company already owned 20% of the clearing house and purchased the remaining 80%. In May 2020, the company announced it was expanding into Canada, via acquisition of the Canadian stock trading platform, MATCHNow, which operated an alternative trading system (ATS). Cboe acquired another ATS operator, BIDS Trading, in October 2020. In June 2021, Cboe announced that it had completed its acquisition of Chi-X Asia Pacific. Through the acquisition, Cboe established a significant presence in the Asia Pacific region for the first time by gaining access to two of the world's largest securities markets in Japan and Australia. In November 2021, Cboe announced it had agreed to acquire NEO, the Canadian stock exchange operator. In May 2022, Cboe completed its acquisition of Eris Digital Holdings (ErisX), a US-based digital asset spot market, regulated futures exchange, and regulated clearinghouse. Operations Cboe Global Markets operates in North America, Europe, and Asia-Pacific, offering platforms for trading options, futures, equities, and foreign exchange. It owns stock exchanges in the U.S., Canada, the Netherlands, and Australia. In Canada, Cboe Canada accounts for about 15% of trading volume in listed securities. Cboe Australia was established following the acquisition of Chi-X in Australia and Japan. Its European arm, Cboe Clear Europe, based in London and Amsterdam, operates the largest stock exchange group in Europe by volume, and ranks second in Canada and third in the U.S. The company also runs clearing houses, including Cboe Clear Europe, and operates Cboe Digital, a cryptocurrency exchange acquired in 2021 as ErisX. It is headquartered in Chicago, where it maintains an open outcry trading floor. Cboe's key index options include those on the VIX, which tracks market volatility, and on the S&P 500 Index (SPX), along with other indices like the Russell 2000. Fredric Tomczyk served as CEO from 2023 to 2025 and was succeeded by Craig Donohue in May 2025."
}