{
  "ticker": "CBRE",
  "cik": "0001138118",
  "company_name": "CBRE Group",
  "corrected_name": "CBRE Group",
  "wiki_title_used": "CBRE Group",
  "exists": true,
  "raw_text": "CBRE Group, Inc. (an initialism of Coldwell Banker Richard Ellis) is an American commercial real estate services and investment firm with corporate headquarters in Dallas, Texas and global financial headquarters at Lever House in Midtown Manhattan. It is the world's largest commercial real estate services and investment firm (based on 2022 revenue).\nThe firm is ranked 135th on the Fortune 500 and has been included in the Fortune 500 every year since 2008. CBRE serves more than 95 of the companies on the Fortune 100. It is one of the \"Big 4\" commercial real estate services companies, alongside Cushman & Wakefield, Colliers and JLL.\n\nServices\nCBRE provides services to both occupiers of and investors in real estate. For occupiers, CBRE provides facilities management, project management, transaction (both property sales and leasing) and consulting services, financial services, and valuation, among others. For investors, CBRE provide capital markets (property sales, commercial mortgage brokerage, loan origination and servicing), property leasing, investment management, property management, sustainability, valuation and development services, among others.\n\nHistory\nIn 1906, Tucker, Lynch & Coldwell, the earliest predecessor to CBRE, was established.\nIn 1913, the company added Benjamin Arthur Banker as a partner and changed the combined entity's name in 1918 to Coldwell, Kern & Banker. In 1919, the name became Coldwell, Kern, Cornwall & Banker, and in 1920, Coldwell, Cornwall & Banker. Cornwall retired in 1940, and the company name changed again to Coldwell, Banker & Company, which was shortened to Coldwell Banker in 1974.\nIn 1981, Coldwell Banker was acquired by Sears.\nIn 1989, Sears sold Coldwell Banker's commercial unit to a management-led buyout group including The Carlyle Group for approximately $300 million. After the buyout, the company was renamed CB Commercial Real Estate Group. The residential group retained the Coldwell Banker name.\nIn 1996, the company became a public company via an initial public offering, raising approximately $80 million.\nIn 1997, the company acquired Koll Real Estate Services for $145 million.\nIn 1998, CB Commercial merged with Richard Ellis International and changed its name to CB Richard Ellis (CBRE). It also purchased UK firm Hillier Parker which was rebranded CB Hillier Parker.\nIn 2001, CBRE was acquired in a leveraged buyout by an investment group led by Blum Capital for $800 million.\nIn 2003, the company acquired Insignia Financial Group for $415 million.\nIn 2004, CBRE once again became a public company via an initial public offering.\nIn 2006, the company's shares were added to the S&P 500 Index.\nIn 2006, the company acquired Trammell Crow Company for $2.2 billion.\nIn 2011, the company acquired the real estate investment business of ING Group for $940 million.\nIn 2011, the company changed its name to CBRE Group Inc.\nIn 2013, the company acquired Norland Managed Services, a facilities, energy and project management provider in the United Kingdom and Ireland.\nIn 2015, the company acquired Global Workplace Solutions from Johnson Controls.\nIn 2018, the company acquired FacilitySource.\nIn 2019, the company acquired the London developer Telford Homes.\nIn 2020, CBRE moved its headquarters from Los Angeles to Trammell Crow's former headquarters building in Dallas, Texas.\nIn 2021, CBRE Group Inc paid £960 million for a 60% stake in the UK multidisciplinary professional services firm Turner & Townsend. In June 2024, CBRE announced plans to merge its project management businesses into Turner & Townsend, creating a $3bn business employing over 20,000 staff in 60 countries. CBRE will also increase its T&T ownership stake to 70%.\nIn January 2025, CBRE established a new global financial headquarters at Lever House in Midtown Manhattan.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for CBRE Group, Inc.:",
  "clean_text": "CBRE Group, Inc. (an initialism of Coldwell Banker Richard Ellis) is an American commercial real estate services and investment firm with corporate headquarters in Dallas, Texas and global financial headquarters at Lever House in Midtown Manhattan. It is the world's largest commercial real estate services and investment firm (based on 2022 revenue). The firm is ranked 135th on the Fortune 500 and has been included in the Fortune 500 every year since 2008. CBRE serves more than 95 of the companies on the Fortune 100. It is one of the \"Big 4\" commercial real estate services companies, alongside Cushman & Wakefield, Colliers and JLL. Services CBRE provides services to both occupiers of and investors in real estate. For occupiers, CBRE provides facilities management, project management, transaction (both property sales and leasing) and consulting services, financial services, and valuation, among others. For investors, CBRE provide capital markets (property sales, commercial mortgage brokerage, loan origination and servicing), property leasing, investment management, property management, sustainability, valuation and development services, among others. History In 1906, Tucker, Lynch & Coldwell, the earliest predecessor to CBRE, was established. In 1913, the company added Benjamin Arthur Banker as a partner and changed the combined entity's name in 1918 to Coldwell, Kern & Banker. In 1919, the name became Coldwell, Kern, Cornwall & Banker, and in 1920, Coldwell, Cornwall & Banker. Cornwall retired in 1940, and the company name changed again to Coldwell, Banker & Company, which was shortened to Coldwell Banker in 1974. In 1981, Coldwell Banker was acquired by Sears. In 1989, Sears sold Coldwell Banker's commercial unit to a management-led buyout group including The Carlyle Group for approximately $300 million. After the buyout, the company was renamed CB Commercial Real Estate Group. The residential group retained the Coldwell Banker name. In 1996, the company became a public company via an initial public offering, raising approximately $80 million. In 1997, the company acquired Koll Real Estate Services for $145 million. In 1998, CB Commercial merged with Richard Ellis International and changed its name to CB Richard Ellis (CBRE). It also purchased UK firm Hillier Parker which was rebranded CB Hillier Parker. In 2001, CBRE was acquired in a leveraged buyout by an investment group led by Blum Capital for $800 million. In 2003, the company acquired Insignia Financial Group for $415 million. In 2004, CBRE once again became a public company via an initial public offering. In 2006, the company's shares were added to the S&P 500 Index. In 2006, the company acquired Trammell Crow Company for $2.2 billion. In 2011, the company acquired the real estate investment business of ING Group for $940 million. In 2011, the company changed its name to CBRE Group Inc. In 2013, the company acquired Norland Managed Services, a facilities, energy and project management provider in the United Kingdom and Ireland. In 2015, the company acquired Global Workplace Solutions from Johnson Controls. In 2018, the company acquired FacilitySource. In 2019, the company acquired the London developer Telford Homes. In 2020, CBRE moved its headquarters from Los Angeles to Trammell Crow's former headquarters building in Dallas, Texas. In 2021, CBRE Group Inc paid £960 million for a 60% stake in the UK multidisciplinary professional services firm Turner & Townsend. In June 2024, CBRE announced plans to merge its project management businesses into Turner & Townsend, creating a $3bn business employing over 20,000 staff in 60 countries. CBRE will also increase its T&T ownership stake to 70%. In January 2025, CBRE established a new global financial headquarters at Lever House in Midtown Manhattan."
}