{
  "ticker": "CCI",
  "cik": "0001051470",
  "company_name": "Crown Castle",
  "corrected_name": "Crown Castle",
  "wiki_title_used": "Crown Castle",
  "exists": true,
  "raw_text": "Crown Castle Inc. is a real estate investment trust and provider of shared communications infrastructure in the United States headquartered in Houston, Texas. Operating with 100 offices worldwide, its network includes over 40,000 cell towers and approximately 85,000 route miles of fiber supporting small cells and fiber systems.\n\nHistory\nCrown Communications (1980-1997) and Castle Tower (1994-1997)\nCrown Communications was founded in 1980 by Robert and Barbara Crown, natives of the Pittsburgh suburb of Green Tree. Crown Communications built, sited, owned and maintained cell towers across the United States; within Pittsburgh and its surrounding region, the company had a near monopoly on cell towers.\nCastle Tower was founded in 1994, starting with 133 Houston-area towers, and initially backed by two private investment firms. Among its first operational purchases was the transmission sites of the BBC, where Castle and French communications firm TDF Group outbid NTL Incorporated.\nIn 1997, Crown Communications merged with Houston's Castle Tower Corporation to form Crown Castle International. The terms of the merger stipulated that Castle would buy out Crown Communications, though the name of the company would be changed to Crown Castle and that the company would continue to operate with a strong presence in the Pittsburgh area. The merger of the two firms, completed in January 1998, more than doubled the assets of the now-merged Crown Castle.\n\nCrown Castle International (1997-2015)\nOn August 31, 2004, Crown Castle completed the sale of its UK subsidiary, Crown Castle UK, to National Grid Transco plc for over $2 billion.\nNational Grid Transco plc was renamed to National Grid plc in July 2005, while Crown Castle UK was renamed National Grid Wireless in October 2005.\nOn January 12, 2007, Crown Castle completed the acquisition of Global Signal Inc., another U.S. tower operator which was based in Sarasota, Florida.\nOn December 11, 2011, Crown Castle announced an agreement to purchase NextG Networks, Inc. for nearly $1 billion. NextG had over 7,000 distributed antenna system nodes on-air at the time of the agreement with another 1,500 nodes under construction as well as rights to more than 4,600 miles of fiber optic cables.\nOn September 28, 2012, Crown Castle entered a tower leasing agreement with T-Mobile US. The deal leases 7,200 wireless towers to the company for a term of 28 years in exchange for $2.4 billion. After the deal ends in 2040, Crown Castle will have an opportunity to purchase the towers for an additional $2.4 billion. Similarly, on October 20, 2013, Crown Castle entered a tower leasing agreement with AT&T Mobility. The deal leases 9,700 wireless towers to the company for a term of 28 years in exchange for $4.85 billion. Crown Castle also gained the right to acquire the towers outright in the future for $4.2 billion. 600 towers will be acquired outright by Crown Castle in the future. AT&T will pay $1,900 a month per site to access the towers with rent rising approximately 2% per year.\nIn 2015, Crown Castle expanded into small cell technology in order to boost the capability and widen the scope of its network. The acquisition of Quanta Fiber Networks (Sunesys) in 2015 gave the company access to over 10,000 miles of fiber in various metro areas like Los Angeles, Chicago, Silicon Valley and Atlanta. Prior to that, in 2014, the company acquired the 24/7 Mid-Atlantic Network with over 800 miles of fiber along the East Coast of U.S.\n\nDomestic-exclusive firm (2015-present)\nCrown Castle International sold off its Australian assets in 2015, removing its international focus and making the company exclusively operational in the United States. The company sold its last towers to Macquarie Group for $1.6 billion, which after taxes and fees gave a net gain of $1.3 billion to the company. The sale was motivated to boost an expansion to its domestic operations.\nOn July 19, 2017, Crown Castle signed an agreement to acquire Lightower, a fiber network operator in the northeast U.S., for approximately $7.1 billion. The transaction increased Crown Castle's fiber network to approximately 60,000 route miles. The buyout had a significant impact on second-quarter earnings reported in late July. Revenue increased by 3.3% and small cells increased sales by 42%. Crown Castle also announced a $3.25 billion common stock offering as well as a $1.5 billion sale of convertible preferred shares to help finance the Lightower purchase.\nBased on its 2019 revenue, in 2020 Crown Castle joined the Fortune 500 list for the first time, at number 496.\nOn March 13, 2025, Crown Castle announced that it will divest from its fiber and small cell businesses and focus on towers. Crown Castle agreed to sell its fiber assets to Zayo Group Holdings and its small cell assets to EQT Active Core Infrastructure for $4.25 billion each.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Crown Castle International Corp.:",
  "clean_text": "Crown Castle Inc. is a real estate investment trust and provider of shared communications infrastructure in the United States headquartered in Houston, Texas. Operating with 100 offices worldwide, its network includes over 40,000 cell towers and approximately 85,000 route miles of fiber supporting small cells and fiber systems. History Crown Communications (1980-1997) and Castle Tower (1994-1997) Crown Communications was founded in 1980 by Robert and Barbara Crown, natives of the Pittsburgh suburb of Green Tree. Crown Communications built, sited, owned and maintained cell towers across the United States; within Pittsburgh and its surrounding region, the company had a near monopoly on cell towers. Castle Tower was founded in 1994, starting with 133 Houston-area towers, and initially backed by two private investment firms. Among its first operational purchases was the transmission sites of the BBC, where Castle and French communications firm TDF Group outbid NTL Incorporated. In 1997, Crown Communications merged with Houston's Castle Tower Corporation to form Crown Castle International. The terms of the merger stipulated that Castle would buy out Crown Communications, though the name of the company would be changed to Crown Castle and that the company would continue to operate with a strong presence in the Pittsburgh area. The merger of the two firms, completed in January 1998, more than doubled the assets of the now-merged Crown Castle. Crown Castle International (1997-2015) On August 31, 2004, Crown Castle completed the sale of its UK subsidiary, Crown Castle UK, to National Grid Transco plc for over $2 billion. National Grid Transco plc was renamed to National Grid plc in July 2005, while Crown Castle UK was renamed National Grid Wireless in October 2005. On January 12, 2007, Crown Castle completed the acquisition of Global Signal Inc., another U.S. tower operator which was based in Sarasota, Florida. On December 11, 2011, Crown Castle announced an agreement to purchase NextG Networks, Inc. for nearly $1 billion. NextG had over 7,000 distributed antenna system nodes on-air at the time of the agreement with another 1,500 nodes under construction as well as rights to more than 4,600 miles of fiber optic cables. On September 28, 2012, Crown Castle entered a tower leasing agreement with T-Mobile US. The deal leases 7,200 wireless towers to the company for a term of 28 years in exchange for $2.4 billion. After the deal ends in 2040, Crown Castle will have an opportunity to purchase the towers for an additional $2.4 billion. Similarly, on October 20, 2013, Crown Castle entered a tower leasing agreement with AT&T Mobility. The deal leases 9,700 wireless towers to the company for a term of 28 years in exchange for $4.85 billion. Crown Castle also gained the right to acquire the towers outright in the future for $4.2 billion. 600 towers will be acquired outright by Crown Castle in the future. AT&T will pay $1,900 a month per site to access the towers with rent rising approximately 2% per year. In 2015, Crown Castle expanded into small cell technology in order to boost the capability and widen the scope of its network. The acquisition of Quanta Fiber Networks (Sunesys) in 2015 gave the company access to over 10,000 miles of fiber in various metro areas like Los Angeles, Chicago, Silicon Valley and Atlanta. Prior to that, in 2014, the company acquired the 24/7 Mid-Atlantic Network with over 800 miles of fiber along the East Coast of U.S. Domestic-exclusive firm (2015-present) Crown Castle International sold off its Australian assets in 2015, removing its international focus and making the company exclusively operational in the United States. The company sold its last towers to Macquarie Group for $1.6 billion, which after taxes and fees gave a net gain of $1.3 billion to the company. The sale was motivated to boost an expansion to its domestic operations. On July 19, 2017, Crown Castle signed an agreement to acquire Lightower, a fiber network operator in the northeast U.S., for approximately $7.1 billion. The transaction increased Crown Castle's fiber network to approximately 60,000 route miles. The buyout had a significant impact on second-quarter earnings reported in late July. Revenue increased by 3.3% and small cells increased sales by 42%. Crown Castle also announced a $3.25 billion common stock offering as well as a $1.5 billion sale of convertible preferred shares to help finance the Lightower purchase. Based on its 2019 revenue, in 2020 Crown Castle joined the Fortune 500 list for the first time, at number 496. On March 13, 2025, Crown Castle announced that it will divest from its fiber and small cell businesses and focus on towers. Crown Castle agreed to sell its fiber assets to Zayo Group Holdings and its small cell assets to EQT Active Core Infrastructure for $4.25 billion each."
}