{
  "ticker": "CDNS",
  "cik": "0000813672",
  "company_name": "Cadence Design Systems",
  "corrected_name": "Cadence Design Systems",
  "wiki_title_used": "Cadence Design Systems",
  "exists": true,
  "raw_text": "Cadence Design Systems, Inc. (stylized as cādence) is an American multinational technology and computational software company headquartered in San Jose, California.  Initially specialized in electronic design automation (EDA) software for the semiconductor industry, currently the company makes software and hardware for designing products such as integrated circuits, systems on chips (SoCs), printed circuit boards, and pharmaceutical drugs, also licensing intellectual property for the electronics, aerospace, defense and automotive industries.\n\nHistory\n1983–1999\nFounded in 1983 in San Jose, California, Cadence Design Systems began as an electronic design automation (EDA) company named Solomon Design Automation (SDA). SDA's cofounders included James Solomon, Richard Newton, and Alberto Sangiovanni-Vincentelli. Cadence was formed by the merger of SDA and ECAD. A public company, ECAD had been co-founded by Ping Chao, Glen Antle, and Paul Huang in 1982. Cadence Design Systems was officially formed through the 1988 merger of SDA and ECAD, with Joseph Costello appointed both CEO and president of the newly combined company. After the merger, Cadence began trading on the New York Stock Exchange and Costello oversaw further mergers and acquisitions.\nIn 1989, the company acquired Gateway Design Automation for $72 million. In 1990 it acquired Automated Systems Inc., and in doing so added \"board design to its existing line of chip design software.\" In 1991, Cadence acquired its rival Valid Logic Systems for around $200 million, its biggest acquisition yet. The revenues of the combined company were $390 million, according to the New York Times. \nIn 1996, Cadence acquired High Level Design Systems, at which point Cadence had 3,300 employees and $742 million in annual revenue. Following the resignation of Cadence's original CEO Joe Costello in 1997, Jack Harding was appointed CEO. Ray Bingham was named CEO in 1999. Cadence purchased Ambit Design Systems for $260 million, which made tools for system-on-a-chip technology, in 1998, and OrCAD Systems in 1999. Cadence acquired Quickturn Design Systems in 1999, preventing a hostile takeover attempt by Mentor Graphics.\n\n2000–2019\nUnder urging by executives such as Jim Hogan and executive vice president Penny Herscher, between 2001 and 2003, Cadence purchased a number of implementation tools through acquisition, such as Silicon Perspective, Verplex, and Celestry Design. The acquisitions were apparently in part to counter the 2001 purchase of Avanti by Synopsys, as Synopsys had become their primary market rival. In 2004, Mike Fister became Cadence's new CEO and president, with Ray Bingham becoming chairman. The former chairman, Donald L. Lucas, remained on the Cadence board. Between 2004 and 2007, Cadence purchased four companies, including the software developer Verisity, and in 2006, it spent $1 billion in stock buybacks.\nIn 2007, Cadence announced it would be introducing a new chip-making process that laid wires diagonally as well as horizontally and vertically. In June 2007, Cadence had a market value of around $6.4 billion. That year, Cadence was rumored to be in talks with Kohlberg Kravis Roberts and Blackstone Group regarding a possible sale of the company. Cadence withdrew a $1.6 billion offer to purchase Mentor Graphics in 2008. Also that year, Cadence's board appointed Lip-Bu Tan as acting CEO, after the resignation of Mike Fister; Tan had served on the Cadence board of directors since 2004. In January 2009, the board of directors of Cadence voted unanimously to confirm Lip-Bu Tan as president and CEO. In 2011, it purchased Altos Design Automation. Subsequent notable acquisitions included Cosmic Circuits and Tensilica in 2013, Forte Design Systems in 2014, and the AWR Corporation in 2019.\n\n2020–2025\nCadence had 9,300 employees and annual revenue of $3 billion in 2021.  Most of its revenue came from licensing its software and intellectual property. In April 2021, following a Washington Post report on the use of Cadence and Synopsys technology in the People's Liberation Army's military-civil fusion efforts, U.S. legislators Michael McCaul and Tom Cotton requested that the United States Department of Commerce tighten controls on the sales of semiconductor manufacturing software. On December 15, 2021, Anirudh Devgan assumed the role of Cadence president & CEO, after having been named Cadence president in 2017. Lip-Bu Tan retired as CEO and became executive chairman and left this position and the board in May 2023. In 2021, Cadence launched an artificial intelligence platform to streamline processor development.\nAlthough most of Cadence's customers for decades were \"traditional semiconductor firms,\" around 40% of Cadence's revenue by 2022 came from customers who were \"systems\" oriented, or seeking products tailored for various industries that utilized chips in a central role. Cadence was also increasingly designing customized chips for clients and having them manufactured by third parties such as Taiwan Semiconductor Manufacturing, a practice which had become more popular in the face of worldwide chip shortages and shipping issues, according to Reuters. By late 2022, Cadence had clients such as Tesla and Apple Inc. Cadence acquired OpenEye Scientific Software for $500 million in September 2022, rebranding the company OpenEye Cadence Molecular Sciences and making it into a business unit. OpenEye signed Pfizer as a software client in October 2023. \nCadence purchased several businesses from Rambus in 2023.  In February 2024, Cadence \"quietly stepped into the supercomputer business,\" according to TechRadar, when it unveiled the M1, its own supercomputer designed to run computational fluid dynamics (CFD) while utilizing AI. In June 2024, Cadence purchased BETA CAE Systems.\nIn January 2025, Cadence announced the acquisition of Secure-IC, an embedded security IP platform provider; the acquisition is expected to close by mid-2025, following the usual regulatory approvals and other closing conditions, and be immaterial to 2025 revenue and earnings.\nIn mid-2025, the Trump administration briefly paused the issuing of licenses for exports of American EDA software to China, including Cadence products. In July 2025, it was announced that Cadence would plead guilty to violating U.S. export controls and pay US$140 million.\nOn September 4, 2025, Cadence Design Systems announced it would acquire the design and engineering business of Stockholm-based Hexagon AB for €2.7 billion (approximately $3.16 billion) in a stock-and-cash deal. The acquisition includes Hexagon's MSC Software business, a provider of engineering simulation and analysis software and workflows.\n\nProducts\nOriginally known as a creator of electronic design automation (EDA) software, the company currently develops software, hardware and intellectual property (IP) used to design chips, chiplet-style products, and printed circuit boards, while also selling hardware systems that run its chip design software.\nIt also has tools for \"electromagnetics, thermal and computational fluid dynamics in the high-tech electronics, aerospace and defense and automotive sectors,\" and according to Investor's Business Daily in 2023, it specializes in products for fields such as \"artificial intelligence and machine learning, cloud computing, 3D technology, and AI-enabled big data analytics.\" Among market applications are \"hyperscale computing, 5G communications, automotive, mobile, aerospace, consumer, industrial and health care.\"\n\nIntegrated circuit software\nThe company develops a number of technologies for creating custom integrated circuits. For example, its Virtuoso Platform, later renamed Virtuoso Studio, incorporates tools for designing full-custom integrated circuits. In 2019, Cadence introduced its Spectre X parallel circuit simulator, so that users could distribute time- and frequency-domain simulations across hundreds of CPUs for speed. Cadence also offers AWR, a radio frequency to millimeter wave design environment for designing 5G/wireless products. AWR is used for communications, aerospace and defense, semiconductor, computer, and consumer electronics.\n\nDigital implementation and signoff\nCadence has a number of digital implementation and signoff tools, including Genus, Innovus, Tempus & Voltus, among others. In 2020, Cadence integrated its Innovus place and route engine and optimizer into Genus Synthesis. Stratus is Cadence's high-level synthesis tool, and is used to create RTL implementations from C, C++, or SystemC code. Other formal verification and signoff tools include Conformal Equivalence Checker, Joules RTL Power Solution, Quantus Extraction Solution, and Cadence's Modus DFT Software Solution.\n\nSystem verification\nCadence has developed a number of formal verification products for chip design. JasperGold is a formal verification tool, initially introduced in 2003 and upgraded with machine learning in 2019. vManager is a verification management tool for tracking the verification process. Cadence announced Perspec System Verifier in 2014 for defining and verifying system-level verification scenarios, with Perspec made compatible with the Accellera Portable Test and Stimulus Standard (PSS) several years later. Introduced in 2017, Cadence's parallel simulator Xcelium is based on a multi-core parallel computing architecture.\n\nHardware emulation\nIn 2015, Cadence announced the Palladium Z1 hardware emulation platform, for verifying billion-gate designs. which was based on emulation technology from Cadence's 1998 acquisition of Quickturn. Cadence announced Palladium Z2 in 2021 as a successor to the Z1 platform with improved performance.\nThe Protium FPGA prototyping platform was introduced in 2014, followed by the Protium S1 in 2017, which was built on Xilinx Virtex UltraScale FPGAs. Protium X1 rack-based prototyping was introduced in 2019, which Cadence claimed supported a 1.2 billion gate SoCs at around 5 MHz. with Palladium S1/X1 and Protium sharing a single compilation flow. In 2021, Protium X2 was announced; Cadence claimed a 1.5X performance and 2X capacity improvement over Protium X1.\n\nSIP blocks\nCadence supplies semiconductor intellectual property (SIP) blocks, covering interface design, USB, MIPI, ethernet, memory, analog, SoC peripherals, and data plane processing units. Cadence also develops chip verification technologies including simulators and formal verification tools. Cadence develops Tensilica DSP processors for audio, vision, wireless modems, and convolutional neural nets. Tensilica DSP processors IP in 2019 included: Tensilica Vision DSPs for imaging, vision, and AI processing; Tensilica HiFi DSPs for audio processing; Tensilica Fusion DSPs for IoT; Tensilica ConnX DSPs for radar, lidar, and communications processing; and Tensilica DNA Processor Family for AI acceleration. In 2021, Cadence launched the Tensilica AI Platform to accelerate AI SoC development and improve performances.\n\nPCB and packaging technologies\nThe company provides several tools for the design of printed circuit boards (PCB) and of chip packages. Its Allegro Platform covers co-design of integrated circuits, packages, and PCBs on industrial scale. The OrCAD/PSpice product line aims at smaller design teams and individual PCB designers. OrbitIO Interconnect Designer is a die/package planning & route optimization tool. InspectAR uses augmented reality to map out complicated circuit board electronics for real-time labelling of board schematics.\n\nSystems design and analysis\nThe company has a number of tools for system analysis. Sigrity offers tools for signal, power integrity, and thermal integrity analysis and IC package design. Introduced in April 2019 as part of Cadence's expansion into system analysis, Clarity is a 3D field solver for electromagnetic analysis, that uses distributed adaptive meshing to partition jobs across multiple cores. In September 2019, Cadence announced Celsius, a parallel architecture thermal solver that uses  finite element analysis for solid structures and computational fluid dynamics (CFD) for fluids. \nCascade Technologies, Inc includes hi-fidelity CFD solvers for multiphysics analysis of turbulence fluid flow. Acquired by Cadence from Pointwise in 2021, Fidelity Pointwise is for computational fluid dynamics (CFD) mesh generation.\n\nMachine design and digital twins\nCadence in 2021 acquired a number of system analysis products from NUMECA, known for software tools used in the automotive, marine, aerospace, and power generation industries. Among the tools were Fidelity (formerly known as OMNIS), a computational fluid dynamics (CFD), mesh generation, multi-physics simulation, and optimization product.  Its Cadence Reality digital twin platform creates manipulatable digital models of designs or factories.\nCadence Design Systems in February 2024 launched its Cadence Millennium Enterprise Multiphysics Platform, or Millennium M1. The hardware/software combination was designed for creating digital twins. It draws from Cadence's older Fidelity CFD suite.\n\nDrug design\nCadence's OpenEye Scientific division has computational molecular modeling and simulation software used by pharmaceutical and biotechnology companies for purposes such as drug discovery and antibody discovery. The Orion is OpenEye's software-as-a-service platform. OpenEye Scientific has its headquarters in Santa Fe, New Mexico.\n\nArtificial intelligence\nAccording to Reuters, in 2023 Cadence has been \"providing tools to design chips for AI\" and \"adding AI into its own software to help in the complex process of designing chips.\" Cerebrus was released in 2021, and is a machine learning-based chip design software which utilizes reinforcement learning and is meant to automatically optimize the Cadence digital design flow. In 2022, Cadence introduced the AI platform Optimality Intelligent System Explorer, a system design tool with multiphysics system analysis software. Designed to be compatible with Clarity 3D and SigrityX, Microsoft was an early adopter. In September 2023, Cadence released software called ChipGPT, allowing companies to create custom silicon with assistance from AI.\n\nRecognition\nIn 2016, former Cadence CEO Lip-Bu Tan was awarded the Dr. Morris Chang Exemplary Leadership Award by the Global Semiconductor Alliance. In 2019, Investor's Business Daily ranked Cadence Design Systems #5 on its 50 Best Environmental, Social, and Governance (ESG) Companies list. In 2020, Cadence ranked #45 on People magazine's Companies that Care list. Fortune magazine named Cadence to its 100 Best Companies to Work For list for the sixth consecutive year in 2020. In 2021, Anirudh Devgan was awarded the prestigious IEEE/SEMI Phil Kaufman award and in 2022 was inducted into National Academy of Engineering.\n\nSponsorship\nIn May 2022, the Formula 1 motor racing team McLaren announced a multi-year partnership deal with Cadence. Cadence partnered with the San Francisco 49ers in April 2023 on a several year technology project to fix energy efficiencies at Levi's Stadium. The deal also gave Cadence the naming rights to the team's mobile app.\n\nAcquisitions timeline\nControversies\nLawsuits\nAvanti Corporation  From 1995 until 2002, Cadence was involved in a 6-year-long legal dispute with Avanti Corporation (brand name \"Avant!\"), in which Cadence claimed Avanti stole Cadence code, and Avanti denied it. According to Business Week \"The Avanti case is probably the most dramatic tale of white-collar crime in the history of Silicon Valley\". The Avanti executives eventually pleaded no contest and Cadence received several hundred million dollars in restitution. Avanti was then purchased by Synopsys, which paid $265 million more to settle the remaining claims. The case resulted in a number of legal precedents.\nAptix Corporation Quickturn Design Systems, a company acquired by Cadence, was involved in a series of legal events with Aptix Corporation. Aptix licensed a patent to Mentor Graphics and the two companies jointly sued Quickturn over an alleged patent infringement. Amr Mohsen, CEO of Aptix, forged and tampered with legal evidence and was subsequently charged with conspiracy, perjury, and obstruction of justice. Mohsen was arrested after violating his bail agreement by attempting to flee the country. While in jail, Mohsen plotted to intimidate witnesses and kill the federal judge presiding over his case. Mohsen was further charged with attempting to delay a federal trial by feigning incompetency. Due to the overwhelming misconduct, the judge ruled the lawsuit as unenforceable and Mohsen was sentenced to 17 years in prison. Mentor Graphics subsequently sued Aptix to recoup legal costs. Cadence also sued Mentor Graphics and Aptix to recover legal costs.\nBerkeley Design Automation In 2013, Cadence sued Berkeley Design Automation (BDA) for circumvention of a license scheme to link its Analog FastSpice (AFS) simulator to Cadence's Analog Design Environment (Virtuoso ADE). The lawsuit was settled less than one year later with an undisclosed payment of BDA and a multi-year agreement to support interoperability of AFS with ADE through Cadence's official interface. BDA was bought by Mentor Graphics a few months later.\n\nExport control violations and Chinese military university sales\nIn July 2025, Cadence Design Systems agreed to plead guilty to criminal charges and pay over $140 million in combined penalties for illegally exporting semiconductor design technology to China's National University of Defense Technology (NUDT), a military university controlled by China's Central Military Commission. According to the U.S. Department of Justice and Bureau of Industry and Security, Cadence's Chinese subsidiary knowingly sold Electronic Design Automation (EDA) hardware, software, and semiconductor design technology valued at over $45 million to NUDT between 2015 and 2021, despite the university being placed on the U.S. Entity List in February 2015 due to its use of American technology for supercomputers \"believed to support nuclear explosive simulation and military simulation activities.\"\nThe violations involved employees at Cadence's Chinese subsidiary using intermediary companies, including Central South CAD Center (CSCC) and later Phytium Technology, to disguise sales to the restricted military university. Internal communications revealed that Cadence China employees were explicitly instructed to refer to NUDT only in Chinese characters and use \"CSCC\" in English correspondence because \"the subject [was] too sensitive.\" The Department of Justice noted that Cadence received only partial cooperation credit because the company \"failed to voluntarily disclose the misconduct\" and did not fully facilitate interviews of China-based employees, ultimately resulting in the company being placed on three years of corporate probation.\n\nSee also\nComparison of EDA software\nList of EDA companies\nList of semiconductor IP core vendors\nList of the largest software companies\nList of S&P 400 companies\nSemiconductor intellectual property core\nKen Kundert, Cadence fellow and creator of the Spectre circuit simulation family of products (including SpectreRF) and the Verilog-A analog hardware description language\n\nReferences\nExternal links\nOfficial website \nBusiness data for Cadence Design Systems, Inc.:",
  "clean_text": "Cadence Design Systems, Inc. (stylized as cādence) is an American multinational technology and computational software company headquartered in San Jose, California. Initially specialized in electronic design automation (EDA) software for the semiconductor industry, currently the company makes software and hardware for designing products such as integrated circuits, systems on chips (SoCs), printed circuit boards, and pharmaceutical drugs, also licensing intellectual property for the electronics, aerospace, defense and automotive industries. History 1983–1999 Founded in 1983 in San Jose, California, Cadence Design Systems began as an electronic design automation (EDA) company named Solomon Design Automation (SDA). SDA's cofounders included James Solomon, Richard Newton, and Alberto Sangiovanni-Vincentelli. Cadence was formed by the merger of SDA and ECAD. A public company, ECAD had been co-founded by Ping Chao, Glen Antle, and Paul Huang in 1982. Cadence Design Systems was officially formed through the 1988 merger of SDA and ECAD, with Joseph Costello appointed both CEO and president of the newly combined company. After the merger, Cadence began trading on the New York Stock Exchange and Costello oversaw further mergers and acquisitions. In 1989, the company acquired Gateway Design Automation for $72 million. In 1990 it acquired Automated Systems Inc., and in doing so added \"board design to its existing line of chip design software.\" In 1991, Cadence acquired its rival Valid Logic Systems for around $200 million, its biggest acquisition yet. The revenues of the combined company were $390 million, according to the New York Times. In 1996, Cadence acquired High Level Design Systems, at which point Cadence had 3,300 employees and $742 million in annual revenue. Following the resignation of Cadence's original CEO Joe Costello in 1997, Jack Harding was appointed CEO. Ray Bingham was named CEO in 1999. Cadence purchased Ambit Design Systems for $260 million, which made tools for system-on-a-chip technology, in 1998, and OrCAD Systems in 1999. Cadence acquired Quickturn Design Systems in 1999, preventing a hostile takeover attempt by Mentor Graphics. 2000–2019 Under urging by executives such as Jim Hogan and executive vice president Penny Herscher, between 2001 and 2003, Cadence purchased a number of implementation tools through acquisition, such as Silicon Perspective, Verplex, and Celestry Design. The acquisitions were apparently in part to counter the 2001 purchase of Avanti by Synopsys, as Synopsys had become their primary market rival. In 2004, Mike Fister became Cadence's new CEO and president, with Ray Bingham becoming chairman. The former chairman, Donald L. Lucas, remained on the Cadence board. Between 2004 and 2007, Cadence purchased four companies, including the software developer Verisity, and in 2006, it spent $1 billion in stock buybacks. In 2007, Cadence announced it would be introducing a new chip-making process that laid wires diagonally as well as horizontally and vertically. In June 2007, Cadence had a market value of around $6.4 billion. That year, Cadence was rumored to be in talks with Kohlberg Kravis Roberts and Blackstone Group regarding a possible sale of the company. Cadence withdrew a $1.6 billion offer to purchase Mentor Graphics in 2008. Also that year, Cadence's board appointed Lip-Bu Tan as acting CEO, after the resignation of Mike Fister; Tan had served on the Cadence board of directors since 2004. In January 2009, the board of directors of Cadence voted unanimously to confirm Lip-Bu Tan as president and CEO. In 2011, it purchased Altos Design Automation. Subsequent notable acquisitions included Cosmic Circuits and Tensilica in 2013, Forte Design Systems in 2014, and the AWR Corporation in 2019. 2020–2025 Cadence had 9,300 employees and annual revenue of $3 billion in 2021. Most of its revenue came from licensing its software and intellectual property. In April 2021, following a Washington Post report on the use of Cadence and Synopsys technology in the People's Liberation Army's military-civil fusion efforts, U.S. legislators Michael McCaul and Tom Cotton requested that the United States Department of Commerce tighten controls on the sales of semiconductor manufacturing software. On December 15, 2021, Anirudh Devgan assumed the role of Cadence president & CEO, after having been named Cadence president in 2017. Lip-Bu Tan retired as CEO and became executive chairman and left this position and the board in May 2023. In 2021, Cadence launched an artificial intelligence platform to streamline processor development. Although most of Cadence's customers for decades were \"traditional semiconductor firms,\" around 40% of Cadence's revenue by 2022 came from customers who were \"systems\" oriented, or seeking products tailored for various industries that utilized chips in a central role. Cadence was also increasingly designing customized chips for clients and having them manufactured by third parties such as Taiwan Semiconductor Manufacturing, a practice which had become more popular in the face of worldwide chip shortages and shipping issues, according to Reuters. By late 2022, Cadence had clients such as Tesla and Apple Inc. Cadence acquired OpenEye Scientific Software for $500 million in September 2022, rebranding the company OpenEye Cadence Molecular Sciences and making it into a business unit. OpenEye signed Pfizer as a software client in October 2023. Cadence purchased several businesses from Rambus in 2023. In February 2024, Cadence \"quietly stepped into the supercomputer business,\" according to TechRadar, when it unveiled the M1, its own supercomputer designed to run computational fluid dynamics (CFD) while utilizing AI. In June 2024, Cadence purchased BETA CAE Systems. In January 2025, Cadence announced the acquisition of Secure-IC, an embedded security IP platform provider; the acquisition is expected to close by mid-2025, following the usual regulatory approvals and other closing conditions, and be immaterial to 2025 revenue and earnings. In mid-2025, the Trump administration briefly paused the issuing of licenses for exports of American EDA software to China, including Cadence products. In July 2025, it was announced that Cadence would plead guilty to violating U.S. export controls and pay US$140 million. On September 4, 2025, Cadence Design Systems announced it would acquire the design and engineering business of Stockholm-based Hexagon AB for €2.7 billion (approximately $3.16 billion) in a stock-and-cash deal. The acquisition includes Hexagon's MSC Software business, a provider of engineering simulation and analysis software and workflows. Products Originally known as a creator of electronic design automation (EDA) software, the company currently develops software, hardware and intellectual property (IP) used to design chips, chiplet-style products, and printed circuit boards, while also selling hardware systems that run its chip design software. It also has tools for \"electromagnetics, thermal and computational fluid dynamics in the high-tech electronics, aerospace and defense and automotive sectors,\" and according to Investor's Business Daily in 2023, it specializes in products for fields such as \"artificial intelligence and machine learning, cloud computing, 3D technology, and AI-enabled big data analytics.\" Among market applications are \"hyperscale computing, 5G communications, automotive, mobile, aerospace, consumer, industrial and health care.\" Integrated circuit software The company develops a number of technologies for creating custom integrated circuits. For example, its Virtuoso Platform, later renamed Virtuoso Studio, incorporates tools for designing full-custom integrated circuits. In 2019, Cadence introduced its Spectre X parallel circuit simulator, so that users could distribute time- and frequency-domain simulations across hundreds of CPUs for speed. Cadence also offers AWR, a radio frequency to millimeter wave design environment for designing 5G/wireless products. AWR is used for communications, aerospace and defense, semiconductor, computer, and consumer electronics. Digital implementation and signoff Cadence has a number of digital implementation and signoff tools, including Genus, Innovus, Tempus & Voltus, among others. In 2020, Cadence integrated its Innovus place and route engine and optimizer into Genus Synthesis. Stratus is Cadence's high-level synthesis tool, and is used to create RTL implementations from C, C++, or SystemC code. Other formal verification and signoff tools include Conformal Equivalence Checker, Joules RTL Power Solution, Quantus Extraction Solution, and Cadence's Modus DFT Software Solution. System verification Cadence has developed a number of formal verification products for chip design. JasperGold is a formal verification tool, initially introduced in 2003 and upgraded with machine learning in 2019. vManager is a verification management tool for tracking the verification process. Cadence announced Perspec System Verifier in 2014 for defining and verifying system-level verification scenarios, with Perspec made compatible with the Accellera Portable Test and Stimulus Standard (PSS) several years later. Introduced in 2017, Cadence's parallel simulator Xcelium is based on a multi-core parallel computing architecture. Hardware emulation In 2015, Cadence announced the Palladium Z1 hardware emulation platform, for verifying billion-gate designs. which was based on emulation technology from Cadence's 1998 acquisition of Quickturn. Cadence announced Palladium Z2 in 2021 as a successor to the Z1 platform with improved performance. The Protium FPGA prototyping platform was introduced in 2014, followed by the Protium S1 in 2017, which was built on Xilinx Virtex UltraScale FPGAs. Protium X1 rack-based prototyping was introduced in 2019, which Cadence claimed supported a 1.2 billion gate SoCs at around 5 MHz. with Palladium S1/X1 and Protium sharing a single compilation flow. In 2021, Protium X2 was announced; Cadence claimed a 1.5X performance and 2X capacity improvement over Protium X1. SIP blocks Cadence supplies semiconductor intellectual property (SIP) blocks, covering interface design, USB, MIPI, ethernet, memory, analog, SoC peripherals, and data plane processing units. Cadence also develops chip verification technologies including simulators and formal verification tools. Cadence develops Tensilica DSP processors for audio, vision, wireless modems, and convolutional neural nets. Tensilica DSP processors IP in 2019 included: Tensilica Vision DSPs for imaging, vision, and AI processing; Tensilica HiFi DSPs for audio processing; Tensilica Fusion DSPs for IoT; Tensilica ConnX DSPs for radar, lidar, and communications processing; and Tensilica DNA Processor Family for AI acceleration. In 2021, Cadence launched the Tensilica AI Platform to accelerate AI SoC development and improve performances. PCB and packaging technologies The company provides several tools for the design of printed circuit boards (PCB) and of chip packages. Its Allegro Platform covers co-design of integrated circuits, packages, and PCBs on industrial scale. The OrCAD/PSpice product line aims at smaller design teams and individual PCB designers. OrbitIO Interconnect Designer is a die/package planning & route optimization tool. InspectAR uses augmented reality to map out complicated circuit board electronics for real-time labelling of board schematics. Systems design and analysis The company has a number of tools for system analysis. Sigrity offers tools for signal, power integrity, and thermal integrity analysis and IC package design. Introduced in April 2019 as part of Cadence's expansion into system analysis, Clarity is a 3D field solver for electromagnetic analysis, that uses distributed adaptive meshing to partition jobs across multiple cores. In September 2019, Cadence announced Celsius, a parallel architecture thermal solver that uses finite element analysis for solid structures and computational fluid dynamics (CFD) for fluids. Cascade Technologies, Inc includes hi-fidelity CFD solvers for multiphysics analysis of turbulence fluid flow. Acquired by Cadence from Pointwise in 2021, Fidelity Pointwise is for computational fluid dynamics (CFD) mesh generation. Machine design and digital twins Cadence in 2021 acquired a number of system analysis products from NUMECA, known for software tools used in the automotive, marine, aerospace, and power generation industries. Among the tools were Fidelity (formerly known as OMNIS), a computational fluid dynamics (CFD), mesh generation, multi-physics simulation, and optimization product. Its Cadence Reality digital twin platform creates manipulatable digital models of designs or factories. Cadence Design Systems in February 2024 launched its Cadence Millennium Enterprise Multiphysics Platform, or Millennium M1. The hardware/software combination was designed for creating digital twins. It draws from Cadence's older Fidelity CFD suite. Drug design Cadence's OpenEye Scientific division has computational molecular modeling and simulation software used by pharmaceutical and biotechnology companies for purposes such as drug discovery and antibody discovery. The Orion is OpenEye's software-as-a-service platform. OpenEye Scientific has its headquarters in Santa Fe, New Mexico. Artificial intelligence According to Reuters, in 2023 Cadence has been \"providing tools to design chips for AI\" and \"adding AI into its own software to help in the complex process of designing chips.\" Cerebrus was released in 2021, and is a machine learning-based chip design software which utilizes reinforcement learning and is meant to automatically optimize the Cadence digital design flow. In 2022, Cadence introduced the AI platform Optimality Intelligent System Explorer, a system design tool with multiphysics system analysis software. Designed to be compatible with Clarity 3D and SigrityX, Microsoft was an early adopter. In September 2023, Cadence released software called ChipGPT, allowing companies to create custom silicon with assistance from AI. Recognition In 2016, former Cadence CEO Lip-Bu Tan was awarded the Dr. Morris Chang Exemplary Leadership Award by the Global Semiconductor Alliance. In 2019, Investor's Business Daily ranked Cadence Design Systems #5 on its 50 Best Environmental, Social, and Governance (ESG) Companies list. In 2020, Cadence ranked #45 on People magazine's Companies that Care list. Fortune magazine named Cadence to its 100 Best Companies to Work For list for the sixth consecutive year in 2020. In 2021, Anirudh Devgan was awarded the prestigious IEEE/SEMI Phil Kaufman award and in 2022 was inducted into National Academy of Engineering. Sponsorship In May 2022, the Formula 1 motor racing team McLaren announced a multi-year partnership deal with Cadence. Cadence partnered with the San Francisco 49ers in April 2023 on a several year technology project to fix energy efficiencies at Levi's Stadium. The deal also gave Cadence the naming rights to the team's mobile app. Acquisitions timeline Controversies Lawsuits Avanti Corporation From 1995 until 2002, Cadence was involved in a 6-year-long legal dispute with Avanti Corporation (brand name \"Avant!\"), in which Cadence claimed Avanti stole Cadence code, and Avanti denied it. According to Business Week \"The Avanti case is probably the most dramatic tale of white-collar crime in the history of Silicon Valley\". The Avanti executives eventually pleaded no contest and Cadence received several hundred million dollars in restitution. Avanti was then purchased by Synopsys, which paid $265 million more to settle the remaining claims. The case resulted in a number of legal precedents. Aptix Corporation Quickturn Design Systems, a company acquired by Cadence, was involved in a series of legal events with Aptix Corporation. Aptix licensed a patent to Mentor Graphics and the two companies jointly sued Quickturn over an alleged patent infringement. Amr Mohsen, CEO of Aptix, forged and tampered with legal evidence and was subsequently charged with conspiracy, perjury, and obstruction of justice. Mohsen was arrested after violating his bail agreement by attempting to flee the country. While in jail, Mohsen plotted to intimidate witnesses and kill the federal judge presiding over his case. Mohsen was further charged with attempting to delay a federal trial by feigning incompetency. Due to the overwhelming misconduct, the judge ruled the lawsuit as unenforceable and Mohsen was sentenced to 17 years in prison. Mentor Graphics subsequently sued Aptix to recoup legal costs. Cadence also sued Mentor Graphics and Aptix to recover legal costs. Berkeley Design Automation In 2013, Cadence sued Berkeley Design Automation (BDA) for circumvention of a license scheme to link its Analog FastSpice (AFS) simulator to Cadence's Analog Design Environment (Virtuoso ADE). The lawsuit was settled less than one year later with an undisclosed payment of BDA and a multi-year agreement to support interoperability of AFS with ADE through Cadence's official interface. BDA was bought by Mentor Graphics a few months later. Export control violations and Chinese military university sales In July 2025, Cadence Design Systems agreed to plead guilty to criminal charges and pay over $140 million in combined penalties for illegally exporting semiconductor design technology to China's National University of Defense Technology (NUDT), a military university controlled by China's Central Military Commission. According to the U.S. Department of Justice and Bureau of Industry and Security, Cadence's Chinese subsidiary knowingly sold Electronic Design Automation (EDA) hardware, software, and semiconductor design technology valued at over $45 million to NUDT between 2015 and 2021, despite the university being placed on the U.S. Entity List in February 2015 due to its use of American technology for supercomputers \"believed to support nuclear explosive simulation and military simulation activities.\" The violations involved employees at Cadence's Chinese subsidiary using intermediary companies, including Central South CAD Center (CSCC) and later Phytium Technology, to disguise sales to the restricted military university. Internal communications revealed that Cadence China employees were explicitly instructed to refer to NUDT only in Chinese characters and use \"CSCC\" in English correspondence because \"the subject [was] too sensitive.\" The Department of Justice noted that Cadence received only partial cooperation credit because the company \"failed to voluntarily disclose the misconduct\" and did not fully facilitate interviews of China-based employees, ultimately resulting in the company being placed on three years of corporate probation."
}