{
  "ticker": "CDW",
  "cik": "0001402057",
  "company_name": "CDW Corporation",
  "corrected_name": "CDW Corporation",
  "wiki_title_used": "CDW Corporation",
  "exists": true,
  "raw_text": "CDW Corporation is an American multi-brand provider of information technology services, serving business, government, education, and healthcare sectors across the United States, the United Kingdom, and Canada. Headquartered in Vernon Hills, Illinois, CDW is a Fortune 500 and generated $21 billion in annual net sales in 2023.\n\nHistory\nCDW was originally incorporated in 1984 as \"MPK Computing\" by its founder Michael Krasny. The idea was born when Krasny took a small ad in a free-circulation newspaper to sell his computer and printer. It later became Computer Discount Warehouse and then simply CDW.\nIn 2005, CDW launched BizTech magazine, which it publishes on quarterly basis.\nIn early 2006, CDW opened a 513,000-square-foot (47,700 m2) distribution center in North Las Vegas, Nevada.  The Vernon Hills, Illinois distribution center is roughly 450,000 square feet (42,000 m2). In October 2006 CDW acquired Berbee, a reseller of IBM, Cisco, and Microsoft products and services. It was CDW's second major acquisition after purchasing Micro Warehouse in September 2003.\nOn 12 October 2007, Chicago based private equity firms Madison Dearborn Partners and Providence Equity Partners completed a $7 billion acquisition of CDW. It went public again through an initial public offering on the NASDAQ market on July 2, 2013, under the name CDW Corporation (the parent company since 2010). CDW LLC and CDW Finance Corporation are wholly owned subsidiaries.\nCDW operates in Canada as CDW Canada Incorporated, based in Etobicoke, Ontario. \nAs of 2018, CDW ranked 189th on the Fortune 500 list of the largest United States corporations by revenue.\nOn December 18, 2023, CDW became a component of the Nasdaq-100 index.\n\nAcquisitions\nBerbee Information Networks Corporation, an American company specializing in IT, was purchased by CDW in 2006. Prior to that it was a privately held company headquartered in Fitchburg, Wisconsin. Berbee had offices in Illinois, Indiana, Michigan, Minnesota, Ohio, and Wisconsin. In October 2006, Berbee accepted an $175 million all-cash acquisition offer from CDW. It became a division of CDW and is now known as CDW Advanced Technology Services.\nOn 3 August 2015 the company announced that it had acquired the remaining 65% of Kelway Ltd., a London based multinational business with significant presence in the IT sector. Eight months earlier, CDW had bought a 35 percent stake in Kelway.\nIn 2021, CDW announced the acquisition of Sirius Computer Solutions, Inc. The acquisition was completed later that year.\n\nReferences\nExternal links\n\nOfficial Website\nBusiness data for CDW Corporation: \nUK & International Official Website\nCanadian Official Website",
  "clean_text": "CDW Corporation is an American multi-brand provider of information technology services, serving business, government, education, and healthcare sectors across the United States, the United Kingdom, and Canada. Headquartered in Vernon Hills, Illinois, CDW is a Fortune 500 and generated $21 billion in annual net sales in 2023. History CDW was originally incorporated in 1984 as \"MPK Computing\" by its founder Michael Krasny. The idea was born when Krasny took a small ad in a free-circulation newspaper to sell his computer and printer. It later became Computer Discount Warehouse and then simply CDW. In 2005, CDW launched BizTech magazine, which it publishes on quarterly basis. In early 2006, CDW opened a 513,000-square-foot (47,700 m2) distribution center in North Las Vegas, Nevada. The Vernon Hills, Illinois distribution center is roughly 450,000 square feet (42,000 m2). In October 2006 CDW acquired Berbee, a reseller of IBM, Cisco, and Microsoft products and services. It was CDW's second major acquisition after purchasing Micro Warehouse in September 2003. On 12 October 2007, Chicago based private equity firms Madison Dearborn Partners and Providence Equity Partners completed a $7 billion acquisition of CDW. It went public again through an initial public offering on the NASDAQ market on July 2, 2013, under the name CDW Corporation (the parent company since 2010). CDW LLC and CDW Finance Corporation are wholly owned subsidiaries. CDW operates in Canada as CDW Canada Incorporated, based in Etobicoke, Ontario. As of 2018, CDW ranked 189th on the Fortune 500 list of the largest United States corporations by revenue. On December 18, 2023, CDW became a component of the Nasdaq-100 index. Acquisitions Berbee Information Networks Corporation, an American company specializing in IT, was purchased by CDW in 2006. Prior to that it was a privately held company headquartered in Fitchburg, Wisconsin. Berbee had offices in Illinois, Indiana, Michigan, Minnesota, Ohio, and Wisconsin. In October 2006, Berbee accepted an $175 million all-cash acquisition offer from CDW. It became a division of CDW and is now known as CDW Advanced Technology Services. On 3 August 2015 the company announced that it had acquired the remaining 65% of Kelway Ltd., a London based multinational business with significant presence in the IT sector. Eight months earlier, CDW had bought a 35 percent stake in Kelway. In 2021, CDW announced the acquisition of Sirius Computer Solutions, Inc. The acquisition was completed later that year."
}