{
  "ticker": "CEG",
  "cik": "0001868275",
  "company_name": "Constellation Energy",
  "corrected_name": "Constellation Energy",
  "wiki_title_used": "Constellation Energy",
  "exists": true,
  "raw_text": "Constellation Energy Corporation is an American energy company headquartered in Baltimore, Maryland. The company provides electric power, natural gas, and energy management services. It has approximately two million customers across the continental United States.\nThe company was known as Constellation Energy Group (former NYSE ticker symbol CEG), a Fortune 500 company and one of the largest electricity producers in the United States, until a merger with Exelon in 2012. When FERC approved the acquisition, Constellation Energy's energy supply business was re-branded as Constellation, an Exelon company. As part of the 2012 merger, Baltimore Gas and Electric, the regulated utility operated by Constellation Energy, became a regulated utility operating under Exelon Utilities. The current iteration of the company was founded in 2022 after splitting off from Exelon.\nBefore merging with Exelon, Constellation Energy Group operated more than 35 power plants in 11 states (mainly Maryland, Pennsylvania, New York, West Virginia, and California). Baltimore Gas and Electric created Constellation as a holding company in 1999.\n\nHistory\nOn September 15, 2005, Constellation Energy announced a joint venture, UniStar Nuclear, with Areva to market the European Pressurized Reactor (EPR) in the United States. On December 19, 2005, FPL Group, Inc. announced the acquisition of Constellation Energy in a merger transaction valued at more than $11 billion, as well as the fact that it would adopt Constellation Energy as its name for the post-merger entity. The merger was canceled on October 25, 2006.\nIn July 2008, Constellation Energy bought uranium trading firm Nufcor International from AngloGold Ashanti and FirstRand International.\nOn September 15, 2008, after reports that Constellation had exposure to Lehman Brothers following that firm's bankruptcy filing, Constellation's stock price dropped 56% in a single day. The massive drop led the New York Stock Exchange to halt trading in Constellation. The next day, as the stock fell as low as $13 a share, the company announced it was hiring Morgan Stanley and UBS to advise it on \"strategic alternatives\" suggesting a buyout. On September 17, 2008, Constellation accepted an offer of $4.7 billion by MidAmerican Energy, a subsidiary of Berkshire Hathaway, but ultimately canceled the deal on December 17, 2008, in favor of a $4.5 billion buyout from French power company Electricite de France (EDF).\nIn January 2009, Constellation Energy announced it would sell the majority of its London-based international commodities business to an affiliate of Goldman Sachs for an undisclosed price.\nIn April 2010, Constellation Energy closed its agreement with Clipper Windpower to acquire the Criterion Wind Project in Garrett County, Maryland, and to purchase 28 Clipper Liberty 2.5-MW wind turbines for the project. Construction was completed in December 2010. In May 2010, the firm acquired two natural gas combined-cycle generation facilities in Texas from Houston-based Navasota Holdings. The $365 million transaction included the Colorado Bend Energy Center, a 550-MW facility near Wharton, Texas, and Quail Run Energy Center, a 550-MW facility near Odessa, Texas. The purchase added 1,100 MW of capacity.\nOn April 28, 2011, Exelon announced its intention to purchase Constellation Energy. The merger was completed on March 12, 2012.\nOn May 27, 2011, Constellation Energy announced its intention to purchase StarTex Power, a retail electricity provider in Houston, Texas; the purchase was completed on June 1, 2011. In 2018, the StarTex brand was discontinued; Constellation served its existing customers instead. In May 2011, the company acquired MXenergy, a residential and small business energy provider with approximately half a million customers. In December 2011, it announced the acquisition of ONEOK Energy Marketing Co., a natural gas company with customers in the Midwest. In 2011, it contracted to construct and operate for the Toys-R-Us distribution center in Flanders, New Jersey, what was then the largest rooftop solar array ever constructed.\nIn March 2014, it agreed to acquire ETC ProLiance Energy, a supplier of natural gas to customers in several states. In November 2014, it completed its acquisition of Integrys Energy Services, a competitive retail electricity and natural gas subsidiary serving customers in 22 states. In September 2016, it completed its acquisition of the retail electricity and natural gas business from ConEdison Solutions, a subsidiary of Consolidated Edison, Inc. In the purchase, Constellation acquired ConEdison's retail electricity and natural gas customer contracts and associated supply contracts serving approximately 15 TWh of electricity and 1 billion cubic feet per annum (28,000,000 m3/a) of natural gas to more than 560,000 commercial, industrial, public sector and residential customers.\nIn August 2018, it began constructing a 10-megawatt solar array outside of Ocean City, Maryland. The array will provide the city with approximately 20% of its annual energy usage when completed. In October 2018, Constellation and the Tucson Unified School District completed a project that added solar generation capability to 82 of the district's buildings and facilities. The project is estimated to meet 47% of the district's electricity needs.\nIn 2022, it became an independent company after Exelon split its utilities and power generation businesses. Former subsidiary Baltimore Gas & Electric remained part of Exelon.\nIn September 2024 Microsoft entered a contract with the company that will restart the undamaged nuclear reactor at the Three Mile Island plant. In November 2025, the Trump administration said it would give Constellation Energy a $1 billion federal loan for the project. The company is also planning to upgrade other existing reactor plants to provide more power. \nIn January 2025, Constellation agreed to acquire the natural gas and geothermal power provider Calpine for $16.4 billion ($26.6bn including debt) in a cash-and-stock deal. Approval of the purchase by state and federal regulators will be necessary.\n\nOperations\nElectric power\nConstellation provides electric power to commercial and industrial customers. Its electricity supply business manages energy sales, dispatch, and delivery from Exelon's power generation portfolio to utilities, municipal co-ops, and energy retailers nationwide. As of 2018, Constellation had around 360 megawatts of solar generation assets that are either in operation or under construction across the United States, including Maryland, California, Arizona, New Jersey, and Texas. In 2011, Constellation was contracted to construct and operate what was then the largest rooftop solar array ever constructed for the Toys-R-Us distribution center in Flanders, New Jersey.\nThe company's offsite renewables service (CORe) provides access to offsite renewable energy projects through a retail power contract. CORe combines location-specific renewable energy purchases and certificates with a physical load-following energy supply contract.\n\nNatural gas\nConstellation delivers approximately 730 billion cubic feet (21 billion cubic metres) of natural gas annually to customers, making it one of the ten largest natural gas marketers in the United States. The company oversees trading, transport, and storage of physical gas supply, pricing, hedging, and risk management.\n\nConstellation Technology Ventures\nConstellation Technology Ventures (CTV), Constellation's venture capital fund, invests in start-up companies with emerging energy technologies. Their portfolio includes Proterra, ChargePoint and Aquion Energy\n\nNuclear\nConstellation is the United States' leading nuclear power plant operator, with over 19,000 megawatts.\n\nBraidwood Nuclear Generating Station (Illinois)\nByron Nuclear Generating Station (Illinois)\nCalvert Cliffs Nuclear Power Plant (Maryland)\nClinton Nuclear Generating Station (Illinois)\nDresden Generating Station (Illinois)\nGinna Nuclear Generating Station (New York)\nJames A. FitzPatrick Nuclear Power Plant (New York)\nLaSalle County Nuclear Generating Station (Illinois)\nLimerick Nuclear Power Plant (Pennsylvania)\nNine Mile Point Nuclear Generating Station (New York)\nPeach Bottom Atomic Power Station (Pennsylvania)\nQuad Cities Nuclear Generating Station (Illinois)\nSalem Nuclear Power Plant (New Jersey) (minority owner)\nThree Mile Island Nuclear Generating Station (Pennsylvania) (Unit 2 owned by EnergySolutions)\nSouth Texas Nuclear Generating Station (Texas) (Minority owner)\n\nFossil\nConstellation owns and operates a portfolio of fossil fuel and other sources generating more than 12,000 megawatts (MW) of power.\n\nChester Generating Station – oil (Pennsylvania), which is distinct from the historic Chester Waterside Station\nColorado Bend II Energy Center – natural gas (Texas)\nCroydon Generating Station – oil (Pennsylvania)\nDelaware Generating Station – oil (Pennsylvania)\nEddystone Generating Station – natural gas and oil (Pennsylvania)\nEverett LNG Facility – natural gas imports (Massachusetts) a.k.a. Distrigas, purchased in 2019\nFalls Generating Station – oil (Pennsylvania)\nFramingham Generating Station – oil (Massachusetts)\nGrande Prairie Generating Station – natural gas (Alberta, Canada)\nHandley Generating Station – natural gas (Texas)\nHandsome Lake Generating Station – natural gas (Pennsylvania)\nHillabee Generating Station – natural gas (Alabama)\nMoser Generating Station – oil (Pennsylvania)\nMystic Generating Station – natural gas (Massachusetts)\nPerryman Generating Station – oil and natural gas (Maryland)\nPhiladelphia Road Generating Station – oil (Maryland)\nRichmond Generating Station – oil (Pennsylvania)\nSchuylkill Generating Station – oil (Pennsylvania)\nSouthwark Generating Station – oil (Pennsylvania)\nWest Medway Generating Station I – oil (Massachusetts)\nWest Medway Generating Station II – natural gas or oil (Massachusetts)\nWolf Hollow II Generating Station – natural gas (Texas)\nWyman Generating Station – oil (Maine) (minority owner)\n\nHydro\nConstellation's two hydroelectric plants generate 1,600 MW of power.\n\nConowingo Dam (Maryland)\nMuddy Run Pumped Storage Facility (Pennsylvania)\n\nSolar\nAntelope Valley Solar Ranch One (California)\n\nWind\nConstellation has 27 wind projects in ten states, totaling nearly 1,400 megawatts (MW).\n\nGeneration services\nConstellation owns Constellation Generation Solutions (CGS). CGS functions as an industry-leading maintenance and technical services organization emphasizing precision and quality, structured to streamline the work execution of the nuclear fleet.\nConstellation PowerLabs is a wholly owned subsidiary of Constellation. Since 1911, PowerLabs has transformed from supporting the power industry to becoming Exelon's primary calibrations and testing laboratory. It has four individual labs strategically located from the upper Midwest to the Northeast, enabling experienced staff in engineering, metrology, and nuclear power generation to support the urgent demands of our nation's nuclear facilities, power grids, and critical supply chains.\n\nBaltimore community involvement\nHistorical archives\nConstellation owns the archives of the Baltimore Gas & Electric Company, the former Consolidated Gas Light, Electric Power Company of Baltimore City, and its ancient predecessor, the Gas Light Company of Baltimore. The Baltimore Gas & Electric Company's photographic collection consists of approximately 250,000 photographic prints and negatives, in more than 50,000 series. The archives are held by the Baltimore Museum of Industry.\n\nPhilanthropy\nConstellation ranks second in local corporate giving among Baltimore-based companies, and donated $7.10 million in 2017. The company also provides grants to local schools that implement education programs promoting science and technology.\n\nSee also\nCalvert Cliffs Nuclear Generating Station, on the Chesapeake Bay, Calvert County; Lusby, Maryland\nConemaugh Generating Station\nGinna Nuclear Generating Station\nKeystone Generating Station\nNine Mile Point Nuclear Generating Station\nSafe Harbor Dam, on the Susquehanna River, Pennsylvania\n\nReferences\nExternal links\nOfficial website\nBusiness data for Constellation Energy Corp:",
  "clean_text": "Constellation Energy Corporation is an American energy company headquartered in Baltimore, Maryland. The company provides electric power, natural gas, and energy management services. It has approximately two million customers across the continental United States. The company was known as Constellation Energy Group (former NYSE ticker symbol CEG), a Fortune 500 company and one of the largest electricity producers in the United States, until a merger with Exelon in 2012. When FERC approved the acquisition, Constellation Energy's energy supply business was re-branded as Constellation, an Exelon company. As part of the 2012 merger, Baltimore Gas and Electric, the regulated utility operated by Constellation Energy, became a regulated utility operating under Exelon Utilities. The current iteration of the company was founded in 2022 after splitting off from Exelon. Before merging with Exelon, Constellation Energy Group operated more than 35 power plants in 11 states (mainly Maryland, Pennsylvania, New York, West Virginia, and California). Baltimore Gas and Electric created Constellation as a holding company in 1999. History On September 15, 2005, Constellation Energy announced a joint venture, UniStar Nuclear, with Areva to market the European Pressurized Reactor (EPR) in the United States. On December 19, 2005, FPL Group, Inc. announced the acquisition of Constellation Energy in a merger transaction valued at more than $11 billion, as well as the fact that it would adopt Constellation Energy as its name for the post-merger entity. The merger was canceled on October 25, 2006. In July 2008, Constellation Energy bought uranium trading firm Nufcor International from AngloGold Ashanti and FirstRand International. On September 15, 2008, after reports that Constellation had exposure to Lehman Brothers following that firm's bankruptcy filing, Constellation's stock price dropped 56% in a single day. The massive drop led the New York Stock Exchange to halt trading in Constellation. The next day, as the stock fell as low as $13 a share, the company announced it was hiring Morgan Stanley and UBS to advise it on \"strategic alternatives\" suggesting a buyout. On September 17, 2008, Constellation accepted an offer of $4.7 billion by MidAmerican Energy, a subsidiary of Berkshire Hathaway, but ultimately canceled the deal on December 17, 2008, in favor of a $4.5 billion buyout from French power company Electricite de France (EDF). In January 2009, Constellation Energy announced it would sell the majority of its London-based international commodities business to an affiliate of Goldman Sachs for an undisclosed price. In April 2010, Constellation Energy closed its agreement with Clipper Windpower to acquire the Criterion Wind Project in Garrett County, Maryland, and to purchase 28 Clipper Liberty 2.5-MW wind turbines for the project. Construction was completed in December 2010. In May 2010, the firm acquired two natural gas combined-cycle generation facilities in Texas from Houston-based Navasota Holdings. The $365 million transaction included the Colorado Bend Energy Center, a 550-MW facility near Wharton, Texas, and Quail Run Energy Center, a 550-MW facility near Odessa, Texas. The purchase added 1,100 MW of capacity. On April 28, 2011, Exelon announced its intention to purchase Constellation Energy. The merger was completed on March 12, 2012. On May 27, 2011, Constellation Energy announced its intention to purchase StarTex Power, a retail electricity provider in Houston, Texas; the purchase was completed on June 1, 2011. In 2018, the StarTex brand was discontinued; Constellation served its existing customers instead. In May 2011, the company acquired MXenergy, a residential and small business energy provider with approximately half a million customers. In December 2011, it announced the acquisition of ONEOK Energy Marketing Co., a natural gas company with customers in the Midwest. In 2011, it contracted to construct and operate for the Toys-R-Us distribution center in Flanders, New Jersey, what was then the largest rooftop solar array ever constructed. In March 2014, it agreed to acquire ETC ProLiance Energy, a supplier of natural gas to customers in several states. In November 2014, it completed its acquisition of Integrys Energy Services, a competitive retail electricity and natural gas subsidiary serving customers in 22 states. In September 2016, it completed its acquisition of the retail electricity and natural gas business from ConEdison Solutions, a subsidiary of Consolidated Edison, Inc. In the purchase, Constellation acquired ConEdison's retail electricity and natural gas customer contracts and associated supply contracts serving approximately 15 TWh of electricity and 1 billion cubic feet per annum (28,000,000 m3/a) of natural gas to more than 560,000 commercial, industrial, public sector and residential customers. In August 2018, it began constructing a 10-megawatt solar array outside of Ocean City, Maryland. The array will provide the city with approximately 20% of its annual energy usage when completed. In October 2018, Constellation and the Tucson Unified School District completed a project that added solar generation capability to 82 of the district's buildings and facilities. The project is estimated to meet 47% of the district's electricity needs. In 2022, it became an independent company after Exelon split its utilities and power generation businesses. Former subsidiary Baltimore Gas & Electric remained part of Exelon. In September 2024 Microsoft entered a contract with the company that will restart the undamaged nuclear reactor at the Three Mile Island plant. In November 2025, the Trump administration said it would give Constellation Energy a $1 billion federal loan for the project. The company is also planning to upgrade other existing reactor plants to provide more power. In January 2025, Constellation agreed to acquire the natural gas and geothermal power provider Calpine for $16.4 billion ($26.6bn including debt) in a cash-and-stock deal. Approval of the purchase by state and federal regulators will be necessary. Operations Electric power Constellation provides electric power to commercial and industrial customers. Its electricity supply business manages energy sales, dispatch, and delivery from Exelon's power generation portfolio to utilities, municipal co-ops, and energy retailers nationwide. As of 2018, Constellation had around 360 megawatts of solar generation assets that are either in operation or under construction across the United States, including Maryland, California, Arizona, New Jersey, and Texas. In 2011, Constellation was contracted to construct and operate what was then the largest rooftop solar array ever constructed for the Toys-R-Us distribution center in Flanders, New Jersey. The company's offsite renewables service (CORe) provides access to offsite renewable energy projects through a retail power contract. CORe combines location-specific renewable energy purchases and certificates with a physical load-following energy supply contract. Natural gas Constellation delivers approximately 730 billion cubic feet (21 billion cubic metres) of natural gas annually to customers, making it one of the ten largest natural gas marketers in the United States. The company oversees trading, transport, and storage of physical gas supply, pricing, hedging, and risk management. Constellation Technology Ventures Constellation Technology Ventures (CTV), Constellation's venture capital fund, invests in start-up companies with emerging energy technologies. Their portfolio includes Proterra, ChargePoint and Aquion Energy Nuclear Constellation is the United States' leading nuclear power plant operator, with over 19,000 megawatts. Braidwood Nuclear Generating Station (Illinois) Byron Nuclear Generating Station (Illinois) Calvert Cliffs Nuclear Power Plant (Maryland) Clinton Nuclear Generating Station (Illinois) Dresden Generating Station (Illinois) Ginna Nuclear Generating Station (New York) James A. FitzPatrick Nuclear Power Plant (New York) LaSalle County Nuclear Generating Station (Illinois) Limerick Nuclear Power Plant (Pennsylvania) Nine Mile Point Nuclear Generating Station (New York) Peach Bottom Atomic Power Station (Pennsylvania) Quad Cities Nuclear Generating Station (Illinois) Salem Nuclear Power Plant (New Jersey) (minority owner) Three Mile Island Nuclear Generating Station (Pennsylvania) (Unit 2 owned by EnergySolutions) South Texas Nuclear Generating Station (Texas) (Minority owner) Fossil Constellation owns and operates a portfolio of fossil fuel and other sources generating more than 12,000 megawatts (MW) of power. Chester Generating Station – oil (Pennsylvania), which is distinct from the historic Chester Waterside Station Colorado Bend II Energy Center – natural gas (Texas) Croydon Generating Station – oil (Pennsylvania) Delaware Generating Station – oil (Pennsylvania) Eddystone Generating Station – natural gas and oil (Pennsylvania) Everett LNG Facility – natural gas imports (Massachusetts) a.k.a. Distrigas, purchased in 2019 Falls Generating Station – oil (Pennsylvania) Framingham Generating Station – oil (Massachusetts) Grande Prairie Generating Station – natural gas (Alberta, Canada) Handley Generating Station – natural gas (Texas) Handsome Lake Generating Station – natural gas (Pennsylvania) Hillabee Generating Station – natural gas (Alabama) Moser Generating Station – oil (Pennsylvania) Mystic Generating Station – natural gas (Massachusetts) Perryman Generating Station – oil and natural gas (Maryland) Philadelphia Road Generating Station – oil (Maryland) Richmond Generating Station – oil (Pennsylvania) Schuylkill Generating Station – oil (Pennsylvania) Southwark Generating Station – oil (Pennsylvania) West Medway Generating Station I – oil (Massachusetts) West Medway Generating Station II – natural gas or oil (Massachusetts) Wolf Hollow II Generating Station – natural gas (Texas) Wyman Generating Station – oil (Maine) (minority owner) Hydro Constellation's two hydroelectric plants generate 1,600 MW of power. Conowingo Dam (Maryland) Muddy Run Pumped Storage Facility (Pennsylvania) Solar Antelope Valley Solar Ranch One (California) Wind Constellation has 27 wind projects in ten states, totaling nearly 1,400 megawatts (MW). Generation services Constellation owns Constellation Generation Solutions (CGS). CGS functions as an industry-leading maintenance and technical services organization emphasizing precision and quality, structured to streamline the work execution of the nuclear fleet. Constellation PowerLabs is a wholly owned subsidiary of Constellation. Since 1911, PowerLabs has transformed from supporting the power industry to becoming Exelon's primary calibrations and testing laboratory. It has four individual labs strategically located from the upper Midwest to the Northeast, enabling experienced staff in engineering, metrology, and nuclear power generation to support the urgent demands of our nation's nuclear facilities, power grids, and critical supply chains. Baltimore community involvement Historical archives Constellation owns the archives of the Baltimore Gas & Electric Company, the former Consolidated Gas Light, Electric Power Company of Baltimore City, and its ancient predecessor, the Gas Light Company of Baltimore. The Baltimore Gas & Electric Company's photographic collection consists of approximately 250,000 photographic prints and negatives, in more than 50,000 series. The archives are held by the Baltimore Museum of Industry. Philanthropy Constellation ranks second in local corporate giving among Baltimore-based companies, and donated $7.10 million in 2017. The company also provides grants to local schools that implement education programs promoting science and technology."
}