{
  "ticker": "CF",
  "cik": "0001324404",
  "company_name": "CF Industries",
  "corrected_name": "CF Industries",
  "wiki_title_used": "CF Industries",
  "exists": true,
  "raw_text": "CF Industries Holdings, Inc. is an American manufacturer and distributor of agricultural fertilizers, including ammonia, urea, and ammonium nitrate products. The company is based in Northbrook, Illinois, a suburb of Chicago, and was founded in 1946 as the Central Farmers Fertilizer Company. For its first 56 years, it was a federation of regional agricultural supply cooperatives. CF then demutualized, and became a publicly traded company.\n\nOperations\nCF Industries operates nine manufacturing complexes worldwide comprising 17 ammonia plants, the largest of which is in Donaldsonville, Louisiana. The primary operating subsidiary is CF Industries, Inc.\n\nHistory\nThe company was founded in 1946 as the Central Farmers Fertilizer Company, a federation of regional agricultural supply cooperatives. The company became CF Industries in 1971.\nCF demutualized in 2002 and made an initial public offering of shares of equity stock in 2005.  Since 2008, the shares of CF Industries have been included in the S&P 500 index of large-cap stock prices.\nIn April 2010, CF Industries acquired Terra Industries, Inc., following protracted negotiations that included an attempt by rival fertilizer manufacturer Agrium to purchase CF and efforts by Yara International to purchase Terra. acquiring five production complexes in North America, a 50% interest in a joint venture in Point Lisas, Trinidad, and a 50% interest in the GrowHow joint venture in the United Kingdom.\nIn 2013, Mosaic Company agreed to buy CF Industries' phosphate business for $1.4 billion in cash.\nOn July 1, 2015, CF Industries announced an agreement to acquire remaining 50% interest in GrowHow from Yara International for $580 million.\nOn August 6, 2015, CF Industries announced that it will combine with OCI N.V.'s European, North American and Global Distribution businesses for $8 billion. The combined company will be domiciled in the UK and it will use the CF Industries name. On May 31, 2016, CF Industries announced the termination of the proposed combination with the European, North American and Global Distribution businesses of OCI.\nOn September 15, 2021, CF Industries announced that it was halting operations at its two UK production complexes due to high natural gas prices. The halt in operations created a potential for a shortage in the UK of food grade CO2; a byproduct of ammonia production that is critical to sectors from beer and soft drinks to food packaging and meat. CF Industries' UK facilities had been the source of 60% of the country's food grade CO2. On September 21, the UK government announced a short-term arrangement whereby the government would provide limited financial support to CF Industries for three weeks in order to support the immediate restart of operations and CO2 production at its Billingham, Teesside, plant. In June 2022, CF Industries permanently shut their fertiliser factory in Ince, Cheshire, due to continuing high gas prices and environmental taxes.\n\nReferences\nExternal links\n\nOfficial website \nCorporate profile – CF Industries' history\nBusiness data for CF Industries Holdings, Inc.: \n\"CF Industries restarting fertilizer plant closed by Gustav\". Chicago Tribune. September 9, 2009. Archived from the original on May 22, 2011. Retrieved September 12, 2008.\nToby Shute (July 29, 2008). \"A Cash Flood for CF Industries\". Motley Fool.",
  "clean_text": "CF Industries Holdings, Inc. is an American manufacturer and distributor of agricultural fertilizers, including ammonia, urea, and ammonium nitrate products. The company is based in Northbrook, Illinois, a suburb of Chicago, and was founded in 1946 as the Central Farmers Fertilizer Company. For its first 56 years, it was a federation of regional agricultural supply cooperatives. CF then demutualized, and became a publicly traded company. Operations CF Industries operates nine manufacturing complexes worldwide comprising 17 ammonia plants, the largest of which is in Donaldsonville, Louisiana. The primary operating subsidiary is CF Industries, Inc. History The company was founded in 1946 as the Central Farmers Fertilizer Company, a federation of regional agricultural supply cooperatives. The company became CF Industries in 1971. CF demutualized in 2002 and made an initial public offering of shares of equity stock in 2005. Since 2008, the shares of CF Industries have been included in the S&P 500 index of large-cap stock prices. In April 2010, CF Industries acquired Terra Industries, Inc., following protracted negotiations that included an attempt by rival fertilizer manufacturer Agrium to purchase CF and efforts by Yara International to purchase Terra. acquiring five production complexes in North America, a 50% interest in a joint venture in Point Lisas, Trinidad, and a 50% interest in the GrowHow joint venture in the United Kingdom. In 2013, Mosaic Company agreed to buy CF Industries' phosphate business for $1.4 billion in cash. On July 1, 2015, CF Industries announced an agreement to acquire remaining 50% interest in GrowHow from Yara International for $580 million. On August 6, 2015, CF Industries announced that it will combine with OCI N.V.'s European, North American and Global Distribution businesses for $8 billion. The combined company will be domiciled in the UK and it will use the CF Industries name. On May 31, 2016, CF Industries announced the termination of the proposed combination with the European, North American and Global Distribution businesses of OCI. On September 15, 2021, CF Industries announced that it was halting operations at its two UK production complexes due to high natural gas prices. The halt in operations created a potential for a shortage in the UK of food grade CO2; a byproduct of ammonia production that is critical to sectors from beer and soft drinks to food packaging and meat. CF Industries' UK facilities had been the source of 60% of the country's food grade CO2. On September 21, the UK government announced a short-term arrangement whereby the government would provide limited financial support to CF Industries for three weeks in order to support the immediate restart of operations and CO2 production at its Billingham, Teesside, plant. In June 2022, CF Industries permanently shut their fertiliser factory in Ince, Cheshire, due to continuing high gas prices and environmental taxes."
}