{
  "ticker": "CFG",
  "cik": "0000759944",
  "company_name": "Citizens Financial Group",
  "corrected_name": "Citizens Financial Group",
  "wiki_title_used": "Citizens Financial Group",
  "exists": true,
  "raw_text": "Citizens Financial Group, Inc. is an American bank holding company, headquartered in Providence, Rhode Island. The company owns the bank Citizens Bank, N.A., which operates in the U.S. states of Connecticut, Delaware, Florida, Maryland, Massachusetts, Michigan, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Rhode Island, Vermont, and Virginia, as well as Washington, DC.\nBetween 1988 and its 2014 initial public offering, Citizens was a wholly owned subsidiary of Royal Bank of Scotland (RBS). RBS sold its last 20.9% stake in the company in October 2015.\nCitizens operates 1,078 branches and four wealth centers as of August 31, 2023, and over 3,200 ATMs across 14 states under the Citizens Bank brand.\nCitizens ranks 18th on the \"List of largest banks in the United States\" as of Q3 2024.\n\nEarly history\nCitizens was established in 1828 as the High Street Bank in Providence, Rhode Island. In 1871, the Rhode Island legislature gave a second charter to establish the Citizens Savings Bank which eventually acquired its parent group to form Citizens Trust Company. The bank then expanded through Rhode Island, opening a total of 29 branches in that state. It established Citizens Financial Group as a holding company when the bank acquired The Greenville Trust Company in 1954.\nIn 1985, Citizens changed status from a mutual savings bank to a federal stock savings bank. Expansion into other states began with Massachusetts in 1986.\n\nRBS ownership\nIn 1988, The Royal Bank of Scotland Group acquired Citizens. Under RBS ownership, Citizens acquired several smaller banks in New England to become the second largest bank in the region. In 1996, in conjunction with the acquisition of First NH Bank, the Bank of Ireland gained a 23.5% stake in Citizens, which RBS then acquired two years later to resume 100% ownership.\nIn 1999, Citizens acquired the United States Trust Company of Boston and the retail banking business of State Street Corporation, significantly increasing its footprint in Massachusetts.\nExpansion outside New England began in 2001, when RBS purchased the retail banking division of Mellon Financial Corporation in Pennsylvania, New Jersey and Delaware for $2 billion. At one stroke, Citizens Bank became the second-largest bank in Pennsylvania, and a major bank in both Philadelphia and Pittsburgh.\nOn January 17, 2003, Citizens Financial Group purchased Commonwealth Bancorp, the holding company for Commonwealth Bank, based in Norristown, Pennsylvania.\nIn July 2003, the bank purchased the naming rights to the new home stadium of the Philadelphia Phillies professional baseball team, which was named Citizens Bank Park and opened on April 3, 2004.\nIn 2004, RBS purchased the credit card division of Connecticut-based People's Bank. This purchase allowed Citizens to issue and market its own credit cards.\nA new corporate logo designed to show Citizens Bank's connection to the Royal Bank of Scotland debuted on April 26, 2005.\nIn July 2006, Citizens Bank eliminated the mortgage department in Michigan and terminated over 100 employees.\nOn September 1, 2007, the individual banks under Citizens Financial Group, excluding Citizens Bank of Pennsylvania, merged into RBS Citizens, N.A.\nIn October 2015, RBS sold its remaining stake in Citizens Financial Group, having progressively reduced its stake through an initial public offering (IPO) started in 2014.\n\nCharter One Financial\nIn August 2004, Citizens Financial acquired Cleveland-based Charter One Financial, parent company of Charter One Bank, with branches in Illinois, Ohio, Indiana, Michigan, upstate New York, and Vermont for $10.5 billion. Because Citizens Republic Bancorp of Flint, Michigan, already operated under the Citizens Bank name in most of Charter One's territory, Citizens Financial elected to keep the Charter One name in Charter One's Midwestern footprint. However, it re-branded the New York and Vermont branches as Citizens Bank. This purchase made Citizens Financial the 12th largest bank in the United States with over $131 billion in assets and 1,530 branches across 13 states.\nIn early 2005, the Charter One name replaced the Citizens Bank banner on seven branches in Butler County, Pennsylvania. This rebranding resolved a 3½-year-old name dispute with Butler-based Citizens National Bank. By mid 2005, Citizens National and Citizens Financial agreed to a compromise. Citizens National Bank changed its name to NexTier Bank, while the Citizens Financial Group branches reverted to the \"Citizens Bank\" name.\nIn November 2008, Charter One sold its network of 65 branches in Indiana to Old National Bank which rebranded them under the Old National Bank banner. The transaction closed in June 2010.\nIn 2014, Citizens sold 94 branches in metropolitan Chicago to U.S. Bancorp.\nCitizens Republic Bancorp was founded in Flint, Michigan, in 1871 and merged with Republic Bank in 2006.  In 2007, Citizens Republic prevailed in a case to prevent Citizens Financial from using the similar name in Michigan and Ohio. FirstMerit Bank acquired Citizens Republic in 2013 and rebranded all branches as FirstMerit until 2016 when Huntington Bancshares acquired FirstMerit.  With conflicting names no longer an issue, Citizens Bank announced June 30, 2014, that Charter One branches in Michigan and Ohio would be rebranded as Citizens Bank. The name change officially took place on April 27, 2015, bringing to an end the name Charter One in Cleveland; the city in which it was founded.\n\nFinancial crisis\nIn May 2008, Citizens Financial Group failed to publicly announce that it was under investigation by the Securities and Exchange Commission (SEC) for its involvement in the sub-prime mortgage crisis that devastated the U.S. housing market and bond investors around the world. The SEC only investigated banks if suspected of involvement in the purchase and sale of subprime securities.\nIn 2008, the company lost $929 million and anticipated writing off $2 billion in bad loans. Royal Bank of Scotland posted the biggest loss in British corporate history and announced cost-cutting measures at Citizens.\nA Philadelphia developer sued Citizens Bank January 27, 2010, for $8 billion, under a claim that the bank used sham accusations of default to recall loans in an effort to prop up its failing parent companies, Citizens Financial Group and \"its ultimate parent, The Royal Bank of Scotland Group.\" The case was ultimately settled out of court.\n\nIPO\nFollowing the effective nationalization of RBS in 2008, speculation arose as to whether RBS would retain Citizens Bank. In 2012, public pressure in the United Kingdom grew for RBS to focus on its home market and sell foreign assets, including Citizens Bank, in order for UK taxpayers to earn their money back. Substantial interest in Citizens Bank had been rumored from other foreign banks such as Brazil-based Itaú Unibanco and Canada-based Toronto-Dominion Bank, the latter of which already had an existing U.S. branch network that overlapped with the existing Citizen footprint east of the Appalachian Mountains. The Bank of Montreal, with its existing U.S. presence, was also mentioned as a possible buyer. U.S. banks mentioned as potential Citizens buyers included JPMorgan Chase, Wells Fargo, U.S. Bancorp, PNC Financial Services, and Fifth Third Bank.\nIn February 2013, RBS confirmed at least a partial spinoff of Citizens through an initial public offering within the next two years. Then in October 2013, RBS announced it would sell its Chicago-area branches, which represented 6% of its U.S. deposits; Citizens later agreed to sell those branches to U.S. Bancorp on January 7, 2014. Finally in November 2013, RBS announced that it would divest all of Citizens Financial Group.\nThe bank began trading on the New York Stock Exchange under the ticker symbol CFG on September 24, 2014, raising $3 billion. By April 2015, RBS Group's shareholding in the bank had dropped to 45.6%. A further sale in July 2015 reduced RBS' stake to 23.4%. RBS sold its remaining stake in the bank in October 2015. However, Citizens still uses the RBS \"daisy wheel\" logo.\nIn June 2016, it was announced that Citizens Financial Group had joined the Fortune 500 for the first time.\n\nMisappropriation of depositor funds\nIn August 2015, the Consumer Financial Protection Bureau (CFPB) and other federal regulators levied nearly $35 million in penalties against Citizens Bank \"for failing to credit to customers’ accounts the full amount of their deposits\". The regulators declared that, from 2008 to 2013, \"The bank’s actions resulted in consumers being shorted millions of dollars\". Joint action by the CFPB, the FDIC, and the Comptroller of the Currency determined that Citizens Bank had engaged in \"deceptive practices\" by \"fail[ing] to give customers their full deposits at times when the size of the deposit didn’t match the number written on deposit slips\", despite promising to correct such discrepancies, instead pocketing the difference. The bank was required to reimburse its customers for lost funds as well as pay roughly $20 million in fines to the three agencies. The New York Times said that Citizens Bank's misconduct \"is appalling precisely because it is so basic\", demonstrating that \"regulators like the Consumer Financial Protection Bureau are a necessary defense against a system prone to abuses\".\n\nPaul Manafort investigation\nOn May 12, 2017, The Wall Street Journal reported that the United States Department of Justice requested from numerous banks, including Citizens, Trump 2016 campaign manager Paul Manafort's transaction records. According to the article, the request was related to the investigation into alleged Russian interference in the 2016 United States elections. Manafort reportedly secured a $2.7 million loan from Citizens in 2016.\nOn February 26, 2018, Bloomberg News reported that Citizens' stock price dropped 4.1 percent after U.S. Special Counsel Robert Mueller's indictment of Manafort was released, appearing to indicate that Citizens was the \"Lender B\" cited as having lent $3.4 million to the former campaign manager of President Trump.\n\nSubsequent acquisitions\nIn August 2018, Citizens completed its acquisition of Franklin American Mortgage in a deal valued at $511 Million, expanding its presence into Tennessee and Texas.\nOn May 26, 2021, Citizens entered into an agreement with HSBC Bank USA to purchase HSBC's retail operations on the East Coast. Under the agreement, Citizens would acquire approximately $9.0 billion in deposits and approximately $2.2 billion in loans.\nIn April 2022, Citizens completed the acquisition of 80 branches from HSBC in New York City, New Jersey, Pennsylvania, Washington, D.C., Maryland, Virginia, and Florida.\nIn July 2021, Citizens announced plans to acquire New Jersey–based bank holding company Investors Bancorp for $3.5 billion. Citizens took over more than 150 branches with the deal. As of February 2023, all Investors locations were rebranded as Citizens Bank.\n\nBranches\nLike several other banks, Citizens has agreements with several supermarket chains to locate bank branches in the stores. The greatest number of these are in Pittsburgh-based Giant Eagle stores, most of which were acquired in the acquisition of Mellon Financial Corporation's retail banking division. Citizens also operates branches inside many Stop & Shop and Shaw's stores in New England. One unique aspect at Citizens branches inside supermarkets is full-service banking from 10 a.m. to 3 p.m. on Sundays; historically, USA banks were often closed on Sunday and even Saturdays.\nIn September 2010, Giant Eagle announced a new agreement with Huntington Bank in which Huntington would open branches in several stores in Ohio and West Virginia and will replace existing branches of other banks when the store's agreements with those banks expire.\nOn June 25, 2008, Citizens Bank announced would sell 18 branches in upstate New York as it prepared to open 57 branches downstate. Community Bank System Inc. of DeWitt, New York purchased the branches in Ausable Forks, Champlain, Fort Covington, Indian Lake, Lake Placid, Lyons Falls, Long Lake, Malone, Newcomb, North Creek, Plattsburgh, Saranac Lake, Ticonderoga, Tupper Lake and Whitehall. The sale completed on November 7, 2008.\nIn October 2009, Citizens Bank opened a full-service branch inside a Dunkin' Donuts in Bellingham, Massachusetts. The branch offers teller windows, a full-service automated teller machine (ATM) and Dunkin' Donuts promotions for using the bank's services.\n\nSee also\nCitizens Bank Park\n\nReferences\nExternal links\n\nOfficial website\nCorporate website\nConsent decree regarding misappropriation of depositor funds\nBusiness data for Citizens Financial Group, Inc.:",
  "clean_text": "Citizens Financial Group, Inc. is an American bank holding company, headquartered in Providence, Rhode Island. The company owns the bank Citizens Bank, N.A., which operates in the U.S. states of Connecticut, Delaware, Florida, Maryland, Massachusetts, Michigan, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Rhode Island, Vermont, and Virginia, as well as Washington, DC. Between 1988 and its 2014 initial public offering, Citizens was a wholly owned subsidiary of Royal Bank of Scotland (RBS). RBS sold its last 20.9% stake in the company in October 2015. Citizens operates 1,078 branches and four wealth centers as of August 31, 2023, and over 3,200 ATMs across 14 states under the Citizens Bank brand. Citizens ranks 18th on the \"List of largest banks in the United States\" as of Q3 2024. Early history Citizens was established in 1828 as the High Street Bank in Providence, Rhode Island. In 1871, the Rhode Island legislature gave a second charter to establish the Citizens Savings Bank which eventually acquired its parent group to form Citizens Trust Company. The bank then expanded through Rhode Island, opening a total of 29 branches in that state. It established Citizens Financial Group as a holding company when the bank acquired The Greenville Trust Company in 1954. In 1985, Citizens changed status from a mutual savings bank to a federal stock savings bank. Expansion into other states began with Massachusetts in 1986. RBS ownership In 1988, The Royal Bank of Scotland Group acquired Citizens. Under RBS ownership, Citizens acquired several smaller banks in New England to become the second largest bank in the region. In 1996, in conjunction with the acquisition of First NH Bank, the Bank of Ireland gained a 23.5% stake in Citizens, which RBS then acquired two years later to resume 100% ownership. In 1999, Citizens acquired the United States Trust Company of Boston and the retail banking business of State Street Corporation, significantly increasing its footprint in Massachusetts. Expansion outside New England began in 2001, when RBS purchased the retail banking division of Mellon Financial Corporation in Pennsylvania, New Jersey and Delaware for $2 billion. At one stroke, Citizens Bank became the second-largest bank in Pennsylvania, and a major bank in both Philadelphia and Pittsburgh. On January 17, 2003, Citizens Financial Group purchased Commonwealth Bancorp, the holding company for Commonwealth Bank, based in Norristown, Pennsylvania. In July 2003, the bank purchased the naming rights to the new home stadium of the Philadelphia Phillies professional baseball team, which was named Citizens Bank Park and opened on April 3, 2004. In 2004, RBS purchased the credit card division of Connecticut-based People's Bank. This purchase allowed Citizens to issue and market its own credit cards. A new corporate logo designed to show Citizens Bank's connection to the Royal Bank of Scotland debuted on April 26, 2005. In July 2006, Citizens Bank eliminated the mortgage department in Michigan and terminated over 100 employees. On September 1, 2007, the individual banks under Citizens Financial Group, excluding Citizens Bank of Pennsylvania, merged into RBS Citizens, N.A. In October 2015, RBS sold its remaining stake in Citizens Financial Group, having progressively reduced its stake through an initial public offering (IPO) started in 2014. Charter One Financial In August 2004, Citizens Financial acquired Cleveland-based Charter One Financial, parent company of Charter One Bank, with branches in Illinois, Ohio, Indiana, Michigan, upstate New York, and Vermont for $10.5 billion. Because Citizens Republic Bancorp of Flint, Michigan, already operated under the Citizens Bank name in most of Charter One's territory, Citizens Financial elected to keep the Charter One name in Charter One's Midwestern footprint. However, it re-branded the New York and Vermont branches as Citizens Bank. This purchase made Citizens Financial the 12th largest bank in the United States with over $131 billion in assets and 1,530 branches across 13 states. In early 2005, the Charter One name replaced the Citizens Bank banner on seven branches in Butler County, Pennsylvania. This rebranding resolved a 3½-year-old name dispute with Butler-based Citizens National Bank. By mid 2005, Citizens National and Citizens Financial agreed to a compromise. Citizens National Bank changed its name to NexTier Bank, while the Citizens Financial Group branches reverted to the \"Citizens Bank\" name. In November 2008, Charter One sold its network of 65 branches in Indiana to Old National Bank which rebranded them under the Old National Bank banner. The transaction closed in June 2010. In 2014, Citizens sold 94 branches in metropolitan Chicago to U.S. Bancorp. Citizens Republic Bancorp was founded in Flint, Michigan, in 1871 and merged with Republic Bank in 2006. In 2007, Citizens Republic prevailed in a case to prevent Citizens Financial from using the similar name in Michigan and Ohio. FirstMerit Bank acquired Citizens Republic in 2013 and rebranded all branches as FirstMerit until 2016 when Huntington Bancshares acquired FirstMerit. With conflicting names no longer an issue, Citizens Bank announced June 30, 2014, that Charter One branches in Michigan and Ohio would be rebranded as Citizens Bank. The name change officially took place on April 27, 2015, bringing to an end the name Charter One in Cleveland; the city in which it was founded. Financial crisis In May 2008, Citizens Financial Group failed to publicly announce that it was under investigation by the Securities and Exchange Commission (SEC) for its involvement in the sub-prime mortgage crisis that devastated the U.S. housing market and bond investors around the world. The SEC only investigated banks if suspected of involvement in the purchase and sale of subprime securities. In 2008, the company lost $929 million and anticipated writing off $2 billion in bad loans. Royal Bank of Scotland posted the biggest loss in British corporate history and announced cost-cutting measures at Citizens. A Philadelphia developer sued Citizens Bank January 27, 2010, for $8 billion, under a claim that the bank used sham accusations of default to recall loans in an effort to prop up its failing parent companies, Citizens Financial Group and \"its ultimate parent, The Royal Bank of Scotland Group.\" The case was ultimately settled out of court. IPO Following the effective nationalization of RBS in 2008, speculation arose as to whether RBS would retain Citizens Bank. In 2012, public pressure in the United Kingdom grew for RBS to focus on its home market and sell foreign assets, including Citizens Bank, in order for UK taxpayers to earn their money back. Substantial interest in Citizens Bank had been rumored from other foreign banks such as Brazil-based Itaú Unibanco and Canada-based Toronto-Dominion Bank, the latter of which already had an existing U.S. branch network that overlapped with the existing Citizen footprint east of the Appalachian Mountains. The Bank of Montreal, with its existing U.S. presence, was also mentioned as a possible buyer. U.S. banks mentioned as potential Citizens buyers included JPMorgan Chase, Wells Fargo, U.S. Bancorp, PNC Financial Services, and Fifth Third Bank. In February 2013, RBS confirmed at least a partial spinoff of Citizens through an initial public offering within the next two years. Then in October 2013, RBS announced it would sell its Chicago-area branches, which represented 6% of its U.S. deposits; Citizens later agreed to sell those branches to U.S. Bancorp on January 7, 2014. Finally in November 2013, RBS announced that it would divest all of Citizens Financial Group. The bank began trading on the New York Stock Exchange under the ticker symbol CFG on September 24, 2014, raising $3 billion. By April 2015, RBS Group's shareholding in the bank had dropped to 45.6%. A further sale in July 2015 reduced RBS' stake to 23.4%. RBS sold its remaining stake in the bank in October 2015. However, Citizens still uses the RBS \"daisy wheel\" logo. In June 2016, it was announced that Citizens Financial Group had joined the Fortune 500 for the first time. Misappropriation of depositor funds In August 2015, the Consumer Financial Protection Bureau (CFPB) and other federal regulators levied nearly $35 million in penalties against Citizens Bank \"for failing to credit to customers’ accounts the full amount of their deposits\". The regulators declared that, from 2008 to 2013, \"The bank’s actions resulted in consumers being shorted millions of dollars\". Joint action by the CFPB, the FDIC, and the Comptroller of the Currency determined that Citizens Bank had engaged in \"deceptive practices\" by \"fail[ing] to give customers their full deposits at times when the size of the deposit didn’t match the number written on deposit slips\", despite promising to correct such discrepancies, instead pocketing the difference. The bank was required to reimburse its customers for lost funds as well as pay roughly $20 million in fines to the three agencies. The New York Times said that Citizens Bank's misconduct \"is appalling precisely because it is so basic\", demonstrating that \"regulators like the Consumer Financial Protection Bureau are a necessary defense against a system prone to abuses\". Paul Manafort investigation On May 12, 2017, The Wall Street Journal reported that the United States Department of Justice requested from numerous banks, including Citizens, Trump 2016 campaign manager Paul Manafort's transaction records. According to the article, the request was related to the investigation into alleged Russian interference in the 2016 United States elections. Manafort reportedly secured a $2.7 million loan from Citizens in 2016. On February 26, 2018, Bloomberg News reported that Citizens' stock price dropped 4.1 percent after U.S. Special Counsel Robert Mueller's indictment of Manafort was released, appearing to indicate that Citizens was the \"Lender B\" cited as having lent $3.4 million to the former campaign manager of President Trump. Subsequent acquisitions In August 2018, Citizens completed its acquisition of Franklin American Mortgage in a deal valued at $511 Million, expanding its presence into Tennessee and Texas. On May 26, 2021, Citizens entered into an agreement with HSBC Bank USA to purchase HSBC's retail operations on the East Coast. Under the agreement, Citizens would acquire approximately $9.0 billion in deposits and approximately $2.2 billion in loans. In April 2022, Citizens completed the acquisition of 80 branches from HSBC in New York City, New Jersey, Pennsylvania, Washington, D.C., Maryland, Virginia, and Florida. In July 2021, Citizens announced plans to acquire New Jersey–based bank holding company Investors Bancorp for $3.5 billion. Citizens took over more than 150 branches with the deal. As of February 2023, all Investors locations were rebranded as Citizens Bank. Branches Like several other banks, Citizens has agreements with several supermarket chains to locate bank branches in the stores. The greatest number of these are in Pittsburgh-based Giant Eagle stores, most of which were acquired in the acquisition of Mellon Financial Corporation's retail banking division. Citizens also operates branches inside many Stop & Shop and Shaw's stores in New England. One unique aspect at Citizens branches inside supermarkets is full-service banking from 10 a.m. to 3 p.m. on Sundays; historically, USA banks were often closed on Sunday and even Saturdays. In September 2010, Giant Eagle announced a new agreement with Huntington Bank in which Huntington would open branches in several stores in Ohio and West Virginia and will replace existing branches of other banks when the store's agreements with those banks expire. On June 25, 2008, Citizens Bank announced would sell 18 branches in upstate New York as it prepared to open 57 branches downstate. Community Bank System Inc. of DeWitt, New York purchased the branches in Ausable Forks, Champlain, Fort Covington, Indian Lake, Lake Placid, Lyons Falls, Long Lake, Malone, Newcomb, North Creek, Plattsburgh, Saranac Lake, Ticonderoga, Tupper Lake and Whitehall. The sale completed on November 7, 2008. In October 2009, Citizens Bank opened a full-service branch inside a Dunkin' Donuts in Bellingham, Massachusetts. The branch offers teller windows, a full-service automated teller machine (ATM) and Dunkin' Donuts promotions for using the bank's services."
}