{
  "ticker": "CHD",
  "cik": "0000313927",
  "company_name": "Church & Dwight",
  "corrected_name": "Church & Dwight",
  "wiki_title_used": "Church & Dwight",
  "exists": true,
  "raw_text": "Church & Dwight Co., Inc. is an American consumer goods company focusing on personal care, household products, and specialty products. The company was founded in 1847 and is headquartered in Ewing, New Jersey. It is the parent company of well-known brands such as Arm & Hammer, Trojan, OxiClean, and First Response. In 2022, Church & Dwight reported annual revenue of $5.4 billion. The company's products and services include a wide range of consumer goods, including laundry detergent, air fresheners, baking soda, condoms, pregnancy tests, and oral hygiene products.\n\nHistory\nThe company was founded in 1847 to unify two companies created by John Dwight of Massachusetts and his brother-in-law, Austin Church of Connecticut. Their partnership had begun in 1846 with the two founders selling sodium bicarbonate (also known as baking soda) that they refined in Dwight's kitchen.\nThe Arm & Hammer name and logo, which dates back to the 1860s, is often incorrectly claimed to have originated with tycoon Armand Hammer. Hammer was so often asked about the Church & Dwight brand that he attempted to buy the company. While this attempt was unsuccessful, Hammer's Occidental Petroleum in 1986 acquired enough stock for him to join the Church & Dwight board of directors until he died in 1990.\nIn 1970, the Arm & Hammer brand introduced the market's first nationally distributed, phosphate-free detergent: Arm & Hammer Powder Laundry Detergent.\n\n2000s\nIn 2001, Church & Dwight acquired the consumer product line of Carter-Wallace, and MedPointe bought the diagnostics and drug businesses. The same year, Church & Dwight expanded its business into laundry detergent products by acquiring small detergent company USA Detergents, the original owner of Xtra detergent.\nIn 2003, Church & Dwight bought the U.S. and Canadian rights to Unilever's oral health business, which includes Pepsodent, Mentadent, Close-Up, and Aim. Unilever still owns the brands outside of North America.\nIn 2006, Church & Dwight expanded its household brand portfolio with the acquisition of Denver-based Orange Glo International, which included such brands as OxiClean in the laundry pre-wash additive category, Kaboom bathroom cleaners, and Orange Glo household cleaning products.\nIn 2008, Church & Dwight acquired the Orajel business from Del Labs, including pain relievers for toothache, mouth sore, teething, and non-fluoride toothpaste.\n\n2010s\nChurch & Dwight was ranked 723 in the Fortune 500 listing of companies in 2010. The same year, Church & Dwight acquired Simply Saline and Feline Pine.\nIn 2016, Church & Dwight acquired Spencer Forrest, Inc., the maker of Toppik hair care products.\nIn 2017, MidOcean Partners agreed to sell Water Pik to Church & Dwight for $1 billion. At the time of the sale announcement, it was reported that Water Pik had \"$265 million of revenue in the fiscal year ended June 30, about 70% of which came from its water flosser products\".\n\n2020s\nIn December 2021, the company acquired TheraBreath for a reported amount of $580 million.\nIn September 2022, the company acquired Hero Cosmetics for a reported amount of $630 million.\n\nNotable brands\nSee also\nCompanies listed on the New York Stock Exchange (C)\nList of S&P 500 companies\n\nReferences\nFurther reading\nKaras, David, \"Church & Dwight picks new home in Ewing\", New Jersey On-Line, Tuesday, August 23, 2011. (The Times, Trenton)\n\"Snapshot: Church & Dwight\", CNNMoney.com\n\nExternal links\n\nBusiness data for Church & Dwight:",
  "clean_text": "Church & Dwight Co., Inc. is an American consumer goods company focusing on personal care, household products, and specialty products. The company was founded in 1847 and is headquartered in Ewing, New Jersey. It is the parent company of well-known brands such as Arm & Hammer, Trojan, OxiClean, and First Response. In 2022, Church & Dwight reported annual revenue of $5.4 billion. The company's products and services include a wide range of consumer goods, including laundry detergent, air fresheners, baking soda, condoms, pregnancy tests, and oral hygiene products. History The company was founded in 1847 to unify two companies created by John Dwight of Massachusetts and his brother-in-law, Austin Church of Connecticut. Their partnership had begun in 1846 with the two founders selling sodium bicarbonate (also known as baking soda) that they refined in Dwight's kitchen. The Arm & Hammer name and logo, which dates back to the 1860s, is often incorrectly claimed to have originated with tycoon Armand Hammer. Hammer was so often asked about the Church & Dwight brand that he attempted to buy the company. While this attempt was unsuccessful, Hammer's Occidental Petroleum in 1986 acquired enough stock for him to join the Church & Dwight board of directors until he died in 1990. In 1970, the Arm & Hammer brand introduced the market's first nationally distributed, phosphate-free detergent: Arm & Hammer Powder Laundry Detergent. 2000s In 2001, Church & Dwight acquired the consumer product line of Carter-Wallace, and MedPointe bought the diagnostics and drug businesses. The same year, Church & Dwight expanded its business into laundry detergent products by acquiring small detergent company USA Detergents, the original owner of Xtra detergent. In 2003, Church & Dwight bought the U.S. and Canadian rights to Unilever's oral health business, which includes Pepsodent, Mentadent, Close-Up, and Aim. Unilever still owns the brands outside of North America. In 2006, Church & Dwight expanded its household brand portfolio with the acquisition of Denver-based Orange Glo International, which included such brands as OxiClean in the laundry pre-wash additive category, Kaboom bathroom cleaners, and Orange Glo household cleaning products. In 2008, Church & Dwight acquired the Orajel business from Del Labs, including pain relievers for toothache, mouth sore, teething, and non-fluoride toothpaste. 2010s Church & Dwight was ranked 723 in the Fortune 500 listing of companies in 2010. The same year, Church & Dwight acquired Simply Saline and Feline Pine. In 2016, Church & Dwight acquired Spencer Forrest, Inc., the maker of Toppik hair care products. In 2017, MidOcean Partners agreed to sell Water Pik to Church & Dwight for $1 billion. At the time of the sale announcement, it was reported that Water Pik had \"$265 million of revenue in the fiscal year ended June 30, about 70% of which came from its water flosser products\". 2020s In December 2021, the company acquired TheraBreath for a reported amount of $580 million. In September 2022, the company acquired Hero Cosmetics for a reported amount of $630 million. Notable brands"
}