{
  "ticker": "CHRW",
  "cik": "0001043277",
  "company_name": "C.H. Robinson",
  "corrected_name": "C.H. Robinson",
  "wiki_title_used": "C.H. Robinson",
  "exists": true,
  "raw_text": "C.H. Robinson Worldwide, Inc. is an American transportation company that includes third-party logistics (3PL). The company offers freight transportation, transportation management, brokerage and warehousing. It offers truckload, less than truckload, air freight, intermodal, and ocean transportation.\n\nCompany overview\nThe company is headquartered in Eden Prairie, Minnesota, with more than 300 offices and over 15,000 employees in North America, Europe, Asia, and South America. The company has contractual relationships with over 66,000 transportation companies, including motor carriers, railroads, air freight, and ocean carriers. It also provides services including supply chain analysis, freight consolidation, core carrier program management, and information reporting. C.H. Robinson also owns Robinson Fresh, which buys and sells produce to the foodservice industry through independent produce growers and suppliers.\nC.H. Robinson's transportation of goods accounts for about 94% of its gross net revenues with the remainder coming from sourcing and marketing fresh produce.\n\nHistory\nOrigins and early history\nIn the early 1900s, Charles Henry Robinson owned a small wholesale brokerage house that provided produce throughout North Dakota and Minnesota. He partnered with the Nash brothers on April 11, 1905, and became the company’s first president. Nash Finch Company was the leading wholesaler in the region, owning and operating grocery stores. Following Charles Henry Robinson’s death in 1909, the Nash Brothers assumed control of the C.H. Robinson Company.\nC.H. Robinson became the procurement arm for the Nash Finch Company as it expanded in Iowa, Minnesota, Wisconsin, Illinois, and Texas. In the 1940s, the FTC found Nash Finch Company to have a \"price advantage,\" and under the Robinson-Patman Act of 1936, C.H. Robinson Co. was split into two companies. \nThe first, C.H. Robinson Co., was formed by the offices that sold produce to Nash Finch’s warehouses, and ownership was retained by C.H. Robinson employees. The second company, C.H. Robinson, Inc., remained owned by Nash Finch.\n\nExpansion into logistics and trucking\nC.H. Robinson’s entrance into the trucking business came after the Federal Highway Act of 1956 and expanded U.S. interstate commerce. C.H. Robinson and other shippers had previously relied on trains to transport goods. In 1968, the firm entered the regulated truck business as a contract carrier named Meat Packers Express based in Omaha, Nebraska. Robco Transportation Inc. was formed by merging Meat Packers Express with additional carriers three years later and was sold in 1986.\nIn the mid-1960s, C.H. Robinson Co. and C.H. Robinson, Inc., consolidated their operations under the name C.H. Robinson Co. Nash Finch still held a 25% stake in the brokerage company, with C.H. Robinson employees owning the remainder. By 1976, the Nash Finch shares had been bought out and the company was 100% employee owned. C.H. Robinson focused on using emerging technology, and adopted IBM mainframes in 1979.\nThe Motor Carrier Act of 1980 deregulated transportation industries in America and increased competition for logistics providers and shippers. C.H. Robinson created a contract carrier program, expanded its freight contract operations, and established itself as a middleman sourcing operation for shippable goods.\nThe company’s average annual growth, measured in truckloads, more than doubled and C.H. Robinson posted more than $700 million in sale within five years. Forty per cent was generated by truck brokerage, with the remainder of revenue coming from produce sales.\n\nRenaming and IPO\nThe company renamed itself C.H. Robinson Worldwide, Inc., in 1997 and had an IPO that raised $190 million for the 101 employees who sold their shares. The initial market value totaled $743 million, and the firm began trading on NASDAQ under the symbol CHRW. Gross revenues for 1997 reached $1.79 billion, while net revenues amounted to $206 million, a 15.1% increase over the previous year. In January 2023, Bob Biesterfeld stepped down as president and CEO; the company announced Scott Anderson as interim CEO.\nOn June 6, 2023, C.H. Robinson Worldwide, Inc. announced that its board of directors had appointed Dave Bozeman as chief executive officer and member of the board, effective June 26, 2023.\n\nOutreach\nThe company’s work with nonprofits and other charity and community causes has been acknowledged, including selection as a finalist for the Minnesota Business Magazine 2015 Long-Term Achievement Award for “demonstrating a long-term commitment to positively impacting the state’s community of nonprofits or other worthy causes.”\n\nAcquisitions\nBeginning in 1989, C.H. Robinson began expanding its international logistics operations with the opening of its Monterrey, Mexico office. It acquired C.S. Greene International in 1992 to add international freight forwarding, air freight operations, and refrigerated containers. In 1993, C.H. Robinson bought a 30% stake in Transeco, a major French motor carrier, and eventually bought the entire company. C.H. Robinson added to its operations by purchasing companies including Daystar International, a distributor of fruit juice, and FoodSource. It also became an exclusive marketer for Tropicana, Motts, Glory and Welch’s.\nThe company continued expanding its logistics services by purchasing regional logistics firms like the Chicago-based American Backhaulers, Inc. for $136 million in 1999, and acquired the Minnesota-based Trans-Consolidated Inc.\nAt the end of the 1990s, the company began making acquisitions to expand its shipping and logistics services in international markets. These acquisitions included: Preferred Translocation Systems; the Argentina-based Comexter Group; the Western European transportation provider Norminter; New York-based Vertex Transportation Inc.; Smith Terminal International Services, one of the largest third-party logistics providers in Florida; the Germany-based international freight logistics provider Frank M. Viet GmbH Internationale Spedition; Dalian Decheng Shipping Agency Co.; FoodSource Procurement LLC; Apreo Logistics S.A.; and other major European, Indian, Chinese, and North American logistics providers.\nIn 2012, C.H Robinson purchased Phoenix International for $635 million and doubled its ocean freight capacity. The company also acquired the Polish shipping firm Apreo Logisitics S.A., which provides trucking, air, and ocean shipping services throughout Europe.\nThe company launched a technology-enabled platform called Navisphere in 2012. The service provides facilities to  C.H. Robinson employees, customers, and service providers to manage supply chain logistics, transportation, and sourcing activities on a global scale.\nTMC, a division of C.H. Robinson, provides support for C.H. Robinson’s network through its Managed TMS, a combination of global transportation management system (TMS) software, and logistics management.\nIn 2015, the company connected its shipping and logistics services to expand into less-than-truckload markets; it acquired the company Freightquote, a privately owned online transportation broker.\nC.H. Robinson acquired Prime Distribution Services on January 28, 2020, for $225 million. This purchase moved the company into warehouse management with a total of 2.6 million square feet of warehouse space.\n\nSee also\nReeves v. C.H. Robinson Worldwide, Inc.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for C.H. Robinson Worldwide, Inc.:",
  "clean_text": "C.H. Robinson Worldwide, Inc. is an American transportation company that includes third-party logistics (3PL). The company offers freight transportation, transportation management, brokerage and warehousing. It offers truckload, less than truckload, air freight, intermodal, and ocean transportation. Company overview The company is headquartered in Eden Prairie, Minnesota, with more than 300 offices and over 15,000 employees in North America, Europe, Asia, and South America. The company has contractual relationships with over 66,000 transportation companies, including motor carriers, railroads, air freight, and ocean carriers. It also provides services including supply chain analysis, freight consolidation, core carrier program management, and information reporting. C.H. Robinson also owns Robinson Fresh, which buys and sells produce to the foodservice industry through independent produce growers and suppliers. C.H. Robinson's transportation of goods accounts for about 94% of its gross net revenues with the remainder coming from sourcing and marketing fresh produce. History Origins and early history In the early 1900s, Charles Henry Robinson owned a small wholesale brokerage house that provided produce throughout North Dakota and Minnesota. He partnered with the Nash brothers on April 11, 1905, and became the company’s first president. Nash Finch Company was the leading wholesaler in the region, owning and operating grocery stores. Following Charles Henry Robinson’s death in 1909, the Nash Brothers assumed control of the C.H. Robinson Company. C.H. Robinson became the procurement arm for the Nash Finch Company as it expanded in Iowa, Minnesota, Wisconsin, Illinois, and Texas. In the 1940s, the FTC found Nash Finch Company to have a \"price advantage,\" and under the Robinson-Patman Act of 1936, C.H. Robinson Co. was split into two companies. The first, C.H. Robinson Co., was formed by the offices that sold produce to Nash Finch’s warehouses, and ownership was retained by C.H. Robinson employees. The second company, C.H. Robinson, Inc., remained owned by Nash Finch. Expansion into logistics and trucking C.H. Robinson’s entrance into the trucking business came after the Federal Highway Act of 1956 and expanded U.S. interstate commerce. C.H. Robinson and other shippers had previously relied on trains to transport goods. In 1968, the firm entered the regulated truck business as a contract carrier named Meat Packers Express based in Omaha, Nebraska. Robco Transportation Inc. was formed by merging Meat Packers Express with additional carriers three years later and was sold in 1986. In the mid-1960s, C.H. Robinson Co. and C.H. Robinson, Inc., consolidated their operations under the name C.H. Robinson Co. Nash Finch still held a 25% stake in the brokerage company, with C.H. Robinson employees owning the remainder. By 1976, the Nash Finch shares had been bought out and the company was 100% employee owned. C.H. Robinson focused on using emerging technology, and adopted IBM mainframes in 1979. The Motor Carrier Act of 1980 deregulated transportation industries in America and increased competition for logistics providers and shippers. C.H. Robinson created a contract carrier program, expanded its freight contract operations, and established itself as a middleman sourcing operation for shippable goods. The company’s average annual growth, measured in truckloads, more than doubled and C.H. Robinson posted more than $700 million in sale within five years. Forty per cent was generated by truck brokerage, with the remainder of revenue coming from produce sales. Renaming and IPO The company renamed itself C.H. Robinson Worldwide, Inc., in 1997 and had an IPO that raised $190 million for the 101 employees who sold their shares. The initial market value totaled $743 million, and the firm began trading on NASDAQ under the symbol CHRW. Gross revenues for 1997 reached $1.79 billion, while net revenues amounted to $206 million, a 15.1% increase over the previous year. In January 2023, Bob Biesterfeld stepped down as president and CEO; the company announced Scott Anderson as interim CEO. On June 6, 2023, C.H. Robinson Worldwide, Inc. announced that its board of directors had appointed Dave Bozeman as chief executive officer and member of the board, effective June 26, 2023. Outreach The company’s work with nonprofits and other charity and community causes has been acknowledged, including selection as a finalist for the Minnesota Business Magazine 2015 Long-Term Achievement Award for “demonstrating a long-term commitment to positively impacting the state’s community of nonprofits or other worthy causes.” Acquisitions Beginning in 1989, C.H. Robinson began expanding its international logistics operations with the opening of its Monterrey, Mexico office. It acquired C.S. Greene International in 1992 to add international freight forwarding, air freight operations, and refrigerated containers. In 1993, C.H. Robinson bought a 30% stake in Transeco, a major French motor carrier, and eventually bought the entire company. C.H. Robinson added to its operations by purchasing companies including Daystar International, a distributor of fruit juice, and FoodSource. It also became an exclusive marketer for Tropicana, Motts, Glory and Welch’s. The company continued expanding its logistics services by purchasing regional logistics firms like the Chicago-based American Backhaulers, Inc. for $136 million in 1999, and acquired the Minnesota-based Trans-Consolidated Inc. At the end of the 1990s, the company began making acquisitions to expand its shipping and logistics services in international markets. These acquisitions included: Preferred Translocation Systems; the Argentina-based Comexter Group; the Western European transportation provider Norminter; New York-based Vertex Transportation Inc.; Smith Terminal International Services, one of the largest third-party logistics providers in Florida; the Germany-based international freight logistics provider Frank M. Viet GmbH Internationale Spedition; Dalian Decheng Shipping Agency Co.; FoodSource Procurement LLC; Apreo Logistics S.A.; and other major European, Indian, Chinese, and North American logistics providers. In 2012, C.H Robinson purchased Phoenix International for $635 million and doubled its ocean freight capacity. The company also acquired the Polish shipping firm Apreo Logisitics S.A., which provides trucking, air, and ocean shipping services throughout Europe. The company launched a technology-enabled platform called Navisphere in 2012. The service provides facilities to C.H. Robinson employees, customers, and service providers to manage supply chain logistics, transportation, and sourcing activities on a global scale. TMC, a division of C.H. Robinson, provides support for C.H. Robinson’s network through its Managed TMS, a combination of global transportation management system (TMS) software, and logistics management. In 2015, the company connected its shipping and logistics services to expand into less-than-truckload markets; it acquired the company Freightquote, a privately owned online transportation broker. C.H. Robinson acquired Prime Distribution Services on January 28, 2020, for $225 million. This purchase moved the company into warehouse management with a total of 2.6 million square feet of warehouse space."
}