{
  "ticker": "CHTR",
  "cik": "0001091667",
  "company_name": "Charter Communications",
  "corrected_name": "Charter Communications",
  "wiki_title_used": "Charter Communications",
  "exists": true,
  "raw_text": "Charter Communications, Inc., is an American telecommunications and mass media company with services branded as Spectrum. The company is headquartered in Stamford, Connecticut.\nWith over 32 million customers in 41 states as of 2022, it is the largest cable operator in the United States by subscribers, just ahead of Comcast, and the largest pay TV operator ahead of Comcast and AT&T. Charter is the fifth-largest telephone provider based on number of residential lines. Its brand of Spectrum services also include internet access, internet security, managed services, and unified communications.\nIn late 2012, with longtime Cablevision executive Thomas Rutledge named as their CEO, Charter relocated its corporate headquarters from St. Louis, Missouri, to Stamford, Connecticut, though kept many of its operations in St. Louis. On May 18, 2016, Charter finalized acquisition of Time Warner Cable and its sister company Bright House Networks, making it the third-largest pay television service in the United States. In 2019, Charter ranked No. 70 in the Fortune 500 list of the largest United States corporations by total revenue.\n\nHistory\n1980–1992: Beginnings\nCharter Communications CATV systems was founded in 1980 by Charles H. Leonard in Barry County, Michigan. The original Charter system headquarters and offices were located at 1001 Payne Lake Road, Yankee Springs Township, Michigan.  Leonard began a corporate partnership with Gary Wilcox and Gerry Kazma, both from Naperville, Illinois, during which Spectrum Communications (Wilcox) merged with Charter Systems (1981–1983).\n\n1993: Consolidation and founding of Charter Communications, Inc.\nThrough continued mergers and acquisition, Charter was consolidated in 1993 by Barry Babcock, Jerald Kent and Howard Wood, who had been former executives at Cencom Cable Television in St. Louis, Missouri. It was also incorporated in the state of Missouri in 1993.\n\n1994–1998: Early growth\nIn 1995, Charter paid about $300 million for a controlling interest in the cable television systems owned by Crown Media Holdings and acquired Cable South.\nIn 1997, Charter and EarthLink worked together to deliver high-speed Internet access through cable modems to Charter's customers in Los Angeles and Riverside, California.\nIn 1998, Paul Allen bought a controlling interest. The company paid $2.8 billion to acquire Dallas-based cable company Marcus Cable. Charter Communications had one million customers in 1998.\n\n1999–2008: Nasdaq listing and acquisitions\nIn November 1999, the company went public, trading on the Nasdaq stock exchange. At the time, it had 3.9 million customers.\nCharter completed more than 10 major acquisitions in 1999 when it:\n\nAdded 68,000 subscribers in Southern California with the purchase of four cable systems from American Cable Entertainment of Stamford, Connecticut.\nAcquired 400,000 InterMedia Partners subscribers, primarily in the Southeast. As part of the deal Charter would turn over about 140,000 of its subscribers to TCI in a cable system swap.\nMerged with Marcus Cable\nAcquired cable systems serving 460,000 subscribers from Rifkin Acquisition Partners and InterLink Communications.\nAcquired 173,000 subscribers, mostly in central Massachusetts, from New Jersey–based Greater Media Inc.\nAcquired Renaissance Media Group, a New York partnership serving 130,000 customers near New Orleans, western Mississippi, and Jackson, Tennessee.\nAcquired New Jersey–based Helicon Cable Communications. The systems served about 171,000 customers in eight states in the Southeast and Northeast.\nAcquired Avalon Cable TV, adding 260,000 subscribers primarily in Michigan and Massachusetts.\nAcquired Vista Broadband Communications in Smyrna, Georgia, adding 30,000 more customers.\nAcquired Falcon Cable TV of Los Angeles. Falcon was the eighth-largest cable operator in the United States with about one million subscribers in 27 states in primarily non-urban areas.\nAcquired Fanch Communications Inc. of Denver. Fanch had 547,000 subscribers in West Virginia, Pennsylvania, Michigan, Indiana, Kentucky, Louisiana, and Wisconsin.\nCharter also began swapping customers with other systems to improve the geographic clustering of its systems. In December 1999, it signed a letter of intent with AT&T Corporation to swap 1.3 million cable subscribers in St. Louis as well as in Alabama, Georgia, and Missouri. In 2000, Charter Communications bought select AT&T cable markets, including Reno, Nevada, and the City of St. Louis.\nIn 2001, MSN and Charter signed an agreement to offer MSN content and services to Charter's broadband customers. In the same year, Charter received awards, including the Outstanding Corporate Growth Award from the Association for Corporate Growth, the R.E. \"Ted\" Turner Innovator of the Year Award from the Southern Cable Telecommunications Association, and the Fast 50 Award for Growth from the St. Louis Regional Chamber and Growth Association.\nIn 2008, Charter stock failed to meet Nasdaq standards and was given warning to comply by October 13 or request an extension.\nAlso in 2008, it acquired the cable-television franchise and service for the Cerritos and Ventura, California, areas from Wave Broadband.\n\n2009: Bankruptcy and emergence\nIn February 2009, Charter Communications announced that it planned to file for Chapter 11 of the United States Bankruptcy Code on or before April 1, 2009. The action would allow Charter to pay its debt obligations, and cancel its obligations to shareholders. Private equity firm Apollo Management expected to own most of Charter's shares after the bankruptcy. Charter filed for a prearranged bankruptcy on March 28, 2009. The company expected the financial restructuring to reduce its debt by $8 billion, as well as adding $3 billion of new investment, and refinancing other debt.\nOn November 30, 2009, its bankruptcy plan was approved, which extinguished its stock and cut approximately $8 billion in debt. That day, Charter emerged from bankruptcy despite many of its creditors' objections over its bankruptcy plan.\n\n2010–2012: Nasdaq re-listing; leadership change\nOn September 14, 2010, Charter Class A common stock was re-listed on Nasdaq under the symbol \"CHTR\".\nIn 2011, Microsoft co-founder Paul Allen stepped down as chairman and from the board of directors' seat, but at the time remained the largest single shareholder. Also in that year, Charter signed a multi-year deal with TiVo to deliver content via its platform.\nThomas M. Rutledge was appointed as a director and president and chief executive officer effective February 13, 2012.\nThe same year, Charter priced $1.25 billion senior debt, offering to pay down short- and long-term debt.\n\n2013–2014: Purchase of Optimum West; Liberty Media investment\nOn February 8, 2013, Charter announced an agreement to acquire some former Bresnan Communications systems from Cablevision in a transaction worth US$1.63 billion. The deal brought Charter cable systems to 375,000 customers in Colorado's mountains and Western Slope, as well as in Utah, Wyoming and Montana.\nApproximately one month later, on March 19, 2013, Charter announced that Liberty Media, a company controlled by former TCI CEO John C. Malone, would be acquiring a 27.3% ownership interest in the company, making it the company's largest single shareholder, largely through the purchase of interests held by investment funds following Charter's 2009 restructuring. In November 2014, Liberty's holdings in Charter as well as a small minority interest in Time Warner Cable were spun off as a separate holding company named Liberty Broadband Corporation, which as of early 2015 was 47.1% controlled by Malone.\n\n2014–2017: Acquisition of Time Warner Cable and Bright House Networks\nOn January 13, 2014, Charter Communications said it was interested in buying its larger rival Time Warner Cable. After three previous attempts to buy and merge with the company, all of which failed, Charter's chief executive officer Thomas Rutledge wrote in an open letter to Time Warner Cable's chief executive officer Robert Marcus stating, \"I believe we have a significant opportunity to put our companies together in a way that will create maximum, long-term value for shareholders and employees of both companies\". The $132.50 per share offer, just above TWC's closing price at $132.40 on January 13, was rejected.\nOn February 13, 2014, Time Warner Cable accepted an offer of $158.82 per share from Comcast, avoiding a hostile takeover situation from Charter.\nOn April 28, 2014, Comcast and Charter announced that, assuming Comcast's merger with Time Warner Cable was successful, Charter would acquire 1.4 million Comcast/Time Warner Cable customers, bringing Charter's subscriber total to 30 million and making Charter, by its own count, the second-largest cable operator in the country. In addition to the 1.4 million divested subscribers, Comcast also agreed to swap 1.6 million subscribers with Charter in an even, tax-efficient exchange whose intent is to improve the geographic spread of both companies. In a third part of the agreement, Comcast would spin off 2.5 million subscribers into a new publicly traded company in which Charter would hold a 33% stake – with an option to eventually own the whole company – and former Time Warner Cable shareholders would hold a 67% stake.\nIn late March 2015, Charter announced plans to purchase Bright House Networks from Advance/Newhouse for $10.4 billion in a combination of cash and equities convertible to Charter stock. The deal was contingent on, among other approvals, the completion of Charter's transactions with Comcast, and the expiration of Time Warner Cable's right of first offer to buy Bright House itself (which was not expected to be exercised in light of the merger with Comcast). However, facing potential difficulties in reaching regulatory approval, Comcast called off its merger with Time Warner Cable in April 2015.\nOn May 26, 2015, Charter and Time Warner Cable announced that they had entered into a definitive agreement for Charter to merge with Time Warner Cable in a deal valued at $78.7 billion. Charter also confirmed that it would continue with its proposed acquisition of Bright House Networks under slightly modified terms. The deal was subject to regulatory approval, although the deal was expected to face less scrutiny from the FCC than the Comcast/TWC deal, as the companies were relatively smaller, and their media holdings are not as extensive as those of Comcast. The TWC and Bright House systems as well as Charter Cable were to be migrated to the Spectrum brand following the conclusion of the merger.\nLiberty Broadband will invest a further $5 billion in Charter and will ultimately hold about 20% ownership in the combined entity. Advance/Newhouse will own about 14%, and other current Time Warner Cable shareholders are expected to hold a combined 44% stake. The merger was approved by the Department of Justice and FCC on April 25, 2016; it is subject to conditions, including a requirement that Charter must not implement usage-based billing, nor use its dominant position in the market to impact the online video industry – which includes a prohibition on charging for interconnections. Charter was also required to expand its services to two million new households, with at least one million being in markets where competing providers operate.\nThe merger was completed on May 18, 2016. The purchase made Charter the third-largest pay television company in the United States, behind AT&T and Comcast (the former having completed its merger with DirecTV in mid-2015).\n\nSince 2017: Post-Time Warner Cable acquisition\nOn January 26, 2017, it was reported that Verizon Communications was in talks with Charter to discuss a possible buyout. President and CEO of Liberty Media, Greg Maffei said that they were not interested in the deal. The deal was rejected around the end of May 2017. Charter claimed that the deal was too low for them to accept, and Charter's largest shareholder Liberty Media stated that they were not ready to sell.\nIn March 2017 under new FCC leadership, Charter's regulatory conditions were changed to require that Charter expand its services to 2 million households that are not currently served by any broadband provider, as opposed to requiring one million of these households to be in areas served by a competitor. The decision was made under goals by new chairman Ajit Pai to increase the availability of broadband in rural areas not served by high-speed Internet, but was criticized for maintaining oligopolies rather than encouraging wider competition.\nIn May 2017, it was reported that Charter and Comcast had entered into an agreement to \"explore working together in a number of potential operational areas in the wireless space\" in respect to mobile virtual network operators (MVNOs); both providers have agreements with Verizon Wireless to re-sell its services, and Comcast announced that it would begin to do so under the brand Xfinity Mobile later in the year. The agreement includes a provision, lasting for one year, that requires the companies to receive consent from each other before performing wireless-related acquisitions or mergers.\nOn June 21, 2017, it was reported that Charter was in talks to buy Cox Communications.\nOn March 28, 2017, IBEW Local 3 went on strike, representing 1,800 employees. The company had proposed moving independently managed health and pension benefits to its own company plans, which union members considered would include drastic cuts for them and their families and loss of job security. The strike ended on April 19, 2022, with an outcome that some found disappointing.\nOn March 12, 2018, it was reported that Softbank had purchased 5% of Charter's stock on the open market.\n\nThreatened revocation of New York cable franchises\nIn June 2018, the New York Public Service Commission fined Charter $2 million for failing to meet obligations it agreed to as conditions of its acquisition of Time Warner Cable. Charter was required to expand broadband service to at least 145,000 unserved or underserved residential units over four years, with a minimum of 36,250 new units per-year. The company was accused of making false statements in its progress reports, with an audit finding that Charter fraudulently declared at least 14,000 addresses already served by the company as being \"new\" deployments. The commission threatened the possibility of further regulatory remedies, including revocation of its cable franchises.\nOn July 27, 2018, the NYPSC voted to retroactively reverse its approval of Charter's acquisition of TWC, thus revoking its franchises in the state of New York. The commission cited Charter's repeated failures to meet deadlines on expansion promised as part of the TWC purchase, \"attempts to skirt obligations to serve rural communities\", and \"purposeful obfuscation of its performance and compliance obligations to the Commission and its customers.\" Within 60 days, Charter was to submit a plan to divest and migrate its New York state cable operations (which serve around 2 million customers) to new owners.\nCharter CEO Tom Rutledge threatened legal action against the commission. The company was later granted repeated extensions of its deadline.\nIn April 2019, Charter agreed to new conditions, under which it must complete its expansion of 145,000 new premises by September 30, 2021 (being credited for 64,827 premises up until December 2018), all of which must be outside of New York City, and are subject to milestone requirements. Charter must also contribute $12 million to a fund \"for broadband expansion projects at locations to be selected by the Department and the Broadband Program Office\", with half of this funding to be provided to either Charter or a competitor via a competitive bidding process.\n\nStreaming venture\nIn April 2022, Charter and Comcast announced plans for a 50/50 venture to develop a streaming platform. As part of this effort, Comcast would license its Flex streaming platform and offer up the XClass TVs and the Xumo streaming service.\n\nUnbundling and September 2023 Disney/Spectrum carriage dispute\nIn July 2023, Charter announced a major change to its cable offerings, allowing consumers to choose between the Spectrum Select Plus cable package with regional sports offerings and the Spectrum Select Signature package without, for a lower cost. Major sports networks ESPN and FS1 would still be available with the cheaper option. This move came at a time when many consumers were cutting the cord and regional sports networks were struggling.\nAt the same time, it announced a new distribution agreement with DirecTV that would allow that service to provide more flexible options for consumers not interested in sports programming.\nESPN and sister Disney channels went dark on Charter Spectrum on August 31, 2023, interrupting coverage of the college football season opener and the US Open. Charter wanted to offer cheaper, non-sports packages to customers, as a way to fight cordcutting and to prepare for ESPN's potential launch of a full-service over-the-top subscription service. The dispute ended on September 11, 2023, with capitulations by Disney involving the offering of ESPN+ and Disney+ direct to Spectrum customers, along with sports-free bundles, though it also resulted in the removal of several networks (whose programming had already been widely available on Hulu and Disney+ or was otherwise a low priority for carriage), including BabyTV, Disney Junior, Disney XD, Freeform, FXM, FXX, Nat Geo Wild and Nat Geo Mundo.\n\nAcquisition of Liberty Broadband shares\nOn November 13, 2024, Charter announced its intent to acquire Liberty Broadband—a spin-off from Liberty Media that has held its stake in the company—in an all-stock deal. As a condition of the agreement, Liberty Broadband will spin off its subsidiary GCI Communication Corp. to its shareholders.\n\nProposed merger with Cox Communications\nOn May 16, 2025, Charter announced its intent to merge with Cox Communications, with the resulting entity keeping the Cox Communications name, but will adopt Charter's Spectrum branding for consumer-facing operations. In the transaction, Charter will acquire Cox Communications’ commercial fiber and managed IT and cloud businesses, and Cox Communications' parent Cox Enterprises will contribute Cox Communications’ residential cable business to Charter Holdings, an existing subsidiary partnership of Charter. Following the closing, Chris Winfrey will continue in his current role as President & CEO, and board member. Alex Taylor will join the board as Chairman, and Eric Zinterhofer will become the lead independent director on Charter’s board. Cox Enterprises will own 23% of the combined company, and replace Liberty Media as the provider of long-term capital to Charter.\n\nCybersecurity and network incidents\n2015 Website vulnerability\nIn May 2015, security researchers Eric Taylor and Blake Welsh identified a vulnerability in a Charter Communications Internet service website that exposed subscriber information. The flaw stemmed from the site’s reliance on IP addresses for customer identification, which could be manipulated through modified HTTP header to access account numbers, modem serial numbers, device names, home addresses, and billing details. Charter patched the affected portion of the site shortly after being notified, stating that fewer than one million customers were impacted and that no passwords or credit card numbers were exposed.\n\n2023 Third-party vendor data breach\nIn 2023, a third-party vendor working with Charter was breached, exposing data on approximately 550,000 customers, including names, addresses, and account numbers. Charter reported that financial data and Customer Proprietary Network Information were not affected.\n\n2024 FCC fine of $15 million USD\nIn July 2024, Charter Communications agreed to pay $15 million USD to the Federal Communications Commission to resolve allegations that it failed to properly notify emergency call centers about network and 911 outages, including one incident attributed to a denial-of-service attack.\n\n2024 Targeted in cyber-espionage campaign\nIn 2024, Charter Communications was among several U.S. telecommunications companies reportedly compromised in a cyber-espionage campaign attributed to the Chinese state-linked group \"Salt Typhoon,\" which exploited unpatched networking hardware.\n\n2025 Fiber-optic sabotage\nOn June 15, 2025, thirteen fiber-optic lines in Van Nuys, California, carrying more than 2,600 fibers-were deliberately severed, disrupting service for over 50,000 residential and 500 business customers, including emergency services, for up to 30 hours. Charter described the incident as an \"act of domestic terrorism.\"\n Meanwhile, the LAPD stated that the cutting of communications lines in Van Nuys was being investigated as vandalism. Similar attacks have been reported elsewhere, including a more than 200% year-over-year increase in felony vandalism against Charter's fiber network in Missouri.\n\nOperations\nCurrent operations\nAs of 2022, Charter Communications offers service to an estimated 32 million people in 41 states with significant coverage in 38 states.\nIn November 2013, the company announced the re-branding of its residential services to Charter Spectrum, which encompassed an upgrade to an all-digital network for its video, voice and broadband services. The company relied heavily on a predominantly coaxial cable–based network. The newer fiber-optic service-delivery network system, provides higher bandwidth speeds than are available with its coaxial cable infrastructure.\nEnterprise and mid-market businesses use Spectrum Enterprise for their services, which include fiber internet access, internet security, managed services, unified communications, and television products. Spectrum Business offers services to small businesses, which include internet access, internet security, phone, television, and Spectrum Mobile for Business.\nSpectrum's local insertion advertising arm, Spectrum Reach, currently offers service in 36 states across 91 media markets.\n\nFormer operations\nOn March 27, 2006, Charter announced that it would sell cable systems serving approximately 43,000 customers in Nevada, Colorado, New Mexico, and Utah to Orange Broadband Holding Company (since renamed Baja Broadband).\nCharter also sold cable systems in West Virginia and Virginia to Cebridge Connections (later Suddenlink Communications and now known as Altice USA) and cable systems in Kentucky and Illinois to New Wave Communications. The company eventually returned to those areas (excluding Illinois) in 2016 when it acquired Time Warner Cable.\nOn October 14, 2008, the Fairmont Sentinel reported that Charter was selling parts of their system to Midcontinent Communications, including Charter's offices in Bemidji and International Falls, Minnesota. Starting February 1, 2009, Midcontinent took over some of Charter's cable system in Minnesota including Balaton, Bemidji, Canby, Ely, Fairmont, International Falls, Littlefork, Sherburn, and surrounding communities. Other areas in Minnesota would have sold to Comcast, but the deal fell through.\nOn October 22, 2010, Charter sold 32 head-ends serving 65,000 customers in Alabama, Arkansas, Georgia, Louisiana, Missouri and Texas, to Cobridge Communications.\n\nLawsuits\nIn 2002, the United States Department of Justice investigated the company, leading to the indictment of four former executives in 2005 for improper financial reporting related primarily to the inflation of cable subscriber numbers to improve financial figures.\nIn 2004, Charter settled a class-action lawsuit concerning the questionable financial reporting associated with the U.S. Department of Justice's 2002 investigation and subsequent indictment of four former executives. Current and former shareholders (and their attorneys) were awarded $144 million as well as an agreement from Charter to maintain and implement proper corporate governance measures.\nIn June 2010, Charter settled a class-action lawsuit for $18 million concerning wage and overtime claims for current and former field technicians in California, Missouri, Michigan, Minnesota, Illinois, Nevada, Washington, Oregon and Nebraska.\nIn December 2013, a complaint was filed by Steelhead Licensing LLC for patent infringement of U.S. Patent 8082318; it is described as \"Controlling service requests transmitted from a client to a server\".\nIn January 2016, the National Association of African-American Owned Media and Byron Allen's Entertainment Studios filed a $10 billion civil rights lawsuit against Charter, claiming discrimination for Charter's refusal to pick up Allen's eight-channel suite of networks (which mainly carry ES content already syndicated through local television stations and paid programming); Allen and the NAAAOM (which has an Entertainment Studios executive as its head) have already filed the same type of suit against several other providers.\nIn May 2016, Charter reached a settlement with the FCC regarding allegations by Zoom Telephonics that, in 2012, following the introduction of new rate plans and the introduction of DOCSIS 3.0, it had begun to bar new subscribers or those switching to the new plans from utilizing customer-purchased modems. Although Charter ended this practice in 2014 and began to allow certain certified modems to be used, Zoom argued that the company was still deliberately limiting options by requiring the modems to undergo a testing protocol concerning factors beyond  whether they cause interference or unauthorized receipt of service (the only two factors which providers may use to restrict allowable modems under FCC policy). Charter paid a $640,000 fine, and agreed to use a shorter testing process allowing the use of any DOCSIS 3.0-compatible modem, and send compliance reports to the FCC every six months and whenever a modem is blacklisted.\nOn February 1, 2017, Charter was sued by the Attorney General of New York for failing to provide its advertised Internet speeds to customers in areas that Charter acquired by the purchase of Time Warner Cable. The company agreed to a $174.2 million settlement, including both refunds of $75 to affected subscribers (with an additional $75 to those who rented the defective modem hardware for at least 24 months), and offers of complimentary subscriptions to services such as HBO (3 months) or Showtime (6 months) to all subscribers with an internet and television bundle.\nOn August 28, 2017, Charter agreed to a $225,000 settlement in the state of Missouri over violations of telemarketing and No-call list laws.\nIn July 2022, a jury in Dallas County, Texas, ordered Charter to pay $375 million in compensatory damages plus $7 billion in punitive damages to the family of Betty Thomas, an 83-year-old grandmother, who was robbed and murdered in her home by a Spectrum technician. Lawyers for the woman's family contended that \"systemic safety failures\" at Spectrum led to the murder, and that Spectrum forged documents to force the case into arbitration instead of a jury trial. On September 19, 2022, a judge ordered Charter to pay $1.147 billion to the family after their legal team requested a reduction in the punitive damage to twice the compensatory damages. Thomas's murderer, Roy Holden Jr., is serving life in prison for his crimes.\n\nSee also\nList of United States telephone companies\nList of cable television companies\nList of Connecticut companies\nSpectrum Sports\nSpectrum News\nSportsNet LA\n\nReferences\nExternal links\n\nOfficial website",
  "clean_text": "Charter Communications, Inc., is an American telecommunications and mass media company with services branded as Spectrum. The company is headquartered in Stamford, Connecticut. With over 32 million customers in 41 states as of 2022, it is the largest cable operator in the United States by subscribers, just ahead of Comcast, and the largest pay TV operator ahead of Comcast and AT&T. Charter is the fifth-largest telephone provider based on number of residential lines. Its brand of Spectrum services also include internet access, internet security, managed services, and unified communications. In late 2012, with longtime Cablevision executive Thomas Rutledge named as their CEO, Charter relocated its corporate headquarters from St. Louis, Missouri, to Stamford, Connecticut, though kept many of its operations in St. Louis. On May 18, 2016, Charter finalized acquisition of Time Warner Cable and its sister company Bright House Networks, making it the third-largest pay television service in the United States. In 2019, Charter ranked No. 70 in the Fortune 500 list of the largest United States corporations by total revenue. History 1980–1992: Beginnings Charter Communications CATV systems was founded in 1980 by Charles H. Leonard in Barry County, Michigan. The original Charter system headquarters and offices were located at 1001 Payne Lake Road, Yankee Springs Township, Michigan. Leonard began a corporate partnership with Gary Wilcox and Gerry Kazma, both from Naperville, Illinois, during which Spectrum Communications (Wilcox) merged with Charter Systems (1981–1983). 1993: Consolidation and founding of Charter Communications, Inc. Through continued mergers and acquisition, Charter was consolidated in 1993 by Barry Babcock, Jerald Kent and Howard Wood, who had been former executives at Cencom Cable Television in St. Louis, Missouri. It was also incorporated in the state of Missouri in 1993. 1994–1998: Early growth In 1995, Charter paid about $300 million for a controlling interest in the cable television systems owned by Crown Media Holdings and acquired Cable South. In 1997, Charter and EarthLink worked together to deliver high-speed Internet access through cable modems to Charter's customers in Los Angeles and Riverside, California. In 1998, Paul Allen bought a controlling interest. The company paid $2.8 billion to acquire Dallas-based cable company Marcus Cable. Charter Communications had one million customers in 1998. 1999–2008: Nasdaq listing and acquisitions In November 1999, the company went public, trading on the Nasdaq stock exchange. At the time, it had 3.9 million customers. Charter completed more than 10 major acquisitions in 1999 when it: Added 68,000 subscribers in Southern California with the purchase of four cable systems from American Cable Entertainment of Stamford, Connecticut. Acquired 400,000 InterMedia Partners subscribers, primarily in the Southeast. As part of the deal Charter would turn over about 140,000 of its subscribers to TCI in a cable system swap. Merged with Marcus Cable Acquired cable systems serving 460,000 subscribers from Rifkin Acquisition Partners and InterLink Communications. Acquired 173,000 subscribers, mostly in central Massachusetts, from New Jersey–based Greater Media Inc. Acquired Renaissance Media Group, a New York partnership serving 130,000 customers near New Orleans, western Mississippi, and Jackson, Tennessee. Acquired New Jersey–based Helicon Cable Communications. The systems served about 171,000 customers in eight states in the Southeast and Northeast. Acquired Avalon Cable TV, adding 260,000 subscribers primarily in Michigan and Massachusetts. Acquired Vista Broadband Communications in Smyrna, Georgia, adding 30,000 more customers. Acquired Falcon Cable TV of Los Angeles. Falcon was the eighth-largest cable operator in the United States with about one million subscribers in 27 states in primarily non-urban areas. Acquired Fanch Communications Inc. of Denver. Fanch had 547,000 subscribers in West Virginia, Pennsylvania, Michigan, Indiana, Kentucky, Louisiana, and Wisconsin. Charter also began swapping customers with other systems to improve the geographic clustering of its systems. In December 1999, it signed a letter of intent with AT&T Corporation to swap 1.3 million cable subscribers in St. Louis as well as in Alabama, Georgia, and Missouri. In 2000, Charter Communications bought select AT&T cable markets, including Reno, Nevada, and the City of St. Louis. In 2001, MSN and Charter signed an agreement to offer MSN content and services to Charter's broadband customers. In the same year, Charter received awards, including the Outstanding Corporate Growth Award from the Association for Corporate Growth, the R.E. \"Ted\" Turner Innovator of the Year Award from the Southern Cable Telecommunications Association, and the Fast 50 Award for Growth from the St. Louis Regional Chamber and Growth Association. In 2008, Charter stock failed to meet Nasdaq standards and was given warning to comply by October 13 or request an extension. Also in 2008, it acquired the cable-television franchise and service for the Cerritos and Ventura, California, areas from Wave Broadband. 2009: Bankruptcy and emergence In February 2009, Charter Communications announced that it planned to file for Chapter 11 of the United States Bankruptcy Code on or before April 1, 2009. The action would allow Charter to pay its debt obligations, and cancel its obligations to shareholders. Private equity firm Apollo Management expected to own most of Charter's shares after the bankruptcy. Charter filed for a prearranged bankruptcy on March 28, 2009. The company expected the financial restructuring to reduce its debt by $8 billion, as well as adding $3 billion of new investment, and refinancing other debt. On November 30, 2009, its bankruptcy plan was approved, which extinguished its stock and cut approximately $8 billion in debt. That day, Charter emerged from bankruptcy despite many of its creditors' objections over its bankruptcy plan. 2010–2012: Nasdaq re-listing; leadership change On September 14, 2010, Charter Class A common stock was re-listed on Nasdaq under the symbol \"CHTR\". In 2011, Microsoft co-founder Paul Allen stepped down as chairman and from the board of directors' seat, but at the time remained the largest single shareholder. Also in that year, Charter signed a multi-year deal with TiVo to deliver content via its platform. Thomas M. Rutledge was appointed as a director and president and chief executive officer effective February 13, 2012. The same year, Charter priced $1.25 billion senior debt, offering to pay down short- and long-term debt. 2013–2014: Purchase of Optimum West; Liberty Media investment On February 8, 2013, Charter announced an agreement to acquire some former Bresnan Communications systems from Cablevision in a transaction worth US$1.63 billion. The deal brought Charter cable systems to 375,000 customers in Colorado's mountains and Western Slope, as well as in Utah, Wyoming and Montana. Approximately one month later, on March 19, 2013, Charter announced that Liberty Media, a company controlled by former TCI CEO John C. Malone, would be acquiring a 27.3% ownership interest in the company, making it the company's largest single shareholder, largely through the purchase of interests held by investment funds following Charter's 2009 restructuring. In November 2014, Liberty's holdings in Charter as well as a small minority interest in Time Warner Cable were spun off as a separate holding company named Liberty Broadband Corporation, which as of early 2015 was 47.1% controlled by Malone. 2014–2017: Acquisition of Time Warner Cable and Bright House Networks On January 13, 2014, Charter Communications said it was interested in buying its larger rival Time Warner Cable. After three previous attempts to buy and merge with the company, all of which failed, Charter's chief executive officer Thomas Rutledge wrote in an open letter to Time Warner Cable's chief executive officer Robert Marcus stating, \"I believe we have a significant opportunity to put our companies together in a way that will create maximum, long-term value for shareholders and employees of both companies\". The $132.50 per share offer, just above TWC's closing price at $132.40 on January 13, was rejected. On February 13, 2014, Time Warner Cable accepted an offer of $158.82 per share from Comcast, avoiding a hostile takeover situation from Charter. On April 28, 2014, Comcast and Charter announced that, assuming Comcast's merger with Time Warner Cable was successful, Charter would acquire 1.4 million Comcast/Time Warner Cable customers, bringing Charter's subscriber total to 30 million and making Charter, by its own count, the second-largest cable operator in the country. In addition to the 1.4 million divested subscribers, Comcast also agreed to swap 1.6 million subscribers with Charter in an even, tax-efficient exchange whose intent is to improve the geographic spread of both companies. In a third part of the agreement, Comcast would spin off 2.5 million subscribers into a new publicly traded company in which Charter would hold a 33% stake – with an option to eventually own the whole company – and former Time Warner Cable shareholders would hold a 67% stake. In late March 2015, Charter announced plans to purchase Bright House Networks from Advance/Newhouse for $10.4 billion in a combination of cash and equities convertible to Charter stock. The deal was contingent on, among other approvals, the completion of Charter's transactions with Comcast, and the expiration of Time Warner Cable's right of first offer to buy Bright House itself (which was not expected to be exercised in light of the merger with Comcast). However, facing potential difficulties in reaching regulatory approval, Comcast called off its merger with Time Warner Cable in April 2015. On May 26, 2015, Charter and Time Warner Cable announced that they had entered into a definitive agreement for Charter to merge with Time Warner Cable in a deal valued at $78.7 billion. Charter also confirmed that it would continue with its proposed acquisition of Bright House Networks under slightly modified terms. The deal was subject to regulatory approval, although the deal was expected to face less scrutiny from the FCC than the Comcast/TWC deal, as the companies were relatively smaller, and their media holdings are not as extensive as those of Comcast. The TWC and Bright House systems as well as Charter Cable were to be migrated to the Spectrum brand following the conclusion of the merger. Liberty Broadband will invest a further $5 billion in Charter and will ultimately hold about 20% ownership in the combined entity. Advance/Newhouse will own about 14%, and other current Time Warner Cable shareholders are expected to hold a combined 44% stake. The merger was approved by the Department of Justice and FCC on April 25, 2016; it is subject to conditions, including a requirement that Charter must not implement usage-based billing, nor use its dominant position in the market to impact the online video industry – which includes a prohibition on charging for interconnections. Charter was also required to expand its services to two million new households, with at least one million being in markets where competing providers operate. The merger was completed on May 18, 2016. The purchase made Charter the third-largest pay television company in the United States, behind AT&T and Comcast (the former having completed its merger with DirecTV in mid-2015). Since 2017: Post-Time Warner Cable acquisition On January 26, 2017, it was reported that Verizon Communications was in talks with Charter to discuss a possible buyout. President and CEO of Liberty Media, Greg Maffei said that they were not interested in the deal. The deal was rejected around the end of May 2017. Charter claimed that the deal was too low for them to accept, and Charter's largest shareholder Liberty Media stated that they were not ready to sell. In March 2017 under new FCC leadership, Charter's regulatory conditions were changed to require that Charter expand its services to 2 million households that are not currently served by any broadband provider, as opposed to requiring one million of these households to be in areas served by a competitor. The decision was made under goals by new chairman Ajit Pai to increase the availability of broadband in rural areas not served by high-speed Internet, but was criticized for maintaining oligopolies rather than encouraging wider competition. In May 2017, it was reported that Charter and Comcast had entered into an agreement to \"explore working together in a number of potential operational areas in the wireless space\" in respect to mobile virtual network operators (MVNOs); both providers have agreements with Verizon Wireless to re-sell its services, and Comcast announced that it would begin to do so under the brand Xfinity Mobile later in the year. The agreement includes a provision, lasting for one year, that requires the companies to receive consent from each other before performing wireless-related acquisitions or mergers. On June 21, 2017, it was reported that Charter was in talks to buy Cox Communications. On March 28, 2017, IBEW Local 3 went on strike, representing 1,800 employees. The company had proposed moving independently managed health and pension benefits to its own company plans, which union members considered would include drastic cuts for them and their families and loss of job security. The strike ended on April 19, 2022, with an outcome that some found disappointing. On March 12, 2018, it was reported that Softbank had purchased 5% of Charter's stock on the open market. Threatened revocation of New York cable franchises In June 2018, the New York Public Service Commission fined Charter $2 million for failing to meet obligations it agreed to as conditions of its acquisition of Time Warner Cable. Charter was required to expand broadband service to at least 145,000 unserved or underserved residential units over four years, with a minimum of 36,250 new units per-year. The company was accused of making false statements in its progress reports, with an audit finding that Charter fraudulently declared at least 14,000 addresses already served by the company as being \"new\" deployments. The commission threatened the possibility of further regulatory remedies, including revocation of its cable franchises. On July 27, 2018, the NYPSC voted to retroactively reverse its approval of Charter's acquisition of TWC, thus revoking its franchises in the state of New York. The commission cited Charter's repeated failures to meet deadlines on expansion promised as part of the TWC purchase, \"attempts to skirt obligations to serve rural communities\", and \"purposeful obfuscation of its performance and compliance obligations to the Commission and its customers.\" Within 60 days, Charter was to submit a plan to divest and migrate its New York state cable operations (which serve around 2 million customers) to new owners. Charter CEO Tom Rutledge threatened legal action against the commission. The company was later granted repeated extensions of its deadline. In April 2019, Charter agreed to new conditions, under which it must complete its expansion of 145,000 new premises by September 30, 2021 (being credited for 64,827 premises up until December 2018), all of which must be outside of New York City, and are subject to milestone requirements. Charter must also contribute $12 million to a fund \"for broadband expansion projects at locations to be selected by the Department and the Broadband Program Office\", with half of this funding to be provided to either Charter or a competitor via a competitive bidding process. Streaming venture In April 2022, Charter and Comcast announced plans for a 50/50 venture to develop a streaming platform. As part of this effort, Comcast would license its Flex streaming platform and offer up the XClass TVs and the Xumo streaming service. Unbundling and September 2023 Disney/Spectrum carriage dispute In July 2023, Charter announced a major change to its cable offerings, allowing consumers to choose between the Spectrum Select Plus cable package with regional sports offerings and the Spectrum Select Signature package without, for a lower cost. Major sports networks ESPN and FS1 would still be available with the cheaper option. This move came at a time when many consumers were cutting the cord and regional sports networks were struggling. At the same time, it announced a new distribution agreement with DirecTV that would allow that service to provide more flexible options for consumers not interested in sports programming. ESPN and sister Disney channels went dark on Charter Spectrum on August 31, 2023, interrupting coverage of the college football season opener and the US Open. Charter wanted to offer cheaper, non-sports packages to customers, as a way to fight cordcutting and to prepare for ESPN's potential launch of a full-service over-the-top subscription service. The dispute ended on September 11, 2023, with capitulations by Disney involving the offering of ESPN+ and Disney+ direct to Spectrum customers, along with sports-free bundles, though it also resulted in the removal of several networks (whose programming had already been widely available on Hulu and Disney+ or was otherwise a low priority for carriage), including BabyTV, Disney Junior, Disney XD, Freeform, FXM, FXX, Nat Geo Wild and Nat Geo Mundo. Acquisition of Liberty Broadband shares On November 13, 2024, Charter announced its intent to acquire Liberty Broadband—a spin-off from Liberty Media that has held its stake in the company—in an all-stock deal. As a condition of the agreement, Liberty Broadband will spin off its subsidiary GCI Communication Corp. to its shareholders. Proposed merger with Cox Communications On May 16, 2025, Charter announced its intent to merge with Cox Communications, with the resulting entity keeping the Cox Communications name, but will adopt Charter's Spectrum branding for consumer-facing operations. In the transaction, Charter will acquire Cox Communications’ commercial fiber and managed IT and cloud businesses, and Cox Communications' parent Cox Enterprises will contribute Cox Communications’ residential cable business to Charter Holdings, an existing subsidiary partnership of Charter. Following the closing, Chris Winfrey will continue in his current role as President & CEO, and board member. Alex Taylor will join the board as Chairman, and Eric Zinterhofer will become the lead independent director on Charter’s board. Cox Enterprises will own 23% of the combined company, and replace Liberty Media as the provider of long-term capital to Charter. Cybersecurity and network incidents 2015 Website vulnerability In May 2015, security researchers Eric Taylor and Blake Welsh identified a vulnerability in a Charter Communications Internet service website that exposed subscriber information. The flaw stemmed from the site’s reliance on IP addresses for customer identification, which could be manipulated through modified HTTP header to access account numbers, modem serial numbers, device names, home addresses, and billing details. Charter patched the affected portion of the site shortly after being notified, stating that fewer than one million customers were impacted and that no passwords or credit card numbers were exposed. 2023 Third-party vendor data breach In 2023, a third-party vendor working with Charter was breached, exposing data on approximately 550,000 customers, including names, addresses, and account numbers. Charter reported that financial data and Customer Proprietary Network Information were not affected. 2024 FCC fine of $15 million USD In July 2024, Charter Communications agreed to pay $15 million USD to the Federal Communications Commission to resolve allegations that it failed to properly notify emergency call centers about network and 911 outages, including one incident attributed to a denial-of-service attack. 2024 Targeted in cyber-espionage campaign In 2024, Charter Communications was among several U.S. telecommunications companies reportedly compromised in a cyber-espionage campaign attributed to the Chinese state-linked group \"Salt Typhoon,\" which exploited unpatched networking hardware. 2025 Fiber-optic sabotage On June 15, 2025, thirteen fiber-optic lines in Van Nuys, California, carrying more than 2,600 fibers-were deliberately severed, disrupting service for over 50,000 residential and 500 business customers, including emergency services, for up to 30 hours. Charter described the incident as an \"act of domestic terrorism.\" Meanwhile, the LAPD stated that the cutting of communications lines in Van Nuys was being investigated as vandalism. Similar attacks have been reported elsewhere, including a more than 200% year-over-year increase in felony vandalism against Charter's fiber network in Missouri. Operations Current operations As of 2022, Charter Communications offers service to an estimated 32 million people in 41 states with significant coverage in 38 states. In November 2013, the company announced the re-branding of its residential services to Charter Spectrum, which encompassed an upgrade to an all-digital network for its video, voice and broadband services. The company relied heavily on a predominantly coaxial cable–based network. The newer fiber-optic service-delivery network system, provides higher bandwidth speeds than are available with its coaxial cable infrastructure. Enterprise and mid-market businesses use Spectrum Enterprise for their services, which include fiber internet access, internet security, managed services, unified communications, and television products. Spectrum Business offers services to small businesses, which include internet access, internet security, phone, television, and Spectrum Mobile for Business. Spectrum's local insertion advertising arm, Spectrum Reach, currently offers service in 36 states across 91 media markets. Former operations On March 27, 2006, Charter announced that it would sell cable systems serving approximately 43,000 customers in Nevada, Colorado, New Mexico, and Utah to Orange Broadband Holding Company (since renamed Baja Broadband). Charter also sold cable systems in West Virginia and Virginia to Cebridge Connections (later Suddenlink Communications and now known as Altice USA) and cable systems in Kentucky and Illinois to New Wave Communications. The company eventually returned to those areas (excluding Illinois) in 2016 when it acquired Time Warner Cable. On October 14, 2008, the Fairmont Sentinel reported that Charter was selling parts of their system to Midcontinent Communications, including Charter's offices in Bemidji and International Falls, Minnesota. Starting February 1, 2009, Midcontinent took over some of Charter's cable system in Minnesota including Balaton, Bemidji, Canby, Ely, Fairmont, International Falls, Littlefork, Sherburn, and surrounding communities. Other areas in Minnesota would have sold to Comcast, but the deal fell through. On October 22, 2010, Charter sold 32 head-ends serving 65,000 customers in Alabama, Arkansas, Georgia, Louisiana, Missouri and Texas, to Cobridge Communications. Lawsuits In 2002, the United States Department of Justice investigated the company, leading to the indictment of four former executives in 2005 for improper financial reporting related primarily to the inflation of cable subscriber numbers to improve financial figures. In 2004, Charter settled a class-action lawsuit concerning the questionable financial reporting associated with the U.S. Department of Justice's 2002 investigation and subsequent indictment of four former executives. Current and former shareholders (and their attorneys) were awarded $144 million as well as an agreement from Charter to maintain and implement proper corporate governance measures. In June 2010, Charter settled a class-action lawsuit for $18 million concerning wage and overtime claims for current and former field technicians in California, Missouri, Michigan, Minnesota, Illinois, Nevada, Washington, Oregon and Nebraska. In December 2013, a complaint was filed by Steelhead Licensing LLC for patent infringement of U.S. Patent 8082318; it is described as \"Controlling service requests transmitted from a client to a server\". In January 2016, the National Association of African-American Owned Media and Byron Allen's Entertainment Studios filed a $10 billion civil rights lawsuit against Charter, claiming discrimination for Charter's refusal to pick up Allen's eight-channel suite of networks (which mainly carry ES content already syndicated through local television stations and paid programming); Allen and the NAAAOM (which has an Entertainment Studios executive as its head) have already filed the same type of suit against several other providers. In May 2016, Charter reached a settlement with the FCC regarding allegations by Zoom Telephonics that, in 2012, following the introduction of new rate plans and the introduction of DOCSIS 3.0, it had begun to bar new subscribers or those switching to the new plans from utilizing customer-purchased modems. Although Charter ended this practice in 2014 and began to allow certain certified modems to be used, Zoom argued that the company was still deliberately limiting options by requiring the modems to undergo a testing protocol concerning factors beyond whether they cause interference or unauthorized receipt of service (the only two factors which providers may use to restrict allowable modems under FCC policy). Charter paid a $640,000 fine, and agreed to use a shorter testing process allowing the use of any DOCSIS 3.0-compatible modem, and send compliance reports to the FCC every six months and whenever a modem is blacklisted. On February 1, 2017, Charter was sued by the Attorney General of New York for failing to provide its advertised Internet speeds to customers in areas that Charter acquired by the purchase of Time Warner Cable. The company agreed to a $174.2 million settlement, including both refunds of $75 to affected subscribers (with an additional $75 to those who rented the defective modem hardware for at least 24 months), and offers of complimentary subscriptions to services such as HBO (3 months) or Showtime (6 months) to all subscribers with an internet and television bundle. On August 28, 2017, Charter agreed to a $225,000 settlement in the state of Missouri over violations of telemarketing and No-call list laws. In July 2022, a jury in Dallas County, Texas, ordered Charter to pay $375 million in compensatory damages plus $7 billion in punitive damages to the family of Betty Thomas, an 83-year-old grandmother, who was robbed and murdered in her home by a Spectrum technician. Lawyers for the woman's family contended that \"systemic safety failures\" at Spectrum led to the murder, and that Spectrum forged documents to force the case into arbitration instead of a jury trial. On September 19, 2022, a judge ordered Charter to pay $1.147 billion to the family after their legal team requested a reduction in the punitive damage to twice the compensatory damages. Thomas's murderer, Roy Holden Jr., is serving life in prison for his crimes."
}