{
  "ticker": "CI",
  "cik": "0001739940",
  "company_name": "Cigna",
  "corrected_name": "Cigna",
  "wiki_title_used": "Cigna",
  "exists": true,
  "raw_text": "The Cigna Group is an American multinational for-profit managed healthcare and insurance company based in Bloomfield, Connecticut. Its insurance subsidiaries are major providers of medical, dental, disability, life and accident insurance and related products and services, the majority of which are offered through employers and other groups (e.g., governmental and non-governmental organizations, unions and associations). Cigna is incorporated in Delaware.\nThe company ranked No. 15 in the 2023 Fortune 500 list of the largest U.S. corporations by total revenue and in the 2023 Forbes Global 2000 ranking the company took 68th place.\nThe company has been embroiled in controversies, including engaging in automatic denials of insurance claims without reviewing them.\n\nHistory\nCigna was formed by the 1982 merger of the Connecticut General Life Insurance Company (CG) and INA Corporation (the parent corporation of Insurance Company of North America, the first stock insurance company in America). The company name, Cigna, is a mix of letters from the merging companies, CG and INA. Insurance Company of North America was formed in 1792, while CG was created in 1865 by a special act of the Governor of Connecticut. In October 1871, the great Chicago Fire burned for two days, destroyed 2,000 acres, and left 100,000 people in Illinois homeless. INA paid $650,000, one of only 51 insurance companies (out of a total of 202) to pay claims in full.\nCigna sold the majority of its life insurance operations to Lincoln National Corporation in 1997.\nIn October 2011, Cigna agreed to buy HealthSpring Inc. for $3.8 billion to jump-start its business selling Medicare plans from 46,000 Medicare Advantage members to almost 400,000 Medicare Advantage members. The payment would come from an issue of new equity to cover about 20 percent of the value, with the rest funded by additional cash and debt. In 2013, Cigna operated in 30 countries, had approximately 35,800 employees and managed around US$53.734 billion in assets.\nIn June 2015, U.S. health insurer Anthem Inc. announced that it would acquire Cigna for $47 billion in cash and stock. Anthem confirmed it had reached a deal to buy Cigna on July 24, 2015. On July 21, 2016, the US Justice Department filed an antitrust suit to block the proposed merger, and a District Court ruling on February 8, 2017, blocked the merger on anticompetitive grounds. That month, Cigna Corp. called off its $48 billion merger agreement with Anthem Inc., with Anthem stating it would \"continue to enforce its rights under the merger agreement and remains committed to closing the transaction.\" After exhausting federal appeals of the antitrust merger block, the companies turned on each other in Delaware's Court of Chancery. The legal saga came to an end with an August 31, 2020 decision denying both companies claims for compensation from the other for the failed merger.\nOn March 7, 2018, it was announced that Cigna would acquire Express Scripts in a $67 billion deal and on August 24, 2018, the shareholders of Cigna and Express Scripts approved the deal.\nIn June 2020, Cigna formed a strategic alliance with Priority Health to make comprehensive health care coverage more affordable and accessible to Michigan employers and customers.\nIn September 2020, Cigna rebranded its health services portfolio under the name Evernorth, which included Express Scripts, Accredo, and eviCore.\nIn October 2020, it was announced that Cigna and Envision Healthcare had renewed their agreement to include Envision's clinicians as in-network providers for Cigna's members.  In 2021, Molina Healthcare acquired Cigna's Medicaid contracts in Texas for US$60 million.\nOn February 13, 2023, Cigna renamed its holding company The Cigna Group, its health benefits provider business unit Cigna Healthcare, and its Evernorth business unit Evernorth Health Services.\nIn January 2024, the company agreed with the Health Care Service Corporation (HCSC) to sell Cigna Group's Medicare Advantage, Cigna Supplemental Benefits, Medicare Part D, and CareAllies businesses. The total value of the transaction is about $3.7 billion. The deal also included a four-year service agreement under which Evernorth Health Services, a subsidiary of the Cigna Group, will continue to provide pharmacy benefits to Medicare beneficiaries. The deal closed on March 19, 2025.\nOn 8 July 2025, HCSC announced that its newly acquired Cigna Medicare Advantage products will be renamed Healthspring, which was a dormant brand name acquired as part of HCSC deal with the Cigna Group. A logo and website for the newly revived Healthspring brand have already been launched by HCSC, which now owns Healthspring.\n\nCigna Global Health Benefits\nCigna Global Health Benefits is a business unit within Cigna. The company is headquartered in Wilmington, Delaware, close to Philadelphia. Additional Cigna Global Health Benefits operations are located in Visalia, California, and Greenock, Scotland and Shanghai, China and Antwerp, Belgium. Sales offices are located in North America, Europe, Asia and the Middle East.\n\nProducts and services\nCGHB global health plans typically include medical, dental, behavioral, and disability coverage, as well as business travel and life insurance components. Expatriates are defined as employees of multinational companies who work outside their home country on short- or long-term international assignments. CGHB maintains its own, in-house international claims platform, and offers a network of physicians and hospitals for its members (including 550,000 in the U.S. and more than 141,000 outside the U.S.).\n\nPublic relations and lobbying\nCigna spent more than $4.4 million from 2005 to 2009 on lobbying to attain legislation that the company favors. This includes $720,000 spent in 2009 alone, when it had 20 lobbyists at five firms working on its behalf.\nIn 2008, the head of Cigna's public relations, Wendell Potter, resigned, becoming a whistleblower who gave testimony in 2009 to the U.S. Senate Committee on Commerce, Science and Transportation in favor of reform of the health care industry.\n\nControversies\nAutomatically rejecting claims with no review\nIn 2023, Cigna was criticized for allowing company doctors to reject claims even if they had not opened the patient's file. The company was found to be using a system, \"PXDX,\" that, according to ProPublica, \"saved money in two ways. It allowed Cigna to begin turning down claims that it had once paid. And it made it cheaper to turn down claims, because the company's doctors never had to open a file or conduct any in-depth review. They simply denied the claims in bulk with an electronic signature.\" The speed with which denials were placed was termed internally as \"click and close.\"\n\nNataline Sarkisyan liver transplant case\nIn December 2007, Cigna refused to pay for a liver transplant of a California teenage girl, Nataline Sarkisyan, coming under scrutiny as a result. There was a liver ready and waiting to be transplanted, and doctors estimated she had a 65% chance of surviving at least six months. In response to much protest and public scrutiny, Cigna reversed its decision, though Ms. Sarkisyan died awaiting the transplant. \nEven though liver transplants have been performed since 1963 and are a well-accepted treatment option for end-stage liver disease and acute liver failure, Cigna defended its actions by claiming that there was insufficient data to show that a transplant for a patient in Sarkisyan's condition would be safe and effective. The California court agreed with Cigna's position that the Sarkisyans’ claims regarding Cigna's decision-making were preempted by federal ERISA law. On April 16, 2009, the United States District Court for the Central District of California dismissed all of the claims against Cigna related to the coverage determination.\nThe UK newspaper Guardian in their Esc and Ctrl videoblog about control of the Internet by corporations, documented the incident with Nataline Sarkisyan and the former vice president of Cigna talking about astroturfing, the practice of creating fake blogs by interested groups, e.g. health insurance companies, to push claims that are profitable for said company into media, e.g. dismissing universal health care.\n\nOther controversies\nIn 2002, Cigna was alleged in violation of the Securities Exchange Act for earnings manipulation. Its common stock price plummeted significantly as a result. \nIn 2015, the American Consumer Satisfaction Index named Cigna as one of the most hated companies in the U.S. Cigna's name returned on the ACSI's most hated list in 2018.\nIn August 2020, the Department of Justice filed a lawsuit against Cigna alleging that the company defrauded Medicare Advantage, Medicare, and Medicaid for $1.4B by submitting diagnostic codes for health conditions that patients did not have.\nIn November 2020, investors sued Cigna's CEO and board, alleging that they had used \"black-ops-style\" tactics to \"blow up\" the potential merger with Anthem in 2017. One pension fund accused Cigna CEO David Cordani of seeking to poison the deal after he had failed to secure the top post in the resulting company. The fund claimed he had utilized lawyers and public relations specialists to set up a \"Trojan Horse\" campaign. The merger would have produced the largest U.S. health insurer in 2017.\n\nEvaluations\nCigna received gold in the 2009 Gartner & 1to1 Customer Experience Excellence Award. The awards are given to the companies that \"most clearly demonstrate exemplary customer relationship strategy and an unrivaled level of excellence in delivering the customer experience\".\nIn January 2010, Cigna received the JD Power award for customer service for all of its call centers for the fourth time in a row.\nIn 2011, the California Nurses Association determined that Cigna denied roughly 39.6% of all claims (compared to competitors such as Aetna, who denied about 5.9% of all claims in the same time frame).\n\nStrategic alliances\nOn April 16, 2010, Cigna announced an alliance with Humana group to offer a streamlined Medicare Advantage offering through employer clients for retirees. In November 2023, Reuters reported that Cigna and Humana were in talk to merge, in a deal totalling $60 billion. In December 2023, The Wall Street Journal reported that merger talks ended.\nIn November 2011, Cigna and TTK Group, an Indian business conglomerate focused on healthcare, formed a joint venture called Cigna TTK to develop a health insurance business in India, subject to obtaining government approvals.\n\nSee also\nList of United States insurance companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for The Cigna Group:",
  "clean_text": "The Cigna Group is an American multinational for-profit managed healthcare and insurance company based in Bloomfield, Connecticut. Its insurance subsidiaries are major providers of medical, dental, disability, life and accident insurance and related products and services, the majority of which are offered through employers and other groups (e.g., governmental and non-governmental organizations, unions and associations). Cigna is incorporated in Delaware. The company ranked No. 15 in the 2023 Fortune 500 list of the largest U.S. corporations by total revenue and in the 2023 Forbes Global 2000 ranking the company took 68th place. The company has been embroiled in controversies, including engaging in automatic denials of insurance claims without reviewing them. History Cigna was formed by the 1982 merger of the Connecticut General Life Insurance Company (CG) and INA Corporation (the parent corporation of Insurance Company of North America, the first stock insurance company in America). The company name, Cigna, is a mix of letters from the merging companies, CG and INA. Insurance Company of North America was formed in 1792, while CG was created in 1865 by a special act of the Governor of Connecticut. In October 1871, the great Chicago Fire burned for two days, destroyed 2,000 acres, and left 100,000 people in Illinois homeless. INA paid $650,000, one of only 51 insurance companies (out of a total of 202) to pay claims in full. Cigna sold the majority of its life insurance operations to Lincoln National Corporation in 1997. In October 2011, Cigna agreed to buy HealthSpring Inc. for $3.8 billion to jump-start its business selling Medicare plans from 46,000 Medicare Advantage members to almost 400,000 Medicare Advantage members. The payment would come from an issue of new equity to cover about 20 percent of the value, with the rest funded by additional cash and debt. In 2013, Cigna operated in 30 countries, had approximately 35,800 employees and managed around US$53.734 billion in assets. In June 2015, U.S. health insurer Anthem Inc. announced that it would acquire Cigna for $47 billion in cash and stock. Anthem confirmed it had reached a deal to buy Cigna on July 24, 2015. On July 21, 2016, the US Justice Department filed an antitrust suit to block the proposed merger, and a District Court ruling on February 8, 2017, blocked the merger on anticompetitive grounds. That month, Cigna Corp. called off its $48 billion merger agreement with Anthem Inc., with Anthem stating it would \"continue to enforce its rights under the merger agreement and remains committed to closing the transaction.\" After exhausting federal appeals of the antitrust merger block, the companies turned on each other in Delaware's Court of Chancery. The legal saga came to an end with an August 31, 2020 decision denying both companies claims for compensation from the other for the failed merger. On March 7, 2018, it was announced that Cigna would acquire Express Scripts in a $67 billion deal and on August 24, 2018, the shareholders of Cigna and Express Scripts approved the deal. In June 2020, Cigna formed a strategic alliance with Priority Health to make comprehensive health care coverage more affordable and accessible to Michigan employers and customers. In September 2020, Cigna rebranded its health services portfolio under the name Evernorth, which included Express Scripts, Accredo, and eviCore. In October 2020, it was announced that Cigna and Envision Healthcare had renewed their agreement to include Envision's clinicians as in-network providers for Cigna's members. In 2021, Molina Healthcare acquired Cigna's Medicaid contracts in Texas for US$60 million. On February 13, 2023, Cigna renamed its holding company The Cigna Group, its health benefits provider business unit Cigna Healthcare, and its Evernorth business unit Evernorth Health Services. In January 2024, the company agreed with the Health Care Service Corporation (HCSC) to sell Cigna Group's Medicare Advantage, Cigna Supplemental Benefits, Medicare Part D, and CareAllies businesses. The total value of the transaction is about $3.7 billion. The deal also included a four-year service agreement under which Evernorth Health Services, a subsidiary of the Cigna Group, will continue to provide pharmacy benefits to Medicare beneficiaries. The deal closed on March 19, 2025. On 8 July 2025, HCSC announced that its newly acquired Cigna Medicare Advantage products will be renamed Healthspring, which was a dormant brand name acquired as part of HCSC deal with the Cigna Group. A logo and website for the newly revived Healthspring brand have already been launched by HCSC, which now owns Healthspring. Cigna Global Health Benefits Cigna Global Health Benefits is a business unit within Cigna. The company is headquartered in Wilmington, Delaware, close to Philadelphia. Additional Cigna Global Health Benefits operations are located in Visalia, California, and Greenock, Scotland and Shanghai, China and Antwerp, Belgium. Sales offices are located in North America, Europe, Asia and the Middle East. Products and services CGHB global health plans typically include medical, dental, behavioral, and disability coverage, as well as business travel and life insurance components. Expatriates are defined as employees of multinational companies who work outside their home country on short- or long-term international assignments. CGHB maintains its own, in-house international claims platform, and offers a network of physicians and hospitals for its members (including 550,000 in the U.S. and more than 141,000 outside the U.S.). Public relations and lobbying Cigna spent more than $4.4 million from 2005 to 2009 on lobbying to attain legislation that the company favors. This includes $720,000 spent in 2009 alone, when it had 20 lobbyists at five firms working on its behalf. In 2008, the head of Cigna's public relations, Wendell Potter, resigned, becoming a whistleblower who gave testimony in 2009 to the U.S. Senate Committee on Commerce, Science and Transportation in favor of reform of the health care industry. Controversies Automatically rejecting claims with no review In 2023, Cigna was criticized for allowing company doctors to reject claims even if they had not opened the patient's file. The company was found to be using a system, \"PXDX,\" that, according to ProPublica, \"saved money in two ways. It allowed Cigna to begin turning down claims that it had once paid. And it made it cheaper to turn down claims, because the company's doctors never had to open a file or conduct any in-depth review. They simply denied the claims in bulk with an electronic signature.\" The speed with which denials were placed was termed internally as \"click and close.\" Nataline Sarkisyan liver transplant case In December 2007, Cigna refused to pay for a liver transplant of a California teenage girl, Nataline Sarkisyan, coming under scrutiny as a result. There was a liver ready and waiting to be transplanted, and doctors estimated she had a 65% chance of surviving at least six months. In response to much protest and public scrutiny, Cigna reversed its decision, though Ms. Sarkisyan died awaiting the transplant. Even though liver transplants have been performed since 1963 and are a well-accepted treatment option for end-stage liver disease and acute liver failure, Cigna defended its actions by claiming that there was insufficient data to show that a transplant for a patient in Sarkisyan's condition would be safe and effective. The California court agreed with Cigna's position that the Sarkisyans’ claims regarding Cigna's decision-making were preempted by federal ERISA law. On April 16, 2009, the United States District Court for the Central District of California dismissed all of the claims against Cigna related to the coverage determination. The UK newspaper Guardian in their Esc and Ctrl videoblog about control of the Internet by corporations, documented the incident with Nataline Sarkisyan and the former vice president of Cigna talking about astroturfing, the practice of creating fake blogs by interested groups, e.g. health insurance companies, to push claims that are profitable for said company into media, e.g. dismissing universal health care. Other controversies In 2002, Cigna was alleged in violation of the Securities Exchange Act for earnings manipulation. Its common stock price plummeted significantly as a result. In 2015, the American Consumer Satisfaction Index named Cigna as one of the most hated companies in the U.S. Cigna's name returned on the ACSI's most hated list in 2018. In August 2020, the Department of Justice filed a lawsuit against Cigna alleging that the company defrauded Medicare Advantage, Medicare, and Medicaid for $1.4B by submitting diagnostic codes for health conditions that patients did not have. In November 2020, investors sued Cigna's CEO and board, alleging that they had used \"black-ops-style\" tactics to \"blow up\" the potential merger with Anthem in 2017. One pension fund accused Cigna CEO David Cordani of seeking to poison the deal after he had failed to secure the top post in the resulting company. The fund claimed he had utilized lawyers and public relations specialists to set up a \"Trojan Horse\" campaign. The merger would have produced the largest U.S. health insurer in 2017. Evaluations Cigna received gold in the 2009 Gartner & 1to1 Customer Experience Excellence Award. The awards are given to the companies that \"most clearly demonstrate exemplary customer relationship strategy and an unrivaled level of excellence in delivering the customer experience\". In January 2010, Cigna received the JD Power award for customer service for all of its call centers for the fourth time in a row. In 2011, the California Nurses Association determined that Cigna denied roughly 39.6% of all claims (compared to competitors such as Aetna, who denied about 5.9% of all claims in the same time frame). Strategic alliances On April 16, 2010, Cigna announced an alliance with Humana group to offer a streamlined Medicare Advantage offering through employer clients for retirees. In November 2023, Reuters reported that Cigna and Humana were in talk to merge, in a deal totalling $60 billion. In December 2023, The Wall Street Journal reported that merger talks ended. In November 2011, Cigna and TTK Group, an Indian business conglomerate focused on healthcare, formed a joint venture called Cigna TTK to develop a health insurance business in India, subject to obtaining government approvals."
}