{
  "ticker": "CINF",
  "cik": "0000020286",
  "company_name": "Cincinnati Financial",
  "corrected_name": "Cincinnati Financial",
  "wiki_title_used": "Cincinnati Financial",
  "exists": true,
  "raw_text": "Cincinnati Financial Corporation offers property and casualty insurance, its main business, through The Cincinnati Insurance Company, The Cincinnati Indemnity Company and The Cincinnati Casualty Company. The company has 1.01% of the domestic property and casualty insurance premiums, which ranks it as the 20th largest insurance company by market share in the U.S.\nThe Cincinnati Insurance Company was founded in 1950 by four agents, including brothers John Jack Schiff and Robert Cleveland Schiff.\nThe Cincinnati Life Insurance Company markets life and disability income insurance and annuities. CFC Investment Company supports the insurance subsidiaries and their independent agent representatives through commercial leasing and financing activities. CinFin Capital Management Company provides asset management services to institutions, corporations and individuals.\nIn 2001, SFAS 133 adjustments were included with realized capital gains or losses rather than investment income. The impact on nine-month 2001 earnings was an after-tax gain of $1.3 million. Prior period 2001 results were restated on this basis.\nIn 2008, Cincinnati began writing excess and surplus lines insurance under a new subsidiary called the Cincinnati Specialty Underwriters Insurance Company.\nMSP Underwriting, a global specialty underwriter, was acquired in February 2019, and was rebranded Cincinnati Global Underwriting Ltd. on May 1, 2019. Based in London, Cincinnati Global Underwriting Ltd. operates through Cincinnati Global Underwriting Agency Ltd., which is the Lloyd's managing agent for Cincinnati Global Syndicate 318. Collectively, the group is known as Cincinnati Global.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Cincinnati Financial Corporation:",
  "clean_text": "Cincinnati Financial Corporation offers property and casualty insurance, its main business, through The Cincinnati Insurance Company, The Cincinnati Indemnity Company and The Cincinnati Casualty Company. The company has 1.01% of the domestic property and casualty insurance premiums, which ranks it as the 20th largest insurance company by market share in the U.S. The Cincinnati Insurance Company was founded in 1950 by four agents, including brothers John Jack Schiff and Robert Cleveland Schiff. The Cincinnati Life Insurance Company markets life and disability income insurance and annuities. CFC Investment Company supports the insurance subsidiaries and their independent agent representatives through commercial leasing and financing activities. CinFin Capital Management Company provides asset management services to institutions, corporations and individuals. In 2001, SFAS 133 adjustments were included with realized capital gains or losses rather than investment income. The impact on nine-month 2001 earnings was an after-tax gain of $1.3 million. Prior period 2001 results were restated on this basis. In 2008, Cincinnati began writing excess and surplus lines insurance under a new subsidiary called the Cincinnati Specialty Underwriters Insurance Company. MSP Underwriting, a global specialty underwriter, was acquired in February 2019, and was rebranded Cincinnati Global Underwriting Ltd. on May 1, 2019. Based in London, Cincinnati Global Underwriting Ltd. operates through Cincinnati Global Underwriting Agency Ltd., which is the Lloyd's managing agent for Cincinnati Global Syndicate 318. Collectively, the group is known as Cincinnati Global."
}