{
  "ticker": "CL",
  "cik": "0000021665",
  "company_name": "Colgate-Palmolive",
  "corrected_name": "Colgate-Palmolive",
  "wiki_title_used": "Colgate-Palmolive",
  "exists": true,
  "raw_text": "The Colgate-Palmolive Company, commonly known as Colgate-Palmolive, is an American multinational consumer products company headquartered on Park Avenue in Midtown Manhattan, New York City. The company specializes in the production, distribution, and provision of household, health care, personal care, and veterinary products.\n\nHistory and founding\nWilliam Colgate, an English immigrant to the United States and devout Baptist, established a starch, soap, and candle factory on Dutch Street in New York City under the name William Colgate & Company in 1806.\nIn 1833, he suffered a severe heart attack, stopping his business's sales; after a convalescence he continued with his business. In the 1840s, the company began selling individual cakes of soap in uniform weights. In 1857, Colgate died and the company was reorganized as Colgate & Company under the management of his similarly devout Baptist son Samuel Colgate, who did not want to continue the business but thought it would be the right thing to do. In 1872, he introduced Cashmere Bouquet, a perfumed soap.\nIn 1873, the company introduced its first Colgate toothpaste, an aromatic toothpaste sold in jars. In 1896, the company sold the first toothpaste in a tube, named Colgate Ribbon Dental Cream (invented by dentist Washington Sheffield). Also in 1896, Colgate hired Martin Ittner and under his direction founded one of the first applied research labs. By 1908, they initiated mass sales of toothpaste in tubes. Another of William Colgate's sons, James Boorman Colgate, was a primary trustee of Colgate University (formerly Madison University).\nIn Milwaukee, Wisconsin, the B. J. Johnson Company was making a soap from palm oil and olive oil, the formula of which was developed by Burdett J. Johnson in 1898. The soap was popular enough to rename their company after it in 1917—Palmolive. Around the start of the 20th century, Palmolive was the world's best-selling soap.\nIn June 1928, rumors started that \"officials of the Palmolive-Peet Co. are negotiating to purchase the Colgate Co.\" privately held by the Colgate family. Peet Brothers Soap Company of Kansas City merged into Palmolive two years before the merger with Colgate. The merger combined the three oldest and largest soap and perfumery companies in the US and was effective July 1, 1928. The combined company was named the \"Colgate Palmolive Peet Company\". The combined pre-merger sales in 1927 of the three companies exceeded $100,000,000 (equivalent to $1,831,201,550 in 2024). The newly combined company had seven US manufacturing facilities as well as factories in 14 foreign countries. In 1953, the companies became a joint venture, known as the Colgate-Palmolive Company.\n\nCompetition with P&G\nColgate-Palmolive has long been in competition with Procter & Gamble (P&G), the world's largest soap and detergent maker and the maker of Crest toothpaste. P&G introduced its Tide laundry detergent shortly after World War II, and thousands of consumers turned from Colgate's soaps to the new product. Colgate lost its number one place in the toothpaste market when P&G added fluoride to its toothpaste Crest & Gleem (The Gleem brand was discontinued by P&G in 2014). Colgate has since re-claimed the #1 sales position. In the beginning of the TV era, Colgate-Palmolive wished to compete with P&G as a sponsor of soap operas and sponsored only two soap operas,  The Doctors on NBC  &   ABC's  One Life To Live from the shows debut in July 1968 until ABC bought  One Life To Live from its creator Agnes Nixon in December 1974.  They tried to keep the sponsorship of One Life To Live and gain sponsorship of Nixon's newest soap opera All My Children  which ABC begin airing on January 5th of 1970 but ABC wouldn't allow it. However, The Doctors was sponsored by Colgate-Palmolive for its entire run from April 1963 until its cancellation in December 1982. \nAfter The Doctors cancellation, Colgate-Palmolive never sponsored another show. P&G continued sponsoring several soap operas on all three networks until its last show As the World Turns was canceled in September 2010.\nGeorge Henry Lesch, president, CEO, and chairman of the board of Colgate-Palmolive in the 1960s and 1970s, transformed the firm into a modern company with major restructuring.\n\nRecent years\nIn 2005, Colgate sold the under-performing brands Fab, Dynamo, Arctic Power, ABC, Cold Power and Fresh Start, as well as the license of the Ajax brand for laundry detergents in the US, Canada and Puerto Rico, to Phoenix Brands, LLC as part of its plan to focus on its higher margin oral, personal, and pet care products.\nIn 2006, Colgate-Palmolive announced the intended acquisition of Tom's of Maine, a leading maker of natural toothpaste, for US$100 million. Tom's of Maine was founded by Tom Chappell in 1970.\nIn 2020, Colgate-Palmolive acquired Hello Products LLC, one of the fastest-growing premium oral care brands in the United States, for an undisclosed amount.\nToday, Colgate has numerous subsidiary organizations spanning 200 countries, but it is publicly listed in three: the United States, India, and Pakistan.\nOn October 25, 2012, the company announced it would cut 2,310 workers, or 6% of its workforce, by the end of 2016 in a push to make the consumer products company more efficient. The company ranked 184th on the 2018 Fortune 500 list of the largest United States corporations by revenue. In 2021, the company ranked 15th on the list of Most Trusted Brands by Morning Consult.\n\nEducational and community involvement\nIn 1890, Madison University in New York State was renamed Colgate University in honor of the Colgate family following decades of financial support and involvement.\nThe Colgate-Palmolive Company has sponsored a non-profit track meet open to women of all ages called the Colgate Women's Games. The Colgate Women's Games is the nation's largest amateur track series open to all girls from elementary school through college. Held at Brooklyn's Pratt Institute, competitors participate in preliminary meets and semi-finals over five weekends throughout January. Finalists compete for trophies and educational grants-in-aid from Colgate-Palmolive Company at New York City's Madison Square Garden in February. For more than 20 years, the company supports the Starlight Children Foundation which is a non profit organization dedicated to help seriously ill children and their families. The mission is to help children to cope with pain, fear and isolation through entertainment, family activities and education.\nThe Colgate website has resources for children including educational tooth brushing songs and animated videos featuring their former animated mascot Dr. Rabbit.\n\nEthics\nIn 2011, Colgate-Palmolive was one of the first companies recognized by PETA (People for the Ethical Treatment of Animals) under the new \"working for regulatory change\" category for companies that test on animals only when mandated by government regulations and are actively seeking alternatives to animal testing. This relates to the corporation's decision to continue to participate in the profitable Chinese market, where some animal testing is still a regulatory requirement.  Other companies have chosen to decline entry to this market.\nIn 2006, Colgate-Palmolive acquired an 84% stake in Tom's of Maine. In 2011, the company chose to retain the use of the antibacterial agent triclosan in its market-leading Total toothpaste range, despite withdrawing it from several other product ranges, following concerns about triclosan's impact on health and the environment.\nAs of January 2024, Ethical Consumer website states that \"Our research highlights several ethical issues with Colgate-Palmolive, including its approach to palm oil, supply chain management, climate change, excessive pay, tax, human rights, and animal testing. It scored our worst rating across all of these categories.\"\n\nEnvironmental record\nColgate-Palmolive received the 2012 Safe-in-Sound Excellence in Hearing Loss Prevention Award.\nAs a successor to the Mennen Company, Colgate-Palmolive was reported in 2017 as one of about 300 companies held potentially responsible for hazardous waste at the Chemsol federal Superfund site in Piscataway, New Jersey.  Their involvement in this site may have contributed to the contamination of an estimated 18,500 cubic yards (14,100 m3) of soil with volatile organic compounds (VOCs), PCBs, and lead off-site. A proposed $23 million agreement with the government and state of New Jersey would require Colgate-Palmolive and the other involved companies to pay for the cleanup of this hazardous waste that is contaminating the soil as well as the groundwater.\nIn 2019, BreakFreeFromPlastic cited Colgate-Palmolive as one of the world's top ten plastic polluters. Previously, Colgate-Palmolive had committed to 100% recyclability of plastics in packaging across all its product categories by 2025 but made no commitment to reducing the use of virgin plastic in packaging.\nA 2021 report by Global Witness, updated in 2022, stated that Colgate-Palmolive had used palm oil suppliers connected to bribery, brutalisation of villagers and child labour in Papua New Guinea.\nIn 2021, the Rainforest Action Network (RAN) gave Colgate-Palmolive a score of \"F\" on their \"scorecard\" keeping track of deforestation and human rights abuses. In August 2021, Colgate-Palmolive publicly disclosed the \"forest impact of its palm oil supply chain in the Indonesian province of North Sumatra\", showing the impact on the rainforests and the indigenous people who live there. In November 2023, Colgate-Palmolive received a \"D-\" on their RAN scorecard.\nIn relation to climate change, in June 2023, Planet Tracker stated that Colgate-Palmolive \"is on a path to missing its approved Science-based Targets emissions by a factor of 7 when optional indirect use emissions are excluded\", it \"provides 'no clear strategy' to mitigate its main source of emissions, namely, upstream Scope 3 activities\" and its \"climate engagement with its value chain has not resulted in positive results over the last half-decade, with the GhG emissions from key 'targeted' areas experiencing substantial growth.\" Sustainability Beat stated in August 2023 that this puts their profits in jeopardy and risks greenwashing.\nIn 2024, the website Ethical Consumer gave Colgate-Palmolive the worst possible rating for climate change, plastic use, and palm oil/deforestation. It received their best rating for avoiding toxic chemicals in its products.\n\nCorporate governance\nAs of August 2023, members of the board of directors of Colgate-Palmolive are the following:\n\nNoel Wallace\nJohn P. Bilbrey\nLisa M. Edwards\nC. Martin Harris\nMartina Hund-Mejean\nKimberly A. Nelson\nLorrie M. Norrington\nSteve Cahillane\nJohn T. Cahill\nStephen Sadove\n\nEmployment diversity\nColgate-Palmolive was named one of the \"100 Best Companies for Working Mothers\" by Working Mother magazine. The 2012 Human Rights Campaign \"report card\" on American businesses gave Colgate an A for its support of diversity in the workplace.\nHowever, Ethical Consumer states that the company \"published no standards for working hours and wages and no information about the outcomes of supply chain audits. There was no clear mechanism workers could use to make anonymous complaints and raise issues\", and scores badly in their human rights category.\n\nResponse to Russian Invasion of Ukraine\nFollowing Russia's invasion of Ukraine in 2022, Colgate-Palmolive announced a suspension of imports and sales in Russia, limiting operations to essential health and hygiene products. The company also halted all capital investments, media, advertising, and promotional activities within the country. As of December 2024, Colgate-Palmolive's current operational status in Russia remains unspecified.\n\nBrands\nColgate now markets a broadly diversified mix of products in the United States and other countries. Major product areas include household and personal care products, food products, health care and industrial supplies, and sports and leisure time equipment.\n\nDiscontinued products and former brands\nAjax Laundry Detergent (Ajax Cleanser still made by CP) \nAd (detergent) \nBambeanos\nBrisk (fluoride toothpaste) \nBurst (detergent)\nCue (fluoride toothpaste) \nCashmere Bouquet (soap) \nCherish (cinnamon flavored toothpaste)\n\nCold Power (detergent)* (known in Canada as Arctic Power, Australian and New Zealand rights sold to Henkel in May 2015)\nColeo (soap) \nColgate Tooth Powder**  and Colgate Chlorophyll Tooth Powder \nColgate Toothpaste with Chlorophyll** \nDynamo laundry detergent (liquid detergent-no longer made by CP in the U.S.) \nFab Detergent (no longer made by CP in the U.S.)\nFab One Shot (detergent)\nFlorient (room deodorizer)\nHalo Shampoo \nKolynos (toothpaste)**\nLustre-Creme Shampoo \nOctagon (soap) \nPalmolive Rapid Shave \nColgate's Peter Pan Beauty Bar with Chlorophyll \nSoaky (bubble bath for kids) \nSuper Suds (detergent) \nSwerl (liquid cleanser) \nVel (dishwashing detergent) \nNotes:\n* While detergent brands continue to be manufactured and sold by Colgate in some countries, in the United States they have been sold to another company, Phoenix Brands in 2005. Phoenix Brands filed for bankruptcy in May 2016 and the US rights have been assumed by Fab & Kind Company.\nIn May 2015, Colgate-Palmolive sold its Australian laundry detergents and pre-wash brands to Henkel for US$245 million (€220 million). Colgate-Palmolive has divested its laundry detergents business in Colombia, which was in turn acquired by Unilever and some Asian countries, which was acquired by Procter & Gamble.\n** Still being made by Colgate-Palmolive internationally, but no longer available in the U.S.\n\nFacilities\nIn the U.S., the company operates approximately 60 properties, of which 14 are owned. Major U.S. manufacturing and warehousing facilities used by the oral, personal and home care segment of Colgate-Palmolive were located in Morristown, New Jersey (previously the headquarters of the Mennen company prior to their 1991 buyout, and still HQ of the Mennen division) until 2014, when the plant shut down and moved operations to Hodges, South Carolina ; Morristown, Tennessee; and Cambridge, Ohio. The pet nutrition segment has major facilities in Bowling Green, Kentucky; Emporia, Kansas; Topeka, Kansas; and Richmond, Indiana. The primary research center for oral, personal and home care products is located in Piscataway, New Jersey and the primary research center for pet nutrition products is located in Topeka, Kansas.\nOverseas, the company operates approximately 280 properties of which 80 are owned in over 70 countries. Major overseas facilities used by the oral, personal and home care segment are located in Australia, Brazil, China, Colombia, France, Guatemala, India, Italy, Malaysia, Mexico, Pakistan, Poland, South Africa, Thailand, Venezuela, Vietnam and elsewhere throughout the world.\nColgate-Palmolive has closed or is in the process of phasing out production at certain facilities under a restructuring program initiated in 2004 and has built new state-of-the-art plants to produce toothpaste in the U.S., Mexico and Poland.\nColgate-Palmolive's chief manufacturing plant is located in Burlington Township, New Jersey, producing all of the fragrance and flavor oils for the company's facilities around the world.\n\nAdvertising\nThe iconic hand on the Palmolive dishwashing soap label belongs to hand model Elizabeth Barbour. The image is an illustration of a photograph taken in 1985 when the Colgate-Palmolive Company updated the image, hiring Barbour, then with the Ford Agency in New York City.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Colgate-Palmolive Company: \nColgate-Palmolive company history at FundingUniverse",
  "clean_text": "The Colgate-Palmolive Company, commonly known as Colgate-Palmolive, is an American multinational consumer products company headquartered on Park Avenue in Midtown Manhattan, New York City. The company specializes in the production, distribution, and provision of household, health care, personal care, and veterinary products. History and founding William Colgate, an English immigrant to the United States and devout Baptist, established a starch, soap, and candle factory on Dutch Street in New York City under the name William Colgate & Company in 1806. In 1833, he suffered a severe heart attack, stopping his business's sales; after a convalescence he continued with his business. In the 1840s, the company began selling individual cakes of soap in uniform weights. In 1857, Colgate died and the company was reorganized as Colgate & Company under the management of his similarly devout Baptist son Samuel Colgate, who did not want to continue the business but thought it would be the right thing to do. In 1872, he introduced Cashmere Bouquet, a perfumed soap. In 1873, the company introduced its first Colgate toothpaste, an aromatic toothpaste sold in jars. In 1896, the company sold the first toothpaste in a tube, named Colgate Ribbon Dental Cream (invented by dentist Washington Sheffield). Also in 1896, Colgate hired Martin Ittner and under his direction founded one of the first applied research labs. By 1908, they initiated mass sales of toothpaste in tubes. Another of William Colgate's sons, James Boorman Colgate, was a primary trustee of Colgate University (formerly Madison University). In Milwaukee, Wisconsin, the B. J. Johnson Company was making a soap from palm oil and olive oil, the formula of which was developed by Burdett J. Johnson in 1898. The soap was popular enough to rename their company after it in 1917—Palmolive. Around the start of the 20th century, Palmolive was the world's best-selling soap. In June 1928, rumors started that \"officials of the Palmolive-Peet Co. are negotiating to purchase the Colgate Co.\" privately held by the Colgate family. Peet Brothers Soap Company of Kansas City merged into Palmolive two years before the merger with Colgate. The merger combined the three oldest and largest soap and perfumery companies in the US and was effective July 1, 1928. The combined company was named the \"Colgate Palmolive Peet Company\". The combined pre-merger sales in 1927 of the three companies exceeded $100,000,000 (equivalent to $1,831,201,550 in 2024). The newly combined company had seven US manufacturing facilities as well as factories in 14 foreign countries. In 1953, the companies became a joint venture, known as the Colgate-Palmolive Company. Competition with P&G Colgate-Palmolive has long been in competition with Procter & Gamble (P&G), the world's largest soap and detergent maker and the maker of Crest toothpaste. P&G introduced its Tide laundry detergent shortly after World War II, and thousands of consumers turned from Colgate's soaps to the new product. Colgate lost its number one place in the toothpaste market when P&G added fluoride to its toothpaste Crest & Gleem (The Gleem brand was discontinued by P&G in 2014). Colgate has since re-claimed the #1 sales position. In the beginning of the TV era, Colgate-Palmolive wished to compete with P&G as a sponsor of soap operas and sponsored only two soap operas, The Doctors on NBC & ABC's One Life To Live from the shows debut in July 1968 until ABC bought One Life To Live from its creator Agnes Nixon in December 1974. They tried to keep the sponsorship of One Life To Live and gain sponsorship of Nixon's newest soap opera All My Children which ABC begin airing on January 5th of 1970 but ABC wouldn't allow it. However, The Doctors was sponsored by Colgate-Palmolive for its entire run from April 1963 until its cancellation in December 1982. After The Doctors cancellation, Colgate-Palmolive never sponsored another show. P&G continued sponsoring several soap operas on all three networks until its last show As the World Turns was canceled in September 2010. George Henry Lesch, president, CEO, and chairman of the board of Colgate-Palmolive in the 1960s and 1970s, transformed the firm into a modern company with major restructuring. Recent years In 2005, Colgate sold the under-performing brands Fab, Dynamo, Arctic Power, ABC, Cold Power and Fresh Start, as well as the license of the Ajax brand for laundry detergents in the US, Canada and Puerto Rico, to Phoenix Brands, LLC as part of its plan to focus on its higher margin oral, personal, and pet care products. In 2006, Colgate-Palmolive announced the intended acquisition of Tom's of Maine, a leading maker of natural toothpaste, for US$100 million. Tom's of Maine was founded by Tom Chappell in 1970. In 2020, Colgate-Palmolive acquired Hello Products LLC, one of the fastest-growing premium oral care brands in the United States, for an undisclosed amount. Today, Colgate has numerous subsidiary organizations spanning 200 countries, but it is publicly listed in three: the United States, India, and Pakistan. On October 25, 2012, the company announced it would cut 2,310 workers, or 6% of its workforce, by the end of 2016 in a push to make the consumer products company more efficient. The company ranked 184th on the 2018 Fortune 500 list of the largest United States corporations by revenue. In 2021, the company ranked 15th on the list of Most Trusted Brands by Morning Consult. Educational and community involvement In 1890, Madison University in New York State was renamed Colgate University in honor of the Colgate family following decades of financial support and involvement. The Colgate-Palmolive Company has sponsored a non-profit track meet open to women of all ages called the Colgate Women's Games. The Colgate Women's Games is the nation's largest amateur track series open to all girls from elementary school through college. Held at Brooklyn's Pratt Institute, competitors participate in preliminary meets and semi-finals over five weekends throughout January. Finalists compete for trophies and educational grants-in-aid from Colgate-Palmolive Company at New York City's Madison Square Garden in February. For more than 20 years, the company supports the Starlight Children Foundation which is a non profit organization dedicated to help seriously ill children and their families. The mission is to help children to cope with pain, fear and isolation through entertainment, family activities and education. The Colgate website has resources for children including educational tooth brushing songs and animated videos featuring their former animated mascot Dr. Rabbit. Ethics In 2011, Colgate-Palmolive was one of the first companies recognized by PETA (People for the Ethical Treatment of Animals) under the new \"working for regulatory change\" category for companies that test on animals only when mandated by government regulations and are actively seeking alternatives to animal testing. This relates to the corporation's decision to continue to participate in the profitable Chinese market, where some animal testing is still a regulatory requirement. Other companies have chosen to decline entry to this market. In 2006, Colgate-Palmolive acquired an 84% stake in Tom's of Maine. In 2011, the company chose to retain the use of the antibacterial agent triclosan in its market-leading Total toothpaste range, despite withdrawing it from several other product ranges, following concerns about triclosan's impact on health and the environment. As of January 2024, Ethical Consumer website states that \"Our research highlights several ethical issues with Colgate-Palmolive, including its approach to palm oil, supply chain management, climate change, excessive pay, tax, human rights, and animal testing. It scored our worst rating across all of these categories.\" Environmental record Colgate-Palmolive received the 2012 Safe-in-Sound Excellence in Hearing Loss Prevention Award. As a successor to the Mennen Company, Colgate-Palmolive was reported in 2017 as one of about 300 companies held potentially responsible for hazardous waste at the Chemsol federal Superfund site in Piscataway, New Jersey. Their involvement in this site may have contributed to the contamination of an estimated 18,500 cubic yards (14,100 m3) of soil with volatile organic compounds (VOCs), PCBs, and lead off-site. A proposed $23 million agreement with the government and state of New Jersey would require Colgate-Palmolive and the other involved companies to pay for the cleanup of this hazardous waste that is contaminating the soil as well as the groundwater. In 2019, BreakFreeFromPlastic cited Colgate-Palmolive as one of the world's top ten plastic polluters. Previously, Colgate-Palmolive had committed to 100% recyclability of plastics in packaging across all its product categories by 2025 but made no commitment to reducing the use of virgin plastic in packaging. A 2021 report by Global Witness, updated in 2022, stated that Colgate-Palmolive had used palm oil suppliers connected to bribery, brutalisation of villagers and child labour in Papua New Guinea. In 2021, the Rainforest Action Network (RAN) gave Colgate-Palmolive a score of \"F\" on their \"scorecard\" keeping track of deforestation and human rights abuses. In August 2021, Colgate-Palmolive publicly disclosed the \"forest impact of its palm oil supply chain in the Indonesian province of North Sumatra\", showing the impact on the rainforests and the indigenous people who live there. In November 2023, Colgate-Palmolive received a \"D-\" on their RAN scorecard. In relation to climate change, in June 2023, Planet Tracker stated that Colgate-Palmolive \"is on a path to missing its approved Science-based Targets emissions by a factor of 7 when optional indirect use emissions are excluded\", it \"provides 'no clear strategy' to mitigate its main source of emissions, namely, upstream Scope 3 activities\" and its \"climate engagement with its value chain has not resulted in positive results over the last half-decade, with the GhG emissions from key 'targeted' areas experiencing substantial growth.\" Sustainability Beat stated in August 2023 that this puts their profits in jeopardy and risks greenwashing. In 2024, the website Ethical Consumer gave Colgate-Palmolive the worst possible rating for climate change, plastic use, and palm oil/deforestation. It received their best rating for avoiding toxic chemicals in its products. Corporate governance As of August 2023, members of the board of directors of Colgate-Palmolive are the following: Noel Wallace John P. Bilbrey Lisa M. Edwards C. Martin Harris Martina Hund-Mejean Kimberly A. Nelson Lorrie M. Norrington Steve Cahillane John T. Cahill Stephen Sadove Employment diversity Colgate-Palmolive was named one of the \"100 Best Companies for Working Mothers\" by Working Mother magazine. The 2012 Human Rights Campaign \"report card\" on American businesses gave Colgate an A for its support of diversity in the workplace. However, Ethical Consumer states that the company \"published no standards for working hours and wages and no information about the outcomes of supply chain audits. There was no clear mechanism workers could use to make anonymous complaints and raise issues\", and scores badly in their human rights category. Response to Russian Invasion of Ukraine Following Russia's invasion of Ukraine in 2022, Colgate-Palmolive announced a suspension of imports and sales in Russia, limiting operations to essential health and hygiene products. The company also halted all capital investments, media, advertising, and promotional activities within the country. As of December 2024, Colgate-Palmolive's current operational status in Russia remains unspecified. Brands Colgate now markets a broadly diversified mix of products in the United States and other countries. Major product areas include household and personal care products, food products, health care and industrial supplies, and sports and leisure time equipment. Discontinued products and former brands Ajax Laundry Detergent (Ajax Cleanser still made by CP) Ad (detergent) Bambeanos Brisk (fluoride toothpaste) Burst (detergent) Cue (fluoride toothpaste) Cashmere Bouquet (soap) Cherish (cinnamon flavored toothpaste) Cold Power (detergent)* (known in Canada as Arctic Power, Australian and New Zealand rights sold to Henkel in May 2015) Coleo (soap) Colgate Tooth Powder** and Colgate Chlorophyll Tooth Powder Colgate Toothpaste with Chlorophyll** Dynamo laundry detergent (liquid detergent-no longer made by CP in the U.S.) Fab Detergent (no longer made by CP in the U.S.) Fab One Shot (detergent) Florient (room deodorizer) Halo Shampoo Kolynos (toothpaste)** Lustre-Creme Shampoo Octagon (soap) Palmolive Rapid Shave Colgate's Peter Pan Beauty Bar with Chlorophyll Soaky (bubble bath for kids) Super Suds (detergent) Swerl (liquid cleanser) Vel (dishwashing detergent) Notes: * While detergent brands continue to be manufactured and sold by Colgate in some countries, in the United States they have been sold to another company, Phoenix Brands in 2005. Phoenix Brands filed for bankruptcy in May 2016 and the US rights have been assumed by Fab & Kind Company. In May 2015, Colgate-Palmolive sold its Australian laundry detergents and pre-wash brands to Henkel for US$245 million (€220 million). Colgate-Palmolive has divested its laundry detergents business in Colombia, which was in turn acquired by Unilever and some Asian countries, which was acquired by Procter & Gamble. ** Still being made by Colgate-Palmolive internationally, but no longer available in the U.S. Facilities In the U.S., the company operates approximately 60 properties, of which 14 are owned. Major U.S. manufacturing and warehousing facilities used by the oral, personal and home care segment of Colgate-Palmolive were located in Morristown, New Jersey (previously the headquarters of the Mennen company prior to their 1991 buyout, and still HQ of the Mennen division) until 2014, when the plant shut down and moved operations to Hodges, South Carolina ; Morristown, Tennessee; and Cambridge, Ohio. The pet nutrition segment has major facilities in Bowling Green, Kentucky; Emporia, Kansas; Topeka, Kansas; and Richmond, Indiana. The primary research center for oral, personal and home care products is located in Piscataway, New Jersey and the primary research center for pet nutrition products is located in Topeka, Kansas. Overseas, the company operates approximately 280 properties of which 80 are owned in over 70 countries. Major overseas facilities used by the oral, personal and home care segment are located in Australia, Brazil, China, Colombia, France, Guatemala, India, Italy, Malaysia, Mexico, Pakistan, Poland, South Africa, Thailand, Venezuela, Vietnam and elsewhere throughout the world. Colgate-Palmolive has closed or is in the process of phasing out production at certain facilities under a restructuring program initiated in 2004 and has built new state-of-the-art plants to produce toothpaste in the U.S., Mexico and Poland. Colgate-Palmolive's chief manufacturing plant is located in Burlington Township, New Jersey, producing all of the fragrance and flavor oils for the company's facilities around the world. Advertising The iconic hand on the Palmolive dishwashing soap label belongs to hand model Elizabeth Barbour. The image is an illustration of a photograph taken in 1985 when the Colgate-Palmolive Company updated the image, hiring Barbour, then with the Ford Agency in New York City."
}