{
  "ticker": "CLX",
  "cik": "0000021076",
  "company_name": "Clorox",
  "corrected_name": "Clorox",
  "wiki_title_used": "Clorox",
  "exists": true,
  "raw_text": "The Clorox Company (formerly Clorox Chemical Company) is an American multinational manufacturer and marketer of consumer and professional products. As of 2024, the Oakland, California-based company had approximately 8,000 employees worldwide. Net sales for the 2024 fiscal year were US$7.1 billion. Ranked annually since 2000, Clorox was named number 474 on Fortune magazine's 2020 Fortune 500 list.\nClorox products are sold primarily through mass merchandisers, retail outlets, e-commerce channels, distributors, and medical supply providers. Clorox brands include its namesake bleach and cleaning products as well as Burt's Bees, Formula 409, Glad, Hidden Valley, Kingsford, Kitchen Bouquet, KC Masterpiece, Liquid-Plumr, Brita (in the Americas), Mistolin, Pine-Sol, Poett, Green Works Cleaning Products, Soy Vay, Tilex, S.O.S., and Fresh Step, Scoop Away, and Ever Clean pet products.\n\nHistory\n1913–1927\nThe Electro-Alkaline Company was founded on May 3, 1913, as the first commercial-scale liquid bleach manufacturer in the United States. Archibald Taft, a banker; Edward Hughes, a purveyor of wood and coal; Charles Husband, a bookkeeper; Rufus Myers, a lawyer; and William Hussey, a miner, each invested $100 to set up a factory \non the east side of San Francisco Bay. The name of its original product, Clorox, was coined as a portmanteau of its two main ingredients, chlorine and sodium hydroxide. The original Clorox packaging featured a diamond-shaped logo, which has been used in one form or another in Clorox branding ever since.\n\nThe public, however, was unfamiliar with liquid bleach. The company started slowly and was about to collapse when investor William Murray took it over in 1916, who installed himself as general manager. His wife Annie prompted the creation of a less concentrated liquid bleach for home use and built customer demand by giving away 15-US-fluid-ounce (440 ml) sample bottles at the family's grocery store in downtown Oakland. Word shortly began to spread, and in 1917 the company started shipping Clorox bleach to the East Coast via the Panama Canal.\n\n1928–1960s\nOn May 28, 1928, the company went public on the San Francisco stock exchange. It changed its name to Clorox Chemical Company. Butch, an animated Clorox liquid bleach bottle, was used in its advertising and became well known, even surviving the 1941 transition from rubber-stoppered bottles to screw-off caps.\nClorox was strong enough to survive the Great Depression during the 1930s, achieving national distribution of its bleach.\nEven though bleach was a valuable first aid product for American armed forces during World War II, government rationing of chlorine gas forced many bleach manufacturers to reduce the concentration of sodium hypochlorite in their products. Clorox, however, declined and elected to sell fewer units of full-strength bleach, establishing a reputation for quality.\nIn 1957, Clorox was purchased by Procter & Gamble, which renamed its new subsidiary the Clorox Company. Almost immediately, a rival company objected to the purchase, and it was challenged by the Federal Trade Commission, which feared it would stifle competition in the household products market. The FTC prevailed in 1967 when the U.S. Supreme Court forced Procter & Gamble to divest Clorox, which took place on January 1, 1969.\n\n1970s–1990s\nThroughout the 1970s and 1980s, Clorox pursued an aggressive expansion and diversification program. In 1970 it introduced Clorox 2 all-fabric bleach. Later it acquired several brands that remain a part of its portfolio, including Formula 409, Liquid-Plumr, and Kingsford charcoal. The company also developed new cleaning products such as Tilex instant mildew remover. It also acquired the \"Hidden Valley\" brand of ranch dressing.\nIn 1988, Clorox struck a licensing-and-distribution agreement that brought Brita water filters to the U.S. The company acquired sole control of the brand for the U.S. and Canada in 1995 when it acquired Brita International Holdings (Canada). In 2000 it secured the remaining Americas market from Brita.\nIn 1990, Clorox purchased Pine-Sol.\nIn 1999, Clorox acquired First Brands, the former consumer products division of Union Carbide, in the largest transaction in its history. Such brands as Glad, Handi-Wipes (which First Brands acquired from Colgate-Palmolive several months before the Clorox acquisition), and STP became part of the Clorox portfolio. The First Brands acquisition doubled the company's size and helped it land on the Fortune 500 for the first time the following year.\n\n2000s–present\nIn 2002, Clorox entered into a joint venture with Procter & Gamble to create food and trash bags, food wraps, and containers under the names Glad, GladWare, and related trademarks. As part of this agreement, Clorox sold a 10% stake in the Glad products to P&G, which increased to 20% in 2005.\nIn 2007, the company acquired Burt's Bees. In 2010, Clorox shed businesses that were no longer a good strategic fit for the company, announcing that it was selling the Armor All and STP brands to Avista Capital Partners. In 2011, Clorox acquired the Aplicare and HealthLink brands, bolstering its presence in the healthcare industry.\nIn 2008, the Clorox Company became the first major consumer packaged goods company to develop and nationally launch a green cleaning line, Green Works, into the mainstream cleaning aisle. In 2011, the Clorox Company integrated corporate social responsibility (CSR) reporting with financial reporting. The company's annual report for the fiscal year ending in June 2011 shared data on financial performance and advances in environmental, social, and governance performance.\nIn 2013, the company announced a focus on consumer megatrends that included sustainability, health and wellness, affordability and value, and multiculturalism, with a particular emphasis on the Hispanic community.\nIn 2015, the company became a signatory of the United Nations Global Compact, a large corporate responsibility initiative.\nIn 2018, Clorox purchased Nutranext Business, LLC for approximately $700 million. Florida-based Nutranext makes natural multivitamins, specialty minerals used as health aids, and supplements for hair, skin and nails. Operating income in 2018 was US$1.1 billion. The company had approximately 8,700 employees worldwide as of 2018, yearly revenue for the period ending June 30, 2018, equaled $6.1 billion. Yearly revenue equaled $6.2 billion in 2019.\nClorox was named to the inaugural Bloomberg Gender Equality Index in 2018. The following year, it topped the Axios Harris Poll 100 corporate reputation rankings. In 2019, Clorox ranked seventh in Barron's \"100 Most Sustainable U.S. Companies\" list.\nIn 2022, the company opened a new manufacturing facility in Martinsburg, West Virginia, to facilitate the growth of its cat litter business.\nIn 2023 the company was affected by a cyberattack, resulting in revenue loss and product shortages.\n\nBrands\nThe Clorox Company currently owns a number of well-known household and professional brands in a wide variety of products, including:\n\nBrita water filtration systems (Americas only)\nBurt's Bees natural cosmetics and personal care products\nClorinda bleach and cleaning and disinfection products, alternative brand of Clorox Chile\nFormula 409 hard surface cleaners\nFresh Step, Scoop Away, and Ever Clean cat litters\nGlad storage bags, trash bags, Press'n Seal, GladWare containers (joint venture with P&G as 20-percent minority shareholder)\nGreen Works natural cleaners\nHandy Andy floor cleaners in Australia\nHidden Valley dressings, sandwich spreads and condiments, dips and dressing mixes, croutons and salad toppings, side dishes and appetizers\nKingsford charcoal\nKitchen Bouquet, KC Masterpiece, and Soy Vay sauces\nLestoil heavy-duty laundry and multipurpose cleaner\nLiquid-Plumr drain cleaner\nPine-Sol, Tilex, Poett, and S.O.S cleaning products\nThe company's bleach products are sold under regional brands. In 2006, Clorox acquired the Canadian Javex line of bleach products from Colgate-Palmolive, and similar product lines in parts of Latin and South America.\n\nSales\nThe company ranked No. 453 on the Fortune 500 list in 2017; by 2020, Clorox ranked No. 474 on the list.\nClorox's net sales (2015–2020)\n\nMarketing\nAdvertising campaigns\nIn 1986, the advertising campaign for Clorox 2 featured an award-winning jingle, \"Mama's Got The Magic of Clorox 2\". The song was written by Dan Williams and performed by Dobie Gray.\nThe company was listed at Advertising Age's 2015 Marketer A-List.\n\nAllegations of sexist marketing\nDuring 2006 and 2007, a Clorox commercial that aired nationally showed several generations of women doing laundry. The commercial included the words \"Your mother, your grandmother, her mother, they all did the laundry, maybe even a man or two\". Feminists criticized the commercial for insinuating that doing laundry is a job for women only.\nThe Clorox slogan, \"Mama's got the magic of Clorox\", was criticized on similar grounds. The slogan first appeared in a Clorox commercial in 1986. A modified version of the commercial ran from 2002 to 2004.\nIn 2009, Clorox received complaints of sexism for an advertisement that featured a man's white, lipstick-stained dress shirt with the caption, \"Clorox. Getting ad guys out of hot water for generations\". The ad, and others, were produced expressly for the television program Mad Men, capitalizing on \"the show's unique vintage style to [create] a link between classic and modern consumer behaviors\".\n\nReactions to product claims\nGreen Works\nIn 2008, the Sierra Club endorsed the Clorox Green Works line. Sierra Club Executive Director Carl Pope stated that one of the nonprofit organization's primary goals is to \"foster vibrant, healthy communities with clean water and air that are free from pollution. Products like Green Works help to achieve this goal in the home\". The Sierra Club also partnered with Clorox to \"promote a line of natural cleaning products for consumers who are moving toward a greener lifestyle\". The partnership \"caused schisms\" in the club, which contributed in part to Pope's decision to resign.\nAlso in 2008, the National Advertising Division told Clorox to either discontinue or modify its advertisements for Green Works on the grounds the cleaners actually do not work as well as traditional cleaners, as Clorox had claimed.\nIn 2009, Clorox received further criticism for its Clorox Green Works line, regarding claims the products are environmentally friendly. Several Clorox Green Works products contain ethanol, which environmental groups state is neither cost-effective nor eco-friendly. Many Green Works products also contain sodium lauryl sulfate, a known skin irritant. Women's Voices for the Earth have questioned whether or not the Clorox Green Works line is greenwashing, as Clorox's \"green\" products are far outnumbered by their traditional products, asking \"Why sell one set of products that have hazardous ingredients and others that don't?\"\n\nAnimal testing\nIn 2019, Clorox announced that they do not participate in animal testing except where required by law.  This prompted backlash from animal advocacy organizations like PETA, who claimed that Clorox was perpetuating animal testing by choosing to sell their products in markets where inhumane animal testing was required, such as China.\n\nSee also\nList of companies based in Oakland, California\n\nReferences\nExternal links\n\nTheCloroxCompany.com: corporate website\nClorox.com: consumer products website\nBusiness data for The Clorox Company:",
  "clean_text": "The Clorox Company (formerly Clorox Chemical Company) is an American multinational manufacturer and marketer of consumer and professional products. As of 2024, the Oakland, California-based company had approximately 8,000 employees worldwide. Net sales for the 2024 fiscal year were US$7.1 billion. Ranked annually since 2000, Clorox was named number 474 on Fortune magazine's 2020 Fortune 500 list. Clorox products are sold primarily through mass merchandisers, retail outlets, e-commerce channels, distributors, and medical supply providers. Clorox brands include its namesake bleach and cleaning products as well as Burt's Bees, Formula 409, Glad, Hidden Valley, Kingsford, Kitchen Bouquet, KC Masterpiece, Liquid-Plumr, Brita (in the Americas), Mistolin, Pine-Sol, Poett, Green Works Cleaning Products, Soy Vay, Tilex, S.O.S., and Fresh Step, Scoop Away, and Ever Clean pet products. History 1913–1927 The Electro-Alkaline Company was founded on May 3, 1913, as the first commercial-scale liquid bleach manufacturer in the United States. Archibald Taft, a banker; Edward Hughes, a purveyor of wood and coal; Charles Husband, a bookkeeper; Rufus Myers, a lawyer; and William Hussey, a miner, each invested $100 to set up a factory on the east side of San Francisco Bay. The name of its original product, Clorox, was coined as a portmanteau of its two main ingredients, chlorine and sodium hydroxide. The original Clorox packaging featured a diamond-shaped logo, which has been used in one form or another in Clorox branding ever since. The public, however, was unfamiliar with liquid bleach. The company started slowly and was about to collapse when investor William Murray took it over in 1916, who installed himself as general manager. His wife Annie prompted the creation of a less concentrated liquid bleach for home use and built customer demand by giving away 15-US-fluid-ounce (440 ml) sample bottles at the family's grocery store in downtown Oakland. Word shortly began to spread, and in 1917 the company started shipping Clorox bleach to the East Coast via the Panama Canal. 1928–1960s On May 28, 1928, the company went public on the San Francisco stock exchange. It changed its name to Clorox Chemical Company. Butch, an animated Clorox liquid bleach bottle, was used in its advertising and became well known, even surviving the 1941 transition from rubber-stoppered bottles to screw-off caps. Clorox was strong enough to survive the Great Depression during the 1930s, achieving national distribution of its bleach. Even though bleach was a valuable first aid product for American armed forces during World War II, government rationing of chlorine gas forced many bleach manufacturers to reduce the concentration of sodium hypochlorite in their products. Clorox, however, declined and elected to sell fewer units of full-strength bleach, establishing a reputation for quality. In 1957, Clorox was purchased by Procter & Gamble, which renamed its new subsidiary the Clorox Company. Almost immediately, a rival company objected to the purchase, and it was challenged by the Federal Trade Commission, which feared it would stifle competition in the household products market. The FTC prevailed in 1967 when the U.S. Supreme Court forced Procter & Gamble to divest Clorox, which took place on January 1, 1969. 1970s–1990s Throughout the 1970s and 1980s, Clorox pursued an aggressive expansion and diversification program. In 1970 it introduced Clorox 2 all-fabric bleach. Later it acquired several brands that remain a part of its portfolio, including Formula 409, Liquid-Plumr, and Kingsford charcoal. The company also developed new cleaning products such as Tilex instant mildew remover. It also acquired the \"Hidden Valley\" brand of ranch dressing. In 1988, Clorox struck a licensing-and-distribution agreement that brought Brita water filters to the U.S. The company acquired sole control of the brand for the U.S. and Canada in 1995 when it acquired Brita International Holdings (Canada). In 2000 it secured the remaining Americas market from Brita. In 1990, Clorox purchased Pine-Sol. In 1999, Clorox acquired First Brands, the former consumer products division of Union Carbide, in the largest transaction in its history. Such brands as Glad, Handi-Wipes (which First Brands acquired from Colgate-Palmolive several months before the Clorox acquisition), and STP became part of the Clorox portfolio. The First Brands acquisition doubled the company's size and helped it land on the Fortune 500 for the first time the following year. 2000s–present In 2002, Clorox entered into a joint venture with Procter & Gamble to create food and trash bags, food wraps, and containers under the names Glad, GladWare, and related trademarks. As part of this agreement, Clorox sold a 10% stake in the Glad products to P&G, which increased to 20% in 2005. In 2007, the company acquired Burt's Bees. In 2010, Clorox shed businesses that were no longer a good strategic fit for the company, announcing that it was selling the Armor All and STP brands to Avista Capital Partners. In 2011, Clorox acquired the Aplicare and HealthLink brands, bolstering its presence in the healthcare industry. In 2008, the Clorox Company became the first major consumer packaged goods company to develop and nationally launch a green cleaning line, Green Works, into the mainstream cleaning aisle. In 2011, the Clorox Company integrated corporate social responsibility (CSR) reporting with financial reporting. The company's annual report for the fiscal year ending in June 2011 shared data on financial performance and advances in environmental, social, and governance performance. In 2013, the company announced a focus on consumer megatrends that included sustainability, health and wellness, affordability and value, and multiculturalism, with a particular emphasis on the Hispanic community. In 2015, the company became a signatory of the United Nations Global Compact, a large corporate responsibility initiative. In 2018, Clorox purchased Nutranext Business, LLC for approximately $700 million. Florida-based Nutranext makes natural multivitamins, specialty minerals used as health aids, and supplements for hair, skin and nails. Operating income in 2018 was US$1.1 billion. The company had approximately 8,700 employees worldwide as of 2018, yearly revenue for the period ending June 30, 2018, equaled $6.1 billion. Yearly revenue equaled $6.2 billion in 2019. Clorox was named to the inaugural Bloomberg Gender Equality Index in 2018. The following year, it topped the Axios Harris Poll 100 corporate reputation rankings. In 2019, Clorox ranked seventh in Barron's \"100 Most Sustainable U.S. Companies\" list. In 2022, the company opened a new manufacturing facility in Martinsburg, West Virginia, to facilitate the growth of its cat litter business. In 2023 the company was affected by a cyberattack, resulting in revenue loss and product shortages. Brands The Clorox Company currently owns a number of well-known household and professional brands in a wide variety of products, including: Brita water filtration systems (Americas only) Burt's Bees natural cosmetics and personal care products Clorinda bleach and cleaning and disinfection products, alternative brand of Clorox Chile Formula 409 hard surface cleaners Fresh Step, Scoop Away, and Ever Clean cat litters Glad storage bags, trash bags, Press'n Seal, GladWare containers (joint venture with P&G as 20-percent minority shareholder) Green Works natural cleaners Handy Andy floor cleaners in Australia Hidden Valley dressings, sandwich spreads and condiments, dips and dressing mixes, croutons and salad toppings, side dishes and appetizers Kingsford charcoal Kitchen Bouquet, KC Masterpiece, and Soy Vay sauces Lestoil heavy-duty laundry and multipurpose cleaner Liquid-Plumr drain cleaner Pine-Sol, Tilex, Poett, and S.O.S cleaning products The company's bleach products are sold under regional brands. In 2006, Clorox acquired the Canadian Javex line of bleach products from Colgate-Palmolive, and similar product lines in parts of Latin and South America. Sales The company ranked No. 453 on the Fortune 500 list in 2017; by 2020, Clorox ranked No. 474 on the list. Clorox's net sales (2015–2020) Marketing Advertising campaigns In 1986, the advertising campaign for Clorox 2 featured an award-winning jingle, \"Mama's Got The Magic of Clorox 2\". The song was written by Dan Williams and performed by Dobie Gray. The company was listed at Advertising Age's 2015 Marketer A-List. Allegations of sexist marketing During 2006 and 2007, a Clorox commercial that aired nationally showed several generations of women doing laundry. The commercial included the words \"Your mother, your grandmother, her mother, they all did the laundry, maybe even a man or two\". Feminists criticized the commercial for insinuating that doing laundry is a job for women only. The Clorox slogan, \"Mama's got the magic of Clorox\", was criticized on similar grounds. The slogan first appeared in a Clorox commercial in 1986. A modified version of the commercial ran from 2002 to 2004. In 2009, Clorox received complaints of sexism for an advertisement that featured a man's white, lipstick-stained dress shirt with the caption, \"Clorox. Getting ad guys out of hot water for generations\". The ad, and others, were produced expressly for the television program Mad Men, capitalizing on \"the show's unique vintage style to [create] a link between classic and modern consumer behaviors\". Reactions to product claims Green Works In 2008, the Sierra Club endorsed the Clorox Green Works line. Sierra Club Executive Director Carl Pope stated that one of the nonprofit organization's primary goals is to \"foster vibrant, healthy communities with clean water and air that are free from pollution. Products like Green Works help to achieve this goal in the home\". The Sierra Club also partnered with Clorox to \"promote a line of natural cleaning products for consumers who are moving toward a greener lifestyle\". The partnership \"caused schisms\" in the club, which contributed in part to Pope's decision to resign. Also in 2008, the National Advertising Division told Clorox to either discontinue or modify its advertisements for Green Works on the grounds the cleaners actually do not work as well as traditional cleaners, as Clorox had claimed. In 2009, Clorox received further criticism for its Clorox Green Works line, regarding claims the products are environmentally friendly. Several Clorox Green Works products contain ethanol, which environmental groups state is neither cost-effective nor eco-friendly. Many Green Works products also contain sodium lauryl sulfate, a known skin irritant. Women's Voices for the Earth have questioned whether or not the Clorox Green Works line is greenwashing, as Clorox's \"green\" products are far outnumbered by their traditional products, asking \"Why sell one set of products that have hazardous ingredients and others that don't?\" Animal testing In 2019, Clorox announced that they do not participate in animal testing except where required by law. This prompted backlash from animal advocacy organizations like PETA, who claimed that Clorox was perpetuating animal testing by choosing to sell their products in markets where inhumane animal testing was required, such as China."
}