{
  "ticker": "CME",
  "cik": "0001156375",
  "company_name": "CME Group",
  "corrected_name": "CME Group",
  "wiki_title_used": "CME Group",
  "exists": true,
  "raw_text": "CME Group Inc. (formerly Chicago Mercantile Exchange Holdings Inc.) is an American financial services company based in Chicago, Illinois. It operates financial derivatives exchanges, including the Chicago Mercantile Exchange (CME), the Chicago Board of Trade (CBOT), the New York Mercantile Exchange (NYMEX), and the Commodity Exchange (COMEX). The company owns 27% of S&P Dow Jones Indices. It is the world's largest operator of financial derivatives exchanges. Its exchanges are platforms for trading in agricultural products, currencies, energy, interest rates, metals, futures contracts, options, stock indexes, and cryptocurrencies futures.\nHeadquartered in Chicago, the company maintains offices in New York, Houston, and Washington D.C., in the United States, as well as abroad in Bangalore, Beijing, Belfast, Calgary, Hong Kong, London, Seoul, Singapore, and Tokyo.\n\nHistory\nThe Chicago Mercantile Exchange (CME), was founded in 1898 as a nonprofit corporation. In 1919, it established its clearing house. In 2000, CME demutualized (became a joint stock company). In 2002, CME Group, the parent company of CME, became a public company via an initial public offering.\nOn July 12, 2007, CME Group completed a merger with the CME's historical rival, the holding company for the Chicago Board of Trade, founded in 1848, in an $8 billion deal that created the world's largest financial market. The company then launched as CME Group Inc., a CME/Chicago Board of Trade Company.\nIn 2012, Phupinder Gill, then CME Group's president and COO, became the company's CEO.\nIn November 2016, Gill retired from his role and Terrence A. Duffy, then executive chairman and president of the company, took on an expanded role as its CEO.\nIn 2021, the firm struck a partnership with Google to build its cloud strategy, which saw the tech giant investing $1 billion in CME Group.\nIn 2022, CME Group futures and options reached a record average daily volume of 23.3 million contracts.\n\nMergers and acquisitions\nOn August 22, 2008, CME Group acquired New York Mercantile Exchange (NYMEX), owner of both the NYMEX exchange and the Commodity Exchange (COMEX), for $8.9 billion in cash and CME Group stock.\nOn February 10, 2010, CME Group agreed to purchase 90% of Dow Jones & Company's financial-indexes business, including the Dow Jones Industrial Average. CME Group and Dow Jones & Company subsequently contributed the Dow Jones Indexes to the formation of S&P Dow Jones Indices joint venture, with CME Group receiving a 24.4% ownership interest and Dow Jones & Company receiving a 2.6% ownership interest in the joint venture. In April 2013, CME Group purchased the remaining Dow Jones & Company interest for $80.0 million, increasing CME Group's interest in S&P Dow Jones Indices from 24.4% to 27.0%.\nOn December 3, 2012, CME Group acquired the Kansas City Board of Trade, the dominant venue for the sale of hard red winter wheat, for $126 million in cash.\nOn March 15, 2016, the firm announced the sale of its suburban Chicago data center in Aurora, IL to CyrusOne for $130 million, in a leaseback transaction.\nOn November 2, 2018, CME Group acquired the London-based NEX Group for $5.5 billion.\n\nOperations\nCME Group operates a global derivatives marketplace that allows institutions and individuals to trade futures and options based on interest rates, equity indexes, foreign exchange, energy, metals, and agricultural commodities. The company runs an electronic trading platform, CME Globex, which allows customers in approximately 150 countries to trade futures and options contracts.\nThe company also operates two cash market businesses: BrokerTec, which facilitates dealer-to-dealer trading for fixed-income markets, and EBS, which provides foreign exchange spot trading.\nIn addition, CME Group operates CME Clearing, which serves as a counterparty to every cleared transaction, including both listed and OTC derivatives, within the company's marketplace. CME Group is a member of CCP Global, a trade group of central counterparty clearinghouses from around the globe.\n\nBoard governance\nCME Group's history of member-owned exchanges and mergers and acquisition of rivals have led to an unconventionally large board size for a publicly traded company. In 2018, six of its 20 sitting board directors were elected by holders of Class B shares, representing owners of exchange seats, as opposed to that of publicly traded Class A shares. In comparison, the average company in the S&P 500 had no more than 11 board directors.\nOn August 23, 2018, the company offered holders of Class B shares about $10 million to relinquish control of their six board seats. The move was subsequently rejected.\n\nNotable events\n2010 flash crash\nCME Group was at the center of the 2010 flash crash, which took place on May 6, 2010. According to a Commodity Futures Trading Commission (CFTC) 2014 report, a significant cause of the event was the use of spoofing algorithms by Navinder Singh Sarao, a British financial trader; just prior to the flash crash, he placed orders for thousands of E-mini S&P 500 stock index futures contracts — which traded on CME Group's Globex platform — and later replaced or modified those orders at least 19,000 times before they were cancelled. The event led to the modern day implementation of coordinated cross-market circuit breakers, as the CME's Globex platform halted trading in an automated response to the activity, while the New York Stock Exchange did not.\n\nAwards and honors\nCME Group earned a score of 100% on the Human Rights Campaign's Corporate Equality Index in 2019, 2020, 2021, and 2022.\nCME Group was named to the Forbes Blockchain 50 list in 2021 and 2022.\nIn 2022, the company won WatersTechnology's IMD & IRD Awards for Best market data in the exchange category.\n\nSee also\nCME Group Tour Championship, the season-ending tournament of the LPGA Tour of women's golf, sponsored by CME Group\nCCP Global\n\nReferences\nExternal links\nOfficial website \nBusiness data for CME Group Inc.: \nThe CME Group Collections at University of Illinois at Chicago",
  "clean_text": "CME Group Inc. (formerly Chicago Mercantile Exchange Holdings Inc.) is an American financial services company based in Chicago, Illinois. It operates financial derivatives exchanges, including the Chicago Mercantile Exchange (CME), the Chicago Board of Trade (CBOT), the New York Mercantile Exchange (NYMEX), and the Commodity Exchange (COMEX). The company owns 27% of S&P Dow Jones Indices. It is the world's largest operator of financial derivatives exchanges. Its exchanges are platforms for trading in agricultural products, currencies, energy, interest rates, metals, futures contracts, options, stock indexes, and cryptocurrencies futures. Headquartered in Chicago, the company maintains offices in New York, Houston, and Washington D.C., in the United States, as well as abroad in Bangalore, Beijing, Belfast, Calgary, Hong Kong, London, Seoul, Singapore, and Tokyo. History The Chicago Mercantile Exchange (CME), was founded in 1898 as a nonprofit corporation. In 1919, it established its clearing house. In 2000, CME demutualized (became a joint stock company). In 2002, CME Group, the parent company of CME, became a public company via an initial public offering. On July 12, 2007, CME Group completed a merger with the CME's historical rival, the holding company for the Chicago Board of Trade, founded in 1848, in an $8 billion deal that created the world's largest financial market. The company then launched as CME Group Inc., a CME/Chicago Board of Trade Company. In 2012, Phupinder Gill, then CME Group's president and COO, became the company's CEO. In November 2016, Gill retired from his role and Terrence A. Duffy, then executive chairman and president of the company, took on an expanded role as its CEO. In 2021, the firm struck a partnership with Google to build its cloud strategy, which saw the tech giant investing $1 billion in CME Group. In 2022, CME Group futures and options reached a record average daily volume of 23.3 million contracts. Mergers and acquisitions On August 22, 2008, CME Group acquired New York Mercantile Exchange (NYMEX), owner of both the NYMEX exchange and the Commodity Exchange (COMEX), for $8.9 billion in cash and CME Group stock. On February 10, 2010, CME Group agreed to purchase 90% of Dow Jones & Company's financial-indexes business, including the Dow Jones Industrial Average. CME Group and Dow Jones & Company subsequently contributed the Dow Jones Indexes to the formation of S&P Dow Jones Indices joint venture, with CME Group receiving a 24.4% ownership interest and Dow Jones & Company receiving a 2.6% ownership interest in the joint venture. In April 2013, CME Group purchased the remaining Dow Jones & Company interest for $80.0 million, increasing CME Group's interest in S&P Dow Jones Indices from 24.4% to 27.0%. On December 3, 2012, CME Group acquired the Kansas City Board of Trade, the dominant venue for the sale of hard red winter wheat, for $126 million in cash. On March 15, 2016, the firm announced the sale of its suburban Chicago data center in Aurora, IL to CyrusOne for $130 million, in a leaseback transaction. On November 2, 2018, CME Group acquired the London-based NEX Group for $5.5 billion. Operations CME Group operates a global derivatives marketplace that allows institutions and individuals to trade futures and options based on interest rates, equity indexes, foreign exchange, energy, metals, and agricultural commodities. The company runs an electronic trading platform, CME Globex, which allows customers in approximately 150 countries to trade futures and options contracts. The company also operates two cash market businesses: BrokerTec, which facilitates dealer-to-dealer trading for fixed-income markets, and EBS, which provides foreign exchange spot trading. In addition, CME Group operates CME Clearing, which serves as a counterparty to every cleared transaction, including both listed and OTC derivatives, within the company's marketplace. CME Group is a member of CCP Global, a trade group of central counterparty clearinghouses from around the globe. Board governance CME Group's history of member-owned exchanges and mergers and acquisition of rivals have led to an unconventionally large board size for a publicly traded company. In 2018, six of its 20 sitting board directors were elected by holders of Class B shares, representing owners of exchange seats, as opposed to that of publicly traded Class A shares. In comparison, the average company in the S&P 500 had no more than 11 board directors. On August 23, 2018, the company offered holders of Class B shares about $10 million to relinquish control of their six board seats. The move was subsequently rejected. Notable events 2010 flash crash CME Group was at the center of the 2010 flash crash, which took place on May 6, 2010. According to a Commodity Futures Trading Commission (CFTC) 2014 report, a significant cause of the event was the use of spoofing algorithms by Navinder Singh Sarao, a British financial trader; just prior to the flash crash, he placed orders for thousands of E-mini S&P 500 stock index futures contracts — which traded on CME Group's Globex platform — and later replaced or modified those orders at least 19,000 times before they were cancelled. The event led to the modern day implementation of coordinated cross-market circuit breakers, as the CME's Globex platform halted trading in an automated response to the activity, while the New York Stock Exchange did not. Awards and honors CME Group earned a score of 100% on the Human Rights Campaign's Corporate Equality Index in 2019, 2020, 2021, and 2022. CME Group was named to the Forbes Blockchain 50 list in 2021 and 2022. In 2022, the company won WatersTechnology's IMD & IRD Awards for Best market data in the exchange category."
}