{
  "ticker": "CMG",
  "cik": "0001058090",
  "company_name": "Chipotle Mexican Grill",
  "corrected_name": "Chipotle Mexican Grill",
  "wiki_title_used": "Chipotle Mexican Grill",
  "exists": true,
  "raw_text": "Chipotle Mexican Grill, Inc. ( chih-POHT-lay), often known simply as Chipotle, is an American multinational chain of fast casual restaurants specializing in bowls, tacos, and Mission burritos made to order in front of the customer. As of June 30, 2025, Chipotle has over 3,800 restaurants. Its name derives from chipotle, the Nahuatl name (from chilpoctli) for a smoked and dried jalapeño chili pepper.\nChipotle was one of the first chains of fast casual restaurants.  It was founded by Steve Ells on July 13, 1993. Ells was the founder, chairman, and CEO of Chipotle. He was inspired to open the restaurant after visiting taquerias and burrito shops in San Francisco's Mission District while working as a chef. Ells wanted to show customers that fresh ingredients could be used to quickly serve food.  Chipotle had 16 restaurants (all in Colorado) when McDonald's Corporation became a major investor in 1998. By the time McDonald's fully divested itself from Chipotle in 2006, the chain had grown to over 500 locations. With more than 2,000 locations, Chipotle had a net income of US$475.6 million and a staff of more than 45,000 employees in 2015.\nBy 2025, Chipotle had restaurants in 48 states and the district of Columbia but not in the states of Alaska nor Hawaii, nor in the American overseas territories of Puerto Rico, Virgin Islands, American Samoa, or Guam.\nIn May 2018, Chipotle announced the relocation of their corporate headquarters to Newport Beach, California, in Southern California, leaving Denver after 25 years.\n\nHistory\nSteve Ells attended the Culinary Institute of America in Hyde Park, New York. Afterward, he became a line cook for Jeremiah Tower at Stars in San Francisco. There, Ells observed the popularity of the taquerías and San Francisco burritos in the Mission District. In 1993, Ells took what he learned in San Francisco and opened the first Chipotle Mexican Grill in Denver, Colorado, in a former Dolly Madison Ice Cream store at 1644 East Evans Avenue, near the University of Denver campus, using an $85,000 loan from his father. Ells and his father calculated that the store would need to sell 107 burritos per day to be profitable. After one month, the original restaurant was selling over 1,000 burritos a day. The second store opened in 1995 using Chipotle's cash flow, and the third was opened using an SBA loan. To fund additional growth, Ells' father invested $1.5 million. Afterwards, Ells created a board of directors and business plan, raising an additional $1.8 million for the company. Ells had originally planned to use funds from the first Chipotle to open a fine-dining restaurant, but instead focused on Chipotle Mexican Grill when the restaurants saw success.\nIn 1998, the first restaurant outside of Colorado opened in Kansas City, Missouri.\nIn 1998, McDonald's made an initial minority investment in the company. By 2001, McDonald's had grown to be Chipotle's largest investor. The investment from McDonald's allowed the firm to quickly expand, from 16 restaurants in 1998 to over 500 by 2005. On January 26, 2006, Chipotle made its initial public offering (IPO) after increasing the share price twice due to high pre-IPO demand. At the time Chipotle had 500 stores. In its first day as a public company, the stock rose exactly 100%, resulting in the best U.S.-based IPO in six years, and the second-best IPO for a restaurant after Boston Market. The money from the offering was then used to fund new store growth.\nIn March 2005, Monty Moran was appointed president and chief operating officer of Chipotle while Ells remained chairman and CEO.\nIn October 2006, McDonald's fully divested from Chipotle. This was part of a larger initiative for McDonald's to divest all of its non-core business restaurants—Chipotle, Donatos Pizza, and Boston Market—so that it could focus on the main McDonald's chain. McDonald's had invested approximately $360 million into Chipotle, and took out $1.5 billion. McDonald's had attempted to get Chipotle to add drive-through windows and a breakfast menu, which Ells resisted.  In 2008, Chipotle opened its first location outside of the United States in Toronto.\nIn January 2009, president and chief operating officer Monty Moran was promoted to co-CEO, a position that he would share with Ells, while Moran retained his president position.\nIn a list of fastest-growing restaurant chains in 2009, Chipotle was ranked eighth, based on increases in U.S. sales over the past year, and in 2010 Chipotle was ranked third. Consumer Reports ranked Chipotle as the best Mexican fast-food chain in 2011. The company serves approximately 750,000 customers per day.\nIn December 2010, Chipotle hired chef Nate Appleman to develop new cuisine. Appleman has won Rising Star Chef from the James Beard Foundation, was named \"Best New Chef\" by the Food & Wine magazine, and competed on The Next Iron Chef.\nIn 2010, U.S. Immigration and Customs Enforcement (ICE) audited Chipotle's Minneapolis restaurants, and found that some employees had been hired using fraudulent documents. In December, Chipotle fired 450 employees from its Minneapolis restaurants as a result of the audit, resulting in protests by local groups. In February 2011, ICE expanded the audit to include 60 restaurants in Virginia and Washington, D.C. which resulted in 40 workers being fired. In April 2011, the criminal division of the attorney general's office in Washington, D.C., joined the case, and ICE agents began interviewing employees at 20 to 25 restaurants in other locations, such as Los Angeles and Atlanta. In response to the government investigations, Chipotle hired former director of ICE Julie Myers Wood and high-profile attorneys Robert Luskin and Gregory B. Craig.\nIn April 2014, Chipotle announced an increase in menu prices for the first time in nearly three years, due to increasing costs for steak, avocados, and cheese. The price increase was expected to be rolled out from the end of second quarter of 2014 through the end of the third quarter. In late 2015, Chipotle expanded its mobile strategy through delivery partnerships with tech startups like Tapingo, a delivery service that targets college campuses.\nIn December 2016, Chipotle announced that co-CEO Monty Moran has stepped down from his role effective immediately with Ells becoming the sole CEO. Eleven months later, Ells announced in November 2017 that he would be stepping down as CEO.\nIn December 2017, Chipotle announced it signed a 15-year lease and in late 2018 will move around 450 corporate employees—currently housed in multiple buildings around downtown Denver—into the new 1144 Fifteenth Tower and occupy around 126,000 square feet or 5 floors of the 40-story tower.\nIn February 2018, Chipotle announced that Taco Bell CEO Brian Niccol would replace Ells as CEO starting on March 5 while Ells would retain his chairman position. Many industry analysts praised Niccol's appointment saying that Chipotle \"needed new blood\". Chipotle stock went up $30.27, or 12.04%, as a result of the announcement. However, other analysts criticized the announcement by saying that \"the move goes against everything the burrito chain stands for\".\nIn May 2018, Chipotle announced that it would relocate headquarters from Denver to Newport Beach, California, in Southern California. Corporate functions handled in their Denver and New York offices would move to Newport Beach or to an existing office in Columbus, Ohio. This move would impact 400 workers, some being offered relocation and retention packages.\nIn May 2018, Chipotle announced the \"Chipotlane\" and began testing it in the U.S.. The Chipotlane acts as a drive-thru, but it is for mobile order pickup only; customers are unable to order food at the handout window but are welcome to pick up their mobile orders through the Chipotlane or inside the restaurant. As of 2023, there are over 500+ locations which include the Chipotlane in order to make the restaurant run more efficiently.\nIn June 2018, the company announced the closing of 65 under-performing restaurants.\nElls broke all ties with the company in March 2020 by resigning as its chairman and departing from its board of directors.\nIn January 2023, the company announced plans to hire 15,000 workers and expand to 7,000 locations, up from a previous goal of 6,000. This would double its footprint. At the time of the announcement, it had more than 100,000 employees. An article in The Wall Street Journal in July noted the chain would focus on opening 700–800 new locations in small towns and cities as part of its plan to expand by nearly 3,800 locations, in territory traditionally dominated by chains like McDonald's and Applebee's.\nIn 2023 Chipotle saw $9.9 billion in revenue with 14.3% growth year on year and $3 million in average unit volumes (per restaurant revenue) and 7.9% growth in comparable sales; in 2023 37.4% of their revenue came via online orders, third-party delivery services or their new Chipotlanes.\nIn September 2024, Chipotle announced it was collaborating with Vebu, a company that develops automation and robotics equipment for the food industry, on a new automated avocado processing machine, Autocado. The companies claimed that this machine could peel and cut an avocado in less than 30 seconds and operate unattended on a large batch, which could significantly reduce the time and labor required to prepare large quantities of guacamole.\nChipotle's share price fell more than 9% after fiscal second quarter results showed same-store sales shrinking by 4%, compared to 0.4% in the prior quarter.\nIn August 2025, Chipotle announced plans of delivering food via drone aircraft within the greater Dallas area through a partnership with Zipline.\n\nExpansion attempts into other types of cuisines\nIn the 2010s, Ells tried to diversify the company by creating or acquiring several subsidiaries. These subsidiaries offered very different cuisines compared to their parent company. Examples include soul food (Soul Daddy), Asian cuisine (ShopHouse Southeast Asian Kitchen), pizza (Pizzeria Locale), and burgers (Tasty Made). In 2023, Chipotle had also tried incorporating California-inspired bowls into the Farmesa Fresh Eatery concept. The few test locations were not a financial success and all concepts were discontinued.\nIn 2011, Steve Ells was a judge for the TV show America's Next Great Restaurant and investor of ANGR Holdings, the company that will be running the winning concept's restaurants. Chipotle has agreed to purchase Ells' investment in ANGR at his cost, provide support for ANGR operations, and invest a total of $2.3 million in cash contributions. The winning concept, Soul Daddy, was quickly closed after operating for 8 weeks.\nIn September 2011, Chipotle opened an Asian fast-casual concept restaurant named ShopHouse Southeast Asian Kitchen in Washington, D.C. The company has said the new restaurant \"would follow the Chipotle service format and its focus on 'food with integrity' in ingredients\". Chipotle's plan was to start with only one store, and see how the restaurant works out before expanding the concept.\nOn July 29, 2016, the company announced the opening of its first Tasty Made burger restaurant in the fall.\nThe newer restaurant concepts did not perform as well as expected, so ShopHouse Southeast Asian Kitchen and Tasty Made were closed in March 2017 and February 2018 respectively, leaving only Pizzeria Locale operating besides the parent company.\nIn February 2023, Chipotle opened their first Farmesa Fresh Eatery in Santa Monica, California, serving bowls containing customers' choice of a protein, a green or grain, two sides, a topping, and a selection of up to five sauces. Some of the choices included steak, salmon, whipped potatoes, sweet potato chips, beets, and cauliflower.\nIn July 2023, Chipotle exited the highly competitive pizza restaurant industry by announcing that they were closing all of their remaining Pizzeria Locale locations and would \"dissolve the business\". Chipotle also abandoned Farmesa in April 2024.\n\nCorporate affairs\nFinancial performance\nThe key trends for Chipotle are (as of the financial year ending December 31):\n\nOwnership\nChipotle is mainly owned by institutional investors, who hold around 89% of all shares. The 10 largest shareholders in late 2024 were:\n\nThe Vanguard Group (8.97%)\nBlackRock (8.14%)\nState Street Corporation (4.26%)\nT. Rowe Price (3.92%)\nJPMorgan Chase (3.31%)\nCapital World Investors (2.93%)\nFidelity Investments (2.49%)\nAllianceBernstein (2.23%)\nGeode Capital Management (2.11%)\nPershing Square Capital Management (1.83%)\n\nCorporate management\nChipotle's team includes a residing corporate office of managers and its board of directors. Members of both teams are appointed to serve on committees: audit, compensation, and nominating and corporate governance.\nBy late 2016, the top management team consisted of the chief executive officer, Steve Ells; the chief financial officer, Jack R. Hartung; the chief marketing and development officer, Mark Crumpacker. At that time, the board of directors consists of: Ells, Patrick Flynn, Albert Baldocchi, Neil Flanzraich, Darlene Friedman, Stephen Gillet, Kimbal Musk and John Charlesworth.  On March 14, 2018, it was reported that Mark Crumpacker, who had previously been charged in a 2016 cocaine ring indictment, would be leaving the company.\nElls served as chairman of the company, and served as chief executive officer until November 2017. He had a 1.25% stake in the company in 2010. The labor-market research firm Glassdoor reported that Ells earned $29 million in 2014, versus a median of $19,000 for Chipotle's workers, making the CEO-to-worker pay ratio 1522:1.\nOn February 13, 2018, Chipotle announced that Taco Bell CEO Brian Niccol would replace Ells as CEO starting on March 5 while Ells would retain his chairman position.\nOn March 6, 2020, Ells resigned as chairman and left the board of directors, breaking his final ties to the company. At the same time, Niccol was appointed chairman and the size of the board was reduced from 10 to 7 directors.\nOn August 13, 2024, Starbucks announced it was hiring Niccol as its next CEO. Chief Operating Officer Scott Boatwright was appointed by the board as interim CEO effective August 31, 2024. At the same board meeting, company director Scott Maw was named chairman of the board and retiring CFO Jack Hartung was named president. Four months later, Boatwright was named permanent CEO by the board in November 2024.\nChipotle's key management as of May 2025 consists of:\n\nScott Boatwright, Chief Executive Officer and Board member\nAdam Rymer, Chief Financial Officer\nChris Brandt, Chief Brand Officer\nCurt Garner, Chief Customer and Technology Officer\nJohn R. Hartung, President and Chief Strategy Officer\nLaurie Schalow, Chief Corporate Affairs and Food Safety Officer\n\nOperation and distribution\nAll of Chipotle's restaurants are company-owned, rather than franchised. As of December 2012, 1430 restaurants have since opened throughout the United States and Canada, with locations in 43 states, Ontario, British Columbia, and the District of Columbia.\nThe field team are the employees who work closely with but not directly within specific restaurants. The field support system includes apprentice team leaders (step up from restaurateurs), team leaders or area managers, team directors and regional directors (not atypical for them to oversee more than fifty locations). Because Chipotle does not franchise, all restaurants are owned and operated directly by the corporation itself. Thus, whenever Chipotle is in the process of launching a new location, the field team hires a new general manager and trains them at a current location so that they will be ready for the new location when it opens for business. The corporate office takes care of finding and funding new locations as well.\nIn July 2023, the company announced it was testing a robot developed to cut the time to prepare avocados for guacamole in half amid an ongoing labor shortage. It was one of multiple chains incorporating automation into its operations at the time.\n\nInternational\nChipotle had 17 locations outside of the United States by October 2014 with the majority in Canada, and the UK was in the process of opening more locations. The rate of overseas expansion was slower than expected.  Many of the press reviewers thought that the food was overpriced for their area.\nIn July 2023, the company announced it would partner with the Kuwait-based Alshaya Group in its first-ever franchise deal to expand into the Middle East.\nIn April 2025, Chipotle announced it had signed a joint venture with Alsea to open restaurants in Mexico by early 2026, and possibly in other areas in which Alsea operates in Latin America.\nIn September 2025, Chipotle announced it signed a joint venture with SPC Group to open restaurants in Eastern Asia, with the first Chipotle restaurants opening in South Korea and Singapore in 2026. At the time of the announcement, Chipotle's existing international portfolio of restaurants included 60 locations in Canada, 20 in the United Kingdom, six in France, two in Germany, three in Kuwait and three in the UAE.\n\nNorth America\nCanada\nIn August 2008, Chipotle opened its first location outside of the United States in Toronto, Canada. A second Toronto store opened in 2010. The first Canadian location outside Toronto opened in Vancouver in December 2012. Chipotle has six locations in the Vancouver-area, including Vancouver, West Vancouver, North Vancouver, Burnaby, Port Coquitlam, Langley and Surrey. In 2023, Chipotle announced that seventh store would open up in the Vancouver region.  The first location in the country's Capital opened in February 2017 at the Rideau Centre.\nThe first location in Alberta was opened in Calgary in October 2023. The first Chipotle restaurant in Edmonton opened in September 2024.\nAcross Canada, there are 26 stores in Ontario, 16 in British Columbia, and 2 in Alberta.\n\nEurope\nUnited Kingdom\nChipotle expanded to Europe with the first European restaurant opening in May 2010 in London. A second location opened in London in September 2011. The following year, three additional locations quickly opened in the London area. After this growth spurt, the rate of further expansion in London slowed greatly with the sixth location appearing in 2013 and the seventh in June 2015. Although Chipotle blames the slow growth in the United Kingdom on the British unfamiliarity with Mexican foods, several locally owned burrito chains had opened locations across the United Kingdom during the same interval. As of February 2024, there were 19 UK locations, of which 17 were in London.\n\nFrance\nThe first location in France opened in Paris in May 2012. Expansion in France was much slower than that in the United Kingdom or Canada, with a second location in Paris opening in 2013 and a third location in 2014. At the time of its opening in 2014, the restaurant at La Défense was the largest Chipotle location in the world at 7,000 square feet (650 m2), while a typical Chipotle restaurant is usually between 2,200 square feet (200 m2) and 2,500 square feet (230 m2). A fourth Parisian location was opened in Levallois-Perret in 2015 followed by a fifth Parisian location in Saint-Germain-des-Prés in 2016. The company opened its seventh location in France and its first location outside the Paris region, inside Lyon's La Part-Dieu shopping mall in 2021.\n\nGermany\nThe first location in Germany opened up in Frankfurt's Skyline Plaza shopping mall in August 2013. A second location opened in Frankfurt's MyZeil shopping mall in April 2019.\n\nAsia\nKuwait\nFranchise partner Alshaya Group opened its first Chipotle restaurant in the city state of Kuwait inside The Avenues mall in April 2024.\n\nUnited Arab Emirates\nFranchise partner Alshaya Group opened its first Chipotle restaurant in the United Arab Emirates in Dubai at the Jumeirah Beach Residence in September 2024. Alshaya open its first location in Abu Dhabi at the Yas Mall, the third in the UAE, in August 2025.\n\nQatar\nFranchise partner Alshaya Group opened its first Chipotle restaurant in Doha, the capital of the state of Qatar in September 2025 at the Villaggio Mall.\n\nMenu\nChipotle's menu consists of five items: burritos, bowls, tacos, quesadillas, and salads. The price of each item is based on the choice of chicken, pork carnitas, barbacoa, steak, tofu-based \"sofritas\", or vegetarian (with guacamole or queso, which would be at an extra charge otherwise). Additional optional toppings are offered free of charge, including: rice, beans, four types of salsa, fajita vegetables, sour cream, cheese, and lettuce. Although Chipotle styles itself as a \"Mexican Grill\", its menu is more accurately characterized as Cal-Mex, a form of Mexican-American cuisine with its roots in California.  When asked in 2007 about expanding the menu, Steve Ells said, \"[I]t's important to keep the menu focused, because if you just do a few things, you can ensure that you do them better than anybody else.\" Chipotle also offers a children's menu. Most restaurants sell beer and margaritas in addition to soft drinks and fruit drinks.\nThe majority of food is prepared in each restaurant. Some exceptions are the beans and carnitas, which are prepared at a central kitchen in Chicago, Illinois. None of the restaurants have freezers, microwave ovens, or can openers.\nThe chain experimented with breakfast foods at two airports in the Washington (D.C.) metropolitan area but decided against expanding the menu in that direction. Starting in 2009, selected restaurants had offered a pozole soup, which has since been discontinued. Starting in 2009, Chipotle tested a vegan chicken product (made by Gardein) called \"Garden Blend\" in various cities but discontinued it in 2010.\nIn 2013, Chipotle began testing the tofu-based \"sofritas\" option (made by Hodo Soy) in Northern California restaurants; following its successful trial, it was rolled out nation-wide in 2014.\n\nIn June 2015, Chipotle began test marketing a pork and chicken chorizo-type sausage as a new protein option at selected locations in the Kansas City area. Some food writers have expressed their health related concerns over the protein's relatively high sodium content since a 4-ounce (110 g) serving contains 293 calories and 803 milligrams of sodium while the American Heart Association's recommended daily amount is less than 1,500 milligrams of sodium. In contrast, the protein options with next highest sodium contents are Barbacoa with 530 milligrams and sofritas with 555 milligrams. An earlier version of the Mexican sausage was tested in Denver and New York City in 2011, but that test was terminated when that version of the sausage was perceived as looking too greasy.  Chorizo was discontinued in September 2017 but was returned to the menu in the following year for a limited time.\nIn July 2020, Chipotle began test marketing a cauliflower rice option at 55 locations in Colorado and Wisconsin.\nIn August 2021, Chipotle began testing a company-made vegan chorizo made with pea protein. The vegan chorizo (now called plant-based chorizo) was subsequently released nation-wide as a limited-time only item on January 3, 2022, before being removed on March 4, 2022.\nChipotle accepts fax orders, and in 2005 the company added the ability to order online from their website. For both online and fax orders, customers proceed to the front of the line to pay for pre-ordered food. In 2009, Chipotle released an app for the iPhone that allows users to find nearby Chipotle locations, place an order, and prepay with a credit card. In 2013, Chipotle released an Android app that allows users to locate nearby Chipotle locations, place an order, prepay with a credit or gift card, and access favorites and recent orders.\nIn late 2021, the company added a non-food item to the menu—cilantro soap.  According to published reports, the soap sold out the day after its release.  The soap was produced after an August 2021 Instagram post of what was thought to be a mock photo of the product.  It was an effort to engage fans and haters of the herb that, \"plays into a larger trend of turning digital moments into real life experiences,\" according to Chris Brandt, Chipotle's Chief Marketing Officer.\n\nNutrition\nIn 2003, a Center for Science in the Public Interest report stated that Chipotle's burritos contain over 1,000 calories, which is nearly equivalent to two meals' worth of food. MSNBC Health.com placed the burritos on their list of the \"20 Worst Foods in America\" because of their high caloric content and high sodium. When a burrito with carnitas, rice, vegetables, cheese, guacamole, and salsa was compared with a typical Big Mac, the burrito had more fat, cholesterol, carbohydrates, and sodium than the Big Mac, but it also had more protein and fiber. The restaurant has also received praise—Health.com included the restaurant in its list of the \"Healthiest Fast Food Restaurants\".\nChipotle's vegetarian options include rice, black beans, fajita vegetables (onions and bell peppers), salsa, guacamole, queso and cheese.  All items other than the meats, cheese, sour cream, queso and honey vinaigrette dressing are vegan. As of late 2013, Chipotle developed a new cooking strategy for the pinto beans, eliminating the bacon and making them vegetarian and vegan-friendly. The cheese is processed with vegetable-based rennet in order to be suitable for vegetarians.  In April 2010, Chipotle began testing a vegan \"Garden Blend\" option, which is a plant-based meat alternative marinated in chipotle adobo, at six locations in the U.S. The flour tortillas used for the burritos and soft tacos are the only items that contain gluten.\n\nPortion size irregularities\nSome customers took to the social media platform TikTok accusing Chipotle of reducing portion sizes. In June 2024, a Wells Fargo analyst and his team set investigated the matter and ordered 75 identically configured items from 8 different Chipotle locations in New York City. The team weighed each bowl and reported that portion sizes varied widely, ranging from 14 to 27 ounces (400 to 770 g) with a median weight of 21.5 ounces (610 g).\n\nFood sourcing\nIn 1999, while looking for ways to improve the taste of the carnitas, founder Steve Ells was prompted by an article written by Edward Behr to visit Concentrated Animal Feeding Operations (CAFOs). Ells found the CAFOs \"horrific\", and began sourcing from open-range pork suppliers. This caused an increase in both the price and the sales of the carnitas burritos.\nIn 2001, Chipotle released a mission statement called Food With Integrity, which highlighted Chipotle's efforts to increase their use of naturally raised meat, organic produce, and dairy without added hormones.\nElls testified before the United States Congress in support of the Preservation of Antibiotics for Medical Treatment Act, which was aimed to reduce the amount of antibiotics given to farm animals.\nFrom 2006 to 2012, the Coalition of Immokalee Workers (CIW), a Floridian farmworker organization, protested Chipotle's refusal to sign a Fair Food agreement, which would commit the restaurant chain to pay a penny-per-pound premium on its Florida tomatoes to boost tomato harvesters' wages, and to only buy Florida tomatoes from growers who comply with the Fair Food Code of Conduct. In 2009, the creators of the documentary film Food, Inc. (along with 31 other leaders in the sustainable food movement) signed an open letter of support for the CIW's campaign, stating that, \"If Chipotle is sincere in its wishes to reform its supply chain, the time has come to work with the Coalition of Immokalee Workers as a true partner in the protection of farmworkers rights.\" In September 2009, Chipotle announced that it would sidestep partnership with the CIW and instead work directly with East Coast Growers and Packers to increase wages for its tomato pickers. Ells framed the dispute as a fundamental issue of control, stating that, \"the CIW wants us to sign a contract that would let them control Chipotle's decisions regarding food in the future\". In October 2012, Chipotle signed an agreement with the CIW and became the 11th company to join the organization's Fair Food Program.\nIn January 2015, Chipotle pulled carnitas from its menu in a third of its restaurants; company officials cited animal welfare problems at one of the suppliers, found during a regular audit, as the reason. Subsequently, a false rumor spread online claiming it was done to appease Muslims who consider pork to be unclean, leading to some protests on social media. The company still uses antibiotic-free and hormone-free steak in its restaurants, despite being briefly forced to \"serve beef that is not naturally raised\" during the summer of 2013, posting an in-store notice each time that occurred. Roberto Ferdman of The Washington Post opined that Chipotle's stated mission to sell \"food with integrity\" may be \"untenable\" if meat producers continue to breach Chipotle's ethical standards.\nAlso in 2015, Chipotle stopped using genetically modified corn and soybeans in their foods, claiming to be the first nationwide restaurant to cook completely GMO free. However, in 2019, Chipotle paid $6.5 million to settle a lawsuit where the plaintiffs claimed that the company's food \"may have been sourced from livestock that consumed GMO animal feed\".\nIn 2017, Chipotle committed to transitioning away from birds bred to maximize growth at the expense of animal well-being. However, in 2024, investigations by animal welfare groups showed that they were failing to meet these standards.\n\nFood safety\nSince 2008, a former Kansas State University food safety professor has accused Chipotle of confusing the public by using such terms as \"naturally raised meats\", \"organic ingredients\", and \"locally sourced\" and trying to equate those terms with food safety. In rebuttal, a Chipotle spokesperson told The Daily Beast that \"all of our practices have always been very much within industry norms. It's important to note that restaurant practices are regulated by health codes, and restaurants are routinely inspected by health officials. Everything we have done in our supply chain and in our restaurants has been within industry norms.\" Yet, FiveThirtyEight pointed out that the 2015 norovirus outbreak appears to be unusual and others are criticizing their food sourcing or handling practices. MarketWatch wrote that the result of all of these outbreaks will be to force Chipotle to obtain their produce from larger corporate farms that can afford the more extensive microbial food-safety testing programs and to process vegetables at centralized locations instead of at the individual stores, both of which are industry-standard practices that the company had previously criticized. The New York Times implied that the company's insistence on maintaining its long standing rhetoric about \"food integrity\" seemed to be quite opposite with the realities of recent current events and made it appear that the management was just ignoring their current problems. It also has been pointed out that Chipotle's current record-keeping system is actually hindering the health authorities' investigation in locating the sources of the various infections.\nA writer for the magazine Popular Science pointed out that Chipotle had publicly acknowledged that they \"may be at a higher risk for food-borne illness outbreaks than some competitors due to our use of fresh produce and meats rather than frozen, and our reliance on employees cooking with traditional methods rather than automation\". Other observers have argued that the variety of pathogens implicated in different incidents (Salmonella, E. coli, and norovirus) points towards a systemic problem, and that the use of manure to grow organic food can increase the risk of spreading bacteria like E. coli.\nIn December 2015, Seattle health officials closed a Seattle-area Chipotle for a day after it had repeatedly had small numbers of violations during recent consecutive inspections that previously would not have generated a closure order. On December 10, 2015, CEO Steve Ells released a press statement apologizing for 2015 outbreaks and promised changes to minimize the risks of future outbreaks.\n\nFood poisoning outbreaks\nMarch 2008 hepatitis\nIn March and April 2008, the Community Epidemiology Branch of the San Diego County Health and Human Services Agency traced a hepatitis A outbreak in San Diego County to a single Chipotle restaurant located in La Mesa, California, in which 22 customers were infected with the virus.\n\nApril 2008 norovirus\nIn 2008, Chipotle was implicated in a norovirus outbreak in Kent, Ohio, where over 400 people became ill after eating at a Chipotle restaurant. Officials at the Ohio Department of Health said that the outbreak was caused by Norovirus Genotype G2. Many of the victims were students at Kent State University. The initial source of the outbreak was never found.\n\nJuly 2015 E. coli\nIn early November 2015, The Oregonian reported that there was a little-known E. coli outbreak that had occurred earlier in July in which five people were infected with the O157:H7 strain of E. coli. The outbreak was traced to a single Chipotle location in Seattle and that the incident was not publicized at that time. Seattle public health officials defended their actions at that time by saying that the outbreak was over by the time they made an association with Chipotle. Health officials were unable to trace the source of the July outbreak and said that the cause of the July outbreak is unrelated to the October/November outbreak.\n\nAugust 2015 norovirus\nAnother norovirus outbreak was confirmed to have occurred in August 2015 at a Simi Valley, California, location in which 80 customers and 18 employees reported becoming ill. Ventura County health inspectors found various health violations during two inspections following the outbreak report. Despite those violations, the county health officials did not close the restaurant and allowed it to continue to operate. In a January 2016 article, The New York Times reported that the number of victims involved in the Simi Valley norovirus outbreak was actually 207, twice the number that was reported earlier.\nIn an unusual move, the U.S. Attorney's Office for the Central District of California in conjunction with the Food and Drug Administration had gotten a federal grand jury to issue a subpoena in January 2016 as part of a criminal investigation seeking documents and information from Chipotle concerning the Simi Valley norovirus outbreak. As of January 2016, it is too early to tell which organization is the actual target of the investigation. In most cases involving norovirus outbreaks that involved a single location, state and/or local authorities are the usual jurisdiction responsible in the investigation and prosecution of those type of cases.  However, Ventura County officials had been criticized for their handling of parts of their investigation, and for allowing the restaurant to continue to operate after finding health violations during consecutive inspections.\nLess than two weeks later, a federal class action lawsuit was filed in the U.S. District Court for the Central District of California claiming that Chipotle knowingly allowed an ill kitchen manager to work for two days before sending that person home. Then, the restaurant actively deep-cleaned the restaurant to remove all traces of contamination prior to notifying the Ventura County Environmental Health Division of the existing outbreak, hindering their investigation.  The lawsuit also claimed that the number of known victims was as high as 234 and estimates that the number of meals that the infected employee may have come in contact with could be as high 3,000.\n\nAugust 2015 Salmonella\nAt almost the same time as the Simi Valley norovirus outbreak, Minnesota health officials confirmed a Salmonella outbreak that affected 17 Minneapolis-area Chipotle restaurants in mid-August 2015. The source of the outbreak was traced back to contaminated tomatoes that were grown in Mexico. The Minnesota Department of Health reported that samples from 45 victims were tested and found that their illness was caused by the Salmonella Newport bacterium as determined by DNA profiling. Later, the state officials reported that the total of persons who became infected was increased to 64 and the number Chipotle locations in which they had acquired the bacterium was increased to 22, all located within the state of Minnesota.\n\nOctober 2015 E. coli\nIn October 2015, at least 22 people were reported to have gotten sick after eating at several different Chipotle locations in the states of Washington and Oregon. At that time, an epidemiologist for the Washington State Department of Health said the culprit appeared to be a Shiga toxin-producing Escherichia coli bacterium, but they were still waiting the outcome of several laboratory tests before they could give a definitive result. As a precaution, Chipotle had closed 43 stores in Washington and Oregon pending the results and recommendations of the involved health authorities. On November 5, the U.S. Centers for Disease Control and Prevention (CDC) had reported that the number of persons reported ill had risen to 40 known cases and that the bacteria samples taken from 7 infected persons in Washington and 3 persons in Oregon states were confirmed to be infected by the same strain of E. coli, the Shiga toxin-producing STEC O26 strain, as determined by DNA profiling. At least 12 persons required hospitalization, but there were no fatalities. As of November 2015, Health authorities were still trying to trace the exact source of the bacterial contamination, but suspected fresh produce.\nOn November 12, the CDC increased the number of known cases to 50, the number of persons requiring hospitalization to 14, and the number of DNA fingerprint confirmations to 33. Through a match via Pulsenet, the DNA fingerprint also matched a recent case in Minnesota, but the ill person did not eat at Chipotle. The source of the bacteria infection still had not yet been determined at the time of the report released by the CDC and the CDC is trying to use the more definitive, but more time-consuming whole genome sequencing procedure to see if they are able to determine the relationships between all of the STEC O26 cases. In the meantime, Chipotle reopened the closed restaurants on November 11 after disposing all of the food within the closed facilities and deep cleaning those facilities.\nOn November 20, the CDC reported that the number of STEC O26 cases, as determined by DNA fingerprinting, had increased to 45 with 16 persons requiring hospitalization and the total number states being affected had increased to six. Besides Oregon and Washington, new cases were reported in the states of Minnesota, California, New York, and Ohio. 43 out of 45 of the affected individuals had reported that they had eaten at a Chipotle in the week before they had become sick.\nOn December 4, the CDC reported that the number of STEC O26 cases, as determined by DNA fingerprinting, had increased to 52 with 20 persons requiring hospitalization and the total number states being affected had increased to nine. New cases were reported in the states of California (1), Illinois (1), Maryland (1), Ohio (2), Pennsylvania (1), and Washington (1).\nThe price of shares for Chipotle stock dropped a further 12% immediately after the CDC had issued their update on November 20. Share prices had been dropping since the initial announcement of the E. coli outbreak in late October with investors unsure if the drop in share prices just a temporary aberration and that Chipotle management is handling the incident as well as they could. Chipotle has since hired a consultant to improve their food safety program and have their program reviewed by both the CDC and FDA.\nOn February 1, 2016, the CDC official closed their investigations on the larger E. coli that started in Pacific Northwest in October 2015 and also the smaller outbreak that started in Kansas and Oklahoma in November since no new cases were reported since December 1. In their final report, the CDC stated that 55 persons in 11 states were infected with the same strain of STEC O26 during the major outbreak with 21 of those persons requiring hospitalization. The five persons infected in the later outbreak were made ill by a genetically different strain of STEC O26. The CDC also reported that federal and local health and food safety authorities were unable to detect traces of the microorganisms in any of the food samples taken from the suspected restaurants or from their supply chain. The CDC, FDA, and the USDA Food Safety and Inspection Service were unable to determine a point source that was in common in the meals that were consumed by all the victims since some of the restaurants were located far apart and had obtained some of their ingredients from different suppliers while other consumers of the suspected suppliers were not affected.\n\nNovember 2015 E. coli\nThe Centers for Disease Control and Prevention reported on December 21 that five more people became ill after eating at two Chipotle restaurants located in Kansas and Oklahoma in late November. Preliminary DNA fingerprinting results appear to indicated that the newer cases were caused by a different strain of Shiga toxin-producing E. coli O26. Scientists are waiting for the results of the more definitive whole genome sequencing analyses to determine if the organisms responsible for this outbreak are genetically related to the E. coli that are responsible for causing the outbreak that had started in Oregon and Washington in late October and thus an extension of that outbreak.  The agency has not yet determined which food is responsible for the outbreak. The Food and Drug Administration reported that they are trying to determine how the bacteria in these cases, along with the earlier Oregon, Washington, and other multi-state cases, might have been propagated through the food supply chain.\n\nDecember 2015 norovirus\nIn December 2015, 80 students at Boston College, including members of the men's basketball team, were sickened after eating at a single Chipotle restaurant. Affected students had been tested for both E. coli and norovirus in order to determine the cause of the illnesses. Although it would take as long as two days before the results of more definitive tests became known, public health investigators reported that preliminary tests pointed to the presence of norovirus. The health inspectors for the City of Boston had since closed this particular location on December 7 for a number of health violations that included maintaining meats at a too low of a temperature on the serving line and for allowing a sick employee to work at the time of the inspection.\nOn December 10, officials from the Boston Public Health Commission reported that tests had identified a single strain of norovirus that was responsible for this particular outbreak. Boston Globe reported on December 10 that 141 persons were reported to have gotten ill and that some of the newer victims had not visited Chipotle before contracting the virus and most likely became infected by being in close proximity to someone who had gotten ill at Chipotle, such as a roommate or dorm-mate. Boston authorities traced the cause of the outbreak to a sick employee who was allowed to work on the day of the outbreak. Chipotle has since fired the employee and also the manager who knowingly allowed the ill worker to complete his shift instead of following health codes.\nOn February 8, 2016, Chipotle closed all of its eateries nationwide for a few hours during the morning for an all-staff meeting on food safety. The company hired a new head of food safety, who instituted changes including having all employees wash hands every half hour, having two employees verify that produce like onions, jalapeños and avocados have been immersed in hot water for five seconds to kill germs on their exteriors, and using Pascalization to pre-treat food ingredients.\nSince the series of food-poisoning outbreaks in 2015 lowered trust in the product, Chipotle tried to recover its customers with free food and heavier advertising. Same-store sales increased 17.8% percent in the first quarter of 2017.\n\nJuly 2017 norovirus\nDespite corrective actions, the company faced another setback in implementing their safe food policies in July 2017.  A norovirus outbreak is being investigated in Virginia.  More than 130 people reported having norovirus-like symptoms and two individuals had tested positive for the virus after eating at a Chipotle restaurant in Sterling, Virginia.  The Loudoun County Health Department confirmed the illnesses from July 13–16, 2017.  Shares of Chipotle stock dropped more than 10% on this news. On July 25, several news agencies reported that Chipotle officials confirmed that the \"recent norovirus outbreak in Virginia was the result of lax sick policy enforcement by store managers\" and that the company believed that an employee was the cause of the outbreak.\n\nJuly 2018 Clostridium perfringens\nIn late July 2018, Ohio public health officials launched an investigation after receiving 350 complaints from customers after they had eaten at a Powell, Ohio, location. By mid-August, the U.S. Centers for Disease Control and Prevention identified the bacteria that cause the outbreak which had affected over 700 people as Clostridium perfringens. This food borne outbreak has been called the worst incident to date that can be traced to a single restaurant location.\n\nData breach\n2017\nIn April 2017, Chipotle first announced that their point of sale payment system was compromised during a three-week period from late March to mid-April but gave very little information about the incident. The following month, the company later revealed that 2,250 restaurants in 47 states were involved which could potentially affect hundreds of thousands of customers who may had their credit or debit card account information with security codes stolen. A few restaurants in Canada were also affected. Some security experts criticized the way Chipotle had downplayed the incident. During the same month, a credit union in New Hampshire filed a class action lawsuit on the behalf of banks and credit unions against Chipotle for failure to provide elementary credit card data security in the most recent data breach after a similar data breach that had occurred in 2004. In July 2017, Gainesville, Florida, police reported that an unidentified person took more than $17,000 from an ATM at a local credit union by stealing from 40 different accounts that can be traced directly to the data breach.\n\n2019\nA number of Chipotle mobile ordering app customers claimed that their mobile ordering app accounts had been hacked and reported fraudulent orders charged to their credit cards. Chipotle claimed that the customers were using unsecured passwords, and that any fraudulent orders were a result of this. The customers then argued that the passwords they were using were secure, and that their complaints involved an issue with the server.\n\nLawsuits\nIn November 2016, three men filed a class-action lawsuit against Chipotle alleging that a burrito was listed as containing only 300 calories, when in fact it contained more. They are seeking \"unspecified damages and for an injunction against the company to prevent it from posting what it calls misleading information on its food\".\nIn January 2020, the company was fined $1.3 million by the state of Massachusetts for 13,000 child labor violations.\n\nLabor issues and unionization\nIn May 2019, Chipotle was in the news for having dismissed a manager in St. Paul, Minnesota, who had been falsely accused of racism.\nIn December 2019, the office of the general counsel of the National Labor Relations Board (NLRB), Peter Robb, filed a complaint against Chipotle, accusing the company of firing a worker in New York City in retaliation for trying to organize a union, as well as alleging that a manager in Manhattan threatened to fire workers if they engaged in protected union activities, implying they could even face physical violence as a result.\nIn July 2022, Chipotle closed a store in Augusta, Maine, whose staff was trying to unionize, ostensibly due to staffing difficulties. In November 2022, the NLRB issued a complaint against Chipotle, accusing the company of illegally closing the Augusta store and blackballing the employees at the store in violation of the National Labor Relations Act.\nIn August 2022, a restaurant in Lansing, Michigan, became the chain's first location to vote to unionize with the International Brotherhood of Teamsters.\nAt multiple points in 2022, various outlets highlighted Chipotle as an example of a restaurant chain investing in robotics and automation via Chippy, an autonomous kitchen assistant made by Miso Robotics.\n\nAdvertising and publicity\nIn the past, Chipotle mainly relied on billboards, radio advertisements, and word of mouth to advertise. In 2010, the company initiated an ad campaign that mocks advice given to Chipotle by advertising agencies. In 2012, Chipotle aired its first nationally televised commercial during the 54th Annual Grammy Awards ceremony. Chipotle has run many promotions giving out free food to potential customers, especially when opening a new store. Stores also give out free burritos on certain holidays; for instance, on Halloween, some locations have had promotions in which free burritos are given to people who come dressed as a burrito.\nChipotle gave away free burritos to reporters during the 1997 trial of Timothy McVeigh, which took place in Chipotle's hometown of Denver. In addition, stores offered free burritos to those displaced by Hurricane Katrina. Chipotle received attention when Ozzy Osbourne's reality show The Osbournes featured the company's burritos heavily.\nFor Halloween 2010, Chipotle announced that customers dressed as a processed food product would receive a burrito for $2. The event was part of a $1 million fundraiser for Jamie Oliver's Food Revolution called \"Boorito 2010: The Horrors of Processed Food\". For \"Boorito 2011\", customers dressed in costumes \"inspired by family farms\" will receive a menu item for $2, with proceeds from the promotion going to The Chipotle Cultivate Foundation and Farm Aid. The promotion is aimed to increase awareness of family farms. Also in support of family farms, Chipotle released music videos of Karen O of the Yeah Yeah Yeahs and Willie Nelson.\nOn September 12, 2013, Chipotle released an animated short called The Scarecrow, with a companion mobile video game; both feature a narrative heavily critical of industrial farming, but little in the way of direct marketing for the chain. The short features a cover of \"Pure Imagination\" from Willy Wonka & the Chocolate Factory, sung by Fiona Apple.  It was named one of the worst advertisements of 2013 by The Wall Street Journal.\nIn 2011, Chipotle created the \"Farm Team\", which is a rewards program available only by invitation from restaurant managers. The Farm Team members have access to a special Chipotle website, where members can earn rewards, i.e. free food and T-shirts. The site offers members to, \"learn where Chipotle's food comes from, take quizzes and polls, play games and watch videos about the company\". In April 2014, the Farm Team program was shut down.\nChipotle sponsors Team Garmin-Barracuda (formerly Team Garmin-Chipotle, Team Garmin-Slipstream, Team Garmin-Transitions and Team Garmin-Cervélo) of the International Cycling Union,  and is an official team partner of the Boston Celtics, and the Boston Bruins. In June 2009, Chipotle sponsored free screenings of Food, Inc., a film that criticizes the corporate food industry. Founder Steve Ells stated that he hoped the film would make customers appreciate Chipotle's Food With Integrity policy. From May until September 2009, Chipotle ran a contest on mychipotle.com, a microsite which had a competition for the best user-created audio and video presentations about different combinations of ingredients. In July 2010, Chipotle began a campaign to support healthier lunch alternatives for students, in which money will be donated to The Lunch Box program based on how many spam Emails consumers forward to a company Email address.\nIn 2014, Chipotle collaborated on a viral marketing campaign with the rock band Spoon, in support of the band's album, They Want My Soul.\nFor Chipotle's 18th anniversary, the company began wrapping its burritos in gold foil as part of a larger promotion to draw attention to its Food With Integrity mantra. Also as part of the gold foil campaign, Chipotle is offering prizes for customer-created pictures of items wrapped in gold foil. Chipotle hired comedian Amy Sedaris to create a comedic how-to video on wrapping with gold foil, and spread the video using Twitter. In March 2013, Chipotle pulled its sponsorship of a Boy Scouts of America event, citing that organization's ban on LGBT members.\n\nOn March 14, 2016, a National Labor Relations Board (NLRB) administrative law judge concluded that Chipotle's social media policy, and more specifically its application towards an employee who posted tweets regarding wages and working conditions, violated the National Labor Relations Act (NLRA). A former Chipotle employee in Havertown, Pennsylvania, wrote a series of tweets from his personal account about hourly workers being required to work on snow days. Chipotle instructed the employee to delete the tweets. The NLRB judge determined that Chipotle's request to delete the tweets violated the NLRA even though the employee was not disciplined as a result of his tweets.\nIn July 2021, Chipotle rolled out limited edition gold foil at participating locations to celebrate American athletes competing in Tokyo at the 2020 Summer Olympics. On October 28, 2021, Chipotle announced $1 million of burritos to be given away for free for the first 30,000 people to play the Chipotle experience on the video game Roblox. The site ended up experiencing a three-day outage, but the company clarified that it was not the fault of Chipotle.\nOn February 16, 2023, MoneyGram Haas F1 Team announced a sponsorship deal with Chipotle. The Chipotle logo will be featured on both the nose and side of the VF-23, race-suits of drivers Kevin Magnussen and Nico Hulkenberg and team apparel.\n\nArchitecture\nArchitecturally, all Chipotle restaurants are built using most of the same material finishes (plywood, corrugated metal, stainless steel, exposed ductwork), although each store is unique. The interiors have been described as having an \"industrial, sheet metal look\". Chipotle has built restaurants using white ceramic tile instead of stainless steel. It costs the company approximately $850,000 to open a new restaurant. When the first Chipotle opened, Steve Ells asked his friend, sculptor Bruce Gueswel, to design the chairs and a styled Mayan king whose face was loosely based on that of civil rights movement leader Martin Luther King Jr., a personal inspiration of Gueswel, for the restaurant. Both items were made from wood and metal. Gueswel has continued to design and build the art and chairs for all subsequent Chipotle restaurants.\nMost Chipotle locations display a photograph of the original restaurant, which is near the University of Denver campus on Evans Avenue. Instead of a photograph of itself, the original location has a photograph of the Dolly Madison Ice Cream that previously occupied the location. In 2010, Chipotle began opening smaller concept locations that have lower costs of development and occupancy. Chipotle uses environmentally friendly packaging, with bowls made from recycled newsprint, unbleached tray liners, and napkins and cups made from postconsumer waste.\nChipotle's architectural design team incorporates the principles of sustainable architecture in their projects. The \"green\" restaurant in Gurnee, Illinois, features an on-site six kilowatt wind turbine, which generates about 10% of the restaurant's electrical needs. The Gurnee restaurant has received Platinum level LEED certification from U.S. Green Building Council. A restaurant in Tulsa, Oklahoma, uses recycled drywall, low-VOC paint, and energy-efficient appliances. A Chipotle restaurant in Austin, Texas, was the first to receive a four-star rating from the city's Green Building Program. Additionally, Chipotle has made arrangements to add solar panels to 75 of its restaurants. Chipotle has contracted to clean its stores in the New York metropolitan area, with \"plant-based, environmentally preferable cleaning supplies and technologies\". The cleansers are readily biodegradable and non-toxic to humans or aquatic life.\nChipotle was the defendant in a lawsuit for failure to comply with the Americans with Disabilities Act (ADA). Maurizio Antoninetti, a customer who used a wheelchair, claimed he was denied the \"Chipotle Experience\", because he was unable to see the food preparation. The case against the company was upheld in the United States Court of Appeals for the Ninth Circuit, and the Supreme Court of the United States declined to hear Chipotle's appeal, leaving the Ninth Circuit's ruling intact. Chipotle has \"an official disability policy of bringing ingredients to the tables of diners with disabilities and doing tableside preparation.\" Chipotle is retrofitting restaurants affected by the ruling, replacing the walls in front of the food preparation area with lower ones or transparent panels. They are incorporating the new design elements into new restaurants. The case was one of over twenty ADA-related lawsuits filed by Antoninetti, who died in 2011.\n\nOther restaurant units\nFormer units\n\nFarmesa was a restaurant concept launch by Chipotle in March 2023 that specialized in custom-made bowls. The first location opened in Santa Monica. After a year of operations, Chipotle abandoned the concept in April 2024.\n\nPizzeria Locale (2013–2023) was a fast casual pizza restaurant chain formed as a partnership with the original Pizzeria Locale, a single full-service pizza restaurant in Boulder, Colorado. The original Pizzeria Locale owners, Bobby Stuckey and Lachlan Mackinnon-Patterson, would continue to own their original location in Boulder while Chipotle would increase its stake in the chain over time. The first jointly owned location (with Chipotle) opened in Denver in May 2013. A second Denver location was opened in October 2014. The first location outside of Colorado was opened in Kansas City in July 2015. The first location in Cincinnati, the fourth in the chain, was opened in March 2016. By February 2017, the chain had grown to seven locations. In June 2018, Chipotle closed five Pizzeria Locale locations in Kansas City and Cincinnati, leaving two locations in Denver and one in Boulder still operating. In March 2019, Pizzeria Locale announced plans to open two additional locations within the Denver metropolitan area, one in Hale and the other in Stapleton. The planned Pizzeria Locale for Stapleton opened in December 2019, to make it the third location in operation. It was announced in February 2020 that the new Pizzeria Locale at the 9th and Colorado mixed-use development in Hale was expected to open later that year. The Hale restaurant finally opened in August 2020. In July 2023, Chipotle announced that they were closing all of their remaining Pizzeria Locale locations in Denver and would \"dissolve the business\". To distance themselves from the failed partnership, the owners of the original Pizzeria Locale restaurant in Boulder renamed their surviving restaurant Pizzeria Alberico around the same time.\n\nSoul Daddy (May–Jun 2011) was a soul food fast casual restaurant that was owned by ANGR Holdings, LLC, and was managed by Chipotle after purchasing Ells' stake in the company. The restaurant had three locations that had operated for less than 5 weeks in 2011 before closing.\nShopHouse Southeast Asian Kitchen (2011–2017) was an Asian fast-casual concept restaurant that was opened by Chipotle in September 2011. The company said that the new restaurant \"would follow the Chipotle service format and its focus on 'food with integrity' in ingredients\". Chipotle's plan was to start with only one store, and see how the restaurant works out before expanding the concept. By July 2016, the chain had 15 restaurants. All ShopHouse locations were closed on March 17, 2017.\nTasty Made (2016–2018) was a burger restaurant concept that Chipotle first opened in Lancaster, Ohio, in October 2016. On July 29, 2016, the company announced the opening of its first Tasty Made burger restaurant in the fall. The first location was revealed to be in Lancaster, Ohio. Ohio was selected as culinary manager Nate Appleman and national training director David Chrisman are both from the state and helped design the concept. Tasty Made was announced to have a focused menu like early burger restaurants which were limited to burgers, fries and milkshakes. Chipotle had trademarked Better Burger earlier in the year. Tasty Made was closed on February 28, 2018.\n\nReferences\nFurther reading\nBerfield, Susan (December 22, 2015). \"Inside Chipotle's Contamination Crisis: Smugness and happy talk about sustainability aren't working anymore\". Bloomberg Businessweek. Retrieved January 29, 2016.\n\nExternal links\n\nOfficial website\nBusiness data for Chipotle Mexican Grill, Inc.:",
  "clean_text": "Chipotle Mexican Grill, Inc. ( chih-POHT-lay), often known simply as Chipotle, is an American multinational chain of fast casual restaurants specializing in bowls, tacos, and Mission burritos made to order in front of the customer. As of June 30, 2025, Chipotle has over 3,800 restaurants. Its name derives from chipotle, the Nahuatl name (from chilpoctli) for a smoked and dried jalapeño chili pepper. Chipotle was one of the first chains of fast casual restaurants. It was founded by Steve Ells on July 13, 1993. Ells was the founder, chairman, and CEO of Chipotle. He was inspired to open the restaurant after visiting taquerias and burrito shops in San Francisco's Mission District while working as a chef. Ells wanted to show customers that fresh ingredients could be used to quickly serve food. Chipotle had 16 restaurants (all in Colorado) when McDonald's Corporation became a major investor in 1998. By the time McDonald's fully divested itself from Chipotle in 2006, the chain had grown to over 500 locations. With more than 2,000 locations, Chipotle had a net income of US$475.6 million and a staff of more than 45,000 employees in 2015. By 2025, Chipotle had restaurants in 48 states and the district of Columbia but not in the states of Alaska nor Hawaii, nor in the American overseas territories of Puerto Rico, Virgin Islands, American Samoa, or Guam. In May 2018, Chipotle announced the relocation of their corporate headquarters to Newport Beach, California, in Southern California, leaving Denver after 25 years. History Steve Ells attended the Culinary Institute of America in Hyde Park, New York. Afterward, he became a line cook for Jeremiah Tower at Stars in San Francisco. There, Ells observed the popularity of the taquerías and San Francisco burritos in the Mission District. In 1993, Ells took what he learned in San Francisco and opened the first Chipotle Mexican Grill in Denver, Colorado, in a former Dolly Madison Ice Cream store at 1644 East Evans Avenue, near the University of Denver campus, using an $85,000 loan from his father. Ells and his father calculated that the store would need to sell 107 burritos per day to be profitable. After one month, the original restaurant was selling over 1,000 burritos a day. The second store opened in 1995 using Chipotle's cash flow, and the third was opened using an SBA loan. To fund additional growth, Ells' father invested $1.5 million. Afterwards, Ells created a board of directors and business plan, raising an additional $1.8 million for the company. Ells had originally planned to use funds from the first Chipotle to open a fine-dining restaurant, but instead focused on Chipotle Mexican Grill when the restaurants saw success. In 1998, the first restaurant outside of Colorado opened in Kansas City, Missouri. In 1998, McDonald's made an initial minority investment in the company. By 2001, McDonald's had grown to be Chipotle's largest investor. The investment from McDonald's allowed the firm to quickly expand, from 16 restaurants in 1998 to over 500 by 2005. On January 26, 2006, Chipotle made its initial public offering (IPO) after increasing the share price twice due to high pre-IPO demand. At the time Chipotle had 500 stores. In its first day as a public company, the stock rose exactly 100%, resulting in the best U.S.-based IPO in six years, and the second-best IPO for a restaurant after Boston Market. The money from the offering was then used to fund new store growth. In March 2005, Monty Moran was appointed president and chief operating officer of Chipotle while Ells remained chairman and CEO. In October 2006, McDonald's fully divested from Chipotle. This was part of a larger initiative for McDonald's to divest all of its non-core business restaurants—Chipotle, Donatos Pizza, and Boston Market—so that it could focus on the main McDonald's chain. McDonald's had invested approximately $360 million into Chipotle, and took out $1.5 billion. McDonald's had attempted to get Chipotle to add drive-through windows and a breakfast menu, which Ells resisted. In 2008, Chipotle opened its first location outside of the United States in Toronto. In January 2009, president and chief operating officer Monty Moran was promoted to co-CEO, a position that he would share with Ells, while Moran retained his president position. In a list of fastest-growing restaurant chains in 2009, Chipotle was ranked eighth, based on increases in U.S. sales over the past year, and in 2010 Chipotle was ranked third. Consumer Reports ranked Chipotle as the best Mexican fast-food chain in 2011. The company serves approximately 750,000 customers per day. In December 2010, Chipotle hired chef Nate Appleman to develop new cuisine. Appleman has won Rising Star Chef from the James Beard Foundation, was named \"Best New Chef\" by the Food & Wine magazine, and competed on The Next Iron Chef. In 2010, U.S. Immigration and Customs Enforcement (ICE) audited Chipotle's Minneapolis restaurants, and found that some employees had been hired using fraudulent documents. In December, Chipotle fired 450 employees from its Minneapolis restaurants as a result of the audit, resulting in protests by local groups. In February 2011, ICE expanded the audit to include 60 restaurants in Virginia and Washington, D.C. which resulted in 40 workers being fired. In April 2011, the criminal division of the attorney general's office in Washington, D.C., joined the case, and ICE agents began interviewing employees at 20 to 25 restaurants in other locations, such as Los Angeles and Atlanta. In response to the government investigations, Chipotle hired former director of ICE Julie Myers Wood and high-profile attorneys Robert Luskin and Gregory B. Craig. In April 2014, Chipotle announced an increase in menu prices for the first time in nearly three years, due to increasing costs for steak, avocados, and cheese. The price increase was expected to be rolled out from the end of second quarter of 2014 through the end of the third quarter. In late 2015, Chipotle expanded its mobile strategy through delivery partnerships with tech startups like Tapingo, a delivery service that targets college campuses. In December 2016, Chipotle announced that co-CEO Monty Moran has stepped down from his role effective immediately with Ells becoming the sole CEO. Eleven months later, Ells announced in November 2017 that he would be stepping down as CEO. In December 2017, Chipotle announced it signed a 15-year lease and in late 2018 will move around 450 corporate employees—currently housed in multiple buildings around downtown Denver—into the new 1144 Fifteenth Tower and occupy around 126,000 square feet or 5 floors of the 40-story tower. In February 2018, Chipotle announced that Taco Bell CEO Brian Niccol would replace Ells as CEO starting on March 5 while Ells would retain his chairman position. Many industry analysts praised Niccol's appointment saying that Chipotle \"needed new blood\". Chipotle stock went up $30.27, or 12.04%, as a result of the announcement. However, other analysts criticized the announcement by saying that \"the move goes against everything the burrito chain stands for\". In May 2018, Chipotle announced that it would relocate headquarters from Denver to Newport Beach, California, in Southern California. Corporate functions handled in their Denver and New York offices would move to Newport Beach or to an existing office in Columbus, Ohio. This move would impact 400 workers, some being offered relocation and retention packages. In May 2018, Chipotle announced the \"Chipotlane\" and began testing it in the U.S.. The Chipotlane acts as a drive-thru, but it is for mobile order pickup only; customers are unable to order food at the handout window but are welcome to pick up their mobile orders through the Chipotlane or inside the restaurant. As of 2023, there are over 500+ locations which include the Chipotlane in order to make the restaurant run more efficiently. In June 2018, the company announced the closing of 65 under-performing restaurants. Ells broke all ties with the company in March 2020 by resigning as its chairman and departing from its board of directors. In January 2023, the company announced plans to hire 15,000 workers and expand to 7,000 locations, up from a previous goal of 6,000. This would double its footprint. At the time of the announcement, it had more than 100,000 employees. An article in The Wall Street Journal in July noted the chain would focus on opening 700–800 new locations in small towns and cities as part of its plan to expand by nearly 3,800 locations, in territory traditionally dominated by chains like McDonald's and Applebee's. In 2023 Chipotle saw $9.9 billion in revenue with 14.3% growth year on year and $3 million in average unit volumes (per restaurant revenue) and 7.9% growth in comparable sales; in 2023 37.4% of their revenue came via online orders, third-party delivery services or their new Chipotlanes. In September 2024, Chipotle announced it was collaborating with Vebu, a company that develops automation and robotics equipment for the food industry, on a new automated avocado processing machine, Autocado. The companies claimed that this machine could peel and cut an avocado in less than 30 seconds and operate unattended on a large batch, which could significantly reduce the time and labor required to prepare large quantities of guacamole. Chipotle's share price fell more than 9% after fiscal second quarter results showed same-store sales shrinking by 4%, compared to 0.4% in the prior quarter. In August 2025, Chipotle announced plans of delivering food via drone aircraft within the greater Dallas area through a partnership with Zipline. Expansion attempts into other types of cuisines In the 2010s, Ells tried to diversify the company by creating or acquiring several subsidiaries. These subsidiaries offered very different cuisines compared to their parent company. Examples include soul food (Soul Daddy), Asian cuisine (ShopHouse Southeast Asian Kitchen), pizza (Pizzeria Locale), and burgers (Tasty Made). In 2023, Chipotle had also tried incorporating California-inspired bowls into the Farmesa Fresh Eatery concept. The few test locations were not a financial success and all concepts were discontinued. In 2011, Steve Ells was a judge for the TV show America's Next Great Restaurant and investor of ANGR Holdings, the company that will be running the winning concept's restaurants. Chipotle has agreed to purchase Ells' investment in ANGR at his cost, provide support for ANGR operations, and invest a total of $2.3 million in cash contributions. The winning concept, Soul Daddy, was quickly closed after operating for 8 weeks. In September 2011, Chipotle opened an Asian fast-casual concept restaurant named ShopHouse Southeast Asian Kitchen in Washington, D.C. The company has said the new restaurant \"would follow the Chipotle service format and its focus on 'food with integrity' in ingredients\". Chipotle's plan was to start with only one store, and see how the restaurant works out before expanding the concept. On July 29, 2016, the company announced the opening of its first Tasty Made burger restaurant in the fall. The newer restaurant concepts did not perform as well as expected, so ShopHouse Southeast Asian Kitchen and Tasty Made were closed in March 2017 and February 2018 respectively, leaving only Pizzeria Locale operating besides the parent company. In February 2023, Chipotle opened their first Farmesa Fresh Eatery in Santa Monica, California, serving bowls containing customers' choice of a protein, a green or grain, two sides, a topping, and a selection of up to five sauces. Some of the choices included steak, salmon, whipped potatoes, sweet potato chips, beets, and cauliflower. In July 2023, Chipotle exited the highly competitive pizza restaurant industry by announcing that they were closing all of their remaining Pizzeria Locale locations and would \"dissolve the business\". Chipotle also abandoned Farmesa in April 2024. Corporate affairs Financial performance The key trends for Chipotle are (as of the financial year ending December 31): Ownership Chipotle is mainly owned by institutional investors, who hold around 89% of all shares. The 10 largest shareholders in late 2024 were: The Vanguard Group (8.97%) BlackRock (8.14%) State Street Corporation (4.26%) T. Rowe Price (3.92%) JPMorgan Chase (3.31%) Capital World Investors (2.93%) Fidelity Investments (2.49%) AllianceBernstein (2.23%) Geode Capital Management (2.11%) Pershing Square Capital Management (1.83%) Corporate management Chipotle's team includes a residing corporate office of managers and its board of directors. Members of both teams are appointed to serve on committees: audit, compensation, and nominating and corporate governance. By late 2016, the top management team consisted of the chief executive officer, Steve Ells; the chief financial officer, Jack R. Hartung; the chief marketing and development officer, Mark Crumpacker. At that time, the board of directors consists of: Ells, Patrick Flynn, Albert Baldocchi, Neil Flanzraich, Darlene Friedman, Stephen Gillet, Kimbal Musk and John Charlesworth. On March 14, 2018, it was reported that Mark Crumpacker, who had previously been charged in a 2016 cocaine ring indictment, would be leaving the company. Ells served as chairman of the company, and served as chief executive officer until November 2017. He had a 1.25% stake in the company in 2010. The labor-market research firm Glassdoor reported that Ells earned $29 million in 2014, versus a median of $19,000 for Chipotle's workers, making the CEO-to-worker pay ratio 1522:1. On February 13, 2018, Chipotle announced that Taco Bell CEO Brian Niccol would replace Ells as CEO starting on March 5 while Ells would retain his chairman position. On March 6, 2020, Ells resigned as chairman and left the board of directors, breaking his final ties to the company. At the same time, Niccol was appointed chairman and the size of the board was reduced from 10 to 7 directors. On August 13, 2024, Starbucks announced it was hiring Niccol as its next CEO. Chief Operating Officer Scott Boatwright was appointed by the board as interim CEO effective August 31, 2024. At the same board meeting, company director Scott Maw was named chairman of the board and retiring CFO Jack Hartung was named president. Four months later, Boatwright was named permanent CEO by the board in November 2024. Chipotle's key management as of May 2025 consists of: Scott Boatwright, Chief Executive Officer and Board member Adam Rymer, Chief Financial Officer Chris Brandt, Chief Brand Officer Curt Garner, Chief Customer and Technology Officer John R. Hartung, President and Chief Strategy Officer Laurie Schalow, Chief Corporate Affairs and Food Safety Officer Operation and distribution All of Chipotle's restaurants are company-owned, rather than franchised. As of December 2012, 1430 restaurants have since opened throughout the United States and Canada, with locations in 43 states, Ontario, British Columbia, and the District of Columbia. The field team are the employees who work closely with but not directly within specific restaurants. The field support system includes apprentice team leaders (step up from restaurateurs), team leaders or area managers, team directors and regional directors (not atypical for them to oversee more than fifty locations). Because Chipotle does not franchise, all restaurants are owned and operated directly by the corporation itself. Thus, whenever Chipotle is in the process of launching a new location, the field team hires a new general manager and trains them at a current location so that they will be ready for the new location when it opens for business. The corporate office takes care of finding and funding new locations as well. In July 2023, the company announced it was testing a robot developed to cut the time to prepare avocados for guacamole in half amid an ongoing labor shortage. It was one of multiple chains incorporating automation into its operations at the time. International Chipotle had 17 locations outside of the United States by October 2014 with the majority in Canada, and the UK was in the process of opening more locations. The rate of overseas expansion was slower than expected. Many of the press reviewers thought that the food was overpriced for their area. In July 2023, the company announced it would partner with the Kuwait-based Alshaya Group in its first-ever franchise deal to expand into the Middle East. In April 2025, Chipotle announced it had signed a joint venture with Alsea to open restaurants in Mexico by early 2026, and possibly in other areas in which Alsea operates in Latin America. In September 2025, Chipotle announced it signed a joint venture with SPC Group to open restaurants in Eastern Asia, with the first Chipotle restaurants opening in South Korea and Singapore in 2026. At the time of the announcement, Chipotle's existing international portfolio of restaurants included 60 locations in Canada, 20 in the United Kingdom, six in France, two in Germany, three in Kuwait and three in the UAE. North America Canada In August 2008, Chipotle opened its first location outside of the United States in Toronto, Canada. A second Toronto store opened in 2010. The first Canadian location outside Toronto opened in Vancouver in December 2012. Chipotle has six locations in the Vancouver-area, including Vancouver, West Vancouver, North Vancouver, Burnaby, Port Coquitlam, Langley and Surrey. In 2023, Chipotle announced that seventh store would open up in the Vancouver region. The first location in the country's Capital opened in February 2017 at the Rideau Centre. The first location in Alberta was opened in Calgary in October 2023. The first Chipotle restaurant in Edmonton opened in September 2024. Across Canada, there are 26 stores in Ontario, 16 in British Columbia, and 2 in Alberta. Europe United Kingdom Chipotle expanded to Europe with the first European restaurant opening in May 2010 in London. A second location opened in London in September 2011. The following year, three additional locations quickly opened in the London area. After this growth spurt, the rate of further expansion in London slowed greatly with the sixth location appearing in 2013 and the seventh in June 2015. Although Chipotle blames the slow growth in the United Kingdom on the British unfamiliarity with Mexican foods, several locally owned burrito chains had opened locations across the United Kingdom during the same interval. As of February 2024, there were 19 UK locations, of which 17 were in London. France The first location in France opened in Paris in May 2012. Expansion in France was much slower than that in the United Kingdom or Canada, with a second location in Paris opening in 2013 and a third location in 2014. At the time of its opening in 2014, the restaurant at La Défense was the largest Chipotle location in the world at 7,000 square feet (650 m2), while a typical Chipotle restaurant is usually between 2,200 square feet (200 m2) and 2,500 square feet (230 m2). A fourth Parisian location was opened in Levallois-Perret in 2015 followed by a fifth Parisian location in Saint-Germain-des-Prés in 2016. The company opened its seventh location in France and its first location outside the Paris region, inside Lyon's La Part-Dieu shopping mall in 2021. Germany The first location in Germany opened up in Frankfurt's Skyline Plaza shopping mall in August 2013. A second location opened in Frankfurt's MyZeil shopping mall in April 2019. Asia Kuwait Franchise partner Alshaya Group opened its first Chipotle restaurant in the city state of Kuwait inside The Avenues mall in April 2024. United Arab Emirates Franchise partner Alshaya Group opened its first Chipotle restaurant in the United Arab Emirates in Dubai at the Jumeirah Beach Residence in September 2024. Alshaya open its first location in Abu Dhabi at the Yas Mall, the third in the UAE, in August 2025. Qatar Franchise partner Alshaya Group opened its first Chipotle restaurant in Doha, the capital of the state of Qatar in September 2025 at the Villaggio Mall. Menu Chipotle's menu consists of five items: burritos, bowls, tacos, quesadillas, and salads. The price of each item is based on the choice of chicken, pork carnitas, barbacoa, steak, tofu-based \"sofritas\", or vegetarian (with guacamole or queso, which would be at an extra charge otherwise). Additional optional toppings are offered free of charge, including: rice, beans, four types of salsa, fajita vegetables, sour cream, cheese, and lettuce. Although Chipotle styles itself as a \"Mexican Grill\", its menu is more accurately characterized as Cal-Mex, a form of Mexican-American cuisine with its roots in California. When asked in 2007 about expanding the menu, Steve Ells said, \"[I]t's important to keep the menu focused, because if you just do a few things, you can ensure that you do them better than anybody else.\" Chipotle also offers a children's menu. Most restaurants sell beer and margaritas in addition to soft drinks and fruit drinks. The majority of food is prepared in each restaurant. Some exceptions are the beans and carnitas, which are prepared at a central kitchen in Chicago, Illinois. None of the restaurants have freezers, microwave ovens, or can openers. The chain experimented with breakfast foods at two airports in the Washington (D.C.) metropolitan area but decided against expanding the menu in that direction. Starting in 2009, selected restaurants had offered a pozole soup, which has since been discontinued. Starting in 2009, Chipotle tested a vegan chicken product (made by Gardein) called \"Garden Blend\" in various cities but discontinued it in 2010. In 2013, Chipotle began testing the tofu-based \"sofritas\" option (made by Hodo Soy) in Northern California restaurants; following its successful trial, it was rolled out nation-wide in 2014. In June 2015, Chipotle began test marketing a pork and chicken chorizo-type sausage as a new protein option at selected locations in the Kansas City area. Some food writers have expressed their health related concerns over the protein's relatively high sodium content since a 4-ounce (110 g) serving contains 293 calories and 803 milligrams of sodium while the American Heart Association's recommended daily amount is less than 1,500 milligrams of sodium. In contrast, the protein options with next highest sodium contents are Barbacoa with 530 milligrams and sofritas with 555 milligrams. An earlier version of the Mexican sausage was tested in Denver and New York City in 2011, but that test was terminated when that version of the sausage was perceived as looking too greasy. Chorizo was discontinued in September 2017 but was returned to the menu in the following year for a limited time. In July 2020, Chipotle began test marketing a cauliflower rice option at 55 locations in Colorado and Wisconsin. In August 2021, Chipotle began testing a company-made vegan chorizo made with pea protein. The vegan chorizo (now called plant-based chorizo) was subsequently released nation-wide as a limited-time only item on January 3, 2022, before being removed on March 4, 2022. Chipotle accepts fax orders, and in 2005 the company added the ability to order online from their website. For both online and fax orders, customers proceed to the front of the line to pay for pre-ordered food. In 2009, Chipotle released an app for the iPhone that allows users to find nearby Chipotle locations, place an order, and prepay with a credit card. In 2013, Chipotle released an Android app that allows users to locate nearby Chipotle locations, place an order, prepay with a credit or gift card, and access favorites and recent orders. In late 2021, the company added a non-food item to the menu—cilantro soap. According to published reports, the soap sold out the day after its release. The soap was produced after an August 2021 Instagram post of what was thought to be a mock photo of the product. It was an effort to engage fans and haters of the herb that, \"plays into a larger trend of turning digital moments into real life experiences,\" according to Chris Brandt, Chipotle's Chief Marketing Officer. Nutrition In 2003, a Center for Science in the Public Interest report stated that Chipotle's burritos contain over 1,000 calories, which is nearly equivalent to two meals' worth of food. MSNBC Health.com placed the burritos on their list of the \"20 Worst Foods in America\" because of their high caloric content and high sodium. When a burrito with carnitas, rice, vegetables, cheese, guacamole, and salsa was compared with a typical Big Mac, the burrito had more fat, cholesterol, carbohydrates, and sodium than the Big Mac, but it also had more protein and fiber. The restaurant has also received praise—Health.com included the restaurant in its list of the \"Healthiest Fast Food Restaurants\". Chipotle's vegetarian options include rice, black beans, fajita vegetables (onions and bell peppers), salsa, guacamole, queso and cheese. All items other than the meats, cheese, sour cream, queso and honey vinaigrette dressing are vegan. As of late 2013, Chipotle developed a new cooking strategy for the pinto beans, eliminating the bacon and making them vegetarian and vegan-friendly. The cheese is processed with vegetable-based rennet in order to be suitable for vegetarians. In April 2010, Chipotle began testing a vegan \"Garden Blend\" option, which is a plant-based meat alternative marinated in chipotle adobo, at six locations in the U.S. The flour tortillas used for the burritos and soft tacos are the only items that contain gluten. Portion size irregularities Some customers took to the social media platform TikTok accusing Chipotle of reducing portion sizes. In June 2024, a Wells Fargo analyst and his team set investigated the matter and ordered 75 identically configured items from 8 different Chipotle locations in New York City. The team weighed each bowl and reported that portion sizes varied widely, ranging from 14 to 27 ounces (400 to 770 g) with a median weight of 21.5 ounces (610 g). Food sourcing In 1999, while looking for ways to improve the taste of the carnitas, founder Steve Ells was prompted by an article written by Edward Behr to visit Concentrated Animal Feeding Operations (CAFOs). Ells found the CAFOs \"horrific\", and began sourcing from open-range pork suppliers. This caused an increase in both the price and the sales of the carnitas burritos. In 2001, Chipotle released a mission statement called Food With Integrity, which highlighted Chipotle's efforts to increase their use of naturally raised meat, organic produce, and dairy without added hormones. Ells testified before the United States Congress in support of the Preservation of Antibiotics for Medical Treatment Act, which was aimed to reduce the amount of antibiotics given to farm animals. From 2006 to 2012, the Coalition of Immokalee Workers (CIW), a Floridian farmworker organization, protested Chipotle's refusal to sign a Fair Food agreement, which would commit the restaurant chain to pay a penny-per-pound premium on its Florida tomatoes to boost tomato harvesters' wages, and to only buy Florida tomatoes from growers who comply with the Fair Food Code of Conduct. In 2009, the creators of the documentary film Food, Inc. (along with 31 other leaders in the sustainable food movement) signed an open letter of support for the CIW's campaign, stating that, \"If Chipotle is sincere in its wishes to reform its supply chain, the time has come to work with the Coalition of Immokalee Workers as a true partner in the protection of farmworkers rights.\" In September 2009, Chipotle announced that it would sidestep partnership with the CIW and instead work directly with East Coast Growers and Packers to increase wages for its tomato pickers. Ells framed the dispute as a fundamental issue of control, stating that, \"the CIW wants us to sign a contract that would let them control Chipotle's decisions regarding food in the future\". In October 2012, Chipotle signed an agreement with the CIW and became the 11th company to join the organization's Fair Food Program. In January 2015, Chipotle pulled carnitas from its menu in a third of its restaurants; company officials cited animal welfare problems at one of the suppliers, found during a regular audit, as the reason. Subsequently, a false rumor spread online claiming it was done to appease Muslims who consider pork to be unclean, leading to some protests on social media. The company still uses antibiotic-free and hormone-free steak in its restaurants, despite being briefly forced to \"serve beef that is not naturally raised\" during the summer of 2013, posting an in-store notice each time that occurred. Roberto Ferdman of The Washington Post opined that Chipotle's stated mission to sell \"food with integrity\" may be \"untenable\" if meat producers continue to breach Chipotle's ethical standards. Also in 2015, Chipotle stopped using genetically modified corn and soybeans in their foods, claiming to be the first nationwide restaurant to cook completely GMO free. However, in 2019, Chipotle paid $6.5 million to settle a lawsuit where the plaintiffs claimed that the company's food \"may have been sourced from livestock that consumed GMO animal feed\". In 2017, Chipotle committed to transitioning away from birds bred to maximize growth at the expense of animal well-being. However, in 2024, investigations by animal welfare groups showed that they were failing to meet these standards. Food safety Since 2008, a former Kansas State University food safety professor has accused Chipotle of confusing the public by using such terms as \"naturally raised meats\", \"organic ingredients\", and \"locally sourced\" and trying to equate those terms with food safety. In rebuttal, a Chipotle spokesperson told The Daily Beast that \"all of our practices have always been very much within industry norms. It's important to note that restaurant practices are regulated by health codes, and restaurants are routinely inspected by health officials. Everything we have done in our supply chain and in our restaurants has been within industry norms.\" Yet, FiveThirtyEight pointed out that the 2015 norovirus outbreak appears to be unusual and others are criticizing their food sourcing or handling practices. MarketWatch wrote that the result of all of these outbreaks will be to force Chipotle to obtain their produce from larger corporate farms that can afford the more extensive microbial food-safety testing programs and to process vegetables at centralized locations instead of at the individual stores, both of which are industry-standard practices that the company had previously criticized. The New York Times implied that the company's insistence on maintaining its long standing rhetoric about \"food integrity\" seemed to be quite opposite with the realities of recent current events and made it appear that the management was just ignoring their current problems. It also has been pointed out that Chipotle's current record-keeping system is actually hindering the health authorities' investigation in locating the sources of the various infections. A writer for the magazine Popular Science pointed out that Chipotle had publicly acknowledged that they \"may be at a higher risk for food-borne illness outbreaks than some competitors due to our use of fresh produce and meats rather than frozen, and our reliance on employees cooking with traditional methods rather than automation\". Other observers have argued that the variety of pathogens implicated in different incidents (Salmonella, E. coli, and norovirus) points towards a systemic problem, and that the use of manure to grow organic food can increase the risk of spreading bacteria like E. coli. In December 2015, Seattle health officials closed a Seattle-area Chipotle for a day after it had repeatedly had small numbers of violations during recent consecutive inspections that previously would not have generated a closure order. On December 10, 2015, CEO Steve Ells released a press statement apologizing for 2015 outbreaks and promised changes to minimize the risks of future outbreaks. Food poisoning outbreaks March 2008 hepatitis In March and April 2008, the Community Epidemiology Branch of the San Diego County Health and Human Services Agency traced a hepatitis A outbreak in San Diego County to a single Chipotle restaurant located in La Mesa, California, in which 22 customers were infected with the virus. April 2008 norovirus In 2008, Chipotle was implicated in a norovirus outbreak in Kent, Ohio, where over 400 people became ill after eating at a Chipotle restaurant. Officials at the Ohio Department of Health said that the outbreak was caused by Norovirus Genotype G2. Many of the victims were students at Kent State University. The initial source of the outbreak was never found. July 2015 E. coli In early November 2015, The Oregonian reported that there was a little-known E. coli outbreak that had occurred earlier in July in which five people were infected with the O157:H7 strain of E. coli. The outbreak was traced to a single Chipotle location in Seattle and that the incident was not publicized at that time. Seattle public health officials defended their actions at that time by saying that the outbreak was over by the time they made an association with Chipotle. Health officials were unable to trace the source of the July outbreak and said that the cause of the July outbreak is unrelated to the October/November outbreak. August 2015 norovirus Another norovirus outbreak was confirmed to have occurred in August 2015 at a Simi Valley, California, location in which 80 customers and 18 employees reported becoming ill. Ventura County health inspectors found various health violations during two inspections following the outbreak report. Despite those violations, the county health officials did not close the restaurant and allowed it to continue to operate. In a January 2016 article, The New York Times reported that the number of victims involved in the Simi Valley norovirus outbreak was actually 207, twice the number that was reported earlier. In an unusual move, the U.S. Attorney's Office for the Central District of California in conjunction with the Food and Drug Administration had gotten a federal grand jury to issue a subpoena in January 2016 as part of a criminal investigation seeking documents and information from Chipotle concerning the Simi Valley norovirus outbreak. As of January 2016, it is too early to tell which organization is the actual target of the investigation. In most cases involving norovirus outbreaks that involved a single location, state and/or local authorities are the usual jurisdiction responsible in the investigation and prosecution of those type of cases. However, Ventura County officials had been criticized for their handling of parts of their investigation, and for allowing the restaurant to continue to operate after finding health violations during consecutive inspections. Less than two weeks later, a federal class action lawsuit was filed in the U.S. District Court for the Central District of California claiming that Chipotle knowingly allowed an ill kitchen manager to work for two days before sending that person home. Then, the restaurant actively deep-cleaned the restaurant to remove all traces of contamination prior to notifying the Ventura County Environmental Health Division of the existing outbreak, hindering their investigation. The lawsuit also claimed that the number of known victims was as high as 234 and estimates that the number of meals that the infected employee may have come in contact with could be as high 3,000. August 2015 Salmonella At almost the same time as the Simi Valley norovirus outbreak, Minnesota health officials confirmed a Salmonella outbreak that affected 17 Minneapolis-area Chipotle restaurants in mid-August 2015. The source of the outbreak was traced back to contaminated tomatoes that were grown in Mexico. The Minnesota Department of Health reported that samples from 45 victims were tested and found that their illness was caused by the Salmonella Newport bacterium as determined by DNA profiling. Later, the state officials reported that the total of persons who became infected was increased to 64 and the number Chipotle locations in which they had acquired the bacterium was increased to 22, all located within the state of Minnesota. October 2015 E. coli In October 2015, at least 22 people were reported to have gotten sick after eating at several different Chipotle locations in the states of Washington and Oregon. At that time, an epidemiologist for the Washington State Department of Health said the culprit appeared to be a Shiga toxin-producing Escherichia coli bacterium, but they were still waiting the outcome of several laboratory tests before they could give a definitive result. As a precaution, Chipotle had closed 43 stores in Washington and Oregon pending the results and recommendations of the involved health authorities. On November 5, the U.S. Centers for Disease Control and Prevention (CDC) had reported that the number of persons reported ill had risen to 40 known cases and that the bacteria samples taken from 7 infected persons in Washington and 3 persons in Oregon states were confirmed to be infected by the same strain of E. coli, the Shiga toxin-producing STEC O26 strain, as determined by DNA profiling. At least 12 persons required hospitalization, but there were no fatalities. As of November 2015, Health authorities were still trying to trace the exact source of the bacterial contamination, but suspected fresh produce. On November 12, the CDC increased the number of known cases to 50, the number of persons requiring hospitalization to 14, and the number of DNA fingerprint confirmations to 33. Through a match via Pulsenet, the DNA fingerprint also matched a recent case in Minnesota, but the ill person did not eat at Chipotle. The source of the bacteria infection still had not yet been determined at the time of the report released by the CDC and the CDC is trying to use the more definitive, but more time-consuming whole genome sequencing procedure to see if they are able to determine the relationships between all of the STEC O26 cases. In the meantime, Chipotle reopened the closed restaurants on November 11 after disposing all of the food within the closed facilities and deep cleaning those facilities. On November 20, the CDC reported that the number of STEC O26 cases, as determined by DNA fingerprinting, had increased to 45 with 16 persons requiring hospitalization and the total number states being affected had increased to six. Besides Oregon and Washington, new cases were reported in the states of Minnesota, California, New York, and Ohio. 43 out of 45 of the affected individuals had reported that they had eaten at a Chipotle in the week before they had become sick. On December 4, the CDC reported that the number of STEC O26 cases, as determined by DNA fingerprinting, had increased to 52 with 20 persons requiring hospitalization and the total number states being affected had increased to nine. New cases were reported in the states of California (1), Illinois (1), Maryland (1), Ohio (2), Pennsylvania (1), and Washington (1). The price of shares for Chipotle stock dropped a further 12% immediately after the CDC had issued their update on November 20. Share prices had been dropping since the initial announcement of the E. coli outbreak in late October with investors unsure if the drop in share prices just a temporary aberration and that Chipotle management is handling the incident as well as they could. Chipotle has since hired a consultant to improve their food safety program and have their program reviewed by both the CDC and FDA. On February 1, 2016, the CDC official closed their investigations on the larger E. coli that started in Pacific Northwest in October 2015 and also the smaller outbreak that started in Kansas and Oklahoma in November since no new cases were reported since December 1. In their final report, the CDC stated that 55 persons in 11 states were infected with the same strain of STEC O26 during the major outbreak with 21 of those persons requiring hospitalization. The five persons infected in the later outbreak were made ill by a genetically different strain of STEC O26. The CDC also reported that federal and local health and food safety authorities were unable to detect traces of the microorganisms in any of the food samples taken from the suspected restaurants or from their supply chain. The CDC, FDA, and the USDA Food Safety and Inspection Service were unable to determine a point source that was in common in the meals that were consumed by all the victims since some of the restaurants were located far apart and had obtained some of their ingredients from different suppliers while other consumers of the suspected suppliers were not affected. November 2015 E. coli The Centers for Disease Control and Prevention reported on December 21 that five more people became ill after eating at two Chipotle restaurants located in Kansas and Oklahoma in late November. Preliminary DNA fingerprinting results appear to indicated that the newer cases were caused by a different strain of Shiga toxin-producing E. coli O26. Scientists are waiting for the results of the more definitive whole genome sequencing analyses to determine if the organisms responsible for this outbreak are genetically related to the E. coli that are responsible for causing the outbreak that had started in Oregon and Washington in late October and thus an extension of that outbreak. The agency has not yet determined which food is responsible for the outbreak. The Food and Drug Administration reported that they are trying to determine how the bacteria in these cases, along with the earlier Oregon, Washington, and other multi-state cases, might have been propagated through the food supply chain. December 2015 norovirus In December 2015, 80 students at Boston College, including members of the men's basketball team, were sickened after eating at a single Chipotle restaurant. Affected students had been tested for both E. coli and norovirus in order to determine the cause of the illnesses. Although it would take as long as two days before the results of more definitive tests became known, public health investigators reported that preliminary tests pointed to the presence of norovirus. The health inspectors for the City of Boston had since closed this particular location on December 7 for a number of health violations that included maintaining meats at a too low of a temperature on the serving line and for allowing a sick employee to work at the time of the inspection. On December 10, officials from the Boston Public Health Commission reported that tests had identified a single strain of norovirus that was responsible for this particular outbreak. Boston Globe reported on December 10 that 141 persons were reported to have gotten ill and that some of the newer victims had not visited Chipotle before contracting the virus and most likely became infected by being in close proximity to someone who had gotten ill at Chipotle, such as a roommate or dorm-mate. Boston authorities traced the cause of the outbreak to a sick employee who was allowed to work on the day of the outbreak. Chipotle has since fired the employee and also the manager who knowingly allowed the ill worker to complete his shift instead of following health codes. On February 8, 2016, Chipotle closed all of its eateries nationwide for a few hours during the morning for an all-staff meeting on food safety. The company hired a new head of food safety, who instituted changes including having all employees wash hands every half hour, having two employees verify that produce like onions, jalapeños and avocados have been immersed in hot water for five seconds to kill germs on their exteriors, and using Pascalization to pre-treat food ingredients. Since the series of food-poisoning outbreaks in 2015 lowered trust in the product, Chipotle tried to recover its customers with free food and heavier advertising. Same-store sales increased 17.8% percent in the first quarter of 2017. July 2017 norovirus Despite corrective actions, the company faced another setback in implementing their safe food policies in July 2017. A norovirus outbreak is being investigated in Virginia. More than 130 people reported having norovirus-like symptoms and two individuals had tested positive for the virus after eating at a Chipotle restaurant in Sterling, Virginia. The Loudoun County Health Department confirmed the illnesses from July 13–16, 2017. Shares of Chipotle stock dropped more than 10% on this news. On July 25, several news agencies reported that Chipotle officials confirmed that the \"recent norovirus outbreak in Virginia was the result of lax sick policy enforcement by store managers\" and that the company believed that an employee was the cause of the outbreak. July 2018 Clostridium perfringens In late July 2018, Ohio public health officials launched an investigation after receiving 350 complaints from customers after they had eaten at a Powell, Ohio, location. By mid-August, the U.S. Centers for Disease Control and Prevention identified the bacteria that cause the outbreak which had affected over 700 people as Clostridium perfringens. This food borne outbreak has been called the worst incident to date that can be traced to a single restaurant location. Data breach 2017 In April 2017, Chipotle first announced that their point of sale payment system was compromised during a three-week period from late March to mid-April but gave very little information about the incident. The following month, the company later revealed that 2,250 restaurants in 47 states were involved which could potentially affect hundreds of thousands of customers who may had their credit or debit card account information with security codes stolen. A few restaurants in Canada were also affected. Some security experts criticized the way Chipotle had downplayed the incident. During the same month, a credit union in New Hampshire filed a class action lawsuit on the behalf of banks and credit unions against Chipotle for failure to provide elementary credit card data security in the most recent data breach after a similar data breach that had occurred in 2004. In July 2017, Gainesville, Florida, police reported that an unidentified person took more than $17,000 from an ATM at a local credit union by stealing from 40 different accounts that can be traced directly to the data breach. 2019 A number of Chipotle mobile ordering app customers claimed that their mobile ordering app accounts had been hacked and reported fraudulent orders charged to their credit cards. Chipotle claimed that the customers were using unsecured passwords, and that any fraudulent orders were a result of this. The customers then argued that the passwords they were using were secure, and that their complaints involved an issue with the server. Lawsuits In November 2016, three men filed a class-action lawsuit against Chipotle alleging that a burrito was listed as containing only 300 calories, when in fact it contained more. They are seeking \"unspecified damages and for an injunction against the company to prevent it from posting what it calls misleading information on its food\". In January 2020, the company was fined $1.3 million by the state of Massachusetts for 13,000 child labor violations. Labor issues and unionization In May 2019, Chipotle was in the news for having dismissed a manager in St. Paul, Minnesota, who had been falsely accused of racism. In December 2019, the office of the general counsel of the National Labor Relations Board (NLRB), Peter Robb, filed a complaint against Chipotle, accusing the company of firing a worker in New York City in retaliation for trying to organize a union, as well as alleging that a manager in Manhattan threatened to fire workers if they engaged in protected union activities, implying they could even face physical violence as a result. In July 2022, Chipotle closed a store in Augusta, Maine, whose staff was trying to unionize, ostensibly due to staffing difficulties. In November 2022, the NLRB issued a complaint against Chipotle, accusing the company of illegally closing the Augusta store and blackballing the employees at the store in violation of the National Labor Relations Act. In August 2022, a restaurant in Lansing, Michigan, became the chain's first location to vote to unionize with the International Brotherhood of Teamsters. At multiple points in 2022, various outlets highlighted Chipotle as an example of a restaurant chain investing in robotics and automation via Chippy, an autonomous kitchen assistant made by Miso Robotics. Advertising and publicity In the past, Chipotle mainly relied on billboards, radio advertisements, and word of mouth to advertise. In 2010, the company initiated an ad campaign that mocks advice given to Chipotle by advertising agencies. In 2012, Chipotle aired its first nationally televised commercial during the 54th Annual Grammy Awards ceremony. Chipotle has run many promotions giving out free food to potential customers, especially when opening a new store. Stores also give out free burritos on certain holidays; for instance, on Halloween, some locations have had promotions in which free burritos are given to people who come dressed as a burrito. Chipotle gave away free burritos to reporters during the 1997 trial of Timothy McVeigh, which took place in Chipotle's hometown of Denver. In addition, stores offered free burritos to those displaced by Hurricane Katrina. Chipotle received attention when Ozzy Osbourne's reality show The Osbournes featured the company's burritos heavily. For Halloween 2010, Chipotle announced that customers dressed as a processed food product would receive a burrito for $2. The event was part of a $1 million fundraiser for Jamie Oliver's Food Revolution called \"Boorito 2010: The Horrors of Processed Food\". For \"Boorito 2011\", customers dressed in costumes \"inspired by family farms\" will receive a menu item for $2, with proceeds from the promotion going to The Chipotle Cultivate Foundation and Farm Aid. The promotion is aimed to increase awareness of family farms. Also in support of family farms, Chipotle released music videos of Karen O of the Yeah Yeah Yeahs and Willie Nelson. On September 12, 2013, Chipotle released an animated short called The Scarecrow, with a companion mobile video game; both feature a narrative heavily critical of industrial farming, but little in the way of direct marketing for the chain. The short features a cover of \"Pure Imagination\" from Willy Wonka & the Chocolate Factory, sung by Fiona Apple. It was named one of the worst advertisements of 2013 by The Wall Street Journal. In 2011, Chipotle created the \"Farm Team\", which is a rewards program available only by invitation from restaurant managers. The Farm Team members have access to a special Chipotle website, where members can earn rewards, i.e. free food and T-shirts. The site offers members to, \"learn where Chipotle's food comes from, take quizzes and polls, play games and watch videos about the company\". In April 2014, the Farm Team program was shut down. Chipotle sponsors Team Garmin-Barracuda (formerly Team Garmin-Chipotle, Team Garmin-Slipstream, Team Garmin-Transitions and Team Garmin-Cervélo) of the International Cycling Union, and is an official team partner of the Boston Celtics, and the Boston Bruins. In June 2009, Chipotle sponsored free screenings of Food, Inc., a film that criticizes the corporate food industry. Founder Steve Ells stated that he hoped the film would make customers appreciate Chipotle's Food With Integrity policy. From May until September 2009, Chipotle ran a contest on mychipotle.com, a microsite which had a competition for the best user-created audio and video presentations about different combinations of ingredients. In July 2010, Chipotle began a campaign to support healthier lunch alternatives for students, in which money will be donated to The Lunch Box program based on how many spam Emails consumers forward to a company Email address. In 2014, Chipotle collaborated on a viral marketing campaign with the rock band Spoon, in support of the band's album, They Want My Soul. For Chipotle's 18th anniversary, the company began wrapping its burritos in gold foil as part of a larger promotion to draw attention to its Food With Integrity mantra. Also as part of the gold foil campaign, Chipotle is offering prizes for customer-created pictures of items wrapped in gold foil. Chipotle hired comedian Amy Sedaris to create a comedic how-to video on wrapping with gold foil, and spread the video using Twitter. In March 2013, Chipotle pulled its sponsorship of a Boy Scouts of America event, citing that organization's ban on LGBT members. On March 14, 2016, a National Labor Relations Board (NLRB) administrative law judge concluded that Chipotle's social media policy, and more specifically its application towards an employee who posted tweets regarding wages and working conditions, violated the National Labor Relations Act (NLRA). A former Chipotle employee in Havertown, Pennsylvania, wrote a series of tweets from his personal account about hourly workers being required to work on snow days. Chipotle instructed the employee to delete the tweets. The NLRB judge determined that Chipotle's request to delete the tweets violated the NLRA even though the employee was not disciplined as a result of his tweets. In July 2021, Chipotle rolled out limited edition gold foil at participating locations to celebrate American athletes competing in Tokyo at the 2020 Summer Olympics. On October 28, 2021, Chipotle announced $1 million of burritos to be given away for free for the first 30,000 people to play the Chipotle experience on the video game Roblox. The site ended up experiencing a three-day outage, but the company clarified that it was not the fault of Chipotle. On February 16, 2023, MoneyGram Haas F1 Team announced a sponsorship deal with Chipotle. The Chipotle logo will be featured on both the nose and side of the VF-23, race-suits of drivers Kevin Magnussen and Nico Hulkenberg and team apparel. Architecture Architecturally, all Chipotle restaurants are built using most of the same material finishes (plywood, corrugated metal, stainless steel, exposed ductwork), although each store is unique. The interiors have been described as having an \"industrial, sheet metal look\". Chipotle has built restaurants using white ceramic tile instead of stainless steel. It costs the company approximately $850,000 to open a new restaurant. When the first Chipotle opened, Steve Ells asked his friend, sculptor Bruce Gueswel, to design the chairs and a styled Mayan king whose face was loosely based on that of civil rights movement leader Martin Luther King Jr., a personal inspiration of Gueswel, for the restaurant. Both items were made from wood and metal. Gueswel has continued to design and build the art and chairs for all subsequent Chipotle restaurants. Most Chipotle locations display a photograph of the original restaurant, which is near the University of Denver campus on Evans Avenue. Instead of a photograph of itself, the original location has a photograph of the Dolly Madison Ice Cream that previously occupied the location. In 2010, Chipotle began opening smaller concept locations that have lower costs of development and occupancy. Chipotle uses environmentally friendly packaging, with bowls made from recycled newsprint, unbleached tray liners, and napkins and cups made from postconsumer waste. Chipotle's architectural design team incorporates the principles of sustainable architecture in their projects. The \"green\" restaurant in Gurnee, Illinois, features an on-site six kilowatt wind turbine, which generates about 10% of the restaurant's electrical needs. The Gurnee restaurant has received Platinum level LEED certification from U.S. Green Building Council. A restaurant in Tulsa, Oklahoma, uses recycled drywall, low-VOC paint, and energy-efficient appliances. A Chipotle restaurant in Austin, Texas, was the first to receive a four-star rating from the city's Green Building Program. Additionally, Chipotle has made arrangements to add solar panels to 75 of its restaurants. Chipotle has contracted to clean its stores in the New York metropolitan area, with \"plant-based, environmentally preferable cleaning supplies and technologies\". The cleansers are readily biodegradable and non-toxic to humans or aquatic life. Chipotle was the defendant in a lawsuit for failure to comply with the Americans with Disabilities Act (ADA). Maurizio Antoninetti, a customer who used a wheelchair, claimed he was denied the \"Chipotle Experience\", because he was unable to see the food preparation. The case against the company was upheld in the United States Court of Appeals for the Ninth Circuit, and the Supreme Court of the United States declined to hear Chipotle's appeal, leaving the Ninth Circuit's ruling intact. Chipotle has \"an official disability policy of bringing ingredients to the tables of diners with disabilities and doing tableside preparation.\" Chipotle is retrofitting restaurants affected by the ruling, replacing the walls in front of the food preparation area with lower ones or transparent panels. They are incorporating the new design elements into new restaurants. The case was one of over twenty ADA-related lawsuits filed by Antoninetti, who died in 2011. Other restaurant units Former units Farmesa was a restaurant concept launch by Chipotle in March 2023 that specialized in custom-made bowls. The first location opened in Santa Monica. After a year of operations, Chipotle abandoned the concept in April 2024. Pizzeria Locale (2013–2023) was a fast casual pizza restaurant chain formed as a partnership with the original Pizzeria Locale, a single full-service pizza restaurant in Boulder, Colorado. The original Pizzeria Locale owners, Bobby Stuckey and Lachlan Mackinnon-Patterson, would continue to own their original location in Boulder while Chipotle would increase its stake in the chain over time. The first jointly owned location (with Chipotle) opened in Denver in May 2013. A second Denver location was opened in October 2014. The first location outside of Colorado was opened in Kansas City in July 2015. The first location in Cincinnati, the fourth in the chain, was opened in March 2016. By February 2017, the chain had grown to seven locations. In June 2018, Chipotle closed five Pizzeria Locale locations in Kansas City and Cincinnati, leaving two locations in Denver and one in Boulder still operating. In March 2019, Pizzeria Locale announced plans to open two additional locations within the Denver metropolitan area, one in Hale and the other in Stapleton. The planned Pizzeria Locale for Stapleton opened in December 2019, to make it the third location in operation. It was announced in February 2020 that the new Pizzeria Locale at the 9th and Colorado mixed-use development in Hale was expected to open later that year. The Hale restaurant finally opened in August 2020. In July 2023, Chipotle announced that they were closing all of their remaining Pizzeria Locale locations in Denver and would \"dissolve the business\". To distance themselves from the failed partnership, the owners of the original Pizzeria Locale restaurant in Boulder renamed their surviving restaurant Pizzeria Alberico around the same time. Soul Daddy (May–Jun 2011) was a soul food fast casual restaurant that was owned by ANGR Holdings, LLC, and was managed by Chipotle after purchasing Ells' stake in the company. The restaurant had three locations that had operated for less than 5 weeks in 2011 before closing. ShopHouse Southeast Asian Kitchen (2011–2017) was an Asian fast-casual concept restaurant that was opened by Chipotle in September 2011. The company said that the new restaurant \"would follow the Chipotle service format and its focus on 'food with integrity' in ingredients\". Chipotle's plan was to start with only one store, and see how the restaurant works out before expanding the concept. By July 2016, the chain had 15 restaurants. All ShopHouse locations were closed on March 17, 2017. Tasty Made (2016–2018) was a burger restaurant concept that Chipotle first opened in Lancaster, Ohio, in October 2016. On July 29, 2016, the company announced the opening of its first Tasty Made burger restaurant in the fall. The first location was revealed to be in Lancaster, Ohio. Ohio was selected as culinary manager Nate Appleman and national training director David Chrisman are both from the state and helped design the concept. Tasty Made was announced to have a focused menu like early burger restaurants which were limited to burgers, fries and milkshakes. Chipotle had trademarked Better Burger earlier in the year. Tasty Made was closed on February 28, 2018."
}