{
  "ticker": "CMI",
  "cik": "0000026172",
  "company_name": "Cummins",
  "corrected_name": "Cummins",
  "wiki_title_used": "Cummins",
  "exists": true,
  "raw_text": "Cummins Inc. is an American multinational corporation that designs, manufactures, and distributes diesel engines, electric vehicle components, and power generation products. Cummins also services engines and related equipment, including fuel systems, air handling systems controls, filtration, emission control, electrical power generation systems, and engine control units.\nHeadquartered in Columbus, Indiana, Cummins sells in approximately 190 countries and territories through a network of more than 600 company-owned and independent distributors and approximately 7,200 dealers.\n\nHistory\nThe Cummins Engine Company was founded in Columbus, Indiana on February 3, 1919, by mechanic Clessie Cummins and banker William Glanton Irwin. The company focused on developing the diesel engine, which was invented 20 years earlier. Despite several well-publicized endurance trials, it was not until 1933 that their Model H engine, used in small railroad switchers, proved successful. The Cummins N Series engines became the industry leader in the post-World War II road-building boom in the United States, with more than half of the heavy-duty truck market using Cummins engines from 1952 to 1959. In the 1960s, the company opened an assembly plant in Shotts, Scotland (closed in 1996). By 2013, Cummins had operations in 197 countries and territories.\n\nBusiness units\nCummins Components Business\nCummins Component Business Unit consists of emission solutions, filtration (Fleetguard), fuel systems, turbo technologies (Holset), and electronics. The Cummins Turbo Technologies unit designs and manufactures turbochargers and related products on a global scale, for diesel engines above 3 liters. Its Emission Solutions unit develops and supplies catalytic exhaust systems and associated products to the medium and heavy-duty commercial diesel engine markets. Cummins Filtration designs, manufactures and distributes heavy-duty and light-duty air, fuel, hydraulic and lube filtration, chemicals and exhaust system technology products for diesel and gas-powered equipment. In contrast Cummins Electronics designs engine control units and sensors for Cummins diesel engines.\n\nCummins Engine Business\nCummins Engine Business Unit consists of aftermarket support, mid-range, heavy-duty, and high-power engines. Its markets include heavy and medium-duty trucks, buses, recreational vehicles (RV), light-duty automotive, and several industrial uses, including construction, mining, marine, oil, gas, railroad and military equipment.\nOne of the most popular engines built is the 5.9-liter I6 engine used in the Dodge Ram heavy-duty pickups starting in 1988. In 2007, a 6.7-liter version of the Cummins straight-six engine became optional on the RAM pickup. In 2008, Cummins was a named defendant in a class-action suit related to 1998-2001 model year Dodge Ram trucks, model 2500 or 3500, originally equipped with a Cummins ISB 5.9 liter diesel engine built using a pattern 53 Block. The case has been settled, but some qualified Chrysler owners may receive $500 for repairs to the block, which was alleged to crack and create a coolant leak.\nIn April 2013, Cummins utilized technology developed by Westport Innovations to ship large natural gas-fueled engines to truck manufacturers in the United States as trucking companies began converting portions of their fleets to natural gas and the natural gas distribution network in the United States began to expand.\nCummins has a technical center in Darlington, England, for developing products for the European, Middle Eastern, and Asian markets.\n\nCummins Distribution Business\nCummins Distribution Business consists of engine and power generation distribution as well as service and parts. The distribution unit of Cummins consists of 17 Cummins owned distributors and 10 joint ventures, covering 90 countries and territories through 234 locations.\n\nCummins Power Systems Business\nCummins Power Systems Business Unit consists of alternators, automatic transfer switches, commercial power systems, consumer systems, engines, and paralleling systems.\nAll of the above stem from the Cummins Onan Corporation, whose products remain in service today.\nThis Business Unit was formed recently, following a merge of the Power Generation Unit and High Horsepower Sub-Division. \n\nOn August 22, 2017, United Rentals announced it had acquired all mobile power generation assets from Cummins. To maintain fleet and customer service continuity, some Cummins employees joined United Rentals.\n\nAccelera by Cummins\nOn March 8, 2023, Cummins rebranded its New Power business unit as Accelera by Cummins. Accelera designs and produces zero-emissions power generation and vehicle propulsion devices, including hydrogen fuel cells, batteries, e-axles, traction systems and electrolyzers.\n\nSubsidiaries\nCummins Turbo Technologies\nThe Holset Engineering Co. was a British company that produced turbochargers, primarily for diesel and heavy-duty applications.\nIn 1973 the company was purchased by Cummins after briefly being owned by the Hanson Trust. Holset now operates facilities in China, India, Brazil, the Netherlands, the United Kingdom, and the United States.\nIn 2006, the division officially changed its name to Cummins Turbo Technologies to be identified more closely with its parent company. The turbocharger products still use the Holset brand name.\n\nCummins Valvetrain Technologies\nClessie Cummins invented the engine brake in the late 1950s and sold the technology to Jacobs Chuck in 1961 for production, which created the Clessie L. Cummins division of the company to produce engine brakes as an aftermarket option for various diesel engines. This division would later separate from its parent company and be known as Jacobs Vehicle Systems from then on. The company would be purchased by Cummins in 2022.\nThe division has manufacturing facilities in Bloomfield, CT as well as Suzhou, China, and although it is no longer known as Jacobs Vehicle Systems, Cummins still uses the Jacobs name for its engine braking products.\nThe company also designs and manufactures multiple variable valve actuation technologies for heavy-duty applications.\n\nCummins Power Systems\nIn 1986, Cummins began the acquisition of Onan and completed it in 1992. Since then, Onan has evolved into Cummins Power Generation (now Cummins Power Systems), a wholly invested division of Cummins. The Onan name continues to be used for modern versions of their traditional engine-driven generators for RV, marine, commercial mobility, home standby, and portable use.\nCummins Inc. (NYSE: CMI) announced that it will be unifying its brand strategy across its Power Systems business segment, which provides high-speed engines from 760 to 4400 HP and power generation equipment from 2–3,500 kW, including standby and prime power gen sets, alternators, switchgear and other components. Currently, the portfolio features the Cummins, Cummins Power Generation and Cummins Onan brands. With immediate effect, the branding will be consolidated under the Cummins brand. The Cummins Power Generation and Cummins Onan brands will be retired and the Onan name synonymous with mobile gensets, will be repositioned as a generator product line under the newly unified Cummins brand in the RV market.\nCummins Inc. will also be permanently changing all “Fun Roads” branding to Cummins RV moving forward as well and the Fun Roads brand will also be retired. As Onan will now be repositioned as an RV product line, with the new rv.cummins.com website and social media platforms serving as tools for RVers across the country to find relevant information like product specs and a sales and service locator.\n“Looking to unify Cummins into one cohesive, unified brand, we decided that consolidating both products (engines and generators) into the Cummins RV family only strengthens the brand and more uniformly speaks to our manufacturers and consumers,” said Jodie Wilson. “The brand changing will not affect product or service offerings, but will help us to continue on our promise of delivering dependability across the globe.”\nRebranding occurred globally on all marketing activities, as product branding changed across all manufacturing plants beginning July 2017.\nPresident Joe Biden visited the Cummins plant in Fridley, Minnesota on April 3, 2022. It was part of his \"Investing in America\" tour. Cummins had announced a US$1 billion initiative to produce clean energy technology, including electrolyzers for hydrogen cells in Fridley.\n\nCummins Emission Solutions\nExhaust and emissions after-treatment company Nelson Industries was purchased in 1999, due to the increasing importance of exhaust after-treatment systems for meeting future emissions standards. The division changed its name to Cummins Emission Solutions to be identified more closely with their parent company.\n\nChina operations\nCummins has some joint ventures with Chinese manufacturers, such as Dongfeng Cummins, a joint venture with Dongfeng Automobile Company, as well as Guangxi Cummins Industrial Power with LiuGong. One of the most successful joint ventures is the joint venture with Foton called Beijing Foton Cummins Engine Company. This joint venture developed the ISG/X12 engine platform in the mid-2010s. The ISG/X12 in China has surpassed 240,000 units per year making it the highest volume heavy duty engine in the Cummins product line. The ISG/X12 is the foundation for all Cummins future engine platforms.\nOther entities were Cummins Beijing, Chongqing Cummins Engine, Xi’an Cummins Engine, Wuxi Newage Alternators, Xiangfan Fleetguard, Wuxi Cummins Turbo Technologies.\n\nIndia operations\nCummins India is the Indian subsidiary of Cummins. Cummins India is publicly traded on the Bombay Stock Exchange (BSE) and the National Stock Exchange of India (NSE). Cummins began its India operations on 17 February 1962 in a joint venture with the Kirloskar Group. The ownership structure of the joint venture was divided as follows:\n\nCummins - 50%\nKirloskar Group - 25.5%\nRetail Investors - 24.5%\nIn 1996 Cummins Inc. bought Kirloskar shares. Now it is a Cummins Inc. subsidiary. As of 2013, the Cummins group had revenues over $1.5 billion, 20 factories and 9000 employees in India.\nCummins conducts a significant part of its R&D in India at the Cummins Research and Technology centre that was established in 2003. Cummins has built a technical centre in Pune which  houses over 2500 engineers, called CTCI (Cummins Technical Centre India).\nCummins India has made significant contributions to local skill development by establishing the MKSSS's Cummins College of Engineering for Women, a women-only engineering college in Pune.\n\nApplications\nIS (Interact Series) - family of engines used for on-highway applications, trucks, buses and RVs\nISF 2.8-liter I4 - used in GAZ GAZelle (Business and Next series) and Foton Tunland light trucks\nISB 4.5-liter I4 - used in some buses and trucks (such as from Alexander Dennis and DAF respectively; the latter branded as Paccar)\nISV 5.0-liter V8 - used in the 2016 and newer Nissan Titan XD truck, up to 2019 model year\nISB 5.9-liter I6, 190 HP - used in first, second, and third-generation Ram 2500 and 3500 trucks until 2007\nISB 6.7-liter I6 - used in third, fourth and fifth generation Ram 2500-5500 trucks, school buses, some Alexander Dennis buses, medium-duty trucks, such as Freightliner and International. Also used by Kenworth, Peterbilt and DAF called the Paccar PX6 or PX7. Scania has a version called the DC07.\nISC 8.3-liter I6 - discontinued\nISL 8.9-liter - I6 - used for a variety of applications, and a very common engine for buses outside of Europe.\nISL G 8.9-liter - I6 natural-gas-powered, used for a variety of applications\nISM 11-liter I6 - used for a variety of vocational applications in lesser regulated areas\nISG 12-liter I6 - used primarily in Chinese HD trucks\nISX 12-liter I6 - used in heavy-duty trucks\nISX G 12-liter I6 - natural-gas-powered; used in heavy-duty trucks\nISD 12.4-liter I6 - used in tractor applications in lesser regulated areas\nISX 15 liter I6 - used in heavy-duty trucks\nV555 9.1-liter V8 - used in heavy machinery and large trucks\nV903 14.8-liter V8 - used in Bradley fighting vehicles and other military applications\nQS (Quantum Series) - family of engines used for off-highway applications, such as marine, rail/industrial, construction, power generation and agriculture\nQSF 2.8-liter I4\nQSF 3.8-liter I4\nQSB 4.5-liter I4\nQSB 6.7-liter I6\nQSL 9-liter I6\nQSG 12-liter I6\nQSX 15-liter I6\nQSK 19-liter I6\nQSK 23-liter I6\nQST 30-liter V12\nQSK 38-liter V12\nQSK 45-liter V12\nQSK 50-liter V16\nQSK 60-liter V16\nQSK 78-liter V18\nQSK 95-liter V16\nX Series (Next-Generation) - evolution of IS engine family\nX12\nX15 Performance 15-liter I6\nX15 Efficiency 15-liter I6\n\nConcept vehicles\nCummins Aeos - An electric-powered conventional truck.\n\nClean Air Act violations\nIn 1998, the EPA announced fines totaling $83.4 million against Cummins and six other diesel engine manufacturers, the largest fine to date. The fines came after manufacturers evaded testing by deliberately deactivating emissions controls during highway driving to give the appearance of being in full regulatory compliance during standard laboratory testing. The manufacturers also agreed to spend more than $1 billion to correct the problem. The trucks used engine ECU software to engage pollution controls during the 20-minute lab tests to verify compliance with the Clean Air Act, but then quietly disabled the emissions controls during normal highway cruising, thereby emitting up to three times the maximum allowed NOx pollution.\nIn December 2023, Cummins was fined $1.675 billion by the U.S. Justice Department for violations of the Clean Air Act. Cummins was found to have installed devices designed to bypass or disable emissions controls on 960,000 Dodge and Stellantis RAM pickup truck diesel engines between 2013 and 2023. It will also pay $325 million in remedies and recalls.\n\nSee also\nCummins Corporate Office Building\nCummins UK\nCummins-Wärtsilä\nKomatsu\nJ. Irwin Miller\nBrammo\n\nReferences\nExternal links\n\nOfficial website\nCummins Spare Parts Catalogue Archived 31 January 2023 at the Wayback Machine\nBusiness data for Cummins Inc.:",
  "clean_text": "Cummins Inc. is an American multinational corporation that designs, manufactures, and distributes diesel engines, electric vehicle components, and power generation products. Cummins also services engines and related equipment, including fuel systems, air handling systems controls, filtration, emission control, electrical power generation systems, and engine control units. Headquartered in Columbus, Indiana, Cummins sells in approximately 190 countries and territories through a network of more than 600 company-owned and independent distributors and approximately 7,200 dealers. History The Cummins Engine Company was founded in Columbus, Indiana on February 3, 1919, by mechanic Clessie Cummins and banker William Glanton Irwin. The company focused on developing the diesel engine, which was invented 20 years earlier. Despite several well-publicized endurance trials, it was not until 1933 that their Model H engine, used in small railroad switchers, proved successful. The Cummins N Series engines became the industry leader in the post-World War II road-building boom in the United States, with more than half of the heavy-duty truck market using Cummins engines from 1952 to 1959. In the 1960s, the company opened an assembly plant in Shotts, Scotland (closed in 1996). By 2013, Cummins had operations in 197 countries and territories. Business units Cummins Components Business Cummins Component Business Unit consists of emission solutions, filtration (Fleetguard), fuel systems, turbo technologies (Holset), and electronics. The Cummins Turbo Technologies unit designs and manufactures turbochargers and related products on a global scale, for diesel engines above 3 liters. Its Emission Solutions unit develops and supplies catalytic exhaust systems and associated products to the medium and heavy-duty commercial diesel engine markets. Cummins Filtration designs, manufactures and distributes heavy-duty and light-duty air, fuel, hydraulic and lube filtration, chemicals and exhaust system technology products for diesel and gas-powered equipment. In contrast Cummins Electronics designs engine control units and sensors for Cummins diesel engines. Cummins Engine Business Cummins Engine Business Unit consists of aftermarket support, mid-range, heavy-duty, and high-power engines. Its markets include heavy and medium-duty trucks, buses, recreational vehicles (RV), light-duty automotive, and several industrial uses, including construction, mining, marine, oil, gas, railroad and military equipment. One of the most popular engines built is the 5.9-liter I6 engine used in the Dodge Ram heavy-duty pickups starting in 1988. In 2007, a 6.7-liter version of the Cummins straight-six engine became optional on the RAM pickup. In 2008, Cummins was a named defendant in a class-action suit related to 1998-2001 model year Dodge Ram trucks, model 2500 or 3500, originally equipped with a Cummins ISB 5.9 liter diesel engine built using a pattern 53 Block. The case has been settled, but some qualified Chrysler owners may receive $500 for repairs to the block, which was alleged to crack and create a coolant leak. In April 2013, Cummins utilized technology developed by Westport Innovations to ship large natural gas-fueled engines to truck manufacturers in the United States as trucking companies began converting portions of their fleets to natural gas and the natural gas distribution network in the United States began to expand. Cummins has a technical center in Darlington, England, for developing products for the European, Middle Eastern, and Asian markets. Cummins Distribution Business Cummins Distribution Business consists of engine and power generation distribution as well as service and parts. The distribution unit of Cummins consists of 17 Cummins owned distributors and 10 joint ventures, covering 90 countries and territories through 234 locations. Cummins Power Systems Business Cummins Power Systems Business Unit consists of alternators, automatic transfer switches, commercial power systems, consumer systems, engines, and paralleling systems. All of the above stem from the Cummins Onan Corporation, whose products remain in service today. This Business Unit was formed recently, following a merge of the Power Generation Unit and High Horsepower Sub-Division. On August 22, 2017, United Rentals announced it had acquired all mobile power generation assets from Cummins. To maintain fleet and customer service continuity, some Cummins employees joined United Rentals. Accelera by Cummins On March 8, 2023, Cummins rebranded its New Power business unit as Accelera by Cummins. Accelera designs and produces zero-emissions power generation and vehicle propulsion devices, including hydrogen fuel cells, batteries, e-axles, traction systems and electrolyzers. Subsidiaries Cummins Turbo Technologies The Holset Engineering Co. was a British company that produced turbochargers, primarily for diesel and heavy-duty applications. In 1973 the company was purchased by Cummins after briefly being owned by the Hanson Trust. Holset now operates facilities in China, India, Brazil, the Netherlands, the United Kingdom, and the United States. In 2006, the division officially changed its name to Cummins Turbo Technologies to be identified more closely with its parent company. The turbocharger products still use the Holset brand name. Cummins Valvetrain Technologies Clessie Cummins invented the engine brake in the late 1950s and sold the technology to Jacobs Chuck in 1961 for production, which created the Clessie L. Cummins division of the company to produce engine brakes as an aftermarket option for various diesel engines. This division would later separate from its parent company and be known as Jacobs Vehicle Systems from then on. The company would be purchased by Cummins in 2022. The division has manufacturing facilities in Bloomfield, CT as well as Suzhou, China, and although it is no longer known as Jacobs Vehicle Systems, Cummins still uses the Jacobs name for its engine braking products. The company also designs and manufactures multiple variable valve actuation technologies for heavy-duty applications. Cummins Power Systems In 1986, Cummins began the acquisition of Onan and completed it in 1992. Since then, Onan has evolved into Cummins Power Generation (now Cummins Power Systems), a wholly invested division of Cummins. The Onan name continues to be used for modern versions of their traditional engine-driven generators for RV, marine, commercial mobility, home standby, and portable use. Cummins Inc. (NYSE: CMI) announced that it will be unifying its brand strategy across its Power Systems business segment, which provides high-speed engines from 760 to 4400 HP and power generation equipment from 2–3,500 kW, including standby and prime power gen sets, alternators, switchgear and other components. Currently, the portfolio features the Cummins, Cummins Power Generation and Cummins Onan brands. With immediate effect, the branding will be consolidated under the Cummins brand. The Cummins Power Generation and Cummins Onan brands will be retired and the Onan name synonymous with mobile gensets, will be repositioned as a generator product line under the newly unified Cummins brand in the RV market. Cummins Inc. will also be permanently changing all “Fun Roads” branding to Cummins RV moving forward as well and the Fun Roads brand will also be retired. As Onan will now be repositioned as an RV product line, with the new rv.cummins.com website and social media platforms serving as tools for RVers across the country to find relevant information like product specs and a sales and service locator. “Looking to unify Cummins into one cohesive, unified brand, we decided that consolidating both products (engines and generators) into the Cummins RV family only strengthens the brand and more uniformly speaks to our manufacturers and consumers,” said Jodie Wilson. “The brand changing will not affect product or service offerings, but will help us to continue on our promise of delivering dependability across the globe.” Rebranding occurred globally on all marketing activities, as product branding changed across all manufacturing plants beginning July 2017. President Joe Biden visited the Cummins plant in Fridley, Minnesota on April 3, 2022. It was part of his \"Investing in America\" tour. Cummins had announced a US$1 billion initiative to produce clean energy technology, including electrolyzers for hydrogen cells in Fridley. Cummins Emission Solutions Exhaust and emissions after-treatment company Nelson Industries was purchased in 1999, due to the increasing importance of exhaust after-treatment systems for meeting future emissions standards. The division changed its name to Cummins Emission Solutions to be identified more closely with their parent company. China operations Cummins has some joint ventures with Chinese manufacturers, such as Dongfeng Cummins, a joint venture with Dongfeng Automobile Company, as well as Guangxi Cummins Industrial Power with LiuGong. One of the most successful joint ventures is the joint venture with Foton called Beijing Foton Cummins Engine Company. This joint venture developed the ISG/X12 engine platform in the mid-2010s. The ISG/X12 in China has surpassed 240,000 units per year making it the highest volume heavy duty engine in the Cummins product line. The ISG/X12 is the foundation for all Cummins future engine platforms. Other entities were Cummins Beijing, Chongqing Cummins Engine, Xi’an Cummins Engine, Wuxi Newage Alternators, Xiangfan Fleetguard, Wuxi Cummins Turbo Technologies. India operations Cummins India is the Indian subsidiary of Cummins. Cummins India is publicly traded on the Bombay Stock Exchange (BSE) and the National Stock Exchange of India (NSE). Cummins began its India operations on 17 February 1962 in a joint venture with the Kirloskar Group. The ownership structure of the joint venture was divided as follows: Cummins - 50% Kirloskar Group - 25.5% Retail Investors - 24.5% In 1996 Cummins Inc. bought Kirloskar shares. Now it is a Cummins Inc. subsidiary. As of 2013, the Cummins group had revenues over $1.5 billion, 20 factories and 9000 employees in India. Cummins conducts a significant part of its R&D in India at the Cummins Research and Technology centre that was established in 2003. Cummins has built a technical centre in Pune which houses over 2500 engineers, called CTCI (Cummins Technical Centre India). Cummins India has made significant contributions to local skill development by establishing the MKSSS's Cummins College of Engineering for Women, a women-only engineering college in Pune. Applications IS (Interact Series) - family of engines used for on-highway applications, trucks, buses and RVs ISF 2.8-liter I4 - used in GAZ GAZelle (Business and Next series) and Foton Tunland light trucks ISB 4.5-liter I4 - used in some buses and trucks (such as from Alexander Dennis and DAF respectively; the latter branded as Paccar) ISV 5.0-liter V8 - used in the 2016 and newer Nissan Titan XD truck, up to 2019 model year ISB 5.9-liter I6, 190 HP - used in first, second, and third-generation Ram 2500 and 3500 trucks until 2007 ISB 6.7-liter I6 - used in third, fourth and fifth generation Ram 2500-5500 trucks, school buses, some Alexander Dennis buses, medium-duty trucks, such as Freightliner and International. Also used by Kenworth, Peterbilt and DAF called the Paccar PX6 or PX7. Scania has a version called the DC07. ISC 8.3-liter I6 - discontinued ISL 8.9-liter - I6 - used for a variety of applications, and a very common engine for buses outside of Europe. ISL G 8.9-liter - I6 natural-gas-powered, used for a variety of applications ISM 11-liter I6 - used for a variety of vocational applications in lesser regulated areas ISG 12-liter I6 - used primarily in Chinese HD trucks ISX 12-liter I6 - used in heavy-duty trucks ISX G 12-liter I6 - natural-gas-powered; used in heavy-duty trucks ISD 12.4-liter I6 - used in tractor applications in lesser regulated areas ISX 15 liter I6 - used in heavy-duty trucks V555 9.1-liter V8 - used in heavy machinery and large trucks V903 14.8-liter V8 - used in Bradley fighting vehicles and other military applications QS (Quantum Series) - family of engines used for off-highway applications, such as marine, rail/industrial, construction, power generation and agriculture QSF 2.8-liter I4 QSF 3.8-liter I4 QSB 4.5-liter I4 QSB 6.7-liter I6 QSL 9-liter I6 QSG 12-liter I6 QSX 15-liter I6 QSK 19-liter I6 QSK 23-liter I6 QST 30-liter V12 QSK 38-liter V12 QSK 45-liter V12 QSK 50-liter V16 QSK 60-liter V16 QSK 78-liter V18 QSK 95-liter V16 X Series (Next-Generation) - evolution of IS engine family X12 X15 Performance 15-liter I6 X15 Efficiency 15-liter I6 Concept vehicles Cummins Aeos - An electric-powered conventional truck. Clean Air Act violations In 1998, the EPA announced fines totaling $83.4 million against Cummins and six other diesel engine manufacturers, the largest fine to date. The fines came after manufacturers evaded testing by deliberately deactivating emissions controls during highway driving to give the appearance of being in full regulatory compliance during standard laboratory testing. The manufacturers also agreed to spend more than $1 billion to correct the problem. The trucks used engine ECU software to engage pollution controls during the 20-minute lab tests to verify compliance with the Clean Air Act, but then quietly disabled the emissions controls during normal highway cruising, thereby emitting up to three times the maximum allowed NOx pollution. In December 2023, Cummins was fined $1.675 billion by the U.S. Justice Department for violations of the Clean Air Act. Cummins was found to have installed devices designed to bypass or disable emissions controls on 960,000 Dodge and Stellantis RAM pickup truck diesel engines between 2013 and 2023. It will also pay $325 million in remedies and recalls."
}