{
  "ticker": "CMS",
  "cik": "0000811156",
  "company_name": "CMS Energy",
  "corrected_name": "CMS Energy",
  "wiki_title_used": "CMS Energy",
  "exists": true,
  "raw_text": "CMS Energy Corporation is an American energy company based in Jackson, Michigan, that is focused principally on utility operations in Michigan. Its principal business is Consumers Energy, a public utility that provides electricity and natural gas to more than 6 million of Michigan's 10 million residents. Its non-utility businesses are focused primarily on domestic independent power production. Consumers Energy has operated since 1886.\nNorthStar Clean Energy's primary businesses are independent power production and natural gas transmission.\n\nHistory\nCMS Energy was formed in 1987 as a holding company with its principal subsidiaries as Consumers Energy and CMS Enterprises. On October 23, 1987, CMS Energy became a publicly owned company and was listed at the New York Stock Exchange. The company's history dates back to 1886, when William Augustine Foote and Samuel Jarvis initially approached Jackson, Michigan officials and asked them to support efforts to illuminate Jackson's downtown with electric arc lights. They formed a company, Jackson Electric Light Works in 1888. In 1889, they built a hydro plant project at the Trowbridge Dam on the Kalamazoo River in  Allegan. Foote, after seeing some early success, began consolidating his small power companies and formed Commonwealth Power Company.\nIn 1907, Foote and Jarvis built Croton Hydro project on the Muskegon River, the first project in the world that could transmit 110,000 volts of electricity. In 1920, Foote and Jarvis offered preferred shares of their company to the public to secure sufficient financing to enter other energy and power generation sectors. Over the next decades the company built several coal-fired, natural gas, nuclear and electric facilities. In 1946, the company formed a strategic partnership with Panhandle Company to convert former natural gas fields to underground natural gas storage areas. CMS Energy's primary subsidiary, Consumers Energy, announced Michigan's first nuclear power plant in 1961, Big Rock Point in Charlevoix, Michigan.\nThe company announced another nuclear plant, Palisades Nuclear Generating Station on Lake Michigan, which first produced electricity in December, 1971 to serve 400,000 people a day. CMS Energy owned the plant until 2006, when it was sold to Entergy. It then  announced a gas reforming plant to furnish heat for Michigan homes in 1971. This plant was the first of its kind in North America to produce synthetic gas, converting impure liquid petroleum into pipeline-quality natural gas.\nIn 1987, CMS Energy, a holding company with its principal subsidiaries as Consumers Power and CMS Enterprises was formed. Consumers Power was rebranded Consumers Energy in 1997. The firm was one of the first companies to introduce an online billing system in the late 1990s.\nIn 2001, the firm entered into an exploration agreement with Eritrea for oil exploration in the Dismin Block of the Red Sea.\nIn 2002, CMS Energy founded EnerBank USA.\nIn 2003, the firm moved its headquarters to One Energy Plaza in Jackson, Michigan. In 2007, the company announced plans to invest $6 billion in Michigan's energy future to support new power plant technology and identify new energy sources. In 2014, Consumers Energy opened Cross Winds Energy Park in Michigan's Tuscola County and signed a contract with General Electric to supply 621.79-kilowatt wind turbine engines for the project which has a total generating capacity of 105 megawatts.\nOct 1, 2021, CMS Energy Completes Sale of EnerBank USA to Regions Bank.\nOn Nov 1st 2022, CMS Enterprises changes name to NorthStar Clean Energy as it begins to serve more corporate clients.\n\nSustainability and Environment\nIn 2015, 9 percent of CMS Energy's power comes from renewable energy sources. Primary CMS Energy subsidiary Consumers Energy joined the Wildlife Habitat Council as an active member. By 2007, all power facilities received the Clean Corporate Citizen award from the Michigan Department of Environmental Quality.\n\nAwards\nConsumers Energy, CMS Energy's primary subsidiary, was named Energy Star Partner of the Year in 2014 and 2015 for excellence in sustainable energy efficiency programs. In 2014, Consumers Energy  was ranked among the top 15 most sustainable energy providers. Later that year, CMS Energy received Edison Electric Institute's Index Award for top cumulative shareholder return in the small cap category.  The firm received the 2015 Emergency Recovery Award for its electricity restoration efforts during the December 2013 North American storm complex.\n\nCriticism\nIn December 2011, the non-partisan organization Public Campaign criticized CMS Energy for spending $3.48 million on lobbying and not paying any taxes during 2008-2010, instead getting $29 million in tax rebates, despite making a profit of $415 million, and increasing executive pay by 79% to $900.4 million in 2010 for its top 5 executives.\n\nPhilanthropy\nCMS Energy has helped establish and finance numerous research, educational and cultural institutes in the United States. Consumers Energy was given the William Booth Award in 2013 by The Salvation Army in recognition of its long history of philanthropic activities and leadership for the PeopleCare assistance program.\nCMS Energy participates in internship and cooperative education programs to build career opportunities in Michigan. Consumers Energy has also worked on early childhood development and education in Michigan and has also received Wildlife Habitat Council (WHC) compliant certificates for its efforts to promote environmental education.\n\nSee also\nLists of public utilities\n\nReferences\nExternal links\nOfficial website\nBusiness data for CMS Energy:",
  "clean_text": "CMS Energy Corporation is an American energy company based in Jackson, Michigan, that is focused principally on utility operations in Michigan. Its principal business is Consumers Energy, a public utility that provides electricity and natural gas to more than 6 million of Michigan's 10 million residents. Its non-utility businesses are focused primarily on domestic independent power production. Consumers Energy has operated since 1886. NorthStar Clean Energy's primary businesses are independent power production and natural gas transmission. History CMS Energy was formed in 1987 as a holding company with its principal subsidiaries as Consumers Energy and CMS Enterprises. On October 23, 1987, CMS Energy became a publicly owned company and was listed at the New York Stock Exchange. The company's history dates back to 1886, when William Augustine Foote and Samuel Jarvis initially approached Jackson, Michigan officials and asked them to support efforts to illuminate Jackson's downtown with electric arc lights. They formed a company, Jackson Electric Light Works in 1888. In 1889, they built a hydro plant project at the Trowbridge Dam on the Kalamazoo River in Allegan. Foote, after seeing some early success, began consolidating his small power companies and formed Commonwealth Power Company. In 1907, Foote and Jarvis built Croton Hydro project on the Muskegon River, the first project in the world that could transmit 110,000 volts of electricity. In 1920, Foote and Jarvis offered preferred shares of their company to the public to secure sufficient financing to enter other energy and power generation sectors. Over the next decades the company built several coal-fired, natural gas, nuclear and electric facilities. In 1946, the company formed a strategic partnership with Panhandle Company to convert former natural gas fields to underground natural gas storage areas. CMS Energy's primary subsidiary, Consumers Energy, announced Michigan's first nuclear power plant in 1961, Big Rock Point in Charlevoix, Michigan. The company announced another nuclear plant, Palisades Nuclear Generating Station on Lake Michigan, which first produced electricity in December, 1971 to serve 400,000 people a day. CMS Energy owned the plant until 2006, when it was sold to Entergy. It then announced a gas reforming plant to furnish heat for Michigan homes in 1971. This plant was the first of its kind in North America to produce synthetic gas, converting impure liquid petroleum into pipeline-quality natural gas. In 1987, CMS Energy, a holding company with its principal subsidiaries as Consumers Power and CMS Enterprises was formed. Consumers Power was rebranded Consumers Energy in 1997. The firm was one of the first companies to introduce an online billing system in the late 1990s. In 2001, the firm entered into an exploration agreement with Eritrea for oil exploration in the Dismin Block of the Red Sea. In 2002, CMS Energy founded EnerBank USA. In 2003, the firm moved its headquarters to One Energy Plaza in Jackson, Michigan. In 2007, the company announced plans to invest $6 billion in Michigan's energy future to support new power plant technology and identify new energy sources. In 2014, Consumers Energy opened Cross Winds Energy Park in Michigan's Tuscola County and signed a contract with General Electric to supply 621.79-kilowatt wind turbine engines for the project which has a total generating capacity of 105 megawatts. Oct 1, 2021, CMS Energy Completes Sale of EnerBank USA to Regions Bank. On Nov 1st 2022, CMS Enterprises changes name to NorthStar Clean Energy as it begins to serve more corporate clients. Sustainability and Environment In 2015, 9 percent of CMS Energy's power comes from renewable energy sources. Primary CMS Energy subsidiary Consumers Energy joined the Wildlife Habitat Council as an active member. By 2007, all power facilities received the Clean Corporate Citizen award from the Michigan Department of Environmental Quality. Awards Consumers Energy, CMS Energy's primary subsidiary, was named Energy Star Partner of the Year in 2014 and 2015 for excellence in sustainable energy efficiency programs. In 2014, Consumers Energy was ranked among the top 15 most sustainable energy providers. Later that year, CMS Energy received Edison Electric Institute's Index Award for top cumulative shareholder return in the small cap category. The firm received the 2015 Emergency Recovery Award for its electricity restoration efforts during the December 2013 North American storm complex. Criticism In December 2011, the non-partisan organization Public Campaign criticized CMS Energy for spending $3.48 million on lobbying and not paying any taxes during 2008-2010, instead getting $29 million in tax rebates, despite making a profit of $415 million, and increasing executive pay by 79% to $900.4 million in 2010 for its top 5 executives. Philanthropy CMS Energy has helped establish and finance numerous research, educational and cultural institutes in the United States. Consumers Energy was given the William Booth Award in 2013 by The Salvation Army in recognition of its long history of philanthropic activities and leadership for the PeopleCare assistance program. CMS Energy participates in internship and cooperative education programs to build career opportunities in Michigan. Consumers Energy has also worked on early childhood development and education in Michigan and has also received Wildlife Habitat Council (WHC) compliant certificates for its efforts to promote environmental education."
}