{
  "ticker": "CNC",
  "cik": "0001071739",
  "company_name": "Centene Corporation",
  "corrected_name": "Centene Corporation",
  "wiki_title_used": "Centene Corporation",
  "exists": true,
  "raw_text": "Centene Corporation is an American for-profit healthcare company based in St. Louis, Missouri, which is an intermediary for government-sponsored and privately insured healthcare programs. Centene ranked No. 23 on the 2025 Fortune 500.\n\nHistory\nCentene was founded by Elizabeth Brinn as Managed Health Services in Milwaukee, Wisconsin, in 1984. After the death of Brinn, the non-profit organization was sold to investors, with the proceeds going to the Betty Brinn Foundation, which subsequently became a major shareholder in Centene. In 1996, Michael Neidorff joined the company as chief executive.\nCentene went public in December 2001. In 2006, the firm acquired US Script, a pharmacy benefits manager. The company later merged US Script with subsidiaries to form its Envolve divisions. In 2011, the firm formed Centurion, a provider of correctional health care services, as a joint venture with MHM Services. In 2018, it acquired MHM Services, including its stake in Centurion. Centene began offering state-run Medicaid programs through Affordable Care Act exchanges in 2014.\nIn July 2015, Centene announced it would acquire Health Net and Trillium Community Health Plan (serving Oregon). In March 2016, it finalized its acquisition. In September 2017, it announced that it would acquire Fidelis Care, a nonprofit insurer in New York, for US$3.75 billion. In March 2019, it announced plans to acquire WellCare for US$17.3 billion. In January 2021, it was announced that it would acquire Magellan Health for $2.2 billion. In January 2022, the acquisition was completed.\nIn the United Kingdom, Centene began to acquire local healthcare services in 2017. In 2019, Centene, through its subsidiary MH Services, took a 40% stake in Circle Health, as part of a deal which created a national network of over 50 private hospitals. Centene gained full control of Circle Health in July 2021, and sold the business to PureHealth in August 2023.\nIn early 2021, Operose Health, a UK subsidiary of Centene, took over a group of London practices, AT Medics.\nIn May 2022, Centene announced that they had divested two pharmacy organisations as the company exited the pharmacy benefit management business. Centene divested Magellan Rx and PANTHERx Rare for a total of $2.8 billion.\n\nBusiness segments\nThe main lines of Centene include:\n\nMedicaid\nACA health insurance marketplace\nMedicare\nTricare\nCorrectional healthcare\n\nLeadership\nIn June 2021, an article in the Ohio Capital Journal reported that CEO Michael Neidorff was the highest paid healthcare executive in the United States in 2020, earning nearly $25 million.\nIn December 2021, Politan Capital Management took a $900 million stake in Centene. Following the agreement, CEO Michael Neidorff announced plans to retire by the end of 2022.\nIn March 2022, Sarah London was named chief executive officer of the company, replacing Neidorff.\n\nControversies\nIn 2014, Fox News alleged that Superior HealthPlan of Texas denied coverage of an infant's surgery for brain cancer at Texas Children's Hospital. Superior HealthPlan is a joint-venture of Centene and Community Health Centers Network LP, which provides services for Medicaid recipients. The article reported that Superior HealthPlan had previously paid healthcare claims for the infant at the hospital, although Superior HealthPlan stated that it did not cover procedures at the facility. Three days after the article was published, Superior HealthPlan reversed its decision and covered the surgery.\nIn January 2018, a class action lawsuit accused Centene's Ambetter marketplace healthcare plans of misleading enrollees about plan benefits. According to the lawsuit, people who bought Centene's plans had difficulty finding medical providers that accepted patients covered under Centene's policies.\nIn December 2018, Centene was sued by two pension funds alleging that Centene's acquisition of Health Net resulted in damages to Centene and exposed the company to potential liability. The suit also alleged that Centene concealed that Health Net owed approximately $1B in past tax liabilities to California and was under investigation for Medicare fraud at the time of the acquisition.\nIn 2022, Operose Health had almost 600,000 NHS patients and was the largest supplier of GP services to the NHS.  It was accused of putting patients at risk by prioritising profit, specifically by hiring physician associates, because they were cheaper than GPs.  At Operose practices the average number of full time equivalent GPs per patients is about half the average in English practices. Sir Sam Everington said he was worried to see physician associates saying they were not receiving the supervision they needed. The practice had a backlog of thousands of medical test results and hospital letters on their computer systems.  Operose said 97% of its practices were rated \"good\" or \"outstanding\" by the Care Quality Commission.\n\nSettlements\nIn April 2021, Health Net Federal Services, a subsidiary of Centene, agreed to pay $97M to settle allegations that it had duplicated or inflated claims submitted to the Department of Veterans Affairs.\nBetween June 2021 and January 2022, Centene agreed to settlements with several states on behalf of their subsidiary, Envolve, a pharmacy benefit manager, including Ohio, Mississippi, Illinois, Arkansas, and New Hampshire to resolve allegations of overpayments to the PBM from the states' Medicaid programs. The settlements have totaled over $191 million.\nIn December 2021, Centene agreed to pay $27.6M to Kansas to settle allegations that it had failed to disclose discounts and used other strategies to obtain more profit from Kansas' Medicaid program.\nIn September 2022, Centene will pay more than $14 million to Massachusetts's to resolve claims that it overcharged the state Medicaid program, MassHealth, millions of dollars for pharmacy benefits and services provided by subsidiary companies.\nCentene overbilled Florida $67 million in 2021 and proactively notified the state. Their discussions with Agency for Health Care Administration (AHCA) ended in 2024 and Centene agreed to return the $67 million. $10 million of that was sent to Hope Florida Foundation, rather than the state directly.\n\nSee also\nList of United States insurance companies\nList of S&P 500 companies\nHealth insurance in the United States\nCompanies listed on the New York Stock Exchange (C)\n\nReferences\nExternal links\nOfficial website \nBusiness data for Centene Corporation:",
  "clean_text": "Centene Corporation is an American for-profit healthcare company based in St. Louis, Missouri, which is an intermediary for government-sponsored and privately insured healthcare programs. Centene ranked No. 23 on the 2025 Fortune 500. History Centene was founded by Elizabeth Brinn as Managed Health Services in Milwaukee, Wisconsin, in 1984. After the death of Brinn, the non-profit organization was sold to investors, with the proceeds going to the Betty Brinn Foundation, which subsequently became a major shareholder in Centene. In 1996, Michael Neidorff joined the company as chief executive. Centene went public in December 2001. In 2006, the firm acquired US Script, a pharmacy benefits manager. The company later merged US Script with subsidiaries to form its Envolve divisions. In 2011, the firm formed Centurion, a provider of correctional health care services, as a joint venture with MHM Services. In 2018, it acquired MHM Services, including its stake in Centurion. Centene began offering state-run Medicaid programs through Affordable Care Act exchanges in 2014. In July 2015, Centene announced it would acquire Health Net and Trillium Community Health Plan (serving Oregon). In March 2016, it finalized its acquisition. In September 2017, it announced that it would acquire Fidelis Care, a nonprofit insurer in New York, for US$3.75 billion. In March 2019, it announced plans to acquire WellCare for US$17.3 billion. In January 2021, it was announced that it would acquire Magellan Health for $2.2 billion. In January 2022, the acquisition was completed. In the United Kingdom, Centene began to acquire local healthcare services in 2017. In 2019, Centene, through its subsidiary MH Services, took a 40% stake in Circle Health, as part of a deal which created a national network of over 50 private hospitals. Centene gained full control of Circle Health in July 2021, and sold the business to PureHealth in August 2023. In early 2021, Operose Health, a UK subsidiary of Centene, took over a group of London practices, AT Medics. In May 2022, Centene announced that they had divested two pharmacy organisations as the company exited the pharmacy benefit management business. Centene divested Magellan Rx and PANTHERx Rare for a total of $2.8 billion. Business segments The main lines of Centene include: Medicaid ACA health insurance marketplace Medicare Tricare Correctional healthcare Leadership In June 2021, an article in the Ohio Capital Journal reported that CEO Michael Neidorff was the highest paid healthcare executive in the United States in 2020, earning nearly $25 million. In December 2021, Politan Capital Management took a $900 million stake in Centene. Following the agreement, CEO Michael Neidorff announced plans to retire by the end of 2022. In March 2022, Sarah London was named chief executive officer of the company, replacing Neidorff. Controversies In 2014, Fox News alleged that Superior HealthPlan of Texas denied coverage of an infant's surgery for brain cancer at Texas Children's Hospital. Superior HealthPlan is a joint-venture of Centene and Community Health Centers Network LP, which provides services for Medicaid recipients. The article reported that Superior HealthPlan had previously paid healthcare claims for the infant at the hospital, although Superior HealthPlan stated that it did not cover procedures at the facility. Three days after the article was published, Superior HealthPlan reversed its decision and covered the surgery. In January 2018, a class action lawsuit accused Centene's Ambetter marketplace healthcare plans of misleading enrollees about plan benefits. According to the lawsuit, people who bought Centene's plans had difficulty finding medical providers that accepted patients covered under Centene's policies. In December 2018, Centene was sued by two pension funds alleging that Centene's acquisition of Health Net resulted in damages to Centene and exposed the company to potential liability. The suit also alleged that Centene concealed that Health Net owed approximately $1B in past tax liabilities to California and was under investigation for Medicare fraud at the time of the acquisition. In 2022, Operose Health had almost 600,000 NHS patients and was the largest supplier of GP services to the NHS. It was accused of putting patients at risk by prioritising profit, specifically by hiring physician associates, because they were cheaper than GPs. At Operose practices the average number of full time equivalent GPs per patients is about half the average in English practices. Sir Sam Everington said he was worried to see physician associates saying they were not receiving the supervision they needed. The practice had a backlog of thousands of medical test results and hospital letters on their computer systems. Operose said 97% of its practices were rated \"good\" or \"outstanding\" by the Care Quality Commission. Settlements In April 2021, Health Net Federal Services, a subsidiary of Centene, agreed to pay $97M to settle allegations that it had duplicated or inflated claims submitted to the Department of Veterans Affairs. Between June 2021 and January 2022, Centene agreed to settlements with several states on behalf of their subsidiary, Envolve, a pharmacy benefit manager, including Ohio, Mississippi, Illinois, Arkansas, and New Hampshire to resolve allegations of overpayments to the PBM from the states' Medicaid programs. The settlements have totaled over $191 million. In December 2021, Centene agreed to pay $27.6M to Kansas to settle allegations that it had failed to disclose discounts and used other strategies to obtain more profit from Kansas' Medicaid program. In September 2022, Centene will pay more than $14 million to Massachusetts's to resolve claims that it overcharged the state Medicaid program, MassHealth, millions of dollars for pharmacy benefits and services provided by subsidiary companies. Centene overbilled Florida $67 million in 2021 and proactively notified the state. Their discussions with Agency for Health Care Administration (AHCA) ended in 2024 and Centene agreed to return the $67 million. $10 million of that was sent to Hope Florida Foundation, rather than the state directly."
}