{
  "ticker": "CNP",
  "cik": "0001130310",
  "company_name": "CenterPoint Energy",
  "corrected_name": "CenterPoint Energy",
  "wiki_title_used": "CenterPoint Energy",
  "exists": true,
  "raw_text": "CenterPoint Energy, Inc. is an American utility company based in Houston, Texas, that provides electric and natural gas utility to customers in several markets in the American states of Indiana, Ohio, Louisiana, Minnesota, Mississippi, and Texas. Part of the Fortune 500, the company was formerly known as Reliant Energy, NorAm Energy, Houston Industries, and HL&P. The company is headquartered in the CenterPoint Energy Tower at 1111 Louisiana Street in Downtown Houston.\n\nHistory\nWhen Texas deregulated the electricity market, the former Houston Lighting & Power (HL&P) was split into several companies. In 2003 HL&P was split into Reliant Energy, Texas Genco, and CenterPoint Energy.\nUntil December 15, 2004, CenterPoint Energy and its predecessors operated in its various markets under these names; they were used separately prior to Reliant Energy, and later in conjunction with the Reliant Energy and CenterPoint Energy names:\n\nMinnegasco (natural gas throughout Minnesota)\nHouston Lighting and Power (or HL&P) Houston-Galveston electric provider\nEntex (Natural gas throughout South and East Texas, Southern Louisiana and Mississippi)\nArkla (Natural gas throughout Northern Louisiana, Northeast Texas, Oklahoma, and Arkansas)\nIn late 2004, four private equity firms—the Texas Pacific Group, the Blackstone Group, Kohlberg Kravis Roberts, and Hellman & Friedman—combined forces to purchase Texas Genco from Centerpoint. Later in 2006, Texas Genco was sold to NRG Energy of Princeton, N.J.\nOn April 23, 2018, CenterPoint Energy and Vectren Corporation announced they had entered into a definitive merger agreement, with CenterPoint being the emerging head company. On February 1, 2019, the merger was completed and Vectren was delisted from the NYSE. CenterPoint retained the Vectren name for Vectren's service territory until it was retired on May 3, 2021.\n\nSeptember 2008 power outage\nIn September 2008, Hurricane Ike caused great disruption of service in the Greater Houston Area, wiping out 2.1 million of CenterPoint's 2.26 million clients' electricity.\n\nSmart meter pilot program\nIn March 2009, the company's five-year smart meter deployment began, delivering enhanced smart meter functionality to Retail Electric Providers (REPs).\nThe company worked with the Department of Energy for a pilot program in Texas centered on energy consumption. After working with 500-residential electricity customers in the Houston area, it was found that by using a smart meter, consumers cut down on energy use for the home. The pilot program was funded in part by the $200 million it received from the federal stimulus act.\nElectric vehicles\nIn 2010, CenterPoint Energy and Ford Motor Company formed a partnership to promote adoption of electric vehicles. The two companies teamed up to work together to create electric vehicle consumer outreach and education programs; they also distributed details to various stakeholders about charging needs and the requirements needed to \"ensure the electrical infrastructure can support the necessary demand.\" Additionally: \"The Ford and CenterPoint Energy collaboration also includes developing strategies to minimize the emissions and distribution impacts of charging electric vehicles by using statewide system renewable energy resources and more efficient use of household electricity.\"\n\n2021 Texas power outages\nAt 1:25 a.m. on February 15, 2021, due to a major cold-weather event affecting the state of Texas, the Electric Reliability Council of Texas (ERCOT) declared a statewide power generation shortfall emergency, due to a 34,000 MW shortfall in generation causing widespread blackouts. At 1:30 a.m., CenterPoint Energy started controlled, rotating outages in the Greater Houston area. At first, the company said that the outages were expected to last 10 to 45 minutes, but soon updated its statement to say that customers who were experiencing an outage should be prepared to be without power for the rest of Monday. The company also told its customers to lower their thermostat settings temporarily to help conserve natural gas across its eight-state service territory.\nOvernight on Tuesday morning, CenterPoint Energy was able to restart the process of rolling the outages around, but had to stop at around 4 a.m. due to another ERCOT order because several third-party electric generators tripped offline. However, it was able to restart the process around 1:30 p.m. the same day. Later that evening, CenterPoint Energy stated online that it was given another ERCOT order to reduce electric load and warned customers to make preparations for additional outages.\nOn Wednesday evening, CenterPoint Energy told its customers to conserve both power and natural gas starting at 6 p.m. CDT until midnight, as it was preparing to re-energize portions of the electric system. In the early hours of Thursday, the company restored electric service to approximately 1.39 million customers, while less than 7000 customers were about to be restored. Later at around Friday morning, ERCOT ended emergency conditions, saying there was enough generation to resume normal operations.\n\n2024 Texas power outage\nCategory 1 Hurricane Beryl made landfall in Texas the early hours of July 8, 2024. The impact of the storm left 2.2 million CenterPoint customers without power, the largest number in the company's history, and the largest number in the state's history.\nOn July 10, 2024, a graffiti mural with the name \"CenterPointle$$\" popped up on an I-10 West underpass near the highway and Studewood Street, indicating the city's response to the company's lack of preparations and failure to give reliable information to its customers after the storm.  On Friday, the Texas Department of Transportation (TxDOT) removed the graffiti mural.\n\nCriticism\nOn December 16, 2005, CenterPoint Energy Inc. said it would restate its finances for 2004 and the first three quarters of 2005 to correct accounting errors that overstated revenue and natural gas expenses.\nIn December 2011, the non-partisan organization Public Campaign criticized CenterPoint Energy for spending $2.65 million on lobbying and not paying any taxes during 2008–2010, instead getting $284 million in tax rebates, despite making a profit of $1.9 billion and paying its top five executives between $12 and $13 million.\n\nSee also\nDeregulation of the Texas electricity market\nElectric Reliability Council of Texas (ERCOT)\nSheffield Nelson\n\nReferences\nExternal links\nOfficial website\nCompany timeline\nBusiness data for CenterPoint Energy, Inc.:",
  "clean_text": "CenterPoint Energy, Inc. is an American utility company based in Houston, Texas, that provides electric and natural gas utility to customers in several markets in the American states of Indiana, Ohio, Louisiana, Minnesota, Mississippi, and Texas. Part of the Fortune 500, the company was formerly known as Reliant Energy, NorAm Energy, Houston Industries, and HL&P. The company is headquartered in the CenterPoint Energy Tower at 1111 Louisiana Street in Downtown Houston. History When Texas deregulated the electricity market, the former Houston Lighting & Power (HL&P) was split into several companies. In 2003 HL&P was split into Reliant Energy, Texas Genco, and CenterPoint Energy. Until December 15, 2004, CenterPoint Energy and its predecessors operated in its various markets under these names; they were used separately prior to Reliant Energy, and later in conjunction with the Reliant Energy and CenterPoint Energy names: Minnegasco (natural gas throughout Minnesota) Houston Lighting and Power (or HL&P) Houston-Galveston electric provider Entex (Natural gas throughout South and East Texas, Southern Louisiana and Mississippi) Arkla (Natural gas throughout Northern Louisiana, Northeast Texas, Oklahoma, and Arkansas) In late 2004, four private equity firms—the Texas Pacific Group, the Blackstone Group, Kohlberg Kravis Roberts, and Hellman & Friedman—combined forces to purchase Texas Genco from Centerpoint. Later in 2006, Texas Genco was sold to NRG Energy of Princeton, N.J. On April 23, 2018, CenterPoint Energy and Vectren Corporation announced they had entered into a definitive merger agreement, with CenterPoint being the emerging head company. On February 1, 2019, the merger was completed and Vectren was delisted from the NYSE. CenterPoint retained the Vectren name for Vectren's service territory until it was retired on May 3, 2021. September 2008 power outage In September 2008, Hurricane Ike caused great disruption of service in the Greater Houston Area, wiping out 2.1 million of CenterPoint's 2.26 million clients' electricity. Smart meter pilot program In March 2009, the company's five-year smart meter deployment began, delivering enhanced smart meter functionality to Retail Electric Providers (REPs). The company worked with the Department of Energy for a pilot program in Texas centered on energy consumption. After working with 500-residential electricity customers in the Houston area, it was found that by using a smart meter, consumers cut down on energy use for the home. The pilot program was funded in part by the $200 million it received from the federal stimulus act. Electric vehicles In 2010, CenterPoint Energy and Ford Motor Company formed a partnership to promote adoption of electric vehicles. The two companies teamed up to work together to create electric vehicle consumer outreach and education programs; they also distributed details to various stakeholders about charging needs and the requirements needed to \"ensure the electrical infrastructure can support the necessary demand.\" Additionally: \"The Ford and CenterPoint Energy collaboration also includes developing strategies to minimize the emissions and distribution impacts of charging electric vehicles by using statewide system renewable energy resources and more efficient use of household electricity.\" 2021 Texas power outages At 1:25 a.m. on February 15, 2021, due to a major cold-weather event affecting the state of Texas, the Electric Reliability Council of Texas (ERCOT) declared a statewide power generation shortfall emergency, due to a 34,000 MW shortfall in generation causing widespread blackouts. At 1:30 a.m., CenterPoint Energy started controlled, rotating outages in the Greater Houston area. At first, the company said that the outages were expected to last 10 to 45 minutes, but soon updated its statement to say that customers who were experiencing an outage should be prepared to be without power for the rest of Monday. The company also told its customers to lower their thermostat settings temporarily to help conserve natural gas across its eight-state service territory. Overnight on Tuesday morning, CenterPoint Energy was able to restart the process of rolling the outages around, but had to stop at around 4 a.m. due to another ERCOT order because several third-party electric generators tripped offline. However, it was able to restart the process around 1:30 p.m. the same day. Later that evening, CenterPoint Energy stated online that it was given another ERCOT order to reduce electric load and warned customers to make preparations for additional outages. On Wednesday evening, CenterPoint Energy told its customers to conserve both power and natural gas starting at 6 p.m. CDT until midnight, as it was preparing to re-energize portions of the electric system. In the early hours of Thursday, the company restored electric service to approximately 1.39 million customers, while less than 7000 customers were about to be restored. Later at around Friday morning, ERCOT ended emergency conditions, saying there was enough generation to resume normal operations. 2024 Texas power outage Category 1 Hurricane Beryl made landfall in Texas the early hours of July 8, 2024. The impact of the storm left 2.2 million CenterPoint customers without power, the largest number in the company's history, and the largest number in the state's history. On July 10, 2024, a graffiti mural with the name \"CenterPointle$$\" popped up on an I-10 West underpass near the highway and Studewood Street, indicating the city's response to the company's lack of preparations and failure to give reliable information to its customers after the storm. On Friday, the Texas Department of Transportation (TxDOT) removed the graffiti mural. Criticism On December 16, 2005, CenterPoint Energy Inc. said it would restate its finances for 2004 and the first three quarters of 2005 to correct accounting errors that overstated revenue and natural gas expenses. In December 2011, the non-partisan organization Public Campaign criticized CenterPoint Energy for spending $2.65 million on lobbying and not paying any taxes during 2008–2010, instead getting $284 million in tax rebates, despite making a profit of $1.9 billion and paying its top five executives between $12 and $13 million."
}