{
  "ticker": "COF",
  "cik": "0000927628",
  "company_name": "Capital One",
  "corrected_name": "Capital One",
  "wiki_title_used": "Capital One",
  "exists": true,
  "raw_text": "Capital One Financial Corporation is an American bank holding company founded on July 21, 1994, and specializing in credit cards, auto loans, banking, and savings accounts, headquartered in Tysons, Virginia, with operations primarily in the United States. It is the sixth largest bank in the United States by total assets as of June 30, 2025, the third largest issuer of Visa and Mastercard credit cards, and one of the largest car finance companies in the United States.\nThe bank has approximately 750 branches, including 30 café style locations, and 2,000 ATMs. It is ranked 82nd on the Fortune 500, 15th on Fortune's 100 Best Companies to Work For list, and conducts business in the United States, Canada, and the United Kingdom. The company helped pioneer the mass marketing of credit cards in the 1990s.\nThe company's three divisions are credit cards, consumer banking and commercial banking. As of December 31, 2022, the company had loans receivable of $114 billion from credit cards, $75 billion from auto loans, and $85 billion from commercial loans. The company has been fined by regulators for its role in money-laundering on separate occasions and been subject to consumer class action lawsuits and government investigations in relations to its treatment of customers.\n\nHistory\nMonoline credit card company (1994–2004)\nRichard Fairbank and Nigel Morris developed the idea of using information technology and statistical analysis to create customized credit card offers for different segments of customers in 1987. At the time, most credit cards would offer the same terms—interest rate and annual fee—to almost everyone, regardless of the financial risks of each customer. However, Fairbank and Morris' idea was to drop the fee and target various credit card terms to specific customers. They consulted with Oracle Corporation on how to compile the demographics and other statistics that would help them sort out and identify those customer market segments. Funding Universe wrote:  “Fairbank and Morris’s plan would allow companies to fine-tune card product and pricing strategies for individual customers through a decision-making structure blending together marketing, credit, risk, operations and technology functions.\"\nThey then started soliciting banks regarding using their approach, indicating that they anticipated large profits based on the large numbers of customers they projected to enroll. They convinced Richmond, Virginia-based Signet Bank (now part of Wells Fargo) to start a credit card division called Signet Financial in 1988 that would utilize their approach. As part of the deal, they became employees of Signet. In 1991, Fairbank and Morris had a great success with a mass mailing that offered to transfer existing credit card balances from other banks' credit cards for the opportunity of a lower interest rate with Signet.\nOn July 21, 1994, Signet Financial Corp announced the corporate spin-off of Signet Financial, at first naming it OakStone Financial with Fairbank as CEO and Morris as COO. After the initial public offering, the new company was renamed Capital One in October 1994 and the spin-off was completed in February 1995.\nAt that time, Capital One was a monoline bank, meaning that all of its revenue came from a single product, in this case, credit cards. This strategy is risky in that it can lead to losses during bad times. Capital One attributed its relative success as a monoline to its use of data collection to build demographic profiles, allowing it to target personalized offers of credit directly to consumers.\n\nExpansion into auto loans (1996–present)\nIn 1996, Capital One moved from relying on teaser rates to generate new clients to adopting more innovative techniques that would attract more customers to their business model. At the time, it was losing customers to competitors who offered higher ceilings on loan balances and no-annual-fee accounts. The company came up with co-branded, secured, and joint account credit cards. In mid-1996, Capital One received approval from the federal government to set up Capital One FSB. This meant that the company could now retain and lend out deposits on secured cards and even issue automobile installment loans.\nIn 1996, Capital One expanded its business operations to the United Kingdom and Canada. This gave the company access to a large international market for its credit cards. An article appearing in Chief Executive in 1997 noted that the company held $12.6 billion in credit card receivables and served more than nine million customers. The company was listed in the Standard & Poor's 500, and its stock price hit the $100 mark for the first time in 1998.\nIn July 1998, Capital One acquired auto financing company Summit Acceptance Corporation.\nIn 1999, Capital One was looking to expand beyond credit cards. CEO Richard Fairbank announced moves to use Capital One's experience with collecting consumer data to offer loans, insurance, and phone service.\nIn October 2001, PeopleFirst Finance LLC was acquired by Capital One. The companies were combined and re-branded as Capital One Auto Finance Corporation in 2003.\nIn late 2002, Capital One and the United States Postal Service proposed a negotiated services agreement (NSA) for bulk discounts in mailing services. The resulting three-year agreement was extended in 2006. In June 2008, however, Capital One filed a complaint with the USPS regarding the terms of the next agreement, citing the terms of the NSA of Capital One's competitor, Bank of America. Capital One subsequently withdrew its complaint to the Postal Regulatory Commission following a settlement with the USPS.\nAutomobile loan financer Onyx Acceptance Corporation was acquired by Capital One in January 2005.\n\nExpansion into retail banking (2005–present)\nIn 2005 Capital One became the first monoline credit card issuer to buy a bank, as it entered into retail banking by acquiring Hibernia National Bank. It purchased the New Orleans, Louisiana-based Hibernia for $4.9 billion in cash and stock. It acquired Melville, New York-based North Fork Bank for $13.2 billion in cash and stock in 2006. The acquisition of retail banks greatly reduced its dependency on the credit-card business alone. It briefly considered acquiring Netspend, a marketer of prepaid debit cards, for $700 million in 2007, but the deal was not ultimately completed.\nIn 2008, Capital One debuted their blue and red \"swoosh\" logo, and underwent a $13 billion marketing campaign in the following years. The similarity of Credit One Bank's logo and the Capital One logo caused confusion among consumers, with many not realizing they were separate companies. Credit One Bank adopted their black and blue \"swoosh\" logo in 2006.\nIn February 2009, Capital One acquired Chevy Chase Bank for $520 million in cash and stock.\nIn January 2011, Capital One acquired Canada-based Hudson's Bay Company's private credit card portfolio from Synchrony Financial, then known as GE Financial.\nIn April 2011, Capital One signed a deal with Kohl's to handle Kohl's private label credit card program that was previously serviced by Chase Bank for a seven-year period for an undisclosed amount. The contract between the two companies was extended in May 2014.\nIn August 2011, Capital One reached a deal with HSBC to acquire its U.S. credit card operations. Capital One paid $31.3 billion in exchange for $28.2 billion in loans and $600 million in other assets. The acquisition was completed in May 2012. The acquisition also included private issued credit cards for such companies as Saks Fifth Avenue, Neiman Marcus, and Lord & Taylor that were previously handled by HSBC.\nIn February 2012, along with several other banks, Capital One announced support for the Isis Mobile Wallet payment system. However, in September 2013, Capital One dropped support for the venture.\nIn 2012, Capital One closed 41 branch locations.\nIn 2014, Capital One amended its terms of use to allow it to \"contact you in any manner we choose\", including a \"personal visit . . . at your home and at your place of employment\". It also asserted its right to \"modify or suppress caller ID and similar services and identify ourselves on these services in any manner we choose\". The company stated that it would not actually make personal visits to customers except \"As a last resort, . . . if it becomes necessary to repossess [a] sports vehicle\". Capital One also attributed its assertion of a right to \"spoof\" as necessary because \"sometimes the number is 'displayed differently' by 'some local phone exchanges,' something that is 'beyond our control'\".\nIn February 2014, Capital One became a 25 percent owner in ClearXchange, a Peer-to-peer transaction money transfer service designed to make electronic funds transfers to customers within the same bank and other financial institutions via mobile phone number or email address. ClearXchange was sold to Early Warning in 2016.\nIn October 2014, Capital One acquired Adaptive Path, a San Francisco-based user experience and digital design consultancy.\nIn January 2015, Capital One acquired Level Money, a budgeting app for consumers.\nIn 2015, Capital One closed several branch locations to leave 174 operating branches in the D.C. metro area.\nIn July 2015, the company acquired Monsoon, a design studio, development shop, marketing house and strategic consultancy.\nIn 2015, Capital One acquired General Electric's Healthcare Financial Services unit, which included $8.5 billion in loans made to businesses in the healthcare industry, for $9 billion.\nIn October 2016, Capital One acquired Paribus, a price tracking service, for an undisclosed amount.\nIn July 2019, Capital One signed a deal with Walmart to handle Walmart's private label and co-branded credit card programs that was previously serviced by Synchrony Financial. Walmart terminated the deal in April 2024 after customer service failures by Capital One.\n\nIn November 2021, the company introduced Venture X, a travel rewards credit card, with a $395 annual fee.\n\nExit from mortgage banking (2006–2007 and 2011–2017)\nIn December 2006, Capital One acquired its GreenPoint Mortgage unit when the company paid $13.2 billion for North Fork Bancorp Inc. During the subprime mortgage crisis, Capital One closed its mortgage platform, GreenPoint Mortgage, due in part to investor pressures, cutting 1,900 jobs and costing the company $860 million in charges. The U.S. Securities and Exchange Commission criticized Capital One's conduct during the crisis, claiming that they understated auto loan losses during the 2008 financial crisis. In 2013, Capital One paid $3.5 million to settle the case, but was not required to directly address the allegations of wrongdoing. In 2008, Capital One received an investment of $3.56 billion from the United States Treasury as a result of the Troubled Asset Relief Program. On June 17, 2009, Capital One completed the repurchase of the stock the company issued to the U.S. Treasury paying a total of $3.67 billion, resulting in a profit of over $100 million to the U.S. Treasury.\nThe re-emergence into the mortgage industry came in June 2011, when ING Group announced the sale of its ING Direct division to Capital One for $9 billion in cash and stock. On August 26, 2011, the Federal Reserve Board of Governors announced it would hold public hearings on the Capital One acquisition of ING Direct, and extend to October 12, 2011, the public comment period that had been scheduled to end August 22. The move came amidst rising scrutiny of the deal on systemic risk, or \"Too-Big-to-Fail,\" performance under the Community Reinvestment Act, and pending legal challenges. A coalition of national civil rights and consumer groups, led by the National Community Reinvestment Coalition, were joined by Rep. Barney Frank to challenge immediate approval of the deal. The groups argued that the acquisition was a test of the Dodd-Frank Wall Street Reform and Consumer Protection Act, under which systemically risky firms must demonstrate a public benefit that outweighs new risk before they are allowed to grow. Kansas City Federal Reserve Bank head Thomas M. Hoenig was also skeptical of the deal. In February 2012, the acquisition was approved by regulators and Capital One completed its acquisition of ING Direct. Capital One received permission to merge ING into its business in October 2012, and rebranded ING Direct as Capital One 360 in November 2012.\nIn November 2017, President of Financial Services Sanjiv Yajnik announced that the mortgage market was too competitive in the low rate environment to make money in the business. The company exited the mortgage origination business on November 7, 2017, laying off 1,100 employees.\n\nTelevision advertisements\nBeginning in 2010, Alec Baldwin appeared in a television campaign for Capital One as their spokesperson. Following his 2013 confrontation with a videographer reported by TMZ, his contract was not renewed, and he was succeeded in the campaign by Jennifer Garner.\nIn 2012 Capital One released an advert featuring British power metal band DragonForce. The advert showed Herman Li and Sam Totman playing guitar on an asteroid while using Capital One's mobile app.\n\nOther acquisitions\nConfyrm\nIn May 2018, the company acquired Confyrm, a digital identity and fraud alert service.\n\nCapital One Shopping\nIn November 2018, Capital One acquired Wikibuy, a shopping comparison app and browser extension from an Austin, Texas start-up business. Wikibuy continues to operate the service which is now named Capital One Shopping.\n\nDiscover Financial Services\nCapital One announced on February 19, 2024 that it had agreed to acquire Discover Financial in an all-stock deal worth $35.3 billion. If the deal is approved by regulators, the combined company will become the largest credit card issuer in the U.S. Jamie Dimon, CEO of rival firm, JPMorgan Chase, said he welcomed the deal, even if his bank would be surpassed as the country's biggest credit card lender. He also praised the firm's CEO, Richard Fairbank.\nThe Attorney General of New York launched an investigation into whether the company's takeover of Discover would violate state anti-trust laws. In July 2024, a proposed consumer class action lawsuit was also filed in Virginia, claiming that it would be in violation of federal antitrust laws, forming the largest U.S. credit card issuer by balance and sixth-largest U.S. bank by assets.\nThe deal was approved by U.S. banking regulators in April 2025. The acquisition was completed on May 18, 2025.\n\nDivisions\nCapital One operates 3 divisions as follows:\n\nCredit cards – Capital One issues credit cards in the United States, Canada, and the United Kingdom and is the 3rd largest credit card issuer, after JPMorgan Chase and Citigroup. As of December 31, 2018, Capital One had $107.350 billion in credit card loans outstanding in the United States and $9.011 billion of credit card loans outstanding in Canada and the United Kingdom, with credit cards representing 47.3 percent of total loans outstanding.\nConsumer banking – Capital One offers banking services, including checking accounts, saving accounts, and money market accounts via its branches and direct bank as well as retail and auto loans. As of December 31, 2018, the company had $2.864 billion in retail loans outstanding and $56.341 billion in car finance loans outstanding, representing 22.9 percent of total loans outstanding.\nCommercial banking – As of December 31, 2018, Capital One had $70.333 billion in loans outstanding secured by commercial, multifamily, and industrial properties, representing 28.6 percent of total loans outstanding.\n\nSports marketing\nFrom 2001 to 2014, Capital One was the principal sponsor of the college football Florida Citrus Bowl, which was called the Capital One Bowl from 2003 to 2014. It sponsored a mascot challenge every year, announcing the winner on the day of the Capital One Bowl. The name of the bowl game was changed in 2015 to the Buffalo Wild Wings Citrus Bowl.\nCapital One is the title sponsor of the Orange Bowl since 2015.\nCapital One Venture X is the presenting sponsor of the Rose Bowl Game since 2022.\nCapital One is one of the top three sponsors of the NCAA, paying an estimated $35 million annually in exchange for advertising and access to consumer data. Capital One also sponsored the EFL Cup, an English soccer knockout tournament, from 2012 to 2016. The company sponsored English soccer clubs Nottingham Forest from 2003 to 2009 and Sheffield United from 2006 to 2008. From 2009 to 2022, the University of Maryland Terrapins football team played at Capital One Field at Maryland Stadium (formerly Byrd Stadium), a naming-rights deal inherited in the bank's acquisition of Chevy Chase Bank. In 2017, the company became the sponsor of the Capital One Arena in Washington D.C.\nIn 2018, to celebrate the Washington Capitals' second-ever Stanley Cup Finals appearance, the firm temporarily changed its logo by replacing the word \"Capital\" with the Capitals' titular logo, without the \"s\" plural.\nIn March 2022, Major League Baseball announced that Capital One is the official bank and credit card and presenting sponsor of the World Series. In March 2022, Capital One also announced a partnership with Vivid Seats Inc. to launch Capital One Entertainment, a rewards programs for cards holders.\n\nCorporate citizenship\nCapital One operates some charitable programs. The accountability organization National Committee for Responsive Philanthropy has been highly critical of Capital One's relatively low rate of giving, stating that \"Capital One's philanthropic track record is dismal\". The organization pointed out that Capital One's donations of 0.024% of revenue were much less than the industry median of 0.11% of revenue. Capital One has disputed the groups figures, saying that \"... In 2011 alone, our giving totals are more than 6 times greater ($30 million) than the number given by the NCRP\".\n\nInvestigations and legal actions\nFines for misleading customers to pay extra for services\nIn July 2012, Capital One was fined by the Office of the Comptroller of the Currency and the Consumer Financial Protection Bureau for misleading millions of its customers, for example by requiring customers to pay extra for payment protection or credit monitoring when they took out a card. The company agreed to pay $210 million to settle the legal action and to refund two million customers. This was the CFPB's first public enforcement action.\n\nAutomated dialing to customers' phones\nIn August 2014, Capital One and three collection agencies entered into an agreement to pay $75.5 million to end a consolidated class action lawsuit pending in the United States District Court for the Northern District of Illinois alleging that the companies used an automated dialer to call customers' cellphones without consent, which is a violation of the Telephone Consumer Protection Act of 1991. It is notable that this legal action involved informational telephone calls, which are not subject to the \"prior express written consent\" requirements which have been in place for telemarketing calls since October 2013.\n\nJuly 2019 security breach\nCapital One publicly acknowledged on July 29, 2019, that they had found unauthorized access had occurred ten days earlier by an individual who had breached the account and identity security of 106 million people in the United States and Canada, one of the largest data breaches of personal information. The FBI arrested Paige Thompson, who had previously worked as a software engineer for Amazon Web Services, Capital One's cloud hosting company. Capital One declared that Thompson had accessed about 140,000 Social Security numbers, a million Canadian social insurance numbers; 80,000 bank account numbers, and an unknown number of names and addresses of customers. Capital One began offering free credit monitoring services and identity protection to those affected by the breach. It was ultimately determined there was no evidence the data was shared by Thompson.\nAmazon stated that the security vulnerability she used to access Capital One could have been discovered by anyone, the information that facilitated her activity was not gained from work at Amazon, and that she gained access via \"a misconfiguration of the (Capital One-designed) web application and not the underlying (Amazon-designed) cloud-based infrastructure\".\nIn 2022, Thompson was convicted of five felonies and two misdemeanors. She was sentenced to time served and five years of probation.\n\nCapital One response\nCapital One was alerted to the breach on July 17, 2019, 12 days before they publicly acknowledged it. Several Capital One customers stated that the first time they heard about the hack was through the media and the bank did not disclose the breach or explain its implications to affected customers. On social media and in the mainstream press, Capital One's contradictory July 2019 press statement was mocked for saying \"No bank account numbers or Social Security numbers were compromised,\" but then listing hundreds of thousands of bank account numbers and Social Security numbers that were compromised.\n\nFederal Reserve action\nOn August 6, 2020, the Federal Reserve Board of Governors announced a cease and desist order against Capital One resulting from the breach. The order mandated, among other things, significant improvements in Capital One's governance, risk management and compliance (GRC) practices. The Federal Reserve ended the enforcement action in 2023.\n\nLawsuits\nLawsuits were filed against Capital One and its employees in federal and circuit courts, led by the firms Colson Hicks Eidson, Franklin D. Azar and Associates P.C., and several others.\nTwo consumer class action lawsuits filed against Capital One in Virginia were reported in July 2024. A suit related to its acquisition of ING Direct USA, in 2012, claimed that, since February 2013, the company unfairly maintained 360 Savings online savings account as a higher yield rate than was available to its other depositors. Later that month, a proposed consumer class action was also filed, in a bid to block a merger with Discover Financial, claiming that the acquisition would be in violation of federal antitrust laws.\nThe State of New York filed New York v. Capital One NA et al (No. 25-04037), in the U.S. District Court, Southern District of New York, suing Capital One in May 2025, on behalf of depositors promised high interest rates on their 360 Savings accounts, which were subsequently frozen at 0.30%, while interest rates rose in the United States. A federal judge rejected the company's proposed $425 million settlement in November 2025.\n\nGovernment investigations\nIn 2015 the bank disclosed that it was under federal investigation for bank fraud, money laundering, and possible racketeering charges. No further information was given and government investigators would only confirm that it was under scrutiny for \"unspecified charges\".\nIn 2018, Capital One was fined $100 million for failure to monitor, detect, and prevent money laundering. Charging documents specified Capital One failed to file suspicious activity reports, had deficiencies in its risk assessment, remote deposit capture and generally had weaknesses that compromised  national bank security controls. The bank was the subject of a larger investigation that alleged funds were siphoned out of US jurisdiction to safe havens.\nIn January 2021, Capital One was fined $390 million by FINCEN for anti-money laundering control failure concerning a now-defunct small portfolio of check-cashing businesses that Capital One acquired around 2008 and subsequently exited from in 2014. Capital One later admitted that it failed to file thousands of suspicious activity reports and lapsed on filing currency transaction reports on around 50,000 reportable cash transactions valued around $16 billion.\nIn January 2025, the Consumer Financial Protection Bureau sued Capital One for cheating savings account holders out of $2 billion by \"deceptive, abusive and illegal\" practices which obscured the difference between the high-interest \"360 Performance Savings\" accounts vs. low-interest \"360 Savings\" accounts. In February 2025, shortly after Donald Trump became president, the CFPB dropped its lawsuit against Capital One.\n\nNotable office buildings\nCapital One Tower (McLean, VA) - company headquarters\nTrent House (Nottingham, England) - Europe headquarters\nCapital One West Creek (Richmond, VA)\n7933 Preston Road Plano (Dallas, TX)\nPlace St. Charles (New Orleans, LA)\n77 West Wacker Drive (Chicago, IL)\n299 Park Avenue (New York, NY)\n114 Fifth Avenue (New York, NY)\n11 W 19th Street (New York, NY)\n314 Main Street (Cambridge, MA)\n675 Ponce De Leon Ave NE (Atlanta, GA)\n201 Third Street (San Francisco, CA)\n1735 Market Street (Philadelphia, PA)\n802 Delaware Ave, Wilmington DE\n\nReferences\nExternal links\n\nOfficial website \nOfficial website (Canada)\nOfficial website (United Kingdom)\nBusiness data for Capital One Financial Corporation:",
  "clean_text": "Capital One Financial Corporation is an American bank holding company founded on July 21, 1994, and specializing in credit cards, auto loans, banking, and savings accounts, headquartered in Tysons, Virginia, with operations primarily in the United States. It is the sixth largest bank in the United States by total assets as of June 30, 2025, the third largest issuer of Visa and Mastercard credit cards, and one of the largest car finance companies in the United States. The bank has approximately 750 branches, including 30 café style locations, and 2,000 ATMs. It is ranked 82nd on the Fortune 500, 15th on Fortune's 100 Best Companies to Work For list, and conducts business in the United States, Canada, and the United Kingdom. The company helped pioneer the mass marketing of credit cards in the 1990s. The company's three divisions are credit cards, consumer banking and commercial banking. As of December 31, 2022, the company had loans receivable of $114 billion from credit cards, $75 billion from auto loans, and $85 billion from commercial loans. The company has been fined by regulators for its role in money-laundering on separate occasions and been subject to consumer class action lawsuits and government investigations in relations to its treatment of customers. History Monoline credit card company (1994–2004) Richard Fairbank and Nigel Morris developed the idea of using information technology and statistical analysis to create customized credit card offers for different segments of customers in 1987. At the time, most credit cards would offer the same terms—interest rate and annual fee—to almost everyone, regardless of the financial risks of each customer. However, Fairbank and Morris' idea was to drop the fee and target various credit card terms to specific customers. They consulted with Oracle Corporation on how to compile the demographics and other statistics that would help them sort out and identify those customer market segments. Funding Universe wrote: “Fairbank and Morris’s plan would allow companies to fine-tune card product and pricing strategies for individual customers through a decision-making structure blending together marketing, credit, risk, operations and technology functions.\" They then started soliciting banks regarding using their approach, indicating that they anticipated large profits based on the large numbers of customers they projected to enroll. They convinced Richmond, Virginia-based Signet Bank (now part of Wells Fargo) to start a credit card division called Signet Financial in 1988 that would utilize their approach. As part of the deal, they became employees of Signet. In 1991, Fairbank and Morris had a great success with a mass mailing that offered to transfer existing credit card balances from other banks' credit cards for the opportunity of a lower interest rate with Signet. On July 21, 1994, Signet Financial Corp announced the corporate spin-off of Signet Financial, at first naming it OakStone Financial with Fairbank as CEO and Morris as COO. After the initial public offering, the new company was renamed Capital One in October 1994 and the spin-off was completed in February 1995. At that time, Capital One was a monoline bank, meaning that all of its revenue came from a single product, in this case, credit cards. This strategy is risky in that it can lead to losses during bad times. Capital One attributed its relative success as a monoline to its use of data collection to build demographic profiles, allowing it to target personalized offers of credit directly to consumers. Expansion into auto loans (1996–present) In 1996, Capital One moved from relying on teaser rates to generate new clients to adopting more innovative techniques that would attract more customers to their business model. At the time, it was losing customers to competitors who offered higher ceilings on loan balances and no-annual-fee accounts. The company came up with co-branded, secured, and joint account credit cards. In mid-1996, Capital One received approval from the federal government to set up Capital One FSB. This meant that the company could now retain and lend out deposits on secured cards and even issue automobile installment loans. In 1996, Capital One expanded its business operations to the United Kingdom and Canada. This gave the company access to a large international market for its credit cards. An article appearing in Chief Executive in 1997 noted that the company held $12.6 billion in credit card receivables and served more than nine million customers. The company was listed in the Standard & Poor's 500, and its stock price hit the $100 mark for the first time in 1998. In July 1998, Capital One acquired auto financing company Summit Acceptance Corporation. In 1999, Capital One was looking to expand beyond credit cards. CEO Richard Fairbank announced moves to use Capital One's experience with collecting consumer data to offer loans, insurance, and phone service. In October 2001, PeopleFirst Finance LLC was acquired by Capital One. The companies were combined and re-branded as Capital One Auto Finance Corporation in 2003. In late 2002, Capital One and the United States Postal Service proposed a negotiated services agreement (NSA) for bulk discounts in mailing services. The resulting three-year agreement was extended in 2006. In June 2008, however, Capital One filed a complaint with the USPS regarding the terms of the next agreement, citing the terms of the NSA of Capital One's competitor, Bank of America. Capital One subsequently withdrew its complaint to the Postal Regulatory Commission following a settlement with the USPS. Automobile loan financer Onyx Acceptance Corporation was acquired by Capital One in January 2005. Expansion into retail banking (2005–present) In 2005 Capital One became the first monoline credit card issuer to buy a bank, as it entered into retail banking by acquiring Hibernia National Bank. It purchased the New Orleans, Louisiana-based Hibernia for $4.9 billion in cash and stock. It acquired Melville, New York-based North Fork Bank for $13.2 billion in cash and stock in 2006. The acquisition of retail banks greatly reduced its dependency on the credit-card business alone. It briefly considered acquiring Netspend, a marketer of prepaid debit cards, for $700 million in 2007, but the deal was not ultimately completed. In 2008, Capital One debuted their blue and red \"swoosh\" logo, and underwent a $13 billion marketing campaign in the following years. The similarity of Credit One Bank's logo and the Capital One logo caused confusion among consumers, with many not realizing they were separate companies. Credit One Bank adopted their black and blue \"swoosh\" logo in 2006. In February 2009, Capital One acquired Chevy Chase Bank for $520 million in cash and stock. In January 2011, Capital One acquired Canada-based Hudson's Bay Company's private credit card portfolio from Synchrony Financial, then known as GE Financial. In April 2011, Capital One signed a deal with Kohl's to handle Kohl's private label credit card program that was previously serviced by Chase Bank for a seven-year period for an undisclosed amount. The contract between the two companies was extended in May 2014. In August 2011, Capital One reached a deal with HSBC to acquire its U.S. credit card operations. Capital One paid $31.3 billion in exchange for $28.2 billion in loans and $600 million in other assets. The acquisition was completed in May 2012. The acquisition also included private issued credit cards for such companies as Saks Fifth Avenue, Neiman Marcus, and Lord & Taylor that were previously handled by HSBC. In February 2012, along with several other banks, Capital One announced support for the Isis Mobile Wallet payment system. However, in September 2013, Capital One dropped support for the venture. In 2012, Capital One closed 41 branch locations. In 2014, Capital One amended its terms of use to allow it to \"contact you in any manner we choose\", including a \"personal visit . . . at your home and at your place of employment\". It also asserted its right to \"modify or suppress caller ID and similar services and identify ourselves on these services in any manner we choose\". The company stated that it would not actually make personal visits to customers except \"As a last resort, . . . if it becomes necessary to repossess [a] sports vehicle\". Capital One also attributed its assertion of a right to \"spoof\" as necessary because \"sometimes the number is 'displayed differently' by 'some local phone exchanges,' something that is 'beyond our control'\". In February 2014, Capital One became a 25 percent owner in ClearXchange, a Peer-to-peer transaction money transfer service designed to make electronic funds transfers to customers within the same bank and other financial institutions via mobile phone number or email address. ClearXchange was sold to Early Warning in 2016. In October 2014, Capital One acquired Adaptive Path, a San Francisco-based user experience and digital design consultancy. In January 2015, Capital One acquired Level Money, a budgeting app for consumers. In 2015, Capital One closed several branch locations to leave 174 operating branches in the D.C. metro area. In July 2015, the company acquired Monsoon, a design studio, development shop, marketing house and strategic consultancy. In 2015, Capital One acquired General Electric's Healthcare Financial Services unit, which included $8.5 billion in loans made to businesses in the healthcare industry, for $9 billion. In October 2016, Capital One acquired Paribus, a price tracking service, for an undisclosed amount. In July 2019, Capital One signed a deal with Walmart to handle Walmart's private label and co-branded credit card programs that was previously serviced by Synchrony Financial. Walmart terminated the deal in April 2024 after customer service failures by Capital One. In November 2021, the company introduced Venture X, a travel rewards credit card, with a $395 annual fee. Exit from mortgage banking (2006–2007 and 2011–2017) In December 2006, Capital One acquired its GreenPoint Mortgage unit when the company paid $13.2 billion for North Fork Bancorp Inc. During the subprime mortgage crisis, Capital One closed its mortgage platform, GreenPoint Mortgage, due in part to investor pressures, cutting 1,900 jobs and costing the company $860 million in charges. The U.S. Securities and Exchange Commission criticized Capital One's conduct during the crisis, claiming that they understated auto loan losses during the 2008 financial crisis. In 2013, Capital One paid $3.5 million to settle the case, but was not required to directly address the allegations of wrongdoing. In 2008, Capital One received an investment of $3.56 billion from the United States Treasury as a result of the Troubled Asset Relief Program. On June 17, 2009, Capital One completed the repurchase of the stock the company issued to the U.S. Treasury paying a total of $3.67 billion, resulting in a profit of over $100 million to the U.S. Treasury. The re-emergence into the mortgage industry came in June 2011, when ING Group announced the sale of its ING Direct division to Capital One for $9 billion in cash and stock. On August 26, 2011, the Federal Reserve Board of Governors announced it would hold public hearings on the Capital One acquisition of ING Direct, and extend to October 12, 2011, the public comment period that had been scheduled to end August 22. The move came amidst rising scrutiny of the deal on systemic risk, or \"Too-Big-to-Fail,\" performance under the Community Reinvestment Act, and pending legal challenges. A coalition of national civil rights and consumer groups, led by the National Community Reinvestment Coalition, were joined by Rep. Barney Frank to challenge immediate approval of the deal. The groups argued that the acquisition was a test of the Dodd-Frank Wall Street Reform and Consumer Protection Act, under which systemically risky firms must demonstrate a public benefit that outweighs new risk before they are allowed to grow. Kansas City Federal Reserve Bank head Thomas M. Hoenig was also skeptical of the deal. In February 2012, the acquisition was approved by regulators and Capital One completed its acquisition of ING Direct. Capital One received permission to merge ING into its business in October 2012, and rebranded ING Direct as Capital One 360 in November 2012. In November 2017, President of Financial Services Sanjiv Yajnik announced that the mortgage market was too competitive in the low rate environment to make money in the business. The company exited the mortgage origination business on November 7, 2017, laying off 1,100 employees. Television advertisements Beginning in 2010, Alec Baldwin appeared in a television campaign for Capital One as their spokesperson. Following his 2013 confrontation with a videographer reported by TMZ, his contract was not renewed, and he was succeeded in the campaign by Jennifer Garner. In 2012 Capital One released an advert featuring British power metal band DragonForce. The advert showed Herman Li and Sam Totman playing guitar on an asteroid while using Capital One's mobile app. Other acquisitions Confyrm In May 2018, the company acquired Confyrm, a digital identity and fraud alert service. Capital One Shopping In November 2018, Capital One acquired Wikibuy, a shopping comparison app and browser extension from an Austin, Texas start-up business. Wikibuy continues to operate the service which is now named Capital One Shopping. Discover Financial Services Capital One announced on February 19, 2024 that it had agreed to acquire Discover Financial in an all-stock deal worth $35.3 billion. If the deal is approved by regulators, the combined company will become the largest credit card issuer in the U.S. Jamie Dimon, CEO of rival firm, JPMorgan Chase, said he welcomed the deal, even if his bank would be surpassed as the country's biggest credit card lender. He also praised the firm's CEO, Richard Fairbank. The Attorney General of New York launched an investigation into whether the company's takeover of Discover would violate state anti-trust laws. In July 2024, a proposed consumer class action lawsuit was also filed in Virginia, claiming that it would be in violation of federal antitrust laws, forming the largest U.S. credit card issuer by balance and sixth-largest U.S. bank by assets. The deal was approved by U.S. banking regulators in April 2025. The acquisition was completed on May 18, 2025. Divisions Capital One operates 3 divisions as follows: Credit cards – Capital One issues credit cards in the United States, Canada, and the United Kingdom and is the 3rd largest credit card issuer, after JPMorgan Chase and Citigroup. As of December 31, 2018, Capital One had $107.350 billion in credit card loans outstanding in the United States and $9.011 billion of credit card loans outstanding in Canada and the United Kingdom, with credit cards representing 47.3 percent of total loans outstanding. Consumer banking – Capital One offers banking services, including checking accounts, saving accounts, and money market accounts via its branches and direct bank as well as retail and auto loans. As of December 31, 2018, the company had $2.864 billion in retail loans outstanding and $56.341 billion in car finance loans outstanding, representing 22.9 percent of total loans outstanding. Commercial banking – As of December 31, 2018, Capital One had $70.333 billion in loans outstanding secured by commercial, multifamily, and industrial properties, representing 28.6 percent of total loans outstanding. Sports marketing From 2001 to 2014, Capital One was the principal sponsor of the college football Florida Citrus Bowl, which was called the Capital One Bowl from 2003 to 2014. It sponsored a mascot challenge every year, announcing the winner on the day of the Capital One Bowl. The name of the bowl game was changed in 2015 to the Buffalo Wild Wings Citrus Bowl. Capital One is the title sponsor of the Orange Bowl since 2015. Capital One Venture X is the presenting sponsor of the Rose Bowl Game since 2022. Capital One is one of the top three sponsors of the NCAA, paying an estimated $35 million annually in exchange for advertising and access to consumer data. Capital One also sponsored the EFL Cup, an English soccer knockout tournament, from 2012 to 2016. The company sponsored English soccer clubs Nottingham Forest from 2003 to 2009 and Sheffield United from 2006 to 2008. From 2009 to 2022, the University of Maryland Terrapins football team played at Capital One Field at Maryland Stadium (formerly Byrd Stadium), a naming-rights deal inherited in the bank's acquisition of Chevy Chase Bank. In 2017, the company became the sponsor of the Capital One Arena in Washington D.C. In 2018, to celebrate the Washington Capitals' second-ever Stanley Cup Finals appearance, the firm temporarily changed its logo by replacing the word \"Capital\" with the Capitals' titular logo, without the \"s\" plural. In March 2022, Major League Baseball announced that Capital One is the official bank and credit card and presenting sponsor of the World Series. In March 2022, Capital One also announced a partnership with Vivid Seats Inc. to launch Capital One Entertainment, a rewards programs for cards holders. Corporate citizenship Capital One operates some charitable programs. The accountability organization National Committee for Responsive Philanthropy has been highly critical of Capital One's relatively low rate of giving, stating that \"Capital One's philanthropic track record is dismal\". The organization pointed out that Capital One's donations of 0.024% of revenue were much less than the industry median of 0.11% of revenue. Capital One has disputed the groups figures, saying that \"... In 2011 alone, our giving totals are more than 6 times greater ($30 million) than the number given by the NCRP\". Investigations and legal actions Fines for misleading customers to pay extra for services In July 2012, Capital One was fined by the Office of the Comptroller of the Currency and the Consumer Financial Protection Bureau for misleading millions of its customers, for example by requiring customers to pay extra for payment protection or credit monitoring when they took out a card. The company agreed to pay $210 million to settle the legal action and to refund two million customers. This was the CFPB's first public enforcement action. Automated dialing to customers' phones In August 2014, Capital One and three collection agencies entered into an agreement to pay $75.5 million to end a consolidated class action lawsuit pending in the United States District Court for the Northern District of Illinois alleging that the companies used an automated dialer to call customers' cellphones without consent, which is a violation of the Telephone Consumer Protection Act of 1991. It is notable that this legal action involved informational telephone calls, which are not subject to the \"prior express written consent\" requirements which have been in place for telemarketing calls since October 2013. July 2019 security breach Capital One publicly acknowledged on July 29, 2019, that they had found unauthorized access had occurred ten days earlier by an individual who had breached the account and identity security of 106 million people in the United States and Canada, one of the largest data breaches of personal information. The FBI arrested Paige Thompson, who had previously worked as a software engineer for Amazon Web Services, Capital One's cloud hosting company. Capital One declared that Thompson had accessed about 140,000 Social Security numbers, a million Canadian social insurance numbers; 80,000 bank account numbers, and an unknown number of names and addresses of customers. Capital One began offering free credit monitoring services and identity protection to those affected by the breach. It was ultimately determined there was no evidence the data was shared by Thompson. Amazon stated that the security vulnerability she used to access Capital One could have been discovered by anyone, the information that facilitated her activity was not gained from work at Amazon, and that she gained access via \"a misconfiguration of the (Capital One-designed) web application and not the underlying (Amazon-designed) cloud-based infrastructure\". In 2022, Thompson was convicted of five felonies and two misdemeanors. She was sentenced to time served and five years of probation. Capital One response Capital One was alerted to the breach on July 17, 2019, 12 days before they publicly acknowledged it. Several Capital One customers stated that the first time they heard about the hack was through the media and the bank did not disclose the breach or explain its implications to affected customers. On social media and in the mainstream press, Capital One's contradictory July 2019 press statement was mocked for saying \"No bank account numbers or Social Security numbers were compromised,\" but then listing hundreds of thousands of bank account numbers and Social Security numbers that were compromised. Federal Reserve action On August 6, 2020, the Federal Reserve Board of Governors announced a cease and desist order against Capital One resulting from the breach. The order mandated, among other things, significant improvements in Capital One's governance, risk management and compliance (GRC) practices. The Federal Reserve ended the enforcement action in 2023. Lawsuits Lawsuits were filed against Capital One and its employees in federal and circuit courts, led by the firms Colson Hicks Eidson, Franklin D. Azar and Associates P.C., and several others. Two consumer class action lawsuits filed against Capital One in Virginia were reported in July 2024. A suit related to its acquisition of ING Direct USA, in 2012, claimed that, since February 2013, the company unfairly maintained 360 Savings online savings account as a higher yield rate than was available to its other depositors. Later that month, a proposed consumer class action was also filed, in a bid to block a merger with Discover Financial, claiming that the acquisition would be in violation of federal antitrust laws. The State of New York filed New York v. Capital One NA et al (No. 25-04037), in the U.S. District Court, Southern District of New York, suing Capital One in May 2025, on behalf of depositors promised high interest rates on their 360 Savings accounts, which were subsequently frozen at 0.30%, while interest rates rose in the United States. A federal judge rejected the company's proposed $425 million settlement in November 2025. Government investigations In 2015 the bank disclosed that it was under federal investigation for bank fraud, money laundering, and possible racketeering charges. No further information was given and government investigators would only confirm that it was under scrutiny for \"unspecified charges\". In 2018, Capital One was fined $100 million for failure to monitor, detect, and prevent money laundering. Charging documents specified Capital One failed to file suspicious activity reports, had deficiencies in its risk assessment, remote deposit capture and generally had weaknesses that compromised national bank security controls. The bank was the subject of a larger investigation that alleged funds were siphoned out of US jurisdiction to safe havens. In January 2021, Capital One was fined $390 million by FINCEN for anti-money laundering control failure concerning a now-defunct small portfolio of check-cashing businesses that Capital One acquired around 2008 and subsequently exited from in 2014. Capital One later admitted that it failed to file thousands of suspicious activity reports and lapsed on filing currency transaction reports on around 50,000 reportable cash transactions valued around $16 billion. In January 2025, the Consumer Financial Protection Bureau sued Capital One for cheating savings account holders out of $2 billion by \"deceptive, abusive and illegal\" practices which obscured the difference between the high-interest \"360 Performance Savings\" accounts vs. low-interest \"360 Savings\" accounts. In February 2025, shortly after Donald Trump became president, the CFPB dropped its lawsuit against Capital One. Notable office buildings Capital One Tower (McLean, VA) - company headquarters Trent House (Nottingham, England) - Europe headquarters Capital One West Creek (Richmond, VA) 7933 Preston Road Plano (Dallas, TX) Place St. Charles (New Orleans, LA) 77 West Wacker Drive (Chicago, IL) 299 Park Avenue (New York, NY) 114 Fifth Avenue (New York, NY) 11 W 19th Street (New York, NY) 314 Main Street (Cambridge, MA) 675 Ponce De Leon Ave NE (Atlanta, GA) 201 Third Street (San Francisco, CA) 1735 Market Street (Philadelphia, PA) 802 Delaware Ave, Wilmington DE"
}