{
  "ticker": "COO",
  "cik": "0000711404",
  "company_name": "Cooper Companies (The)",
  "corrected_name": "The Cooper Companies",
  "wiki_title_used": "The Cooper Companies",
  "exists": true,
  "raw_text": "The Cooper Companies, Inc., branded as CooperCompanies, is a global medical device company headquartered in San Ramon, California. The company consists of two business units, CooperVision (CVI) which manufactures contact lenses, and CooperSurgical (CSI), which manufactures medical devices and fertility and genomic products for the women's healthcare market.\n\nHistory\nCooperCompanies was founded in 1958 as Martin H. Smith Co. and in 1961, incorporated as Cooper Tinsley Laboratories Inc. The company changed its name to Cooper Laboratories Inc. in 1967, and entered the contact lens business when it acquired British lens maker GlobalVision in 1972.\nIn 1980, Cooper Laboratories reorganized into three business groups: CooperVision, CooperCare and CooperBiomedical, with Cooper Medical Devices Corp. added as a fourth group one year later.\nThe company was renamed The Cooper Companies in 1987. Three years later, it was further restructured into three business units: CooperVision, CooperSurgical and CooperVision Pharmaceuticals (dissolved in 2003).\nCurrently, the firm operates as two business units: CooperVision and CooperSurgical. CooperVision serves contact lens wearers and eye care practitioners. Products include a range of daily, two-week and monthly disposable contact lenses, and other spherical, toric and multifocal lenses for astigmatism, nearsightedness and farsightedness, and presbyopia.\nCooperSurgical is the medical device and fertility and genomics unit of the companies. It became a business unit in 1990 and its focus includes women's health and fertility.\n\nAcquisitions\nOcular Sciences Inc. was acquired by CooperVision in 2005.\nCooperSurgical acquired AEGEA Medical, a medical manufacturing company in February 2021. A month later, in March, the company acquired Safe Obstetric Systems, and in December 2021, CooperSurgical acquired Generate Life Sciences for $1.6 billion.\nIn March 2022, CooperSurgical acquired Cook Medical's reproductive health business for $875 million. During that same year the company acquired EnsEyers, a supplier of orthokeratology and scleral contact lenses.\n\nSee also\nList of S&P 400 companies\n\nReferences\nExternal links\nBusiness data for The Cooper Companies, Inc.:",
  "clean_text": "The Cooper Companies, Inc., branded as CooperCompanies, is a global medical device company headquartered in San Ramon, California. The company consists of two business units, CooperVision (CVI) which manufactures contact lenses, and CooperSurgical (CSI), which manufactures medical devices and fertility and genomic products for the women's healthcare market. History CooperCompanies was founded in 1958 as Martin H. Smith Co. and in 1961, incorporated as Cooper Tinsley Laboratories Inc. The company changed its name to Cooper Laboratories Inc. in 1967, and entered the contact lens business when it acquired British lens maker GlobalVision in 1972. In 1980, Cooper Laboratories reorganized into three business groups: CooperVision, CooperCare and CooperBiomedical, with Cooper Medical Devices Corp. added as a fourth group one year later. The company was renamed The Cooper Companies in 1987. Three years later, it was further restructured into three business units: CooperVision, CooperSurgical and CooperVision Pharmaceuticals (dissolved in 2003). Currently, the firm operates as two business units: CooperVision and CooperSurgical. CooperVision serves contact lens wearers and eye care practitioners. Products include a range of daily, two-week and monthly disposable contact lenses, and other spherical, toric and multifocal lenses for astigmatism, nearsightedness and farsightedness, and presbyopia. CooperSurgical is the medical device and fertility and genomics unit of the companies. It became a business unit in 1990 and its focus includes women's health and fertility. Acquisitions Ocular Sciences Inc. was acquired by CooperVision in 2005. CooperSurgical acquired AEGEA Medical, a medical manufacturing company in February 2021. A month later, in March, the company acquired Safe Obstetric Systems, and in December 2021, CooperSurgical acquired Generate Life Sciences for $1.6 billion. In March 2022, CooperSurgical acquired Cook Medical's reproductive health business for $875 million. During that same year the company acquired EnsEyers, a supplier of orthokeratology and scleral contact lenses."
}