{
  "ticker": "COP",
  "cik": "0001163165",
  "company_name": "ConocoPhillips",
  "corrected_name": "ConocoPhillips",
  "wiki_title_used": "ConocoPhillips",
  "exists": true,
  "raw_text": "ConocoPhillips Company is an American multinational corporation engaged in hydrocarbon exploration and production. It is based in the Energy Corridor district of Houston, Texas.\nThe company has operations in 15 countries and has production in the United States (49% of 2019 production), Norway (10% of 2019 production), Canada (5% of 2019 production), Australia (12% of 2019 production), Indonesia (4% of 2019 production), Malaysia (4% of 2019 production), Libya (3% of 2019 production), China (3% of 2019 production), and Qatar (6% of 2019 production). The company's production in the United States included production in Alaska, the Eagle Ford Group, the Permian Basin, the Bakken Formation, the Gulf of Mexico and the Anadarko Basin. Approximately one-third of the company's U.S. production is in Alaska, where it has operations in the Cook Inlet Area, the Alpine oil field off the Colville River, and the Kuparuk oil field and Prudhoe Bay Oil Field on the Alaska North Slope.\nAs of December 31, 2023, the company had proved reserves of 6,758 million barrels of oil equivalent (4.134×1010 GJ), of which 46% was petroleum, 34% was natural gas, 14% was natural gas liquids and 6% was bitumen.\nThe company is ranked 156th on the Fortune 500. In the 2023 Forbes Global 2000, ConocoPhillips was ranked as the 83rd-largest public company in the world. ConocoPhillips also ranked 207th on Forbes Best Employers for Diversity (2021), 125th on Forbes America's Best Employers (2021) and 76 on Forbes Canada's Best Employers (2021).\nThe company was ranked as the 14th most polluting company in the world by The Guardian in 2019. It is responsible for 0.91% of global industrial greenhouse gas emissions from 1988 to 2015.\n\nHistory\n1875 to January 1993\nIn 1875, the \"Continental Oil and Transportation Company\" (acronym \"Conoco\") was founded in Ogden, Utah by Isaac Blake. In 1885, Conoco was reincorporated as part of Standard Oil. After the Supreme Court of the United States dissolved Standard Oil, Conoco became independent in 1913.\nBy 1929, it had become a fully integrated oil company. The company was a coal, oil, kerosene, grease and candles distributor in the West.\nIn 1929, Conoco merged with the Marland Oil Company.\nMarland Oil Company, founded by exploration pioneer E. W. Marland, later acquired the assets of Continental Oil Co.. On June 26, 1899, Marland Oil changed its name to Continental Oil Co. and moved its headquarters to Fargo, North Dakota. The acquisition gave Conoco the red bar-and-triangle logo previously used by Marland. Conoco used the logo between 1930 and 1970, when the current red capsule logo was adopted. Conoco was based in Ponca City until 1949, when it moved to Houston, Texas.\n\n1998\nIn 1998, Conoco acquired an interest in 10.5 blocks in the Kashagan Field in the Caspian Sea off Kazakhstan through the North Caspian Sea Production Sharing Agreement (NCSPSA). On November 26, 2012, in its largest acquisition ever, ONGC Videsh agreed to buy ConocoPhillips' 8.4% stake in the Kashagan oilfield for approximately US$5 billion.\n\n2002\nOn August 30, 2002, Conoco Inc. and Phillips Petroleum Company, whose headquarters were in nearby Bartlesville, Oklahoma merged into ConocoPhillips. By January 2002, the groups organizing the merger had selected Houston as the site of the headquarters. The merger brought the two companies' expertise together, allowing the new company to develop megaprojects involving remote natural gas supplies. Governor of Oklahoma Frank Keating said that the move to Houston was \"regrettable\".\n\nSeptember 2004 to January 2009\nIn September 2004, the company invested $2 billion in Lukoil.\nIn March 2006, ConocoPhillips acquired Wilhelmshavener Raffineriegesellschaft mbH, based in Germany. It also acquired Burlington Resources for $35 billion in cash and stock.\nOn May 10, 2006, Richard Armitage, former deputy-secretary of the U.S. State Department, was elected to the board of directors of the ConocoPhillips oil company.\n\nJuly 2011 to January 2017\nOn July 14, 2011, ConocoPhillips announced its intent to separate the company's upstream and downstream businesses into two stand-alone, publicly traded corporations, with the intent of maximizing shareholder value. On May 1, 2012, all midstream, downstream, marketing and chemical operations were separated into a new company named Phillips 66, headquartered in Houston. As a result, ConocoPhillips continued its operations as an upstream (exploration and production) company.\nIn April 2012, ConocoPhillips sold its Trainer Refinery to Monroe Energy LLC, a subsidiary of Delta Air Lines.\nIn May 2012, ConocoPhillips completed the corporate spin-off of its downstream assets as Phillips 66.\nIn 2012, the company began the process of divesting onshore and offshore assets in Nigeria. ConocoPhillips contracted a French bank, BNP Paribas, to sell all assets, including a 17% stake in Brass Liquefied Natural Gas LNG, Oil Mining Lease OML 131 in which ConocoPhillips had a 47.5% stake. ConocoPhillips operated in Nigeria for more than 46 years.\nIn January 2013, Conoco announced that it would sell its Rocky Mountain assets to Denbury Resources for $1.05 billion.\nIn July 2016, the company agreed to sell a 35% stake in three Senegalese deepwater oil and gas exploration blocks for about $350 million to Woodside Petroleum.\nIn November 2016, the company announced the move of its headquarters to Energy Center Four by 2018.\n\nFebruary 2017 to January 2021\nIn February 2017, Ecuador was ordered to pay $380 million to the company for unlawfully expropriating the company's oil investments.\nIn March 2017, the company agreed to sell its Foster Creek Christina Lake Partnership interest, Western Canada Deep Basin Gas assets to Cenovus Energy for $13.3 billion. Along with the sale of natural gas fields in the U.S., it led to a reduction of close to 30% of its proved oil and gas reserves.\nIn June 2017, the company agreed to sell assets in the Barnett Shale for $305 million.\nIn August 2017, the company sold its business in the San Juan Basin for $2.5 billion.\nIn May 2018, ConocoPhillips seized assets belonging to the Venezuelan state oil company PDVSA from the Isla refinery on Curaçao to collect on $2 billion owed since a 2007 court decision.\nIn March 2019, the World Bank ruled that Venezuela must pay ConocoPhillips $8.7 billion to compensate for the 2007 expropriation of oil assets.\nIn April 2019, the company sold a 30% stake in the Greater Sunrise Fields to the government of Timor-Leste.\nIn September 2019, the company sold its business in the United Kingdom for $2.675 billion.\nFor the 2019 Awards in Predefined Areas (APA) on the Norwegian continental shelf (NCS), ConocoPhillips was awarded three operatorships and ownership interests in a total of five production licenses. Two which are located in the Norwegian Sea (PL 1009 B and PL 1064) in Warka and Slagugle, one in the North Sea (PL 917 B) for two discoveries in Busta Voe and Cape Enniberg, and the other is the Hasselbaink prospect, where drilling has already begun.\nIn May 2020, the company sold its assets in Northern Australia to Santos Limited for $1.39 billion.\nIn July 2020, the company announced the acquisition of acreage in the Montney Formation in Canada for $375 million.\nOn 1 August 2020, Steinar Våge who has been with the ConocoPhillips company since 1988, was elected into the position of President for ConocoPhillips Europe, Middle East and North Africa. He was previously the Senior Vice President of Global Operations, Wells and Projects at the corporate headquarters in Houston, United States, and is now located in Stavanger, where the main office is located.\nDue to the COVID-19 pandemic in 2020, ConocoPhillips had to reduce its production in May as the price of oil in North Slope, which stood at about $10 per barrel at the end of April, rose to $40 per barrel.\nIn December 2020, ConocoPhillips made the largest discovery of oil for the year, between 75.5 million and 201 million barrels in the Slagugle well. Executive Vice President Matt Fox, stated that this was the fourth successful exploration well to be found on the Norwegian continental shelf in the past 16 months.\nIn January 2021, the company acquired Concho Resources, an operator in the Permian Basin, for $9.7 billion.\n\nSeptember 2021 to the present\nIn September 2021, ConocoPhillips announced it would buy all of Royal Dutch Shell PLC's assets in the Permian basin for around $9.5 billion in cash.\nIn June 2022, ConocoPhillips became one of the stakeholders in the joint venture with QatarEnergy for the North Field East (NFE) expansion, holding 3.125%, as well as holding 6.25% stakes in the North Field South (NFS), a second phase expansion of the NFE. The NFE expansion is expected to begin production by 2025, and the NFS later in 2028.\nIn year 2023, the Biden administration approved ConocoPhillips' request to drill for oil along the Alaskan coast.\nIn 2023, Conoco purchased another 50% stake in the Surmont Canadian facility from TotalEnergies for $3 billion.\nIn February 2024, ConocoPhillips prepared to meet providers of leased floating production, storage and off-loading (FPSO) in preparation for the launch of the FEED competition for Salam-Patawali project offshore Malaysia. The project has been developing for several years: in February 2021, permission was obtained for exploration on the Malaysian shelf called SB405, in 2022 conducted seismic exploration in 3D. Also in 2022, FPSO contractors Bumi Armada, MISC and Yinson Holdings were said to have expressed an interest in this project, and Genesis was contracted for engineering services.\nConocoPhillips Norwegian subsidiary holds 35% of the Eldfisk North Project which began production in May 2024.\nIn July 2024, ConocoPhillips took legal action against the Biden administration after a new ruling in April of that year blocked oil and gas development on nearly half of Alaska's National Petroleum Reserve.\nIn September 2024 ConocoPhillips and Uniper agreed for a supplying deal which is up to 10 billion cubic metres (bcm) of natural gas for the next 10 years. With this, ConocoPhillips will be able to supply natural gas to Uniper i.e. in the north- western European zone.\nIn November 2024, ConocoPhillips acquired Marathon Oil in a $22.5 billion transaction.\nIn September 2025, the company announced plans to lay off some 25% of its workforce amidst lower oil prices and higher operating costs.\n\nMuseums\nThe Conoco Museum in Ponca City, Oklahoma, and the Phillips Petroleum Company Museum in Bartlesville, Oklahoma, are dedicated to the history of the company.\n\nOperations\nConocoPhillips explores for, produces, transports and markets crude oil, bitumen, natural gas, natural gas liquids and liquefied natural gas on a worldwide basis. The company manages its operations through six operating segments, defined by geographic region: Alaska; Lower 48; Canada; Europe, Middle East and North Africa; Asia Pacific; and Other International.\n\nGovernance\nLeadership\nCurrent board of directors\nCharles Bunch, CEO and chairman of PPG Industries\nCaroline Maury Devine, former president and managing director of a Norwegian affiliate of ExxonMobil\nJohn V. Faraci, former CEO and chairman of International Paper Company\nJody Freeman, Archibald Cox Professor of Law at Harvard Law School\nGay Huey Evans, chairman, London Metal Exchange\nJeffrey A. Joerres, Former Executive Chairman and chief executive officer, ManpowerGroup Inc.\nRyan Lance, CEO and chairman of the board\nTim Leach, Executive Vice President, Lower 48 at ConocoPhillips\nAdmiral William H. McRaven, Retired U.S. Navy Four-Star Admiral (SEAL)\nSharmila Mulligan, Former Chief Strategy Officer of Alteryx\nEric D. Mullins, chairman and chief executive officer, Lime Rock Resources\nArjun Murti, former partner at Goldman Sachs\nRobert Niblock, former CEO, president, and chairman of Lowe's\nDavid T. Seaton, Former Chairman and chief executive officer, Fluor Corporation\nR.A.Walker, Former Chairman and chief executive officer, Anadarko Petroleum Company\nDominic E. Macklon - executive vice president of strategy, sustainability, and technology (retired from May 1, 2024).\n\nEnvironmental record\nOn April 11, 2007, ConocoPhillips became the first U.S. oil company to join the U.S. Climate Action Partnership, an alliance of big business and environmental groups. In January 2007, the partnership advised President George W. Bush that mandatory emissions caps would be needed to reduce the flow of carbon dioxide and other greenhouse gases into the atmosphere. In 2007, ConocoPhillips announced it would spend $150 million that year on alternative and unconventional energy sources, up from $80 million in 2006. However, ConocoPhillips left the U.S. Climate Action Partnership in February 2010, at the same time as BP and Caterpillar Inc. left the partnership.\nConocoPhillips is a signatory participant of the Voluntary Principles on Security and Human Rights. In 2016, ConocoPhillips was ranked as being among the 12th best of 92 oil, gas, and mining companies on indigenous rights in the Arctic. In May 2020, it was reported that the company was planning new drillings in Alaska's North Slope which would affect the life of 400 in the Native Village of Nuiqsut. According to the 2021 Arctic Environmental Responsibility Index (AERI), ConocoPhillips is ranked as the fourth most environmentally responsible company out of 120 oil, gas, and mining companies involved in resource extraction north of the Arctic Circle.\nIn 1990, ConocoPhillips agreed to pay $23 million to buy 400 homes and compensate families in Ponca City, Oklahoma, who said its refinery gave them cancer and other illnesses.\nIn June 2011, ConocoPhillips China Inc., a wholly owned subsidiary of ConocoPhillips, was responsible for the 2011 Bohai bay oil spills in Bohai Bay.\nIn 2015, ConocoPhillips and Phillips 66 agreed to pay $11.5 million to settle a lawsuit alleging that hundreds of their gas stations violated California anti-pollution laws since 2006. The civil complaint, filed in January 2013, alleged that the companies violated state laws on the operation and maintenance of underground gasoline storage tanks at more than 560 gas stations in the state. These violations included failing to properly maintain leak detection devices, testing secondary containment systems, conducting monthly inspections and training employees in proper protocol.\nIn May 2019, ConocoPhillips settled a lawsuit with homeowners in northwestern Oklahoma City who accused the company of polluting their soil and water to such a degree that no trees or flowers will grow.\nIn May 2017, ConocoPhillips agreed to a $39 million settlement to resolve complaints brought by New Jersey over groundwater contamination. ConocoPhillips was one of 50 companies named in a 2007 lawsuit filed against manufacturers, distributors and other industrial users of the gasoline additive MTBE, found in groundwater at locations throughout New Jersey.\nBobby Berk, one of the stars from Netflix's \"Queer Eye,\" spoke out against ConocoPhillips' water pollution in Missouri, saying that there were so many chemicals at one point, they could \"actually light a glass of our water on fire\".\nAccording to the Political Economy Research Institute, ConocoPhillips ranked 13th among U.S. corporate producers of air pollution.\nIn 2013, ConocoPhillips had the \"leakiest\" methane in operations compared to its peers.\nIn February 2022, ConocoPhillips announced a pilot program to sell its flare gas to a company operating a bitcoin mine in the Bakken Formation region of North Dakota as part of a company initiative to reduce routine flaring to zero by 2030. In 2021 and 2022, an index constructed by researchers at the University of Cambridge showed that bitcoin mining consumed more electricity during the course of the year than the entire nations of Argentina (a G20 country) and the Netherlands.\n\nCarbon footprint\nConocoPhillips reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 16,200 Kt (-4,300 /-21% y-o-y). Importantly, the figure does not include Scope 3 end-use emissions resulting from the consumption of fossil fuels produced by the company.\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for ConocoPhillips:",
  "clean_text": "ConocoPhillips Company is an American multinational corporation engaged in hydrocarbon exploration and production. It is based in the Energy Corridor district of Houston, Texas. The company has operations in 15 countries and has production in the United States (49% of 2019 production), Norway (10% of 2019 production), Canada (5% of 2019 production), Australia (12% of 2019 production), Indonesia (4% of 2019 production), Malaysia (4% of 2019 production), Libya (3% of 2019 production), China (3% of 2019 production), and Qatar (6% of 2019 production). The company's production in the United States included production in Alaska, the Eagle Ford Group, the Permian Basin, the Bakken Formation, the Gulf of Mexico and the Anadarko Basin. Approximately one-third of the company's U.S. production is in Alaska, where it has operations in the Cook Inlet Area, the Alpine oil field off the Colville River, and the Kuparuk oil field and Prudhoe Bay Oil Field on the Alaska North Slope. As of December 31, 2023, the company had proved reserves of 6,758 million barrels of oil equivalent (4.134×1010 GJ), of which 46% was petroleum, 34% was natural gas, 14% was natural gas liquids and 6% was bitumen. The company is ranked 156th on the Fortune 500. In the 2023 Forbes Global 2000, ConocoPhillips was ranked as the 83rd-largest public company in the world. ConocoPhillips also ranked 207th on Forbes Best Employers for Diversity (2021), 125th on Forbes America's Best Employers (2021) and 76 on Forbes Canada's Best Employers (2021). The company was ranked as the 14th most polluting company in the world by The Guardian in 2019. It is responsible for 0.91% of global industrial greenhouse gas emissions from 1988 to 2015. History 1875 to January 1993 In 1875, the \"Continental Oil and Transportation Company\" (acronym \"Conoco\") was founded in Ogden, Utah by Isaac Blake. In 1885, Conoco was reincorporated as part of Standard Oil. After the Supreme Court of the United States dissolved Standard Oil, Conoco became independent in 1913. By 1929, it had become a fully integrated oil company. The company was a coal, oil, kerosene, grease and candles distributor in the West. In 1929, Conoco merged with the Marland Oil Company. Marland Oil Company, founded by exploration pioneer E. W. Marland, later acquired the assets of Continental Oil Co.. On June 26, 1899, Marland Oil changed its name to Continental Oil Co. and moved its headquarters to Fargo, North Dakota. The acquisition gave Conoco the red bar-and-triangle logo previously used by Marland. Conoco used the logo between 1930 and 1970, when the current red capsule logo was adopted. Conoco was based in Ponca City until 1949, when it moved to Houston, Texas. 1998 In 1998, Conoco acquired an interest in 10.5 blocks in the Kashagan Field in the Caspian Sea off Kazakhstan through the North Caspian Sea Production Sharing Agreement (NCSPSA). On November 26, 2012, in its largest acquisition ever, ONGC Videsh agreed to buy ConocoPhillips' 8.4% stake in the Kashagan oilfield for approximately US$5 billion. 2002 On August 30, 2002, Conoco Inc. and Phillips Petroleum Company, whose headquarters were in nearby Bartlesville, Oklahoma merged into ConocoPhillips. By January 2002, the groups organizing the merger had selected Houston as the site of the headquarters. The merger brought the two companies' expertise together, allowing the new company to develop megaprojects involving remote natural gas supplies. Governor of Oklahoma Frank Keating said that the move to Houston was \"regrettable\". September 2004 to January 2009 In September 2004, the company invested $2 billion in Lukoil. In March 2006, ConocoPhillips acquired Wilhelmshavener Raffineriegesellschaft mbH, based in Germany. It also acquired Burlington Resources for $35 billion in cash and stock. On May 10, 2006, Richard Armitage, former deputy-secretary of the U.S. State Department, was elected to the board of directors of the ConocoPhillips oil company. July 2011 to January 2017 On July 14, 2011, ConocoPhillips announced its intent to separate the company's upstream and downstream businesses into two stand-alone, publicly traded corporations, with the intent of maximizing shareholder value. On May 1, 2012, all midstream, downstream, marketing and chemical operations were separated into a new company named Phillips 66, headquartered in Houston. As a result, ConocoPhillips continued its operations as an upstream (exploration and production) company. In April 2012, ConocoPhillips sold its Trainer Refinery to Monroe Energy LLC, a subsidiary of Delta Air Lines. In May 2012, ConocoPhillips completed the corporate spin-off of its downstream assets as Phillips 66. In 2012, the company began the process of divesting onshore and offshore assets in Nigeria. ConocoPhillips contracted a French bank, BNP Paribas, to sell all assets, including a 17% stake in Brass Liquefied Natural Gas LNG, Oil Mining Lease OML 131 in which ConocoPhillips had a 47.5% stake. ConocoPhillips operated in Nigeria for more than 46 years. In January 2013, Conoco announced that it would sell its Rocky Mountain assets to Denbury Resources for $1.05 billion. In July 2016, the company agreed to sell a 35% stake in three Senegalese deepwater oil and gas exploration blocks for about $350 million to Woodside Petroleum. In November 2016, the company announced the move of its headquarters to Energy Center Four by 2018. February 2017 to January 2021 In February 2017, Ecuador was ordered to pay $380 million to the company for unlawfully expropriating the company's oil investments. In March 2017, the company agreed to sell its Foster Creek Christina Lake Partnership interest, Western Canada Deep Basin Gas assets to Cenovus Energy for $13.3 billion. Along with the sale of natural gas fields in the U.S., it led to a reduction of close to 30% of its proved oil and gas reserves. In June 2017, the company agreed to sell assets in the Barnett Shale for $305 million. In August 2017, the company sold its business in the San Juan Basin for $2.5 billion. In May 2018, ConocoPhillips seized assets belonging to the Venezuelan state oil company PDVSA from the Isla refinery on Curaçao to collect on $2 billion owed since a 2007 court decision. In March 2019, the World Bank ruled that Venezuela must pay ConocoPhillips $8.7 billion to compensate for the 2007 expropriation of oil assets. In April 2019, the company sold a 30% stake in the Greater Sunrise Fields to the government of Timor-Leste. In September 2019, the company sold its business in the United Kingdom for $2.675 billion. For the 2019 Awards in Predefined Areas (APA) on the Norwegian continental shelf (NCS), ConocoPhillips was awarded three operatorships and ownership interests in a total of five production licenses. Two which are located in the Norwegian Sea (PL 1009 B and PL 1064) in Warka and Slagugle, one in the North Sea (PL 917 B) for two discoveries in Busta Voe and Cape Enniberg, and the other is the Hasselbaink prospect, where drilling has already begun. In May 2020, the company sold its assets in Northern Australia to Santos Limited for $1.39 billion. In July 2020, the company announced the acquisition of acreage in the Montney Formation in Canada for $375 million. On 1 August 2020, Steinar Våge who has been with the ConocoPhillips company since 1988, was elected into the position of President for ConocoPhillips Europe, Middle East and North Africa. He was previously the Senior Vice President of Global Operations, Wells and Projects at the corporate headquarters in Houston, United States, and is now located in Stavanger, where the main office is located. Due to the COVID-19 pandemic in 2020, ConocoPhillips had to reduce its production in May as the price of oil in North Slope, which stood at about $10 per barrel at the end of April, rose to $40 per barrel. In December 2020, ConocoPhillips made the largest discovery of oil for the year, between 75.5 million and 201 million barrels in the Slagugle well. Executive Vice President Matt Fox, stated that this was the fourth successful exploration well to be found on the Norwegian continental shelf in the past 16 months. In January 2021, the company acquired Concho Resources, an operator in the Permian Basin, for $9.7 billion. September 2021 to the present In September 2021, ConocoPhillips announced it would buy all of Royal Dutch Shell PLC's assets in the Permian basin for around $9.5 billion in cash. In June 2022, ConocoPhillips became one of the stakeholders in the joint venture with QatarEnergy for the North Field East (NFE) expansion, holding 3.125%, as well as holding 6.25% stakes in the North Field South (NFS), a second phase expansion of the NFE. The NFE expansion is expected to begin production by 2025, and the NFS later in 2028. In year 2023, the Biden administration approved ConocoPhillips' request to drill for oil along the Alaskan coast. In 2023, Conoco purchased another 50% stake in the Surmont Canadian facility from TotalEnergies for $3 billion. In February 2024, ConocoPhillips prepared to meet providers of leased floating production, storage and off-loading (FPSO) in preparation for the launch of the FEED competition for Salam-Patawali project offshore Malaysia. The project has been developing for several years: in February 2021, permission was obtained for exploration on the Malaysian shelf called SB405, in 2022 conducted seismic exploration in 3D. Also in 2022, FPSO contractors Bumi Armada, MISC and Yinson Holdings were said to have expressed an interest in this project, and Genesis was contracted for engineering services. ConocoPhillips Norwegian subsidiary holds 35% of the Eldfisk North Project which began production in May 2024. In July 2024, ConocoPhillips took legal action against the Biden administration after a new ruling in April of that year blocked oil and gas development on nearly half of Alaska's National Petroleum Reserve. In September 2024 ConocoPhillips and Uniper agreed for a supplying deal which is up to 10 billion cubic metres (bcm) of natural gas for the next 10 years. With this, ConocoPhillips will be able to supply natural gas to Uniper i.e. in the north- western European zone. In November 2024, ConocoPhillips acquired Marathon Oil in a $22.5 billion transaction. In September 2025, the company announced plans to lay off some 25% of its workforce amidst lower oil prices and higher operating costs. Museums The Conoco Museum in Ponca City, Oklahoma, and the Phillips Petroleum Company Museum in Bartlesville, Oklahoma, are dedicated to the history of the company. Operations ConocoPhillips explores for, produces, transports and markets crude oil, bitumen, natural gas, natural gas liquids and liquefied natural gas on a worldwide basis. The company manages its operations through six operating segments, defined by geographic region: Alaska; Lower 48; Canada; Europe, Middle East and North Africa; Asia Pacific; and Other International. Governance Leadership Current board of directors Charles Bunch, CEO and chairman of PPG Industries Caroline Maury Devine, former president and managing director of a Norwegian affiliate of ExxonMobil John V. Faraci, former CEO and chairman of International Paper Company Jody Freeman, Archibald Cox Professor of Law at Harvard Law School Gay Huey Evans, chairman, London Metal Exchange Jeffrey A. Joerres, Former Executive Chairman and chief executive officer, ManpowerGroup Inc. Ryan Lance, CEO and chairman of the board Tim Leach, Executive Vice President, Lower 48 at ConocoPhillips Admiral William H. McRaven, Retired U.S. Navy Four-Star Admiral (SEAL) Sharmila Mulligan, Former Chief Strategy Officer of Alteryx Eric D. Mullins, chairman and chief executive officer, Lime Rock Resources Arjun Murti, former partner at Goldman Sachs Robert Niblock, former CEO, president, and chairman of Lowe's David T. Seaton, Former Chairman and chief executive officer, Fluor Corporation R.A.Walker, Former Chairman and chief executive officer, Anadarko Petroleum Company Dominic E. Macklon - executive vice president of strategy, sustainability, and technology (retired from May 1, 2024). Environmental record On April 11, 2007, ConocoPhillips became the first U.S. oil company to join the U.S. Climate Action Partnership, an alliance of big business and environmental groups. In January 2007, the partnership advised President George W. Bush that mandatory emissions caps would be needed to reduce the flow of carbon dioxide and other greenhouse gases into the atmosphere. In 2007, ConocoPhillips announced it would spend $150 million that year on alternative and unconventional energy sources, up from $80 million in 2006. However, ConocoPhillips left the U.S. Climate Action Partnership in February 2010, at the same time as BP and Caterpillar Inc. left the partnership. ConocoPhillips is a signatory participant of the Voluntary Principles on Security and Human Rights. In 2016, ConocoPhillips was ranked as being among the 12th best of 92 oil, gas, and mining companies on indigenous rights in the Arctic. In May 2020, it was reported that the company was planning new drillings in Alaska's North Slope which would affect the life of 400 in the Native Village of Nuiqsut. According to the 2021 Arctic Environmental Responsibility Index (AERI), ConocoPhillips is ranked as the fourth most environmentally responsible company out of 120 oil, gas, and mining companies involved in resource extraction north of the Arctic Circle. In 1990, ConocoPhillips agreed to pay $23 million to buy 400 homes and compensate families in Ponca City, Oklahoma, who said its refinery gave them cancer and other illnesses. In June 2011, ConocoPhillips China Inc., a wholly owned subsidiary of ConocoPhillips, was responsible for the 2011 Bohai bay oil spills in Bohai Bay. In 2015, ConocoPhillips and Phillips 66 agreed to pay $11.5 million to settle a lawsuit alleging that hundreds of their gas stations violated California anti-pollution laws since 2006. The civil complaint, filed in January 2013, alleged that the companies violated state laws on the operation and maintenance of underground gasoline storage tanks at more than 560 gas stations in the state. These violations included failing to properly maintain leak detection devices, testing secondary containment systems, conducting monthly inspections and training employees in proper protocol. In May 2019, ConocoPhillips settled a lawsuit with homeowners in northwestern Oklahoma City who accused the company of polluting their soil and water to such a degree that no trees or flowers will grow. In May 2017, ConocoPhillips agreed to a $39 million settlement to resolve complaints brought by New Jersey over groundwater contamination. ConocoPhillips was one of 50 companies named in a 2007 lawsuit filed against manufacturers, distributors and other industrial users of the gasoline additive MTBE, found in groundwater at locations throughout New Jersey. Bobby Berk, one of the stars from Netflix's \"Queer Eye,\" spoke out against ConocoPhillips' water pollution in Missouri, saying that there were so many chemicals at one point, they could \"actually light a glass of our water on fire\". According to the Political Economy Research Institute, ConocoPhillips ranked 13th among U.S. corporate producers of air pollution. In 2013, ConocoPhillips had the \"leakiest\" methane in operations compared to its peers. In February 2022, ConocoPhillips announced a pilot program to sell its flare gas to a company operating a bitcoin mine in the Bakken Formation region of North Dakota as part of a company initiative to reduce routine flaring to zero by 2030. In 2021 and 2022, an index constructed by researchers at the University of Cambridge showed that bitcoin mining consumed more electricity during the course of the year than the entire nations of Argentina (a G20 country) and the Netherlands. Carbon footprint ConocoPhillips reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 16,200 Kt (-4,300 /-21% y-o-y). Importantly, the figure does not include Scope 3 end-use emissions resulting from the consumption of fossil fuels produced by the company."
}