{
  "ticker": "COR",
  "cik": "0001140859",
  "company_name": "Cencora",
  "corrected_name": "Cencora",
  "wiki_title_used": "Cencora",
  "exists": true,
  "raw_text": "Cencora, Inc., formerly known as AmerisourceBergen, is an American drug wholesale and distribution  company and a contract research organization, that was formed by the merger of Bergen Brunswig and AmeriSource in 2001 and renamed following numerous lawsuits related to its role in the American Opioid Epidemic. It is one of the largest pharmaceutical companies in the world and distributes generic pharmaceuticals, over-the-counter healthcare products, as well as home healthcare supplies and equipment.\n\nBackground\nAmerisourceBergen was formed in 2001 following the merger of AmeriSource Health Corporation and Bergen Brunswig Corporation. David Yost was CEO of Amerisource prior to the merger and remained in the position after the companies merged.\nAmerisourceBergen has 26 pharmaceutical distribution centers in the US, nine distribution centers in Canada, four specialty distribution centers in the US, and over 1 million square feet of packaging production capacity in the US and the UK. With the addition of World Courier, the largest specialty courier company in the world, over 150 company-owned offices around the globe were added to the company.\nAmerisourceBergen operates its pharmaceutical distribution business under four primary units: AmerisourceBergen Drug Corporation (ABDC), AmerisourceBergen Specialty Group (ABSG), AmerisourceBergen Consulting Services (ABCS) and World Courier. In March 2016, pharmacy Walgreens Boots Alliance Inc. announced it would exercise an option to purchase 22.7 million shares of AmerisourceBergen stock and thereby control 15% of the company.\nIn 2012, the firm was the largest by revenue based in Pennsylvania.\nThe company changed its name to Cencora as of August 30, 2023 and began trading on the New York Stock Exchange under the new ticker symbol \"COR\".\nIn May 2024, Cencora disclosed it had been the subject of a cyber incident in which patient information was exposed.\n\nProducts\nThey provide drug distribution and consulting related to medical business operations and patient services. They also distribute a line of brand name and generic pharmaceuticals, over-the-counter (OTC) health care products and home health care supplies and equipment to health care providers throughout the United States, including acute care hospitals and health systems, independent and chain retail pharmacies, mail-order facilities, physicians, clinics and other alternate site facilities, as well as nursing and assisted living centers. They also provide pharmaceuticals and pharmacy services to long-term care, workers' compensation and specialty drug patients.\nAmerisourceBergen handles about 20% of all of the pharmaceuticals sold and distributed throughout the United States and ranked 10th on the Fortune 500 list for 2020 with over $179 billion in annual revenue.\n\nGood Neighbor Pharmacy\nGood Neighbor Pharmacy is an American retailers' cooperative network of more than 3,400 independently owned and operated pharmacies. It has a business affiliation with AmerisourceBergen, which sponsors the network and owns the name \"Good Neighbor Pharmacy.\" Good Neighbor Pharmacy is the sponsor for \"ThoughtSpot,\" the annual trade show held in both Orlando and Las Vegas.\n\nAcquisition history\nIn 2011, the company acquired IntrinsiQ for $35 million and Premier Source for an undisclosed amount. In July, Steven Collis replaced Yost as CEO of the company.\nIn March 2012, AmerisourceBergen agreed to acquire World Courier Group Inc, a transportation and logistics provider for the biopharmaceutical industry, for $520 million.\nIn January 2015, the company bought MWI Veterinary for $2.5 billion. In October, they agreed to buy PharMEDium, a compounding drug company, for $2.58 billion.\nOn January 3, 2018, AmerisourceBergen acquired H. D. Smith, the largest privately held national pharmaceutical wholesaler in the U.S.\nOn June 2, 2021, AmerisourceBergen acquired Alliance Healthcare from Walgreens Boots Alliance for approximately $6.5 billion, made up of $6.275 billion in cash and 2 million shares of AmerisourceBergen common stock.\n\nDistribution of Remdesivir\nIn June 2020, the U.S. Department of Health and Human Services (HHS) announced an unusual agreement for the distribution of remdesivir, the first coronavirus drug. HHS agreed to manufacturer Gilead's wholesale acquisition price, while HHS would continue to work together with state governments and AmerisourceBergen to allocate shipments of remdesivir vials to American hospitals through the end of September 2020, and in exchange, during that time-frame American patients would be allocated over 90% of Gilead's projected remdesivir output of more than 500,000 treatment courses.\n\nFinances\nFor the fiscal year 2019, AmerisourceBergen reported earnings of US$1.11 billion, with an annual revenue of US$179.58 billion. AmerisourceBergen's shares traded at over $88 per share, and its market capitalization was valued at over US$19.2 billion in September 2019.\n\nControversies\nOpioid epidemic\nAmerisourceBergen is among several distributors that have been sued by West Virginian governments for contributing to the Opioid epidemic, by shipping inordinate amounts of pain medication into the state.\nIn December 2019, Michigan became the first state to sue AmerisourceBergen and three other opioid distributors as drug dealers for their role in the state's opioid crisis. The lawsuit is filed under the Michigan Drug Dealer Liability Act. AmerisourceBergen was among four companies who, because of their role in the addiction crisis, agreed to pay $260 million to two Ohio counties.\nIn May 2020, Oklahoma Attorney General Mike Hunter sued AmerisourceBergen in Bryan County District Court, Oklahoma. The lawsuit alleged that the company's actions helped fuel Oklahoma's opioid crisis. The suit was filed along with lawsuits against Cardinal Health and McKesson, and the three lawsuits allege that the three companies provided \"enough opioids to Bryan County that every adult resident there could have had 144 hydrocodone tablets.\"\nIn January 2022, AmerisourceBergen, McKesson, Cardinal Health, and Johnson & Johnson agreed to pay $26 billion to settle with all but five of the states suing them. The deal covered the bulk of the grievances against these four companies, including 90 percent of municipal governments, 46 states, and Washington, DC. Had the states gone to court, the companies could have faced up to $95 billion in penalties. AmeriSource Bergen and the three other companies did not admit wrongdoings.\n\nLegal issues\nIn October 2018, AmerisourceBergen agreed to pay $625 million to settle civil fraud allegations resulting from its repackaging and sale of adulterated drugs and unapproved new drugs, double billing and providing kickbacks to physicians. The company had previously been found guilty of a misdemeanor charge related to the repackaging and distribution of pre-filled syringes that lacked FDA approval. In connection with this case, AmerisourceBergen agreed to pay $260 million, bringing the total settlement amount to $885 million.\nAs part of the civil settlement, ABC admitted that between January 2001 and January 2014, MII and OSC operated a program that created, packed and shipped millions of pre-filled syringes (PFS) to oncology practices for administration to vulnerable cancer patients (the PFS Program).  At MII, an ABC subsidiary located in Alabama, the drug product was removed from the original glass vials and multiple vials of the product were pooled in untested plastic containers.  Then the drug, including the overfill, was extracted and repackaged into syringes.  By harvesting the overfill, ABC was able to create more doses than it bought from the original vial manufacturers and avoid opening some of the vials.  ABC retained the unopened vials and sold them to other customers and to its subsidiary ABDC for resale.  During the 13 years the PFS Program was in operation, MII manufactured thousands of syringes daily, and eventually over one million syringes per year.  These syringes were sold throughout the United States.  Approximately 57% of the patients who were injected with the PFS were Federal Health Care Program beneficiaries.  The profit from the PFS Program was between $2.3 and $14.4 million annually for a total profit of at least $99.6 million.\nABC’s scheme enabled it to bill multiple health care providers for the same vial of drug, causing some of those providers to bill the Federal Health Care Programs for the same vial more than once.  The scheme also enabled ABC to increase its market share by offering various product discounts, which it leveraged to obtain new customers and to keep existing customers who purchased its entire portfolio of oncology drugs.  ABC excluded the entire PFS Program from its standard regulatory audit and pedigree compliance programs.  AmerisourceBergen's stock price reportedly plummeted after they were among other drug distributors who offered $10 billion to settle their portion of the national opioids lawsuit. States countered with $45 billion.\nIn 2022, the United States government filed a lawsuit against AmerisourceBergen for contributing to the opioid crisis in America. The suit, which was filed by the United States Department of Justice with federal prosecutors in New Jersey, Colorado, Pennsylvania, and New York, alleged that the company distributed opioids that were later resold illegally.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Cencora, Inc.:",
  "clean_text": "Cencora, Inc., formerly known as AmerisourceBergen, is an American drug wholesale and distribution company and a contract research organization, that was formed by the merger of Bergen Brunswig and AmeriSource in 2001 and renamed following numerous lawsuits related to its role in the American Opioid Epidemic. It is one of the largest pharmaceutical companies in the world and distributes generic pharmaceuticals, over-the-counter healthcare products, as well as home healthcare supplies and equipment. Background AmerisourceBergen was formed in 2001 following the merger of AmeriSource Health Corporation and Bergen Brunswig Corporation. David Yost was CEO of Amerisource prior to the merger and remained in the position after the companies merged. AmerisourceBergen has 26 pharmaceutical distribution centers in the US, nine distribution centers in Canada, four specialty distribution centers in the US, and over 1 million square feet of packaging production capacity in the US and the UK. With the addition of World Courier, the largest specialty courier company in the world, over 150 company-owned offices around the globe were added to the company. AmerisourceBergen operates its pharmaceutical distribution business under four primary units: AmerisourceBergen Drug Corporation (ABDC), AmerisourceBergen Specialty Group (ABSG), AmerisourceBergen Consulting Services (ABCS) and World Courier. In March 2016, pharmacy Walgreens Boots Alliance Inc. announced it would exercise an option to purchase 22.7 million shares of AmerisourceBergen stock and thereby control 15% of the company. In 2012, the firm was the largest by revenue based in Pennsylvania. The company changed its name to Cencora as of August 30, 2023 and began trading on the New York Stock Exchange under the new ticker symbol \"COR\". In May 2024, Cencora disclosed it had been the subject of a cyber incident in which patient information was exposed. Products They provide drug distribution and consulting related to medical business operations and patient services. They also distribute a line of brand name and generic pharmaceuticals, over-the-counter (OTC) health care products and home health care supplies and equipment to health care providers throughout the United States, including acute care hospitals and health systems, independent and chain retail pharmacies, mail-order facilities, physicians, clinics and other alternate site facilities, as well as nursing and assisted living centers. They also provide pharmaceuticals and pharmacy services to long-term care, workers' compensation and specialty drug patients. AmerisourceBergen handles about 20% of all of the pharmaceuticals sold and distributed throughout the United States and ranked 10th on the Fortune 500 list for 2020 with over $179 billion in annual revenue. Good Neighbor Pharmacy Good Neighbor Pharmacy is an American retailers' cooperative network of more than 3,400 independently owned and operated pharmacies. It has a business affiliation with AmerisourceBergen, which sponsors the network and owns the name \"Good Neighbor Pharmacy.\" Good Neighbor Pharmacy is the sponsor for \"ThoughtSpot,\" the annual trade show held in both Orlando and Las Vegas. Acquisition history In 2011, the company acquired IntrinsiQ for $35 million and Premier Source for an undisclosed amount. In July, Steven Collis replaced Yost as CEO of the company. In March 2012, AmerisourceBergen agreed to acquire World Courier Group Inc, a transportation and logistics provider for the biopharmaceutical industry, for $520 million. In January 2015, the company bought MWI Veterinary for $2.5 billion. In October, they agreed to buy PharMEDium, a compounding drug company, for $2.58 billion. On January 3, 2018, AmerisourceBergen acquired H. D. Smith, the largest privately held national pharmaceutical wholesaler in the U.S. On June 2, 2021, AmerisourceBergen acquired Alliance Healthcare from Walgreens Boots Alliance for approximately $6.5 billion, made up of $6.275 billion in cash and 2 million shares of AmerisourceBergen common stock. Distribution of Remdesivir In June 2020, the U.S. Department of Health and Human Services (HHS) announced an unusual agreement for the distribution of remdesivir, the first coronavirus drug. HHS agreed to manufacturer Gilead's wholesale acquisition price, while HHS would continue to work together with state governments and AmerisourceBergen to allocate shipments of remdesivir vials to American hospitals through the end of September 2020, and in exchange, during that time-frame American patients would be allocated over 90% of Gilead's projected remdesivir output of more than 500,000 treatment courses. Finances For the fiscal year 2019, AmerisourceBergen reported earnings of US$1.11 billion, with an annual revenue of US$179.58 billion. AmerisourceBergen's shares traded at over $88 per share, and its market capitalization was valued at over US$19.2 billion in September 2019. Controversies Opioid epidemic AmerisourceBergen is among several distributors that have been sued by West Virginian governments for contributing to the Opioid epidemic, by shipping inordinate amounts of pain medication into the state. In December 2019, Michigan became the first state to sue AmerisourceBergen and three other opioid distributors as drug dealers for their role in the state's opioid crisis. The lawsuit is filed under the Michigan Drug Dealer Liability Act. AmerisourceBergen was among four companies who, because of their role in the addiction crisis, agreed to pay $260 million to two Ohio counties. In May 2020, Oklahoma Attorney General Mike Hunter sued AmerisourceBergen in Bryan County District Court, Oklahoma. The lawsuit alleged that the company's actions helped fuel Oklahoma's opioid crisis. The suit was filed along with lawsuits against Cardinal Health and McKesson, and the three lawsuits allege that the three companies provided \"enough opioids to Bryan County that every adult resident there could have had 144 hydrocodone tablets.\" In January 2022, AmerisourceBergen, McKesson, Cardinal Health, and Johnson & Johnson agreed to pay $26 billion to settle with all but five of the states suing them. The deal covered the bulk of the grievances against these four companies, including 90 percent of municipal governments, 46 states, and Washington, DC. Had the states gone to court, the companies could have faced up to $95 billion in penalties. AmeriSource Bergen and the three other companies did not admit wrongdoings. Legal issues In October 2018, AmerisourceBergen agreed to pay $625 million to settle civil fraud allegations resulting from its repackaging and sale of adulterated drugs and unapproved new drugs, double billing and providing kickbacks to physicians. The company had previously been found guilty of a misdemeanor charge related to the repackaging and distribution of pre-filled syringes that lacked FDA approval. In connection with this case, AmerisourceBergen agreed to pay $260 million, bringing the total settlement amount to $885 million. As part of the civil settlement, ABC admitted that between January 2001 and January 2014, MII and OSC operated a program that created, packed and shipped millions of pre-filled syringes (PFS) to oncology practices for administration to vulnerable cancer patients (the PFS Program). At MII, an ABC subsidiary located in Alabama, the drug product was removed from the original glass vials and multiple vials of the product were pooled in untested plastic containers. Then the drug, including the overfill, was extracted and repackaged into syringes. By harvesting the overfill, ABC was able to create more doses than it bought from the original vial manufacturers and avoid opening some of the vials. ABC retained the unopened vials and sold them to other customers and to its subsidiary ABDC for resale. During the 13 years the PFS Program was in operation, MII manufactured thousands of syringes daily, and eventually over one million syringes per year. These syringes were sold throughout the United States. Approximately 57% of the patients who were injected with the PFS were Federal Health Care Program beneficiaries. The profit from the PFS Program was between $2.3 and $14.4 million annually for a total profit of at least $99.6 million. ABC’s scheme enabled it to bill multiple health care providers for the same vial of drug, causing some of those providers to bill the Federal Health Care Programs for the same vial more than once. The scheme also enabled ABC to increase its market share by offering various product discounts, which it leveraged to obtain new customers and to keep existing customers who purchased its entire portfolio of oncology drugs. ABC excluded the entire PFS Program from its standard regulatory audit and pedigree compliance programs. AmerisourceBergen's stock price reportedly plummeted after they were among other drug distributors who offered $10 billion to settle their portion of the national opioids lawsuit. States countered with $45 billion. In 2022, the United States government filed a lawsuit against AmerisourceBergen for contributing to the opioid crisis in America. The suit, which was filed by the United States Department of Justice with federal prosecutors in New Jersey, Colorado, Pennsylvania, and New York, alleged that the company distributed opioids that were later resold illegally."
}