{
  "ticker": "COST",
  "cik": "0000909832",
  "company_name": "Costco",
  "corrected_name": "Costco",
  "wiki_title_used": "Costco",
  "exists": true,
  "raw_text": "Costco Wholesale Corporation, doing business as Costco, is an American multinational corporation which operates a chain of membership-only big-box warehouse club retail stores. As of 2021, Costco is the third-largest retailer in the world, and as of August 2024, Costco is the world's largest retailer of beef, poultry, organic produce, and wine, with just under a third of American consumers regularly shopping at Costco warehouses. Costco is ranked 11th on the Fortune 500 rankings of the largest United States corporations by total revenue, as of 2024.\nCostco's worldwide headquarters are in Issaquah, Washington, an eastern suburb of Seattle, but its Kirkland Signature house label bears the name of its former location in Kirkland. The company opened its first warehouse (the chain's term for its retail outlets) in Seattle in 1983. Through mergers, however, Costco's corporate history dates back to 1976, when its former competitor Price Club was founded in San Diego, California.\nCostco originally began with a wholesale business model aimed at enrolling businesses as members, then also began to enroll individual consumers and sell products intended for them, including its own private label brand. As of October 2025, Costco operates 918 warehouses worldwide, with the majority of them being in North America (United States, Canada, and Mexico).\n\nHistory\nPrice Club\nCostco's earliest predecessor, Price Club, opened its first store on July 12, 1976, on Morena Boulevard in San Diego, California. It was founded three months earlier by Sol Price and his son, Robert, after a dispute with the new owners of FedMart, Price's previous membership-only discount store. Price Club was among the first retail warehouse clubs, beginning with its Morena Boulevard store inside a series of old airplane hangars once owned by Howard Hughes. The store, known as Costco Warehouse #401, is still in operation today.\nPrice Club's sales model targeted small business owners, selling items in bulk for a discounted price at no-frills outlets that were accessible only with an annual membership fee. The company launched an initial public offering in 1980 and expanded to 24 locations in the Southwest and 1.1 million members by early 1986. Price Club expanded into Canada in 1986, opening a store in Montreal, followed by a Mexico City store in 1992 as part of a joint venture with hypermarket chain Controladora Comercial Mexicana. The company also announced plans to open stores in Spain and Portugal through their Canadian subsidiary.\n\nCostco opens\nJim Sinegal and Jeffrey H. Brotman opened the first Costco warehouse in Seattle on September 15, 1983. Sinegal had started in wholesale distribution by working for Sol Price at FedMart; Brotman, an attorney from an old Seattle retailing family, had also been involved in retail distribution from an early age. Sinegal began his retail involvement as a grocery bagger. At its launch, Costco sold goods to small businesses at a markup of only 8 or 9 percent over the wholesale price.\nA second store opened in Portland, Oregon in October, and a third in Spokane in December 1983. In December 1985, Costco went public, opening on the NASDAQ at $10 per share; at the time, the company had 17 warehouses nationally and 1,950 employees. The company was initially headquartered at its first warehouse in Seattle but moved its headquarters to Kirkland in 1987.\n\nThe \"PriceCostco\" merger\nIn 1993, Costco and Price Club agreed to merge operations after Price declined an offer from Walmart to merge Price Club with their warehouse store chain, Sam's Club. Costco's business model and size were similar to those of Price Club, which made the merger more natural for both companies. The combined company took the name PriceCostco, and memberships became universal, meaning that a Price Club member could use their membership to shop at Costco and vice versa. PriceCostco boasted 206 locations generating $16 billion in annual sales. PriceCostco was initially led by executives from both companies, but in 1994, the Prices left the company to form PriceSmart, a warehouse club chain in Central America and the Caribbean unrelated to the current Costco.\nCostco moved its headquarters from Kirkland to Issaquah in 1996. It chose to build a new headquarters campus next to a warehouse store to allow buyers to check sales and merchandise. They had originally planned to move by December 1993 to Redmond, another Eastside city, but delays in road construction near the warehouse site caused the company to reconsider. The former Kirkland headquarters, a 10.7-acre (4.3 ha) campus, was sold in late 1996.\nThe company began testing store conversions to Costco branding across the Southwestern United States in late 1996. It officially reverted to using the Costco name and stock symbol in February 1997, with all remaining Price Club locations subsequently rebranded as Costco. In March 2020, Costco announced the acquisition of Innovel, a logistics company, for one billion dollars.\n\nOther company milestones\nThe first Costco warehouse in Seattle was replaced with a new building on an adjacent lot to the north in March 2005; the company was able to arrange to keep the same address for the new building, which was on land acquired from Seattle Public Schools. The original building was demolished and replaced by a parking lot, gas station, and car wash—the company's first—which opened in 2006. In 2014, Costco was the third largest retailer in the United States. That year Costco announced plans to open an online store in China using Alibaba Group.\nCostco announced the opening of 29 new locations in 2016, the most in one year since 2007. Span Construction, led by King Husein, has constructed almost all of Costco's buildings since 1989.\nCostco opened its first warehouse in China on August 27, 2019, in Shanghai. The store attracted so many customers that it had to close after only a couple of hours. The first Costco in New Zealand opened at West Auckland in September 2022, delayed from mid-August due to the economic impact of the COVID-19 pandemic.\n\nCostco today\nIn the United States, Costco's main competitors operating membership warehouses are Sam's Club (a subsidiary of Walmart) and BJ's Wholesale Club. Costco employs 316,000 full and part-time employees worldwide. Costco had 90.3 million members in 2017. In 2020, Costco had 105.5 million members. In 2021, the company had 111.6 million members. As of November 2023, Costco had 129.5 million members.\nCostco was the first company to grow from $0 in sales to $3 billion in sales in under six years. For the fiscal year ending on August 31, 2012, the company's sales totaled $97.062 billion, with $1.709 billion net profit. As of 2019, Costco is ranked No. 14 on the Fortune 500 rankings of the largest United States corporations by total revenue. The ACSI (The American Customer Satisfaction Index) named Costco number one in the specialty retail store industry with a score of 84 in 2014.\nFrom December 2013, Costco's board of directors was chaired by co-founder Jeffrey H. Brotman and included Sinegal, co-founder and director, and two officers of the company: president and CEO W. Craig Jelinek and CFO Richard A. Galanti. On August 1, 2017, Brotman died. As of August 2017, Sinegal and Jelinek remained on the board. Jim Sinegal stepped down in 2018.\nDuring the 2010s, Costco outgrew its original three-building headquarters campus in the Pickering Place area of Issaquah—known simply as Buildings 1, 2, and 3—and was forced to put new employees into various leased buildings throughout the city. In April 2019, Costco broke ground on Building 5, a multilevel parking garage with an attached meeting center and fitness center, followed in January 2020 by Building 4, a nine-story office tower next to Interstate 90. The two new buildings were finished in June 2023, and then Costco moved its headquarters employees from Buildings 1, 2, and 3 into the new Building 4. The three original buildings were repurposed for the use of Costco's information technology department.\nIn September 2024, Costco raised its membership fees, increasing Gold Star and Business memberships from $60 to $65 and Executive memberships from $120 to $130, affecting 52 million members, with the Executive reward cap raised from $1,000 to $1,250. In June 2017, fees had increased from $55 to $60 for Gold Star and Business and from $110 to $120 for Executive memberships. In 2024, Costco implemented barcode scanners at warehouse entrances, requiring members to scan their physical or digital card's QR code to prevent membership sharing, replacing the practice of showing cards. Also in 2024, food court access was restricted to members only, ending non-member purchases. Starting June 2025, select locations, such as Manhattan, will offer exclusive 9 a.m. shopping hours for Executive Members to provide a less crowded experience. These changes align with Costco's strategy to bolster its membership model, which generated 65.5% of its 2024 net operating income, by enhancing exclusivity and revenue.\n\nLocations\nAs of October 2025, Costco operates 918 warehouses worldwide.\n\n632 in the United States (including Puerto Rico)\n111 in Canada\n42 in Mexico\n37 in Japan\n29 in the United Kingdom\n20 in South Korea\n15 in Australia\n14 in Taiwan\n7 in China\n5 in Spain\n3 in France\n2 in Sweden\n1 in Iceland\n1 in New Zealand\n\nThe company's warehouses throughout the world are all similarly designed, featuring generally identical layout, signage, and parking lot markings. A typical warehouse uses a simple loop for its main corridor from the entrance to the checkout area. Costco has contracted with architecture firm MG2 for over 800 of its locations, which are typically built within a 110-day schedule.\nFood court menus are tailored for local preferences, with meat pies on offer in Australia; poutine in Canada and France; seafood-topped pizza in Asian locations; pastor taco-topped pizzas in Mexico; clam chowder in Japan, South Korea, and Taiwan; plokkfiskur in Iceland; and jacket potatoes in the United Kingdom.\nIn Canada, the company participates in the voluntary Scanner Price Accuracy Code managed by the Retail Council of Canada.\n\nWarehouses in mixed-use development\nIn September 2024, Costco broke ground on its first-ever mixed-use development in the United States that combines a warehouse store with residential apartments above it. The project, developed in partnership with the real estate developer Thrive Living, includes 800 rental apartments above the 185,000-square-foot (17,200 m2) Costco warehouse in the Baldwin Village neighborhood of South Los Angeles, California. Of the 800 apartments, 184 (23%) will be dedicated to low-income housing, with the remainder offered as workforce and unsubsidized housing. The project is made possible by California's state law AB 2011 for affordable housing, which went into effect on July 1, 2023.\n\nLargest and smallest warehouses\nIn 2005, Costco's largest store (by area) was in Hillsboro, Oregon, with 148,663 sq ft (13,811.2 m2). In 2015, Costco completed an expansion in Salt Lake City, Utah, making it the new largest Costco at 235,000 sq ft (21,800 m2). The Salt Lake City store was the first to be expanded into a hybrid between the conventional Costco warehouse format and the newer Costco Business Center format, which explains its gigantic size.\n\nIn 2023, Costco had planned on building a new warehouse store in Fresno, California, which would have had a 241,000 sq ft (22,400 m2) footprint, making it the largest store. But the city only approved 219,000 sq ft (20,300 m2). In 2019, Costco opened its biggest store in Canada, in St. John's, Newfoundland and Labrador; the store is 182,000 sq ft (16,900 m2). \nAs of 2019, the smallest Costco is in Juneau, Alaska at 76,696 sq ft (7,125.3 m2). The warehouse is the only one left from a 1993 initiative in which Costco experimented with small-format warehouses. Although the company concluded that the small format does not work for most markets, it determined that the format was acceptable for Juneau.\n\nCostco Business Centers\nCostco Business Centers are warehouses similar to regular Costco warehouses and are open to all Costco members, regardless of membership type. Their merchandise caters predominantly to enterprises, with a focus on small businesses. Business Centers do not carry most consumer items like clothing, jewelry, media, and tires, while carrying larger quantities and more options for business products which they carry. More than 70% of the items that can be acquired from a Costco Business Center are not found in a typical Costco store. Some locations have a food court, a gas station, or both. They have large parking spaces for trucks and are capable of delivering goods to businesses in bulk quantities, with a delivery charge of $25 for orders that are below $250. Costco Business Center operating hours are shorter than regular warehouses (usually opening at 7:00 am on Mondays to Saturdays and closed on Sundays), while discounts and coupons for Business Centers are issued separately from regular warehouses.\nThe first Business Center was a converted Costco warehouse in Lynnwood, Washington, which reopened in October 1996, following renovations; the change was made after a conventional Costco warehouse had opened in nearby Everett.\n\nLocations\nAs of August 2022, there are 26 Costco Business Centers in the United States.\nThe first Costco Business Center outside the US opened in Canada in Scarborough, Ontario, in March 2017. In September 2020, the second Canadian Costco Business Centre opened in Saint-Hubert, Quebec, near Montreal. A third Canadian Business Centre opened in the Ottawa neighborhood of Gloucester in March 2021.\n\nCostco Home Showroom\nIn 2022, Costco opened a Costco Home Showroom in San Juan, Puerto Rico, and then opened a second one in Anchorage, Alaska, in 2024. A third one opened in Pearl City, Hawaii, in 2024.\nUnlike traditional Costco warehouses and the defunct Costco Home format, the Home Showroom format is not a cash-and-carry store. The showroom cannot sell goods on the spot to members to take home with them that same day; members must place orders to be delivered to their homes. It is merely a showroom for \"expensive, large, and bulky items\" like furniture and appliances. Costco had already begun to offer a broader selection of furniture and appliances through Costco.com than it could fit into its traditional warehouses, but found that it was \"daunting\" for many people to order those items online without having first touched, felt, and seen the goods in person.\n\nFinances\nSales volume\nIn 2011, Costco's highest-volume store was in Seoul, South Korea. In 2018, the store in Taichung, Taiwan, ranked at the top in the number of members and was second in the world in sales volume, behind South Korea's Yangjae store in Seoul. Of the 14 Costco operations in Taiwan, three ranked in the top 10 in the world in sales volume: Taichung, Neihu, and Chungho.\n\nOwnership\nCostco is mainly owned by institutional investors, who own over 70% of shares. The largest shareholders as of September 2024 are:\n\nThe Vanguard Group (9.40%)\nBlackRock (7.56%)\nState Street Corporation (4.06%)\nGeode Capital Management (2.14%)\nMorgan Stanley (2.13%)\nFidelity Investments (FMR) (2.10%)\nBank of America (1.59%)\nNorges Bank (1.20%)\nNorthern Trust (1.05%)\nBNY Mellon (1.01%)\n\nBusiness model\nCostco is a membership-only warehouse in which customers must buy a membership to access the warehouse and make purchases. Revenue from membership fees accounts for the majority of the company's profits, accounting for over 72% of the company's net operating income in fiscal years 2022 and 2023, and 65.5% in fiscal year 2024.\nCostco divides its business into three segments for the purpose of reporting revenue and operating income. The segments, ordered by size, are:\n\nUnited States Operations (72.4% of total revenue)\nOther International Operations (13.9% of total revenue)\nCanadian Operations (13.7% of total revenue)\n\nSales model\nOne company rule states that no regular item may be marked up more than 14% over cost and no Kirkland Signature item may be marked up more than 15% over cost. The company runs very lean, with overhead costs at about 10% of revenue and profit margins at 2%. For example, Costco has no public relations department and buys no outside advertising.\nCostco's sales model is to focus on limited selection over variety. Although consumer products often come in many different varieties, Costco will not carry most of those variants, but instead will carry only one or two examples of what is essentially the same product and try to sell a higher volume of units at a lower price. Thus, a typical Costco warehouse carries only 3,700 distinct products, while a typical Walmart Supercenter carries approximately 140,000 products. If Costco feels the wholesale price of any individual product is too high, they will refuse to stock the product. For example, in November 2009, Costco announced that it would stop selling Coca-Cola products because the soft-drink maker refused to lower its wholesale prices. Costco resumed selling Coca-Cola products the following month. Finally, Costco insists that manufacturers must package their products in large sizes and properly arrange them on pallets suitable for deployment to its warehouses. However, unlike most chain stores, Costco does not sell shelf space to manufacturers.\nDue to its massive size and its extremely selective approach to buying products, Costco has become a powerful \"arbiter\" between manufacturers and consumers. From the perspective of small manufacturers, the reward for jumping through all these hoops to sell products to Costco is the possibility of obtaining international distribution through the company's warehouses in other countries. If a manufacturer's product is popular at warehouses in its home country, Costco may look into whether members in other countries might also be interested in that product.\nAlthough the company engages in visible efforts to reduce costs, the stores themselves are expensive. In 2013, Costco spent approximately $80 million on each of the new stores it opened.\n\nThe cost is partly driven by the cost of real estate, as each new store requires enough space to support a building of approximately 150,000 square feet (14,000 m2) in size, a large parking lot, and often a gas station. Lighting costs are reduced on sunny days because most Costco locations have several skylights. During the day, electronic light meters measure how much light is coming in the skylights and turn off an appropriate percentage of the interior lights. During an average sunny day, it is normal for the center section of the warehouse not to have interior lights in use.\nRotisserie chickens are a major driver of customer traffic and sales for Costco, which has sold them since 1994 amid the then-rising popularity of Boston Market. In response to the annual growth of per-capita chicken consumption in the United States, Costco opened a factory in Nebraska in 2019 that implemented vertical integration across all aspects of poultry production in a bid to keep their pricing intact while maintaining consistent quality control of them. In some international markets, Costco also offers sushi that is made in-house; the Issaquah warehouse became the first US store to have in-house sushi in 2023.\nCostco is known for its \"exit greeters\", who briefly compare receipts against shopping cart contents as customers exit. They are trained to quickly count cart contents and serve as a form of customer service to verify that customers were charged correctly, have redeemed any voucher-based items (e.g., tickets), and have not missed items placed in their cart's lower racks. Costco has used exit greeters since its first store opened in Seattle in 1983.\n\nManagement model\nCostco is known for a strong corporate culture which encourages and rewards loyalty and promotes from within. As of 2024, Costco claims to have a retention rate over 90% for new employees who make it to one year. Many of its senior executives started as front-line employees in its warehouses and spent many years rising through the ranks to reach their current positions. For example, Ron Vachris started in 1982 as a forklift driver at a Price Club in Arizona and became only the third chief executive officer in Costco's history in 2024. Since 95% of the company's workforce is in its warehouses, and so many of its executives started their careers there, the company's culture is tightly focused on supporting the warehouse experience.\nAt Costco headquarters in Issaquah, all 7,000 headquarters employees sit in cubicles, including the chief executive officer. However, the CEO does get to have a slightly larger cubicle. All Costco executives are expected to get out of the office regularly and spend the majority of their time in the field visiting warehouses and solving problems. The CEO attempts to visit as many warehouses as possible around the world in a cycle every 18 to 24 months, while executives responsible for smaller geographical areas are expected to visit all the warehouses under their supervision much more often.\n\nOnline shopping\nCostco primarily focuses on getting members to come in to a warehouse for purchases, instead of ordering products online. Due to the COVID-19 pandemic, Costco's online sales increased dramatically, with more online sales growth in 2020 than the previous five years combined. In November 1998, the company launched Costco Online, its online shopping site. The site expanded to incorporate B2B e-commerce on April 17, 2001.\nCostco operates online stores in only some of the countries in which it has warehouses: the U.S., Canada, the U.K., Mexico, South Korea, Taiwan, Japan, and Australia. Instacart offers Costco delivery in a select number of states, including Arizona, California, Colorado, Florida, Georgia, Illinois, Indiana, Massachusetts, Maryland, Minnesota, Missouri, North Carolina, New Jersey, New York, Oregon, Tennessee, Texas, Virginia, Washington, and the District of Columbia. In Canada, Costco uses Instacart for online grocery delivery for non–dry goods, pantry staples and household essentials.\nSimilarly, in March 2017, Costco initiated a partnership with Shipt, an online grocery delivery service. Unlike Instacart, Shipt charges its own membership fee, $99 a year or $14 a month, in exchange for free delivery on orders over $35. As of November 2018, Shipt offers Costco delivery in select Florida markets. In October 2017, Costco launched same-day and two-day grocery delivery options for members. In Iceland, Costco began in June 2023 to allow individuals over the age of 20 to purchase alcoholic beverages online and pick them up at the warehouse stores. The \"click and collect\" arrangement was previously only available to businesses having a liquor license.\n\nProducts\nCostco frequently rotates its inventory, often stocking items temporarily or seasonally. In 2017, Sinegal described this as a \"treasure-hunt atmosphere\". This model creates a \"sense of urgency\" in shoppers to impulsively buy a good deal as soon as they spot one because it may not be available at the next visit.\nOver the years, Costco has significantly expanded its range of products. While initially focusing on bulk, boxed items easily displayed in store by removing the stretch wrap from a pallet, Costco's offerings now include a diverse array of items of all shapes and sizes. These range from art, books, caskets, and clothing, to computer software, fine wine, furniture, home appliances, electronics, hot tubs, jewelry, and various perishable goods like dairy, baked items, flowers, produce, meat, and seafood. Other items such as solar panels, tires, and vacuum cleaners, have also found their way into Costco's product lineup. Its growth has led it to become a dominant purchaser for some goods. As of 2025, Costco sold more than half of the world's cashews, for example, with direct implications for over a million cashew farmers in Africa.\nBeyond products, many Costco warehouses feature additional services including gas stations, pharmacies, hearing aid centers, optometry and eyewear departments, and tire installation garages.\n\nAlcohol\nAlcohol sales at Costco vary by location due to differing regulations. In some places, separate liquor stores exist to adhere to licensing laws, whereas in others, alcohol is available within the main warehouse alongside general merchandise. In certain states, like Texas, liquor sales must be conducted by a separate business entity with its own staff.\nCostco's desire to alter its alcohol sales structure in its home state faced a setback in 2006 when it lost its court battle against the state of Washington's requirement for retailers to buy wine through the state-controlled system. The company then changed strategies. Costco spent over $22 million to support Initiative 1183, versus $11.75 million from opponents, \"the most expensive initiative fight\" in Washington's history. In the November 8, 2011, election, Initiative 1183 passed with 60 percent of the vote and led to the demolition of Washington's government's monopoly on the distribution of liquor and spirits for retail sale through state-owned and state-licensed liquor stores.\nThe Costco warehouses with the largest wine departments have a \"wine steward\" who roams around that department and advises Costco customers on what wines are best for their needs. As of October 2024, Costco employed about 30 wine stewards at its US warehouses. In the 21st century, Costco has made its store openings into special events by featuring special selections of whiskey, wine, and other alcoholic beverages that are extremely rare and not normally sold at its warehouses, or extremely cheap, or both. For the October 2024 opening of Costco's first warehouse in Napa, California, die-hard whiskey fans began camping out on the sidewalk six days in advance.\nInternational operations must navigate regional laws as well. For example, Costco's first store in Victoria, Australia, operates under the country's relatively liberal alcohol licensing laws, allowing sales directly off the shelf as is common in most European countries. However, in New Zealand, Costco's sole warehouse in West Auckland is restricted from selling alcohol due to a local monopoly on liquor retail.\n\nBooks\nFor its first four decades, Costco was a major American bookseller in its own right, in an era in which e-commerce giant Amazon and big-box bookstore chain Barnes & Noble were wiping out traditional bookstores. Costco became one of the few American brick-and-mortar retail outlets where many shoppers who rarely visited bookstores could easily detour to the book section to browse hard-copy books, discover books they might not have otherwise noticed, and buy them right away. When Costco chose to buy any particular book, it usually acquired tens of thousands of copies, which was important to a publishing industry where a print run of 50,000 copies is a big deal.\nIn the 2020s, Costco management reportedly began to consider no longer carrying books as a year-round product category because they are extremely labor-intensive products. New books must be unpacked and laid out by hand on tables when released each Tuesday, while books that failed to sell must be manually collected and returned to their publishers.\nIn 2022, Costco quietly closed the year-round book sections in its Alaska and Hawaii warehouses. In June 2024, several publishing executives warned that in January 2025, Costco was planning to do the same across its 600 warehouses in the contiguous United States. In other words, books would become just one more rotating inventory item for eight months each year and would reappear as a full section only during the holiday shopping season in the last four months of each year. This was deeply alarming to a publishing industry already facing stagnating book sales. In November 2024, Costco agreed to keep year-round book sections for the time being in 100 of its 600 mainland US warehouses.\n\nGold and platinum bullion products\nCostco began selling one-ounce, 24-karat gold bars in October 2023. While typically selling for about 2% above the spot price, Costco offers 2% cash back for executive members and another 2% for users of certain credit cards. Thus, it is seen as a low-profit venture for Costco and a loss leader for increasing store memberships.\nIn 2024, following the success of the gold bar products being sold, Costco began selling platinum .9995 fine bars as a direct-to-consumer product eligible for purchase on their website.\n\nKirkland Signature: Costco's private label brand\nKirkland Signature is Costco's private label brand, featured on a wide array of products sold across Costco's warehouses and its website. Launched in 1995, the brand takes its name from the original location of Costco's corporate headquarters in Kirkland, Washington. It accounts for nearly one-third of the company's sales and outpaces the growth of Costco's overall sales.\nIn 2024, the Kirkland Signature brand recorded $86 billion in revenue. This was more than all the revenue earned by consumer products giant Procter & Gamble in 2024.\nThe aim of the Kirkland Signature brand was to offer products with brand name quality at discounted prices. Recognizing the typical consumer skepticism common with private labels, Costco has adopted a strategy of co-branding certain items with well-known manufacturers to bolster consumer trust. Notable co-branded products include those from Chinet, Jelly Belly, Keurig Green Mountain, Ocean Spray, Stearns & Foster, and Starbucks. Additionally, while some Kirkland Signature products maintain a generic label, they are produced in partnership with Duracell, Niagara Bottling, and other recognized companies. The brand often uses simple, minimalist packaging, reflecting its focus on offering high-quality products at affordable prices.\nTo ensure high quality, the CEO of Costco personally evaluates and grants final approval to all Kirkland Signature products. Such products are expected to sell in high volumes like name-brand products, and are equally vulnerable to swift removal if they fail to sell as expected.\nFrom the perspective of manufacturers, one advantage of entering into a Kirkland Signature private label deal is that it frees them from the burden of sales and marketing campaigns to establish brand awareness among consumers. If a manufacturer has developed a promising new product with expensive ingredients and a slim profit margin, that could mean the difference between not launching at all or a nationwide product launch at Costco warehouses under the Kirkland Signature brand.\n\nPublications\nCostco Connection\nCostco Connection is a magazine sent free to Costco executive members; it can also be accessed online by anyone, free of charge. As of 2024, the magazine is distributed to 15.4 million households and has 300,000 copies across its warehouses. It has the third-highest magazine circulation in the United States, behind two AARP magazines.\nThe magazine was established in 1987 as a newsprint publication and converted to a magazine in 1997. It features articles which regularly tie into the corporation along with business, celebrity features, cooking, entertaining, health, home improvement, and social articles, as well as coupons and ads. MediaPost reports: \"While about 90% of the magazine's advertising is co-op, increasingly national advertisers such as Procter & Gamble are buying space, notes Roeglin--presumably because of the pub's gargantuan reach and the data it has on its subscribers (whose average household income is $156,000 a year). 'We see about 56% of our subscribers a month buy something at one of our stores based on something they've read in the magazine,' says Roeglin.\"\n\nServices\nConcierge service\nCostco offers a free \"concierge\" service to members who purchase electronics, to help answer questions regarding setup and use, and avoid potential returns due to not understanding how to use the products.\n\nCostco Auto and Home Insurance\nCostco has an agreement with CONNECT, powered by American Family Insurance, for auto insurance, home insurance, and umbrella insurance.\n\nCostco Optical\nCostco Optical ranks as the fifth-largest optical company in the US, as of 2015. Optometrists working at Costco locations will see patients without Costco memberships, although a membership is required to fill a prescription at the optical department.\n\nCostco Travel\nCostco Travel is a wholly owned subsidiary of Costco Wholesale and offers leisure travel to Costco members of the United States and Canada. The program offers vacation packages to the Caribbean, Europe, Florida, Hawaii, Las Vegas, Mexico, and the South Pacific.\n\nFood service\nIn 1985, Costco began to sell freshly prepared food through a hot dog cart at its original Seattle warehouse. Most Costco locations now have a food court. They can be indoors or outdoors, but the menu is essentially the same: hot dog with drink (one of the most popular items), pizza, frozen yogurt/ice cream, Coca-Cola beverages, baked items, and sandwiches. Costco offers its signature quarter-pound 100% beef hot dog and 20 US fluid ounces (590 ml) drink (with refills) for US$1.50, the same price since 1985. Some US locations also offer Polish sausage or bratwurst in addition to hot dogs, at the same $1.50 price.\nThe hot dog sausages were kosher and supplied by Hebrew National and Sinai Kosher until 2009, when supply issues and low profit margins led Costco to start producing them in-house under the Kirkland Signature label to maintain the $1.50 price. In Australia and New Zealand, the hot dog is made of pork and is sold with a large soda for $1.99 (AUD/NZD). In Canada, the price for a hot dog and soda with refills is C$1.50. In Mexico, the hot dog is made of 100% beef and includes a drink (with refills) for MXN$35. In the UK, the hot dog is also made from beef, and customers get a drink (with refills) for £1.50. Costco sold more than 137 million quarter-pound (113 g) hot dogs in its food courts in 2017. In Taiwan and Japan, the hot dog is made of pork as well. Japan's price for their 120-gram (4½ oz.) hot dog and refillable 600-ml (20 fl. oz.) drink is ¥180.\nIn a July 2024 interview, CEO Ron Vachris reiterated Costco's commitment to the US$1.50 price point for the hot dog combo and promised that the price would not rise on his watch.\nAs of April 2024, cheese or pepperoni pizza (along with pre-ordering of full pizzas to take home), chicken bakes, ice cream (vanilla, chocolate, or twist), ice cream sundae, fruit smoothies, latte freeze (without chocolate), mocha freeze (with chocolate), and chocolate chunk cookies (replacement of twisted churros) are offered at all United States locations. Some food court items are only available in certain countries. For example, the bulgogi bake and mango boba tea are only available in Australia, Taiwan, South Korea, and Japan; poutine is available in Canada and France. There are, however, temporary menu items available exclusively in several countries, like the pastor taco-topped pizzas in Mexico.\n\nDue to slow sales, in 2009, the pretzel was replaced by the churro. In April 2013, Pepsi replaced all Coca-Cola fountain drinks sold at US locations because Coke had raised its prices; this helped keep the hot dog combo with soda at its original US$1.50 price; however, in late 2024, it was reported that Costco would be reverting to Coca-Cola products in early 2025. Warehouses began the transition in July 2025.\nCostco started selling a cheeseburger with a 1⁄3-pound (150 g) patty at select stores across Western Washington and Southern California in mid-2017 as a test item, with comparisons drawn to those of Shake Shack. The cheeseburger was not successful; its availability only spread to around a dozen locations before it was discontinued in 2020. Amid the COVID-19 pandemic, Costco enacted safety measures for its food courts in March 2020, removing the seating areas and drastically reducing the food court menu to just hot dogs and pizza. Diced onion returned as a topping in May 2023, but it was offered in plastic cups instead of the crank-driven onion dispensers present pre-pandemic. The combo pizza was also removed as a menu item in 2020; it was indirectly replaced in May 2025 by a combo calzone, which received mixed reception regarding its $6.99 price.\n\nCostco credit card\nOn April 1, 2016, in the US, Citigroup became the exclusive issuer of Costco's branded credit cards. Before that, Costco credit cards had been issued by American Express since 2001, and Costco accepted only American Express cards for credit transactions. After the switch of its co-branded cards to Citi, Costco ceased accepting AmEx and began exclusively accepting Visa. AmEx cited the reason for the split that Costco was asking for lower transaction fees than AmEx was willing to grant. In Canada, Costco ended its AmEx relationship in 2014, and starting in 2015, it partnered with Capital One Mastercard for branded credit cards. In 2020, Capital One announced it would be ending the partnership in late 2021. It was announced that beginning in March 2022, Costco will begin a partnership with CIBC Mastercard. Costco branded credit cards from both issuers also serve as alternate Costco membership cards, with a customized reverse side containing membership info.\n\nCostco Audiobook App\nIn March 2021, Costco started selling audiobooks and launched a corresponding iOS and Android app to listen to purchases. The app is free; however, the books are exclusive to Costco members. The retailer sells audiobooks in bundles grouped by genre or author, with prices ranging from $5 to $50. Audiobooks are currently only available at US locations.\n\nLabor relations\nEmployee rights\nWhile some former Price Club locations in California and the northeastern United States are staffed by Teamsters, the majority of Costco locations are not unionized, although there was a drive in 2012 to unionize some locations in Canada. The Teamsters report that over 15,000 Costco employees are union members. The non-union locations have revisions to their Costco Employee Agreement every three years concurrent with union contract ratifications in locations with collective bargaining agreements. The Employee Agreement sets forth such things as benefits, wages, disciplinary procedures, paid holidays, bonuses, and seniority. The Employee Agreement is subject to change by Costco at any time and offers no absolute protection to the workers. As of June 2022, non-supervisory hourly wages ranged from $17.50 to $28.45 in the US, $16.00 to $28.70 in Canada, and £9.75 to £13.90 in the United Kingdom. In the US as of 2005, eighty-five percent of Costco's workers had health insurance, compared with less than fifty percent at Walmart and Target. Health benefits include coverage through Aetna, remote primary care through Teladoc, second opinions and clinical navigation by Grand Rounds, varieties of health insurance agencies with Custom Benefit Consultants Inc. (CBC), and wellness coaching by Omada.\nIn February 2021, Costco announced that it would be raising the starting rate for its hourly store workers in the United States to $16 an hour. Costco has been actively raising its minimum wage, starting with $14 in 2018 to $15 in 2019. They further add that 20% of their hourly employees will be subject to the minimum wage change.\nA location in Norfolk, Virginia, unionized with the Teamsters in 2023. The vote in Norfolk was the first successful Costco union drive in over twenty years. In January 2025, the Teamsters union representing over 18,000 Costco employees voted to strike, demanding \"fair wages and benefits.\"\n\nContractors\nCostco contracts exclusively with two independent companies to provide employees for product demonstrations (e.g., food samples) at Costco stores: Club Demonstration Services (CDS) and Warehouse Demo Services (WDS). Demonstration employees receive a pay and benefit package that is less than that of Costco employees. As of August 1, 2017, demonstrations/samples are provided by CDS in Canada. Product demonstrations at Costco stores in the United States were halted in March 2020 amid the COVID-19 pandemic, with some Costco CDS employees shifted to cleaning tasks before all were laid off when CDS temporarily ceased operations the following month; they were rehired as Costco started resuming demonstrations at select stores in June 2020, with all US stores resuming demonstrations by June 2021.\n\nDiscontinued concepts\nCostco Home\nThe first Costco Home warehouse opened in December 2002, in Kirkland, Washington. The warehouse's concept was to combine the value, setting and members-only elements of Costco's warehouse clubs with the product array one would find at an upscale home store, such as Fortunoff or Crate & Barrel. The Costco Home warehouses sold furniture, housewares, kitchen products and accessories from higher-end brands such as Lexington, Ralph Lauren and Waterford in a warehouse-club setting. Like traditional Costco warehouses, Costco Home was a cash-and-carry format with onsite inventory available for immediate pickup, meaning that members could collect and take items home with them that same day. A second warehouse opened in 2004 in Tempe, Arizona.\nOn April 2, 2009, the company announced that it would be abandoning its Costco Home concept, closing the two existing stores in Kirkland, Washington and Tempe, Arizona on July 3, 2009, and abandoning plans for a third warehouse in Portland, Oregon.\n\nCostco Fresh\nA grocery-centered format, named Costco Fresh, was announced in September 1999 for a 75,000-square-foot (7,000 m2) two-story space in Manhattan, New York City. The company pulled out of an agreement to build the Manhattan store later that year after cost increases and local protests. The concept was revived in late 2002 for a store in Bellevue, Washington, near its Issaquah headquarters, at a former Kmart. The new store would primarily sell fresh produce, meats, seafood, and baked goods instead of bulk items, but would also have several features from normal Costco warehouses; it would also have a modified logo, with a fruit stem growing from the first \"o\" in the Costco name. The concept was dropped the following year, but the company retained interest in building a normal Costco store at the Bellevue site until 2008, when they abandoned the plans due to zoning regulations that would have required daylighting an underground creek.\n\nControversies\nAnimal welfare\nIn 2010, Mercy for Animals conducted an undercover investigation at Buckeye Veal Farm, a veal supplier to Costco. Immediately following the investigative release, Costco adopted a policy against purchasing veal from producers that use the crate-and-chain production method. The case prompted Ohio lawmakers to vote in favor of a veal crate phase-out in the state. In 2012, Mercy for Animals conducted another undercover investigation of a pork supplier to major retailers such as Costco, Walmart, Safeway, Kroger, and Kmart. Before the public release of the investigation, Costco announced they would begin requiring their pork suppliers to phase out gestation crates.\nIn 2015, the Humane Society of the United States conducted an undercover investigation at a Costco egg supplier. An undercover worker at Hillandale Farms, a major egg supplier to Costco, filmed conditions in which egg-laying hens lived in tiny wire cages. Following the investigations, several celebrities including Brad Pitt and Ryan Gosling publicly wrote to Costco to address this issue. In December 2015, following efforts by animal protection nonprofits including The Humane League, Costco released an updated commitment to source exclusively cage-free eggs in its operations.\nIn December 2020, Costco announced plans to end the use of battery cage eggs throughout its operations worldwide, becoming the first US retailer to issue a global policy on the confinement of animals in its supply chain. Josh Dahmen, Costco financial planning and investor relations director, stated: \"We are in the process of making that transition to cage-free eggs. We will continue to increase the percentage over time, with a goal of eventually getting to 100%.\"\nIn 2016, the animal rights group Direct Action Everywhere (DxE) reported cannibalism and high mortality at a cage-free Costco egg supplier. Costco denied the allegations, but the video sparked a discussion about animal welfare problems continuing to exist at cage-free egg farms. Writing in The Huffington Post, DxE co-founder Wayne Hsiung argued that the new investigation, rather than suggesting that Costco should keep birds in cages, indicated that hens should have the right not to be raised for food or kept on farms at all.\nIn October 2020, Costco dropped Chaokoh coconut milk over allegations of forced monkey labor. PETA accused the manufacturer, Theppadungporn Coconut Co., of using forced monkey labor, finding cruelty to monkeys at their farms and facilities. Ken Kimble, Costco's Vice President of Corporate Food and Sundries, condemned the use of monkey labor and stated that Costco launched an investigation regarding the issue and ceased purchasing from the Chaokoh supplier. Kimble also stated that Costco will continue to monitor the implementation of the harvest policies and, once satisfied, will resume purchasing.\nIn February 2021, an undercover investigation by Mercy for Animals showed chickens at a Costco facility in Nebraska unable to move, sitting in feces, and covered with chemical burns. New York Times opinion columnist Nicholas Kristof covered the investigation, accusing Costco of keeping prices low \"in part by developing chickens that effectively are bred to suffer.\" In June 2022, two Costco shareholders represented by the animal rights organization Legal Impact for Chickens sued Costco executives for breach of fiduciary duty. The lawsuit claimed that the company's use of fast-growing breeds violates animal welfare laws in Nebraska and Iowa, undermining Costco's appeal to consumers.\n\nEnvironmental standards\nIn 2014, the US Department of Justice and the United States Environmental Protection Agency alleged that Costco had failed to promptly repair leaks from its refrigeration equipment of the refrigerant chlorodifluoromethane at its stores. Costco paid a fine of US$335,000 and agreed to spend $2 million over three years to fix refrigerant leaks and make improvements at 274 stores.\nCostco was criticized in 2019 by the Natural Resources Defense Council (NRDC) and SumOfUs for using virgin Canadian boreal forest to make its toilet paper. NRDC stated that over the previous twenty years, 28 million acres of Canadian boreal forest had been cut down to make toilet paper.\n\nLabor standards\nIn 2014, The Guardian reported that Costco was a client of Charoen Pokphand Foods. Over six months, The Guardian traced down a supply chain from slave ships in Asian waters to leading producers and retailers. Costco has published a statement stating that it has had a supplier code of conduct since 1999 which does not allow this practice, and that independent auditors check for violations regularly.\nIn June 2023, a Costco employee in South Korea died of heatstroke while organizing shopping carts outside. South Korean government guidelines state that outdoor workers be given a 10- to 15-minute break every hour during heatwave advisories; however, these guidelines were not strictly followed or enforced at the location where the employee worked. He was given 15-minute breaks every 3 hours without a regular supply of drinking water. The company was later fined ₩30 million by the Ministry of Employment and Labor.\n\nPharmacies\nIn September 2016, Costco self-disclosed conduct to the Office of Inspector General after its pharmacy in Waltham, Massachusetts improperly altered prescription drug claims to Medicare Part D and the Massachusetts Medicaid program that resulted in higher reimbursement than was appropriate. They paid a fine of US$340,157.25. In January 2017, Costco was brought to court in the US for lax pharmacy controls in violation of the Controlled Substances Act. Allegations such as Costco \"filling prescriptions that were incomplete\", or were for substances \"beyond various doctors' scope of practice\". The case was settled after Costco paid US$11.75 million.\nIn 2019, the Ontario Ministry of Health fined Costco $CA7.2 million after it found that Costco pharmacies were accepting advertising services from a generic drug manufacturer in Ontario, where it is illegal for a pharmacy to accept rebates, or kickbacks, from a generic drug manufacturer in exchange for promising to stock its brand of drugs. Two Costco pharmacy directors were referred to the Ontario College of Pharmacists and were fined for the misconduct.\n\nProduct quality\nIn July 2015, the US Consumer Product Safety Commission recalled the EKO Sensible Eco Living Trash Can that Costco was selling because the black plastic protective collar in the opening on the back of the trash can could be dislodged, exposing a sharp edge. Costco was fined US$3.85 million for failing to notify the commission about the defect, despite receiving 92 complaints about the trash can, including 60 complaints from those who sustained injuries.\nIn 2017, Costco and Acushnet Holdings sued each other over their golf balls. In August 2017, a federal judge ordered a \"deceptive\" Costco to pay Tiffany & Co. US$19.4 million for misleading consumers into thinking they could buy legitimate Tiffany merchandise at warehouse club prices.\nIn September 2020, CBS News reported that Costco had stopped selling Palmetto Cheese after the owner of the pimento cheese brand called Black Lives Matter a \"terror organization.\" Costco posted a note to the item in their Myrtle Beach location indicating that the item will not be reordered, and over 120 Costco locations throughout the US will no longer be carrying the item.\nIn 2023, the Kaohsiung Department of Health fined Costco numerous times for selling bags of mixed berries imported into Taiwan that tested positive for Hepatitis A. Costco was fined a total of NT12.5 million and was temporarily barred from selling mixed berries in the country. In July 2023, Costco Australia paid $33,000 in penalties for mislabeling the origin of lobster products. Lobsters imported from Canada were labeled as \"Kirkland Signature PREVIOUSLY FROZEN WHOLE COOKED WA LOBSTER\" and \"Australian Lobster\". In August 2023, the Environment Agency of Iceland fined Costco ISK 20 million for a diesel spill originating from a gas station in Garðabær, which contaminated the Hafnarfjörður sewage system.\n\nSee also\nBulk foods\nCostco Guys\nCostco Wholesale Corp. v. Omega, S. A.\nWholesaling\n\nNotes\nReferences\nExternal links\n\nOfficial website \nOfficial UK website\nInstagram\nBusiness data for Costco Wholesale Corporation:",
  "clean_text": "Costco Wholesale Corporation, doing business as Costco, is an American multinational corporation which operates a chain of membership-only big-box warehouse club retail stores. As of 2021, Costco is the third-largest retailer in the world, and as of August 2024, Costco is the world's largest retailer of beef, poultry, organic produce, and wine, with just under a third of American consumers regularly shopping at Costco warehouses. Costco is ranked 11th on the Fortune 500 rankings of the largest United States corporations by total revenue, as of 2024. Costco's worldwide headquarters are in Issaquah, Washington, an eastern suburb of Seattle, but its Kirkland Signature house label bears the name of its former location in Kirkland. The company opened its first warehouse (the chain's term for its retail outlets) in Seattle in 1983. Through mergers, however, Costco's corporate history dates back to 1976, when its former competitor Price Club was founded in San Diego, California. Costco originally began with a wholesale business model aimed at enrolling businesses as members, then also began to enroll individual consumers and sell products intended for them, including its own private label brand. As of October 2025, Costco operates 918 warehouses worldwide, with the majority of them being in North America (United States, Canada, and Mexico). History Price Club Costco's earliest predecessor, Price Club, opened its first store on July 12, 1976, on Morena Boulevard in San Diego, California. It was founded three months earlier by Sol Price and his son, Robert, after a dispute with the new owners of FedMart, Price's previous membership-only discount store. Price Club was among the first retail warehouse clubs, beginning with its Morena Boulevard store inside a series of old airplane hangars once owned by Howard Hughes. The store, known as Costco Warehouse #401, is still in operation today. Price Club's sales model targeted small business owners, selling items in bulk for a discounted price at no-frills outlets that were accessible only with an annual membership fee. The company launched an initial public offering in 1980 and expanded to 24 locations in the Southwest and 1.1 million members by early 1986. Price Club expanded into Canada in 1986, opening a store in Montreal, followed by a Mexico City store in 1992 as part of a joint venture with hypermarket chain Controladora Comercial Mexicana. The company also announced plans to open stores in Spain and Portugal through their Canadian subsidiary. Costco opens Jim Sinegal and Jeffrey H. Brotman opened the first Costco warehouse in Seattle on September 15, 1983. Sinegal had started in wholesale distribution by working for Sol Price at FedMart; Brotman, an attorney from an old Seattle retailing family, had also been involved in retail distribution from an early age. Sinegal began his retail involvement as a grocery bagger. At its launch, Costco sold goods to small businesses at a markup of only 8 or 9 percent over the wholesale price. A second store opened in Portland, Oregon in October, and a third in Spokane in December 1983. In December 1985, Costco went public, opening on the NASDAQ at $10 per share; at the time, the company had 17 warehouses nationally and 1,950 employees. The company was initially headquartered at its first warehouse in Seattle but moved its headquarters to Kirkland in 1987. The \"PriceCostco\" merger In 1993, Costco and Price Club agreed to merge operations after Price declined an offer from Walmart to merge Price Club with their warehouse store chain, Sam's Club. Costco's business model and size were similar to those of Price Club, which made the merger more natural for both companies. The combined company took the name PriceCostco, and memberships became universal, meaning that a Price Club member could use their membership to shop at Costco and vice versa. PriceCostco boasted 206 locations generating $16 billion in annual sales. PriceCostco was initially led by executives from both companies, but in 1994, the Prices left the company to form PriceSmart, a warehouse club chain in Central America and the Caribbean unrelated to the current Costco. Costco moved its headquarters from Kirkland to Issaquah in 1996. It chose to build a new headquarters campus next to a warehouse store to allow buyers to check sales and merchandise. They had originally planned to move by December 1993 to Redmond, another Eastside city, but delays in road construction near the warehouse site caused the company to reconsider. The former Kirkland headquarters, a 10.7-acre (4.3 ha) campus, was sold in late 1996. The company began testing store conversions to Costco branding across the Southwestern United States in late 1996. It officially reverted to using the Costco name and stock symbol in February 1997, with all remaining Price Club locations subsequently rebranded as Costco. In March 2020, Costco announced the acquisition of Innovel, a logistics company, for one billion dollars. Other company milestones The first Costco warehouse in Seattle was replaced with a new building on an adjacent lot to the north in March 2005; the company was able to arrange to keep the same address for the new building, which was on land acquired from Seattle Public Schools. The original building was demolished and replaced by a parking lot, gas station, and car wash—the company's first—which opened in 2006. In 2014, Costco was the third largest retailer in the United States. That year Costco announced plans to open an online store in China using Alibaba Group. Costco announced the opening of 29 new locations in 2016, the most in one year since 2007. Span Construction, led by King Husein, has constructed almost all of Costco's buildings since 1989. Costco opened its first warehouse in China on August 27, 2019, in Shanghai. The store attracted so many customers that it had to close after only a couple of hours. The first Costco in New Zealand opened at West Auckland in September 2022, delayed from mid-August due to the economic impact of the COVID-19 pandemic. Costco today In the United States, Costco's main competitors operating membership warehouses are Sam's Club (a subsidiary of Walmart) and BJ's Wholesale Club. Costco employs 316,000 full and part-time employees worldwide. Costco had 90.3 million members in 2017. In 2020, Costco had 105.5 million members. In 2021, the company had 111.6 million members. As of November 2023, Costco had 129.5 million members. Costco was the first company to grow from $0 in sales to $3 billion in sales in under six years. For the fiscal year ending on August 31, 2012, the company's sales totaled $97.062 billion, with $1.709 billion net profit. As of 2019, Costco is ranked No. 14 on the Fortune 500 rankings of the largest United States corporations by total revenue. The ACSI (The American Customer Satisfaction Index) named Costco number one in the specialty retail store industry with a score of 84 in 2014. From December 2013, Costco's board of directors was chaired by co-founder Jeffrey H. Brotman and included Sinegal, co-founder and director, and two officers of the company: president and CEO W. Craig Jelinek and CFO Richard A. Galanti. On August 1, 2017, Brotman died. As of August 2017, Sinegal and Jelinek remained on the board. Jim Sinegal stepped down in 2018. During the 2010s, Costco outgrew its original three-building headquarters campus in the Pickering Place area of Issaquah—known simply as Buildings 1, 2, and 3—and was forced to put new employees into various leased buildings throughout the city. In April 2019, Costco broke ground on Building 5, a multilevel parking garage with an attached meeting center and fitness center, followed in January 2020 by Building 4, a nine-story office tower next to Interstate 90. The two new buildings were finished in June 2023, and then Costco moved its headquarters employees from Buildings 1, 2, and 3 into the new Building 4. The three original buildings were repurposed for the use of Costco's information technology department. In September 2024, Costco raised its membership fees, increasing Gold Star and Business memberships from $60 to $65 and Executive memberships from $120 to $130, affecting 52 million members, with the Executive reward cap raised from $1,000 to $1,250. In June 2017, fees had increased from $55 to $60 for Gold Star and Business and from $110 to $120 for Executive memberships. In 2024, Costco implemented barcode scanners at warehouse entrances, requiring members to scan their physical or digital card's QR code to prevent membership sharing, replacing the practice of showing cards. Also in 2024, food court access was restricted to members only, ending non-member purchases. Starting June 2025, select locations, such as Manhattan, will offer exclusive 9 a.m. shopping hours for Executive Members to provide a less crowded experience. These changes align with Costco's strategy to bolster its membership model, which generated 65.5% of its 2024 net operating income, by enhancing exclusivity and revenue. Locations As of October 2025, Costco operates 918 warehouses worldwide. 632 in the United States (including Puerto Rico) 111 in Canada 42 in Mexico 37 in Japan 29 in the United Kingdom 20 in South Korea 15 in Australia 14 in Taiwan 7 in China 5 in Spain 3 in France 2 in Sweden 1 in Iceland 1 in New Zealand The company's warehouses throughout the world are all similarly designed, featuring generally identical layout, signage, and parking lot markings. A typical warehouse uses a simple loop for its main corridor from the entrance to the checkout area. Costco has contracted with architecture firm MG2 for over 800 of its locations, which are typically built within a 110-day schedule. Food court menus are tailored for local preferences, with meat pies on offer in Australia; poutine in Canada and France; seafood-topped pizza in Asian locations; pastor taco-topped pizzas in Mexico; clam chowder in Japan, South Korea, and Taiwan; plokkfiskur in Iceland; and jacket potatoes in the United Kingdom. In Canada, the company participates in the voluntary Scanner Price Accuracy Code managed by the Retail Council of Canada. Warehouses in mixed-use development In September 2024, Costco broke ground on its first-ever mixed-use development in the United States that combines a warehouse store with residential apartments above it. The project, developed in partnership with the real estate developer Thrive Living, includes 800 rental apartments above the 185,000-square-foot (17,200 m2) Costco warehouse in the Baldwin Village neighborhood of South Los Angeles, California. Of the 800 apartments, 184 (23%) will be dedicated to low-income housing, with the remainder offered as workforce and unsubsidized housing. The project is made possible by California's state law AB 2011 for affordable housing, which went into effect on July 1, 2023. Largest and smallest warehouses In 2005, Costco's largest store (by area) was in Hillsboro, Oregon, with 148,663 sq ft (13,811.2 m2). In 2015, Costco completed an expansion in Salt Lake City, Utah, making it the new largest Costco at 235,000 sq ft (21,800 m2). The Salt Lake City store was the first to be expanded into a hybrid between the conventional Costco warehouse format and the newer Costco Business Center format, which explains its gigantic size. In 2023, Costco had planned on building a new warehouse store in Fresno, California, which would have had a 241,000 sq ft (22,400 m2) footprint, making it the largest store. But the city only approved 219,000 sq ft (20,300 m2). In 2019, Costco opened its biggest store in Canada, in St. John's, Newfoundland and Labrador; the store is 182,000 sq ft (16,900 m2). As of 2019, the smallest Costco is in Juneau, Alaska at 76,696 sq ft (7,125.3 m2). The warehouse is the only one left from a 1993 initiative in which Costco experimented with small-format warehouses. Although the company concluded that the small format does not work for most markets, it determined that the format was acceptable for Juneau. Costco Business Centers Costco Business Centers are warehouses similar to regular Costco warehouses and are open to all Costco members, regardless of membership type. Their merchandise caters predominantly to enterprises, with a focus on small businesses. Business Centers do not carry most consumer items like clothing, jewelry, media, and tires, while carrying larger quantities and more options for business products which they carry. More than 70% of the items that can be acquired from a Costco Business Center are not found in a typical Costco store. Some locations have a food court, a gas station, or both. They have large parking spaces for trucks and are capable of delivering goods to businesses in bulk quantities, with a delivery charge of $25 for orders that are below $250. Costco Business Center operating hours are shorter than regular warehouses (usually opening at 7:00 am on Mondays to Saturdays and closed on Sundays), while discounts and coupons for Business Centers are issued separately from regular warehouses. The first Business Center was a converted Costco warehouse in Lynnwood, Washington, which reopened in October 1996, following renovations; the change was made after a conventional Costco warehouse had opened in nearby Everett. Locations As of August 2022, there are 26 Costco Business Centers in the United States. The first Costco Business Center outside the US opened in Canada in Scarborough, Ontario, in March 2017. In September 2020, the second Canadian Costco Business Centre opened in Saint-Hubert, Quebec, near Montreal. A third Canadian Business Centre opened in the Ottawa neighborhood of Gloucester in March 2021. Costco Home Showroom In 2022, Costco opened a Costco Home Showroom in San Juan, Puerto Rico, and then opened a second one in Anchorage, Alaska, in 2024. A third one opened in Pearl City, Hawaii, in 2024. Unlike traditional Costco warehouses and the defunct Costco Home format, the Home Showroom format is not a cash-and-carry store. The showroom cannot sell goods on the spot to members to take home with them that same day; members must place orders to be delivered to their homes. It is merely a showroom for \"expensive, large, and bulky items\" like furniture and appliances. Costco had already begun to offer a broader selection of furniture and appliances through Costco.com than it could fit into its traditional warehouses, but found that it was \"daunting\" for many people to order those items online without having first touched, felt, and seen the goods in person. Finances Sales volume In 2011, Costco's highest-volume store was in Seoul, South Korea. In 2018, the store in Taichung, Taiwan, ranked at the top in the number of members and was second in the world in sales volume, behind South Korea's Yangjae store in Seoul. Of the 14 Costco operations in Taiwan, three ranked in the top 10 in the world in sales volume: Taichung, Neihu, and Chungho. Ownership Costco is mainly owned by institutional investors, who own over 70% of shares. The largest shareholders as of September 2024 are: The Vanguard Group (9.40%) BlackRock (7.56%) State Street Corporation (4.06%) Geode Capital Management (2.14%) Morgan Stanley (2.13%) Fidelity Investments (FMR) (2.10%) Bank of America (1.59%) Norges Bank (1.20%) Northern Trust (1.05%) BNY Mellon (1.01%) Business model Costco is a membership-only warehouse in which customers must buy a membership to access the warehouse and make purchases. Revenue from membership fees accounts for the majority of the company's profits, accounting for over 72% of the company's net operating income in fiscal years 2022 and 2023, and 65.5% in fiscal year 2024. Costco divides its business into three segments for the purpose of reporting revenue and operating income. The segments, ordered by size, are: United States Operations (72.4% of total revenue) Other International Operations (13.9% of total revenue) Canadian Operations (13.7% of total revenue) Sales model One company rule states that no regular item may be marked up more than 14% over cost and no Kirkland Signature item may be marked up more than 15% over cost. The company runs very lean, with overhead costs at about 10% of revenue and profit margins at 2%. For example, Costco has no public relations department and buys no outside advertising. Costco's sales model is to focus on limited selection over variety. Although consumer products often come in many different varieties, Costco will not carry most of those variants, but instead will carry only one or two examples of what is essentially the same product and try to sell a higher volume of units at a lower price. Thus, a typical Costco warehouse carries only 3,700 distinct products, while a typical Walmart Supercenter carries approximately 140,000 products. If Costco feels the wholesale price of any individual product is too high, they will refuse to stock the product. For example, in November 2009, Costco announced that it would stop selling Coca-Cola products because the soft-drink maker refused to lower its wholesale prices. Costco resumed selling Coca-Cola products the following month. Finally, Costco insists that manufacturers must package their products in large sizes and properly arrange them on pallets suitable for deployment to its warehouses. However, unlike most chain stores, Costco does not sell shelf space to manufacturers. Due to its massive size and its extremely selective approach to buying products, Costco has become a powerful \"arbiter\" between manufacturers and consumers. From the perspective of small manufacturers, the reward for jumping through all these hoops to sell products to Costco is the possibility of obtaining international distribution through the company's warehouses in other countries. If a manufacturer's product is popular at warehouses in its home country, Costco may look into whether members in other countries might also be interested in that product. Although the company engages in visible efforts to reduce costs, the stores themselves are expensive. In 2013, Costco spent approximately $80 million on each of the new stores it opened. The cost is partly driven by the cost of real estate, as each new store requires enough space to support a building of approximately 150,000 square feet (14,000 m2) in size, a large parking lot, and often a gas station. Lighting costs are reduced on sunny days because most Costco locations have several skylights. During the day, electronic light meters measure how much light is coming in the skylights and turn off an appropriate percentage of the interior lights. During an average sunny day, it is normal for the center section of the warehouse not to have interior lights in use. Rotisserie chickens are a major driver of customer traffic and sales for Costco, which has sold them since 1994 amid the then-rising popularity of Boston Market. In response to the annual growth of per-capita chicken consumption in the United States, Costco opened a factory in Nebraska in 2019 that implemented vertical integration across all aspects of poultry production in a bid to keep their pricing intact while maintaining consistent quality control of them. In some international markets, Costco also offers sushi that is made in-house; the Issaquah warehouse became the first US store to have in-house sushi in 2023. Costco is known for its \"exit greeters\", who briefly compare receipts against shopping cart contents as customers exit. They are trained to quickly count cart contents and serve as a form of customer service to verify that customers were charged correctly, have redeemed any voucher-based items (e.g., tickets), and have not missed items placed in their cart's lower racks. Costco has used exit greeters since its first store opened in Seattle in 1983. Management model Costco is known for a strong corporate culture which encourages and rewards loyalty and promotes from within. As of 2024, Costco claims to have a retention rate over 90% for new employees who make it to one year. Many of its senior executives started as front-line employees in its warehouses and spent many years rising through the ranks to reach their current positions. For example, Ron Vachris started in 1982 as a forklift driver at a Price Club in Arizona and became only the third chief executive officer in Costco's history in 2024. Since 95% of the company's workforce is in its warehouses, and so many of its executives started their careers there, the company's culture is tightly focused on supporting the warehouse experience. At Costco headquarters in Issaquah, all 7,000 headquarters employees sit in cubicles, including the chief executive officer. However, the CEO does get to have a slightly larger cubicle. All Costco executives are expected to get out of the office regularly and spend the majority of their time in the field visiting warehouses and solving problems. The CEO attempts to visit as many warehouses as possible around the world in a cycle every 18 to 24 months, while executives responsible for smaller geographical areas are expected to visit all the warehouses under their supervision much more often. Online shopping Costco primarily focuses on getting members to come in to a warehouse for purchases, instead of ordering products online. Due to the COVID-19 pandemic, Costco's online sales increased dramatically, with more online sales growth in 2020 than the previous five years combined. In November 1998, the company launched Costco Online, its online shopping site. The site expanded to incorporate B2B e-commerce on April 17, 2001. Costco operates online stores in only some of the countries in which it has warehouses: the U.S., Canada, the U.K., Mexico, South Korea, Taiwan, Japan, and Australia. Instacart offers Costco delivery in a select number of states, including Arizona, California, Colorado, Florida, Georgia, Illinois, Indiana, Massachusetts, Maryland, Minnesota, Missouri, North Carolina, New Jersey, New York, Oregon, Tennessee, Texas, Virginia, Washington, and the District of Columbia. In Canada, Costco uses Instacart for online grocery delivery for non–dry goods, pantry staples and household essentials. Similarly, in March 2017, Costco initiated a partnership with Shipt, an online grocery delivery service. Unlike Instacart, Shipt charges its own membership fee, $99 a year or $14 a month, in exchange for free delivery on orders over $35. As of November 2018, Shipt offers Costco delivery in select Florida markets. In October 2017, Costco launched same-day and two-day grocery delivery options for members. In Iceland, Costco began in June 2023 to allow individuals over the age of 20 to purchase alcoholic beverages online and pick them up at the warehouse stores. The \"click and collect\" arrangement was previously only available to businesses having a liquor license. Products Costco frequently rotates its inventory, often stocking items temporarily or seasonally. In 2017, Sinegal described this as a \"treasure-hunt atmosphere\". This model creates a \"sense of urgency\" in shoppers to impulsively buy a good deal as soon as they spot one because it may not be available at the next visit. Over the years, Costco has significantly expanded its range of products. While initially focusing on bulk, boxed items easily displayed in store by removing the stretch wrap from a pallet, Costco's offerings now include a diverse array of items of all shapes and sizes. These range from art, books, caskets, and clothing, to computer software, fine wine, furniture, home appliances, electronics, hot tubs, jewelry, and various perishable goods like dairy, baked items, flowers, produce, meat, and seafood. Other items such as solar panels, tires, and vacuum cleaners, have also found their way into Costco's product lineup. Its growth has led it to become a dominant purchaser for some goods. As of 2025, Costco sold more than half of the world's cashews, for example, with direct implications for over a million cashew farmers in Africa. Beyond products, many Costco warehouses feature additional services including gas stations, pharmacies, hearing aid centers, optometry and eyewear departments, and tire installation garages. Alcohol Alcohol sales at Costco vary by location due to differing regulations. In some places, separate liquor stores exist to adhere to licensing laws, whereas in others, alcohol is available within the main warehouse alongside general merchandise. In certain states, like Texas, liquor sales must be conducted by a separate business entity with its own staff. Costco's desire to alter its alcohol sales structure in its home state faced a setback in 2006 when it lost its court battle against the state of Washington's requirement for retailers to buy wine through the state-controlled system. The company then changed strategies. Costco spent over $22 million to support Initiative 1183, versus $11.75 million from opponents, \"the most expensive initiative fight\" in Washington's history. In the November 8, 2011, election, Initiative 1183 passed with 60 percent of the vote and led to the demolition of Washington's government's monopoly on the distribution of liquor and spirits for retail sale through state-owned and state-licensed liquor stores. The Costco warehouses with the largest wine departments have a \"wine steward\" who roams around that department and advises Costco customers on what wines are best for their needs. As of October 2024, Costco employed about 30 wine stewards at its US warehouses. In the 21st century, Costco has made its store openings into special events by featuring special selections of whiskey, wine, and other alcoholic beverages that are extremely rare and not normally sold at its warehouses, or extremely cheap, or both. For the October 2024 opening of Costco's first warehouse in Napa, California, die-hard whiskey fans began camping out on the sidewalk six days in advance. International operations must navigate regional laws as well. For example, Costco's first store in Victoria, Australia, operates under the country's relatively liberal alcohol licensing laws, allowing sales directly off the shelf as is common in most European countries. However, in New Zealand, Costco's sole warehouse in West Auckland is restricted from selling alcohol due to a local monopoly on liquor retail. Books For its first four decades, Costco was a major American bookseller in its own right, in an era in which e-commerce giant Amazon and big-box bookstore chain Barnes & Noble were wiping out traditional bookstores. Costco became one of the few American brick-and-mortar retail outlets where many shoppers who rarely visited bookstores could easily detour to the book section to browse hard-copy books, discover books they might not have otherwise noticed, and buy them right away. When Costco chose to buy any particular book, it usually acquired tens of thousands of copies, which was important to a publishing industry where a print run of 50,000 copies is a big deal. In the 2020s, Costco management reportedly began to consider no longer carrying books as a year-round product category because they are extremely labor-intensive products. New books must be unpacked and laid out by hand on tables when released each Tuesday, while books that failed to sell must be manually collected and returned to their publishers. In 2022, Costco quietly closed the year-round book sections in its Alaska and Hawaii warehouses. In June 2024, several publishing executives warned that in January 2025, Costco was planning to do the same across its 600 warehouses in the contiguous United States. In other words, books would become just one more rotating inventory item for eight months each year and would reappear as a full section only during the holiday shopping season in the last four months of each year. This was deeply alarming to a publishing industry already facing stagnating book sales. In November 2024, Costco agreed to keep year-round book sections for the time being in 100 of its 600 mainland US warehouses. Gold and platinum bullion products Costco began selling one-ounce, 24-karat gold bars in October 2023. While typically selling for about 2% above the spot price, Costco offers 2% cash back for executive members and another 2% for users of certain credit cards. Thus, it is seen as a low-profit venture for Costco and a loss leader for increasing store memberships. In 2024, following the success of the gold bar products being sold, Costco began selling platinum .9995 fine bars as a direct-to-consumer product eligible for purchase on their website. Kirkland Signature: Costco's private label brand Kirkland Signature is Costco's private label brand, featured on a wide array of products sold across Costco's warehouses and its website. Launched in 1995, the brand takes its name from the original location of Costco's corporate headquarters in Kirkland, Washington. It accounts for nearly one-third of the company's sales and outpaces the growth of Costco's overall sales. In 2024, the Kirkland Signature brand recorded $86 billion in revenue. This was more than all the revenue earned by consumer products giant Procter & Gamble in 2024. The aim of the Kirkland Signature brand was to offer products with brand name quality at discounted prices. Recognizing the typical consumer skepticism common with private labels, Costco has adopted a strategy of co-branding certain items with well-known manufacturers to bolster consumer trust. Notable co-branded products include those from Chinet, Jelly Belly, Keurig Green Mountain, Ocean Spray, Stearns & Foster, and Starbucks. Additionally, while some Kirkland Signature products maintain a generic label, they are produced in partnership with Duracell, Niagara Bottling, and other recognized companies. The brand often uses simple, minimalist packaging, reflecting its focus on offering high-quality products at affordable prices. To ensure high quality, the CEO of Costco personally evaluates and grants final approval to all Kirkland Signature products. Such products are expected to sell in high volumes like name-brand products, and are equally vulnerable to swift removal if they fail to sell as expected. From the perspective of manufacturers, one advantage of entering into a Kirkland Signature private label deal is that it frees them from the burden of sales and marketing campaigns to establish brand awareness among consumers. If a manufacturer has developed a promising new product with expensive ingredients and a slim profit margin, that could mean the difference between not launching at all or a nationwide product launch at Costco warehouses under the Kirkland Signature brand. Publications Costco Connection Costco Connection is a magazine sent free to Costco executive members; it can also be accessed online by anyone, free of charge. As of 2024, the magazine is distributed to 15.4 million households and has 300,000 copies across its warehouses. It has the third-highest magazine circulation in the United States, behind two AARP magazines. The magazine was established in 1987 as a newsprint publication and converted to a magazine in 1997. It features articles which regularly tie into the corporation along with business, celebrity features, cooking, entertaining, health, home improvement, and social articles, as well as coupons and ads. MediaPost reports: \"While about 90% of the magazine's advertising is co-op, increasingly national advertisers such as Procter & Gamble are buying space, notes Roeglin--presumably because of the pub's gargantuan reach and the data it has on its subscribers (whose average household income is $156,000 a year). 'We see about 56% of our subscribers a month buy something at one of our stores based on something they've read in the magazine,' says Roeglin.\" Services Concierge service Costco offers a free \"concierge\" service to members who purchase electronics, to help answer questions regarding setup and use, and avoid potential returns due to not understanding how to use the products. Costco Auto and Home Insurance Costco has an agreement with CONNECT, powered by American Family Insurance, for auto insurance, home insurance, and umbrella insurance. Costco Optical Costco Optical ranks as the fifth-largest optical company in the US, as of 2015. Optometrists working at Costco locations will see patients without Costco memberships, although a membership is required to fill a prescription at the optical department. Costco Travel Costco Travel is a wholly owned subsidiary of Costco Wholesale and offers leisure travel to Costco members of the United States and Canada. The program offers vacation packages to the Caribbean, Europe, Florida, Hawaii, Las Vegas, Mexico, and the South Pacific. Food service In 1985, Costco began to sell freshly prepared food through a hot dog cart at its original Seattle warehouse. Most Costco locations now have a food court. They can be indoors or outdoors, but the menu is essentially the same: hot dog with drink (one of the most popular items), pizza, frozen yogurt/ice cream, Coca-Cola beverages, baked items, and sandwiches. Costco offers its signature quarter-pound 100% beef hot dog and 20 US fluid ounces (590 ml) drink (with refills) for US$1.50, the same price since 1985. Some US locations also offer Polish sausage or bratwurst in addition to hot dogs, at the same $1.50 price. The hot dog sausages were kosher and supplied by Hebrew National and Sinai Kosher until 2009, when supply issues and low profit margins led Costco to start producing them in-house under the Kirkland Signature label to maintain the $1.50 price. In Australia and New Zealand, the hot dog is made of pork and is sold with a large soda for $1.99 (AUD/NZD). In Canada, the price for a hot dog and soda with refills is C$1.50. In Mexico, the hot dog is made of 100% beef and includes a drink (with refills) for MXN$35. In the UK, the hot dog is also made from beef, and customers get a drink (with refills) for £1.50. Costco sold more than 137 million quarter-pound (113 g) hot dogs in its food courts in 2017. In Taiwan and Japan, the hot dog is made of pork as well. Japan's price for their 120-gram (4½ oz.) hot dog and refillable 600-ml (20 fl. oz.) drink is ¥180. In a July 2024 interview, CEO Ron Vachris reiterated Costco's commitment to the US$1.50 price point for the hot dog combo and promised that the price would not rise on his watch. As of April 2024, cheese or pepperoni pizza (along with pre-ordering of full pizzas to take home), chicken bakes, ice cream (vanilla, chocolate, or twist), ice cream sundae, fruit smoothies, latte freeze (without chocolate), mocha freeze (with chocolate), and chocolate chunk cookies (replacement of twisted churros) are offered at all United States locations. Some food court items are only available in certain countries. For example, the bulgogi bake and mango boba tea are only available in Australia, Taiwan, South Korea, and Japan; poutine is available in Canada and France. There are, however, temporary menu items available exclusively in several countries, like the pastor taco-topped pizzas in Mexico. Due to slow sales, in 2009, the pretzel was replaced by the churro. In April 2013, Pepsi replaced all Coca-Cola fountain drinks sold at US locations because Coke had raised its prices; this helped keep the hot dog combo with soda at its original US$1.50 price; however, in late 2024, it was reported that Costco would be reverting to Coca-Cola products in early 2025. Warehouses began the transition in July 2025. Costco started selling a cheeseburger with a 1⁄3-pound (150 g) patty at select stores across Western Washington and Southern California in mid-2017 as a test item, with comparisons drawn to those of Shake Shack. The cheeseburger was not successful; its availability only spread to around a dozen locations before it was discontinued in 2020. Amid the COVID-19 pandemic, Costco enacted safety measures for its food courts in March 2020, removing the seating areas and drastically reducing the food court menu to just hot dogs and pizza. Diced onion returned as a topping in May 2023, but it was offered in plastic cups instead of the crank-driven onion dispensers present pre-pandemic. The combo pizza was also removed as a menu item in 2020; it was indirectly replaced in May 2025 by a combo calzone, which received mixed reception regarding its $6.99 price. Costco credit card On April 1, 2016, in the US, Citigroup became the exclusive issuer of Costco's branded credit cards. Before that, Costco credit cards had been issued by American Express since 2001, and Costco accepted only American Express cards for credit transactions. After the switch of its co-branded cards to Citi, Costco ceased accepting AmEx and began exclusively accepting Visa. AmEx cited the reason for the split that Costco was asking for lower transaction fees than AmEx was willing to grant. In Canada, Costco ended its AmEx relationship in 2014, and starting in 2015, it partnered with Capital One Mastercard for branded credit cards. In 2020, Capital One announced it would be ending the partnership in late 2021. It was announced that beginning in March 2022, Costco will begin a partnership with CIBC Mastercard. Costco branded credit cards from both issuers also serve as alternate Costco membership cards, with a customized reverse side containing membership info. Costco Audiobook App In March 2021, Costco started selling audiobooks and launched a corresponding iOS and Android app to listen to purchases. The app is free; however, the books are exclusive to Costco members. The retailer sells audiobooks in bundles grouped by genre or author, with prices ranging from $5 to $50. Audiobooks are currently only available at US locations. Labor relations Employee rights While some former Price Club locations in California and the northeastern United States are staffed by Teamsters, the majority of Costco locations are not unionized, although there was a drive in 2012 to unionize some locations in Canada. The Teamsters report that over 15,000 Costco employees are union members. The non-union locations have revisions to their Costco Employee Agreement every three years concurrent with union contract ratifications in locations with collective bargaining agreements. The Employee Agreement sets forth such things as benefits, wages, disciplinary procedures, paid holidays, bonuses, and seniority. The Employee Agreement is subject to change by Costco at any time and offers no absolute protection to the workers. As of June 2022, non-supervisory hourly wages ranged from $17.50 to $28.45 in the US, $16.00 to $28.70 in Canada, and £9.75 to £13.90 in the United Kingdom. In the US as of 2005, eighty-five percent of Costco's workers had health insurance, compared with less than fifty percent at Walmart and Target. Health benefits include coverage through Aetna, remote primary care through Teladoc, second opinions and clinical navigation by Grand Rounds, varieties of health insurance agencies with Custom Benefit Consultants Inc. (CBC), and wellness coaching by Omada. In February 2021, Costco announced that it would be raising the starting rate for its hourly store workers in the United States to $16 an hour. Costco has been actively raising its minimum wage, starting with $14 in 2018 to $15 in 2019. They further add that 20% of their hourly employees will be subject to the minimum wage change. A location in Norfolk, Virginia, unionized with the Teamsters in 2023. The vote in Norfolk was the first successful Costco union drive in over twenty years. In January 2025, the Teamsters union representing over 18,000 Costco employees voted to strike, demanding \"fair wages and benefits.\" Contractors Costco contracts exclusively with two independent companies to provide employees for product demonstrations (e.g., food samples) at Costco stores: Club Demonstration Services (CDS) and Warehouse Demo Services (WDS). Demonstration employees receive a pay and benefit package that is less than that of Costco employees. As of August 1, 2017, demonstrations/samples are provided by CDS in Canada. Product demonstrations at Costco stores in the United States were halted in March 2020 amid the COVID-19 pandemic, with some Costco CDS employees shifted to cleaning tasks before all were laid off when CDS temporarily ceased operations the following month; they were rehired as Costco started resuming demonstrations at select stores in June 2020, with all US stores resuming demonstrations by June 2021. Discontinued concepts Costco Home The first Costco Home warehouse opened in December 2002, in Kirkland, Washington. The warehouse's concept was to combine the value, setting and members-only elements of Costco's warehouse clubs with the product array one would find at an upscale home store, such as Fortunoff or Crate & Barrel. The Costco Home warehouses sold furniture, housewares, kitchen products and accessories from higher-end brands such as Lexington, Ralph Lauren and Waterford in a warehouse-club setting. Like traditional Costco warehouses, Costco Home was a cash-and-carry format with onsite inventory available for immediate pickup, meaning that members could collect and take items home with them that same day. A second warehouse opened in 2004 in Tempe, Arizona. On April 2, 2009, the company announced that it would be abandoning its Costco Home concept, closing the two existing stores in Kirkland, Washington and Tempe, Arizona on July 3, 2009, and abandoning plans for a third warehouse in Portland, Oregon. Costco Fresh A grocery-centered format, named Costco Fresh, was announced in September 1999 for a 75,000-square-foot (7,000 m2) two-story space in Manhattan, New York City. The company pulled out of an agreement to build the Manhattan store later that year after cost increases and local protests. The concept was revived in late 2002 for a store in Bellevue, Washington, near its Issaquah headquarters, at a former Kmart. The new store would primarily sell fresh produce, meats, seafood, and baked goods instead of bulk items, but would also have several features from normal Costco warehouses; it would also have a modified logo, with a fruit stem growing from the first \"o\" in the Costco name. The concept was dropped the following year, but the company retained interest in building a normal Costco store at the Bellevue site until 2008, when they abandoned the plans due to zoning regulations that would have required daylighting an underground creek. Controversies Animal welfare In 2010, Mercy for Animals conducted an undercover investigation at Buckeye Veal Farm, a veal supplier to Costco. Immediately following the investigative release, Costco adopted a policy against purchasing veal from producers that use the crate-and-chain production method. The case prompted Ohio lawmakers to vote in favor of a veal crate phase-out in the state. In 2012, Mercy for Animals conducted another undercover investigation of a pork supplier to major retailers such as Costco, Walmart, Safeway, Kroger, and Kmart. Before the public release of the investigation, Costco announced they would begin requiring their pork suppliers to phase out gestation crates. In 2015, the Humane Society of the United States conducted an undercover investigation at a Costco egg supplier. An undercover worker at Hillandale Farms, a major egg supplier to Costco, filmed conditions in which egg-laying hens lived in tiny wire cages. Following the investigations, several celebrities including Brad Pitt and Ryan Gosling publicly wrote to Costco to address this issue. In December 2015, following efforts by animal protection nonprofits including The Humane League, Costco released an updated commitment to source exclusively cage-free eggs in its operations. In December 2020, Costco announced plans to end the use of battery cage eggs throughout its operations worldwide, becoming the first US retailer to issue a global policy on the confinement of animals in its supply chain. Josh Dahmen, Costco financial planning and investor relations director, stated: \"We are in the process of making that transition to cage-free eggs. We will continue to increase the percentage over time, with a goal of eventually getting to 100%.\" In 2016, the animal rights group Direct Action Everywhere (DxE) reported cannibalism and high mortality at a cage-free Costco egg supplier. Costco denied the allegations, but the video sparked a discussion about animal welfare problems continuing to exist at cage-free egg farms. Writing in The Huffington Post, DxE co-founder Wayne Hsiung argued that the new investigation, rather than suggesting that Costco should keep birds in cages, indicated that hens should have the right not to be raised for food or kept on farms at all. In October 2020, Costco dropped Chaokoh coconut milk over allegations of forced monkey labor. PETA accused the manufacturer, Theppadungporn Coconut Co., of using forced monkey labor, finding cruelty to monkeys at their farms and facilities. Ken Kimble, Costco's Vice President of Corporate Food and Sundries, condemned the use of monkey labor and stated that Costco launched an investigation regarding the issue and ceased purchasing from the Chaokoh supplier. Kimble also stated that Costco will continue to monitor the implementation of the harvest policies and, once satisfied, will resume purchasing. In February 2021, an undercover investigation by Mercy for Animals showed chickens at a Costco facility in Nebraska unable to move, sitting in feces, and covered with chemical burns. New York Times opinion columnist Nicholas Kristof covered the investigation, accusing Costco of keeping prices low \"in part by developing chickens that effectively are bred to suffer.\" In June 2022, two Costco shareholders represented by the animal rights organization Legal Impact for Chickens sued Costco executives for breach of fiduciary duty. The lawsuit claimed that the company's use of fast-growing breeds violates animal welfare laws in Nebraska and Iowa, undermining Costco's appeal to consumers. Environmental standards In 2014, the US Department of Justice and the United States Environmental Protection Agency alleged that Costco had failed to promptly repair leaks from its refrigeration equipment of the refrigerant chlorodifluoromethane at its stores. Costco paid a fine of US$335,000 and agreed to spend $2 million over three years to fix refrigerant leaks and make improvements at 274 stores. Costco was criticized in 2019 by the Natural Resources Defense Council (NRDC) and SumOfUs for using virgin Canadian boreal forest to make its toilet paper. NRDC stated that over the previous twenty years, 28 million acres of Canadian boreal forest had been cut down to make toilet paper. Labor standards In 2014, The Guardian reported that Costco was a client of Charoen Pokphand Foods. Over six months, The Guardian traced down a supply chain from slave ships in Asian waters to leading producers and retailers. Costco has published a statement stating that it has had a supplier code of conduct since 1999 which does not allow this practice, and that independent auditors check for violations regularly. In June 2023, a Costco employee in South Korea died of heatstroke while organizing shopping carts outside. South Korean government guidelines state that outdoor workers be given a 10- to 15-minute break every hour during heatwave advisories; however, these guidelines were not strictly followed or enforced at the location where the employee worked. He was given 15-minute breaks every 3 hours without a regular supply of drinking water. The company was later fined ₩30 million by the Ministry of Employment and Labor. Pharmacies In September 2016, Costco self-disclosed conduct to the Office of Inspector General after its pharmacy in Waltham, Massachusetts improperly altered prescription drug claims to Medicare Part D and the Massachusetts Medicaid program that resulted in higher reimbursement than was appropriate. They paid a fine of US$340,157.25. In January 2017, Costco was brought to court in the US for lax pharmacy controls in violation of the Controlled Substances Act. Allegations such as Costco \"filling prescriptions that were incomplete\", or were for substances \"beyond various doctors' scope of practice\". The case was settled after Costco paid US$11.75 million. In 2019, the Ontario Ministry of Health fined Costco $CA7.2 million after it found that Costco pharmacies were accepting advertising services from a generic drug manufacturer in Ontario, where it is illegal for a pharmacy to accept rebates, or kickbacks, from a generic drug manufacturer in exchange for promising to stock its brand of drugs. Two Costco pharmacy directors were referred to the Ontario College of Pharmacists and were fined for the misconduct. Product quality In July 2015, the US Consumer Product Safety Commission recalled the EKO Sensible Eco Living Trash Can that Costco was selling because the black plastic protective collar in the opening on the back of the trash can could be dislodged, exposing a sharp edge. Costco was fined US$3.85 million for failing to notify the commission about the defect, despite receiving 92 complaints about the trash can, including 60 complaints from those who sustained injuries. In 2017, Costco and Acushnet Holdings sued each other over their golf balls. In August 2017, a federal judge ordered a \"deceptive\" Costco to pay Tiffany & Co. US$19.4 million for misleading consumers into thinking they could buy legitimate Tiffany merchandise at warehouse club prices. In September 2020, CBS News reported that Costco had stopped selling Palmetto Cheese after the owner of the pimento cheese brand called Black Lives Matter a \"terror organization.\" Costco posted a note to the item in their Myrtle Beach location indicating that the item will not be reordered, and over 120 Costco locations throughout the US will no longer be carrying the item. In 2023, the Kaohsiung Department of Health fined Costco numerous times for selling bags of mixed berries imported into Taiwan that tested positive for Hepatitis A. Costco was fined a total of NT12.5 million and was temporarily barred from selling mixed berries in the country. In July 2023, Costco Australia paid $33,000 in penalties for mislabeling the origin of lobster products. Lobsters imported from Canada were labeled as \"Kirkland Signature PREVIOUSLY FROZEN WHOLE COOKED WA LOBSTER\" and \"Australian Lobster\". In August 2023, the Environment Agency of Iceland fined Costco ISK 20 million for a diesel spill originating from a gas station in Garðabær, which contaminated the Hafnarfjörður sewage system."
}