{
  "ticker": "CPAY",
  "cik": "0001175454",
  "company_name": "Corpay",
  "corrected_name": "Corpay",
  "wiki_title_used": "Corpay",
  "exists": true,
  "raw_text": "Corpay, Inc. (formerly Fleetcor Technologies), headquartered in Atlanta, Georgia, provides payments and spend management systems and services that control expense-related purchasing and payment processes. The company focuses on vehicle-related expenses, lodging expenses, and corporate payments.\n\nHistory\nThe predecessor of the company was founded in 1986.\nIn August 2000, Ronald F. Clarke was named CEO; at that time, the company was a provider of fuel cards to businesses and its estimated annual revenues were $25 million.\nIn November 2019, the company moved its headquarters to Terminus 100.\nIn October 2023, due to the Russian invasion of Ukraine, the company sold its businesses in Russia for $197 million; it had been criticized for not selling the interests earlier.\nIn 2019, the Federal Trade Commission sued the company for obscuring fees and misleading consumers about fuel card discounts; in 2023 it received an injunction against the company preventing it from continuing the practice.\nIn March 2024, the company changed its name to Corpay.\n\nFinancing\nIn June 2002, Summit Partners invested $45 million in the company.\nIn July 2005, Bain Capital invested $75 million in the company.\nIn November 2006, Advent invested $46 million in the company. \nIn December 2010, Fleetcor became a public company via an initial public offering, raising $335 million.\n\nContract wins\nAcquisitions\nReferences\nExternal links\nOfficial website\nBusiness data for Corpay:",
  "clean_text": "Corpay, Inc. (formerly Fleetcor Technologies), headquartered in Atlanta, Georgia, provides payments and spend management systems and services that control expense-related purchasing and payment processes. The company focuses on vehicle-related expenses, lodging expenses, and corporate payments. History The predecessor of the company was founded in 1986. In August 2000, Ronald F. Clarke was named CEO; at that time, the company was a provider of fuel cards to businesses and its estimated annual revenues were $25 million. In November 2019, the company moved its headquarters to Terminus 100. In October 2023, due to the Russian invasion of Ukraine, the company sold its businesses in Russia for $197 million; it had been criticized for not selling the interests earlier. In 2019, the Federal Trade Commission sued the company for obscuring fees and misleading consumers about fuel card discounts; in 2023 it received an injunction against the company preventing it from continuing the practice. In March 2024, the company changed its name to Corpay. Financing In June 2002, Summit Partners invested $45 million in the company. In July 2005, Bain Capital invested $75 million in the company. In November 2006, Advent invested $46 million in the company. In December 2010, Fleetcor became a public company via an initial public offering, raising $335 million. Contract wins Acquisitions"
}