{
  "ticker": "CPB",
  "cik": "0000016732",
  "company_name": "Campbell's Company (The)",
  "corrected_name": "Campbell Soup Company",
  "wiki_title_used": "Campbell Soup Company",
  "exists": true,
  "raw_text": "The Campbell's Company (doing business as Campbell's and formerly known as the Campbell Soup Company) is an American company, most closely associated with its flagship canned soup products. The classic red-and-white can design used by many Campbell's branded products has become an American icon, and its use in pop art was typified by American artist Andy Warhol's series of Campbell's Soup Cans prints. \nCampbell's has grown to become one of the largest processed food companies in the United States through mergers and acquisitions, with a wide variety of products under its flagship Campbell's brand as well as other brands including Pepperidge Farm, Snyder's of Hanover, V8, and Swanson. With its namesake brand Campbell's produces soups and other canned foods, baked goods, beverages, and snacks. It is headquartered in Camden, New Jersey.\n\nHistory\nFoundation and early history\nThe company was started in 1869 by Joseph A. Campbell, a fruit merchant from Bridgeton, New Jersey, and Abraham Anderson, an icebox manufacturer from South Jersey. They produced canned tomatoes, vegetables, jellies, soups, condiments, and minced meats.\nIn 1876, Anderson left the partnership and the company became the \"Joseph A. Campbell Preserve Company\". Anderson's son, Campbell Speelman, split paths with his father and continued to work at Campbell's as a creative director, originally designing the Campbell's soup cans.\n\nIn 1894, Campbell retired and Arthur Dorrance became the company president. Campbell reorganized into \"Joseph Campbell & Co.\" in 1896. In 1897, John T. Dorrance, a nephew of company president Dorrance, began working for the company at a wage of $7.50 a week ($253 in 2022 dollars). Dorrance, a chemist with degrees from MIT and Göttingen University, Germany, developed a commercially viable method for condensing soup by halving the quantity of its heaviest ingredient: water. He went on to become president of the company from 1914 to 1930, eventually buying out the Campbell family.\nIn 1898, Herberton Williams, a Campbell's executive, convinced the company to adopt a carnelian red and bright white color scheme, because he was taken by the crisp carnelian red color of the Cornell University football team's uniforms. To this day, the layout of the can, with its red and white design and the metallic bronze medal seal from the 1900 Paris Exhibition, has changed very little, with the exception of the French phrase on the top of the bronze seal that said \"Exposition-Universelle-Internationale\" which was changed to the English name of the exhibition as \"Paris International Exposition\".\n\nGrowth under new leadership\nCampbell Soup became one of the largest food companies in the world under the leadership of William Beverly Murphy. He was elected executive vice president of Campbell Soup in 1949 and was president and CEO from 1953 to 1972. While at Campbell's Soup Company, he took the corporation public and increased its brand portfolio to include Pepperidge Farm's breads, cookies, and crackers, Franco-American's gravies and pastas, V8 vegetable juices, Swanson broths, and Godiva's chocolates. During the 1970s and 1980s, Campbell's entered the restaurant business by acquiring Pietro's Pizza, Annabelle's, Clark, and Herfy's and launching Hanover Trail and H.T. McDoogal's. David Johnson was president and CEO from 1990 until 1997.\n\nCampbell Soup has invested heavily in advertising since its inception, and many artifacts of its promotional campaigns have proven valuable in the Americana collectible advertising market. Perhaps best known are the \"Campbell's Kids\" designed by illustrator Grace Drayton. Ronald Reagan was a spokesman for V8 when Campbell's acquired the brand in 1948.\nIn addition to collectible advertising, the company has had notable commercial sponsorships. Among them was Orson Welles's The Campbell Playhouse, which had previously been The Mercury Theatre on the Air. After the program's adaptation of The War of the Worlds became a sensation for accidentally starting a mass panic due to its realism, Campbell's took over as sponsor of the radio theater program in December 1938.\n\nShutdown of factories\nThe shutdown of Campbell's original plant in Camden, New Jersey, plant No. 1, was announced in 1989, with production to end on the night of March 1, 1991; the plant was officially closed the next day, and was demolished on November 1, 1991. Plants in Pocomoke City, Maryland; Crisfield, Maryland; and Smyrna, Tennessee also shut down around that time.\nPlant No. 2, originally a tomato-processing plant, shut down in 1980. In the 1950s it had manufactured about 35% of all Campbell's products. Products included pork and beans; tomato juice, V8 vegetable juice, Franco-American spaghetti, macaroni and cheese; and soups (notably: bean with bacon, cream of mushroom, cream of celery, and cream of asparagus.\n\nDue to these closures 2,800 jobs were lost, around 1,000 of those from the Camden plant. Workers received one week's payment for each year of employment as well as six months of paid medical benefits, and half the cost for an additional six months. Salaried workers received one week's pay for each year of employment. Production was moved to plants in Napoleon, Ohio; Paris, Texas; and Maxton, North Carolina.\n\nRecent history\nIn November 2007, Campbell's Soup sold Godiva to Yildiz Holding.\nIn March 2008, Campbell's Soup was rebranded as Batchelors Condensed Soup in the UK and Erin in Ireland when the license to use the brand name in those countries expired. Premier Foods, headquartered in St. Albans, Hertfordshire, bought the Campbell Soup Company in the UK and Ireland for £450 million ($830 million) in 2006 but was licensed to use the Campbell name only until 2008. Under this agreement, the US-based Campbell Soup Company continued to produce Campbell's Condensed Soup but could not sell the product in the UK for a further five years.\nCampbell's continues to be a major part of Camden, regularly participating in charity events in the community. In 2009, Campbell's completed the construction of a new and expanded headquarters in the city.\n\nIn January 2010, Campbell's Canadian subsidiary began selling a line of soups that are certified by the Islamic Society of North America as being halal (prepared in accordance with Islamic law). Although Campbell does not have any plans to sell its halal soups in the United States, the move drew criticism from anti-Muslim critics in the United States. Several bloggers called for a boycott of the company, but Campbell's spokesman John Faulkner stated at the time that the company did not notice any effect on its sales as a result.\nIn July 2011, Campbell's Soup decided to once again sell its product in the UK. Symingtons began manufacturing the brand under license. The new lineup consisted of twelve cup soups, five simmer soups designed to be cooked in a pot of water, four savory rice lines as well as four savory pasta and sauce packets. The items were not sold in cans but instead in packets and boxes. Later in 2011, the canned varieties also returned to supermarket shelves with refreshed labels and new lines.\nIn 2012, Campbell announced plans to buy Bolthouse Farms, a maker of juices, salad dressings, and baby carrots, for $1.55 billion. Analysts said it was an attempt to reach younger, more affluent consumers.\nSince 2012, Campbell Soup has been focused on updating their image and digital marketing to increase visibility among younger generations.\nIn June 2013, Campbell acquired the Danish multinational baked goods company Kelsen Group for an undisclosed amount. Kelsen has an 85-country distribution network and is seen as providing Campbell with opportunities for international expansion, particularly into China and other Asian markets.\nIn June 2015, Campbell Soup acquired salsa maker Garden Fresh Gourmet for $231 million as it looked to expand into the fresh and organic packaged foods business.\nIn January 2016, Campbell's announced that it would source 100% cage-free eggs by 2025.\nIn December 2017, Campbell's completed the acquisition of Pacific Foods of Oregon, LLC for $700 million and announced the agreement to acquire the snack company Snyder's-Lance for $4.87 billion in cash. The latter deal is the largest in the company's history.\nIn January 2018, Campbell's announced the closure of their only Canadian factory, in Toronto. Production shifted to three existing facilities in the United States, and 380 jobs were lost as a result.\n\nDenise Morrison served as the company's president and CEO from 2011 through 2018.\nOn December 21, 2018, Mark Clouse, former CEO of Pinnacle Foods, was announced as Campbell's CEO effective January 22, 2019.\nHaving sold over $450 million a year worth of Chunky Soup from 2004 to 2017, Campbell's asked for a trademark on \"Chunky\", which was approved in 2019.\nIn July 2019, Campbell's agreed to sell its stake in the Kelsen Group for $300 million to a subsidiary of Ferrero SpA, with the transfer to be completed in 2020. Campbell's also divested Arnott's Biscuits to KKR for $2.2 billion at the same time.\nIn August 2023, it was announced that Campbell's had acquired the Louisville, Colorado-headquartered food manufacturer Sovos Brands for $2.7 billion.\nOn August 1, 2024, Campbell's announced that it will transfer its stock listing from the NYSE to the Nasdaq Global Select Market starting on August 16 at the market close. Trading on Nasdaq began on August 19, 2024.\nOn August 26, 2024, Campbell's announced it completed the sale of its Pop Secret popcorn business to Our Home, an independent snack company. Terms of the transaction were not disclosed.\nOn September 11, 2024, Campbell's announced a name change to The Campbell's Company. The change was approved on November 19, 2024. President and CEO Mark Clouse retired from his position to be named the team president of the NFL's Washington Commanders, with Mick Beekhuizen succeeding him on February 1, 2025.\nIn September 2025, Campbell's admitted to multiple violations of the Clean Water Act. Campbell's Napoleon, Ohio canning plant dumped millions of gallons of waste into the Maumee River, which feeds Lake Erie, over a six and a half year period.\nIn November 2025, a lawsuit was filed by Robert Garza, a former cybersecurity analyst for the company. The suit alleges Garza was fired after complaining about racist comments by an executive, Martin Bally, made during a meeting in November 2024. In an alleged recording of the meeting which was released to the media by Garza, an individual Garza claims is Bally states in an expletive-filled rant that Campbell's makes food for poor people and that they themselves don't want to eat it because the meat is bio-engineered and \"came from a 3-D printer\". Later that same month, Bally was dismissed by the company.\n\nPop art\nIn 1962, artist Andy Warhol incorporated the familiar look of the Campbell's soup can with a series of pop art silkscreens, a theme he would return to off and on through the 1960s and 1970s. The first batch in 1962 were a series of 32 canvases. At first, the cans were accurate representations of actual Campbell's cans, but as his series progressed, they became more surrealistic, with Warhol experimenting with negative-reversed color schemes and other varied techniques (many of these which would be used on other Warhol paintings of the period, such as his celebrity silkscreens of the 1960s). The silkscreens themselves have become iconic pieces of pop art, with one in particular, Small Torn Campbell Soup Can (Pepper Pot) (1962), commanding a price of $11.8 million at auction in 2006.\n\nSlogans\nMmm Mmm Good (1935–present—their predominantly used slogan)\nGive Me The Campbell Life (1969–75)\nSoup Is Good Food (1975–c. 1982)\nNever underestimate the power of soup! (1990s)\nPossibilities (2005–2009)\nSo Many Many Reasons It's So Mmm Mmm Good (2009–2010)\nIt's Amazing What Soup Can Do! (2010–present)\nMade for real, Real life (2015–present)\n\nHealth issues\nMany canned soups, including Campbell's condensed and chunky varieties, contain relatively high quantities of sodium and thus are not desirable for those on low-sodium diets. However, Campbell's Chunky, Healthy Request and other soups, as well as their V-8 and tomato juices, are claimed by Campbell's to contain reduced sodium levels.\nIn the fall of 2007, Campbell's was awarded a Certificate of Excellence from Blood Pressure Canada for their efforts in lowering sodium levels.\nBy the fall of 2009, Campbell's claimed it had lowered the sodium content in 50% of its soups range. In March 2010, this claim was challenged; ABC News reported that the low-sodium variety of Campbell soup in fact contained the same amount of sodium as the regular variety, and that Campbell's Healthy Request soup contained more fat than the regular variety. In July 2011, citing sinking sales, the company increased the salt content of its products again.\nIn December 2009, Consumer Reports found that major canned food companies including Campbell's Soup were producing tinned products with bisphenol A (BPA) levels over 100 ppb in some cases; the testing revealed that just one serving of canned food would exceed an expert's recommendation for daily exposure (0.2 micrograms per kg body weight per day).\n\nGMO\nThroughout 2012, Campbell's contributed $500,000 to a $46 million political campaign known as \"the Coalition Against the Costly Food Labeling Proposition, sponsored by farmers and food producers\". This organization was set up to oppose a citizens' initiative, known as Proposition 37, demanding mandatory labeling of foods containing genetically modified ingredients sold in California.\nIn January 2016, the company decided to support mandatory labeling and announced they would label their products that contained GMO additives.\n\nBrands\nCampbell's owns numerous brands that it markets worldwide. Among these are the following:\n\nCampbell's\nThe company's flagship brand and the Campbell's name is used to market soups, sauces, and canned meals. Product lines under the brand include:\n\nPepperidge Farm\nAn American baked-goods company founded in 1937, it was acquired by Campbell's in 1961. The Pepperidge Farm brand is used by Campbell's to market the following:\n\nPace Foods\nAn American salsa company founded in 1947, Pace was acquired by Campbell's in 1995. The Pace brand is used by Campbell's to market salsas and picante sauce.\n\nSwanson\nBroth\nTV dinners and frozen meals (made by Pinnacle Foods under license)\nCanned chicken\n\nPrego\nPasta sauces\n\nSnyder's-Lance\nLance crackers and cookies\nSnyder's of Hanover pretzels\nCape Cod Potato Chips\nKettle potato chips\nSnack Factory pretzel chips\nArchway Cookies\n\nLate July Snacks\nLate July Snacks is a subsidiary of the Campbell Soup Company, acquired in the Snyder's-Lance acquisition in early 2018. Snyder's-Lance had boosted their ownership stake in Late July Snacks to 80% in 2014.\n\nPlants\nUnited States\nCamden, New Jersey: world headquarters, non-manufacturing\nMaxton, North Carolina: opened 1978\nNapoleon, Ohio\nAshland, Ohio: Archway Cookies bakery, acquired through the Snyder's-Lance purchase\nWillard, Ohio\nParis, Texas\nMilwaukee, Wisconsin\nEverett, Washington\nWest Sacramento, California\nTualatin, Oregon\nEast Rancho Dominguez, California\nDixon, California\nRancho Cucamonga, California\nHyannis, Massachusetts: Cape Cod Potato Chips\n\nInternational\nToronto: Opened 1930 in New Toronto, Ontario (closure announced in 2018)\nLemnos, Victoria, Australia\nLübeck, Germany Sold in 2013 to CVC Capital Partners and converted into Continental Foods BVBA.\nSelangor state, Malaysia\nKing's Lynn, United Kingdom: Opened 1959, closed 2007. Site demolished 2012.\nBekasi, Indonesia (as PT. Arnotts Indonesia) until 2019 at which point Campbell Soup Company sold it to KKR\nRibe, Denmark until 2013 at which point Campbell Soup left the European market\nNørre Snede, Denmark until 2013 at which point Campbell Soup left the European market\n\nRecalls\n2010\nOn June 22, 2010, Campbell's \"SpaghettiOs and Meatballs\" product was recalled after a Texas firm found possible traces of underprocessed meat in the product.\n\nSee also\nCream of mushroom soup\nGreen bean casserole\nList of food companies\n\nReferences\nCitations\nBibliography\nCollins, Douglas (1994). America's Favorite Food: The Story of Campbell Soup Company. Harry N. Abrams, Inc. ISBN 0-8109-2592-3.\nShea, Martha Esposito, and Mathis, Mike (2002). Images of America: Campbell Soup Company. Arcadia Publishing. ISBN 0-7385-1058-0.\nSidorick, Daniel (2009). Condensed Capitalism: Campbell Soup and the Pursuit of Cheap Production in the Twentieth Century. Cornell University Press. ISBN 0-8014-4726-7.\n\nExternal links\n\nOfficial website  – consumer\nOfficial corporate website\nBusiness data for Campbell Soup Company:",
  "clean_text": "The Campbell's Company (doing business as Campbell's and formerly known as the Campbell Soup Company) is an American company, most closely associated with its flagship canned soup products. The classic red-and-white can design used by many Campbell's branded products has become an American icon, and its use in pop art was typified by American artist Andy Warhol's series of Campbell's Soup Cans prints. Campbell's has grown to become one of the largest processed food companies in the United States through mergers and acquisitions, with a wide variety of products under its flagship Campbell's brand as well as other brands including Pepperidge Farm, Snyder's of Hanover, V8, and Swanson. With its namesake brand Campbell's produces soups and other canned foods, baked goods, beverages, and snacks. It is headquartered in Camden, New Jersey. History Foundation and early history The company was started in 1869 by Joseph A. Campbell, a fruit merchant from Bridgeton, New Jersey, and Abraham Anderson, an icebox manufacturer from South Jersey. They produced canned tomatoes, vegetables, jellies, soups, condiments, and minced meats. In 1876, Anderson left the partnership and the company became the \"Joseph A. Campbell Preserve Company\". Anderson's son, Campbell Speelman, split paths with his father and continued to work at Campbell's as a creative director, originally designing the Campbell's soup cans. In 1894, Campbell retired and Arthur Dorrance became the company president. Campbell reorganized into \"Joseph Campbell & Co.\" in 1896. In 1897, John T. Dorrance, a nephew of company president Dorrance, began working for the company at a wage of $7.50 a week ($253 in 2022 dollars). Dorrance, a chemist with degrees from MIT and Göttingen University, Germany, developed a commercially viable method for condensing soup by halving the quantity of its heaviest ingredient: water. He went on to become president of the company from 1914 to 1930, eventually buying out the Campbell family. In 1898, Herberton Williams, a Campbell's executive, convinced the company to adopt a carnelian red and bright white color scheme, because he was taken by the crisp carnelian red color of the Cornell University football team's uniforms. To this day, the layout of the can, with its red and white design and the metallic bronze medal seal from the 1900 Paris Exhibition, has changed very little, with the exception of the French phrase on the top of the bronze seal that said \"Exposition-Universelle-Internationale\" which was changed to the English name of the exhibition as \"Paris International Exposition\". Growth under new leadership Campbell Soup became one of the largest food companies in the world under the leadership of William Beverly Murphy. He was elected executive vice president of Campbell Soup in 1949 and was president and CEO from 1953 to 1972. While at Campbell's Soup Company, he took the corporation public and increased its brand portfolio to include Pepperidge Farm's breads, cookies, and crackers, Franco-American's gravies and pastas, V8 vegetable juices, Swanson broths, and Godiva's chocolates. During the 1970s and 1980s, Campbell's entered the restaurant business by acquiring Pietro's Pizza, Annabelle's, Clark, and Herfy's and launching Hanover Trail and H.T. McDoogal's. David Johnson was president and CEO from 1990 until 1997. Campbell Soup has invested heavily in advertising since its inception, and many artifacts of its promotional campaigns have proven valuable in the Americana collectible advertising market. Perhaps best known are the \"Campbell's Kids\" designed by illustrator Grace Drayton. Ronald Reagan was a spokesman for V8 when Campbell's acquired the brand in 1948. In addition to collectible advertising, the company has had notable commercial sponsorships. Among them was Orson Welles's The Campbell Playhouse, which had previously been The Mercury Theatre on the Air. After the program's adaptation of The War of the Worlds became a sensation for accidentally starting a mass panic due to its realism, Campbell's took over as sponsor of the radio theater program in December 1938. Shutdown of factories The shutdown of Campbell's original plant in Camden, New Jersey, plant No. 1, was announced in 1989, with production to end on the night of March 1, 1991; the plant was officially closed the next day, and was demolished on November 1, 1991. Plants in Pocomoke City, Maryland; Crisfield, Maryland; and Smyrna, Tennessee also shut down around that time. Plant No. 2, originally a tomato-processing plant, shut down in 1980. In the 1950s it had manufactured about 35% of all Campbell's products. Products included pork and beans; tomato juice, V8 vegetable juice, Franco-American spaghetti, macaroni and cheese; and soups (notably: bean with bacon, cream of mushroom, cream of celery, and cream of asparagus. Due to these closures 2,800 jobs were lost, around 1,000 of those from the Camden plant. Workers received one week's payment for each year of employment as well as six months of paid medical benefits, and half the cost for an additional six months. Salaried workers received one week's pay for each year of employment. Production was moved to plants in Napoleon, Ohio; Paris, Texas; and Maxton, North Carolina. Recent history In November 2007, Campbell's Soup sold Godiva to Yildiz Holding. In March 2008, Campbell's Soup was rebranded as Batchelors Condensed Soup in the UK and Erin in Ireland when the license to use the brand name in those countries expired. Premier Foods, headquartered in St. Albans, Hertfordshire, bought the Campbell Soup Company in the UK and Ireland for £450 million ($830 million) in 2006 but was licensed to use the Campbell name only until 2008. Under this agreement, the US-based Campbell Soup Company continued to produce Campbell's Condensed Soup but could not sell the product in the UK for a further five years. Campbell's continues to be a major part of Camden, regularly participating in charity events in the community. In 2009, Campbell's completed the construction of a new and expanded headquarters in the city. In January 2010, Campbell's Canadian subsidiary began selling a line of soups that are certified by the Islamic Society of North America as being halal (prepared in accordance with Islamic law). Although Campbell does not have any plans to sell its halal soups in the United States, the move drew criticism from anti-Muslim critics in the United States. Several bloggers called for a boycott of the company, but Campbell's spokesman John Faulkner stated at the time that the company did not notice any effect on its sales as a result. In July 2011, Campbell's Soup decided to once again sell its product in the UK. Symingtons began manufacturing the brand under license. The new lineup consisted of twelve cup soups, five simmer soups designed to be cooked in a pot of water, four savory rice lines as well as four savory pasta and sauce packets. The items were not sold in cans but instead in packets and boxes. Later in 2011, the canned varieties also returned to supermarket shelves with refreshed labels and new lines. In 2012, Campbell announced plans to buy Bolthouse Farms, a maker of juices, salad dressings, and baby carrots, for $1.55 billion. Analysts said it was an attempt to reach younger, more affluent consumers. Since 2012, Campbell Soup has been focused on updating their image and digital marketing to increase visibility among younger generations. In June 2013, Campbell acquired the Danish multinational baked goods company Kelsen Group for an undisclosed amount. Kelsen has an 85-country distribution network and is seen as providing Campbell with opportunities for international expansion, particularly into China and other Asian markets. In June 2015, Campbell Soup acquired salsa maker Garden Fresh Gourmet for $231 million as it looked to expand into the fresh and organic packaged foods business. In January 2016, Campbell's announced that it would source 100% cage-free eggs by 2025. In December 2017, Campbell's completed the acquisition of Pacific Foods of Oregon, LLC for $700 million and announced the agreement to acquire the snack company Snyder's-Lance for $4.87 billion in cash. The latter deal is the largest in the company's history. In January 2018, Campbell's announced the closure of their only Canadian factory, in Toronto. Production shifted to three existing facilities in the United States, and 380 jobs were lost as a result. Denise Morrison served as the company's president and CEO from 2011 through 2018. On December 21, 2018, Mark Clouse, former CEO of Pinnacle Foods, was announced as Campbell's CEO effective January 22, 2019. Having sold over $450 million a year worth of Chunky Soup from 2004 to 2017, Campbell's asked for a trademark on \"Chunky\", which was approved in 2019. In July 2019, Campbell's agreed to sell its stake in the Kelsen Group for $300 million to a subsidiary of Ferrero SpA, with the transfer to be completed in 2020. Campbell's also divested Arnott's Biscuits to KKR for $2.2 billion at the same time. In August 2023, it was announced that Campbell's had acquired the Louisville, Colorado-headquartered food manufacturer Sovos Brands for $2.7 billion. On August 1, 2024, Campbell's announced that it will transfer its stock listing from the NYSE to the Nasdaq Global Select Market starting on August 16 at the market close. Trading on Nasdaq began on August 19, 2024. On August 26, 2024, Campbell's announced it completed the sale of its Pop Secret popcorn business to Our Home, an independent snack company. Terms of the transaction were not disclosed. On September 11, 2024, Campbell's announced a name change to The Campbell's Company. The change was approved on November 19, 2024. President and CEO Mark Clouse retired from his position to be named the team president of the NFL's Washington Commanders, with Mick Beekhuizen succeeding him on February 1, 2025. In September 2025, Campbell's admitted to multiple violations of the Clean Water Act. Campbell's Napoleon, Ohio canning plant dumped millions of gallons of waste into the Maumee River, which feeds Lake Erie, over a six and a half year period. In November 2025, a lawsuit was filed by Robert Garza, a former cybersecurity analyst for the company. The suit alleges Garza was fired after complaining about racist comments by an executive, Martin Bally, made during a meeting in November 2024. In an alleged recording of the meeting which was released to the media by Garza, an individual Garza claims is Bally states in an expletive-filled rant that Campbell's makes food for poor people and that they themselves don't want to eat it because the meat is bio-engineered and \"came from a 3-D printer\". Later that same month, Bally was dismissed by the company. Pop art In 1962, artist Andy Warhol incorporated the familiar look of the Campbell's soup can with a series of pop art silkscreens, a theme he would return to off and on through the 1960s and 1970s. The first batch in 1962 were a series of 32 canvases. At first, the cans were accurate representations of actual Campbell's cans, but as his series progressed, they became more surrealistic, with Warhol experimenting with negative-reversed color schemes and other varied techniques (many of these which would be used on other Warhol paintings of the period, such as his celebrity silkscreens of the 1960s). The silkscreens themselves have become iconic pieces of pop art, with one in particular, Small Torn Campbell Soup Can (Pepper Pot) (1962), commanding a price of $11.8 million at auction in 2006. Slogans Mmm Mmm Good (1935–present—their predominantly used slogan) Give Me The Campbell Life (1969–75) Soup Is Good Food (1975–c. 1982) Never underestimate the power of soup! (1990s) Possibilities (2005–2009) So Many Many Reasons It's So Mmm Mmm Good (2009–2010) It's Amazing What Soup Can Do! (2010–present) Made for real, Real life (2015–present) Health issues Many canned soups, including Campbell's condensed and chunky varieties, contain relatively high quantities of sodium and thus are not desirable for those on low-sodium diets. However, Campbell's Chunky, Healthy Request and other soups, as well as their V-8 and tomato juices, are claimed by Campbell's to contain reduced sodium levels. In the fall of 2007, Campbell's was awarded a Certificate of Excellence from Blood Pressure Canada for their efforts in lowering sodium levels. By the fall of 2009, Campbell's claimed it had lowered the sodium content in 50% of its soups range. In March 2010, this claim was challenged; ABC News reported that the low-sodium variety of Campbell soup in fact contained the same amount of sodium as the regular variety, and that Campbell's Healthy Request soup contained more fat than the regular variety. In July 2011, citing sinking sales, the company increased the salt content of its products again. In December 2009, Consumer Reports found that major canned food companies including Campbell's Soup were producing tinned products with bisphenol A (BPA) levels over 100 ppb in some cases; the testing revealed that just one serving of canned food would exceed an expert's recommendation for daily exposure (0.2 micrograms per kg body weight per day). GMO Throughout 2012, Campbell's contributed $500,000 to a $46 million political campaign known as \"the Coalition Against the Costly Food Labeling Proposition, sponsored by farmers and food producers\". This organization was set up to oppose a citizens' initiative, known as Proposition 37, demanding mandatory labeling of foods containing genetically modified ingredients sold in California. In January 2016, the company decided to support mandatory labeling and announced they would label their products that contained GMO additives. Brands Campbell's owns numerous brands that it markets worldwide. Among these are the following: Campbell's The company's flagship brand and the Campbell's name is used to market soups, sauces, and canned meals. Product lines under the brand include: Pepperidge Farm An American baked-goods company founded in 1937, it was acquired by Campbell's in 1961. The Pepperidge Farm brand is used by Campbell's to market the following: Pace Foods An American salsa company founded in 1947, Pace was acquired by Campbell's in 1995. The Pace brand is used by Campbell's to market salsas and picante sauce. Swanson Broth TV dinners and frozen meals (made by Pinnacle Foods under license) Canned chicken Prego Pasta sauces Snyder's-Lance Lance crackers and cookies Snyder's of Hanover pretzels Cape Cod Potato Chips Kettle potato chips Snack Factory pretzel chips Archway Cookies Late July Snacks Late July Snacks is a subsidiary of the Campbell Soup Company, acquired in the Snyder's-Lance acquisition in early 2018. Snyder's-Lance had boosted their ownership stake in Late July Snacks to 80% in 2014. Plants United States Camden, New Jersey: world headquarters, non-manufacturing Maxton, North Carolina: opened 1978 Napoleon, Ohio Ashland, Ohio: Archway Cookies bakery, acquired through the Snyder's-Lance purchase Willard, Ohio Paris, Texas Milwaukee, Wisconsin Everett, Washington West Sacramento, California Tualatin, Oregon East Rancho Dominguez, California Dixon, California Rancho Cucamonga, California Hyannis, Massachusetts: Cape Cod Potato Chips International Toronto: Opened 1930 in New Toronto, Ontario (closure announced in 2018) Lemnos, Victoria, Australia Lübeck, Germany Sold in 2013 to CVC Capital Partners and converted into Continental Foods BVBA. Selangor state, Malaysia King's Lynn, United Kingdom: Opened 1959, closed 2007. Site demolished 2012. Bekasi, Indonesia (as PT. Arnotts Indonesia) until 2019 at which point Campbell Soup Company sold it to KKR Ribe, Denmark until 2013 at which point Campbell Soup left the European market Nørre Snede, Denmark until 2013 at which point Campbell Soup left the European market Recalls 2010 On June 22, 2010, Campbell's \"SpaghettiOs and Meatballs\" product was recalled after a Texas firm found possible traces of underprocessed meat in the product."
}