{
  "ticker": "CPRT",
  "cik": "0000900075",
  "company_name": "Copart",
  "corrected_name": "Copart",
  "wiki_title_used": "Copart",
  "exists": true,
  "raw_text": "Copart, Inc. is a multi-national provider of online vehicle auction and remarketing services to automotive resellers such as insurance, rental car, fleet and finance companies in 11 countries; the US, Canada, the UK, Germany, Ireland, Brazil, Spain, UAE, Bahrain, Oman and Finland. Headquartered in Dallas, Texas, Copart has more than 200 physical locations, where it houses more than 10,000 acres of vehicle inventory. Copart sells used, wholesale and repairable vehicles in weekly and bi-weekly online auctions to buyers ranging from consumers to automotive businesses. Copart provides vehicle sellers with a range of services to process and sell repairable and clean title vehicles over the internet, using its patented virtual auction technology, named VB3, as well as others of its auction-related brands.\nCopart is a public company and is traded on the NASDAQ under the ticker symbol CPRT and has been named to Fortune's 2020 Future 50 companies, 100 Fastest-Growing Companies, and the Fortune 500 list.\n\nHistory\nCopart was founded in 1982 by then 34-year-old Willis J. Johnson in Vallejo, California.\nJohnson began expanding Copart in the early 1990s through private loans and equity. By the early '90s, the company had grown to four locations in northern California; and by March 1994, it had added another eight new facilities in Oregon, Washington, and Texas, culminating in the acquisition of the largest volume seller of salvage in the United States, North Texas Salvage Pool of Dallas, Texas.\nThat decade, Willis Johnson began developing Copart's information technology. The first main step in this process was the creation of the Copart Auction System (CAS) in 1997, which was designed to unify and support the growing business as well as allow Copart facilities and sellers to access information, generate reports, and increase operating efficiencies. The next step came in 1998 with Copart's introduction of internet bidding—a departure from the industry standard of local physical auctions.\nOn March 17, 1994, Copart had its initial public offering (IPO) at $12 per share and debuted on the NASDAQ under the symbol \"CPRT.\" Copart's IPO of 2.3 million shares of stock provided the company with the means to become a national company.\nIn May 1995, Copart began rapid expansion in the United States with the sizable acquisition of NER Auction Group, doubling its number of facilities around the country. Copart would continue to grow via acquisitions and founded six new locations from July 1995 to July 1996. With locations spread coast-to-coast in the United States, Copart shifted tactics and began to procure regional and national contracts with the nation's leading insurance companies to grow a nationwide chain of facilities. Copart has continued to acquire businesses, including National Powersport Auctions (NPA) in 2017.\nBy 2003, the company grew to 100 locations across the country and became the first to launch a completely online auction model. Currently, Copart has more than 200 locations in 11 countries.  A Canada yard opening marked the first international expansion in 2003. By 2007, Copart grew its footprint overseas to the United Kingdom. In 2012, Copart began expanding to the United Arab Emirates, Brazil, Bahrain, Oman, Spain, Ireland and Germany. Copart also expanded into Finland in 2018 with the acquisition of Autovahinkokeskus (AVK). Additionally, the CashForCars.com brand launched in Canada in 2018, Germany in 2019 and the United Kingdom in 2020.\nAs Internet bidding grew in popularity, Copart developed its online auction platform, VB2, which it implemented in 2003. VB2 opened the sales process to registered buyers (Members) and sellers worldwide. In fiscal year 2004 in North America and fiscal year 2008 in the U.K., Copart discontinued all live auctions and began remarketing vehicles exclusively through VB2.\nIn 2012, Copart relocated its corporate headquarters from Fairfield, California, to Dallas, Texas. Copart's Dallas headquarters building, Copart Tower, consists of approximately 53,000 square feet (4,900 m2) of leased office space.\nIn 2013, Copart upgraded its VB2 technology to a new version dubbed VB3. This version supported the latest browsers, eliminated the need for plugins and supported mobile interactivity. Copart now sells more than one million vehicles each year through VB3 technology.\n\nProducts and operations\nCopart's brands include BID4U, CashForCars.com, CrashedToys, DRIVE Auto Auctions, and National Powersport Auctions (NPA). Copart also sells additional services such as providing sale pricing estimates for salvage vehicles, providing transport to and from storage lots for vehicles being sold in its platforms, and assisting with vehicle title processing.\nCopart derives the largest part, over 80%, of its revenue from service fees collected for use of its online auction platform. The majority of the remainder of revenue comes from the sale of vehicles it actually takes ownership of and then resells. The company has reported that approximately 88% of its service fee revenue and 63% of its vehicle sales revenue come from within the United States, with the remainder of revenue coming from outside the United States. The largest group of vehicle purchasers buying automobiles in Copart's auctions is vehicle dismantlers, while insurance companies make up the primary seller of vehicles listed in Copart auctions.\nAmong the vehicles sold by insurance companies, the majority are vehicles declared a total loss after an accident or as a result of damage from a natural disaster.\n\nSee also\nList of S&P 500 companies\nList of companies in the Dallas–Fort Worth metroplex\n\nReferences\nExternal links\nOfficial website\nBusiness data for Copart, Inc.:",
  "clean_text": "Copart, Inc. is a multi-national provider of online vehicle auction and remarketing services to automotive resellers such as insurance, rental car, fleet and finance companies in 11 countries; the US, Canada, the UK, Germany, Ireland, Brazil, Spain, UAE, Bahrain, Oman and Finland. Headquartered in Dallas, Texas, Copart has more than 200 physical locations, where it houses more than 10,000 acres of vehicle inventory. Copart sells used, wholesale and repairable vehicles in weekly and bi-weekly online auctions to buyers ranging from consumers to automotive businesses. Copart provides vehicle sellers with a range of services to process and sell repairable and clean title vehicles over the internet, using its patented virtual auction technology, named VB3, as well as others of its auction-related brands. Copart is a public company and is traded on the NASDAQ under the ticker symbol CPRT and has been named to Fortune's 2020 Future 50 companies, 100 Fastest-Growing Companies, and the Fortune 500 list. History Copart was founded in 1982 by then 34-year-old Willis J. Johnson in Vallejo, California. Johnson began expanding Copart in the early 1990s through private loans and equity. By the early '90s, the company had grown to four locations in northern California; and by March 1994, it had added another eight new facilities in Oregon, Washington, and Texas, culminating in the acquisition of the largest volume seller of salvage in the United States, North Texas Salvage Pool of Dallas, Texas. That decade, Willis Johnson began developing Copart's information technology. The first main step in this process was the creation of the Copart Auction System (CAS) in 1997, which was designed to unify and support the growing business as well as allow Copart facilities and sellers to access information, generate reports, and increase operating efficiencies. The next step came in 1998 with Copart's introduction of internet bidding—a departure from the industry standard of local physical auctions. On March 17, 1994, Copart had its initial public offering (IPO) at $12 per share and debuted on the NASDAQ under the symbol \"CPRT.\" Copart's IPO of 2.3 million shares of stock provided the company with the means to become a national company. In May 1995, Copart began rapid expansion in the United States with the sizable acquisition of NER Auction Group, doubling its number of facilities around the country. Copart would continue to grow via acquisitions and founded six new locations from July 1995 to July 1996. With locations spread coast-to-coast in the United States, Copart shifted tactics and began to procure regional and national contracts with the nation's leading insurance companies to grow a nationwide chain of facilities. Copart has continued to acquire businesses, including National Powersport Auctions (NPA) in 2017. By 2003, the company grew to 100 locations across the country and became the first to launch a completely online auction model. Currently, Copart has more than 200 locations in 11 countries. A Canada yard opening marked the first international expansion in 2003. By 2007, Copart grew its footprint overseas to the United Kingdom. In 2012, Copart began expanding to the United Arab Emirates, Brazil, Bahrain, Oman, Spain, Ireland and Germany. Copart also expanded into Finland in 2018 with the acquisition of Autovahinkokeskus (AVK). Additionally, the CashForCars.com brand launched in Canada in 2018, Germany in 2019 and the United Kingdom in 2020. As Internet bidding grew in popularity, Copart developed its online auction platform, VB2, which it implemented in 2003. VB2 opened the sales process to registered buyers (Members) and sellers worldwide. In fiscal year 2004 in North America and fiscal year 2008 in the U.K., Copart discontinued all live auctions and began remarketing vehicles exclusively through VB2. In 2012, Copart relocated its corporate headquarters from Fairfield, California, to Dallas, Texas. Copart's Dallas headquarters building, Copart Tower, consists of approximately 53,000 square feet (4,900 m2) of leased office space. In 2013, Copart upgraded its VB2 technology to a new version dubbed VB3. This version supported the latest browsers, eliminated the need for plugins and supported mobile interactivity. Copart now sells more than one million vehicles each year through VB3 technology. Products and operations Copart's brands include BID4U, CashForCars.com, CrashedToys, DRIVE Auto Auctions, and National Powersport Auctions (NPA). Copart also sells additional services such as providing sale pricing estimates for salvage vehicles, providing transport to and from storage lots for vehicles being sold in its platforms, and assisting with vehicle title processing. Copart derives the largest part, over 80%, of its revenue from service fees collected for use of its online auction platform. The majority of the remainder of revenue comes from the sale of vehicles it actually takes ownership of and then resells. The company has reported that approximately 88% of its service fee revenue and 63% of its vehicle sales revenue come from within the United States, with the remainder of revenue coming from outside the United States. The largest group of vehicle purchasers buying automobiles in Copart's auctions is vehicle dismantlers, while insurance companies make up the primary seller of vehicles listed in Copart auctions. Among the vehicles sold by insurance companies, the majority are vehicles declared a total loss after an accident or as a result of damage from a natural disaster."
}