{
  "ticker": "CPT",
  "cik": "0000906345",
  "company_name": "Camden Property Trust",
  "corrected_name": "Camden Property Trust",
  "wiki_title_used": "Camden Property Trust",
  "exists": true,
  "raw_text": "Camden Property Trust is a publicly traded real estate investment trust that invests in apartments in the United States. As of December 31, 2023, the company owned interests in 176 apartment communities containing 59,800 apartment homes in the United States. It is the 14th largest owner of apartments in the United States.\nThe name of the company is derived from the last names of its founders, Richard J. Campo and D. Keith Oden.\n\nHistory\nIn 1981, Richard J. Campo and D. Keith Oden bought the failing Houston condominium business of their employer and reorganized it into a REIT.\nIn 1993, the company became a public company via an initial public offering.\nIn 1997, the company acquired Paragon Group, which owned 17,000 apartment units, in a $615 million transaction.\nIn 1998, the company acquired Oasis Residential for $542 million in stock and the assumption of $430 million in debt.\nIn 2005, the company acquired Summit Properties in a $1.1 billion transaction.\nIn 2011, the company acquired 8 properties in Texas for $261 million.\nIn 2012, the company purchased the 80% interest held by a joint venture partner in 12 communities for $99.5 million.\nIn 2016, the company sold its portfolio of properties in Nevada, which included 15 communities with 4,918 apartment units, for $630 million.\nIn 2022, the company acquired the remaining ownership interests in its joint venture with Teacher Retirement System of Texas.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Camden Property Trust:",
  "clean_text": "Camden Property Trust is a publicly traded real estate investment trust that invests in apartments in the United States. As of December 31, 2023, the company owned interests in 176 apartment communities containing 59,800 apartment homes in the United States. It is the 14th largest owner of apartments in the United States. The name of the company is derived from the last names of its founders, Richard J. Campo and D. Keith Oden. History In 1981, Richard J. Campo and D. Keith Oden bought the failing Houston condominium business of their employer and reorganized it into a REIT. In 1993, the company became a public company via an initial public offering. In 1997, the company acquired Paragon Group, which owned 17,000 apartment units, in a $615 million transaction. In 1998, the company acquired Oasis Residential for $542 million in stock and the assumption of $430 million in debt. In 2005, the company acquired Summit Properties in a $1.1 billion transaction. In 2011, the company acquired 8 properties in Texas for $261 million. In 2012, the company purchased the 80% interest held by a joint venture partner in 12 communities for $99.5 million. In 2016, the company sold its portfolio of properties in Nevada, which included 15 communities with 4,918 apartment units, for $630 million. In 2022, the company acquired the remaining ownership interests in its joint venture with Teacher Retirement System of Texas."
}