{
  "ticker": "CRL",
  "cik": "0001100682",
  "company_name": "Charles River Laboratories",
  "corrected_name": "Charles River Laboratories",
  "wiki_title_used": "Charles River Laboratories",
  "exists": true,
  "raw_text": "Charles River Laboratories International, Inc. is an American pharmaceutical and biotechnology contract research organisation (CRO) headquartered in Wilmington, Massachusetts, United States. Founded in 1947, the company provides preclinical and clinical laboratory services for the development of new drugs, vaccines, and medical devices. Its operations span at least 20 countries, offering research models, safety assessment, and manufacturing support services to pharmaceutical, biotechnology, and government clients.\nCharles River Laboratories is considered one of the largest CROs globally, known for its role in toxicology studies, animal research models, and microbial testing services used in regulatory submissions to health authorities such as the U.S. Food and Drug Administration (FDA). The company has also been the subject of public scrutiny and regulatory attention over its use of laboratory animals, including dogs, primates, and horseshoe crabs.\nAs of 2024, the company employs over 20,000 people worldwide and is publicly traded on the New York Stock Exchange under the ticker symbol CRL.\n\nHistory\nCharles River was founded in 1947 by Henry Foster, a young veterinarian who purchased one thousand rat cages from a Virginia farm and set up a one-person laboratory in Boston overlooking the Charles River. He supplied local researchers with laboratory animals.\nIn 1955, the company's headquarters were relocated to their current home in Wilmington, Massachusetts. The organization became an international entity in 1966 by opening a new animal production facility in France.\nThe first commercial, comprehensive genetic monitoring program was implemented by Charles River in 1981. Three years later, they were acquired by Bausch & Lomb.\nIn 1988, the organization began creating transgenic mice and rats. In the 1990s, they began in vitro endotoxin testing.\nIn the 1990s, Jim Foster bought Charles River back from Bausch & Lomb, and the company later went public on the New York Stock Exchange.\nCharles River launched the Humane Care Imperative in 2002, designed to raise awareness and train employees on animal welfare's importance. The same year, they were named \"Company of the Year\" by The Boston Globe. The company introduced preconditioning services in 2005 to provide customers with study-ready animals.\nIn 2008, Charles River signed a ten-year contract to partner with the National Cancer Institute and opened a facility in Frederick, Maryland.\nIn April 2019, Charles River announced it would cease its San Diego operations, moving the breeding of rodents for testing compounds to Hollister, California.\nIn March 2023, the Born Free USA animal welfare organization protested against Charles River's plan to export 1,000 endangered juvenile long-tail macaques to Cambodia for testing.\n\nAcquisitions\nIn 1988, Charles River purchased Specific Pathogen Antigen Free Avian Services (SPAFAS) and serologic diagnostic services Merck, Sharp, and Dohme.\nBetween 1996 and 2000, the company acquired Endosafe, Inc. and Sierra Biomedical.\nIn October 2003, Charles River Laboratories merged with Inveresk, a research company based in the United Kingdom. The company was known then as Charles River Laboratories. Inveresk specialised in clinical research and pre-clinical testing, and their main facilities are in Edinburgh, Scotland. In late 2009, Charles River sold its Clinical Services Division in Edinburgh to Quotient Bioresearch.\nIn 2010, Charles River Laboratories attempted to acquire WuXi PharmaTech, a China-based contract research organization, but the offer was withdrawn when the deal faced opposition from several large Charles River investors, including Relational Investors, JANA Partners, and Neuberger Berman. The proxy advisory firm RiskMetrics had also recommended that Charles River's shareholders vote against the proposed deal.\nFrom 2008 to 2013, Charles River acquires several companies including NewLab Bioquality AG, MIR Preclinical Services, Piedmont Research Center, LLC, Cerebricon, Ltd., Accugenix, and Vital River, allowing the company to expand their research models and services portfolio to drug development and discovery markets in China.\nThe acquisitions of Argenta and BioFocus in 2014 allowed Charles River to establish itself as a full-service, early-stage contract research organization with integrated in vitro and in vivo capabilities from target discovery through pre-clinical development.\nIn July 2015, the company announced it would acquire Celsis International for $212 million.\nIn 2016, the company announced it was set to acquire WIL Research for approximately $585 million in cash and Blue Stream Laboratories.\nIn August 2017, the business announced it would acquire Brains On-Line.\nIn January 2018, the company announced it would acquire KWS BioTest for up to £18 million ($24.4 million). In February of the same year, Charles River announced it would acquire MPI Research for approximately $800 million in cash. The transaction was completed on April 3, 2018.\nIn February 2019, the company announced it would acquire Citoxlab for €448 million in cash (approximately $500 million), including the former acquisitions of the French company, AccelLAB, Atlanbio and Solvo Biotechnology. The transaction was completed on April 29. In December of the same year the business announced it would acquire HemaCare for approximately $380 million in cash.\nIn August 2020, the company announced it would acquire Cellero for $38 million in cash.\nIn January 2021, the company announced it would acquire Distributed Bio, Inc., an antibody discovery business.\nIn February 2021, Charles River announced it would acquire Cognate BioServices, Inc. for $875 million.\nIn March 2021, Charles River announced the acquisition of Retrogenix for $48 million.\nIn May 2021, Charles River announced the acquisition of Vigene Biosciences, a gene therapy contract development and manufacturing organization (CDMO), for $292.5 million.\nIn October 2021, a Japanese subsidiary of Charles River was acquired by Jackson Laboratory for $63M USD.\nIn April 2022, the company announced it would acquire Explora BioLabs.\nIn January 2023, the business announced it would acquire SAMDI Tech, Inc.\n\nSee also\nList of S&P 500 companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for Charles River Laboratories:",
  "clean_text": "Charles River Laboratories International, Inc. is an American pharmaceutical and biotechnology contract research organisation (CRO) headquartered in Wilmington, Massachusetts, United States. Founded in 1947, the company provides preclinical and clinical laboratory services for the development of new drugs, vaccines, and medical devices. Its operations span at least 20 countries, offering research models, safety assessment, and manufacturing support services to pharmaceutical, biotechnology, and government clients. Charles River Laboratories is considered one of the largest CROs globally, known for its role in toxicology studies, animal research models, and microbial testing services used in regulatory submissions to health authorities such as the U.S. Food and Drug Administration (FDA). The company has also been the subject of public scrutiny and regulatory attention over its use of laboratory animals, including dogs, primates, and horseshoe crabs. As of 2024, the company employs over 20,000 people worldwide and is publicly traded on the New York Stock Exchange under the ticker symbol CRL. History Charles River was founded in 1947 by Henry Foster, a young veterinarian who purchased one thousand rat cages from a Virginia farm and set up a one-person laboratory in Boston overlooking the Charles River. He supplied local researchers with laboratory animals. In 1955, the company's headquarters were relocated to their current home in Wilmington, Massachusetts. The organization became an international entity in 1966 by opening a new animal production facility in France. The first commercial, comprehensive genetic monitoring program was implemented by Charles River in 1981. Three years later, they were acquired by Bausch & Lomb. In 1988, the organization began creating transgenic mice and rats. In the 1990s, they began in vitro endotoxin testing. In the 1990s, Jim Foster bought Charles River back from Bausch & Lomb, and the company later went public on the New York Stock Exchange. Charles River launched the Humane Care Imperative in 2002, designed to raise awareness and train employees on animal welfare's importance. The same year, they were named \"Company of the Year\" by The Boston Globe. The company introduced preconditioning services in 2005 to provide customers with study-ready animals. In 2008, Charles River signed a ten-year contract to partner with the National Cancer Institute and opened a facility in Frederick, Maryland. In April 2019, Charles River announced it would cease its San Diego operations, moving the breeding of rodents for testing compounds to Hollister, California. In March 2023, the Born Free USA animal welfare organization protested against Charles River's plan to export 1,000 endangered juvenile long-tail macaques to Cambodia for testing. Acquisitions In 1988, Charles River purchased Specific Pathogen Antigen Free Avian Services (SPAFAS) and serologic diagnostic services Merck, Sharp, and Dohme. Between 1996 and 2000, the company acquired Endosafe, Inc. and Sierra Biomedical. In October 2003, Charles River Laboratories merged with Inveresk, a research company based in the United Kingdom. The company was known then as Charles River Laboratories. Inveresk specialised in clinical research and pre-clinical testing, and their main facilities are in Edinburgh, Scotland. In late 2009, Charles River sold its Clinical Services Division in Edinburgh to Quotient Bioresearch. In 2010, Charles River Laboratories attempted to acquire WuXi PharmaTech, a China-based contract research organization, but the offer was withdrawn when the deal faced opposition from several large Charles River investors, including Relational Investors, JANA Partners, and Neuberger Berman. The proxy advisory firm RiskMetrics had also recommended that Charles River's shareholders vote against the proposed deal. From 2008 to 2013, Charles River acquires several companies including NewLab Bioquality AG, MIR Preclinical Services, Piedmont Research Center, LLC, Cerebricon, Ltd., Accugenix, and Vital River, allowing the company to expand their research models and services portfolio to drug development and discovery markets in China. The acquisitions of Argenta and BioFocus in 2014 allowed Charles River to establish itself as a full-service, early-stage contract research organization with integrated in vitro and in vivo capabilities from target discovery through pre-clinical development. In July 2015, the company announced it would acquire Celsis International for $212 million. In 2016, the company announced it was set to acquire WIL Research for approximately $585 million in cash and Blue Stream Laboratories. In August 2017, the business announced it would acquire Brains On-Line. In January 2018, the company announced it would acquire KWS BioTest for up to £18 million ($24.4 million). In February of the same year, Charles River announced it would acquire MPI Research for approximately $800 million in cash. The transaction was completed on April 3, 2018. In February 2019, the company announced it would acquire Citoxlab for €448 million in cash (approximately $500 million), including the former acquisitions of the French company, AccelLAB, Atlanbio and Solvo Biotechnology. The transaction was completed on April 29. In December of the same year the business announced it would acquire HemaCare for approximately $380 million in cash. In August 2020, the company announced it would acquire Cellero for $38 million in cash. In January 2021, the company announced it would acquire Distributed Bio, Inc., an antibody discovery business. In February 2021, Charles River announced it would acquire Cognate BioServices, Inc. for $875 million. In March 2021, Charles River announced the acquisition of Retrogenix for $48 million. In May 2021, Charles River announced the acquisition of Vigene Biosciences, a gene therapy contract development and manufacturing organization (CDMO), for $292.5 million. In October 2021, a Japanese subsidiary of Charles River was acquired by Jackson Laboratory for $63M USD. In April 2022, the company announced it would acquire Explora BioLabs. In January 2023, the business announced it would acquire SAMDI Tech, Inc."
}