{
  "ticker": "CRWD",
  "cik": "0001535527",
  "company_name": "CrowdStrike",
  "corrected_name": "CrowdStrike",
  "wiki_title_used": "CrowdStrike",
  "exists": true,
  "raw_text": "CrowdStrike Holdings, Inc. is an American cybersecurity technology company based in Austin, Texas. It provides endpoint security, threat intelligence, and cyberattack response services.\nCrowdstrike has investigated several high-profile cyberattacks, including the 2014 Sony Pictures hack, the 2015-16 cyberattacks on the Democratic National Committee (DNC), and the 2016 email leak involving the DNC. On July 19, 2024, it issued a faulty update to its security software that caused global computer outages that disrupted air travel, banking, broadcasting, and other services.\n\nHistory\nCrowdStrike was co-founded in 2011 by George Kurtz (CEO), Dmitri Alperovitch (former CTO), and Gregg Marston (CFO, retired). The following year, the company hired Shawn Henry, a former Federal Bureau of Investigation (FBI) official, to lead the subsidiary CrowdStrike Services, Inc., which offered security and response services. The company launched CrowdStrike Falcon, an antivirus package, as its first product in June 2013.\nIn May 2014, CrowdStrike's reports helped the United States Department of Justice to charge five Chinese military hackers with economic cyber espionage against U.S. corporations. CrowdStrike also uncovered the activities of Energetic Bear, a group connected to Russia's Federal Security Service that conducted intelligence operations against global targets, primarily in the energy sector.\nAfter the Sony Pictures hack, CrowdStrike uncovered evidence implicating the government of North Korea and demonstrated how the attack was carried out. In 2014, CrowdStrike helped identify members of Putter Panda, the state-sponsored Chinese group of hackers also known as PLA Unit 61486.\nIn May 2015, the company released information about VENOM, a critical flaw in an open-source hypervisor (hardware or software that runs virtual machines) called Quick Emulator (QEMU) that allowed hackers to access sensitive personal information. In October 2015, the company announced that it had identified Chinese hackers attacking technology and pharmaceutical companies around the time that U.S. President Barack Obama and China's leader Xi Jinping publicly agreed not to conduct economic espionage against each other. The alleged hacking would have been in violation of that agreement.\nIn July 2015, Google invested in the company's Series C funding round, which was followed by Series D and Series E, raising a total of $480 million as of May 2019.\nIn 2017, Crowdstrike reached a valuation of more than $1 billion with an estimated annual revenue of $100 million. In June 2018, the company said it was valued at more than $3 billion. Investors include Telstra, March Capital Partners, Rackspace, Accel Partners and Warburg Pincus.\nIn June 2019, the company made an initial public offering on the Nasdaq.\nCrowdStrike expanded its identity security offerings with Falcon Identity Threat Protection, initially available in 2020, which later evolved into a managed service integrating with Falcon Complete in 2022, and a Cloud Threat Hunting Service in July 2022.\nIn December 2021, the company moved its headquarters location from Sunnyvale, California, to Austin, Texas.\nIn 2023, CrowdStrike introduced CrowdStream service in collaboration with Cribl.io. Charlotte AI, CrowdStrike's generative AI security analyst, was launched in May 2023 as part of Falcon's AI-driven security updates, enhancing automated threat triaging and response.\nIn September 2023, CrowdStrike launched Falcon Foundry, a no-code application development platform directed at a wider audience, and in September 2024, the company launched CrowdStrike Financial Services, which offers payment solutions and financing to improve access to the Falcon platform.\nCrowdStrike joined the S&P 500 index in June 2024.\nAs of 2024, CrowdStrike spent more than $360,000 on federal lobbying in the first half of 2024, according to OpenSecrets, and $620,000 during 2023. The company has also focused on working with the U.S. government and selling its services to government agencies.\n\nAcquisitions\nCrowdstrike has a history of acquisitions, including: \n\nNovember 2017: Acquired Payload Security, a firm that developed automated malware analysis sandbox technology.\nSeptember 2020: Acquired zero trust and conditional access technology provider Preempt Security for $96 million.\nFebruary 2021: Acquired Danish log management platform Humio for $400 million with plans to integrate Humio's log aggregation into CrowdStrike's XDR offering.\nNovember 2021: Acquired SecureCircle, a SaaS-based cybersecurity service that extends zero trust endpoint security to include data.\nOctober 2022: Acquired Reposify, an external attack surface management vendor for risk management.\n2023: Acquired Israeli cybersecurity startup Bionic.ai.\n2024: Acquired Israeli cloud security startups Flow Security for $200 million and Adaptive Shield for $300 million.\nAugust 2025: Acquired the Spanish company Onum a company focused on managing real time telemetry pipelines.\n\nEarnings\nIn 2024, total revenue was $3.06 billion, a 36% increase.\n\nRussian hacking investigations\nCrowdStrike helped investigate the Democratic National Committee cyberattacks and a connection to Russian intelligence services. On 20 March 2017, then-FBI director James Comey testified before congress stating:\"CrowdStrike, Mandiant, and ThreatConnect review[ed] the evidence of the hack and conclude[d] with high certainty that it was the work of APT 28 and APT 29 who are known to be Russian intelligence services.\"Comey previously testified in January 2017 that a request for FBI forensics investigators to access the DNC servers was denied, saying Crowdstrike agreed to share information.\nIn December 2016, CrowdStrike released a report stating that Russian government-affiliated group Fancy Bear had hacked a Ukrainian artillery app. The report concluded that Russia had used the hack to cause large losses to Ukrainian artillery units. The app (called ArtOS) was installed on tablet PCs and used for fire-control. CrowdStrike also found a hacked variation of POPR-D30 being distributed on Ukrainian military forums that utilized an X-Agent implant.\nThe U.K.-based think tank International Institute for Strategic Studies said CrowdStrike’s report wrongly used its data and denied that hacking caused Ukraine’s artillery losses. The Ukrainian Ministry of Defense also rejected the CrowdStrike report, stating that actual artillery losses were much smaller than what was reported by CrowdStrike and were not associated with Russian hacking. Prior to this, CrowdStrike had published a report claiming that malware used in Ukraine and against the Democratic National Committee (DNC) appeared to be unique and identical, offering it as further evidence for a Russian origin of the DNC attack.\nCybersecurity firm SecureWorks discovered a list of email addresses targeted by Fancy Bear in phishing attacks. The list included the email address of Yaroslav Sherstyuk, the developer of ArtOS. Additional Associated Press research supports CrowdStrike's conclusions about Fancy Bear. Radio Free Europe notes that the AP report \"lends some credence to the original CrowdStrike report, showing that the app had, in fact, been targeted.\"\n\n2024 IT Outages\nOn 19 July 2024, CrowdStrike released a software configuration file update to the Falcon endpoint detection and response agent. Flaws in the update caused blue screens of death on Microsoft Windows machines, disrupting millions of Windows computers worldwide. Affected machines were forced into a bootloop, making them unusable. This was caused by an update to a configuration file, Channel File 291, which CrowdStrike says triggered a logic error and caused the operating system to crash. The downtime caused a widespread global impact, grounding commercial airline flights, temporarily taking Sky News and other broadcasters offline, and disrupting banking and healthcare services as well as 911 emergency call centers.\nBy the end of the day, CrowdStrike shares closed trading at a price of $304.96, down $38.09 or 11.10%.\nAlthough CrowdStrike issued a patch to fix the error, computers stuck in a bootloop were unable to connect to the Internet to download the patch before Falcon would be loaded and crash the device again. The recommended solution from CrowdStrike was to boot into safe mode or Windows Recovery Mode and manually delete Channel File 291. This requires local administrator access and if the device was encrypted by BitLocker, also required a recovery key. Microsoft reported that some customers were able to remediate the issue solely by rebooting impacted devices up to 15 times.\nOn 22 July 2024, CrowdStrike shares closed the trading day at a price of $263.91, with a loss of $41.05 or 13.46%. On 24 July 2024, five days after the incident, CrowdStrike published a Post-Incident Review. That same day, CrowdStrike reportedly contacted affected channel partners with apology emails containing Uber Eats gift cards worth $10. On 6 August 2024, Crowdstrike published a Root Cause Analysis to explain the causes of the Channel File 291 Incident, and the mitigation steps the company took to eliminate future incidents. CrowdStrike made several process improvements in response to the 19 July incident. These include: adding new content configuration test procedures; implementing additional deployment layers and acceptance checks for its content configuration  system; engaging two third-party vendors to review Falcon sensor code, and the company's quality control and release processes; and staggering update rollouts so that users can select their preferred timing for updates. The CrowdStrike incident cost Fortune 500 companies $5.4 billion.\n\nSee also\nOperating systems\nChinese intelligence activity abroad\nChinese espionage in the United States\nTimeline of Russian interference in the 2016 United States elections\nTimeline of investigations into Donald Trump and Russia (January–June 2017)\n\nReferences\nExternal links\nOfficial website \n\nBusiness data for CrowdStrike Holdings, Inc.:",
  "clean_text": "CrowdStrike Holdings, Inc. is an American cybersecurity technology company based in Austin, Texas. It provides endpoint security, threat intelligence, and cyberattack response services. Crowdstrike has investigated several high-profile cyberattacks, including the 2014 Sony Pictures hack, the 2015-16 cyberattacks on the Democratic National Committee (DNC), and the 2016 email leak involving the DNC. On July 19, 2024, it issued a faulty update to its security software that caused global computer outages that disrupted air travel, banking, broadcasting, and other services. History CrowdStrike was co-founded in 2011 by George Kurtz (CEO), Dmitri Alperovitch (former CTO), and Gregg Marston (CFO, retired). The following year, the company hired Shawn Henry, a former Federal Bureau of Investigation (FBI) official, to lead the subsidiary CrowdStrike Services, Inc., which offered security and response services. The company launched CrowdStrike Falcon, an antivirus package, as its first product in June 2013. In May 2014, CrowdStrike's reports helped the United States Department of Justice to charge five Chinese military hackers with economic cyber espionage against U.S. corporations. CrowdStrike also uncovered the activities of Energetic Bear, a group connected to Russia's Federal Security Service that conducted intelligence operations against global targets, primarily in the energy sector. After the Sony Pictures hack, CrowdStrike uncovered evidence implicating the government of North Korea and demonstrated how the attack was carried out. In 2014, CrowdStrike helped identify members of Putter Panda, the state-sponsored Chinese group of hackers also known as PLA Unit 61486. In May 2015, the company released information about VENOM, a critical flaw in an open-source hypervisor (hardware or software that runs virtual machines) called Quick Emulator (QEMU) that allowed hackers to access sensitive personal information. In October 2015, the company announced that it had identified Chinese hackers attacking technology and pharmaceutical companies around the time that U.S. President Barack Obama and China's leader Xi Jinping publicly agreed not to conduct economic espionage against each other. The alleged hacking would have been in violation of that agreement. In July 2015, Google invested in the company's Series C funding round, which was followed by Series D and Series E, raising a total of $480 million as of May 2019. In 2017, Crowdstrike reached a valuation of more than $1 billion with an estimated annual revenue of $100 million. In June 2018, the company said it was valued at more than $3 billion. Investors include Telstra, March Capital Partners, Rackspace, Accel Partners and Warburg Pincus. In June 2019, the company made an initial public offering on the Nasdaq. CrowdStrike expanded its identity security offerings with Falcon Identity Threat Protection, initially available in 2020, which later evolved into a managed service integrating with Falcon Complete in 2022, and a Cloud Threat Hunting Service in July 2022. In December 2021, the company moved its headquarters location from Sunnyvale, California, to Austin, Texas. In 2023, CrowdStrike introduced CrowdStream service in collaboration with Cribl.io. Charlotte AI, CrowdStrike's generative AI security analyst, was launched in May 2023 as part of Falcon's AI-driven security updates, enhancing automated threat triaging and response. In September 2023, CrowdStrike launched Falcon Foundry, a no-code application development platform directed at a wider audience, and in September 2024, the company launched CrowdStrike Financial Services, which offers payment solutions and financing to improve access to the Falcon platform. CrowdStrike joined the S&P 500 index in June 2024. As of 2024, CrowdStrike spent more than $360,000 on federal lobbying in the first half of 2024, according to OpenSecrets, and $620,000 during 2023. The company has also focused on working with the U.S. government and selling its services to government agencies. Acquisitions Crowdstrike has a history of acquisitions, including: November 2017: Acquired Payload Security, a firm that developed automated malware analysis sandbox technology. September 2020: Acquired zero trust and conditional access technology provider Preempt Security for $96 million. February 2021: Acquired Danish log management platform Humio for $400 million with plans to integrate Humio's log aggregation into CrowdStrike's XDR offering. November 2021: Acquired SecureCircle, a SaaS-based cybersecurity service that extends zero trust endpoint security to include data. October 2022: Acquired Reposify, an external attack surface management vendor for risk management. 2023: Acquired Israeli cybersecurity startup Bionic.ai. 2024: Acquired Israeli cloud security startups Flow Security for $200 million and Adaptive Shield for $300 million. August 2025: Acquired the Spanish company Onum a company focused on managing real time telemetry pipelines. Earnings In 2024, total revenue was $3.06 billion, a 36% increase. Russian hacking investigations CrowdStrike helped investigate the Democratic National Committee cyberattacks and a connection to Russian intelligence services. On 20 March 2017, then-FBI director James Comey testified before congress stating:\"CrowdStrike, Mandiant, and ThreatConnect review[ed] the evidence of the hack and conclude[d] with high certainty that it was the work of APT 28 and APT 29 who are known to be Russian intelligence services.\"Comey previously testified in January 2017 that a request for FBI forensics investigators to access the DNC servers was denied, saying Crowdstrike agreed to share information. In December 2016, CrowdStrike released a report stating that Russian government-affiliated group Fancy Bear had hacked a Ukrainian artillery app. The report concluded that Russia had used the hack to cause large losses to Ukrainian artillery units. The app (called ArtOS) was installed on tablet PCs and used for fire-control. CrowdStrike also found a hacked variation of POPR-D30 being distributed on Ukrainian military forums that utilized an X-Agent implant. The U.K.-based think tank International Institute for Strategic Studies said CrowdStrike’s report wrongly used its data and denied that hacking caused Ukraine’s artillery losses. The Ukrainian Ministry of Defense also rejected the CrowdStrike report, stating that actual artillery losses were much smaller than what was reported by CrowdStrike and were not associated with Russian hacking. Prior to this, CrowdStrike had published a report claiming that malware used in Ukraine and against the Democratic National Committee (DNC) appeared to be unique and identical, offering it as further evidence for a Russian origin of the DNC attack. Cybersecurity firm SecureWorks discovered a list of email addresses targeted by Fancy Bear in phishing attacks. The list included the email address of Yaroslav Sherstyuk, the developer of ArtOS. Additional Associated Press research supports CrowdStrike's conclusions about Fancy Bear. Radio Free Europe notes that the AP report \"lends some credence to the original CrowdStrike report, showing that the app had, in fact, been targeted.\" 2024 IT Outages On 19 July 2024, CrowdStrike released a software configuration file update to the Falcon endpoint detection and response agent. Flaws in the update caused blue screens of death on Microsoft Windows machines, disrupting millions of Windows computers worldwide. Affected machines were forced into a bootloop, making them unusable. This was caused by an update to a configuration file, Channel File 291, which CrowdStrike says triggered a logic error and caused the operating system to crash. The downtime caused a widespread global impact, grounding commercial airline flights, temporarily taking Sky News and other broadcasters offline, and disrupting banking and healthcare services as well as 911 emergency call centers. By the end of the day, CrowdStrike shares closed trading at a price of $304.96, down $38.09 or 11.10%. Although CrowdStrike issued a patch to fix the error, computers stuck in a bootloop were unable to connect to the Internet to download the patch before Falcon would be loaded and crash the device again. The recommended solution from CrowdStrike was to boot into safe mode or Windows Recovery Mode and manually delete Channel File 291. This requires local administrator access and if the device was encrypted by BitLocker, also required a recovery key. Microsoft reported that some customers were able to remediate the issue solely by rebooting impacted devices up to 15 times. On 22 July 2024, CrowdStrike shares closed the trading day at a price of $263.91, with a loss of $41.05 or 13.46%. On 24 July 2024, five days after the incident, CrowdStrike published a Post-Incident Review. That same day, CrowdStrike reportedly contacted affected channel partners with apology emails containing Uber Eats gift cards worth $10. On 6 August 2024, Crowdstrike published a Root Cause Analysis to explain the causes of the Channel File 291 Incident, and the mitigation steps the company took to eliminate future incidents. CrowdStrike made several process improvements in response to the 19 July incident. These include: adding new content configuration test procedures; implementing additional deployment layers and acceptance checks for its content configuration system; engaging two third-party vendors to review Falcon sensor code, and the company's quality control and release processes; and staggering update rollouts so that users can select their preferred timing for updates. The CrowdStrike incident cost Fortune 500 companies $5.4 billion."
}