{
  "ticker": "CSGP",
  "cik": "0001057352",
  "company_name": "CoStar Group",
  "corrected_name": "CoStar Group",
  "wiki_title_used": "CoStar Group",
  "exists": true,
  "raw_text": "CoStar Group, Inc. is an American provider of information, analytics, and marketing services to the commercial property industry in North America and Europe. Founded in 1987 by Andrew C. Florance and based in Arlington, Virginia, the company operates the CoStar online database and news website and several online marketplaces, including Apartments.com and Homes.com.\n\nHistory\nOrigins\nCoStar Group was founded in 1987 by Andrew C. Florance in Washington, D.C., as one of the first companies that digitized and aggregated property data before the Internet became widely available. In 1998, the company went public via an initial public offering on Nasdaq, raising $22.5 million. In June 2004, the lawsuit CoStar Group, Inc. v. LoopNet, Inc. became a landmark case in copyright law about the role of an Internet service provider in monitoring copyrighted content posted on its servers. In October 2009, the company acquired a building from the Mortgage Bankers Association for $41.3 million, which served as the company's headquarters. The building had sold for $97 million two years earlier, with CoStar Group claiming that it had used its analytics data to determine the right time to buy. In 2025, CoStar Group moved its headquarters to Arlington, Virginia.\n\nGrowth and expansion\nThroughout the 2010s, CoStar Group expanded its footprint in the commercial property industry with a series of acquisitions in North America and Europe. In 2009, it acquired Property and Portfolio Research company Grecam, joining the company's existing Grecam service. In 2012, it acquired the online marketing site LoopNet for $860 million. With the acquisition, CoStar Group also took over the Loopnet properties BizBuySell and LandsofAmerica. Two years later, the company acquired Apartments.com for $585 million, as well as Apartment Finder the following year.\nFrom 2017 through 2020, the company acquired the online marketplaces Westside Rentals, ForRent.com (previously owned by Dominion Enterprises), Cozy Services, Off Campus Partners, and Ten-X; in addition to the hotel research and analytics firm STR, the residential mobile application provider Homesnap. In April 2021, it acquired Homes.com, a prominent residential real-estate website, from Dominion Enterprises for $156 million in cash. In February 2025, CoStar acquired the 3D spatial mapping company Matterport for $1.6 billion. \nOverseas, its European division acquired the German real-estate business data company Thomas Daily and the Spanish online marketplace and information provider Belbex in 2016. From 2018 through 2023, it acquired the British online marketplace Realla, the German real-estate data company Emporis, the French online marketplace BureauxLocaux, and the British property portal OnTheMarket. After initially taking a 16.9% stake in Australian real estate information company Domain Group, CoStar entered an agreement to acquire 100% of the company for US$1.92 billion in May 2025.\n\nOther activities\nIn 2019, CoStar Group announced that Oxford Economics would provide the economic data and forecasts used in its products. The company came under fire in 2022 when Business Insider reported that over 29 current and former employees claimed to have been excessively monitored and micromanaged, including with unscheduled check-in video calls made by the company's IT department, as well as being publicly berated and arbitrarily fired in some cases. The company made efforts to take down criticism of itself on various social media platforms. CoStar Group denied the allegations, contending that the discontent had stemmed from the company's high expectations. In 2024, CoStar Group purchased an estimated $35 million worth of airtime at Super Bowl LVIII for four Super Bowl commercials advertising its subsidiaries Homes.com and Apartments.com, which The New York Times described as an effort to rival competitor services such as Zillow and Realtor.com.\nCoStar has been criticized for anticompetitive and monopolistic business practices, often using aggressive litigation and \"public-relations warfare\" to \"push [competitors] to the brink of collapse or weaken them enough to make them soft targets for an acquisition\". In February 2024, a proposed consumer class action lawsuit was filed against CoStar in multiple states, accusing the company of a price-fixing conspiracy in which it conspired with a group of luxury hotel chains—including Hilton, Hyatt, Marriott, InterContinental, Loews, and Accor—to keep room rental prices artificially high by sharing competitively sensitive information through the company's STR reports. These allegations were based in part on insider information shared by an STR software engineer.\n\nBusiness\nCoStar Group provides commercial real estate information, analytics, and online marketplaces for real estate transactions. Its research services include online services and research for the rental home and hotel industry.\nAs of February 2025, its subsidiaries include:\n\nReferences\nExternal links\nOfficial website\nBusiness data for CoStar Group, Inc.:",
  "clean_text": "CoStar Group, Inc. is an American provider of information, analytics, and marketing services to the commercial property industry in North America and Europe. Founded in 1987 by Andrew C. Florance and based in Arlington, Virginia, the company operates the CoStar online database and news website and several online marketplaces, including Apartments.com and Homes.com. History Origins CoStar Group was founded in 1987 by Andrew C. Florance in Washington, D.C., as one of the first companies that digitized and aggregated property data before the Internet became widely available. In 1998, the company went public via an initial public offering on Nasdaq, raising $22.5 million. In June 2004, the lawsuit CoStar Group, Inc. v. LoopNet, Inc. became a landmark case in copyright law about the role of an Internet service provider in monitoring copyrighted content posted on its servers. In October 2009, the company acquired a building from the Mortgage Bankers Association for $41.3 million, which served as the company's headquarters. The building had sold for $97 million two years earlier, with CoStar Group claiming that it had used its analytics data to determine the right time to buy. In 2025, CoStar Group moved its headquarters to Arlington, Virginia. Growth and expansion Throughout the 2010s, CoStar Group expanded its footprint in the commercial property industry with a series of acquisitions in North America and Europe. In 2009, it acquired Property and Portfolio Research company Grecam, joining the company's existing Grecam service. In 2012, it acquired the online marketing site LoopNet for $860 million. With the acquisition, CoStar Group also took over the Loopnet properties BizBuySell and LandsofAmerica. Two years later, the company acquired Apartments.com for $585 million, as well as Apartment Finder the following year. From 2017 through 2020, the company acquired the online marketplaces Westside Rentals, ForRent.com (previously owned by Dominion Enterprises), Cozy Services, Off Campus Partners, and Ten-X; in addition to the hotel research and analytics firm STR, the residential mobile application provider Homesnap. In April 2021, it acquired Homes.com, a prominent residential real-estate website, from Dominion Enterprises for $156 million in cash. In February 2025, CoStar acquired the 3D spatial mapping company Matterport for $1.6 billion. Overseas, its European division acquired the German real-estate business data company Thomas Daily and the Spanish online marketplace and information provider Belbex in 2016. From 2018 through 2023, it acquired the British online marketplace Realla, the German real-estate data company Emporis, the French online marketplace BureauxLocaux, and the British property portal OnTheMarket. After initially taking a 16.9% stake in Australian real estate information company Domain Group, CoStar entered an agreement to acquire 100% of the company for US$1.92 billion in May 2025. Other activities In 2019, CoStar Group announced that Oxford Economics would provide the economic data and forecasts used in its products. The company came under fire in 2022 when Business Insider reported that over 29 current and former employees claimed to have been excessively monitored and micromanaged, including with unscheduled check-in video calls made by the company's IT department, as well as being publicly berated and arbitrarily fired in some cases. The company made efforts to take down criticism of itself on various social media platforms. CoStar Group denied the allegations, contending that the discontent had stemmed from the company's high expectations. In 2024, CoStar Group purchased an estimated $35 million worth of airtime at Super Bowl LVIII for four Super Bowl commercials advertising its subsidiaries Homes.com and Apartments.com, which The New York Times described as an effort to rival competitor services such as Zillow and Realtor.com. CoStar has been criticized for anticompetitive and monopolistic business practices, often using aggressive litigation and \"public-relations warfare\" to \"push [competitors] to the brink of collapse or weaken them enough to make them soft targets for an acquisition\". In February 2024, a proposed consumer class action lawsuit was filed against CoStar in multiple states, accusing the company of a price-fixing conspiracy in which it conspired with a group of luxury hotel chains—including Hilton, Hyatt, Marriott, InterContinental, Loews, and Accor—to keep room rental prices artificially high by sharing competitively sensitive information through the company's STR reports. These allegations were based in part on insider information shared by an STR software engineer. Business CoStar Group provides commercial real estate information, analytics, and online marketplaces for real estate transactions. Its research services include online services and research for the rental home and hotel industry. As of February 2025, its subsidiaries include:"
}