{
  "ticker": "CSX",
  "cik": "0000277948",
  "company_name": "CSX Corporation",
  "corrected_name": "CSX Corporation",
  "wiki_title_used": "CSX Corporation",
  "exists": true,
  "raw_text": "CSX Corporation is an American holding company focused on rail transportation and real estate in North America, among other industries. The company was established in 1980 as part of the Chessie System and Seaboard Coast Line Industries merger. The various railroads of the former Chessie System and Seaboard Coast Line Industries that are now owned by CSX Corporation were eventually merged into a single line in 1986 and it became known as CSX Transportation. CSX Corporation currently has a number of subsidiaries beyond CSX Transportation. Previously based in Richmond, Virginia after the merger, the corporation moved its headquarters to Jacksonville, Florida, in 2003. CSX is a Fortune 500 company.\n\nSubsidiaries and divisions\nCSX Transportation\nCSX Transportation is a Class I railroad operating in the eastern United States and the Canadian provinces of Ontario and Quebec. The railroad operates approximately 21,000 route miles (34,000 km) of track.\nAs of December 30, 2016, CSX Transportation served population centers in 23 states east of the Mississippi River, the District of Columbia and the Canadian provinces of Ontario and Quebec. Also as of that date, it had access to over 70 ocean, river and lake port terminals along the Atlantic and Gulf Coasts, the Mississippi River, the Great Lakes and the St. Lawrence Seaway.\nFollowing a successful merger application to the Surface Transportation Board, CSX Corporation and CSX Transportation acquired Pan Am Railways in 2022, including a 50 percent stake in Pan Am Southern.\n\nConrail\nConrail was the primary Class I railroad in the Northeastern United States between 1976 and 1999. The trade name Conrail is a portmanteau based on the company's legal name (Consolidated Rail Corporation), and while it no longer operates trains it continues to do business as an asset management and network services provider in three Shared Assets Areas that were excluded from the division of its operations during its acquisition by CSX Corporation and the Norfolk Southern Railway.\nThe federal government created Conrail to take over the lines of multiple bankrupt carriers, including the Penn Central Transportation Company and Erie Lackawanna Railway. After railroad regulations were lifted by the 4R Act and the Staggers Act, Conrail began to turn a profit in the 1980s and was privatized in 1987. The two remaining Class I railroads in the East, CSX Transportation and the Norfolk Southern Railway (NS), agreed in 1997 to acquire the system and split it into two roughly-equal parts (alongside three residual shared-assets areas), returning rail freight competition to the Northeast by essentially undoing the 1968 merger of the Pennsylvania Railroad and New York Central Railroad that created Penn Central. Following approval by the Surface Transportation Board, CSX and NS took control in August 1998, and on June 1, 1999, began operating their respective portions of Conrail.\nThe old company remains a jointly owned subsidiary, with CSX and NS owning respectively 42 percent and 58 percent of its stock, corresponding to how much of Conrail's assets they acquired. Each parent, however, has an equal voting interest. The primary asset retained by Conrail is ownership of the three Shared Assets Areas in New Jersey, Philadelphia, and Detroit. Both CSX and NS have the right to serve all shippers in these areas, paying Conrail for the cost of maintaining and improving trackage. They also make use of Conrail to perform switching and terminal services within the areas, but not as a common carrier, since contracts are signed between shippers and CSX or NS. Conrail also retains various support facilities including maintenance-of-way and training, as well as a 51 percent share in the Indiana Harbor Belt Railroad.\n\nWinston-Salem Southbound Railway\nThe Winston-Salem Southbound Railway is a 90-mile (140 km) short-line railroad jointly held by CSX Transportation and the Norfolk Southern Railway, which provides it with equipment. It connects with Norfolk Southern at the north end in Winston-Salem, CSX at the south end in Wadesboro, and in between with NS at Lexington and Whitney, the subsidiary High Point, Thomasville and Denton Railroad at High Rock, and the Aberdeen, Carolina and Western Railway at Norwood. Originally owned jointly by the Atlantic Coast Line Railroad and Norfolk and Western Railway, predecessors to CSX and NS, it was completed in November 1910.\nCommodities commonly carried by the railroad are grain, sand, gravel, stone, forest products, paper products, coal, coke, cement, clay fertilizer, aluminum, chemicals, iron, and steel. Its principal shippers are Corn Products Company of Winston-Salem, a manufacturer of corn syrup and related products, and Owens Brockway Glass Company of Eller, a manufacturer of glass products.\n\nP&L Transportation, Inc.\nFormerly Four Rivers Transportation, Inc., P&L is based in Wilmington, Delaware. It is a railroad holding company in the United States. It is jointly owned by the management of the P&L Railway, as well as CSX Corporation, the latter of which holds a majority.\n\nGeographic divisions\nCSX is organized into two operating regions: the West Region and the East Region. Each primary region is divided into two sub-regions:\n\nEast\nNortheast Region, based in Baltimore, Maryland\nSouth Region, based in Waycross, Georgia\n\nWest\nMidwest Region, based in Cincinnati, Ohio\nSouthwest Region, based in Nashville, Tennessee\n\nOther subsidiaries\nPan Am Railways\nFruit Growers Express\nCSX Intermodal Terminals\nCSX Real Property\nCSX Technology\nChessie Computer Service\nCybernetics & Services\nTotal Distribution Services\nTRANSFLO Corporation\nCSX de Mexico\nPowerhouse Logistics\n\nHistory\nCSX Corporation was organized on November 14, 1978, as a vehicle for the future merger of Chessie System and Seaboard Coast Line Industries. On November 1, 1980, following Interstate Commerce Commission (ICC) approval, CSX Corporation officially came into being as the successor of Chessie System and Seaboard Coast Line Industries.\nOne of the first issues the new railroad grappled with was the choice of name. Chessie and SCLI leadership agreed that, as a merger of equals, neither of the existing names could be used. A call for suggestions went out to employees of both railroads, who responded with a wide variety of initialisms combining C and S in some form. At the same time, the two companies' lawyers needed a name to use as part of their proceedings with the ICC. \"CSC\" was chosen but belonged to a trucking company in Virginia. \"CSM\" (for \"Chessie-Seaboard Merger\") was also taken. Needing some sort of identifier for the new railroad, the lawyers decided to use \"CSX\", and the name stuck, despite only being intended as a placeholder. In the public announcement, it was said that \"CSX is singularly appropriate. C can stand for Chessie, S for Seaboard and X, the multiplication symbol, means that together we are so much more.\" However, an August 9, 2016, article on the Railway Age website stated that \" ... the 'X' was for 'Consolidated' \". A fourth letter had to be added to CSX when used as a reporting mark because reporting marks that end in X mean that the car is owned by a leasing company or private car owner. Chessie's public relations staff drafted a number of possible logos for the new railroad, but continued to strike out until it was suggested to combine the letters \"C\" and \"S\" in the shape of an X.\nThe company introduced its current slogan, \"How Tomorrow Moves\", in 2008.\nCSX Corporation sold two-thirds of its control of water transport company American Commercial Barge Line in 1998, citing a desire to focus more on rail operations.\nThe founding chairman of CSX Corporation was Prime F. Osborn III of Seaboard, for whom Jacksonville's Prime F. Osborn III Convention Center is named. The first CEO and second chairman was Hays T. Watkins Jr. of Chessie. Watkins was succeeded by John W. Snow as CEO in 1989 and as chairman in 1991. When Snow left the company in 2003 to become United States Secretary of the Treasury, Michael J. Ward, who then headed CSX Transportation, was promoted to succeed him. Overall in 2003, Ward took on the positions of chairman, president, and  CEO. When president Oscar Munoz left CSX in September 2015 after obtaining the role earlier that year from Ward, the company underwent several management changes, with Clarence Gooden appointed president.\nThe company went through major leadership changes in 2017 when activist investor Mantle Ridge, a hedge fund that held 4.9% of CSX's stock, demanded a change in the board, that Michael Ward step down as CEO, that the company cut middle management, and that the company hire Hunter Harrison, known for leading the turnaround three other railroads, as CEO.  Within months of Harrison's hiring in spring 2017, several members of CSX's executive management team stepped down. Harrison died on December 16, 2017, and shortly thereafter Chief Operating Officer James M. Foote was named president and chief executive officer.\nIn March 2018, Foote, said CSX would follow-through on Harrison's plans to transform the company and move it from a traditional railroad model to a scheduled railroad model in order to reduce costs and improve the quality of service. Part of this effort includes reducing the number of locomotives in service from 3,000 in late 2017 to between 2,370 and 2,420 in 2020. The company also plans to reduce the number of rail cars it owns from 136,000 in late 2017 to between 104,000 and 109,000 in 2020. In 2017, CSX cut its workforce by 3,300 employees. In 2018, roughly 2,200 jobs were cut. A further reduction of 4,000 positions is planned by 2020. CSX estimates that after these cuts it will have a workforce of about 21,000 people.\nCSX is also trying to increase profits by monetizing some of its real estate. As of early 2018, the company planned to generate $800 million by 2020 by selling off some railroad lines and other real estate. As of the same date, CSX held real estate in 23 states, the District of Columbia, and two Canadian provinces.\n\nOfficers\nPresidents\nHays T. (Thomas) Watkins Jr. (1980 – April 1989)\nJohn W. Snow (April 1989 – 2003)\nMichael J. Ward (2000 – 2015)\nOscar Munoz (February 11, 2015 – )\nClarence W. Gooden ( – May 31, 2017)\nFredrik J. Eliasson (February 15, 2017 – )\nE. Hunter Harrison ( – December 16, 2017)\nJames M. Foote (Acting: December 16, 2017 – December 22, 2017, Full: December 22, 2017 – September 26, 2022)\nJoseph R. Hinrichs (September 26, 2022 – September 2025)\nSteve Angel (September 2025 – present)\n\nChief executive officers\nJohn W. Snow (April 1989 – 2003)\nPeter Carpenter (1992 – 1999)\nMichael J. Ward ( – February 21, 2017)\nE. Hunter Harrison (March 6, 2017 – December 16, 2017)\nJames M. Foote (December 22, 2017 – September 26, 2022)\nJoseph R. Hinrichs (September 26, 2022 – September 2025)\nSteve Angel (September 2025 – present)\n\nChairmen of the board of directors\nPrime F. Osborn III (1980 – 1982)\nHays T. Watkins Jr. (1982 – January 31, 1991)\nJohn W. Snow (January 31, 1991 – 2003)\nMichael J. Ward (2003 – February 21, 2017)\nEdward J. Kelly, III (2017 – January 2019)\nJohn J. Zillmer (January 2019 – present)\n\nLeadership\nThe following is a list of CSX management as of September 2025:\n\nJohn J. Zillmer, chairman of the board of directors\nSteve Angel, president and chief executive officer\nSean Pelkey, executive vice president and chief financial officer\nKevin Boone, executive vice president of sales and marketing\nMike Cory, executive vice president of operations\nNathan D. Goldman, executive vice president, chief legal officer and corporate secretary\nDiana Sorfleet, executive vice president and chief administrative officer\nSteve Fortune, executive vice president and chief digital and technology officer\n\nFinances\nAt the end of 2018, CSX Corporation's total shareholder's equity was reported as US$12.58 billion and total assets were valued at $36.729 billion. Total revenue for 2018 was $12.25 billion, an increase from $11.408 billion the previous year. Operating income was $4.869 billion, up from $3.72 billion in 2017, while earnings before income taxes were $4.304 billion, compared to $3.142 billion the previous year.\nAs of 2019, CSX Corporation was a Fortune 500 company.\n\nHeadquarters\nThe CSX Transportation Building is a 251 feet (77 meters) high-rise office building in  Jacksonville, Florida. Completed in 1960, the building currently serves as headquarters for CSX Corporation. The building is located in the Northbank area of Downtown Jacksonville, along the banks of the St. Johns River. Its former names include the Atlantic Coast Line Building  and  the Seaboard Coastline Railroad Building. Designed by KBJ Architects, the CSX Transportation Building is a LEED certified building and an example of mid-century modern and international style architecture.\n\nSee also\nHistory of railroads in Michigan\nList of CSX Transportation lines\nList of CSX Transportation predecessor railroads\nRailex (refrigerated rail service - CSX and Union Pacific Railroad)\n\nReferences\nSolomon, Brian (2005). CSX. Saint Paul, MN: MBI Publishing Co. ISBN 978-0-7603-1796-9. OCLC 57641636.\n\nExternal links\n\nOfficial website \nBusiness data for CSX Corporation:",
  "clean_text": "CSX Corporation is an American holding company focused on rail transportation and real estate in North America, among other industries. The company was established in 1980 as part of the Chessie System and Seaboard Coast Line Industries merger. The various railroads of the former Chessie System and Seaboard Coast Line Industries that are now owned by CSX Corporation were eventually merged into a single line in 1986 and it became known as CSX Transportation. CSX Corporation currently has a number of subsidiaries beyond CSX Transportation. Previously based in Richmond, Virginia after the merger, the corporation moved its headquarters to Jacksonville, Florida, in 2003. CSX is a Fortune 500 company. Subsidiaries and divisions CSX Transportation CSX Transportation is a Class I railroad operating in the eastern United States and the Canadian provinces of Ontario and Quebec. The railroad operates approximately 21,000 route miles (34,000 km) of track. As of December 30, 2016, CSX Transportation served population centers in 23 states east of the Mississippi River, the District of Columbia and the Canadian provinces of Ontario and Quebec. Also as of that date, it had access to over 70 ocean, river and lake port terminals along the Atlantic and Gulf Coasts, the Mississippi River, the Great Lakes and the St. Lawrence Seaway. Following a successful merger application to the Surface Transportation Board, CSX Corporation and CSX Transportation acquired Pan Am Railways in 2022, including a 50 percent stake in Pan Am Southern. Conrail Conrail was the primary Class I railroad in the Northeastern United States between 1976 and 1999. The trade name Conrail is a portmanteau based on the company's legal name (Consolidated Rail Corporation), and while it no longer operates trains it continues to do business as an asset management and network services provider in three Shared Assets Areas that were excluded from the division of its operations during its acquisition by CSX Corporation and the Norfolk Southern Railway. The federal government created Conrail to take over the lines of multiple bankrupt carriers, including the Penn Central Transportation Company and Erie Lackawanna Railway. After railroad regulations were lifted by the 4R Act and the Staggers Act, Conrail began to turn a profit in the 1980s and was privatized in 1987. The two remaining Class I railroads in the East, CSX Transportation and the Norfolk Southern Railway (NS), agreed in 1997 to acquire the system and split it into two roughly-equal parts (alongside three residual shared-assets areas), returning rail freight competition to the Northeast by essentially undoing the 1968 merger of the Pennsylvania Railroad and New York Central Railroad that created Penn Central. Following approval by the Surface Transportation Board, CSX and NS took control in August 1998, and on June 1, 1999, began operating their respective portions of Conrail. The old company remains a jointly owned subsidiary, with CSX and NS owning respectively 42 percent and 58 percent of its stock, corresponding to how much of Conrail's assets they acquired. Each parent, however, has an equal voting interest. The primary asset retained by Conrail is ownership of the three Shared Assets Areas in New Jersey, Philadelphia, and Detroit. Both CSX and NS have the right to serve all shippers in these areas, paying Conrail for the cost of maintaining and improving trackage. They also make use of Conrail to perform switching and terminal services within the areas, but not as a common carrier, since contracts are signed between shippers and CSX or NS. Conrail also retains various support facilities including maintenance-of-way and training, as well as a 51 percent share in the Indiana Harbor Belt Railroad. Winston-Salem Southbound Railway The Winston-Salem Southbound Railway is a 90-mile (140 km) short-line railroad jointly held by CSX Transportation and the Norfolk Southern Railway, which provides it with equipment. It connects with Norfolk Southern at the north end in Winston-Salem, CSX at the south end in Wadesboro, and in between with NS at Lexington and Whitney, the subsidiary High Point, Thomasville and Denton Railroad at High Rock, and the Aberdeen, Carolina and Western Railway at Norwood. Originally owned jointly by the Atlantic Coast Line Railroad and Norfolk and Western Railway, predecessors to CSX and NS, it was completed in November 1910. Commodities commonly carried by the railroad are grain, sand, gravel, stone, forest products, paper products, coal, coke, cement, clay fertilizer, aluminum, chemicals, iron, and steel. Its principal shippers are Corn Products Company of Winston-Salem, a manufacturer of corn syrup and related products, and Owens Brockway Glass Company of Eller, a manufacturer of glass products. P&L Transportation, Inc. Formerly Four Rivers Transportation, Inc., P&L is based in Wilmington, Delaware. It is a railroad holding company in the United States. It is jointly owned by the management of the P&L Railway, as well as CSX Corporation, the latter of which holds a majority. Geographic divisions CSX is organized into two operating regions: the West Region and the East Region. Each primary region is divided into two sub-regions: East Northeast Region, based in Baltimore, Maryland South Region, based in Waycross, Georgia West Midwest Region, based in Cincinnati, Ohio Southwest Region, based in Nashville, Tennessee Other subsidiaries Pan Am Railways Fruit Growers Express CSX Intermodal Terminals CSX Real Property CSX Technology Chessie Computer Service Cybernetics & Services Total Distribution Services TRANSFLO Corporation CSX de Mexico Powerhouse Logistics History CSX Corporation was organized on November 14, 1978, as a vehicle for the future merger of Chessie System and Seaboard Coast Line Industries. On November 1, 1980, following Interstate Commerce Commission (ICC) approval, CSX Corporation officially came into being as the successor of Chessie System and Seaboard Coast Line Industries. One of the first issues the new railroad grappled with was the choice of name. Chessie and SCLI leadership agreed that, as a merger of equals, neither of the existing names could be used. A call for suggestions went out to employees of both railroads, who responded with a wide variety of initialisms combining C and S in some form. At the same time, the two companies' lawyers needed a name to use as part of their proceedings with the ICC. \"CSC\" was chosen but belonged to a trucking company in Virginia. \"CSM\" (for \"Chessie-Seaboard Merger\") was also taken. Needing some sort of identifier for the new railroad, the lawyers decided to use \"CSX\", and the name stuck, despite only being intended as a placeholder. In the public announcement, it was said that \"CSX is singularly appropriate. C can stand for Chessie, S for Seaboard and X, the multiplication symbol, means that together we are so much more.\" However, an August 9, 2016, article on the Railway Age website stated that \" ... the 'X' was for 'Consolidated' \". A fourth letter had to be added to CSX when used as a reporting mark because reporting marks that end in X mean that the car is owned by a leasing company or private car owner. Chessie's public relations staff drafted a number of possible logos for the new railroad, but continued to strike out until it was suggested to combine the letters \"C\" and \"S\" in the shape of an X. The company introduced its current slogan, \"How Tomorrow Moves\", in 2008. CSX Corporation sold two-thirds of its control of water transport company American Commercial Barge Line in 1998, citing a desire to focus more on rail operations. The founding chairman of CSX Corporation was Prime F. Osborn III of Seaboard, for whom Jacksonville's Prime F. Osborn III Convention Center is named. The first CEO and second chairman was Hays T. Watkins Jr. of Chessie. Watkins was succeeded by John W. Snow as CEO in 1989 and as chairman in 1991. When Snow left the company in 2003 to become United States Secretary of the Treasury, Michael J. Ward, who then headed CSX Transportation, was promoted to succeed him. Overall in 2003, Ward took on the positions of chairman, president, and CEO. When president Oscar Munoz left CSX in September 2015 after obtaining the role earlier that year from Ward, the company underwent several management changes, with Clarence Gooden appointed president. The company went through major leadership changes in 2017 when activist investor Mantle Ridge, a hedge fund that held 4.9% of CSX's stock, demanded a change in the board, that Michael Ward step down as CEO, that the company cut middle management, and that the company hire Hunter Harrison, known for leading the turnaround three other railroads, as CEO. Within months of Harrison's hiring in spring 2017, several members of CSX's executive management team stepped down. Harrison died on December 16, 2017, and shortly thereafter Chief Operating Officer James M. Foote was named president and chief executive officer. In March 2018, Foote, said CSX would follow-through on Harrison's plans to transform the company and move it from a traditional railroad model to a scheduled railroad model in order to reduce costs and improve the quality of service. Part of this effort includes reducing the number of locomotives in service from 3,000 in late 2017 to between 2,370 and 2,420 in 2020. The company also plans to reduce the number of rail cars it owns from 136,000 in late 2017 to between 104,000 and 109,000 in 2020. In 2017, CSX cut its workforce by 3,300 employees. In 2018, roughly 2,200 jobs were cut. A further reduction of 4,000 positions is planned by 2020. CSX estimates that after these cuts it will have a workforce of about 21,000 people. CSX is also trying to increase profits by monetizing some of its real estate. As of early 2018, the company planned to generate $800 million by 2020 by selling off some railroad lines and other real estate. As of the same date, CSX held real estate in 23 states, the District of Columbia, and two Canadian provinces. Officers Presidents Hays T. (Thomas) Watkins Jr. (1980 – April 1989) John W. Snow (April 1989 – 2003) Michael J. Ward (2000 – 2015) Oscar Munoz (February 11, 2015 – ) Clarence W. Gooden ( – May 31, 2017) Fredrik J. Eliasson (February 15, 2017 – ) E. Hunter Harrison ( – December 16, 2017) James M. Foote (Acting: December 16, 2017 – December 22, 2017, Full: December 22, 2017 – September 26, 2022) Joseph R. Hinrichs (September 26, 2022 – September 2025) Steve Angel (September 2025 – present) Chief executive officers John W. Snow (April 1989 – 2003) Peter Carpenter (1992 – 1999) Michael J. Ward ( – February 21, 2017) E. Hunter Harrison (March 6, 2017 – December 16, 2017) James M. Foote (December 22, 2017 – September 26, 2022) Joseph R. Hinrichs (September 26, 2022 – September 2025) Steve Angel (September 2025 – present) Chairmen of the board of directors Prime F. Osborn III (1980 – 1982) Hays T. Watkins Jr. (1982 – January 31, 1991) John W. Snow (January 31, 1991 – 2003) Michael J. Ward (2003 – February 21, 2017) Edward J. Kelly, III (2017 – January 2019) John J. Zillmer (January 2019 – present) Leadership The following is a list of CSX management as of September 2025: John J. Zillmer, chairman of the board of directors Steve Angel, president and chief executive officer Sean Pelkey, executive vice president and chief financial officer Kevin Boone, executive vice president of sales and marketing Mike Cory, executive vice president of operations Nathan D. Goldman, executive vice president, chief legal officer and corporate secretary Diana Sorfleet, executive vice president and chief administrative officer Steve Fortune, executive vice president and chief digital and technology officer Finances At the end of 2018, CSX Corporation's total shareholder's equity was reported as US$12.58 billion and total assets were valued at $36.729 billion. Total revenue for 2018 was $12.25 billion, an increase from $11.408 billion the previous year. Operating income was $4.869 billion, up from $3.72 billion in 2017, while earnings before income taxes were $4.304 billion, compared to $3.142 billion the previous year. As of 2019, CSX Corporation was a Fortune 500 company. Headquarters The CSX Transportation Building is a 251 feet (77 meters) high-rise office building in Jacksonville, Florida. Completed in 1960, the building currently serves as headquarters for CSX Corporation. The building is located in the Northbank area of Downtown Jacksonville, along the banks of the St. Johns River. Its former names include the Atlantic Coast Line Building and the Seaboard Coastline Railroad Building. Designed by KBJ Architects, the CSX Transportation Building is a LEED certified building and an example of mid-century modern and international style architecture."
}