{
  "ticker": "CTAS",
  "cik": "0000723254",
  "company_name": "Cintas",
  "corrected_name": "Cintas",
  "wiki_title_used": "Cintas",
  "exists": true,
  "raw_text": "Cintas Corporation () is an American corporation headquartered in Mason, Ohio, which provides a range of products and services to businesses including uniforms, mats, mops, cleaning and restroom supplies, first aid and safety products, fire extinguishers and testing, and safety courses. Cintas is a publicly held company traded on the Nasdaq Global Select Market under the symbol CTAS and is a component of the S&P 500 Index.\nThe company is one of the largest in the industry with 44,500 employees in 2023. In 2020, the company reported $7.09 billion in total revenue.\n\nHistory\nEarly company years\nCintas Corporation began in 1929 as the Acme Industrial Laundry Company by Richard (Doc) Farmer and Amelia Farmer. They collected old, used rags from factories, laundered them, and sold them back to businesses. In the early 1940s, Doc's son Hershell, took over and replaced the old rags with shop towels, becoming a service company. By then, the company's name had changed to Acme Wiper and Industrial Laundry.\nHershell's son, Richard \"Dick\" Farmer, joined the family business in 1957 after graduating from Miami University in Oxford, Ohio. Acme had just 12 employees at the time. In 1959, Hershell handed the business over to Dick, allowing him to expand into uniform rental. The company became Acme Uniform and Towel Supply in 1964. Dick worked with Celanese Corporation, Graniteville, and Redkap to develop a 65/35 Polycotton fabric blend. In 1968, Dick Farmer founded the Satellite Corporation. He opened the first location in Cleveland and the companies merged in 1970. In 1972, the company changed its name to Cintas and then went public in 1983.\nCintas expanded its uniform services into Canada with the acquisition of Cadet Uniform Service Ltd in 1995. Bob Kohlhepp became CEO in 1996, while Dick Farmer became chairman of the board. In 1997, Cintas entered the First Aid & Safety business. In July 1998, Dick Farmer's son Scott Farmer, who has been employed at the company since 1981, became president and chief operating officer.\n\n2000s to present\nIn 2002, Cintas acquired a number of companies, including uniform rental company Omni Services, and first-aid companies Petragon, American First Aid, and Respond Industries. Cintas has hosted an annual America's Best Restroom® Contest since 2002.\nIn 2003, Cintas acquired Kamp Fire Equipment, a distributor of fire safety products and services.\nUNITE HERE was the subject of a ruling that was subsequently upheld by the U.S. Court of Appeals for the Third Circuit. The court ruled that the labor union violated the privacy of thousands of Cintas employees in Pennsylvania, by illegally obtaining their license plate numbers in order to access their home addresses and other personal information.\nAnother investigation involved the March 2007 death of a Tulsa, Oklahoma employee. Both unions and several Members of Congress called for stricter health and safety standards at Cintas laundry facilities.\nPhillip Holloman became president and COO in 2008. Dick Farmer then became chairman emeritus, and Bob Kohlhepp became chairman of the board.\nIn 2015, Cintas acquired Zee Medical from McKesson Corporation for approximately $130 million.\nIn 2016, CEO Scott Farmer became chairman of the board.\nIn 2017, Cintas made their largest acquisition with G&K Services for $2.2 billion.\nCintas has been included on the Fortune 500 list six years in a row, in 2018, 2019, 2020, 2021, 2022, and 2023.\nIn 2021, Scott Farmer retired as CEO, retaining his position as executive chairman. Todd Schneider, former executive vice president and COO, was selected to replace Farmer.\nOn August 5, 2021, founder Dick Farmer died.\nIn January 2025, Cintas announced plans to acquire UniFirst Corporation after repeated rejections, first dating back to February 2022. Discussions ceased in March after disagreements about the proposal.\n\nAcquisition history\nSee also\nCompanies portal\n\nReferences\nExternal links\nOfficial website\nBusiness data for Cintas Corporation:",
  "clean_text": "Cintas Corporation () is an American corporation headquartered in Mason, Ohio, which provides a range of products and services to businesses including uniforms, mats, mops, cleaning and restroom supplies, first aid and safety products, fire extinguishers and testing, and safety courses. Cintas is a publicly held company traded on the Nasdaq Global Select Market under the symbol CTAS and is a component of the S&P 500 Index. The company is one of the largest in the industry with 44,500 employees in 2023. In 2020, the company reported $7.09 billion in total revenue. History Early company years Cintas Corporation began in 1929 as the Acme Industrial Laundry Company by Richard (Doc) Farmer and Amelia Farmer. They collected old, used rags from factories, laundered them, and sold them back to businesses. In the early 1940s, Doc's son Hershell, took over and replaced the old rags with shop towels, becoming a service company. By then, the company's name had changed to Acme Wiper and Industrial Laundry. Hershell's son, Richard \"Dick\" Farmer, joined the family business in 1957 after graduating from Miami University in Oxford, Ohio. Acme had just 12 employees at the time. In 1959, Hershell handed the business over to Dick, allowing him to expand into uniform rental. The company became Acme Uniform and Towel Supply in 1964. Dick worked with Celanese Corporation, Graniteville, and Redkap to develop a 65/35 Polycotton fabric blend. In 1968, Dick Farmer founded the Satellite Corporation. He opened the first location in Cleveland and the companies merged in 1970. In 1972, the company changed its name to Cintas and then went public in 1983. Cintas expanded its uniform services into Canada with the acquisition of Cadet Uniform Service Ltd in 1995. Bob Kohlhepp became CEO in 1996, while Dick Farmer became chairman of the board. In 1997, Cintas entered the First Aid & Safety business. In July 1998, Dick Farmer's son Scott Farmer, who has been employed at the company since 1981, became president and chief operating officer. 2000s to present In 2002, Cintas acquired a number of companies, including uniform rental company Omni Services, and first-aid companies Petragon, American First Aid, and Respond Industries. Cintas has hosted an annual America's Best Restroom® Contest since 2002. In 2003, Cintas acquired Kamp Fire Equipment, a distributor of fire safety products and services. UNITE HERE was the subject of a ruling that was subsequently upheld by the U.S. Court of Appeals for the Third Circuit. The court ruled that the labor union violated the privacy of thousands of Cintas employees in Pennsylvania, by illegally obtaining their license plate numbers in order to access their home addresses and other personal information. Another investigation involved the March 2007 death of a Tulsa, Oklahoma employee. Both unions and several Members of Congress called for stricter health and safety standards at Cintas laundry facilities. Phillip Holloman became president and COO in 2008. Dick Farmer then became chairman emeritus, and Bob Kohlhepp became chairman of the board. In 2015, Cintas acquired Zee Medical from McKesson Corporation for approximately $130 million. In 2016, CEO Scott Farmer became chairman of the board. In 2017, Cintas made their largest acquisition with G&K Services for $2.2 billion. Cintas has been included on the Fortune 500 list six years in a row, in 2018, 2019, 2020, 2021, 2022, and 2023. In 2021, Scott Farmer retired as CEO, retaining his position as executive chairman. Todd Schneider, former executive vice president and COO, was selected to replace Farmer. On August 5, 2021, founder Dick Farmer died. In January 2025, Cintas announced plans to acquire UniFirst Corporation after repeated rejections, first dating back to February 2022. Discussions ceased in March after disagreements about the proposal. Acquisition history"
}