{
  "ticker": "CTRA",
  "cik": "0000858470",
  "company_name": "Coterra",
  "corrected_name": "Coterra",
  "wiki_title_used": "Coterra",
  "exists": true,
  "raw_text": "Coterra Energy Inc. is an American energy company engaged in hydrocarbon exploration based in Houston, Texas. The company has operations in the Permian Basin, Marcellus Shale, and the Anadarko Basin.\nAs of 31 December 2024, the company had 2,271 million barrels of oil equivalent (1.389×1010 GJ) of estimated proved reserves, of which 85% was natural gas, 7% was petroleum, and 8% was natural gas liquids.\n\nHistory\nThe company was formed as Cabot Oil & Gas Corporation, a subsidiary of Cabot Corporation. It became a public company via an initial public offering in February 1990. In March 1991, the company became 100% publicly owned.\nIn 1994, the company acquired Washington Energy Resources in a $180 million stock transaction.\nIn May 1995, the company ousted John Lollar, its chairman and CEO, in part due to the ill-timing of the acquisition of Washington Energy Resources.\nIn 1997, the company sold oil reserves and land in northwest Pennsylvania for $92.5 million.\nIn 2001, the company acquired Cody Energy for $230 million.\nIn June 2008, the company was added to the S&P 500.\nIn 2013, the company sold its assets in the Marmaton play of Oklahoma and West Texas for $160 million.\nIn March 2018, the company sold its assets in the Eagle Ford Group  to KKR and Venado Oil & Gas.\nIn October 2021, the company acquired Cimarex Energy and was renamed Coterra Energy.\nIn January 2025, the company acquired Franklin Mountain Energy and Avant Natural Resources for a combined $3.9 billion.\n\nControversies\nEnvironmental damage\nIn 2009, the company was cited for violations in regard to spills of toxic hydraulic fracturing fluids in Northeastern Pennsylvania.\nIn 2012, the company was cited for improper well construction that had resulted in polluted drinking water.\n\nRestraining order on anti-fracking activist\nIn January 2014, the company sought, and a judge granted, a temporary injunction barring anti-fracking activist Vera Scroggins from entering on any of the 312.5 square miles of land in Pennsylvania owned or leased by the company. The company acknowledged that Scroggins had not violated any laws, but the lawsuit was due to her being a \"nuisance\" at company sites. In March 2014, the judge narrowed the injunction to prevent Scroggins only from going within 100 feet of an active well pad and 25 feet of an inactive well pad, access road or access road entrance.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Coterra Energy Inc.:",
  "clean_text": "Coterra Energy Inc. is an American energy company engaged in hydrocarbon exploration based in Houston, Texas. The company has operations in the Permian Basin, Marcellus Shale, and the Anadarko Basin. As of 31 December 2024, the company had 2,271 million barrels of oil equivalent (1.389×1010 GJ) of estimated proved reserves, of which 85% was natural gas, 7% was petroleum, and 8% was natural gas liquids. History The company was formed as Cabot Oil & Gas Corporation, a subsidiary of Cabot Corporation. It became a public company via an initial public offering in February 1990. In March 1991, the company became 100% publicly owned. In 1994, the company acquired Washington Energy Resources in a $180 million stock transaction. In May 1995, the company ousted John Lollar, its chairman and CEO, in part due to the ill-timing of the acquisition of Washington Energy Resources. In 1997, the company sold oil reserves and land in northwest Pennsylvania for $92.5 million. In 2001, the company acquired Cody Energy for $230 million. In June 2008, the company was added to the S&P 500. In 2013, the company sold its assets in the Marmaton play of Oklahoma and West Texas for $160 million. In March 2018, the company sold its assets in the Eagle Ford Group to KKR and Venado Oil & Gas. In October 2021, the company acquired Cimarex Energy and was renamed Coterra Energy. In January 2025, the company acquired Franklin Mountain Energy and Avant Natural Resources for a combined $3.9 billion. Controversies Environmental damage In 2009, the company was cited for violations in regard to spills of toxic hydraulic fracturing fluids in Northeastern Pennsylvania. In 2012, the company was cited for improper well construction that had resulted in polluted drinking water. Restraining order on anti-fracking activist In January 2014, the company sought, and a judge granted, a temporary injunction barring anti-fracking activist Vera Scroggins from entering on any of the 312.5 square miles of land in Pennsylvania owned or leased by the company. The company acknowledged that Scroggins had not violated any laws, but the lawsuit was due to her being a \"nuisance\" at company sites. In March 2014, the judge narrowed the injunction to prevent Scroggins only from going within 100 feet of an active well pad and 25 feet of an inactive well pad, access road or access road entrance."
}