{
  "ticker": "CTVA",
  "cik": "0001755672",
  "company_name": "Corteva",
  "corrected_name": "Corteva",
  "wiki_title_used": "Corteva",
  "exists": true,
  "raw_text": "Corteva, Inc. (also known as Corteva Agriscience) is an American company devoted to products for seeds and crop protection, including herbicides, insecticides, fungicides, and biologicals (natural herbicides) that are sold in 110 countries.  The company's name combines \"cor\" (Latin for \"heart\") with \"teva\" (an ancient word for nature). It is headquartered in Indianapolis, Indiana. Corteva sells a large portion of their seeds under the Pioneer Hi-Bred International brand.\n\nHistory\nThe company was formed in March 2018 as a subsidiary of DowDuPont. In June 2019, DowDuPont completed the corporate spin-off of the company and Corteva became a public company.\nIn February 2020, Corteva ceased production of the pesticide chlorpyrifos due to declining sales after the product was linked to neurological problems in children and following bans in the European Union and some US states.\nIn March 2023, the company acquired Stoller Group, a maker of natural pesticides for $1.2 billion. It also acquired Symborg, an expert in microbiological technologies based in Murcia, Spain. This was part of an overall strategy to grow and strengthen an emerging biologicals product porfolio. \nIn November 2024, the company partnered with BP to develop a low carbon intensive bio-feedstock for the production of aviation biofuel. \nAlso in November 2024, the company acquired the naming rights to the Indiana Farmers Coliseum at the Indiana State Fairgrounds.\nIn 2025, the company introduced Forcivo, a fungicide for corn and soybeans containing flutriafol, azoxystrobin, and fluindapyr and targeting tar spot, southern rust, and frogeye leaf spot.\nIn September 2025, the Wall Street Journal reported the company was exploring a breakup that would separate its seed and pesticide businesses.\n\nLegal issues\nIn July 2020, a U.S. appeals court ruled that Corteva can continue to sell Enlist Duo, which contains 2,4-D choline and glyphosate, after environmentalists attempted to block sales of the chemical due to its claimed negative effects on plants and wildlife. However, the court ruled that the U.S. Environmental Protection Agency properly relied on studies that showed that the volatility of 2,4-D choline salt will not cause unreasonable harm to the environment.\nIn August 2022, Bayer sued Corteva for breach of contractual obligations related to the development and commercialization of E3 soybeans. Corteva then sued Bayer, alleging that Bayer infringed upon its patents on a gene used in Enlist Corn, which is resistant to herbicides such as Roundup. In May 2025, the case was paused until the US Supreme Court considers whether to take up a separate patent-related case.\nIn September 2022, the Federal Trade Commission sued Syngenta and Corteva, challenging certain US-based discount programs that allegedly block and restrict generic competition from pesticide markets. In January 2024, a federal judge denied a motion to dismiss the lawsuit.\n\nCriticism\nIn March 2019, Corteva was criticised by the Humane Society of the United States for commissioning Charles River Laboratories to test its new fungicide on 36 beagles. Corteva argued that such testing is required by regulatory authorities but then agreed to stop the tests and release the animals to Michigan Humane for adoption.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Corteva, Inc.:",
  "clean_text": "Corteva, Inc. (also known as Corteva Agriscience) is an American company devoted to products for seeds and crop protection, including herbicides, insecticides, fungicides, and biologicals (natural herbicides) that are sold in 110 countries. The company's name combines \"cor\" (Latin for \"heart\") with \"teva\" (an ancient word for nature). It is headquartered in Indianapolis, Indiana. Corteva sells a large portion of their seeds under the Pioneer Hi-Bred International brand. History The company was formed in March 2018 as a subsidiary of DowDuPont. In June 2019, DowDuPont completed the corporate spin-off of the company and Corteva became a public company. In February 2020, Corteva ceased production of the pesticide chlorpyrifos due to declining sales after the product was linked to neurological problems in children and following bans in the European Union and some US states. In March 2023, the company acquired Stoller Group, a maker of natural pesticides for $1.2 billion. It also acquired Symborg, an expert in microbiological technologies based in Murcia, Spain. This was part of an overall strategy to grow and strengthen an emerging biologicals product porfolio. In November 2024, the company partnered with BP to develop a low carbon intensive bio-feedstock for the production of aviation biofuel. Also in November 2024, the company acquired the naming rights to the Indiana Farmers Coliseum at the Indiana State Fairgrounds. In 2025, the company introduced Forcivo, a fungicide for corn and soybeans containing flutriafol, azoxystrobin, and fluindapyr and targeting tar spot, southern rust, and frogeye leaf spot. In September 2025, the Wall Street Journal reported the company was exploring a breakup that would separate its seed and pesticide businesses. Legal issues In July 2020, a U.S. appeals court ruled that Corteva can continue to sell Enlist Duo, which contains 2,4-D choline and glyphosate, after environmentalists attempted to block sales of the chemical due to its claimed negative effects on plants and wildlife. However, the court ruled that the U.S. Environmental Protection Agency properly relied on studies that showed that the volatility of 2,4-D choline salt will not cause unreasonable harm to the environment. In August 2022, Bayer sued Corteva for breach of contractual obligations related to the development and commercialization of E3 soybeans. Corteva then sued Bayer, alleging that Bayer infringed upon its patents on a gene used in Enlist Corn, which is resistant to herbicides such as Roundup. In May 2025, the case was paused until the US Supreme Court considers whether to take up a separate patent-related case. In September 2022, the Federal Trade Commission sued Syngenta and Corteva, challenging certain US-based discount programs that allegedly block and restrict generic competition from pesticide markets. In January 2024, a federal judge denied a motion to dismiss the lawsuit. Criticism In March 2019, Corteva was criticised by the Humane Society of the United States for commissioning Charles River Laboratories to test its new fungicide on 36 beagles. Corteva argued that such testing is required by regulatory authorities but then agreed to stop the tests and release the animals to Michigan Humane for adoption."
}