{
  "ticker": "CVX",
  "cik": "0000093410",
  "company_name": "Chevron Corporation",
  "corrected_name": "Chevron Corporation",
  "wiki_title_used": "Chevron Corporation",
  "exists": true,
  "raw_text": "Chevron Corporation is an American multinational energy corporation predominantly specializing in oil and gas. The second-largest direct descendant of Standard Oil, and originally known as the Standard Oil Company of California (shortened to Socal or CalSo), it is active in more than 180 countries. Within oil and gas, Chevron is vertically integrated and is involved in hydrocarbon exploration, production, refining, marketing and transport, chemicals manufacturing and sales, and power generation.\nFounded originally in Southern California during the 1870s, the company was then based for many decades in San Francisco, California, before moving its corporate offices to San Ramon, California, in 2001; on August 2, 2024, Chevron announced that it would be transferring its headquarters to Houston, Texas.\nChevron traces its history back to the second half of the 19th century to small California-based oil companies which were acquired by Standard and merged into Standard Oil of California. The company grew quickly on its own after the breakup of Standard Oil by continuing to acquire companies and partnering with others both inside and outside of California, eventually becoming one of the Seven Sisters that dominated the global petroleum industry from the mid-1940s to the 1970s.\nIn 1985, Socal merged with the Pittsburgh-based Gulf Oil and rebranded as Chevron; the newly merged company later merged with Texaco in 2001. Chevron manufactures and sells fuels, lubricants, additives, and petrochemicals, primarily in Western North America,  the US Gulf Coast, Southeast Asia, South Korea and Australia. In 2018, the company produced an average of 791,000 barrels (125,800 m3) of net oil-equivalent per day in United States.\nChevron is one of the largest companies in the world and the second-largest oil company based in the United States by revenue, only behind fellow Standard Oil descendant ExxonMobil. Chevron ranked 10th on the Fortune 500 in 2023. The company is also the last-remaining oil-and-gas component of the Dow Jones Industrial Average since ExxonMobil's exit from the index in 2020.\nChevron has been subject to numerous controversies.\n\nHistory\nPredecessors\nStar Oil and Pacific Coast Oil Company\nOne of Chevron's early predecessors, \"Star Oil\", discovered oil at the Pico Canyon Oilfield in the Santa Susana Mountains north of Los Angeles in 1876. The 25 barrels of oil per day well marked the discovery of the Newhall Field, and is considered by geophysicist Marius Vassiliou as the beginning of the modern oil industry in California. Energy analyst Antonia Juhasz has said that while Star Oil's founders were influential in establishing an oil industry in California, Union Mattole Company discovered oil in the state eleven years prior.\nIn September 1879, Charles N. Felton, Lloyd Tevis, George Loomis and others created the \"Pacific Coast Oil Company\", which acquired the assets of Star Oil with $1 million in funding. Pacific Coast Oil eventually became the largest oil interest in California, and in 1900, John D. Rockefeller's Standard Oil acquired Pacific Coast Oil  for $761,000. In 1906, the Pacific Coast acquired the business operations and assets of the Standard Oil Company (Iowa). At this time, Pacific renamed itself the Standard Oil Company (California).\n\nTexaco\nSince the acquisition of the Pacific Coast Oil Company by Standard Oil, the Standard descendant had traditionally worked closely with Texaco for 100 years, before acquiring Texaco outright in 2001. Originally known as the Texas Fuel Company (later the Texas Company), Texaco was founded in Beaumont, Texas,  as an oil-equipment vendor by \"Buckskin Joe\". The founder's nickname came from being harsh and aggressive. Texas Fuel worked closely with Chevron. In 1936, it formed a joint venture with California Standard named Caltex, to drill and produce oil in Saudi Arabia. According to energy analyst and activist shareholder Antonia Juhasz, the Texas Fuel Company and California Standard were often referred to as the \"terrible twins\" for their cutthroat business practices.\n\nFormation of the Chevron name\nIn 1911, the federal government broke Standard Oil into several pieces under the Sherman Antitrust Act. One of those pieces, Standard Oil Co. (California), went on to become Chevron. It became part of the \"Seven Sisters\", which dominated the world oil industry in the early 20th century. In 1926, the company changed its name to Standard Oil Co. of California (SOCAL). By the terms of the breakup of Standard Oil, at first Standard of California could use the Standard name only within its original geographic area of the Pacific coast states, plus Nevada and Arizona; outside that area, it had to use another name.\nToday, Chevron is the owner of the Standard Oil trademark in 16 states in the western and southeastern United States. Since American trademark law operates under a use-it-or-lose-it rule, the company owns and operates one Standard-branded Chevron station in each state of the area.  However, though Chevron (as CalSo) acquired Kyso in the 1960s, its status in Kentucky is unclear after Chevron withdrew its brand from retail sales from Kentucky in July 2010.\nThe 'Chevron' name came into use for some of its retail products in the 1930s. The name \"Calso\" was also used from 1946 to 1955, in states outside its native West Coast territory.\nStandard Oil Company of California ranked 75th among United States corporations in the value of World War II military production contracts.\nIn 1933, Saudi Arabia granted California Standard a concession to find oil, which led to the discovery of oil in 1938. In 1948, California Standard discovered the world's largest oil field in Saudi Arabia, Ghawar Field. California Standard's subsidiary, California-Arabian Standard Oil Company, grew over the years and became the Arabian American Oil Company (ARAMCO) in 1944. In 1973, the Saudi government began buying into ARAMCO. By 1980, the company was entirely owned by the Saudis, and in 1988, its name was changed to Saudi Arabian Oil Company—Saudi Aramco.\nStandard Oil of California and Gulf Oil merged in 1984, which was the largest merger in history at that time. To comply with U.S. antitrust law, California Standard divested many of Gulf's operating subsidiaries, and sold some Gulf stations in the eastern United States and a Philadelphia refinery which has since closed.  Among the assets sold off were Gulf's retail outlets in Gulf's home market of Pittsburgh, where Chevron lacks a retail presence but does retain a regional headquarters there as of 2013, partially for Marcellus Shale-related drilling. The same year, Standard Oil of California also took the opportunity to change its legal name to Chevron Corporation, since it had already been using the well-known \"Chevron\" retail brand name for decades. Chevron would sell the Gulf Oil trademarks for the entire U.S. to Cumberland Farms, the parent company of Gulf Oil LP, in 2010 after Cumberland Farms had a license to the Gulf trademark in the Northeastern United States since 1986.\nIn 1996, Chevron transferred its natural gas gathering, operating and marketing operation to NGC Corporation (later Dynegy) in exchange for a roughly 25% equity stake in NGC. In a merger completed February 1, 2000, Illinova Corp. became a wholly owned subsidiary of Dynegy Inc. and Chevron's stake increased up to 28%. However, in May 2007, Chevron sold its stake in the company for approximately $985 million, resulting in a gain of $680 million.\n\nAcquisitions and diversification\n2000s\nThe early 2000s saw Chevron engage in many mergers, acquisitions, and sales, the first largest of which was the $45 billion acquisition of Texaco, announced on October 15, 2000. The acquisition created the second-largest oil company in the United States and the world's fourth-largest publicly traded oil company with a combined market value of approximately $95 billion. Completed on October 9, 2001, Chevron temporarily renamed itself to ChevronTexaco between 2001 and 2005; after the company reverted its name to Chevron, Texaco became used as a brand by the company for some of its fueling stations.\n2005 also saw Chevron purchase Unocal Corporation for $18.4 billion, increasing the company's petroleum and natural gas reserves by about 15%. Because of Unocal's large South East Asian geothermal operations, Chevron became a large producer of geothermal energy. The deal did not include Unocal's former retail operations including the Union 76 trademark, as it had sold that off to Tosco Corporation in 1997. The 76 brand is owned by Phillips 66, unaffiliated with Chevron.\nChevron and the Los Alamos National Laboratory started a cooperation in 2006, to improve the recovery of hydrocarbons from oil shale by developing a shale oil extraction process named Chevron CRUSH. In 2006, the United States Department of the Interior issued a research, development and demonstration lease for Chevron's demonstration oil shale project on public lands in Colorado's Piceance Basin. In February 2012, Chevron notified the Bureau of Land Management and the Department of Reclamation, Mining and Safety that it intended to divest this lease.\nIn 2008, Chevron Limited, a subsidiary of Chevron, sold its equity distributor business in the UK to GB Oils Limited for £21.9 million.\n\n2010s\nStarting in 2010, Chevron began to reduce its retail footprint and expand in domestic natural gas. In July 2010, Chevron ended retail operations in the Mid-Atlantic United States by removing the Chevron and Texaco names from 1,100 stations.  In 2011, Chevron acquired Pennsylvania-based Atlas Energy Inc. for $3.2 billion in cash and an additional $1.1 billion in existing debt owed by Atlas. Three months later, Chevron acquired drilling and development rights for another 228,000 acres in the Marcellus Shale from Chief Oil & Gas LLC and Tug Hill, Inc. In September 2013, Total S.A. and its joint-venture partner agreed to buy Chevron's retail distribution business in Pakistan for an undisclosed amount.\nIn October 2014, Chevron announced that it would sell a 30 percent holding in its Canadian oil shale holdings to Kuwait's state-owned oil company Kuwait Oil Company for a fee of $1.5 billion. Despite these sales, Chevron continued to explore acquisitions, a trend which had reinvigorated in 2019 and extended throughout the COVID-19 pandemic. In April 2019, Chevron announced its intention to acquire Anadarko Petroleum in a deal valued at $33 billion, but decided to focus on other acquisitions shortly afterwards when a deal could not be reached. Despite the failed acquisition of Anadarko, Chevron did acquire Noble Energy for $5 billion in July 2020.\nChevron sold its North Sea operations in May 2019 to Ithaca Energy for $2 billion.\nChevron was not spared from the pandemic, however, as Chevron announced reductions of 10–15% of its workforce due to both the pandemic and a 2020 oil price war between Russia and Saudi Arabia. During the pandemic, Chevron considered a merger with rival ExxonMobil in 2020 during the early stages of the COVID-19 pandemic that drove oil demand sharply down. It would have been one of the largest corporate mergers in history, and a combined Chevron and ExxonMobil (dubbed \"Chexxon\" by Reuters) would have been the second-largest oil company in the world, trailing only Saudi Aramco.\nLater in the pandemic, Chevron began requiring some employees, namely expatriate employees, those working overseas, and workers on U.S.-flagged ships, to receive COVID-19 vaccinations after having some key operations, the off-shore platforms off the Gulf of Mexico and Permian Basin for example. The requirement will begin for workers off the Gulf of Mexico on the first of November.\n\n2020s\nIn the 2020s, Chevron's primary focus was on alternative energy solutions, gradual pullouts from Africa and Southeast Asia, and an increased focus on the Americas with a lessened albeit still present interest in natural gas. Chevron in February 2020 joined Marubeni Corporation and WAVE Equity Partners in investing in Carbon Clean Solutions, a company that provides portable carbon capture technology for the oil field and other industrial facilities. Two years later, Chevron announced that they will acquire Renewable Energy Group, a biodiesel production company based in Ames, Iowa. The acquisition was completed just under four months later on June 13.\nIn the Americas, Chevron acquired natural gas company Beyond6, LLC (B6) and its network of 55 compressed natural gas stations across the United States from Mercuria in November 2022. However, Chevron's largest American moves in the 2020s were in Venezuela, as the Biden administration relaxed restrictions on Chevron from pumping oil in the South American nation, originally imposed due to corruption scandals and human rights violations by Venezuelan president Nicolás Maduro. The relaxed restrictions, however, came with severe limitations, including provisions which prohibited Chevron from selling to Russian or Iranian-affiliated agencies and from allowing any direct profits to go to Venezuelan oil company PDVSA.\nOn November 29, 2022, Venezuelan Government Petroleum Minister Tarek El Aissami met in Caracas, Venezuela, with the president of Chevron, Javier La Rosa. The Venezuelan ruling party said it was committed to \"the development of oil production\" after the easing of sanctions.\nThe most important joint ventures where Chevron is involved in Venezuela are Petroboscán, in the west of the nation, and Petropiar, in the eastern Orinoco Belt, with a production capacity of close to 180,000 barrels per day between both projects. In the case of Petroboscán, current production is nil and, in Petropiar, current records indicate close to 50,000 barrels per day.\nOn March 20, 2023, Tareck El Aissami resigned from his government post amid serious corruption allegations. Moreover, El Aissami, a longtime Maduro ally, has a $10mn US government reward on his head for allegedly facilitating drug trafficking from Venezuela. He played a key role in helping Nicolas Maduro's government dodge US economic sanctions, using his Syrian and Lebanese parentage to open up new business channels to Iran and Turkey.\nOn January 5, 2022, Chevron temporarily decreased production in Kazakhstan's Tengiz Field due to the 2022 Kazakh protests, which were motivated by heavy oil price increases. Later that month, Chevron also announced it would end all operations in Myanmar, citing rampant human rights abuses and deteriorating rule of law since the 2021 Myanmar coup d'état. A statement released by the company on its website stated while Chevron was committed to an orderly exit which ensured it could still provide energy to Southeast Asia, Chevron remained firmly opposed to the human rights violations committed by the current military rule in Myanmar.\nAlso in 2022, Chevron was reported to explore the sale of stakes in three fields located in Equatorial Guinea. It was suggested by Reuters that the sales are intended to attract smaller oil companies.\nChevron, however, did not do business in the 2020s without controversy and regulatory obstacles. Chevron Phillips Chemical, a company jointly owned by Chevron and Phillips 66, agreed to pay $118 million in March 2022 as a result of violating the Clean Air Act at three of its chemical production plants in Texas. According to the United States Department of Justice and United States Environmental Protection Agency, Chevron and Phillips failed to properly flare at the plants, causing excess air pollution. The companies agreed to add pollution control systems to the plants as well.\nDespite the major oil and gas companies, including Chevron, reporting sharp rises in interim revenues and profits due to Russia's 2022 invasion of Ukraine, the world's-largest oil companies received immense backlash for such profits. In total, Chevron made US$246.3 billion in revenue and $36.5 billion in profit within 2022, both of which are records for the company. In addition, days before the company reported its full year earnings, Chevron increased its dividend and announced a $75 billion stock buyback program, a move which attracted a heated response from the Biden administration as well as from news commentators within the United States.\nThe 2020s also saw efforts by Chevron to expand into the clean energy industry. Across the 2020s, Chevron invested stakes into fusion power companies, the two largest of them being Zap Energy and TAE Technologies. September 2023 saw Chevron acquire a majority stake in a Utah hydrogen storage facility, which is poised to be the world's largest storage facility for hydrogen in renewable energy.\nIn October 2023, Chevron Corporation acquired Hess Corporation in an all-stock deal for $53 billion.  The acquisition, which was announced on October 23, 2023, opens up new opportunities in the US shale plays and in oil-rich Guyana. Hess Corporation, ExxonMobil and China's CNOOC, key players in Guyana, have been producing a combined 400,000 barrels per day from two offshore projects. With the potential to develop 10 more projects, Guyana becomes one of the fastest-growing oil regions that Chevron now has access to. Hess approved the merger in May 2024, but the deal was held up by an arbitration claim from ExxonMobil, which argued that it had right of first refusal on Hess's Guyana oil field shares. In September 2024, the Federal Trade Commission cleared the merger if Hess CEO John B. Hess is refused a place on Chevron’s board.\nIn 2023, Chevron entered into a 10-year agreement with state-owned Hindustan Petroleum Corporation Ltd (HPCL) to license, manufacture, distribute and sell Chevron lubricants in India under the Caltex brand.\nIn August 2024, Chevron earmarked $1 billion in a new research and development (R&D) hub called Chevron Engineering and Innovation Excellence Center (ENGINE) in Bengaluru, India. The ENGINE facility opened in October 2025.\nIn October 2024, Chevron sold some of its Kuparuk and Prudhoe Bay oil fields in Alaska to ConocoPhillips Alaska for $300 million.\nIn February 2025, Chevron announced plans to cut 20% of its workforce by the end of 2026. The company aims to reduce its payroll expenses by $2 to $3 billion. \nOn February 26, Chevron had its license revoked by Donald Trump, forcing the company to cease operations in Venezuela.\nOn August 15, 2025, Chevron resumed Venezuelan oil exports to the U.S. after receiving a new Treasury license, with two tankers carrying heavy crude bound for Texas and the West Coast.\n\nCorporate image\nLogo evolution\nThe first logo featured the legend \"Pacific Coast Oil Co.\", the name adopted by the company when it was established in 1879. Successive versions showed the word 'Standard' (for \"The Standard Oil of California\"). In 1968, the company introduced the word 'Chevron' (which was introduced as a brand in the 1930s) for the first time in its logo. In July 2014, the Chevron Corporation logo design was officially changed, although it has been used since 2000. By 2015, the logo had been changed multiple times, with three different color schemes applied in the logo. The logo was gray, then blue, and then turned red before returning to the silver gray it is today.\n\n\"Human Energy\"\nChevron today is well known for its slogan \"the human energy company\", a campaign first launched in September 2007. In a corporate blog, Chevron states \"human energy\" was chosen as their campaign's slogan and focus because \"human energy captures our positive spirit in delivering energy to a rapidly changing world\". The slogan remains prominent in Chevron advertising, and Chevron has derived from this slogan to use phrases in marketing such as \"it's only human\".\n\nOperations\nAs of December 31, 2018, Chevron had approximately 48,600 employees (including about 3,600 service station employees). Approximately 24,800 employees (including about 3,300 service station employees), or 51 percent, were employed in U.S. operations.\nChevron's dominant regions of production are North America, which produces 1.2 billion barrels of oil equivalent (BBOE), and Eurasia, which produces 1.4 BBOE. Chevron's Eurasian-Pacific operations are concentrated in the United Kingdom, Southeast Asia, Kazakhstan, Australia, Bangladesh, and greater China. Chevron additionally operates in South America, the west coast of sub-Saharan Africa (mainly Nigeria and Angola), Egypt, and Iraq; these four regions collectively produce 0.4 BBOE. Chevron's largest revenue products are shale and tight, though produces considerable revenue from heavy oil, deepwater offshore drilling, conventional oil, and liquefied natural gas.\nIn October 2015, Chevron announced that it was cutting up to 7,000 jobs, or 11 percent of its workforce. Because of the COVID-19 pandemic and 2020 Russia–Saudi Arabia oil price war, Chevron announced reductions of 10–15% of its workforce.\n\nUpstream\nChevron's oil and gas exploration and production operations, which in the oil and gas industry are considered as \"upstream\" operations, are primarily in the US, Australia, Nigeria, Angola, Kazakhstan, and the Gulf of Mexico.  As of December 31, 2018, the company's upstream business reported worldwide net production of 2.930 million oil-equivalent barrels per day.\nIn the United States, the company operates approximately 11,000 oil and natural gas wells in hundreds of fields occupying 4,000,000 acres (16,000 km2) across the Permian Basin, located in West Texas and southeastern New Mexico. In 2010, Chevron was the fourth-largest producer in the region. In February 2011, Chevron celebrated the production of its 5 billionth barrel of Permian Basin oil. The Gulf of Mexico is where the company's deepest offshore drilling takes place at Tahiti and Blind Faith. The company also explored and drilled in the Marcellus Shale formation under several northeastern US states; these operations were sold to the Pittsburgh-based natural gas firm EQT Corporation in 2020.\nIn December 2019, Chevron announced the Anchor Field project, a deepwater high-pressure oil development in the Gulf of Mexico. The $5,7 billion project is able to extract 75,000 barrels of crude oil as well as 28 million cubic feet of natural gas per day and started production in August 2024. Co-owner of the project is Total E&P USA Inc, a subsidiary of TotalEnergies, with 37.14% working interests.\nChevron's largest single resource project is the $43 billion Gorgon Gas Project in Australia. It also produces natural gas from Western Australia.  The $43 billion project was started in 2010, and was expected to be brought online in 2014. The project includes construction of a 15 million tonne per annum liquefied natural gas plant on Barrow Island, and a domestic gas plant with the capacity to provide 300 terajoules per day to supply gas to Western Australia.\nIt is also developing the Wheatstone liquefied natural gas development in Western Australia. The foundation phase of the project is estimated to cost $29 billion; it will consist of two LNG processing trains with a combined capacity of 8.9 million tons per annum, a domestic gas plant and associated offshore infrastructure. In August 2014 a significant gas-condensate discovery at the Lasseter-1 exploration well in WA-274-P in Western Australia, in which Chevron has a 50% interest was announced. The company also has an interest in the North West Shelf Venture, equally shared with five other investors including BP, BHP Petroleum, Shell, Mitsubishi/Mitsui and Woodside. Presently, Chevron is looking to convert its Gorgon Island operations from upstream production to carbon capture and storage.\nIn the onshore and near-offshore regions of the Niger Delta, Chevron operates under a joint venture with the Nigerian National Petroleum Corporation, operating and holding a 40% interest in 13 concessions in the region. In addition, Chevron operates the Escravos Gas Plant and the Escravos gas-to-liquids plant.\nChevron has interests in four concessions in Angola, including offshore two concessions in Cabinda province, the Tombua–Landana development and the Mafumeira Norte project, operated by the company.  It is also a leading partner in Angola LNG plant.\nIn Kazakhstan, Chevron participate the Tengiz and Karachaganak projects. In 2010, Chevron became the largest private shareholder in the Caspian Pipeline Consortium pipeline, which transports oil from the Caspian Sea to the Black Sea.\nAs of 2013, the Rosebank oil and gas field west of Shetland was being evaluated by Chevron and its partners. Chevron drilled its discovery well there in 2004. Production was expected in 2015 if a decision was made to produce from the field. The geology and weather conditions are challenging.\n\nMidstream\nAs of 2019, outside of maritime shipping, Chevron did not own significant midstream assets; that year it attempted to purchase Anadarko Petroleum, which owned pipelines, but was outbid by Occidental Petroleum.  In 2021, Chevron completed its purchase of Noble Midstream Partners LP, which has crude oil, produced water and gas gathering assets in the Permian Basin in West Texas and the DJ Basin in Colorado. Noble Midstream also has 2 crude oil terminals in the DJ Basin as well as freshwater delivery systems.\n\nTransport\nChevron Shipping Company, a wholly owned subsidiary, provides the maritime transport operations, marine consulting services and marine risk management services for Chevron Corporation. Chevron ships historically had names beginning with \"Chevron\", such as Chevron Washington and Chevron South America, or were named after former or serving directors of the company. Samuel Ginn, William E. Crain, Kenneth Derr, Richard Matzke and most notably Condoleezza Rice were among those honored, but the ship named after Rice was subsequently renamed as Altair Voyager.\n\nDownstream\nRefining\nChevron's downstream operations manufacture and sell products such as fuels, lubricants, additives and petrochemicals. The company's most significant areas of operations are the west coast of North America, the U.S. Gulf Coast, Southeast Asia, South Korea, Australia and South Africa.  In 2010, Chevron sold an average of 3.1 million barrels per day (490×10^3 m3/d) of refined products like gasoline, diesel and jet fuel. The company operates approximately 19,550 retail sites in 84 countries. Chevron's Asia downstream headquarters is in Singapore, and the company operates gas stations (under the Caltex brand) within the city state, in addition to some gas stations in Western Canada. Chevron owns the trademark rights to Texaco and Caltex fuel and lubricant products.\nChevron, with equal partner Singapore Petroleum Company, also owns half of the 285,000 barrels per day (45,300 m3/d) Singapore Refining Company (SRC) plant, a complex refinery capable of cracking crude oil. The investment was first made in 1979 when Caltex was a one-third partner.\nIn 2010, Chevron processed 1.9 million barrels per day (300×10^3 m3/d) of crude oil. It owns and operates Five active refineries in the United States (Richmond, CA, El Segundo, CA, Salt Lake City, UT, Pascagoula, MS, Pasadena, TX ). Chevron is the non-operating partner in seven joint venture refineries, located in Australia, Pakistan, Singapore, Thailand, South Korea, and New Zealand. Chevron's United States refineries are located in Gulf and Western states. Chevron also owns an asphalt refinery in Perth Amboy, New Jersey; however, since early 2008 that refinery has primarily operated as a terminal.\n\nChemicals\nChevron's primary chemical business is in a 50/50 joint venture with Phillips 66, organized into the Chevron Phillips Chemical Company. Chevron also operates the Chevron Oronite Company, which develops, manufactures and sells fuel and lubricant additives.\n\nRetail\nIn the United States, the Chevron brand is the most widely used, at 6,880 locations as of September 2022 spread across 21 states. Chevron's highest concentration of stations branded as Chevron are in California (mostly in the San Francisco Bay Area, Central Valley, and Greater Los Angeles), Las Vegas, Anchorage, the Pacific Northwest (especially Seattle), Phoenix, Salt Lake City, Atlanta, the Texas Triangle, and South Florida. The world's largest Chevron gas station is located at Terrible's Road House in Nevada.\nChevron also utilizes the Texaco brand within the United States, though its locations are much more sparsely-spread than that of Chevron. Texaco is used at 1,346 locations across 17 states, mostly in Washington, Texas, Louisiana, Alabama, Mississippi, Georgia, and Hawaii. Additionally, Texaco licenses its brand to Valero Energy to use in the United Kingdom, and over 730 Texaco stations exist in Britain.\nChevron primarily uses the Caltex brand outside of the United States, primarily in Southeast Asia, Hong Kong, Pakistan, New Zealand, and South Africa. In 2015, Chevron sold its 50% stake in Caltex Australia, while allowing the company to continue using the Caltex brand. In 2019, Chevron announced it would re-enter the Australian market by purchasing Puma Energy's operations in the country. The acquisition was completed in July 2020. Chevron relaunched the Caltex brand in Australia in 2022, after the expiration of Caltex Australia's license to use the Caltex brand.\n\nAlternative energy\nChevron's alternative energy operations include geothermal solar, wind, biofuel, fuel cells, and hydrogen. In 2021 it significantly increased its use of biofuel from dairy farms, like biomethane.\nChevron has claimed to be the world's largest producer of geothermal energy. The company's primary geothermal operations were located in Southeast Asia, but these assets were sold in 2017.\nPrior, Chevron operated geothermal wells in Indonesia providing power to Jakarta and the surrounding area. In the Philippines, Chevron also operated geothermal wells at Tiwi field in Albay province, the Makiling-Banahaw field in Laguna and Quezon provinces.\nIn 2007, Chevron and the United States Department of Energy's National Renewable Energy Laboratory (NREL) started collaboration to develop and produce algae fuel, which could be converted into transportation fuels, such as jet fuel. In 2008, Chevron and Weyerhaeuser created Catchlight Energy LLC, which researches the conversion of cellulose-based biomass into biofuels. In 2013, the Catchlight plan was downsized due to competition with fossil fuel projects for funds.\nBetween 2006 and 2011, Chevron contributed up to $12 million to a strategic research alliance with the Georgia Institute of Technology to develop cellulosic biofuels and to create a process to convert biomass like wood or switchgrass into fuels.\nAdditionally, Chevron holds a 22% stake in Galveston Bay Biodiesel LP, which produces up to 110 million US gallons (420,000 m3) of renewable biodiesel fuel a year.\nIn 2010, the Chevron announced a 740 kW photovoltaic demonstration project in Bakersfield, California, called Project Brightfield, for exploring possibilities to use solar power for powering Chevron's facilities. It consists of technologies from seven companies, which Chevron is evaluating for large-scale use. In Fellows, California, Chevron has invested in the 500 kW Solarmine photovoltaic solar project, which supplies daytime power to the Midway-Sunset Oil Field. In Questa, Chevron has built a 1 MW concentrated photovoltaic plant that comprises 173 solar arrays, which use Fresnel lenses. In October 2011, Chevron launched a 29-MW thermal solar-to-steam facility in the Coalinga Field to produce the steam for enhanced oil recovery. As of 2012, the project is the largest of its kind in the world.\nIn 2014, Chevron began reducing its investment in renewable energy technologies, reducing headcount and selling alternative energy-related assets.\nIn 2015, the Shell Canada Quest Energy project was launched of which Chevron Canada Limited holds a 20% share. The project is based within the Athabasca Oil Sands Project near Fort McMurray, Alberta. It is the world's first CCS project on a commercial-scale.\nIn 2025, Chevron launches a lithium project in the US by purchasing 125,000 acres in Texas and Arkansas. The Smackover formation located there will allow the development of a high-lithium brine.\n\nCorporate affairs\nBusiness trends\nAs of 2018, Chevron is ranked No. 13 on the Fortune 500 rankings of the largest United States corporations by total revenue.\nThe key trends of Chevron are (as at the financial year ending December 31):\n\nOwnership\nChevron is mainly owned by institutional investors, who own around 70% of shares. The largest shareholders in December 2023 were:\n\nThe Vanguard Group (8.70%)\nBlackRock (6.98%)\nBerkshire Hathaway (6.79%)\nState Street Corporation (6.71%)\nGeode Capital Management (1.86%)\nMorgan Stanley (1.85%)\nBank of America (1.49%)\nCharles Schwab Corporation (1.41%)\nJPMorgan Chase (1.38%)\nNorthern Trust (1.18%)\n\nHeadquarters and Offices\nTexas\nChevron's corporate headquarters operates from office towers in downtown Houston, Texas, where it purchased 1500 Louisiana Street and 1400 Smith Street.\nUpon Chevron announcing that it was selling its San Ramon headquarters in 2022, the company offered to cover moving costs for employees who wished to relocate to Texas.\nOn August 2, 2024, Chevron announced that it would relocate its headquarters from San Ramon, California to Houston, Texas by January 2025, citing a number of factors.\n\nCalifornia\nChevron has a corporate office located in San Ramon, California, at 5001 Executive Parkway.\nThe company’s earlier headquarters was located at 555 Market Street in San Francisco, California, the city where it had been located since its inception in 1879. Then in 2002, Chevron moved to a 92-acre campus in San Ramon, California, located at 6001 Bollinger Canyon Road.\nChevron sold its San Ramon headquarters to the local Sunset Development Co. in September 2022, from whom it originally bought the land which the Bollinger Canyon Road office previously stood, and leases a space in San Ramon's Bishop Ranch, also owned by Sunset, as its new office, as it continues to shift more operations to Texas.\n\nPolitical contributions\nSince January 2011 Chevron has contributed almost $15 million on Washington lobbying. On October 7, 2012, Chevron donated $2.5 million to the Republican Congressional Leadership Fund super PAC that is closely tied to former House Speaker John Boehner.\nAccording to watchdog group Documented, in 2020 Chevron contributed $50,000 to the Rule of Law Defense Fund, a fund-raising arm of the Republican Attorneys General Association.\n\nLeadership\nChairman of the Board\nDemetrius G. Scofield, March 8, 1917 – July 30, 1917\nWilliam S. Miller, April 28, 1919 – December 23, 1919\nHarry D. Collier, October 25, 1945 – January 1, 1950\nR. Gwin Follis, January 1, 1950–December 1966\nOtto N. Miller, December 1966–January 1974\nHarold J. Haynes, January 1974–May 1981\nGeorge M. Keller, May 1981–January 1, 1989\nKenneth T. Derr, January 1, 1989 – January 1, 2000\nDavid J. O'Reilly, January 1, 2000 – December 31, 2009\nJohn S. Watson December 31, 2009 – February 1, 2018\nMichael K. Wirth, February 1, 2018–present\n\nPresident\nGeorge Loomis, September 10, 1879 – December 15, 1879\nCharles N. Felton, December 15, 1879–August 1885\nGeorge Loomis, August 1885–April 8, 1894\nCharles N. Felton, April 17, 1894–February 1896\nGordon Blanding, February 1896–October 17, 1900\nHenry M. Tilford, December 18, 1900 – February 20, 1911\nJames A. Moffett, February 20, 1911 – December 1, 1911\nDemetrius G. Scofield, December 5, 1911 – March 8, 1917\nKenneth R. Kingsbury, April 28, 1919 – November 22, 1937\nWilliam H. Berg, December 10, 1937 – June 26, 1940\nHarry D. Collier, July 8, 1940 – October 25, 1945\nR. Gwin Follis, October 25, 1945 – January 9, 1948\nTheodore S. Petersen, January 9, 1948 – October 26, 1961\nOtto N. Miller, October 26, 1961–December 1966\nJames E. Gosline, December 1966–July 30, 1969\nHarold J. Haynes, July 30, 1969–January 1974\nJohn R. Grey, January 1974–December 31, 1985 office abolished\n\nCurrent Board of directors\nWanda Austin\nJohn B. Frank\nAlice P. Gast\nEnrique Hernandez Jr.\nJohn B. Hess\nMarillyn Hewson\nJon M. Huntsman Jr.\nCharles Moorman\nDambisa Moyo\nDebra Reed-Klages\nRonald Sugar (Lead independent director)\nInge Thulin\nJim Umpleby\nCynthia J. Warner\nMike Wirth (Chairman & CEO)\n\nCriticism and concerns\nChevron has been widely criticized and attacked for scandals, accidents, and activities mostly related to climate change. Chevron has been fined by the governments of Angola, for oil spills within its waters, and the United States through its EPA for violations of the US Clean Air Act and pollutive activities arising out of its Richmond Refinery in California. On multiple instances, authorities in oil-heavy countries have fired rounds onto protestors against Chevron. Environmental activists have held annual anti-Chevron protests, usually within a week of Chevron's annual meeting of shareholders.\nOne case heavily promoted on social media is about work done in the Lago Agrio oil field by Texaco, which Chevron acquired in 2001. Texaco dumped 18 billion tons of toxic waste and spilled 17 million US gallons (64,000,000 L) of petroleum. Texaco's activities were the subject of an Ecuadorian court case brought by Steven Donziger, which claimed an $18 billion and later reduced $9.5 billion judgment.\nChevron has played a significant role in the exploitation of natural gas resources in the Eastern Mediterranean, including the Leviathan and Tamar fields off Israel's coast. The company has financially benefited from Israel's control over maritime resources to which Palestinians have been denied access due to the blockade of the Gaza Strip and lack of maritime sovereignty.\nA major point of contention involves Texaco's operations in the Ecuadorian Amazon from the 1960s until 1992. Critics allege that during this period, the company deliberately discharged approximately 72 billion liters (18 billion gallons) of toxic waste directly into the rainforest's rivers and lands as a cost-saving measure instead of utilizing proper disposal methods. This contamination is reported to have devastated local ecosystems, poisoned water sources used by indigenous communities for drinking and sustenance, and led to widespread health issues, including illnesses and physical ailments. Some experts and affected parties have referred to this environmental damage as the \"Amazon Chernobyl\". It is claimed that these were not accidental spills but rather the result of systematically engineered dumping practices. Local communities initially reported changes in water taste but were allegedly dismissed by the company, which purportedly suggested the water contained beneficial \"vitamins\".\nThe environmental damage in Ecuador led to one of the largest environmental lawsuits in history (Aguinda v. Texaco, Inc.). In 2011, an Ecuadorian court found Chevron liable and ordered the company to pay $9.5 billion in damages to the affected communities. Chevron refused to pay the judgment, removed its assets from Ecuador, and vowed to fight the ruling indefinitely, with a company lawyer stating they would contest it \"until hell freezes over, and then fight it out on the ice\". Chevron allegedly lobbied the US government to impose sanctions on Ecuador following the ruling. In 2018, an international tribunal in The Hague ruled in favor of Chevron, stating that the 2011 Ecuador Supreme Court ruling had been obtained through fraud, bribery and corruption. The majority of Chevron's crude oil from the Amazon is processed in California at the El Segundo refinery.\nSteven Donziger, an American lawyer who represented the Ecuadorian plaintiffs for decades, became a central figure in the subsequent legal battles. Chevron pursued legal action against Donziger in the United States, accusing him of obtaining the Ecuadorian judgment through bribery and fraud. A key witness in Chevron's US case against Donziger, Alberto Guerra, later admitted under oath in an international tribunal that Chevron had paid him substantial sums (reportedly over $1 million and ongoing benefits) to provide false testimony against Donziger, requiring extensive coaching over 50 days.\nThe US case against Donziger was overseen by Judge Lewis A. Kaplan, who critics note had financial ties to Chevron. When Donziger appealed Kaplan's order to turn over his computer and phone citing attorney-client privilege, Kaplan referred the matter for criminal contempt charges. After the US Attorney's office declined to prosecute, Judge Kaplan appointed a private law firm, Gibson Dunn & Crutcher (which has represented Chevron), to prosecute Donziger in the court's name – an unusual move described as the first corporate criminal prosecution in US history. Donziger was subsequently placed under house arrest for 993 days while awaiting trial on the misdemeanor charge. He was ultimately convicted of contempt of court and served time in prison, receiving a sentence critics claim exceeded the legal maximum for the offense. As a result of these legal battles, Donziger was disbarred, had his bank accounts frozen, and reportedly faces ongoing restrictions preventing him from working, holding accounts, or leaving the US. Chevron also sued Donziger for $60 billion, described as the largest amount sought from an individual in US history. Critics assert that Chevron's actions against Donziger were intended to make an example of him and deter other lawyers from challenging the company over environmental damages worldwide.\nConcerns have also been raised about Chevron's oil extraction activities in urban settings like Los Angeles. Observers note the presence of active oil wells located directly adjacent to homes and schools, particularly in lower-income areas. In wealthier neighborhoods, such as Beverly Hills, Chevron allegedly camouflages its drilling operations within large, windowless structures designed to look like ordinary office buildings or service facilities, hiding numerous wells from public view. One such disguised oil pump at Beverly Hills High School, dubbed the \"Tower of Hope,\" reportedly drew attention only after it caught fire. Furthermore, Chevron is accused of improperly abandoning depleted wells in the city, leaving behind toxic sites that pose ongoing health risks (such as nosebleeds or respiratory issues) to nearby residents and can potentially lead to hazardous events like eruptions of toxic sludge. Critics argue that, similar to the situation in Ecuador, regulatory oversight in these areas appears insufficient to prevent these practices or hold the company accountable for remediation.\nCritics argue that these incidents reflect a broader business model employed by Chevron and other large resource extraction companies. This alleged model involves entering countries, extracting resources as cheaply as possible (often with minimal environmental safeguards), dumping waste products to cut costs, and leaving local communities to deal with the long-term environmental and health consequences. The company is accused of using its significant financial and legal resources (employing thousands of lawyers and spending billions on litigation in the Ecuador case) to overwhelm opponents, delay legal proceedings, influence governments, and avoid accountability for damages caused by its operations globally.\n\nSee also\nChevron U.S.A., Inc. v. Natural Resources Defense Council, Inc.\nClimate appraisal\nClimate risk management\nGlobal warming\nJack 2\nPatent encumbrance of large automotive NiMH batteries\nTexaco\nThe Richmond Standard\nTrans-Caribbean pipeline\n\nNotes\nReferences\nExternal links\nChevron Corporation on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nOfficial website \nBusiness data for Chevron Corporation:",
  "clean_text": "Chevron Corporation is an American multinational energy corporation predominantly specializing in oil and gas. The second-largest direct descendant of Standard Oil, and originally known as the Standard Oil Company of California (shortened to Socal or CalSo), it is active in more than 180 countries. Within oil and gas, Chevron is vertically integrated and is involved in hydrocarbon exploration, production, refining, marketing and transport, chemicals manufacturing and sales, and power generation. Founded originally in Southern California during the 1870s, the company was then based for many decades in San Francisco, California, before moving its corporate offices to San Ramon, California, in 2001; on August 2, 2024, Chevron announced that it would be transferring its headquarters to Houston, Texas. Chevron traces its history back to the second half of the 19th century to small California-based oil companies which were acquired by Standard and merged into Standard Oil of California. The company grew quickly on its own after the breakup of Standard Oil by continuing to acquire companies and partnering with others both inside and outside of California, eventually becoming one of the Seven Sisters that dominated the global petroleum industry from the mid-1940s to the 1970s. In 1985, Socal merged with the Pittsburgh-based Gulf Oil and rebranded as Chevron; the newly merged company later merged with Texaco in 2001. Chevron manufactures and sells fuels, lubricants, additives, and petrochemicals, primarily in Western North America, the US Gulf Coast, Southeast Asia, South Korea and Australia. In 2018, the company produced an average of 791,000 barrels (125,800 m3) of net oil-equivalent per day in United States. Chevron is one of the largest companies in the world and the second-largest oil company based in the United States by revenue, only behind fellow Standard Oil descendant ExxonMobil. Chevron ranked 10th on the Fortune 500 in 2023. The company is also the last-remaining oil-and-gas component of the Dow Jones Industrial Average since ExxonMobil's exit from the index in 2020. Chevron has been subject to numerous controversies. History Predecessors Star Oil and Pacific Coast Oil Company One of Chevron's early predecessors, \"Star Oil\", discovered oil at the Pico Canyon Oilfield in the Santa Susana Mountains north of Los Angeles in 1876. The 25 barrels of oil per day well marked the discovery of the Newhall Field, and is considered by geophysicist Marius Vassiliou as the beginning of the modern oil industry in California. Energy analyst Antonia Juhasz has said that while Star Oil's founders were influential in establishing an oil industry in California, Union Mattole Company discovered oil in the state eleven years prior. In September 1879, Charles N. Felton, Lloyd Tevis, George Loomis and others created the \"Pacific Coast Oil Company\", which acquired the assets of Star Oil with $1 million in funding. Pacific Coast Oil eventually became the largest oil interest in California, and in 1900, John D. Rockefeller's Standard Oil acquired Pacific Coast Oil for $761,000. In 1906, the Pacific Coast acquired the business operations and assets of the Standard Oil Company (Iowa). At this time, Pacific renamed itself the Standard Oil Company (California). Texaco Since the acquisition of the Pacific Coast Oil Company by Standard Oil, the Standard descendant had traditionally worked closely with Texaco for 100 years, before acquiring Texaco outright in 2001. Originally known as the Texas Fuel Company (later the Texas Company), Texaco was founded in Beaumont, Texas, as an oil-equipment vendor by \"Buckskin Joe\". The founder's nickname came from being harsh and aggressive. Texas Fuel worked closely with Chevron. In 1936, it formed a joint venture with California Standard named Caltex, to drill and produce oil in Saudi Arabia. According to energy analyst and activist shareholder Antonia Juhasz, the Texas Fuel Company and California Standard were often referred to as the \"terrible twins\" for their cutthroat business practices. Formation of the Chevron name In 1911, the federal government broke Standard Oil into several pieces under the Sherman Antitrust Act. One of those pieces, Standard Oil Co. (California), went on to become Chevron. It became part of the \"Seven Sisters\", which dominated the world oil industry in the early 20th century. In 1926, the company changed its name to Standard Oil Co. of California (SOCAL). By the terms of the breakup of Standard Oil, at first Standard of California could use the Standard name only within its original geographic area of the Pacific coast states, plus Nevada and Arizona; outside that area, it had to use another name. Today, Chevron is the owner of the Standard Oil trademark in 16 states in the western and southeastern United States. Since American trademark law operates under a use-it-or-lose-it rule, the company owns and operates one Standard-branded Chevron station in each state of the area. However, though Chevron (as CalSo) acquired Kyso in the 1960s, its status in Kentucky is unclear after Chevron withdrew its brand from retail sales from Kentucky in July 2010. The 'Chevron' name came into use for some of its retail products in the 1930s. The name \"Calso\" was also used from 1946 to 1955, in states outside its native West Coast territory. Standard Oil Company of California ranked 75th among United States corporations in the value of World War II military production contracts. In 1933, Saudi Arabia granted California Standard a concession to find oil, which led to the discovery of oil in 1938. In 1948, California Standard discovered the world's largest oil field in Saudi Arabia, Ghawar Field. California Standard's subsidiary, California-Arabian Standard Oil Company, grew over the years and became the Arabian American Oil Company (ARAMCO) in 1944. In 1973, the Saudi government began buying into ARAMCO. By 1980, the company was entirely owned by the Saudis, and in 1988, its name was changed to Saudi Arabian Oil Company—Saudi Aramco. Standard Oil of California and Gulf Oil merged in 1984, which was the largest merger in history at that time. To comply with U.S. antitrust law, California Standard divested many of Gulf's operating subsidiaries, and sold some Gulf stations in the eastern United States and a Philadelphia refinery which has since closed. Among the assets sold off were Gulf's retail outlets in Gulf's home market of Pittsburgh, where Chevron lacks a retail presence but does retain a regional headquarters there as of 2013, partially for Marcellus Shale-related drilling. The same year, Standard Oil of California also took the opportunity to change its legal name to Chevron Corporation, since it had already been using the well-known \"Chevron\" retail brand name for decades. Chevron would sell the Gulf Oil trademarks for the entire U.S. to Cumberland Farms, the parent company of Gulf Oil LP, in 2010 after Cumberland Farms had a license to the Gulf trademark in the Northeastern United States since 1986. In 1996, Chevron transferred its natural gas gathering, operating and marketing operation to NGC Corporation (later Dynegy) in exchange for a roughly 25% equity stake in NGC. In a merger completed February 1, 2000, Illinova Corp. became a wholly owned subsidiary of Dynegy Inc. and Chevron's stake increased up to 28%. However, in May 2007, Chevron sold its stake in the company for approximately $985 million, resulting in a gain of $680 million. Acquisitions and diversification 2000s The early 2000s saw Chevron engage in many mergers, acquisitions, and sales, the first largest of which was the $45 billion acquisition of Texaco, announced on October 15, 2000. The acquisition created the second-largest oil company in the United States and the world's fourth-largest publicly traded oil company with a combined market value of approximately $95 billion. Completed on October 9, 2001, Chevron temporarily renamed itself to ChevronTexaco between 2001 and 2005; after the company reverted its name to Chevron, Texaco became used as a brand by the company for some of its fueling stations. 2005 also saw Chevron purchase Unocal Corporation for $18.4 billion, increasing the company's petroleum and natural gas reserves by about 15%. Because of Unocal's large South East Asian geothermal operations, Chevron became a large producer of geothermal energy. The deal did not include Unocal's former retail operations including the Union 76 trademark, as it had sold that off to Tosco Corporation in 1997. The 76 brand is owned by Phillips 66, unaffiliated with Chevron. Chevron and the Los Alamos National Laboratory started a cooperation in 2006, to improve the recovery of hydrocarbons from oil shale by developing a shale oil extraction process named Chevron CRUSH. In 2006, the United States Department of the Interior issued a research, development and demonstration lease for Chevron's demonstration oil shale project on public lands in Colorado's Piceance Basin. In February 2012, Chevron notified the Bureau of Land Management and the Department of Reclamation, Mining and Safety that it intended to divest this lease. In 2008, Chevron Limited, a subsidiary of Chevron, sold its equity distributor business in the UK to GB Oils Limited for £21.9 million. 2010s Starting in 2010, Chevron began to reduce its retail footprint and expand in domestic natural gas. In July 2010, Chevron ended retail operations in the Mid-Atlantic United States by removing the Chevron and Texaco names from 1,100 stations. In 2011, Chevron acquired Pennsylvania-based Atlas Energy Inc. for $3.2 billion in cash and an additional $1.1 billion in existing debt owed by Atlas. Three months later, Chevron acquired drilling and development rights for another 228,000 acres in the Marcellus Shale from Chief Oil & Gas LLC and Tug Hill, Inc. In September 2013, Total S.A. and its joint-venture partner agreed to buy Chevron's retail distribution business in Pakistan for an undisclosed amount. In October 2014, Chevron announced that it would sell a 30 percent holding in its Canadian oil shale holdings to Kuwait's state-owned oil company Kuwait Oil Company for a fee of $1.5 billion. Despite these sales, Chevron continued to explore acquisitions, a trend which had reinvigorated in 2019 and extended throughout the COVID-19 pandemic. In April 2019, Chevron announced its intention to acquire Anadarko Petroleum in a deal valued at $33 billion, but decided to focus on other acquisitions shortly afterwards when a deal could not be reached. Despite the failed acquisition of Anadarko, Chevron did acquire Noble Energy for $5 billion in July 2020. Chevron sold its North Sea operations in May 2019 to Ithaca Energy for $2 billion. Chevron was not spared from the pandemic, however, as Chevron announced reductions of 10–15% of its workforce due to both the pandemic and a 2020 oil price war between Russia and Saudi Arabia. During the pandemic, Chevron considered a merger with rival ExxonMobil in 2020 during the early stages of the COVID-19 pandemic that drove oil demand sharply down. It would have been one of the largest corporate mergers in history, and a combined Chevron and ExxonMobil (dubbed \"Chexxon\" by Reuters) would have been the second-largest oil company in the world, trailing only Saudi Aramco. Later in the pandemic, Chevron began requiring some employees, namely expatriate employees, those working overseas, and workers on U.S.-flagged ships, to receive COVID-19 vaccinations after having some key operations, the off-shore platforms off the Gulf of Mexico and Permian Basin for example. The requirement will begin for workers off the Gulf of Mexico on the first of November. 2020s In the 2020s, Chevron's primary focus was on alternative energy solutions, gradual pullouts from Africa and Southeast Asia, and an increased focus on the Americas with a lessened albeit still present interest in natural gas. Chevron in February 2020 joined Marubeni Corporation and WAVE Equity Partners in investing in Carbon Clean Solutions, a company that provides portable carbon capture technology for the oil field and other industrial facilities. Two years later, Chevron announced that they will acquire Renewable Energy Group, a biodiesel production company based in Ames, Iowa. The acquisition was completed just under four months later on June 13. In the Americas, Chevron acquired natural gas company Beyond6, LLC (B6) and its network of 55 compressed natural gas stations across the United States from Mercuria in November 2022. However, Chevron's largest American moves in the 2020s were in Venezuela, as the Biden administration relaxed restrictions on Chevron from pumping oil in the South American nation, originally imposed due to corruption scandals and human rights violations by Venezuelan president Nicolás Maduro. The relaxed restrictions, however, came with severe limitations, including provisions which prohibited Chevron from selling to Russian or Iranian-affiliated agencies and from allowing any direct profits to go to Venezuelan oil company PDVSA. On November 29, 2022, Venezuelan Government Petroleum Minister Tarek El Aissami met in Caracas, Venezuela, with the president of Chevron, Javier La Rosa. The Venezuelan ruling party said it was committed to \"the development of oil production\" after the easing of sanctions. The most important joint ventures where Chevron is involved in Venezuela are Petroboscán, in the west of the nation, and Petropiar, in the eastern Orinoco Belt, with a production capacity of close to 180,000 barrels per day between both projects. In the case of Petroboscán, current production is nil and, in Petropiar, current records indicate close to 50,000 barrels per day. On March 20, 2023, Tareck El Aissami resigned from his government post amid serious corruption allegations. Moreover, El Aissami, a longtime Maduro ally, has a $10mn US government reward on his head for allegedly facilitating drug trafficking from Venezuela. He played a key role in helping Nicolas Maduro's government dodge US economic sanctions, using his Syrian and Lebanese parentage to open up new business channels to Iran and Turkey. On January 5, 2022, Chevron temporarily decreased production in Kazakhstan's Tengiz Field due to the 2022 Kazakh protests, which were motivated by heavy oil price increases. Later that month, Chevron also announced it would end all operations in Myanmar, citing rampant human rights abuses and deteriorating rule of law since the 2021 Myanmar coup d'état. A statement released by the company on its website stated while Chevron was committed to an orderly exit which ensured it could still provide energy to Southeast Asia, Chevron remained firmly opposed to the human rights violations committed by the current military rule in Myanmar. Also in 2022, Chevron was reported to explore the sale of stakes in three fields located in Equatorial Guinea. It was suggested by Reuters that the sales are intended to attract smaller oil companies. Chevron, however, did not do business in the 2020s without controversy and regulatory obstacles. Chevron Phillips Chemical, a company jointly owned by Chevron and Phillips 66, agreed to pay $118 million in March 2022 as a result of violating the Clean Air Act at three of its chemical production plants in Texas. According to the United States Department of Justice and United States Environmental Protection Agency, Chevron and Phillips failed to properly flare at the plants, causing excess air pollution. The companies agreed to add pollution control systems to the plants as well. Despite the major oil and gas companies, including Chevron, reporting sharp rises in interim revenues and profits due to Russia's 2022 invasion of Ukraine, the world's-largest oil companies received immense backlash for such profits. In total, Chevron made US$246.3 billion in revenue and $36.5 billion in profit within 2022, both of which are records for the company. In addition, days before the company reported its full year earnings, Chevron increased its dividend and announced a $75 billion stock buyback program, a move which attracted a heated response from the Biden administration as well as from news commentators within the United States. The 2020s also saw efforts by Chevron to expand into the clean energy industry. Across the 2020s, Chevron invested stakes into fusion power companies, the two largest of them being Zap Energy and TAE Technologies. September 2023 saw Chevron acquire a majority stake in a Utah hydrogen storage facility, which is poised to be the world's largest storage facility for hydrogen in renewable energy. In October 2023, Chevron Corporation acquired Hess Corporation in an all-stock deal for $53 billion. The acquisition, which was announced on October 23, 2023, opens up new opportunities in the US shale plays and in oil-rich Guyana. Hess Corporation, ExxonMobil and China's CNOOC, key players in Guyana, have been producing a combined 400,000 barrels per day from two offshore projects. With the potential to develop 10 more projects, Guyana becomes one of the fastest-growing oil regions that Chevron now has access to. Hess approved the merger in May 2024, but the deal was held up by an arbitration claim from ExxonMobil, which argued that it had right of first refusal on Hess's Guyana oil field shares. In September 2024, the Federal Trade Commission cleared the merger if Hess CEO John B. Hess is refused a place on Chevron’s board. In 2023, Chevron entered into a 10-year agreement with state-owned Hindustan Petroleum Corporation Ltd (HPCL) to license, manufacture, distribute and sell Chevron lubricants in India under the Caltex brand. In August 2024, Chevron earmarked $1 billion in a new research and development (R&D) hub called Chevron Engineering and Innovation Excellence Center (ENGINE) in Bengaluru, India. The ENGINE facility opened in October 2025. In October 2024, Chevron sold some of its Kuparuk and Prudhoe Bay oil fields in Alaska to ConocoPhillips Alaska for $300 million. In February 2025, Chevron announced plans to cut 20% of its workforce by the end of 2026. The company aims to reduce its payroll expenses by $2 to $3 billion. On February 26, Chevron had its license revoked by Donald Trump, forcing the company to cease operations in Venezuela. On August 15, 2025, Chevron resumed Venezuelan oil exports to the U.S. after receiving a new Treasury license, with two tankers carrying heavy crude bound for Texas and the West Coast. Corporate image Logo evolution The first logo featured the legend \"Pacific Coast Oil Co.\", the name adopted by the company when it was established in 1879. Successive versions showed the word 'Standard' (for \"The Standard Oil of California\"). In 1968, the company introduced the word 'Chevron' (which was introduced as a brand in the 1930s) for the first time in its logo. In July 2014, the Chevron Corporation logo design was officially changed, although it has been used since 2000. By 2015, the logo had been changed multiple times, with three different color schemes applied in the logo. The logo was gray, then blue, and then turned red before returning to the silver gray it is today. \"Human Energy\" Chevron today is well known for its slogan \"the human energy company\", a campaign first launched in September 2007. In a corporate blog, Chevron states \"human energy\" was chosen as their campaign's slogan and focus because \"human energy captures our positive spirit in delivering energy to a rapidly changing world\". The slogan remains prominent in Chevron advertising, and Chevron has derived from this slogan to use phrases in marketing such as \"it's only human\". Operations As of December 31, 2018, Chevron had approximately 48,600 employees (including about 3,600 service station employees). Approximately 24,800 employees (including about 3,300 service station employees), or 51 percent, were employed in U.S. operations. Chevron's dominant regions of production are North America, which produces 1.2 billion barrels of oil equivalent (BBOE), and Eurasia, which produces 1.4 BBOE. Chevron's Eurasian-Pacific operations are concentrated in the United Kingdom, Southeast Asia, Kazakhstan, Australia, Bangladesh, and greater China. Chevron additionally operates in South America, the west coast of sub-Saharan Africa (mainly Nigeria and Angola), Egypt, and Iraq; these four regions collectively produce 0.4 BBOE. Chevron's largest revenue products are shale and tight, though produces considerable revenue from heavy oil, deepwater offshore drilling, conventional oil, and liquefied natural gas. In October 2015, Chevron announced that it was cutting up to 7,000 jobs, or 11 percent of its workforce. Because of the COVID-19 pandemic and 2020 Russia–Saudi Arabia oil price war, Chevron announced reductions of 10–15% of its workforce. Upstream Chevron's oil and gas exploration and production operations, which in the oil and gas industry are considered as \"upstream\" operations, are primarily in the US, Australia, Nigeria, Angola, Kazakhstan, and the Gulf of Mexico. As of December 31, 2018, the company's upstream business reported worldwide net production of 2.930 million oil-equivalent barrels per day. In the United States, the company operates approximately 11,000 oil and natural gas wells in hundreds of fields occupying 4,000,000 acres (16,000 km2) across the Permian Basin, located in West Texas and southeastern New Mexico. In 2010, Chevron was the fourth-largest producer in the region. In February 2011, Chevron celebrated the production of its 5 billionth barrel of Permian Basin oil. The Gulf of Mexico is where the company's deepest offshore drilling takes place at Tahiti and Blind Faith. The company also explored and drilled in the Marcellus Shale formation under several northeastern US states; these operations were sold to the Pittsburgh-based natural gas firm EQT Corporation in 2020. In December 2019, Chevron announced the Anchor Field project, a deepwater high-pressure oil development in the Gulf of Mexico. The $5,7 billion project is able to extract 75,000 barrels of crude oil as well as 28 million cubic feet of natural gas per day and started production in August 2024. Co-owner of the project is Total E&P USA Inc, a subsidiary of TotalEnergies, with 37.14% working interests. Chevron's largest single resource project is the $43 billion Gorgon Gas Project in Australia. It also produces natural gas from Western Australia. The $43 billion project was started in 2010, and was expected to be brought online in 2014. The project includes construction of a 15 million tonne per annum liquefied natural gas plant on Barrow Island, and a domestic gas plant with the capacity to provide 300 terajoules per day to supply gas to Western Australia. It is also developing the Wheatstone liquefied natural gas development in Western Australia. The foundation phase of the project is estimated to cost $29 billion; it will consist of two LNG processing trains with a combined capacity of 8.9 million tons per annum, a domestic gas plant and associated offshore infrastructure. In August 2014 a significant gas-condensate discovery at the Lasseter-1 exploration well in WA-274-P in Western Australia, in which Chevron has a 50% interest was announced. The company also has an interest in the North West Shelf Venture, equally shared with five other investors including BP, BHP Petroleum, Shell, Mitsubishi/Mitsui and Woodside. Presently, Chevron is looking to convert its Gorgon Island operations from upstream production to carbon capture and storage. In the onshore and near-offshore regions of the Niger Delta, Chevron operates under a joint venture with the Nigerian National Petroleum Corporation, operating and holding a 40% interest in 13 concessions in the region. In addition, Chevron operates the Escravos Gas Plant and the Escravos gas-to-liquids plant. Chevron has interests in four concessions in Angola, including offshore two concessions in Cabinda province, the Tombua–Landana development and the Mafumeira Norte project, operated by the company. It is also a leading partner in Angola LNG plant. In Kazakhstan, Chevron participate the Tengiz and Karachaganak projects. In 2010, Chevron became the largest private shareholder in the Caspian Pipeline Consortium pipeline, which transports oil from the Caspian Sea to the Black Sea. As of 2013, the Rosebank oil and gas field west of Shetland was being evaluated by Chevron and its partners. Chevron drilled its discovery well there in 2004. Production was expected in 2015 if a decision was made to produce from the field. The geology and weather conditions are challenging. Midstream As of 2019, outside of maritime shipping, Chevron did not own significant midstream assets; that year it attempted to purchase Anadarko Petroleum, which owned pipelines, but was outbid by Occidental Petroleum. In 2021, Chevron completed its purchase of Noble Midstream Partners LP, which has crude oil, produced water and gas gathering assets in the Permian Basin in West Texas and the DJ Basin in Colorado. Noble Midstream also has 2 crude oil terminals in the DJ Basin as well as freshwater delivery systems. Transport Chevron Shipping Company, a wholly owned subsidiary, provides the maritime transport operations, marine consulting services and marine risk management services for Chevron Corporation. Chevron ships historically had names beginning with \"Chevron\", such as Chevron Washington and Chevron South America, or were named after former or serving directors of the company. Samuel Ginn, William E. Crain, Kenneth Derr, Richard Matzke and most notably Condoleezza Rice were among those honored, but the ship named after Rice was subsequently renamed as Altair Voyager. Downstream Refining Chevron's downstream operations manufacture and sell products such as fuels, lubricants, additives and petrochemicals. The company's most significant areas of operations are the west coast of North America, the U.S. Gulf Coast, Southeast Asia, South Korea, Australia and South Africa. In 2010, Chevron sold an average of 3.1 million barrels per day (490×10^3 m3/d) of refined products like gasoline, diesel and jet fuel. The company operates approximately 19,550 retail sites in 84 countries. Chevron's Asia downstream headquarters is in Singapore, and the company operates gas stations (under the Caltex brand) within the city state, in addition to some gas stations in Western Canada. Chevron owns the trademark rights to Texaco and Caltex fuel and lubricant products. Chevron, with equal partner Singapore Petroleum Company, also owns half of the 285,000 barrels per day (45,300 m3/d) Singapore Refining Company (SRC) plant, a complex refinery capable of cracking crude oil. The investment was first made in 1979 when Caltex was a one-third partner. In 2010, Chevron processed 1.9 million barrels per day (300×10^3 m3/d) of crude oil. It owns and operates Five active refineries in the United States (Richmond, CA, El Segundo, CA, Salt Lake City, UT, Pascagoula, MS, Pasadena, TX ). Chevron is the non-operating partner in seven joint venture refineries, located in Australia, Pakistan, Singapore, Thailand, South Korea, and New Zealand. Chevron's United States refineries are located in Gulf and Western states. Chevron also owns an asphalt refinery in Perth Amboy, New Jersey; however, since early 2008 that refinery has primarily operated as a terminal. Chemicals Chevron's primary chemical business is in a 50/50 joint venture with Phillips 66, organized into the Chevron Phillips Chemical Company. Chevron also operates the Chevron Oronite Company, which develops, manufactures and sells fuel and lubricant additives. Retail In the United States, the Chevron brand is the most widely used, at 6,880 locations as of September 2022 spread across 21 states. Chevron's highest concentration of stations branded as Chevron are in California (mostly in the San Francisco Bay Area, Central Valley, and Greater Los Angeles), Las Vegas, Anchorage, the Pacific Northwest (especially Seattle), Phoenix, Salt Lake City, Atlanta, the Texas Triangle, and South Florida. The world's largest Chevron gas station is located at Terrible's Road House in Nevada. Chevron also utilizes the Texaco brand within the United States, though its locations are much more sparsely-spread than that of Chevron. Texaco is used at 1,346 locations across 17 states, mostly in Washington, Texas, Louisiana, Alabama, Mississippi, Georgia, and Hawaii. Additionally, Texaco licenses its brand to Valero Energy to use in the United Kingdom, and over 730 Texaco stations exist in Britain. Chevron primarily uses the Caltex brand outside of the United States, primarily in Southeast Asia, Hong Kong, Pakistan, New Zealand, and South Africa. In 2015, Chevron sold its 50% stake in Caltex Australia, while allowing the company to continue using the Caltex brand. In 2019, Chevron announced it would re-enter the Australian market by purchasing Puma Energy's operations in the country. The acquisition was completed in July 2020. Chevron relaunched the Caltex brand in Australia in 2022, after the expiration of Caltex Australia's license to use the Caltex brand. Alternative energy Chevron's alternative energy operations include geothermal solar, wind, biofuel, fuel cells, and hydrogen. In 2021 it significantly increased its use of biofuel from dairy farms, like biomethane. Chevron has claimed to be the world's largest producer of geothermal energy. The company's primary geothermal operations were located in Southeast Asia, but these assets were sold in 2017. Prior, Chevron operated geothermal wells in Indonesia providing power to Jakarta and the surrounding area. In the Philippines, Chevron also operated geothermal wells at Tiwi field in Albay province, the Makiling-Banahaw field in Laguna and Quezon provinces. In 2007, Chevron and the United States Department of Energy's National Renewable Energy Laboratory (NREL) started collaboration to develop and produce algae fuel, which could be converted into transportation fuels, such as jet fuel. In 2008, Chevron and Weyerhaeuser created Catchlight Energy LLC, which researches the conversion of cellulose-based biomass into biofuels. In 2013, the Catchlight plan was downsized due to competition with fossil fuel projects for funds. Between 2006 and 2011, Chevron contributed up to $12 million to a strategic research alliance with the Georgia Institute of Technology to develop cellulosic biofuels and to create a process to convert biomass like wood or switchgrass into fuels. Additionally, Chevron holds a 22% stake in Galveston Bay Biodiesel LP, which produces up to 110 million US gallons (420,000 m3) of renewable biodiesel fuel a year. In 2010, the Chevron announced a 740 kW photovoltaic demonstration project in Bakersfield, California, called Project Brightfield, for exploring possibilities to use solar power for powering Chevron's facilities. It consists of technologies from seven companies, which Chevron is evaluating for large-scale use. In Fellows, California, Chevron has invested in the 500 kW Solarmine photovoltaic solar project, which supplies daytime power to the Midway-Sunset Oil Field. In Questa, Chevron has built a 1 MW concentrated photovoltaic plant that comprises 173 solar arrays, which use Fresnel lenses. In October 2011, Chevron launched a 29-MW thermal solar-to-steam facility in the Coalinga Field to produce the steam for enhanced oil recovery. As of 2012, the project is the largest of its kind in the world. In 2014, Chevron began reducing its investment in renewable energy technologies, reducing headcount and selling alternative energy-related assets. In 2015, the Shell Canada Quest Energy project was launched of which Chevron Canada Limited holds a 20% share. The project is based within the Athabasca Oil Sands Project near Fort McMurray, Alberta. It is the world's first CCS project on a commercial-scale. In 2025, Chevron launches a lithium project in the US by purchasing 125,000 acres in Texas and Arkansas. The Smackover formation located there will allow the development of a high-lithium brine. Corporate affairs Business trends As of 2018, Chevron is ranked No. 13 on the Fortune 500 rankings of the largest United States corporations by total revenue. The key trends of Chevron are (as at the financial year ending December 31): Ownership Chevron is mainly owned by institutional investors, who own around 70% of shares. The largest shareholders in December 2023 were: The Vanguard Group (8.70%) BlackRock (6.98%) Berkshire Hathaway (6.79%) State Street Corporation (6.71%) Geode Capital Management (1.86%) Morgan Stanley (1.85%) Bank of America (1.49%) Charles Schwab Corporation (1.41%) JPMorgan Chase (1.38%) Northern Trust (1.18%) Headquarters and Offices Texas Chevron's corporate headquarters operates from office towers in downtown Houston, Texas, where it purchased 1500 Louisiana Street and 1400 Smith Street. Upon Chevron announcing that it was selling its San Ramon headquarters in 2022, the company offered to cover moving costs for employees who wished to relocate to Texas. On August 2, 2024, Chevron announced that it would relocate its headquarters from San Ramon, California to Houston, Texas by January 2025, citing a number of factors. California Chevron has a corporate office located in San Ramon, California, at 5001 Executive Parkway. The company’s earlier headquarters was located at 555 Market Street in San Francisco, California, the city where it had been located since its inception in 1879. Then in 2002, Chevron moved to a 92-acre campus in San Ramon, California, located at 6001 Bollinger Canyon Road. Chevron sold its San Ramon headquarters to the local Sunset Development Co. in September 2022, from whom it originally bought the land which the Bollinger Canyon Road office previously stood, and leases a space in San Ramon's Bishop Ranch, also owned by Sunset, as its new office, as it continues to shift more operations to Texas. Political contributions Since January 2011 Chevron has contributed almost $15 million on Washington lobbying. On October 7, 2012, Chevron donated $2.5 million to the Republican Congressional Leadership Fund super PAC that is closely tied to former House Speaker John Boehner. According to watchdog group Documented, in 2020 Chevron contributed $50,000 to the Rule of Law Defense Fund, a fund-raising arm of the Republican Attorneys General Association. Leadership Chairman of the Board Demetrius G. Scofield, March 8, 1917 – July 30, 1917 William S. Miller, April 28, 1919 – December 23, 1919 Harry D. Collier, October 25, 1945 – January 1, 1950 R. Gwin Follis, January 1, 1950–December 1966 Otto N. Miller, December 1966–January 1974 Harold J. Haynes, January 1974–May 1981 George M. Keller, May 1981–January 1, 1989 Kenneth T. Derr, January 1, 1989 – January 1, 2000 David J. O'Reilly, January 1, 2000 – December 31, 2009 John S. Watson December 31, 2009 – February 1, 2018 Michael K. Wirth, February 1, 2018–present President George Loomis, September 10, 1879 – December 15, 1879 Charles N. Felton, December 15, 1879–August 1885 George Loomis, August 1885–April 8, 1894 Charles N. Felton, April 17, 1894–February 1896 Gordon Blanding, February 1896–October 17, 1900 Henry M. Tilford, December 18, 1900 – February 20, 1911 James A. Moffett, February 20, 1911 – December 1, 1911 Demetrius G. Scofield, December 5, 1911 – March 8, 1917 Kenneth R. Kingsbury, April 28, 1919 – November 22, 1937 William H. Berg, December 10, 1937 – June 26, 1940 Harry D. Collier, July 8, 1940 – October 25, 1945 R. Gwin Follis, October 25, 1945 – January 9, 1948 Theodore S. Petersen, January 9, 1948 – October 26, 1961 Otto N. Miller, October 26, 1961–December 1966 James E. Gosline, December 1966–July 30, 1969 Harold J. Haynes, July 30, 1969–January 1974 John R. Grey, January 1974–December 31, 1985 office abolished Current Board of directors Wanda Austin John B. Frank Alice P. Gast Enrique Hernandez Jr. John B. Hess Marillyn Hewson Jon M. Huntsman Jr. Charles Moorman Dambisa Moyo Debra Reed-Klages Ronald Sugar (Lead independent director) Inge Thulin Jim Umpleby Cynthia J. Warner Mike Wirth (Chairman & CEO) Criticism and concerns Chevron has been widely criticized and attacked for scandals, accidents, and activities mostly related to climate change. Chevron has been fined by the governments of Angola, for oil spills within its waters, and the United States through its EPA for violations of the US Clean Air Act and pollutive activities arising out of its Richmond Refinery in California. On multiple instances, authorities in oil-heavy countries have fired rounds onto protestors against Chevron. Environmental activists have held annual anti-Chevron protests, usually within a week of Chevron's annual meeting of shareholders. One case heavily promoted on social media is about work done in the Lago Agrio oil field by Texaco, which Chevron acquired in 2001. Texaco dumped 18 billion tons of toxic waste and spilled 17 million US gallons (64,000,000 L) of petroleum. Texaco's activities were the subject of an Ecuadorian court case brought by Steven Donziger, which claimed an $18 billion and later reduced $9.5 billion judgment. Chevron has played a significant role in the exploitation of natural gas resources in the Eastern Mediterranean, including the Leviathan and Tamar fields off Israel's coast. The company has financially benefited from Israel's control over maritime resources to which Palestinians have been denied access due to the blockade of the Gaza Strip and lack of maritime sovereignty. A major point of contention involves Texaco's operations in the Ecuadorian Amazon from the 1960s until 1992. Critics allege that during this period, the company deliberately discharged approximately 72 billion liters (18 billion gallons) of toxic waste directly into the rainforest's rivers and lands as a cost-saving measure instead of utilizing proper disposal methods. This contamination is reported to have devastated local ecosystems, poisoned water sources used by indigenous communities for drinking and sustenance, and led to widespread health issues, including illnesses and physical ailments. Some experts and affected parties have referred to this environmental damage as the \"Amazon Chernobyl\". It is claimed that these were not accidental spills but rather the result of systematically engineered dumping practices. Local communities initially reported changes in water taste but were allegedly dismissed by the company, which purportedly suggested the water contained beneficial \"vitamins\". The environmental damage in Ecuador led to one of the largest environmental lawsuits in history (Aguinda v. Texaco, Inc.). In 2011, an Ecuadorian court found Chevron liable and ordered the company to pay $9.5 billion in damages to the affected communities. Chevron refused to pay the judgment, removed its assets from Ecuador, and vowed to fight the ruling indefinitely, with a company lawyer stating they would contest it \"until hell freezes over, and then fight it out on the ice\". Chevron allegedly lobbied the US government to impose sanctions on Ecuador following the ruling. In 2018, an international tribunal in The Hague ruled in favor of Chevron, stating that the 2011 Ecuador Supreme Court ruling had been obtained through fraud, bribery and corruption. The majority of Chevron's crude oil from the Amazon is processed in California at the El Segundo refinery. Steven Donziger, an American lawyer who represented the Ecuadorian plaintiffs for decades, became a central figure in the subsequent legal battles. Chevron pursued legal action against Donziger in the United States, accusing him of obtaining the Ecuadorian judgment through bribery and fraud. A key witness in Chevron's US case against Donziger, Alberto Guerra, later admitted under oath in an international tribunal that Chevron had paid him substantial sums (reportedly over $1 million and ongoing benefits) to provide false testimony against Donziger, requiring extensive coaching over 50 days. The US case against Donziger was overseen by Judge Lewis A. Kaplan, who critics note had financial ties to Chevron. When Donziger appealed Kaplan's order to turn over his computer and phone citing attorney-client privilege, Kaplan referred the matter for criminal contempt charges. After the US Attorney's office declined to prosecute, Judge Kaplan appointed a private law firm, Gibson Dunn & Crutcher (which has represented Chevron), to prosecute Donziger in the court's name – an unusual move described as the first corporate criminal prosecution in US history. Donziger was subsequently placed under house arrest for 993 days while awaiting trial on the misdemeanor charge. He was ultimately convicted of contempt of court and served time in prison, receiving a sentence critics claim exceeded the legal maximum for the offense. As a result of these legal battles, Donziger was disbarred, had his bank accounts frozen, and reportedly faces ongoing restrictions preventing him from working, holding accounts, or leaving the US. Chevron also sued Donziger for $60 billion, described as the largest amount sought from an individual in US history. Critics assert that Chevron's actions against Donziger were intended to make an example of him and deter other lawyers from challenging the company over environmental damages worldwide. Concerns have also been raised about Chevron's oil extraction activities in urban settings like Los Angeles. Observers note the presence of active oil wells located directly adjacent to homes and schools, particularly in lower-income areas. In wealthier neighborhoods, such as Beverly Hills, Chevron allegedly camouflages its drilling operations within large, windowless structures designed to look like ordinary office buildings or service facilities, hiding numerous wells from public view. One such disguised oil pump at Beverly Hills High School, dubbed the \"Tower of Hope,\" reportedly drew attention only after it caught fire. Furthermore, Chevron is accused of improperly abandoning depleted wells in the city, leaving behind toxic sites that pose ongoing health risks (such as nosebleeds or respiratory issues) to nearby residents and can potentially lead to hazardous events like eruptions of toxic sludge. Critics argue that, similar to the situation in Ecuador, regulatory oversight in these areas appears insufficient to prevent these practices or hold the company accountable for remediation. Critics argue that these incidents reflect a broader business model employed by Chevron and other large resource extraction companies. This alleged model involves entering countries, extracting resources as cheaply as possible (often with minimal environmental safeguards), dumping waste products to cut costs, and leaving local communities to deal with the long-term environmental and health consequences. The company is accused of using its significant financial and legal resources (employing thousands of lawyers and spending billions on litigation in the Ecuador case) to overwhelm opponents, delay legal proceedings, influence governments, and avoid accountability for damages caused by its operations globally."
}