{
  "ticker": "D",
  "cik": "0000715957",
  "company_name": "Dominion Energy",
  "corrected_name": "Dominion Energy",
  "wiki_title_used": "Dominion Energy",
  "exists": true,
  "raw_text": "Dominion Energy, Inc., commonly referred to as Dominion, is an American energy company headquartered in Richmond, Virginia that supplies electricity in parts of Virginia, North Carolina, and South Carolina and supplies natural gas to parts of Utah, Idaho and Wyoming, West Virginia, Ohio, Pennsylvania, North Carolina, South Carolina, and Georgia. Dominion also has generation facilities in Indiana, Illinois, Connecticut, and Rhode Island.\nThe company acquired Questar Corporation in the Western United States, including parts of Utah and Wyoming, in September 2016. In January 2019, Dominion Energy completed its acquisition of SCANA Corporation.\n\nOverview\nThe company's asset portfolio includes 27,000 megawatts of power generation, 6,000 miles (9,700 km) of electric transmission lines, 54,000 miles (87,000 km) of distribution lines, 14,000 miles (23,000 km) of natural gas transmission, gathering and storage pipeline, and 1.2 trillion cubic feet (34 km3) equivalent of natural gas and oil reserves. Dominion also operates the nation's largest natural gas storage facility, amounting to more than 975 billion cubic feet (2.76×1010 m3) of storage capacity. The company's Cove Point liquefied natural gas (LNG) import terminal on the Chesapeake Bay is one of the nation's largest and busiest facilities of its kind. Dominion serves more than 5 million retail energy customers in the Midwest, mid-Atlantic and Northeast regions of the U.S.\nIn 2017, Dominion was listed at #238 on the Fortune 500. A book about the company's 100-year history, Dominion’s First Century: A Legacy of Service, was published in 2010.\n\nGeneration statistics\nIn 2022, 18 percent of Dominion's total electric production came from coal, 23 percent from nuclear power, 48 percent from natural gas, and 11 percent from hydroelectricity and other renewables. A strategy is being developed for renewable energy sources, primarily wind and biomass, and conservation and efficiency programs to play an increasingly important role in meeting future energy needs and minimizing the company's environmental footprint.\n\nHistory\nDominion's corporate roots reach back to the Colonial era through predecessor companies that operated canal and river barging, street lighting, railways, and electric trolleys. \nIn 1787, the Virginia General Assembly created the Appomattox Trustees to promote navigation along the Appomattox River. In 1795, the trustees formed the Upper Appomattox Company to build dams along the river for industrial use, beginning Dominion's history. In 1901, the water rights passed to the newly formed Virginia Passenger & Power Company.\nDominion's closest direct corporate ancestor, Virginia Railway & Power Company, was founded by Frank Jay Gould on June 29, 1909. It bought Virginia Passenger & Power soon afterward. In 1925, the name was changed to the Virginia Electric and Power Company (VEPCO), a regulated monopoly. In 1940, VEPCO doubled its service territory by merging with the Virginia Public Service Company. The transit operations were sold in 1944. In 1980, VEPCO began branding itself as \"Virginia Power,\" while branding its North Carolina operations as \"North Carolina Power.\" Three years later, VEPCO reorganized as a holding company, Dominion Resources.\nBy 1985, Dominion split its distribution operations among two operating companies: Virginia Power (operating in Virginia and the Greenbrier Valley of West Virginia) and North Carolina Power (operating in North Carolina). In 1986, Dominion gained territory by expanding in Northern Virginia after purchasing the Virginia distribution territory of Potomac Electric Power Company (PEPCO). In 1987, the West Virginia assets of Dominion were sold to Utilicorp United becoming branded as West Virginia Power, but Dominion retained ownership of the Mount Storm Power Station in West Virginia. (In 1999, West Virginia Power would be sold to Allegheny Energy and folded into its Monongahela Power subsidiary; it and other Allegheny Energy subsidiaries have since been acquired in 2010 by FirstEnergy.)\n\nThroughout the 1980s and 1990s, Dominion initiated a series of expansions into regulated and non-regulated energy businesses, both domestically and internationally. During that era, the company also established itself as a world-class operator of nuclear power stations.\nIn 2000, Dominion bought Consolidated Natural Gas Company (CNG) of Pittsburgh, and added natural gas service to its energy delivery network in the energy-intensive markets in the Northeastern quadrant of the U.S. In 2001, Dominion bought Louis Dreyfus Natural Gas Company, adding to its natural gas delivery network.\nDominion re-branded all of its operations in 2000 to Dominion from Virginia and North Carolina Power as well as Consolidated Gas in order to create a more unified energy company. In 2007, as part of another effort to refocus on core electric and gas operations, Dominion sold most of its Houston-based natural gas and oil exploration and production business for pre-tax proceeds of nearly $14 billion. Its onshore US oil and gas reserves were sold in separate deals to Loews Corporation and to XTO Energy, while its Gulf of Mexico reserves were sold to Eni, and its Canadian reserves were sold to two Canadian trusts. Dominion still retains some production areas in Appalachia, however.\nIn February 2016, Dominion Resources announced that it would be acquiring Questar Corporation. The acquisition was completed in September 2016.\nIn 2017, Dominion Resources rebranded itself to Dominion Energy, following with a new logo.\nIn January 2018, Reuters reported that Dominion Energy would be buying SCANA Corporation for $7.9 billion.; the acquisition was completed in January 2019.\nIn the summer of 2018, Dominion Energy launched a \"grid transformation program.\" The program's aim was to build 3,000 megawatts worth of new solar and wind energy by the year 2022. The program was launched under the authority of the Grid Transformation & Security Act, a state law signed by Virginia Governor Ralph Northam. \"The law paves the way for expanded investments in renewable energy, smart grid technology, a stronger, more secure grid and energy efficiency programs . . .\"\nIn July 2020, Dominion announced plans to sell natural gas transmission and storage assets to Berkshire Hathaway; the size of the deal is estimated at $10 billion.\nIn February 2022, Dominion Energy sold one of its subsidiary, Dominion Energy West Virginia, to  Hearthstone Utilities Inc. for $690 million. Hearthstone will continue operations in West Virginia under the name: \"Hope Gas\".\nIn September 2023, Enbridge agreed to acquire East Ohio Gas, Questar Gas, and Public Service Co. of North Carolina, from Dominion for a total enterprise value worth $14 billion.\n\nOperations\nDominion has four operating segments:\n\nDominion Generation\nDominion generates electricity for both regulated sale in its Virginia and North Carolina markets, and also for wholesale in other markets in the Northeast and Midwest United States. Electricity generation is the largest unit of Dominion.\n\nDominion Virginia and North Carolina Power\nDominion is a regulated electric utility that transmits, and distributes electricity from its power plants in Virginia, North Carolina, Connecticut, and West Virginia to customers.\n\nDominion Energy\nNatural gas distribution\nNatural gas transmission and storage\nProducer services\nSolar Funding – Tredegar Solar Fund I, LLC\n\nDominion Exploration and Production\nDominion Exploration and Production was the natural gas and oil exploration and production subsidiary of Dominion, and by 2007 was one of the largest independent natural gas and oil operators.  During 2007, Dominion sold the majority of its oil and natural gas exploration and production assets to put additional focus on growing its electric generation and energy distribution, transmission, storage and retail businesses mainly in Virginia, West Virginia, and North Carolina.\n\nExpansion plans\nDominion was a partner in a joint venture that planned to build the 600 miles (970 km) Atlantic Coast Pipeline, a natural gas pipeline to run between West Virginia and North Carolina. Though the project had faced stiff opposition from environmental and community heritage groups along its route, ground was broken on the pipeline in Lewis County, West Virginia, in May 2018. Dominion and Duke Energy canceled the pipeline in July 2020, citing cost increases due to lawsuits, largely from environmental groups opposed to the project.\nDominion is constructing a massive offshore wind farm off of the coast of Virginia, the project being named Coastal Virginia Offshore Wind, or CVOW. This project will add more than 2,600 megawatts of clean energy to their grid, with 220 wind turbines capable of powering 650,000 homes at peak. This project will be the country's second offshore wind project, but the first of its kind to be installed in federal waters, sited roughly 27 miles off the Virginian coast. Dominion currently has two turbines constructed as a pilot project, planning for all turbines to be in place by 2026. In December 2020, the keel was laid for the project's novel Jones Act-compliant offshore WTIV, the Charybdis, under construction at Keppel AmFELS shipyards in Brownsville, Texas.\n\nPolitical activities\nThe Dominion Political Action Committee (PAC) has been very active in donating to Virginia candidates. In 2009, the Dominion PAC donated a total of $814,885 with 56% going to Republicans and 41% to Democrats. In 2008, the PAC donated $539,038 with 50% going to Republicans and 47% to Democrats. In the 2016 election cycle, the PAC contributed $1,276,016.17 to various political candidates and committees.\nLobbyists for Dominion worked to pass West Virginia's Critical Infrastructure Protection Act, a 2021 law creating felony penalties for trespassing offenses targeting oil and gas facilities, which was described by its sponsor John Kelly as having been \"requested by the natural gas industry\".\n\nCharitable contributions\nDominion's social investment program is carried out primarily through the Dominion Foundation, which gives about $20 million each year to charities in the states in which Dominion does business.\nDominion also has the Benjamin J. Lambert, III, Volunteer of the Year Program.  2017 was the thirty-third year of the program recognizing top company volunteers.  Dominion honors the volunteers by paying $1000 to the charity of the individual's choice.  In 2016, twelve employees from Ohio, Pennsylvania, Virginia and West Virginia were selected.\nIn 2020, Dominion responded to the coronavirus pandemic by stopping service disconnects for non-payment and helping customers who had been disconnected for not making payments to reconnect to its service. It is also waiving late and reconnection fees. The company has also directed its charitable foundation to provide $1 million in aid to help individuals and organizations fighting COVID-19. The $1 million will be offered to national groups like the American Red Cross and local organizations the company identifies.\n\nControversies\nHigh voltage lines\nA number of controversies have surrounded the company's decisions to develop new routes for its electric power transmission lines. On February 13, 2007, The Washington Post reported that the power company was planning to change the route of one 500 kV transmission line to appease critics in Northern Virginia from a route that would cut through protected forest and farmland to a southern route that would bypass nature preserves and Civil War sites by running adjacent to existing power lines. However, U.S. Congressional Representative Frank Wolf (R - VA) and Governor Tim Kaine (D) remained opposed to the line, saying that there was no real need, and that Dominion was trying to bring cheap electricity from the Midwest. Dominion contested, saying that the line would bring needed electricity to growing Northern Virginia. The proposal was accepted by the State Corporation Commission (SCC) on October 7, 2008.\nOn February 15, 2008, the SCC approved a controversial proposal for a 230 kV Dominion Virginia transmission line that would travel above ground for 1.8 miles (2.9 km) along a wooded portion of the Washington & Old Dominion Railroad Trail between Leesburg and Clarks Gap in Loudoun County, which Dominion again claimed was necessary for power reliability. Less than three weeks later, on March 4 and March 5, 2008, the Senate and the House of Delegates of the Virginia General Assembly unanimously passed emergency legislation that ordered the SCC to approve the underground construction of the line along that section of the trail as part of a four-part statewide pilot program for the development of underground transmission lines. Sponsored by Delegate Joe T. May (R - Loudoun), the legislation exempted the project from any requirements for further SCC analyses relating to the impacts of the route, including environmental impacts and impacts upon historical resources. The legislation went into effect when Virginia Governor Tim Kaine approved it on April 2, 2008.\n\nWise County power plant\nThe company began constructing a 605 MWe coal fired power station in Wise County, Virginia in June 2008.  As of December 2009, the construction had reached the halfway point, with the plant scheduled to be fully operational in mid-2012. Dominion calls the plant the \"Virginia City Hybrid Energy Center,\" which has been criticized by environmentalists as a way to make the plant sound environmentally friendly. The plant does however have the most stringent air permit for any coal fired power plant in the nation currently. The plant will burn up to 20% biomass along with coal and a small amount of waste coal known as gob.  The plant's carbon dioxide emissions are currently projected to be 5.4 million tons per year. High levels of mercury emitted from the plant, which is controlled by activated carbon injection to reduce the emissions, as well as a fly ash dump near the Clinch River (a source of drinking water) are also of concern. The plant would also continue to support mountaintop removal coal mining. Supporters, including Governor Tim Kaine, stated that as one of the largest importers of electricity, Virginia could become less dependent on importing electricity from other states with a new power plant. The plant brought 1000 workers to build, and will employ 130 full-time, as well as pay 4 to 7 million dollars of tax revenue yearly to economically depressed Wise County. In September 2008, the site was blockaded by activists from the Rainforest Action Network.\n\nCove Point LNG import facility\nIn 2001 when Dominion's Dominion Cove Point LNG subsidiary was scheduled to reopen, many local residents were concerned about the proximity (only 3 miles) to the Calvert Cliffs Nuclear Power Plant, and the damage that could be caused by an attack or an explosion at the plant. Residents thought that the Federal Energy Regulatory Commission did not consider the risks before opening the plant.\nIn 2005, Washington Gas claimed that the natural gas imported at the plant was too \"hot,\" meaning that it contained fewer heavy hydrocarbons and burned hotter. Washington Gas said that the hot gas caused problems for its customers and caused many of its mains to break. Dominion denied that the imported gas was the cause of the breaks and stated that expanding the area serviced by the imported gas would not cause additional leaks in the District of Columbia and Northern Virginia suburbs.\n\nEnvironmental record\nIn 2010, the Political Economy Research Institute ranked Dominion Resources 51st among corporations emitting airborne pollutants in the United States. Dominion's Toxic Score of 16,656 (pounds released × toxicity × population exposure) represents a significant improvement from both the 2008 report (Dominion ranked 27th with a Toxic Score of 58,642) and the 2005 report (Dominion ranked 19th with a Toxic Score of 117,712) In December 2007, a settlement between the United States Environmental Protection Agency (EPA) and Dominion Energy of Brayton Point called for the company's power generating plant to install new closed cycle cooling towers that provided significant protection to aquatic organisms in Mount Hope Bay, which flows into Narragansett Bay. The 2007 settlement resolved an ongoing dispute that began in 2003. The EPA issued a final discharge permit called a National Pollution Discharge Elimination System (NPDES) for the Brayton Point Power Station requiring significant reductions in thermal discharges to, and water intake from, Mount Hope Bay. In 2002, Dominion was responsible for 1,110,703 pounds of gastrointestinal or liver toxicant emissions, 1,440,000 pounds of musculoskeletal toxicant emissions, and 1,489,763 pounds of suspected respiratory toxicant emissions, and 1,478,383 pounds of suspected skin or sense organ toxicant emissions among other emissions that are suspected to be hazardous.\nOn August 12, 2025, police in Mount Pleasant, South Carolina,  released a dashcam footage capturing a lightning strike hitting the Dominion Energy infrastructure, erupting into a massive fireball.\n\nSee also\nCoastal Virginia Offshore Wind\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Dominion Energy, Inc.:",
  "clean_text": "Dominion Energy, Inc., commonly referred to as Dominion, is an American energy company headquartered in Richmond, Virginia that supplies electricity in parts of Virginia, North Carolina, and South Carolina and supplies natural gas to parts of Utah, Idaho and Wyoming, West Virginia, Ohio, Pennsylvania, North Carolina, South Carolina, and Georgia. Dominion also has generation facilities in Indiana, Illinois, Connecticut, and Rhode Island. The company acquired Questar Corporation in the Western United States, including parts of Utah and Wyoming, in September 2016. In January 2019, Dominion Energy completed its acquisition of SCANA Corporation. Overview The company's asset portfolio includes 27,000 megawatts of power generation, 6,000 miles (9,700 km) of electric transmission lines, 54,000 miles (87,000 km) of distribution lines, 14,000 miles (23,000 km) of natural gas transmission, gathering and storage pipeline, and 1.2 trillion cubic feet (34 km3) equivalent of natural gas and oil reserves. Dominion also operates the nation's largest natural gas storage facility, amounting to more than 975 billion cubic feet (2.76×1010 m3) of storage capacity. The company's Cove Point liquefied natural gas (LNG) import terminal on the Chesapeake Bay is one of the nation's largest and busiest facilities of its kind. Dominion serves more than 5 million retail energy customers in the Midwest, mid-Atlantic and Northeast regions of the U.S. In 2017, Dominion was listed at #238 on the Fortune 500. A book about the company's 100-year history, Dominion’s First Century: A Legacy of Service, was published in 2010. Generation statistics In 2022, 18 percent of Dominion's total electric production came from coal, 23 percent from nuclear power, 48 percent from natural gas, and 11 percent from hydroelectricity and other renewables. A strategy is being developed for renewable energy sources, primarily wind and biomass, and conservation and efficiency programs to play an increasingly important role in meeting future energy needs and minimizing the company's environmental footprint. History Dominion's corporate roots reach back to the Colonial era through predecessor companies that operated canal and river barging, street lighting, railways, and electric trolleys. In 1787, the Virginia General Assembly created the Appomattox Trustees to promote navigation along the Appomattox River. In 1795, the trustees formed the Upper Appomattox Company to build dams along the river for industrial use, beginning Dominion's history. In 1901, the water rights passed to the newly formed Virginia Passenger & Power Company. Dominion's closest direct corporate ancestor, Virginia Railway & Power Company, was founded by Frank Jay Gould on June 29, 1909. It bought Virginia Passenger & Power soon afterward. In 1925, the name was changed to the Virginia Electric and Power Company (VEPCO), a regulated monopoly. In 1940, VEPCO doubled its service territory by merging with the Virginia Public Service Company. The transit operations were sold in 1944. In 1980, VEPCO began branding itself as \"Virginia Power,\" while branding its North Carolina operations as \"North Carolina Power.\" Three years later, VEPCO reorganized as a holding company, Dominion Resources. By 1985, Dominion split its distribution operations among two operating companies: Virginia Power (operating in Virginia and the Greenbrier Valley of West Virginia) and North Carolina Power (operating in North Carolina). In 1986, Dominion gained territory by expanding in Northern Virginia after purchasing the Virginia distribution territory of Potomac Electric Power Company (PEPCO). In 1987, the West Virginia assets of Dominion were sold to Utilicorp United becoming branded as West Virginia Power, but Dominion retained ownership of the Mount Storm Power Station in West Virginia. (In 1999, West Virginia Power would be sold to Allegheny Energy and folded into its Monongahela Power subsidiary; it and other Allegheny Energy subsidiaries have since been acquired in 2010 by FirstEnergy.) Throughout the 1980s and 1990s, Dominion initiated a series of expansions into regulated and non-regulated energy businesses, both domestically and internationally. During that era, the company also established itself as a world-class operator of nuclear power stations. In 2000, Dominion bought Consolidated Natural Gas Company (CNG) of Pittsburgh, and added natural gas service to its energy delivery network in the energy-intensive markets in the Northeastern quadrant of the U.S. In 2001, Dominion bought Louis Dreyfus Natural Gas Company, adding to its natural gas delivery network. Dominion re-branded all of its operations in 2000 to Dominion from Virginia and North Carolina Power as well as Consolidated Gas in order to create a more unified energy company. In 2007, as part of another effort to refocus on core electric and gas operations, Dominion sold most of its Houston-based natural gas and oil exploration and production business for pre-tax proceeds of nearly $14 billion. Its onshore US oil and gas reserves were sold in separate deals to Loews Corporation and to XTO Energy, while its Gulf of Mexico reserves were sold to Eni, and its Canadian reserves were sold to two Canadian trusts. Dominion still retains some production areas in Appalachia, however. In February 2016, Dominion Resources announced that it would be acquiring Questar Corporation. The acquisition was completed in September 2016. In 2017, Dominion Resources rebranded itself to Dominion Energy, following with a new logo. In January 2018, Reuters reported that Dominion Energy would be buying SCANA Corporation for $7.9 billion.; the acquisition was completed in January 2019. In the summer of 2018, Dominion Energy launched a \"grid transformation program.\" The program's aim was to build 3,000 megawatts worth of new solar and wind energy by the year 2022. The program was launched under the authority of the Grid Transformation & Security Act, a state law signed by Virginia Governor Ralph Northam. \"The law paves the way for expanded investments in renewable energy, smart grid technology, a stronger, more secure grid and energy efficiency programs . . .\" In July 2020, Dominion announced plans to sell natural gas transmission and storage assets to Berkshire Hathaway; the size of the deal is estimated at $10 billion. In February 2022, Dominion Energy sold one of its subsidiary, Dominion Energy West Virginia, to Hearthstone Utilities Inc. for $690 million. Hearthstone will continue operations in West Virginia under the name: \"Hope Gas\". In September 2023, Enbridge agreed to acquire East Ohio Gas, Questar Gas, and Public Service Co. of North Carolina, from Dominion for a total enterprise value worth $14 billion. Operations Dominion has four operating segments: Dominion Generation Dominion generates electricity for both regulated sale in its Virginia and North Carolina markets, and also for wholesale in other markets in the Northeast and Midwest United States. Electricity generation is the largest unit of Dominion. Dominion Virginia and North Carolina Power Dominion is a regulated electric utility that transmits, and distributes electricity from its power plants in Virginia, North Carolina, Connecticut, and West Virginia to customers. Dominion Energy Natural gas distribution Natural gas transmission and storage Producer services Solar Funding – Tredegar Solar Fund I, LLC Dominion Exploration and Production Dominion Exploration and Production was the natural gas and oil exploration and production subsidiary of Dominion, and by 2007 was one of the largest independent natural gas and oil operators. During 2007, Dominion sold the majority of its oil and natural gas exploration and production assets to put additional focus on growing its electric generation and energy distribution, transmission, storage and retail businesses mainly in Virginia, West Virginia, and North Carolina. Expansion plans Dominion was a partner in a joint venture that planned to build the 600 miles (970 km) Atlantic Coast Pipeline, a natural gas pipeline to run between West Virginia and North Carolina. Though the project had faced stiff opposition from environmental and community heritage groups along its route, ground was broken on the pipeline in Lewis County, West Virginia, in May 2018. Dominion and Duke Energy canceled the pipeline in July 2020, citing cost increases due to lawsuits, largely from environmental groups opposed to the project. Dominion is constructing a massive offshore wind farm off of the coast of Virginia, the project being named Coastal Virginia Offshore Wind, or CVOW. This project will add more than 2,600 megawatts of clean energy to their grid, with 220 wind turbines capable of powering 650,000 homes at peak. This project will be the country's second offshore wind project, but the first of its kind to be installed in federal waters, sited roughly 27 miles off the Virginian coast. Dominion currently has two turbines constructed as a pilot project, planning for all turbines to be in place by 2026. In December 2020, the keel was laid for the project's novel Jones Act-compliant offshore WTIV, the Charybdis, under construction at Keppel AmFELS shipyards in Brownsville, Texas. Political activities The Dominion Political Action Committee (PAC) has been very active in donating to Virginia candidates. In 2009, the Dominion PAC donated a total of $814,885 with 56% going to Republicans and 41% to Democrats. In 2008, the PAC donated $539,038 with 50% going to Republicans and 47% to Democrats. In the 2016 election cycle, the PAC contributed $1,276,016.17 to various political candidates and committees. Lobbyists for Dominion worked to pass West Virginia's Critical Infrastructure Protection Act, a 2021 law creating felony penalties for trespassing offenses targeting oil and gas facilities, which was described by its sponsor John Kelly as having been \"requested by the natural gas industry\". Charitable contributions Dominion's social investment program is carried out primarily through the Dominion Foundation, which gives about $20 million each year to charities in the states in which Dominion does business. Dominion also has the Benjamin J. Lambert, III, Volunteer of the Year Program. 2017 was the thirty-third year of the program recognizing top company volunteers. Dominion honors the volunteers by paying $1000 to the charity of the individual's choice. In 2016, twelve employees from Ohio, Pennsylvania, Virginia and West Virginia were selected. In 2020, Dominion responded to the coronavirus pandemic by stopping service disconnects for non-payment and helping customers who had been disconnected for not making payments to reconnect to its service. It is also waiving late and reconnection fees. The company has also directed its charitable foundation to provide $1 million in aid to help individuals and organizations fighting COVID-19. The $1 million will be offered to national groups like the American Red Cross and local organizations the company identifies. Controversies High voltage lines A number of controversies have surrounded the company's decisions to develop new routes for its electric power transmission lines. On February 13, 2007, The Washington Post reported that the power company was planning to change the route of one 500 kV transmission line to appease critics in Northern Virginia from a route that would cut through protected forest and farmland to a southern route that would bypass nature preserves and Civil War sites by running adjacent to existing power lines. However, U.S. Congressional Representative Frank Wolf (R - VA) and Governor Tim Kaine (D) remained opposed to the line, saying that there was no real need, and that Dominion was trying to bring cheap electricity from the Midwest. Dominion contested, saying that the line would bring needed electricity to growing Northern Virginia. The proposal was accepted by the State Corporation Commission (SCC) on October 7, 2008. On February 15, 2008, the SCC approved a controversial proposal for a 230 kV Dominion Virginia transmission line that would travel above ground for 1.8 miles (2.9 km) along a wooded portion of the Washington & Old Dominion Railroad Trail between Leesburg and Clarks Gap in Loudoun County, which Dominion again claimed was necessary for power reliability. Less than three weeks later, on March 4 and March 5, 2008, the Senate and the House of Delegates of the Virginia General Assembly unanimously passed emergency legislation that ordered the SCC to approve the underground construction of the line along that section of the trail as part of a four-part statewide pilot program for the development of underground transmission lines. Sponsored by Delegate Joe T. May (R - Loudoun), the legislation exempted the project from any requirements for further SCC analyses relating to the impacts of the route, including environmental impacts and impacts upon historical resources. The legislation went into effect when Virginia Governor Tim Kaine approved it on April 2, 2008. Wise County power plant The company began constructing a 605 MWe coal fired power station in Wise County, Virginia in June 2008. As of December 2009, the construction had reached the halfway point, with the plant scheduled to be fully operational in mid-2012. Dominion calls the plant the \"Virginia City Hybrid Energy Center,\" which has been criticized by environmentalists as a way to make the plant sound environmentally friendly. The plant does however have the most stringent air permit for any coal fired power plant in the nation currently. The plant will burn up to 20% biomass along with coal and a small amount of waste coal known as gob. The plant's carbon dioxide emissions are currently projected to be 5.4 million tons per year. High levels of mercury emitted from the plant, which is controlled by activated carbon injection to reduce the emissions, as well as a fly ash dump near the Clinch River (a source of drinking water) are also of concern. The plant would also continue to support mountaintop removal coal mining. Supporters, including Governor Tim Kaine, stated that as one of the largest importers of electricity, Virginia could become less dependent on importing electricity from other states with a new power plant. The plant brought 1000 workers to build, and will employ 130 full-time, as well as pay 4 to 7 million dollars of tax revenue yearly to economically depressed Wise County. In September 2008, the site was blockaded by activists from the Rainforest Action Network. Cove Point LNG import facility In 2001 when Dominion's Dominion Cove Point LNG subsidiary was scheduled to reopen, many local residents were concerned about the proximity (only 3 miles) to the Calvert Cliffs Nuclear Power Plant, and the damage that could be caused by an attack or an explosion at the plant. Residents thought that the Federal Energy Regulatory Commission did not consider the risks before opening the plant. In 2005, Washington Gas claimed that the natural gas imported at the plant was too \"hot,\" meaning that it contained fewer heavy hydrocarbons and burned hotter. Washington Gas said that the hot gas caused problems for its customers and caused many of its mains to break. Dominion denied that the imported gas was the cause of the breaks and stated that expanding the area serviced by the imported gas would not cause additional leaks in the District of Columbia and Northern Virginia suburbs. Environmental record In 2010, the Political Economy Research Institute ranked Dominion Resources 51st among corporations emitting airborne pollutants in the United States. Dominion's Toxic Score of 16,656 (pounds released × toxicity × population exposure) represents a significant improvement from both the 2008 report (Dominion ranked 27th with a Toxic Score of 58,642) and the 2005 report (Dominion ranked 19th with a Toxic Score of 117,712) In December 2007, a settlement between the United States Environmental Protection Agency (EPA) and Dominion Energy of Brayton Point called for the company's power generating plant to install new closed cycle cooling towers that provided significant protection to aquatic organisms in Mount Hope Bay, which flows into Narragansett Bay. The 2007 settlement resolved an ongoing dispute that began in 2003. The EPA issued a final discharge permit called a National Pollution Discharge Elimination System (NPDES) for the Brayton Point Power Station requiring significant reductions in thermal discharges to, and water intake from, Mount Hope Bay. In 2002, Dominion was responsible for 1,110,703 pounds of gastrointestinal or liver toxicant emissions, 1,440,000 pounds of musculoskeletal toxicant emissions, and 1,489,763 pounds of suspected respiratory toxicant emissions, and 1,478,383 pounds of suspected skin or sense organ toxicant emissions among other emissions that are suspected to be hazardous. On August 12, 2025, police in Mount Pleasant, South Carolina, released a dashcam footage capturing a lightning strike hitting the Dominion Energy infrastructure, erupting into a massive fireball."
}