{
  "ticker": "DAL",
  "cik": "0000027904",
  "company_name": "Delta Air Lines",
  "corrected_name": "Delta Air Lines",
  "wiki_title_used": "Delta Air Lines",
  "exists": true,
  "raw_text": "Delta Air Lines, Inc. is a major airline in the United States headquartered in Atlanta, Georgia, operating nine hubs, with Hartsfield–Jackson Atlanta International Airport being its largest in terms of total passengers and number of departures. With its regional subsidiaries and contractors operating under the brand name Delta Connection, Delta has over 5,400 flights daily and serves 325 destinations in 52 countries on six continents. Delta is a founding member of the SkyTeam airline alliance which helps to extend its global network. It is the second-oldest operating commercial airline in the U.S., having begun passenger operations after United.\nDelta ranks first in revenue and brand value among the world's largest airlines, and second by number of passengers carried, passenger miles flown, and fleet size.  Listed 70th on the Fortune 500 list, Delta has topped The Wall Street Journal's annual rankings of airlines in 2022, 2023, and 2024 and earned first place in the 2024 Readers’ Choice Awards for Best Airlines in the U.S. by Condé Nast Traveler.\n\nHistory\nEarly history\nThe history of Delta Air Lines began with the world's first aerial crop dusting operation called Huff Daland Dusters, Inc. The company was founded on March 2, 1925, in Macon, Georgia, before moving to Monroe, Louisiana, in the summer of 1925. It flew a Huff-Daland Duster, the first true crop duster, designed to combat the boll weevil infestation of cotton crops. The first flight operated by Huff Daland Dusters departed from the airfield at Camp Wheeler, now Macon Downtown Airport, on March 23, 1925 to dust a peach orchard in Montezuma, Georgia. C.E. Woolman, general manager and later Delta's first CEO, led a group of local investors to acquire the company's assets. Delta Air Service was incorporated on December 3, 1928, and was named after the Mississippi Delta region.\nPassenger operations began on June 17, 1929, from Dallas, Texas, to Jackson, Mississippi, with stops at Shreveport and Monroe, Louisiana. By June 1930, service had extended east to Atlanta and west to Fort Worth, Texas. Passenger service ceased in October 1930 when the airmail contract for the route Delta had pioneered was awarded to another airline, which purchased the assets of Delta Air Service. Local banker Travis Oliver, acting as a trustee, C.E. Woolman, and other local investors purchased back the crop-dusting assets of Delta Air Service and incorporated as Delta Air Corporation on December 31, 1930.\nDelta Air Corporation secured an airmail contract in 1934, and began doing business as Delta Air Lines over Mail Route 24, stretching from Fort Worth, Texas, to Charleston, South Carolina. Delta moved its headquarters from Monroe, Louisiana, to its current location in Atlanta in 1941. The company name officially became Delta Air Lines in 1945. In 1946, the company commenced regularly scheduled freight transport. In 1949, the company launched the first discounted fares between Chicago and Miami. In 1953, the company launched its first international routes after the acquisition of Chicago and Southern Air Lines. In 1959, it was the first airline to fly the Douglas DC-8. In 1960, it was the first airline to fly Convair 880 jets. In 1964, it launched the Deltamatic reservation systems using computers in the IBM 7070 series. In 1965, Delta was the first airline to fly the McDonnell Douglas DC-9.\n\nGrowth and acquisitions\nBy 1970, Delta had an all-jet fleet, and in 1972 it acquired Northeast Airlines. Trans-Atlantic service began in 1978 with the first nonstop flights from Atlanta to London. In 1981, Delta launched a frequent-flyer program. In 1987, it acquired Western Airlines, and that same year Delta began trans-Pacific service (Atlanta to Portland, Oregon, to Tokyo). In 1990, Delta was the first airline in the United States to fly McDonnell Douglas MD-11 jets. In 1991, it acquired substantially all of Pan Am's trans-Atlantic routes and the Pan Am Shuttle, rebranded as the Delta Shuttle. Delta was now the leading airline across the Atlantic.\nIn 1997, Delta was the first airline to board more than 100 million passengers in a calendar year. Also that year, Delta began an expansion of its international routes into Latin America. In 2003, the company launched Song, a low-cost carrier.\n\nBankruptcy and restructuring (2005–2007)\nOn September 14, 2005, the company filed for bankruptcy, citing rising fuel costs. It emerged from bankruptcy in April 2007 after fending off a hostile takeover from US Airways and its shares were re-listed on the New York Stock Exchange.\n\nAcquisition of Northwest Airlines (2008–2010)\nThe acquisition of Northwest Airlines was announced on April 14, 2008. It was approved and consummated on October 29, 2008. Northwest continued to operate as a wholly owned subsidiary of Delta until December 31, 2009, when the Northwest Airlines operating certificate was merged into that of Delta. Delta completed integration with Northwest on January 31, 2010, when their computer reservations system and websites were combined, and the Northwest Airlines brand was officially retired.\n\nNetwork\nDelta and its worldwide alliance partners operate more than 15,000 flights per day, having operated 893 daily flights out of its Atlanta main hub in the summer of 2024. As of December 31, 2021, Delta's mainline aircraft fly to 242 destinations, serving 52 countries across six continents.\n\nDestinations\nAs of May 2025, Delta Air Lines operates or has previously operated to the following destinations. This table does not include destinations served by Delta's regional subsidiary, Delta Connection.\n\nHubs\nDelta currently has nine hubs:\n\nAtlanta: The airline's largest hub serving the Southern and Eastern United States and as its main gateway to Latin America and the Caribbean. Home to Delta's corporate headquarters, as well as Delta TechOps, the airline's primary maintenance base.\nBoston: Delta's secondary transatlantic hub. It offers service to destinations in Europe and North America.\nDetroit: One of Delta's two Midwest hubs. It is the primary Asian gateway for the Eastern United States and it also provides service to many destinations in the Americas and Europe.\nLos Angeles: Delta's secondary hub for the West Coast. It offers service to cities in Latin America, Asia, Australia, Europe, and major domestic cities and West Coast regional destinations.\nMinneapolis/St. Paul: One of Delta's two Midwest hubs. It is the primary Canadian gateway for the airline and also serves many American metropolitan destinations, many regional destinations in the upper Midwest, and some select destinations in Europe and Asia.\nNew York–JFK: Delta's primary transatlantic hub. The hub also offers service on transcontinental \"prestige routes\" to Los Angeles and San Francisco.\nNew York–LaGuardia: Delta's second New York hub. Delta's service at LaGuardia covers numerous East Coast U.S. cities and several regional destinations in the U.S. and Canada.\nSalt Lake City: Delta's hub for the Rocky Mountain region of the United States. Delta's service covers most major U.S. destinations and several regional destinations in the U.S., emphasizing the Rocky Mountains and select destinations in Canada and Mexico, and select cities in Europe, Hawaii and Asia.\nSeattle/Tacoma: Delta's primary West Coast hub. The hub serves as an international gateway to Asia for the Western United States. Delta service also includes many major U.S. destinations as well as regional destinations in the Pacific Northwest.\n\nDelta Connection\nAlliance and codeshare agreements\nDelta is a member of the SkyTeam alliance and has codeshare agreements with the following airlines:\n\nFleet\nCabin\nDelta underwent a cabin branding upgrade in 2015. Availability and exact details vary by route and aircraft type.\n\nDelta One\n\nDelta One is the airline's premier business class product, available on long-haul international flights, as well as transcontinental service from New York–Kennedy to Los Angeles and San Francisco.\nDelta One features lie-flat seating on all aircraft types and direct aisle access from every seat on all types except the Boeing 757-200 (in which only a special sub-fleet of approximately 20 aircraft feature lie-flats) and in their 'type 35L' ex-LATAM A350s (which use a 2-2-2 layout). The Boeing 767-300ER seats, designed by James Thompson, feature a space-saving design whereby the seats are staggered such that when in the fully flat position, the foot of each bed extends under the armrests of the seat in front of it. On the Airbus A330 cabins, Delta One features the Cirrus flat-bed sleeper suite by Zodiac Seats U.S., configured in a reverse herringbone pattern.\nAll seats are also equipped with a personal, on-demand in-flight-entertainment (IFE) system, universal power-ports, a movable reading light, and a folding work table. Passengers also receive meals, alcoholic beverages, an amenity kit, bedding, and pre-flight Delta Sky Club access.\nIn August 2016, Delta announced the introduction of Delta One Suites on select widebody fleets. The suites will feature a door to the aisle for enhanced privacy, as well as improved storage space, a larger IFE screen, and an updated design. The suites rolled out on the Airbus A350 fleet, first delivered in July 2017, followed by installation within the Boeing 777 fleet. Delta's Airbus A330-900, which began revenue service for the airline in July 2019, also features Delta One Suites. Also in July 2019, Delta began retrofitting a new seat on the 767-400ER, which featured increased privacy and design similar to Delta One Suites, though without a privacy door. These seats lack a door due to the 767's smaller cabin width.\n\nFirst Class\n\nFirst Class is offered on mainline domestic flights (except those featuring Delta One service), select short- and medium-haul international flights, and Delta Connection aircraft. Seats range from 18.5 to 20.75 inches (47.0 to 52.7 cm) wide and have between 37 and 40 inches (94 and 102 cm) of pitch. Passengers in this class receive a wider variety of free snacks compared to Main Cabin, as well as free drinks and alcohol, and full meal service on flights 900 miles (1,400 km) and longer. Certain aircraft also feature power ports at each seat and free entertainment products from Delta Studio. First Class passengers are also eligible for priority boarding.\n\nPremium Select\n\nIn April 2016, Delta CEO Ed Bastian announced that a new Premium Economy cabin would be added. Since renamed to Premium Select, this cabin will feature extra legroom; adjustable leg rests; extra seat pitch, width, and recline; and a new premium service. Delta introduced it on its new Airbus A350, first delivered in fall 2017, to be followed by the now-retired Boeing 777. In October 2018, Delta announced that it would be selling first class seats on domestically configured Boeing 757 aircraft flying transatlantic routes as Premium Select. Delta's A330-900, delivered in 2019, also offers Premium Select. In 2021, Delta began retrofitting many of its 767-300ER and older A330 aircraft with Premium Select.\n\nDelta Comfort+\n\nDelta Comfort+ seats are installed on all aircraft and feature 34–36 inches (860–910 mm) of pitch; on all Delta One configured aircraft, 35–36 inches (890–910 mm) of pitch and 50 percent more recline over standard Main Cabin seats. Additional amenities include: priority boarding, dedicated overhead space, complimentary beer, wine, and spirits on flights 250 miles (400 km) or more, and complimentary premium snacks on flights 900 miles (1,400 km) or more. Complimentary premium entertainment is available via Delta Studio, with free headsets available on most flights. On transcontinental flights between JFK-LAX/SFO, Delta Comfort+ passengers also get Luvo snack wraps. Certain Medallion members can upgrade from Main Cabin to Comfort+ for free right after booking, while other customers can upgrade for a fee or with SkyMiles.\n\nMain Cabin\n\nMain Cabin (Economy Class) is available on all aircraft with seats ranging from 17 to 18.6 inches (43 to 47 cm) wide and 30 to 33 inches (76 to 84 cm) of pitch. The main cabin on some aircraft has an articulating seat bottom where the seat bottom moves forward in addition to the seat back tilting backwards when reclining.\nMain Cabin passengers receive complimentary snacks and non-alcoholic drinks on all flights 250 miles (400 km) or longer. Alcoholic beverages are also available for purchase. Complimentary meals and alcoholic drinks are provided on long-haul international flights as well as selected transcontinental domestic flights, such as between New York–JFK and Seattle, San Francisco, Los Angeles, and San Diego. As part of Delta's Flight Fuel buy on board program, meals are available for purchase on other North American flights 900 miles (1,400 km) or longer.\nDelta operated a different buy-on-board program between 2003 and 2005. The previous program had items from differing providers, depending on the origin and destination of the flight. Prices ranged up to $10 ($16.65 when adjusted for inflation). The airline started the service on a few selected flights in July 2003, and the meal service was initially offered on 400 flights. Delta ended this buy-on-board program in 2005; instead, Delta began offering snacks at no extra charge on flights over 90 minutes to most U.S. domestic flights and some flights to the Caribbean and Latin America. Beginning in mid-March 2005 the airline planned to stop providing pillows on flights within the 48 contiguous U.S. states, Bermuda, Canada, the Caribbean, and Central America. In addition, the airline increased the price of alcoholic beverages on Delta mainline flights from $4 ($6.44 when adjusted for inflation) to $5 ($8.05 when adjusted for inflation); the increase in alcohol prices did not occur on Song flights.\n\nBasic Economy\nBasic Economy is a basic version of Main Cabin, offering the same services with fewer flexibility options for a lower price. Examples of fewer flexibility options include no ticket changes, no paid or complimentary upgrades regardless of frequent-flier status, and only having a seat assigned at check-in. As of December 2021, Basic Economy travelers no longer earn award miles (used for redeeming free travel, for example) or medallion qualifying miles (which count towards elite status).\n\nReward programs\nSkyMiles\nSkyMiles is the frequent flyer program for Delta Air Lines. Miles do not expire but accounts may be deactivated by Delta in certain cases, such as the death of a program member or fraudulent activity.\nAs part of its efforts to improve customer experience, Delta introduced several service upgrades in 2025. These included free Wi-Fi access for SkyMiles members on most domestic flights, expanded Delta Sky Club lounge facilities, and new premium dining options featuring branded offerings such as Shake Shack.\n\nDelta Sky Club\nDelta Sky Club is the branding name of Delta's airport lounges. Membership is available through an annual membership that can be purchased with either money or miles. International passengers travelling in Delta One class get free access. Membership can also be granted through top-level Delta status or by being an American Express cardholder with certain exceptions. As of January 2019, Delta no longer offered single-day passes.\nOriginally, Delta's membership-based airport clubs were called Crown Room lounges, with Northwest's called WorldClubs.\nExclusive Delta One Clubs for customers travelling in business class are slated to open at New York–Kennedy, Los Angeles, and Boston in 2024.\nIn February 2024, Delta announced a new, more exclusive or premium level of Sky Club lounge aimed at high-spending travellers. The first would be at New York's John F. Kennedy International Airport, followed by those in Boston's Logan International Airport and Los Angeles International Airport later in the year. In addition to wellness areas, the lounge would offer a full-service brasserie and a marketplace influenced or assisted by a chef that would feature an open kitchen. The move represented a shift away from a standard offering to something closer to a unique experience for each airport and the city in which the lounge was located.\n\nSkyBonus\nOn November 27, 2001, Delta Air Lines launched SkyBonus, a program aimed toward small-to-medium businesses spending between $5,000 and $500,000 annually on air travel. Businesses can earn points toward free travel and upgrades, as well as Sky Club memberships and SkyMiles Silver Medallion status. Points are earned on paid travel based on various fare amounts paid, booking codes, and place origin or destination. While enrolled businesses are able to earn points toward free travel, the travelling passenger is still eligible to earn SkyMiles during his or her travel.\nIn early 2010, Delta Air Lines merged its SkyBonus program with Northwest's similar Biz Perks program.\n\nCorporate affairs\nBusiness trends\nThe key trends for Delta Air Lines are (as of the financial year ending December 31):\n\nPersonnel\nBetween its mainline operation and subsidiaries, and as of December 2024, Delta employs nearly 103,000 people.\nDelta's 17,500 mainline pilots are represented by the Air Line Pilots Association, International and are the union's second largest pilot group. The company's approximately 180 flight dispatchers are represented by the Professional Airline Flight Control Association (PAFCA). Not counting the pilots and flight dispatchers, Delta is the only one of the five largest airlines in the United States, and one of only two in the top 9 (the other being JetBlue), whose non-pilot USA domestic staff is entirely non-union.\n\nDelta Global Staffing\nDelta Global Staffing (DGS) was a temporary employment firm located in Atlanta, Georgia. Delta Global Staffing was a wholly owned subsidiary of Delta Air Lines, Inc., and a division of the internal company DAL Global Services.\nDelta Air Lines sold majority ownership of DAL Global Services to Argenbright Holdings on December 21, 2018. As part of the sale, Delta dissolved the staffing division of DGS.\nIt was founded in 1995 as a provider of temporary staffing for Delta primarily in Atlanta.  DGS has since expanded to include customers and businesses outside the airline and aviation industries. DGS now supports customers in major US metropolitan areas.\nDelta Global Staffing provided contract workers for short and long term assignments, VMS partnering, VOP on-site management, temp-to-hire, direct placements, and payroll services. DGS services markets such as call centers, customer services and administrative placements, IT & professional recruiting, logistics, finance & accounting, hospitality, and aviation/airline industry.\n\nHeadquarters and offices\nDelta's corporate headquarters is located on a corporate campus on the northern boundary of Hartsfield–Jackson Atlanta International Airport, within the city limits of Atlanta. This location has served as Delta's headquarters since 1941, when the company relocated its corporate offices from Monroe, Louisiana, to Greater Atlanta. The crop dusting division of Delta remained headquartered in Monroe until Delta ceased crop dusting in 1966. Before 1981, the Delta corporate campus, an 80-acre (32 ha) plot of land in proximity to the old Hartsfield Airport terminal, was outside the City of Atlanta limits in unincorporated Fulton County. On August 3, 1981, the Atlanta City Council approved the annexation of 141 acres (57 ha) of land, an area containing the Delta headquarters. As of 1981 Delta would have had to begin paying $200,000 annually to the City of Atlanta in taxes. In September 1981, the airline sued the city, challenging the annexation on the basis of the constitutionality of the 1960 City of Atlanta annexation of the Hartsfield old terminal. The City of Atlanta was only permitted to annex areas that are adjacent to areas already in the Atlanta city limits.\nIn addition to hosting Delta's corporate headquarters, Hartsfield–Jackson is also the home of Delta TechOps, the airline's primary maintenance, repair, and overhaul arm and the largest full-service airline MRO in North America, specializing in engines, components, airframe, and line maintenance.\nDelta maintains a large presence in the Twin Cities, with over 12,000 employees in the region as well as significant corporate support functions housed in the Minneapolis area, including the company's information technology divisional offices.\n\nCorporate identity\nDelta's logo, often called the \"widget\", was originally unveiled in 1959. Its triangle shape is taken from the Greek letter delta, and recalls the airline's early history operating in the Mississippi Delta. It is also said to be reminiscent of the swept-wing design of the DC-8, Delta's first jet aircraft.\n\nDelta's current livery is called \"Upward & Onward\". It features a white fuselage with the company's name in blue lettering and a widget on the vertical stabilizer. Delta introduced its current livery in 2007 as part of a re-branding after it emerged from bankruptcy. The new livery consists of four colors, while the old one (called \"colors in motion\") uses eight. This meant the switch saved the airline money by removing one day from each aircraft's painting cycle. The airline took four years to repaint all of its aircraft into the current scheme, including aircraft inherited from Northwest Airlines.\n\nEnvironmental initiatives\nIn 2008, Delta Air Lines was given an award from the United States Environmental Protection Agency's Design for the Environment (DfE) program for its use of PreKote, a more environmentally friendly, non-hexavalent chromium surface pretreatment on its aircraft, replacing hazardous chemicals formerly used to improve paint adhesion and prevent corrosion. In addition, PreKote reduces water usage by two-thirds and reduces wastewater treatment.\nPreKote is also saving money by reducing the time needed to paint each airplane. With time savings of eight to ten percent, it will save an estimated more than $1 million annually.\nDespite having purchased 9.7 million metric tonnes of carbon offsets in 2022, Delta was in the process of moving away from such investments to reduce the company's carbon footprint by the end of March of that year and was instead focusing on reducing emissions from company operations. In May 2023, Delta Air Lines received a consumer class action lawsuit filed in Central California U.S. District Court over marketing claims that the company is the world's first carbon neutral airline.\n\nIn popular culture\nDeltalina\nAs part of the re-branding project, a safety video featuring a flight attendant was posted on YouTube in early 2008, getting over 1 million views and the attention of news outlets, specifically for the video's tone mixed with the serious safety message. The flight attendant, Katherine Lee, was dubbed \"Deltalina\" by a member of FlyerTalk for her resemblance to Angelina Jolie. Delta had considered several styles for its current safety video, including animation, before opting for a video presenting a flight attendant speaking to the audience. The video was filmed on a former Song Airlines Boeing 757-200.\n\nOn-time performance\nIn 2023, Delta flights arrived at their destination on time 84.72% of the time, compared to the North American industry average of 74.45% per Cirium. Delta completed 98.82% of its scheduled flights.\n\nAward and recognition\nOn June 24, 2024, Delta Air Lines was voted 2024 Best Airline in North America and Best Airline Staff Service in North America by Skytrax.\n\nAccidents and incidents\nThe following are major accidents and incidents that occurred on Delta mainline aircraft. For Northwest Airlines incidents, see Northwest Airlines accidents and incidents. For Delta Connection incidents, see Delta Connection incidents and accidents.\nAll told, in 14 fatal accidents involving at least one death, 299 passengers and crew died, 11 on two other aircraft died (in two collision accidents), and 16 people on the ground died (in four accidents).\n\nControversies and passenger incidents\nIn July 2024, Delta canceled over 7,000 flights during a disruption following the 2024 CrowdStrike incident. The incident closely resembled the 2022 Southwest Airlines scheduling crisis, in which the airline canceled thousands of flights. On Tuesday July 23, 2024, United States Secretary of Transportation, Pete Buttigieg, announced the Department of Transportation would be launching an investigation into the events that prevented Delta Air Lines from swiftly recovering, as other airlines had. Over the course of the event over 500,000 passengers were inconvenienced, according to Delta CEO Ed Bastian, and over 3,000 complaints had been lodged with the government according to the Department of Transportation.\nDelta has claimed to have lost $500 million due to the outages and associated costs. The airline has hired David Boies in preparation for litigation against Microsoft and CrowdStrike. The conflict led to an ongoing legal dispute in Delta Air Lines v. Crowdstrike.\n\nLitigation\nDelta Air Lines v. CrowdStrike is a legal dispute stemming from a massive global outage on July 19, 2024, caused by a faulty software update from CrowdStrike, which crashed Microsoft Windows systems worldwide and disrupted critical industries, including air travel. Delta was the hardest-hit airline, with over 7,000 canceled flights, losses estimated at $550 million, and significant operational setbacks due to failures in crew-tracking and outdated IT systems. Delta sued CrowdStrike for gross negligence, fraud, and computer trespass, claiming the update was deployed without proper testing and without authorization despite Delta opting out of automatic updates. CrowdStrike denied wrongdoing, citing contract terms that limit its liability and blaming Delta’s legacy systems for the extended recovery time. A Georgia court allowed Delta to proceed with several claims, though potential damages may be capped under the service agreement’s liability limits.\n\nSafety and aircraft maintenance\nIn April 2025, two Delta Air Lines flights experienced incidents in which ceiling panels detached mid-flight, injuring at least one passenger. The events occurred on a Boeing 757 and a Boeing 717, prompting scrutiny of Delta’s maintenance practices and the condition of its older aircraft. Emergency personnel assessed the injured upon landing.\nThat same month, three Delta flights made emergency landings within five days due to cabin pressurization issues. The aircraft either diverted or returned to their departure airports, with crews following established emergency protocols. Although no serious injuries were reported, the incidents raised concerns about the airline’s operational oversight. Delta stated that it provided accommodations for affected passengers and reaffirmed its focus on safety.\n\nJet fuel dumping over Los Angeles\nOn January 14, 2020, Delta Air Lines Flight DL89, a Boeing 777-200 to Shanghai, returned to Los Angeles International Airport shortly after takeoff due to engine trouble. To reach a safe landing weight, the crew released about 15,000 gallons of jet fuel over southeastern Los Angeles County, including schoolyards.\nAbout 60 children and teachers at Park Avenue Elementary School in Cudahy were treated for minor skin and lung irritation after being exposed to the fuel. Teachers and residents later filed a class-action lawsuit, alleging the pilots acted negligently by dumping fuel at a low altitude over populated areas instead of over the ocean or at higher altitude.\nIn August 2025, Delta agreed to a $79 million settlement, pending court approval. The airline did not admit liability, stating that the pilots had followed Federal Aviation Administration guidance and that the settlement was intended to avoid the costs of a trial. After legal fees, compensation will be distributed to an estimated 38,000 property owners and 160,000 residents.\n\nToxic fume events\nAfter a surge in toxic fume events that have caused health problems for passengers and crew, Delta started replacing auxiliary power units on its aircraft. The Wall Street Journal reported that these incidents, which have led to emergency diversions and illnesses including brain injuries, were particularly concentrated on Delta’s fleet.\n\nSee also\nAir transportation in the United States\nDelta Flight Museum\nDelta Ship 41\nDelta Connection\nList of airlines of the United States\nList of airports in the United States\nTransportation in the United States\n\nNotes\nReferences\nNotes\n\nBibliography\nGreen, William; Swanborough, Gordon; Mowinski, John (1987). Modern Commercial Aircraft. New York: Crown Publishers, Inc. ISBN 0-517-63369-8.\n\nExternal links\nOfficial website\nDelta Air Lines companies grouped at OpenCorporates\nBusiness data for Delta Air Lines:",
  "clean_text": "Delta Air Lines, Inc. is a major airline in the United States headquartered in Atlanta, Georgia, operating nine hubs, with Hartsfield–Jackson Atlanta International Airport being its largest in terms of total passengers and number of departures. With its regional subsidiaries and contractors operating under the brand name Delta Connection, Delta has over 5,400 flights daily and serves 325 destinations in 52 countries on six continents. Delta is a founding member of the SkyTeam airline alliance which helps to extend its global network. It is the second-oldest operating commercial airline in the U.S., having begun passenger operations after United. Delta ranks first in revenue and brand value among the world's largest airlines, and second by number of passengers carried, passenger miles flown, and fleet size. Listed 70th on the Fortune 500 list, Delta has topped The Wall Street Journal's annual rankings of airlines in 2022, 2023, and 2024 and earned first place in the 2024 Readers’ Choice Awards for Best Airlines in the U.S. by Condé Nast Traveler. History Early history The history of Delta Air Lines began with the world's first aerial crop dusting operation called Huff Daland Dusters, Inc. The company was founded on March 2, 1925, in Macon, Georgia, before moving to Monroe, Louisiana, in the summer of 1925. It flew a Huff-Daland Duster, the first true crop duster, designed to combat the boll weevil infestation of cotton crops. The first flight operated by Huff Daland Dusters departed from the airfield at Camp Wheeler, now Macon Downtown Airport, on March 23, 1925 to dust a peach orchard in Montezuma, Georgia. C.E. Woolman, general manager and later Delta's first CEO, led a group of local investors to acquire the company's assets. Delta Air Service was incorporated on December 3, 1928, and was named after the Mississippi Delta region. Passenger operations began on June 17, 1929, from Dallas, Texas, to Jackson, Mississippi, with stops at Shreveport and Monroe, Louisiana. By June 1930, service had extended east to Atlanta and west to Fort Worth, Texas. Passenger service ceased in October 1930 when the airmail contract for the route Delta had pioneered was awarded to another airline, which purchased the assets of Delta Air Service. Local banker Travis Oliver, acting as a trustee, C.E. Woolman, and other local investors purchased back the crop-dusting assets of Delta Air Service and incorporated as Delta Air Corporation on December 31, 1930. Delta Air Corporation secured an airmail contract in 1934, and began doing business as Delta Air Lines over Mail Route 24, stretching from Fort Worth, Texas, to Charleston, South Carolina. Delta moved its headquarters from Monroe, Louisiana, to its current location in Atlanta in 1941. The company name officially became Delta Air Lines in 1945. In 1946, the company commenced regularly scheduled freight transport. In 1949, the company launched the first discounted fares between Chicago and Miami. In 1953, the company launched its first international routes after the acquisition of Chicago and Southern Air Lines. In 1959, it was the first airline to fly the Douglas DC-8. In 1960, it was the first airline to fly Convair 880 jets. In 1964, it launched the Deltamatic reservation systems using computers in the IBM 7070 series. In 1965, Delta was the first airline to fly the McDonnell Douglas DC-9. Growth and acquisitions By 1970, Delta had an all-jet fleet, and in 1972 it acquired Northeast Airlines. Trans-Atlantic service began in 1978 with the first nonstop flights from Atlanta to London. In 1981, Delta launched a frequent-flyer program. In 1987, it acquired Western Airlines, and that same year Delta began trans-Pacific service (Atlanta to Portland, Oregon, to Tokyo). In 1990, Delta was the first airline in the United States to fly McDonnell Douglas MD-11 jets. In 1991, it acquired substantially all of Pan Am's trans-Atlantic routes and the Pan Am Shuttle, rebranded as the Delta Shuttle. Delta was now the leading airline across the Atlantic. In 1997, Delta was the first airline to board more than 100 million passengers in a calendar year. Also that year, Delta began an expansion of its international routes into Latin America. In 2003, the company launched Song, a low-cost carrier. Bankruptcy and restructuring (2005–2007) On September 14, 2005, the company filed for bankruptcy, citing rising fuel costs. It emerged from bankruptcy in April 2007 after fending off a hostile takeover from US Airways and its shares were re-listed on the New York Stock Exchange. Acquisition of Northwest Airlines (2008–2010) The acquisition of Northwest Airlines was announced on April 14, 2008. It was approved and consummated on October 29, 2008. Northwest continued to operate as a wholly owned subsidiary of Delta until December 31, 2009, when the Northwest Airlines operating certificate was merged into that of Delta. Delta completed integration with Northwest on January 31, 2010, when their computer reservations system and websites were combined, and the Northwest Airlines brand was officially retired. Network Delta and its worldwide alliance partners operate more than 15,000 flights per day, having operated 893 daily flights out of its Atlanta main hub in the summer of 2024. As of December 31, 2021, Delta's mainline aircraft fly to 242 destinations, serving 52 countries across six continents. Destinations As of May 2025, Delta Air Lines operates or has previously operated to the following destinations. This table does not include destinations served by Delta's regional subsidiary, Delta Connection. Hubs Delta currently has nine hubs: Atlanta: The airline's largest hub serving the Southern and Eastern United States and as its main gateway to Latin America and the Caribbean. Home to Delta's corporate headquarters, as well as Delta TechOps, the airline's primary maintenance base. Boston: Delta's secondary transatlantic hub. It offers service to destinations in Europe and North America. Detroit: One of Delta's two Midwest hubs. It is the primary Asian gateway for the Eastern United States and it also provides service to many destinations in the Americas and Europe. Los Angeles: Delta's secondary hub for the West Coast. It offers service to cities in Latin America, Asia, Australia, Europe, and major domestic cities and West Coast regional destinations. Minneapolis/St. Paul: One of Delta's two Midwest hubs. It is the primary Canadian gateway for the airline and also serves many American metropolitan destinations, many regional destinations in the upper Midwest, and some select destinations in Europe and Asia. New York–JFK: Delta's primary transatlantic hub. The hub also offers service on transcontinental \"prestige routes\" to Los Angeles and San Francisco. New York–LaGuardia: Delta's second New York hub. Delta's service at LaGuardia covers numerous East Coast U.S. cities and several regional destinations in the U.S. and Canada. Salt Lake City: Delta's hub for the Rocky Mountain region of the United States. Delta's service covers most major U.S. destinations and several regional destinations in the U.S., emphasizing the Rocky Mountains and select destinations in Canada and Mexico, and select cities in Europe, Hawaii and Asia. Seattle/Tacoma: Delta's primary West Coast hub. The hub serves as an international gateway to Asia for the Western United States. Delta service also includes many major U.S. destinations as well as regional destinations in the Pacific Northwest. Delta Connection Alliance and codeshare agreements Delta is a member of the SkyTeam alliance and has codeshare agreements with the following airlines: Fleet Cabin Delta underwent a cabin branding upgrade in 2015. Availability and exact details vary by route and aircraft type. Delta One Delta One is the airline's premier business class product, available on long-haul international flights, as well as transcontinental service from New York–Kennedy to Los Angeles and San Francisco. Delta One features lie-flat seating on all aircraft types and direct aisle access from every seat on all types except the Boeing 757-200 (in which only a special sub-fleet of approximately 20 aircraft feature lie-flats) and in their 'type 35L' ex-LATAM A350s (which use a 2-2-2 layout). The Boeing 767-300ER seats, designed by James Thompson, feature a space-saving design whereby the seats are staggered such that when in the fully flat position, the foot of each bed extends under the armrests of the seat in front of it. On the Airbus A330 cabins, Delta One features the Cirrus flat-bed sleeper suite by Zodiac Seats U.S., configured in a reverse herringbone pattern. All seats are also equipped with a personal, on-demand in-flight-entertainment (IFE) system, universal power-ports, a movable reading light, and a folding work table. Passengers also receive meals, alcoholic beverages, an amenity kit, bedding, and pre-flight Delta Sky Club access. In August 2016, Delta announced the introduction of Delta One Suites on select widebody fleets. The suites will feature a door to the aisle for enhanced privacy, as well as improved storage space, a larger IFE screen, and an updated design. The suites rolled out on the Airbus A350 fleet, first delivered in July 2017, followed by installation within the Boeing 777 fleet. Delta's Airbus A330-900, which began revenue service for the airline in July 2019, also features Delta One Suites. Also in July 2019, Delta began retrofitting a new seat on the 767-400ER, which featured increased privacy and design similar to Delta One Suites, though without a privacy door. These seats lack a door due to the 767's smaller cabin width. First Class First Class is offered on mainline domestic flights (except those featuring Delta One service), select short- and medium-haul international flights, and Delta Connection aircraft. Seats range from 18.5 to 20.75 inches (47.0 to 52.7 cm) wide and have between 37 and 40 inches (94 and 102 cm) of pitch. Passengers in this class receive a wider variety of free snacks compared to Main Cabin, as well as free drinks and alcohol, and full meal service on flights 900 miles (1,400 km) and longer. Certain aircraft also feature power ports at each seat and free entertainment products from Delta Studio. First Class passengers are also eligible for priority boarding. Premium Select In April 2016, Delta CEO Ed Bastian announced that a new Premium Economy cabin would be added. Since renamed to Premium Select, this cabin will feature extra legroom; adjustable leg rests; extra seat pitch, width, and recline; and a new premium service. Delta introduced it on its new Airbus A350, first delivered in fall 2017, to be followed by the now-retired Boeing 777. In October 2018, Delta announced that it would be selling first class seats on domestically configured Boeing 757 aircraft flying transatlantic routes as Premium Select. Delta's A330-900, delivered in 2019, also offers Premium Select. In 2021, Delta began retrofitting many of its 767-300ER and older A330 aircraft with Premium Select. Delta Comfort+ Delta Comfort+ seats are installed on all aircraft and feature 34–36 inches (860–910 mm) of pitch; on all Delta One configured aircraft, 35–36 inches (890–910 mm) of pitch and 50 percent more recline over standard Main Cabin seats. Additional amenities include: priority boarding, dedicated overhead space, complimentary beer, wine, and spirits on flights 250 miles (400 km) or more, and complimentary premium snacks on flights 900 miles (1,400 km) or more. Complimentary premium entertainment is available via Delta Studio, with free headsets available on most flights. On transcontinental flights between JFK-LAX/SFO, Delta Comfort+ passengers also get Luvo snack wraps. Certain Medallion members can upgrade from Main Cabin to Comfort+ for free right after booking, while other customers can upgrade for a fee or with SkyMiles. Main Cabin Main Cabin (Economy Class) is available on all aircraft with seats ranging from 17 to 18.6 inches (43 to 47 cm) wide and 30 to 33 inches (76 to 84 cm) of pitch. The main cabin on some aircraft has an articulating seat bottom where the seat bottom moves forward in addition to the seat back tilting backwards when reclining. Main Cabin passengers receive complimentary snacks and non-alcoholic drinks on all flights 250 miles (400 km) or longer. Alcoholic beverages are also available for purchase. Complimentary meals and alcoholic drinks are provided on long-haul international flights as well as selected transcontinental domestic flights, such as between New York–JFK and Seattle, San Francisco, Los Angeles, and San Diego. As part of Delta's Flight Fuel buy on board program, meals are available for purchase on other North American flights 900 miles (1,400 km) or longer. Delta operated a different buy-on-board program between 2003 and 2005. The previous program had items from differing providers, depending on the origin and destination of the flight. Prices ranged up to $10 ($16.65 when adjusted for inflation). The airline started the service on a few selected flights in July 2003, and the meal service was initially offered on 400 flights. Delta ended this buy-on-board program in 2005; instead, Delta began offering snacks at no extra charge on flights over 90 minutes to most U.S. domestic flights and some flights to the Caribbean and Latin America. Beginning in mid-March 2005 the airline planned to stop providing pillows on flights within the 48 contiguous U.S. states, Bermuda, Canada, the Caribbean, and Central America. In addition, the airline increased the price of alcoholic beverages on Delta mainline flights from $4 ($6.44 when adjusted for inflation) to $5 ($8.05 when adjusted for inflation); the increase in alcohol prices did not occur on Song flights. Basic Economy Basic Economy is a basic version of Main Cabin, offering the same services with fewer flexibility options for a lower price. Examples of fewer flexibility options include no ticket changes, no paid or complimentary upgrades regardless of frequent-flier status, and only having a seat assigned at check-in. As of December 2021, Basic Economy travelers no longer earn award miles (used for redeeming free travel, for example) or medallion qualifying miles (which count towards elite status). Reward programs SkyMiles SkyMiles is the frequent flyer program for Delta Air Lines. Miles do not expire but accounts may be deactivated by Delta in certain cases, such as the death of a program member or fraudulent activity. As part of its efforts to improve customer experience, Delta introduced several service upgrades in 2025. These included free Wi-Fi access for SkyMiles members on most domestic flights, expanded Delta Sky Club lounge facilities, and new premium dining options featuring branded offerings such as Shake Shack. Delta Sky Club Delta Sky Club is the branding name of Delta's airport lounges. Membership is available through an annual membership that can be purchased with either money or miles. International passengers travelling in Delta One class get free access. Membership can also be granted through top-level Delta status or by being an American Express cardholder with certain exceptions. As of January 2019, Delta no longer offered single-day passes. Originally, Delta's membership-based airport clubs were called Crown Room lounges, with Northwest's called WorldClubs. Exclusive Delta One Clubs for customers travelling in business class are slated to open at New York–Kennedy, Los Angeles, and Boston in 2024. In February 2024, Delta announced a new, more exclusive or premium level of Sky Club lounge aimed at high-spending travellers. The first would be at New York's John F. Kennedy International Airport, followed by those in Boston's Logan International Airport and Los Angeles International Airport later in the year. In addition to wellness areas, the lounge would offer a full-service brasserie and a marketplace influenced or assisted by a chef that would feature an open kitchen. The move represented a shift away from a standard offering to something closer to a unique experience for each airport and the city in which the lounge was located. SkyBonus On November 27, 2001, Delta Air Lines launched SkyBonus, a program aimed toward small-to-medium businesses spending between $5,000 and $500,000 annually on air travel. Businesses can earn points toward free travel and upgrades, as well as Sky Club memberships and SkyMiles Silver Medallion status. Points are earned on paid travel based on various fare amounts paid, booking codes, and place origin or destination. While enrolled businesses are able to earn points toward free travel, the travelling passenger is still eligible to earn SkyMiles during his or her travel. In early 2010, Delta Air Lines merged its SkyBonus program with Northwest's similar Biz Perks program. Corporate affairs Business trends The key trends for Delta Air Lines are (as of the financial year ending December 31): Personnel Between its mainline operation and subsidiaries, and as of December 2024, Delta employs nearly 103,000 people. Delta's 17,500 mainline pilots are represented by the Air Line Pilots Association, International and are the union's second largest pilot group. The company's approximately 180 flight dispatchers are represented by the Professional Airline Flight Control Association (PAFCA). Not counting the pilots and flight dispatchers, Delta is the only one of the five largest airlines in the United States, and one of only two in the top 9 (the other being JetBlue), whose non-pilot USA domestic staff is entirely non-union. Delta Global Staffing Delta Global Staffing (DGS) was a temporary employment firm located in Atlanta, Georgia. Delta Global Staffing was a wholly owned subsidiary of Delta Air Lines, Inc., and a division of the internal company DAL Global Services. Delta Air Lines sold majority ownership of DAL Global Services to Argenbright Holdings on December 21, 2018. As part of the sale, Delta dissolved the staffing division of DGS. It was founded in 1995 as a provider of temporary staffing for Delta primarily in Atlanta. DGS has since expanded to include customers and businesses outside the airline and aviation industries. DGS now supports customers in major US metropolitan areas. Delta Global Staffing provided contract workers for short and long term assignments, VMS partnering, VOP on-site management, temp-to-hire, direct placements, and payroll services. DGS services markets such as call centers, customer services and administrative placements, IT & professional recruiting, logistics, finance & accounting, hospitality, and aviation/airline industry. Headquarters and offices Delta's corporate headquarters is located on a corporate campus on the northern boundary of Hartsfield–Jackson Atlanta International Airport, within the city limits of Atlanta. This location has served as Delta's headquarters since 1941, when the company relocated its corporate offices from Monroe, Louisiana, to Greater Atlanta. The crop dusting division of Delta remained headquartered in Monroe until Delta ceased crop dusting in 1966. Before 1981, the Delta corporate campus, an 80-acre (32 ha) plot of land in proximity to the old Hartsfield Airport terminal, was outside the City of Atlanta limits in unincorporated Fulton County. On August 3, 1981, the Atlanta City Council approved the annexation of 141 acres (57 ha) of land, an area containing the Delta headquarters. As of 1981 Delta would have had to begin paying $200,000 annually to the City of Atlanta in taxes. In September 1981, the airline sued the city, challenging the annexation on the basis of the constitutionality of the 1960 City of Atlanta annexation of the Hartsfield old terminal. The City of Atlanta was only permitted to annex areas that are adjacent to areas already in the Atlanta city limits. In addition to hosting Delta's corporate headquarters, Hartsfield–Jackson is also the home of Delta TechOps, the airline's primary maintenance, repair, and overhaul arm and the largest full-service airline MRO in North America, specializing in engines, components, airframe, and line maintenance. Delta maintains a large presence in the Twin Cities, with over 12,000 employees in the region as well as significant corporate support functions housed in the Minneapolis area, including the company's information technology divisional offices. Corporate identity Delta's logo, often called the \"widget\", was originally unveiled in 1959. Its triangle shape is taken from the Greek letter delta, and recalls the airline's early history operating in the Mississippi Delta. It is also said to be reminiscent of the swept-wing design of the DC-8, Delta's first jet aircraft. Delta's current livery is called \"Upward & Onward\". It features a white fuselage with the company's name in blue lettering and a widget on the vertical stabilizer. Delta introduced its current livery in 2007 as part of a re-branding after it emerged from bankruptcy. The new livery consists of four colors, while the old one (called \"colors in motion\") uses eight. This meant the switch saved the airline money by removing one day from each aircraft's painting cycle. The airline took four years to repaint all of its aircraft into the current scheme, including aircraft inherited from Northwest Airlines. Environmental initiatives In 2008, Delta Air Lines was given an award from the United States Environmental Protection Agency's Design for the Environment (DfE) program for its use of PreKote, a more environmentally friendly, non-hexavalent chromium surface pretreatment on its aircraft, replacing hazardous chemicals formerly used to improve paint adhesion and prevent corrosion. In addition, PreKote reduces water usage by two-thirds and reduces wastewater treatment. PreKote is also saving money by reducing the time needed to paint each airplane. With time savings of eight to ten percent, it will save an estimated more than $1 million annually. Despite having purchased 9.7 million metric tonnes of carbon offsets in 2022, Delta was in the process of moving away from such investments to reduce the company's carbon footprint by the end of March of that year and was instead focusing on reducing emissions from company operations. In May 2023, Delta Air Lines received a consumer class action lawsuit filed in Central California U.S. District Court over marketing claims that the company is the world's first carbon neutral airline. In popular culture Deltalina As part of the re-branding project, a safety video featuring a flight attendant was posted on YouTube in early 2008, getting over 1 million views and the attention of news outlets, specifically for the video's tone mixed with the serious safety message. The flight attendant, Katherine Lee, was dubbed \"Deltalina\" by a member of FlyerTalk for her resemblance to Angelina Jolie. Delta had considered several styles for its current safety video, including animation, before opting for a video presenting a flight attendant speaking to the audience. The video was filmed on a former Song Airlines Boeing 757-200. On-time performance In 2023, Delta flights arrived at their destination on time 84.72% of the time, compared to the North American industry average of 74.45% per Cirium. Delta completed 98.82% of its scheduled flights. Award and recognition On June 24, 2024, Delta Air Lines was voted 2024 Best Airline in North America and Best Airline Staff Service in North America by Skytrax. Accidents and incidents The following are major accidents and incidents that occurred on Delta mainline aircraft. For Northwest Airlines incidents, see Northwest Airlines accidents and incidents. For Delta Connection incidents, see Delta Connection incidents and accidents. All told, in 14 fatal accidents involving at least one death, 299 passengers and crew died, 11 on two other aircraft died (in two collision accidents), and 16 people on the ground died (in four accidents). Controversies and passenger incidents In July 2024, Delta canceled over 7,000 flights during a disruption following the 2024 CrowdStrike incident. The incident closely resembled the 2022 Southwest Airlines scheduling crisis, in which the airline canceled thousands of flights. On Tuesday July 23, 2024, United States Secretary of Transportation, Pete Buttigieg, announced the Department of Transportation would be launching an investigation into the events that prevented Delta Air Lines from swiftly recovering, as other airlines had. Over the course of the event over 500,000 passengers were inconvenienced, according to Delta CEO Ed Bastian, and over 3,000 complaints had been lodged with the government according to the Department of Transportation. Delta has claimed to have lost $500 million due to the outages and associated costs. The airline has hired David Boies in preparation for litigation against Microsoft and CrowdStrike. The conflict led to an ongoing legal dispute in Delta Air Lines v. Crowdstrike. Litigation Delta Air Lines v. CrowdStrike is a legal dispute stemming from a massive global outage on July 19, 2024, caused by a faulty software update from CrowdStrike, which crashed Microsoft Windows systems worldwide and disrupted critical industries, including air travel. Delta was the hardest-hit airline, with over 7,000 canceled flights, losses estimated at $550 million, and significant operational setbacks due to failures in crew-tracking and outdated IT systems. Delta sued CrowdStrike for gross negligence, fraud, and computer trespass, claiming the update was deployed without proper testing and without authorization despite Delta opting out of automatic updates. CrowdStrike denied wrongdoing, citing contract terms that limit its liability and blaming Delta’s legacy systems for the extended recovery time. A Georgia court allowed Delta to proceed with several claims, though potential damages may be capped under the service agreement’s liability limits. Safety and aircraft maintenance In April 2025, two Delta Air Lines flights experienced incidents in which ceiling panels detached mid-flight, injuring at least one passenger. The events occurred on a Boeing 757 and a Boeing 717, prompting scrutiny of Delta’s maintenance practices and the condition of its older aircraft. Emergency personnel assessed the injured upon landing. That same month, three Delta flights made emergency landings within five days due to cabin pressurization issues. The aircraft either diverted or returned to their departure airports, with crews following established emergency protocols. Although no serious injuries were reported, the incidents raised concerns about the airline’s operational oversight. Delta stated that it provided accommodations for affected passengers and reaffirmed its focus on safety. Jet fuel dumping over Los Angeles On January 14, 2020, Delta Air Lines Flight DL89, a Boeing 777-200 to Shanghai, returned to Los Angeles International Airport shortly after takeoff due to engine trouble. To reach a safe landing weight, the crew released about 15,000 gallons of jet fuel over southeastern Los Angeles County, including schoolyards. About 60 children and teachers at Park Avenue Elementary School in Cudahy were treated for minor skin and lung irritation after being exposed to the fuel. Teachers and residents later filed a class-action lawsuit, alleging the pilots acted negligently by dumping fuel at a low altitude over populated areas instead of over the ocean or at higher altitude. In August 2025, Delta agreed to a $79 million settlement, pending court approval. The airline did not admit liability, stating that the pilots had followed Federal Aviation Administration guidance and that the settlement was intended to avoid the costs of a trial. After legal fees, compensation will be distributed to an estimated 38,000 property owners and 160,000 residents. Toxic fume events After a surge in toxic fume events that have caused health problems for passengers and crew, Delta started replacing auxiliary power units on its aircraft. The Wall Street Journal reported that these incidents, which have led to emergency diversions and illnesses including brain injuries, were particularly concentrated on Delta’s fleet."
}