{
  "ticker": "DASH",
  "cik": "0001792789",
  "company_name": "DoorDash",
  "corrected_name": "DoorDash",
  "wiki_title_used": "DoorDash",
  "exists": true,
  "raw_text": "DoorDash, Inc. is an American company operating online food ordering and food delivery. It trades under the symbol DASH. With a 56% market share, DoorDash is the largest food delivery platform in the United States. It also has a 60% market share in the convenience delivery category. As of December 31, 2020, the platform was used by 450,000 merchants, 20 million consumers, and had over one million delivery couriers.\nFounded by Tony Xu, Andy Fang, Stanley Tang and Evan Moore, DoorDash made its debut on the Fortune 500 list in 2024, ranking #443. \nDoorDash has been sued for and/or held legally liable for withholding tips, reducing tip transparency, antitrust price manipulation, listing restaurants without permission, misclassifying workers, withholding sick time, and illegally selling personal data.   \nAs the end of 2025, DoorDash operates in the United States, Canada, Australia and New Zealand, and via its international subsidiaries Deliveroo and Wolt across 45 countries worldwide.\n\nHistory\nIn January 2013, Stanford University students Tony Xu, Stanley Tang, Andy Fang and Evan Moore launched PaloAltoDelivery.com in Palo Alto, California. In the summer of 2013, it received US$120,000 in seed money from Y Combinator in exchange for a 7% stake. It incorporated as DoorDash in June 2013.\nDoordash's first partnership with a fast food burger restaurant chain was on April 19, 2016, when it partnered with CKE Restaurants, parent company of Carl's Jr. and Hardee's, for food delivery.\nOn December 1, 2017, DoorDash announced its partnership with Wendy's for delivery from its restaurants.\nIn December 2018, DoorDash overtook Uber Eats to hold the second position in total US food delivery sales, behind GrubHub. By March 2019, it had exceeded GrubHub in total sales, at 27.6% of the on-demand delivery market. By early 2019, DoorDash was the largest food delivery provider in the U.S., as measured by consumer spending.  \nIn October 2019, DoorDash opened its first ghost kitchen, DoorDash Kitchen, in Redwood City, California, with four restaurants operating at the location.\nBy June 2020, DoorDash had raised more than $2.5 billion over several financing rounds from investors including Y Combinator, Charles River Ventures, SV Angel, Khosla Ventures, Sequoia Capital, SoftBank Group, GIC, and Kleiner Perkins.\nDoorDash announced its partnership with KFC on September 8, 2020, followed by Taco Bell on October 14, 2020.\nIn November 2020, DoorDash announced the opening of its first physical restaurant location, partnering up with Bay Area restaurant Burma Bites to offer delivery and pick-up orders.\nOn December 9, 2020, the company became a public company via an initial public offering, raising $3.37 billion.\nIn November 2021, DoorDash acquired Finland’s Wolt for €7bn.\nIn August 2022, DoorDash announced it would end its partnership with Walmart in September, ending the companies' cooperation agreement from 2018.\nIn late November 2022, DoorDash announced plans to lay off 1,250 corporate employees, or about six percent of their workforce. This was to rein in expenses.\nIn June 2023, DoorDash announced it would give its drivers the option of earning an hourly minimum wage instead of being paid per delivery. However, drivers are only paid hourly when on an active delivery.\nIn September 2023, the company transferred its stock listing from the New York Stock Exchange to the Nasdaq. On December 18, 2023, DoorDash was added to the Nasdaq-100 index.\nIn March 2025, DoorDash announced a partnership with Klarna, a Buy Now, Pay Later (BNPL) service, letting customers schedule small payments over a set period of time. DoorDash received widespread criticism from this decision, including internet mockery, given concerns about the increase of household debt in America.\nIn 2025, DoorDash will acquire the UK-based delivery service Deliveroo for $3.88 billion. The combined company will operate in 40 countries and serve 50 million users monthly.\nOn September 9, 2025, both DoorDash and Ace Hardware (the largest hardware cooperative) announced their partnership to offer delivery for home improvement products from over 4,000 Ace Hardware locations.\n\nLawsuits against DoorDash\n2017 class-action lawsuit for misclassifying workers\nIn 2017, a class-action lawsuit was filed against DoorDash for allegedly misclassifying delivery drivers in California and Massachusetts as independent contractors. In 2022, a tentative settlement was reached in which DoorDash would pay $100 million total, with $61 million going to over 900,000 drivers, paying out just over $130 per driver, and $28 million for the lawyers. Gizmodo criticized the settlement, noting that the $413 million that DoorDash CEO Tony Xu received the previous year was one of the largest CEO compensation packages of all time.\n\n2019 data breach lawsuit\nOn May 4, 2019, DoorDash confirmed 4.9 million customers, delivery workers and merchants had sensitive information stolen via a data breach. Those who joined the platform after April 5, 2018, were unaffected by the breach. A class-action lawsuit for the breach was filed against DoorDash in October 2019.\n\nWithholding of tips and subsequent class-action lawsuits\nIn July 2019, the company's tipping policy was criticized by The New York Times, and later The Verge and Vox and Gothamist. Drivers receive a guaranteed minimum per order that is paid by DoorDash by default. When a customer added a tip, instead of going directly to the driver, it first went to the company to cover the guaranteed minimum. Drivers then only directly received the part of the tip that exceeded the guaranteed minimum per order.\nIn January 2020, it was reported that DoorDash had lied about skimming tips from its drivers, causing them to earn an average of $1.45 an hour after expenses, and that after the company had allegedly overhauled its tipping system, DoorDash was still manipulating per-delivery payouts at the expense of drivers.\nA DoorDash customer filed a class action lawsuit against the company for its \"materially false and misleading\" tipping policy. The case was referred to arbitration in August 2020. Under pressure, the company revised its policy. The company settled a lawsuit with District of Columbia Attorney General Karl Racine for $2.5 million, with funds going to deliverers, the government, and to charity.\n\n2021 driver strike for tip transparency\nIn July 2021, DoorDash drivers went on strike to protest lack of tip transparency and to ask for higher pay. At the time of the strike, and, as of June 2022, DoorDash did not allow drivers to see the full tip amounts prior to accepting a delivery in the app. If customers tip over a set amount for the order total, Doordash hides a portion of the tip until the delivery is complete. The strike occurred after DoorDash rewrote its code to cut off access to Para, a third-party app that drivers had been using to see the full tip amounts.\n\n2025 class-action lawsuit settlement\nIn 2025, DoorDash agreed to pay around $17 million for \"misleading both consumers and delivery workers\" with tips being docked from drivers' pay instead of directly going to drivers.\n\n2020 antitrust litigation\nIn April 2020, in the case of Davitashvili v. GrubHub Inc. DoorDash, Grubhub, Postmates, and Uber Eats were accused of monopolistic power by only listing restaurants on their apps if the restaurant owners signed contracts which include clauses that require prices be the same for dine-in customers as for customers receiving delivery. The plaintiffs stated that this arrangement increases the cost for dine-in customers, as they are required to subsidize the cost of delivery; and that the apps charge \"exorbitant\" fees, which range from 13% to 40% of revenue, while the average restaurant's profit ranges from 3% to 9% of revenue. The lawsuit seeks treble damages, including for overcharges, since April 14, 2016, for dine-in and delivery customers in the United States at restaurants using the defendants’ delivery apps. Although several preliminary documents in the case have now been filed, a trial date has not yet been set.\n\nLitigation for illegal unauthorized restaurant listing\nIn May 2021, DoorDash was criticized for unauthorized listings of restaurants who had not given permission to appear on the app. The company was sued by Lona's Lil Eats in St. Louis, with the lawsuit claiming that DoorDash had listed them without permission, then prevented any orders to the restaurant from going through and redirecting customers to other restaurants instead, because Lona's was \"too far away,\" when in reality it had not paid DoorDash a fee for listing. This aspect of DoorDash's business practice is illegal in California.\n\n2021 lawsuit by the city of Chicago\nIn August 2021, the city of Chicago sued DoorDash and GrubHub. According to Chicago mayor Lori Lightfoot, the companies broke the law by using \"unfair and deceptive tactics to take advantage of restaurants and consumers who were struggling to stay afloat during the COVID-19 pandemic.\" DoorDash and GrubHub denied the suit's merits.\n\n2023 class-action lawsuit\nDoorDash has been accused of charging users of iPhone more than users on the Android platform. User testing claimed to show several instances of various fees and delivery charges being higher when using an Apple device. DoorDash denied these allegations in response to the ongoing US$1 billion class-action suit.\n\n2023 lawsuit by the city of Seattle\nIn August 2023, DoorDash was obligated to pay its drivers and the city of Seattle a total of $1.6 million.  It was found that the platform made it difficult for users to request paid time off.  DoorDash is to pay $1.1 million towards safe and sick time credits, $500k directly to drivers and an additional $8,500 in city fees.\n\n2024 privacy lawsuit by the state of California\nIn February 2024, after being found to have illegally sold personal data, DoorDash was obligated to pay a $375,000 civil penalty as well as to begin complying with privacy laws it had been shirking, namely CCPA and CalOPPA.\n\nMarkets\nDoorDash began expanding into international markets in 2015, launching in Toronto, Canada. The company started operating in markets outside North America in 2019, officially launching in Melbourne, Australia, in September and later expanding further into the country. In 2021, the company expanded its service area to Sendai, Japan in June and Stuttgart, Germany, in November. In June 2022, the company expanded into the Wellington Region of New Zealand.\nThe company expanded its service offerings in 2020, adding grocery delivery initially in California and the Midwest in August 2020. DoorDash expanded the service offerings in 2021 to include DoubleDash, which allows for orders from multiple merchants, and alcohol delivery in 20 U.S. states, Washington, D.C., Canada, and Australia.\n\nAcquisitions\nIn August 2019, the company acquired Scotty Labs, a tele-operations startup company that focuses on self-driving and remote-controlled vehicle technology.\nIn October 2019, DoorDash acquired Caviar, a service specializing in food delivery from upscale urban-area restaurants that typically do not offer delivery, from Square, Inc. for $410 million.\nOn February 8, 2021, DoorDash announced its acquisition of Chowbotics, a robotics company known for its salad-making robot. The companies did not disclose the terms of the deal, but Chowbotics was valued at $46 million in 2018.\nOn November 9, 2021, DoorDash announced its acquisition of the Finnish technology company Wolt for over $8.1 billion.\nIn March of 2022, DoorDash announced its acquisition of Bbot, startup that developed digital ordering and payment solutions for restaurants and hospitality venues.\nIn April 2025, the company made an initial offer to acquire Deliveroo, a UK-based food delivery company, for £2.7 billion($3.6 billion). In May 2025, DoorDash announced it had acquired Deliveroo for $3.9 billion. In May 2025, DoorDash announced the $1.2 billion all-cash acquisition of restaurant booking platform SevenRooms.\n\nPhilanthropy\nIn 2018, DoorDash launched Project DASH, a partnership with local food security organizations to deliver donations to those in need. By August 2019, the program had expanded to 25 cities in the United States and Canada and had delivered more than one million pounds of food. As of September 2021, Project DASH operated in more than 900 cities and had delivered more than 15 million meals. \nDoorDash partnered with the National Urban League in 2020 as part of its Main Street Strong program, pledging $200 million over five years to support restaurants and drivers during the COVID-19 pandemic, $12 million of which was allotted to assisting drivers of color in building job skills and financial literacy.\nIn 2022, DoorDash partnered with Meals on Wheels to help deliver food to senior citizens.\n\nSee also\nFood delivery\n\nReferences\nExternal links\nOfficial website \nBusiness data for DoorDash, Inc.:",
  "clean_text": "DoorDash, Inc. is an American company operating online food ordering and food delivery. It trades under the symbol DASH. With a 56% market share, DoorDash is the largest food delivery platform in the United States. It also has a 60% market share in the convenience delivery category. As of December 31, 2020, the platform was used by 450,000 merchants, 20 million consumers, and had over one million delivery couriers. Founded by Tony Xu, Andy Fang, Stanley Tang and Evan Moore, DoorDash made its debut on the Fortune 500 list in 2024, ranking #443. DoorDash has been sued for and/or held legally liable for withholding tips, reducing tip transparency, antitrust price manipulation, listing restaurants without permission, misclassifying workers, withholding sick time, and illegally selling personal data. As the end of 2025, DoorDash operates in the United States, Canada, Australia and New Zealand, and via its international subsidiaries Deliveroo and Wolt across 45 countries worldwide. History In January 2013, Stanford University students Tony Xu, Stanley Tang, Andy Fang and Evan Moore launched PaloAltoDelivery.com in Palo Alto, California. In the summer of 2013, it received US$120,000 in seed money from Y Combinator in exchange for a 7% stake. It incorporated as DoorDash in June 2013. Doordash's first partnership with a fast food burger restaurant chain was on April 19, 2016, when it partnered with CKE Restaurants, parent company of Carl's Jr. and Hardee's, for food delivery. On December 1, 2017, DoorDash announced its partnership with Wendy's for delivery from its restaurants. In December 2018, DoorDash overtook Uber Eats to hold the second position in total US food delivery sales, behind GrubHub. By March 2019, it had exceeded GrubHub in total sales, at 27.6% of the on-demand delivery market. By early 2019, DoorDash was the largest food delivery provider in the U.S., as measured by consumer spending. In October 2019, DoorDash opened its first ghost kitchen, DoorDash Kitchen, in Redwood City, California, with four restaurants operating at the location. By June 2020, DoorDash had raised more than $2.5 billion over several financing rounds from investors including Y Combinator, Charles River Ventures, SV Angel, Khosla Ventures, Sequoia Capital, SoftBank Group, GIC, and Kleiner Perkins. DoorDash announced its partnership with KFC on September 8, 2020, followed by Taco Bell on October 14, 2020. In November 2020, DoorDash announced the opening of its first physical restaurant location, partnering up with Bay Area restaurant Burma Bites to offer delivery and pick-up orders. On December 9, 2020, the company became a public company via an initial public offering, raising $3.37 billion. In November 2021, DoorDash acquired Finland’s Wolt for €7bn. In August 2022, DoorDash announced it would end its partnership with Walmart in September, ending the companies' cooperation agreement from 2018. In late November 2022, DoorDash announced plans to lay off 1,250 corporate employees, or about six percent of their workforce. This was to rein in expenses. In June 2023, DoorDash announced it would give its drivers the option of earning an hourly minimum wage instead of being paid per delivery. However, drivers are only paid hourly when on an active delivery. In September 2023, the company transferred its stock listing from the New York Stock Exchange to the Nasdaq. On December 18, 2023, DoorDash was added to the Nasdaq-100 index. In March 2025, DoorDash announced a partnership with Klarna, a Buy Now, Pay Later (BNPL) service, letting customers schedule small payments over a set period of time. DoorDash received widespread criticism from this decision, including internet mockery, given concerns about the increase of household debt in America. In 2025, DoorDash will acquire the UK-based delivery service Deliveroo for $3.88 billion. The combined company will operate in 40 countries and serve 50 million users monthly. On September 9, 2025, both DoorDash and Ace Hardware (the largest hardware cooperative) announced their partnership to offer delivery for home improvement products from over 4,000 Ace Hardware locations. Lawsuits against DoorDash 2017 class-action lawsuit for misclassifying workers In 2017, a class-action lawsuit was filed against DoorDash for allegedly misclassifying delivery drivers in California and Massachusetts as independent contractors. In 2022, a tentative settlement was reached in which DoorDash would pay $100 million total, with $61 million going to over 900,000 drivers, paying out just over $130 per driver, and $28 million for the lawyers. Gizmodo criticized the settlement, noting that the $413 million that DoorDash CEO Tony Xu received the previous year was one of the largest CEO compensation packages of all time. 2019 data breach lawsuit On May 4, 2019, DoorDash confirmed 4.9 million customers, delivery workers and merchants had sensitive information stolen via a data breach. Those who joined the platform after April 5, 2018, were unaffected by the breach. A class-action lawsuit for the breach was filed against DoorDash in October 2019. Withholding of tips and subsequent class-action lawsuits In July 2019, the company's tipping policy was criticized by The New York Times, and later The Verge and Vox and Gothamist. Drivers receive a guaranteed minimum per order that is paid by DoorDash by default. When a customer added a tip, instead of going directly to the driver, it first went to the company to cover the guaranteed minimum. Drivers then only directly received the part of the tip that exceeded the guaranteed minimum per order. In January 2020, it was reported that DoorDash had lied about skimming tips from its drivers, causing them to earn an average of $1.45 an hour after expenses, and that after the company had allegedly overhauled its tipping system, DoorDash was still manipulating per-delivery payouts at the expense of drivers. A DoorDash customer filed a class action lawsuit against the company for its \"materially false and misleading\" tipping policy. The case was referred to arbitration in August 2020. Under pressure, the company revised its policy. The company settled a lawsuit with District of Columbia Attorney General Karl Racine for $2.5 million, with funds going to deliverers, the government, and to charity. 2021 driver strike for tip transparency In July 2021, DoorDash drivers went on strike to protest lack of tip transparency and to ask for higher pay. At the time of the strike, and, as of June 2022, DoorDash did not allow drivers to see the full tip amounts prior to accepting a delivery in the app. If customers tip over a set amount for the order total, Doordash hides a portion of the tip until the delivery is complete. The strike occurred after DoorDash rewrote its code to cut off access to Para, a third-party app that drivers had been using to see the full tip amounts. 2025 class-action lawsuit settlement In 2025, DoorDash agreed to pay around $17 million for \"misleading both consumers and delivery workers\" with tips being docked from drivers' pay instead of directly going to drivers. 2020 antitrust litigation In April 2020, in the case of Davitashvili v. GrubHub Inc. DoorDash, Grubhub, Postmates, and Uber Eats were accused of monopolistic power by only listing restaurants on their apps if the restaurant owners signed contracts which include clauses that require prices be the same for dine-in customers as for customers receiving delivery. The plaintiffs stated that this arrangement increases the cost for dine-in customers, as they are required to subsidize the cost of delivery; and that the apps charge \"exorbitant\" fees, which range from 13% to 40% of revenue, while the average restaurant's profit ranges from 3% to 9% of revenue. The lawsuit seeks treble damages, including for overcharges, since April 14, 2016, for dine-in and delivery customers in the United States at restaurants using the defendants’ delivery apps. Although several preliminary documents in the case have now been filed, a trial date has not yet been set. Litigation for illegal unauthorized restaurant listing In May 2021, DoorDash was criticized for unauthorized listings of restaurants who had not given permission to appear on the app. The company was sued by Lona's Lil Eats in St. Louis, with the lawsuit claiming that DoorDash had listed them without permission, then prevented any orders to the restaurant from going through and redirecting customers to other restaurants instead, because Lona's was \"too far away,\" when in reality it had not paid DoorDash a fee for listing. This aspect of DoorDash's business practice is illegal in California. 2021 lawsuit by the city of Chicago In August 2021, the city of Chicago sued DoorDash and GrubHub. According to Chicago mayor Lori Lightfoot, the companies broke the law by using \"unfair and deceptive tactics to take advantage of restaurants and consumers who were struggling to stay afloat during the COVID-19 pandemic.\" DoorDash and GrubHub denied the suit's merits. 2023 class-action lawsuit DoorDash has been accused of charging users of iPhone more than users on the Android platform. User testing claimed to show several instances of various fees and delivery charges being higher when using an Apple device. DoorDash denied these allegations in response to the ongoing US$1 billion class-action suit. 2023 lawsuit by the city of Seattle In August 2023, DoorDash was obligated to pay its drivers and the city of Seattle a total of $1.6 million. It was found that the platform made it difficult for users to request paid time off. DoorDash is to pay $1.1 million towards safe and sick time credits, $500k directly to drivers and an additional $8,500 in city fees. 2024 privacy lawsuit by the state of California In February 2024, after being found to have illegally sold personal data, DoorDash was obligated to pay a $375,000 civil penalty as well as to begin complying with privacy laws it had been shirking, namely CCPA and CalOPPA. Markets DoorDash began expanding into international markets in 2015, launching in Toronto, Canada. The company started operating in markets outside North America in 2019, officially launching in Melbourne, Australia, in September and later expanding further into the country. In 2021, the company expanded its service area to Sendai, Japan in June and Stuttgart, Germany, in November. In June 2022, the company expanded into the Wellington Region of New Zealand. The company expanded its service offerings in 2020, adding grocery delivery initially in California and the Midwest in August 2020. DoorDash expanded the service offerings in 2021 to include DoubleDash, which allows for orders from multiple merchants, and alcohol delivery in 20 U.S. states, Washington, D.C., Canada, and Australia. Acquisitions In August 2019, the company acquired Scotty Labs, a tele-operations startup company that focuses on self-driving and remote-controlled vehicle technology. In October 2019, DoorDash acquired Caviar, a service specializing in food delivery from upscale urban-area restaurants that typically do not offer delivery, from Square, Inc. for $410 million. On February 8, 2021, DoorDash announced its acquisition of Chowbotics, a robotics company known for its salad-making robot. The companies did not disclose the terms of the deal, but Chowbotics was valued at $46 million in 2018. On November 9, 2021, DoorDash announced its acquisition of the Finnish technology company Wolt for over $8.1 billion. In March of 2022, DoorDash announced its acquisition of Bbot, startup that developed digital ordering and payment solutions for restaurants and hospitality venues. In April 2025, the company made an initial offer to acquire Deliveroo, a UK-based food delivery company, for £2.7 billion($3.6 billion). In May 2025, DoorDash announced it had acquired Deliveroo for $3.9 billion. In May 2025, DoorDash announced the $1.2 billion all-cash acquisition of restaurant booking platform SevenRooms. Philanthropy In 2018, DoorDash launched Project DASH, a partnership with local food security organizations to deliver donations to those in need. By August 2019, the program had expanded to 25 cities in the United States and Canada and had delivered more than one million pounds of food. As of September 2021, Project DASH operated in more than 900 cities and had delivered more than 15 million meals. DoorDash partnered with the National Urban League in 2020 as part of its Main Street Strong program, pledging $200 million over five years to support restaurants and drivers during the COVID-19 pandemic, $12 million of which was allotted to assisting drivers of color in building job skills and financial literacy. In 2022, DoorDash partnered with Meals on Wheels to help deliver food to senior citizens."
}