{
  "ticker": "DAY",
  "cik": "0001725057",
  "company_name": "Dayforce",
  "corrected_name": "Dayforce",
  "wiki_title_used": "Dayforce",
  "exists": true,
  "raw_text": "Dayforce, Inc., formerly Ceridian, is an American human resources software and services company. It is a publicly traded on the New York Stock Exchange and Toronto Stock Exchange.\nDayforce is also the name of the company's cloud Human Capital Management (HCM) platform, which covers the full suite of human capital management software, including payroll, tax filing, benefits, HR, talent intelligence, workforce management, and recruiting technology.\n\nHistory\nDayforce, formerly Ceridian, is a descendant of Control Data Corporation (CDC). In 1992, Ceridian Corporation was founded as an information services company from the restructuring of CDC, a computer services and manufacturing company founded in 1957. The computer product business was spun-off as Control Data Systems (CDS) and took the Control Data name.\nIn March 2001, Ceridian was split into two independent companies, with the \"old\" Ceridian Corporation changed its name to Arbitron and the rest of company (consisting of human resources services and Comdata business) took the Ceridian name.\nIn 2007, Ceridian was acquired for US$5.3 billion by Thomas H. Lee Partners and Fidelity National Financial (FNF). Ceridian common stock ceased trading on the NYSE before commencement of trading on November 9, 2007 and was delisted from the NYSE.\nIn March 2012, Ceridian completed its acquisition of Dayforce, a single SaaS application for HR, payroll, tax, benefits, workforce management, talent management, and several related activities. In October 2013, Ceridian announced the legal separation of its Human Capital Management and payments businesses. Ceridian completed the separation on October 1, 2013 through a series of transactions, which resulted in the payments business being operated as Comdata Inc. (“Comdata”), and the HCM business being operated as Ceridian HCM Holding Inc. (“Ceridian HCM”).\nIn April 2018, Ceridian went public in an initial offering that raised over $400 million.\nIn September 2019, Ceridian acquired Australia-based enterprise HR software company Riteq.\nIn April 2020, Ceridian acquired an Asian HCM (Excelity Global Solutions).\nOn March 1, 2021, Ceridian completed the acquisition of Ascender HCM.\nOn December 3, 2021, Ceridian acquired the US-based ADAM Human Capital Management which was a leading provider of payroll and HCM software and services for 33 countries in the Latin American, Brazilian, and Caribbean markets.\nOn January 1, 2024, Ceridian acquired Denmark-based Eloomi, a learning and development (L&D) platform that combines a learning management system (LMS) and performance management into a single, all-in-one solution. \nOn February 1, 2024, Ceridian transitioned the company’s brand to Dayforce and its ticker symbol to DAY on the New York Stock Exchange and Toronto Stock Exchange, replacing its previous symbol \"CDAY\", which was used since the company’s initial public offering in 2018.\nIn August 2025, private equity firm Thoma Bravo agreed to acquire Dayforce in a $12.3 billion deal that also includes a significant minority investment from the Abu Dhabi Investment Authority.\n\nLeadership\nDavid Ossip, Chairman and Chief Executive Officer (2013–present)\n\nReferences\nFurther reading\nAttridge, Mark; Herlihy, Patricia A.; Maiden, R. Paul, eds. (2006). The Integration of Employee Assistance, Work/Life, and Wellness Services. Taylor & Francis. p. 185. ISBN 978-1136751882.\nBloom, Daniel (2013). Achieving HR Excellence through Six Sigma. Taylor & Francis. p. 95. ISBN 978-1466586468.\nJensen, Mark (2013). HR Pioneers: A History of Human Resource Innovations at Control Data Corporation. North Star Press of St. Cloud. ISBN 978-0878396535.\n\nExternal links\nBusiness data for Dayforce, Inc.:",
  "clean_text": "Dayforce, Inc., formerly Ceridian, is an American human resources software and services company. It is a publicly traded on the New York Stock Exchange and Toronto Stock Exchange. Dayforce is also the name of the company's cloud Human Capital Management (HCM) platform, which covers the full suite of human capital management software, including payroll, tax filing, benefits, HR, talent intelligence, workforce management, and recruiting technology. History Dayforce, formerly Ceridian, is a descendant of Control Data Corporation (CDC). In 1992, Ceridian Corporation was founded as an information services company from the restructuring of CDC, a computer services and manufacturing company founded in 1957. The computer product business was spun-off as Control Data Systems (CDS) and took the Control Data name. In March 2001, Ceridian was split into two independent companies, with the \"old\" Ceridian Corporation changed its name to Arbitron and the rest of company (consisting of human resources services and Comdata business) took the Ceridian name. In 2007, Ceridian was acquired for US$5.3 billion by Thomas H. Lee Partners and Fidelity National Financial (FNF). Ceridian common stock ceased trading on the NYSE before commencement of trading on November 9, 2007 and was delisted from the NYSE. In March 2012, Ceridian completed its acquisition of Dayforce, a single SaaS application for HR, payroll, tax, benefits, workforce management, talent management, and several related activities. In October 2013, Ceridian announced the legal separation of its Human Capital Management and payments businesses. Ceridian completed the separation on October 1, 2013 through a series of transactions, which resulted in the payments business being operated as Comdata Inc. (“Comdata”), and the HCM business being operated as Ceridian HCM Holding Inc. (“Ceridian HCM”). In April 2018, Ceridian went public in an initial offering that raised over $400 million. In September 2019, Ceridian acquired Australia-based enterprise HR software company Riteq. In April 2020, Ceridian acquired an Asian HCM (Excelity Global Solutions). On March 1, 2021, Ceridian completed the acquisition of Ascender HCM. On December 3, 2021, Ceridian acquired the US-based ADAM Human Capital Management which was a leading provider of payroll and HCM software and services for 33 countries in the Latin American, Brazilian, and Caribbean markets. On January 1, 2024, Ceridian acquired Denmark-based Eloomi, a learning and development (L&D) platform that combines a learning management system (LMS) and performance management into a single, all-in-one solution. On February 1, 2024, Ceridian transitioned the company’s brand to Dayforce and its ticker symbol to DAY on the New York Stock Exchange and Toronto Stock Exchange, replacing its previous symbol \"CDAY\", which was used since the company’s initial public offering in 2018. In August 2025, private equity firm Thoma Bravo agreed to acquire Dayforce in a $12.3 billion deal that also includes a significant minority investment from the Abu Dhabi Investment Authority. Leadership David Ossip, Chairman and Chief Executive Officer (2013–present)"
}