{
  "ticker": "DECK",
  "cik": "0000910521",
  "company_name": "Deckers Brands",
  "corrected_name": "Deckers Brands",
  "wiki_title_used": "Deckers Brands",
  "exists": true,
  "raw_text": "Deckers Outdoor Corporation, doing business as Deckers Brands, is an American footwear designer and distributor founded in 1973 and based in Goleta, California. The company's portfolio of brands includes UGG, Teva, and Hoka. It was founded by Doug Otto and Karl F. Lopker.\n\nHistory\nIn 1973, Karl Lopker began his career making and selling flip-flops at craft fairs along the West Coast of the United States. In 1975, Doug Otto visited Hawaii on business and found that locals referred to his sandals as \"deckas\", a slang word based on their striped layered construction that resembled a \"deck\" of stacked wood. Liking the name, Lopker and Otto named their brand Deckers.\nIn 1985, Deckers expanded its range of sandals when it entered into a licensing agreement to produce and distribute Teva sandals. Deckers purchased Teva's patents, trademarks, and other assets in 2002.\nThe company was renamed Deckers Outdoor Corporation when it went public on the NASDAQ in 1993, and Deckers purchased Simple Shoes.\nIn 1995, Deckers purchased UGG Holdings. UGG boots became well known after they were included on The Oprah Winfrey Show's Favorite Things segment in 2003.\nIn 2010, Deckers acquired MOZO Shoes, a brand that produced footwear for the culinary industry, but sold the brand in July 2015. Deckers acquired Sanuk shoes for $120 million in 2011, which it later divested to Canadian sportswear company Lolë. In 2013, Deckers acquired Hoka One One. In 2015, Deckers acquired Koolaburra and positioned it under its UGG brand.\n\nBrands\nUGG\nUGG brand boots have a sheepskin upper with a wool inner lining and a tanned outer surface worn by men and women. Surfing helped popularize the boots outside of Australia and New Zealand, when surfer Brian Smith started selling the boots in the US through UGG Holdings, Inc. in 1979.\nDeckers is considered a niche market supplier due to heavy reliance on its UGG brand, a fashion luxury item, in its sales. In the economic downturn of 2008, Deckers continued to show earnings and sales growth. UGG boots are Deckers' primary source of revenue.\n\nHOKA\nHoka is a sportswear company that designs and markets running shoes. It was founded in 2009 in Annecy, France, and had been based in Richmond, California before it was acquired by Deckers Brands in 2013. Hoka first gained attention in the running industry by producing shoes with oversized midsoles, dubbed \"maximalist\" shoes. It has sponsored a variety of professional runners and running competitions.\n\nTeva\nGeophysicist Mark Thatcher invented Teva (pronounced /ˈtɛvə/ TEH-və not /ˈtivə/  TEE-və in English; the name is based on Hebrew: טבע, meaning \"nature\").\n While working as a rafting guide in 1982 he noticed the lack of proper shoes for river activities.  Sneakers would become heavy when wet and would take days to dry, and flip-flops would slide off feet very easily.\n\nThatcher added a nylon ankle strap to a traditional thong-style sandal, thus creating the first sports sandal. Thatcher patented his invention and signed an agreement with the shoemaker California Pacific to manufacture the shoes. He marketed the \"amphibious utility sandals\" as their salesman, selling 200 pairs the first year. Although it was effective water sports footwear, it proved less effective for regular sports, as the first Teva users often complained of blisters between the first and second toes caused by the thong-style strapping system. However in 1984 demand for Teva sandals suddenly increase as young Americans found the sandal fashionable. California Pacific then claimed rights over the Teva name and patent, stating that Thatcher was merely an employee of their company. Thatcher sued California Pacific and won his case the following year, severing links with California Pacific. He then started the Teva company in Flagstaff, Arizona.\nIn late 1985, Thatcher set up an exclusive licensing agreement with Deckers Corporation to manufacture and distribute Teva sandals. Deckers eventually obtained exclusive rights to Teva, including US patent #4,793,075 for the basic design and a trademark for the brand name. The sandal was redesigned, creating the \"Universal Strapping System\". The strapping system includes a heel strap that goes around the ankle to prevent the sandal from sliding off, and a side strap that prevents the sandal from stretching in awkward positions where injury could occur. Each strap is connected to the others by triangular \"rings\". The basic model consists of a two-layer sole; the inner sole is softer and serves as the footbed, and most models come with arch support and Microban Zinc, a technology that reduces odor and kills bacteria. The outer sole is harder and is formulated to have a good grip on wet surfaces.\nOn November 25, 2002, Deckers Outdoor Cooperation acquired the worldwide Teva patents, trademarks, and other assets from Mark Thatcher.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Deckers Outdoor:",
  "clean_text": "Deckers Outdoor Corporation, doing business as Deckers Brands, is an American footwear designer and distributor founded in 1973 and based in Goleta, California. The company's portfolio of brands includes UGG, Teva, and Hoka. It was founded by Doug Otto and Karl F. Lopker. History In 1973, Karl Lopker began his career making and selling flip-flops at craft fairs along the West Coast of the United States. In 1975, Doug Otto visited Hawaii on business and found that locals referred to his sandals as \"deckas\", a slang word based on their striped layered construction that resembled a \"deck\" of stacked wood. Liking the name, Lopker and Otto named their brand Deckers. In 1985, Deckers expanded its range of sandals when it entered into a licensing agreement to produce and distribute Teva sandals. Deckers purchased Teva's patents, trademarks, and other assets in 2002. The company was renamed Deckers Outdoor Corporation when it went public on the NASDAQ in 1993, and Deckers purchased Simple Shoes. In 1995, Deckers purchased UGG Holdings. UGG boots became well known after they were included on The Oprah Winfrey Show's Favorite Things segment in 2003. In 2010, Deckers acquired MOZO Shoes, a brand that produced footwear for the culinary industry, but sold the brand in July 2015. Deckers acquired Sanuk shoes for $120 million in 2011, which it later divested to Canadian sportswear company Lolë. In 2013, Deckers acquired Hoka One One. In 2015, Deckers acquired Koolaburra and positioned it under its UGG brand. Brands UGG UGG brand boots have a sheepskin upper with a wool inner lining and a tanned outer surface worn by men and women. Surfing helped popularize the boots outside of Australia and New Zealand, when surfer Brian Smith started selling the boots in the US through UGG Holdings, Inc. in 1979. Deckers is considered a niche market supplier due to heavy reliance on its UGG brand, a fashion luxury item, in its sales. In the economic downturn of 2008, Deckers continued to show earnings and sales growth. UGG boots are Deckers' primary source of revenue. HOKA Hoka is a sportswear company that designs and markets running shoes. It was founded in 2009 in Annecy, France, and had been based in Richmond, California before it was acquired by Deckers Brands in 2013. Hoka first gained attention in the running industry by producing shoes with oversized midsoles, dubbed \"maximalist\" shoes. It has sponsored a variety of professional runners and running competitions. Teva Geophysicist Mark Thatcher invented Teva (pronounced /ˈtɛvə/ TEH-və not /ˈtivə/ TEE-və in English; the name is based on Hebrew: טבע, meaning \"nature\"). While working as a rafting guide in 1982 he noticed the lack of proper shoes for river activities. Sneakers would become heavy when wet and would take days to dry, and flip-flops would slide off feet very easily. Thatcher added a nylon ankle strap to a traditional thong-style sandal, thus creating the first sports sandal. Thatcher patented his invention and signed an agreement with the shoemaker California Pacific to manufacture the shoes. He marketed the \"amphibious utility sandals\" as their salesman, selling 200 pairs the first year. Although it was effective water sports footwear, it proved less effective for regular sports, as the first Teva users often complained of blisters between the first and second toes caused by the thong-style strapping system. However in 1984 demand for Teva sandals suddenly increase as young Americans found the sandal fashionable. California Pacific then claimed rights over the Teva name and patent, stating that Thatcher was merely an employee of their company. Thatcher sued California Pacific and won his case the following year, severing links with California Pacific. He then started the Teva company in Flagstaff, Arizona. In late 1985, Thatcher set up an exclusive licensing agreement with Deckers Corporation to manufacture and distribute Teva sandals. Deckers eventually obtained exclusive rights to Teva, including US patent #4,793,075 for the basic design and a trademark for the brand name. The sandal was redesigned, creating the \"Universal Strapping System\". The strapping system includes a heel strap that goes around the ankle to prevent the sandal from sliding off, and a side strap that prevents the sandal from stretching in awkward positions where injury could occur. Each strap is connected to the others by triangular \"rings\". The basic model consists of a two-layer sole; the inner sole is softer and serves as the footbed, and most models come with arch support and Microban Zinc, a technology that reduces odor and kills bacteria. The outer sole is harder and is formulated to have a good grip on wet surfaces. On November 25, 2002, Deckers Outdoor Cooperation acquired the worldwide Teva patents, trademarks, and other assets from Mark Thatcher."
}