{
  "ticker": "DG",
  "cik": "0000029534",
  "company_name": "Dollar General",
  "corrected_name": "Dollar General",
  "wiki_title_used": "Dollar General",
  "exists": true,
  "raw_text": "Dollar General Corporation is an American chain of discount stores headquartered in Goodlettsville, Tennessee. As of January 8, 2024, Dollar General has operated 19,643 stores in the contiguous United States and Mexico.\nThe company began in 1939 in Scottsville, Kentucky, as a family-owned business called J.L. Turner and Son, owned by James Luther Turner and Cal Turner. In 1955, the name changed to Dollar General Corporation, and in 1968 the company went public on the New York Stock Exchange. The Fortune 500 recognized Dollar General in 1999, and in 2020 it reached No. 112 on the list. Dollar General has grown to become one of the most profitable stores in the rural United States, with revenue reaching around $27 billion in 2019.\nThe company and its business practices have been subject to criticism, particularly regarding how it may be creating and perpetuating food deserts and stifling local businesses while offering fewer and lower-paying jobs.\n\nHistory\nJ.L. Turner and Son: 1939–1964\nDollar General has its origin in Scottsville, Kentucky, with James Luther \"J.L.\" Turner and his son Cal Turner. James Turner's father died in an accident in 1902 when James was only 11. James quit school to work on the family farm, helping to provide for his mother and siblings, and subsequently never completed his education. After two unsuccessful attempts at retailing, James became a traveling dry goods salesman for a Nashville wholesale grocer. James left the sales job after 10 years and settled his family in Scottsville, Kentucky. During the Great Depression, he began buying and liquidating bankrupt general stores. Cal accompanied his father to these closeouts at a young age, gaining valuable business knowledge and skills.\nIn October 1939, James and Cal opened J.L. Turner and Son with an initial investment of $5,000 each (equivalent to $113,000 in 2024). The switch to retailing resulted in annual sales above $2 million by the early 1950s. By the mid-1950s Turner had 35 department stores in Kentucky and Tennessee. In 1955, Cal Turner developed his idea of a retail store selling goods for a dollar, based on the Dollar Days promotions held at other department stores, by converting Turner's Department Store in Springfield, Kentucky, into the first Dollar General Store. In 1964, J.L. Turner died, leaving his son Cal Turner to succeed him.\n\n1968–2002\nThe company Cal Turner co-founded went public as Dollar General Corporation in 1968, posting annual sales of more than $40 million and net income in excess of $1.5 million. In 1977, Cal Turner Jr., who joined the company in 1965 as a third-generation Turner, succeeded his father as CEO of Dollar General. In 1989, Cal Sr. retired as chairman and the company headquarters were moved to Tennessee. Under his son's leadership, the company grew to more than 6,000 stores and $6 billion in sales. In 1997 a distribution center was established in South Boston, Virginia.\nIn 2000, Dollar General opened a new corporate headquarters in Goodlettsville, Tennessee. By the end of 2000, sales at Dollar General exceeded $4 billion. The distribution center in Homerville, Georgia, was closed in April 2000 and operations were moved to a new distribution center in Alachua, Florida.\nCal Jr. retired in 2002 and was succeeded by David Perdue on April 2, 2003.\n\n2003–present\nDollar General entered the grocery market with the establishment of Dollar General Market in 2003. In 2004, Dollar General expanded to low-cost Asian markets by opening a sourcing office in Hong Kong.\nOn June 21, 2007, CEO David Perdue announced his resignation, leaving David Bere as interim CEO. One month later, all shares of Dollar General publicly listed were acquired by private equity investors for $22 per share. An investment group consisting of affiliates of Kohlberg Kravis Roberts (KKR), GS Capital Partners (an affiliate of Goldman Sachs), Citigroup Private Equity, and other co-investors completed an acquisition of Dollar General Corporation for $6.9 billion.\nAs a part of the transition to a privately held company, Dollar General assessed each location at the end of its lease against a model known as \"EZ Stores\". This assessment included evaluating whether the location had a loading dock, garbage dumpsters, adequate parking, and acceptable profitability. Stores that did not pass this evaluation were relocated or closed. Over 400 stores were closed as part of this initiative.\n\nDollar General filed on August 20, 2009, for an initial public offering of up to $750 million, turning the company once again into a publicly traded corporation. In 2013, Dollar General started selling cigarettes in response to its competitor Family Dollar selling cigarettes in 2012. Dollar General's 12th distribution center opened on May 31, 2014, in Bethel, Pennsylvania, to serve the Northeast and Midwest stores. On August 18, 2014, Dollar General lodged a competing bid of $9.7 billion against Dollar Tree for Family Dollar. The bid was rejected on August 20, 2014, by the Family Dollar board, which said it would proceed with the deal with Dollar Tree.\nOn June 3, 2015, Chief Operating Officer Todd Vasos replaced Rick Dreiling as chief executive. Dreiling remained as senior advisor and chairman until his retirement in January 2016. Dollar General's 13th distribution center opened in San Antonio, Texas, on June 6, 2016, with a local investment of $100 million and the creation of over 500 jobs. In September 2015, the City Council in Janesville, Wisconsin, approved an agreement to bring a Dollar General distribution center to the town. The center created more than 500 jobs in the area and became the 14th Dollar General distribution center.\n\nOn September 15, 2016, Dollar General announced plans to hire 10,000 new employees and open 900 new stores in fiscal 2016 and 1,000 in fiscal 2017. Dollar General operated 13,000 stores as of August 2016.\nIn January 2017, Dollar General opened a concept store in Nashville, Tennessee, called DGX. The DGX store concept focuses on urban shoppers and is geared toward instant-consumption services such as coffee stations and soda fountains. The following month another DGX store opened in Raleigh, North Carolina, and in September a third DGX opened in Philadelphia, Pennsylvania. As of May 2020, Dollar General operated 12 DGX locations in nine states.\n\nIn Jackson, Georgia, Dollar General opened its 15th distribution center in fall 2017 to serve stores in Georgia and the surrounding states. In 2017, Dollar General began construction for its 16th distribution center, in Amsterdam, New York. The distribution center was to cost $91 million and was expected to create 400 jobs in Montgomery County, New York. Dollar General planned to open 900 new stores in 2018. The distribution center became fully operational in 2019. Also in 2017, Dollar General acquired stores from Dollar Express LLC held by Sycamore Partners, a spinoff from the Family Dollar–Dollar Tree deal, and converted the store.\nIn September 2019, Dollar General celebrated the grand opening of its 16,000th store, in Panama City, Florida, following damage sustained from Hurricane Michael in October 2018. To commemorate the opening, Dollar General presented two $16,000 checks in partnership with Kellogg's to two local elementary schools displaced from the hurricane.\nOn December 5, 2019, Dollar General announced plans for fiscal 2020 that included the opening of 1,000 new stores, remodeling of 1,500 mature stores, and relocation of 80 stores. In February 2020, Dollar General announced plans to create 8,000 net new career opportunities in fiscal year 2020. Dollar General expanded to 46 states in 2020 with the addition of new stores in Wyoming in March and Washington in April.\n\nIn late May 2020, two Dollar General stores were destroyed by arson during the George Floyd protests in Minneapolis–Saint Paul, and three others had property damage.\nIn October 2020, Dollar General launched a new store concept known as Popshelf (stylized pOpshelf), which primarily focuses on higher-margin, non-essential household goods including arts and crafts, home decor, health and beauty, electronics, toys, and seasonal specialty items (including party supplies). Most products would cost less than $5, with the stores primarily targeting \"suburban moms\" seeking \"trendy\" and \"elevated\" items. Dollar General planned to open 50 free-standing locations by the end of 2021, and 25 Popshelf store-within-a-store locations inside Dollar General Market stores. By 2024, Popshelf had expanded to 200 locations.\nIn April 2021, the company said it was planning to hire 20,000 employees, less than the number hired in 2020 (50,000).\nOn 5 March 2022, Dollar General opened its first store in the state of Idaho, located in Athol.\nOn 12 October 2023, Dollar General announced the return of former CEO Todd Vasos, who replaced Jeff Owen. Chairman Michael Calbert said in a statement, “At this time the Board has determined that a change in leadership is necessary to restore stability and confidence in the Company moving forward\".\nIn September 2024, Popshelf's senior vice president Vichidvongsa stated that it would discontinue its store-within-a-store locations, citing that the demographics of Dollar General Market shoppers did not align with the target markets of Popshelf. The following month, Popshelf introduced an updated store format with additional product offerings, as well as a new loyalty rewards app.\n\nMajor sponsorships\nAuto racing\nFor several years, Dollar General has had a connection with motorsports, particularly in NASCAR. The company has previously been a primary sponsor for Joe Gibbs Racing. Dollar General sponsored Brian Vickers in the Nationwide Series in 2013. Dollar General became a primary sponsor for Matt Kenseth in the Sprint Cup Series starting in 2013. Dollar General and Turner (formerly Braun Racing) have been partnered together since 2008, with the team previously sponsoring cars for Frank Cicci Racing and Kevin Harvick Incorporated. In 2010, Dollar General sponsored some races in the Truck Series for Kyle Busch Motorsports, with Kyle Busch in the No. 18 Toyota Tundra, and sponsored Kyle Busch's Motorsports No. 51 Toyota Tundra for four races in 2014, with Busch driving three and Erik Jones driving one. Dollar General was the title sponsor for Nationwide Series races held in Charlotte every fall, Chicagoland every summer, and Phoenix in the spring. On May 23, 2016, Dollar General announced it would withdraw its sponsorship from NASCAR at the end of the 2016 season.\nDollar General has also been active in the IndyCar Series since 2008, serving initially as the primary sponsor for owner/driver Sarah Fisher's Sarah Fisher Racing team. In 2010, both Fisher and Graham Rahal drove part-time for the team, finishing 9th at the Honda Grand Prix of St. Petersburg. Fisher also led the field at the Peak Antifreeze & Motor Oil Indy 300 at Chicagoland Speedway. In 2011, Dollar General continued to sponsor Sarah Fisher Racing; the team was still part-time, but Ed Carpenter drove for nines races starting at the 2011 Indianapolis 500. Dollar General ceased its sponsorship of Sarah Fisher Racing in 2012.\n\nSports\nDollar General became the sponsor of the Dollar General Bowl, formerly the GoDaddy Bowl, in Mobile, Alabama, on August 17, 2016. In May 2019, Dollar General withdrew its title sponsorship of the Mobile bowl game.\n\nMerchandise\nDollar General sells products from national name brands like Clorox, Energizer, Procter & Gamble, Hanes, Coca-Cola, Mars, Unilever, Nestlé, Kimberly-Clark, Kellogg's, General Mills, and PepsiCo.\nIn 2018, Dollar General expanded its product offerings to include the \"Better for You\" assortment, which aims to offer healthier options from brands like Kashi, Annie's, Back to Nature, and Kind.\nBy the end of its 2019 fiscal year, Dollar General offered its produce assortments in more than 650 stores, with plans to expand its produce offerings to an additional 400 stores in fiscal 2020.\n\nPrivate brands\nDollar General has used its abbreviation, the letters \"DG\", as a store brand for \"inexpensive\" household products sold through its stores; the brand is in the process of being phased out for most products as of the early 2020s. DG is also the company's NYSE ticker symbol.\nDollar General private brands include Clover Valley (groceries), Good & Smart (health foods), Smart & Simple (a low-end discount brand), Sweet Smiles (bulk candy), Nature's Menu, Forever Pals and Heartland Farms (pet food and products, formerly EverPet), Gentle Steps (diapers, training pants, and wipes), Studio Selection (beauty and skin care), Believe Beauty (beauty care and makeup), Root to End (hair care), TrueLiving (housewares and laundry), Comfort Bay (towels, blankets, and pillows), Open Trails (men's apparel), Mission Ridge (blue jeans), Zone Pro (sportswear), Rexall (health care, under license from McKesson Corporation), Composure (adult diapers and incontinence pads), Breeze (feminine hygiene), ProEssentials (hardware), DriveMXD (automotive), OfficeHub (office supplies), and Bobbie Brooks (women's apparel, under license).\n\nRexall\nThe brand name Rexall was first established in 1903 by Louis K. Liggett and gradually became a powerhouse as a pharmaceutical drug store chain. Rexall vitamins and supplements began appearing at Dollar General stores in March and by fall 2010 a full line of Rexall products was available at Dollar General.\n\nCorporate affairs\nBoard of directors\nDollar General Board of Directors as of June 2024 are: Michael M. Calbert (Chairman of the Board), Todd Vasos (CEO), Warren Bryant, Patricia Fili-Krushel, Timothy I. McGuire, Ana Chadwick, David Rowland, Debra A. Sandler, and Ralph E. Santana.\n\nEnvironmental Impact\nDollar General has implemented several sustainability initiatives as of 2024. The company has partnered with the Arbor Day Foundation since 2021 to restore over 321 acres of forest and plant more than 96,000 trees near the Mississippi River in Louisiana and Mississippi. Additionally, Dollar General aims to reduce greenhouse gas emissions by 15% by 2026 and 30% per square foot by 2031. They have also made significant progress in recycling, avoiding more than 1.1 million metric tons of GHG emissions through various programs such as the cardboard backhauling initiative.\n\nOperations\nDollar General has more than 19,400 stores in 48 states, the District of Columbia, and Mexico, and approximately 158,000 employees. Dollar General also has 17 distribution centers in 16 states. Since 2017, DG has opened stores in North Dakota, Wyoming, and Washington. As of early 2025, only two states lacked DG stores: Alaska, and Hawaii.\nIn the first half of 2024, Dollar General shut down self-checkout in more than half of its stores across the US because of losses from theft.\n\nSubsidiaries\nDolgencorp\nDolgencorp is a wholly owned subsidiary of Dollar General Corporation. Dollar General brand products are manufactured under the Dolgencorp subsidiary.\n\nDollar General Global Sourcing Ltd.\nIn 2004, a Dollar General office was opened in Hong Kong to oversee the global sourcing operations through exporting and importing products of Dollar General–related goods.\n\nDollar General Literacy Foundation\nSince 1993, Dollar General has provided funding of literacy and education programs through its subsidiary Dollar General Literacy Foundation. Every year the Foundation awards funds to nonprofit organizations, schools, and libraries within a 15-mile radius of a Dollar General store or distribution center. It has awarded more than $182 million in grants to literacy organizations, which have helped more than 11 million individuals learn to read, prepare for the high school equivalency test, or learn English.\nIn 2020, the Dollar General Literacy Foundation awarded $8.6 million to approximately 970 nonprofit organizations, schools, and libraries, its largest one-day grant announcement. The Foundation celebrated its 25th anniversary in 2018.\nIn April 2022, the Dollar General Literacy Foundation announced an approximately $9.2 million commitment to support literacy within the surrounding communities across the United States that Dollar General serves. $8.2 million was earmarked for the spring grants to support family literacy programs across the country, while the remaining $1 million was pledged to the DonorsChoose program.\n\nControversies\nPerpetuating economic distress\nDollar General, along with other dollar store chains, while \"sometimes [filling] a need in cash-strapped communities\" where supermarkets have closed, are regarded not \"merely a byproduct of economic distress. They're a cause of it.\" Dollar store chains, in \"capitalizing on a series of powerful economic and social forces—white flight, the recent recession, the so-called \"retail apocalypse\"—all of which have opened up gaping holes in food access...might not be causing these inequalities per se, they appear to be perpetuating them\". The rapid growth in dollar stores across the US has created food deserts and a \"dollar store belt\". After originally granting them local tax incentives, a number of municipalities have been adding zoning bylaws to discourage dollar stores. According to a study done by the Institute for Local Self-Reliance, dollar stores tend to create fewer and lower-wage jobs than independent grocery stores. The report claims that dollar stores stifle local competition, thereby hurting the communities they are serving.\nIn March 2020, Dollar General announced plans for its 2020 fiscal year to begin offering produce assortments at approximately 400 stores in addition to the 650 stores that already did so. In February 2019, the University of Nevada, Las Vegas, published a story which found that the quality of fruits and vegetables at dollar stores is just as good as at regular grocery stores.\n\nFinancial irregularities\nOn April 30, 2001, Dollar General Corp was judged liable for making false statements or failing to disclose adverse facts about the company's financial results, and paid $162 million for settlement. The company also announced a restatement of its earnings for the previous three fiscal years, due to accounting irregularities including allegations of fraudulent behavior.\nOn March 3, 2005, Dollar General restated its results for 2000 through 2003, due to a clarification of lease-accounting matters issued by the SEC.\n\nOSHA fines\nIn November 2014, Dollar General was fined $51,700 by the Occupational Safety and Health Administration (OSHA) following an inspection of a Brooklyn, Mississippi, branch of the store. The statement from OSHA noted that Dollar General had had repeated health and safety violations: \"Since 2009, OSHA has conducted 72 inspections of Dollar General nationwide. Of those inspections, 39 have resulted in citations.\" In April 2016, OSHA reported that further citations had been given to the store for exposing employees to the risk of electrical hazards due to missing face plates on electrical outlets. The store was fined $107,620. In December 2016, OSHA noted that some Dollar General stores continued to block fire exits with merchandise in disregard of safety violations, resulting in several fines. In early 2022, inspections at three Dollar General store locations throughout Georgia (Pembroke in February and Hogansville and Smyrna in March) identified four willful and seven repeat violations. Specifically, OSHA cited the company for failing to keep receiving areas clean and orderly and for stacking materials in an unsafe manner. These hazards exposed workers to slips, trips, and being struck by objects. OSHA also issued citations for exposing workers to fire and entrapment hazards by failing to keep exit routes and electrical panels clear and unobstructed.\nDollar General's pattern of disregarding worker safety was apparent at five other Southeast locations. In February 2022, OSHA proposed $1,048,309 in penalties after inspections at three locations in Mobile, Alabama, and one in Dalton, Georgia, found similar hazards. At another Mobile location, a December 2021 inspection led OSHA to propose $321,827 in penalties for exposing workers to slip and trip hazards and not keeping the main storeroom orderly to allow a safe exit during an emergency.\nIn March 2023 it was reported that Dollar General was added to OSHA's severe-violator enforcement program.\n\nDollar General Corp. v. Mississippi Band of Choctaw Indians\nPricing irregularities\nIn March 2023 a Barron's article found that North Carolina, Louisiana, Mississippi, and Arizona together had fined Dollar General more than $1 million for price irregularities during 2021 and 2022, and the company was also facing multiple potential class-action lawsuits relating to the issue.\nIn 2019, Dollar General was fined $1.75 million by the state of Vermont over pricing irregularities for charging a higher price for products at the register than was advertised at the shelf.\nDuring 2022, the State of Ohio brought a lawsuit for deceptive pricing.\n\nRural and small town resistance\nThere has been a trend of citizens in small towns organizing to prevent development of Dollar General in towns with a strong rural identity.\nThe Institute for Local Self Reliance, ILSR, assists communities in rejecting Dollar Store development. A report by ILSR, The Dollar Store Invasion details the tactics of the dollar chains and the rising grassroots opposition.\n\nSee also\nDollar Tree\nFamily Dollar\nJ.L. Turner and Son Building\n\nFurther reading\n\"How Dollar General Became Rural America's Store of Choice,\" The Wall Street Journal. Nassauer, Sarah. (December 4, 2017)\n\"Brief intro about DGME stores and their employees,\" (Jan 8, 2025)\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Dollar General Corporation:",
  "clean_text": "Dollar General Corporation is an American chain of discount stores headquartered in Goodlettsville, Tennessee. As of January 8, 2024, Dollar General has operated 19,643 stores in the contiguous United States and Mexico. The company began in 1939 in Scottsville, Kentucky, as a family-owned business called J.L. Turner and Son, owned by James Luther Turner and Cal Turner. In 1955, the name changed to Dollar General Corporation, and in 1968 the company went public on the New York Stock Exchange. The Fortune 500 recognized Dollar General in 1999, and in 2020 it reached No. 112 on the list. Dollar General has grown to become one of the most profitable stores in the rural United States, with revenue reaching around $27 billion in 2019. The company and its business practices have been subject to criticism, particularly regarding how it may be creating and perpetuating food deserts and stifling local businesses while offering fewer and lower-paying jobs. History J.L. Turner and Son: 1939–1964 Dollar General has its origin in Scottsville, Kentucky, with James Luther \"J.L.\" Turner and his son Cal Turner. James Turner's father died in an accident in 1902 when James was only 11. James quit school to work on the family farm, helping to provide for his mother and siblings, and subsequently never completed his education. After two unsuccessful attempts at retailing, James became a traveling dry goods salesman for a Nashville wholesale grocer. James left the sales job after 10 years and settled his family in Scottsville, Kentucky. During the Great Depression, he began buying and liquidating bankrupt general stores. Cal accompanied his father to these closeouts at a young age, gaining valuable business knowledge and skills. In October 1939, James and Cal opened J.L. Turner and Son with an initial investment of $5,000 each (equivalent to $113,000 in 2024). The switch to retailing resulted in annual sales above $2 million by the early 1950s. By the mid-1950s Turner had 35 department stores in Kentucky and Tennessee. In 1955, Cal Turner developed his idea of a retail store selling goods for a dollar, based on the Dollar Days promotions held at other department stores, by converting Turner's Department Store in Springfield, Kentucky, into the first Dollar General Store. In 1964, J.L. Turner died, leaving his son Cal Turner to succeed him. 1968–2002 The company Cal Turner co-founded went public as Dollar General Corporation in 1968, posting annual sales of more than $40 million and net income in excess of $1.5 million. In 1977, Cal Turner Jr., who joined the company in 1965 as a third-generation Turner, succeeded his father as CEO of Dollar General. In 1989, Cal Sr. retired as chairman and the company headquarters were moved to Tennessee. Under his son's leadership, the company grew to more than 6,000 stores and $6 billion in sales. In 1997 a distribution center was established in South Boston, Virginia. In 2000, Dollar General opened a new corporate headquarters in Goodlettsville, Tennessee. By the end of 2000, sales at Dollar General exceeded $4 billion. The distribution center in Homerville, Georgia, was closed in April 2000 and operations were moved to a new distribution center in Alachua, Florida. Cal Jr. retired in 2002 and was succeeded by David Perdue on April 2, 2003. 2003–present Dollar General entered the grocery market with the establishment of Dollar General Market in 2003. In 2004, Dollar General expanded to low-cost Asian markets by opening a sourcing office in Hong Kong. On June 21, 2007, CEO David Perdue announced his resignation, leaving David Bere as interim CEO. One month later, all shares of Dollar General publicly listed were acquired by private equity investors for $22 per share. An investment group consisting of affiliates of Kohlberg Kravis Roberts (KKR), GS Capital Partners (an affiliate of Goldman Sachs), Citigroup Private Equity, and other co-investors completed an acquisition of Dollar General Corporation for $6.9 billion. As a part of the transition to a privately held company, Dollar General assessed each location at the end of its lease against a model known as \"EZ Stores\". This assessment included evaluating whether the location had a loading dock, garbage dumpsters, adequate parking, and acceptable profitability. Stores that did not pass this evaluation were relocated or closed. Over 400 stores were closed as part of this initiative. Dollar General filed on August 20, 2009, for an initial public offering of up to $750 million, turning the company once again into a publicly traded corporation. In 2013, Dollar General started selling cigarettes in response to its competitor Family Dollar selling cigarettes in 2012. Dollar General's 12th distribution center opened on May 31, 2014, in Bethel, Pennsylvania, to serve the Northeast and Midwest stores. On August 18, 2014, Dollar General lodged a competing bid of $9.7 billion against Dollar Tree for Family Dollar. The bid was rejected on August 20, 2014, by the Family Dollar board, which said it would proceed with the deal with Dollar Tree. On June 3, 2015, Chief Operating Officer Todd Vasos replaced Rick Dreiling as chief executive. Dreiling remained as senior advisor and chairman until his retirement in January 2016. Dollar General's 13th distribution center opened in San Antonio, Texas, on June 6, 2016, with a local investment of $100 million and the creation of over 500 jobs. In September 2015, the City Council in Janesville, Wisconsin, approved an agreement to bring a Dollar General distribution center to the town. The center created more than 500 jobs in the area and became the 14th Dollar General distribution center. On September 15, 2016, Dollar General announced plans to hire 10,000 new employees and open 900 new stores in fiscal 2016 and 1,000 in fiscal 2017. Dollar General operated 13,000 stores as of August 2016. In January 2017, Dollar General opened a concept store in Nashville, Tennessee, called DGX. The DGX store concept focuses on urban shoppers and is geared toward instant-consumption services such as coffee stations and soda fountains. The following month another DGX store opened in Raleigh, North Carolina, and in September a third DGX opened in Philadelphia, Pennsylvania. As of May 2020, Dollar General operated 12 DGX locations in nine states. In Jackson, Georgia, Dollar General opened its 15th distribution center in fall 2017 to serve stores in Georgia and the surrounding states. In 2017, Dollar General began construction for its 16th distribution center, in Amsterdam, New York. The distribution center was to cost $91 million and was expected to create 400 jobs in Montgomery County, New York. Dollar General planned to open 900 new stores in 2018. The distribution center became fully operational in 2019. Also in 2017, Dollar General acquired stores from Dollar Express LLC held by Sycamore Partners, a spinoff from the Family Dollar–Dollar Tree deal, and converted the store. In September 2019, Dollar General celebrated the grand opening of its 16,000th store, in Panama City, Florida, following damage sustained from Hurricane Michael in October 2018. To commemorate the opening, Dollar General presented two $16,000 checks in partnership with Kellogg's to two local elementary schools displaced from the hurricane. On December 5, 2019, Dollar General announced plans for fiscal 2020 that included the opening of 1,000 new stores, remodeling of 1,500 mature stores, and relocation of 80 stores. In February 2020, Dollar General announced plans to create 8,000 net new career opportunities in fiscal year 2020. Dollar General expanded to 46 states in 2020 with the addition of new stores in Wyoming in March and Washington in April. In late May 2020, two Dollar General stores were destroyed by arson during the George Floyd protests in Minneapolis–Saint Paul, and three others had property damage. In October 2020, Dollar General launched a new store concept known as Popshelf (stylized pOpshelf), which primarily focuses on higher-margin, non-essential household goods including arts and crafts, home decor, health and beauty, electronics, toys, and seasonal specialty items (including party supplies). Most products would cost less than $5, with the stores primarily targeting \"suburban moms\" seeking \"trendy\" and \"elevated\" items. Dollar General planned to open 50 free-standing locations by the end of 2021, and 25 Popshelf store-within-a-store locations inside Dollar General Market stores. By 2024, Popshelf had expanded to 200 locations. In April 2021, the company said it was planning to hire 20,000 employees, less than the number hired in 2020 (50,000). On 5 March 2022, Dollar General opened its first store in the state of Idaho, located in Athol. On 12 October 2023, Dollar General announced the return of former CEO Todd Vasos, who replaced Jeff Owen. Chairman Michael Calbert said in a statement, “At this time the Board has determined that a change in leadership is necessary to restore stability and confidence in the Company moving forward\". In September 2024, Popshelf's senior vice president Vichidvongsa stated that it would discontinue its store-within-a-store locations, citing that the demographics of Dollar General Market shoppers did not align with the target markets of Popshelf. The following month, Popshelf introduced an updated store format with additional product offerings, as well as a new loyalty rewards app. Major sponsorships Auto racing For several years, Dollar General has had a connection with motorsports, particularly in NASCAR. The company has previously been a primary sponsor for Joe Gibbs Racing. Dollar General sponsored Brian Vickers in the Nationwide Series in 2013. Dollar General became a primary sponsor for Matt Kenseth in the Sprint Cup Series starting in 2013. Dollar General and Turner (formerly Braun Racing) have been partnered together since 2008, with the team previously sponsoring cars for Frank Cicci Racing and Kevin Harvick Incorporated. In 2010, Dollar General sponsored some races in the Truck Series for Kyle Busch Motorsports, with Kyle Busch in the No. 18 Toyota Tundra, and sponsored Kyle Busch's Motorsports No. 51 Toyota Tundra for four races in 2014, with Busch driving three and Erik Jones driving one. Dollar General was the title sponsor for Nationwide Series races held in Charlotte every fall, Chicagoland every summer, and Phoenix in the spring. On May 23, 2016, Dollar General announced it would withdraw its sponsorship from NASCAR at the end of the 2016 season. Dollar General has also been active in the IndyCar Series since 2008, serving initially as the primary sponsor for owner/driver Sarah Fisher's Sarah Fisher Racing team. In 2010, both Fisher and Graham Rahal drove part-time for the team, finishing 9th at the Honda Grand Prix of St. Petersburg. Fisher also led the field at the Peak Antifreeze & Motor Oil Indy 300 at Chicagoland Speedway. In 2011, Dollar General continued to sponsor Sarah Fisher Racing; the team was still part-time, but Ed Carpenter drove for nines races starting at the 2011 Indianapolis 500. Dollar General ceased its sponsorship of Sarah Fisher Racing in 2012. Sports Dollar General became the sponsor of the Dollar General Bowl, formerly the GoDaddy Bowl, in Mobile, Alabama, on August 17, 2016. In May 2019, Dollar General withdrew its title sponsorship of the Mobile bowl game. Merchandise Dollar General sells products from national name brands like Clorox, Energizer, Procter & Gamble, Hanes, Coca-Cola, Mars, Unilever, Nestlé, Kimberly-Clark, Kellogg's, General Mills, and PepsiCo. In 2018, Dollar General expanded its product offerings to include the \"Better for You\" assortment, which aims to offer healthier options from brands like Kashi, Annie's, Back to Nature, and Kind. By the end of its 2019 fiscal year, Dollar General offered its produce assortments in more than 650 stores, with plans to expand its produce offerings to an additional 400 stores in fiscal 2020. Private brands Dollar General has used its abbreviation, the letters \"DG\", as a store brand for \"inexpensive\" household products sold through its stores; the brand is in the process of being phased out for most products as of the early 2020s. DG is also the company's NYSE ticker symbol. Dollar General private brands include Clover Valley (groceries), Good & Smart (health foods), Smart & Simple (a low-end discount brand), Sweet Smiles (bulk candy), Nature's Menu, Forever Pals and Heartland Farms (pet food and products, formerly EverPet), Gentle Steps (diapers, training pants, and wipes), Studio Selection (beauty and skin care), Believe Beauty (beauty care and makeup), Root to End (hair care), TrueLiving (housewares and laundry), Comfort Bay (towels, blankets, and pillows), Open Trails (men's apparel), Mission Ridge (blue jeans), Zone Pro (sportswear), Rexall (health care, under license from McKesson Corporation), Composure (adult diapers and incontinence pads), Breeze (feminine hygiene), ProEssentials (hardware), DriveMXD (automotive), OfficeHub (office supplies), and Bobbie Brooks (women's apparel, under license). Rexall The brand name Rexall was first established in 1903 by Louis K. Liggett and gradually became a powerhouse as a pharmaceutical drug store chain. Rexall vitamins and supplements began appearing at Dollar General stores in March and by fall 2010 a full line of Rexall products was available at Dollar General. Corporate affairs Board of directors Dollar General Board of Directors as of June 2024 are: Michael M. Calbert (Chairman of the Board), Todd Vasos (CEO), Warren Bryant, Patricia Fili-Krushel, Timothy I. McGuire, Ana Chadwick, David Rowland, Debra A. Sandler, and Ralph E. Santana. Environmental Impact Dollar General has implemented several sustainability initiatives as of 2024. The company has partnered with the Arbor Day Foundation since 2021 to restore over 321 acres of forest and plant more than 96,000 trees near the Mississippi River in Louisiana and Mississippi. Additionally, Dollar General aims to reduce greenhouse gas emissions by 15% by 2026 and 30% per square foot by 2031. They have also made significant progress in recycling, avoiding more than 1.1 million metric tons of GHG emissions through various programs such as the cardboard backhauling initiative. Operations Dollar General has more than 19,400 stores in 48 states, the District of Columbia, and Mexico, and approximately 158,000 employees. Dollar General also has 17 distribution centers in 16 states. Since 2017, DG has opened stores in North Dakota, Wyoming, and Washington. As of early 2025, only two states lacked DG stores: Alaska, and Hawaii. In the first half of 2024, Dollar General shut down self-checkout in more than half of its stores across the US because of losses from theft. Subsidiaries Dolgencorp Dolgencorp is a wholly owned subsidiary of Dollar General Corporation. Dollar General brand products are manufactured under the Dolgencorp subsidiary. Dollar General Global Sourcing Ltd. In 2004, a Dollar General office was opened in Hong Kong to oversee the global sourcing operations through exporting and importing products of Dollar General–related goods. Dollar General Literacy Foundation Since 1993, Dollar General has provided funding of literacy and education programs through its subsidiary Dollar General Literacy Foundation. Every year the Foundation awards funds to nonprofit organizations, schools, and libraries within a 15-mile radius of a Dollar General store or distribution center. It has awarded more than $182 million in grants to literacy organizations, which have helped more than 11 million individuals learn to read, prepare for the high school equivalency test, or learn English. In 2020, the Dollar General Literacy Foundation awarded $8.6 million to approximately 970 nonprofit organizations, schools, and libraries, its largest one-day grant announcement. The Foundation celebrated its 25th anniversary in 2018. In April 2022, the Dollar General Literacy Foundation announced an approximately $9.2 million commitment to support literacy within the surrounding communities across the United States that Dollar General serves. $8.2 million was earmarked for the spring grants to support family literacy programs across the country, while the remaining $1 million was pledged to the DonorsChoose program. Controversies Perpetuating economic distress Dollar General, along with other dollar store chains, while \"sometimes [filling] a need in cash-strapped communities\" where supermarkets have closed, are regarded not \"merely a byproduct of economic distress. They're a cause of it.\" Dollar store chains, in \"capitalizing on a series of powerful economic and social forces—white flight, the recent recession, the so-called \"retail apocalypse\"—all of which have opened up gaping holes in food access...might not be causing these inequalities per se, they appear to be perpetuating them\". The rapid growth in dollar stores across the US has created food deserts and a \"dollar store belt\". After originally granting them local tax incentives, a number of municipalities have been adding zoning bylaws to discourage dollar stores. According to a study done by the Institute for Local Self-Reliance, dollar stores tend to create fewer and lower-wage jobs than independent grocery stores. The report claims that dollar stores stifle local competition, thereby hurting the communities they are serving. In March 2020, Dollar General announced plans for its 2020 fiscal year to begin offering produce assortments at approximately 400 stores in addition to the 650 stores that already did so. In February 2019, the University of Nevada, Las Vegas, published a story which found that the quality of fruits and vegetables at dollar stores is just as good as at regular grocery stores. Financial irregularities On April 30, 2001, Dollar General Corp was judged liable for making false statements or failing to disclose adverse facts about the company's financial results, and paid $162 million for settlement. The company also announced a restatement of its earnings for the previous three fiscal years, due to accounting irregularities including allegations of fraudulent behavior. On March 3, 2005, Dollar General restated its results for 2000 through 2003, due to a clarification of lease-accounting matters issued by the SEC. OSHA fines In November 2014, Dollar General was fined $51,700 by the Occupational Safety and Health Administration (OSHA) following an inspection of a Brooklyn, Mississippi, branch of the store. The statement from OSHA noted that Dollar General had had repeated health and safety violations: \"Since 2009, OSHA has conducted 72 inspections of Dollar General nationwide. Of those inspections, 39 have resulted in citations.\" In April 2016, OSHA reported that further citations had been given to the store for exposing employees to the risk of electrical hazards due to missing face plates on electrical outlets. The store was fined $107,620. In December 2016, OSHA noted that some Dollar General stores continued to block fire exits with merchandise in disregard of safety violations, resulting in several fines. In early 2022, inspections at three Dollar General store locations throughout Georgia (Pembroke in February and Hogansville and Smyrna in March) identified four willful and seven repeat violations. Specifically, OSHA cited the company for failing to keep receiving areas clean and orderly and for stacking materials in an unsafe manner. These hazards exposed workers to slips, trips, and being struck by objects. OSHA also issued citations for exposing workers to fire and entrapment hazards by failing to keep exit routes and electrical panels clear and unobstructed. Dollar General's pattern of disregarding worker safety was apparent at five other Southeast locations. In February 2022, OSHA proposed $1,048,309 in penalties after inspections at three locations in Mobile, Alabama, and one in Dalton, Georgia, found similar hazards. At another Mobile location, a December 2021 inspection led OSHA to propose $321,827 in penalties for exposing workers to slip and trip hazards and not keeping the main storeroom orderly to allow a safe exit during an emergency. In March 2023 it was reported that Dollar General was added to OSHA's severe-violator enforcement program. Dollar General Corp. v. Mississippi Band of Choctaw Indians Pricing irregularities In March 2023 a Barron's article found that North Carolina, Louisiana, Mississippi, and Arizona together had fined Dollar General more than $1 million for price irregularities during 2021 and 2022, and the company was also facing multiple potential class-action lawsuits relating to the issue. In 2019, Dollar General was fined $1.75 million by the state of Vermont over pricing irregularities for charging a higher price for products at the register than was advertised at the shelf. During 2022, the State of Ohio brought a lawsuit for deceptive pricing. Rural and small town resistance There has been a trend of citizens in small towns organizing to prevent development of Dollar General in towns with a strong rural identity. The Institute for Local Self Reliance, ILSR, assists communities in rejecting Dollar Store development. A report by ILSR, The Dollar Store Invasion details the tactics of the dollar chains and the rising grassroots opposition."
}