{
  "ticker": "DGX",
  "cik": "0001022079",
  "company_name": "Quest Diagnostics",
  "corrected_name": "Quest Diagnostics",
  "wiki_title_used": "Quest Diagnostics",
  "exists": true,
  "raw_text": "Quest Diagnostics Incorporated is an American clinical laboratory. A Fortune 500 company, Quest operates in the United States, Puerto Rico, Mexico, and Brazil. Quest also maintains collaborative agreements with various hospitals and clinics across the globe.\nAs of 2020, the company had approximately 48,000 employees, and it generated more than $7.7 billion in revenue in 2019. The company offers access to diagnostic testing services for cancer, cardiovascular disease, infectious disease, neurological disorders, COVID-19, and employment and court-ordered drug testing.\n\nHistory\n1960–1995\nOriginally founded as Metropolitan Pathology Laboratory, Inc. in 1967 by Paul A. Brown, MD, the clinical laboratory underwent a variety of name changes. In 1969, the company's name changed to MetPath, Inc. with headquarters in Teaneck, New Jersey. By 1982, MetPath was acquired by what was then known as Corning Glass Works and was subsequently renamed Corning Clinical Laboratories.\n\n1996–2000\nOn December 31, 1996, Quest Diagnostics became an independent company as a spin-off from Corning. Kenneth W. Freeman was appointed as CEO during this transition. Over the next year, Quest acquired a clinical laboratory division of Branford, Connecticut–based Diagnostic Medical Laboratory, Inc. (DML). Two years later in 1999, Quest added SmithKline Beecham Clinical Laboratories to their subsidiaries; which includes a joint venture ownership with CompuNet Clinical Laboratory. The purchase of SmithKline Beecham also included the lab's medical sample transport airline (ICAO: LBQ, call sign: LABQUEST) originally founded in 1988.\nIn 1997, Quest and Banner Health formed a joint venture creating the Arizona based Sonora Quest laboratory, a business unit of Laboratory Sciences of Arizona. This entity represents the operations of Quest Diagnostics in the Arizona regional market.\n\n2001–2015\nFrom May 2004 to April 2012, Surya Mohapatra served as the company's President and CEO. In 2007 Quest acquired diagnostic testing equipment company AmeriPath. In response to Mohapatra's resignation after eight years with Quest, former Philips Healthcare CEO Stephen Rusckowski was appointed. Under Rusckowski, Quest Diagnostics teamed up with central New England's largest health care system, UMass Memorial Health Care, to purchase its clinical outreach laboratory.\n\n2016–present\nIn 2016, Quest collaborated with Safeway to bring testing services to twelve of its stores in California, Maryland, Virginia, Texas and Colorado.\nBy the end of 2017, Quest, in partnership with Walmart, incorporated laboratory testing in about 15 of their locations in Texas and Florida.\nIn May 2018, the company announced it will become an in-network laboratory provider to UnitedHealthcare starting in 2019, providing access to 48 million plan members.\nIn September 2018, Quest moved its headquarters from Madison, where it was located since 2007, to Secaucus, New Jersey.\nIn November 2018, Quest launched QuestDirect, a consumer-initiated testing service that allows patients to order health and wellness lab testing from home.\nIn March 2020, the company launched a COVID-19 testing service. As of July 2020, Quest had performed more than 9.2 million COVID-19 molecular tests and 2.8 million serology tests.\nIn April 2024, Quest has added a new blood screening to their AD-Detect product line. This test will analyze the blood for a specific Alzheimer's protein, pTau-217.\nIn Febuaray 2025, Fresenius Medical Care announced via Helen Giza (CEO, Chair of the management board and acting CFO) that  \"under terms of a definitive acquisition agreement, Quest will acquire select assets of FME’s wholly owned Spectra Laboratories, a leading provider of renal-specific laboratory testing services in the U.S.\"\nIn addition, under a separate agreement, \"Quest will provide comprehensive laboratory services related to end-stage kidney disease (ESKD) and specialized water testing for patients and providers served by dialysis centers operated by Fresenius Medical Care and its wholly owned and joint-venture partners in the United States.\"\n\nAcquisitions\nPartnerships\n2005: Forms a strategic alliance with Ciphergen Biosystems to commercialize novel proteomic tests.\n\nControversies\nQuest Diagnostics set a record in April 2009 when it paid $302 million to the government to settle a Medicare fraud case alleging the company sold faulty medical testing kits.  It was the largest qui tam (whistleblower) settlement paid by a medical laboratory for manufacturing and distributing a faulty product. In May 2011, Quest paid $241 million to the state of California to settle a False Claims Act case that alleged the company had overcharged Medi-Cal, the state's Medicaid program, and provided illegal kickbacks as incentives for healthcare providers to use Quest labs.\nIn 2018, Quest Diagnostics was among a number of U.S.–based laboratories linked to inaccuracies of over 200 women's cervical smear tests for CervicalCheck, Ireland's national screening program. Audits of the testing performed by Quest (and another subcontractor, Clinical Pathology Laboratories, Inc. of Austin, Texas) showed a high rate of errors in analysis of samples which led to lawsuits and a government inquiry. Quest and the Irish government continue to settle the resulting lawsuits.\nOn June 3, 2019, Quest announced that American Medical Collection Agency (AMCA), a billing collections service provider, had informed Quest Diagnostics that an unauthorized user had access to AMCA’s system containing personal information AMCA received from various entities, including from Quest. AMCA provides billing collections services to Optum360, which in turn is a Quest contractor. AMCA later went bankrupt after the breach.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Quest Diagnostics Incorporated:",
  "clean_text": "Quest Diagnostics Incorporated is an American clinical laboratory. A Fortune 500 company, Quest operates in the United States, Puerto Rico, Mexico, and Brazil. Quest also maintains collaborative agreements with various hospitals and clinics across the globe. As of 2020, the company had approximately 48,000 employees, and it generated more than $7.7 billion in revenue in 2019. The company offers access to diagnostic testing services for cancer, cardiovascular disease, infectious disease, neurological disorders, COVID-19, and employment and court-ordered drug testing. History 1960–1995 Originally founded as Metropolitan Pathology Laboratory, Inc. in 1967 by Paul A. Brown, MD, the clinical laboratory underwent a variety of name changes. In 1969, the company's name changed to MetPath, Inc. with headquarters in Teaneck, New Jersey. By 1982, MetPath was acquired by what was then known as Corning Glass Works and was subsequently renamed Corning Clinical Laboratories. 1996–2000 On December 31, 1996, Quest Diagnostics became an independent company as a spin-off from Corning. Kenneth W. Freeman was appointed as CEO during this transition. Over the next year, Quest acquired a clinical laboratory division of Branford, Connecticut–based Diagnostic Medical Laboratory, Inc. (DML). Two years later in 1999, Quest added SmithKline Beecham Clinical Laboratories to their subsidiaries; which includes a joint venture ownership with CompuNet Clinical Laboratory. The purchase of SmithKline Beecham also included the lab's medical sample transport airline (ICAO: LBQ, call sign: LABQUEST) originally founded in 1988. In 1997, Quest and Banner Health formed a joint venture creating the Arizona based Sonora Quest laboratory, a business unit of Laboratory Sciences of Arizona. This entity represents the operations of Quest Diagnostics in the Arizona regional market. 2001–2015 From May 2004 to April 2012, Surya Mohapatra served as the company's President and CEO. In 2007 Quest acquired diagnostic testing equipment company AmeriPath. In response to Mohapatra's resignation after eight years with Quest, former Philips Healthcare CEO Stephen Rusckowski was appointed. Under Rusckowski, Quest Diagnostics teamed up with central New England's largest health care system, UMass Memorial Health Care, to purchase its clinical outreach laboratory. 2016–present In 2016, Quest collaborated with Safeway to bring testing services to twelve of its stores in California, Maryland, Virginia, Texas and Colorado. By the end of 2017, Quest, in partnership with Walmart, incorporated laboratory testing in about 15 of their locations in Texas and Florida. In May 2018, the company announced it will become an in-network laboratory provider to UnitedHealthcare starting in 2019, providing access to 48 million plan members. In September 2018, Quest moved its headquarters from Madison, where it was located since 2007, to Secaucus, New Jersey. In November 2018, Quest launched QuestDirect, a consumer-initiated testing service that allows patients to order health and wellness lab testing from home. In March 2020, the company launched a COVID-19 testing service. As of July 2020, Quest had performed more than 9.2 million COVID-19 molecular tests and 2.8 million serology tests. In April 2024, Quest has added a new blood screening to their AD-Detect product line. This test will analyze the blood for a specific Alzheimer's protein, pTau-217. In Febuaray 2025, Fresenius Medical Care announced via Helen Giza (CEO, Chair of the management board and acting CFO) that \"under terms of a definitive acquisition agreement, Quest will acquire select assets of FME’s wholly owned Spectra Laboratories, a leading provider of renal-specific laboratory testing services in the U.S.\" In addition, under a separate agreement, \"Quest will provide comprehensive laboratory services related to end-stage kidney disease (ESKD) and specialized water testing for patients and providers served by dialysis centers operated by Fresenius Medical Care and its wholly owned and joint-venture partners in the United States.\" Acquisitions Partnerships 2005: Forms a strategic alliance with Ciphergen Biosystems to commercialize novel proteomic tests. Controversies Quest Diagnostics set a record in April 2009 when it paid $302 million to the government to settle a Medicare fraud case alleging the company sold faulty medical testing kits. It was the largest qui tam (whistleblower) settlement paid by a medical laboratory for manufacturing and distributing a faulty product. In May 2011, Quest paid $241 million to the state of California to settle a False Claims Act case that alleged the company had overcharged Medi-Cal, the state's Medicaid program, and provided illegal kickbacks as incentives for healthcare providers to use Quest labs. In 2018, Quest Diagnostics was among a number of U.S.–based laboratories linked to inaccuracies of over 200 women's cervical smear tests for CervicalCheck, Ireland's national screening program. Audits of the testing performed by Quest (and another subcontractor, Clinical Pathology Laboratories, Inc. of Austin, Texas) showed a high rate of errors in analysis of samples which led to lawsuits and a government inquiry. Quest and the Irish government continue to settle the resulting lawsuits. On June 3, 2019, Quest announced that American Medical Collection Agency (AMCA), a billing collections service provider, had informed Quest Diagnostics that an unauthorized user had access to AMCA’s system containing personal information AMCA received from various entities, including from Quest. AMCA provides billing collections services to Optum360, which in turn is a Quest contractor. AMCA later went bankrupt after the breach."
}