{
  "ticker": "DHI",
  "cik": "0000882184",
  "company_name": "D. R. Horton",
  "corrected_name": "D. R. Horton",
  "wiki_title_used": "D. R. Horton",
  "exists": true,
  "raw_text": "D.R. Horton, Inc. is an American home construction company based in Arlington, Texas. Since 2002, the company has been the largest homebuilder by volume in the United States. The company ranked number 120 on the 2024 Fortune 500 list of the largest United States corporations by revenue. The company operates in 125 markets across 36 states.\nD.R. Horton operates four brands: D.R. Horton, Emerald Homes, Express Homes, and Freedom Homes. Express Homes is tailored to entry-level buyers while the Emerald Homes brand is sold as luxury real estate. Freedom Homes caters to the active adult community.\n\nHistory\nThe company was founded in 1978 by Donald R. Horton. Horton took the company public in 1992, and as of 2020 owned about 6% of the company. In 1997, the company acquired Continental Homes for $305 million and the assumption of $278 million in debt. The company also entered the Tucson, Arizona, market. In 1998, the company promoted Donald J. Tomnitz to vice chairman and chief executive and promoted Richard Beckwitt to president. The company also acquired Cambridge Homes.\nThe company completed more acquisitions throughout the years. In 1999, the company acquired Century Title Agency. In 2001, the company acquired Emerald Builders and Fortress Homes and Communities of Florida. In 2002, the company acquired Schuler Homes. The company also acquired 300 acres in McKinney, Texas.\nIn 2013, the company re-entered the Nashville market.\nIn April 2015, the company acquired Pacific Ridge Homes, based in Seattle, for $72 million. The acquisition included 350 lots, 90 homes in inventory and 40 homes in sales order backlog. Horton also acquired control of about 400 lots through option contracts.\nIn May 2015, the company received approval from the Honolulu City Council to begin construction on an 11,750-home planned community in West Oahu, Hawaii.\nIn 2016, the company acquired Wilson Parker Homes for $90 million. In 2017, the company moved its headquarters from Fort Worth, Texas, to Arlington, Texas. In 2018, the company acquired Terramor Homes, Classic Builders, and Westport Homes.\nOn May 17, 2024, the company announced the passing of its founder and chairman, Donald R. Horton, who suddenly died at the age of 74. Company representatives believe the cause of death was a heart attack. Following Horton's death, the board appointed the company's Executive Vice Chairman, David V. Auld, as the new executive chairman.\n\nControversies\nThe Supreme Court of the United States heard the appeal of a case in which the National Labor Relations Board held that the company violated the National Labor Relations Act (NLRA) by requiring its employees to sign an arbitration agreement that prohibited them from pursuing claims in a collective or class action. In 2018 the Supreme Court ruled in favor of D.R. Horton, stating that the company's actions did not violate the NLRA or the Federal Arbitration Act.\n\nAwards and recognition\n1st, Builder Top 100  - 2003-2023\n\nReferences\nExternal links\nOfficial website\nBusiness data for D.R. Horton, Inc.:",
  "clean_text": "D.R. Horton, Inc. is an American home construction company based in Arlington, Texas. Since 2002, the company has been the largest homebuilder by volume in the United States. The company ranked number 120 on the 2024 Fortune 500 list of the largest United States corporations by revenue. The company operates in 125 markets across 36 states. D.R. Horton operates four brands: D.R. Horton, Emerald Homes, Express Homes, and Freedom Homes. Express Homes is tailored to entry-level buyers while the Emerald Homes brand is sold as luxury real estate. Freedom Homes caters to the active adult community. History The company was founded in 1978 by Donald R. Horton. Horton took the company public in 1992, and as of 2020 owned about 6% of the company. In 1997, the company acquired Continental Homes for $305 million and the assumption of $278 million in debt. The company also entered the Tucson, Arizona, market. In 1998, the company promoted Donald J. Tomnitz to vice chairman and chief executive and promoted Richard Beckwitt to president. The company also acquired Cambridge Homes. The company completed more acquisitions throughout the years. In 1999, the company acquired Century Title Agency. In 2001, the company acquired Emerald Builders and Fortress Homes and Communities of Florida. In 2002, the company acquired Schuler Homes. The company also acquired 300 acres in McKinney, Texas. In 2013, the company re-entered the Nashville market. In April 2015, the company acquired Pacific Ridge Homes, based in Seattle, for $72 million. The acquisition included 350 lots, 90 homes in inventory and 40 homes in sales order backlog. Horton also acquired control of about 400 lots through option contracts. In May 2015, the company received approval from the Honolulu City Council to begin construction on an 11,750-home planned community in West Oahu, Hawaii. In 2016, the company acquired Wilson Parker Homes for $90 million. In 2017, the company moved its headquarters from Fort Worth, Texas, to Arlington, Texas. In 2018, the company acquired Terramor Homes, Classic Builders, and Westport Homes. On May 17, 2024, the company announced the passing of its founder and chairman, Donald R. Horton, who suddenly died at the age of 74. Company representatives believe the cause of death was a heart attack. Following Horton's death, the board appointed the company's Executive Vice Chairman, David V. Auld, as the new executive chairman. Controversies The Supreme Court of the United States heard the appeal of a case in which the National Labor Relations Board held that the company violated the National Labor Relations Act (NLRA) by requiring its employees to sign an arbitration agreement that prohibited them from pursuing claims in a collective or class action. In 2018 the Supreme Court ruled in favor of D.R. Horton, stating that the company's actions did not violate the NLRA or the Federal Arbitration Act. Awards and recognition 1st, Builder Top 100 - 2003-2023"
}