{
  "ticker": "DLR",
  "cik": "0001297996",
  "company_name": "Digital Realty",
  "corrected_name": "Digital Realty",
  "wiki_title_used": "Digital Realty",
  "exists": true,
  "raw_text": "Digital Realty is a real estate investment trust that owns, operates and invests in carrier-neutral data centers across the world. The company offers data center, colocation, and interconnection services. \nAs of June 2023, Digital Realty has more than 300 facilities in more than 25 countries.\nThe company has made promises and efforts to reduce its carbon emissions. In 2020, Digital Realty joined the Science-Based Target Initiative, promising to reduce its Scope 1 and 2 emissions by 68% and Scope 3 emissions by 24% between 2018 and 2030. The company is also a signatory of the Climate Neutral Data Center Pact, a self-regulatory initiative – drawn up with the European Data Center Association (EUDCA) and Cloud Infrastructure Services Provider in Europe (CISPE) – designed to make the industry climate-neutral by 2030. In July 2023, Digital Realty received a Certificate of Conformity, certifying its adherence to the Self-Regulatory Initiatives set out by the Pact in Europe.\nDigital Realty is working to switch entirely to renewable power. Many of its U.S. and European data centers are powered by renewable energy. The company has 1 GW of wind and solar projects under contract in Texas, Illinois, North Carolina, Oregon, Arizona and Virginia and has installed 1.8 MW of solar panels in Kenya, Greece, Switzerland, and South Korea. The company says it avoided emitting 1.8 million metric tons of CO2-equivalent emissions (MtCO2e) in 2022.\n\nHistory\nThe company was formed in 2004 by GI Partners, which contributed 21 data centers that it acquired through bankruptcy auctions and from distressed companies at a 20–40% discount to replacement cost.\nOn November 4, 2004, the company became a public company via an initial public offering. At that time, the company owned 23 properties comprising 5.6 million square feet.\nIn August 2006, the company acquired a property in Phoenix, Arizona, for $175 million.\nBy March 2007, GI Partners had sold all of its shares in the company.\nIn January 2010, the company acquired three data centers in Massachusetts and Connecticut for $375 million.\nIn January 2012, the company acquired a 334,000-square-foot data center near Hartsfield-Jackson Atlanta International Airport for $63 million in a leaseback transaction. The company also acquired a data center in San Francisco for $85 million.\nIn April 2013, the company acquired the data center of Delta Air Lines in Eagan, Minnesota, for $37 million in a leaseback transaction.\nIn July 2013, the company doubled capacity at its data center in Chandler, Arizona.\nIn May 2015, the company sold a building in Philadelphia for $161 million that it acquired in 2005 for $59 million.\nIn October 2015, the company acquired Telx for $1.886 billion.\nIn November 2015, the company acquired 125.9 acres of undeveloped land in Loudoun County, Virginia, for $43 million and announced plans to build a 2 million-square-foot data center on the property.\nIn July 2016, the company acquired 8 data centers in Europe from Equinix for $874 million.\nIn March 2017, the company announced a $22 million expansion of its data center in Atlanta.\nIn September 2017, the company completed the acquisition of DuPont Fabros Technology.\nIn 2018, the Supreme Court ruled in favor of the company in Digital Realty Trust, Inc. v. Somers, a case in which Digital Realty fired an employee who had complained internally about the elimination of supervisory controls and the hiding of cost overruns. After he was fired, the employee sued the company, saying he was protected by whistleblower provisions in Dodd-Frank. The Supreme Court, citing Dodd-Frank, ruled that these protections only applied to whistleblowers who had first notified the SEC.\nIn December 2018, the company acquired Ascenty for $1.8 billion. At the time, Ascenty operated eight data centers in Brazil.\nIn October 2019, Digital Realty announced the acquisition of European data center provider Interxion for $8.4 billion to “create a leading global provider of data centre, colocation and interconnection solutions”.\nIn January 2021, Digital Realty said it would move its headquarters to Austin, Texas.\nIn January 2022, the company announced a 55% stake acquisition in Teraco Data Centres\nOn 10 September 2024, about 7:45 am, a Digital Realty data centre in Loyang, Singapore, caught fire. According to the Singapore Civil Defence Force, the fire \"involved lithium-ion batteries housed in battery rooms on the third floor of a four-storey building\". Digital Realty said its employees were evacuated from the data centre without injuries. The fire affected Lazada and Bytedance's systems, as well as Alibaba Cloud's Availability zone C in Singapore, and possibly DigitalOcean, Coolify, and Cloudflare.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Digital Realty Trust, Inc.:",
  "clean_text": "Digital Realty is a real estate investment trust that owns, operates and invests in carrier-neutral data centers across the world. The company offers data center, colocation, and interconnection services. As of June 2023, Digital Realty has more than 300 facilities in more than 25 countries. The company has made promises and efforts to reduce its carbon emissions. In 2020, Digital Realty joined the Science-Based Target Initiative, promising to reduce its Scope 1 and 2 emissions by 68% and Scope 3 emissions by 24% between 2018 and 2030. The company is also a signatory of the Climate Neutral Data Center Pact, a self-regulatory initiative – drawn up with the European Data Center Association (EUDCA) and Cloud Infrastructure Services Provider in Europe (CISPE) – designed to make the industry climate-neutral by 2030. In July 2023, Digital Realty received a Certificate of Conformity, certifying its adherence to the Self-Regulatory Initiatives set out by the Pact in Europe. Digital Realty is working to switch entirely to renewable power. Many of its U.S. and European data centers are powered by renewable energy. The company has 1 GW of wind and solar projects under contract in Texas, Illinois, North Carolina, Oregon, Arizona and Virginia and has installed 1.8 MW of solar panels in Kenya, Greece, Switzerland, and South Korea. The company says it avoided emitting 1.8 million metric tons of CO2-equivalent emissions (MtCO2e) in 2022. History The company was formed in 2004 by GI Partners, which contributed 21 data centers that it acquired through bankruptcy auctions and from distressed companies at a 20–40% discount to replacement cost. On November 4, 2004, the company became a public company via an initial public offering. At that time, the company owned 23 properties comprising 5.6 million square feet. In August 2006, the company acquired a property in Phoenix, Arizona, for $175 million. By March 2007, GI Partners had sold all of its shares in the company. In January 2010, the company acquired three data centers in Massachusetts and Connecticut for $375 million. In January 2012, the company acquired a 334,000-square-foot data center near Hartsfield-Jackson Atlanta International Airport for $63 million in a leaseback transaction. The company also acquired a data center in San Francisco for $85 million. In April 2013, the company acquired the data center of Delta Air Lines in Eagan, Minnesota, for $37 million in a leaseback transaction. In July 2013, the company doubled capacity at its data center in Chandler, Arizona. In May 2015, the company sold a building in Philadelphia for $161 million that it acquired in 2005 for $59 million. In October 2015, the company acquired Telx for $1.886 billion. In November 2015, the company acquired 125.9 acres of undeveloped land in Loudoun County, Virginia, for $43 million and announced plans to build a 2 million-square-foot data center on the property. In July 2016, the company acquired 8 data centers in Europe from Equinix for $874 million. In March 2017, the company announced a $22 million expansion of its data center in Atlanta. In September 2017, the company completed the acquisition of DuPont Fabros Technology. In 2018, the Supreme Court ruled in favor of the company in Digital Realty Trust, Inc. v. Somers, a case in which Digital Realty fired an employee who had complained internally about the elimination of supervisory controls and the hiding of cost overruns. After he was fired, the employee sued the company, saying he was protected by whistleblower provisions in Dodd-Frank. The Supreme Court, citing Dodd-Frank, ruled that these protections only applied to whistleblowers who had first notified the SEC. In December 2018, the company acquired Ascenty for $1.8 billion. At the time, Ascenty operated eight data centers in Brazil. In October 2019, Digital Realty announced the acquisition of European data center provider Interxion for $8.4 billion to “create a leading global provider of data centre, colocation and interconnection solutions”. In January 2021, Digital Realty said it would move its headquarters to Austin, Texas. In January 2022, the company announced a 55% stake acquisition in Teraco Data Centres On 10 September 2024, about 7:45 am, a Digital Realty data centre in Loyang, Singapore, caught fire. According to the Singapore Civil Defence Force, the fire \"involved lithium-ion batteries housed in battery rooms on the third floor of a four-storey building\". Digital Realty said its employees were evacuated from the data centre without injuries. The fire affected Lazada and Bytedance's systems, as well as Alibaba Cloud's Availability zone C in Singapore, and possibly DigitalOcean, Coolify, and Cloudflare."
}