{
  "ticker": "DLTR",
  "cik": "0000935703",
  "company_name": "Dollar Tree",
  "corrected_name": "Dollar Tree",
  "wiki_title_used": "Dollar Tree",
  "exists": true,
  "raw_text": "Dollar Tree, Inc., formerly known as Dollar Tree Stores, Inc., is an American multi-price-point chain of discount variety stores. Headquartered in Chesapeake, Virginia, it is a Fortune 500 (sometimes referred to as Fortune 200) company and operates 15,115 stores throughout the 48 contiguous U.S. states and Canada. Its stores are supported by a nationwide logistics network of 24 distribution centers.\nDollar Tree competes in the dollar store and low-end retail markets. Each Dollar Tree stocks a variety of products, including national, regional, and private-label brands. Departments found in a Dollar Tree store include health and beauty, food and snacks, party, seasonal décor, housewares, glassware, dinnerware, household cleaning supplies, candy, toys, gifts, gift bags, and wrap, stationery, craft supplies, teaching supplies, automotive, electronics, pet supplies, and books. Most Dollar Tree stores also sell frozen foods and dairy items such as milk, eggs, pizza, ice cream, frozen dinners, and pre-made baked goods. In August 2012, the company began accepting manufacturer coupons at all of its store locations.\nDollar Tree, and dollar stores in general, have been alleged to create food deserts: areas with poor access to healthy and affordable food. Dollar Tree disputes this claim, stating that it creates food options in areas that would otherwise be deserts.\n\nHistory\nEarly years\nIn 1953, K. R. Perry opened a Ben Franklin variety store in Norfolk, Virginia, which later became known as K&K 5&10.\nIn 1970, K. R. Perry, Doug Perry, and Macon Brock started K&K Toys in Norfolk, Virginia. This mall concept grew to over 130 stores on the East Coast.\nIn 1986, Doug Perry, Macon Brock, and Ray Compton started another chain store called Only $1.00 with five stores, one in Georgia, one in Tennessee, and three in Virginia. The expansion of dollar stores was continued alongside K&K Toys stores, mostly in enclosed malls.\nOn April 27, 1989, the first \"Dollar Tree\"-branded store opened at the Jessamine Mall in Sumter, South Carolina. In a May 1989 advertisement in the Sun-News, the fledgling chain, apparently already planning 100 stores for the eastern United States, bills the dollar-pricing model as the \"hottest new shopping concept in America.\"\n\n1990s\nIn 1991, the corporation made a decision to focus exclusively on the expansion of dollar stores after selling K&K stores to KB Toys, owned by Melville Corporation.\nIn 1993, the name Only $1.00 was changed to Dollar Tree Stores to address what could be a multi-price-point strategy in the future, and part equity interest was sold to SKM partners, a private equity firm.\nThe Perrys and Brock got the idea for the company from another retailer known as Everything's A Dollar, which went bankrupt in the 1990s.\nIn 1996, Dollar Tree acquired Dollar Bill$, Inc., a Chicago-based chain of 136 stores.\nIn 1997, the company opened its first distribution center and its new store support center, both located in Chesapeake, Virginia.\nIn 1999, Dollar Tree acquired Only $One stores based in New York. That same year, the company opened its second distribution center in Olive Branch, Mississippi.\n\n2000s\nIn 2000, Dollar Tree acquired Dollar Express, a Philadelphia-based company, and also built a new distribution center in Stockton, California. In 2001, the company opened two additional distribution centers in Savannah, Georgia and Briar Creek, Pennsylvania. In 2003, Dollar Tree acquired Salt Lake City, Utah-based Greenbacks, Inc., and opened a new distribution center in Marietta, Oklahoma.\nIn 2004, Dollar Tree opened its first store in North Dakota which marked its operation of stores in all 48 contiguous states. The company also opened new distribution centers in Joliet, Illinois and Ridgefield, Washington.\nIn 2006, Dollar Tree celebrated its 20th year of retailing at a $1.00 price point, opened its 3,000th store, and acquired 138 DEAL$ stores, previously owned by SUPERVALU INC.\nIn 2007, Dollar Tree expanded its Briar Creek Distribution Center and crossed the $4 billion sales threshold. In 2008, Dollar Tree earned a place in the Fortune 500. By the close of 2009, the company opened a store in Washington, D.C., and purchased a new distribution center in San Bernardino, California. A new concept, a Halloween chain pilot named \"Totally Halloween\" was attempted during 2007's fall as a pivot towards season items ranging from 99 cents to around $169. It closed after Halloween 2007 and has not opened again since. A year before a general seaonal store called Occasions was piloted.\nIn 2009, Dollar Tree redesigned its website with a new e-commerce platform. DollarTree.com sells Dollar Tree merchandise in larger quantities to individuals, small businesses, and organizations. The company also advertises in-store events, specials, seasonal promotions, and featured products through the site, and users can locate a retail store, research information about Dollar Tree, and view product recalls. Dollar Tree also added customer ratings and reviews, and customer stories to the site.\n\n2010s\nIn March 2010, Dollar Tree piloted a single full-service grocery concept called Dollar Tree Market in Chesapeake, Virginia, but the store closed a few years later and the format was never expanded. At 23,000 sq ft, it had combined both a supermarket with a Dollar Tree, including meat, a full produce section, and an in-store bakery with custom cakes. The sole location was then purchased by Aldi.\nIn 2010, the corporation opened its 4,000th chain store and acquired 86 Canadian Dollar Giant stores which are based in Vancouver, British Columbia. The stores are operated in British Columbia, Alberta, Saskatchewan and Ontario. These are the first retail locations outside of the United States operated by Dollar Tree.\nIn 2011, Dollar Tree achieved total sales of $6.63 billion, opened 278 new stores, and completed a 400,000 square feet (37,000 m2) expansion of its distribution center in Savannah, Georgia.\nIn 2012, Dollar Tree opened another 345 new stores and exceeded $7 billion in sales.\n\nOn July 28, 2014, Dollar Tree announced that it was offering $9.2 billion for the purchase of competitor chain store Family Dollar. On August 18, 2014, Dollar General lodged a competing bid of $9.7 billion for Family Dollar. The bid was rejected on August 20, 2014, by the Family Dollar board, which said it would proceed with the deal with Dollar Tree.In January 2015, Dollar Tree announced plans to divest 300 stores in order to appease US regulators scrutinizing its proposed takeover of Family Dollar stores.\nIn June 2015, the firm agreed to sell 330 stores to private equity company Sycamore Partners as part of the approval process for its $8.5 billion takeover of Family Dollar.\nThe company was ranked 134 on the 2018 Fortune 500 list of the United States corporations by revenue.\nIn March 2019, as part of its reposition plan, Dollar Tree announced that it will close up to 390 Family Dollar stores along with renovating 1,000 other locations.\nDollar Tree Plus (branded \"Dollar Tree Plus!\", internally known as a \"2.0\") is a variant of dollar tree including multi-dollar products, begun as a 100-store pilot in May 2019 that layered $3 and $5 items such as seasonal décor, toys, housewares, craft supplies, among others, into dedicated front-of-store bays along with the core $1 assortment. More locations were converted 2023 and onwards.\n\n2020s\nOn March 3, 2021, it was announced that Dollar Tree had quietly introduced a combination Family Dollar/Dollar Tree store concept, with the first one opening in early 2021. Dollar Tree has opened and operated nearly 50 locations by the end of 2020, primarily in small towns with populations of just a few thousand people.\nOn September 28, 2021, CEO Michael Witynski, citing increased shipping and labor costs squeezing profit margins, announced that some prices will be rising above $1, possibly to as much as $1.50.\n\nOn November 23, 2021, it was announced that Dollar Tree plans to raise its prices from a dollar for typical items to $1.25 in response to inflation and pressure from investors to raise prices. Some of the items sold at Dollar Tree will not have their prices increased. The retailer will introduce the new price point in more than 2,000 stores by December 2021 and complete the roll-out across most of its 8,000 stores by the first quarter of 2022.\nOn March 13, 2024, Dollar Tree reported a loss of $1.71 billion for latest quarter and announced the closure of near 1,000 stores. On April 28, 2024, a tornado destroyed Dollar Tree's distribution center in Marietta, Oklahoma. Dollar Tree announced on May 28, 2024, that the distribution center would close, laying off almost all of its staff. On August 16, 2024, the dilapidated warehouse caught on fire.\nIn 2024, a new format: the More Choices(internally known as a \"3.0\") was established, integrating the price points over 1.75 dollars, up to $7 into the shelves, aggressively expanding the format across 2024 and 2025. The Dollar Tree Plus! branding is also being winded down because of this.\nIn May 2024, Dollar Tree acquired the lease of 170 99 Cents Only Stores locations across all states it operated in, along with all intellectual property of The 99 Store/99 Cents Only, and select onsite equipment, furniture, and fixtures.\nIn December 2024, Dollar Tree announced that its Board of Directors appointed Interim CEO Michael C. Creedon Jr. as permanent chief executive officer. Creedon had joined Dollar Tree in 2022 as Chief Operating Officer and in November 2024 he was appointed Interim Chief Executive Officer, succeeding Rick Dreiling. Creedon has responsibility for leading more than 200,000 associates and more than 16,000 stores across the Dollar Tree and Family Dollar banners.\nIn March 2025, the company announced the sale of the Family Dollar chain for $1 billion to Brigade Capital and Macellum Capital. The sale was completed on July 7, 2025.\n\nBusiness strategy\nDollar Tree is classified as an extreme discount store. It claims to be able to achieve this because their buyers \"work extremely hard to find the best bargains out there\", and it has \"great control over the tremendous buying power at the dollar price-point.\" Its prices are primarily designed to attract financially disadvantaged customers, but it has also become popular within immigrant communities.\n\nFamily Dollar bidding\nOn July 28, 2014, Dollar Tree announced that a deal had been reached and approved by both parties to purchase Family Dollar for $8.5 billion plus acquisition of the $1 billion in debt currently held by Family Dollar. The deal came in the month following activist investor and major shareholder Carl Icahn's demand that Family Dollar be promptly put up for sale. After their reported deal had been struck, Dollar General entered the bidding, surpassing Dollar Tree's offer, with a $9.7 billion bid on August 18, 2014. On August 20, 2014, Family Dollar rejected the Dollar General bid, saying it was not a matter of price, but concerns over antitrust issues that had convinced the company and its advisers that the deal could not be concluded on the terms proposed. The Family Dollar board had been analyzing potential antitrust issues that could arise from doing a deal with Dollar General, since the start of the year a statement from CEO Howard Levine outlined.\n\nAllegations of creating food deserts\nDollar Tree, and dollar stores in general, have been alleged by a number of studies, individuals, and organizations to proliferate food deserts: areas with limited access to healthy and affordable food. Dollar Tree has disputed this claim; it claimed that in a number of cases it created food options in food deserts. Dollar stores are alleged to outcompete local grocery stores, and end up being one of the few options available for purchasing food in some communities. In 2023, Dollar Tree reportedly stopped selling eggs when the price of eggs increased. In line with these allegations, a number of states have passed restrictions on where new dollar stores can be opened.\n\nCanada\nOn October 11, 2010, Dollar Tree announced its acquisition of Dollar Giant, incorporated in 2001 in Vancouver, Canada, for $52 million. At the time of the acquisition, Dollar Giant had about 85 retail outlets in British Columbia, Alberta, Saskatchewan and Ontario. Approximately 30 of its retail locations are in British Columbia, making it the second largest dollar store chain in that province. It was Canada's fourth largest operator of dollar stores. Dollar Tree has since rebranded all of its Dollar Giant stores to Dollar Tree; these were the first retail locations outside of the United States operated by Dollar Tree.\nAs of 2020, the company operates 227 stores across Canada, concentrated in Western Canada and Ontario. All Dollar Tree stores in Canada sell items for C$1.50 or mentioned otherwise which is usually less than C$2.\nDollar Tree Canada's merchandising team is located in Mississauga, Ontario, while its corporate office remains in Burnaby in Greater Vancouver.\n\nRecalls\nThe U.S. Consumer Product Safety Commission has listed several recalls for products sold at Dollar Tree stores. The recalled products include salsa jars with broken glass inside them, hot-melt mini glue guns (recalled in January 2008) which could short circuit and cause burns, and candle sets (recalled in February 2004) that could produce excessive flame.\n\nSee also\n100-yen shop\nDollar General\nFamily Dollar\nGeneral store\nTypes of retail outlets\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Dollar Tree, Inc.:",
  "clean_text": "Dollar Tree, Inc., formerly known as Dollar Tree Stores, Inc., is an American multi-price-point chain of discount variety stores. Headquartered in Chesapeake, Virginia, it is a Fortune 500 (sometimes referred to as Fortune 200) company and operates 15,115 stores throughout the 48 contiguous U.S. states and Canada. Its stores are supported by a nationwide logistics network of 24 distribution centers. Dollar Tree competes in the dollar store and low-end retail markets. Each Dollar Tree stocks a variety of products, including national, regional, and private-label brands. Departments found in a Dollar Tree store include health and beauty, food and snacks, party, seasonal décor, housewares, glassware, dinnerware, household cleaning supplies, candy, toys, gifts, gift bags, and wrap, stationery, craft supplies, teaching supplies, automotive, electronics, pet supplies, and books. Most Dollar Tree stores also sell frozen foods and dairy items such as milk, eggs, pizza, ice cream, frozen dinners, and pre-made baked goods. In August 2012, the company began accepting manufacturer coupons at all of its store locations. Dollar Tree, and dollar stores in general, have been alleged to create food deserts: areas with poor access to healthy and affordable food. Dollar Tree disputes this claim, stating that it creates food options in areas that would otherwise be deserts. History Early years In 1953, K. R. Perry opened a Ben Franklin variety store in Norfolk, Virginia, which later became known as K&K 5&10. In 1970, K. R. Perry, Doug Perry, and Macon Brock started K&K Toys in Norfolk, Virginia. This mall concept grew to over 130 stores on the East Coast. In 1986, Doug Perry, Macon Brock, and Ray Compton started another chain store called Only $1.00 with five stores, one in Georgia, one in Tennessee, and three in Virginia. The expansion of dollar stores was continued alongside K&K Toys stores, mostly in enclosed malls. On April 27, 1989, the first \"Dollar Tree\"-branded store opened at the Jessamine Mall in Sumter, South Carolina. In a May 1989 advertisement in the Sun-News, the fledgling chain, apparently already planning 100 stores for the eastern United States, bills the dollar-pricing model as the \"hottest new shopping concept in America.\" 1990s In 1991, the corporation made a decision to focus exclusively on the expansion of dollar stores after selling K&K stores to KB Toys, owned by Melville Corporation. In 1993, the name Only $1.00 was changed to Dollar Tree Stores to address what could be a multi-price-point strategy in the future, and part equity interest was sold to SKM partners, a private equity firm. The Perrys and Brock got the idea for the company from another retailer known as Everything's A Dollar, which went bankrupt in the 1990s. In 1996, Dollar Tree acquired Dollar Bill$, Inc., a Chicago-based chain of 136 stores. In 1997, the company opened its first distribution center and its new store support center, both located in Chesapeake, Virginia. In 1999, Dollar Tree acquired Only $One stores based in New York. That same year, the company opened its second distribution center in Olive Branch, Mississippi. 2000s In 2000, Dollar Tree acquired Dollar Express, a Philadelphia-based company, and also built a new distribution center in Stockton, California. In 2001, the company opened two additional distribution centers in Savannah, Georgia and Briar Creek, Pennsylvania. In 2003, Dollar Tree acquired Salt Lake City, Utah-based Greenbacks, Inc., and opened a new distribution center in Marietta, Oklahoma. In 2004, Dollar Tree opened its first store in North Dakota which marked its operation of stores in all 48 contiguous states. The company also opened new distribution centers in Joliet, Illinois and Ridgefield, Washington. In 2006, Dollar Tree celebrated its 20th year of retailing at a $1.00 price point, opened its 3,000th store, and acquired 138 DEAL$ stores, previously owned by SUPERVALU INC. In 2007, Dollar Tree expanded its Briar Creek Distribution Center and crossed the $4 billion sales threshold. In 2008, Dollar Tree earned a place in the Fortune 500. By the close of 2009, the company opened a store in Washington, D.C., and purchased a new distribution center in San Bernardino, California. A new concept, a Halloween chain pilot named \"Totally Halloween\" was attempted during 2007's fall as a pivot towards season items ranging from 99 cents to around $169. It closed after Halloween 2007 and has not opened again since. A year before a general seaonal store called Occasions was piloted. In 2009, Dollar Tree redesigned its website with a new e-commerce platform. DollarTree.com sells Dollar Tree merchandise in larger quantities to individuals, small businesses, and organizations. The company also advertises in-store events, specials, seasonal promotions, and featured products through the site, and users can locate a retail store, research information about Dollar Tree, and view product recalls. Dollar Tree also added customer ratings and reviews, and customer stories to the site. 2010s In March 2010, Dollar Tree piloted a single full-service grocery concept called Dollar Tree Market in Chesapeake, Virginia, but the store closed a few years later and the format was never expanded. At 23,000 sq ft, it had combined both a supermarket with a Dollar Tree, including meat, a full produce section, and an in-store bakery with custom cakes. The sole location was then purchased by Aldi. In 2010, the corporation opened its 4,000th chain store and acquired 86 Canadian Dollar Giant stores which are based in Vancouver, British Columbia. The stores are operated in British Columbia, Alberta, Saskatchewan and Ontario. These are the first retail locations outside of the United States operated by Dollar Tree. In 2011, Dollar Tree achieved total sales of $6.63 billion, opened 278 new stores, and completed a 400,000 square feet (37,000 m2) expansion of its distribution center in Savannah, Georgia. In 2012, Dollar Tree opened another 345 new stores and exceeded $7 billion in sales. On July 28, 2014, Dollar Tree announced that it was offering $9.2 billion for the purchase of competitor chain store Family Dollar. On August 18, 2014, Dollar General lodged a competing bid of $9.7 billion for Family Dollar. The bid was rejected on August 20, 2014, by the Family Dollar board, which said it would proceed with the deal with Dollar Tree.In January 2015, Dollar Tree announced plans to divest 300 stores in order to appease US regulators scrutinizing its proposed takeover of Family Dollar stores. In June 2015, the firm agreed to sell 330 stores to private equity company Sycamore Partners as part of the approval process for its $8.5 billion takeover of Family Dollar. The company was ranked 134 on the 2018 Fortune 500 list of the United States corporations by revenue. In March 2019, as part of its reposition plan, Dollar Tree announced that it will close up to 390 Family Dollar stores along with renovating 1,000 other locations. Dollar Tree Plus (branded \"Dollar Tree Plus!\", internally known as a \"2.0\") is a variant of dollar tree including multi-dollar products, begun as a 100-store pilot in May 2019 that layered $3 and $5 items such as seasonal décor, toys, housewares, craft supplies, among others, into dedicated front-of-store bays along with the core $1 assortment. More locations were converted 2023 and onwards. 2020s On March 3, 2021, it was announced that Dollar Tree had quietly introduced a combination Family Dollar/Dollar Tree store concept, with the first one opening in early 2021. Dollar Tree has opened and operated nearly 50 locations by the end of 2020, primarily in small towns with populations of just a few thousand people. On September 28, 2021, CEO Michael Witynski, citing increased shipping and labor costs squeezing profit margins, announced that some prices will be rising above $1, possibly to as much as $1.50. On November 23, 2021, it was announced that Dollar Tree plans to raise its prices from a dollar for typical items to $1.25 in response to inflation and pressure from investors to raise prices. Some of the items sold at Dollar Tree will not have their prices increased. The retailer will introduce the new price point in more than 2,000 stores by December 2021 and complete the roll-out across most of its 8,000 stores by the first quarter of 2022. On March 13, 2024, Dollar Tree reported a loss of $1.71 billion for latest quarter and announced the closure of near 1,000 stores. On April 28, 2024, a tornado destroyed Dollar Tree's distribution center in Marietta, Oklahoma. Dollar Tree announced on May 28, 2024, that the distribution center would close, laying off almost all of its staff. On August 16, 2024, the dilapidated warehouse caught on fire. In 2024, a new format: the More Choices(internally known as a \"3.0\") was established, integrating the price points over 1.75 dollars, up to $7 into the shelves, aggressively expanding the format across 2024 and 2025. The Dollar Tree Plus! branding is also being winded down because of this. In May 2024, Dollar Tree acquired the lease of 170 99 Cents Only Stores locations across all states it operated in, along with all intellectual property of The 99 Store/99 Cents Only, and select onsite equipment, furniture, and fixtures. In December 2024, Dollar Tree announced that its Board of Directors appointed Interim CEO Michael C. Creedon Jr. as permanent chief executive officer. Creedon had joined Dollar Tree in 2022 as Chief Operating Officer and in November 2024 he was appointed Interim Chief Executive Officer, succeeding Rick Dreiling. Creedon has responsibility for leading more than 200,000 associates and more than 16,000 stores across the Dollar Tree and Family Dollar banners. In March 2025, the company announced the sale of the Family Dollar chain for $1 billion to Brigade Capital and Macellum Capital. The sale was completed on July 7, 2025. Business strategy Dollar Tree is classified as an extreme discount store. It claims to be able to achieve this because their buyers \"work extremely hard to find the best bargains out there\", and it has \"great control over the tremendous buying power at the dollar price-point.\" Its prices are primarily designed to attract financially disadvantaged customers, but it has also become popular within immigrant communities. Family Dollar bidding On July 28, 2014, Dollar Tree announced that a deal had been reached and approved by both parties to purchase Family Dollar for $8.5 billion plus acquisition of the $1 billion in debt currently held by Family Dollar. The deal came in the month following activist investor and major shareholder Carl Icahn's demand that Family Dollar be promptly put up for sale. After their reported deal had been struck, Dollar General entered the bidding, surpassing Dollar Tree's offer, with a $9.7 billion bid on August 18, 2014. On August 20, 2014, Family Dollar rejected the Dollar General bid, saying it was not a matter of price, but concerns over antitrust issues that had convinced the company and its advisers that the deal could not be concluded on the terms proposed. The Family Dollar board had been analyzing potential antitrust issues that could arise from doing a deal with Dollar General, since the start of the year a statement from CEO Howard Levine outlined. Allegations of creating food deserts Dollar Tree, and dollar stores in general, have been alleged by a number of studies, individuals, and organizations to proliferate food deserts: areas with limited access to healthy and affordable food. Dollar Tree has disputed this claim; it claimed that in a number of cases it created food options in food deserts. Dollar stores are alleged to outcompete local grocery stores, and end up being one of the few options available for purchasing food in some communities. In 2023, Dollar Tree reportedly stopped selling eggs when the price of eggs increased. In line with these allegations, a number of states have passed restrictions on where new dollar stores can be opened. Canada On October 11, 2010, Dollar Tree announced its acquisition of Dollar Giant, incorporated in 2001 in Vancouver, Canada, for $52 million. At the time of the acquisition, Dollar Giant had about 85 retail outlets in British Columbia, Alberta, Saskatchewan and Ontario. Approximately 30 of its retail locations are in British Columbia, making it the second largest dollar store chain in that province. It was Canada's fourth largest operator of dollar stores. Dollar Tree has since rebranded all of its Dollar Giant stores to Dollar Tree; these were the first retail locations outside of the United States operated by Dollar Tree. As of 2020, the company operates 227 stores across Canada, concentrated in Western Canada and Ontario. All Dollar Tree stores in Canada sell items for C$1.50 or mentioned otherwise which is usually less than C$2. Dollar Tree Canada's merchandising team is located in Mississauga, Ontario, while its corporate office remains in Burnaby in Greater Vancouver. Recalls The U.S. Consumer Product Safety Commission has listed several recalls for products sold at Dollar Tree stores. The recalled products include salsa jars with broken glass inside them, hot-melt mini glue guns (recalled in January 2008) which could short circuit and cause burns, and candle sets (recalled in February 2004) that could produce excessive flame."
}