{
  "ticker": "DOC",
  "cik": "0000765880",
  "company_name": "Healthpeak Properties",
  "corrected_name": "Healthpeak Properties",
  "wiki_title_used": "Healthpeak Properties",
  "exists": true,
  "raw_text": "Healthpeak Properties, Inc. is an American real estate investment trust that invests in real estate related to the healthcare industry including senior housing, life science, and medical offices. It was organized in 2007 in Maryland and headquartered in Denver, Colorado with offices in Irvine, Nashville and San Francisco. As of December 31, 2019, the company owned interests in 617 properties.\n\nHistory\nThe company was founded in 1985 with two acute care hospitals and 22 skilled nursing facilities.\nIn 1985, the company became a public company via an initial public offering (IPO).\nIn September 2007, the company changed its name from Health Care Property Investors, Inc. to HCP, Inc.\nThe company was added to the S&P 500 Index in March 2008.\nIn November 2020, the company announced its choice of Denver for their new headquarters.\n\nMergers and acquisitions\nIn October 2016, the company completed the spin-off of Quality Care Properties.\nIn October 2019, the company restructured its joint venture with Brookdale Senior Living. The company also changed its name to Healthpeak Properties, Inc. and ticker symbol from \"HCP\" to \"PEAK\" effective November 5, 2019.\nIn March 2024, the company closed its all-stock merger of equals valued at approximately $21 billion with Physicians Realty Trust, and its NYSE ticker symbol for the company changed from \"PEAK\" to \"DOC\", effective March 4, 2024. Healthpeak Properties also obtained a five-year, $750 million unsecured term loan with $210 in Physicians Realty Trust private placement notes, for further development, and entered into a swap agreement to lock in an interest rate of 4.5% for the life of the loan. The Healthpeak Properties board of directors then added five new members from the Physicians Realty Trust board: John Thomas, Ava Lias-Booker, Pamela Kessler, Governor Tommy Thompson, Richard Weiss.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Healthpeak Properties, Inc.:",
  "clean_text": "Healthpeak Properties, Inc. is an American real estate investment trust that invests in real estate related to the healthcare industry including senior housing, life science, and medical offices. It was organized in 2007 in Maryland and headquartered in Denver, Colorado with offices in Irvine, Nashville and San Francisco. As of December 31, 2019, the company owned interests in 617 properties. History The company was founded in 1985 with two acute care hospitals and 22 skilled nursing facilities. In 1985, the company became a public company via an initial public offering (IPO). In September 2007, the company changed its name from Health Care Property Investors, Inc. to HCP, Inc. The company was added to the S&P 500 Index in March 2008. In November 2020, the company announced its choice of Denver for their new headquarters. Mergers and acquisitions In October 2016, the company completed the spin-off of Quality Care Properties. In October 2019, the company restructured its joint venture with Brookdale Senior Living. The company also changed its name to Healthpeak Properties, Inc. and ticker symbol from \"HCP\" to \"PEAK\" effective November 5, 2019. In March 2024, the company closed its all-stock merger of equals valued at approximately $21 billion with Physicians Realty Trust, and its NYSE ticker symbol for the company changed from \"PEAK\" to \"DOC\", effective March 4, 2024. Healthpeak Properties also obtained a five-year, $750 million unsecured term loan with $210 in Physicians Realty Trust private placement notes, for further development, and entered into a swap agreement to lock in an interest rate of 4.5% for the life of the loan. The Healthpeak Properties board of directors then added five new members from the Physicians Realty Trust board: John Thomas, Ava Lias-Booker, Pamela Kessler, Governor Tommy Thompson, Richard Weiss."
}