{
  "ticker": "DOV",
  "cik": "0000029905",
  "company_name": "Dover Corporation",
  "corrected_name": "Dover Corporation",
  "wiki_title_used": "Dover Corporation",
  "exists": true,
  "raw_text": "Dover Corporation is an American conglomerate manufacturer of industrial products. The Downers Grove, Illinois-based company was founded in 1955. As of 2021, Dover's business was divided into five segments: Engineered Products, Clean Energy and Fueling, Imaging & Identification, Pumps & Process Solutions and Climate and Sustainability Technologies. Dover is a constituent of the S&P 500 index and trades on the New York Stock Exchange under the symbol DOV. Dover was ranked 448 in the 2024 Fortune 500. The company relocated its headquarters to Illinois from New York in mid-2010.\n\nHistory\nFounding\nIn the 1930s and 1940s, George Ohrstrom Sr., a New York City stockbroker, bought four manufacturing companies: C. Lee Cook Company (seals and piston rings), Rotary Lift (automotive lifts), C. Norris (oil-well pump-sucker rods) and Peerless (space heaters). Dover Corporation was incorporated in 1947, and in 1955 Ohrstrom brought in the former owner and president of C. Lee Cook Company, Fred D. Durham, to manage his four companies. Later that same year, the Dover Corporate offices opened in Washington, D.C., and Dover Corporation went public on the New York Stock Exchange. As such, the year 1955 marks the company's official founding.\nFred Durham influenced Dover's corporate culture, emphasizing autonomy, decentralization and few corporate staff members. As a result, divisions were run in an independent fashion, each with its own president. Today, Dover is still known for its decentralized management structure, its governance of operating companies and for its acquisitive approach.\nBetween 1955 and 1979, Dover acquired 14 companies. A great deal of this acquisition activity served to build the Dover Elevator business. This elevator growth began in 1955, as Dover Elevator split from Rotary Lift and became an independent operating company within Dover. Dover's purchase of the Shepard Warner Elevator Company in 1958 marked the beginning of an effort to grow the elevator business. In 1963, Dover acquired Acme Elevator, Elevator Service, Reddy Elevator Company in 1964 and Hunter-Hayes Elevator Company in 1970. With these purchases, Dover soon became the third largest elevator company in the U.S. and remained so for many years. Dover continued to expand its elevator division throughout the 1960s and 1970s with the purchases of Moody & Rowe, Burch, Turnbull, Burlington, Hammond & Champness, Louisiana Elevator and W.W. Moore. Ultimately, Dover sold its elevator division in 1999 to Thyssen AG for $1.1 billion. Dover Elevator had a pretax operating profit of $93 million in 1997. The sale allowed Dover to focus on building its other businesses and moved ThyssenKrupp Elevator Americas to the number three spot worldwide in the elevator and escalator industry.\n\nAcquisitions\nDover's acquisition history reaches beyond the elevator industry. With a focus on diversification in the 1960s, such as the acquisition of Ohio Pattern Works & Foundry Company in 1961, came notable purchases of companies that continue to be a significant part of Dover Corporation today. The company was shortened to OPW, and in 1949 one of its engineers, Leonard H. Duerr, invented the automatic shutoff fuel-dispensing nozzle valve. Today, the basic technology of Duerr's invention continues to exist in automatic shutoff nozzles, and OPW is still a part of Dover, specializing in the design and manufacture of commercial and retail-fueling.\nIn 1962, Dover made two notable acquisitions: Detroit Stamping Company, now DE-STA-CO, specializing in the design and manufacturing of clamping, gripping, transferring and robotic tooling; and Alberta Oil Tool, subsequently part of Dover Artificial Lift before its separation from Dover Corp. Today, Alberta Oil Tool produces specialty drive rods, Norris tubular fittings, Norriseal control valves and other products.\n1964 marked a significant year, as OPW's former leader Thomas Sutton became president of Dover, and corporate headquarters were relocated to New York City. The 1970s were characterized by Dover's intent to expand beyond its principle industries of building materials, equipment and industrial components. A result of this effort included the acquisition of Dieterich Standard, which manufactured liquid-measurement instruments and whose president, Gary Roubos, went on to become Dover's chief operating officer (COO) and president in 1977. Later, Roubos became Dover's chief executive officer (CEO) in 1981.\nAnother significant acquisition included Sargent Industries, a manufacturer of control devices for aerospace and industrial end-markets, purchased in 1984 for $68 million. The Sargent Aerospace & Defense unit persisted as a global supplier of precision-engineered components and aftermarket services, performing critical functions on a variety of commercial and military aircraft, submarines and land-based vehicles.\nIn the 1980s, Dover also began to focus more on electronics. This period was marked by the acquisitions of K&L Microwave in 1983, Dielectric Laboratories in 1985 and NURAD in 1986. Dover later chose to spin off DOVatron in 1993 to shareholders, as the company specialized in circuit-board assembly and had become a source of competition for Dover customers.\nThat same year, Dover acquired Phoenix Refrigeration Systems, which then acquired Hill Refrigeration in 1994 to form Hillphoenix. Hillphoenix now manufactures commercial refrigeration systems and mechanical centers, electrical distribution products, walk-in coolers and freezers, and specialty display cases and fixtures. The company is a partner of the EPA's GreenChill initiative, which focuses on reducing refrigerant emissions and climate-change impact. Hillphoenix has more equipment installed at GreenChill Certified retail stores than any other refrigeration manufacturer.\nAlso in 1994, Dover's COO and President, Thomas Reece, became CEO of the company. The following year, Dover purchased an 88% interest in the French company Imaje Printing Products for $200 million; this acquisition marks the largest in Dover's corporate history. In 2006, Dover acquired Markem Corporation which specializes in identification. In 2007, the companies merged and were renamed Markem-Imaje, and have since focused on product coding, labeling, traceability and identification.\n\n2000s\nWhile Dover acquired more than seventy companies between 1998 and 2002, the company's acquisition rate slowed in the early 2000s. Dover sold eight companies in 2001 for a total of $400 million. The early 2000s also marked a leadership change: Ronald Hoffman, Dover's vice president, and former president and CEO of Dover Resources, become president and COO of Dover Corporation in 2003. In 2005, he was appointed to the position of CEO. The financial crisis hit Dover hard, but the company recovered quickly.\nDover focused on growing target areas from 2007 to 2009, including electronic communication, energy and fluids, product identification, and refrigeration. Dover continued to grow its refrigeration business with the 2012 purchase of Anthony International for $602.5 million. Anthony designs and manufactures specialty glass, commercial-glass refrigeration and freezer doors, lighting systems, and display equipment.\nIn 2008, Robert Livingston was appointed Dover's new CEO and president. Livingston's Dover career began twenty-nine years earlier with the acquisition of K&L Microwave, where he was a vice president. After joining Dover, Livingston also served as COO and vice president of Dover Corporation, president and CEO of Dover Engineered Systems, and president and CEO of Dover Electronics. Under Livingston's leadership, Dover moved its corporate headquarters from New York City to the Chicago area in 2010. Factors at play in this decision included Chicago's central location, wide variety of housing options for employees, quality of life, and nearby air service to national and global destinations. The choice to move to Downers Grove, Illinois, was also partially impacted by an effort to consolidate operations, and reduce administration costs, as the move brought all four segment headquarters under one roof.\nFrom 2008 to 2012, Dover acquired almost twenty-five companies. Livingston's corporate development strategy sought to strengthen promising businesses and divest those that were either growing slowly or had significant exposure to highly volatile industries. As a result, Dover was able to apply greater focus to growing four or five targeted end-markets. Livingston also worked to reduced expenses by consolidating back office operations, metal purchases, and freight transportation. Inpro/Seal, a producer of bearing isolators, was purchased by Waukesha Bearings Corporation in 2009, which included 150,991 shares of Dover's common stock being issued to Inpro/Seal shareholders. In 2010, KMC Inc. and Bearings Plus Inc. were acquired by Waukesha Bearings Corporation with the expectation of synergizing their bearing seal technologies with Dover. In addition, between 2008 and 2010, Dover spent approximately $436 million to purchase a total of sixteen businesses, while only $100 million was earned from the sale of eight businesses.\nIn 2011, Dover expanded its acoustic components business with the purchase of Sound Solutions, a manufacturer of dynamic speakers and receivers for mobile phones and other consumer electronics, for $855 million. Dover had acquired Knowles, a designer and manufacturer of hearing-aid technology and other acoustical componentry, six years earlier for $750 million. Sound Solutions and Knowles gave Dover the necessary scale to develop items for the rapidly evolving mobile-electronics industry. In 2014, Dover spun off Knowles, which had a $2.6 billion market cap post-spin. Today, Knowles continues to be a global supplier of communication-technology components, such as MEMS (micro-electro-mechanical systems), microphones, speakers, receivers, transducers, capacitors and oscillators. Dover CEO and president Robert Livingston described the spinoff as allowing both Knowles and Dover to more aggressively pursue their individual growth strategies.\nIn 2015, Dover sold Sargent Aerospace & Defense to RBC Bearings.\nIn 2016, Dover acquired Ravaglioli S.p.A., adding to its Vehicle Service Group\nIn May 2018, Richard J. Tobin took over as president and CEO of Dover, after previously serving as the company's director. In May 2018, Dover spun off a large portion of its Energy segment including upstream energy businesses into a standalone publicly traded company, Apergy.\nIn February 2024, Dover appointed its president and CEO, Richard J. Tobin, to the additional role of Chairman of the Board. In addition, the independent directors of the Board appointed Michael F. Johnston to the role of lead independent director. Later that year, the company completed sales of two of its operating divisions. German firm Stabilus purchased DESTACO for $680 million in a transaction announced in October 2023 and closed in April 2024, while Terex acquired the Environmental Solutions Group division for $2 billion in a deal announced in July and closed in October.\n\nSegments and operating companies\nDover's organization and segment structure has changed over its history. For example, in 1985 Dover restructured into five major subsidiaries to reflect its key markets of interest. For reporting purposes, these five major subsidiaries were represented in four sections: building industries (Dover Elevator International); electronic products (Dover Technologies); petroleum (Dover Resources); and industrial and aerospace products (Dover Industries, Dover Sargent). In 1989, Dover re-segmented into six sectors based on market activity changes: Dover Elevator International, Dover Technology, Dover Resources, Dover Industries, Dover Diversified, and Corporate Companies. After selling Dover Elevator, these segments became Diversified, Electronics, Industries, Resources, Systems and Technologies. In 2007, Dover reported four segments: Industrial Products, Engineered Systems, Fluid Management, and Electronic Technologies. Following 2014, Dover Corporation operated with four segments: Energy, Engineered Systems, Fluids, and Refrigeration & Food Equipment. The operating companies that reside within each segment are run like independent companies.\nAs of 2022, Dover Corporation is divided into five operating segments: Engineered Products, Clean Energy and Fueling, Imaging and Identification, Pumps and Process Solutions, and Climate and Sustainability Technologies. The Engineered Products segment provides products, software, and services for markets that include aerospace, defense, aftermarket vehicle services, industrial automation, and waste disposal. This segment includes Microwave Products Group, OK International, TWG, and Vehicle Service Group. The Clean Energy and Fueling segment provides products, services, software, and equipment for retail fueling and clean energy, vehicle wash solutions, and adjacent markets. This segment includes two operating companies: Dover Fueling Solutions and OPW. The Imaging and Identification segment supplies equipment and services to the marking and coding, product traceability, and digital textile printing markets. This segment includes two operating companies: Dover Digital Printing and Markem-Imaje. The Pumps and Process Solutions segment manufactures products for handling fluids across the chemical, hygienic, biopharma, oil and gas, and industrial sectors. This segment includes four operating companies: CPC, Dover Precision Components, MAAG Group, and PSG. The Climate and Sustainability Technologies segment provides equipment and systems to the commercial refrigeration, beverage packaging equipment, and heating and cooling markets. This segment includes three operating companies: Belvac, Dover Food Retail, and SWEP.\n\nEnergy and Fueling\nDover's energy segment works in the drilling and production markets to develop systems that extract oil and gas. It is composed of seven operating companies: Cook Compression, Dover Artificial Lift, Dover Energy Automation (DEA), Accelerated Process Systems, TWG, US Synthetic, and Waukesha Bearings. Cook Compression develops engineered compressors, while Dover Artificial Lift develops systems for oil-and-gas production, such as rod lifts, progressing cavity pumps, gas lifts, and plunger-lift systems. DEA includes Quartzdyne, which designs, develops, and manufactures resonating quartz pressure transducers for the downhole oil-and-gas industry. TWG is made up of six companies, all of which specialize in industry-specific winches and supporting electronic systems. US Synthetic produces long-lasting diamond inserts for downhole drilling-tool applications. Finally, Waukesha Bearings develops custom-engineered fluid-film bearings and magnet-bearing systems for high-performance turbomachinery.\n\nEngineered Products\nThe Engineered Systems segment develops products and systems for a variety of industries, from printing to waste handling. JK Group, Markem-Imaje, MS Printing Solutions, and OK International all serve the printing and identification markets. Environmental Solutions Group makes systems for the transportation and transformation of solid waste. De-Sta-Co is part of the work-holding and flexible-automation segment, such as clamps and grippers. Microwave Products Group serves defense, aerospace, and telecommunications markets. Lastly, Performance Motorsports Inc., Texas Hydraulics, Vehicle Service Group, and Warn are focused on the automobile and vehicle-service industry.\n\nPumps and Process Solutions\nThe Fluids segment designs and manufactures products and systems that safely handle critical fluids for the following end markets: oil-and-gas, retail-fueling, vehicle-wash, chemical, hygienic (food and pharmaceutical), and industrial. This segment is composed of: Colder Products Company, Finder, Hydro Systems Company (including Dosmatic U.S.A.), Maag, OPW, Tokheim, Wayne Fueling Systems and Pump Solutions Group. LaserWash is a brand name of a brand of touchless in-bay automatic vehicle wash system, or car wash. LaserWash vehicle wash systems are manufactured in  De Pere, Wisconsin. The systems are able to be remotely controlled and configured over the internet via a web interface; owners are able to see the status of the car wash and send commands to the machine.\n\nClimate and Sustainability Technologies\nDover's Refrigeration & Food Equipment segment develops equipment and systems for the commercial-refrigeration, heating and cooling, and food and beverage packaging, and food service industries. Anthony and Hill Phoenix design grocery store refrigerators and freezers. Anthony manufactures glass refrigerator and freezer doors, lighting systems and display equipment, and Hillphoenix manufactures display cases, walk-in coolers/freezers, and refrigeration and power systems. The packaging industry is served by Belvac Production Machinery, Inc., which offers systems for the beverage can-making industry. SWEP specializes in brazed-plate heat exchangers, with applications in air conditioning, refrigeration, heating, and industry and district energy. Unified Brands produces commercial kitchen equipment; prior to December 2021, Dover was owned Unified Brands before its sale to Sweden-based appliance manufacturer Electrolux Professional.\n\nImaging and identification\nThe Imaging & Identification segment is involved with the design and manufacture of equipment, consumables and software, in addition to providing support services for the marking and coding and for digital textile printing markets. This segment incorporates Markem-Imaje  who manufactures product identification and traceability systems including inkjet, thermal transfer, laser, print & apply label systems, and engineering systems. It also includes Dover Digital Printing who delivers  printing systems through software, inks and consumables, along with printing systems for the digital textile, soft signage and specialty materials markets.\n\nSee also\nList of conglomerates in the United States\n\nReferences\nExternal links\nBusiness data for Dover Corporation:",
  "clean_text": "Dover Corporation is an American conglomerate manufacturer of industrial products. The Downers Grove, Illinois-based company was founded in 1955. As of 2021, Dover's business was divided into five segments: Engineered Products, Clean Energy and Fueling, Imaging & Identification, Pumps & Process Solutions and Climate and Sustainability Technologies. Dover is a constituent of the S&P 500 index and trades on the New York Stock Exchange under the symbol DOV. Dover was ranked 448 in the 2024 Fortune 500. The company relocated its headquarters to Illinois from New York in mid-2010. History Founding In the 1930s and 1940s, George Ohrstrom Sr., a New York City stockbroker, bought four manufacturing companies: C. Lee Cook Company (seals and piston rings), Rotary Lift (automotive lifts), C. Norris (oil-well pump-sucker rods) and Peerless (space heaters). Dover Corporation was incorporated in 1947, and in 1955 Ohrstrom brought in the former owner and president of C. Lee Cook Company, Fred D. Durham, to manage his four companies. Later that same year, the Dover Corporate offices opened in Washington, D.C., and Dover Corporation went public on the New York Stock Exchange. As such, the year 1955 marks the company's official founding. Fred Durham influenced Dover's corporate culture, emphasizing autonomy, decentralization and few corporate staff members. As a result, divisions were run in an independent fashion, each with its own president. Today, Dover is still known for its decentralized management structure, its governance of operating companies and for its acquisitive approach. Between 1955 and 1979, Dover acquired 14 companies. A great deal of this acquisition activity served to build the Dover Elevator business. This elevator growth began in 1955, as Dover Elevator split from Rotary Lift and became an independent operating company within Dover. Dover's purchase of the Shepard Warner Elevator Company in 1958 marked the beginning of an effort to grow the elevator business. In 1963, Dover acquired Acme Elevator, Elevator Service, Reddy Elevator Company in 1964 and Hunter-Hayes Elevator Company in 1970. With these purchases, Dover soon became the third largest elevator company in the U.S. and remained so for many years. Dover continued to expand its elevator division throughout the 1960s and 1970s with the purchases of Moody & Rowe, Burch, Turnbull, Burlington, Hammond & Champness, Louisiana Elevator and W.W. Moore. Ultimately, Dover sold its elevator division in 1999 to Thyssen AG for $1.1 billion. Dover Elevator had a pretax operating profit of $93 million in 1997. The sale allowed Dover to focus on building its other businesses and moved ThyssenKrupp Elevator Americas to the number three spot worldwide in the elevator and escalator industry. Acquisitions Dover's acquisition history reaches beyond the elevator industry. With a focus on diversification in the 1960s, such as the acquisition of Ohio Pattern Works & Foundry Company in 1961, came notable purchases of companies that continue to be a significant part of Dover Corporation today. The company was shortened to OPW, and in 1949 one of its engineers, Leonard H. Duerr, invented the automatic shutoff fuel-dispensing nozzle valve. Today, the basic technology of Duerr's invention continues to exist in automatic shutoff nozzles, and OPW is still a part of Dover, specializing in the design and manufacture of commercial and retail-fueling. In 1962, Dover made two notable acquisitions: Detroit Stamping Company, now DE-STA-CO, specializing in the design and manufacturing of clamping, gripping, transferring and robotic tooling; and Alberta Oil Tool, subsequently part of Dover Artificial Lift before its separation from Dover Corp. Today, Alberta Oil Tool produces specialty drive rods, Norris tubular fittings, Norriseal control valves and other products. 1964 marked a significant year, as OPW's former leader Thomas Sutton became president of Dover, and corporate headquarters were relocated to New York City. The 1970s were characterized by Dover's intent to expand beyond its principle industries of building materials, equipment and industrial components. A result of this effort included the acquisition of Dieterich Standard, which manufactured liquid-measurement instruments and whose president, Gary Roubos, went on to become Dover's chief operating officer (COO) and president in 1977. Later, Roubos became Dover's chief executive officer (CEO) in 1981. Another significant acquisition included Sargent Industries, a manufacturer of control devices for aerospace and industrial end-markets, purchased in 1984 for $68 million. The Sargent Aerospace & Defense unit persisted as a global supplier of precision-engineered components and aftermarket services, performing critical functions on a variety of commercial and military aircraft, submarines and land-based vehicles. In the 1980s, Dover also began to focus more on electronics. This period was marked by the acquisitions of K&L Microwave in 1983, Dielectric Laboratories in 1985 and NURAD in 1986. Dover later chose to spin off DOVatron in 1993 to shareholders, as the company specialized in circuit-board assembly and had become a source of competition for Dover customers. That same year, Dover acquired Phoenix Refrigeration Systems, which then acquired Hill Refrigeration in 1994 to form Hillphoenix. Hillphoenix now manufactures commercial refrigeration systems and mechanical centers, electrical distribution products, walk-in coolers and freezers, and specialty display cases and fixtures. The company is a partner of the EPA's GreenChill initiative, which focuses on reducing refrigerant emissions and climate-change impact. Hillphoenix has more equipment installed at GreenChill Certified retail stores than any other refrigeration manufacturer. Also in 1994, Dover's COO and President, Thomas Reece, became CEO of the company. The following year, Dover purchased an 88% interest in the French company Imaje Printing Products for $200 million; this acquisition marks the largest in Dover's corporate history. In 2006, Dover acquired Markem Corporation which specializes in identification. In 2007, the companies merged and were renamed Markem-Imaje, and have since focused on product coding, labeling, traceability and identification. 2000s While Dover acquired more than seventy companies between 1998 and 2002, the company's acquisition rate slowed in the early 2000s. Dover sold eight companies in 2001 for a total of $400 million. The early 2000s also marked a leadership change: Ronald Hoffman, Dover's vice president, and former president and CEO of Dover Resources, become president and COO of Dover Corporation in 2003. In 2005, he was appointed to the position of CEO. The financial crisis hit Dover hard, but the company recovered quickly. Dover focused on growing target areas from 2007 to 2009, including electronic communication, energy and fluids, product identification, and refrigeration. Dover continued to grow its refrigeration business with the 2012 purchase of Anthony International for $602.5 million. Anthony designs and manufactures specialty glass, commercial-glass refrigeration and freezer doors, lighting systems, and display equipment. In 2008, Robert Livingston was appointed Dover's new CEO and president. Livingston's Dover career began twenty-nine years earlier with the acquisition of K&L Microwave, where he was a vice president. After joining Dover, Livingston also served as COO and vice president of Dover Corporation, president and CEO of Dover Engineered Systems, and president and CEO of Dover Electronics. Under Livingston's leadership, Dover moved its corporate headquarters from New York City to the Chicago area in 2010. Factors at play in this decision included Chicago's central location, wide variety of housing options for employees, quality of life, and nearby air service to national and global destinations. The choice to move to Downers Grove, Illinois, was also partially impacted by an effort to consolidate operations, and reduce administration costs, as the move brought all four segment headquarters under one roof. From 2008 to 2012, Dover acquired almost twenty-five companies. Livingston's corporate development strategy sought to strengthen promising businesses and divest those that were either growing slowly or had significant exposure to highly volatile industries. As a result, Dover was able to apply greater focus to growing four or five targeted end-markets. Livingston also worked to reduced expenses by consolidating back office operations, metal purchases, and freight transportation. Inpro/Seal, a producer of bearing isolators, was purchased by Waukesha Bearings Corporation in 2009, which included 150,991 shares of Dover's common stock being issued to Inpro/Seal shareholders. In 2010, KMC Inc. and Bearings Plus Inc. were acquired by Waukesha Bearings Corporation with the expectation of synergizing their bearing seal technologies with Dover. In addition, between 2008 and 2010, Dover spent approximately $436 million to purchase a total of sixteen businesses, while only $100 million was earned from the sale of eight businesses. In 2011, Dover expanded its acoustic components business with the purchase of Sound Solutions, a manufacturer of dynamic speakers and receivers for mobile phones and other consumer electronics, for $855 million. Dover had acquired Knowles, a designer and manufacturer of hearing-aid technology and other acoustical componentry, six years earlier for $750 million. Sound Solutions and Knowles gave Dover the necessary scale to develop items for the rapidly evolving mobile-electronics industry. In 2014, Dover spun off Knowles, which had a $2.6 billion market cap post-spin. Today, Knowles continues to be a global supplier of communication-technology components, such as MEMS (micro-electro-mechanical systems), microphones, speakers, receivers, transducers, capacitors and oscillators. Dover CEO and president Robert Livingston described the spinoff as allowing both Knowles and Dover to more aggressively pursue their individual growth strategies. In 2015, Dover sold Sargent Aerospace & Defense to RBC Bearings. In 2016, Dover acquired Ravaglioli S.p.A., adding to its Vehicle Service Group In May 2018, Richard J. Tobin took over as president and CEO of Dover, after previously serving as the company's director. In May 2018, Dover spun off a large portion of its Energy segment including upstream energy businesses into a standalone publicly traded company, Apergy. In February 2024, Dover appointed its president and CEO, Richard J. Tobin, to the additional role of Chairman of the Board. In addition, the independent directors of the Board appointed Michael F. Johnston to the role of lead independent director. Later that year, the company completed sales of two of its operating divisions. German firm Stabilus purchased DESTACO for $680 million in a transaction announced in October 2023 and closed in April 2024, while Terex acquired the Environmental Solutions Group division for $2 billion in a deal announced in July and closed in October. Segments and operating companies Dover's organization and segment structure has changed over its history. For example, in 1985 Dover restructured into five major subsidiaries to reflect its key markets of interest. For reporting purposes, these five major subsidiaries were represented in four sections: building industries (Dover Elevator International); electronic products (Dover Technologies); petroleum (Dover Resources); and industrial and aerospace products (Dover Industries, Dover Sargent). In 1989, Dover re-segmented into six sectors based on market activity changes: Dover Elevator International, Dover Technology, Dover Resources, Dover Industries, Dover Diversified, and Corporate Companies. After selling Dover Elevator, these segments became Diversified, Electronics, Industries, Resources, Systems and Technologies. In 2007, Dover reported four segments: Industrial Products, Engineered Systems, Fluid Management, and Electronic Technologies. Following 2014, Dover Corporation operated with four segments: Energy, Engineered Systems, Fluids, and Refrigeration & Food Equipment. The operating companies that reside within each segment are run like independent companies. As of 2022, Dover Corporation is divided into five operating segments: Engineered Products, Clean Energy and Fueling, Imaging and Identification, Pumps and Process Solutions, and Climate and Sustainability Technologies. The Engineered Products segment provides products, software, and services for markets that include aerospace, defense, aftermarket vehicle services, industrial automation, and waste disposal. This segment includes Microwave Products Group, OK International, TWG, and Vehicle Service Group. The Clean Energy and Fueling segment provides products, services, software, and equipment for retail fueling and clean energy, vehicle wash solutions, and adjacent markets. This segment includes two operating companies: Dover Fueling Solutions and OPW. The Imaging and Identification segment supplies equipment and services to the marking and coding, product traceability, and digital textile printing markets. This segment includes two operating companies: Dover Digital Printing and Markem-Imaje. The Pumps and Process Solutions segment manufactures products for handling fluids across the chemical, hygienic, biopharma, oil and gas, and industrial sectors. This segment includes four operating companies: CPC, Dover Precision Components, MAAG Group, and PSG. The Climate and Sustainability Technologies segment provides equipment and systems to the commercial refrigeration, beverage packaging equipment, and heating and cooling markets. This segment includes three operating companies: Belvac, Dover Food Retail, and SWEP. Energy and Fueling Dover's energy segment works in the drilling and production markets to develop systems that extract oil and gas. It is composed of seven operating companies: Cook Compression, Dover Artificial Lift, Dover Energy Automation (DEA), Accelerated Process Systems, TWG, US Synthetic, and Waukesha Bearings. Cook Compression develops engineered compressors, while Dover Artificial Lift develops systems for oil-and-gas production, such as rod lifts, progressing cavity pumps, gas lifts, and plunger-lift systems. DEA includes Quartzdyne, which designs, develops, and manufactures resonating quartz pressure transducers for the downhole oil-and-gas industry. TWG is made up of six companies, all of which specialize in industry-specific winches and supporting electronic systems. US Synthetic produces long-lasting diamond inserts for downhole drilling-tool applications. Finally, Waukesha Bearings develops custom-engineered fluid-film bearings and magnet-bearing systems for high-performance turbomachinery. Engineered Products The Engineered Systems segment develops products and systems for a variety of industries, from printing to waste handling. JK Group, Markem-Imaje, MS Printing Solutions, and OK International all serve the printing and identification markets. Environmental Solutions Group makes systems for the transportation and transformation of solid waste. De-Sta-Co is part of the work-holding and flexible-automation segment, such as clamps and grippers. Microwave Products Group serves defense, aerospace, and telecommunications markets. Lastly, Performance Motorsports Inc., Texas Hydraulics, Vehicle Service Group, and Warn are focused on the automobile and vehicle-service industry. Pumps and Process Solutions The Fluids segment designs and manufactures products and systems that safely handle critical fluids for the following end markets: oil-and-gas, retail-fueling, vehicle-wash, chemical, hygienic (food and pharmaceutical), and industrial. This segment is composed of: Colder Products Company, Finder, Hydro Systems Company (including Dosmatic U.S.A.), Maag, OPW, Tokheim, Wayne Fueling Systems and Pump Solutions Group. LaserWash is a brand name of a brand of touchless in-bay automatic vehicle wash system, or car wash. LaserWash vehicle wash systems are manufactured in De Pere, Wisconsin. The systems are able to be remotely controlled and configured over the internet via a web interface; owners are able to see the status of the car wash and send commands to the machine. Climate and Sustainability Technologies Dover's Refrigeration & Food Equipment segment develops equipment and systems for the commercial-refrigeration, heating and cooling, and food and beverage packaging, and food service industries. Anthony and Hill Phoenix design grocery store refrigerators and freezers. Anthony manufactures glass refrigerator and freezer doors, lighting systems and display equipment, and Hillphoenix manufactures display cases, walk-in coolers/freezers, and refrigeration and power systems. The packaging industry is served by Belvac Production Machinery, Inc., which offers systems for the beverage can-making industry. SWEP specializes in brazed-plate heat exchangers, with applications in air conditioning, refrigeration, heating, and industry and district energy. Unified Brands produces commercial kitchen equipment; prior to December 2021, Dover was owned Unified Brands before its sale to Sweden-based appliance manufacturer Electrolux Professional. Imaging and identification The Imaging & Identification segment is involved with the design and manufacture of equipment, consumables and software, in addition to providing support services for the marking and coding and for digital textile printing markets. This segment incorporates Markem-Imaje who manufactures product identification and traceability systems including inkjet, thermal transfer, laser, print & apply label systems, and engineering systems. It also includes Dover Digital Printing who delivers printing systems through software, inks and consumables, along with printing systems for the digital textile, soft signage and specialty materials markets."
}