{
  "ticker": "DPZ",
  "cik": "0001286681",
  "company_name": "Domino's",
  "corrected_name": "Domino's",
  "wiki_title_used": "Domino's",
  "exists": true,
  "raw_text": "Domino's Pizza, Inc., commonly referred to as Domino's, is an American multinational pizza restaurant chain founded in 1960. The corporation is Delaware-domiciled and headquartered at the Domino's Farms office park in Ann Arbor Township, near Ann Arbor, Michigan. As of 2018, Domino's had approximately 15,000 stores, with 5,649 in the United States, 1,500 in India, and 1,249 in the United Kingdom. Domino's has stores in more than 83 countries and 5,701 cities worldwide.\n\nHistory\n1960s–1990s\nIn 1960, Tom Monaghan and his brother, Jim, took over the operation of DomiNick's, an existing location of a small pizza restaurant chain that had been owned by Dominick DeVarti, at 507 Cross Street (now 301 West Cross Street) in Ypsilanti, Michigan, near Eastern Michigan University. The deal was secured by a $500 down payment, after which the brothers borrowed $900 to pay for the store. The brothers planned to split the work hours evenly, but Jim did not want to quit his job as a full-time postman to keep up with the demands of the new business. Within eight months, Jim traded his half of the business to Tom for the Volkswagen Beetle they used for pizza deliveries.\nBy 1965, Tom Monaghan had purchased two additional pizzerias; he now had a total of three locations in the same county. Monaghan wanted the stores to share the same branding, but the original owner forbade him from using the DomiNick's name. One day, an employee, Jim Kennedy, returned from a pizza delivery and suggested the name \"Domino's\". Monaghan immediately loved the idea and officially renamed the business to Domino's Pizza, Inc. in 1965.\nThe company logo originally had three dots (🁀), representing the three stores in 1965. Monaghan planned to add a new dot with the addition of every new store, but this idea quickly faded, as Domino's experienced rapid growth. Domino's Pizza opened its first franchise location in 1967 and by 1978, the company had expanded to 200 stores. In 1975, Domino's faced a lawsuit by Amstar Corporation, the maker of Domino Sugar, alleging trademark infringement and unfair competition. On May 2, 1980, the Fifth Circuit Court of Appeals in New Orleans found in favor of Domino's Pizza. During the lawsuit, Domino's opened fifteen new stores under the name Pizza Dispatch, while also converting other stores to the name.\n\nIn 1998, after 38 years of ownership, Monaghan announced his retirement, sold 93 percent of the company to Bain Capital, Inc. for about $1 billion, and ceased being involved in day-to-day operations of the company. A year later, the company named Dave Brandon as its CEO.\n\nLeaning Tower of Pizza\nThe Leaning Tower of Pizza was a proposed 30-story slanted skyscraper that would have housed Domino's Pizza's operations at its Domino's Farms campus near Ann Arbor, Michigan. In the mid-1980s, Monaghan asked Taliesin Associated Architects, the inheritors of Frank Lloyd Wright's practice, to erect a structure based on an un-built tower that Wright designed in 1956 for Chicago called the Golden Beacon. Sometime during the planning of the tower, Monaghan and the Taliesin architects parted company, allegedly because both parties felt the project may have not served justice to the spirit of Wright's architecture.\nMonaghan then went to Gunnar Birkerts, the architect of Domino's unusual half-mile (800 m) long headquarters office building who came up with a design for a tower that would rise at a 15-degree angle with a swooping top reminiscent of the forms of Wright's late work. Birkerts' design, no doubt, had serious intent, but would immediately and forever be dubbed with the nickname \"The Leaning Tower of Pizza\" after Italy's Leaning Tower of Pisa. The structure was never built but a 50-foot (15 m) tall scale model stands at the proposed site on Domino Pizza headquarters in Ann Arbor Charter Township, Michigan, outside of Ann Arbor.\n\nInternational expansion\nOn May 12, 1983, Domino's opened its first international store, in Winnipeg, Manitoba, Canada. That same year, Domino's opened its 1,000th store, at 8086 E. Mill Plain Blvd. in Vancouver, Washington. In 1985, the chain opened their first store in the United Kingdom in Luton. Also, in 1985 Domino's opened their first store in Tokyo, Japan. In 1993, they became the second American franchise to open in the Dominican Republic and the first one to open in Haiti, under the direction of entrepreneur Luis de Jesús Rodríguez. By 1995, Domino's had expanded to 1,000 international locations. In 1997, Domino's opened its 1,500th international location, opening seven stores in one day across five continents. By 2014, the company had grown to 6,000 international locations and was planning to expand to pizza's birthplace, Italy; this was achieved on October 5, 2015, in Milan, with their first Italian location. CEO Patrick Doyle, in May 2014, said the company would concentrate on its delivery model there. After having faced tough competition from local restaurants and falling behind on its debt obligations, Domino's exited the country in 2022.\nIn 1995, Domino's Pizza entered China through the Pizza Vest Fast Food Group, which also owned the rights to operate Domino's Pizza in eleven Southeast Asian countries.\nIn February 2016, Domino's opened its 1,000th store in India. Outside the United States, India has the largest number of Domino's outlets in the world.\n\nChina\nThe Chinese subsidiary is known as Domino's Pizza China (Chinese: 达美乐; pinyin: Dá Měi Lè). As of October 2019, Domino's Pizza China has about 250 stores in nine cities: Beijing (about 75 stores), Shanghai (about 100 stores), Guangzhou, Shenzhen, Tianjin, Nanjing, Suzhou, Wuxi, and Hangzhou. Domino's Pizza China has offered American-style potato bacon pizza, crayfish crispy-and-tender chicken pizza, durian pulp pizza, and salted egg-yolk pizza, as well as Sichuan pepper-flavor tender chicken drumsticks.\nThe first mainland China store was located in the Shenzhen Special Economic Zone 4 and the first Beijing location opened in Haidian District in May 1997. In December 2006, Taiwan's Jinghua Hotel Group invested NT$500 million to acquire the rights for Domino's Pizza in Taiwan and Beijing. The 200th store in Shenzhen, was also the 10,000th Domino's store internationally. In 2017, Dash Brands Ltd., a foreign investment company specializing in restaurant chains, obtained the exclusive rights for Hong Kong and Macau.\nIn China, more than 90% of orders are placed online. Orders can be made in the stores and on the company website, via app, and through the messaging app WeChat. Despite insisting that its own distribution system has greater advantages in safeguarding service quality and data retention, Domino's has already opened up a model of cooperation with third-party take-out platforms such as Ele.me and Meituan.\n\n2000s–present\nIn 2004, after 44 years as a privately held company, Domino's began trading common stock on the New York Stock Exchange under the ticker symbol \"DPZ\". Industry trade publication Pizza Today magazine named Domino's Pizza \"Chain of the Year\" in 2003, 2010, and 2011. In a simultaneous celebration in January 2006, Domino's opened its 5,000th American store in Huntley, Illinois, and its 3,000th international store in Panama City, Panama, making 8,000 total stores for the system. In August 2006, the Domino's location in Tallaght, Dublin, Ireland, became the first store in Domino's history to hit a turnover of $3 million (€2.35 million) per year. As of September 2006, Domino's has 8,200-plus stores worldwide, which totaled $1.4 billion in gross income.\n\nIn August 2012, Domino's Pizza changed its name to simply Domino's (the parent company is still called Domino's Pizza). At the same time, Domino's introduced a new logo that removed the blue rectangle and text under the domino in the logo, and changed the formerly all-red domino to be blue on the side with two dots and red on the side with one dot. This was done because the company wanted to \"expand\" menu choices rather than simply rely on its traditional pizza.\nIn April 2022, Domino's Italy franchise operator EPizza SpA filed for bankruptcy at a Milan court after two years of declining sales caused by the COVID-19 lockdowns in Italy. In addition, Domino's Pizza faced competition from local pizza chains and restaurants, which had begun using food delivery app services such as Glovo, Just Eat and Deliveroo. The reason for the failure, however, is mainly that the customer rating of Domino's outlets is very low in Italy, which explains the difficulty of competing with the high quality of Italian pizzas. After the 90-day grace period expired in July 2022, Domino's closed all its Italian stores on 20 July.\nIn 2023, following the invasion war in Ukraine, Domino's Russian operations also filed for bankruptcy and Domino's ultimately announced their withdrawal from the country, closing down all of their restaurants shortly after the announcement.\nOn December 12, 2024, Domino's announced that it would transfer its stock to the Nasdaq Global Select Market which took effect on January 2, 2025 at the stock market open. The company retained the ticker symbol \"DPZ\".\nDomino's has announced on February 7, 2025, that it plans to close more than 200 stores worldwide, 172 of them just in Japan, where Domino's Pizza Japan operates 1,000 stores. The decision comes after CEO and Managing Director Mark van Dyck took the reins of the company. The reason given for the closures, is low sales in the selected stores. Of all the markets that include the brand, Australia–New Zealand was the only market to report positive growth. With the closures, Domino's expects to reduce costs by approximately $9.8 million.\n\nProducts\nThe Domino's menu varies by region. The current Domino's menu in the United States features a variety of Italian-American main and side dishes. Pizza is the primary focus, with traditional, specialty, and custom pizzas available in a variety of crust styles and toppings. In 2011, Domino's launched artisan-style pizzas. Additional entrees include pasta, bread bowls, and oven-baked sandwiches. The menu offers chicken and bread side dishes, as well as beverages and desserts.\nFrom its founding until the early 1990s, the menu at Domino's Pizza was kept simple relative to other fast food restaurants, to ensure efficiency of delivery. Historically, Domino's menu consisted solely of one style of pizza crust in two sizes (12-inch and 16-inch), eleven toppings, and Coca-Cola as the only soft drink option.\nThe first menu expansion occurred in 1989, with the debut of Domino's deep dish. Its introduction followed market research showing that 40% of pizza customers preferred thick crusts. The new product launch cost approximately $25 million, of which $15 million was spent on new sheet metal pans with perforated bottoms. Domino's started testing extra-large-size pizzas in early 1993, starting with the 30-slice, yard-long \"The Dominator\".\nDomino's tapped into a market trend toward bite-size foods with spicy \"Buffalo Chicken Kickers\", as an alternative to Buffalo wings, in August 2002. The breaded, baked, white-meat fillets, similar to chicken fingers, are packaged in a custom-designed box with two types of sauce to \"heat up\" and \"cool down\" the chicken.\n\nIn August 2003, Domino's announced its first new pizza since January 2000, the \"Philly Cheese Steak Pizza\". The product launch also marked the beginning of a partnership with the National Cattlemen's Beef Association, whose beef Check-Off logo appeared in related advertising. Domino's continued its move toward specialty pizzas in 2006, with the introduction of its \"Brooklyn Style Pizza\", featuring a thinner crust, cornmeal baked in to add crispness, and larger slices that could be folded in the style of traditional New York-style pizza.In 2008, Domino's once again branched out into non-pizza fare, offering oven-baked sandwiches in four styles, intended to compete with Subway's toasted submarine sandwiches. Early marketing for the sandwiches made varied references to its competition, such as offering free sandwiches to customers named \"Jared\", a reference to Subway's spokesman of the same name.\nThe company introduced its \"American Legends\" line of specialty pizzas in 2009, featuring 40% more cheese than the company's regular pizzas, along with a greater variety of toppings. That same year, Domino's began selling its \"BreadBowl Pasta\" entree, a lightly seasoned bread bowl baked with pasta inside, and the \"Lava Crunch Cake\" dessert, a crunchy chocolate shell filled with warm fudge. Domino's promoted the dessert by flying in 1,000 cakes to deliver at Hoffstadt Bluffs Visitor Center near Mount St. Helens in Washington state.\nIn 2010, shortly after the company's 50th anniversary, Domino's changed its pizza recipe \"from the crust up\", making significant changes in the dough, sauce, and cheese used in their pizzas. Their advertising campaign admitted to earlier problems with the public perception of Domino's product owing to taste issues. In September 2012, Domino's announced it was introducing pan pizza to the menu on September 24, 2012, and the original Deep Dish pizza introduced 23 years prior was discontinued in favor of the new pan pizza. In December 2013, Domino's Pizza Israel unveiled its first vegan pizza, which uses a soy-based cheese substitute supplied by the UK company VBites.\n\nFranchises\nDomino's Pizza, as of September 2018, has locations in the United States (including the District of Columbia, Guam, Puerto Rico, and the United States Virgin Islands), in 83 other countries, including overseas territories such as the Cayman Islands, and states with limited recognition, such as Kosovo and Northern Cyprus. It has its stores in 5,701 cities worldwide (2,900 international and 2,800 in America) In 2016, Domino's opened its 1,000th store in India. As of the first quarter of 2018, Domino's had approximately 15,000 stores, with 5,649 in the United States, 1,232 in India, and 1,094 in the United Kingdom.\nIn most cases, Domino's has master franchise agreements with one company per country, but three companies have acquired multiple master franchise agreements, covering multiple countries:\n\nDomino's Pizza Israel was founded in 1990, and opened their first branch in 1993. They are operated by Elgad Pizza. As of August 2014, there are 33 branches throughout the state. There are four kosher franchises.\nThe rights to own, operate, and franchise branches of the chain in Australia, New Zealand, France, Belgium, the Netherlands, Monaco, Luxembourg, Germany, Japan, Malaysia, Singapore, Taiwan and Cambodia are currently owned by Australian Domino's Pizza Enterprises, having bought the master franchises from the parent company in 1993 (Australian and New Zealand franchises). The Australian company also acquired several European and Asian franchises between 2013 and 2022. It acquired the Danish operations in 2019 but liquidated them in 2023.\nThe master franchises for the UK and Ireland were purchased in 1993 by the British publicly listed Domino's Pizza Group (DPG), which acquired the master franchise for Germany in 2011, and Switzerland, Liechtenstein, and Luxembourg in August 2012 by buying the Swiss master franchise holder, with an option to acquire the Austrian master franchise as well. DPG opened its first Swedish location near the Mobilia shopping mall in Malmö in December 2016; three years later, in 2019, they announced that they would be selling all of their current businesses in the country.\nIn Latin America, the first franchise was opened in 1988 in Colombia. During the next years, Domino's Pizza started operations in Mexico, Guatemala (1989), Chile (1991), Venezuela (1992), Dominican Republic (1993), Ecuador and Peru (1995). However, owing to problems in administration and after several cases of unhealthiness, the Domino's Peruvian franchise closed in 2015, and reopened one year later with new owners.\nThe master franchises for India, Nepal, and Sri Lanka are currently owned by the Indian company Jubilant FoodWorks. India is the largest international market for Domino's outside its home market, being the only country to have more than 1,000 Domino's outlets. With the first store opening in Delhi in 1996, the company operates 1,362 stores across 264 Indian cities as of 2018.\nIn Bangladesh, the franchises for Domino's Pizza are co-owned by Jubilant FoodWorks and Golden Harvest Limited, forming 'Domino's Pizza Bangladesh Limited'. In this entity, Jubilant FoodWorks is the majority shareholder and owns 51% of the company, while the rest of the share is owned by Golden Harvest Limited. The first store in Bangladesh opened in February 2019.\nAs of July 27, 2020, Domino's Pizza opened in downtown Zagreb, Croatia.\nAs of 2020, Domino's Pizza opened 550 stores in Turkey.\nIn Italy, Domino's declared bankruptcy closing all its stores.\nIn Russia, DP Eurasia announced that they would be declaring bankruptcy for its Russian business and would be closing all of its locations in Russia, Turkey, Azerbaijan, and Georgia. The Russian network was bought by rapper Timati in August 2023. After the sale, it changed its name to Domиno Pizza.\nAs of November 2022, Domino's Pizza opened in Montevideo, Uruguay, being the franchise's first location in the Southern Cone, and announcing the plan of opening 20 stores in this city in the next five years.\nIn Central Asia, Domino's Pizza opened its first franchise in May 2024 in Tashkent (Uzbekistan).\n\nSales\nThere are currently 6,157 total Domino's units in the United States, and of those 5,815 of those are franchised units. In 2018, the Average Weekly Unit Sales (AWUS) for franchised units was $22,045, showing a consistent increase over the past five years. Per year, this amounts to an average of over a million dollars in sales. Domino's EBITDA was 15.0% for stores making more than $25,000. The vast majority of stores fell under this category, more than 1,500 units. According to Domino's 2019 income statement, their net income was just over $400,000. The initial franchise fee for a Domino's franchise is $10,000, the royalty fee is 5.5% of the store's weekly sales, and the advertising payment is 4% of the store's weekly sales.\n\nAdvertising\nIn late 1986, Domino's was well known for its advertisements featuring a slapstick character called the Noid, created by Group 243 Inc. who hired Will Vinton Studios to produce the television commercials that featured the character. The character was designed to be the personification of any and all possible unsatisfactory experiences when having pizza delivered; as such, the catchphrase associated with the commercials was \"Avoid the Noid\". The ad campaign gained notoriety, however, in 1989, when a man named Kenneth Lamar Noid, believing the mascot to be an imitation of him, held two Domino's employees hostage in Chamblee, Georgia. The employees escaped while Noid ate a pizza he had ordered. Noid was eventually diagnosed with paranoid schizophrenia and acquitted due to insanity, and later committed suicide in 1995. Contrary to popular belief, Domino's has stated that the retirement of the Noid ad campaign was not a result of the hostage situation. The Noid was briefly brought back for a week in 2011 in an arcade-style game on the Domino's Facebook page. The person with the top score received a coupon for a free pizza.\nOwing to a glitch on the Domino's website, the company gave away nearly 11,000 free medium pizzas in March 2009. The company had planned the campaign for December 2008 but scrapped the idea and never promoted it. The redemption code to receive the pizzas was never deactivated, however, and resulted in the free giveaway of the pizzas across the United States after someone discovered the promotion on the website by typing in the word \"bailout\" as the redemption code and then shared it with others on the Internet. Domino's deactivated the code on the morning of March 31, 2009, and promised to reimburse store owners for the pizzas.\n\nDomino's sponsored CART's Doug Shierson Racing, which was driven by Arie Luyendyk and won the 1990 Indianapolis 500. In 2003, Domino's teamed up with NASCAR for a multi-year partnership to become the \"Official Pizza of NASCAR\". Domino's also sponsored Michael Waltrip Racing and driver David Reutimann during the 2007 season in the NASCAR Sprint Cup Series.\nIn June 2018, Domino's announced that it had started a project to pave over cracks and potholes on roads in the United States called \"Paving for Pizza\" to prevent their pizzas from being ruined, giving cities and towns grants for road repairs. The company had reached an agreement with four cities and towns, including Burbank, California; Bartonville, Texas; Athens, Georgia; and Milford, Delaware, to pave their roads. The paved sections feature the Domino's logo along with the slogan \"OH YES, WE DID\".\n\n30-minute guarantee\nBeginning in 1973, Domino's Pizza offered a guarantee to customers their pizza would be delivered within 30 minutes of placing an order or they would receive the pizza free. This guarantee was changed to $3 off in 1987. In 1992, the company settled a lawsuit brought by the family of an Indiana woman who had been killed by a speeding Domino's delivery driver, paying the family $2.8 million. In another lawsuit in 1993, a woman who was injured when a Domino's delivery driver ran a red light and collided with her vehicle was awarded nearly $80 million by a jury, but accepted a payout of $15 million. The half-hour guarantee was dropped that year because of the \"public perception of reckless driving and irresponsibility\", according to then-CEO Tom Monaghan.\nIn December 2007, Domino's introduced a new slogan, \"You Got 30 Minutes\", alluding to the earlier pledge, but stopping short of promising delivery in half an hour.\nThe company continues to honor the 30-minute guarantee for orders placed in its stores located in Colombia, Vietnam, Mexico, China, and India. The 30-minute guarantee is subject to the terms and conditions applied in the respective country.\n\nMarketing\nIn 2001, Domino's launched a two-year national partnership with the Make-A-Wish Foundation of America. That same year, company stores in New York City and Washington, D.C., provided more than 12,000 pizzas to relief workers following the September 11 attacks on the World Trade Center and The Pentagon. Through a matching funds program, the corporation donated $350,000 to the American Red Cross' disaster relief effort. In 2004, Domino's began a partnership with St. Jude Children's Research Hospital, participating in the hospital's \"Thanks and Giving\" campaign since the campaign began in 2004, and raising $5.2 million in 2014.\nIn 2007, Domino's introduced its Veterans Delivering the Dream franchising program and also rolled out its online and mobile ordering sites. In 2008, Domino's introduced the Pizza Tracker, an online application that allows customers to view the status of their order in a real time progress bar. Since 2005, the voice of Domino's Pizza's US phone ordering service has been Kevin Railsback.\nIn a 2009 survey of consumer taste preferences among national chains by Brand Keys, Domino's was last—tied with Chuck E. Cheese. In December that year, Domino's announced plans to entirely reinvent its pizza. It began a self-critical ad campaign in which consumers were filmed criticizing the then-current pizza's quality and chefs were shown developing a new pizza. The new pizza was unveiled that same month. The following year, 2010 and Domino's 50th anniversary, the company hired J. Patrick Doyle as its new CEO and experienced a 14.3% quarterly gain.\nIn 2011, Domino's launched a billboard advertising in New York's Times Square which displayed real time comments from customers, including good, neutral and bad comments.\nIn 2015, Domino's unveiled a \"pizza car\" that can carry 80 pizzas, sides, two-liter bottles of soda, and dipping sauces. It also has a 140 °F (60 °C) oven on board and is more fuel efficient than a standard delivery car. Officially named the Domino's DXP, the car is a Chevrolet Spark customized by Roush Performance. Once each car reaches 100,000 miles, it will be retired and returned to Roush, where it will be returned to stock form.\nIn 2016, Domino's cooperated with Starship Technologies and applied self-driving robots to deliver pizzas in specific German and Dutch cities. In 2016, Domino's in New Zealand delivered the world's first pizza delivery by unmanned aerial vehicle using the DRU Drone by Flirety.\nIn February 2017, Domino's launched a wedding registry with gifts delivered in the form of Domino's eGift cards. Domino's also worked with Gugu Guru to create a pizza-themed baby registry. Customers have the option of signing up for Domino's pizza package to be served for the event.\nIn June 2019, Domino's announced a partnership with robotics company Nuro. The service is slated to launch in Houston, Texas, with Nuro's custom, self-driving vehicle, R2.\nIn December 2021, the company began offering \"surprise frees,\" or complimentary items as part of a delivery process, of up to $50 million. The move was made to distinguish the company from delivery apps that charged fees.\nIn January 2022, the company announced it would cut back on promotional offers as well as adjust specific menu items in response to inflationary pressures. In September, the company launched an \"Inflation Relief Deal\" that for a limited time offered a 20% discount on online ordering. And in November, Domino's added 800 Chevrolet Bolt cars to the United States fleet of cars.\n\nSee also\nList of pizza chains\nList of pizza chains of the United States\nList of pizza franchises\nList of pizza varieties by country\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Domino's Pizza, Inc.:",
  "clean_text": "Domino's Pizza, Inc., commonly referred to as Domino's, is an American multinational pizza restaurant chain founded in 1960. The corporation is Delaware-domiciled and headquartered at the Domino's Farms office park in Ann Arbor Township, near Ann Arbor, Michigan. As of 2018, Domino's had approximately 15,000 stores, with 5,649 in the United States, 1,500 in India, and 1,249 in the United Kingdom. Domino's has stores in more than 83 countries and 5,701 cities worldwide. History 1960s–1990s In 1960, Tom Monaghan and his brother, Jim, took over the operation of DomiNick's, an existing location of a small pizza restaurant chain that had been owned by Dominick DeVarti, at 507 Cross Street (now 301 West Cross Street) in Ypsilanti, Michigan, near Eastern Michigan University. The deal was secured by a $500 down payment, after which the brothers borrowed $900 to pay for the store. The brothers planned to split the work hours evenly, but Jim did not want to quit his job as a full-time postman to keep up with the demands of the new business. Within eight months, Jim traded his half of the business to Tom for the Volkswagen Beetle they used for pizza deliveries. By 1965, Tom Monaghan had purchased two additional pizzerias; he now had a total of three locations in the same county. Monaghan wanted the stores to share the same branding, but the original owner forbade him from using the DomiNick's name. One day, an employee, Jim Kennedy, returned from a pizza delivery and suggested the name \"Domino's\". Monaghan immediately loved the idea and officially renamed the business to Domino's Pizza, Inc. in 1965. The company logo originally had three dots (🁀), representing the three stores in 1965. Monaghan planned to add a new dot with the addition of every new store, but this idea quickly faded, as Domino's experienced rapid growth. Domino's Pizza opened its first franchise location in 1967 and by 1978, the company had expanded to 200 stores. In 1975, Domino's faced a lawsuit by Amstar Corporation, the maker of Domino Sugar, alleging trademark infringement and unfair competition. On May 2, 1980, the Fifth Circuit Court of Appeals in New Orleans found in favor of Domino's Pizza. During the lawsuit, Domino's opened fifteen new stores under the name Pizza Dispatch, while also converting other stores to the name. In 1998, after 38 years of ownership, Monaghan announced his retirement, sold 93 percent of the company to Bain Capital, Inc. for about $1 billion, and ceased being involved in day-to-day operations of the company. A year later, the company named Dave Brandon as its CEO. Leaning Tower of Pizza The Leaning Tower of Pizza was a proposed 30-story slanted skyscraper that would have housed Domino's Pizza's operations at its Domino's Farms campus near Ann Arbor, Michigan. In the mid-1980s, Monaghan asked Taliesin Associated Architects, the inheritors of Frank Lloyd Wright's practice, to erect a structure based on an un-built tower that Wright designed in 1956 for Chicago called the Golden Beacon. Sometime during the planning of the tower, Monaghan and the Taliesin architects parted company, allegedly because both parties felt the project may have not served justice to the spirit of Wright's architecture. Monaghan then went to Gunnar Birkerts, the architect of Domino's unusual half-mile (800 m) long headquarters office building who came up with a design for a tower that would rise at a 15-degree angle with a swooping top reminiscent of the forms of Wright's late work. Birkerts' design, no doubt, had serious intent, but would immediately and forever be dubbed with the nickname \"The Leaning Tower of Pizza\" after Italy's Leaning Tower of Pisa. The structure was never built but a 50-foot (15 m) tall scale model stands at the proposed site on Domino Pizza headquarters in Ann Arbor Charter Township, Michigan, outside of Ann Arbor. International expansion On May 12, 1983, Domino's opened its first international store, in Winnipeg, Manitoba, Canada. That same year, Domino's opened its 1,000th store, at 8086 E. Mill Plain Blvd. in Vancouver, Washington. In 1985, the chain opened their first store in the United Kingdom in Luton. Also, in 1985 Domino's opened their first store in Tokyo, Japan. In 1993, they became the second American franchise to open in the Dominican Republic and the first one to open in Haiti, under the direction of entrepreneur Luis de Jesús Rodríguez. By 1995, Domino's had expanded to 1,000 international locations. In 1997, Domino's opened its 1,500th international location, opening seven stores in one day across five continents. By 2014, the company had grown to 6,000 international locations and was planning to expand to pizza's birthplace, Italy; this was achieved on October 5, 2015, in Milan, with their first Italian location. CEO Patrick Doyle, in May 2014, said the company would concentrate on its delivery model there. After having faced tough competition from local restaurants and falling behind on its debt obligations, Domino's exited the country in 2022. In 1995, Domino's Pizza entered China through the Pizza Vest Fast Food Group, which also owned the rights to operate Domino's Pizza in eleven Southeast Asian countries. In February 2016, Domino's opened its 1,000th store in India. Outside the United States, India has the largest number of Domino's outlets in the world. China The Chinese subsidiary is known as Domino's Pizza China (Chinese: 达美乐; pinyin: Dá Měi Lè). As of October 2019, Domino's Pizza China has about 250 stores in nine cities: Beijing (about 75 stores), Shanghai (about 100 stores), Guangzhou, Shenzhen, Tianjin, Nanjing, Suzhou, Wuxi, and Hangzhou. Domino's Pizza China has offered American-style potato bacon pizza, crayfish crispy-and-tender chicken pizza, durian pulp pizza, and salted egg-yolk pizza, as well as Sichuan pepper-flavor tender chicken drumsticks. The first mainland China store was located in the Shenzhen Special Economic Zone 4 and the first Beijing location opened in Haidian District in May 1997. In December 2006, Taiwan's Jinghua Hotel Group invested NT$500 million to acquire the rights for Domino's Pizza in Taiwan and Beijing. The 200th store in Shenzhen, was also the 10,000th Domino's store internationally. In 2017, Dash Brands Ltd., a foreign investment company specializing in restaurant chains, obtained the exclusive rights for Hong Kong and Macau. In China, more than 90% of orders are placed online. Orders can be made in the stores and on the company website, via app, and through the messaging app WeChat. Despite insisting that its own distribution system has greater advantages in safeguarding service quality and data retention, Domino's has already opened up a model of cooperation with third-party take-out platforms such as Ele.me and Meituan. 2000s–present In 2004, after 44 years as a privately held company, Domino's began trading common stock on the New York Stock Exchange under the ticker symbol \"DPZ\". Industry trade publication Pizza Today magazine named Domino's Pizza \"Chain of the Year\" in 2003, 2010, and 2011. In a simultaneous celebration in January 2006, Domino's opened its 5,000th American store in Huntley, Illinois, and its 3,000th international store in Panama City, Panama, making 8,000 total stores for the system. In August 2006, the Domino's location in Tallaght, Dublin, Ireland, became the first store in Domino's history to hit a turnover of $3 million (€2.35 million) per year. As of September 2006, Domino's has 8,200-plus stores worldwide, which totaled $1.4 billion in gross income. In August 2012, Domino's Pizza changed its name to simply Domino's (the parent company is still called Domino's Pizza). At the same time, Domino's introduced a new logo that removed the blue rectangle and text under the domino in the logo, and changed the formerly all-red domino to be blue on the side with two dots and red on the side with one dot. This was done because the company wanted to \"expand\" menu choices rather than simply rely on its traditional pizza. In April 2022, Domino's Italy franchise operator EPizza SpA filed for bankruptcy at a Milan court after two years of declining sales caused by the COVID-19 lockdowns in Italy. In addition, Domino's Pizza faced competition from local pizza chains and restaurants, which had begun using food delivery app services such as Glovo, Just Eat and Deliveroo. The reason for the failure, however, is mainly that the customer rating of Domino's outlets is very low in Italy, which explains the difficulty of competing with the high quality of Italian pizzas. After the 90-day grace period expired in July 2022, Domino's closed all its Italian stores on 20 July. In 2023, following the invasion war in Ukraine, Domino's Russian operations also filed for bankruptcy and Domino's ultimately announced their withdrawal from the country, closing down all of their restaurants shortly after the announcement. On December 12, 2024, Domino's announced that it would transfer its stock to the Nasdaq Global Select Market which took effect on January 2, 2025 at the stock market open. The company retained the ticker symbol \"DPZ\". Domino's has announced on February 7, 2025, that it plans to close more than 200 stores worldwide, 172 of them just in Japan, where Domino's Pizza Japan operates 1,000 stores. The decision comes after CEO and Managing Director Mark van Dyck took the reins of the company. The reason given for the closures, is low sales in the selected stores. Of all the markets that include the brand, Australia–New Zealand was the only market to report positive growth. With the closures, Domino's expects to reduce costs by approximately $9.8 million. Products The Domino's menu varies by region. The current Domino's menu in the United States features a variety of Italian-American main and side dishes. Pizza is the primary focus, with traditional, specialty, and custom pizzas available in a variety of crust styles and toppings. In 2011, Domino's launched artisan-style pizzas. Additional entrees include pasta, bread bowls, and oven-baked sandwiches. The menu offers chicken and bread side dishes, as well as beverages and desserts. From its founding until the early 1990s, the menu at Domino's Pizza was kept simple relative to other fast food restaurants, to ensure efficiency of delivery. Historically, Domino's menu consisted solely of one style of pizza crust in two sizes (12-inch and 16-inch), eleven toppings, and Coca-Cola as the only soft drink option. The first menu expansion occurred in 1989, with the debut of Domino's deep dish. Its introduction followed market research showing that 40% of pizza customers preferred thick crusts. The new product launch cost approximately $25 million, of which $15 million was spent on new sheet metal pans with perforated bottoms. Domino's started testing extra-large-size pizzas in early 1993, starting with the 30-slice, yard-long \"The Dominator\". Domino's tapped into a market trend toward bite-size foods with spicy \"Buffalo Chicken Kickers\", as an alternative to Buffalo wings, in August 2002. The breaded, baked, white-meat fillets, similar to chicken fingers, are packaged in a custom-designed box with two types of sauce to \"heat up\" and \"cool down\" the chicken. In August 2003, Domino's announced its first new pizza since January 2000, the \"Philly Cheese Steak Pizza\". The product launch also marked the beginning of a partnership with the National Cattlemen's Beef Association, whose beef Check-Off logo appeared in related advertising. Domino's continued its move toward specialty pizzas in 2006, with the introduction of its \"Brooklyn Style Pizza\", featuring a thinner crust, cornmeal baked in to add crispness, and larger slices that could be folded in the style of traditional New York-style pizza.In 2008, Domino's once again branched out into non-pizza fare, offering oven-baked sandwiches in four styles, intended to compete with Subway's toasted submarine sandwiches. Early marketing for the sandwiches made varied references to its competition, such as offering free sandwiches to customers named \"Jared\", a reference to Subway's spokesman of the same name. The company introduced its \"American Legends\" line of specialty pizzas in 2009, featuring 40% more cheese than the company's regular pizzas, along with a greater variety of toppings. That same year, Domino's began selling its \"BreadBowl Pasta\" entree, a lightly seasoned bread bowl baked with pasta inside, and the \"Lava Crunch Cake\" dessert, a crunchy chocolate shell filled with warm fudge. Domino's promoted the dessert by flying in 1,000 cakes to deliver at Hoffstadt Bluffs Visitor Center near Mount St. Helens in Washington state. In 2010, shortly after the company's 50th anniversary, Domino's changed its pizza recipe \"from the crust up\", making significant changes in the dough, sauce, and cheese used in their pizzas. Their advertising campaign admitted to earlier problems with the public perception of Domino's product owing to taste issues. In September 2012, Domino's announced it was introducing pan pizza to the menu on September 24, 2012, and the original Deep Dish pizza introduced 23 years prior was discontinued in favor of the new pan pizza. In December 2013, Domino's Pizza Israel unveiled its first vegan pizza, which uses a soy-based cheese substitute supplied by the UK company VBites. Franchises Domino's Pizza, as of September 2018, has locations in the United States (including the District of Columbia, Guam, Puerto Rico, and the United States Virgin Islands), in 83 other countries, including overseas territories such as the Cayman Islands, and states with limited recognition, such as Kosovo and Northern Cyprus. It has its stores in 5,701 cities worldwide (2,900 international and 2,800 in America) In 2016, Domino's opened its 1,000th store in India. As of the first quarter of 2018, Domino's had approximately 15,000 stores, with 5,649 in the United States, 1,232 in India, and 1,094 in the United Kingdom. In most cases, Domino's has master franchise agreements with one company per country, but three companies have acquired multiple master franchise agreements, covering multiple countries: Domino's Pizza Israel was founded in 1990, and opened their first branch in 1993. They are operated by Elgad Pizza. As of August 2014, there are 33 branches throughout the state. There are four kosher franchises. The rights to own, operate, and franchise branches of the chain in Australia, New Zealand, France, Belgium, the Netherlands, Monaco, Luxembourg, Germany, Japan, Malaysia, Singapore, Taiwan and Cambodia are currently owned by Australian Domino's Pizza Enterprises, having bought the master franchises from the parent company in 1993 (Australian and New Zealand franchises). The Australian company also acquired several European and Asian franchises between 2013 and 2022. It acquired the Danish operations in 2019 but liquidated them in 2023. The master franchises for the UK and Ireland were purchased in 1993 by the British publicly listed Domino's Pizza Group (DPG), which acquired the master franchise for Germany in 2011, and Switzerland, Liechtenstein, and Luxembourg in August 2012 by buying the Swiss master franchise holder, with an option to acquire the Austrian master franchise as well. DPG opened its first Swedish location near the Mobilia shopping mall in Malmö in December 2016; three years later, in 2019, they announced that they would be selling all of their current businesses in the country. In Latin America, the first franchise was opened in 1988 in Colombia. During the next years, Domino's Pizza started operations in Mexico, Guatemala (1989), Chile (1991), Venezuela (1992), Dominican Republic (1993), Ecuador and Peru (1995). However, owing to problems in administration and after several cases of unhealthiness, the Domino's Peruvian franchise closed in 2015, and reopened one year later with new owners. The master franchises for India, Nepal, and Sri Lanka are currently owned by the Indian company Jubilant FoodWorks. India is the largest international market for Domino's outside its home market, being the only country to have more than 1,000 Domino's outlets. With the first store opening in Delhi in 1996, the company operates 1,362 stores across 264 Indian cities as of 2018. In Bangladesh, the franchises for Domino's Pizza are co-owned by Jubilant FoodWorks and Golden Harvest Limited, forming 'Domino's Pizza Bangladesh Limited'. In this entity, Jubilant FoodWorks is the majority shareholder and owns 51% of the company, while the rest of the share is owned by Golden Harvest Limited. The first store in Bangladesh opened in February 2019. As of July 27, 2020, Domino's Pizza opened in downtown Zagreb, Croatia. As of 2020, Domino's Pizza opened 550 stores in Turkey. In Italy, Domino's declared bankruptcy closing all its stores. In Russia, DP Eurasia announced that they would be declaring bankruptcy for its Russian business and would be closing all of its locations in Russia, Turkey, Azerbaijan, and Georgia. The Russian network was bought by rapper Timati in August 2023. After the sale, it changed its name to Domиno Pizza. As of November 2022, Domino's Pizza opened in Montevideo, Uruguay, being the franchise's first location in the Southern Cone, and announcing the plan of opening 20 stores in this city in the next five years. In Central Asia, Domino's Pizza opened its first franchise in May 2024 in Tashkent (Uzbekistan). Sales There are currently 6,157 total Domino's units in the United States, and of those 5,815 of those are franchised units. In 2018, the Average Weekly Unit Sales (AWUS) for franchised units was $22,045, showing a consistent increase over the past five years. Per year, this amounts to an average of over a million dollars in sales. Domino's EBITDA was 15.0% for stores making more than $25,000. The vast majority of stores fell under this category, more than 1,500 units. According to Domino's 2019 income statement, their net income was just over $400,000. The initial franchise fee for a Domino's franchise is $10,000, the royalty fee is 5.5% of the store's weekly sales, and the advertising payment is 4% of the store's weekly sales. Advertising In late 1986, Domino's was well known for its advertisements featuring a slapstick character called the Noid, created by Group 243 Inc. who hired Will Vinton Studios to produce the television commercials that featured the character. The character was designed to be the personification of any and all possible unsatisfactory experiences when having pizza delivered; as such, the catchphrase associated with the commercials was \"Avoid the Noid\". The ad campaign gained notoriety, however, in 1989, when a man named Kenneth Lamar Noid, believing the mascot to be an imitation of him, held two Domino's employees hostage in Chamblee, Georgia. The employees escaped while Noid ate a pizza he had ordered. Noid was eventually diagnosed with paranoid schizophrenia and acquitted due to insanity, and later committed suicide in 1995. Contrary to popular belief, Domino's has stated that the retirement of the Noid ad campaign was not a result of the hostage situation. The Noid was briefly brought back for a week in 2011 in an arcade-style game on the Domino's Facebook page. The person with the top score received a coupon for a free pizza. Owing to a glitch on the Domino's website, the company gave away nearly 11,000 free medium pizzas in March 2009. The company had planned the campaign for December 2008 but scrapped the idea and never promoted it. The redemption code to receive the pizzas was never deactivated, however, and resulted in the free giveaway of the pizzas across the United States after someone discovered the promotion on the website by typing in the word \"bailout\" as the redemption code and then shared it with others on the Internet. Domino's deactivated the code on the morning of March 31, 2009, and promised to reimburse store owners for the pizzas. Domino's sponsored CART's Doug Shierson Racing, which was driven by Arie Luyendyk and won the 1990 Indianapolis 500. In 2003, Domino's teamed up with NASCAR for a multi-year partnership to become the \"Official Pizza of NASCAR\". Domino's also sponsored Michael Waltrip Racing and driver David Reutimann during the 2007 season in the NASCAR Sprint Cup Series. In June 2018, Domino's announced that it had started a project to pave over cracks and potholes on roads in the United States called \"Paving for Pizza\" to prevent their pizzas from being ruined, giving cities and towns grants for road repairs. The company had reached an agreement with four cities and towns, including Burbank, California; Bartonville, Texas; Athens, Georgia; and Milford, Delaware, to pave their roads. The paved sections feature the Domino's logo along with the slogan \"OH YES, WE DID\". 30-minute guarantee Beginning in 1973, Domino's Pizza offered a guarantee to customers their pizza would be delivered within 30 minutes of placing an order or they would receive the pizza free. This guarantee was changed to $3 off in 1987. In 1992, the company settled a lawsuit brought by the family of an Indiana woman who had been killed by a speeding Domino's delivery driver, paying the family $2.8 million. In another lawsuit in 1993, a woman who was injured when a Domino's delivery driver ran a red light and collided with her vehicle was awarded nearly $80 million by a jury, but accepted a payout of $15 million. The half-hour guarantee was dropped that year because of the \"public perception of reckless driving and irresponsibility\", according to then-CEO Tom Monaghan. In December 2007, Domino's introduced a new slogan, \"You Got 30 Minutes\", alluding to the earlier pledge, but stopping short of promising delivery in half an hour. The company continues to honor the 30-minute guarantee for orders placed in its stores located in Colombia, Vietnam, Mexico, China, and India. The 30-minute guarantee is subject to the terms and conditions applied in the respective country. Marketing In 2001, Domino's launched a two-year national partnership with the Make-A-Wish Foundation of America. That same year, company stores in New York City and Washington, D.C., provided more than 12,000 pizzas to relief workers following the September 11 attacks on the World Trade Center and The Pentagon. Through a matching funds program, the corporation donated $350,000 to the American Red Cross' disaster relief effort. In 2004, Domino's began a partnership with St. Jude Children's Research Hospital, participating in the hospital's \"Thanks and Giving\" campaign since the campaign began in 2004, and raising $5.2 million in 2014. In 2007, Domino's introduced its Veterans Delivering the Dream franchising program and also rolled out its online and mobile ordering sites. In 2008, Domino's introduced the Pizza Tracker, an online application that allows customers to view the status of their order in a real time progress bar. Since 2005, the voice of Domino's Pizza's US phone ordering service has been Kevin Railsback. In a 2009 survey of consumer taste preferences among national chains by Brand Keys, Domino's was last—tied with Chuck E. Cheese. In December that year, Domino's announced plans to entirely reinvent its pizza. It began a self-critical ad campaign in which consumers were filmed criticizing the then-current pizza's quality and chefs were shown developing a new pizza. The new pizza was unveiled that same month. The following year, 2010 and Domino's 50th anniversary, the company hired J. Patrick Doyle as its new CEO and experienced a 14.3% quarterly gain. In 2011, Domino's launched a billboard advertising in New York's Times Square which displayed real time comments from customers, including good, neutral and bad comments. In 2015, Domino's unveiled a \"pizza car\" that can carry 80 pizzas, sides, two-liter bottles of soda, and dipping sauces. It also has a 140 °F (60 °C) oven on board and is more fuel efficient than a standard delivery car. Officially named the Domino's DXP, the car is a Chevrolet Spark customized by Roush Performance. Once each car reaches 100,000 miles, it will be retired and returned to Roush, where it will be returned to stock form. In 2016, Domino's cooperated with Starship Technologies and applied self-driving robots to deliver pizzas in specific German and Dutch cities. In 2016, Domino's in New Zealand delivered the world's first pizza delivery by unmanned aerial vehicle using the DRU Drone by Flirety. In February 2017, Domino's launched a wedding registry with gifts delivered in the form of Domino's eGift cards. Domino's also worked with Gugu Guru to create a pizza-themed baby registry. Customers have the option of signing up for Domino's pizza package to be served for the event. In June 2019, Domino's announced a partnership with robotics company Nuro. The service is slated to launch in Houston, Texas, with Nuro's custom, self-driving vehicle, R2. In December 2021, the company began offering \"surprise frees,\" or complimentary items as part of a delivery process, of up to $50 million. The move was made to distinguish the company from delivery apps that charged fees. In January 2022, the company announced it would cut back on promotional offers as well as adjust specific menu items in response to inflationary pressures. In September, the company launched an \"Inflation Relief Deal\" that for a limited time offered a 20% discount on online ordering. And in November, Domino's added 800 Chevrolet Bolt cars to the United States fleet of cars."
}