{
  "ticker": "DRI",
  "cik": "0000940944",
  "company_name": "Darden Restaurants",
  "corrected_name": "Darden Restaurants",
  "wiki_title_used": "Darden Restaurants",
  "exists": true,
  "raw_text": "Darden Restaurants, Inc. is an American multi-brand restaurant operator headquartered in Orlando, Florida. Darden has more than 1,800 restaurant locations and more than 175,000 employees, making it the world's largest full-service restaurant company. The company began as an extension of Red Lobster, founded by William Darden and initially backed by General Mills. Red Lobster was later sold in July 2014.\nThe firm owns three fine dining restaurant chains: Ruth's Chris Steak House, Eddie V's Prime Seafood, and The Capital Grille; and seven casual dining restaurant chains: Olive Garden Italian Restaurant, LongHorn Steakhouse, Bahama Breeze, Seasons 52, Yard House, Cheddar's Scratch Kitchen, and Chuy's.\n\nHistory\nWilliam \"Bill\" Darden opened his first restaurant, The Green Frog, in Waycross, Georgia, in 1938 at age 19. He later founded the Red Lobster Inns of America and opened the first Red Lobster restaurant in Lakeland, Florida, in 1968. Red Lobster, which grew quickly, formed the basis of the organization that later became known as Darden Restaurants.\nDarden chose Lakeland to see how a seafood restaurant would fare in a non-coastal region. The initial Red Lobster franchise was lauded by diners and critics alike. The restaurant became successful and, by 1970, had expanded to three locations in the state, with two more under construction. While the locations were profitable, the company needed more resources to expand. As such, Darden sold the company to food giant General Mills that year. After an extended illness, Darden died on March 29, 1994, at the age of 75.\n\nGeneral Mills ownership\nGeneral Mills, a company that makes breakfast cereals, upgraded the chain to a more casual dining/family fare-oriented format, opened a new company headquarters in Orlando, and retained Darden as company manager. In 1975, when Darden was promoted to Vice President of General Mills, Joseph (Joe) R. Lee, the company's first restaurant manager, was promoted to President of Red Lobster. Under General Mills' ownership, Red Lobster expanded into a chain of almost 400 locations by 1985. The company underwent several restructurings and transformed itself from an inexpensive fast-food seller into a chain of casual dining seafood restaurants by 1988.\nOne of the company's first ventures into the diversification of its portfolio was the York Steak House chain of English-themed steak and chop restaurants in the 1970s. The franchised steak and potatoes restaurant was a cafeteria-style restaurant with a salad bar and hot station. By the end of the 1980s, the chain had been mostly closed down, though one independent location still exists. These restaurants were very similar to Ruby Tuesday.\nIn 1982, Darden opened the first Olive Garden concept restaurant in Orlando. The chain became successful, and by 1989 General Mills had opened over 145 restaurants, making the chain the fastest-growing unit in the company's restaurant holdings. While Olive Garden did not meet critical success, it was popular, and its per-restaurant sales soon grew to match those of Red Lobster. The company eventually became the largest chain of Italian-themed full-service restaurants in the United States.\nIn 1990, China Coast was launched as an attempt to create a (U.S.) national casual dining restaurant that featured American Chinese cuisine. While the chain eventually expanded to some 50 restaurants, its sales could have been better, and it lost an estimated US$20 million. By the end of 1995, the restaurants were shuttered and the remaining locations were either converted to Red Lobsters or Olive Gardens or closed altogether.\n\nDarden\nIn 1995, General Mills decided to spin off its restaurant chains to focus on consumer food products. The new company was named Darden Restaurants, after Red Lobster's founder. General Mills stockholders received one share of Darden for every common share of General Mills held. General Mills restaurants had $108 million net income in that year. At the end of 1995, Darden operated 1,250 restaurants in 49 states with 73 locations in Canada.\nDarden Restaurants was spun off from General Mills beginning on May 9, 1995, when it began trading on the when-issued basis at $9.75 a share. The company became a fully separate entity on May 31, 1995, when its shares went on sale on the NYSE. The shares opened at $10.75, 17% below expectations, but climbed to $11.125 by the close of trading.\nDarden executives planned to have two additional chains in place by 1998. In March 1996, Darden launched a test of a Bahama Breeze Caribbean Grille concept featuring food and drinks found in the islands of the Caribbean Sea and a Caribbean theme.\nMarkets were oversaturated with restaurants in 1997, forcing Darden to close 48 poorly performing locations and lose $91 million due to the restructuring. Red Lobster and Olive Garden were given makeovers in 1998. Darden also made a profit of $102 million that year.\nIn 1999, Darden opened an additional location after recovering from the 1996–1997 losses. The company then began testing a new concept called Smokey Bones BBQ Sports Bar, which opened in late 1999 in Orlando. The restaurant is a sports bar concept featuring barbecue and related foodstuffs in an Appalachian mountain lodge setting.\nIn 2003, Seasons 52 was under development to \"provide guests the opportunity to indulge while still eating well.\" Seasons 52 restaurants were only being opened in the Florida or Atlanta markets during its initial phase.\nDarden announced in January 2007 that the company was willing to expand by purchasing existing 100-location chains or even considering franchisors. By May, Darden indicated that its Smokey Bones division would be sold and/or shut down including the two Rocky River Grillhouse, the proposed replacement concept for Smokey Bones. In August, Darden acquired rival Atlanta-based restaurant holder Rare Hospitality for US$1.4 billion, gaining Rare's two chains, The Capital Grille and LongHorn Steakhouse. As part of the Rare acquisition, Darden set up its Specialty Restaurant Group to include Capital Grille, Bahama Breeze, and Seasons 52. In December, Darden announced that it would sell its Smokey Bones chain to Barbeque Integrated, Inc., an affiliate of Sun Capital Partners, Inc., for approximately $80 million. The sale was completed in January 2008.\n\nExpansion and ownership changes\nIn 2010, Seasons 52 started a new expansion phase opening up in 11 more states over the next three years.\nIn January 2011, Darden announced co-locating their Olive Garden and Red Lobster brands in smaller markets to share kitchens but continue separate menus and eating areas. As part of the February Darden analyst conference, an analyst indicated that the corporation may be targeting another restaurant chain for acquisition, possibly BJ's, California Pizza Kitchen or Yard House. In October 2011, Darden acquired two chains, Eddie V's Prime Seafood and Wildfish Seafood Grille, for a $59 million cash transaction, and were placed within its Specialty Restaurant Group, Also in October, Darden signed an area development agreement with Americana Group of Kuwait to develop and operate at least 60 locations using the Red Lobster, Olive Garden and LongHorn Steakhouse concepts.\nIn July 2012, Darden acquired the Yard House 39-location beer-centric chain for $585 million from TSG Consumer Partners. Yard House will be alongside the other upscale restaurants in Darden's Specialty Restaurant Group. On December 23, 2013, Darden's stock rose 3% after activist investor Starboard Value, a hedge fund, took a stake in the company.\n\nRed Lobster sale\nOn December 19, 2013, Darden announced plans to sell or spin off the Red Lobster brand, citing pressure from stock investors. This was in direct response to the company spending US$100 million on a new digital platform. At the time, the project was already at least one year behind schedule and above budget. A large number of layoffs occurred in its marketing department, and the company's second in command also left.\nOn May 12, 2014, Darden announced that as part of the spinoff of Red Lobster, it was converting the co-located Red Lobster and Olive Garden locations into standalone Olive Garden locations. On May 16, 2014, Darden announced that it would be selling the Red Lobster seafood restaurant chain to Golden Gate Capital for US$2.1 billion. Darden announced the completion of the sale of Red Lobster on July 28, 2014.\n\nAcquisitions\nDifferences between Starboard and Darden management soon emerged over the hedge fund's proposal to split the company in two and spin off a third to handle their real estate portfolio, a move Starboard said would greatly boost shareholder value. Matters came to a head when management announced a plan to spin off the underperforming Red Lobster early in 2014. Starboard led a large group of investors in asking management to delay the move and see if better options, such as its plans to revitalize the chain, were available. When management instead decided to sell the chain to private equity firm Golden Gate Capital in May, Starboard and other investors sharply criticized the $2.1 billion \"fire sale\" price as a serious undervaluing of Red Lobster and its assets, such as the underlying real estate. It also claimed management had refused shareholders' requests for a special meeting to discuss the deal.\nClarence Otis, Jr. announced he would be resigning as CEO at the end of 2014, the same day the Red Lobster sale was complete. Management said afterward that it would work on a needed turnaround plan for Olive Garden, which was also struggling. However, after CNBC reported on a leaked document, supposedly offered to potential lenders and buyers earlier in the year, that described Red Lobster's financial position far more optimistically than management had in its contemporary public statements, one of the investors, a union pension fund, filed suit alleging material misrepresentation. Management claimed Golden Gate had prepared the document in consultation with Red Lobster's executives, who could have been expected to have that view of the chain's future. Gene Lee was named permanent CEO on February 23, 2015, after serving as interim CEO in October 2014.\nStarboard assembled its slate of directors to challenge all the sitting board members in the company's upcoming shareholder elections. In support of their candidacy, it released a 294-slide presentation in early September about how the company had gone wrong and how its directors would restore it to health. While it received considerable media attention for its detailed focus on Olive Garden, in particular the chain's \"wasteful\" practice of serving too many of its free unlimited breadsticks at once (to prevent food waste due to staleness: instead of one per customer plus an additional one per table; additional breadsticks are served fresh on demand) and not salting the water it boiled pasta in, to secure a longer warranty on the pots, it also attacked management for spending lavishly on the chain's corporate headquarters while paying the general managers of individual restaurants less than its competitors did. Management responded two days later that it was already implementing many of the suggested changes, and said the free breadsticks merely represented \"Italian generosity.\" Nevertheless, in October, shareholders replaced the entire board with Starboard's slate, in what an observer called an \"epic fail\" for management, since that rarely happens.\nOn March 27, 2017, Darden announced its intent to acquire Cheddar's Scratch Kitchen for $780 million from shareholders such as L Catterton and Oak Investment Partners. On March 28, 2017, when Darden announced that it had acquired Cheddar's Scratch Kitchen and \"lifted its full-year earnings outlook,\" the company became the biggest gainer that day on the S&P 500, with shares growing nearly 9%. The acquisition was completed on April 24, 2017.\nOn May 3, 2023, Darden announced it was acquiring Ruth's Hospitality Group Inc. for $21.50 per share in an all-cash transaction, with an equity value of approximately $715 million. Ruth's Hospitality is the owner and operator of the Ruth's Chris Steak House chain. The acquisition was completed on June 14.\nIn July 2024, Darden agreed to acquire Chuy's. The acquisition was completed on October 11, 2024.\n\nAnimal welfare\nIn 2016, Darden announced an animal welfare policy phasing out the use of battery cage eggs in its U.S. locations by 2018 and crated pork by 2025. Following the announcement, it faced criticism by a coalition of environmental, labor, and animal welfare groups for continuing to source meat and dairy products from animals raised in intensive conditions, including routine antibiotic use. In 2019, Darden stated that it would stop sourcing meat from chickens treated with medically important antibiotics by 2023. In 2022, the Open Wing Alliance criticized Darden for failing to make sufficient progress on its cage-free egg commitment, after which Darden expanded its commitment to include all international locations by 2027.\n\nUnits\nCheddar's Scratch Kitchen\nChuy's\nDarden Corporation\nDarden's Specialty Restaurant Group\nYard House\nThe Capital Grille\nSeasons 52\nBahama Breeze\nEddie V's Prime Seafood\nGMRI, Inc.\nRARE Hospitality International, Inc.\nRARE Hospitality Management, Inc.\nLongHorn Steakhouse\nOlive Garden\nRuth's Hospitality Group Inc. (Ruth's Chris Steak House)\n\nSee also\nList of restaurant chains\nList of food companies\nList of casual dining restaurant chains\nList of S&P 500 companies\nCompanies listed on the New York Stock Exchange (D)\nList of Florida companies\nList of Orlando companies\nList of Michigan companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for Darden Restaurants, Inc.:",
  "clean_text": "Darden Restaurants, Inc. is an American multi-brand restaurant operator headquartered in Orlando, Florida. Darden has more than 1,800 restaurant locations and more than 175,000 employees, making it the world's largest full-service restaurant company. The company began as an extension of Red Lobster, founded by William Darden and initially backed by General Mills. Red Lobster was later sold in July 2014. The firm owns three fine dining restaurant chains: Ruth's Chris Steak House, Eddie V's Prime Seafood, and The Capital Grille; and seven casual dining restaurant chains: Olive Garden Italian Restaurant, LongHorn Steakhouse, Bahama Breeze, Seasons 52, Yard House, Cheddar's Scratch Kitchen, and Chuy's. History William \"Bill\" Darden opened his first restaurant, The Green Frog, in Waycross, Georgia, in 1938 at age 19. He later founded the Red Lobster Inns of America and opened the first Red Lobster restaurant in Lakeland, Florida, in 1968. Red Lobster, which grew quickly, formed the basis of the organization that later became known as Darden Restaurants. Darden chose Lakeland to see how a seafood restaurant would fare in a non-coastal region. The initial Red Lobster franchise was lauded by diners and critics alike. The restaurant became successful and, by 1970, had expanded to three locations in the state, with two more under construction. While the locations were profitable, the company needed more resources to expand. As such, Darden sold the company to food giant General Mills that year. After an extended illness, Darden died on March 29, 1994, at the age of 75. General Mills ownership General Mills, a company that makes breakfast cereals, upgraded the chain to a more casual dining/family fare-oriented format, opened a new company headquarters in Orlando, and retained Darden as company manager. In 1975, when Darden was promoted to Vice President of General Mills, Joseph (Joe) R. Lee, the company's first restaurant manager, was promoted to President of Red Lobster. Under General Mills' ownership, Red Lobster expanded into a chain of almost 400 locations by 1985. The company underwent several restructurings and transformed itself from an inexpensive fast-food seller into a chain of casual dining seafood restaurants by 1988. One of the company's first ventures into the diversification of its portfolio was the York Steak House chain of English-themed steak and chop restaurants in the 1970s. The franchised steak and potatoes restaurant was a cafeteria-style restaurant with a salad bar and hot station. By the end of the 1980s, the chain had been mostly closed down, though one independent location still exists. These restaurants were very similar to Ruby Tuesday. In 1982, Darden opened the first Olive Garden concept restaurant in Orlando. The chain became successful, and by 1989 General Mills had opened over 145 restaurants, making the chain the fastest-growing unit in the company's restaurant holdings. While Olive Garden did not meet critical success, it was popular, and its per-restaurant sales soon grew to match those of Red Lobster. The company eventually became the largest chain of Italian-themed full-service restaurants in the United States. In 1990, China Coast was launched as an attempt to create a (U.S.) national casual dining restaurant that featured American Chinese cuisine. While the chain eventually expanded to some 50 restaurants, its sales could have been better, and it lost an estimated US$20 million. By the end of 1995, the restaurants were shuttered and the remaining locations were either converted to Red Lobsters or Olive Gardens or closed altogether. Darden In 1995, General Mills decided to spin off its restaurant chains to focus on consumer food products. The new company was named Darden Restaurants, after Red Lobster's founder. General Mills stockholders received one share of Darden for every common share of General Mills held. General Mills restaurants had $108 million net income in that year. At the end of 1995, Darden operated 1,250 restaurants in 49 states with 73 locations in Canada. Darden Restaurants was spun off from General Mills beginning on May 9, 1995, when it began trading on the when-issued basis at $9.75 a share. The company became a fully separate entity on May 31, 1995, when its shares went on sale on the NYSE. The shares opened at $10.75, 17% below expectations, but climbed to $11.125 by the close of trading. Darden executives planned to have two additional chains in place by 1998. In March 1996, Darden launched a test of a Bahama Breeze Caribbean Grille concept featuring food and drinks found in the islands of the Caribbean Sea and a Caribbean theme. Markets were oversaturated with restaurants in 1997, forcing Darden to close 48 poorly performing locations and lose $91 million due to the restructuring. Red Lobster and Olive Garden were given makeovers in 1998. Darden also made a profit of $102 million that year. In 1999, Darden opened an additional location after recovering from the 1996–1997 losses. The company then began testing a new concept called Smokey Bones BBQ Sports Bar, which opened in late 1999 in Orlando. The restaurant is a sports bar concept featuring barbecue and related foodstuffs in an Appalachian mountain lodge setting. In 2003, Seasons 52 was under development to \"provide guests the opportunity to indulge while still eating well.\" Seasons 52 restaurants were only being opened in the Florida or Atlanta markets during its initial phase. Darden announced in January 2007 that the company was willing to expand by purchasing existing 100-location chains or even considering franchisors. By May, Darden indicated that its Smokey Bones division would be sold and/or shut down including the two Rocky River Grillhouse, the proposed replacement concept for Smokey Bones. In August, Darden acquired rival Atlanta-based restaurant holder Rare Hospitality for US$1.4 billion, gaining Rare's two chains, The Capital Grille and LongHorn Steakhouse. As part of the Rare acquisition, Darden set up its Specialty Restaurant Group to include Capital Grille, Bahama Breeze, and Seasons 52. In December, Darden announced that it would sell its Smokey Bones chain to Barbeque Integrated, Inc., an affiliate of Sun Capital Partners, Inc., for approximately $80 million. The sale was completed in January 2008. Expansion and ownership changes In 2010, Seasons 52 started a new expansion phase opening up in 11 more states over the next three years. In January 2011, Darden announced co-locating their Olive Garden and Red Lobster brands in smaller markets to share kitchens but continue separate menus and eating areas. As part of the February Darden analyst conference, an analyst indicated that the corporation may be targeting another restaurant chain for acquisition, possibly BJ's, California Pizza Kitchen or Yard House. In October 2011, Darden acquired two chains, Eddie V's Prime Seafood and Wildfish Seafood Grille, for a $59 million cash transaction, and were placed within its Specialty Restaurant Group, Also in October, Darden signed an area development agreement with Americana Group of Kuwait to develop and operate at least 60 locations using the Red Lobster, Olive Garden and LongHorn Steakhouse concepts. In July 2012, Darden acquired the Yard House 39-location beer-centric chain for $585 million from TSG Consumer Partners. Yard House will be alongside the other upscale restaurants in Darden's Specialty Restaurant Group. On December 23, 2013, Darden's stock rose 3% after activist investor Starboard Value, a hedge fund, took a stake in the company. Red Lobster sale On December 19, 2013, Darden announced plans to sell or spin off the Red Lobster brand, citing pressure from stock investors. This was in direct response to the company spending US$100 million on a new digital platform. At the time, the project was already at least one year behind schedule and above budget. A large number of layoffs occurred in its marketing department, and the company's second in command also left. On May 12, 2014, Darden announced that as part of the spinoff of Red Lobster, it was converting the co-located Red Lobster and Olive Garden locations into standalone Olive Garden locations. On May 16, 2014, Darden announced that it would be selling the Red Lobster seafood restaurant chain to Golden Gate Capital for US$2.1 billion. Darden announced the completion of the sale of Red Lobster on July 28, 2014. Acquisitions Differences between Starboard and Darden management soon emerged over the hedge fund's proposal to split the company in two and spin off a third to handle their real estate portfolio, a move Starboard said would greatly boost shareholder value. Matters came to a head when management announced a plan to spin off the underperforming Red Lobster early in 2014. Starboard led a large group of investors in asking management to delay the move and see if better options, such as its plans to revitalize the chain, were available. When management instead decided to sell the chain to private equity firm Golden Gate Capital in May, Starboard and other investors sharply criticized the $2.1 billion \"fire sale\" price as a serious undervaluing of Red Lobster and its assets, such as the underlying real estate. It also claimed management had refused shareholders' requests for a special meeting to discuss the deal. Clarence Otis, Jr. announced he would be resigning as CEO at the end of 2014, the same day the Red Lobster sale was complete. Management said afterward that it would work on a needed turnaround plan for Olive Garden, which was also struggling. However, after CNBC reported on a leaked document, supposedly offered to potential lenders and buyers earlier in the year, that described Red Lobster's financial position far more optimistically than management had in its contemporary public statements, one of the investors, a union pension fund, filed suit alleging material misrepresentation. Management claimed Golden Gate had prepared the document in consultation with Red Lobster's executives, who could have been expected to have that view of the chain's future. Gene Lee was named permanent CEO on February 23, 2015, after serving as interim CEO in October 2014. Starboard assembled its slate of directors to challenge all the sitting board members in the company's upcoming shareholder elections. In support of their candidacy, it released a 294-slide presentation in early September about how the company had gone wrong and how its directors would restore it to health. While it received considerable media attention for its detailed focus on Olive Garden, in particular the chain's \"wasteful\" practice of serving too many of its free unlimited breadsticks at once (to prevent food waste due to staleness: instead of one per customer plus an additional one per table; additional breadsticks are served fresh on demand) and not salting the water it boiled pasta in, to secure a longer warranty on the pots, it also attacked management for spending lavishly on the chain's corporate headquarters while paying the general managers of individual restaurants less than its competitors did. Management responded two days later that it was already implementing many of the suggested changes, and said the free breadsticks merely represented \"Italian generosity.\" Nevertheless, in October, shareholders replaced the entire board with Starboard's slate, in what an observer called an \"epic fail\" for management, since that rarely happens. On March 27, 2017, Darden announced its intent to acquire Cheddar's Scratch Kitchen for $780 million from shareholders such as L Catterton and Oak Investment Partners. On March 28, 2017, when Darden announced that it had acquired Cheddar's Scratch Kitchen and \"lifted its full-year earnings outlook,\" the company became the biggest gainer that day on the S&P 500, with shares growing nearly 9%. The acquisition was completed on April 24, 2017. On May 3, 2023, Darden announced it was acquiring Ruth's Hospitality Group Inc. for $21.50 per share in an all-cash transaction, with an equity value of approximately $715 million. Ruth's Hospitality is the owner and operator of the Ruth's Chris Steak House chain. The acquisition was completed on June 14. In July 2024, Darden agreed to acquire Chuy's. The acquisition was completed on October 11, 2024. Animal welfare In 2016, Darden announced an animal welfare policy phasing out the use of battery cage eggs in its U.S. locations by 2018 and crated pork by 2025. Following the announcement, it faced criticism by a coalition of environmental, labor, and animal welfare groups for continuing to source meat and dairy products from animals raised in intensive conditions, including routine antibiotic use. In 2019, Darden stated that it would stop sourcing meat from chickens treated with medically important antibiotics by 2023. In 2022, the Open Wing Alliance criticized Darden for failing to make sufficient progress on its cage-free egg commitment, after which Darden expanded its commitment to include all international locations by 2027. Units Cheddar's Scratch Kitchen Chuy's Darden Corporation Darden's Specialty Restaurant Group Yard House The Capital Grille Seasons 52 Bahama Breeze Eddie V's Prime Seafood GMRI, Inc. RARE Hospitality International, Inc. RARE Hospitality Management, Inc. LongHorn Steakhouse Olive Garden Ruth's Hospitality Group Inc. (Ruth's Chris Steak House)"
}