{
  "ticker": "DTE",
  "cik": "0000936340",
  "company_name": "DTE Energy",
  "corrected_name": "DTE Energy",
  "wiki_title_used": "DTE Energy",
  "exists": true,
  "raw_text": "DTE Energy (formerly Detroit Edison until 1996) is a Detroit-based diversified energy company involved in the development and management of energy-related businesses and services in the United States and Canada. Its operating units include an electric utility serving 2.2 million customers and a natural gas utility serving 1.3 million customers in Michigan.\nDTE is a national and international corporation.\nThe DTE Energy portfolio includes non-utility energy businesses focused on power and industrial projects, energy marketing and trading.\nAs of 2022, 54.16% of DTE's electricity was generated from coal, 18.16% from nuclear, 14.22% from natural gas and 13.11% from renewable energy including wind, solar and hydroelectric.\n\nHistory\nEarly 1900s\nDTE's earliest direct corporate ancestor, the Edison Illuminating Company of Detroit, was founded in 1886. By the turn of the century, it split responsibility for commercial electric power in the fast-growing city of Detroit with the Peninsular Electric Light Company; the latter company controlled the city's electric distribution network. \nIn 1903, the two companies merged as the Detroit Edison Company, which began trading on January 17. That same year, construction began on the Delray 1 Power Plant, and Henry Ford, who had left Edison Illuminating four years earlier, founded Ford Motor Company.\nDTE's gas operations trace their roots to 1849, when the City of Detroit Gas Company began operation with Philadelphia engineer Lemuel Davis as its first president. The company installed Detroit's first gas lamps two years later, by which time it had changed its name to Detroit Gas Light Company. In 1903, the Detroit Gas Co. was renamed the Detroit City Gas Co. It secured franchises for Highland Park and Hamtramck and increased its customer base to more than 67,000.\nIn 1904, Detroit Edison signed its first power contract with an automobile company — the Cadillac Motor Car Co.\nIn 1905, a majority of the Detroit City Gas Co. was acquired by the American Light & Traction Co., a holding company that controlled utility and transportation interests stretching from Grand Rapids to Milwaukee.\nWith the added demand for electricity, the Delray 2 Power Plant was added in 1908.\nIn 1913, Detroit City Gas acquired additional service territory that included the communities of River Rouge, Wyandotte, Dearborn, Ecorse and Trenton.\n\n1920s\nBetween 1924 and 1929, Detroit Edison increased its production capacity by building the Marysville, Trenton Channel and Delray 3 power plants.\n\n1930s\nIn 1937, Detroit City Gas Company merged with Grand Rapids Gas Light Company, Washtenaw Gas Company and Ann Arbor Gas Company to form Michigan Consolidated Gas Company (MichCon). The merger, approved in 1938 by state and federal regulators, created one gas provider for most of the southern half of the Lower Peninsula.\n\n1940s\nTo meet the increasing demand for natural gas, the Michigan-Wisconsin Pipeline was completed in 1945.\nIn 1949, Michigan Consolidated Gas, the Milwaukee Gas Co., the Michigan-Wisconsin Gas Co., the Austin Field Pipeline Co. and the Milwaukee Solvay Co. became the American Natural Gas Co.\n\n1950s\nDetroit Edison added the St. Clair Power Plant in 1954 — one of the largest power plants in the world at the time.\nIn 1956, Detroit Edison broke ground for the Enrico Fermi Power Plant and also began work on the River Rouge Power Plant.\n\n1970s\nThis era marked another construction phase that included the start of the Fermi 2 nuclear plant in 1970 and Monroe Power Plant Units 1-4, which came online from 1971-74.\nConstruction also began in 1972 on the Greenwood Energy Center — the company's first inland plant designed for both oil - and nuclear-fueled generating units.\nThe Ludington Pumped Storage Plant, co-owned by Detroit Edison and Consumers Power Company, also went into service in 1973.\nDetroit Edison was the subject of a long-running legal dispute about discrimination against black employees, led by the Association for the Betterment of Black Edison Employees. Edison agreed to pay $4.25 million in damages.\n\n1980s\nMichCon became a wholly owned subsidiary of Primark Corp in 1981. In 1988, Primark spun-off MichCon, and the MCN Corp. was established as the parent company of MichCon.\nIn 1983, Detroit Edison sought to sell its engineering expertise through the creation of Utility Technical Services, later called SYNDECO — Detroit Edison's first subsidiary business.\nSupporting the new marketing push and increasing customer demand were Belle River Units 1 and 2, which went online in 1984 and 1985.\nIn 1986, the Detroit Edison Foundation was formed to manage the company's charitable giving programs and volunteer efforts that had grown over the years.\nThe Fermi 2 unit was licensed and went online in 1988. The company also founded what is now DTE Biomass Energy to begin collecting methane gas from landfills for use in energy production.\n\n1990s\nIn January 1996, Detroit Edison reorganized as a holding company — DTE Energy. “DTE” was selected because it was the existing stock ticker symbol for Detroit Edison.\n\n2000s\nOn May 31, 2001 DTE Energy and MCN Energy Group completed a merger which created Michigan's largest energy company and a premier regional energy provider. MichCon became an operating company of DTE Energy.\nIn 2007, DTE Energy began acquiring wind development rights on more than 100,000 acres of land in the Thumb area. The first DTE Energy-owned and constructed wind parks were commissioned (connected to the grid and generating power) in December 2012. Two of these wind parks are located in Huron County and one in Sanilac County.\n\n2010s\nIn 2013, DTE Energy adopted \"DTE\" as its customer-facing brand. Accordingly, Detroit Edison Company changed its name to DTE Electric Company, while Michigan Consolidated Gas changed its name to DTE Gas.\n\n2020s\nOn October 27, 2020, DTE announced its plan to spin off DTE Midstream into an independent, publicly traded business called DT Midstream. On July 1, 2021, DT Midstream successfully spun off.\nAccording to a statement released by the White House on Nov 18, 2021, DTE Energy participated in the American Rescue Plan by committing to help customers during the COVID-19 pandemic, by proactively using resources.\nOn January 16, 2025, DTE Gas and DTE Electric received a total of $8.81 billion in conditional commitments for loan guarantees through the US Department of Energy's Loan Programs Office that would be used to install thousands of megawatts of renewable energy generation and storage.\n\nOperations\nUtility\nDTE Electric\nDTE Electric Company is a state-regulated electric utility serving 2.3 million residential and business customers throughout Southeast Michigan and the thumb region.\nDTE Electric's power generation portfolio includes renewable energy and Nuclear power, but is primarily generated by fossil fuels. In 2020, 32.62% came from renewable and nuclear generation while 67.13% of electricity generated by DTE came from coal, gas, and oil.\n\nDTE Gas\nDTE Gas is a state-regulated natural gas provider to 1.3 million residential, commercial and industrial customers throughout Michigan.\n\nNon-Utility\nDTE Vantage\nThe group began by building upon Detroit Edison's (now DTE Electric) existing capabilities and customer relationships to develop non-regulated (non-utility) projects within Michigan. Since then, the business has expanded its geographic reach and broadened its products and services to a nationwide customer base.\nDTE Vantage now encompasses 74 projects in 15 states with a focus on three main business lines: Industrial Energy Services, Renewable Energy and Environmental Controls.\nDTE Biomass Energy operates as an independent subsidiary of DTE Vantage.\n\nDTE Energy Trading\nDTE Energy Trading is an active physical and financial gas, power and environmental marketing company operating in Detroit, Michigan.\n\nSee also\nEnrico Fermi Nuclear Generating Station\nMonroe Power Plant\nMarysville Power Plant\nSt. Clair Power Plant\nBelle River Power Plant\nAmerican Light and Traction\nDTE Energy Music Theatre\n\nReferences\nExternal links\nOfficial website\nDTE Energy Power and Renewables:\nDTE Biomass Energy.\nCredit Reporting Article.\nDTE Energy turns Clean Energy Prize into start-up opportunities\nBusiness data for DTE Energy Company:",
  "clean_text": "DTE Energy (formerly Detroit Edison until 1996) is a Detroit-based diversified energy company involved in the development and management of energy-related businesses and services in the United States and Canada. Its operating units include an electric utility serving 2.2 million customers and a natural gas utility serving 1.3 million customers in Michigan. DTE is a national and international corporation. The DTE Energy portfolio includes non-utility energy businesses focused on power and industrial projects, energy marketing and trading. As of 2022, 54.16% of DTE's electricity was generated from coal, 18.16% from nuclear, 14.22% from natural gas and 13.11% from renewable energy including wind, solar and hydroelectric. History Early 1900s DTE's earliest direct corporate ancestor, the Edison Illuminating Company of Detroit, was founded in 1886. By the turn of the century, it split responsibility for commercial electric power in the fast-growing city of Detroit with the Peninsular Electric Light Company; the latter company controlled the city's electric distribution network. In 1903, the two companies merged as the Detroit Edison Company, which began trading on January 17. That same year, construction began on the Delray 1 Power Plant, and Henry Ford, who had left Edison Illuminating four years earlier, founded Ford Motor Company. DTE's gas operations trace their roots to 1849, when the City of Detroit Gas Company began operation with Philadelphia engineer Lemuel Davis as its first president. The company installed Detroit's first gas lamps two years later, by which time it had changed its name to Detroit Gas Light Company. In 1903, the Detroit Gas Co. was renamed the Detroit City Gas Co. It secured franchises for Highland Park and Hamtramck and increased its customer base to more than 67,000. In 1904, Detroit Edison signed its first power contract with an automobile company — the Cadillac Motor Car Co. In 1905, a majority of the Detroit City Gas Co. was acquired by the American Light & Traction Co., a holding company that controlled utility and transportation interests stretching from Grand Rapids to Milwaukee. With the added demand for electricity, the Delray 2 Power Plant was added in 1908. In 1913, Detroit City Gas acquired additional service territory that included the communities of River Rouge, Wyandotte, Dearborn, Ecorse and Trenton. 1920s Between 1924 and 1929, Detroit Edison increased its production capacity by building the Marysville, Trenton Channel and Delray 3 power plants. 1930s In 1937, Detroit City Gas Company merged with Grand Rapids Gas Light Company, Washtenaw Gas Company and Ann Arbor Gas Company to form Michigan Consolidated Gas Company (MichCon). The merger, approved in 1938 by state and federal regulators, created one gas provider for most of the southern half of the Lower Peninsula. 1940s To meet the increasing demand for natural gas, the Michigan-Wisconsin Pipeline was completed in 1945. In 1949, Michigan Consolidated Gas, the Milwaukee Gas Co., the Michigan-Wisconsin Gas Co., the Austin Field Pipeline Co. and the Milwaukee Solvay Co. became the American Natural Gas Co. 1950s Detroit Edison added the St. Clair Power Plant in 1954 — one of the largest power plants in the world at the time. In 1956, Detroit Edison broke ground for the Enrico Fermi Power Plant and also began work on the River Rouge Power Plant. 1970s This era marked another construction phase that included the start of the Fermi 2 nuclear plant in 1970 and Monroe Power Plant Units 1-4, which came online from 1971-74. Construction also began in 1972 on the Greenwood Energy Center — the company's first inland plant designed for both oil - and nuclear-fueled generating units. The Ludington Pumped Storage Plant, co-owned by Detroit Edison and Consumers Power Company, also went into service in 1973. Detroit Edison was the subject of a long-running legal dispute about discrimination against black employees, led by the Association for the Betterment of Black Edison Employees. Edison agreed to pay $4.25 million in damages. 1980s MichCon became a wholly owned subsidiary of Primark Corp in 1981. In 1988, Primark spun-off MichCon, and the MCN Corp. was established as the parent company of MichCon. In 1983, Detroit Edison sought to sell its engineering expertise through the creation of Utility Technical Services, later called SYNDECO — Detroit Edison's first subsidiary business. Supporting the new marketing push and increasing customer demand were Belle River Units 1 and 2, which went online in 1984 and 1985. In 1986, the Detroit Edison Foundation was formed to manage the company's charitable giving programs and volunteer efforts that had grown over the years. The Fermi 2 unit was licensed and went online in 1988. The company also founded what is now DTE Biomass Energy to begin collecting methane gas from landfills for use in energy production. 1990s In January 1996, Detroit Edison reorganized as a holding company — DTE Energy. “DTE” was selected because it was the existing stock ticker symbol for Detroit Edison. 2000s On May 31, 2001 DTE Energy and MCN Energy Group completed a merger which created Michigan's largest energy company and a premier regional energy provider. MichCon became an operating company of DTE Energy. In 2007, DTE Energy began acquiring wind development rights on more than 100,000 acres of land in the Thumb area. The first DTE Energy-owned and constructed wind parks were commissioned (connected to the grid and generating power) in December 2012. Two of these wind parks are located in Huron County and one in Sanilac County. 2010s In 2013, DTE Energy adopted \"DTE\" as its customer-facing brand. Accordingly, Detroit Edison Company changed its name to DTE Electric Company, while Michigan Consolidated Gas changed its name to DTE Gas. 2020s On October 27, 2020, DTE announced its plan to spin off DTE Midstream into an independent, publicly traded business called DT Midstream. On July 1, 2021, DT Midstream successfully spun off. According to a statement released by the White House on Nov 18, 2021, DTE Energy participated in the American Rescue Plan by committing to help customers during the COVID-19 pandemic, by proactively using resources. On January 16, 2025, DTE Gas and DTE Electric received a total of $8.81 billion in conditional commitments for loan guarantees through the US Department of Energy's Loan Programs Office that would be used to install thousands of megawatts of renewable energy generation and storage. Operations Utility DTE Electric DTE Electric Company is a state-regulated electric utility serving 2.3 million residential and business customers throughout Southeast Michigan and the thumb region. DTE Electric's power generation portfolio includes renewable energy and Nuclear power, but is primarily generated by fossil fuels. In 2020, 32.62% came from renewable and nuclear generation while 67.13% of electricity generated by DTE came from coal, gas, and oil. DTE Gas DTE Gas is a state-regulated natural gas provider to 1.3 million residential, commercial and industrial customers throughout Michigan. Non-Utility DTE Vantage The group began by building upon Detroit Edison's (now DTE Electric) existing capabilities and customer relationships to develop non-regulated (non-utility) projects within Michigan. Since then, the business has expanded its geographic reach and broadened its products and services to a nationwide customer base. DTE Vantage now encompasses 74 projects in 15 states with a focus on three main business lines: Industrial Energy Services, Renewable Energy and Environmental Controls. DTE Biomass Energy operates as an independent subsidiary of DTE Vantage. DTE Energy Trading DTE Energy Trading is an active physical and financial gas, power and environmental marketing company operating in Detroit, Michigan."
}