{
  "ticker": "DUK",
  "cik": "0001326160",
  "company_name": "Duke Energy",
  "corrected_name": "Duke Energy",
  "wiki_title_used": "Duke Energy",
  "exists": true,
  "raw_text": "Duke Energy Corporation is an American electric power and natural gas holding company headquartered in Charlotte, North Carolina. The company serves over 7 million customers in the eastern United States. In 2024 it ranked as the 141st largest company in the United States – its highest-ever placement on the Fortune 500 list.\n\nOverview\nDuke Energy is based in Charlotte, North Carolina. It owns 58,200 megawatts of base-load and peak generation in the United States, which it distributes to its 7.2 million customers. It has approximately 29,000 employees. Duke Energy's service territory covers 104,000 square miles (270,000 km2) with 250,200 miles (402,700 km) of distribution lines. Almost all of Duke Energy's Midwest generation comes from coal, natural gas, or oil, while half of its Carolinas generation comes from its nuclear power plants. During 2006, Duke Energy generated 148,798,332 megawatt-hours of electrical energy.\nDuke Energy Renewable Services (DERS), a subsidiary of Duke Energy, specializes in the development, ownership, and operation of various generation facilities throughout the United States. This segment of the company operates 1,700 megawatts of generation. 240 megawatts of wind generation were under construction and 1,500 additional megawatts of wind generation were in planning stages. On September 9, 2008, DERS updated its projections for future wind power capacity. By the end of 2008, it would have over 500 MW of nameplate capacity of wind power online, and an additional 5,000 MW in development.\n\nSubsidiaries\nDuke Energy Carolinas (formerly Duke Power)\nDuke Energy Ohio (formerly Cincinnati Gas & Electric Company, via Cinergy)\nDuke Energy Kentucky (formerly Union Light, Heat & Power, via Cinergy)\nDuke Energy Indiana (formerly Public Service Indiana, via Cinergy)\nDuke Energy Florida (formerly Florida Power Corporation, via Progress Energy)\nDuke Energy Progress (formerly Carolina Power and Light, via Progress Energy)\nDuke Energy Renewables\nDuke Energy Retail\nDuke Energy International\nDuke Energy Sustainable Solutions\nDuke Energy One\nPiedmont Natural Gas\n\nHistory\nThe company began in 1900 as the Catawba Power Company when Walker Gill Wylie and his brother financed the building of a hydroelectric power station at India Hook Shoals along the Catawba River near India Hook, South Carolina. When Wylie needed additional funding to further his ambitious plan for construction of a series of hydroelectric power plants, Wylie convinced James B. Duke and his partner James Blaney to invest in the Southern Power Company, founded in 1905.\nIn 1917 James Blaney was the founder of the Wateree Power Company that was formed as a holding company for several utilities that had been founded and/or owned by Duke, and Blaney his associates, and in 1924 the name was changed to Duke Power. In 1927, most of the subsidiary companies, including Southern Power Company, Catawba Power Company, Great Falls Power Company, and Western Carolina Power Company were merged into Duke Power, although Southern Public Utilities, 100% owned by Duke Power, maintained a legally separate existence for the retail marketing of Duke-generated power to residential and commercial customers. Southern Public Utilities also operated transit systems, which Duke eventually converted from streetcars to buses.\nIn 1973, through its subsidiary, the Eastover Mining Company, Duke Power engaged in a lengthy contract dispute with the workers at the Brookside coal mine in Harlan County, Kentucky. For thirteen months, workers picketed the company for improved medical benefits and the right to representation by the United Mine Workers of America, while Duke Power insisted on a no-strike clause in the miner's eventual labor contract. The strike culminated in the shooting and death of twenty-two year old miner, Lawrence D. Jones, by a foreman at the Duke Power-owned mine. Five days later, Duke Power would reach an agreement with the striking miners which included recognition of the new UMWA local, the rehiring of workers dismissed during the strike, and dropping charges related to the action.\nIn 1988, Nantahala Power & Light Co., which served southwestern North Carolina, was purchased by Duke from Alcoa. For many years, it was operated as a separate division of Duke Power, operating under the Duke Power Nantahala Area brand. All former Nantahala operations now operate as  Duke Energy Carolinas, although the former Nantahala hydroelectric dams operating in the area are operated as the Nantahala Region for regulatory and permitting purposes. The purchase of Nantahala gave Duke Power, and subsequently Duke Energy, its first and only interconnection with the TVA.   \nIn 1990, Duke sold its remaining transit operations. Duke Power merged with PanEnergy, a natural gas company, in 1997 to form Duke Energy. The Duke Power name continued as the electric utility business of Duke Energy until the Cinergy merger.\n\nWith the purchase of Cinergy Corporation announced in 2005 and completed on April 3, 2006, Duke Energy Corporation's customer base grew to include the Midwestern United States as well. The company operates nuclear power plants, coal-fired plants, conventional hydroelectric plants, natural-gas turbines to handle peak demand, and pumped hydro storage. During 2006, Duke Energy also acquired Chatham, Ontario-based Union Gas, which is regulated under the Ontario Energy Board Act (1998).\nOn January 3, 2007, Duke Energy spun off its gas business to form Spectra Energy. Duke Energy shareholders received 1 share of Spectra Energy for each 2 shares of Duke Energy. After the spin-off, Duke Energy now receives the majority of its revenue from its electric operations in portions of North Carolina, South Carolina, Kentucky, Ohio, and Indiana. The spinoff to Spectra also included Union Gas, which Duke Energy acquired the previous year.\nIn 2011, Duke Energy worked with Charlotte's business leader community to help build Charlotte into a smart city. The group called the initiative \"Envision Charlotte\". At the time, the group decided on a goal to reduce energy use in the \"urban core of the city by 20 percent\". To do so, the group focused on making energy consumption changes to commercial buildings larger than 10,000 square feet.\nOn July 3, 2012, Duke Energy merged with Progress Energy Inc with the Duke Energy name retained along with the Charlotte, North Carolina, headquarters.\nDuke announced on June 18, 2013, that CEO Jim Rogers was retiring and Lynn Good would become the new CEO. Rogers has been CEO and Chairman since 2006, while Good was Chief Financial Officer of Duke since 2009, having joined Duke in the 2006 Cinergy merger. Rogers' retirement was part of an agreement to end an investigation into Duke's Progress Energy acquisition in 2012.\nIn 2016, Duke Energy purchased Piedmont Natural Gas for $4.9 billion to become its wholly owned subsidiary.  Duke Energy completed selling its remaining power operations in Central and South America for $1.2 billion months afterwards.  At one point Duke Energy had more than 4,300 megawatts of electric generation in Latin America. It operated eight hydroelectric power plants in Brazil with an installed capacity of 2,307 megawatts.\nThe company expects to spend $13 billion upgrading the North Carolina grid from 2017.\nIn 2018, Jessee Pound of CNBC wrote that Duke was one of many larger American companies which \"paid an effective federal tax rate of 0% or less\", which the Institute on Taxation and Economic Policy claimed was a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. A response from Duke to a similar claim from the Institute of Policy Studies 2024 stated: \"Duke Energy has a deferred tax balance – this does not mean Duke Energy is not paying these taxes, it means that our taxes are due in future years, and we will pay them.\"\nOn December 3, 2022, an attack was carried out on two Duke Energy substations located in Moore County, North Carolina. Damage from the attack left up to 40,000 residents without electrical power for several days, with officials closing schools and declaring a state of emergency. No suspect was ever identified, but the Federal Bureau of Investigation supported local investigators in case the incident met the definition of domestic terrorism under the Patriot Act.\n\nProposed nuclear plant\nOn March 16, 2006, Duke Power announced that a Cherokee County, South Carolina site had been selected for a potential new nuclear power plant. The site is jointly owned by Duke Power and Southern Company. Duke planned to develop the site for two Westinghouse Electric Company AP1000 (advanced passive) pressurized water reactors. Each reactor would have been capable of producing approximately 1,117 megawatts. (See Nuclear Power 2010 Program.)\nOn December 14, 2007, Duke Power submitted a Combined Construction and Operating License to the Nuclear Regulatory Commission, with an announcement that it will spend $160 million in 2008 on the plant with a total cost of $5 billion to $6 billion. The plant was approved in 2016.\nIn August 2017, Duke decided to seek permission from the North Carolina Utility Commission to cancel the project due to the bankruptcy of Westinghouse and \"other market activity\", although they retained the option of restarting the project at some point in the future if circumstances change.\nThis site would have been adjacent to the old site, which was never completed and abandoned in the early 1980s, and used by James Cameron as a film set for the 1989 movie The Abyss.\nIn 2018, Duke Energy announced that they had decided not to include new nuclear power in their long-range plans.\n\nHeadquarters buildings\nJ.A. Jones designed the first headquarters building, known as the Power Building, which was completed in 1927 at 440 South Church. It was five stories and 503,000 square feet (46,700 m2). The Electric Center at 526 South Church Street opened in 1975 with an addition in 1988. State Farm Insurance sold the Power Building in 2004 for $8 million to The Dilweg Cos., who anticipated significant development. Novare Group bought 5.13 acres (20,800 m2) at 408 South Church Street for $17 million from The Dilweg Cos. in a deal announced March 27, 2006.  The Power Building was demolished February 24, 2007.\nDuke Energy Center at 550 South Tryon Street was announced as the company's headquarters in 2009. The company announced May 17, 2021 that the headquarters will move in 2023 to Duke Energy Plaza, across the street from the current headquarters. Childress Klein is developing the new building, which will allow Duke to sell its Church Street and College Street buildings, and end its lease at 400 South Tryon. Previously named Charlotte Metro Tower, the 40-story building will be purchased when completed for up to $675 million by Childress Klein and CGA Capital, in the largest real estate deal in the city's history, announced in December 2019.\n\nFinances\nFor the fiscal year 2017, Duke Energy reported earnings of US$3.059 billion, with an annual revenue of US$23.565 billion, an increase of 3.6% over the previous fiscal cycle. Duke Energy's shares traded at over $79 per share, and its market capitalization was valued at over US$58.8 billion in November 2018.\n\nEnvironmental record\nIn 1999, the United States Environmental Protection Agency commenced an enforcement action against Duke Energy for making modifications to very old and deteriorating coal-burning power plants without getting permits under the Clean Air Act. Duke asserted that a \"modification\" under the Clean Air Act did not require a permit. Environmental groups asserted that Duke was using loopholes in the law to increase emissions. Initially, Duke prevailed at the trial court level, but in 2006 the case was argued before the Supreme Court (Environmental Defense v. Duke Energy Corp. (05-848)). The Court unanimously ruled on April 2, 2007, that the modifications allowed the power plants to operate for more hours, increasing emissions, so Clean Air Act permits were needed.\nIn 2002, researchers at the University of Massachusetts Amherst identified Duke Energy as the 46th-largest corporate producer of air pollution in the United States, with roughly 36 million\npounds of toxic chemicals released annually into the air. Major pollutants included sulfuric and hydrochloric acid, chromium compounds, and hydrogen fluoride. The Political Economy Research Institute ranks Duke Energy 13th among corporations emitting airborne pollutants in the United States. The ranking is based on the quantity (80 million pounds in 2005) and toxicity of the emissions. This change reflects the purchase of fossil fuel-heavy Cinergy, which occurred in 2005.\n\nIn early 2008, Duke Energy announced a plan to build the new, 800-megawatt Cliffside Unit 6 coal plant 55 miles (89 km) west of Charlotte, North Carolina. The plan has been strongly opposed by environmental groups such as Rising Tide North America, Rainforest Action Network, the community-based Canary Coalition as well as the Southern Environmental Law Center, which has threatened to sue Duke if it does not halt construction plans. On April 1, activists locked themselves to machinery at the Cliffside construction area as part of Fossil Fools Day.\nDuke Energy has been \"one of the most vocal advocates\" for a \"cap-and-trade\" system to combat global CO2 emissions, \"and the company's CEO, Jim Rogers, thinks the company will profit from cap-and-trade\". The company left the National Association of Manufacturers in part over differences on climate policy.\nIn a joint venture with the French-based global energy firm AREVA, under the nominal name of ADAGE, Duke Energy has planned a \"Green\" biomass burning facility in Mason County, Washington and is negotiating with forestland owners to secure the 600,000 tons of wood debris it needs yearly to fuel its $250 million biomass plant.\nThe joint venture between electric power company Duke Energy and global nuclear services giant AREVA was created to build wood waste-to-energy power plants around the country.\nADAGE president Reed Wills announced the first Northwest outpost will be in the struggling timber town of Shelton, Washington.\nThe following pollutants are provided by DUKE-AREVA-ADAGE in their application for permit to the Department of Environmental Protection for a similar type of plant in Florida.\n\n248 tons per year – particulate matter\n288 tons per year – particulate matter 10\n233 tons per year – particulate matter 2.5\n249 tons per year – NOx (nitrogen oxides)\n246 tons per year – SO2 (sulfur dioxide)\n248 tons per year – CO (carbon monoxide)\n40 tons per year – H2SO4 – (sulfuric acid mist)\n63 tons per year – VOC (volatile organic compounds)\n29 tons per year – F (fluorides)\n\nGenerating facilities\nThis list is partially complete due to the July 3, 2012, merger with Progress Energy.\n\nBiomass fired\nShelton Biomass Facility (proposed)\n\nNuclear\nCatawba Nuclear Station\nMcGuire Nuclear Station\nOconee Nuclear Station\nShearon Harris Nuclear Power Plant\nH. B. Robinson Nuclear Generating Station\nBrunswick Nuclear Generating Station\nCrystal River Nuclear Power Plant (retired February 2013)\n\nCoal-fired\nAllen Steam Station\nBelews Creek Steam Station\nBeckjord Power Station\nCayuga Generating Station\nCrystal River Energy Complex\nEast Bend Station\nEdwardsport Station\nGallagher Station\nGibson Station\nMarshall Steam Station\nMayo Plant\nMiami Fort Power Station (purchased by Dynegy, 2014)\nRiverbend Steam Station (retired)\nRoxboro Steam Plant\nWabash River Station\nWilliam H. Zimmer Power Station (purchased by Dynegy, 2014)\n\nHydroelectric\nConventional hydro\nFollowing is a list of Duke Energy's thirty conventional hydroelectric facilities, in order of average electric production.  All properties are 100% owned by Duke, and all but Markland are located in North Carolina and South Carolina (Markland is located in southern Indiana).\n\nBlewett Falls Hydroelectric Plant\nCowans Ford Hydro Station, 350 MW average capacity\nKeowee Hydro Station, 158 MW\nWalters Hydroelectric Plant, 112 MW\nTillery Hydroelectric Plant, 87 MW\nRocky Creek & Cedar Creek Hydro Stations, combined 73 MW\nGreat Falls & Dearborn Hydro Stations, combined 70 MW\nMarkland Hydro Station, 65 MW\nMountain Island Hydro Station, 60 MW\nLake Wylie Hydro Station, 60 MW\nWateree Hydro Station, 56 MW\nFishing Creek Hydro Station, 37 MW\nOxford Hydro Station, 36 MW\nBridgewater Hydro Station at Lake James, 31.5 MW\nRhodhiss Hydro Station, 26 MW\nLookout Shoals Hydro Station, 26 MW\nBlewett Hydroelectric Plant, 22 MW\nNinety-Nine Islands Plant, 18 MW\nGaston Shoals Plant, 9 MW\nTuxedo Plant, 5 MW\nMarshall Plant, 4 MW\nand ten clustered locations at Nantahala, in mountainous southwestern North Carolina, producing a cumulative 99 MW\n\nPumped-storage hydro\nBad Creek Hydroelectric Station\nJocassee Pumped-Storage Generating Station\n\nOil and gas-fired\nAnclote Station\nAsheville Combustion Turbines\nBartow Combined Cycle Station\nBuck Steam Station\nBuzzard Roost Station\nCayuga Combustion Turbine Station\nCliffside Steam Station\nConnersville Peaking Station\nDan River Steam Station\nDarlington County Electric Plant\nHenry County Peaking Station\nHines Energy Complex\nH.F. Lee Energy Complex\nLee Steam Station\nW.S. Lee Steam Station\nLincoln Combustion Turbine Station\nMadison Peaking Station\nMiami-Wabash Peaking Station\nMill Creek Combustion Turbine Station\nNoblesville Station\nRockingham Station\nSmith Energy Complex\nSutton Combined Cycle Plant\nWabash River Repowering Station\nWheatland Peaking Station\nWoodsdale Station\n\nSolar farms\nCiting the falling cost of building solar farms, Duke Energy announced plans in 2017 to launch three new such projects in Kentucky. Two will be in Kenton County and one will be in Grant County. Together the three plants will create more than 6.7 MW of power. These join several other solar farms including:\n\nDavidson County Solar Farm\nMartins Creek Solar Farm 1 MW (Murphy, NC)\nCulberson Solar Farm 1 MW (Murphy, NC)\nOsceola Solar Facility 4 MW (St.Petersburg, Fla)\nAdditionally, Duke Energy added 451 MW of solar capacity to North Carolina's grid in 2017.\n\nHamilton Solar Power Plant 74.9 MW (Jasper, FL)\nColumbia Solar Power Plant 74.9 MW (Fort White, FL) (opening in 2020)\nLive Oak Solar Power Plant ? MW (Live Oak, FL)\nIn 2020 Duke Energy began commercial operations of several farms in Texas, operating alongside its Farm from 2010.\n\nBlue Wing Solar Project (San Antonio, TX)\nLapetus Solar Project 100 MW (Andrews County, TX)\nHolstein Solar Project 200 MW (Nolan County, TX)\nRambler Solar Project 200 MW (Tom Green County, TX)\n\nWind farms\nLos Vientos Wind Farm\nShirley Wind\n\nElectric vehicles\nDuke Energy announced in October 2018 that it would install 530 electric car charging stations around Florida. Ten percent of the stations will go into low income communities.\n\nAwards\nDuke Energy has been chosen as one of The 50 Best Employers In America by Business Insider\nIn 2002, Duke Energy was awarded the Ig Nobel Prize in Economics for \"adapting the mathematical concept of imaginary numbers for use in the business world\".\n\nCriticism\nIn December 2000, Cinergy Corp agreed to pay $1.4B to settle allegations that its coal plants illegally polluted the air. Duke Energy completed its acquisition of Cinergy Corp in 2006.\nIn July 2004, Duke Energy agreed to pay $208M to settle allegations that it had engaged in price gouging in California during the energy crisis of 2000 and 2001.\nIn December 2009, Duke Energy agreed to spend approximately $93M to resolve violations of the Clean Air Act. Duke became obligated to make investments that were expected to reduce sulfur dioxide emissions by 86%.\nOn February 14, 2011, Greenpeace launched a campaign in which Phil Radford called on Duke Energy to abandon mountaintop removal coal, produce a third of its energy from renewable sources by 2020, and abandon coal altogether by 2030.\"\nIn May 2011, Duke agreed to pay $30M to resolve allegations that changes made to the company pension plan disproportionately harmed employees over 40, costing many of them up to half of their accrued benefits.\nIn December 2011, the non-partisan organization Public Campaign criticized Duke Energy for spending $17.47 million on lobbying. It also criticized Duke for not paying any taxes from 2008 to 2010 and receiving $216 million in tax rebates, in spite of turning a $5.4 billion profit and extensively raising executive compensations.\nIn 2012, Greenpeace protested Duke's lobbying of the Democratic Party, including its funding of the 2012 Democratic National Convention.\nIn July 2012, Duke Energy was criticized for paying former Progress Energy CEO Bill Johnson $44.7 million in compensation, including a $10 million severance, for something close to 20 minutes on the job as Duke's CEO.\nIn 2012, Duke Energy sued Citrus County, Florida claiming its tax bill was too high. The county hired an outside appraiser who found that there were a lot of unreported and underreported items and the tax claim was actually too low.\nIn May 2013, university students launched a campaign for Brown University to divest fossil fuels, specifically referring to Duke Energy and other coal plant operators.\nOn February 2, 2014, the massive Dan River coal-ash spill led to a grand jury investigation into Duke Energy. The initial investigation was overseen by Governor Pat McCrory, who was accused of intervening on Duke's behalf as he had been a Duke Energy employee for 28 years. Prosecutors went looking for any cash or items of value that might have been given to Governor McCrory and members of his administration in exchange for cheap settlements. Duke Energy was prosecuted, pled guilty to nine charges of criminal negligence, and agreed to pay $102 million in fines and restitutions. Duke Energy was also ordered to close all of its 32 ash ponds in the state of North Carolina by 2029.\nIn September 2016, the Government Pension Fund of Norway, then worth $900 billion, excluded Duke Energy and its subsidiaries from the fund, citing \"risk of severe environmental damage\".\nDuring 2018 Duke Energy along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017.\nIn August 2020, environmental watchdog EWG released a report accusing Duke Energy of charging Indiana ratepayers for $12 billion worth of failed projects. This was the direct consequence of a controversial bill passed in Indiana earlier that year. Projects included two natural gas pipelines and two retired nuclear power plants.\nIn 2021, investigative reporting by the Orlando Sun Sentinel revealed that Duke Energy, FPL (Nextera Energy), and TECO Energy put forth more than $3 million to promote \"ghost\" spoiler candidates in key Florida legislature races. The scheme involved former senator Frank Artiles and was effective in costing the Democrats at least one election.\nIn January 2021, Duke Energy agreed to a settlement, which the company proposed, to absorb $1.1 billion worth of coal-ash pond closure and cleanup costs, in North Carolina, between 2015 and 2030. The parties involved also waived all rights to challenge the \"reasonableness and prudence\" of Duke Energy's coal ash management practices and costs before March 2020. Duke estimates the costs to be between $8 and $9 billion, the settlement reduces the cost on the ratepayer by 60%.\nIn August 2021, Indiana city officials from Bloomington, Carmel, and West Lafayette, and other lawmakers sent a letter to Duke Energy deploring its progress towards renewables and asking it to stop overcharging low-income homes for electricity.\n\nDecember 2022 rolling blackouts\nIn December 2022, a major winter storm impacted much of the United States. On December 24, 2022, Christmas Eve, Duke Energy implemented rolling blackouts for the first time in their history, due to unprecedented energy demand. The rolling blackouts came without warning and lasted hours. In addition to facility failures, Duke reported failures related to the software that regulated the controlled blackouts. The Federal Energy Regulatory Commission initiated an investigation in response to the blackouts.\n\nSee also\n2005 Atlantic Power Outage\nHarlan County USA—1976 Academy Award-winning documentary film covering the efforts of 180 coal miners on strike against the Duke Power Company in Harlan County, Kentucky, in 1973.\nFixed bill\nHoliday Junction\n\nReferences\nExternal links\n\nOfficial website\nSpectra Energy\nUnion Gas\nBusiness data for Duke Energy Corporation: \nTranscript of Oral Arguments before the Supreme Court, Environmental Defense v. Duke Energy Corp. (05-848)",
  "clean_text": "Duke Energy Corporation is an American electric power and natural gas holding company headquartered in Charlotte, North Carolina. The company serves over 7 million customers in the eastern United States. In 2024 it ranked as the 141st largest company in the United States – its highest-ever placement on the Fortune 500 list. Overview Duke Energy is based in Charlotte, North Carolina. It owns 58,200 megawatts of base-load and peak generation in the United States, which it distributes to its 7.2 million customers. It has approximately 29,000 employees. Duke Energy's service territory covers 104,000 square miles (270,000 km2) with 250,200 miles (402,700 km) of distribution lines. Almost all of Duke Energy's Midwest generation comes from coal, natural gas, or oil, while half of its Carolinas generation comes from its nuclear power plants. During 2006, Duke Energy generated 148,798,332 megawatt-hours of electrical energy. Duke Energy Renewable Services (DERS), a subsidiary of Duke Energy, specializes in the development, ownership, and operation of various generation facilities throughout the United States. This segment of the company operates 1,700 megawatts of generation. 240 megawatts of wind generation were under construction and 1,500 additional megawatts of wind generation were in planning stages. On September 9, 2008, DERS updated its projections for future wind power capacity. By the end of 2008, it would have over 500 MW of nameplate capacity of wind power online, and an additional 5,000 MW in development. Subsidiaries Duke Energy Carolinas (formerly Duke Power) Duke Energy Ohio (formerly Cincinnati Gas & Electric Company, via Cinergy) Duke Energy Kentucky (formerly Union Light, Heat & Power, via Cinergy) Duke Energy Indiana (formerly Public Service Indiana, via Cinergy) Duke Energy Florida (formerly Florida Power Corporation, via Progress Energy) Duke Energy Progress (formerly Carolina Power and Light, via Progress Energy) Duke Energy Renewables Duke Energy Retail Duke Energy International Duke Energy Sustainable Solutions Duke Energy One Piedmont Natural Gas History The company began in 1900 as the Catawba Power Company when Walker Gill Wylie and his brother financed the building of a hydroelectric power station at India Hook Shoals along the Catawba River near India Hook, South Carolina. When Wylie needed additional funding to further his ambitious plan for construction of a series of hydroelectric power plants, Wylie convinced James B. Duke and his partner James Blaney to invest in the Southern Power Company, founded in 1905. In 1917 James Blaney was the founder of the Wateree Power Company that was formed as a holding company for several utilities that had been founded and/or owned by Duke, and Blaney his associates, and in 1924 the name was changed to Duke Power. In 1927, most of the subsidiary companies, including Southern Power Company, Catawba Power Company, Great Falls Power Company, and Western Carolina Power Company were merged into Duke Power, although Southern Public Utilities, 100% owned by Duke Power, maintained a legally separate existence for the retail marketing of Duke-generated power to residential and commercial customers. Southern Public Utilities also operated transit systems, which Duke eventually converted from streetcars to buses. In 1973, through its subsidiary, the Eastover Mining Company, Duke Power engaged in a lengthy contract dispute with the workers at the Brookside coal mine in Harlan County, Kentucky. For thirteen months, workers picketed the company for improved medical benefits and the right to representation by the United Mine Workers of America, while Duke Power insisted on a no-strike clause in the miner's eventual labor contract. The strike culminated in the shooting and death of twenty-two year old miner, Lawrence D. Jones, by a foreman at the Duke Power-owned mine. Five days later, Duke Power would reach an agreement with the striking miners which included recognition of the new UMWA local, the rehiring of workers dismissed during the strike, and dropping charges related to the action. In 1988, Nantahala Power & Light Co., which served southwestern North Carolina, was purchased by Duke from Alcoa. For many years, it was operated as a separate division of Duke Power, operating under the Duke Power Nantahala Area brand. All former Nantahala operations now operate as Duke Energy Carolinas, although the former Nantahala hydroelectric dams operating in the area are operated as the Nantahala Region for regulatory and permitting purposes. The purchase of Nantahala gave Duke Power, and subsequently Duke Energy, its first and only interconnection with the TVA. In 1990, Duke sold its remaining transit operations. Duke Power merged with PanEnergy, a natural gas company, in 1997 to form Duke Energy. The Duke Power name continued as the electric utility business of Duke Energy until the Cinergy merger. With the purchase of Cinergy Corporation announced in 2005 and completed on April 3, 2006, Duke Energy Corporation's customer base grew to include the Midwestern United States as well. The company operates nuclear power plants, coal-fired plants, conventional hydroelectric plants, natural-gas turbines to handle peak demand, and pumped hydro storage. During 2006, Duke Energy also acquired Chatham, Ontario-based Union Gas, which is regulated under the Ontario Energy Board Act (1998). On January 3, 2007, Duke Energy spun off its gas business to form Spectra Energy. Duke Energy shareholders received 1 share of Spectra Energy for each 2 shares of Duke Energy. After the spin-off, Duke Energy now receives the majority of its revenue from its electric operations in portions of North Carolina, South Carolina, Kentucky, Ohio, and Indiana. The spinoff to Spectra also included Union Gas, which Duke Energy acquired the previous year. In 2011, Duke Energy worked with Charlotte's business leader community to help build Charlotte into a smart city. The group called the initiative \"Envision Charlotte\". At the time, the group decided on a goal to reduce energy use in the \"urban core of the city by 20 percent\". To do so, the group focused on making energy consumption changes to commercial buildings larger than 10,000 square feet. On July 3, 2012, Duke Energy merged with Progress Energy Inc with the Duke Energy name retained along with the Charlotte, North Carolina, headquarters. Duke announced on June 18, 2013, that CEO Jim Rogers was retiring and Lynn Good would become the new CEO. Rogers has been CEO and Chairman since 2006, while Good was Chief Financial Officer of Duke since 2009, having joined Duke in the 2006 Cinergy merger. Rogers' retirement was part of an agreement to end an investigation into Duke's Progress Energy acquisition in 2012. In 2016, Duke Energy purchased Piedmont Natural Gas for $4.9 billion to become its wholly owned subsidiary. Duke Energy completed selling its remaining power operations in Central and South America for $1.2 billion months afterwards. At one point Duke Energy had more than 4,300 megawatts of electric generation in Latin America. It operated eight hydroelectric power plants in Brazil with an installed capacity of 2,307 megawatts. The company expects to spend $13 billion upgrading the North Carolina grid from 2017. In 2018, Jessee Pound of CNBC wrote that Duke was one of many larger American companies which \"paid an effective federal tax rate of 0% or less\", which the Institute on Taxation and Economic Policy claimed was a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. A response from Duke to a similar claim from the Institute of Policy Studies 2024 stated: \"Duke Energy has a deferred tax balance – this does not mean Duke Energy is not paying these taxes, it means that our taxes are due in future years, and we will pay them.\" On December 3, 2022, an attack was carried out on two Duke Energy substations located in Moore County, North Carolina. Damage from the attack left up to 40,000 residents without electrical power for several days, with officials closing schools and declaring a state of emergency. No suspect was ever identified, but the Federal Bureau of Investigation supported local investigators in case the incident met the definition of domestic terrorism under the Patriot Act. Proposed nuclear plant On March 16, 2006, Duke Power announced that a Cherokee County, South Carolina site had been selected for a potential new nuclear power plant. The site is jointly owned by Duke Power and Southern Company. Duke planned to develop the site for two Westinghouse Electric Company AP1000 (advanced passive) pressurized water reactors. Each reactor would have been capable of producing approximately 1,117 megawatts. (See Nuclear Power 2010 Program.) On December 14, 2007, Duke Power submitted a Combined Construction and Operating License to the Nuclear Regulatory Commission, with an announcement that it will spend $160 million in 2008 on the plant with a total cost of $5 billion to $6 billion. The plant was approved in 2016. In August 2017, Duke decided to seek permission from the North Carolina Utility Commission to cancel the project due to the bankruptcy of Westinghouse and \"other market activity\", although they retained the option of restarting the project at some point in the future if circumstances change. This site would have been adjacent to the old site, which was never completed and abandoned in the early 1980s, and used by James Cameron as a film set for the 1989 movie The Abyss. In 2018, Duke Energy announced that they had decided not to include new nuclear power in their long-range plans. Headquarters buildings J.A. Jones designed the first headquarters building, known as the Power Building, which was completed in 1927 at 440 South Church. It was five stories and 503,000 square feet (46,700 m2). The Electric Center at 526 South Church Street opened in 1975 with an addition in 1988. State Farm Insurance sold the Power Building in 2004 for $8 million to The Dilweg Cos., who anticipated significant development. Novare Group bought 5.13 acres (20,800 m2) at 408 South Church Street for $17 million from The Dilweg Cos. in a deal announced March 27, 2006. The Power Building was demolished February 24, 2007. Duke Energy Center at 550 South Tryon Street was announced as the company's headquarters in 2009. The company announced May 17, 2021 that the headquarters will move in 2023 to Duke Energy Plaza, across the street from the current headquarters. Childress Klein is developing the new building, which will allow Duke to sell its Church Street and College Street buildings, and end its lease at 400 South Tryon. Previously named Charlotte Metro Tower, the 40-story building will be purchased when completed for up to $675 million by Childress Klein and CGA Capital, in the largest real estate deal in the city's history, announced in December 2019. Finances For the fiscal year 2017, Duke Energy reported earnings of US$3.059 billion, with an annual revenue of US$23.565 billion, an increase of 3.6% over the previous fiscal cycle. Duke Energy's shares traded at over $79 per share, and its market capitalization was valued at over US$58.8 billion in November 2018. Environmental record In 1999, the United States Environmental Protection Agency commenced an enforcement action against Duke Energy for making modifications to very old and deteriorating coal-burning power plants without getting permits under the Clean Air Act. Duke asserted that a \"modification\" under the Clean Air Act did not require a permit. Environmental groups asserted that Duke was using loopholes in the law to increase emissions. Initially, Duke prevailed at the trial court level, but in 2006 the case was argued before the Supreme Court (Environmental Defense v. Duke Energy Corp. (05-848)). The Court unanimously ruled on April 2, 2007, that the modifications allowed the power plants to operate for more hours, increasing emissions, so Clean Air Act permits were needed. In 2002, researchers at the University of Massachusetts Amherst identified Duke Energy as the 46th-largest corporate producer of air pollution in the United States, with roughly 36 million pounds of toxic chemicals released annually into the air. Major pollutants included sulfuric and hydrochloric acid, chromium compounds, and hydrogen fluoride. The Political Economy Research Institute ranks Duke Energy 13th among corporations emitting airborne pollutants in the United States. The ranking is based on the quantity (80 million pounds in 2005) and toxicity of the emissions. This change reflects the purchase of fossil fuel-heavy Cinergy, which occurred in 2005. In early 2008, Duke Energy announced a plan to build the new, 800-megawatt Cliffside Unit 6 coal plant 55 miles (89 km) west of Charlotte, North Carolina. The plan has been strongly opposed by environmental groups such as Rising Tide North America, Rainforest Action Network, the community-based Canary Coalition as well as the Southern Environmental Law Center, which has threatened to sue Duke if it does not halt construction plans. On April 1, activists locked themselves to machinery at the Cliffside construction area as part of Fossil Fools Day. Duke Energy has been \"one of the most vocal advocates\" for a \"cap-and-trade\" system to combat global CO2 emissions, \"and the company's CEO, Jim Rogers, thinks the company will profit from cap-and-trade\". The company left the National Association of Manufacturers in part over differences on climate policy. In a joint venture with the French-based global energy firm AREVA, under the nominal name of ADAGE, Duke Energy has planned a \"Green\" biomass burning facility in Mason County, Washington and is negotiating with forestland owners to secure the 600,000 tons of wood debris it needs yearly to fuel its $250 million biomass plant. The joint venture between electric power company Duke Energy and global nuclear services giant AREVA was created to build wood waste-to-energy power plants around the country. ADAGE president Reed Wills announced the first Northwest outpost will be in the struggling timber town of Shelton, Washington. The following pollutants are provided by DUKE-AREVA-ADAGE in their application for permit to the Department of Environmental Protection for a similar type of plant in Florida. 248 tons per year – particulate matter 288 tons per year – particulate matter 10 233 tons per year – particulate matter 2.5 249 tons per year – NOx (nitrogen oxides) 246 tons per year – SO2 (sulfur dioxide) 248 tons per year – CO (carbon monoxide) 40 tons per year – H2SO4 – (sulfuric acid mist) 63 tons per year – VOC (volatile organic compounds) 29 tons per year – F (fluorides) Generating facilities This list is partially complete due to the July 3, 2012, merger with Progress Energy. Biomass fired Shelton Biomass Facility (proposed) Nuclear Catawba Nuclear Station McGuire Nuclear Station Oconee Nuclear Station Shearon Harris Nuclear Power Plant H. B. Robinson Nuclear Generating Station Brunswick Nuclear Generating Station Crystal River Nuclear Power Plant (retired February 2013) Coal-fired Allen Steam Station Belews Creek Steam Station Beckjord Power Station Cayuga Generating Station Crystal River Energy Complex East Bend Station Edwardsport Station Gallagher Station Gibson Station Marshall Steam Station Mayo Plant Miami Fort Power Station (purchased by Dynegy, 2014) Riverbend Steam Station (retired) Roxboro Steam Plant Wabash River Station William H. Zimmer Power Station (purchased by Dynegy, 2014) Hydroelectric Conventional hydro Following is a list of Duke Energy's thirty conventional hydroelectric facilities, in order of average electric production. All properties are 100% owned by Duke, and all but Markland are located in North Carolina and South Carolina (Markland is located in southern Indiana). Blewett Falls Hydroelectric Plant Cowans Ford Hydro Station, 350 MW average capacity Keowee Hydro Station, 158 MW Walters Hydroelectric Plant, 112 MW Tillery Hydroelectric Plant, 87 MW Rocky Creek & Cedar Creek Hydro Stations, combined 73 MW Great Falls & Dearborn Hydro Stations, combined 70 MW Markland Hydro Station, 65 MW Mountain Island Hydro Station, 60 MW Lake Wylie Hydro Station, 60 MW Wateree Hydro Station, 56 MW Fishing Creek Hydro Station, 37 MW Oxford Hydro Station, 36 MW Bridgewater Hydro Station at Lake James, 31.5 MW Rhodhiss Hydro Station, 26 MW Lookout Shoals Hydro Station, 26 MW Blewett Hydroelectric Plant, 22 MW Ninety-Nine Islands Plant, 18 MW Gaston Shoals Plant, 9 MW Tuxedo Plant, 5 MW Marshall Plant, 4 MW and ten clustered locations at Nantahala, in mountainous southwestern North Carolina, producing a cumulative 99 MW Pumped-storage hydro Bad Creek Hydroelectric Station Jocassee Pumped-Storage Generating Station Oil and gas-fired Anclote Station Asheville Combustion Turbines Bartow Combined Cycle Station Buck Steam Station Buzzard Roost Station Cayuga Combustion Turbine Station Cliffside Steam Station Connersville Peaking Station Dan River Steam Station Darlington County Electric Plant Henry County Peaking Station Hines Energy Complex H.F. Lee Energy Complex Lee Steam Station W.S. Lee Steam Station Lincoln Combustion Turbine Station Madison Peaking Station Miami-Wabash Peaking Station Mill Creek Combustion Turbine Station Noblesville Station Rockingham Station Smith Energy Complex Sutton Combined Cycle Plant Wabash River Repowering Station Wheatland Peaking Station Woodsdale Station Solar farms Citing the falling cost of building solar farms, Duke Energy announced plans in 2017 to launch three new such projects in Kentucky. Two will be in Kenton County and one will be in Grant County. Together the three plants will create more than 6.7 MW of power. These join several other solar farms including: Davidson County Solar Farm Martins Creek Solar Farm 1 MW (Murphy, NC) Culberson Solar Farm 1 MW (Murphy, NC) Osceola Solar Facility 4 MW (St.Petersburg, Fla) Additionally, Duke Energy added 451 MW of solar capacity to North Carolina's grid in 2017. Hamilton Solar Power Plant 74.9 MW (Jasper, FL) Columbia Solar Power Plant 74.9 MW (Fort White, FL) (opening in 2020) Live Oak Solar Power Plant ? MW (Live Oak, FL) In 2020 Duke Energy began commercial operations of several farms in Texas, operating alongside its Farm from 2010. Blue Wing Solar Project (San Antonio, TX) Lapetus Solar Project 100 MW (Andrews County, TX) Holstein Solar Project 200 MW (Nolan County, TX) Rambler Solar Project 200 MW (Tom Green County, TX) Wind farms Los Vientos Wind Farm Shirley Wind Electric vehicles Duke Energy announced in October 2018 that it would install 530 electric car charging stations around Florida. Ten percent of the stations will go into low income communities. Awards Duke Energy has been chosen as one of The 50 Best Employers In America by Business Insider In 2002, Duke Energy was awarded the Ig Nobel Prize in Economics for \"adapting the mathematical concept of imaginary numbers for use in the business world\". Criticism In December 2000, Cinergy Corp agreed to pay $1.4B to settle allegations that its coal plants illegally polluted the air. Duke Energy completed its acquisition of Cinergy Corp in 2006. In July 2004, Duke Energy agreed to pay $208M to settle allegations that it had engaged in price gouging in California during the energy crisis of 2000 and 2001. In December 2009, Duke Energy agreed to spend approximately $93M to resolve violations of the Clean Air Act. Duke became obligated to make investments that were expected to reduce sulfur dioxide emissions by 86%. On February 14, 2011, Greenpeace launched a campaign in which Phil Radford called on Duke Energy to abandon mountaintop removal coal, produce a third of its energy from renewable sources by 2020, and abandon coal altogether by 2030.\" In May 2011, Duke agreed to pay $30M to resolve allegations that changes made to the company pension plan disproportionately harmed employees over 40, costing many of them up to half of their accrued benefits. In December 2011, the non-partisan organization Public Campaign criticized Duke Energy for spending $17.47 million on lobbying. It also criticized Duke for not paying any taxes from 2008 to 2010 and receiving $216 million in tax rebates, in spite of turning a $5.4 billion profit and extensively raising executive compensations. In 2012, Greenpeace protested Duke's lobbying of the Democratic Party, including its funding of the 2012 Democratic National Convention. In July 2012, Duke Energy was criticized for paying former Progress Energy CEO Bill Johnson $44.7 million in compensation, including a $10 million severance, for something close to 20 minutes on the job as Duke's CEO. In 2012, Duke Energy sued Citrus County, Florida claiming its tax bill was too high. The county hired an outside appraiser who found that there were a lot of unreported and underreported items and the tax claim was actually too low. In May 2013, university students launched a campaign for Brown University to divest fossil fuels, specifically referring to Duke Energy and other coal plant operators. On February 2, 2014, the massive Dan River coal-ash spill led to a grand jury investigation into Duke Energy. The initial investigation was overseen by Governor Pat McCrory, who was accused of intervening on Duke's behalf as he had been a Duke Energy employee for 28 years. Prosecutors went looking for any cash or items of value that might have been given to Governor McCrory and members of his administration in exchange for cheap settlements. Duke Energy was prosecuted, pled guilty to nine charges of criminal negligence, and agreed to pay $102 million in fines and restitutions. Duke Energy was also ordered to close all of its 32 ash ponds in the state of North Carolina by 2029. In September 2016, the Government Pension Fund of Norway, then worth $900 billion, excluded Duke Energy and its subsidiaries from the fund, citing \"risk of severe environmental damage\". During 2018 Duke Energy along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. In August 2020, environmental watchdog EWG released a report accusing Duke Energy of charging Indiana ratepayers for $12 billion worth of failed projects. This was the direct consequence of a controversial bill passed in Indiana earlier that year. Projects included two natural gas pipelines and two retired nuclear power plants. In 2021, investigative reporting by the Orlando Sun Sentinel revealed that Duke Energy, FPL (Nextera Energy), and TECO Energy put forth more than $3 million to promote \"ghost\" spoiler candidates in key Florida legislature races. The scheme involved former senator Frank Artiles and was effective in costing the Democrats at least one election. In January 2021, Duke Energy agreed to a settlement, which the company proposed, to absorb $1.1 billion worth of coal-ash pond closure and cleanup costs, in North Carolina, between 2015 and 2030. The parties involved also waived all rights to challenge the \"reasonableness and prudence\" of Duke Energy's coal ash management practices and costs before March 2020. Duke estimates the costs to be between $8 and $9 billion, the settlement reduces the cost on the ratepayer by 60%. In August 2021, Indiana city officials from Bloomington, Carmel, and West Lafayette, and other lawmakers sent a letter to Duke Energy deploring its progress towards renewables and asking it to stop overcharging low-income homes for electricity. December 2022 rolling blackouts In December 2022, a major winter storm impacted much of the United States. On December 24, 2022, Christmas Eve, Duke Energy implemented rolling blackouts for the first time in their history, due to unprecedented energy demand. The rolling blackouts came without warning and lasted hours. In addition to facility failures, Duke reported failures related to the software that regulated the controlled blackouts. The Federal Energy Regulatory Commission initiated an investigation in response to the blackouts."
}