{
  "ticker": "DVN",
  "cik": "0001090012",
  "company_name": "Devon Energy",
  "corrected_name": "Devon Energy",
  "wiki_title_used": "Devon Energy",
  "exists": true,
  "raw_text": "Devon Energy Corporation is a company engaged in hydrocarbon exploration in the United States. It is organized in Delaware with operational headquarters in the 50-story Devon Energy Center in Oklahoma City, Oklahoma. Its operations are in the Delaware Basin, Eagle Ford Group, and the Rocky Mountains (Williston Basin and Powder River Basin).\nThe company is ranked 267th on the Fortune 500 and 607th on the Forbes Global 2000.\nAs of December 31, 2024, the company had proved reserves of 2,155 million barrels of oil equivalent (1.318×1010 GJ), of which 42% was petroleum, 29% was natural gas liquids, and 29% was natural gas.\n\nHistory\nDevon was founded in 1971 by John Nichols (1914-2008) and his son, J. Larry Nichols. In 1988, the company became a public company via an initial public offering.\nIn October 2012, the company completed construction of its current headquarters, the 50-story Devon Energy Center in Oklahoma City, Oklahoma and closed its office in the Allen Center in Downtown Houston. \nIn February 2016, Devon announced plans to lay off 1,000 employees, including 700 in Oklahoma City, and cut its quarterly dividend to $0.06 per share due to low prices of its products. In 2021, it instituted a fixed plus variable dividend structure that resulted in a record high dividend.\n\nAcquisitions\nDivestitures\nCEOs\nLarry Nichols (1980-2010)\nJohn Richels (2010-2015)\nDave Hager (2015-2021)\nRick Muncrief (2021-2025)\nClay Gaspar (2025-)\n\nPolitical activity\nDevon has contributed millions of dollars to politicians and political organizations, almost entirely to organizations and individuals affiliated with the Republican Party.\nAfter agreeing with the Obama administration to install systems to control the illegal emission of hazardous chemicals, Devon backed out of such agreements during the first presidency of Donald Trump due to rollbacks of environmental regulations.\nIn 2014, an investigation by The New York Times uncovered that a three-page letter signed by Scott Pruitt, then the Attorney General of Oklahoma, to the United States Environmental Protection Agency advocating for a relaxing of laws related to hydraulic fracturing was actually written by lobbyists for Devon Energy and not by Pruitt.\n\nEnvironmental and legal issues\nIn November 2019, a blowout at a Devon natural gas well prompted authorities to seal off thousands of acres of land near the Eagle Ford Shale towns of Yorktown, Texas and Nordheim, Texas until the well was capped. It took 35 hours to get the issue under control. The company paid $48,750 in fines for the incident.\nIn September 2021, the company agreed to pay $6.15 million to resolve allegations that it violated the False Claims Act of 1863 by underpaying and underreporting royalties for natural gas from federal lands in Wyoming and New Mexico.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Devon Energy Corporation:",
  "clean_text": "Devon Energy Corporation is a company engaged in hydrocarbon exploration in the United States. It is organized in Delaware with operational headquarters in the 50-story Devon Energy Center in Oklahoma City, Oklahoma. Its operations are in the Delaware Basin, Eagle Ford Group, and the Rocky Mountains (Williston Basin and Powder River Basin). The company is ranked 267th on the Fortune 500 and 607th on the Forbes Global 2000. As of December 31, 2024, the company had proved reserves of 2,155 million barrels of oil equivalent (1.318×1010 GJ), of which 42% was petroleum, 29% was natural gas liquids, and 29% was natural gas. History Devon was founded in 1971 by John Nichols (1914-2008) and his son, J. Larry Nichols. In 1988, the company became a public company via an initial public offering. In October 2012, the company completed construction of its current headquarters, the 50-story Devon Energy Center in Oklahoma City, Oklahoma and closed its office in the Allen Center in Downtown Houston. In February 2016, Devon announced plans to lay off 1,000 employees, including 700 in Oklahoma City, and cut its quarterly dividend to $0.06 per share due to low prices of its products. In 2021, it instituted a fixed plus variable dividend structure that resulted in a record high dividend. Acquisitions Divestitures CEOs Larry Nichols (1980-2010) John Richels (2010-2015) Dave Hager (2015-2021) Rick Muncrief (2021-2025) Clay Gaspar (2025-) Political activity Devon has contributed millions of dollars to politicians and political organizations, almost entirely to organizations and individuals affiliated with the Republican Party. After agreeing with the Obama administration to install systems to control the illegal emission of hazardous chemicals, Devon backed out of such agreements during the first presidency of Donald Trump due to rollbacks of environmental regulations. In 2014, an investigation by The New York Times uncovered that a three-page letter signed by Scott Pruitt, then the Attorney General of Oklahoma, to the United States Environmental Protection Agency advocating for a relaxing of laws related to hydraulic fracturing was actually written by lobbyists for Devon Energy and not by Pruitt. Environmental and legal issues In November 2019, a blowout at a Devon natural gas well prompted authorities to seal off thousands of acres of land near the Eagle Ford Shale towns of Yorktown, Texas and Nordheim, Texas until the well was capped. It took 35 hours to get the issue under control. The company paid $48,750 in fines for the incident. In September 2021, the company agreed to pay $6.15 million to resolve allegations that it violated the False Claims Act of 1863 by underpaying and underreporting royalties for natural gas from federal lands in Wyoming and New Mexico."
}