{
  "ticker": "DXCM",
  "cik": "0001093557",
  "company_name": "Dexcom",
  "corrected_name": "Dexcom",
  "wiki_title_used": "Dexcom",
  "exists": true,
  "raw_text": "Dexcom, Inc. is an American healthcare company that develops, manufactures, produces and distributes a line of continuous glucose monitoring (CGM) systems for diabetes management. It operates internationally with headquarters and R&D center in San Diego, California, U.S.A. and manufacturing facilities in Mesa, Arizona, U.S.A.; Batu Kawan, Malaysia and Athenry, County Galway, Ireland.\n\nHistory\nDexcom was founded in 1999 by Scott Glenn, John Burd, Lauren Otsuki, Ellen Preston and Bret Megargel. In 2006, Dexcom received U.S. Food and Drug Administration (FDA) approval and launched the Dexcom STS Continuous Glucose Monitoring System, which is a three-day sensor that provides up to 288 glucose measurements for every 24 hours. Dexcom received approval of the second-generation product, the Seven Continuous Glucose Monitoring System, in May 2007. This device improved on accuracy and extended use from three to seven days. In 2008, Dexcom announced two consumer development agreements with Insulet Corporation and Animas Corporation as well as a development agreement with Edwards Lifesciences for a continuous glucose monitor in the intensive care unit hospital environment.\nDuring February 2009, Dexcom received approval for the Seven Plus Continuous Glucose Monitor, its new continuous glucose monitoring system, from the FDA. This product received a CE mark in November 2009. In 2013, development work for integration with Insulet was discontinued. Dexcom entered a non-exclusive agreement with Tandem Diabetes Care, Inc. in 2015 to allow the integration of its forthcoming G5 and G6 continuous glucose monitoring systems into Tandem's insulin pumps. The G5 was approved in 2016 by the FDA for use as a standalone device, while the G6 gained approval in 2018.\nDexcom's first G-series CGM, the G4 Platinum, received a CE mark and FDA approval in 2012 for adults ages 18 and over. This device improved hypoglycemic accuracy by 30%. It also offered a longer range of transmission between the sensor and receiver, as well as a color LCD.  The G4 Platinum was approved by the FDA for use in patients ages 2–17 in February 2014. Dexcom received FDA approval in January 2015 for the G4 Platinum with Share, which enabled the sharing of CGM data with up to five other people using the \"Share\" and \"Follow\" smartphone apps.\nThe Dexcom G5 was approved in August 2015 by the FDA for use as a standalone device, the G5 has Bluetooth integrated into its transmitter, enabling it to send data to a mobile device. This allows for use of the device without the standalone receiver. The Dexcom G5 received a CE mark in September 2015.\nDexcom went public in 2005 and is listed on the Nasdaq Global Select Market stock exchange under the ticker symbol DXCM. On April 20, 2020, Dexcom became a component of the Nasdaq-100, replacing American Airlines Group in the index.\nThe Dexcom G7 was approved in December 2022 by the FDA for use as a standalone device and is the most accurate currently approved CGM in the U.S.\n\nAwards and recognition\nIn October 2024, Time Magazine named Dexcom Stelo's over-the-counter glucose monitor one of the year's best inventions.\n\nPartnerships\nDexcom entered into a partnership in 2015 with Google Life Sciences (which subsequently became Verily) to develop the Dexcom G7 \nDexcom entered a non-exclusive agreement with Tandem Diabetes Care, Inc. in 2015 to allow the integration of its new G5 and G6 continuous glucose monitoring systems into Tandem's insulin pumps.  Tandem Diabetes Care received FDA approval in December 2019 for Control-IQ, a closed-loop technology that uses Tandem's t:slim X2 insulin pump and the Dexcom G6 \"to automatically increase, decrease, or stop the delivery of insulin in response to the glucose levels of people with Type 1 diabetes.\"\nIn June 2019, Dexcom announced a collaboration with Companion Medical to enable the exchange of CGM data from Dexcom with insulin data from InPen into both companies' software applications.\nDexcom entered into a partnership with Livongo, a digital chronic care management company, in January 2020 to share CGM data from the Dexcom G6 with Livongo's platform. This integration allowed Livongo to incorporate the CGM data along with other patient data.\nIn February 2020, Dexcom and Insulet Corporation signed a non-exclusive, global agreement to combine current and future Dexcom continuous glucose monitoring systems with Insulet's tubeless insulin delivery Pod into the Omnipod Horizon System for automated insulin delivery. This allowed the ability to adjust insulin doses based on Insulet's algorithm or through their smartphone.\nThe company also announced in March 2020 a partnership with Welldoc to integrate G6 CGM data with BlueStar, a digital platform for diabetes management.\nIn November 2024, Dexcom announced a \"strategic partnership\" and data exchange with Oura.\n\nVenture capital arm\nIn early 2021, Dexcom launched Dexcom Ventures, a venture capital arm focused on emerging continuous glucose monitoring technologies and devices measuring the levels of other types of substances and analytes. In practice, Dexcom Ventures has also invested in cybersecurity platforms for the software used in medical devices.\n\nSee also\nDexcom CGM\n\nReferences\nExternal links\nOfficial website\nBusiness data for Dexcom, Inc.:",
  "clean_text": "Dexcom, Inc. is an American healthcare company that develops, manufactures, produces and distributes a line of continuous glucose monitoring (CGM) systems for diabetes management. It operates internationally with headquarters and R&D center in San Diego, California, U.S.A. and manufacturing facilities in Mesa, Arizona, U.S.A.; Batu Kawan, Malaysia and Athenry, County Galway, Ireland. History Dexcom was founded in 1999 by Scott Glenn, John Burd, Lauren Otsuki, Ellen Preston and Bret Megargel. In 2006, Dexcom received U.S. Food and Drug Administration (FDA) approval and launched the Dexcom STS Continuous Glucose Monitoring System, which is a three-day sensor that provides up to 288 glucose measurements for every 24 hours. Dexcom received approval of the second-generation product, the Seven Continuous Glucose Monitoring System, in May 2007. This device improved on accuracy and extended use from three to seven days. In 2008, Dexcom announced two consumer development agreements with Insulet Corporation and Animas Corporation as well as a development agreement with Edwards Lifesciences for a continuous glucose monitor in the intensive care unit hospital environment. During February 2009, Dexcom received approval for the Seven Plus Continuous Glucose Monitor, its new continuous glucose monitoring system, from the FDA. This product received a CE mark in November 2009. In 2013, development work for integration with Insulet was discontinued. Dexcom entered a non-exclusive agreement with Tandem Diabetes Care, Inc. in 2015 to allow the integration of its forthcoming G5 and G6 continuous glucose monitoring systems into Tandem's insulin pumps. The G5 was approved in 2016 by the FDA for use as a standalone device, while the G6 gained approval in 2018. Dexcom's first G-series CGM, the G4 Platinum, received a CE mark and FDA approval in 2012 for adults ages 18 and over. This device improved hypoglycemic accuracy by 30%. It also offered a longer range of transmission between the sensor and receiver, as well as a color LCD. The G4 Platinum was approved by the FDA for use in patients ages 2–17 in February 2014. Dexcom received FDA approval in January 2015 for the G4 Platinum with Share, which enabled the sharing of CGM data with up to five other people using the \"Share\" and \"Follow\" smartphone apps. The Dexcom G5 was approved in August 2015 by the FDA for use as a standalone device, the G5 has Bluetooth integrated into its transmitter, enabling it to send data to a mobile device. This allows for use of the device without the standalone receiver. The Dexcom G5 received a CE mark in September 2015. Dexcom went public in 2005 and is listed on the Nasdaq Global Select Market stock exchange under the ticker symbol DXCM. On April 20, 2020, Dexcom became a component of the Nasdaq-100, replacing American Airlines Group in the index. The Dexcom G7 was approved in December 2022 by the FDA for use as a standalone device and is the most accurate currently approved CGM in the U.S. Awards and recognition In October 2024, Time Magazine named Dexcom Stelo's over-the-counter glucose monitor one of the year's best inventions. Partnerships Dexcom entered into a partnership in 2015 with Google Life Sciences (which subsequently became Verily) to develop the Dexcom G7 Dexcom entered a non-exclusive agreement with Tandem Diabetes Care, Inc. in 2015 to allow the integration of its new G5 and G6 continuous glucose monitoring systems into Tandem's insulin pumps. Tandem Diabetes Care received FDA approval in December 2019 for Control-IQ, a closed-loop technology that uses Tandem's t:slim X2 insulin pump and the Dexcom G6 \"to automatically increase, decrease, or stop the delivery of insulin in response to the glucose levels of people with Type 1 diabetes.\" In June 2019, Dexcom announced a collaboration with Companion Medical to enable the exchange of CGM data from Dexcom with insulin data from InPen into both companies' software applications. Dexcom entered into a partnership with Livongo, a digital chronic care management company, in January 2020 to share CGM data from the Dexcom G6 with Livongo's platform. This integration allowed Livongo to incorporate the CGM data along with other patient data. In February 2020, Dexcom and Insulet Corporation signed a non-exclusive, global agreement to combine current and future Dexcom continuous glucose monitoring systems with Insulet's tubeless insulin delivery Pod into the Omnipod Horizon System for automated insulin delivery. This allowed the ability to adjust insulin doses based on Insulet's algorithm or through their smartphone. The company also announced in March 2020 a partnership with Welldoc to integrate G6 CGM data with BlueStar, a digital platform for diabetes management. In November 2024, Dexcom announced a \"strategic partnership\" and data exchange with Oura. Venture capital arm In early 2021, Dexcom launched Dexcom Ventures, a venture capital arm focused on emerging continuous glucose monitoring technologies and devices measuring the levels of other types of substances and analytes. In practice, Dexcom Ventures has also invested in cybersecurity platforms for the software used in medical devices."
}