{
  "ticker": "ECL",
  "cik": "0000031462",
  "company_name": "Ecolab",
  "corrected_name": "Ecolab",
  "wiki_title_used": "Ecolab",
  "exists": true,
  "raw_text": "Ecolab Inc. (formerly Economics Laboratory), headquartered in Saint Paul, Minnesota, provides products related to water treatment, sanitation, and hygiene, primarily to commercial and industrial customers.\nThe company is ranked 274th on the Fortune 500 and 569th on the Forbes Global 2000.\n\nHistory\n1923–1986\nThe company was founded in 1923 as Economics Laboratory by Merritt J. \"M.J.\" Osborn. The company's first product was Absorbit, designed to quickly clean carpets in hotel rooms. It followed by Soilax, a dishwasher soap.\nIts first overseas subsidiary, Soilax AB, was established in Sweden in 1956.\nEL became a public company in 1957. It acquired Klenzade in 1961 and the Magnus Company in 1964, giving the company access to Magnus's industrial specialty businesses – including pulp and paper, metalworking, transportation, and petrochemical processing.\nIn 1972, the company acquired Raburn Products, maker of dish machine racks and dish room carts.\nIn February 1980, it acquired Apollo Technologies, a major producer of conditioning agents for electrostatic precipitators, for $71.2 million; it was shut down in 1983 with a $42 million loss.\nIn 1984, Ecolab acquired Lystads, thereby launching its pest elimination division.\n\n1986–2000\nIn 1986, the company changed its name from Economics Laboratory to Ecolab Inc. and was listed on the New York Stock Exchange.\nIn 1987, the company formed a textile care division.\nIn 1987, Ecolab acquired ChemLawn, a lawncare servicer provider, for $376 million. In 1992, it was sold to ServiceMaster for $103 million after years of losses.\nIn July 1991, Ecolab and Henkel formed a 50-50 European joint venture to expand into European and Russian markets. Ecolab also acquired Henkel's institutional cleaning and sanitizing businesses in 19 countries in Latin America and the Asia-Pacific. Henkel then owned a 24% stake in Ecolab. In 2001, Ecolab acquired the 50% interest in the joint venture held by Henkel for $445 million. Henkel sold its stake in Ecolab in November 2008, as it needed to raise cash during the 2008 financial crisis.\nIn November 1994, the company acquired Kay Chemical for $94 million.\nIn August 1997, the company acquired 14.9% of Gibson Chemical Industries of Australia for $18.7 million.\n\n2000–present\nIn 2004, Douglas M. Baker Jr. was named chief executive officer. In 2006, he also was named chairman of Ecolab's board of directors.\nIn November 2005, Ecolab opened a 200,000 square-foot global research, development, and engineering center in Eagan, Minnesota.\nIn November 2007, Ecolab acquired Microtek Medical Holdings, expanding its infection prevention expertise and offerings to hospitals and other healthcare facilities, for $275 million.\nIn February 2008, the company acquired Ecovation, a provider of technology used to increase efficiency in food and beverage production, for $210 million.\nIn 2008, Ecolab established Zurich as its Europe, the Middle East and Africa headquarters.\nIn November 2011, Ecolab acquired Nalco Water for $8.3 billion.\nIn April 2013, Ecolab acquired Champion Technologies and its related company Corsicana Technologies for $2.3 billion. To satisfy regulatory concerns, the company sold Champion's chemical-management services division for deep-water oil and gas wells in the Gulf of Mexico.\nIn November 2014, Ecolab, working with Trucost, launched the Water Risk Monetizer, an algorithm to help companies efficiently use water.\nIn August 2015, the company moved its headquarters.\nIn August 2015, Ecolab acquired the U.S. operations of Swisher Hygiene for $40.5 million.\nIn February 2017, Ecolab acquired Laboratoires Anios, a European manufacturer and marketer of hygiene and disinfection products for the healthcare, food service, and food and beverage markets for $800 million.\nIn July 2016, Ecolab made a minority investment in Aquatech International.\nIn August 2016, the company opened a Latin America regional headquarters in Miramar, Florida.\nIn October 2016, Ecolab acquired the assets of UltraClenz, a developer of electronic hand hygiene compliance monitoring systems and dispensers.\nIn February 2019, the company acquired Lobster Ink, an online training firm.\nIn October 2021, Ecolab acquired Purolite, a provider of ion-exchange resins for biopharmaceutical purification for approximately $3.7 billion.\nIn 2023, Ecolab partnered with and invested a \"multi-million dollar\" amount in Miso Robotics, a company specializing in automated in-restaurant robotic arms and other equipment for food preparation and staff augmentation.\nIn July 2025, the company shifted much of its research and development toward data centers and semiconductor manufacturing, offering technologies such as liquid cooling.\nIn August 2025, Ecolab acquired Ovivo's electronics business for $1.8 billion.\n\nAwards and recognition\n2006 - Black Pearl Award for Corporate Excellence in Food Safety and Quality, presented by the International Association of Food Protection (IAFP).\n2013 - Ranked 33rd on list of most innovative companies by Forbes\n2019-present - Listed on Best Employers for Women list by Forbes\n\nReferences\nExternal links\nOfficial website\nBusiness data for Ecolab, Inc.: \nArchival records of Ecolab at the Minnesota Historical Society",
  "clean_text": "Ecolab Inc. (formerly Economics Laboratory), headquartered in Saint Paul, Minnesota, provides products related to water treatment, sanitation, and hygiene, primarily to commercial and industrial customers. The company is ranked 274th on the Fortune 500 and 569th on the Forbes Global 2000. History 1923–1986 The company was founded in 1923 as Economics Laboratory by Merritt J. \"M.J.\" Osborn. The company's first product was Absorbit, designed to quickly clean carpets in hotel rooms. It followed by Soilax, a dishwasher soap. Its first overseas subsidiary, Soilax AB, was established in Sweden in 1956. EL became a public company in 1957. It acquired Klenzade in 1961 and the Magnus Company in 1964, giving the company access to Magnus's industrial specialty businesses – including pulp and paper, metalworking, transportation, and petrochemical processing. In 1972, the company acquired Raburn Products, maker of dish machine racks and dish room carts. In February 1980, it acquired Apollo Technologies, a major producer of conditioning agents for electrostatic precipitators, for $71.2 million; it was shut down in 1983 with a $42 million loss. In 1984, Ecolab acquired Lystads, thereby launching its pest elimination division. 1986–2000 In 1986, the company changed its name from Economics Laboratory to Ecolab Inc. and was listed on the New York Stock Exchange. In 1987, the company formed a textile care division. In 1987, Ecolab acquired ChemLawn, a lawncare servicer provider, for $376 million. In 1992, it was sold to ServiceMaster for $103 million after years of losses. In July 1991, Ecolab and Henkel formed a 50-50 European joint venture to expand into European and Russian markets. Ecolab also acquired Henkel's institutional cleaning and sanitizing businesses in 19 countries in Latin America and the Asia-Pacific. Henkel then owned a 24% stake in Ecolab. In 2001, Ecolab acquired the 50% interest in the joint venture held by Henkel for $445 million. Henkel sold its stake in Ecolab in November 2008, as it needed to raise cash during the 2008 financial crisis. In November 1994, the company acquired Kay Chemical for $94 million. In August 1997, the company acquired 14.9% of Gibson Chemical Industries of Australia for $18.7 million. 2000–present In 2004, Douglas M. Baker Jr. was named chief executive officer. In 2006, he also was named chairman of Ecolab's board of directors. In November 2005, Ecolab opened a 200,000 square-foot global research, development, and engineering center in Eagan, Minnesota. In November 2007, Ecolab acquired Microtek Medical Holdings, expanding its infection prevention expertise and offerings to hospitals and other healthcare facilities, for $275 million. In February 2008, the company acquired Ecovation, a provider of technology used to increase efficiency in food and beverage production, for $210 million. In 2008, Ecolab established Zurich as its Europe, the Middle East and Africa headquarters. In November 2011, Ecolab acquired Nalco Water for $8.3 billion. In April 2013, Ecolab acquired Champion Technologies and its related company Corsicana Technologies for $2.3 billion. To satisfy regulatory concerns, the company sold Champion's chemical-management services division for deep-water oil and gas wells in the Gulf of Mexico. In November 2014, Ecolab, working with Trucost, launched the Water Risk Monetizer, an algorithm to help companies efficiently use water. In August 2015, the company moved its headquarters. In August 2015, Ecolab acquired the U.S. operations of Swisher Hygiene for $40.5 million. In February 2017, Ecolab acquired Laboratoires Anios, a European manufacturer and marketer of hygiene and disinfection products for the healthcare, food service, and food and beverage markets for $800 million. In July 2016, Ecolab made a minority investment in Aquatech International. In August 2016, the company opened a Latin America regional headquarters in Miramar, Florida. In October 2016, Ecolab acquired the assets of UltraClenz, a developer of electronic hand hygiene compliance monitoring systems and dispensers. In February 2019, the company acquired Lobster Ink, an online training firm. In October 2021, Ecolab acquired Purolite, a provider of ion-exchange resins for biopharmaceutical purification for approximately $3.7 billion. In 2023, Ecolab partnered with and invested a \"multi-million dollar\" amount in Miso Robotics, a company specializing in automated in-restaurant robotic arms and other equipment for food preparation and staff augmentation. In July 2025, the company shifted much of its research and development toward data centers and semiconductor manufacturing, offering technologies such as liquid cooling. In August 2025, Ecolab acquired Ovivo's electronics business for $1.8 billion. Awards and recognition 2006 - Black Pearl Award for Corporate Excellence in Food Safety and Quality, presented by the International Association of Food Protection (IAFP). 2013 - Ranked 33rd on list of most innovative companies by Forbes 2019-present - Listed on Best Employers for Women list by Forbes"
}