{
  "ticker": "ED",
  "cik": "0001047862",
  "company_name": "Consolidated Edison",
  "corrected_name": "Consolidated Edison",
  "wiki_title_used": "Consolidated Edison",
  "exists": true,
  "raw_text": "Consolidated Edison, Inc., commonly known as Con Edison (stylized as conEdison) or ConEd, is an energy company based in New York City.  It is one of the largest investor-owned energy companies in the United States, with approximately $12 billion in annual revenues as of 2017, and over $62 billion in assets. The company provides a wide range of energy-related products and services to its customers through its subsidiaries:\n\nConsolidated Edison Company of New York, Inc. (CECONY), a regulated utility providing electric and gas service in New York City and Westchester County, New York, and steam service in the borough of Manhattan;\nOrange and Rockland Utilities, Inc., a regulated utility serving customers in a 1,300-square-mile (3,400 km2) area in southeastern New York and northern New Jersey; and,\nCon Edison Transmission, Inc., which invests in electric and natural gas transmission projects.\nIn 2015, electric revenues accounted for 70.35% of consolidated sales (70.55% in 2014); gas revenues 13.61% (14.96% in 2014); steam revenues 5.01% (4.86% in 2014); and non-utility revenues of 11.02% (9.63% in 2014).\n\nHistory\nOn March 23, 1823, \"The New-York Gas light Company\" was incorporated by the 46th New York State Legislature, creating the earliest corporate predecessor of Consolidated Edison. Founding directors included Samuel Leggett and Henry Eckford, respectively, a noted banker and large real estate holder. On May 12, 1823, the New York Gas Light Company received the exclusive privilege to lay gas pipes in the streets of New York City south of Grand Street. A year later, it was listed on the New York Stock Exchange (NYSE). It holds the record as the longest listed stock on the NYSE. Due to the Board of Aldermen's authority to grant franchises in the City of New York in the early to mid-19th century, interaction with Tammany Hall was required to expand the business. By William M. Tweed's reign in the late 1860s as the boss of Tammany Hall, the power to authorize franchises lay with the County Board of Supervisors, of which Tweed had been a member. By 1871, Tweed was a member of the board of the Harlem Gas Light Company, a precursor to the Consolidated Edison Company. On November 10, 1884, New York Gas Light merged with the Manhattan Gas Light Company (inc. 1830), Metropolitan Gas Light Company (inc. 1848), Municipal Gas Light Company (inc. 1874), Knickerbocker Gas Light Company (inc. 1876), and Harlem Gas Light Company (inc. 1855) to form the Consolidated Gas Company of New York.\nIn 1901, the Consolidated Gas Company bought Edison Illuminating Company, which had been founded by Thomas Edison in 1880, first supplying electricity to 59 customers in a 1-square-mile (2.6 km2) area in lower Manhattan. After the \"war of currents\", more than 30 companies were generating and distributing electricity in New York City and Westchester County. But by 1920 there were far fewer, and Consolidated Gas's electricity arm, then called the New York Edison Company, was the leader. On February 18, 1936, an annual report issued by Consolidated Gas Company of New York, Inc. revealed that roughly 75% of their gross operating revenue came from electricity, leading to discussion by the company's officers about changing the company's name to better reflect its nature. On March 16, 1936, stockholders of the Consolidated Gas Company of New York, Inc. voted to change the company's name to Consolidated Edison Company of New York, Inc.\nThe New York Steam Company began providing service in Lower Manhattan in 1882. Con Edison bought it in 1954, and now operates the largest commercial steam system in the world, providing steam service to nearly 1,600 commercial and residential establishments in Manhattan from Battery Park to 96th Street.\nConsolidated Edison acquired or merged with more than a dozen companies between 1936 and 1960. Con Edison today is the result of acquisitions, dissolutions, and mergers of more than 170 individual electric, gas, and steam companies.\nConsolidated Edison acquired land on the Hudson River in Buchanan, New York, in 1954 for the Indian Point nuclear power plant. The first reactor (Indian Point 1) began generating power on September 16, 1962. The reactor was shut down on October 31, 1974, because the emergency core cooling system did not meet regulatory requirements. The company built two more reactors at Indian Point during the 1970s: Indian Point 2 and 3. Indian Point 3 was sold to the New York Power Authority in 1975. Entergy acquired Indian Point 2 in November 2000, nine months after a steam generator leak. With the sale of Indian Point 2, the last power plant it owned, Consolidated Edison, Inc. became primarily an energy distributor.\nOn January 1, 1998, following the deregulation of the utility industry in New York State, a holding company, Consolidated Edison, Inc., was formed. It is one of the nation's largest investor-owned energy companies, with approximately $13 billion in annual revenues and $47 billion in assets. The company provides a wide range of energy-related products and services to its customers through two regulated utility subsidiaries and three competitive energy businesses. Under several corporate names, the company has been traded on the NYSE without interruption since 1824—longer than any other NYSE stock. Its largest subsidiary, Consolidated Edison Company of New York, Inc., provides electric, gas, and steam service to more than 3 million customers in New York City and Westchester County, New York, an area of 660 square miles (1,700 km2) with a population of nearly 9 million. Also in 1998, Consolidated Edison, Inc. acquired Orange & Rockland Utilities, which is operated separately.\nCon Edison had invested $3 billion in solar and wind projects. In September 2017 it was announced that the company would invest $1.25 billion in \"renewable energy production facilities over the next three years.\"\nThe company's \"renewable portfolio\" contained more than 1.5 gigawatts of operating capacity. Seventy-five percent of that capacity came from solar energy. Clean energy accounted for around eight percent of the company's earnings, as of fall 2017. Con Edison sold its clean energy business to RWE in 2023.\n\nSystems\nClean energy\nTo support electric vehicles, Con Edison partnered with the company FleetCarma to provide $500 in rewards to owners of electric vehicles in New York City and Westchester County, New York. Through this program, Con Edison pays customers to charge their vehicles when energy demand is low.\n\nElectrical\nThe Con Edison electrical transmission system utilizes voltages of 138 kilovolts (kV), 345 kV, and 500 kV. The company has two 345 kV interconnections with upstate New York that enable it to import power from Hydro-Québec in Canada and one 345 kV interconnection each with Public Service Electric and Gas (PSE&G) in New Jersey and Long Island. Con Edison's connection with Hydro-Québec is via a series of transmission lines owned by the New York Power Authority and neighboring utilities; a more direct connection via the Champlain Hudson Power Express HVDC line is expected to come online in 2025.\nCon Edison is also interconnected with PSE&G via the Branchburg-Ramapo 500 kV line. Con Ed's distribution voltages are 33 kV, 27 kV, 13 kV, and 4 kV.\nThe 93,000 miles (150,000 km) of underground cable in the Con Edison system could wrap around the Earth 3.6 times. Nearly 36,000 miles (58,000 km) of overhead electric wires complement the underground system—enough cable to stretch between New York and Los Angeles 13 times.\n\nGas\nThe Con Edison gas system has nearly 7,200 miles (11,600 km) of pipes—if laid end to end, long enough to reach Paris and back to New York City, and serves Westchester County, the Bronx, Manhattan, and parts of Queens. Gas service in Brooklyn, Staten Island, and the rest of Queens is provided by National Grid USA's New York City operations, except the Rockaway peninsula, which is serviced by National Grid's Long Island operations. The average volume of gas that travels through Con Edison's gas system annually could fill the Empire State Building nearly 6,100 times.\n\nSteam\nCon Edison produces 30 billion pounds of steam each year through its seven power plants which boil water to 1,000 °F (538 °C) before distributing it to hundreds of buildings in the New York City steam system, which is the biggest district steam system in the world. Steam traveling through the system is used to heat and cool some of New York's most famous addresses, including the United Nations complex, the Empire State Building, and the Metropolitan Museum of Art.\n\nMetering\nThe Smart Meter Project was awarded to Aclara Smart Grid Solutions (electric) and the majority of the rollout was completed in 2022 with several thousand meters still needing to be changed in 2023 due to customer access issues. ConEd utilized Aclara's metering products for field installation. Over five million electric and gas meters were replaced in this project. Lime green-colored seals were used on electric meters to indicate that the meter was changed by a contractor.\n\nPrograms and resources\nConEd offers a variety of programs and resources for its customers and stakeholders, organized in such categories as, \"For Renters\", \"For Residential Owners\", \"For Small & Medium Businesses\", \"For Commercial & Industrial\", \"Business Partners\", \"Investors\", \"Community Affairs\", and \"Municipalities\". Examples of such resources include:\n\nCONCERN Program, which offers eligible customers a specially trained representative and advice about government aid programs, safety tips, and ways to save money on one's energy bill\nQuarterly Billing Plan, which allows senior citizens, whose Con Edison bills are less than $420 a year, to receive bills once every three months (in March, June, September, and December), rather than once a month\nSPOTLIGHT, Con Edison's newsletter\n\nCommunity partnerships\nCon Edison contributes substantial funding and volunteer hours to many non-profit organizations and learning centers including New York Botanical Garden, Hudson Valley Groundworks Science Barge, Teatown Reservation, Jay Heritage Center, and the Intrepid Sea, Air & Space Museum.\n\nLeadership and associations\nTimothy P. Cawley, Chairman, president and Chief Executive Officer, Consolidated Edison, Inc.\nMatt Ketschke, president, Con Edison of New York\nMichele O'Connell, president and CEO, Orange and Rockland Utilities, Inc.\nStuart Nachmias, president and CEO, Con Edison Transmission\nRobert Sanchez, president, Shared Services\nKirkland Andrews, senior vice president and chief financial officer\nMary E. Kelly, senior vice president and chief information officer\nJennifer Hensley, senior vice president, Corporate Affairs\nYukari Saegusa, vice president, Treasury and Investor Relations\nEdlyn Misquita, vice president and general auditor\nSylvia Dooley, vice president and corporate secretary\nJoseph Miller, vice president, controller and chief accounting officer\nDeneen L. Donnley, senior vice president and general counsel\nScott Sanders, vice president, Business Finance\nEdward L. Conway, ombudsman\nConEd Solutions is a member of Real Estate Board of New York.\n\nMajor accidents and incidents\n1977: All of New York City, with the exception of the Rockaways - which get their power from the Long Island Lighting Company (LILCo) - was blacked out overnight on July 13 and 14, due to lightning strikes on a number of sub-stations and the resulting failures of interconnects in the power grid.\n1989: A steam pipe explosion in Gramercy Park killed three, injured 24, and required the evacuation of a damaged apartment building due to high levels of asbestos in the air.  Workers had failed to drain water from the pipe before turning the steam on. The utility also eventually pleaded guilty to lying about the absence of asbestos contamination, and paid a $2 million fine.\n2001: The Con Edison electricity substation at 7 World Trade Center was destroyed on September 11th as a result of the collapse of Numbers 1 and 2 World Trade Center following a terrorist attack by Al-Qaeda against the United States.\n2004: In Manhattan, stray voltage killed  East Village resident Jodie Lane and her dog when she stepped on a service box that wasn't properly insulated. The corner of East 11th Street and 1st Avenue, where the incident occurred, was given the alternate name of Jodie Lane Place in 2005.\n2006: After the blackout in Queens, the company was criticized by public officials for a poor record in the restoration of service to its customers.\n2007: On July 18, an explosion occurred in midtown Manhattan near Grand Central Terminal when an 83-year-old Con Edison steam pipe failed, resulting in one death, over 40 injuries, as well as subway and surface disruptions.\n2007: The day before Thanksgiving, an explosion critically burned Queens resident Kunta Oza when an 80-year-old cast iron gas main ruptured. Oza died on Thanksgiving Day, and her family later settled with Con Edison for $3.75 million.\n2009: Another gas explosion claimed a life in Queens while Con Edison personnel were on the scene. There was a leak in a manhole and a fault in an electrical feeder at the same time. The fault in the feeder caused the explosion due to the sparks being generated. When the mechanic opened the manhole more oxygen entered and the explosion took place. Due to that event, Con Edison has changed its procedure on outside gas leak calls.\n2012:\nOn October 29, flooding from Hurricane Sandy caused a transformer explosion at a Con-Ed plant on New York City's East Side.\nDuring the storm, Con Edison used social media to get outage and restoration information out to customers. The company's Twitter account gained an extra 16,000 followers during the storm.\nCon Edison's subsidiary, Orange & Rockland Utilities, was criticized for its response to Hurricane Sandy. Some customers experienced a loss of electrical power for 11 days.\n2014: On March 12, two apartment buildings exploded in East Harlem after a reported Con Edison gas leak. Eight people were killed in the massive explosion that reduced the conjoining buildings to rubble.\n2018: After 9 p.m. on December 27, a transformer short-circuit at a ConEd power plant in Astoria, Queens shut down La Guardia Airport for several hours - until it switched to back-up generators - caused extensive delays on the #7 subway line, and an outage on Rikers Island, until it, too, reverted to back-up equipment. The incident caused a large portion of the sky in the surrounding area to be lit up by blue light that was caused by arc flashes, in which light-emitting atoms of excited gas, called plasma, are projected into the air. The arc flashes probably lasted only a few minutes, but because of meteorological conditions which caused them to be refracted, they were seen across a large portion of the New York City metropolitan area. There was no explosion or fire connected to the electrical surge, and no reported injuries. The New York Police Department reported that 911 calls increased from 500 in the half-hour before the event to over 3,200 in the 30 minutes afterwards. ConEd is investigating the cause of the surge in equipment that was intended to monitor voltage in the electrical sub-station, but suspects that the problem was a malfunctioning of its relay system. The lights were nicknamed the \"Astoria Borealis\" on Twitter.\n2019: On the night of July 13 a significant portion of Manhattan saw a blackout due to a Consolidated Edison cable that burnt out in a transformer on West End Avenue. The blackout, which lasted for about three hours, shut down a number of subway stations, much of the West Side from the 40s to 72nd Street, parts of Times Square and Rockefeller Center, and other areas, resulting in an estimated 73,000 customers losing power. The outage fell on the anniversary of the 1977 blackout, where most of the city lost power.\n2020: During the COVID-19 pandemic in the United States, 170 Con Edison employees tested positive for COVID-19 and three died. Consolidated Edison said they would not shut off service due to non-payment related to the health crisis and would waive any new late-payment charges for customers.\n\nBribery prosecution\nOn January 14, 2009, eleven Con Edison supervisors were arrested for demanding more than $1 million in kickbacks related to work done by a construction company that was repairing the Midtown steam pipe eruption of 2007. According to federal prosecutors, the employees had approved payment for work that was unnecessary or not performed and promised faster payment for some work performed by the construction company in exchange for the bribes. The FBI had two retired Con Edison employees and the president of the construction company wear recording devices that recorded the suspects demanding bribes of between $1000 and $5000. Later that year Con Edison sued Brendan Maher, one of the construction supervisors who was arrested and later admitted to taking bribes that the utility company claimed amounted to $10,000.\nIn April 2016, Con Edison agreed to pay over $171 million, about 1.5% of its annual revenue, back to its customers in compensation for harm resulting from the bribery. The Public Service Commission had found that Con Edison failed to supervise the employees. Con Edison admitted no wrongdoing.\n\nHonors and criticism\nIn March 2002, Fortune magazine named the company as one of \"America's Most Admired Companies\" in the publication's newest corporate ranking survey. In 2003, Con Edison ranked second on the top ten list for electric and gas utilities.\nIn December 2011, the non-partisan organization Public Campaign released a report criticizing ConEd for spending $1.8 million on lobbying and not paying any taxes during 2008–2010, instead getting $127 million in tax rebates, despite making a profit of $4.2 billion, and increasing executive pay by 82% to $17.4 million in 2010 for its top five executives.\nIn 2014, Con Edison was named the #1 utility and #16 overall among corporations, in Newsweek's Green Rankings, and one of the 50 best companies for Latinas by Latina Style Magazine. In its \"Best of the Best\" issue in 2015, Hispanic Network Magazine named the company a top employer among energy, gas, and oil companies. Con Edison was also selected as one of the top regional utilities by DiversityInc magazine in 2014. In 2016, the company was listed among America's best large employers by Forbes.\nIn February 2021, The Energy and Policy Institute criticized Con Edison for touting clean energy while investing in Gas Infrastructure.  This is unclean fracked gas.  (Fracked gas is methane gas produced by hydraulic fracturing.)  The article explained, \"A recent analysis of utility executive compensation by the Energy and Policy Institute found that Con Edison’s executive compensation policies include renewable energy growth as components of broader goals, but do not reward executives for reducing greenhouse gas emissions.\n\nStop tags\nWhen a New York City contractor is unable to repair a reported nonfunctioning or malfunctioning street light, traffic light or pedestrian Walk/Don't Walk light because of a failure in the power to the affected unit, a stop tag is assigned by Con Ed. When a caller to NYC's 311 asks for followup information about a reported outage, they're told the stop tag number, and told to call Con Ed at 800-752-6633 (800-75-CON-ED).\nThe New York Times wrote that it can take over two years for some repairs. Sometimes an entire fixture must be removed, repaired, then returned. Other times the streets must be torn up to replace underground wiring. Temporary fixes, using what was described as \"nothing more than overhead extension cords\" (called \"Shunts\") at times are left in place for an extended period. In 2017 Con Ed committed to repair \"at least 90% ... within 90 days.\"\n\nAdaptive re-use of former Con Ed buildings\nA former Con Edison building on West 53rd Street in Manhattan was converted first into the studio for the television game show Let's Make a Deal, and later into a recording studio called \"Power Station\" because of its Edison history. In 1996, the studio was renamed Avatar Studios and then in 2017 back to \"Power Station\".\nIn 1978, Con Edison sold the Excelsior Power Company Building, a former substation on Gold Street in Manhattan's Financial District. It was renovated into an apartment building, and became a New York City designated landmark in 2016.\n\nSee also\nReferences\nExternal links\n\nCon Edison official website\nOrange and Rockland Utilities official website\nConsolidated Edison Inc. (Holding Company) official website\nBusiness data for Consolidated Edison, Inc.:",
  "clean_text": "Consolidated Edison, Inc., commonly known as Con Edison (stylized as conEdison) or ConEd, is an energy company based in New York City. It is one of the largest investor-owned energy companies in the United States, with approximately $12 billion in annual revenues as of 2017, and over $62 billion in assets. The company provides a wide range of energy-related products and services to its customers through its subsidiaries: Consolidated Edison Company of New York, Inc. (CECONY), a regulated utility providing electric and gas service in New York City and Westchester County, New York, and steam service in the borough of Manhattan; Orange and Rockland Utilities, Inc., a regulated utility serving customers in a 1,300-square-mile (3,400 km2) area in southeastern New York and northern New Jersey; and, Con Edison Transmission, Inc., which invests in electric and natural gas transmission projects. In 2015, electric revenues accounted for 70.35% of consolidated sales (70.55% in 2014); gas revenues 13.61% (14.96% in 2014); steam revenues 5.01% (4.86% in 2014); and non-utility revenues of 11.02% (9.63% in 2014). History On March 23, 1823, \"The New-York Gas light Company\" was incorporated by the 46th New York State Legislature, creating the earliest corporate predecessor of Consolidated Edison. Founding directors included Samuel Leggett and Henry Eckford, respectively, a noted banker and large real estate holder. On May 12, 1823, the New York Gas Light Company received the exclusive privilege to lay gas pipes in the streets of New York City south of Grand Street. A year later, it was listed on the New York Stock Exchange (NYSE). It holds the record as the longest listed stock on the NYSE. Due to the Board of Aldermen's authority to grant franchises in the City of New York in the early to mid-19th century, interaction with Tammany Hall was required to expand the business. By William M. Tweed's reign in the late 1860s as the boss of Tammany Hall, the power to authorize franchises lay with the County Board of Supervisors, of which Tweed had been a member. By 1871, Tweed was a member of the board of the Harlem Gas Light Company, a precursor to the Consolidated Edison Company. On November 10, 1884, New York Gas Light merged with the Manhattan Gas Light Company (inc. 1830), Metropolitan Gas Light Company (inc. 1848), Municipal Gas Light Company (inc. 1874), Knickerbocker Gas Light Company (inc. 1876), and Harlem Gas Light Company (inc. 1855) to form the Consolidated Gas Company of New York. In 1901, the Consolidated Gas Company bought Edison Illuminating Company, which had been founded by Thomas Edison in 1880, first supplying electricity to 59 customers in a 1-square-mile (2.6 km2) area in lower Manhattan. After the \"war of currents\", more than 30 companies were generating and distributing electricity in New York City and Westchester County. But by 1920 there were far fewer, and Consolidated Gas's electricity arm, then called the New York Edison Company, was the leader. On February 18, 1936, an annual report issued by Consolidated Gas Company of New York, Inc. revealed that roughly 75% of their gross operating revenue came from electricity, leading to discussion by the company's officers about changing the company's name to better reflect its nature. On March 16, 1936, stockholders of the Consolidated Gas Company of New York, Inc. voted to change the company's name to Consolidated Edison Company of New York, Inc. The New York Steam Company began providing service in Lower Manhattan in 1882. Con Edison bought it in 1954, and now operates the largest commercial steam system in the world, providing steam service to nearly 1,600 commercial and residential establishments in Manhattan from Battery Park to 96th Street. Consolidated Edison acquired or merged with more than a dozen companies between 1936 and 1960. Con Edison today is the result of acquisitions, dissolutions, and mergers of more than 170 individual electric, gas, and steam companies. Consolidated Edison acquired land on the Hudson River in Buchanan, New York, in 1954 for the Indian Point nuclear power plant. The first reactor (Indian Point 1) began generating power on September 16, 1962. The reactor was shut down on October 31, 1974, because the emergency core cooling system did not meet regulatory requirements. The company built two more reactors at Indian Point during the 1970s: Indian Point 2 and 3. Indian Point 3 was sold to the New York Power Authority in 1975. Entergy acquired Indian Point 2 in November 2000, nine months after a steam generator leak. With the sale of Indian Point 2, the last power plant it owned, Consolidated Edison, Inc. became primarily an energy distributor. On January 1, 1998, following the deregulation of the utility industry in New York State, a holding company, Consolidated Edison, Inc., was formed. It is one of the nation's largest investor-owned energy companies, with approximately $13 billion in annual revenues and $47 billion in assets. The company provides a wide range of energy-related products and services to its customers through two regulated utility subsidiaries and three competitive energy businesses. Under several corporate names, the company has been traded on the NYSE without interruption since 1824—longer than any other NYSE stock. Its largest subsidiary, Consolidated Edison Company of New York, Inc., provides electric, gas, and steam service to more than 3 million customers in New York City and Westchester County, New York, an area of 660 square miles (1,700 km2) with a population of nearly 9 million. Also in 1998, Consolidated Edison, Inc. acquired Orange & Rockland Utilities, which is operated separately. Con Edison had invested $3 billion in solar and wind projects. In September 2017 it was announced that the company would invest $1.25 billion in \"renewable energy production facilities over the next three years.\" The company's \"renewable portfolio\" contained more than 1.5 gigawatts of operating capacity. Seventy-five percent of that capacity came from solar energy. Clean energy accounted for around eight percent of the company's earnings, as of fall 2017. Con Edison sold its clean energy business to RWE in 2023. Systems Clean energy To support electric vehicles, Con Edison partnered with the company FleetCarma to provide $500 in rewards to owners of electric vehicles in New York City and Westchester County, New York. Through this program, Con Edison pays customers to charge their vehicles when energy demand is low. Electrical The Con Edison electrical transmission system utilizes voltages of 138 kilovolts (kV), 345 kV, and 500 kV. The company has two 345 kV interconnections with upstate New York that enable it to import power from Hydro-Québec in Canada and one 345 kV interconnection each with Public Service Electric and Gas (PSE&G) in New Jersey and Long Island. Con Edison's connection with Hydro-Québec is via a series of transmission lines owned by the New York Power Authority and neighboring utilities; a more direct connection via the Champlain Hudson Power Express HVDC line is expected to come online in 2025. Con Edison is also interconnected with PSE&G via the Branchburg-Ramapo 500 kV line. Con Ed's distribution voltages are 33 kV, 27 kV, 13 kV, and 4 kV. The 93,000 miles (150,000 km) of underground cable in the Con Edison system could wrap around the Earth 3.6 times. Nearly 36,000 miles (58,000 km) of overhead electric wires complement the underground system—enough cable to stretch between New York and Los Angeles 13 times. Gas The Con Edison gas system has nearly 7,200 miles (11,600 km) of pipes—if laid end to end, long enough to reach Paris and back to New York City, and serves Westchester County, the Bronx, Manhattan, and parts of Queens. Gas service in Brooklyn, Staten Island, and the rest of Queens is provided by National Grid USA's New York City operations, except the Rockaway peninsula, which is serviced by National Grid's Long Island operations. The average volume of gas that travels through Con Edison's gas system annually could fill the Empire State Building nearly 6,100 times. Steam Con Edison produces 30 billion pounds of steam each year through its seven power plants which boil water to 1,000 °F (538 °C) before distributing it to hundreds of buildings in the New York City steam system, which is the biggest district steam system in the world. Steam traveling through the system is used to heat and cool some of New York's most famous addresses, including the United Nations complex, the Empire State Building, and the Metropolitan Museum of Art. Metering The Smart Meter Project was awarded to Aclara Smart Grid Solutions (electric) and the majority of the rollout was completed in 2022 with several thousand meters still needing to be changed in 2023 due to customer access issues. ConEd utilized Aclara's metering products for field installation. Over five million electric and gas meters were replaced in this project. Lime green-colored seals were used on electric meters to indicate that the meter was changed by a contractor. Programs and resources ConEd offers a variety of programs and resources for its customers and stakeholders, organized in such categories as, \"For Renters\", \"For Residential Owners\", \"For Small & Medium Businesses\", \"For Commercial & Industrial\", \"Business Partners\", \"Investors\", \"Community Affairs\", and \"Municipalities\". Examples of such resources include: CONCERN Program, which offers eligible customers a specially trained representative and advice about government aid programs, safety tips, and ways to save money on one's energy bill Quarterly Billing Plan, which allows senior citizens, whose Con Edison bills are less than $420 a year, to receive bills once every three months (in March, June, September, and December), rather than once a month SPOTLIGHT, Con Edison's newsletter Community partnerships Con Edison contributes substantial funding and volunteer hours to many non-profit organizations and learning centers including New York Botanical Garden, Hudson Valley Groundworks Science Barge, Teatown Reservation, Jay Heritage Center, and the Intrepid Sea, Air & Space Museum. Leadership and associations Timothy P. Cawley, Chairman, president and Chief Executive Officer, Consolidated Edison, Inc. Matt Ketschke, president, Con Edison of New York Michele O'Connell, president and CEO, Orange and Rockland Utilities, Inc. Stuart Nachmias, president and CEO, Con Edison Transmission Robert Sanchez, president, Shared Services Kirkland Andrews, senior vice president and chief financial officer Mary E. Kelly, senior vice president and chief information officer Jennifer Hensley, senior vice president, Corporate Affairs Yukari Saegusa, vice president, Treasury and Investor Relations Edlyn Misquita, vice president and general auditor Sylvia Dooley, vice president and corporate secretary Joseph Miller, vice president, controller and chief accounting officer Deneen L. Donnley, senior vice president and general counsel Scott Sanders, vice president, Business Finance Edward L. Conway, ombudsman ConEd Solutions is a member of Real Estate Board of New York. Major accidents and incidents 1977: All of New York City, with the exception of the Rockaways - which get their power from the Long Island Lighting Company (LILCo) - was blacked out overnight on July 13 and 14, due to lightning strikes on a number of sub-stations and the resulting failures of interconnects in the power grid. 1989: A steam pipe explosion in Gramercy Park killed three, injured 24, and required the evacuation of a damaged apartment building due to high levels of asbestos in the air. Workers had failed to drain water from the pipe before turning the steam on. The utility also eventually pleaded guilty to lying about the absence of asbestos contamination, and paid a $2 million fine. 2001: The Con Edison electricity substation at 7 World Trade Center was destroyed on September 11th as a result of the collapse of Numbers 1 and 2 World Trade Center following a terrorist attack by Al-Qaeda against the United States. 2004: In Manhattan, stray voltage killed East Village resident Jodie Lane and her dog when she stepped on a service box that wasn't properly insulated. The corner of East 11th Street and 1st Avenue, where the incident occurred, was given the alternate name of Jodie Lane Place in 2005. 2006: After the blackout in Queens, the company was criticized by public officials for a poor record in the restoration of service to its customers. 2007: On July 18, an explosion occurred in midtown Manhattan near Grand Central Terminal when an 83-year-old Con Edison steam pipe failed, resulting in one death, over 40 injuries, as well as subway and surface disruptions. 2007: The day before Thanksgiving, an explosion critically burned Queens resident Kunta Oza when an 80-year-old cast iron gas main ruptured. Oza died on Thanksgiving Day, and her family later settled with Con Edison for $3.75 million. 2009: Another gas explosion claimed a life in Queens while Con Edison personnel were on the scene. There was a leak in a manhole and a fault in an electrical feeder at the same time. The fault in the feeder caused the explosion due to the sparks being generated. When the mechanic opened the manhole more oxygen entered and the explosion took place. Due to that event, Con Edison has changed its procedure on outside gas leak calls. 2012: On October 29, flooding from Hurricane Sandy caused a transformer explosion at a Con-Ed plant on New York City's East Side. During the storm, Con Edison used social media to get outage and restoration information out to customers. The company's Twitter account gained an extra 16,000 followers during the storm. Con Edison's subsidiary, Orange & Rockland Utilities, was criticized for its response to Hurricane Sandy. Some customers experienced a loss of electrical power for 11 days. 2014: On March 12, two apartment buildings exploded in East Harlem after a reported Con Edison gas leak. Eight people were killed in the massive explosion that reduced the conjoining buildings to rubble. 2018: After 9 p.m. on December 27, a transformer short-circuit at a ConEd power plant in Astoria, Queens shut down La Guardia Airport for several hours - until it switched to back-up generators - caused extensive delays on the #7 subway line, and an outage on Rikers Island, until it, too, reverted to back-up equipment. The incident caused a large portion of the sky in the surrounding area to be lit up by blue light that was caused by arc flashes, in which light-emitting atoms of excited gas, called plasma, are projected into the air. The arc flashes probably lasted only a few minutes, but because of meteorological conditions which caused them to be refracted, they were seen across a large portion of the New York City metropolitan area. There was no explosion or fire connected to the electrical surge, and no reported injuries. The New York Police Department reported that 911 calls increased from 500 in the half-hour before the event to over 3,200 in the 30 minutes afterwards. ConEd is investigating the cause of the surge in equipment that was intended to monitor voltage in the electrical sub-station, but suspects that the problem was a malfunctioning of its relay system. The lights were nicknamed the \"Astoria Borealis\" on Twitter. 2019: On the night of July 13 a significant portion of Manhattan saw a blackout due to a Consolidated Edison cable that burnt out in a transformer on West End Avenue. The blackout, which lasted for about three hours, shut down a number of subway stations, much of the West Side from the 40s to 72nd Street, parts of Times Square and Rockefeller Center, and other areas, resulting in an estimated 73,000 customers losing power. The outage fell on the anniversary of the 1977 blackout, where most of the city lost power. 2020: During the COVID-19 pandemic in the United States, 170 Con Edison employees tested positive for COVID-19 and three died. Consolidated Edison said they would not shut off service due to non-payment related to the health crisis and would waive any new late-payment charges for customers. Bribery prosecution On January 14, 2009, eleven Con Edison supervisors were arrested for demanding more than $1 million in kickbacks related to work done by a construction company that was repairing the Midtown steam pipe eruption of 2007. According to federal prosecutors, the employees had approved payment for work that was unnecessary or not performed and promised faster payment for some work performed by the construction company in exchange for the bribes. The FBI had two retired Con Edison employees and the president of the construction company wear recording devices that recorded the suspects demanding bribes of between $1000 and $5000. Later that year Con Edison sued Brendan Maher, one of the construction supervisors who was arrested and later admitted to taking bribes that the utility company claimed amounted to $10,000. In April 2016, Con Edison agreed to pay over $171 million, about 1.5% of its annual revenue, back to its customers in compensation for harm resulting from the bribery. The Public Service Commission had found that Con Edison failed to supervise the employees. Con Edison admitted no wrongdoing. Honors and criticism In March 2002, Fortune magazine named the company as one of \"America's Most Admired Companies\" in the publication's newest corporate ranking survey. In 2003, Con Edison ranked second on the top ten list for electric and gas utilities. In December 2011, the non-partisan organization Public Campaign released a report criticizing ConEd for spending $1.8 million on lobbying and not paying any taxes during 2008–2010, instead getting $127 million in tax rebates, despite making a profit of $4.2 billion, and increasing executive pay by 82% to $17.4 million in 2010 for its top five executives. In 2014, Con Edison was named the #1 utility and #16 overall among corporations, in Newsweek's Green Rankings, and one of the 50 best companies for Latinas by Latina Style Magazine. In its \"Best of the Best\" issue in 2015, Hispanic Network Magazine named the company a top employer among energy, gas, and oil companies. Con Edison was also selected as one of the top regional utilities by DiversityInc magazine in 2014. In 2016, the company was listed among America's best large employers by Forbes. In February 2021, The Energy and Policy Institute criticized Con Edison for touting clean energy while investing in Gas Infrastructure. This is unclean fracked gas. (Fracked gas is methane gas produced by hydraulic fracturing.) The article explained, \"A recent analysis of utility executive compensation by the Energy and Policy Institute found that Con Edison’s executive compensation policies include renewable energy growth as components of broader goals, but do not reward executives for reducing greenhouse gas emissions. Stop tags When a New York City contractor is unable to repair a reported nonfunctioning or malfunctioning street light, traffic light or pedestrian Walk/Don't Walk light because of a failure in the power to the affected unit, a stop tag is assigned by Con Ed. When a caller to NYC's 311 asks for followup information about a reported outage, they're told the stop tag number, and told to call Con Ed at 800-752-6633 (800-75-CON-ED). The New York Times wrote that it can take over two years for some repairs. Sometimes an entire fixture must be removed, repaired, then returned. Other times the streets must be torn up to replace underground wiring. Temporary fixes, using what was described as \"nothing more than overhead extension cords\" (called \"Shunts\") at times are left in place for an extended period. In 2017 Con Ed committed to repair \"at least 90% ... within 90 days.\" Adaptive re-use of former Con Ed buildings A former Con Edison building on West 53rd Street in Manhattan was converted first into the studio for the television game show Let's Make a Deal, and later into a recording studio called \"Power Station\" because of its Edison history. In 1996, the studio was renamed Avatar Studios and then in 2017 back to \"Power Station\". In 1978, Con Edison sold the Excelsior Power Company Building, a former substation on Gold Street in Manhattan's Financial District. It was renovated into an apartment building, and became a New York City designated landmark in 2016."
}