{
  "ticker": "EIX",
  "cik": "0000827052",
  "company_name": "Edison International",
  "corrected_name": "Edison International",
  "wiki_title_used": "Edison International",
  "exists": true,
  "raw_text": "Edison International is a public utility holding company based in Rosemead, California. Its subsidiaries include Southern California Edison, and unregulated non-utility business assets Edison Energy. Edison's roots trace back to Holt & Knupps, a company founded in 1886 as a provider of street lights in Visalia, California.\n\nHistory\nThe company was first incorporated in 1909 as Southern California Edison Company after Southern California acquired the assets of Edison Electric Company; it was known as Southern California Edison until 1996, when it adopted its current name in recognition of its growing business abroad and in other industry sectors.  Edison first became a holding company in 1988 when it made a small change to its original name, becoming known as SCEcorp.\nEdison International acquired the naming rights for the Anaheim Angels' stadium (previously known as Anaheim Stadium) in 1998, in a deal running for 20 years. The company backed out of the naming rights deal after the 2003 season, and the stadium is now called Angel Stadium.\nIn 2001, Edison's main holding, Southern California Edison, faced bankruptcy after a state senate bill regarding financial assistance came up short by $1 billion.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Edison International:",
  "clean_text": "Edison International is a public utility holding company based in Rosemead, California. Its subsidiaries include Southern California Edison, and unregulated non-utility business assets Edison Energy. Edison's roots trace back to Holt & Knupps, a company founded in 1886 as a provider of street lights in Visalia, California. History The company was first incorporated in 1909 as Southern California Edison Company after Southern California acquired the assets of Edison Electric Company; it was known as Southern California Edison until 1996, when it adopted its current name in recognition of its growing business abroad and in other industry sectors. Edison first became a holding company in 1988 when it made a small change to its original name, becoming known as SCEcorp. Edison International acquired the naming rights for the Anaheim Angels' stadium (previously known as Anaheim Stadium) in 1998, in a deal running for 20 years. The company backed out of the naming rights deal after the 2003 season, and the stadium is now called Angel Stadium. In 2001, Edison's main holding, Southern California Edison, faced bankruptcy after a state senate bill regarding financial assistance came up short by $1 billion."
}