{
  "ticker": "EL",
  "cik": "0001001250",
  "company_name": "Estée Lauder Companies (The)",
  "corrected_name": "The Estée Lauder Companies",
  "wiki_title_used": "The Estée Lauder Companies",
  "exists": true,
  "raw_text": "The Estée Lauder Companies Inc. ( EST-ay LAW-dər) is an American multinational cosmetics company, a manufacturer and marketer of makeup, skincare, perfume, and hair care products, based in Midtown Manhattan, New York City. It is the second largest cosmetics company in the world after L'Oréal. The company owns a diverse portfolio of brands, including La Mer, Jo Malone London, Clinique and Tom Ford Beauty, among many more, distributed internationally through both digital commerce and retail channels.\n\nHistory\nThe company began in 1946 when Estée Lauder and her husband Joseph began producing cosmetics in New York City. They first carried only four products: Cleansing Oil, Skin Lotion, Super Rich All-purpose Creme, and Creme Pack. Two years later, in 1948 they established their first department store account with Saks Fifth Avenue in Manhattan.\nOver the next 15 years, they expanded the range and continued to sell their products in the United States. In 1960, the company started its first international account in the London department store Harrods. The following year it opened an office in Hong Kong.\nIn 1964, they introduced Aramis, a line of fragrance and grooming products for men named after an exotic Turkish root originally used as an aphrodisiac. In 1967, Estée Lauder herself was named one of ten Outstanding Women in Business in the United States by business and financial editors. This was followed by a Spirit of Achievement Award from Albert Einstein College of Medicine at Yeshiva University in 1968. In that year, the company expanded again, opening Clinique,  a dermatologist-guided (Dr. Norman Orentreich), allergy-tested, fragrance-free cosmetic brand.\nEstée Lauder's Clinique brand became the first women's cosmetic company to introduce a second line for men when, in 1976, they began a separate line called \"Skin Supplies for Men\", which continues to be sold at Clinique counters worldwide. In 1981, the company's products became available in the Soviet Union.\nIn the 1990s, brand acquisitions and licensing agreements contributed to explosive growth as the company transformed from a family-owned business to a publicly traded, family-controlled organization. The decade opened with the creation of Origins – the first wellness brand in U.S. department stores. The first licensing agreement for fragrances was with fashion designer Tommy Hilfiger in 1993, followed by Kiton, an Italian fashion house (1995), and with American fashion designer Donna Karan (1997).\nBrand acquisitions began with an investment in the Toronto-based MAC Cosmetics in 1994, which the company then acquired in 1998. Bobbi Brown Cosmetics, designed by the celebrated makeup artist, was acquired in 1995, as was La Mer – along with the original recipe for its supreme luxury product, Crème de la Mer, containing the nutrient-rich Miracle Broth. The company ventured into its first hair care and holistic beauty brand with Aveda in 1997. The fragrance house Jo Malone London was acquired in 1999.\nOn November 16, 1995, the Estée Lauder Companies went public on the New York Stock Exchange at $26 a share ($6.50 on a post-split basis; equivalent to $50 and $10 in 2024).\nAcquisitions and licensing continued in the 2000s as the Estée Lauder Companies bought a majority interest in the hair salon Bumble and bumble and completed its acquisition in 2006; an exclusive global licensing agreement was signed with fashion designer Michael Kors (2003). Designer Tom Ford began a project with the company and later an agreement was signed with him (2005) to develop and distribute fragrances and cosmetics under the Tom Ford Beauty brand.\nOn July 1, 2010, the company acquired Smashbox Beauty Cosmetics, Inc., a brand created in Smashbox Studios in Culver City, California, by brothers Dean and Davis Factor (as in Max).\n\nOn October 28, 2011, Aramis and Designer Fragrances, a division of the Estée Lauder Companies Inc., and Tory Burch LLC announced the signing of a multiyear agreement for the exclusive worldwide license of the Tory Burch fragrance business. This partnership marked Tory Burch's first step into the beauty industry. The first Tory Burch fragrance products were introduced in 2013.\nIn 2012, the company launched AERIN Beauty, a luxury lifestyle beauty and fragrance brand inspired by the signature style of its founder, Aerin Lauder.\nIn 2014, the company acquired two insider beauty brands, RODIN olio lusso, a skincare brand known for its \"Luxury Face Oil\", and Le Labo, a fragrance and sensory lifestyle brand. Later that year, the company also made its first investment in India by buying a minority stake in Forest Essentials, a luxury cosmetics company specializing in Ayurvedic products. In 2015, the company acquired Editions de Parfums Frédéric Malle, a fragrance brand, and GLAMGLOW, a Hollywood skin care brand.\nIn 2016, the company acquired Becca Cosmetics, its first color cosmetic group acquisition since Smashbox in 2010. In November 2016, the company made its largest acquisition to date by acquiring California-based cosmetics company Too Faced for $1.45 billion.\nIn 2019, the company acquired Dr. Jart+. Founded in Korea in 2004, Dr. Jart+ pioneered the marketing of BB cream as a cosmetic.\nIn 2021, the company acquired Canadian-based Deciem Beauty Group Inc. In 2022, Estée Lauder opened a 300,000-square-foot (2.8-hectare) distribution center in Galgenen, Switzerland.\nIn November 2022, the company announced it was to acquire the designer fashion house Tom Ford in a deal worth $2.8bn, with Ford remaining as creative director until at least 2023.\nIn 2024, the company announced its partnership with Messika.\nIn June 2024, Estée Lauder completed the acquisition of DECIEM Beauty Group.\nIn October 2024, the company officially opened its Global Fragrance Atelier inside La Maison des Parfums in Paris, establishing an AI-enabled, advanced technology innovation hub dedicated to accelerating the development of its luxury and prestige fragrance portfolio.\n\nResponse to the COVID-19 pandemic\nIn response to the COVID-19 pandemic the Estée Lauder Companies announced on August 20, 2020, a reduction in their workforce by 1,500 to 2,000 personnel worldwide, or about 3 percent of total employees. Most of the reductions will be support workers and store employees. The company also announce they would be closing approximately 10 to 15 percent of their stores, close in-store beauty counters, and focus more on digital operations.\n\nMarketing\nThe Estée Lauder company has many brands and Estée Lauder is one of the brands. It has had sometimes high-profile spokesmodels, sometimes referred to simply as 'faces'. Past 'faces' for Estée Lauder include Karen Graham, Bruce Boxleitner, Shaun Casey, Willow Bay, Paulina Porizkova, Elizabeth Hurley, Carolyn Murphy, supermodel Liya Kebede – the first African 'face' of Estée Lauder, Anja Rubik, and actress Gwyneth Paltrow. As of 2008 the main spokesmodel for Estée Lauder was supermodel Hilary Rhoda. In 2010, the company added three more faces to the roster, Chinese model Liu Wen, Puerto Rican model Joan Smalls, and French model Constance Jablonski.\nIn 2015, Estée Lauder signed model Kendall Jenner to promote the brand.\nIn 2017, the company announced Violette Serrat as their Global Beauty Director.\nAlvin Chereskin, the founder of AC&R, was the long-time creative partner of the company.\nCurrent roster of Estée Lauder Global Ambassadors include Ana de Armas, Amanda Gorman, Bianca Brandolini d'Adda, Carolyn Murphy, Grace Elizabeth, Imaan Hammam, Karlie Kloss, Manushi Chhillar and Yang Mi. In 2024, the company announced singer, songwriter and actress, IU, as their first Korean Global Brand Ambassador.\n\nOperations and finances\nFinances\nFor fiscal year 2016, the Estée Lauder Companies achieved net sales of $11.26 billion, a 4% increase compared with $10.78 billion in the prior year. Net earnings for the year were $1.11 billion, a 2% increase compared with $1.09 billion in the previous year, and diluted net earnings per common share rose 5% to $2.96, compared with $2.82 reported in the prior year. As of 2018, Estée Lauder Companies ranked 258 on the Fortune 500 list of the largest United States corporations by revenue.\n\nExecutive management\nLeonard A. Lauder was chairman emeritus. William P. Lauder is the chairman of the board. Fabrizio Freda was president and chief executive officer from 2009 through 2024. As of 2025, Stéphane de la Faverie, the former executive group president, was named president and CEO of ELC.\n\nInternational operations\nJeanette Sarkisian Wagner was president of the company's International Operations division, who quickly introduced the brand's product line to the women of the Soviet Union and China when those countries began to open up in the 1980s and '90s. Under Wagner, the division went from a small and relatively unprofitable arm of Estée Lauder to one that brought in about half of the company's revenue. She oversaw the opening of the company's first location in the USSR one week after the fall of the Berlin Wall. Wagner launched marketing campaigns in over 100 countries for the company.\n\nBreast Cancer Awareness campaign\nIn October 1992, the Breast Cancer Awareness campaign was launched by Evelyn Lauder (Estée's daughter-in-law) who co-created the \"Pink Ribbon\" with Self magazine as a symbol of breast health.\nThe Estée Lauder Companies' annual Breast Cancer Awareness campaign involves all of the 19 brands that make up the Estée Lauder Companies. They collectively represent the Breast Cancer Research Foundation's first and largest corporate supporter. Since 1992, the Estée Lauder Companies' breast cancer campaign has raised more than $89 million globally for research, education, and medical services.\n\nBrands\nThe Estée Lauder Companies brands include:\n\nControversies\nSOPA\nEstée Lauder Companies appeared on lists of major companies supporting SOPA, the controversial, but unsuccessful, Congressional anti-piracy bill that was considered overreaching by critics.\n\nChild labor\nIn 2001, it was reported that children were discovered working in a factory in Cambridge, New York, making products for Origins, one of Estee Lauder's natural products brands. The contracted company was Common Sense Natural Soap & Bodycare, owned by a group led by cult leader Yoneq Gene Spriggs. Estee Lauder said it immediately moved to terminate the contract with the manufacturer it had been in business with for 5 years, stating it was totally unaware prior to the initial inspection.\n\nAnimal testing\nThe Estée Lauder Companies perform non-animal and human volunteer testing to assess product safety and efficacy. Estée Lauder Companies product goes through animal testing where required by law by its country government. The Chinese government requires testing on animals for many cosmetic products. This causes controversy for smaller brands that are \"cruelty free\" but were acquired by Estée Lauder.\n\nBoycott and anti-boycott\nSince at least February 2001, Estée Lauder and its brands have been the target of a boycott campaign led by pro-Palestine activists who have targeted the corporation because of the pro-Israel activities of Ronald Lauder. In June 2003, the San Francisco-based Queers Undermining Israeli Terrorism (QUIT) took up the boycott with their \"Estée Slaughter\" campaign. The boycott has generated an anti-boycott campaign by supporters of Israel.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for The Estée Lauder Companies Inc.: \n40°45′49″N 73°58′22″W",
  "clean_text": "The Estée Lauder Companies Inc. ( EST-ay LAW-dər) is an American multinational cosmetics company, a manufacturer and marketer of makeup, skincare, perfume, and hair care products, based in Midtown Manhattan, New York City. It is the second largest cosmetics company in the world after L'Oréal. The company owns a diverse portfolio of brands, including La Mer, Jo Malone London, Clinique and Tom Ford Beauty, among many more, distributed internationally through both digital commerce and retail channels. History The company began in 1946 when Estée Lauder and her husband Joseph began producing cosmetics in New York City. They first carried only four products: Cleansing Oil, Skin Lotion, Super Rich All-purpose Creme, and Creme Pack. Two years later, in 1948 they established their first department store account with Saks Fifth Avenue in Manhattan. Over the next 15 years, they expanded the range and continued to sell their products in the United States. In 1960, the company started its first international account in the London department store Harrods. The following year it opened an office in Hong Kong. In 1964, they introduced Aramis, a line of fragrance and grooming products for men named after an exotic Turkish root originally used as an aphrodisiac. In 1967, Estée Lauder herself was named one of ten Outstanding Women in Business in the United States by business and financial editors. This was followed by a Spirit of Achievement Award from Albert Einstein College of Medicine at Yeshiva University in 1968. In that year, the company expanded again, opening Clinique, a dermatologist-guided (Dr. Norman Orentreich), allergy-tested, fragrance-free cosmetic brand. Estée Lauder's Clinique brand became the first women's cosmetic company to introduce a second line for men when, in 1976, they began a separate line called \"Skin Supplies for Men\", which continues to be sold at Clinique counters worldwide. In 1981, the company's products became available in the Soviet Union. In the 1990s, brand acquisitions and licensing agreements contributed to explosive growth as the company transformed from a family-owned business to a publicly traded, family-controlled organization. The decade opened with the creation of Origins – the first wellness brand in U.S. department stores. The first licensing agreement for fragrances was with fashion designer Tommy Hilfiger in 1993, followed by Kiton, an Italian fashion house (1995), and with American fashion designer Donna Karan (1997). Brand acquisitions began with an investment in the Toronto-based MAC Cosmetics in 1994, which the company then acquired in 1998. Bobbi Brown Cosmetics, designed by the celebrated makeup artist, was acquired in 1995, as was La Mer – along with the original recipe for its supreme luxury product, Crème de la Mer, containing the nutrient-rich Miracle Broth. The company ventured into its first hair care and holistic beauty brand with Aveda in 1997. The fragrance house Jo Malone London was acquired in 1999. On November 16, 1995, the Estée Lauder Companies went public on the New York Stock Exchange at $26 a share ($6.50 on a post-split basis; equivalent to $50 and $10 in 2024). Acquisitions and licensing continued in the 2000s as the Estée Lauder Companies bought a majority interest in the hair salon Bumble and bumble and completed its acquisition in 2006; an exclusive global licensing agreement was signed with fashion designer Michael Kors (2003). Designer Tom Ford began a project with the company and later an agreement was signed with him (2005) to develop and distribute fragrances and cosmetics under the Tom Ford Beauty brand. On July 1, 2010, the company acquired Smashbox Beauty Cosmetics, Inc., a brand created in Smashbox Studios in Culver City, California, by brothers Dean and Davis Factor (as in Max). On October 28, 2011, Aramis and Designer Fragrances, a division of the Estée Lauder Companies Inc., and Tory Burch LLC announced the signing of a multiyear agreement for the exclusive worldwide license of the Tory Burch fragrance business. This partnership marked Tory Burch's first step into the beauty industry. The first Tory Burch fragrance products were introduced in 2013. In 2012, the company launched AERIN Beauty, a luxury lifestyle beauty and fragrance brand inspired by the signature style of its founder, Aerin Lauder. In 2014, the company acquired two insider beauty brands, RODIN olio lusso, a skincare brand known for its \"Luxury Face Oil\", and Le Labo, a fragrance and sensory lifestyle brand. Later that year, the company also made its first investment in India by buying a minority stake in Forest Essentials, a luxury cosmetics company specializing in Ayurvedic products. In 2015, the company acquired Editions de Parfums Frédéric Malle, a fragrance brand, and GLAMGLOW, a Hollywood skin care brand. In 2016, the company acquired Becca Cosmetics, its first color cosmetic group acquisition since Smashbox in 2010. In November 2016, the company made its largest acquisition to date by acquiring California-based cosmetics company Too Faced for $1.45 billion. In 2019, the company acquired Dr. Jart+. Founded in Korea in 2004, Dr. Jart+ pioneered the marketing of BB cream as a cosmetic. In 2021, the company acquired Canadian-based Deciem Beauty Group Inc. In 2022, Estée Lauder opened a 300,000-square-foot (2.8-hectare) distribution center in Galgenen, Switzerland. In November 2022, the company announced it was to acquire the designer fashion house Tom Ford in a deal worth $2.8bn, with Ford remaining as creative director until at least 2023. In 2024, the company announced its partnership with Messika. In June 2024, Estée Lauder completed the acquisition of DECIEM Beauty Group. In October 2024, the company officially opened its Global Fragrance Atelier inside La Maison des Parfums in Paris, establishing an AI-enabled, advanced technology innovation hub dedicated to accelerating the development of its luxury and prestige fragrance portfolio. Response to the COVID-19 pandemic In response to the COVID-19 pandemic the Estée Lauder Companies announced on August 20, 2020, a reduction in their workforce by 1,500 to 2,000 personnel worldwide, or about 3 percent of total employees. Most of the reductions will be support workers and store employees. The company also announce they would be closing approximately 10 to 15 percent of their stores, close in-store beauty counters, and focus more on digital operations. Marketing The Estée Lauder company has many brands and Estée Lauder is one of the brands. It has had sometimes high-profile spokesmodels, sometimes referred to simply as 'faces'. Past 'faces' for Estée Lauder include Karen Graham, Bruce Boxleitner, Shaun Casey, Willow Bay, Paulina Porizkova, Elizabeth Hurley, Carolyn Murphy, supermodel Liya Kebede – the first African 'face' of Estée Lauder, Anja Rubik, and actress Gwyneth Paltrow. As of 2008 the main spokesmodel for Estée Lauder was supermodel Hilary Rhoda. In 2010, the company added three more faces to the roster, Chinese model Liu Wen, Puerto Rican model Joan Smalls, and French model Constance Jablonski. In 2015, Estée Lauder signed model Kendall Jenner to promote the brand. In 2017, the company announced Violette Serrat as their Global Beauty Director. Alvin Chereskin, the founder of AC&R, was the long-time creative partner of the company. Current roster of Estée Lauder Global Ambassadors include Ana de Armas, Amanda Gorman, Bianca Brandolini d'Adda, Carolyn Murphy, Grace Elizabeth, Imaan Hammam, Karlie Kloss, Manushi Chhillar and Yang Mi. In 2024, the company announced singer, songwriter and actress, IU, as their first Korean Global Brand Ambassador. Operations and finances Finances For fiscal year 2016, the Estée Lauder Companies achieved net sales of $11.26 billion, a 4% increase compared with $10.78 billion in the prior year. Net earnings for the year were $1.11 billion, a 2% increase compared with $1.09 billion in the previous year, and diluted net earnings per common share rose 5% to $2.96, compared with $2.82 reported in the prior year. As of 2018, Estée Lauder Companies ranked 258 on the Fortune 500 list of the largest United States corporations by revenue. Executive management Leonard A. Lauder was chairman emeritus. William P. Lauder is the chairman of the board. Fabrizio Freda was president and chief executive officer from 2009 through 2024. As of 2025, Stéphane de la Faverie, the former executive group president, was named president and CEO of ELC. International operations Jeanette Sarkisian Wagner was president of the company's International Operations division, who quickly introduced the brand's product line to the women of the Soviet Union and China when those countries began to open up in the 1980s and '90s. Under Wagner, the division went from a small and relatively unprofitable arm of Estée Lauder to one that brought in about half of the company's revenue. She oversaw the opening of the company's first location in the USSR one week after the fall of the Berlin Wall. Wagner launched marketing campaigns in over 100 countries for the company. Breast Cancer Awareness campaign In October 1992, the Breast Cancer Awareness campaign was launched by Evelyn Lauder (Estée's daughter-in-law) who co-created the \"Pink Ribbon\" with Self magazine as a symbol of breast health. The Estée Lauder Companies' annual Breast Cancer Awareness campaign involves all of the 19 brands that make up the Estée Lauder Companies. They collectively represent the Breast Cancer Research Foundation's first and largest corporate supporter. Since 1992, the Estée Lauder Companies' breast cancer campaign has raised more than $89 million globally for research, education, and medical services. Brands The Estée Lauder Companies brands include: Controversies SOPA Estée Lauder Companies appeared on lists of major companies supporting SOPA, the controversial, but unsuccessful, Congressional anti-piracy bill that was considered overreaching by critics. Child labor In 2001, it was reported that children were discovered working in a factory in Cambridge, New York, making products for Origins, one of Estee Lauder's natural products brands. The contracted company was Common Sense Natural Soap & Bodycare, owned by a group led by cult leader Yoneq Gene Spriggs. Estee Lauder said it immediately moved to terminate the contract with the manufacturer it had been in business with for 5 years, stating it was totally unaware prior to the initial inspection. Animal testing The Estée Lauder Companies perform non-animal and human volunteer testing to assess product safety and efficacy. Estée Lauder Companies product goes through animal testing where required by law by its country government. The Chinese government requires testing on animals for many cosmetic products. This causes controversy for smaller brands that are \"cruelty free\" but were acquired by Estée Lauder. Boycott and anti-boycott Since at least February 2001, Estée Lauder and its brands have been the target of a boycott campaign led by pro-Palestine activists who have targeted the corporation because of the pro-Israel activities of Ronald Lauder. In June 2003, the San Francisco-based Queers Undermining Israeli Terrorism (QUIT) took up the boycott with their \"Estée Slaughter\" campaign. The boycott has generated an anti-boycott campaign by supporters of Israel."
}