{
  "ticker": "ELV",
  "cik": "0001156039",
  "company_name": "Elevance Health",
  "corrected_name": "Elevance Health",
  "wiki_title_used": "Elevance Health",
  "exists": true,
  "raw_text": "Elevance Health, Inc. is an American multinational health insurance company. Prior to June 2022, Elevance Health was named Anthem, Inc. The company's services include medical, pharmaceutical, dental, behavioral health, long-term care, and disability plans through affiliated companies such as Anthem Blue Cross and Blue Shield, Anthem Blue Cross in California, Wellpoint, and Carelon. It is the largest for-profit managed health care company in the Blue Cross Blue Shield Association. As of 2022, the company had 46.8 million members within its affiliated companies' health plans.\nBased on its 2021 revenues, the company ranked 20th on the 2022 Fortune 500. In 2023, the company's seat in Forbes Global 2000 was 78.\nCarelon Global Solutions, Elevance Health's Business Process Outsourcing (BPO)/Shared Services subsidiary, serves the group's offshore and customer service management. It operates sites in India, Israel, Puerto Rico, the Philippines, United States, and Ireland.\n\nHistory\nAnthem\nIn 1946, Anthem began in Indianapolis, Indiana, as Mutual Hospital Insurance Inc. and Mutual Medical Insurance Inc. The companies grew significantly, controlling 80% of the medical insurance market in Indiana by the 1970s.\nIn 1972, the two firms, then known as Blue Cross of Indiana and Blue Shield of Indiana, entered into a joint operating agreement.\nIn 1985, the two companies merged into Associated Insurance Companies, Inc,, later called, The Associated Group, a holding company, but usage of the name \"Anthem\" persisted.\nIn 1989, the company purchased American General Insurance Co. for $150 million and in 1991, it acquired The Shelby Insurance Co., based in Shelby, Ohio, for $125 million.\nIn 1989, The Associated Group founded Acordia, a brokerage that sold and serviced insurance and employee benefit programs.\nIn 1993, Acordia acquired American Business Insurance for $130 million and the Federal Kemper Insurance Company for $100 million. The Associated Group merged with Southeastern Mutual Insurance Company, the operator of Blue Cross and Blue Shield of Kentucky.\nIn 1994, it sold Raffensperger, Hughes & Co., Inc., Indiana's largest investment bank, to National City Corp.\n\nIn 1995, The Associated Group acquired Community Mutual Insurance, a provider of Blue Cross and Blue Shield insurance plans in Ohio with over 1.9 million policy holders), then set up Anthem Blue Cross and Blue Shield.\nIn 1996, The Associated Group changed its name to Anthem Insurance Company.\nIn August 1997, Anthem acquired Blue Cross and Blue Shield of Connecticut. It also sold Acordia to management.\nIn 1999, Anthem acquired Blue Cross and Blue Shield of New Hampshire and Blue Cross and Blue Shield of Colorado and Nevada, using debt financing. The acquisitions made since 1996 added 850,000 policy holders. Among its customer base were 2.4 million PPO and 964,000 HMO enrollees.\nIn 2000, Anthem acquired Blue Cross Blue Shield of Maine.\nThe Gramm-Leach-Bliley Act of 1999 made it possible for Anthem to undergo demutualization and become a public company via an initial public offering, which made it the fourth largest public managed health care company in the United States.\nIn 2002, Anthem acquired Trigon Healthcare of Virginia, a Blue Cross and Blue Shield plan, the largest insurer in Virginia, for $4.04 billion. Anthem Insurance Company reached 11.9 million members.\n\nBlue Cross of California\nBlue Cross of California was the predecessor of WellPoint Health Network Inc.\nIn 1982, Blue Cross of California was founded with the consolidation of Blue Cross of Northern California (established in 1936) and Blue Cross of Southern California (established in 1937).\nIn 1992, WellPoint was formed to operate Blue Cross of California's managed care business.\nIn January 1993, Blue Cross of California spun off its managed care business into a publicly traded entity, WellPoint Health Networks Inc. Blue Cross of California retained an 80% interest and voting control.\nIn 1996, Blue Cross of California restructured to a for-profit corporation, designating WellPoint Health Networks Inc. as the parent organization.\nIn April 1996, WellPoint completed its acquisition of Massachusetts Mutual Life Insurance Company's group life and health insurance subsidiaries for approximately $380 million, making it the second largest publicly held managed health company in the U.S. with 4 million policyholders.\nIn March 1997, WellPoint acquired the group health and life businesses of John Hancock Financial for $86.7 million. With this acquisition, WellPoint expanded its presence into Michigan, Texas, and the mid-Atlantic, and gained a unit that concentrated on serving the needs of large employers.\nIn 2000, WellPoint acquired PrecisionRx, a mail service pharmacy fulfillment center in Texas.\nIn 2001, WellPoint offered to acquire CareFirst BlueCross BlueShield for $1.37 billion, including $119 million in bonuses to Carefirst executives. In 2003, the offer was rejected by the Maryland insurance commissioner.\nIn March 2000, WellPoint acquired Rush Prudential Health Plans, a Chicago provider, for $204 million. In March 2001, WellPoint acquired Cerulean Companies, the parent company of Blue Cross Blue Shield of Georgia.\nIn 2002, WellPoint acquired RightChoice Managed Care, a Missouri-based company that ran Blue Cross and Blue Shield for part of the state, for $1.5 billion. RightChoice also owned provider network company HealthLink. WellPoint also acquired MethodistCare of Houston, Texas and HealthLink.\nIn 2003, WellPoint acquired Golden West Dental and Vision of Camarillo, California, and Cobalt, including Blue Cross and Blue Shield United of Wisconsin.\nIn November 2004, Wellpoint, Inc. was formed by the merger of Anthem Insurance Company and WellPoint Health Networks Inc. The merger was structured as Anthem acquiring WellPoint Health Networks and renaming itself WellPoint, Inc. WellPoint continued to use 'Anthem' as the brand name under which it operated. It sold its Blue Cross and Blue Shield products in 11 states.\nIn 2005, WellPoint acquired Alexandria, Virginia–based Lumenos, a provider of consumer-driven health care, for $185 million. Lumenos was the pioneer and market leader in consumer-driven health plans. In December, WellPoint acquired WellChoice, a New York City-based Blue Cross Blue Shield provider, for approximately $6.5 billion, making New York the 14th state in which WellPoint is a Blue Cross Blue Shield licensee.\nIn 2007, WellPoint acquired Chicago-based American Imaging Management, a radiology benefit management company that creates software to help physicians choose cost-effective locations for their patients to receive medical imaging tests. WellPoint also acquired Chicago-based American Imaging Management (AIM), the leading radiology benefit management company.\nIn January 2008, Leslie Margolin became the president of California operations. She resigned in July 2010.\nIn 2008, WellPoint acquired Resolution Health, a firm that analyzes patient history for potential medical problems such as adverse drug interactions.\nIn 2009, WellPoint acquired DeCare Dental, a dental insurance firm.\nIn 2011, WellPoint acquired CareMore, a Cerritos, California-based provider of insurance and care centers for elderly patients.\nIn 2012, WellPoint acquired Amerigroup for $4.9 billion, anticipating significant growth due to Medicaid expansion under the Patient Protection and Affordable Care Act.\nIn August 2012, CEO Angela Braly resigned due to pressure from investors.\nOn August 13, 2014, WellPoint announced it intended to change its name to Anthem, Inc., effective in December.\n\nAnthem, Inc.\nIn February 2015, the company acquired Simply Healthcare Holdings, a Medicaid and Medicare managed care company based in Florida.\nIn June 2015, Anthem made an offer to acquire Cigna for more than $54 billion in cash and stock. In February 2017, United States district court Judge Amy Berman Jackson blocked the Cigna merger on grounds of anti-competitive practices. On February 14, Cigna called off its merger agreement with Anthem.\nIn October 2017, Anthem announced that it would not renew its pharmacy benefit management (PBM) relationship with Express Scripts saying it had been overcharged $3 billion and that instead, Anthem would eventually handle the PBM process itself through its new IngenioRx unit. Anthem announced that it would enter a 5-year contract with CVS Health. Cigna then announced plans in March 2018 to acquire Express Scripts for $58 billion.\nOn November 6, 2017, Gail Koziara Boudreaux was named CEO.\nIn 2018, the company announced a $20 million expansion of its headquarters and the signing of a lease in Atlanta for its technology center.\nIn March 2020, Anthem announced the acquisition of Beacon Health Options, and independently held behavioral health organization.\nOn February 2, 2021, Anthem announced the acquisition of InnovaCare Health's Puerto Rico subsidiaries including MMM Holdings, LLC (“MMM”) and its Medicare Advantage (MA) plan MMM Healthcare, LLC as well as affiliated companies and Medicaid plan.\nIn November 2021, Anthem announced the acquisition of Integra Managed Care in New York. The acquisition of the New York-based international health insurance company was completed on May 5, 2022.\nOn June 28, 2022, Anthem announced a change of its corporate name to Elevance Health, Inc. and also changed its stock ticker symbol from \"ANTM\" to \"ELV\".\n\nElevance Health\nOn January 23, 2023, Elevance announced that it entered a definitive agreement to acquire Blue Cross and Blue Shield of Louisiana, increasing Elevance's footprint to 15 states and adding 1.9 million new members.\nIn 2023, Elevance announced that it would rebrand its Amerigroup business as Wellpoint starting in 2024.\nAs of 2025, Elevance subsidiaries Carelon Behavioral Health and Anthem Blue Cross and Blue Shield are the subject of three lawsuits in New York and Connecticut alleging that they operate ghost networks.\n\nSubsidiaries\nElevance Health includes the following subsidiaries:\n\nAmerigroup\nDistrict of Columbia (Medicaid)\nGeorgia (Medicaid)\nNew Mexico (Medicare Advantage)\nAnthem Blue Cross\nCalifornia\nBlue Cross of California Partnership Plan (Medicaid)\nNew York (upstate)\nAnthem Blue Cross Blue Shield\nColorado\nConnecticut\nGeorgia\nIndiana\nKentucky\nAnthem Blue Cross and Blue Shield Medicaid\nMaine\nMissouri (excluding 30 counties in the Kansas City area)\nNevada\nAnthem Blue Cross and Blue Shield Healthcare Solutions (Medicaid)\nNew Hampshire\nNew York (downstate)\nOhio\nVirginia (excluding Alexandria City, Arlington County, Falls Church City, and parts of Fairfax County)\nHealthKeepers (Medicaid)\nWisconsin\nCarelon Behavioral Health\nCarelon Behavioral Health of California\nCarelon Behavioral Health of Kansas\nCarelon Health of Pennsylvania\nCarelon Global Solutions (Business Process Outsourcing/Shared Services)\nFreedom Health\nFlorida\nGolden West Dental & Vision\nCalifornia\nHealthSun\nFlorida\nMMM\nPuerto Rico\nOptimum Healthcare\nFlorida\nSimply Healthcare\nFlorida\nUniCare\nWest Virginia\nWellPoint\nArizona (Medicare Advantage)\nIowa (Medicaid and Medicare Advantage)\nMaryland (Medicaid)\nMassachusetts (government employees)\nNew Jersey (Medicaid and Medicare Advantage)\nTennessee (Medicaid and Medicare Advantage)\nTexas (Medicaid and Medicare Advantage)\nWashington (Medicaid and Medicare Advantage)\n\nJoint ventures\nElevance Health operates joint ventures including:\n\nAnthem | MaineHealth (with MaineHealth)\nMaine\nBlue Medicare Advantage (with Independence Blue Cross)\nPennsylvania\nColorado Community Health Alliance (with Centura Health, Physician Health Partners and Primary Physician Partners)\nColorado\nHealthy Blue Kansas (with Blue Cross and Blue Shield of Kansas and Blue Cross and Blue Shield of Kansas City)\nKansas\nHealthy Blue Louisiana (with Blue Cross Blue Shield of Louisiana)\nLouisiana\nSummit Community Care\nArkansas\nCenters Plan for Healthy Living\nNew York, Florida\n\nQuality of care\nIn 2011, in the category of \"Meeting National Standards of Care,\" California's state patient advocacy office gave Anthem a rating of 2 out of 4 stars. In 2014, it received 3 out of 4 stars in the same category. In 2022, twenty-one of Elevance Health's affiliated Medicaid plans earned accreditation for health equity from the National Committee for Quality Assurance (NCQA).\n\nControversies\nCharitable donations\nIn 2007, WellPoint pledged to spend $30 million over three years, through the company's charitable foundation, to help the uninsured. In March 2010, the Los Angeles Times reported that WellPoint's tax records and website showed that the company had given only $6.2 million by 2009. The company said that the foundation had indeed fulfilled its $30-million commitment by mid-2009, but refused to provide any financial details to support its claim.\n\n2007 DMHC Investigation\nIn 2007, the California Department of Managed Health Care (DMHC) investigated Anthem's policies for revoking (rescinding) health care insurance policies. The DMHC randomly selected 90 instances where Anthem canceled the insurance of policy holders who had been diagnosed with costly or life-threatening illnesses, to find how many of these cancellations were legal. The agency concluded that all these cancellations were illegal.\nIn July 2008, Anthem Blue Cross agreed to a settlement with the California Department of Managed Health Care; however in doing so, WellPoint did not officially admit liability. To resolve allegations of improper policy rescissions (cancellations), WellPoint paid $10 million and reinstated plans for 1,770 policy-holders who were affected by cancelled policies. The company also agreed to provide compensation for any medical debts incurred by these policy-holders.\n\n2010 Reuters Exposé\nIn April 2010, Reuters alleged that Wellpoint \"using a computer algorithm, identified women recently diagnosed with breast cancer and then singled them out for cancellation of their policies.\" The software used immediately triggered fraud investigation for those recently diagnosed with the disease as the company searched for some pretext to drop their policies. Wellpoint argued that its algorithm was scanning for diagnostic codes for conditions that patients might have known about during the insurance application. The story not only caused considerable public outrage, but it also led Secretary of Health and Human Services, Kathleen Sebelius, and President Barack Obama, to call on WellPoint to end the practice.\nIn 2011, Anthem began cancelling policies of members who had been paying premiums with credit cards, sometimes without calling or emailing the member ahead of time.\n\nOpposition to healthcare reform\nIn August 2009, Anthem, the largest for-profit insurer in California, contacted its employees and urged them to get involved to oppose healthcare reforms proposed during the Obama administration. Consumer Watchdog, a nonprofit watchdog organization in Santa Monica, asked California Attorney General Jerry Brown to investigate its claim that WellPoint had illegally pushed workers to write to their elected officials, attend town hall meetings and enlist family and friends to ensure an overhaul that would match the firm's interests. According to Consumer Watchdog, California's labor code directly prohibits coercive communications, including forbidding employers from controlling, coercing or influencing employees' political activities or affiliations. WellPoint had not been contacted by the California attorney general and had not seen any complaint.\nThrough 2010 and into 2011, WellPoint senior executives met monthly with executives of other major health insurers to blunt the effect of the Patient Protection and Affordable Care Act.\n\nPremium increases in Maine\nIn 2009, Anthem Health Plans of Maine, a WellPoint subsidiary, sued the state of Maine for the right to increase premiums further. Since Maine licenses insurance companies through its Bureau of Insurance, Anthem needed the state's permission to raise rates. The Court disagreed with Anthem and found that, unlike with other forms of insurance, the Maine Insurance Code does not require the Superintendent to consider profits.\n\nRate increases in California\nIn February 2010, WellPoint announced that rates would increase on some Anthem Blue Cross individual policies in California by as high as 39%. The announcement resulted in an investigation by regulators from the Federal and California governments. Anthem Blue Cross gained worldwide media attention and became a poster child for the problem of rising cost of health care in the U.S. The rate increase came one year after Anthem had raised rates 68% on individual policy holders.\nTo explain the rate increases, some which were four times the rate of medical inflation, Anthem said the company had experienced a death spiral: the company claimed that with increased unemployment and declining wages, healthy customers dropped their insurance policies. Consequently, the remaining risk pool became sicker and thus more expensive to insure; and, in turn, prices were forced up and pushed more people out of the market.\nIn response to the outrage from politicians and consumers, Anthem postponed the rate increase until May 1, 2010.\nSenator Dianne Feinstein of California proposed giving the Federal government of the United States authority to block insurance premium hikes that it considers to be \"unjustified\".\n\nWellPoint cost reclassification\nOn 17 March 2010, WellPoint announced it was reclassifying some of its administrative costs as medical care costs in order to meet loss ratio requirements under the Patient Protection and Affordable Care Act, which requires insurers to spend at least 80% or 85% of customer premiums on health care services, depending on the type of plan.\n\n2009–2010 data breach\nIn June 2010, Anthem sent letters to 230,000 customers in California warning them that their personal data might have been accessed online via a data breach. After a routine upgrade in October 2009, a third-party vendor stated that all security measures had been properly reinstated, when in fact they had not. As a result, personal information of thousands of coverage applicants who were under the age of 65 was exposed in the open. After a Los Angeles-area woman found that her application for coverage was publicly available, she filed a class action lawsuit against Anthem. While gathering evidence for the proceeding, the woman's lawyers downloaded some confidential customer information from Anthem's website and alerted Anthem about the breach. According to the lawyers, confidential information had remained exposed for five months. Greg Zoeller, Indiana's Attorney General, filed a lawsuit against the company seeking $300,000 in civil penalties for the company alleged failure to notify its consumers about the breach.\n\nDenial of benefits for cancer treatment\nIn May 2014, Anthem Blue Cross refused to pay for the hospitalization of a Sonoma County, California man for stage four cancers, although he had paid Anthem over $100,000 in premiums. Anthem ended up paying for coverage following public outcry.\n\n2015 data breach\nOn February 4, 2015, Anthem, Inc. disclosed that criminal hackers had broken into its servers and potentially stolen over 37.5 million records that contain personally identifiable information from its servers. According to Anthem, Inc., the data breach extended into multiple brands Anthem, Inc. uses to market its healthcare plans, including, Anthem Blue Cross, Anthem Blue Cross and Blue Shield, Blue Cross and Blue Shield of Georgia, Empire Blue Cross and Blue Shield, Amerigroup, Caremore, and UniCare. Healthlink was also victimized. Anthem says the medical information and financial data was not compromised. Anthem has offered free credit monitoring in the wake of the breach. According to Bloomberg News, China may be responsible for this data breach. Michael Daniel, chief adviser on cybersecurity for President Barack Obama, said he would be changing his own password. About 80 million company records were hacked, stoking fears that the stolen data could be used for identity theft. The compromised information contained names, birthdays, medical IDs, social security numbers, street addresses, e-mail addresses, employment information and income data. In June 2017, Anthem agreed to spend $115M to settle allegations that it failed to adequately protect the data of its clients, the sum was to be spent on two years of services to protect victims from identity theft. In 2019, two Chinese nationals were indicted for the breach.\n\n\"Avoidable ER program\"\nBeginning in 2015, Anthem has been implementing and expanding its \"avoidable ER program\" which means not reimbursing ER visits when the cause is not covered by the company. A few patients found out that they had been stuck with bills of over $10,000 that Anthem refused to reimburse. According to a 2013 report by the Journal of the American Medical Association, 87 percent of patients initially triaged as non-urgent ended up with a diagnosis that constituted an emergency. Critics derided the scheme, citing that it was unlawful by federal law to cover a person based on diagnosis, not symptoms. It was also considered unsafe, as it pressured patients to diagnose themselves before going to the ER.\n\nNeglecting complaints\nIn 2017, the California Department of Managed Health Care fined the company $5 million for untimely response to consumer complaints. In 2019, this was settled at $2.8 million.\n\n2019 lawsuit for coercive direct payments\nIn 2019, Sovereign Health pressed charges against Anthem, alleging that it was using direct payments to compel them to join Anthem's network under unfavorable terms. Sovereign owns facilities that treat people with addiction and mental health problems.\n\nDiagnostics fraud\nIn March 2020, Anthem was sued by the Department of Justice. The lawsuit alleges that Anthem had submitted inaccurate diagnostics data in order to obtain increased Medicare reimbursements. In October 2022, a judge ordered Anthem to face the lawsuit.\n\nMedicare Advantage star rating\nIn January 2024, Elevance Health filed a lawsuit with the Department of Health and Human Services (HHS) challenging changes in the Medicare Advantage star rating methodology. Star ratings are tied to key bonus payouts, and due to the new rating system in 2024 ratings have significantly decreased.\n\nFinances\nFor the fiscal year 2017, Anthem reported earnings of US$3.843 billion, with an annual revenue of US$90.039 billion, an increase of 6.1% over the previous fiscal cycle. Anthem's shares traded at over $183 per share, and its market capitalization was valued at over US$69.1 billion in October 2018.\n\nRecognition\nThe company was featured on the S&P Dow Jones Sustainability Index from 2018 to 2022, was named by Fortune as one of the 100 Best Companies to Work For, and was included on the Corporate Equality Index's list of Best Places to Work for LGBTQ Equality from 2015 to 2022.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Elevance Health, Inc.:",
  "clean_text": "Elevance Health, Inc. is an American multinational health insurance company. Prior to June 2022, Elevance Health was named Anthem, Inc. The company's services include medical, pharmaceutical, dental, behavioral health, long-term care, and disability plans through affiliated companies such as Anthem Blue Cross and Blue Shield, Anthem Blue Cross in California, Wellpoint, and Carelon. It is the largest for-profit managed health care company in the Blue Cross Blue Shield Association. As of 2022, the company had 46.8 million members within its affiliated companies' health plans. Based on its 2021 revenues, the company ranked 20th on the 2022 Fortune 500. In 2023, the company's seat in Forbes Global 2000 was 78. Carelon Global Solutions, Elevance Health's Business Process Outsourcing (BPO)/Shared Services subsidiary, serves the group's offshore and customer service management. It operates sites in India, Israel, Puerto Rico, the Philippines, United States, and Ireland. History Anthem In 1946, Anthem began in Indianapolis, Indiana, as Mutual Hospital Insurance Inc. and Mutual Medical Insurance Inc. The companies grew significantly, controlling 80% of the medical insurance market in Indiana by the 1970s. In 1972, the two firms, then known as Blue Cross of Indiana and Blue Shield of Indiana, entered into a joint operating agreement. In 1985, the two companies merged into Associated Insurance Companies, Inc,, later called, The Associated Group, a holding company, but usage of the name \"Anthem\" persisted. In 1989, the company purchased American General Insurance Co. for $150 million and in 1991, it acquired The Shelby Insurance Co., based in Shelby, Ohio, for $125 million. In 1989, The Associated Group founded Acordia, a brokerage that sold and serviced insurance and employee benefit programs. In 1993, Acordia acquired American Business Insurance for $130 million and the Federal Kemper Insurance Company for $100 million. The Associated Group merged with Southeastern Mutual Insurance Company, the operator of Blue Cross and Blue Shield of Kentucky. In 1994, it sold Raffensperger, Hughes & Co., Inc., Indiana's largest investment bank, to National City Corp. In 1995, The Associated Group acquired Community Mutual Insurance, a provider of Blue Cross and Blue Shield insurance plans in Ohio with over 1.9 million policy holders), then set up Anthem Blue Cross and Blue Shield. In 1996, The Associated Group changed its name to Anthem Insurance Company. In August 1997, Anthem acquired Blue Cross and Blue Shield of Connecticut. It also sold Acordia to management. In 1999, Anthem acquired Blue Cross and Blue Shield of New Hampshire and Blue Cross and Blue Shield of Colorado and Nevada, using debt financing. The acquisitions made since 1996 added 850,000 policy holders. Among its customer base were 2.4 million PPO and 964,000 HMO enrollees. In 2000, Anthem acquired Blue Cross Blue Shield of Maine. The Gramm-Leach-Bliley Act of 1999 made it possible for Anthem to undergo demutualization and become a public company via an initial public offering, which made it the fourth largest public managed health care company in the United States. In 2002, Anthem acquired Trigon Healthcare of Virginia, a Blue Cross and Blue Shield plan, the largest insurer in Virginia, for $4.04 billion. Anthem Insurance Company reached 11.9 million members. Blue Cross of California Blue Cross of California was the predecessor of WellPoint Health Network Inc. In 1982, Blue Cross of California was founded with the consolidation of Blue Cross of Northern California (established in 1936) and Blue Cross of Southern California (established in 1937). In 1992, WellPoint was formed to operate Blue Cross of California's managed care business. In January 1993, Blue Cross of California spun off its managed care business into a publicly traded entity, WellPoint Health Networks Inc. Blue Cross of California retained an 80% interest and voting control. In 1996, Blue Cross of California restructured to a for-profit corporation, designating WellPoint Health Networks Inc. as the parent organization. In April 1996, WellPoint completed its acquisition of Massachusetts Mutual Life Insurance Company's group life and health insurance subsidiaries for approximately $380 million, making it the second largest publicly held managed health company in the U.S. with 4 million policyholders. In March 1997, WellPoint acquired the group health and life businesses of John Hancock Financial for $86.7 million. With this acquisition, WellPoint expanded its presence into Michigan, Texas, and the mid-Atlantic, and gained a unit that concentrated on serving the needs of large employers. In 2000, WellPoint acquired PrecisionRx, a mail service pharmacy fulfillment center in Texas. In 2001, WellPoint offered to acquire CareFirst BlueCross BlueShield for $1.37 billion, including $119 million in bonuses to Carefirst executives. In 2003, the offer was rejected by the Maryland insurance commissioner. In March 2000, WellPoint acquired Rush Prudential Health Plans, a Chicago provider, for $204 million. In March 2001, WellPoint acquired Cerulean Companies, the parent company of Blue Cross Blue Shield of Georgia. In 2002, WellPoint acquired RightChoice Managed Care, a Missouri-based company that ran Blue Cross and Blue Shield for part of the state, for $1.5 billion. RightChoice also owned provider network company HealthLink. WellPoint also acquired MethodistCare of Houston, Texas and HealthLink. In 2003, WellPoint acquired Golden West Dental and Vision of Camarillo, California, and Cobalt, including Blue Cross and Blue Shield United of Wisconsin. In November 2004, Wellpoint, Inc. was formed by the merger of Anthem Insurance Company and WellPoint Health Networks Inc. The merger was structured as Anthem acquiring WellPoint Health Networks and renaming itself WellPoint, Inc. WellPoint continued to use 'Anthem' as the brand name under which it operated. It sold its Blue Cross and Blue Shield products in 11 states. In 2005, WellPoint acquired Alexandria, Virginia–based Lumenos, a provider of consumer-driven health care, for $185 million. Lumenos was the pioneer and market leader in consumer-driven health plans. In December, WellPoint acquired WellChoice, a New York City-based Blue Cross Blue Shield provider, for approximately $6.5 billion, making New York the 14th state in which WellPoint is a Blue Cross Blue Shield licensee. In 2007, WellPoint acquired Chicago-based American Imaging Management, a radiology benefit management company that creates software to help physicians choose cost-effective locations for their patients to receive medical imaging tests. WellPoint also acquired Chicago-based American Imaging Management (AIM), the leading radiology benefit management company. In January 2008, Leslie Margolin became the president of California operations. She resigned in July 2010. In 2008, WellPoint acquired Resolution Health, a firm that analyzes patient history for potential medical problems such as adverse drug interactions. In 2009, WellPoint acquired DeCare Dental, a dental insurance firm. In 2011, WellPoint acquired CareMore, a Cerritos, California-based provider of insurance and care centers for elderly patients. In 2012, WellPoint acquired Amerigroup for $4.9 billion, anticipating significant growth due to Medicaid expansion under the Patient Protection and Affordable Care Act. In August 2012, CEO Angela Braly resigned due to pressure from investors. On August 13, 2014, WellPoint announced it intended to change its name to Anthem, Inc., effective in December. Anthem, Inc. In February 2015, the company acquired Simply Healthcare Holdings, a Medicaid and Medicare managed care company based in Florida. In June 2015, Anthem made an offer to acquire Cigna for more than $54 billion in cash and stock. In February 2017, United States district court Judge Amy Berman Jackson blocked the Cigna merger on grounds of anti-competitive practices. On February 14, Cigna called off its merger agreement with Anthem. In October 2017, Anthem announced that it would not renew its pharmacy benefit management (PBM) relationship with Express Scripts saying it had been overcharged $3 billion and that instead, Anthem would eventually handle the PBM process itself through its new IngenioRx unit. Anthem announced that it would enter a 5-year contract with CVS Health. Cigna then announced plans in March 2018 to acquire Express Scripts for $58 billion. On November 6, 2017, Gail Koziara Boudreaux was named CEO. In 2018, the company announced a $20 million expansion of its headquarters and the signing of a lease in Atlanta for its technology center. In March 2020, Anthem announced the acquisition of Beacon Health Options, and independently held behavioral health organization. On February 2, 2021, Anthem announced the acquisition of InnovaCare Health's Puerto Rico subsidiaries including MMM Holdings, LLC (“MMM”) and its Medicare Advantage (MA) plan MMM Healthcare, LLC as well as affiliated companies and Medicaid plan. In November 2021, Anthem announced the acquisition of Integra Managed Care in New York. The acquisition of the New York-based international health insurance company was completed on May 5, 2022. On June 28, 2022, Anthem announced a change of its corporate name to Elevance Health, Inc. and also changed its stock ticker symbol from \"ANTM\" to \"ELV\". Elevance Health On January 23, 2023, Elevance announced that it entered a definitive agreement to acquire Blue Cross and Blue Shield of Louisiana, increasing Elevance's footprint to 15 states and adding 1.9 million new members. In 2023, Elevance announced that it would rebrand its Amerigroup business as Wellpoint starting in 2024. As of 2025, Elevance subsidiaries Carelon Behavioral Health and Anthem Blue Cross and Blue Shield are the subject of three lawsuits in New York and Connecticut alleging that they operate ghost networks. Subsidiaries Elevance Health includes the following subsidiaries: Amerigroup District of Columbia (Medicaid) Georgia (Medicaid) New Mexico (Medicare Advantage) Anthem Blue Cross California Blue Cross of California Partnership Plan (Medicaid) New York (upstate) Anthem Blue Cross Blue Shield Colorado Connecticut Georgia Indiana Kentucky Anthem Blue Cross and Blue Shield Medicaid Maine Missouri (excluding 30 counties in the Kansas City area) Nevada Anthem Blue Cross and Blue Shield Healthcare Solutions (Medicaid) New Hampshire New York (downstate) Ohio Virginia (excluding Alexandria City, Arlington County, Falls Church City, and parts of Fairfax County) HealthKeepers (Medicaid) Wisconsin Carelon Behavioral Health Carelon Behavioral Health of California Carelon Behavioral Health of Kansas Carelon Health of Pennsylvania Carelon Global Solutions (Business Process Outsourcing/Shared Services) Freedom Health Florida Golden West Dental & Vision California HealthSun Florida MMM Puerto Rico Optimum Healthcare Florida Simply Healthcare Florida UniCare West Virginia WellPoint Arizona (Medicare Advantage) Iowa (Medicaid and Medicare Advantage) Maryland (Medicaid) Massachusetts (government employees) New Jersey (Medicaid and Medicare Advantage) Tennessee (Medicaid and Medicare Advantage) Texas (Medicaid and Medicare Advantage) Washington (Medicaid and Medicare Advantage) Joint ventures Elevance Health operates joint ventures including: Anthem | MaineHealth (with MaineHealth) Maine Blue Medicare Advantage (with Independence Blue Cross) Pennsylvania Colorado Community Health Alliance (with Centura Health, Physician Health Partners and Primary Physician Partners) Colorado Healthy Blue Kansas (with Blue Cross and Blue Shield of Kansas and Blue Cross and Blue Shield of Kansas City) Kansas Healthy Blue Louisiana (with Blue Cross Blue Shield of Louisiana) Louisiana Summit Community Care Arkansas Centers Plan for Healthy Living New York, Florida Quality of care In 2011, in the category of \"Meeting National Standards of Care,\" California's state patient advocacy office gave Anthem a rating of 2 out of 4 stars. In 2014, it received 3 out of 4 stars in the same category. In 2022, twenty-one of Elevance Health's affiliated Medicaid plans earned accreditation for health equity from the National Committee for Quality Assurance (NCQA). Controversies Charitable donations In 2007, WellPoint pledged to spend $30 million over three years, through the company's charitable foundation, to help the uninsured. In March 2010, the Los Angeles Times reported that WellPoint's tax records and website showed that the company had given only $6.2 million by 2009. The company said that the foundation had indeed fulfilled its $30-million commitment by mid-2009, but refused to provide any financial details to support its claim. 2007 DMHC Investigation In 2007, the California Department of Managed Health Care (DMHC) investigated Anthem's policies for revoking (rescinding) health care insurance policies. The DMHC randomly selected 90 instances where Anthem canceled the insurance of policy holders who had been diagnosed with costly or life-threatening illnesses, to find how many of these cancellations were legal. The agency concluded that all these cancellations were illegal. In July 2008, Anthem Blue Cross agreed to a settlement with the California Department of Managed Health Care; however in doing so, WellPoint did not officially admit liability. To resolve allegations of improper policy rescissions (cancellations), WellPoint paid $10 million and reinstated plans for 1,770 policy-holders who were affected by cancelled policies. The company also agreed to provide compensation for any medical debts incurred by these policy-holders. 2010 Reuters Exposé In April 2010, Reuters alleged that Wellpoint \"using a computer algorithm, identified women recently diagnosed with breast cancer and then singled them out for cancellation of their policies.\" The software used immediately triggered fraud investigation for those recently diagnosed with the disease as the company searched for some pretext to drop their policies. Wellpoint argued that its algorithm was scanning for diagnostic codes for conditions that patients might have known about during the insurance application. The story not only caused considerable public outrage, but it also led Secretary of Health and Human Services, Kathleen Sebelius, and President Barack Obama, to call on WellPoint to end the practice. In 2011, Anthem began cancelling policies of members who had been paying premiums with credit cards, sometimes without calling or emailing the member ahead of time. Opposition to healthcare reform In August 2009, Anthem, the largest for-profit insurer in California, contacted its employees and urged them to get involved to oppose healthcare reforms proposed during the Obama administration. Consumer Watchdog, a nonprofit watchdog organization in Santa Monica, asked California Attorney General Jerry Brown to investigate its claim that WellPoint had illegally pushed workers to write to their elected officials, attend town hall meetings and enlist family and friends to ensure an overhaul that would match the firm's interests. According to Consumer Watchdog, California's labor code directly prohibits coercive communications, including forbidding employers from controlling, coercing or influencing employees' political activities or affiliations. WellPoint had not been contacted by the California attorney general and had not seen any complaint. Through 2010 and into 2011, WellPoint senior executives met monthly with executives of other major health insurers to blunt the effect of the Patient Protection and Affordable Care Act. Premium increases in Maine In 2009, Anthem Health Plans of Maine, a WellPoint subsidiary, sued the state of Maine for the right to increase premiums further. Since Maine licenses insurance companies through its Bureau of Insurance, Anthem needed the state's permission to raise rates. The Court disagreed with Anthem and found that, unlike with other forms of insurance, the Maine Insurance Code does not require the Superintendent to consider profits. Rate increases in California In February 2010, WellPoint announced that rates would increase on some Anthem Blue Cross individual policies in California by as high as 39%. The announcement resulted in an investigation by regulators from the Federal and California governments. Anthem Blue Cross gained worldwide media attention and became a poster child for the problem of rising cost of health care in the U.S. The rate increase came one year after Anthem had raised rates 68% on individual policy holders. To explain the rate increases, some which were four times the rate of medical inflation, Anthem said the company had experienced a death spiral: the company claimed that with increased unemployment and declining wages, healthy customers dropped their insurance policies. Consequently, the remaining risk pool became sicker and thus more expensive to insure; and, in turn, prices were forced up and pushed more people out of the market. In response to the outrage from politicians and consumers, Anthem postponed the rate increase until May 1, 2010. Senator Dianne Feinstein of California proposed giving the Federal government of the United States authority to block insurance premium hikes that it considers to be \"unjustified\". WellPoint cost reclassification On 17 March 2010, WellPoint announced it was reclassifying some of its administrative costs as medical care costs in order to meet loss ratio requirements under the Patient Protection and Affordable Care Act, which requires insurers to spend at least 80% or 85% of customer premiums on health care services, depending on the type of plan. 2009–2010 data breach In June 2010, Anthem sent letters to 230,000 customers in California warning them that their personal data might have been accessed online via a data breach. After a routine upgrade in October 2009, a third-party vendor stated that all security measures had been properly reinstated, when in fact they had not. As a result, personal information of thousands of coverage applicants who were under the age of 65 was exposed in the open. After a Los Angeles-area woman found that her application for coverage was publicly available, she filed a class action lawsuit against Anthem. While gathering evidence for the proceeding, the woman's lawyers downloaded some confidential customer information from Anthem's website and alerted Anthem about the breach. According to the lawyers, confidential information had remained exposed for five months. Greg Zoeller, Indiana's Attorney General, filed a lawsuit against the company seeking $300,000 in civil penalties for the company alleged failure to notify its consumers about the breach. Denial of benefits for cancer treatment In May 2014, Anthem Blue Cross refused to pay for the hospitalization of a Sonoma County, California man for stage four cancers, although he had paid Anthem over $100,000 in premiums. Anthem ended up paying for coverage following public outcry. 2015 data breach On February 4, 2015, Anthem, Inc. disclosed that criminal hackers had broken into its servers and potentially stolen over 37.5 million records that contain personally identifiable information from its servers. According to Anthem, Inc., the data breach extended into multiple brands Anthem, Inc. uses to market its healthcare plans, including, Anthem Blue Cross, Anthem Blue Cross and Blue Shield, Blue Cross and Blue Shield of Georgia, Empire Blue Cross and Blue Shield, Amerigroup, Caremore, and UniCare. Healthlink was also victimized. Anthem says the medical information and financial data was not compromised. Anthem has offered free credit monitoring in the wake of the breach. According to Bloomberg News, China may be responsible for this data breach. Michael Daniel, chief adviser on cybersecurity for President Barack Obama, said he would be changing his own password. About 80 million company records were hacked, stoking fears that the stolen data could be used for identity theft. The compromised information contained names, birthdays, medical IDs, social security numbers, street addresses, e-mail addresses, employment information and income data. In June 2017, Anthem agreed to spend $115M to settle allegations that it failed to adequately protect the data of its clients, the sum was to be spent on two years of services to protect victims from identity theft. In 2019, two Chinese nationals were indicted for the breach. \"Avoidable ER program\" Beginning in 2015, Anthem has been implementing and expanding its \"avoidable ER program\" which means not reimbursing ER visits when the cause is not covered by the company. A few patients found out that they had been stuck with bills of over $10,000 that Anthem refused to reimburse. According to a 2013 report by the Journal of the American Medical Association, 87 percent of patients initially triaged as non-urgent ended up with a diagnosis that constituted an emergency. Critics derided the scheme, citing that it was unlawful by federal law to cover a person based on diagnosis, not symptoms. It was also considered unsafe, as it pressured patients to diagnose themselves before going to the ER. Neglecting complaints In 2017, the California Department of Managed Health Care fined the company $5 million for untimely response to consumer complaints. In 2019, this was settled at $2.8 million. 2019 lawsuit for coercive direct payments In 2019, Sovereign Health pressed charges against Anthem, alleging that it was using direct payments to compel them to join Anthem's network under unfavorable terms. Sovereign owns facilities that treat people with addiction and mental health problems. Diagnostics fraud In March 2020, Anthem was sued by the Department of Justice. The lawsuit alleges that Anthem had submitted inaccurate diagnostics data in order to obtain increased Medicare reimbursements. In October 2022, a judge ordered Anthem to face the lawsuit. Medicare Advantage star rating In January 2024, Elevance Health filed a lawsuit with the Department of Health and Human Services (HHS) challenging changes in the Medicare Advantage star rating methodology. Star ratings are tied to key bonus payouts, and due to the new rating system in 2024 ratings have significantly decreased. Finances For the fiscal year 2017, Anthem reported earnings of US$3.843 billion, with an annual revenue of US$90.039 billion, an increase of 6.1% over the previous fiscal cycle. Anthem's shares traded at over $183 per share, and its market capitalization was valued at over US$69.1 billion in October 2018. Recognition The company was featured on the S&P Dow Jones Sustainability Index from 2018 to 2022, was named by Fortune as one of the 100 Best Companies to Work For, and was included on the Corporate Equality Index's list of Best Places to Work for LGBTQ Equality from 2015 to 2022."
}