{
  "ticker": "EME",
  "cik": "0000105634",
  "company_name": "Emcor",
  "corrected_name": "Emcor",
  "wiki_title_used": "Emcor",
  "exists": true,
  "raw_text": "EMCOR Group, Inc., headquartered in Norwalk, Connecticut, provides mechanical and electrical construction, industrial and energy infrastructure, and building services in the United States and the United Kingdom. It has over 100 operating subsidiaries and approximately 180 locations. The company is ranked 324th on the Fortune 500. In 2024, the company was ranked 2nd by Engineering News-Record on its list of the top 600 specialty contractors.\nThe company's electrical and mechanical construction services division, representing 67% of revenues in 2024, provides construction and operation services for infrastructure such as power stations, including those that provide sustainable energy such as photovoltaic systems; food processing; road lighting and traffic control systems, and other heavy construction projects. Large projects in this division relate to data centers, data and fiber projects, and cabling, as well as semiconductor, biotech, life sciences, and pharmaceutical facilities.\nThe company's building services division, which represented 24% of revenues in 2024, maintains mechanical systems such as HVAC, plumbing, fire safety, automation, energy, and air quality. Notable government agencies that the company provides services for include the National Archives and Records Administration, the Federal Deposit Insurance Corporation, the Government Accountability Office, and the departments of Transportation, Education, Health and Human Services, Energy, and Homeland Security, as well as the NASA Jet Propulsion Laboratory.\nThe company's industrial services segment, which represented 9% of revenues in 2024, handles maintenance of oil refineries and other petrochemical processing plants and is also involved in projects using sustainable energy and carbon capture and storage.\n\nHistory\nIn 1994, Jamaica Water Properties filed for bankruptcy after making acquisitions unrelated to its core business and incurring significant debt. Frank MacInnis became CEO of the company, sold many of the businesses and renamed the remaining company as Emcor. The company also added facilities management services to provide a steady revenue stream. \nAs of 2001, since the restructuring was completed in December 1994, the company had realized 27 consecutive quarters of year-over-year revenue growth.\nMcInnis retired as CEO in January 2011 and as chairman in 2015.\n\nAcquisitions\nControversies\nData breach\nIn March 2020, the company disclosed that a ransomware incident had affected some of its IT systems on February 15, 2020. The incident was identified as an infection with Ryuk ransomware. Details about the incident were not disclosed, including whether or not the company paid the ransom demand.\n\nReferences\nExternal links\nOfficial website\nBusiness data for EMCOR Group, Inc.:",
  "clean_text": "EMCOR Group, Inc., headquartered in Norwalk, Connecticut, provides mechanical and electrical construction, industrial and energy infrastructure, and building services in the United States and the United Kingdom. It has over 100 operating subsidiaries and approximately 180 locations. The company is ranked 324th on the Fortune 500. In 2024, the company was ranked 2nd by Engineering News-Record on its list of the top 600 specialty contractors. The company's electrical and mechanical construction services division, representing 67% of revenues in 2024, provides construction and operation services for infrastructure such as power stations, including those that provide sustainable energy such as photovoltaic systems; food processing; road lighting and traffic control systems, and other heavy construction projects. Large projects in this division relate to data centers, data and fiber projects, and cabling, as well as semiconductor, biotech, life sciences, and pharmaceutical facilities. The company's building services division, which represented 24% of revenues in 2024, maintains mechanical systems such as HVAC, plumbing, fire safety, automation, energy, and air quality. Notable government agencies that the company provides services for include the National Archives and Records Administration, the Federal Deposit Insurance Corporation, the Government Accountability Office, and the departments of Transportation, Education, Health and Human Services, Energy, and Homeland Security, as well as the NASA Jet Propulsion Laboratory. The company's industrial services segment, which represented 9% of revenues in 2024, handles maintenance of oil refineries and other petrochemical processing plants and is also involved in projects using sustainable energy and carbon capture and storage. History In 1994, Jamaica Water Properties filed for bankruptcy after making acquisitions unrelated to its core business and incurring significant debt. Frank MacInnis became CEO of the company, sold many of the businesses and renamed the remaining company as Emcor. The company also added facilities management services to provide a steady revenue stream. As of 2001, since the restructuring was completed in December 1994, the company had realized 27 consecutive quarters of year-over-year revenue growth. McInnis retired as CEO in January 2011 and as chairman in 2015. Acquisitions Controversies Data breach In March 2020, the company disclosed that a ransomware incident had affected some of its IT systems on February 15, 2020. The incident was identified as an infection with Ryuk ransomware. Details about the incident were not disclosed, including whether or not the company paid the ransom demand."
}