{
  "ticker": "EMR",
  "cik": "0000032604",
  "company_name": "Emerson Electric",
  "corrected_name": "Emerson Electric",
  "wiki_title_used": "Emerson Electric",
  "exists": true,
  "raw_text": "Emerson Electric Co. is an American multinational corporation headquartered in St. Louis, Missouri. The Fortune 500 company delivers a range of engineering services, manufactures industrial automation equipment, climate control systems, and precision measurement instruments, and provides software engineering for industrial, commercial, and consumer markets.\nOperating in over 150 countries, Emerson supports a broad range of industries, including oil and gas, power generation, chemicals, water treatment, and heating, ventilation, and air conditioning systems, as well as aerospace and defense solutions.\nIn recent years, Emerson has expanded its portfolio through strategic acquisitions and investments in digital transformation technologies. The company's focus on automation, data analytics, and artificial intelligence has positioned it as a leader in industrial solutions, helping businesses improve operational efficiency and sustainability. Emerson's digital platforms, such as Plantweb and DeltaV, are now widely adopted across industries to enable real-time monitoring, predictive maintenance, and enhanced decision-making processes.\n\nOperations\nEmerson deeply integrates software engineering into its operations, with a focus on automation and the industrial internet of things. The company's platforms, such as the Plantweb Digital Ecosystem, DeltaV, and Ovation, are developed to improve operational efficiency across multiple industries. These platforms integrate technologies like artificial intelligence, real-time data analytics, machine learning, and predictive maintenance to enhance performance and optimize asset management in sectors including power generation and water utilities.\nIn addition to its commitment to technological advancements, Emerson has prioritized sustainability and corporate social responsibility. The company is actively pursuing goals related to energy efficiency, emissions reduction, and community development, making strides toward carbon neutrality in its operations.\n\nHistory\nEmerson was established 1890 in St. Louis, Missouri, as Emerson Electric Manufacturing Co. by Civil War Union veteran John Wesley Emerson to manufacture electric motors using a patent owned by the Scottish-born brothers Charles and Alexander Meston. In 1892, it became the first to sell electric fans in the United States. It quickly expanded its product line to include electric sewing machines, electric dental drills, and power tools.\n\nDuring World War II, under the leadership of Stuart Symington, Emerson became the world's largest manufacturer of airplane armament. Emerson ranked 52nd among United States corporations in the value of World War II military production contracts.\nIn 1954, W.R. \"Buck\" Persons was named company president. Under his leadership, Emerson diversified its business by acquiring 36 companies. When he retired in 1973, the company had 82 plants, 31,000 employees, and $800 million in sales.\nIn 1962, it acquired the United States Electrical Manufacturing Company as the U.S. Electrical Motors Division, including the brand U.S. Motors. In 1968, it acquired the InSinkErator company.\nCharles F. Knight was CEO from 1973 to 2000, and was chairman from 1974 to 2004. His tenure marked the development of a rigorous planning process, new product and technology development, acquisitions and joint ventures, and international growth. David Farr succeeded him as chairman, and was also the CEO until 2021.\nOn December 15, 1999, Emerson Electric reached an agreement to acquire Jordan Industries Inc.'s telecommunications equipment division for a total of $440 million, a strategic move aimed at strengthening its position in the rapidly growing telecommunications sector at the time.\nIn 2010, Emerson sold its U.S. Motors brand to Nidec Corporation, marking a significant shift in Emerson’s focus towards more advanced technology-driven industries.\nOn July 26, 2011, Emerson publicly announced its decision to establish its Latin American regional headquarters in Sunrise, Florida, as part of its strategy to expand its footprint in the region and better serve its growing customer base in Latin America.\nOn December 1, 2016, Platinum Equity acquired Emerson’s Network Power division for more than $4 billion, rebranding the business as Vertiv. This acquisition encompassed several well-known brands, including ASCO, Chloride, Liebert, NetSure, and Trellis, significantly enhancing Platinum Equity’s portfolio in the critical infrastructure technology sector.\nIn July 2018, Emerson completed the acquisition of Textron Tools and Test Businesses for a total of $810 million, which included brands such as Greenlee, Klauke, HD Electric, and Sherman + Reilly. This acquisition further expanded Emerson’s offerings in the professional tools and test equipment market, adding valuable assets to its business.\nOn April 1, 2020, Emerson strengthened its presence in the hydropower control systems industry by acquiring the American Governor Company, a provider of technologies used to control hydroelectric turbines. This acquisition was aimed at boosting Emerson’s capabilities in renewable energy sectors.\nIn October 2022, Emerson reached a significant deal to sell a 55 percent controlling interest in its climate technologies business to private equity firm Blackstone Inc. for $14 billion, including debt. This sale represented a decision by Emerson to pivot towards higher-growth areas such as automation, while also benefiting from Blackstone’s expertise in scaling businesses.\nFollowing a nearly year-long negotiation, in April 2023, Emerson finalized an agreement to acquire National Instruments in an all-cash transaction valued at $8.2 billion. This acquisition was designed to enhance Emerson’s automation technology capabilities, adding advanced testing and measurement technologies to its product portfolio and enabling further innovation in its industrial automation business.\n\nCorporate\nEmerson has undergone significant leadership transitions and strategic shifts since its founding in 1890. Key leadership in the mid-20th century includes W.R. Persons, who focused on diversification and expansion from 1954 to 1973, followed by Charles Knight, under whom Emerson pursued aggressive acquisitions and global growth between 1973 and 2000. David Farr, who was CEO from 2000 to 2021, continued to expand the company's reach into international markets and advanced technology sectors. Jim Turley is the chairman, and Lal Karsanbhai is CEO.\nEmerson operates through two primary business units: Automation Solutions and Commercial & Residential Solutions. Its Automation Solutions division focuses on process automation and digital transformation, providing software and engineering services to industries like oil and gas, power generation, and pharmaceuticals. The Commercial & Residential Solutions unit focuses on climate technologies and residential products, including heating, ventilation, and air conditioning systems, tools, and compressors.\n\nEnvironmental records\nIn 2008 (using data from 2005), researchers at the University of Massachusetts Amherst identified Emerson as the 97th largest corporate producer of air pollution in the United States, down from its previous rank of 56th. Major pollutants indicated by the study include nickel compounds, manganese, diisocyanate, and lead.\nSince then, Emerson has made strides in reducing its environmental footprint. According to its 2023 sustainability report, the company achieved a 52% reduction in Scope 1 and Scope 2 greenhouse gas emissions intensity compared to 2021 levels. Additionally, Emerson procures 49% of its electricity from renewable sources and has set long-term goals for further emissions reductions. In recognition of these efforts, Emerson was named the 2023 Energy Star Partner of the Year for energy management.\n\nProducts\nAutomation Solutions\nEmerson provides advanced process automation, control systems, and software solutions critical to industries such as oil and gas, power generation, chemicals, pharmaceuticals, and water treatment. The company's Plantweb Digital Ecosystem integrates advanced sensing technologies, analytics software, and industrial internet of things solutions to optimize manufacturing processes. Emerson's automation solutions also include predictive maintenance technologies, remote monitoring, and control systems that leverage artificial intelligence, machine learning, and edge computing for enhanced performance. Key products include:\n\nDeltaV distributed control systems\nOvation control systems for power and water industries\nFisher valves and instruments\nRosemount instrumentation\nMicro Motion flow and density meters\nAMS Suite plant asset management software\n\nCommercial & Residential Solutions\nEmerson is a leader in heating, ventilation, and air conditioning and refrigeration technologies through its Copeland brand, known for its compressors and related technologies that improve energy efficiency. In October 2022, Emerson sold to Blackstone a majority stake in its Climate Technologies (HVAC) business. Other notable brands and products in this segment include:\n\nGreenlee tools and equipment for electrical professionals\nRidgid tools\n\nAerospace and Defense Solutions\nEmerson Electric also plays a significant role in the aerospace and defense industry, producing high-performance avionics equipment. The AN/APQ series of radar systems, which provide advanced targeting and navigation capabilities for military aircraft, are key products in this segment. Notable products include:\n\nAN/APG-69\nAN/APQ-153\nAN/APQ-157\nAN/APQ-159\n\nCorporate relationships\nEmerson's brands acquisitions\nOn December 22, 2014, Emerson announced the acquisition of Scotland-based Cascade Technologies Ltd., expanding their gas-analysis portfolio with laser-based measurement analyzers and systems for enhanced industrial emissions monitoring, production efficiencies, and regulatory compliance. Other main Emerson acquisitions and brands include:\n\nControversies\nNBC Heroes lawsuit\nOn October 2, 2006, Emerson filed suit in federal court against NBC regarding a scene that appeared in the pilot episode of the network's TV series Heroes. The scene depicted Claire Bennet reaching into an active garbage disposal, severely injuring her hand. Emerson's suit claims the scene \"casts the disposer in an unsavory light, irreparably tarnishing the product\" by suggesting that serious injuries will result \"in the event consumers were to accidentally insert their hand into one.\"\nEmerson asked for a ruling barring future broadcasts of the pilot and to block NBC from using any Emerson trademarks in the future.\nOn February 23, 2007, the case was dropped. NBC Universal and Emerson Electric settled the lawsuit outside of court.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Emerson Electric Co.:",
  "clean_text": "Emerson Electric Co. is an American multinational corporation headquartered in St. Louis, Missouri. The Fortune 500 company delivers a range of engineering services, manufactures industrial automation equipment, climate control systems, and precision measurement instruments, and provides software engineering for industrial, commercial, and consumer markets. Operating in over 150 countries, Emerson supports a broad range of industries, including oil and gas, power generation, chemicals, water treatment, and heating, ventilation, and air conditioning systems, as well as aerospace and defense solutions. In recent years, Emerson has expanded its portfolio through strategic acquisitions and investments in digital transformation technologies. The company's focus on automation, data analytics, and artificial intelligence has positioned it as a leader in industrial solutions, helping businesses improve operational efficiency and sustainability. Emerson's digital platforms, such as Plantweb and DeltaV, are now widely adopted across industries to enable real-time monitoring, predictive maintenance, and enhanced decision-making processes. Operations Emerson deeply integrates software engineering into its operations, with a focus on automation and the industrial internet of things. The company's platforms, such as the Plantweb Digital Ecosystem, DeltaV, and Ovation, are developed to improve operational efficiency across multiple industries. These platforms integrate technologies like artificial intelligence, real-time data analytics, machine learning, and predictive maintenance to enhance performance and optimize asset management in sectors including power generation and water utilities. In addition to its commitment to technological advancements, Emerson has prioritized sustainability and corporate social responsibility. The company is actively pursuing goals related to energy efficiency, emissions reduction, and community development, making strides toward carbon neutrality in its operations. History Emerson was established 1890 in St. Louis, Missouri, as Emerson Electric Manufacturing Co. by Civil War Union veteran John Wesley Emerson to manufacture electric motors using a patent owned by the Scottish-born brothers Charles and Alexander Meston. In 1892, it became the first to sell electric fans in the United States. It quickly expanded its product line to include electric sewing machines, electric dental drills, and power tools. During World War II, under the leadership of Stuart Symington, Emerson became the world's largest manufacturer of airplane armament. Emerson ranked 52nd among United States corporations in the value of World War II military production contracts. In 1954, W.R. \"Buck\" Persons was named company president. Under his leadership, Emerson diversified its business by acquiring 36 companies. When he retired in 1973, the company had 82 plants, 31,000 employees, and $800 million in sales. In 1962, it acquired the United States Electrical Manufacturing Company as the U.S. Electrical Motors Division, including the brand U.S. Motors. In 1968, it acquired the InSinkErator company. Charles F. Knight was CEO from 1973 to 2000, and was chairman from 1974 to 2004. His tenure marked the development of a rigorous planning process, new product and technology development, acquisitions and joint ventures, and international growth. David Farr succeeded him as chairman, and was also the CEO until 2021. On December 15, 1999, Emerson Electric reached an agreement to acquire Jordan Industries Inc.'s telecommunications equipment division for a total of $440 million, a strategic move aimed at strengthening its position in the rapidly growing telecommunications sector at the time. In 2010, Emerson sold its U.S. Motors brand to Nidec Corporation, marking a significant shift in Emerson’s focus towards more advanced technology-driven industries. On July 26, 2011, Emerson publicly announced its decision to establish its Latin American regional headquarters in Sunrise, Florida, as part of its strategy to expand its footprint in the region and better serve its growing customer base in Latin America. On December 1, 2016, Platinum Equity acquired Emerson’s Network Power division for more than $4 billion, rebranding the business as Vertiv. This acquisition encompassed several well-known brands, including ASCO, Chloride, Liebert, NetSure, and Trellis, significantly enhancing Platinum Equity’s portfolio in the critical infrastructure technology sector. In July 2018, Emerson completed the acquisition of Textron Tools and Test Businesses for a total of $810 million, which included brands such as Greenlee, Klauke, HD Electric, and Sherman + Reilly. This acquisition further expanded Emerson’s offerings in the professional tools and test equipment market, adding valuable assets to its business. On April 1, 2020, Emerson strengthened its presence in the hydropower control systems industry by acquiring the American Governor Company, a provider of technologies used to control hydroelectric turbines. This acquisition was aimed at boosting Emerson’s capabilities in renewable energy sectors. In October 2022, Emerson reached a significant deal to sell a 55 percent controlling interest in its climate technologies business to private equity firm Blackstone Inc. for $14 billion, including debt. This sale represented a decision by Emerson to pivot towards higher-growth areas such as automation, while also benefiting from Blackstone’s expertise in scaling businesses. Following a nearly year-long negotiation, in April 2023, Emerson finalized an agreement to acquire National Instruments in an all-cash transaction valued at $8.2 billion. This acquisition was designed to enhance Emerson’s automation technology capabilities, adding advanced testing and measurement technologies to its product portfolio and enabling further innovation in its industrial automation business. Corporate Emerson has undergone significant leadership transitions and strategic shifts since its founding in 1890. Key leadership in the mid-20th century includes W.R. Persons, who focused on diversification and expansion from 1954 to 1973, followed by Charles Knight, under whom Emerson pursued aggressive acquisitions and global growth between 1973 and 2000. David Farr, who was CEO from 2000 to 2021, continued to expand the company's reach into international markets and advanced technology sectors. Jim Turley is the chairman, and Lal Karsanbhai is CEO. Emerson operates through two primary business units: Automation Solutions and Commercial & Residential Solutions. Its Automation Solutions division focuses on process automation and digital transformation, providing software and engineering services to industries like oil and gas, power generation, and pharmaceuticals. The Commercial & Residential Solutions unit focuses on climate technologies and residential products, including heating, ventilation, and air conditioning systems, tools, and compressors. Environmental records In 2008 (using data from 2005), researchers at the University of Massachusetts Amherst identified Emerson as the 97th largest corporate producer of air pollution in the United States, down from its previous rank of 56th. Major pollutants indicated by the study include nickel compounds, manganese, diisocyanate, and lead. Since then, Emerson has made strides in reducing its environmental footprint. According to its 2023 sustainability report, the company achieved a 52% reduction in Scope 1 and Scope 2 greenhouse gas emissions intensity compared to 2021 levels. Additionally, Emerson procures 49% of its electricity from renewable sources and has set long-term goals for further emissions reductions. In recognition of these efforts, Emerson was named the 2023 Energy Star Partner of the Year for energy management. Products Automation Solutions Emerson provides advanced process automation, control systems, and software solutions critical to industries such as oil and gas, power generation, chemicals, pharmaceuticals, and water treatment. The company's Plantweb Digital Ecosystem integrates advanced sensing technologies, analytics software, and industrial internet of things solutions to optimize manufacturing processes. Emerson's automation solutions also include predictive maintenance technologies, remote monitoring, and control systems that leverage artificial intelligence, machine learning, and edge computing for enhanced performance. Key products include: DeltaV distributed control systems Ovation control systems for power and water industries Fisher valves and instruments Rosemount instrumentation Micro Motion flow and density meters AMS Suite plant asset management software Commercial & Residential Solutions Emerson is a leader in heating, ventilation, and air conditioning and refrigeration technologies through its Copeland brand, known for its compressors and related technologies that improve energy efficiency. In October 2022, Emerson sold to Blackstone a majority stake in its Climate Technologies (HVAC) business. Other notable brands and products in this segment include: Greenlee tools and equipment for electrical professionals Ridgid tools Aerospace and Defense Solutions Emerson Electric also plays a significant role in the aerospace and defense industry, producing high-performance avionics equipment. The AN/APQ series of radar systems, which provide advanced targeting and navigation capabilities for military aircraft, are key products in this segment. Notable products include: AN/APG-69 AN/APQ-153 AN/APQ-157 AN/APQ-159 Corporate relationships Emerson's brands acquisitions On December 22, 2014, Emerson announced the acquisition of Scotland-based Cascade Technologies Ltd., expanding their gas-analysis portfolio with laser-based measurement analyzers and systems for enhanced industrial emissions monitoring, production efficiencies, and regulatory compliance. Other main Emerson acquisitions and brands include: Controversies NBC Heroes lawsuit On October 2, 2006, Emerson filed suit in federal court against NBC regarding a scene that appeared in the pilot episode of the network's TV series Heroes. The scene depicted Claire Bennet reaching into an active garbage disposal, severely injuring her hand. Emerson's suit claims the scene \"casts the disposer in an unsavory light, irreparably tarnishing the product\" by suggesting that serious injuries will result \"in the event consumers were to accidentally insert their hand into one.\" Emerson asked for a ruling barring future broadcasts of the pilot and to block NBC from using any Emerson trademarks in the future. On February 23, 2007, the case was dropped. NBC Universal and Emerson Electric settled the lawsuit outside of court."
}