{
  "ticker": "EOG",
  "cik": "0000821189",
  "company_name": "EOG Resources",
  "corrected_name": "EOG Resources",
  "wiki_title_used": "EOG Resources",
  "exists": true,
  "raw_text": "EOG Resources, Inc. is an American energy company engaged in hydrocarbon exploration. It is organized in Delaware and headquartered in the Heritage Plaza building in Houston, Texas.\nThe company is ranked 186th on the Fortune 500 and 337th on the Forbes Global 2000.\nThe company was named Enron Oil & Gas Company before its separation from Enron in 1999.\n\nHistory\nIn 1998, Mark G. Papa was named chairman and chief executive officer. In 1999, the company became independent from Enron and changed its name to EOG Resources, Inc.\nIn 2000, the company swapped properties with Occidental Petroleum. EOG received properties in East Texas and the Oklahoma Panhandle in exchange for properties in California and the Gulf of Mexico. In February 2000, the company also swapped properties with Burlington Resources. EOG received properties in West Texas and the New Mexico, specifically in the Permian Basin, in exchange for properties in Texas and Oklahoma. The company was added to the S&P 500 index in October 2000.\nThe company acquired properties in Canada from Husky Energy for $320 million in 2003.\nIn 2006, the company signed a 225,648 square feet (20,963.4 m2) lease for office space in the Heritage Plaza building in Houston, Texas.\nIn 2008, the company acquired assets in the Chuan Zhong Block exploration area in the Sichuan Basin, Sichuan Province, China from ConocoPhillips. The company announced major discoveries in 2010 in the Eagle Ford Group.\nIn May 2011, the company sold gas-producing properties in South Texas and New Mexico for $637 million.\nIn December 2014, the company sold its assets in Canada. Also in December 2014, founder Mark G. Papa resigned from the board of directors.\nIn November 2015, the company spent $368 million to acquire additional acreage in the Delaware Basin.\nIn September 2016, the company acquired Yates Petroleum for 26 million shares of common stock valued at $2.3 billion and $37 million in cash. The acquisition increased the company's holdings by 176,000 net acres in the Delaware Basin, 200,000 net acres in the Powder River Basin, and 138,000 net acres on the Northwest Shelf in New Mexico.\nIn 2017, the company formed a joint venture with The Carlyle Group to develop oil and gas assets in Ellis County, Oklahoma.\nIn September 2018, the company sold its offshore assets in the United Kingdom.\n\nCurrent operations\nAs of December 31, 2020, the company had 3.219 billion barrels of oil equivalent (1.969×1010 GJ) of estimated proved reserves, of which 98% was in the United States, 2% was in Trinidad and Tobago, and a negligible amount was in Canada and China. The reserves were 51% petroleum, 22% natural gas liquids, and 27% natural gas.\nIn 2020, the company's production averaged 753 thousand barrels of oil equivalent (4,610,000 GJ) per day, of which 94% was in the United States, 5% was in Trinidad and Tobago, and 1% was in other areas.\n\nUnited States\nAs of December 31, 2020, of the company's total proved reserves in the United States, 53% was petroleum, 21% was natural gas liquids, and 26% was natural gas. As of December 31, 2020, the company was the largest petroleum producer in the Eagle Ford Group. The company also owns properties in the Delaware Basin and other areas of the Permian Basin, including the Leonard, Wolfcamp, and Second Bone Spring Sand shale plays. In the Rocky Mountains, the company owns properties in the Williston Basin of the Bakken Formation and the Turner, Parkman and Niobrara Formations in the Powder River Basin. The company also owns properties in the Austin Chalk, Anadarko Basin, the Fort Worth Basin, and the Marcellus Shale.\n\nCanada\nThe company owns approximately 47,000 net acres in the Horn River Formation.\n\nTrinidad and Tobago\nThe company holds several concession contracts for the supply of natural gas in Trinidad and Tobago. As of December 31, 2020, the company held approximately 115,000 net undeveloped acres in Trinidad and Tobago.\n\nChina\nIn 2008, the company acquired assets in the Chuan Zhong Block exploration area in the Sichuan Basin, Sichuan Province, China from ConocoPhillips.\n\nOman\nThe company is exploring for oil in Oman.\n\nUAE\nThe company is exploring field in the southern area of UAE for oil. UAE.\n\nAntitrust lawsuit\nIn January 2024, a class action lawsuit was filed accusing EOG, along with seven other US oil and gas producers, of an illegal price-fixing scheme to constrain production of shale oil used to produce gasoline, allegedly leading to drivers in the US paying more for gasoline than they would have in a competitive market.\n\nReferences\nExternal links\nOfficial website\nBusiness data for EOG Resources, Inc.:",
  "clean_text": "EOG Resources, Inc. is an American energy company engaged in hydrocarbon exploration. It is organized in Delaware and headquartered in the Heritage Plaza building in Houston, Texas. The company is ranked 186th on the Fortune 500 and 337th on the Forbes Global 2000. The company was named Enron Oil & Gas Company before its separation from Enron in 1999. History In 1998, Mark G. Papa was named chairman and chief executive officer. In 1999, the company became independent from Enron and changed its name to EOG Resources, Inc. In 2000, the company swapped properties with Occidental Petroleum. EOG received properties in East Texas and the Oklahoma Panhandle in exchange for properties in California and the Gulf of Mexico. In February 2000, the company also swapped properties with Burlington Resources. EOG received properties in West Texas and the New Mexico, specifically in the Permian Basin, in exchange for properties in Texas and Oklahoma. The company was added to the S&P 500 index in October 2000. The company acquired properties in Canada from Husky Energy for $320 million in 2003. In 2006, the company signed a 225,648 square feet (20,963.4 m2) lease for office space in the Heritage Plaza building in Houston, Texas. In 2008, the company acquired assets in the Chuan Zhong Block exploration area in the Sichuan Basin, Sichuan Province, China from ConocoPhillips. The company announced major discoveries in 2010 in the Eagle Ford Group. In May 2011, the company sold gas-producing properties in South Texas and New Mexico for $637 million. In December 2014, the company sold its assets in Canada. Also in December 2014, founder Mark G. Papa resigned from the board of directors. In November 2015, the company spent $368 million to acquire additional acreage in the Delaware Basin. In September 2016, the company acquired Yates Petroleum for 26 million shares of common stock valued at $2.3 billion and $37 million in cash. The acquisition increased the company's holdings by 176,000 net acres in the Delaware Basin, 200,000 net acres in the Powder River Basin, and 138,000 net acres on the Northwest Shelf in New Mexico. In 2017, the company formed a joint venture with The Carlyle Group to develop oil and gas assets in Ellis County, Oklahoma. In September 2018, the company sold its offshore assets in the United Kingdom. Current operations As of December 31, 2020, the company had 3.219 billion barrels of oil equivalent (1.969×1010 GJ) of estimated proved reserves, of which 98% was in the United States, 2% was in Trinidad and Tobago, and a negligible amount was in Canada and China. The reserves were 51% petroleum, 22% natural gas liquids, and 27% natural gas. In 2020, the company's production averaged 753 thousand barrels of oil equivalent (4,610,000 GJ) per day, of which 94% was in the United States, 5% was in Trinidad and Tobago, and 1% was in other areas. United States As of December 31, 2020, of the company's total proved reserves in the United States, 53% was petroleum, 21% was natural gas liquids, and 26% was natural gas. As of December 31, 2020, the company was the largest petroleum producer in the Eagle Ford Group. The company also owns properties in the Delaware Basin and other areas of the Permian Basin, including the Leonard, Wolfcamp, and Second Bone Spring Sand shale plays. In the Rocky Mountains, the company owns properties in the Williston Basin of the Bakken Formation and the Turner, Parkman and Niobrara Formations in the Powder River Basin. The company also owns properties in the Austin Chalk, Anadarko Basin, the Fort Worth Basin, and the Marcellus Shale. Canada The company owns approximately 47,000 net acres in the Horn River Formation. Trinidad and Tobago The company holds several concession contracts for the supply of natural gas in Trinidad and Tobago. As of December 31, 2020, the company held approximately 115,000 net undeveloped acres in Trinidad and Tobago. China In 2008, the company acquired assets in the Chuan Zhong Block exploration area in the Sichuan Basin, Sichuan Province, China from ConocoPhillips. Oman The company is exploring for oil in Oman. UAE The company is exploring field in the southern area of UAE for oil. UAE. Antitrust lawsuit In January 2024, a class action lawsuit was filed accusing EOG, along with seven other US oil and gas producers, of an illegal price-fixing scheme to constrain production of shale oil used to produce gasoline, allegedly leading to drivers in the US paying more for gasoline than they would have in a competitive market."
}