{
  "ticker": "EQIX",
  "cik": "0001101239",
  "company_name": "Equinix",
  "corrected_name": "Equinix",
  "wiki_title_used": "Equinix",
  "exists": true,
  "raw_text": "Equinix Inc. is an American multinational company headquartered in Redwood City, California. It specializes in internet connectivity and data center colocation centers, commonly known as carrier hotels. The company converted to a real estate investment trust (REIT) in January 2015.\nEquinix Inc. has been described as a leader in the global data center industry. As of 2025, it operates 260 data centers in 33 countries across five continents. Equinix is listed on the Nasdaq stock exchange under the ticker symbol EQIX. As of December 2023, it employed approximately 13,000 people worldwide.\n\nHistory\nEquinix, Inc. was founded in 1998 by Al Avery and Jay Adelson, who were two facilities managers at Digital Equipment Corporation. The firm promoted its data center platform as a neutral place where competing networks could connect and share data traffic. The firm capitalized on the \"network effect\" through which each new customer would broaden the appeal of its platform. It expanded to Asia-Pacific in October 2002 and Europe in 2007, followed by Latin America in 2011, and the Middle East in 2013.\nIn 2018, according to Sludge, Equinix signed three contracts with the U.S. Customs and Border Protection to provide technology support equipment totaling over $5 million. In September 2020, the company shifted its branding, describing itself as a \"digital infrastructure company\".\nEquinix data centers in London, UK engaged with designer Maximilian Raynor, who created a dress from its repurposed data center equipment. The wearable art dress was constructed from 3,600 meters of network cables and was revealed at Raynor's London Fashion Week pre-show in February 2025.\n\nAcquisitions and expansion\nIn 2002, Equinix merged with I-STT, the Internet infrastructure service subsidiary of Singapore Technologies Telemedia, and Pihana Pacific. This established the company's presence in China, Singapore, Australia and Japan. In 2007, the firm entered the European market by acquiring data center operator IXEurope and its facilities. In 2010, Equinix opened its 50th data center in London.  Over the next seven years, the company nearly tripled its data center portfolio. The company attributed this growth to increased demand, which was caused by the emergence of cloud computing, the Internet of Things, and big data.\nIn 2010, the company purchased Switch and Data Facilities Company, Inc., a U.S. Internet exchange and colocation services provider. The company extended its operations to the Middle East and in Southeast Asia in 2012. Also in 2012, it acquired Hong Kong-based data center provider Asia-Tone. In 2014, Equinix increased its Latin American presence when it acquired ALOG Datacenters of Brazil S.A., the country's leading provider of carrier-neutral data centers.\nIn 2015, Equinix converted to a real estate investment trust (REIT) to gain tax advantages and add shareholder value. That same year, it acquired the professional services company Nimbo.\nIn May 2015, Equinix said it would purchase the British company TelecityGroup, the largest acquisition in company history. The offer was cleared by the European Commission in November after Equinix agreed to sell eight of its data centers around Europe to Digital Realty, while retaining its Telecity Harbour Exchange data center in London Docklands, an acquisition Equinix completed in a transaction valued at approximately $3.8 billion. The addition of these data centers more than doubled Equinix's capacity in Europe. In December 2015, the company purchased Japanese provider Bit-Isle, adding six data centers in Japan.\nIn 2016, Equinix opened new data centers in Dallas, Sydney, and Tokyo and announced a deal to acquire 29 data centers in 15 markets from Verizon.\nIn 2017, the firm opened a new data center in São Paulo. In that same year, Equinix acquired Itconic, which expanded its data center footprint into Spain and Portugal.\nIn 2018, Equinix purchased the Dallas Infomart building, where it had already been operating four data centers. It also acquired Australian data center provider Metronode and its 10 data centers. The company opened its first data center in South Korea the next year.\nIn 2020, Equinix finalized the purchase of Packet, a startup that provided bare-metal servers as a cloud service. The company expanded into India in August 2020, with the acquisition of GPX India, including a campus in Mumbai with two data centers. In October 2020, Equinix completed the acquisition of 13 Bell Canada data centers. The company also invested heavily in hyperscale xScale data centers.\nOn December 7, 2021, Equinix announced its acquisition of Main One, a West African data center and connectivity solutions provider, for $320 million.\nIn March 2022, Equinix expanded into Chile and Peru with $758 million acquisition of four data centers from Entel.\nIn November 2022, Equinix announced its market entry into Malaysia with plans to build a new International Business Exchange (IBX) data center located in Iskandar Puteri, Johor Bahru, Johore called JH1. With an initial investment of approximately $40 million, JH1 launched operations in Q1 2024, providing 500 cabinets and 1,960 square meters of colocation space.\nIn 2024, the company announced a $390 million expansion plan to build more data centers in Africa over the ensuing five years. Later that year, it partnered with the Canada Pension Plan Investment Board and Singapore's GIC to develop new data centers, expecting to meet demand resulting from a boom in artificial intelligence.\n\nEnvironmental impact\nIn 2015, the company made a long-term pledge to power its entire data center platform with clean and renewable energy. This followed criticism in 2014 from the environmental group Greenpeace, which said in an annual report on the environmental practices of Internet companies that Equinix had an insufficient commitment to renewable energy and carbon emissions mitigation. The company signed deals with wind farms in Texas and Oklahoma in order to buy enough renewable energy to offset energy consumption at its North American data center portfolio.\nIn 2019, the U.S. Environmental Protection Agency named Equinix one of 17 Green Power Partners leading the transition to renewable energy.\nIn September 2020, Equinix priced $1.35 billion in green bonds to finance new and existing green projects. At the same time, the company announced a Green Finance Framework to standardize transparency reporting for green debt disclosures. In November 2020, the EPA gave Equinix its 2020 Green Power Partner of the Year award.\nIn January 2021, Equinix joined the Climate Neutral Data Centre Pact, committing to make their data centers climate neutral by 2030.\nSustainability Magazine named Equinix among the Top 10 sustainable data center providers in 2024. Later that year, the company's heat export program began to repurpose residual heat from its data centers for use in nearby buildings. Also in 2024, Equinix VP Christopher Wellise cited artificial intelligence (AI) energy use as one of the \"many growing strains on electric grids\" and stated to Newsweek that AI needs to be viewed \"through the lens of sustainability, no question\".\n\nData centers\nEquinix invested more than $25 billion in its data center platform. Data centers have been rebranded to International Business Exchanges (IBXs). In 2017, the company launched its own data center infrastructure management platform, IBX SmartView. The company's Internet exchange service allows ISPs and enterprises to exchange Internet traffic through a global peering tool.\n\nData center (IBX) locations\nAmericas: United States, Brazil, Canada, Colombia, Chile, Mexico, Peru\nAsia-Pacific: Australia, China, Hong Kong, Indonesia, Japan, South Korea, Singapore, India, Malaysia.\nEurope and Middle East: Bulgaria, Finland, France, Germany, Ireland, Italy, Netherlands, Poland, Portugal, Spain, Sweden, Switzerland, Turkey, United Arab Emirates, Oman, United Kingdom.\nAfrica: Nigeria, South Africa.\n\nSee also\nCloud computing\nList of Internet exchange points\nList of public REITs in the United States\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Equinix, Inc.:",
  "clean_text": "Equinix Inc. is an American multinational company headquartered in Redwood City, California. It specializes in internet connectivity and data center colocation centers, commonly known as carrier hotels. The company converted to a real estate investment trust (REIT) in January 2015. Equinix Inc. has been described as a leader in the global data center industry. As of 2025, it operates 260 data centers in 33 countries across five continents. Equinix is listed on the Nasdaq stock exchange under the ticker symbol EQIX. As of December 2023, it employed approximately 13,000 people worldwide. History Equinix, Inc. was founded in 1998 by Al Avery and Jay Adelson, who were two facilities managers at Digital Equipment Corporation. The firm promoted its data center platform as a neutral place where competing networks could connect and share data traffic. The firm capitalized on the \"network effect\" through which each new customer would broaden the appeal of its platform. It expanded to Asia-Pacific in October 2002 and Europe in 2007, followed by Latin America in 2011, and the Middle East in 2013. In 2018, according to Sludge, Equinix signed three contracts with the U.S. Customs and Border Protection to provide technology support equipment totaling over $5 million. In September 2020, the company shifted its branding, describing itself as a \"digital infrastructure company\". Equinix data centers in London, UK engaged with designer Maximilian Raynor, who created a dress from its repurposed data center equipment. The wearable art dress was constructed from 3,600 meters of network cables and was revealed at Raynor's London Fashion Week pre-show in February 2025. Acquisitions and expansion In 2002, Equinix merged with I-STT, the Internet infrastructure service subsidiary of Singapore Technologies Telemedia, and Pihana Pacific. This established the company's presence in China, Singapore, Australia and Japan. In 2007, the firm entered the European market by acquiring data center operator IXEurope and its facilities. In 2010, Equinix opened its 50th data center in London. Over the next seven years, the company nearly tripled its data center portfolio. The company attributed this growth to increased demand, which was caused by the emergence of cloud computing, the Internet of Things, and big data. In 2010, the company purchased Switch and Data Facilities Company, Inc., a U.S. Internet exchange and colocation services provider. The company extended its operations to the Middle East and in Southeast Asia in 2012. Also in 2012, it acquired Hong Kong-based data center provider Asia-Tone. In 2014, Equinix increased its Latin American presence when it acquired ALOG Datacenters of Brazil S.A., the country's leading provider of carrier-neutral data centers. In 2015, Equinix converted to a real estate investment trust (REIT) to gain tax advantages and add shareholder value. That same year, it acquired the professional services company Nimbo. In May 2015, Equinix said it would purchase the British company TelecityGroup, the largest acquisition in company history. The offer was cleared by the European Commission in November after Equinix agreed to sell eight of its data centers around Europe to Digital Realty, while retaining its Telecity Harbour Exchange data center in London Docklands, an acquisition Equinix completed in a transaction valued at approximately $3.8 billion. The addition of these data centers more than doubled Equinix's capacity in Europe. In December 2015, the company purchased Japanese provider Bit-Isle, adding six data centers in Japan. In 2016, Equinix opened new data centers in Dallas, Sydney, and Tokyo and announced a deal to acquire 29 data centers in 15 markets from Verizon. In 2017, the firm opened a new data center in São Paulo. In that same year, Equinix acquired Itconic, which expanded its data center footprint into Spain and Portugal. In 2018, Equinix purchased the Dallas Infomart building, where it had already been operating four data centers. It also acquired Australian data center provider Metronode and its 10 data centers. The company opened its first data center in South Korea the next year. In 2020, Equinix finalized the purchase of Packet, a startup that provided bare-metal servers as a cloud service. The company expanded into India in August 2020, with the acquisition of GPX India, including a campus in Mumbai with two data centers. In October 2020, Equinix completed the acquisition of 13 Bell Canada data centers. The company also invested heavily in hyperscale xScale data centers. On December 7, 2021, Equinix announced its acquisition of Main One, a West African data center and connectivity solutions provider, for $320 million. In March 2022, Equinix expanded into Chile and Peru with $758 million acquisition of four data centers from Entel. In November 2022, Equinix announced its market entry into Malaysia with plans to build a new International Business Exchange (IBX) data center located in Iskandar Puteri, Johor Bahru, Johore called JH1. With an initial investment of approximately $40 million, JH1 launched operations in Q1 2024, providing 500 cabinets and 1,960 square meters of colocation space. In 2024, the company announced a $390 million expansion plan to build more data centers in Africa over the ensuing five years. Later that year, it partnered with the Canada Pension Plan Investment Board and Singapore's GIC to develop new data centers, expecting to meet demand resulting from a boom in artificial intelligence. Environmental impact In 2015, the company made a long-term pledge to power its entire data center platform with clean and renewable energy. This followed criticism in 2014 from the environmental group Greenpeace, which said in an annual report on the environmental practices of Internet companies that Equinix had an insufficient commitment to renewable energy and carbon emissions mitigation. The company signed deals with wind farms in Texas and Oklahoma in order to buy enough renewable energy to offset energy consumption at its North American data center portfolio. In 2019, the U.S. Environmental Protection Agency named Equinix one of 17 Green Power Partners leading the transition to renewable energy. In September 2020, Equinix priced $1.35 billion in green bonds to finance new and existing green projects. At the same time, the company announced a Green Finance Framework to standardize transparency reporting for green debt disclosures. In November 2020, the EPA gave Equinix its 2020 Green Power Partner of the Year award. In January 2021, Equinix joined the Climate Neutral Data Centre Pact, committing to make their data centers climate neutral by 2030. Sustainability Magazine named Equinix among the Top 10 sustainable data center providers in 2024. Later that year, the company's heat export program began to repurpose residual heat from its data centers for use in nearby buildings. Also in 2024, Equinix VP Christopher Wellise cited artificial intelligence (AI) energy use as one of the \"many growing strains on electric grids\" and stated to Newsweek that AI needs to be viewed \"through the lens of sustainability, no question\". Data centers Equinix invested more than $25 billion in its data center platform. Data centers have been rebranded to International Business Exchanges (IBXs). In 2017, the company launched its own data center infrastructure management platform, IBX SmartView. The company's Internet exchange service allows ISPs and enterprises to exchange Internet traffic through a global peering tool. Data center (IBX) locations Americas: United States, Brazil, Canada, Colombia, Chile, Mexico, Peru Asia-Pacific: Australia, China, Hong Kong, Indonesia, Japan, South Korea, Singapore, India, Malaysia. Europe and Middle East: Bulgaria, Finland, France, Germany, Ireland, Italy, Netherlands, Poland, Portugal, Spain, Sweden, Switzerland, Turkey, United Arab Emirates, Oman, United Kingdom. Africa: Nigeria, South Africa."
}