{
  "ticker": "EQR",
  "cik": "0000906107",
  "company_name": "Equity Residential",
  "corrected_name": "Equity Residential",
  "wiki_title_used": "Equity Residential",
  "exists": true,
  "raw_text": "Equity Residential is a United States–based publicly traded real estate investment trust that invests in apartments.\nAs of December 31, 2024, the company owned or had investments in 311 properties consisting of 84,249 apartment units in Southern California, San Francisco, Washington, D.C., New York City, Boston, Seattle,  Denver, Atlanta, Dallas/Ft. Worth, and Austin.\nIt is the 6th largest owner of apartments in the United States and the 18th largest apartment property manager in the United States.\n\nHistory\nThe company had its origins in Equity Finance and Management Company, founded in 1969 by real-estate investor Sam Zell.\nIn 1993, the company acquired a large portfolio of properties from Starwood Capital Group, owned by Barry Sternlicht and Bob Faith, in exchange for a 20% stake in the company. Starwood had acquired the properties via government auctions after the savings and loan crisis.\nOn August 11, 1993, the company became a public company via an initial public offering. At that time, the company owned 22,000 apartments.\nIn 1997, the company acquired Wellsford Residential Property Trust for $620 million in stock and the assumption of $346 million of debt. It also acquired Evans Withycombe Residential for $625 million in stock and the assumption of $432 million in debt.\nIn 1998, the company acquired a portfolio of 5,774 apartments from Lincoln Property Company for $465 million. It also acquired Merry Land, which owned 34,990 units in the southeast United States, for $1.17 billion in stock as well as $656 million in debt and $270 million in preferred stock.\nIn 1999, the company acquired Lexford Residential Trust for $203 million in stock and the assumption of $530 million of debt. Lexford owned mainly one-story affordable housing units, rented to households with incomes between $25,000 and $35,000.\nIn January 2003, CEO Douglas Crocker retired. During his tenure, the company increased its ownership from 22,000 apartments to 227,000 apartments.\nIn 2006, the company sold its Lexford affordable housing division, which included 27,115 apartment units, for $1.09 billion.\nIn February 2013, Equity Residential and AvalonBay Communities closed a $9 billion deal to acquire Archstone from Lehman Brothers.\nIn 2013, the company sold 8,010 apartment units to a joint venture of Goldman Sachs and Greystar Real Estate Partners for $1.5 billion.\nIn 2016, the company sold 23,262 apartments to Starwood Capital Group for $5.365 billion.\n\nLegal issues\nEquity Residential was sued in a class action in 2017 due to allegations that it charged late payment fees in violation of California law.\nIn 2022, the company agreed to pay approximately $2 million to settle a lawsuit filed by Attorney General for the District of Columbia Karl Racine alleging that the company offered misleading rent discounts on a rent-controlled building in Washington, D.C.\nIn 2022 and 2023, the company was one of 34 landlords named as co-defendants in antitrust lawsuits against RealPage alleging illegal \"collusion-by-algorithm\" to fix and inflate rent prices.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Equity Residential:",
  "clean_text": "Equity Residential is a United States–based publicly traded real estate investment trust that invests in apartments. As of December 31, 2024, the company owned or had investments in 311 properties consisting of 84,249 apartment units in Southern California, San Francisco, Washington, D.C., New York City, Boston, Seattle, Denver, Atlanta, Dallas/Ft. Worth, and Austin. It is the 6th largest owner of apartments in the United States and the 18th largest apartment property manager in the United States. History The company had its origins in Equity Finance and Management Company, founded in 1969 by real-estate investor Sam Zell. In 1993, the company acquired a large portfolio of properties from Starwood Capital Group, owned by Barry Sternlicht and Bob Faith, in exchange for a 20% stake in the company. Starwood had acquired the properties via government auctions after the savings and loan crisis. On August 11, 1993, the company became a public company via an initial public offering. At that time, the company owned 22,000 apartments. In 1997, the company acquired Wellsford Residential Property Trust for $620 million in stock and the assumption of $346 million of debt. It also acquired Evans Withycombe Residential for $625 million in stock and the assumption of $432 million in debt. In 1998, the company acquired a portfolio of 5,774 apartments from Lincoln Property Company for $465 million. It also acquired Merry Land, which owned 34,990 units in the southeast United States, for $1.17 billion in stock as well as $656 million in debt and $270 million in preferred stock. In 1999, the company acquired Lexford Residential Trust for $203 million in stock and the assumption of $530 million of debt. Lexford owned mainly one-story affordable housing units, rented to households with incomes between $25,000 and $35,000. In January 2003, CEO Douglas Crocker retired. During his tenure, the company increased its ownership from 22,000 apartments to 227,000 apartments. In 2006, the company sold its Lexford affordable housing division, which included 27,115 apartment units, for $1.09 billion. In February 2013, Equity Residential and AvalonBay Communities closed a $9 billion deal to acquire Archstone from Lehman Brothers. In 2013, the company sold 8,010 apartment units to a joint venture of Goldman Sachs and Greystar Real Estate Partners for $1.5 billion. In 2016, the company sold 23,262 apartments to Starwood Capital Group for $5.365 billion. Legal issues Equity Residential was sued in a class action in 2017 due to allegations that it charged late payment fees in violation of California law. In 2022, the company agreed to pay approximately $2 million to settle a lawsuit filed by Attorney General for the District of Columbia Karl Racine alleging that the company offered misleading rent discounts on a rent-controlled building in Washington, D.C. In 2022 and 2023, the company was one of 34 landlords named as co-defendants in antitrust lawsuits against RealPage alleging illegal \"collusion-by-algorithm\" to fix and inflate rent prices."
}