{
  "ticker": "EQT",
  "cik": "0000033213",
  "company_name": "EQT Corporation",
  "corrected_name": "EQT Corporation",
  "wiki_title_used": "EQT Corporation",
  "exists": true,
  "raw_text": "EQT Corporation is an American energy company engaged in hydrocarbon exploration and pipeline transport. It is headquartered in EQT Plaza in Pittsburgh, Pennsylvania.\nEQT is the largest natural gas producer in the Appalachian Basin with 19.802 trillion cubic feet equivalent of proved reserves across approximately 1.8 million gross acres, including approximately 1.5 million gross acres in the Marcellus Formation, as of December 31, 2019. Of the company's total proved reserves, 88% are located in the Marcellus Formation and 95% are natural gas.\nVia its interest in EQGP Holdings, LP, the company owns a controlling interest in EQT Midstream Partners, LP. EQM owns and operates midstream assets in the Appalachian Basin and provides water services that support well completion activities and collects and recycles or disposes of flowback and produced water.\nThe company is ranked 605th on the Fortune 500. It is not on the Forbes Global 2000.\n\nHistory\nIn 1884, Michael and Obediah Haymaker struck gas outside of Pittsburgh, PA. Four years later, the Equitable Gas Company was incorporated as a subsidiary of Philadelphia Company.\nIn 1950, the company separated from the Philadelphia Company and was listed on the New York Stock Exchange.\nThe company changed its corporate name to Equitable Resources, Inc. in 1984. The company offered the first fixed bill energy contract in the U.S. in 1995. This is a contract in which the price a customer pays for energy is fixed no matter what the actual cost is during the life of the contract.\nEquitable Resources made a number of acquisitions in the late 1990s. In 1997, the company acquired Northeast Energy Services Co. (NORESCO) for $77 million and a number of offshore oil and gas fields from Chevron Corporation for $80.6 million. In 2000, the company acquired Appalachian wells and reserves from Statoil.\nThe company was added to the S&P 500 Index in 2008, but removed in 2018.\nIn February 2009, the company changed its name to EQT Corporation. EQT opened one of the first compressed natural gas (CNG) fueling stations in the Strip District of Pittsburgh in 2011. That same year, David L. Porges was named chief executive officer.\nEQT sold its natural gas distribution business in 2013 to Peoples Natural Gas for $740 million. In March 2017, Steven Schlotterbeck became chief executive officer, He resigned in March 2018. and in November the company acquired Rice Energy. EQT spun off its pipeline division, Equitrans Midstream, in 2018.\nIn July 2019, Toby Rice became chief executive officer of the company. Rice led the company in acquiring Chevron's Appalachian assets in October 2020 for $735 million, Marcellus shale assets in Pennsylvania from Alta Resources Development in May 2021 for $2.9 billion, and the Marcellus shale holdings of THQ Appalachia I LLC in September 2022 for $5.2 billion. The last purchase included XcL Midstream, the owner of 95 miles (153 km) of natural gas pipeline.\n\nReferences\nExternal links\nOfficial website\nBusiness data for EQT Corporation:",
  "clean_text": "EQT Corporation is an American energy company engaged in hydrocarbon exploration and pipeline transport. It is headquartered in EQT Plaza in Pittsburgh, Pennsylvania. EQT is the largest natural gas producer in the Appalachian Basin with 19.802 trillion cubic feet equivalent of proved reserves across approximately 1.8 million gross acres, including approximately 1.5 million gross acres in the Marcellus Formation, as of December 31, 2019. Of the company's total proved reserves, 88% are located in the Marcellus Formation and 95% are natural gas. Via its interest in EQGP Holdings, LP, the company owns a controlling interest in EQT Midstream Partners, LP. EQM owns and operates midstream assets in the Appalachian Basin and provides water services that support well completion activities and collects and recycles or disposes of flowback and produced water. The company is ranked 605th on the Fortune 500. It is not on the Forbes Global 2000. History In 1884, Michael and Obediah Haymaker struck gas outside of Pittsburgh, PA. Four years later, the Equitable Gas Company was incorporated as a subsidiary of Philadelphia Company. In 1950, the company separated from the Philadelphia Company and was listed on the New York Stock Exchange. The company changed its corporate name to Equitable Resources, Inc. in 1984. The company offered the first fixed bill energy contract in the U.S. in 1995. This is a contract in which the price a customer pays for energy is fixed no matter what the actual cost is during the life of the contract. Equitable Resources made a number of acquisitions in the late 1990s. In 1997, the company acquired Northeast Energy Services Co. (NORESCO) for $77 million and a number of offshore oil and gas fields from Chevron Corporation for $80.6 million. In 2000, the company acquired Appalachian wells and reserves from Statoil. The company was added to the S&P 500 Index in 2008, but removed in 2018. In February 2009, the company changed its name to EQT Corporation. EQT opened one of the first compressed natural gas (CNG) fueling stations in the Strip District of Pittsburgh in 2011. That same year, David L. Porges was named chief executive officer. EQT sold its natural gas distribution business in 2013 to Peoples Natural Gas for $740 million. In March 2017, Steven Schlotterbeck became chief executive officer, He resigned in March 2018. and in November the company acquired Rice Energy. EQT spun off its pipeline division, Equitrans Midstream, in 2018. In July 2019, Toby Rice became chief executive officer of the company. Rice led the company in acquiring Chevron's Appalachian assets in October 2020 for $735 million, Marcellus shale assets in Pennsylvania from Alta Resources Development in May 2021 for $2.9 billion, and the Marcellus shale holdings of THQ Appalachia I LLC in September 2022 for $5.2 billion. The last purchase included XcL Midstream, the owner of 95 miles (153 km) of natural gas pipeline."
}