{
  "ticker": "ERIE",
  "cik": "0000922621",
  "company_name": "Erie Indemnity",
  "corrected_name": "Erie Indemnity",
  "wiki_title_used": "Erie Indemnity",
  "exists": true,
  "raw_text": "Erie Insurance Group, based in Erie, Pennsylvania, is a property and casualty insurance company offering auto, home, business and life insurance through a network of independent insurance agents. As of 2021, Erie Insurance Group is ranked 347th on the 2021 Fortune 500 list of largest American corporations, based on total revenue for the 2020 fiscal year.\nRated A+ (Superior) by A.M. Best, Erie has more than 6 million policies in force and operates in 12 states and the District of Columbia, including Illinois, Indiana, Kentucky, Maryland, New York, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia, West Virginia and Wisconsin. It also owns the naming rights to the Erie Insurance Arena in downtown Erie, Pennsylvania.\n\nHistory\nErie Insurance Exchange began in 1925 when two salesmen for the Pennsylvania Indemnity Exchange, H.O. Hirt and O.G. Crawford, left to create their own insurance company. In three months and 20 days, the two convinced 90 stockholders to invest using a hand-written business plan, raising $31,000 to begin their own auto insurance company.\nThe Pennsylvania Insurance Department issued a license to the Erie Insurance Exchange as an automobile insurer, beginning operations on April 20, 1925. Erie Insurance Exchange was formed as a reciprocal and Erie Indemnity Company was formed as its managing company. The annual premium charge per auto was $34.\nCo-founder H.O. Hirt hoped to create a company built on service, developing the mantra \"The ERIE is above all in sERvIcE,\" with the letters \"E-R-I-E\" raised out of the word \"service\". Customers, who were encouraged to call the company collect, could even expect the cofounders to answer the phone themselves. The company's first adjuster and full-time claims manager, Sam P. Black Jr., had a phone extension installed in his room at the local YMCA, offering 24-hour service to policyholders.\nErie Insurance created a type of auto policy in 1934 named the \"Super Standard Auto Policy,\" that was used as a model for other insurance companies across the county. The policy included extra coverage not seen in other policies during the 1930s such as \"Drive Other Car\" coverage and waiving collision deductibles between two ERIE-insured vehicles. The company later expanded into home, business and life insurance.\nThe company had an office only in Erie until 1928 when it expanded into Pittsburgh, Pennsylvania. Its footprint continued to expand, reaching outside of Pennsylvania and opening a branch campus in \nSilver Spring, Maryland, in 1953.\nNotable dates in company history:\n\nCompanies\nCompany Subsidiaries\nSource:\n\nErie Insurance Property & Casualty Company\nFlagship City Insurance Company\nErie Insurance Company\nErie Insurance Company of New York\nErie Family Life Insurance Company\n\nLogo\nErie Insurance corporate mark includes the company's name with a graphic of the cupola from the H.O. Hirt Building located in Erie, Pennsylvania. This design was introduced in the '90s, and updated in 2005.\n\nSales\nErie Insurance sells its products exclusively through a network of more than 2,200 independent agencies with more than 13,000 licensed agents. In a February 2013 interview with the Erie Times-News, CEO Terry Cavanaugh reaffirmed the company's commitment to this distribution channel while acknowledging the importance of also enabling customers to pay bills and file claims online.\n\nCEOs\nAwards and recognitions\nIn 2003, Erie Insurance made its debut on the Fortune 500 list. It currently ranks at number 368.\nIn 2017, Erie Insurance earned the ACE (Achievement in Customer Excellence) Award in the Voice of the Customer category for claims service for the second consecutive year.\nIn 2018, Erie Insurance became Erie County, Pennsylvania's largest employer with more than 2,800 employees locally.\nSince 2013, Black EOE Journal  and Hispanic Network Magazine have awarded Erie Insurance the top insurance company.\nErie Insurance received a perfect score of 100 percent on the 2017 Corporate Equality Index, a national benchmark on corporate policies and practices related to LGBT workplace equality.\nIn the year 2018, Erie Insurance Group was named to Ward's 50 top-performing property-casualty insurers. Erie Insurance has made the Ward's 50 list since 1991. Ward's 50 ranks property-casualty insurance companies based on their financial safety, consistency, and performance over a five-year period. The analysis is done on nearly 3,000 property-casualty insurers and 1,407 life-health insurers, out of which, Ward's 50 picks the top 50 U.S. based carriers. Erie Insurance Group has also earned A.M. Best's rating of A+ (Superior). Erie Family Life Insurance Company has earned A.M. Best's rating of A (Excellent). A.M. Best is a respected provider of financial ratings for insurance organizations.\nIn February 2020, Forbes recognized Erie Insurance as one of the best employers for diversity.\n\nSponsorships\nIn May 2012, it was announced that Erie Insurance had purchased the naming rights to Tullio Arena in downtown Erie, Pa. The arena was subsequently renamed Erie Insurance Arena.\nIn 2018, Erie Insurance became the title sponsor of Roar on the Shore motorcycle rally, which is no longer running.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Erie Indemnity Company:",
  "clean_text": "Erie Insurance Group, based in Erie, Pennsylvania, is a property and casualty insurance company offering auto, home, business and life insurance through a network of independent insurance agents. As of 2021, Erie Insurance Group is ranked 347th on the 2021 Fortune 500 list of largest American corporations, based on total revenue for the 2020 fiscal year. Rated A+ (Superior) by A.M. Best, Erie has more than 6 million policies in force and operates in 12 states and the District of Columbia, including Illinois, Indiana, Kentucky, Maryland, New York, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia, West Virginia and Wisconsin. It also owns the naming rights to the Erie Insurance Arena in downtown Erie, Pennsylvania. History Erie Insurance Exchange began in 1925 when two salesmen for the Pennsylvania Indemnity Exchange, H.O. Hirt and O.G. Crawford, left to create their own insurance company. In three months and 20 days, the two convinced 90 stockholders to invest using a hand-written business plan, raising $31,000 to begin their own auto insurance company. The Pennsylvania Insurance Department issued a license to the Erie Insurance Exchange as an automobile insurer, beginning operations on April 20, 1925. Erie Insurance Exchange was formed as a reciprocal and Erie Indemnity Company was formed as its managing company. The annual premium charge per auto was $34. Co-founder H.O. Hirt hoped to create a company built on service, developing the mantra \"The ERIE is above all in sERvIcE,\" with the letters \"E-R-I-E\" raised out of the word \"service\". Customers, who were encouraged to call the company collect, could even expect the cofounders to answer the phone themselves. The company's first adjuster and full-time claims manager, Sam P. Black Jr., had a phone extension installed in his room at the local YMCA, offering 24-hour service to policyholders. Erie Insurance created a type of auto policy in 1934 named the \"Super Standard Auto Policy,\" that was used as a model for other insurance companies across the county. The policy included extra coverage not seen in other policies during the 1930s such as \"Drive Other Car\" coverage and waiving collision deductibles between two ERIE-insured vehicles. The company later expanded into home, business and life insurance. The company had an office only in Erie until 1928 when it expanded into Pittsburgh, Pennsylvania. Its footprint continued to expand, reaching outside of Pennsylvania and opening a branch campus in Silver Spring, Maryland, in 1953. Notable dates in company history: Companies Company Subsidiaries Source: Erie Insurance Property & Casualty Company Flagship City Insurance Company Erie Insurance Company Erie Insurance Company of New York Erie Family Life Insurance Company Logo Erie Insurance corporate mark includes the company's name with a graphic of the cupola from the H.O. Hirt Building located in Erie, Pennsylvania. This design was introduced in the '90s, and updated in 2005. Sales Erie Insurance sells its products exclusively through a network of more than 2,200 independent agencies with more than 13,000 licensed agents. In a February 2013 interview with the Erie Times-News, CEO Terry Cavanaugh reaffirmed the company's commitment to this distribution channel while acknowledging the importance of also enabling customers to pay bills and file claims online. CEOs Awards and recognitions In 2003, Erie Insurance made its debut on the Fortune 500 list. It currently ranks at number 368. In 2017, Erie Insurance earned the ACE (Achievement in Customer Excellence) Award in the Voice of the Customer category for claims service for the second consecutive year. In 2018, Erie Insurance became Erie County, Pennsylvania's largest employer with more than 2,800 employees locally. Since 2013, Black EOE Journal and Hispanic Network Magazine have awarded Erie Insurance the top insurance company. Erie Insurance received a perfect score of 100 percent on the 2017 Corporate Equality Index, a national benchmark on corporate policies and practices related to LGBT workplace equality. In the year 2018, Erie Insurance Group was named to Ward's 50 top-performing property-casualty insurers. Erie Insurance has made the Ward's 50 list since 1991. Ward's 50 ranks property-casualty insurance companies based on their financial safety, consistency, and performance over a five-year period. The analysis is done on nearly 3,000 property-casualty insurers and 1,407 life-health insurers, out of which, Ward's 50 picks the top 50 U.S. based carriers. Erie Insurance Group has also earned A.M. Best's rating of A+ (Superior). Erie Family Life Insurance Company has earned A.M. Best's rating of A (Excellent). A.M. Best is a respected provider of financial ratings for insurance organizations. In February 2020, Forbes recognized Erie Insurance as one of the best employers for diversity. Sponsorships In May 2012, it was announced that Erie Insurance had purchased the naming rights to Tullio Arena in downtown Erie, Pa. The arena was subsequently renamed Erie Insurance Arena. In 2018, Erie Insurance became the title sponsor of Roar on the Shore motorcycle rally, which is no longer running."
}