{
  "ticker": "ES",
  "cik": "0000072741",
  "company_name": "Eversource Energy",
  "corrected_name": "Eversource Energy",
  "wiki_title_used": "Eversource Energy",
  "exists": true,
  "raw_text": "Eversource Energy is a publicly traded, Fortune 500 energy company headquartered in Springfield, Massachusetts with additional corporate offices in Hartford, Connecticut, and Boston, Massachusetts, with several regulated subsidiaries offering retail electricity, natural gas service and water service to approximately 4 million customers in Connecticut, Massachusetts, and New Hampshire.  \nFollowing its 2012 merger with Boston-based NSTAR, Northeast Utilities had more than 4,270 circuit miles of electric transmission lines, 72,000 pole miles of distribution lines, and 6,459 miles of natural gas pipeline in New England.\nThrough predecessors New England Gas & Electric System and Commonwealth Energy Systems, Eversource is the direct legal successor of the Associated Gas & Electric System, a labyrinthine trust corporation based in Massachusetts  controlling over a hundred regional gas, electric, railroad and other utility monopolies across the United States, and as distant as Manila. On February 2, 2015, this company and all its subsidiaries rebranded themselves as \"Eversource Energy\".  The stock symbol changed on February 19, 2015, from \"NU\" to \"ES\".\n\nCorporate structure\nBefore its rebranding, the company operated six main subsidiaries: Connecticut Light and Power (CL&P), Public Service Company of New Hampshire (PSNH), Western Massachusetts Electric Company (WMECO), Yankee Gas Services Company (Yankee Gas), NSTAR Electric, and NSTAR Gas.  NSTAR itself was the product of corporate mergers, and included the former Boston Edison Company, Cambridge Electric Light Company, Commonwealth Electric Company, Commonwealth Gas, and Cambridge Gas Company. All now currently operate under the Eversource name.\nEversource remains Connecticut's largest electric utility, serving more than 1.2 million residential, municipal, commercial and industrial customers in approximately 149 cities and towns.\nEversource is also New Hampshire's largest electric utility, serving over 500,000 customers, including homes and businesses, in 211 cities and towns throughout the state.\nFurthermore, Eversource is a major energy distributor to 1.7 million customers across Massachusetts, including over 1.4 million electric customers in 140 communities and over 300,000 natural gas customers in 51 communities.\n\nHistory\nThe Rocky River Power Company, formed in 1905 by J. Henry Roraback, became the Connecticut Light and Power Company in 1917. Eversource predecessor Northeast Utilities (NU) was formed on July 1, 1966, under CEO Lelan Sillin, with the merger of the Connecticut Light and Power Company (CL&P, formed in 1917), Western Massachusetts Electric Company (WMECO, formed in 1886), and the Hartford Electric Light Company (HELCO, formed in 1878) under a single parent company, creating the first new multi-state public utility holding company since the enactment of the Public Utility Holding Company Act of 1935. In 1967, Holyoke Water Power Company (HWP) (formed in 1859) joined the NU System.  Public Service Company of New Hampshire (PSNH, formed in 1926), a private company at the time, declared bankruptcy in January 1988 due to problems obtaining a license for the completed Seabrook Nuclear Power Plant. and in 1992 was merged into Northeast Utilities.\nIn 1999, Con Edison and Northeast Utilities entered negotiations that would have created one of the largest utilities in the United States. However, Con Edison backed out of the merger in 2001 after Connecticut's Attorney General Richard Blumenthal threatened lawsuits to block it.\nLegislation passed in the late 1990s deregulated the electricity market in New England and required regulated utilities to divest generating stations to competitive suppliers. In 1999 the company divested all of the generating assets of WMECO and CL&P per requirements of the Massachusetts and Connecticut legislation. The company retained some of these assets by transferring them to a new subsidiary called Northeast Generation which functioned as a competitive supplier and sold the other assets entirely: WMECO's West Springfield Generating Station and several related hydroelectric and fossil fuel generating units were sold to Con Edison, while other assets (most notably the Northfield Mountain hydroelectric facility) were transferred to Northeast Generation.\nIn 2001, NU sold the assets and operations of its subsidiary, the Holyoke Water Power Company, to the City of Holyoke including the HWP electrical distribution system and customer base and all generation with the exception of the Mt. Tom coal-fired power plant which NU retained. The city's municipal gas and electric department assumed responsibility for the generators and absorbed the HWP distribution customer base. Between 2000 and 2002 due to state laws, NU divested WMECO, CL&P, and PSNH's nuclear generating assets which consisted of their stakes in the Seabrook, Millstone, and Vermont Yankee stations.\n\nIn November 2005, the company announced it would sell its unregulated competitive businesses, including generation and energy services.  In November 2006 the company had essentially completed the divestiture of its competitive businesses.\nIn 2006, NU decided to sell the generating units it had earlier retained in the 1999 divestiture as competitive suppliers and shut down its competitive generation business units. The Northeast Generation assets, including Mount Tom Station and Northfield Mountain, were all sold to Energy Capital Partners. PSNH continued to operate regulated hydroelectric and fossil fuel generation assets to serve its default/basic service customers who did not choose an alternative competitive supplier.\nIn October 2010, Northeast Utilities announced that it would merge with NSTAR, the major electric and gas provider in Greater Boston, with the resulting company retaining the Northeast Utilities name for the next several years.  After government approvals, the deal closed in April 2012.\nIn 2015 the company (now known as Eversource) agreed to sell all of its New Hampshire generation assets in the same manner it sold its assets in Massachusetts and Connecticut between 2000 and 2006. The sale of the New Hampshire generation fleet was approved by the state's Public Utilities Commission on November 29, 2017, and completed on January 10, 2018.\nIn June 2017 Eversource announced its merger with Aquarion Water Company for $1.675 billion.  Aquarion would become a fully owned subsidiary and retain its own name, adding 300 employees and 230,000 customers in Connecticut, Massachusetts, and New Hampshire. In December 2017, the merger was completed after government approval.\nIn 2016, Eversource started joint ventures for wind farm developments with Ørsted. In 2023, Eversource announced it would sell off its equity in these projects (Bay State Wind, South Fork Wind, Revolution Wind, and Sunrise Wind) at an expected loss of $200 million.\n\nMajor projects\nEversource Energy has participated in a number of projects to improve the reliability of the power grid in southwest Connecticut.  The first project was construction of the $350 million 345 kilovolt Bethel–Norwalk transmission line through the western part of the state, and was constructed entirely by the company when it was still known as Northeast Utilities.\nWith United Illuminating, an upgrade to the 69-mile (112 km), 345 kilovolt Middletown-Norwalk transmission line was energized in 2009 at a cost of $900 million.\nIn 2013, the Greater Springfield Reliability Project, a component of the ongoing New England East-West Solution, was energized at a cost of $795 million. The project addressed numerous reliability issues with the Springfield, MA area's 115 kV transmission system by constructing two new 345 kV lines to the Agawam substation; one line north to Ludlow and the other south to North Bloomfield, Connecticut.\nThe new 345 kV corridor added a new strong interface between Massachusetts and Connecticut. The project also involved rebuilding all of the 115 kV lines along the transmission corridor between South Agawam and Ludlow to increase their capacities, building a new 115 kV transmission substation in East Springfield (Cadwell), replacing the Fairmont 115 kV transmission substation in Chicopee with a new substation across the street, and configuring a new 115 kV line from South Agawam to Southwick using a combination of both new and old line segments of the former 115 kV path between Agawam and North Bloomfield. The new Cadwell and Fairmont switching stations allowed a number of three-terminal 115 kV lines to be broken up into two-terminal lines. Finally, the project allowed a problematic underground 115 kV transmission path through the city of Springfield that was vulnerable to thermal overloads to be removed from service by breaking it in half at the middle. The underground lines now function solely to supply the distribution load served out of the Breckwood substation in Springfield. A previously proposed costly project that would have replaced the underground cables is no longer necessary. On November 20, 2013, cutover of 115 kV lines to the new Fairmont Switching Station was complete, marking substantial completion of the GSRP.\nEversource has taken action to support the use of electric vehicles. Starting in 2018, the company began spending $45 million over five years to install over 400 electric vehicle charging stations in Massachusetts. The project is part of the company's Grid Modernization plan. The company has switched much of its power source from coal to natural gas, wind, hydroelectricity and solar power.\n\nHVDC transmission (\"Northern Pass\" Project)\nAs Northeast Utilities, the company signed on a joint venture with Hydro-Québec and NSTAR to build a new high-voltage direct current (HVDC) line from Windsor, Quebec (connecting with the Quebec grid) to a location in Franklin, New Hampshire.  It was projected that the line would either run in an existing right-of-way adjacent to the HVDC line that runs through New Hampshire, or it would connect to a right-of-way in northern New Hampshire that would run through the White Mountains.  This 180- to 190-mile line, projected to carry 1,200 megawatts, would have carried electricity to approximately one million homes. The issue of buying hydropower from Hydro-Québec had been an issue during the Massachusetts gubernatorial election of 2010. In November 2015, the Sierra Club of New Hampshire also expressed opposition for the new line, saying that it would not only benefit Connecticut and Massachusetts residents more than those in New Hampshire, but also the concern of the flooding of boreal forests during the construction of Hydro-Québec's dams in northern Quebec, disputes with the Innu First Nations, and the effects of tourism and the environment within the White Mountain National Forest.\nOn January 25, 2018, Massachusetts Governor Baker selected this \"Northern Pass Transmission\" (NPT) project as the winner for a clean energy procurement RFP.\nHowever, days later on February 1, 2018, the New Hampshire Site Evaluation Committee voted unanimously to deny Eversource's controversial Northern Pass project a permit, leaving the future of the project, and $1.6 billion of Eversource's Transmission Rate Base Growth Projections in doubt.\nOn July 26, 2019, Eversource Energy announced that it was giving up Northern Pass after the New Hampshire Supreme Court rejected its appeal and sided with the SEC.\n\nTransmission controversy (FERC Complaint)\nWhile Eversource reported that its electric transmission earnings were up 80 percent in Q2 2015, the Federal Energy Regulatory Commission (FERC) is now investigating the utility for having transmission rates that appear to be “unjust, unreasonable and unduly discriminatory or preferential”. Meanwhile, the potential for rooftop solar to prevent the need for new transmission lines is growing and Eversource wants to cap rooftop solar growth in the state.\n\nPolitical connections\nIn 2015, Eversource fought the rooftop solar industry and supported anti-solar policies. In Massachusetts, they staffed the State House with lobbyists in order to end legislation promoting growth of the solar industry. During the 2015 legislative session in New Hampshire, Eversource opposed an increase to the state's solar net metering cap. New Hampshire's cap is lower than all neighboring states.\nEversource disclosed on its website politically related organization expenditures of $110,000 to the Democratic Governors Association in 2016, and payments made to trade associations that were used for lobbying or other political activities in excess of $135,000.\n\nRate hikes and solar charges\nIn Massachusetts, Attorney General Maura Healey testified in March, 2017 before the DPU urging it to deny Eversource's proposed $300 million rate increase. In her testimony, she challenged the need for Eversource's rate increase, noting NSTAR's and WMECo's high returns over the last few years. Referencing NSTAR's 2015 return of more than 13 percent, Attorney General Healey told the DPU that “[l]ast year, no state public utility commission in the country allowed a return that high.” Between 2010 and 2015, Eversource's shareholders of common stock received a cumulative total return (including quarterly dividends and the change in the market price per share) of 89 percent.\nOn November 30, 2017, the Massachusetts Department of Public Utilities on Thursday approved a much-reduced rate hike for Eversource Energy that will allow it to charge its Massachusetts electric customers tens of millions of dollars more a year. On December 20, 2017, Attorney General Maura Healey appealed the DPU ruling in the Eversource rate case, specifically the DPU's approval of a costly 10 percent shareholder return, one of the highest rates allowed by an electric distribution company regulator in the last five years.\nOn January 30, 2018, Massachusetts Rep. Thomas Golden and Sen. Michael Barrett held an Oversight Hearing on the DPU's decision to approve Eversource's proposal to include a demand charge as part of a monthly minimum reliability contribution on net metering customers. Rep. Golden accused the utility of purposefully making the new charges \"as confusing as possible.\" He said, \"Let me tell you something gentlemen, I'm not happy how this was rolled out. I'm not happy with the lack of information my office has received.\" Golden, co-chairman of the Committee on Telecommunications, Utilities and Energy, helped write the 2016 law that permits utilities to levy a new minimum monthly charge, and he told Eversource executives they were making it \"extremely, extremely difficult\" for him to continue to support them in the policy.\n\nPrice manipulation controversy\nIn 2017, an environmental group accused Eversource and Avangrid of driving up electric, gas rates over several winters by buying up shipment capacity on a major pipeline that they ultimately did not use. The Environmental Defense Fund said both utilities routinely reserved big deliveries of natural gas on the Algonquin pipeline system for frigid days, but then sharply reduced those orders too late in the day for others to use that capacity. Those orders had the effect of driving up wholesale prices for natural gas during peak winter heating periods and in turn increasing the costs of electricity generated by gas-fired power plants. The two utilities “engaged in behavior that would tend to have the largest impact on prices,” said N. Jonathan Peress, a senior director at the New York-based environmental group. “That implies they knew their efforts would have some sort of pricing impact that would provide them with some commercial benefit.” Representatives for both utilities denied they did anything improper.\nMassachusetts Attorney General Maura Healey is reviewing the findings, U.S. Senator Richard Blumenthal asked the Federal Energy Regulatory Commission to open an investigation on the matter, and both the Connecticut Public Utilities Regulatory Authority and the Massachusetts Public Utilities Department are launching inquiries of their own.\nOn Feb. 27, 2018, FERC announced their investigation “revealed no evidence of anticompetitive withholding of natural gas pipeline capacity on Algonquin Gas Transmission by New England shippers.”  It said that following an extensive review Commission staff “determined that EDF’s study was flawed and led to incorrect conclusions about the alleged withholding.”\nA class-action lawsuit filed on November 14, 2017, against Avangrid, Inc. and Eversource Energy claims the two companies caused electricity consumers to incur overcharges of $3.6 billion in a years-long scheme that impacted six states and affected 14.7 million people.  The lawsuit states that 7.1 million retail electricity customers and an overall population of 14.7 million people have been affected by Eversource and Avangrid's “unique monopoly” spanning at least from 2013 to 2016. On June 10, 2019, the case was thrown out of court as the judge stated natural gas prices are federally regulated and could not be interfered with by the court.\n\nSee also\nLelan Sillin, Jr., former Northeast Utilities CEO\nList of United States natural gas companies\nList of United States electric companies\nQuebec – New England Transmission\n\nReferences\nExternal links\nCT Electric Utility Service Map\nBusiness data for Eversource Energy: \nKobak, Steve (May 8, 2009). \"46 years after breaking color barrier, NU's first black lineman retires\". The Norwalk Hour. Retrieved March 28, 2017.",
  "clean_text": "Eversource Energy is a publicly traded, Fortune 500 energy company headquartered in Springfield, Massachusetts with additional corporate offices in Hartford, Connecticut, and Boston, Massachusetts, with several regulated subsidiaries offering retail electricity, natural gas service and water service to approximately 4 million customers in Connecticut, Massachusetts, and New Hampshire. Following its 2012 merger with Boston-based NSTAR, Northeast Utilities had more than 4,270 circuit miles of electric transmission lines, 72,000 pole miles of distribution lines, and 6,459 miles of natural gas pipeline in New England. Through predecessors New England Gas & Electric System and Commonwealth Energy Systems, Eversource is the direct legal successor of the Associated Gas & Electric System, a labyrinthine trust corporation based in Massachusetts controlling over a hundred regional gas, electric, railroad and other utility monopolies across the United States, and as distant as Manila. On February 2, 2015, this company and all its subsidiaries rebranded themselves as \"Eversource Energy\". The stock symbol changed on February 19, 2015, from \"NU\" to \"ES\". Corporate structure Before its rebranding, the company operated six main subsidiaries: Connecticut Light and Power (CL&P), Public Service Company of New Hampshire (PSNH), Western Massachusetts Electric Company (WMECO), Yankee Gas Services Company (Yankee Gas), NSTAR Electric, and NSTAR Gas. NSTAR itself was the product of corporate mergers, and included the former Boston Edison Company, Cambridge Electric Light Company, Commonwealth Electric Company, Commonwealth Gas, and Cambridge Gas Company. All now currently operate under the Eversource name. Eversource remains Connecticut's largest electric utility, serving more than 1.2 million residential, municipal, commercial and industrial customers in approximately 149 cities and towns. Eversource is also New Hampshire's largest electric utility, serving over 500,000 customers, including homes and businesses, in 211 cities and towns throughout the state. Furthermore, Eversource is a major energy distributor to 1.7 million customers across Massachusetts, including over 1.4 million electric customers in 140 communities and over 300,000 natural gas customers in 51 communities. History The Rocky River Power Company, formed in 1905 by J. Henry Roraback, became the Connecticut Light and Power Company in 1917. Eversource predecessor Northeast Utilities (NU) was formed on July 1, 1966, under CEO Lelan Sillin, with the merger of the Connecticut Light and Power Company (CL&P, formed in 1917), Western Massachusetts Electric Company (WMECO, formed in 1886), and the Hartford Electric Light Company (HELCO, formed in 1878) under a single parent company, creating the first new multi-state public utility holding company since the enactment of the Public Utility Holding Company Act of 1935. In 1967, Holyoke Water Power Company (HWP) (formed in 1859) joined the NU System. Public Service Company of New Hampshire (PSNH, formed in 1926), a private company at the time, declared bankruptcy in January 1988 due to problems obtaining a license for the completed Seabrook Nuclear Power Plant. and in 1992 was merged into Northeast Utilities. In 1999, Con Edison and Northeast Utilities entered negotiations that would have created one of the largest utilities in the United States. However, Con Edison backed out of the merger in 2001 after Connecticut's Attorney General Richard Blumenthal threatened lawsuits to block it. Legislation passed in the late 1990s deregulated the electricity market in New England and required regulated utilities to divest generating stations to competitive suppliers. In 1999 the company divested all of the generating assets of WMECO and CL&P per requirements of the Massachusetts and Connecticut legislation. The company retained some of these assets by transferring them to a new subsidiary called Northeast Generation which functioned as a competitive supplier and sold the other assets entirely: WMECO's West Springfield Generating Station and several related hydroelectric and fossil fuel generating units were sold to Con Edison, while other assets (most notably the Northfield Mountain hydroelectric facility) were transferred to Northeast Generation. In 2001, NU sold the assets and operations of its subsidiary, the Holyoke Water Power Company, to the City of Holyoke including the HWP electrical distribution system and customer base and all generation with the exception of the Mt. Tom coal-fired power plant which NU retained. The city's municipal gas and electric department assumed responsibility for the generators and absorbed the HWP distribution customer base. Between 2000 and 2002 due to state laws, NU divested WMECO, CL&P, and PSNH's nuclear generating assets which consisted of their stakes in the Seabrook, Millstone, and Vermont Yankee stations. In November 2005, the company announced it would sell its unregulated competitive businesses, including generation and energy services. In November 2006 the company had essentially completed the divestiture of its competitive businesses. In 2006, NU decided to sell the generating units it had earlier retained in the 1999 divestiture as competitive suppliers and shut down its competitive generation business units. The Northeast Generation assets, including Mount Tom Station and Northfield Mountain, were all sold to Energy Capital Partners. PSNH continued to operate regulated hydroelectric and fossil fuel generation assets to serve its default/basic service customers who did not choose an alternative competitive supplier. In October 2010, Northeast Utilities announced that it would merge with NSTAR, the major electric and gas provider in Greater Boston, with the resulting company retaining the Northeast Utilities name for the next several years. After government approvals, the deal closed in April 2012. In 2015 the company (now known as Eversource) agreed to sell all of its New Hampshire generation assets in the same manner it sold its assets in Massachusetts and Connecticut between 2000 and 2006. The sale of the New Hampshire generation fleet was approved by the state's Public Utilities Commission on November 29, 2017, and completed on January 10, 2018. In June 2017 Eversource announced its merger with Aquarion Water Company for $1.675 billion. Aquarion would become a fully owned subsidiary and retain its own name, adding 300 employees and 230,000 customers in Connecticut, Massachusetts, and New Hampshire. In December 2017, the merger was completed after government approval. In 2016, Eversource started joint ventures for wind farm developments with Ørsted. In 2023, Eversource announced it would sell off its equity in these projects (Bay State Wind, South Fork Wind, Revolution Wind, and Sunrise Wind) at an expected loss of $200 million. Major projects Eversource Energy has participated in a number of projects to improve the reliability of the power grid in southwest Connecticut. The first project was construction of the $350 million 345 kilovolt Bethel–Norwalk transmission line through the western part of the state, and was constructed entirely by the company when it was still known as Northeast Utilities. With United Illuminating, an upgrade to the 69-mile (112 km), 345 kilovolt Middletown-Norwalk transmission line was energized in 2009 at a cost of $900 million. In 2013, the Greater Springfield Reliability Project, a component of the ongoing New England East-West Solution, was energized at a cost of $795 million. The project addressed numerous reliability issues with the Springfield, MA area's 115 kV transmission system by constructing two new 345 kV lines to the Agawam substation; one line north to Ludlow and the other south to North Bloomfield, Connecticut. The new 345 kV corridor added a new strong interface between Massachusetts and Connecticut. The project also involved rebuilding all of the 115 kV lines along the transmission corridor between South Agawam and Ludlow to increase their capacities, building a new 115 kV transmission substation in East Springfield (Cadwell), replacing the Fairmont 115 kV transmission substation in Chicopee with a new substation across the street, and configuring a new 115 kV line from South Agawam to Southwick using a combination of both new and old line segments of the former 115 kV path between Agawam and North Bloomfield. The new Cadwell and Fairmont switching stations allowed a number of three-terminal 115 kV lines to be broken up into two-terminal lines. Finally, the project allowed a problematic underground 115 kV transmission path through the city of Springfield that was vulnerable to thermal overloads to be removed from service by breaking it in half at the middle. The underground lines now function solely to supply the distribution load served out of the Breckwood substation in Springfield. A previously proposed costly project that would have replaced the underground cables is no longer necessary. On November 20, 2013, cutover of 115 kV lines to the new Fairmont Switching Station was complete, marking substantial completion of the GSRP. Eversource has taken action to support the use of electric vehicles. Starting in 2018, the company began spending $45 million over five years to install over 400 electric vehicle charging stations in Massachusetts. The project is part of the company's Grid Modernization plan. The company has switched much of its power source from coal to natural gas, wind, hydroelectricity and solar power. HVDC transmission (\"Northern Pass\" Project) As Northeast Utilities, the company signed on a joint venture with Hydro-Québec and NSTAR to build a new high-voltage direct current (HVDC) line from Windsor, Quebec (connecting with the Quebec grid) to a location in Franklin, New Hampshire. It was projected that the line would either run in an existing right-of-way adjacent to the HVDC line that runs through New Hampshire, or it would connect to a right-of-way in northern New Hampshire that would run through the White Mountains. This 180- to 190-mile line, projected to carry 1,200 megawatts, would have carried electricity to approximately one million homes. The issue of buying hydropower from Hydro-Québec had been an issue during the Massachusetts gubernatorial election of 2010. In November 2015, the Sierra Club of New Hampshire also expressed opposition for the new line, saying that it would not only benefit Connecticut and Massachusetts residents more than those in New Hampshire, but also the concern of the flooding of boreal forests during the construction of Hydro-Québec's dams in northern Quebec, disputes with the Innu First Nations, and the effects of tourism and the environment within the White Mountain National Forest. On January 25, 2018, Massachusetts Governor Baker selected this \"Northern Pass Transmission\" (NPT) project as the winner for a clean energy procurement RFP. However, days later on February 1, 2018, the New Hampshire Site Evaluation Committee voted unanimously to deny Eversource's controversial Northern Pass project a permit, leaving the future of the project, and $1.6 billion of Eversource's Transmission Rate Base Growth Projections in doubt. On July 26, 2019, Eversource Energy announced that it was giving up Northern Pass after the New Hampshire Supreme Court rejected its appeal and sided with the SEC. Transmission controversy (FERC Complaint) While Eversource reported that its electric transmission earnings were up 80 percent in Q2 2015, the Federal Energy Regulatory Commission (FERC) is now investigating the utility for having transmission rates that appear to be “unjust, unreasonable and unduly discriminatory or preferential”. Meanwhile, the potential for rooftop solar to prevent the need for new transmission lines is growing and Eversource wants to cap rooftop solar growth in the state. Political connections In 2015, Eversource fought the rooftop solar industry and supported anti-solar policies. In Massachusetts, they staffed the State House with lobbyists in order to end legislation promoting growth of the solar industry. During the 2015 legislative session in New Hampshire, Eversource opposed an increase to the state's solar net metering cap. New Hampshire's cap is lower than all neighboring states. Eversource disclosed on its website politically related organization expenditures of $110,000 to the Democratic Governors Association in 2016, and payments made to trade associations that were used for lobbying or other political activities in excess of $135,000. Rate hikes and solar charges In Massachusetts, Attorney General Maura Healey testified in March, 2017 before the DPU urging it to deny Eversource's proposed $300 million rate increase. In her testimony, she challenged the need for Eversource's rate increase, noting NSTAR's and WMECo's high returns over the last few years. Referencing NSTAR's 2015 return of more than 13 percent, Attorney General Healey told the DPU that “[l]ast year, no state public utility commission in the country allowed a return that high.” Between 2010 and 2015, Eversource's shareholders of common stock received a cumulative total return (including quarterly dividends and the change in the market price per share) of 89 percent. On November 30, 2017, the Massachusetts Department of Public Utilities on Thursday approved a much-reduced rate hike for Eversource Energy that will allow it to charge its Massachusetts electric customers tens of millions of dollars more a year. On December 20, 2017, Attorney General Maura Healey appealed the DPU ruling in the Eversource rate case, specifically the DPU's approval of a costly 10 percent shareholder return, one of the highest rates allowed by an electric distribution company regulator in the last five years. On January 30, 2018, Massachusetts Rep. Thomas Golden and Sen. Michael Barrett held an Oversight Hearing on the DPU's decision to approve Eversource's proposal to include a demand charge as part of a monthly minimum reliability contribution on net metering customers. Rep. Golden accused the utility of purposefully making the new charges \"as confusing as possible.\" He said, \"Let me tell you something gentlemen, I'm not happy how this was rolled out. I'm not happy with the lack of information my office has received.\" Golden, co-chairman of the Committee on Telecommunications, Utilities and Energy, helped write the 2016 law that permits utilities to levy a new minimum monthly charge, and he told Eversource executives they were making it \"extremely, extremely difficult\" for him to continue to support them in the policy. Price manipulation controversy In 2017, an environmental group accused Eversource and Avangrid of driving up electric, gas rates over several winters by buying up shipment capacity on a major pipeline that they ultimately did not use. The Environmental Defense Fund said both utilities routinely reserved big deliveries of natural gas on the Algonquin pipeline system for frigid days, but then sharply reduced those orders too late in the day for others to use that capacity. Those orders had the effect of driving up wholesale prices for natural gas during peak winter heating periods and in turn increasing the costs of electricity generated by gas-fired power plants. The two utilities “engaged in behavior that would tend to have the largest impact on prices,” said N. Jonathan Peress, a senior director at the New York-based environmental group. “That implies they knew their efforts would have some sort of pricing impact that would provide them with some commercial benefit.” Representatives for both utilities denied they did anything improper. Massachusetts Attorney General Maura Healey is reviewing the findings, U.S. Senator Richard Blumenthal asked the Federal Energy Regulatory Commission to open an investigation on the matter, and both the Connecticut Public Utilities Regulatory Authority and the Massachusetts Public Utilities Department are launching inquiries of their own. On Feb. 27, 2018, FERC announced their investigation “revealed no evidence of anticompetitive withholding of natural gas pipeline capacity on Algonquin Gas Transmission by New England shippers.” It said that following an extensive review Commission staff “determined that EDF’s study was flawed and led to incorrect conclusions about the alleged withholding.” A class-action lawsuit filed on November 14, 2017, against Avangrid, Inc. and Eversource Energy claims the two companies caused electricity consumers to incur overcharges of $3.6 billion in a years-long scheme that impacted six states and affected 14.7 million people. The lawsuit states that 7.1 million retail electricity customers and an overall population of 14.7 million people have been affected by Eversource and Avangrid's “unique monopoly” spanning at least from 2013 to 2016. On June 10, 2019, the case was thrown out of court as the judge stated natural gas prices are federally regulated and could not be interfered with by the court."
}