{
  "ticker": "ESS",
  "cik": "0000920522",
  "company_name": "Essex Property Trust",
  "corrected_name": "Essex Property Trust",
  "wiki_title_used": "Essex Property Trust",
  "exists": true,
  "raw_text": "Essex Property Trust is a publicly traded real estate investment trust that invests in apartments in California and in the Seattle metropolitan area.\nAs of December 31, 2023, the company owned interests in 252 apartment complexes, aggregating 61,997 apartment units, and 3 commercial office buildings, comprising 283,000 square feet.\nIt is the 11th largest owner of apartments in the United States and the 26th largest apartment property manager in the United States.\n\nHistory\nThe company was founded in 1971 by billionaire George M. Marcus, who also founded Marcus & Millichap that same year.\nOn June 13, 1994, the company became a public company via an initial public offering.\nIn April 2014, the company acquired BRE Properties for $4.3 billion.\nIn 2024, it acquired ownership interests in a joint venture owning 4 properties for $505 million.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Essex Property Trust, Inc.:",
  "clean_text": "Essex Property Trust is a publicly traded real estate investment trust that invests in apartments in California and in the Seattle metropolitan area. As of December 31, 2023, the company owned interests in 252 apartment complexes, aggregating 61,997 apartment units, and 3 commercial office buildings, comprising 283,000 square feet. It is the 11th largest owner of apartments in the United States and the 26th largest apartment property manager in the United States. History The company was founded in 1971 by billionaire George M. Marcus, who also founded Marcus & Millichap that same year. On June 13, 1994, the company became a public company via an initial public offering. In April 2014, the company acquired BRE Properties for $4.3 billion. In 2024, it acquired ownership interests in a joint venture owning 4 properties for $505 million."
}