{
  "ticker": "ETN",
  "cik": "0001551182",
  "company_name": "Eaton Corporation",
  "corrected_name": "Eaton Corporation",
  "wiki_title_used": "Eaton Corporation",
  "exists": true,
  "raw_text": "Eaton Corporation plc is an American-Irish-domiciled multinational power management company, with a primary administrative center in Beachwood, Ohio. Eaton has more than 85,000 employees and sells products to customers in more than 175 countries.\n\nHistory\nIn 1911, Joseph O. Eaton, brother-in-law Henning O. Taube and Viggo V. Torbensen, incorporated the Torbensen Gear and Axle Co. in Bloomfield, New Jersey. With financial backing from Torbensen's mother, the company was set to manufacture Torbensen's patented internal-gear truck axle. In 1914, the company moved to Cleveland, Ohio, to be closer to its core business, the automotive industry.\nThe Torbensen Axle Company incorporated in Ohio in 1916, succeeding the New Jersey corporation. A year later, Republic Motor Truck Company, Torbensen's largest customer bought out the company. But Eaton and Torbensen were not content and bowed out of Republic to form the Eaton Axle Company in 1919. A year later, in 1920, Eaton Axle Company merged with Standard Parts. Standard Parts went in receivership later the same year and was later liquidated. In 1923, Eaton bought the Torbensen Axle Co. back from Republic and changed the name to the Eaton Axle and Spring Company.\nEaton officers believed the quickest way to grow the business was through acquisitions and began buying companies in the automotive industry. By 1932, the diversified company changed its name to Eaton Manufacturing Company. In 1937, Eaton became international by opening a manufacturing plant in Canada. In 1958 Eaton Corporation acquired Fuller Manufacturing. The company name changed once again in 1965 to Eaton Yale & Towne Inc. after the acquisition of Yale & Towne Manufacturing Co. in 1963. Stockholders approved the change to the company's current name in 1971. In 1978, Eaton Corporation acquired Samuel Moore & Company, Kenway Systems, and Cutler-Hammer.\n\nCurrent work\nEaton's businesses are divided into the following sectors:\n\nElectrical\nThe electrical sector's products include circuit breakers, switchgear, busway, UPS systems, power distribution units, panel boards, load centers, motor controls, meters, sensors, relays, PLCs, HMIs, and inverters. The main markets for the Electrical Americas and Electrical Rest of World segments are industrial, institutional, government, utility, commercial, residential, information technology and original equipment manufacturer customers.\n\nAerospace\nFor the aerospace industry, Eaton manufactures and markets a line of systems and components for hydraulic, fuel, motion control, pneumatic systems and engines.\n\nMobility\nThe Mobility Group comprises the company's Vehicle and eMobility segments, including the Roadranger division providing:\n\nEaton clutches\nEaton automated and mechanical transmissions\nEaton hybrid power systems: mounted between the UltraShift automated manual transmission and clutch is an electric motor/generator, connected to a power inverter using lithium-ion batteries, controlled with an electronic control module. The system has a fail-safe that reverts to conventional engine-powered operation should some fault occur.\nRoadranger synthetic lubricants\nEaton MD mobile diagnostics\nThe truck segment is involved in the design, manufacture and marketing of powertrain systems and other components for commercial vehicle markets. Key products include manual and automated transmissions, clutches, drive-line components, and hybrid power.\nEaton's automotive segment produces products such as superchargers, engine valves, valve train components, cylinder heads, locking and limited-slip differentials, heavy-duty drive-line components, fuel, emissions, and safety controls, transmission and engine controls, spoilers, exterior moldings, plastic components, and fluid connectors.\nThe eMobility sector combines elements of Eaton's electrical and vehicle businesses to deliver electric vehicles to passenger car, commercial vehicle and off-highway OEMs.\n\nAcquisitions and divestments\nIn one of Eaton's largest acquisitions, the company purchased the Westinghouse Distribution and Controls Business Unit in 1994. The acquisition included all of the Westinghouse electrical distribution and control product business and also included stipulations that the Westinghouse name cannot be used by anyone else on these types of products for years. Today, Eaton Electrical manufactures electrical distribution and control products branded \"Eaton\" or \"Cutler-Hammer\", which can replace Westinghouse products in commercial and industrial applications.\nEaton spun off its semiconductor manufacturing equipment business as Axcelis Technologies in 2000.\nIn 2003, Eaton's Electrical Distribution and Control business (formerly known as Cutler-Hammer) acquired the electrical division of Delta plc. This acquisition brought Delta's brands Holec, MEM, Tabula, Bill and Elek under the Eaton nameplate with the previous Westinghouse divisions and gave the company manufacturing facilities to meet IEC standards, one of the steps to become a global company and developing a worldwide standard.\nSoon after this acquisition, Eaton entered a joint venture with Caterpillar Inc. and purchased 51% of I & S operations, now known as Intelligent Switchgear Organization, LLC. This was followed in 2004 by the acquisition of Powerware. The Powerware brand is known for the design and production of medium to large Uninterruptible Power System (UPS) devices.  After several years of co-branding UPS products \"Eaton|Powerware\" the company is switching to the single brand Eaton for all UPS products including; BladeUPS, 9355, 9390, 9395, and 9E.\nIn 2006, Eaton entered the data center power distribution market.  Initial products were internally developed PDU's and RPP's under the Powerware brand and included the PowerXpert metering system. A Powerware brand Static Transfer Switch was added to the portfolio through a brand-label relationship with Cyberex. To complete the power distribution portfolio Eaton released a line of rack power distribution products under its Powerware brand called ePDU. It acquired Aphel Technologies Ltd., a manufacturer of power distribution product for data centers based in Coventry, UK. Shortly after, it added Pulizzi Engineering Inc., a manufacturer of mission critical power distribution based in Santa Ana, California. In late 2007, it acquired the MGE Office Protection Systems division of Schneider Electric, as a result of Schneider's acquisition of APC. A Taiwanese manufacturer, Phoenixtec, was also acquired giving the company the highest share in the Chinese single-phase UPS market.\nOn 21 May 2012, Eaton announced that they had agreed to purchase Ireland-based Cooper Industries in a cash-and-stock deal valued at about $11.46 billion. The new company is called Eaton Corporation plc and is incorporated in Ireland. Then-Chairman and CEO of Eaton Alexander Cutler headed the new corporation. Cooper shareholders received $39.15 in cash and 0.77479 of a share in the newly created company for each Cooper share held. This is worth $72 per share based on Eaton's closing share price of $42.40 on 18 May 2012, and is 29% above Cooper's closing stock price. Eaton Corporation plc completed its acquisition of Cooper Industries on 30 Nov 2012. The $13 billion acquisition of Cooper (US$5.4B Sales revenue (2011)), became the largest in Eaton's (US$16B Sales Revenue (2011)) 101-year history.\nOn 17 Mar 2021, Eaton completed the acquisition of Tripp Lite for $1.65 billion. President and COO of Electrical Sector, Eaton Uday Yadav said \"The acquisition of Tripp Lite will enhance the breadth of our edge computing and distributed IT product portfolio and expand our single-phase UPS business.\" The acquisition will further Eaton's access to the consumer market in which Tripp Lite has a strong position.\nEaton's hydraulics business, manufacturing systems and components for the agriculture, construction, mining, forestry, utility, material handling, machine tools, molding, power generation, primary metals, and oil and gas markets, was acquired by Danfoss in August 2021 for $3.3 billion.\n\nHeadquarters\nFrom 1920s-1964 Eaton was based on East 140th Street in Cleveland, Ohio. In 1964, the company moved its headquarters into the new Erieview Tower where it remained until 1983. In that year, Eaton Corporation moved into a 28-story Cleveland office tower which was renamed for it. Eaton relocated to its new 580,000 square foot facility, named Eaton Center, in Beachwood, Ohio in early 2013. They reincorporated, as a means of reducing their U.S. corporate tax burden, in Ireland as part of the Cooper merger involved establishing a registered head office in Dublin, Ireland but operational headquarters remain in Beachwood.\n\nLawsuits and other issues\nRacial harassment\nIn 1995, Eaton Corp had to pay $1.25M in restitution to a former employee who had been subject to racial harassment. Incidents included food being thrown on his desk, food being thrown through the roof of his car, use of the word \"nigger\", and the presence of neo-Nazi flyers at Eaton Corp.\nIn 2020, an employee sued Eaton Corp for retaliation and facilitating a climate of racial harassment. After a profane outburst from a fellow worker, the plaintiff was assigned to work and train under a supervisor who abused him psychologically. The supervisor made frequent use of \"nigger\", made reference to slavery and lynching, and claimed his job was to get rid of Black workers. The employee informed management of his hostile work environment, but management responded by disciplining the plaintiff himself.\n\nLong-term benefits\nBack when Eaton Corp was struggling with bankruptcy, various employees on long-term benefits suddenly found themselves terminated. Eaton had failed to insure the plan that the employees had nonetheless paid for. This led to numerous suits against Eaton.\n\nTax avoidance\nIn 2012, the acquisition of Cooper Industries made it possible for Eaton Corp to become an Irish company, which would sharply lower its corporate tax rate. The move was later denounced by both President Obama and President Donald Trump.\n\nTriumph Group\nIn 2004, Eaton Corp sued Triumph Group for trade secrets theft, but when it was discovered that the company's lawyers were paying former Hinds County District Attorney Ed Peters to improperly influence Hinds County Circuit Judge Bobby DeLaughter, the defendants countersued. In 2014, Eaton Corp paid $135M to Triumph Group and $13M to six former employees to settle the long-running legal dispute. Judge DeLaughter was sentenced to 18 months in prison.\n\nSoftware sabotage\nIn 2018, Eaton Corporation became the target of internal sabotage by a longtime software developer following a corporate restructuring. The employee, Davis Lu, embedded malicious code in the company’s Windows production environment, including a kill switch that would trigger if his account was disabled. When Lu was terminated in September 2019, the kill switch activated, locking out thousands of users and severely disrupting Eaton's global operations. The incident caused hundreds of thousands of dollars in damages. Lu was later convicted of intentionally damaging protected computers and, in 2025, was sentenced to four years in prison and three years of supervised release.\n\nCorporate recognition and rankings\nRecognitions include the following:\n\nRanked #4 in \"100 Best Corporate Citizens\" of Corporate Responsibility Magazine in 2013, also ranking in Top 50 for Six Consecutive Years.\nNamed to Thomson Reuters Top 100 Innovators List, 2011 - 2012 - 2013.\n\nSee also\nCooper Industries\nEagle Electric\nPowerware\nCorporation tax in the Republic of Ireland#Corporate tax inversions\n\nReferences\nThe History of Eaton Corporation 1911–1985\nSecurities and Exchange Commission\n\nExternal links\nOfficial website \nBusiness data for Eaton Corporation: \n Media related to Eaton Corporation at Wikimedia Commons",
  "clean_text": "Eaton Corporation plc is an American-Irish-domiciled multinational power management company, with a primary administrative center in Beachwood, Ohio. Eaton has more than 85,000 employees and sells products to customers in more than 175 countries. History In 1911, Joseph O. Eaton, brother-in-law Henning O. Taube and Viggo V. Torbensen, incorporated the Torbensen Gear and Axle Co. in Bloomfield, New Jersey. With financial backing from Torbensen's mother, the company was set to manufacture Torbensen's patented internal-gear truck axle. In 1914, the company moved to Cleveland, Ohio, to be closer to its core business, the automotive industry. The Torbensen Axle Company incorporated in Ohio in 1916, succeeding the New Jersey corporation. A year later, Republic Motor Truck Company, Torbensen's largest customer bought out the company. But Eaton and Torbensen were not content and bowed out of Republic to form the Eaton Axle Company in 1919. A year later, in 1920, Eaton Axle Company merged with Standard Parts. Standard Parts went in receivership later the same year and was later liquidated. In 1923, Eaton bought the Torbensen Axle Co. back from Republic and changed the name to the Eaton Axle and Spring Company. Eaton officers believed the quickest way to grow the business was through acquisitions and began buying companies in the automotive industry. By 1932, the diversified company changed its name to Eaton Manufacturing Company. In 1937, Eaton became international by opening a manufacturing plant in Canada. In 1958 Eaton Corporation acquired Fuller Manufacturing. The company name changed once again in 1965 to Eaton Yale & Towne Inc. after the acquisition of Yale & Towne Manufacturing Co. in 1963. Stockholders approved the change to the company's current name in 1971. In 1978, Eaton Corporation acquired Samuel Moore & Company, Kenway Systems, and Cutler-Hammer. Current work Eaton's businesses are divided into the following sectors: Electrical The electrical sector's products include circuit breakers, switchgear, busway, UPS systems, power distribution units, panel boards, load centers, motor controls, meters, sensors, relays, PLCs, HMIs, and inverters. The main markets for the Electrical Americas and Electrical Rest of World segments are industrial, institutional, government, utility, commercial, residential, information technology and original equipment manufacturer customers. Aerospace For the aerospace industry, Eaton manufactures and markets a line of systems and components for hydraulic, fuel, motion control, pneumatic systems and engines. Mobility The Mobility Group comprises the company's Vehicle and eMobility segments, including the Roadranger division providing: Eaton clutches Eaton automated and mechanical transmissions Eaton hybrid power systems: mounted between the UltraShift automated manual transmission and clutch is an electric motor/generator, connected to a power inverter using lithium-ion batteries, controlled with an electronic control module. The system has a fail-safe that reverts to conventional engine-powered operation should some fault occur. Roadranger synthetic lubricants Eaton MD mobile diagnostics The truck segment is involved in the design, manufacture and marketing of powertrain systems and other components for commercial vehicle markets. Key products include manual and automated transmissions, clutches, drive-line components, and hybrid power. Eaton's automotive segment produces products such as superchargers, engine valves, valve train components, cylinder heads, locking and limited-slip differentials, heavy-duty drive-line components, fuel, emissions, and safety controls, transmission and engine controls, spoilers, exterior moldings, plastic components, and fluid connectors. The eMobility sector combines elements of Eaton's electrical and vehicle businesses to deliver electric vehicles to passenger car, commercial vehicle and off-highway OEMs. Acquisitions and divestments In one of Eaton's largest acquisitions, the company purchased the Westinghouse Distribution and Controls Business Unit in 1994. The acquisition included all of the Westinghouse electrical distribution and control product business and also included stipulations that the Westinghouse name cannot be used by anyone else on these types of products for years. Today, Eaton Electrical manufactures electrical distribution and control products branded \"Eaton\" or \"Cutler-Hammer\", which can replace Westinghouse products in commercial and industrial applications. Eaton spun off its semiconductor manufacturing equipment business as Axcelis Technologies in 2000. In 2003, Eaton's Electrical Distribution and Control business (formerly known as Cutler-Hammer) acquired the electrical division of Delta plc. This acquisition brought Delta's brands Holec, MEM, Tabula, Bill and Elek under the Eaton nameplate with the previous Westinghouse divisions and gave the company manufacturing facilities to meet IEC standards, one of the steps to become a global company and developing a worldwide standard. Soon after this acquisition, Eaton entered a joint venture with Caterpillar Inc. and purchased 51% of I & S operations, now known as Intelligent Switchgear Organization, LLC. This was followed in 2004 by the acquisition of Powerware. The Powerware brand is known for the design and production of medium to large Uninterruptible Power System (UPS) devices. After several years of co-branding UPS products \"Eaton|Powerware\" the company is switching to the single brand Eaton for all UPS products including; BladeUPS, 9355, 9390, 9395, and 9E. In 2006, Eaton entered the data center power distribution market. Initial products were internally developed PDU's and RPP's under the Powerware brand and included the PowerXpert metering system. A Powerware brand Static Transfer Switch was added to the portfolio through a brand-label relationship with Cyberex. To complete the power distribution portfolio Eaton released a line of rack power distribution products under its Powerware brand called ePDU. It acquired Aphel Technologies Ltd., a manufacturer of power distribution product for data centers based in Coventry, UK. Shortly after, it added Pulizzi Engineering Inc., a manufacturer of mission critical power distribution based in Santa Ana, California. In late 2007, it acquired the MGE Office Protection Systems division of Schneider Electric, as a result of Schneider's acquisition of APC. A Taiwanese manufacturer, Phoenixtec, was also acquired giving the company the highest share in the Chinese single-phase UPS market. On 21 May 2012, Eaton announced that they had agreed to purchase Ireland-based Cooper Industries in a cash-and-stock deal valued at about $11.46 billion. The new company is called Eaton Corporation plc and is incorporated in Ireland. Then-Chairman and CEO of Eaton Alexander Cutler headed the new corporation. Cooper shareholders received $39.15 in cash and 0.77479 of a share in the newly created company for each Cooper share held. This is worth $72 per share based on Eaton's closing share price of $42.40 on 18 May 2012, and is 29% above Cooper's closing stock price. Eaton Corporation plc completed its acquisition of Cooper Industries on 30 Nov 2012. The $13 billion acquisition of Cooper (US$5.4B Sales revenue (2011)), became the largest in Eaton's (US$16B Sales Revenue (2011)) 101-year history. On 17 Mar 2021, Eaton completed the acquisition of Tripp Lite for $1.65 billion. President and COO of Electrical Sector, Eaton Uday Yadav said \"The acquisition of Tripp Lite will enhance the breadth of our edge computing and distributed IT product portfolio and expand our single-phase UPS business.\" The acquisition will further Eaton's access to the consumer market in which Tripp Lite has a strong position. Eaton's hydraulics business, manufacturing systems and components for the agriculture, construction, mining, forestry, utility, material handling, machine tools, molding, power generation, primary metals, and oil and gas markets, was acquired by Danfoss in August 2021 for $3.3 billion. Headquarters From 1920s-1964 Eaton was based on East 140th Street in Cleveland, Ohio. In 1964, the company moved its headquarters into the new Erieview Tower where it remained until 1983. In that year, Eaton Corporation moved into a 28-story Cleveland office tower which was renamed for it. Eaton relocated to its new 580,000 square foot facility, named Eaton Center, in Beachwood, Ohio in early 2013. They reincorporated, as a means of reducing their U.S. corporate tax burden, in Ireland as part of the Cooper merger involved establishing a registered head office in Dublin, Ireland but operational headquarters remain in Beachwood. Lawsuits and other issues Racial harassment In 1995, Eaton Corp had to pay $1.25M in restitution to a former employee who had been subject to racial harassment. Incidents included food being thrown on his desk, food being thrown through the roof of his car, use of the word \"nigger\", and the presence of neo-Nazi flyers at Eaton Corp. In 2020, an employee sued Eaton Corp for retaliation and facilitating a climate of racial harassment. After a profane outburst from a fellow worker, the plaintiff was assigned to work and train under a supervisor who abused him psychologically. The supervisor made frequent use of \"nigger\", made reference to slavery and lynching, and claimed his job was to get rid of Black workers. The employee informed management of his hostile work environment, but management responded by disciplining the plaintiff himself. Long-term benefits Back when Eaton Corp was struggling with bankruptcy, various employees on long-term benefits suddenly found themselves terminated. Eaton had failed to insure the plan that the employees had nonetheless paid for. This led to numerous suits against Eaton. Tax avoidance In 2012, the acquisition of Cooper Industries made it possible for Eaton Corp to become an Irish company, which would sharply lower its corporate tax rate. The move was later denounced by both President Obama and President Donald Trump. Triumph Group In 2004, Eaton Corp sued Triumph Group for trade secrets theft, but when it was discovered that the company's lawyers were paying former Hinds County District Attorney Ed Peters to improperly influence Hinds County Circuit Judge Bobby DeLaughter, the defendants countersued. In 2014, Eaton Corp paid $135M to Triumph Group and $13M to six former employees to settle the long-running legal dispute. Judge DeLaughter was sentenced to 18 months in prison. Software sabotage In 2018, Eaton Corporation became the target of internal sabotage by a longtime software developer following a corporate restructuring. The employee, Davis Lu, embedded malicious code in the company’s Windows production environment, including a kill switch that would trigger if his account was disabled. When Lu was terminated in September 2019, the kill switch activated, locking out thousands of users and severely disrupting Eaton's global operations. The incident caused hundreds of thousands of dollars in damages. Lu was later convicted of intentionally damaging protected computers and, in 2025, was sentenced to four years in prison and three years of supervised release. Corporate recognition and rankings Recognitions include the following: Ranked #4 in \"100 Best Corporate Citizens\" of Corporate Responsibility Magazine in 2013, also ranking in Top 50 for Six Consecutive Years. Named to Thomson Reuters Top 100 Innovators List, 2011 - 2012 - 2013."
}