{
  "ticker": "ETR",
  "cik": "0000065984",
  "company_name": "Entergy",
  "corrected_name": "Entergy",
  "wiki_title_used": "Entergy",
  "exists": true,
  "raw_text": "Entergy Corporation is an American energy company engaged in electric power production and retail distribution operations in the Deep South of the United States. Entergy is headquartered in New Orleans, Louisiana, and generates and distributes electric power to 3 million customers in Arkansas, Louisiana, Mississippi and Texas. Entergy has approximately 24,000 megawatts of electric generating capacity, annual revenues of $11 billion and employs more than 12,000 people.\n\nHistory\nEntergy traces its history to November 13, 1913, with the formation of Arkansas Power Company. Founder Harvey C. Couch used sawdust from a lumber company to bring electricity to rural Arkansas. In the 1920s, Couch set his sights on buying electric companies in other states. In 1923, he merged four independent companies in Mississippi into Mississippi Power and Light. Two years later, he formed Louisiana Power and Light to provide power to his Mississippi customers from northern Louisiana's natural gas fields.\nMeanwhile, in 1922, the Electric Bond and Share Company (EBASCO, a subsidiary of General Electric) under Sidney Z. Mitchell merged several competing streetcar and electric utilities into New Orleans Public Service. Mitchell began turning his attention to other territories, and eventually began competing with Couch. The two men ultimately decided to merge their resources. In 1925, Electric Power and Light Corporation was formed, an EBASCO subsidiary headquartered in New Orleans, with Couch as its president. It was the parent company for Mississippi Power and Light, Louisiana Power and Light, New Orleans Public Service, and Arkansas Power and Light.\nEBASCO fought the constitutionality of the Public Utility Holding Company Act of 1935, losing a Supreme Court case in 1938, and was ordered dissolved under the provisions of that act in 1949. Mississippi Power and Light, Louisiana Power and Light, New Orleans Public Service and Arkansas Power and Light were deemed to be an integrated system, and were reorganized under the control of a new holding company, Middle South Utilities.  It changed its name to Entergy in 1989, and merged/bought Gulf States Utilities, based in Beaumont, Texas, as of 12:00 midnight, January 1, 1994.\nIn the late 1990s, Entergy pursued a strategy of global expansion into unregulated markets, acquiring substantial facilities in Australia, Argentina, and the United Kingdom. Shareholder dissatisfaction with the results of this strategy led to a shakeup of management, culminating with the ouster of longtime CEO Ed Lupberger in 1998. Lupberger was replaced by Wayne Leonard, formerly of Cinergy, who supervised the company's disinvestment from overseas holdings.\nSince its inception, Entergy has been headquartered in New Orleans. That city had also been home to Entergy's various corporate predecessors since 1925. After Hurricane Katrina hit the city of New Orleans in August 2005, Entergy temporarily relocated the 1,500 employees and contractors who worked at the headquarters to other cities, including Clinton, Mississippi, Little Rock, Arkansas, and The Woodlands, Texas. In April 2006, the company began moving back into its New Orleans headquarters.\nIn 2011, Entergy and Coulomb Technologies, an electric vehicle charging station maker, began to donate free electric vehicle charging stations at 16 sites at college campuses in the southern US Its first installation was at Louisiana State University in Baton Rouge, and is free to use for faculty and students.\nIn 2013, Entergy joined the Midcontinent Independent System Operator (MISO) as is southern region following an Department of Justice investigation into the company's anti-competitive behavior. By joining MISO rather than the Southwest Power Pool, Entergy's service areas have limited interconnection to the remainder of the transmission organization, which reduces flow of cheaper electricity into the area. With a integrated power utility business model, Entergy makes money by constructing power plants, reducing the company's incentive to build transmission connecting it to other regions. Experts state these capacity contraints result in higher profits for the company at the expense of customers and lower reliability, such as rolling blackouts during Winter Storm Uri in 2021.\n\nSubsidiaries\nEntergy Arkansas (formerly Arkansas Power and Light Company (AP&L))\nEntergy Louisiana (formerly Louisiana Power and Light Company (LP&L))\nEntergy Gulf States Louisiana (formerly the Louisiana operations of Gulf States Utilities (GSU)) was merged into Entergy Louisiana in 2015.\nEntergy New Orleans (formerly New Orleans Public Service, Inc. (NOPSI))\nEntergy Nuclear\nEntergy Mississippi (formerly Mississippi Power and Light Company (MP&L))\nEntergy Texas (formerly the Texas operations of Gulf States Utilities (GSU))\n\nFormer subsidiary company logos\nPrior to the use of the current Entergy logo, each subsidiary had its own distinctive logo. Upon the renaming of the company from Middle South Utilities System to Entergy, the present logo was adopted.\nLouisiana Power and Light Company (now Entergy Louisiana), for instance, made extensive use of the logo shown on the right between approximately 1967 and 1989, featuring it on buildings, equipment, and in advertising. Each of Middle South Utilities' subsidiaries adopted logos of a similar style.\n\nOperations\nEntergy's service territory includes the southeast corner of Louisiana and the cities of Lafayette and Baton Rouge, the eastern three-fourths of Arkansas and the western half of Mississippi. It also includes part of southeastern Texas, including the Beaumont-Port Arthur-Orange and Conroe-Woodlands-Kingwood areas.\nA member of the Fortune 500, Entergy owns and operates power plants with approximately 30,000 megawatts of electric generating capacity, and it is the second-largest nuclear generator in the United States after Exelon Corporation. It had annual revenues of more than $11 billion in 2010 and approximately 15,000 employees.\nEntergy's main operating segments consist of the US utility segment and the non-utility nuclear segment. The US utility segment provides retail electricity services to approximately 2.9 million customers in Arkansas, Louisiana, Mississippi, and Texas. The non-utility nuclear segment owns and operates a total of six nuclear units, and provided support services to one:\n\nMichigan – Palisades Nuclear Generating Station (closed in spring of 2022)\nArkansas – Arkansas Nuclear One Units 1 and 2\nLouisiana – River Bend Nuclear Generating Station and Waterford Nuclear Generating Station\nMississippi – Grand Gulf Nuclear Generating Station\nNebraska – support services for the Cooper Nuclear Station through 2014, terminated in 2022.\nThe company's nuclear division is headquartered in Jackson, Mississippi.\nEntergy operates more than 40 plants using natural gas, nuclear, coal, oil and hydroelectric power with approximately 30,000 megawatts of electric generating capacity to serve its 2.9 million customers in the Gulf South. Its extensive transmission system carries approximately 30,000 megawatts of power across more than 15,700 miles (25,300 km) of interconnected lines within a 114,000-square-mile (300,000 km2) area.\nEntergy is the only US utility to make the Dow Jones Sustainability Index (DJSI) nine years in a row. The DJSI is a listing of the companies whose overall environmental, social and economic sustainability performance scores were in the top 10 percent for their sector. Entergy was named in 2008 to Forbes list of America's Most Trustworthy Companies, a ranking based on corporate governance practices and accounting transparency.\nOn February 24, 2010, the Vermont Senate voted to prevent the Vermont Public Service Board from issuing the necessary certificate that would allow for the Vermont Yankee plant  to have its license renewed for another 20 years. The vote will not affect current operation of the plant, and the issue could be revisited by the legislature in either a special session later in 2010 or in its next regular session in 2011.\n\nEntergy Texas\nEntergy Texas operates as a wholly owned subsidiary. This was done to prepare the Texas side for de-regulation under Texas law, but Entergy later notified the Public Utility Commission of Texas that it would not split off the Texas side as a de-regulated operation. Because of this, the Texas side remains connected to the Entergy network; until 2012, it was based on where the former Gulf States Utilities was in Beaumont.\n\nNew Orleans gas plant astroturf scandal\nIn May 2018, Entergy New Orleans was embroiled in a scandal surrounding its controversial proposal for a natural gas power plant in East New Orleans. An Entergy subcontractor used Crowds on Demand to artificially lobby council support for the gas plant, prompting accusals of astroturfing. The New Orleans City Council ended up fining Entergy New Orleans $5 million for this paid actors scandal.\n\nSee also\nArkansas Power and Light Building, now known as the Entergy Building\n\nReferences\nExternal links\nOfficial website \nBusiness data for Entergy Corporation:",
  "clean_text": "Entergy Corporation is an American energy company engaged in electric power production and retail distribution operations in the Deep South of the United States. Entergy is headquartered in New Orleans, Louisiana, and generates and distributes electric power to 3 million customers in Arkansas, Louisiana, Mississippi and Texas. Entergy has approximately 24,000 megawatts of electric generating capacity, annual revenues of $11 billion and employs more than 12,000 people. History Entergy traces its history to November 13, 1913, with the formation of Arkansas Power Company. Founder Harvey C. Couch used sawdust from a lumber company to bring electricity to rural Arkansas. In the 1920s, Couch set his sights on buying electric companies in other states. In 1923, he merged four independent companies in Mississippi into Mississippi Power and Light. Two years later, he formed Louisiana Power and Light to provide power to his Mississippi customers from northern Louisiana's natural gas fields. Meanwhile, in 1922, the Electric Bond and Share Company (EBASCO, a subsidiary of General Electric) under Sidney Z. Mitchell merged several competing streetcar and electric utilities into New Orleans Public Service. Mitchell began turning his attention to other territories, and eventually began competing with Couch. The two men ultimately decided to merge their resources. In 1925, Electric Power and Light Corporation was formed, an EBASCO subsidiary headquartered in New Orleans, with Couch as its president. It was the parent company for Mississippi Power and Light, Louisiana Power and Light, New Orleans Public Service, and Arkansas Power and Light. EBASCO fought the constitutionality of the Public Utility Holding Company Act of 1935, losing a Supreme Court case in 1938, and was ordered dissolved under the provisions of that act in 1949. Mississippi Power and Light, Louisiana Power and Light, New Orleans Public Service and Arkansas Power and Light were deemed to be an integrated system, and were reorganized under the control of a new holding company, Middle South Utilities. It changed its name to Entergy in 1989, and merged/bought Gulf States Utilities, based in Beaumont, Texas, as of 12:00 midnight, January 1, 1994. In the late 1990s, Entergy pursued a strategy of global expansion into unregulated markets, acquiring substantial facilities in Australia, Argentina, and the United Kingdom. Shareholder dissatisfaction with the results of this strategy led to a shakeup of management, culminating with the ouster of longtime CEO Ed Lupberger in 1998. Lupberger was replaced by Wayne Leonard, formerly of Cinergy, who supervised the company's disinvestment from overseas holdings. Since its inception, Entergy has been headquartered in New Orleans. That city had also been home to Entergy's various corporate predecessors since 1925. After Hurricane Katrina hit the city of New Orleans in August 2005, Entergy temporarily relocated the 1,500 employees and contractors who worked at the headquarters to other cities, including Clinton, Mississippi, Little Rock, Arkansas, and The Woodlands, Texas. In April 2006, the company began moving back into its New Orleans headquarters. In 2011, Entergy and Coulomb Technologies, an electric vehicle charging station maker, began to donate free electric vehicle charging stations at 16 sites at college campuses in the southern US Its first installation was at Louisiana State University in Baton Rouge, and is free to use for faculty and students. In 2013, Entergy joined the Midcontinent Independent System Operator (MISO) as is southern region following an Department of Justice investigation into the company's anti-competitive behavior. By joining MISO rather than the Southwest Power Pool, Entergy's service areas have limited interconnection to the remainder of the transmission organization, which reduces flow of cheaper electricity into the area. With a integrated power utility business model, Entergy makes money by constructing power plants, reducing the company's incentive to build transmission connecting it to other regions. Experts state these capacity contraints result in higher profits for the company at the expense of customers and lower reliability, such as rolling blackouts during Winter Storm Uri in 2021. Subsidiaries Entergy Arkansas (formerly Arkansas Power and Light Company (AP&L)) Entergy Louisiana (formerly Louisiana Power and Light Company (LP&L)) Entergy Gulf States Louisiana (formerly the Louisiana operations of Gulf States Utilities (GSU)) was merged into Entergy Louisiana in 2015. Entergy New Orleans (formerly New Orleans Public Service, Inc. (NOPSI)) Entergy Nuclear Entergy Mississippi (formerly Mississippi Power and Light Company (MP&L)) Entergy Texas (formerly the Texas operations of Gulf States Utilities (GSU)) Former subsidiary company logos Prior to the use of the current Entergy logo, each subsidiary had its own distinctive logo. Upon the renaming of the company from Middle South Utilities System to Entergy, the present logo was adopted. Louisiana Power and Light Company (now Entergy Louisiana), for instance, made extensive use of the logo shown on the right between approximately 1967 and 1989, featuring it on buildings, equipment, and in advertising. Each of Middle South Utilities' subsidiaries adopted logos of a similar style. Operations Entergy's service territory includes the southeast corner of Louisiana and the cities of Lafayette and Baton Rouge, the eastern three-fourths of Arkansas and the western half of Mississippi. It also includes part of southeastern Texas, including the Beaumont-Port Arthur-Orange and Conroe-Woodlands-Kingwood areas. A member of the Fortune 500, Entergy owns and operates power plants with approximately 30,000 megawatts of electric generating capacity, and it is the second-largest nuclear generator in the United States after Exelon Corporation. It had annual revenues of more than $11 billion in 2010 and approximately 15,000 employees. Entergy's main operating segments consist of the US utility segment and the non-utility nuclear segment. The US utility segment provides retail electricity services to approximately 2.9 million customers in Arkansas, Louisiana, Mississippi, and Texas. The non-utility nuclear segment owns and operates a total of six nuclear units, and provided support services to one: Michigan – Palisades Nuclear Generating Station (closed in spring of 2022) Arkansas – Arkansas Nuclear One Units 1 and 2 Louisiana – River Bend Nuclear Generating Station and Waterford Nuclear Generating Station Mississippi – Grand Gulf Nuclear Generating Station Nebraska – support services for the Cooper Nuclear Station through 2014, terminated in 2022. The company's nuclear division is headquartered in Jackson, Mississippi. Entergy operates more than 40 plants using natural gas, nuclear, coal, oil and hydroelectric power with approximately 30,000 megawatts of electric generating capacity to serve its 2.9 million customers in the Gulf South. Its extensive transmission system carries approximately 30,000 megawatts of power across more than 15,700 miles (25,300 km) of interconnected lines within a 114,000-square-mile (300,000 km2) area. Entergy is the only US utility to make the Dow Jones Sustainability Index (DJSI) nine years in a row. The DJSI is a listing of the companies whose overall environmental, social and economic sustainability performance scores were in the top 10 percent for their sector. Entergy was named in 2008 to Forbes list of America's Most Trustworthy Companies, a ranking based on corporate governance practices and accounting transparency. On February 24, 2010, the Vermont Senate voted to prevent the Vermont Public Service Board from issuing the necessary certificate that would allow for the Vermont Yankee plant to have its license renewed for another 20 years. The vote will not affect current operation of the plant, and the issue could be revisited by the legislature in either a special session later in 2010 or in its next regular session in 2011. Entergy Texas Entergy Texas operates as a wholly owned subsidiary. This was done to prepare the Texas side for de-regulation under Texas law, but Entergy later notified the Public Utility Commission of Texas that it would not split off the Texas side as a de-regulated operation. Because of this, the Texas side remains connected to the Entergy network; until 2012, it was based on where the former Gulf States Utilities was in Beaumont. New Orleans gas plant astroturf scandal In May 2018, Entergy New Orleans was embroiled in a scandal surrounding its controversial proposal for a natural gas power plant in East New Orleans. An Entergy subcontractor used Crowds on Demand to artificially lobby council support for the gas plant, prompting accusals of astroturfing. The New Orleans City Council ended up fining Entergy New Orleans $5 million for this paid actors scandal."
}