{
  "ticker": "EVRG",
  "cik": "0001711269",
  "company_name": "Evergy",
  "corrected_name": "Evergy",
  "wiki_title_used": "Evergy",
  "exists": true,
  "raw_text": "Evergy, Inc. is an American investor-owned utility (IOU) with publicly traded stock with headquarters in Topeka, Kansas, and in Kansas City, Missouri. The company was formed from a merger of Westar Energy of Topeka and Great Plains Energy of Kansas City, parent company of Kansas City Power & Light. Evergy is the largest electric company in Kansas, serving more than 1.7 million residential, commercial and industrial customers in Kansas and Missouri. Its more than 40 power plants have generating capacity of 16,000 megawatt electricity in Kansas and Missouri. Service territory covers 28,130 square miles (72,900 km2) in east Kansas and west Missouri. It owns more than 10,100 miles (16,300 km) of transmission lines and about 52,000 miles (84,000 km) of distribution lines.\n\nHistory of Westar Energy\nWestern Resources was the product of a 1992 merger between the two major electric companies in eastern Kansas, Kansas Gas and Electric (KG&E) of Wichita and Kansas Power and Light (KPL) of Topeka.\nKG&E was founded in 1909 when the American Power and Light Company took over electric companies in Wichita, Pittsburg and Frontenac. Within a decade, it served over 48,000 people in 50 cities and towns. It also provided natural gas to several of the larger cities in its service territory.\nKPL was founded in 1924, and quickly expanded across northeastern Kansas.  In 1983, it merged with The Gas Service Company, a natural gas utility serving customers in Kansas, Missouri, Nebraska and Oklahoma.\nIn 1992, KPL merged with KG&E to become Western Resources, with KPL and KG&E as operating companies.  The merger created one of the largest utilities in the Midwest, serving 560,000 electric customers and 1.06 million natural gas customers in three states. In 1996, Western Resources sold its natural gas business to ONEOK as Kansas Gas Service; this company is now part of ONE Gas. In return, Western Resources acquired a 45 percent stake in ONEOK; it sold this stake in 2003.\nIn 2002, Western Resources officially changed its name to Westar Energy, and all of its subsidiaries began doing business under that name.\n\nHistory of Kansas City Power & Light\nKansas City Power and Light Company was an electric utility serving the Kansas City metropolitan area. It was a wholly owned subsidiary, and biggest component, of Great Plains Energy.\nIn November 1881, Joseph S. Chick obtained the exclusive rights to use the Thompson-Houston arc lighting system in the counties of Jackson, Missouri, and Wyandotte, Kansas, for $4,000. In December, the initial franchise to establish an electric works in the City of Kansas, Missouri, was granted to Lysander R. Moore and later assigned to Kawsmouth Electric Light Company. Construction was begun in February 1882 on a power plant on a tract of land at the southeast corner of 8th and Santa Fe Streets in the West Bottoms. Kawsmouth Electric Light Company built quickly and, on Saturday night, May 13, 1882, brought electric illumination to the first 13 customers on the west side of Main Street in the downtown district. In 1885, the company reincorporated as Kansas City Electric Light Company.\nWeeks spun off the Edison Electric Light & Power Company to meet residential demand.  An electric war ensued when in 1883 J. Ogden Armour, heir to the Armour Packing Company, purchased the company on May 14, 1900, to power the Metropolitan Street Railway Company and Kansas City Electric Light Company.  Under Armour, the company bought competitors and built a new power plant in 1903, providing steam heat to downtown businesses.  The company focused on the trolley company and in 1911 it went into receivership.  In October 1917, the company spun off the trolley business (which still controlled some power plants) and emerged from bankruptcy as Kansas City Light & Power Company with Edison Pioneer, Joseph F. Porter, as President. Porter found the weakened company's most urgent needs were for more energy and more efficient plants. Thus, the company began construction on the Northeast Power station, the company's first modern generating complex. \nIncreased construction costs forced the company to reincorporate again, in June 1919, as Kansas City Power and Light Company. After acquiring the Carroll County Electric Company on July 29, 1922, the reorganized company became Kansas City Power & Light Company, adopting the ampersand and corporate name that continues. Armour sold his interest in 1923. Continental Gas & Electric Corporation purchased the controlling interest in 1924 and was part of United Light and Power until United dissolved in 1950. \nUnder Porter's twenty-one year leadership, the company prospered. Capitalization rose from $7 million to $82.5 million (or $160 million to $1.89 billion in 2025, inflation adjusted). Assured of a strong financial base, Porter ordered construction of the 32-story Kansas City Power and Light Building, which was completed in 1931 and remained the company's headquarters until 1991. Today, the building remains a prominent feature of the downtown Kansas City skyline and namesake for the Kansas City Power & Light District. In 1938, Porter resigned his position as president, though he remained chairman of the board until his death in 1942. \nThe Hawthorn Station, situated on the Missouri River, was started in 1948, and the first of two units were completed in 1951. Two other units followed and were fully operational by 1956. Kansas City Power became independent in 1950.  It acquired Eastern Kansas Utilities in 1952. It was part of a consortium that built Wolf Creek Nuclear Generating Station in Burlington, Kansas.\nOn October 1, 2001, a holding company, Great Plains Energy Incorporated, was established in Kansas City, Missouri that owned electric utility Kansas City Power and Light Company and Strategic Energy, LLC, an energy management company.\nIt acquired Aquila, Inc. in July, 2008.\nIn 2014, it ranked number 855 on the Fortune 1000 list.\n\nMerger of KCP&L and Westar\nIn 2016, Great Plains Energy and Westar announced merger plans, but this proposed merger was rejected by Kansas Corporation Commission utility regulators as unfavorable to Kansas consumers. A new merger plan with Great Plains was announced in 2017. As of May 24, 2018, this merger has been approved by both the Missouri Public Service Commission and the Kansas Corporation Commission, with the combined company to be named Evergy. KCP&L and Westar became the two operating companies of Evergy.\nOn October 7, 2019, the Westar and KCP&L brands were retired and the company adopted the Evergy brand across its entire service territory.\nOn December 28, 2022, the company switched its stock exchange listing to the Nasdaq Global Select Market.\n\nGeneration portfolio\nWolf Creek Nuclear Generating Station – Burlington, Kansas\nLa Cygne Generating Station – La Cygne, Kansas\nLawrence Energy Center – Lawrence, Kansas\nAbilene Energy Center – Abilene, Kansas\nCentral Plains Wind Farm – Leoti, Kansas\nEmporia Energy Center – Emporia, Kansas\nFlat Ridge Wind Energy – Nashville, Kansas\nGordon Evans Energy Center – Colwich, Kansas\nHutchinson Energy Center – Hutchinson, Kansas\nHawthorn Generating Station - Kansas City, Mo\nIatan Generating Station - Weston, Missouri\nJeffrey Energy Center – St. Marys, Kansas\nMeridian Way Wind Farm – Concordia, Kansas\nMurray Gill Energy Center – Wichita, Kansas\nNeosho Energy Center (out of use since 2012) – Parsons, Kansas\nRolling Meadows Landfill Gas to Energy Plant – Topeka, Kansas\nSpring Creek Energy Center – Logan County, Oklahoma\nState Line Combined Cycle Plant – Joplin, Missouri\nTecumseh Energy Center – Tecumseh, Kansas\nWestern Plains Wind Farm – Ford County, Kansas\n\nControversies\nIn 1999, Western Resources restated its consolidated financial statements for 1999, 1998, and 1997 and for each of the periods of 2000, related to the Westinghouse Security Systems (WSS) acquisition.\nOn November 1, 2002, Westar Energy announced the restating of results for its first and second quarter, to account for additional impairment at its Protection One Inc. (POI) unit.\nOn January 14, 2003, Westar Energy Inc was charged for transactions involving power sales from one Cleco Corporation  affiliate to Westar and then back to another or the same Cleco affiliate, and paid $30,000,000 for the settlement.\nOn March 25, 2004, Westar Energy restated its 2003 annual financial results, after realizing that it might have understated its cash flow from operations for the year.\n\nAwards\nEvergy was named one of the \"Healthiest 100 Workplaces in America\" by Springbuk in 2019.\nIn May 2019, Forbes named Evergy as one of America's \"Best Top 500 Employers\".\n\nReferences\nExternal links\nOfficial website \nBusiness data for Evergy, Inc.:",
  "clean_text": "Evergy, Inc. is an American investor-owned utility (IOU) with publicly traded stock with headquarters in Topeka, Kansas, and in Kansas City, Missouri. The company was formed from a merger of Westar Energy of Topeka and Great Plains Energy of Kansas City, parent company of Kansas City Power & Light. Evergy is the largest electric company in Kansas, serving more than 1.7 million residential, commercial and industrial customers in Kansas and Missouri. Its more than 40 power plants have generating capacity of 16,000 megawatt electricity in Kansas and Missouri. Service territory covers 28,130 square miles (72,900 km2) in east Kansas and west Missouri. It owns more than 10,100 miles (16,300 km) of transmission lines and about 52,000 miles (84,000 km) of distribution lines. History of Westar Energy Western Resources was the product of a 1992 merger between the two major electric companies in eastern Kansas, Kansas Gas and Electric (KG&E) of Wichita and Kansas Power and Light (KPL) of Topeka. KG&E was founded in 1909 when the American Power and Light Company took over electric companies in Wichita, Pittsburg and Frontenac. Within a decade, it served over 48,000 people in 50 cities and towns. It also provided natural gas to several of the larger cities in its service territory. KPL was founded in 1924, and quickly expanded across northeastern Kansas. In 1983, it merged with The Gas Service Company, a natural gas utility serving customers in Kansas, Missouri, Nebraska and Oklahoma. In 1992, KPL merged with KG&E to become Western Resources, with KPL and KG&E as operating companies. The merger created one of the largest utilities in the Midwest, serving 560,000 electric customers and 1.06 million natural gas customers in three states. In 1996, Western Resources sold its natural gas business to ONEOK as Kansas Gas Service; this company is now part of ONE Gas. In return, Western Resources acquired a 45 percent stake in ONEOK; it sold this stake in 2003. In 2002, Western Resources officially changed its name to Westar Energy, and all of its subsidiaries began doing business under that name. History of Kansas City Power & Light Kansas City Power and Light Company was an electric utility serving the Kansas City metropolitan area. It was a wholly owned subsidiary, and biggest component, of Great Plains Energy. In November 1881, Joseph S. Chick obtained the exclusive rights to use the Thompson-Houston arc lighting system in the counties of Jackson, Missouri, and Wyandotte, Kansas, for $4,000. In December, the initial franchise to establish an electric works in the City of Kansas, Missouri, was granted to Lysander R. Moore and later assigned to Kawsmouth Electric Light Company. Construction was begun in February 1882 on a power plant on a tract of land at the southeast corner of 8th and Santa Fe Streets in the West Bottoms. Kawsmouth Electric Light Company built quickly and, on Saturday night, May 13, 1882, brought electric illumination to the first 13 customers on the west side of Main Street in the downtown district. In 1885, the company reincorporated as Kansas City Electric Light Company. Weeks spun off the Edison Electric Light & Power Company to meet residential demand. An electric war ensued when in 1883 J. Ogden Armour, heir to the Armour Packing Company, purchased the company on May 14, 1900, to power the Metropolitan Street Railway Company and Kansas City Electric Light Company. Under Armour, the company bought competitors and built a new power plant in 1903, providing steam heat to downtown businesses. The company focused on the trolley company and in 1911 it went into receivership. In October 1917, the company spun off the trolley business (which still controlled some power plants) and emerged from bankruptcy as Kansas City Light & Power Company with Edison Pioneer, Joseph F. Porter, as President. Porter found the weakened company's most urgent needs were for more energy and more efficient plants. Thus, the company began construction on the Northeast Power station, the company's first modern generating complex. Increased construction costs forced the company to reincorporate again, in June 1919, as Kansas City Power and Light Company. After acquiring the Carroll County Electric Company on July 29, 1922, the reorganized company became Kansas City Power & Light Company, adopting the ampersand and corporate name that continues. Armour sold his interest in 1923. Continental Gas & Electric Corporation purchased the controlling interest in 1924 and was part of United Light and Power until United dissolved in 1950. Under Porter's twenty-one year leadership, the company prospered. Capitalization rose from $7 million to $82.5 million (or $160 million to $1.89 billion in 2025, inflation adjusted). Assured of a strong financial base, Porter ordered construction of the 32-story Kansas City Power and Light Building, which was completed in 1931 and remained the company's headquarters until 1991. Today, the building remains a prominent feature of the downtown Kansas City skyline and namesake for the Kansas City Power & Light District. In 1938, Porter resigned his position as president, though he remained chairman of the board until his death in 1942. The Hawthorn Station, situated on the Missouri River, was started in 1948, and the first of two units were completed in 1951. Two other units followed and were fully operational by 1956. Kansas City Power became independent in 1950. It acquired Eastern Kansas Utilities in 1952. It was part of a consortium that built Wolf Creek Nuclear Generating Station in Burlington, Kansas. On October 1, 2001, a holding company, Great Plains Energy Incorporated, was established in Kansas City, Missouri that owned electric utility Kansas City Power and Light Company and Strategic Energy, LLC, an energy management company. It acquired Aquila, Inc. in July, 2008. In 2014, it ranked number 855 on the Fortune 1000 list. Merger of KCP&L and Westar In 2016, Great Plains Energy and Westar announced merger plans, but this proposed merger was rejected by Kansas Corporation Commission utility regulators as unfavorable to Kansas consumers. A new merger plan with Great Plains was announced in 2017. As of May 24, 2018, this merger has been approved by both the Missouri Public Service Commission and the Kansas Corporation Commission, with the combined company to be named Evergy. KCP&L and Westar became the two operating companies of Evergy. On October 7, 2019, the Westar and KCP&L brands were retired and the company adopted the Evergy brand across its entire service territory. On December 28, 2022, the company switched its stock exchange listing to the Nasdaq Global Select Market. Generation portfolio Wolf Creek Nuclear Generating Station – Burlington, Kansas La Cygne Generating Station – La Cygne, Kansas Lawrence Energy Center – Lawrence, Kansas Abilene Energy Center – Abilene, Kansas Central Plains Wind Farm – Leoti, Kansas Emporia Energy Center – Emporia, Kansas Flat Ridge Wind Energy – Nashville, Kansas Gordon Evans Energy Center – Colwich, Kansas Hutchinson Energy Center – Hutchinson, Kansas Hawthorn Generating Station - Kansas City, Mo Iatan Generating Station - Weston, Missouri Jeffrey Energy Center – St. Marys, Kansas Meridian Way Wind Farm – Concordia, Kansas Murray Gill Energy Center – Wichita, Kansas Neosho Energy Center (out of use since 2012) – Parsons, Kansas Rolling Meadows Landfill Gas to Energy Plant – Topeka, Kansas Spring Creek Energy Center – Logan County, Oklahoma State Line Combined Cycle Plant – Joplin, Missouri Tecumseh Energy Center – Tecumseh, Kansas Western Plains Wind Farm – Ford County, Kansas Controversies In 1999, Western Resources restated its consolidated financial statements for 1999, 1998, and 1997 and for each of the periods of 2000, related to the Westinghouse Security Systems (WSS) acquisition. On November 1, 2002, Westar Energy announced the restating of results for its first and second quarter, to account for additional impairment at its Protection One Inc. (POI) unit. On January 14, 2003, Westar Energy Inc was charged for transactions involving power sales from one Cleco Corporation affiliate to Westar and then back to another or the same Cleco affiliate, and paid $30,000,000 for the settlement. On March 25, 2004, Westar Energy restated its 2003 annual financial results, after realizing that it might have understated its cash flow from operations for the year. Awards Evergy was named one of the \"Healthiest 100 Workplaces in America\" by Springbuk in 2019. In May 2019, Forbes named Evergy as one of America's \"Best Top 500 Employers\"."
}