{
  "ticker": "EW",
  "cik": "0001099800",
  "company_name": "Edwards Lifesciences",
  "corrected_name": "Edwards Lifesciences",
  "wiki_title_used": "Edwards Lifesciences",
  "exists": true,
  "raw_text": "Edwards Lifesciences Corporation is an American medical technology company headquartered in Irvine, California, specializing in artificial heart valves and hemodynamic monitoring. It developed the Sapien transcatheter aortic heart valve made of cow tissue within a balloon-expandable, cobalt-chromium frame, deployed via catheter. The company has manufacturing facilities at the Irvine headquarters, as well as in Draper, Utah; Costa Rica; the Dominican Republic; Puerto Rico; and Singapore; and is building a new facility completed in 2021 in Limerick, Ireland.\n\nHistory\nThe Edwards Lifesciences Foundation was originally founded by electrical engineer Miles \"Lowell\" Edwards in 1958, a graduate of Oregon State University. Edwards invented the first medically proven and adopted artificial heart valve. Dr. Albert Starr, a surgeon at the Oregon Health and Sciences University, is credited as the first to successfully implant the Starr-Edwards mitral valve in a patient in 1960. As a result of the successful heart implant, Edwards established his foundation in Santa Ana, California the same year to continue his research in pulmonary devices.\nEdward's valves are still in operation today. An early patient lived a record 48 years with the implant before requiring a replacement.\nEdwards was acquired by Baxter in 1985. It was spun off from Baxter in 2000.\nIn 2017, Edwards completed the acquisition of Valtech Cardio for $340 million. Also in 2017, Edwards acquired Harpoon Medical of Baltimore, Maryland for $100 million. Harpoon, founded in 2013, developed a minimally invasive heart surgery product for mitral valve repair to treat degenerative mitral regurgitation. At the time of the acquisition, the product was not available on any market.\nOn April 18, 2019, Edwards completed the acquisition of CAS Medical Systems of Branford, Connecticut for ~$100 million.\nEdwards Sapien 3 and Sapien 3 Ultra Transcatheter Heart Valve systems were FDA-approved for the treatment of patients at low risk for death or major complications associated with open-heart surgery on August 16, 2019. These products are used to treat patients with severe aortic stenosis without utilizing open-heart surgery.\nIn 2020, Edwards co-sponsored the Virtual ISPOR-FDA Summit centred on patient preference information in medical device regulatory decisions.\nIn 2024, Edwards made agreements with Affluent Medical for an equity stake, IP licensing and an exclusive option to acquire its Kephalios subsidiary. The same month, Edwards announced it would acquire Innovalve Bio Medical for approximately $300 million, and JenaValve Technology and Endotronix for $1.2 billion.\n\nBusiness segments\nIts products are categorized into four areas: surgical valve technologies, transcatheter heart valves, transcatheter mitral and tricuspid therapies, and critical care.\n\nTranscatheter Heart Valve\nEdwards introduced the transcatheter heart valve replacement procedure to U.S. patients unable to undergo open-heart surgery with FDA approval of the Sapien transcatheter valve in 2011. The indication was expanded in November 2012 to include patients at a high risk for death or serious complications associated with open-heart surgery.\n\nTranscatheter Mitral and Tricuspid Therapies\nThe Transcatheter Mitral and Tricuspid Therapies business segment involves the research and development of transcatheter heart valve repair and replacement technologies designed to treat mitral and tricuspid valve diseases. Many of these technologies are in early development and clinical phases, with seven programs and four clinical trials.\n\nCritical Care\nThe Critical Care business segment includes pulmonary artery catheters, disposable pressure transducers and advanced hemodynamic monitoring systems. The portfolio also includes a line of balloon catheter-based vascular products, surgical clips and inserts. In 2023, it was announced that the critical care business unit was to be spun off into its own entity, however in 2024 the critical care department was purchased by BD for $4.2 billion.\n\nOrganizational culture\nEdwards Lifesciences Foundation\nThe Edwards Lifesciences Foundation launched in 2014 and supports programs designed to treat underserved people to reduce heart valve disease.\nThe “Every Heartbeat Matters” (EHM) initiative has educated, screened and treated 1.7 million underserved people, exceeding its goal of serving 1 million underserved patients.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Edwards Lifesciences Corporation:",
  "clean_text": "Edwards Lifesciences Corporation is an American medical technology company headquartered in Irvine, California, specializing in artificial heart valves and hemodynamic monitoring. It developed the Sapien transcatheter aortic heart valve made of cow tissue within a balloon-expandable, cobalt-chromium frame, deployed via catheter. The company has manufacturing facilities at the Irvine headquarters, as well as in Draper, Utah; Costa Rica; the Dominican Republic; Puerto Rico; and Singapore; and is building a new facility completed in 2021 in Limerick, Ireland. History The Edwards Lifesciences Foundation was originally founded by electrical engineer Miles \"Lowell\" Edwards in 1958, a graduate of Oregon State University. Edwards invented the first medically proven and adopted artificial heart valve. Dr. Albert Starr, a surgeon at the Oregon Health and Sciences University, is credited as the first to successfully implant the Starr-Edwards mitral valve in a patient in 1960. As a result of the successful heart implant, Edwards established his foundation in Santa Ana, California the same year to continue his research in pulmonary devices. Edward's valves are still in operation today. An early patient lived a record 48 years with the implant before requiring a replacement. Edwards was acquired by Baxter in 1985. It was spun off from Baxter in 2000. In 2017, Edwards completed the acquisition of Valtech Cardio for $340 million. Also in 2017, Edwards acquired Harpoon Medical of Baltimore, Maryland for $100 million. Harpoon, founded in 2013, developed a minimally invasive heart surgery product for mitral valve repair to treat degenerative mitral regurgitation. At the time of the acquisition, the product was not available on any market. On April 18, 2019, Edwards completed the acquisition of CAS Medical Systems of Branford, Connecticut for ~$100 million. Edwards Sapien 3 and Sapien 3 Ultra Transcatheter Heart Valve systems were FDA-approved for the treatment of patients at low risk for death or major complications associated with open-heart surgery on August 16, 2019. These products are used to treat patients with severe aortic stenosis without utilizing open-heart surgery. In 2020, Edwards co-sponsored the Virtual ISPOR-FDA Summit centred on patient preference information in medical device regulatory decisions. In 2024, Edwards made agreements with Affluent Medical for an equity stake, IP licensing and an exclusive option to acquire its Kephalios subsidiary. The same month, Edwards announced it would acquire Innovalve Bio Medical for approximately $300 million, and JenaValve Technology and Endotronix for $1.2 billion. Business segments Its products are categorized into four areas: surgical valve technologies, transcatheter heart valves, transcatheter mitral and tricuspid therapies, and critical care. Transcatheter Heart Valve Edwards introduced the transcatheter heart valve replacement procedure to U.S. patients unable to undergo open-heart surgery with FDA approval of the Sapien transcatheter valve in 2011. The indication was expanded in November 2012 to include patients at a high risk for death or serious complications associated with open-heart surgery. Transcatheter Mitral and Tricuspid Therapies The Transcatheter Mitral and Tricuspid Therapies business segment involves the research and development of transcatheter heart valve repair and replacement technologies designed to treat mitral and tricuspid valve diseases. Many of these technologies are in early development and clinical phases, with seven programs and four clinical trials. Critical Care The Critical Care business segment includes pulmonary artery catheters, disposable pressure transducers and advanced hemodynamic monitoring systems. The portfolio also includes a line of balloon catheter-based vascular products, surgical clips and inserts. In 2023, it was announced that the critical care business unit was to be spun off into its own entity, however in 2024 the critical care department was purchased by BD for $4.2 billion. Organizational culture Edwards Lifesciences Foundation The Edwards Lifesciences Foundation launched in 2014 and supports programs designed to treat underserved people to reduce heart valve disease. The “Every Heartbeat Matters” (EHM) initiative has educated, screened and treated 1.7 million underserved people, exceeding its goal of serving 1 million underserved patients."
}