{
  "ticker": "EXC",
  "cik": "0001109357",
  "company_name": "Exelon",
  "corrected_name": "Exelon",
  "wiki_title_used": "Exelon",
  "exists": true,
  "raw_text": "Exelon Corporation is an American public utility headquartered in Chicago, and incorporated in Pennsylvania. Exelon is the largest electric parent company in the United States by revenue and is the largest regulated electric utility in the United States with approximately 10 million customers. The company is ranked 187th on the Fortune 500.\nExelon owns six regulated utilities: Atlantic City Electric (New Jersey), Commonwealth Edison (Illinois), PECO Energy Company (Pennsylvania), Baltimore Gas and Electric (Maryland), Delmarva Power and Light (Delaware and Maryland), and Pepco (Washington, DC and Maryland).\n\nOperating subsidiaries\nAtlantic City Electric is a regulated utility in New Jersey with 545,000 electric customers.\nBaltimore Gas and Electric (BGE) is a regulated utility in Maryland with 1.25 million+ electric customers and 650,000+ natural gas customers.\nCommonwealth Edison (ComEd) is a regulated utility in Illinois with 4 million electric customers.\nDelmarva Power is a regulated utility in Delaware and the Eastern Shore of Maryland with 515,000 electric customers over 5,000 square miles of service territory. They provide natural gas to 130,000 customers in northern Delaware.\nPECO Energy Company (PECO) is regulated utility in eastern Pennsylvania with 1.6 million electric customers and more than 500,000 natural gas customers.\nPepco (Potomac Electric Power Company) is a regulated utility in Washington, D.C. that serves 842,000 electric customers in the district and parts of Maryland.\n\nHistory\nExelon Corporation was created in October 2000 by the merger between PECO Energy Company, formed in 1902, and Unicom Corporation, the parent of Commonwealth Edison, formed in 1907. Unicom was based in Chicago and the city became the headquarters of the new entity. The merger was overseen by the CEO of Unicom, John Rowe, who joined the corporation in 1998 and led the newly formed Exelon until 2012, becoming the nation's longest-serving utility executive.\nOn July 31, 2005, the Federal Energy Regulatory Commission approved the merger of Exelon and Public Service Enterprise Group, a New Jersey utility; however, after 18 months, the two companies terminated the agreement due to pressure put on the New Jersey Board of Public Utilities by public interest groups, including New Jersey Citizen Action.\nOn March 12, 2012, Exelon acquired Constellation Energy, with the combined company owning more than 34 gigawatts of power generation (55% nuclear, 24% natural gas, 8% renewable including hydro, 7% oil and 6% coal).\nExelon announced the proposed purchase of Pepco Holdings on April 30, 2014, for $6.8 billion in an all-cash transaction. The merger faced stiff opposition from community groups and D.C. Mayor Muriel Bowser. The merger was originally rejected by the District of Columbia Public Service Commission in August 2015, though it was approved by other federal and state regulators. The companies appealed the decision. On March 23, 2016, the merger was finally approved by the District of Columbia Public Service Commission after the company made concessions and the merger was completed, making Exelon the largest regulated utility in the United States by customer count and total revenue.\nOn February 2, 2022, Exelon completed the corporate spin-off of Constellation Energy, its energy generation business. Constellation was the largest operator of nuclear power plants in the United States and the largest non-governmental operator of nuclear power plants in the world. It is also the largest competitive U.S. power generator with approximately 35,500 megawatts of owned capacity. It had full or majority ownership of 23 nuclear reactors in 14 nuclear power plants.\n\nControversies and legal issues\nPECO Energy: Nuclear power protests and solar energy expansion\nIn the 1970s, activists delayed the opening of nuclear power plants by PECO Energy.\nIn 2015, Earth Quaker Action Team began a campaign to pressure PECO to expand the solar power it purchases, and to purchase it locally to create jobs.\n\nPollution, security incidents\nIn 2005, Exelon was required to pay a $602,000 fine for exceeding the permitted sulfur dioxide emission limit from April to October 2004 at its Cromby Generating Station in Chester County, Pennsylvania.\nExelon and Illinois state officials waited for four years until 2006 before disclosing that Exelon's Braidwood Nuclear Generating Station, a nuclear plant 60 miles southwest of Chicago, had spilled millions of gallons of water containing tritium, a radioactive form of hydrogen, multiple times over a decade.  Exelon officials eventually apologized and said the risks from the leak were \"minimal\", with tritium levels in surrounding wells all found to be below regulatory limits.\nIn 2009, the Nuclear Regulatory Commission announced its plan for a $65,000 fine against Exelon for permitting its contracted security guards that were guarding its Peach Bottom Nuclear Generating Station, a two-reactor nuclear plant located in Delta, Pennsylvania, to sleep on the job. The incidents did not come to light until a videotape of the security guards was leaked to news media. As a result, Exelon terminated the security contract of the Wackenhut security firm that had been involved and now operates its own in-house nuclear security force.\n\nPolitical activity\nExelon makes political contributions via its political action committee (PAC), EXELONPAC. In 2021 and 2022, it contributed $323,500 to federal candidates, including $202,500 to Democrats and $121,000 to Republicans. In 2022, it spent $2,878,000 on lobbying.\n\nFinances\nReferences\nExternal links\n\nOfficial website \nBGE website\nComEd website\nPECO website\nBusiness data for Exelon Corporation:",
  "clean_text": "Exelon Corporation is an American public utility headquartered in Chicago, and incorporated in Pennsylvania. Exelon is the largest electric parent company in the United States by revenue and is the largest regulated electric utility in the United States with approximately 10 million customers. The company is ranked 187th on the Fortune 500. Exelon owns six regulated utilities: Atlantic City Electric (New Jersey), Commonwealth Edison (Illinois), PECO Energy Company (Pennsylvania), Baltimore Gas and Electric (Maryland), Delmarva Power and Light (Delaware and Maryland), and Pepco (Washington, DC and Maryland). Operating subsidiaries Atlantic City Electric is a regulated utility in New Jersey with 545,000 electric customers. Baltimore Gas and Electric (BGE) is a regulated utility in Maryland with 1.25 million+ electric customers and 650,000+ natural gas customers. Commonwealth Edison (ComEd) is a regulated utility in Illinois with 4 million electric customers. Delmarva Power is a regulated utility in Delaware and the Eastern Shore of Maryland with 515,000 electric customers over 5,000 square miles of service territory. They provide natural gas to 130,000 customers in northern Delaware. PECO Energy Company (PECO) is regulated utility in eastern Pennsylvania with 1.6 million electric customers and more than 500,000 natural gas customers. Pepco (Potomac Electric Power Company) is a regulated utility in Washington, D.C. that serves 842,000 electric customers in the district and parts of Maryland. History Exelon Corporation was created in October 2000 by the merger between PECO Energy Company, formed in 1902, and Unicom Corporation, the parent of Commonwealth Edison, formed in 1907. Unicom was based in Chicago and the city became the headquarters of the new entity. The merger was overseen by the CEO of Unicom, John Rowe, who joined the corporation in 1998 and led the newly formed Exelon until 2012, becoming the nation's longest-serving utility executive. On July 31, 2005, the Federal Energy Regulatory Commission approved the merger of Exelon and Public Service Enterprise Group, a New Jersey utility; however, after 18 months, the two companies terminated the agreement due to pressure put on the New Jersey Board of Public Utilities by public interest groups, including New Jersey Citizen Action. On March 12, 2012, Exelon acquired Constellation Energy, with the combined company owning more than 34 gigawatts of power generation (55% nuclear, 24% natural gas, 8% renewable including hydro, 7% oil and 6% coal). Exelon announced the proposed purchase of Pepco Holdings on April 30, 2014, for $6.8 billion in an all-cash transaction. The merger faced stiff opposition from community groups and D.C. Mayor Muriel Bowser. The merger was originally rejected by the District of Columbia Public Service Commission in August 2015, though it was approved by other federal and state regulators. The companies appealed the decision. On March 23, 2016, the merger was finally approved by the District of Columbia Public Service Commission after the company made concessions and the merger was completed, making Exelon the largest regulated utility in the United States by customer count and total revenue. On February 2, 2022, Exelon completed the corporate spin-off of Constellation Energy, its energy generation business. Constellation was the largest operator of nuclear power plants in the United States and the largest non-governmental operator of nuclear power plants in the world. It is also the largest competitive U.S. power generator with approximately 35,500 megawatts of owned capacity. It had full or majority ownership of 23 nuclear reactors in 14 nuclear power plants. Controversies and legal issues PECO Energy: Nuclear power protests and solar energy expansion In the 1970s, activists delayed the opening of nuclear power plants by PECO Energy. In 2015, Earth Quaker Action Team began a campaign to pressure PECO to expand the solar power it purchases, and to purchase it locally to create jobs. Pollution, security incidents In 2005, Exelon was required to pay a $602,000 fine for exceeding the permitted sulfur dioxide emission limit from April to October 2004 at its Cromby Generating Station in Chester County, Pennsylvania. Exelon and Illinois state officials waited for four years until 2006 before disclosing that Exelon's Braidwood Nuclear Generating Station, a nuclear plant 60 miles southwest of Chicago, had spilled millions of gallons of water containing tritium, a radioactive form of hydrogen, multiple times over a decade. Exelon officials eventually apologized and said the risks from the leak were \"minimal\", with tritium levels in surrounding wells all found to be below regulatory limits. In 2009, the Nuclear Regulatory Commission announced its plan for a $65,000 fine against Exelon for permitting its contracted security guards that were guarding its Peach Bottom Nuclear Generating Station, a two-reactor nuclear plant located in Delta, Pennsylvania, to sleep on the job. The incidents did not come to light until a videotape of the security guards was leaked to news media. As a result, Exelon terminated the security contract of the Wackenhut security firm that had been involved and now operates its own in-house nuclear security force. Political activity Exelon makes political contributions via its political action committee (PAC), EXELONPAC. In 2021 and 2022, it contributed $323,500 to federal candidates, including $202,500 to Democrats and $121,000 to Republicans. In 2022, it spent $2,878,000 on lobbying. Finances"
}