{
  "ticker": "EXE",
  "cik": "0000895126",
  "company_name": "Expand Energy",
  "corrected_name": "Expand Energy",
  "wiki_title_used": "Expand Energy",
  "exists": true,
  "raw_text": "Expand Energy Corporation, headquartered in Oklahoma City, is the largest independent natural gas producer in the U.S. based on net daily production. The company operates in the Appalachian Basin of the Marcellus Formation in Pennsylvania and West Virginia, as well as the Haynesville Shale in Northwestern Louisiana.\nIn 2024, the company produced 3,758 MMcfe of natural gas per day. In 2024, 41% of production was from the Haynesville Shale, 48% of production was from Northeast Appalachia, and 11% of production was from Southwest Appalachia.\nAs of December 31, 2024, the company had 20,800 Bcf of proved reserves. It also had interests in 8,000 gross productive wells.\n\nHistory\nThe company was founded in 1989 as Chesapeake Energy by Aubrey McClendon and Tom L. Ward with an initial investment of $50,000. McClendon named the company after Chesapeake Bay due to his love of the region. Ward left the company in 2006 to establish SandRidge Energy.\nIn 1993, the company became a public company via an initial public offering, with a valuation of $25 million.\nFocusing on a strategy of drilling horizontal natural gas wells in unconventional reservoirs, the company built a sizable position in the Golden Trend and Sholem Alechem fields of South-central Oklahoma and in the Giddings field of Southeast Texas.\nIn the mid-1990s, the company unsuccessfully attempted to extend the Austin Chalk play into western and central Louisiana.\nIn 1997, the company wrote down the value of its assets by over $200 million, approximately equal to shareholder's equity at the time, due to low commodity prices and implemented a turnaround plan.\nIn the early 2000s, after a rise in natural gas prices made it economically feasible, the company focused on unconventional drilling in carbonates, tight sandstone, and shale particularly in the Barnett Shale, Fayetteville Shale, and the Marcellus Formation.\nIn 2008, the company announced its discovery of the Haynesville Shale in East Texas and northwestern Louisiana.\nIn 2009, the company partnered with Orange County Choppers to create the first chopper powered by compressed natural gas.\nIn 2011, the company agreed to a 12-year naming rights partnership with the Oklahoma City Thunder for naming and branding rights of the Paycom Center at a cost of $3 million per year, with annual increases of 3%. On April 20, 2021, the agreement was terminated.\nIn June 2012, in response to shareholder concerns about corporate governance issues under McClendon's watch, the company appointed Archie W. Dunham as chairman, while Aubrey McClendon remained CEO.\nIn December 2012, the company sold midstream assets for $2.16 billion.\nEffective April 1, 2013, Aubrey McClendon was forced to leave the company after revelations that he took a personal stake in wells owned by the company and then used those investments as collateral for up to $1.1 billion in loans from banks that also financed the company, prompting an investigation by the U.S. Securities and Exchange Commission. He was also accused of several conflicts of interest.\nIn May 2013, Robert Douglas Lawler, an executive of Anadarko Petroleum, was named CEO of the company.\nIn 2013, the company sold 55,000 net acres in the Northern Eagle Ford Shale and 9,600 net acres in the Haynesville Shale to EXCO for aggregate proceeds of $1 billion.\nIn December 2014, the company sold a large portion of its oil and gas assets in the Marcellus Formation and Utica Shale to Southwestern Energy for net proceeds of $4.975 billion. The transaction included approximately 413,000 net acres and 1,500 wells in northern West Virginia and southern Pennsylvania. Net production of the sold assets was 57,000 barrels of oil equivalent per day in December 2014.\nIn 2014, the company also sold additional midstream assets for $520 million.\nIn September 2015, the company announced layoffs of hundreds of people in Oklahoma City.\nIn 2017, the company sold assets in the Haynesville shale for $465 million.\nIn January 2018, the company laid off 400 employees.\nIn the first quarter of 2018, the company sold assets in Oklahoma for $500 million.\nIn February 2019, the company acquired Texas oil producer WildHorse Resource Development for $4 billion in cash and stock.\nIn June 2020, the company filed for bankruptcy protection with $7 billion in debt. It emerged from bankruptcy protection in February 2021.\nIn April 2021, Doug Lawler resigned as CEO of the company and Mike Wichterich, Chair of the Board of Directors, was named interim-CEO.\nIn November 2021, the company acquired Vine Energy, which operated in the Haynesville Shale.\nIn March 2022, the company acquired Chief Oil & Gas for approximately $2.6 billion. The company also sold its assets in the Powder River Basin to Continental Resources for $450 million.\nIn 2023, in three transactions, the company sold all of its assets in the Eagle Ford shale to Ineos, WildFire Energy (a subsidiary of Warburg Pincus and Kayne Anderson), and SilverBow Resources for a total of $3.5 billion.\nIn October 2024, the company acquired Southwestern Energy in a $7.4 billion all-stock deal and was rebranded as Expand Energy.\n\nControversies\nAntitrust allegations\nAlleged collusion with Encana to lower land price\nIn mid-2012, the U.S. Department of Justice (DOJ) began an investigation into whether Encana, Canada's largest natural gas company, \"illegally colluded with Chesapeake Energy Corp to lower the price of Michigan exploration lands during a public land auction in May 2010.\" The antitrust probe ended in 2014 with a letter to Chesapeake by the U.S. Department of Justice. Internal investigations by the companies found no evidence of collusion.\n\nCancellation of leases\nOn June 5, 2014, the state of Michigan filed felony fraud and racketeering charges against the company, alleging that the company canceled hundreds of land leases on false pretenses after it sought to obtain oil and gas rights. Michigan attorney general Bill Schuette claimed that the company \"obtained uncompensated land options from these landowners by false pretenses, and prevented competitors from leasing the land.\" Chesapeake Energy disputed all charges. In 2015, the company settled the lawsuits by agreeing to pay $25 million to the landowners.\n\nUnderpayment of royalties to landowners\nThe company has faced thousands of lawsuits regarding the alleged under-payment of royalties due to individuals that leased land to the company. In 2013, the company agreed to pay $7.5 million to settle a class action lawsuit by Pennsylvania landowners. In 2017, the company agreed to pay another $30 million to Pennsylvania landowners.\n\nAlleged collusion in land auctions\nOn March 1, 2016, a DOJ federal grand jury indicted Aubrey McClendon for allegedly rigging the bidding process for land leases between December 2007 and March 2012. McClendon was charged of orchestrating a conspiracy in which two oil and gas companies, not named in the indictment, colluded not to bid against each other for the purchase of land in northwestern Oklahoma. According to the indictment, the companies decided ahead of time who would win bids, with the winner then allocating an interest in the leases to the other company, eliminating open competitive bidding. The DOJ said this was the first case resulting from a continuing federal antitrust investigation into price fixing, bid rigging, and other anti-competitive conduct in the petroleum industry.\nThe next day, on March 2, 2016, McClendon died in a single-occupant single-vehicle crash when he drove his vehicle directly into a concrete bridge embankment in Oklahoma City. The charges were dropped by the DOJ as a result of the death.\n\nAlleged price-fixing\nIn January 2024, a class action lawsuit was filed accusing the company, along with seven other US oil and gas producers, of engaging in an anti-competitive business practice in the form of an illegal price fixing scheme to constrain production of shale oil, allegedly leading to drivers in the US paying more for gasoline than they would have in a competitive market.\n\nLobbying\nIn 2004, then CEO Aubrey McClendon contributed $450,000 to the campaign of Tom Corbett for attorney general of Pennsylvania. These funds were cited as the reason Corbett won the election, with a narrow margin. When Corbett eventually became governor of Pennsylvania, he was very supportive of the company's fracking activity in Pennsylvania, and Pennsylvania was the only state without a severance tax on drillers, despite the fact that the budget for education was being reduced.\nIn 2008, then CEO Aubrey McClendon formed American Clean Skies Foundation, a non-profit foundation focused on selling the virtues of natural gas. The foundation was funded by the company and by McClendon. The foundation was criticized for doing nothing but pushing Congress to pass policies that benefited the company and McClendon's business interests.\n\nEnvironmental damage\nDischarges of fill material\nIn 2013, the Environmental Protection Agency fined a subsidiary of the company $3.2 million, and ordered it to pay an estimated $6.5 million for the restoration of sites that were damaged by the company from unauthorized discharge of material.\n\n2011 well blowout\nOn April 19, 2011, due to a failed seal assembly in a wellhead, the company lost control of a natural gas well in Bradford County, Pennsylvania that was being fracture stimulated, causing a large spill of salt water and chemicals, such as 2-butoxyethanol and methanol, into the surrounding countryside. By April 22, 2011, the leak had been stemmed. Maryland announced its intention to sue the company for violation of the Resource Conservation and Recovery Act and the Clean Water Act since fracking fluids from the well blowout wound up in the Chesapeake Bay.\n\n2015 landslide\nIn November 2015, the company was fined $1.4 million in Pennsylvania for a landslide caused by the company in 2011 that resulted in clogged waterways.\n\nEarthquakes Oklahoma and Kansas correlated with hydraulic fracturing\nIn 2007, Oklahoma recorded a single earthquake. By 2015, after the rise in hydraulic fracturing, there were more than 900. After the 2011 Oklahoma earthquake in Prague, Oklahoma, having suffered home damage and physical injury, a resident sued the company. The Sierra Club also filed a lawsuit against the company and Devon Energy over damages suffered in a magnitude 5.8, 2016 Oklahoma earthquake near Pawnee, which was tied for the largest such shock in the eastern United States in 70 years. A judge dismissed the lawsuit in April 2017.\n\nAwards and recognition\nIn 2007, the company was named the best managed oil-and-gas company by Forbes.\nIn 2009, S&P Global Platts named the company as the Energy Producer of the Year and it received the Industry Leadership Award. The company was also a finalist in the Deal of the Year, CEO of the Year, and Community Development Program of the Year categories. In 2012, the company received an Award of Excellence.\nIn 2010, Shaleplay, the company's corporate band, won first place in the Fortune Battle of the Corporate Bands.\nIn 2014, the company was ranked 51st on the 100 Best Companies to Work by Fortune.\nIn 2021, the company achieved Grade \"A\" MiQ and EO100 Certification for its legacy Haynesville Shale operations.\n\nSee also\nThe Power of Big Oil\n\nReferences\nExternal links\nOfficial website\nBusiness data for Expand Energy Corporation:",
  "clean_text": "Expand Energy Corporation, headquartered in Oklahoma City, is the largest independent natural gas producer in the U.S. based on net daily production. The company operates in the Appalachian Basin of the Marcellus Formation in Pennsylvania and West Virginia, as well as the Haynesville Shale in Northwestern Louisiana. In 2024, the company produced 3,758 MMcfe of natural gas per day. In 2024, 41% of production was from the Haynesville Shale, 48% of production was from Northeast Appalachia, and 11% of production was from Southwest Appalachia. As of December 31, 2024, the company had 20,800 Bcf of proved reserves. It also had interests in 8,000 gross productive wells. History The company was founded in 1989 as Chesapeake Energy by Aubrey McClendon and Tom L. Ward with an initial investment of $50,000. McClendon named the company after Chesapeake Bay due to his love of the region. Ward left the company in 2006 to establish SandRidge Energy. In 1993, the company became a public company via an initial public offering, with a valuation of $25 million. Focusing on a strategy of drilling horizontal natural gas wells in unconventional reservoirs, the company built a sizable position in the Golden Trend and Sholem Alechem fields of South-central Oklahoma and in the Giddings field of Southeast Texas. In the mid-1990s, the company unsuccessfully attempted to extend the Austin Chalk play into western and central Louisiana. In 1997, the company wrote down the value of its assets by over $200 million, approximately equal to shareholder's equity at the time, due to low commodity prices and implemented a turnaround plan. In the early 2000s, after a rise in natural gas prices made it economically feasible, the company focused on unconventional drilling in carbonates, tight sandstone, and shale particularly in the Barnett Shale, Fayetteville Shale, and the Marcellus Formation. In 2008, the company announced its discovery of the Haynesville Shale in East Texas and northwestern Louisiana. In 2009, the company partnered with Orange County Choppers to create the first chopper powered by compressed natural gas. In 2011, the company agreed to a 12-year naming rights partnership with the Oklahoma City Thunder for naming and branding rights of the Paycom Center at a cost of $3 million per year, with annual increases of 3%. On April 20, 2021, the agreement was terminated. In June 2012, in response to shareholder concerns about corporate governance issues under McClendon's watch, the company appointed Archie W. Dunham as chairman, while Aubrey McClendon remained CEO. In December 2012, the company sold midstream assets for $2.16 billion. Effective April 1, 2013, Aubrey McClendon was forced to leave the company after revelations that he took a personal stake in wells owned by the company and then used those investments as collateral for up to $1.1 billion in loans from banks that also financed the company, prompting an investigation by the U.S. Securities and Exchange Commission. He was also accused of several conflicts of interest. In May 2013, Robert Douglas Lawler, an executive of Anadarko Petroleum, was named CEO of the company. In 2013, the company sold 55,000 net acres in the Northern Eagle Ford Shale and 9,600 net acres in the Haynesville Shale to EXCO for aggregate proceeds of $1 billion. In December 2014, the company sold a large portion of its oil and gas assets in the Marcellus Formation and Utica Shale to Southwestern Energy for net proceeds of $4.975 billion. The transaction included approximately 413,000 net acres and 1,500 wells in northern West Virginia and southern Pennsylvania. Net production of the sold assets was 57,000 barrels of oil equivalent per day in December 2014. In 2014, the company also sold additional midstream assets for $520 million. In September 2015, the company announced layoffs of hundreds of people in Oklahoma City. In 2017, the company sold assets in the Haynesville shale for $465 million. In January 2018, the company laid off 400 employees. In the first quarter of 2018, the company sold assets in Oklahoma for $500 million. In February 2019, the company acquired Texas oil producer WildHorse Resource Development for $4 billion in cash and stock. In June 2020, the company filed for bankruptcy protection with $7 billion in debt. It emerged from bankruptcy protection in February 2021. In April 2021, Doug Lawler resigned as CEO of the company and Mike Wichterich, Chair of the Board of Directors, was named interim-CEO. In November 2021, the company acquired Vine Energy, which operated in the Haynesville Shale. In March 2022, the company acquired Chief Oil & Gas for approximately $2.6 billion. The company also sold its assets in the Powder River Basin to Continental Resources for $450 million. In 2023, in three transactions, the company sold all of its assets in the Eagle Ford shale to Ineos, WildFire Energy (a subsidiary of Warburg Pincus and Kayne Anderson), and SilverBow Resources for a total of $3.5 billion. In October 2024, the company acquired Southwestern Energy in a $7.4 billion all-stock deal and was rebranded as Expand Energy. Controversies Antitrust allegations Alleged collusion with Encana to lower land price In mid-2012, the U.S. Department of Justice (DOJ) began an investigation into whether Encana, Canada's largest natural gas company, \"illegally colluded with Chesapeake Energy Corp to lower the price of Michigan exploration lands during a public land auction in May 2010.\" The antitrust probe ended in 2014 with a letter to Chesapeake by the U.S. Department of Justice. Internal investigations by the companies found no evidence of collusion. Cancellation of leases On June 5, 2014, the state of Michigan filed felony fraud and racketeering charges against the company, alleging that the company canceled hundreds of land leases on false pretenses after it sought to obtain oil and gas rights. Michigan attorney general Bill Schuette claimed that the company \"obtained uncompensated land options from these landowners by false pretenses, and prevented competitors from leasing the land.\" Chesapeake Energy disputed all charges. In 2015, the company settled the lawsuits by agreeing to pay $25 million to the landowners. Underpayment of royalties to landowners The company has faced thousands of lawsuits regarding the alleged under-payment of royalties due to individuals that leased land to the company. In 2013, the company agreed to pay $7.5 million to settle a class action lawsuit by Pennsylvania landowners. In 2017, the company agreed to pay another $30 million to Pennsylvania landowners. Alleged collusion in land auctions On March 1, 2016, a DOJ federal grand jury indicted Aubrey McClendon for allegedly rigging the bidding process for land leases between December 2007 and March 2012. McClendon was charged of orchestrating a conspiracy in which two oil and gas companies, not named in the indictment, colluded not to bid against each other for the purchase of land in northwestern Oklahoma. According to the indictment, the companies decided ahead of time who would win bids, with the winner then allocating an interest in the leases to the other company, eliminating open competitive bidding. The DOJ said this was the first case resulting from a continuing federal antitrust investigation into price fixing, bid rigging, and other anti-competitive conduct in the petroleum industry. The next day, on March 2, 2016, McClendon died in a single-occupant single-vehicle crash when he drove his vehicle directly into a concrete bridge embankment in Oklahoma City. The charges were dropped by the DOJ as a result of the death. Alleged price-fixing In January 2024, a class action lawsuit was filed accusing the company, along with seven other US oil and gas producers, of engaging in an anti-competitive business practice in the form of an illegal price fixing scheme to constrain production of shale oil, allegedly leading to drivers in the US paying more for gasoline than they would have in a competitive market. Lobbying In 2004, then CEO Aubrey McClendon contributed $450,000 to the campaign of Tom Corbett for attorney general of Pennsylvania. These funds were cited as the reason Corbett won the election, with a narrow margin. When Corbett eventually became governor of Pennsylvania, he was very supportive of the company's fracking activity in Pennsylvania, and Pennsylvania was the only state without a severance tax on drillers, despite the fact that the budget for education was being reduced. In 2008, then CEO Aubrey McClendon formed American Clean Skies Foundation, a non-profit foundation focused on selling the virtues of natural gas. The foundation was funded by the company and by McClendon. The foundation was criticized for doing nothing but pushing Congress to pass policies that benefited the company and McClendon's business interests. Environmental damage Discharges of fill material In 2013, the Environmental Protection Agency fined a subsidiary of the company $3.2 million, and ordered it to pay an estimated $6.5 million for the restoration of sites that were damaged by the company from unauthorized discharge of material. 2011 well blowout On April 19, 2011, due to a failed seal assembly in a wellhead, the company lost control of a natural gas well in Bradford County, Pennsylvania that was being fracture stimulated, causing a large spill of salt water and chemicals, such as 2-butoxyethanol and methanol, into the surrounding countryside. By April 22, 2011, the leak had been stemmed. Maryland announced its intention to sue the company for violation of the Resource Conservation and Recovery Act and the Clean Water Act since fracking fluids from the well blowout wound up in the Chesapeake Bay. 2015 landslide In November 2015, the company was fined $1.4 million in Pennsylvania for a landslide caused by the company in 2011 that resulted in clogged waterways. Earthquakes Oklahoma and Kansas correlated with hydraulic fracturing In 2007, Oklahoma recorded a single earthquake. By 2015, after the rise in hydraulic fracturing, there were more than 900. After the 2011 Oklahoma earthquake in Prague, Oklahoma, having suffered home damage and physical injury, a resident sued the company. The Sierra Club also filed a lawsuit against the company and Devon Energy over damages suffered in a magnitude 5.8, 2016 Oklahoma earthquake near Pawnee, which was tied for the largest such shock in the eastern United States in 70 years. A judge dismissed the lawsuit in April 2017. Awards and recognition In 2007, the company was named the best managed oil-and-gas company by Forbes. In 2009, S&P Global Platts named the company as the Energy Producer of the Year and it received the Industry Leadership Award. The company was also a finalist in the Deal of the Year, CEO of the Year, and Community Development Program of the Year categories. In 2012, the company received an Award of Excellence. In 2010, Shaleplay, the company's corporate band, won first place in the Fortune Battle of the Corporate Bands. In 2014, the company was ranked 51st on the 100 Best Companies to Work by Fortune. In 2021, the company achieved Grade \"A\" MiQ and EO100 Certification for its legacy Haynesville Shale operations."
}