{
  "ticker": "EXPE",
  "cik": "0001324424",
  "company_name": "Expedia Group",
  "corrected_name": "Expedia Group",
  "wiki_title_used": "Expedia Group",
  "exists": true,
  "raw_text": "Expedia Group, Inc. is an American travel technology company that owns and operates travel fare aggregators and travel metasearch engines, including Expedia, Hotels.com, Vrbo, Travelocity, Hotwire.com, Orbitz, Ebookers, CheapTickets, CarRentals.com, Expedia Cruises, Wotif, and Trivago. Over 3.5 million lodging facilities and flights on over 500 airlines are bookable on the company's websites. It has 16,500 employees, and its headquarters are located in Seattle, Washington.\nThe word \"Expedia\" is derived from a combination of \"exploration\" and \"speed\". The company is listed on Nasdaq under the ticker symbol EXPE.\n\nHistory\nFounded as a division of Microsoft in October 1996, Expedia was spun off into a public company in 1999. IAC, known at the time as USA Networks Inc, acquired a controlling interest in the company in 2001 and acquired the remainder of the company in 2003. In August 2005, IAC spun off the company. In December 2011, Expedia, Inc. spun off TripAdvisor.\n\nManagement history\nIn 2003, Rich Barton resigned as CEO and was replaced by Erik Blachford.\nIn December 2004, Dara Khosrowshahi was announced as CEO.\nIn March 2017, Chelsea Clinton was named to the board of directors of Expedia, with compensation of $45,000 a year in cash, plus $250,000 a year in stock vesting over three years.\nIn August 2017, Mark Okerstrom became the President and CEO of Expedia, Inc.\nIn December 2019, Mark Okerstrom and Alan Pickerill resigned as CEO and CFO, respectively. At that time, Expedia Group's chairman, Barry Diller, took over day-to-day operations, while the Chief Strategy Officer, Eric Hart, became acting CFO.\nIn February 2020, Expedia announced it was cutting 3,000 jobs, roughly 12% of the workforce, citing a \"disappointing 2019\". Diller, in his role as acting CEO, stated the company had become \"sclerotic and bloated\" and that employees were \"all life and no work\".\nIn April 2020, Peter Kern was appointed as CEO of Expedia Group. He was the highest paid CEO in the S&P 500 in 2021, with $296 million in total compensation.\nIn May 2024, Ariane Gorin was appointed as CEO of Expedia Group.\n\nOffice and headquarters history\nIn 2015, Expedia announced that it would move its headquarters to the Interbay neighborhood of Seattle, purchasing the Amgen campus on the Elliott Bay waterfront for $228.9 million and investing an additional $900 million on renovation and expansion of the 41-acre (17 ha) campus to 1.23 million square feet (114,000 m2). The first employees moved into the new headquarters in October 2019.\nIn 2021, Expedia built a new campus in DLF Cyber Park, Gurugram, India.\n\nAcquisition history\nIn July 2015, Expedia made an investment in Wingz.\n\nDivestitures\nExpedia Cruises\nExpedia Cruises, formerly CruiseShipCenters International, is a travel agency franchise company established in 1987. In 2024, it had 260 locations in North America, and beyond cruises, booked \"luxury and expedition travel, river cruises, land tours, safaris, all-inclusive resort properties and insurance.\" In 2021, it had 6,100 vacation consultants in the US and Canada.\n\nHistory\nCruiseShipCenters International was established as a travel agency franchise in Vancouver in 1987. In 2007, Expedia bought a \"significant but non-controlling\" interest in cruise vacation specialists CruiseShipCenters International, then based in Vancouver. At the time, CruiseShipCenters had 100 retail locations in Canada, and booked 20% of all cruises sold in the country. In 2007, it had projected annual revenues of $305 million, with 1,500 cruise consultants. Expedia announced it would expand the company into the United States as well. As of March 2013, Expedia Inc owned 100% of the company. \nAs of 2014, it retained its corporate office in Vancouver. With franchises in states such as Nevada by 2016, in February 2017, the Expedia division had 190 locations in North America. In 2018, Expedia CruiseShipCenters was expanding in Texas. In 2018, it had over $790 million in gross bookings. In September 2019, the company announced its 300th franchise agreement in North America. Matthew Eichhorst served as president. In 2020, the Expedia CruiseShipCenters rebranded to Expedia Cruises with the tag line Air, Land & Sea Vacations.\nIt had 290 franchise locations in 2021, and 6,100 vacation consultants in the US and Canada. In 2024, it had 260 locations in North America, and beyond cruises, booked \"luxury and expedition travel, river cruises, land tours, safaris, all-inclusive resort properties and insurance.\" Eichhorst remained president in 2025.\n\nAwards\nExpedia Cruises won the Canadian Franchise Association Award of Excellence from 2006 until 2011.\n\nCorporate office\nThe corporate offices are located in Vancouver, British Columbia, and Seattle, Washington.\n\nCriticism and legal issues\nDelays in refunds of flights cancelled due to COVID-19\nIn 2020, during the COVID-19 pandemic, customers complained regarding the process to get refunds for cancelled flights. Customers complained of excessively long call times and being unable to get through to a representative. This led to many lawsuits.\n\nInvolvement in Israeli settlements\nOn February 12, 2020, Expedia Group was included on a list of companies operating in West Bank settlements involved in activities that \"raised particular human rights concerns\" published by the United Nations Human Rights Council. The company was categorized under \"the provision of services and utilities supporting the maintenance and existence of settlements\".\n\nFalse advertising and trademark violation\nIn August 2016, Buckeye Tree Lodge and Sequoia Village Inn, LLC filed a class-action lawsuit in California accusing the company and its partners of violating trademark rights of numerous independent hotel and motel establishments by running advertising implying that consumers could book reservations for those hotels on Expedia even though Expedia had no relationship with those hotels, in violation of the Lanham Act, and also falsely noting that hotels with which the company had no relationship were \"sold out\". In April 2021, the lawsuit was settled and the company promised not to engage in false advertising.\n\nAustralian false advertising suit\nSouth Carolina sales tax suit\nIn January 2011, Travelscape, a subsidiary of Expedia Inc. based in the Las Vegas Valley, was ordered to pay $6.3 million in back sales taxes to South Carolina by the South Carolina Supreme Court. Travelscape argued that South Carolina's efforts to tax online retailers located out-of-state violate the Dormant Commerce Clause. In a unanimous ruling, the court determined that, while Travelscape does not have physical facilities in South Carolina, frequent sales trips made by its employees and the fact that the company furnished hotel rooms in the state establish its presence for tax purposes and is sufficient to be required to pay sales tax.\n\nNotes\nReferences\nExternal links\nOfficial website of the Expedia Group\nOfficial website of Expedia Cruises\nBusiness data for Expedia Group, Inc.:",
  "clean_text": "Expedia Group, Inc. is an American travel technology company that owns and operates travel fare aggregators and travel metasearch engines, including Expedia, Hotels.com, Vrbo, Travelocity, Hotwire.com, Orbitz, Ebookers, CheapTickets, CarRentals.com, Expedia Cruises, Wotif, and Trivago. Over 3.5 million lodging facilities and flights on over 500 airlines are bookable on the company's websites. It has 16,500 employees, and its headquarters are located in Seattle, Washington. The word \"Expedia\" is derived from a combination of \"exploration\" and \"speed\". The company is listed on Nasdaq under the ticker symbol EXPE. History Founded as a division of Microsoft in October 1996, Expedia was spun off into a public company in 1999. IAC, known at the time as USA Networks Inc, acquired a controlling interest in the company in 2001 and acquired the remainder of the company in 2003. In August 2005, IAC spun off the company. In December 2011, Expedia, Inc. spun off TripAdvisor. Management history In 2003, Rich Barton resigned as CEO and was replaced by Erik Blachford. In December 2004, Dara Khosrowshahi was announced as CEO. In March 2017, Chelsea Clinton was named to the board of directors of Expedia, with compensation of $45,000 a year in cash, plus $250,000 a year in stock vesting over three years. In August 2017, Mark Okerstrom became the President and CEO of Expedia, Inc. In December 2019, Mark Okerstrom and Alan Pickerill resigned as CEO and CFO, respectively. At that time, Expedia Group's chairman, Barry Diller, took over day-to-day operations, while the Chief Strategy Officer, Eric Hart, became acting CFO. In February 2020, Expedia announced it was cutting 3,000 jobs, roughly 12% of the workforce, citing a \"disappointing 2019\". Diller, in his role as acting CEO, stated the company had become \"sclerotic and bloated\" and that employees were \"all life and no work\". In April 2020, Peter Kern was appointed as CEO of Expedia Group. He was the highest paid CEO in the S&P 500 in 2021, with $296 million in total compensation. In May 2024, Ariane Gorin was appointed as CEO of Expedia Group. Office and headquarters history In 2015, Expedia announced that it would move its headquarters to the Interbay neighborhood of Seattle, purchasing the Amgen campus on the Elliott Bay waterfront for $228.9 million and investing an additional $900 million on renovation and expansion of the 41-acre (17 ha) campus to 1.23 million square feet (114,000 m2). The first employees moved into the new headquarters in October 2019. In 2021, Expedia built a new campus in DLF Cyber Park, Gurugram, India. Acquisition history In July 2015, Expedia made an investment in Wingz. Divestitures Expedia Cruises Expedia Cruises, formerly CruiseShipCenters International, is a travel agency franchise company established in 1987. In 2024, it had 260 locations in North America, and beyond cruises, booked \"luxury and expedition travel, river cruises, land tours, safaris, all-inclusive resort properties and insurance.\" In 2021, it had 6,100 vacation consultants in the US and Canada. History CruiseShipCenters International was established as a travel agency franchise in Vancouver in 1987. In 2007, Expedia bought a \"significant but non-controlling\" interest in cruise vacation specialists CruiseShipCenters International, then based in Vancouver. At the time, CruiseShipCenters had 100 retail locations in Canada, and booked 20% of all cruises sold in the country. In 2007, it had projected annual revenues of $305 million, with 1,500 cruise consultants. Expedia announced it would expand the company into the United States as well. As of March 2013, Expedia Inc owned 100% of the company. As of 2014, it retained its corporate office in Vancouver. With franchises in states such as Nevada by 2016, in February 2017, the Expedia division had 190 locations in North America. In 2018, Expedia CruiseShipCenters was expanding in Texas. In 2018, it had over $790 million in gross bookings. In September 2019, the company announced its 300th franchise agreement in North America. Matthew Eichhorst served as president. In 2020, the Expedia CruiseShipCenters rebranded to Expedia Cruises with the tag line Air, Land & Sea Vacations. It had 290 franchise locations in 2021, and 6,100 vacation consultants in the US and Canada. In 2024, it had 260 locations in North America, and beyond cruises, booked \"luxury and expedition travel, river cruises, land tours, safaris, all-inclusive resort properties and insurance.\" Eichhorst remained president in 2025. Awards Expedia Cruises won the Canadian Franchise Association Award of Excellence from 2006 until 2011. Corporate office The corporate offices are located in Vancouver, British Columbia, and Seattle, Washington. Criticism and legal issues Delays in refunds of flights cancelled due to COVID-19 In 2020, during the COVID-19 pandemic, customers complained regarding the process to get refunds for cancelled flights. Customers complained of excessively long call times and being unable to get through to a representative. This led to many lawsuits. Involvement in Israeli settlements On February 12, 2020, Expedia Group was included on a list of companies operating in West Bank settlements involved in activities that \"raised particular human rights concerns\" published by the United Nations Human Rights Council. The company was categorized under \"the provision of services and utilities supporting the maintenance and existence of settlements\". False advertising and trademark violation In August 2016, Buckeye Tree Lodge and Sequoia Village Inn, LLC filed a class-action lawsuit in California accusing the company and its partners of violating trademark rights of numerous independent hotel and motel establishments by running advertising implying that consumers could book reservations for those hotels on Expedia even though Expedia had no relationship with those hotels, in violation of the Lanham Act, and also falsely noting that hotels with which the company had no relationship were \"sold out\". In April 2021, the lawsuit was settled and the company promised not to engage in false advertising. Australian false advertising suit South Carolina sales tax suit In January 2011, Travelscape, a subsidiary of Expedia Inc. based in the Las Vegas Valley, was ordered to pay $6.3 million in back sales taxes to South Carolina by the South Carolina Supreme Court. Travelscape argued that South Carolina's efforts to tax online retailers located out-of-state violate the Dormant Commerce Clause. In a unanimous ruling, the court determined that, while Travelscape does not have physical facilities in South Carolina, frequent sales trips made by its employees and the fact that the company furnished hotel rooms in the state establish its presence for tax purposes and is sufficient to be required to pay sales tax. Notes"
}