{
  "ticker": "EXR",
  "cik": "0001289490",
  "company_name": "Extra Space Storage",
  "corrected_name": "Extra Space Storage",
  "wiki_title_used": "Extra Space Storage",
  "exists": true,
  "raw_text": "Extra Space Storage Inc. is a real estate investment trust headquartered in Cottonwood Heights, Utah that invests in self storage facilities. The company rents storage units, including climate controlled units, drive-up units, lockers, boat storage, RV storage and business storage under the brands Extra Space Storage, Life Storage, and Storage Express. As of March 28, 2024 the company owned and/or operated 3,714 locations in 43 states, and Washington, D.C. comprising approximately 2.6 million units 283.4 million square feet of net rentable space. It is the largest owner of self storage units in the United States and the largest self storage property manager.\nExtra Space Storage has won NAREIT's Leader in the Light Award for superior and sustained sustainability efforts in 2020, 2021 and 2022. The company has solar installations at many of its properties and was listed on the \"Top 25 Corporate Users by Number of Solar Installations\" by the Solar Energy Industries Association.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Extra Space Storage Inc.:",
  "clean_text": "Extra Space Storage Inc. is a real estate investment trust headquartered in Cottonwood Heights, Utah that invests in self storage facilities. The company rents storage units, including climate controlled units, drive-up units, lockers, boat storage, RV storage and business storage under the brands Extra Space Storage, Life Storage, and Storage Express. As of March 28, 2024 the company owned and/or operated 3,714 locations in 43 states, and Washington, D.C. comprising approximately 2.6 million units 283.4 million square feet of net rentable space. It is the largest owner of self storage units in the United States and the largest self storage property manager. Extra Space Storage has won NAREIT's Leader in the Light Award for superior and sustained sustainability efforts in 2020, 2021 and 2022. The company has solar installations at many of its properties and was listed on the \"Top 25 Corporate Users by Number of Solar Installations\" by the Solar Energy Industries Association."
}