{
  "ticker": "FANG",
  "cik": "0001539838",
  "company_name": "Diamondback Energy",
  "corrected_name": "Diamondback Energy",
  "wiki_title_used": "Diamondback Energy",
  "exists": true,
  "raw_text": "Diamondback Energy, headquartered in Midland, Texas, is an American company engaged in hydrocarbon exploration in the Permian Basin.\nAs of December 31, 2024, the company had 3,557 million barrels of oil equivalent (2.176×1010 GJ) of estimated proved reserves, of which 49% was petroleum, 24% was natural gas, and 27% was natural gas liquids.\nIt is ranked 383rd on the Fortune 500 and 471st on the Forbes Global 2000.\n\nHistory\nThe company began operations in December 2007 with the acquisition of 4,174 net acres in the Permian Basin.\nIn October 2012, the company became a public company via an initial public offering, issuing 12,500,000 shares of common stock at a price of $17.50 per share at its opening on Nasdaq under the ticker symbol FANG, in reference to a snake's tooth; the company's logo at the time featured a Western diamondback rattlesnake.\nIn March 2017, the company acquired assets from Brigham Resources for $2.55 billion.\nIn October 2018, the company acquired the assets of Ajax Resources for $1.25 billion.\nIn November 2018, the company acquired Energen.\nIn February 2021, the company acquired leasehold interests and assets from Guidon Resources for $375 million in cash and 10.68 million shares.\nIn March 2021, the company acquired QEP Resources.\nIn September 2024, the company acquired Endeavor Energy Resources.\nIn April 2025, the company acquired Double Eagle IV for $3 billion in cash and 6.9 million shares of stock.\n\nControversies\nEnvironmental\nIn October 2023, the company was accused of being a major contributor to the increase of flaring gas in the Permian Basin.\n\nAntitrust lawsuit\nIn January 2024, a class action lawsuit was filed accusing Diamondback, along with seven other US oil and gas producers, of an illegal price fixing scheme to constrain production of shale oil, allegedly causing drivers in the US paying more for gasoline than they would have in a competitive market. The case is now part of a consolidated multidistrict litigation in New Mexico to be heard by judge Matthew L. Garcia.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Diamondback Energy, Inc.:",
  "clean_text": "Diamondback Energy, headquartered in Midland, Texas, is an American company engaged in hydrocarbon exploration in the Permian Basin. As of December 31, 2024, the company had 3,557 million barrels of oil equivalent (2.176×1010 GJ) of estimated proved reserves, of which 49% was petroleum, 24% was natural gas, and 27% was natural gas liquids. It is ranked 383rd on the Fortune 500 and 471st on the Forbes Global 2000. History The company began operations in December 2007 with the acquisition of 4,174 net acres in the Permian Basin. In October 2012, the company became a public company via an initial public offering, issuing 12,500,000 shares of common stock at a price of $17.50 per share at its opening on Nasdaq under the ticker symbol FANG, in reference to a snake's tooth; the company's logo at the time featured a Western diamondback rattlesnake. In March 2017, the company acquired assets from Brigham Resources for $2.55 billion. In October 2018, the company acquired the assets of Ajax Resources for $1.25 billion. In November 2018, the company acquired Energen. In February 2021, the company acquired leasehold interests and assets from Guidon Resources for $375 million in cash and 10.68 million shares. In March 2021, the company acquired QEP Resources. In September 2024, the company acquired Endeavor Energy Resources. In April 2025, the company acquired Double Eagle IV for $3 billion in cash and 6.9 million shares of stock. Controversies Environmental In October 2023, the company was accused of being a major contributor to the increase of flaring gas in the Permian Basin. Antitrust lawsuit In January 2024, a class action lawsuit was filed accusing Diamondback, along with seven other US oil and gas producers, of an illegal price fixing scheme to constrain production of shale oil, allegedly causing drivers in the US paying more for gasoline than they would have in a competitive market. The case is now part of a consolidated multidistrict litigation in New Mexico to be heard by judge Matthew L. Garcia."
}