{
  "ticker": "FAST",
  "cik": "0000815556",
  "company_name": "Fastenal",
  "corrected_name": "Fastenal",
  "wiki_title_used": "Fastenal",
  "exists": true,
  "raw_text": "Fastenal Company is an American publicly traded company based in Winona, Minnesota, founded in 1967. Fastenal is an industrial supply company that focuses on providing solutions(bin stock, vending machines, total cost of ownership analysis, etc.) and delivering to its customers. It placed 479 in the 2021 Fortune 500 based on its 2020 revenues, and its stock is a component of the Nasdaq 100 and S&P 500 stock market indices. Fastenal had 3,334 in-market locations as of March 2023.\nFastenal refers to itself as a supply chain solutions company, while Reuters calls it an industrial distributor.\n\nHistory\nFounded in 1967 by Bob Kierlin, the company was incorporated on December 24, 1968. Fastenal's offerings include both purchased and manufactured products.\nIn January 2016, Daniel L. Florness became the President and CEO of Fastenal. Florness started with Fastenal in 1996 as the company's chief financial officer.\nFastenal has been a sponsor of NASCAR since 2006, and in 2020, they became the official MRO partner of the NHL.\nIn 2009, Fastenal acquired parts of Holo-Krome, a socket head screw-making company. Fastenal then was added to the S&P 500 index in late 2008.\n\nCanada\nIt entered the Canadian market in 1994. The company has branch locations in every province and two Canadian distribution centers.\n\nMexico\nIn 1999, Fastenal entered the market in Mexico.  Fastenal has branches in 14 of Mexico's states as well as a distribution center.\n\nAsia\nFastenal's Asian trading company, Fastenal Asian Sourcing and Trading Co, is a Wholly Foreign-Owned Enterprise located in Shanghai, China, where it directs sourcing and import purchasing activities. Opened in 2001, Fastenal's Singapore location was its first site outside North America. By 2009, sales operations in Shanghai were complemented by those in its larger neighbor Malaysia. Locally incorporated Fastenal Malaysia Sdn Bhd is associated with Fastenal's Malaysian activities. The company runs an A2LA accredited testing laboratory in this nation as of 2014.\n\nProducts and services\nFastenal first sold mostly fasteners such as screws, threaded rods, and nuts, which are used in construction and manufacturing. Today's product range is more diverse, and the company had a total of 690,000 individual products as of 2010. In addition to a plethora of SKUs, the company offers a variety of services, including inventory management, small fastener manufacture, vending and machining.\nFastenal has retail stores in every U.S. state, every province of Canada, 14 Mexican states, Puerto Rico and Panama.\nAs of 2000, the company employs 400-plus people at six manufacturing locations, including one manufacturing bolts made using a newer method, cold heading, in Rockford, Illinois; an operation in Wallingford, Connecticut, and another in Malaysia, etc.\nInternationally, Fastenal has sites in China, Dominican Republic, Hungary, Malaysia, the Netherlands, Germany, Singapore and the United Kingdom. In 2006, the company had two sourcing offices in Asia, China and Taiwan. Both have an accredited testing laboratory, which, as of 2007, was A2LA certified.\n\nGallery\nSee also\nReferences\nExternal links\nOfficial website\nBusiness data for Fastenal Company:",
  "clean_text": "Fastenal Company is an American publicly traded company based in Winona, Minnesota, founded in 1967. Fastenal is an industrial supply company that focuses on providing solutions(bin stock, vending machines, total cost of ownership analysis, etc.) and delivering to its customers. It placed 479 in the 2021 Fortune 500 based on its 2020 revenues, and its stock is a component of the Nasdaq 100 and S&P 500 stock market indices. Fastenal had 3,334 in-market locations as of March 2023. Fastenal refers to itself as a supply chain solutions company, while Reuters calls it an industrial distributor. History Founded in 1967 by Bob Kierlin, the company was incorporated on December 24, 1968. Fastenal's offerings include both purchased and manufactured products. In January 2016, Daniel L. Florness became the President and CEO of Fastenal. Florness started with Fastenal in 1996 as the company's chief financial officer. Fastenal has been a sponsor of NASCAR since 2006, and in 2020, they became the official MRO partner of the NHL. In 2009, Fastenal acquired parts of Holo-Krome, a socket head screw-making company. Fastenal then was added to the S&P 500 index in late 2008. Canada It entered the Canadian market in 1994. The company has branch locations in every province and two Canadian distribution centers. Mexico In 1999, Fastenal entered the market in Mexico. Fastenal has branches in 14 of Mexico's states as well as a distribution center. Asia Fastenal's Asian trading company, Fastenal Asian Sourcing and Trading Co, is a Wholly Foreign-Owned Enterprise located in Shanghai, China, where it directs sourcing and import purchasing activities. Opened in 2001, Fastenal's Singapore location was its first site outside North America. By 2009, sales operations in Shanghai were complemented by those in its larger neighbor Malaysia. Locally incorporated Fastenal Malaysia Sdn Bhd is associated with Fastenal's Malaysian activities. The company runs an A2LA accredited testing laboratory in this nation as of 2014. Products and services Fastenal first sold mostly fasteners such as screws, threaded rods, and nuts, which are used in construction and manufacturing. Today's product range is more diverse, and the company had a total of 690,000 individual products as of 2010. In addition to a plethora of SKUs, the company offers a variety of services, including inventory management, small fastener manufacture, vending and machining. Fastenal has retail stores in every U.S. state, every province of Canada, 14 Mexican states, Puerto Rico and Panama. As of 2000, the company employs 400-plus people at six manufacturing locations, including one manufacturing bolts made using a newer method, cold heading, in Rockford, Illinois; an operation in Wallingford, Connecticut, and another in Malaysia, etc. Internationally, Fastenal has sites in China, Dominican Republic, Hungary, Malaysia, the Netherlands, Germany, Singapore and the United Kingdom. In 2006, the company had two sourcing offices in Asia, China and Taiwan. Both have an accredited testing laboratory, which, as of 2007, was A2LA certified. Gallery"
}