{
  "ticker": "FCX",
  "cik": "0000831259",
  "company_name": "Freeport-McMoRan",
  "corrected_name": "Freeport-McMoRan",
  "wiki_title_used": "Freeport-McMoRan",
  "exists": true,
  "raw_text": "Freeport-McMoRan Inc., often called Freeport, is an American mining company based in the Freeport-McMoRan Center, in Phoenix, Arizona. The company is the world's largest producer of molybdenum, a major copper producer and operates the world's largest gold mine, the Grasberg mine in Papua, Indonesia.\nDuring 2018 Freeport-McMoRan Copper & Gold along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017.\n\nHistory\nFreeport Sulphur Company was founded July 12, 1912, by the eldest son of Svante Magnus \"E.M.\" Swenson, banker Eric Pierson Swenson, with a group of investors, to develop sulfur mining at Bryan Mound salt dome, along the US Gulf Coast. Freeport, Texas was also established in Nov. 1912 to house workers, and serve as a port for Houston, rivaling Galveston and Corpus Christi.\nFreeport mined sulfur along the Gulf Coast using the Frasch process, the patents for which had expired in 1908, a disruptive innovation for the automated mining of previously inaccessible sulphur deposits at a cost lower than that of established mines, where manual labor gained the mineral under the most appalling conditions. Previously, Union Sulphur Company founder and patent-holder Herman Frasch had enjoyed a monopoly on the process. The Bryan Mound salt dome just south of Freeport became the second Frasch sulphur mine in the world in 1912.\n\nFreeport Texas Company\nEnterprise to support Freeport Sulphur's business and the new town's infrastructure led to the incorporation of a holding company on September 30, 1913, to join the newer assets with Freeport Sulphur and create a vertically integrated mining company around, at first, a single sulphur mine. Officers of the new holding company, Freeport Texas Company, were:\n\nEric. P. Swenson, President and Director (Freeport Sulphur founder, son of Swante M. Swenson)\nEdward E. Dickinson, vice-president and Director\nF.M. Altz, Secretary\nSwante M. Swenson, Treasurer (son of Eric P. Swenson)\nCharles H. Findlay, Auditor (son of Hugh Findlay and his third wife, Mary Ellen Smith)\nDirectors\nEric P. Swenson\nEdward E. Dickinson\nRichard H. Williams (son of Richard H. Williams)\nHarry K. Knapp\nSamuel McRoberts\nCharles P. Northrop\nCharles A. Stone\nFrank A. Vanderlip\nSidell Tilghman (son of General Lloyd Tilghman)\nEppa Hunton Jr. (son of late Virginia Senator, Brig. Gen. Eppa Hunton)\nCharles E. Herrmann\n\nOn May 7, 1917, all 35,000 outstanding shares were exchanged for 500,000 new shares of no par value (at a rate of 14+2⁄7:1). The stock was listed on the NYSE since 1919. Freeport raised an additional $4 million with an April 1, 1922 issue of convertible bonds, almost all of which were converted to common stock right away. Of the new total of 732,000 authorized shares 729,844 were then outstanding. In 1933, the no par common stock was exchanged for $10 par common and $2,500,000 convertible preferred were issued to finance the development of Grande Ecaille, about half of which was converted, the remainder called for redemption in 1938 at the end of which 796,380 common shares were outstanding. To raise general working capital Freeport Sulphur in 1939 sold $3,000,000 in 3% 20-year private debentures to Metropolitan Life Insurance Co. and Sun Life Insurance Co. of Canada. On September 1, 1951, the 99th consecutive quarterly dividend was paid. Effective September 21, 1951 the 800,000 outstanding common shares were split 3-for-1 and the authorized capital was increased from 850,000 to 3,000,000 shares. On March 2, 1959, the 129th consecutive quarterly dividend was paid and effective May 5, 1959 the 2,504,850 outstanding shares were once again split 3-for-1 and the authorized capital was increased from 3,000,000 to 10,000,000 shares.\nFreeport Sulphur was on the Fortune 500 in 1955, 1956, 1957, 1967, 1968, 1969, 1970.\n\nIn 1919, minority stockholders John R. Williams & Sons, First National Bank of Richmond, Virginia vice-president, W. M. Addison, Benjamin P Alsopp, E. L. Norton, and Samuel W. Travers solicited proxies to use at the April 5th annual stockholders' meeting, claiming, according to reports, that \"management has refused them adequate information regarding the property. President E.P. Swenson denies that information has been thus withheld and states that the board, which represents the dominant interests, has no vacancies at the present time.\"\n\n1928–1931 shareholder proxy fight\nIn 1928, shareholder and scion of one of the founding investment firms, John Langbourne Williams & Sons, Langbourne Meade Williams, Jr. launched a proxy fight for control of the company. In 1929, he then sought help from his former supervisor at Lee, Higginson & Co., J.T. Claiborne, who then enlisted clerk John Hay Whitney – who had become one of the wealthiest men in America following the 1927 death of his father, Payne Whitney. Williams eventually gained control of the company from founder Swenson, becoming its president in 1931, with Claiborne as a vice-president, and Whitney as chairman. Williams also served as chairman during 1958–1967.\nWilliams led the company's diversification, beginning with the purchase of manganese deposits in Oriente Province, Cuba.\n\n1930s\nThe company announced on February 19, 1931, the acquisition of a controlling interest in the Cuban American Manganese Corporation. Most of the metal was gained by concentration of low grade ore. The company benefited from (was subsidized by) zero import duty at a time when duties were high despite the United States reliance on imports for most of its supply of manganese. The deposit was depleted and the company dissolved in 1947.\nIn 1932, Freeport Sulphur Company acquired the sulfur rights for Lake Grande Ecaille and vicinity in Plaquemines Parish, Louisiana, and escalated the development of sulfur deposits in the Grand Ecaille dome in 1933, still using the Frasch Process developed by Dr. Herman Frasch, who had, in 1895, enjoined the American Sulphur Company into a partnership, forming the Union Sulphur Company, to initiate the first successful sulfur mining at Grand Ecaille, with which Freeport, like other competitors, would compete upon expiry of the Frasch patents in 1908. From its earliest inception, sulfur mining was the catalyst that developed Port Sulphur, Louisiana.\nEffective January 1, 1937 the Freeport Texas Company changed its name to Freeport Sulphur Company (the old one was dissolved) and its character from a holding company to an operating company, likely as a response to the Revenue Act of 1936 to avoid double taxation. On this occasion all active subsidiaries except the Cuban-American Manganese Corp were liquidated.\n\n1950s\nFreeport announced on March 7, 1952, the development of 3 new sulphur mines at an estimated cost of $20 million, to be financed from accrued cash reserves, as part of the national defense industrial mobilization program (Korea War). The effort grew into a $25 million program covering 4 new mines, one major (Garden Isle Bay) and 3 minor (Bay Ste. Elaine, Nash, Chacahoula) with a combined new capacity of 750,000 long tons per year, in addition to the existing Hoskins Mound (closed in 1955) and Grand Ecaille mines.\nThe company produced nickel during World War II and potash in the 1950s. In 1955, Freeport Nickel invested $119 million, of which $100 million came from the U.S. government, into  construction of a nickel-cobalt mine at Moa Bay, Cuba, and a refinery at Port Nickel, Louisiana. On March 11, 1957, the U.S. government announced a contract to buy nickel and cobalt from the company.\nIn 1956, the company formed the Freeport Oil Company. In 1958, the company sold an oil discovery near Lake Washington in Louisiana for approximately $100 million to Magnolia Petroleum Company.\nIn 1959, Freeport geologists confirmed the 1936 Dutch discovery of the rich Ertsberg copper and gold deposits, now known as the Grasberg mine, in extremely rugged, remote country in the Jayawijaya Mountains in what was then called the Netherlands New Guinea.\n\n1960s\nIn 1960, Fidel Castro implemented a 25% ore tax, effectively nationalizing and seizing Freeport's nickel-mining operations in Cuba.\nIn 1961, the company entered the kaolin business after purchasing the assets of Southern Clays Inc. In 1964, the company formed Freeport of Australia to pursue mining opportunities there and in the surrounding Pacific Ocean region.\n\nDevelopment of the Ertsberg deposit\nIn 1967, the company negotiated a contract with the Indonesian government to develop the Ertsberg deposit. In their feasibility study, Freeport geologists estimated that the orebody totaled 33 million tons averaging 2.5% copper, making it the largest above-ground copper deposit ever discovered. Construction of an open pit mine began in May 1970 and in mid-1973 the mine was declared fully operational. Officials at Bechtel, the primary project contractor, called mine development at Ertsberg \"the most difficult engineering project they had ever undertaken.\" The challenges included building a 101-kilometre (63 mi) long access road (a project that required boring kilometer long tunnels through two mountains) and constructing the world's longest single span aerial tramway. The tramways were needed to move people, supplies and ore because a 2,000-foot (610 m) cliff separates the Ertsberg mine (at 12,000 feet (3,700 m) elevation) from the mill (at 10,000 feet). Moving copper concentrate from that mill to the shipping port required installation of a 109-kilometre (68 mi) slurry pipeline – then the world's longest. Mine construction and startup cost about US$200 million. The Ertsberg project was an engineering marvel, but the mine's early financial performance was disappointing. Depressed copper prices and high operating costs kept profits marginal during the 1970s.\nIn 1967 The McMoRan Oil and Gas Company was founded by three partners, William Kennon McWilliams Jr. (\"Mc\"), James Robert (Jim Bob) Moffett (\"Mo\"), who were both petroleum geologists, and Mack Rankin (\"Ran\"), a specialist in land-leasing and sales operations. In 1981, McMoRan would merge with Freeport Minerals, formerly Freeport Sulphur, to form Freeport-McMoRan.\n\n1970s\nIn 1971, the company changed its name to Freeport Minerals Company, (not to be confused with Freeport Minerals Corporation, founded in 1834).\n\n1980s\nOn April 7, 1981, Freeport Minerals Company merged with the McMoRan Oil and Gas Company.\nIn 1981, the company formed a 70/30 joint venture with an affiliate of FMC Corporation to operate the Jerritt Canyon gold mine near Elko, Nevada. In 1985, the company headquarters moved to New Orleans, Louisiana. The company also sold a 25% interest in oil and gas assets primarily in the western United States to Britoil for $73.5 million.\nIn 1989, the company sold about $1.5 billion in assets to finance development of the Grasberg mine and the Main Pass offshore sulfur-oil-gas deposit off Louisiana.\n\n1990s\nIn July 1995, the company completed the corporate spin-off, first announced in May 1994, of its entire interest in Freeport-McMoRan Copper & Gold, which owned the Grasberg mine.\nIn 1995, RTZ, a predecessor of Rio Tinto Group, made a $450 million investment in the company.\nIn 1997, IMC Global, a large fertilizer producer, acquired Freeport-McMoRan Inc., the former parent company that now owned the sulfur and fertilizer businesses, in a $750 million transaction. Shareholders of Freeport-McMoRan received shares of IMC Global.\nIn 1997, the Indonesian government asked Freeport-McMoRan  to substantiate the Canadian mining company Bre-X's claims of having found the largest gold mine ever discovered, in Borneo. Freeport announced that its prospective partner Bre-X did not have gold reserves at its Indonesian mine, as it had reported. Bre-X subsequently was exposed as a fraud and went bankrupt.\nIn 1998, low commodity prices forced the company to suspend its dividend.\n\n2000s\nIn 2003, the company was subpoenaed as part of an investigation by anti-trust authorities in the United States, Canada, and Europe into price fixing in the copper industry.\nOn March 19, 2007, the company acquired Phelps Dodge (for $25.9 Billion) and became the largest copper producer of any public company in the world. The corporate headquarters was moved from New Orleans, Louisiana to Phoenix, Arizona.\n\n2010s\nIn 2012, the company announced agreements to acquire affiliated companies McMoRan Exploration Company and Plains Exploration & Production Company for a total enterprise value of over $20 billion. The transaction added significantly to the company's petroleum assets. The transaction was criticized as a conflict of interest due to the common ownership of the companies. In 2015, the company paid a $137.5 million settlement to resolve claims that executives and directors had conflicts of interest that resulted in the company overpaying in that transaction.\nIn 2014, the company sold its assets in the Eagle Ford shale to Encana for $3.1 billion. In 2015, the company announced job cuts at its Sierrita Mine in Arizona due to low copper and molybdenum prices.\nOn December 28, 2015, the company announced that James R. Moffett would resign as chairman of the company and be replaced by Gerald J. Ford. Moffett received $16.1 million in severance pay and cash retirement plans totaling more than $63 million. Moffett continued to consult for the company for annual fees of $1.5 million.\nIn May 2016, the company sold a 13% interest in its Morenci Mine to Sumitomo Group for $1 billion in cash.\nIn 2016, Freeport sold its deepwater assets, including the Marlin TLP, and the Holstein and Horn Mountain spars, to Anadarko Petroleum.\nIn August 2017, the company agreed to give a 51% interest in the Grasberg mine to the Government of Indonesia and build a smelter in exchange for a special permit to operate the mine until 2041.\nIn 2018, the company ranked at number 176 on the Fortune 500 list. During this year, Indonesian President Joko Widodo also planned to take control of 51% of Freeport Indonesia's equity, effectively handing over Freeport control to the Indonesian government. The Indonesian government planned to settle payments of $3.85 billion during the takeover process and finalized the process on December 21, 2018.\nDuring 2018 Freeport-McMoRan Copper & Gold along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017.\n\nCurrent operations\nFreeport is the world's largest producer of molybdenum, and one of the largest producers of copper. In 2019, 79% of its revenues were from the sale of copper, 11% were from the sale of gold, and 8% were from the sale of molybdenum. In 2019, sales to the company's copper refining joint venture in Gresik Regency accounted for 13% of the total revenues of the company.\nSome of the company's mining operations are as follows:\n\nAfrica\nFreeport Cobalt held a 100% interest in Kisanfu, a copper and cobalt exploration project located near Tenke, Democratic Republic of the Congo. This subsidiary also owns a large cobalt refinery in Kokkola, Finland, along with a related sales and marketing business. FCX has an effective 56% of that enterprise. Negotiations in 2016  to include these cobalt projects in a sale to China Molybdenum of Tenke Fungurume Mine, a cobalt/copper mine in DRC Congo, were not successful. Instead, the Kisanfu mine was sold to China Molybdenum in a separate transaction in 2020.\n\nEurope\nIn December 2019, Freeport Cobalt (a joint venture between Freeport-McMoRan and Lundin Mining) sold its cobalt refinery in Kokkola, Finland to Umicore. FCX held an effective 56% interest in that enterprise.\n\nNorth America\nArizona\n\nBagdad, Arizona – 100% owned (copper, molybdenum)\nMiami, Arizona – 100% owned (copper)\nMorenci, Arizona – 72% owned (copper)\nSafford mine, Safford, Arizona – 100% owned (copper)\nSierrita mine, Arizona (includes Twin Buttes & Esperanza) – 100% owned (copper, molybdenum)\nColorado\n\nClimax mine, Leadville, Colorado – 100% owned (molybdenum)\nHenderson molybdenum mine, Empire, Colorado – 100% owned (molybdenum)\nNew Mexico\n\nChino mine, Santa Rita, New Mexico – 100% owned (copper, molybdenum)\nTyrone, New Mexico – 100% owned (copper)\n\nSouth America\nEl Abra, Chile – 51% owned (copper)\nCerro Verde, Peru – 54% owned (copper, molybdenum)\n\nEurope\nAtlantic Copper, Huelva, Spain – 100% owned copper refinery\n\nIndonesia\nGrasberg, Central Papua, Indonesia – 49% owned (copper, gold, silver)\n\nPast holdings\nSulphur mines\nBryan Mound\nA first demonstration run began on November 19, 1912, but the plant was quickly shut down again for adjustments. Operations were unsteady throughout 1913. In December one shipment of 730 tons was made to New York and the plant produced about 200 tons per week. The Bryan Mound was 25 feet tall. Five different companies had drilled about 16 holes into the mound in the search for oil, but found no hydrocarbons in commercially viable quantities and attached no value to the sulphur they encountered under the given conditions. During two years of prospecting and with total of $150,000 expended, the Freeport Sulphur syndicate drilled 11 holes, each of them showing sulphur at between 760 feet and 1,100 feet in the form of sulphur bearing limestone, dolomite and gypsum with some beds of pure sulphur up to 7 feet thick. The deposit was carried at a bit below $30,000,000 of estimated value in the 1918 balance sheet. Bryan Mound production was not entirely continuous. To reduce stockpiles, work was suspended from April 1, 1921 until May 1922 and then again from January 31, 1924 to May 15, 1925. During production periods not all of the plants were necessarily in operation. The four plants were built by Westinghouse, Church, Kerr & Co and together were considered to be among the largest oil burning installations in the world.\n\nFreeport Sulphur Co. was also prospecting for oil at Bryan Mound. They found a (decomposing) tree in January 1919 at a record-candidate depth of 2,883 ft.\n\nHoskins Mound\nIn 1923, Freeport started producing sulfur from Hoskins Mound in Brazoria County, Texas.\nThe sulphur was obtained from a depth of between 900 and 1,300 feet. The plant equipment was purchased in 1918 intended to become the 5th plant at Bryanmound, but those plans were abandoned with the end of World War I. Temporary housing, water reservoirs and the excavation for the foundation were all completed before the first train brought cement to the construction site on October 7, 1922. The power plant of steel and brick construction had a 175 foot by 13 foot chimney and was completed on March 26, 1923, with the first turbogenerator already in service since March 10. In the beginning, oil was burned at the Hoskins Mound plant, transported by tank cars from Freeport, stored in 2x15,000bbl tanks and one 55,000bbl reserve tank. These 85,000bbl constituted about 2 months worth of supply (a little more than 1,400bpd). The power generation came from 6 batteries of 2x702hp Stirling boilers (ca. 8,400 hp total). Two 500kW turbogenerators supplied 2,200 volt 3-phase current for those water pumps some distance from the boiler house, the lights, and several auxiliary devices. Hoskins Mound was property of Texaco which received a $1 royalty per ton, as well as 50% of the profits until the time when Freeport had accumulated $2 million of the profit, at which point the contract (dated March 14, 1922) called for 70% of the profits to go to Texaco. The plant was built by Dwight P. Robinson & Co, which by then had absorbed Westinghouse, Church, Kerr & Co, builder of the Bryan Mound plants.\n\nGrand Ecaille\nGarden Island Bay\nProduction started the first week of December 1953 (preliminary activity in November). with approximately 500,000 tons per year capacity, Garden Island Bay was the largest of 4 new mines brought online in Freeport's early 1950s expansion program and in fact the largest new mine in the entire industry since Grand Ecaille in 1933. It was built at a cost of $14 million in an isolated marshland, the only other industrial facility within a 75-mile radius was Freeport's own Grande Ecaille. With the area only a foot or two above sea level, to protect against flooding it was necessary to pour an above-ground foundation, some 16 feet high resting on concrete pilings driven into the ground. When finished the plant could only be reached by boat or seaplane. The power plant and the drill site were 1 mile apart. The sulphur was brought by barges in liquid form to Port Sulphur. Even though Freeport already had the capability to use salty water in its process, this was not used and instead 2 earthen reservoirs together 1 square mile in size and holding almost a billion gallons could satisfy the plants demand for 3.5 million gallons per day. The reservoirs were filled between February and June, when salt water intrusion into the Mississippi river was at its seasonal low point. The sulphur mining rights were obtained in the beginning of 1951 from Texaco, which retained 50% of the profits. The discovery of the deposit was announced by Freeport on August 22, 1951. In its first full year (1954) the plant produced in excess of its rated 500,000 tons.\n\nGrand Isle\nGrand Isle was built (beginning on June 20, 1958) at a cost of $30 million of which $8 million represented the extra cost due to it being 7 miles off the coast of Grand Isle, Louisiana (it was the first ever offshore sulphur mine). The plant began operations on April 14, 1960. Its location in the general vicinity of Port Sulphur meant that the port was used as the transshipment hub for this mine. The offshore platform at a depth of 50 feet of water had an Y-shape, where the power plant on the far end was followed by a platform for living quarters and then the heliport, after which it bifurcated and led to 2 production platforms (the second was built in 1962 at a cost of $3.5 million), both of which allowed for 108 holes to be drilled directionally from 36 surface locations to a typical depth of 2,200 ft with a horizontal deviation of up to 1,250 ft and the holes thus fanned out into a kind of pyramid shape below each platform. The new mine was highly automated and originally required 75 workers to run. There were two groups where each alternately worked for 5 days and then rested 5 days. A special engineering feature was the 7 mile undersea molten sulphur pipeline which was buried 5 ft beneath the ocean floor. It consisted of a 14-inch outer diameter casing which enclosed a thermally insulating air volume and a 7+5⁄8-inch OD hot water pipeline which in turn contained a concentric 6-inch OD molten sulphur line. Outside of the 14-inch casing one pipe was attached for hot water return to the mine and one for fresh water supply to the mine (but salt water was pumped into the deposit). Sulphur entered the line at 320 °F and exited at the shore of Grand Isle at 280 °F from where it was shipped still in liquid form by barges to Port Sulphur. The original plant had a capacity of 2,500-3,300 tons of sulphur per day and a requirement for 13mmcfd of natural gas. The sulphur rights were obtained in 1956 from Humble Oil which retained a right to 50% of the profits. The former platform was turned into an artificial reef and is today totally submerged.\n\nMinor Sulphur Mines\nBay Ste. Elaine\nFreeport announced the development of a new process for the use of seawater in Frasch mining on February 18, 1952. Bay Ste. [Sainte] Elaine was a relatively small mine, but notable not only for the first use of salt water in a Frasch mine, but also for the mounting of the principle plant equipment on barges instead of dredging an artificial island, which was the solution chosen for the company's first Louisiana marshland mine (Grand Ecaille). The power plant on the main 200 ft long, 40 ft wide and 12 ft deep barge (photograph:) was installed at Grand Ecaille and towed in place. The barge was partially sunk and main deck level was 6.5 ft above the water line. The boilers ran on a fresh water cycle going through heat exchangers. Heat exchangers were of corrosion-resistant steel and salt water pipes had a cement lining. The plant was designed for parallel operation of 6 wells and rated at 100,000 long tons per year. Two 1,000 ton 1.5 million gallon 224 ft x 39 ft x 8ft5in insulated tank barges towed by a 800 hp twin-screw diesel towboat brought the molten sulphur to Port Sulphur, 75 miles and an optimal round trip delay of 36 hours away (i.e. 666 tons per day maximum average ferrying capacity on a tight schedule since mine operation was continuous). Bay Ste. Elaine required a workforce of 85 and 100 when including support personnel at Port Sulphur and Grand Ecaille. From the beginning it was accepted that the BSE operation may not actually be profitable. Texaco had leased the land covering the Bay Ste. Elaine, Dog Lake and Lake Pelto dome areas in 1928 from the Louisiana Land & Exploration Co. and had sublet some of it on February 27, 1951, to Freeport Sulphur. Louisiana Land and Texaco shared equally in a $2 per ton royalty and 40% of net profits.\n\nNash\nCommencement of operations was announced on February 2, 1954. The land was held in trust by the Kentucky Female Orphan School of Midway, Kentucky and the school received royalties. Even among the minor deposits, Nash was especially small.\n\nChacahoula\nOperations began on March 10, 1955.\n\nLake Pelto\nFull scale development began in June 1960. The plant for the most part was reused from the decommissioned Bay Ste. Elaine mine, including the 200 ft-barge-mobile-power-plant which was lifted to rest on a foundation on the Pelto artificial island. Like at Bay Ste. Elaine, sea water was pumped into the deposit. The drill site was 1 mile from the island base facilities. The field pipe line was installed at an elevation of 20 ft. Along this pipe line, 4,800 ft from the main island a prefabricated steel structure relay station and the relay tower from Bay Ste. Elaine mine were installed, the latter's height increased to 150 ft. From the communication station a further 2,560 ft of pipe led to the production area. The sulphur was brought in liquid form by barge to Port Sulphur.\n\nMetal mines\nCuban-American Manganese Corporation (1931–1947):\nThe Delaware company offered the first block of 140,000 no par common shares out of an authorized 250,000 in September 1928. The capital was increased to 350,000 authorized shares on February 14, 1931.\nThe Freeport Texas Co. announced on February 19, 1931, the acquisition of a controlling interest (resulting in 9 of 15 Board members) in the Cuban-American Manganese Corporation, owner of 10,000 acres of manganese deposits within 25 miles of Santiago adjacent to the Cuban Railway main line. A plant to process 1,000 tons a day of ore and produce 100,000 tons a year of 50% concentrate was to be constructed within one year. Before 1921 some of the properties were operated by Rand & Aguilara. A prior attempt to finish the plant by July 1929 was apparently not a success. The froth flotation process for concentrating the ore had been developed and tested at commercial scale by Freeport and the B. F. Goodrich Company, who were the principal minority shareholders in the Cuban company. Cuba was not an important producer of manganese and in fact the company worked the only commercially viable deposit in the country which was only viable because it was free from tariffs on import to the United States which heavily relied on importation of the metal. In July 1932 Cuban-American floated 700,000 shares of par $2 8% preferred stock, convertible to common one-for-one at any time. In 1932 Freeport bought additional shares for $699,327 out of its cash reserve. At the end of 1934 the investment stood at 313,621 preferred and 289,715.5 common shares (86.19% of voting shares) and was carried as the principal constituent of the Investments at Cost ($2,727,961) row in the balance sheet. The US-Brazilian trade agreement of February 2, 1935 lowered the manganese import duty by 50% and the plant had to shut down on May 1, 1935, due to the loss of competitive advantage, although the sorting and shipping of high grade ore was continued. The company invested $500,000 into a wet-processing sintering kiln process to increase efficiency and could reopen in early 1937. Total investment was estimated at $3,000,000. In 1941 the Metals Reserve Corp contracted for between 25,000 and 65,000 long tons of concentrate a year over 3 years and plant capacity was increased from 100,000 to 130,000 tons of >=50% concentrate per year. The plant could also produce an additional 50,000 tons of 39-40% concentrate. The company for the first time paid a dividend on its common stock (50 cents) on December 27, 1940. At the time there were 355,873 common shares outstanding and on January 15, 1941, all 594,127 shares of $2 par preferred stock were called unless converted to common stock at a rate of one-for-one before that date. Freeport Sulphur announced it would convert its entire holding of 95% of the preferred. In December 1946 depletion of the mine was imminent. The Cuban-American Manganese Corp was dissolved. For each 95 shares of the company one share of par $50 stock of the Cuban Mining Co. subsidiary was distributed from a total of 10,000 authorized and outstanding shares. Freeport Sulphur owned 94% of the shares of Manganese Corp and thus received 94% of the stock of Cuban Mining Co. Additionally each of the 950,000 shares received $4.958 in cash. Plans were set in motion to convert the plant to produce Portland cement, but this led nowhere and on August 12, 1947, it was announced that the Cuban Mining Co. would also be dissolved. Freeport received $30 per share on September 29, 1947, and $45 per share on October 31, 1947, from this liquidation. The liquidation value of both companies was thus $5,460,100.\nJerritt Canyon mine, near Elko, Nevada has produced over 8 million ounces of gold since 1981. Originally a joint venture of Freeport McMoRan (FCX) with FMC Corporation, then FMC Gold then Meridian Gold, Freeport's share of Jerritt Canyon was then sold to Independence Mining Co., a subsidiary of Minorco (an Anglo American Corporation subsidiary). Minorco later divested all its gold mining assets to AngloGold. AngloGold and Meridian Gold sold the mine to Queenstake Resources in 2003. In 2007 Queenstake and Yukon Gold Corp merged to become Yukon-Nevada Gold, which in 2012 became Veris Gold. Veris Gold operated under U.S. Bankruptcy Code and the Companies' Creditors Arrangement Act bankruptcy protections of Canada from June 9, 2014. Sprott Mining bought the concern after the Canadian bankruptcy court ordered Veris to sell its assets.\nIn May 2016 Freeport announced an agreement to sell its interests in TF Holdings to China Molybdenum Co., Ltd. (CMOC) for $2.65 billion in cash and possibly more if the average copper price rose enough to trigger the increase in the following 24 months. TF Holdings was a Bermuda holding company with indirect ownership of 80% of Tenke Fungurume Mine. Since FCX had owned 70% ownership of TF Holdings, the sale gave China Molybdenum a 56% interest in Tenke Fungurume Mine. The parties discussed including Kokkola refinery and Kisanfu Exploration in the sale, but did not agree on the terms to do so.\nIn December 2020, Freeport completed the sale of its interests in the Kisanfu undeveloped project in Democratic Republic of Congo to a wholly owned subsidiary of China Molybdenum Co., Ltd. for US$550 million.\n\nPast board members\nPast board members include Henry Kissinger, John Hay Whitney, Robert A. Lovett, Benno C. Schmidt Sr., Gus Long, Arleigh Burke, J. Stapleton Roy, Godfrey Rockefeller and his cousin-in-law, Jean Mauzé.\n\nControversies\nSafety record\nIn 2011, Freeport was fined by the U.S. Department of Labor's Mine Safety and Health Administration over the death of a miner. The 67-year-old man had fallen into a hole created by the removal of two steel gratings. It was concluded that Freeport had not done enough to indicate that the hole was there.\n\nGrasberg Mine\nThe company operates the world's largest and most profitable gold mine, the Grasberg mine in Papua, Indonesia.\nIn 2003, a landslide killed eight workers. A government study concluded that the incident was the result of negligence. Important warning signs had been detected two days prior. In response to this, management moved some equipment, but did not keep workers out of the area. A month later two workers died from being exposed to sulfur fumes. The government ultimately overturned its conclusion and attributed the incident to natural causes.\nIn 2005, The New York Times reported that the company paid local military and police generals, colonels, majors and captains, and military units, a total of nearly US$20 million between 1998 and 2004. One individual received up to US$150,000. The payments were meant to secure the reserve. The company responded that the payments did not go to individuals, but went into infrastructure, food, housing, fuel, travel, vehicle repairs, and allowances to cover incidental and administrative costs. According to the report, anonymous sources within the company claimed that company chairman James R. Moffet courted Indonesia's dictator Suharto and \"his cronies\", cutting them in on deals. Another employee is said to have worked on a program to monitor environmentalists' telephone and email conversations, in collaboration with Indonesian military intelligence officers.\nThe Grasberg mine's tailings \"severely impacted\" more than 11 square miles (28 km2) of rainforest, according to a 1996 Dames & Moore environmental audit. The report, endorsed by Freeport, also estimated that during the life of the mine 3.2 billion tons of waste rock – large components of which generate acid – would be dumped into the local river system. Overburden (waste rock) from the mine had already polluted a nearby lake due to acid mine drainage.\nCiting extensive, long-term and irreversible environmental damage in New Guinea, the Government Pension Fund of Norway excluded Freeport-McMoRan from its investment portfolio, following a recommendation from the fund's ethical council.\nIn 2013, a tunnel collapse killed 28 workers. The Freeport geological team claimed that the collapse at the Big Gossan tunnel was caused by erosion of the ceiling, brought about by the continuous infiltration of the limestone wallrocks by corrosive acidic groundwater. Freeport was accused of negligence by the Indonesian National Human Rights Commission.\n\nHuman rights record in Indonesia\nThe company is a signatory participant of the Voluntary Principles on Security and Human Rights. However, the company has been accused of funding the Indonesian government to secure its reserve through militaristic oppression of the native West Papuan people. Freeport has had a troubled relationship with the Amungme and Kamoro peoples since it arrived in Indonesia in 1967. Freeport allegedly damaged 30.000 hectares of the rainforest and two major rivers, on which they depend for their food, water, livelihoods, and traditions. Pressured by cultural and economic deterioration, there were numerous quarrels, between the tribes, Freeport, and the Indonesian military. Some unarmed natives were killed or tortured by the military, or became part of the Free Papua Movement insurgence.\n\nEnvironmental record\nBased on 2014 data, the Political Economy Research Institute ranked Freeport-McMoRan 13th among corporations emitting airborne pollutants in the U.S. The ranking is based on emission quantities and toxicity.\nAfter discovery of uranium and sulfate in the groundwater, Cyprus Tohono Corporation provided North Komelik residents with bottled water until 2003. In 2003, two new supply wells were installed six miles south of the village. The mine used various mining methods to process ore into copper, and these methods required a mix of chemical fluids. Workers disposed of these chemicals in two areas downhill from the mine in unlined ponds. As a result, the liquid chemicals seeped into the ground below the disposal area and polluted a groundwater drinking source known as the \"basin-fill aquifer\". The Tohono O'odham Nation, where the mine is located relies heavily upon groundwater to meet drinking water needs.\nOn October 15, 2009, the City of Blackwell filed suit against Freeport-McMoRan over the contamination caused by its Blackwell Zinc Smelter. The city considered the contamination a nuisance, and alleged that 58 million pounds of toxic waste remained in the city, causing illness within its 7,200 residents. The City of Blackwell and Freeport settled for $54M in February 2010. In 2012, Freeport agreed to a $119M settlement with the residents.\nIn April 2012, the US Department of Justice announced that Freeport McMoran would pay $6.8 million to settle federal and state charges pertaining to the toxic outflow from its Morenci mine in Arizona. According to the complaint waters, soils, habitats, and birds were either injured or lost as a result of the dangerous substances.\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Freeport-McMoRan Inc.: \nEarth Observatory Satellite Picture of Grasberg Mine\"",
  "clean_text": "Freeport-McMoRan Inc., often called Freeport, is an American mining company based in the Freeport-McMoRan Center, in Phoenix, Arizona. The company is the world's largest producer of molybdenum, a major copper producer and operates the world's largest gold mine, the Grasberg mine in Papua, Indonesia. During 2018 Freeport-McMoRan Copper & Gold along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. History Freeport Sulphur Company was founded July 12, 1912, by the eldest son of Svante Magnus \"E.M.\" Swenson, banker Eric Pierson Swenson, with a group of investors, to develop sulfur mining at Bryan Mound salt dome, along the US Gulf Coast. Freeport, Texas was also established in Nov. 1912 to house workers, and serve as a port for Houston, rivaling Galveston and Corpus Christi. Freeport mined sulfur along the Gulf Coast using the Frasch process, the patents for which had expired in 1908, a disruptive innovation for the automated mining of previously inaccessible sulphur deposits at a cost lower than that of established mines, where manual labor gained the mineral under the most appalling conditions. Previously, Union Sulphur Company founder and patent-holder Herman Frasch had enjoyed a monopoly on the process. The Bryan Mound salt dome just south of Freeport became the second Frasch sulphur mine in the world in 1912. Freeport Texas Company Enterprise to support Freeport Sulphur's business and the new town's infrastructure led to the incorporation of a holding company on September 30, 1913, to join the newer assets with Freeport Sulphur and create a vertically integrated mining company around, at first, a single sulphur mine. Officers of the new holding company, Freeport Texas Company, were: Eric. P. Swenson, President and Director (Freeport Sulphur founder, son of Swante M. Swenson) Edward E. Dickinson, vice-president and Director F.M. Altz, Secretary Swante M. Swenson, Treasurer (son of Eric P. Swenson) Charles H. Findlay, Auditor (son of Hugh Findlay and his third wife, Mary Ellen Smith) Directors Eric P. Swenson Edward E. Dickinson Richard H. Williams (son of Richard H. Williams) Harry K. Knapp Samuel McRoberts Charles P. Northrop Charles A. Stone Frank A. Vanderlip Sidell Tilghman (son of General Lloyd Tilghman) Eppa Hunton Jr. (son of late Virginia Senator, Brig. Gen. Eppa Hunton) Charles E. Herrmann On May 7, 1917, all 35,000 outstanding shares were exchanged for 500,000 new shares of no par value (at a rate of 14+2⁄7:1). The stock was listed on the NYSE since 1919. Freeport raised an additional $4 million with an April 1, 1922 issue of convertible bonds, almost all of which were converted to common stock right away. Of the new total of 732,000 authorized shares 729,844 were then outstanding. In 1933, the no par common stock was exchanged for $10 par common and $2,500,000 convertible preferred were issued to finance the development of Grande Ecaille, about half of which was converted, the remainder called for redemption in 1938 at the end of which 796,380 common shares were outstanding. To raise general working capital Freeport Sulphur in 1939 sold $3,000,000 in 3% 20-year private debentures to Metropolitan Life Insurance Co. and Sun Life Insurance Co. of Canada. On September 1, 1951, the 99th consecutive quarterly dividend was paid. Effective September 21, 1951 the 800,000 outstanding common shares were split 3-for-1 and the authorized capital was increased from 850,000 to 3,000,000 shares. On March 2, 1959, the 129th consecutive quarterly dividend was paid and effective May 5, 1959 the 2,504,850 outstanding shares were once again split 3-for-1 and the authorized capital was increased from 3,000,000 to 10,000,000 shares. Freeport Sulphur was on the Fortune 500 in 1955, 1956, 1957, 1967, 1968, 1969, 1970. In 1919, minority stockholders John R. Williams & Sons, First National Bank of Richmond, Virginia vice-president, W. M. Addison, Benjamin P Alsopp, E. L. Norton, and Samuel W. Travers solicited proxies to use at the April 5th annual stockholders' meeting, claiming, according to reports, that \"management has refused them adequate information regarding the property. President E.P. Swenson denies that information has been thus withheld and states that the board, which represents the dominant interests, has no vacancies at the present time.\" 1928–1931 shareholder proxy fight In 1928, shareholder and scion of one of the founding investment firms, John Langbourne Williams & Sons, Langbourne Meade Williams, Jr. launched a proxy fight for control of the company. In 1929, he then sought help from his former supervisor at Lee, Higginson & Co., J.T. Claiborne, who then enlisted clerk John Hay Whitney – who had become one of the wealthiest men in America following the 1927 death of his father, Payne Whitney. Williams eventually gained control of the company from founder Swenson, becoming its president in 1931, with Claiborne as a vice-president, and Whitney as chairman. Williams also served as chairman during 1958–1967. Williams led the company's diversification, beginning with the purchase of manganese deposits in Oriente Province, Cuba. 1930s The company announced on February 19, 1931, the acquisition of a controlling interest in the Cuban American Manganese Corporation. Most of the metal was gained by concentration of low grade ore. The company benefited from (was subsidized by) zero import duty at a time when duties were high despite the United States reliance on imports for most of its supply of manganese. The deposit was depleted and the company dissolved in 1947. In 1932, Freeport Sulphur Company acquired the sulfur rights for Lake Grande Ecaille and vicinity in Plaquemines Parish, Louisiana, and escalated the development of sulfur deposits in the Grand Ecaille dome in 1933, still using the Frasch Process developed by Dr. Herman Frasch, who had, in 1895, enjoined the American Sulphur Company into a partnership, forming the Union Sulphur Company, to initiate the first successful sulfur mining at Grand Ecaille, with which Freeport, like other competitors, would compete upon expiry of the Frasch patents in 1908. From its earliest inception, sulfur mining was the catalyst that developed Port Sulphur, Louisiana. Effective January 1, 1937 the Freeport Texas Company changed its name to Freeport Sulphur Company (the old one was dissolved) and its character from a holding company to an operating company, likely as a response to the Revenue Act of 1936 to avoid double taxation. On this occasion all active subsidiaries except the Cuban-American Manganese Corp were liquidated. 1950s Freeport announced on March 7, 1952, the development of 3 new sulphur mines at an estimated cost of $20 million, to be financed from accrued cash reserves, as part of the national defense industrial mobilization program (Korea War). The effort grew into a $25 million program covering 4 new mines, one major (Garden Isle Bay) and 3 minor (Bay Ste. Elaine, Nash, Chacahoula) with a combined new capacity of 750,000 long tons per year, in addition to the existing Hoskins Mound (closed in 1955) and Grand Ecaille mines. The company produced nickel during World War II and potash in the 1950s. In 1955, Freeport Nickel invested $119 million, of which $100 million came from the U.S. government, into construction of a nickel-cobalt mine at Moa Bay, Cuba, and a refinery at Port Nickel, Louisiana. On March 11, 1957, the U.S. government announced a contract to buy nickel and cobalt from the company. In 1956, the company formed the Freeport Oil Company. In 1958, the company sold an oil discovery near Lake Washington in Louisiana for approximately $100 million to Magnolia Petroleum Company. In 1959, Freeport geologists confirmed the 1936 Dutch discovery of the rich Ertsberg copper and gold deposits, now known as the Grasberg mine, in extremely rugged, remote country in the Jayawijaya Mountains in what was then called the Netherlands New Guinea. 1960s In 1960, Fidel Castro implemented a 25% ore tax, effectively nationalizing and seizing Freeport's nickel-mining operations in Cuba. In 1961, the company entered the kaolin business after purchasing the assets of Southern Clays Inc. In 1964, the company formed Freeport of Australia to pursue mining opportunities there and in the surrounding Pacific Ocean region. Development of the Ertsberg deposit In 1967, the company negotiated a contract with the Indonesian government to develop the Ertsberg deposit. In their feasibility study, Freeport geologists estimated that the orebody totaled 33 million tons averaging 2.5% copper, making it the largest above-ground copper deposit ever discovered. Construction of an open pit mine began in May 1970 and in mid-1973 the mine was declared fully operational. Officials at Bechtel, the primary project contractor, called mine development at Ertsberg \"the most difficult engineering project they had ever undertaken.\" The challenges included building a 101-kilometre (63 mi) long access road (a project that required boring kilometer long tunnels through two mountains) and constructing the world's longest single span aerial tramway. The tramways were needed to move people, supplies and ore because a 2,000-foot (610 m) cliff separates the Ertsberg mine (at 12,000 feet (3,700 m) elevation) from the mill (at 10,000 feet). Moving copper concentrate from that mill to the shipping port required installation of a 109-kilometre (68 mi) slurry pipeline – then the world's longest. Mine construction and startup cost about US$200 million. The Ertsberg project was an engineering marvel, but the mine's early financial performance was disappointing. Depressed copper prices and high operating costs kept profits marginal during the 1970s. In 1967 The McMoRan Oil and Gas Company was founded by three partners, William Kennon McWilliams Jr. (\"Mc\"), James Robert (Jim Bob) Moffett (\"Mo\"), who were both petroleum geologists, and Mack Rankin (\"Ran\"), a specialist in land-leasing and sales operations. In 1981, McMoRan would merge with Freeport Minerals, formerly Freeport Sulphur, to form Freeport-McMoRan. 1970s In 1971, the company changed its name to Freeport Minerals Company, (not to be confused with Freeport Minerals Corporation, founded in 1834). 1980s On April 7, 1981, Freeport Minerals Company merged with the McMoRan Oil and Gas Company. In 1981, the company formed a 70/30 joint venture with an affiliate of FMC Corporation to operate the Jerritt Canyon gold mine near Elko, Nevada. In 1985, the company headquarters moved to New Orleans, Louisiana. The company also sold a 25% interest in oil and gas assets primarily in the western United States to Britoil for $73.5 million. In 1989, the company sold about $1.5 billion in assets to finance development of the Grasberg mine and the Main Pass offshore sulfur-oil-gas deposit off Louisiana. 1990s In July 1995, the company completed the corporate spin-off, first announced in May 1994, of its entire interest in Freeport-McMoRan Copper & Gold, which owned the Grasberg mine. In 1995, RTZ, a predecessor of Rio Tinto Group, made a $450 million investment in the company. In 1997, IMC Global, a large fertilizer producer, acquired Freeport-McMoRan Inc., the former parent company that now owned the sulfur and fertilizer businesses, in a $750 million transaction. Shareholders of Freeport-McMoRan received shares of IMC Global. In 1997, the Indonesian government asked Freeport-McMoRan to substantiate the Canadian mining company Bre-X's claims of having found the largest gold mine ever discovered, in Borneo. Freeport announced that its prospective partner Bre-X did not have gold reserves at its Indonesian mine, as it had reported. Bre-X subsequently was exposed as a fraud and went bankrupt. In 1998, low commodity prices forced the company to suspend its dividend. 2000s In 2003, the company was subpoenaed as part of an investigation by anti-trust authorities in the United States, Canada, and Europe into price fixing in the copper industry. On March 19, 2007, the company acquired Phelps Dodge (for $25.9 Billion) and became the largest copper producer of any public company in the world. The corporate headquarters was moved from New Orleans, Louisiana to Phoenix, Arizona. 2010s In 2012, the company announced agreements to acquire affiliated companies McMoRan Exploration Company and Plains Exploration & Production Company for a total enterprise value of over $20 billion. The transaction added significantly to the company's petroleum assets. The transaction was criticized as a conflict of interest due to the common ownership of the companies. In 2015, the company paid a $137.5 million settlement to resolve claims that executives and directors had conflicts of interest that resulted in the company overpaying in that transaction. In 2014, the company sold its assets in the Eagle Ford shale to Encana for $3.1 billion. In 2015, the company announced job cuts at its Sierrita Mine in Arizona due to low copper and molybdenum prices. On December 28, 2015, the company announced that James R. Moffett would resign as chairman of the company and be replaced by Gerald J. Ford. Moffett received $16.1 million in severance pay and cash retirement plans totaling more than $63 million. Moffett continued to consult for the company for annual fees of $1.5 million. In May 2016, the company sold a 13% interest in its Morenci Mine to Sumitomo Group for $1 billion in cash. In 2016, Freeport sold its deepwater assets, including the Marlin TLP, and the Holstein and Horn Mountain spars, to Anadarko Petroleum. In August 2017, the company agreed to give a 51% interest in the Grasberg mine to the Government of Indonesia and build a smelter in exchange for a special permit to operate the mine until 2041. In 2018, the company ranked at number 176 on the Fortune 500 list. During this year, Indonesian President Joko Widodo also planned to take control of 51% of Freeport Indonesia's equity, effectively handing over Freeport control to the Indonesian government. The Indonesian government planned to settle payments of $3.85 billion during the takeover process and finalized the process on December 21, 2018. During 2018 Freeport-McMoRan Copper & Gold along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. Current operations Freeport is the world's largest producer of molybdenum, and one of the largest producers of copper. In 2019, 79% of its revenues were from the sale of copper, 11% were from the sale of gold, and 8% were from the sale of molybdenum. In 2019, sales to the company's copper refining joint venture in Gresik Regency accounted for 13% of the total revenues of the company. Some of the company's mining operations are as follows: Africa Freeport Cobalt held a 100% interest in Kisanfu, a copper and cobalt exploration project located near Tenke, Democratic Republic of the Congo. This subsidiary also owns a large cobalt refinery in Kokkola, Finland, along with a related sales and marketing business. FCX has an effective 56% of that enterprise. Negotiations in 2016 to include these cobalt projects in a sale to China Molybdenum of Tenke Fungurume Mine, a cobalt/copper mine in DRC Congo, were not successful. Instead, the Kisanfu mine was sold to China Molybdenum in a separate transaction in 2020. Europe In December 2019, Freeport Cobalt (a joint venture between Freeport-McMoRan and Lundin Mining) sold its cobalt refinery in Kokkola, Finland to Umicore. FCX held an effective 56% interest in that enterprise. North America Arizona Bagdad, Arizona – 100% owned (copper, molybdenum) Miami, Arizona – 100% owned (copper) Morenci, Arizona – 72% owned (copper) Safford mine, Safford, Arizona – 100% owned (copper) Sierrita mine, Arizona (includes Twin Buttes & Esperanza) – 100% owned (copper, molybdenum) Colorado Climax mine, Leadville, Colorado – 100% owned (molybdenum) Henderson molybdenum mine, Empire, Colorado – 100% owned (molybdenum) New Mexico Chino mine, Santa Rita, New Mexico – 100% owned (copper, molybdenum) Tyrone, New Mexico – 100% owned (copper) South America El Abra, Chile – 51% owned (copper) Cerro Verde, Peru – 54% owned (copper, molybdenum) Europe Atlantic Copper, Huelva, Spain – 100% owned copper refinery Indonesia Grasberg, Central Papua, Indonesia – 49% owned (copper, gold, silver) Past holdings Sulphur mines Bryan Mound A first demonstration run began on November 19, 1912, but the plant was quickly shut down again for adjustments. Operations were unsteady throughout 1913. In December one shipment of 730 tons was made to New York and the plant produced about 200 tons per week. The Bryan Mound was 25 feet tall. Five different companies had drilled about 16 holes into the mound in the search for oil, but found no hydrocarbons in commercially viable quantities and attached no value to the sulphur they encountered under the given conditions. During two years of prospecting and with total of $150,000 expended, the Freeport Sulphur syndicate drilled 11 holes, each of them showing sulphur at between 760 feet and 1,100 feet in the form of sulphur bearing limestone, dolomite and gypsum with some beds of pure sulphur up to 7 feet thick. The deposit was carried at a bit below $30,000,000 of estimated value in the 1918 balance sheet. Bryan Mound production was not entirely continuous. To reduce stockpiles, work was suspended from April 1, 1921 until May 1922 and then again from January 31, 1924 to May 15, 1925. During production periods not all of the plants were necessarily in operation. The four plants were built by Westinghouse, Church, Kerr & Co and together were considered to be among the largest oil burning installations in the world. Freeport Sulphur Co. was also prospecting for oil at Bryan Mound. They found a (decomposing) tree in January 1919 at a record-candidate depth of 2,883 ft. Hoskins Mound In 1923, Freeport started producing sulfur from Hoskins Mound in Brazoria County, Texas. The sulphur was obtained from a depth of between 900 and 1,300 feet. The plant equipment was purchased in 1918 intended to become the 5th plant at Bryanmound, but those plans were abandoned with the end of World War I. Temporary housing, water reservoirs and the excavation for the foundation were all completed before the first train brought cement to the construction site on October 7, 1922. The power plant of steel and brick construction had a 175 foot by 13 foot chimney and was completed on March 26, 1923, with the first turbogenerator already in service since March 10. In the beginning, oil was burned at the Hoskins Mound plant, transported by tank cars from Freeport, stored in 2x15,000bbl tanks and one 55,000bbl reserve tank. These 85,000bbl constituted about 2 months worth of supply (a little more than 1,400bpd). The power generation came from 6 batteries of 2x702hp Stirling boilers (ca. 8,400 hp total). Two 500kW turbogenerators supplied 2,200 volt 3-phase current for those water pumps some distance from the boiler house, the lights, and several auxiliary devices. Hoskins Mound was property of Texaco which received a $1 royalty per ton, as well as 50% of the profits until the time when Freeport had accumulated $2 million of the profit, at which point the contract (dated March 14, 1922) called for 70% of the profits to go to Texaco. The plant was built by Dwight P. Robinson & Co, which by then had absorbed Westinghouse, Church, Kerr & Co, builder of the Bryan Mound plants. Grand Ecaille Garden Island Bay Production started the first week of December 1953 (preliminary activity in November). with approximately 500,000 tons per year capacity, Garden Island Bay was the largest of 4 new mines brought online in Freeport's early 1950s expansion program and in fact the largest new mine in the entire industry since Grand Ecaille in 1933. It was built at a cost of $14 million in an isolated marshland, the only other industrial facility within a 75-mile radius was Freeport's own Grande Ecaille. With the area only a foot or two above sea level, to protect against flooding it was necessary to pour an above-ground foundation, some 16 feet high resting on concrete pilings driven into the ground. When finished the plant could only be reached by boat or seaplane. The power plant and the drill site were 1 mile apart. The sulphur was brought by barges in liquid form to Port Sulphur. Even though Freeport already had the capability to use salty water in its process, this was not used and instead 2 earthen reservoirs together 1 square mile in size and holding almost a billion gallons could satisfy the plants demand for 3.5 million gallons per day. The reservoirs were filled between February and June, when salt water intrusion into the Mississippi river was at its seasonal low point. The sulphur mining rights were obtained in the beginning of 1951 from Texaco, which retained 50% of the profits. The discovery of the deposit was announced by Freeport on August 22, 1951. In its first full year (1954) the plant produced in excess of its rated 500,000 tons. Grand Isle Grand Isle was built (beginning on June 20, 1958) at a cost of $30 million of which $8 million represented the extra cost due to it being 7 miles off the coast of Grand Isle, Louisiana (it was the first ever offshore sulphur mine). The plant began operations on April 14, 1960. Its location in the general vicinity of Port Sulphur meant that the port was used as the transshipment hub for this mine. The offshore platform at a depth of 50 feet of water had an Y-shape, where the power plant on the far end was followed by a platform for living quarters and then the heliport, after which it bifurcated and led to 2 production platforms (the second was built in 1962 at a cost of $3.5 million), both of which allowed for 108 holes to be drilled directionally from 36 surface locations to a typical depth of 2,200 ft with a horizontal deviation of up to 1,250 ft and the holes thus fanned out into a kind of pyramid shape below each platform. The new mine was highly automated and originally required 75 workers to run. There were two groups where each alternately worked for 5 days and then rested 5 days. A special engineering feature was the 7 mile undersea molten sulphur pipeline which was buried 5 ft beneath the ocean floor. It consisted of a 14-inch outer diameter casing which enclosed a thermally insulating air volume and a 7+5⁄8-inch OD hot water pipeline which in turn contained a concentric 6-inch OD molten sulphur line. Outside of the 14-inch casing one pipe was attached for hot water return to the mine and one for fresh water supply to the mine (but salt water was pumped into the deposit). Sulphur entered the line at 320 °F and exited at the shore of Grand Isle at 280 °F from where it was shipped still in liquid form by barges to Port Sulphur. The original plant had a capacity of 2,500-3,300 tons of sulphur per day and a requirement for 13mmcfd of natural gas. The sulphur rights were obtained in 1956 from Humble Oil which retained a right to 50% of the profits. The former platform was turned into an artificial reef and is today totally submerged. Minor Sulphur Mines Bay Ste. Elaine Freeport announced the development of a new process for the use of seawater in Frasch mining on February 18, 1952. Bay Ste. [Sainte] Elaine was a relatively small mine, but notable not only for the first use of salt water in a Frasch mine, but also for the mounting of the principle plant equipment on barges instead of dredging an artificial island, which was the solution chosen for the company's first Louisiana marshland mine (Grand Ecaille). The power plant on the main 200 ft long, 40 ft wide and 12 ft deep barge (photograph:) was installed at Grand Ecaille and towed in place. The barge was partially sunk and main deck level was 6.5 ft above the water line. The boilers ran on a fresh water cycle going through heat exchangers. Heat exchangers were of corrosion-resistant steel and salt water pipes had a cement lining. The plant was designed for parallel operation of 6 wells and rated at 100,000 long tons per year. Two 1,000 ton 1.5 million gallon 224 ft x 39 ft x 8ft5in insulated tank barges towed by a 800 hp twin-screw diesel towboat brought the molten sulphur to Port Sulphur, 75 miles and an optimal round trip delay of 36 hours away (i.e. 666 tons per day maximum average ferrying capacity on a tight schedule since mine operation was continuous). Bay Ste. Elaine required a workforce of 85 and 100 when including support personnel at Port Sulphur and Grand Ecaille. From the beginning it was accepted that the BSE operation may not actually be profitable. Texaco had leased the land covering the Bay Ste. Elaine, Dog Lake and Lake Pelto dome areas in 1928 from the Louisiana Land & Exploration Co. and had sublet some of it on February 27, 1951, to Freeport Sulphur. Louisiana Land and Texaco shared equally in a $2 per ton royalty and 40% of net profits. Nash Commencement of operations was announced on February 2, 1954. The land was held in trust by the Kentucky Female Orphan School of Midway, Kentucky and the school received royalties. Even among the minor deposits, Nash was especially small. Chacahoula Operations began on March 10, 1955. Lake Pelto Full scale development began in June 1960. The plant for the most part was reused from the decommissioned Bay Ste. Elaine mine, including the 200 ft-barge-mobile-power-plant which was lifted to rest on a foundation on the Pelto artificial island. Like at Bay Ste. Elaine, sea water was pumped into the deposit. The drill site was 1 mile from the island base facilities. The field pipe line was installed at an elevation of 20 ft. Along this pipe line, 4,800 ft from the main island a prefabricated steel structure relay station and the relay tower from Bay Ste. Elaine mine were installed, the latter's height increased to 150 ft. From the communication station a further 2,560 ft of pipe led to the production area. The sulphur was brought in liquid form by barge to Port Sulphur. Metal mines Cuban-American Manganese Corporation (1931–1947): The Delaware company offered the first block of 140,000 no par common shares out of an authorized 250,000 in September 1928. The capital was increased to 350,000 authorized shares on February 14, 1931. The Freeport Texas Co. announced on February 19, 1931, the acquisition of a controlling interest (resulting in 9 of 15 Board members) in the Cuban-American Manganese Corporation, owner of 10,000 acres of manganese deposits within 25 miles of Santiago adjacent to the Cuban Railway main line. A plant to process 1,000 tons a day of ore and produce 100,000 tons a year of 50% concentrate was to be constructed within one year. Before 1921 some of the properties were operated by Rand & Aguilara. A prior attempt to finish the plant by July 1929 was apparently not a success. The froth flotation process for concentrating the ore had been developed and tested at commercial scale by Freeport and the B. F. Goodrich Company, who were the principal minority shareholders in the Cuban company. Cuba was not an important producer of manganese and in fact the company worked the only commercially viable deposit in the country which was only viable because it was free from tariffs on import to the United States which heavily relied on importation of the metal. In July 1932 Cuban-American floated 700,000 shares of par $2 8% preferred stock, convertible to common one-for-one at any time. In 1932 Freeport bought additional shares for $699,327 out of its cash reserve. At the end of 1934 the investment stood at 313,621 preferred and 289,715.5 common shares (86.19% of voting shares) and was carried as the principal constituent of the Investments at Cost ($2,727,961) row in the balance sheet. The US-Brazilian trade agreement of February 2, 1935 lowered the manganese import duty by 50% and the plant had to shut down on May 1, 1935, due to the loss of competitive advantage, although the sorting and shipping of high grade ore was continued. The company invested $500,000 into a wet-processing sintering kiln process to increase efficiency and could reopen in early 1937. Total investment was estimated at $3,000,000. In 1941 the Metals Reserve Corp contracted for between 25,000 and 65,000 long tons of concentrate a year over 3 years and plant capacity was increased from 100,000 to 130,000 tons of >=50% concentrate per year. The plant could also produce an additional 50,000 tons of 39-40% concentrate. The company for the first time paid a dividend on its common stock (50 cents) on December 27, 1940. At the time there were 355,873 common shares outstanding and on January 15, 1941, all 594,127 shares of $2 par preferred stock were called unless converted to common stock at a rate of one-for-one before that date. Freeport Sulphur announced it would convert its entire holding of 95% of the preferred. In December 1946 depletion of the mine was imminent. The Cuban-American Manganese Corp was dissolved. For each 95 shares of the company one share of par $50 stock of the Cuban Mining Co. subsidiary was distributed from a total of 10,000 authorized and outstanding shares. Freeport Sulphur owned 94% of the shares of Manganese Corp and thus received 94% of the stock of Cuban Mining Co. Additionally each of the 950,000 shares received $4.958 in cash. Plans were set in motion to convert the plant to produce Portland cement, but this led nowhere and on August 12, 1947, it was announced that the Cuban Mining Co. would also be dissolved. Freeport received $30 per share on September 29, 1947, and $45 per share on October 31, 1947, from this liquidation. The liquidation value of both companies was thus $5,460,100. Jerritt Canyon mine, near Elko, Nevada has produced over 8 million ounces of gold since 1981. Originally a joint venture of Freeport McMoRan (FCX) with FMC Corporation, then FMC Gold then Meridian Gold, Freeport's share of Jerritt Canyon was then sold to Independence Mining Co., a subsidiary of Minorco (an Anglo American Corporation subsidiary). Minorco later divested all its gold mining assets to AngloGold. AngloGold and Meridian Gold sold the mine to Queenstake Resources in 2003. In 2007 Queenstake and Yukon Gold Corp merged to become Yukon-Nevada Gold, which in 2012 became Veris Gold. Veris Gold operated under U.S. Bankruptcy Code and the Companies' Creditors Arrangement Act bankruptcy protections of Canada from June 9, 2014. Sprott Mining bought the concern after the Canadian bankruptcy court ordered Veris to sell its assets. In May 2016 Freeport announced an agreement to sell its interests in TF Holdings to China Molybdenum Co., Ltd. (CMOC) for $2.65 billion in cash and possibly more if the average copper price rose enough to trigger the increase in the following 24 months. TF Holdings was a Bermuda holding company with indirect ownership of 80% of Tenke Fungurume Mine. Since FCX had owned 70% ownership of TF Holdings, the sale gave China Molybdenum a 56% interest in Tenke Fungurume Mine. The parties discussed including Kokkola refinery and Kisanfu Exploration in the sale, but did not agree on the terms to do so. In December 2020, Freeport completed the sale of its interests in the Kisanfu undeveloped project in Democratic Republic of Congo to a wholly owned subsidiary of China Molybdenum Co., Ltd. for US$550 million. Past board members Past board members include Henry Kissinger, John Hay Whitney, Robert A. Lovett, Benno C. Schmidt Sr., Gus Long, Arleigh Burke, J. Stapleton Roy, Godfrey Rockefeller and his cousin-in-law, Jean Mauzé. Controversies Safety record In 2011, Freeport was fined by the U.S. Department of Labor's Mine Safety and Health Administration over the death of a miner. The 67-year-old man had fallen into a hole created by the removal of two steel gratings. It was concluded that Freeport had not done enough to indicate that the hole was there. Grasberg Mine The company operates the world's largest and most profitable gold mine, the Grasberg mine in Papua, Indonesia. In 2003, a landslide killed eight workers. A government study concluded that the incident was the result of negligence. Important warning signs had been detected two days prior. In response to this, management moved some equipment, but did not keep workers out of the area. A month later two workers died from being exposed to sulfur fumes. The government ultimately overturned its conclusion and attributed the incident to natural causes. In 2005, The New York Times reported that the company paid local military and police generals, colonels, majors and captains, and military units, a total of nearly US$20 million between 1998 and 2004. One individual received up to US$150,000. The payments were meant to secure the reserve. The company responded that the payments did not go to individuals, but went into infrastructure, food, housing, fuel, travel, vehicle repairs, and allowances to cover incidental and administrative costs. According to the report, anonymous sources within the company claimed that company chairman James R. Moffet courted Indonesia's dictator Suharto and \"his cronies\", cutting them in on deals. Another employee is said to have worked on a program to monitor environmentalists' telephone and email conversations, in collaboration with Indonesian military intelligence officers. The Grasberg mine's tailings \"severely impacted\" more than 11 square miles (28 km2) of rainforest, according to a 1996 Dames & Moore environmental audit. The report, endorsed by Freeport, also estimated that during the life of the mine 3.2 billion tons of waste rock – large components of which generate acid – would be dumped into the local river system. Overburden (waste rock) from the mine had already polluted a nearby lake due to acid mine drainage. Citing extensive, long-term and irreversible environmental damage in New Guinea, the Government Pension Fund of Norway excluded Freeport-McMoRan from its investment portfolio, following a recommendation from the fund's ethical council. In 2013, a tunnel collapse killed 28 workers. The Freeport geological team claimed that the collapse at the Big Gossan tunnel was caused by erosion of the ceiling, brought about by the continuous infiltration of the limestone wallrocks by corrosive acidic groundwater. Freeport was accused of negligence by the Indonesian National Human Rights Commission. Human rights record in Indonesia The company is a signatory participant of the Voluntary Principles on Security and Human Rights. However, the company has been accused of funding the Indonesian government to secure its reserve through militaristic oppression of the native West Papuan people. Freeport has had a troubled relationship with the Amungme and Kamoro peoples since it arrived in Indonesia in 1967. Freeport allegedly damaged 30.000 hectares of the rainforest and two major rivers, on which they depend for their food, water, livelihoods, and traditions. Pressured by cultural and economic deterioration, there were numerous quarrels, between the tribes, Freeport, and the Indonesian military. Some unarmed natives were killed or tortured by the military, or became part of the Free Papua Movement insurgence. Environmental record Based on 2014 data, the Political Economy Research Institute ranked Freeport-McMoRan 13th among corporations emitting airborne pollutants in the U.S. The ranking is based on emission quantities and toxicity. After discovery of uranium and sulfate in the groundwater, Cyprus Tohono Corporation provided North Komelik residents with bottled water until 2003. In 2003, two new supply wells were installed six miles south of the village. The mine used various mining methods to process ore into copper, and these methods required a mix of chemical fluids. Workers disposed of these chemicals in two areas downhill from the mine in unlined ponds. As a result, the liquid chemicals seeped into the ground below the disposal area and polluted a groundwater drinking source known as the \"basin-fill aquifer\". The Tohono O'odham Nation, where the mine is located relies heavily upon groundwater to meet drinking water needs. On October 15, 2009, the City of Blackwell filed suit against Freeport-McMoRan over the contamination caused by its Blackwell Zinc Smelter. The city considered the contamination a nuisance, and alleged that 58 million pounds of toxic waste remained in the city, causing illness within its 7,200 residents. The City of Blackwell and Freeport settled for $54M in February 2010. In 2012, Freeport agreed to a $119M settlement with the residents. In April 2012, the US Department of Justice announced that Freeport McMoran would pay $6.8 million to settle federal and state charges pertaining to the toxic outflow from its Morenci mine in Arizona. According to the complaint waters, soils, habitats, and birds were either injured or lost as a result of the dangerous substances."
}