{
  "ticker": "FDS",
  "cik": "0001013237",
  "company_name": "FactSet",
  "corrected_name": "FactSet",
  "wiki_title_used": "FactSet",
  "exists": true,
  "raw_text": "FactSet Research Systems Inc., trading as FactSet, is an American financial data and software company headquartered in Norwalk, Connecticut, United States. The company provides integrated data and software. For fiscal year 2024, FactSet's total ASV and professional services revenues were $2.2 billion. FactSet's total market value is approximately $17 billion.\nFactSet provides client support & learning, implementation services, business advisory, data delivery, index services, portfolio data management, and transition services.\nFactSet's competitors include Bloomberg L.P., LSEG, and S&P Global.\n\nHistory\n1977–1980\nFactSet was founded by Howard Wille and Chuck Snyder in 1978. Their partnership began in 1977 when the two worked on Wall Street at Faulkner, Dawkins & Sullivan.\nAs computers became more prominent at the end of the 1970s, Wille and Snyder thought the industry was changing. When Shearson purchased Faulkner, Dawkins & Sullivan and the company started to expand, Wille and Snyder decided to set out on their own and test their idea for a company that could deliver computer-based financial information. At the time, companies had to purchase raw data directly from a vendor such as Compustat, then hire programmers to make the data user-friendly. Wille and Snyder's vision would offer usable data directly to the client.\nOriginally, all data was delivered to clients on paper, often by bike messenger. The original namesake product was a program called \"Company FactSet,\" which produced a four-page company analysis report using the Value Line database. Today, users access FactSet's private network via WAN, Internet, and wireless devices.\n\n1981–1989\nIn the early 1980s, FactSet had fewer than ten employees. In 1981, Snyder found a way to download data from the FactSet computer into Visicalc, allowing clients to retrieve data from a database directly into a spreadsheet. For the first time, several steps in the process were eliminated, making the data download process dramatically quicker.\nIn 1984, FactSet added limited screening capabilities, which were expanded in 1988 with the introduction of Universal Screening, which allowed users to stipulate their own screening criteria. Another development was the 1989 release of the company's Private Database Service. Users could now store proprietary data and integrate it with their own information to perform custom analysis.\nFormer Chairman Philip A. Hadley joined the company as a consultant in 1985.\n\n1990–2000\nIn 1990, FactSet for Windows was released. That same year, company headquarters moved from New York City to Greenwich, Connecticut.\nA London office opened in 1993, the first in Europe. The first Asia-Pacific office opened in Tokyo in 1995.\nBy the end of 1995, FactSet had fewer than 400 customers including 84 of the United States' top investment managers. The company changed its name in June 1995 to FactSet Research Systems Inc. in preparation for becoming a public company. The company began trading on the New York Stock Exchange in 1996 under the symbol FDS.\nIn 1997, the company released Portfolio Management Workstation, followed a year later by the Economic Analysis and Company Explorer applications.\nThe product became easier to use in 1998, with the release of the DIRECTIONS interface and the addition of Online Assistant, a web-based help and reference tool. FactSet introduced 24-hour live telephone support in 1999.\nWille retired from CEO and chairman in May 2000. Snyder served as interim CEO until September of that year, when Hadley was named the new CEO and chairman.\n\n2000–2009\nIn the early 2000s, new products included a portfolio returns product, SPAR (Style, Performance and Risk), that allowed portfolio managers to analyze the risks and performance of their own funds as well as compare them with peer funds; the Data Central application, which allowed subscribers to create and save their own time-series databases; and Marquee, which combined real-time news and stock quotes with security-level analysis. In 2004, the company's sell-side platform, IBCentral, was released.\nAlso in 2004, the company relocated headquarters and consolidated its three Connecticut offices to Norwalk, Connecticut. Sales topped the $200 million mark for the first time in 2002 and $500 million in 2008.\nIn 2008, FactSet acquired a copy of the Thomson Reuters WorldScope database, which it develops and markets as FactSet Fundamentals.\n\n2009–2015\nIn 2009, FactSet combined its DIRECTIONS, Marquee, and IBCentral platforms into one product, called FactSet. The platform combined the features of the previous platforms with new shared online workspaces and faster analytics. Also in 2009, FactSet integrated Data Explorers short selling data on the Factset Research Systems analytics platform.\nIn January 2010, FactSet and FirstRain announced a partnership that would allow FactSet clients to access FirstRain's web research engine that finds, filters, and analyzes unstructured business data available online.\nIn June 2008, FactSet completed the acquisition of the Thomson Fundamentals database.\nIn June 2010, FactSet acquired Market Metrics, a market research firm situated in the United States that is solely focused on surveys conducted on advisor and insurance products.\nHighlights of 2011 included the addition of a package for colleges and universities in January, the integration of Proquote trading functionality in April, and the addition of Trucost environmental research data in August.\nIn June 2012, FactSet acquired StreetAccount, which provides real-time company updates, portfolio and sector filtering, email alerts, and market summaries for investment professionals.\nIn 2013, FactSet acquired Revere Data, a provider of a line-of-business industry taxonomy, now branded FactSet Revere.\n\n2015–present\nOn February 9, 2015, FactSet acquired Code Red Inc, a provider of Research Management technology to the financial community.\nOn October 16, 2015, FactSet completed its acquisition of Portware, LLC, a multi-asset execution management system (EMS) provider.\nIn December 2016, FactSet acquired Vermilion Software, a client reporting software provider, and CYMBA Technologies, an order management system (OMS) provider.\nOn March 20, 2017, FactSet acquired BISAM, a performance and risk provider, strengthening its coverage of critical workflows throughout the portfolio lifecycle.\nOn April 3, 2017, FactSet strengthened its offering to the Wealth Management industry by completing its acquisition of Interactive Data Managed Solutions.\nIn 2018, FactSet extended its presence in Asia with a new office in Shanghai, celebrated 20 years in Australia and 40 years as a company, and declared strong revenue and EPS growth: \"We are proud to have reached many milestones in fiscal 2018. We celebrated 40 years as a company with 38 years of consecutive revenue growth and 22 years of consecutive adjusted EPS growth. This quarter we had the highest reported quarterly ASV in our history. We enter fiscal 2019 with strong momentum and an expanding suite of innovative workflow solutions to drive our growth plans,\" Phil Snow, FactSet CEO.\nIn 2018 FactSet also announced the launch of the Open:FactSet Marketplace, an online platform that offers both financial and alternative data from providers including Alexandria, Estimize, Genscape, and RepRisk.\nA key milestone for FactSet in 2018 was the selection to be the primary market data provider for Merrill Lynch Wealth Management (multi-year, enterprise level agreement including datafeeds). FactSet deployed its Market Data solution to more than 15,000 wealth management professionals across Merrill Lynch to provide complete multi-asset class content, analytics and global market data.\nIn 2020, FactSet acquired Truvalue Labs, a pioneer in AI-driven environmental, social, and governance (ESG) data. Truvalue Labs applies AI-driven technology to over 100,000 unstructured text sources in 13 languages, including news, trade journals, and nongovernmental organizations and industry reports, to provide daily signals that identify positive and negative ESG behavior. Its coverage spans over 20,000 public and private companies and generates short-term, long-term, and momentum scores derived from hundreds of signals. These signals are mapped against the Sustainability Accounting Standards Board (SASB) standards and United Nations Sustainable Development Goals (SDGs), allowing investors to evaluate ESG risk factors and real-world actions and impacts for quantitative analysis and back-testing. The company also works with its well-established Academic Research Network, which helps academic researchers use its data to study ESG trends and market-related behavior.\nIn October 2021, FactSet acquired Cobalt Software, a Boston-based provider of portfolio monitoring solutions.\nOn December 20, 2021, FactSet joined the S&P 500.\nOn December 27, 2021, FactSet announced its plans to acquire CUSIP Global Services, the exclusive provider of CUSIP and CINS identifiers globally and the official numbering agency for ISIN identifiers in the United States, from S&P Global for $1.925 billion in cash.\nIn February 2025, FactSet acquired LiquidityBook, a provider of cloud-based portfolio, order, and execution management systems, for $246.5 million.\n\nProducts and services\nProducts\nFactSet provides data and analytical applications to global buy and sell-side professionals, including portfolio managers, market research and performance analysts, risk managers, sell-side equity researchers, investment bankers, and fixed income professionals. FactSet's Workstation includes real-time news and quotes, company and portfolio analysis, multi-company comparisons, industry analysis, company screening, portfolio optimization and simulation, predictive risk measurements, alpha testing and tools to value and analyze fixed-income securities and portfolios.\nIn November 2020, FactSet furnished over 400 affinity databases and sought to restructure its foundation with inside the cloud to Amazon Web Services (AWS).\n\nFactSet Mercury\nLarge language-model based knowledge agent for digital workflows and fact-based decision making.\n\nIntelligent Platform Initiative\nConnects FactSet Mercury to FactSet AI-powered solutions.\n\nPitch Creator\nGenAI-powered solution for pitchbook creation for investment banks.\n\nLiquidityBook Acquisition\nAcquired in February 2025. LiquidityBook has cloud-based trading solutions for hedge funds, asset and wealth management, outsourced trading and sell-side middle office clients.\n\nTableTop Data (“LogoIntern”) Acquisition\nAcquired in March 2025. TableTop Data, Inc. (“LogoIntern”) is a workflow tool for junior bankers to add, organize and format logos into pitch decks.\n\nInvestor concerns\nThe company receives data from providers such as Barra, Dow Jones, Russell, and Lipper.\nSince contractual relationships with third-party vendors can be terminated with one year's notice, the company tries to maintain relationships with at least two vendors for each type of data. Since 2000, FactSet has made close to 15 acquisitions, seven of which have been content providers.\n\nManagement\nSanoke Viswanathan, Chief Executive Officer \nHelen Shan, Chief Financial Officer \nCatrina Harding, Chief People Officer \nGoran Skoko, Chief Revenue Officer \nKate Stepp, Chief Technology Officer \nKevin Toomey, Head of Investor Relations\n\nReferences\nExternal links\nOfficial website\nBusiness data for FactSet Research Systems Inc.:",
  "clean_text": "FactSet Research Systems Inc., trading as FactSet, is an American financial data and software company headquartered in Norwalk, Connecticut, United States. The company provides integrated data and software. For fiscal year 2024, FactSet's total ASV and professional services revenues were $2.2 billion. FactSet's total market value is approximately $17 billion. FactSet provides client support & learning, implementation services, business advisory, data delivery, index services, portfolio data management, and transition services. FactSet's competitors include Bloomberg L.P., LSEG, and S&P Global. History 1977–1980 FactSet was founded by Howard Wille and Chuck Snyder in 1978. Their partnership began in 1977 when the two worked on Wall Street at Faulkner, Dawkins & Sullivan. As computers became more prominent at the end of the 1970s, Wille and Snyder thought the industry was changing. When Shearson purchased Faulkner, Dawkins & Sullivan and the company started to expand, Wille and Snyder decided to set out on their own and test their idea for a company that could deliver computer-based financial information. At the time, companies had to purchase raw data directly from a vendor such as Compustat, then hire programmers to make the data user-friendly. Wille and Snyder's vision would offer usable data directly to the client. Originally, all data was delivered to clients on paper, often by bike messenger. The original namesake product was a program called \"Company FactSet,\" which produced a four-page company analysis report using the Value Line database. Today, users access FactSet's private network via WAN, Internet, and wireless devices. 1981–1989 In the early 1980s, FactSet had fewer than ten employees. In 1981, Snyder found a way to download data from the FactSet computer into Visicalc, allowing clients to retrieve data from a database directly into a spreadsheet. For the first time, several steps in the process were eliminated, making the data download process dramatically quicker. In 1984, FactSet added limited screening capabilities, which were expanded in 1988 with the introduction of Universal Screening, which allowed users to stipulate their own screening criteria. Another development was the 1989 release of the company's Private Database Service. Users could now store proprietary data and integrate it with their own information to perform custom analysis. Former Chairman Philip A. Hadley joined the company as a consultant in 1985. 1990–2000 In 1990, FactSet for Windows was released. That same year, company headquarters moved from New York City to Greenwich, Connecticut. A London office opened in 1993, the first in Europe. The first Asia-Pacific office opened in Tokyo in 1995. By the end of 1995, FactSet had fewer than 400 customers including 84 of the United States' top investment managers. The company changed its name in June 1995 to FactSet Research Systems Inc. in preparation for becoming a public company. The company began trading on the New York Stock Exchange in 1996 under the symbol FDS. In 1997, the company released Portfolio Management Workstation, followed a year later by the Economic Analysis and Company Explorer applications. The product became easier to use in 1998, with the release of the DIRECTIONS interface and the addition of Online Assistant, a web-based help and reference tool. FactSet introduced 24-hour live telephone support in 1999. Wille retired from CEO and chairman in May 2000. Snyder served as interim CEO until September of that year, when Hadley was named the new CEO and chairman. 2000–2009 In the early 2000s, new products included a portfolio returns product, SPAR (Style, Performance and Risk), that allowed portfolio managers to analyze the risks and performance of their own funds as well as compare them with peer funds; the Data Central application, which allowed subscribers to create and save their own time-series databases; and Marquee, which combined real-time news and stock quotes with security-level analysis. In 2004, the company's sell-side platform, IBCentral, was released. Also in 2004, the company relocated headquarters and consolidated its three Connecticut offices to Norwalk, Connecticut. Sales topped the $200 million mark for the first time in 2002 and $500 million in 2008. In 2008, FactSet acquired a copy of the Thomson Reuters WorldScope database, which it develops and markets as FactSet Fundamentals. 2009–2015 In 2009, FactSet combined its DIRECTIONS, Marquee, and IBCentral platforms into one product, called FactSet. The platform combined the features of the previous platforms with new shared online workspaces and faster analytics. Also in 2009, FactSet integrated Data Explorers short selling data on the Factset Research Systems analytics platform. In January 2010, FactSet and FirstRain announced a partnership that would allow FactSet clients to access FirstRain's web research engine that finds, filters, and analyzes unstructured business data available online. In June 2008, FactSet completed the acquisition of the Thomson Fundamentals database. In June 2010, FactSet acquired Market Metrics, a market research firm situated in the United States that is solely focused on surveys conducted on advisor and insurance products. Highlights of 2011 included the addition of a package for colleges and universities in January, the integration of Proquote trading functionality in April, and the addition of Trucost environmental research data in August. In June 2012, FactSet acquired StreetAccount, which provides real-time company updates, portfolio and sector filtering, email alerts, and market summaries for investment professionals. In 2013, FactSet acquired Revere Data, a provider of a line-of-business industry taxonomy, now branded FactSet Revere. 2015–present On February 9, 2015, FactSet acquired Code Red Inc, a provider of Research Management technology to the financial community. On October 16, 2015, FactSet completed its acquisition of Portware, LLC, a multi-asset execution management system (EMS) provider. In December 2016, FactSet acquired Vermilion Software, a client reporting software provider, and CYMBA Technologies, an order management system (OMS) provider. On March 20, 2017, FactSet acquired BISAM, a performance and risk provider, strengthening its coverage of critical workflows throughout the portfolio lifecycle. On April 3, 2017, FactSet strengthened its offering to the Wealth Management industry by completing its acquisition of Interactive Data Managed Solutions. In 2018, FactSet extended its presence in Asia with a new office in Shanghai, celebrated 20 years in Australia and 40 years as a company, and declared strong revenue and EPS growth: \"We are proud to have reached many milestones in fiscal 2018. We celebrated 40 years as a company with 38 years of consecutive revenue growth and 22 years of consecutive adjusted EPS growth. This quarter we had the highest reported quarterly ASV in our history. We enter fiscal 2019 with strong momentum and an expanding suite of innovative workflow solutions to drive our growth plans,\" Phil Snow, FactSet CEO. In 2018 FactSet also announced the launch of the Open:FactSet Marketplace, an online platform that offers both financial and alternative data from providers including Alexandria, Estimize, Genscape, and RepRisk. A key milestone for FactSet in 2018 was the selection to be the primary market data provider for Merrill Lynch Wealth Management (multi-year, enterprise level agreement including datafeeds). FactSet deployed its Market Data solution to more than 15,000 wealth management professionals across Merrill Lynch to provide complete multi-asset class content, analytics and global market data. In 2020, FactSet acquired Truvalue Labs, a pioneer in AI-driven environmental, social, and governance (ESG) data. Truvalue Labs applies AI-driven technology to over 100,000 unstructured text sources in 13 languages, including news, trade journals, and nongovernmental organizations and industry reports, to provide daily signals that identify positive and negative ESG behavior. Its coverage spans over 20,000 public and private companies and generates short-term, long-term, and momentum scores derived from hundreds of signals. These signals are mapped against the Sustainability Accounting Standards Board (SASB) standards and United Nations Sustainable Development Goals (SDGs), allowing investors to evaluate ESG risk factors and real-world actions and impacts for quantitative analysis and back-testing. The company also works with its well-established Academic Research Network, which helps academic researchers use its data to study ESG trends and market-related behavior. In October 2021, FactSet acquired Cobalt Software, a Boston-based provider of portfolio monitoring solutions. On December 20, 2021, FactSet joined the S&P 500. On December 27, 2021, FactSet announced its plans to acquire CUSIP Global Services, the exclusive provider of CUSIP and CINS identifiers globally and the official numbering agency for ISIN identifiers in the United States, from S&P Global for $1.925 billion in cash. In February 2025, FactSet acquired LiquidityBook, a provider of cloud-based portfolio, order, and execution management systems, for $246.5 million. Products and services Products FactSet provides data and analytical applications to global buy and sell-side professionals, including portfolio managers, market research and performance analysts, risk managers, sell-side equity researchers, investment bankers, and fixed income professionals. FactSet's Workstation includes real-time news and quotes, company and portfolio analysis, multi-company comparisons, industry analysis, company screening, portfolio optimization and simulation, predictive risk measurements, alpha testing and tools to value and analyze fixed-income securities and portfolios. In November 2020, FactSet furnished over 400 affinity databases and sought to restructure its foundation with inside the cloud to Amazon Web Services (AWS). FactSet Mercury Large language-model based knowledge agent for digital workflows and fact-based decision making. Intelligent Platform Initiative Connects FactSet Mercury to FactSet AI-powered solutions. Pitch Creator GenAI-powered solution for pitchbook creation for investment banks. LiquidityBook Acquisition Acquired in February 2025. LiquidityBook has cloud-based trading solutions for hedge funds, asset and wealth management, outsourced trading and sell-side middle office clients. TableTop Data (“LogoIntern”) Acquisition Acquired in March 2025. TableTop Data, Inc. (“LogoIntern”) is a workflow tool for junior bankers to add, organize and format logos into pitch decks. Investor concerns The company receives data from providers such as Barra, Dow Jones, Russell, and Lipper. Since contractual relationships with third-party vendors can be terminated with one year's notice, the company tries to maintain relationships with at least two vendors for each type of data. Since 2000, FactSet has made close to 15 acquisitions, seven of which have been content providers. Management Sanoke Viswanathan, Chief Executive Officer Helen Shan, Chief Financial Officer Catrina Harding, Chief People Officer Goran Skoko, Chief Revenue Officer Kate Stepp, Chief Technology Officer Kevin Toomey, Head of Investor Relations"
}