{
  "ticker": "FE",
  "cik": "0001031296",
  "company_name": "FirstEnergy",
  "corrected_name": "FirstEnergy",
  "wiki_title_used": "FirstEnergy",
  "exists": true,
  "raw_text": "FirstEnergy Corp. is an electric utility headquartered in Akron, Ohio. It was established when Ohio Edison merged with Centerior Energy in 1997. Its subsidiaries and affiliates are involved in distributing, transmitting, and generating electricity, energy management, and other energy-related services. Its ten electric utility operating companies comprise one of the United States' largest investor-owned utilities, based on serving 6 million customers within a 65,000-square-mile (170,000 km2) area of Ohio, Pennsylvania, West Virginia, Virginia, Maryland, New Jersey, and New York. In 2018, FirstEnergy ranked 219 on the Fortune 500 list of the largest public corporations in the United States by revenue.\nFirstEnergy has 3106.4 MW of energy generation capacity, with coal making up 99.2% of that capacity and solar power accounting for the remaining amount.\nOn July 21, 2020, Speaker of the Ohio House of Representatives, Larry Householder, former Ohio Republican Party Chairman Matt Borges, and three others were accused of accepting $60 million in bribes from FirstEnergy in exchange for $1.3 billion worth of benefits in the form of Ohio House Bill 6, as part of what became known as the Ohio nuclear bribery scandal. The stock price of the company plummeted within hours of the arrests being made. On July 22, 2021, the U.S. Attorney for the Southern District of Ohio announced that FirstEnergy would be fined $230 million for their part in the scandal. This was the largest criminal fine ever collected by the Southern District.\n\nHistory\nOhio Edison\nOhio Edison Company (formerly OEC on the NYSE) was a publicly traded holding company that began in 1930 with the consolidation of 200 electric companies. By 1950, it ended up with two utility operating companies, Pennsylvania Power and Ohio Edison. It continued in existence until 1997 when its merger with Centerior formed FirstEnergy.\n\nSubsidiaries\nIn 1944, the Pennsylvania Power Company became a subsidiary of Ohio Edison and is now one of the ten operating utilities.\nIn 1950, the Ohio Edison Company merged with the Ohio Public Service Company, which continued to operate under its new name. It is now one of the ten FirstEnergy operating companies and the main power provider for northeastern Ohio outside of Cleveland.\n\nCenterior\nCenterior Energy Corporation (formerly CX on the NYSE) was formed in 1986 from the affiliation of two public utilities. Centerior was based in Independence, Ohio and existed as a publicly traded holding company for ten years until its merger with Ohio Edison formed FirstEnergy in 1997:\n\nThe Cleveland Electric Illuminating Company, commonly known as The Illuminating Company (known locally as CEI), was a publicly traded utility company through 1986 until it affiliated with Toledo Edison to come under the control of Centerior. Having been formed in 1929, by 1940 it had become one of ten major direct subsidiaries of North American Company, which in turn had been one of the original 12 stocks listed in the Dow Jones Industrial Average. In 1978, Cleveland Electric Illuminating Company sought to buy Muny Light when Cleveland defaulted because bank credit was not extended without sale of the city's power company. The Nuclear Regulatory Commission charged Cleveland Electric Illuminating with a series of antitrust violations. It is one of three power companies serving Greater Cleveland, the others being city-owned Cleveland Public Power and Painesville Municipal Electric.\nToledo Edison Company (formerly TED on the NYSE) was a publicly traded utility company, until it affiliated with The Illuminating Company to form Centerior in 1986. It is the main power provider for northwestern Ohio.\n\nGPU\nGeneral Public Utilities (formerly GPU on the NYSE) was a publicly traded utility holding company in Parsippany, New Jersey. In 1996, the company was reorganized and renamed GPU, Inc. Also in 1996, it formed a new division, GPU Energy, which became the holding company for GPU's three utility operating companies:\n\nJersey Central Power and Light (JCP&L, serving most of central and northwestern New Jersey)\nPennsylvania Electric Company (Penelec, serving northern and central Pennsylvania)\nMetropolitan Edison (Met-Ed, serving eastern and south-central Pennsylvania)\nIn 2001, FirstEnergy, with its four utility operating companies, merged with GPU, Inc., folding GPU's three additional operating companies into FirstEnergy.\nThrough the 2001 acquisition of GPU, FirstEnergy also acquired MYR Group (formerly MYR on the NYSE), a subsidiary that GPU had created as a publicly traded company in the 1996 reorganization. MYR Group's services included installing and maintaining utility power lines and cellular telephone communications towers.\nGPU is best known as the former owner of the Three Mile Island nuclear plant. In 1989, Standley H. Hoch, a former executive with General Dynamics, became the CEO of GPU. Hoch had two main goals: cut costs and fight to repeal the Public Utility Holding Company Act of 1935, which made it difficult for utilities to operate across state lines.\n\nNortheast blackout of 2003\nOn Thursday, August 14, 2003, a widespread power outage across the Northeast and Midwest of the United States, as well as Ontario, affected 55 million people and left them without power until it was fully restored on August 16. The outage was attributed mostly to FirstEnergy's failure to trim the trees around its high voltage lines in a certain sector of Ohio; heat and extreme power needs caused the lines to sag, coming into contact with the trees and causing flashover.\n\nAllegheny Energy\nAllegheny Energy was an electric utility serving customers in Pennsylvania, West Virginia, Virginia, and Maryland. Its regulated subsidiaries were West Penn Power (serving Southwestern and Central Pennsylvania), Monongahela Power (a.k.a. \"Mon Power\", serving Northern and Southern West Virginia), and The Potomac Edison Company (western and central Maryland, parts of eastern West Virginia, and northern Virginia). The electric generating plants were operated by subsidiary Allegheny Energy Supply Company and Monongahela Power.\nBefore the formation of Allegheny Energy, the holding company was known as Allegheny Power System which had the three utility operating units. The brand name Allegheny Power was used on customer bills, trucks and company equipment starting in 1996. In 1997, the company attempted to merge with Pittsburgh-based Duquesne Light Company. The merger was withdrawn by both parties, and the companies did not merge. In 1999, Allegheny Power purchased the West Virginia operations of UtiliCorp United's West Virginia Power. UtiliCorp purchased Virginia Electric and Power Company's (present day Dominion Resources) West Virginia service area in 1986 and renamed the acquired service area as West Virginia Power.\nIn February 2010, Allegheny Energy announced plans to merge with FirstEnergy. The merger was approved by stockholders of both companies, by the Federal Energy Regulatory Commission, and by the regulatory commissions in Virginia, West Virginia, Maryland, and Pennsylvania. The merger was finalized when the Pennsylvania Public Utilities Commission approved the merger on February 24, 2011. The merger officially closed on February 25, 2011. The merger did not include Allegheny's service area in Virginia, which was purchased in 2010 by the Shenandoah Valley Electric Cooperative and the Rappahannock Electric Cooperative.\nAfter the merger with Allegheny Energy, FirstEnergy was the largest investor-owned electric utility in the country (based on customers served) for a short period, before the Exelon/Constellation and Duke Energy/Progress Energy mergers.\n\nFirstEnergy Formation\nFirstEnergy was formed on November 7, 1997, when Ohio Edison acquired Centerior Energy and its subsidiaries for $1.6 billion in stock. The company was acquired with plans for a restructuring and layoffs to cut costs. That same month the Public Utilities Commission of Ohio (PUCO) initiated an investigation into the reliability of FirstEnergy's energy transmission in the context of possible plant shutdowns and prior problems with Centerior.\n\nBankruptcy of FirstEnergy Services Corp. and formation of Energy Harbor Corp.\nFirstEnergy Services Corp. was incorporated on August 8, 1997, with the primary purpose of providing intracompany services, such as the operation of subsidiary generation companies and financial transactions. It underwent several mergers and fictitious name filings beginning with its first filed merger on March 31, 1998. As of September 1, 2001, FirstEnergy Services Corp. became FirstEnergy Solutions Corp.\nOn March 31, 2018, FirstEnergy Solutions Corp. filed for bankruptcy. FirstEnergy Solutions Corp. was a member of FirstEnergy Generation, LLC–itself a generation subsidiary of FirstEnergy Corp.–while FirstEnergy Corp. itself remained solvent. The case has been closely watched as it could have significant implications for the U.S. power sector. For instance, the U.S. Bankruptcy Court for the Northern District of Ohio has asserted its primacy over the Federal Energy Regulatory Commission (FERC) relating to some of FirstEnergy Solutions Corp.’s FERC-regulated power purchase agreements.\nFirstEnergy Solutions Corp. filed its eighth amended bankruptcy plan on October 14, 2019. In 2020, it emerged from bankruptcy. The company's post-bankruptcy fate was two-fold. First, the company was incorporated in Delaware under the name Energy Harbor Corp. and has since continued to operate in Ohio under the same name. For legal purposes, Energy Harbor Corp. is registered in Ohio as a foreign entity. Secondly regarding post-bankruptcy fate, FirstEnergy Solutions Corp. has also continued its existence as an actively chartered Ohio company, but this is only on paper rather than in practice: that entity does not conduct any business.\n\nIntent to exit non-regulated business\nFirstEnergy announced its intent in November 2016 to exit the competitive businesses while staying in the regulated businesses and also to become a fully regulated company during the following 18 months. FirstEnergy Solutions Corp., the company's then-competitive subsidiary, managed 13,000 MW of generating capacity and was a leading energy supplier serving residential, commercial and industrial customers in the Northeast, Midwest and Mid-Atlantic regions. It was anticipated that some generating units would be sold and that others would be shut down. Robert E. Murray, CEO of Murray Energy, warned in August 2017 that FirstEnergy Solutions Corp. was in danger of bankruptcy if the White House would not issue an emergency order to open coal-fired plants. The Federal Energy Regulatory Commission (FERC) unanimously rejected a United States Department of Energy (DOE) Notice of Proposed Rulemaking (NOPR) to subsidize coal and nuclear plants in January, 2018. FirstEnergy Solutions Corp. filed for Chapter 11 bankruptcy on March 31, 2018. As a result of the bankruptcy, FirstEnergy Solutions Corp. sought federal intervention of invoking Section 202(c) of the Federal Power Act to keep their plants operating.\n\nProposed power plant closures and bailout\nIn February 2018, FirstEnergy announced plans to deactivate or sell Pleasants Power Station in West Virginia. In March 2018, FirstEnergy announced the closure of Perry Nuclear Generating Station and Davis–Besse Nuclear Power Station, both in Ohio and the closure of Beaver Valley Nuclear Power Station in Pennsylvania. This was followed in August 2018 with the announcement of the closure of two coal-fired plants, the W.H. Sammis Power Plant in Stratton, Ohio and the Bruce Mansfield Power Plant in Shippingport, Pennsylvania by June 2022.\n\nHowever, the closure of the Perry, Davis–Besse, and Sammis plants were rescinded in July 2019 when the State of Ohio passed and signed into law a subsidy to support the Perry and Davis–Besse nuclear plants.\n\nRecent\nA 2019 report by the Institute on Taxation and Economic Policy found that FirstEnergy \"paid an effective federal tax rate of 0% or less\" as a result of the Tax Cuts and Jobs Act of 2017.\nDuring the COVID-19 pandemic in March 2020, the company stopped power shutoffs and restored connections for those whose power had been terminated because of non-payment. They also requested that customers who were facing hardship paying their utility bills contact the company to set up alternate payment programs, energy assistance programs or other energy arrangements, based on the customer's ability to pay. This included customers of all ten FirstEnergy utility companies in its entire six-state footprint.\nCharles E. Jones was the president and chief executive officer of FirstEnergy Corp. from 2015 until his termination on October 29, 2020. Steven E. Strah was acting chief executive officer until September 16, 2022, with John Somerhalder serving as interim CEO through June 1, 2023. On March 27, 2023, FirstEnergy Corp. announced Brian X. Tierney, a former executive at American Electric Power, as president and CEO of FirstEnergy Corp. His role became effective June 1, 2023.\nIn May 2023, FirstEnergy vacated their longtime headquarters in Downtown Akron along with their Brecksville offices to consolidate their operations in their West Akron campus.\n\nBribery scandal\nOn July 21, 2020, Speaker of the Ohio House of Representatives, Larry Householder, former Ohio Republican Party Chairman Matt Borges, and three others were accused of accepting $60 million in bribes from FirstEnergy in exchange for $1.3 billion worth of benefits in the form of Ohio House Bill 6, which increased electricity rates and provided that money as a $150 million per year bailout for the two above-mentioned nuclear plants (Perry and Davis–Besse). The stock price of the company plummeted within hours of the arrests being made. FirstEnergy denied involvement in the charges. State legislators quickly announced plans for a bill to repeal H.B. 6. Several organizations called on the Ohio Attorney General to begin revoking the charter of FirstEnergy.\nOn October 29, 2020, The Independent Review Committee of the Board of Directors of FirstEnergy Corp. announced a leadership transition, including the termination of the company's Chief Executive Officer, Charles E. Jones, effective immediately. FirstEnergy also announced on the same day the termination of two other executives: its Senior Vice President of Product Development, Marketing, and Branding; and its Senior Vice President of External Affairs, effective immediately. During the course of the company's previously disclosed internal review related to the government investigations, the Independent Review Committee of the Board determined that these executives violated certain FirstEnergy policies and its code of conduct. Concurrently, Steven E. Strah, President of FirstEnergy, has been appointed Acting Chief Executive Officer, effective immediately.\nOn July 22, 2021, Acting U.S. Attorney for the Southern District of Ohio, announced that FirstEnergy would be fined $230 million for its part in the scandal.\nThe bribery scandal ended up also affecting the company's major naming rights deal with the Cleveland Browns for FirstEnergy Stadium, which was originally to run from 2013 through the end of the 2029 NFL season. The Cleveland city council passed a resolution in June 2022 to urge FirstEnergy to relinquish the rights. At the time, the Browns nor FirstEnergy motioned that the agreement would be revoked. The Browns then announced on April 13, 2023, that the team and FirstEnergy had come to an agreement to immediately terminate the naming rights deal, restoring the name of the venue to Cleveland Browns Stadium.\n\nElectric companies\nOhio Edison (Northeastern Ohio)\nIlluminating Company (Northeastern Ohio)\nToledo Edison (Northwestern Ohio)\nMet-Ed (Eastern Pennsylvania)\nPenelec (Central and Northern Pennsylvania)\nPenn Power (Western Pennsylvania)\nWest Penn Power (Western and Central Pennsylvania)\nJersey Central Power & Light (Eastern and Northwestern New Jersey)\nMon Power (Northern West Virginia)\nPotomac Edison (Western Maryland and West Virginia panhandle)\n\nEnvironmental record\nIn 2024, FirstEnergy generated 15,665,952 MWh from coal in 2024 compared to 29,937 MWh from solar power. The company directly generated 13,905,260 metric tons of CO2 emissions from coal combustion and resulted in the emission of 16,004,265 metric tons through electricity purchases from other generation companies.\nA 2017 report conducted by the University of Massachusetts Amherst placed FirstEnergy as the country's ninth largest greenhouse gas polluter.\nIn 2008, FirstEnergy was required to pay US$1.5 billion by 2011 as part of a settlement to end a lawsuit filed by the United States Environmental Protection Agency. This lawsuit alleged that the company failed to install pollution control equipment when upgrading its coal-burning plants. Also as part of the settlement, major pollution control equipment was installed at the W. H. Sammis Power Plant and at other sites. This lawsuit was one of the New Source Review lawsuits filed in the 1990s.\nIn response, the company announced plans in April 2009 to modify its R.E. Burger Power Station in Shadyside, Ohio, to generate electricity with biomass instead of coal, but abandoned the project a year later. In November 2009, FirstEnergy purchased the rights to develop a compressed-air energy storage generation plant in Norton, Ohio, but suspended this plan in July 2013 citing market conditions.\nA study funded by the United States Department of Energytested carbon sequestration on one of the remaining coal units at R.E. Burger, which was less successful than expected, resulting in the sequestration of only 50 metric tons of CO2, compared to the 1.7 million tons of CO2 emitted in the previous year.\nIn 2008, Ohio lawmakers passed an energy efficiency standards law with the goal of reducing energy use by 22 percent by 2025. After four years of lobbying against the law, in November 2012, FirstEnergy temporarily suspended its \"behind-the-scene lobbying campaign\" to persuade lawmakers to gut the energy efficiency law. However, two years later the company supported\nthe 2014 Ohio Senate Bill 310 which reversed energy efficiency standards and cut their work on improving energy efficiency, despite stating the programs were cost-effective.\nFirstEnergy spent over $60 million to support House Bill 6, a 2019 law that raised electricity rates to provide subsidies for their power plants. Allegations of bribary  resulted in the Ohio nuclear bribery scandal. The subsidies ended in August 2025 after Ohio House Bill 15 was signed into law.\n\nLittle Blue Run\nSeveral cases have been brought against FirstEnergy for its dumping of coal waste into Little Blue Run Lake in West Virginia and Pennsylvania. FirstEnergy has dumped more than 20 billion gallons of coal ash and smokestack scrubber waste into the body of water which has contaminated local water supplies with arsenic, sulfates, sodium, calcium, magnesium and chloride.\nA July 2012 consent decree from the Pennsylvania Department of Environmental Protection forces FirstEnergy to close the Little Blue Run Lake, which is an unlined waste impoundment in Beaver County, Pennsylvania and Hancock County, West Virginia. FirstEnergy had piped coal ash waste slurry from its Bruce Mansfield Power Plant since 1974. The reservoir at Little Blue Run is the country's largest coal ash impoundment. Pollutants including sulfates, chlorides, and arsenic have been found in groundwater nearby. Per the consent decree, FirstEnergy must stop dumping coal ash at the site by 2016, pay a penalty of $800,000, provide clean water to local residents, and monitor the environment for signs of seeps for toxic pollutants including selenium, boron and arsenic.\n\nNotable accidents and incidents\nIn 2005, the NRC identified two earlier incidents at Davis–Besse as being among the top five events (excluding the actual disaster at Three Mile Island) most likely to have resulted in a nuclear disaster in the event of a subsequent failure.\nOn Friday, January 20, 2006, FirstEnergy acknowledged a cover-up of serious safety violations by former workers at the Davis–Besse Nuclear Power Station and accepted a plea bargain with the U.S. Department of Justice in lieu of possible federal criminal prosecution. The plea bargain relates to the March 2002 discovery of severe corrosion in the pressure vessel of the nuclear reactor, contained within the plant's containment building. In the agreement, the company agreed to pay fines of US$23 million, with an additional $5 million to be contributed toward research on alternative energy sources and to Habitat for Humanity, as well as to pay for costs related to the investigation. In addition, two former employees and one former contractor were indicted for purposely deceiving Nuclear Regulatory Commission inspectors in multiple documents (including one videotape) over several years, hiding evidence that boric acid was seriously corroding the reactor pressure vessel. The maximum penalty for each of the three indicted persons is 25 years in prison. The indictments also cite other employees as providing false information to inspectors, but they are not named.\nIn 2011, a 20-year employee was electrocuted to death when a supervisor ordered an unsafe operation. The parent company, FirstEnergy, and Ohio Edison were sued as a result, citing an intentional tort statute relating to \"the deliberate removal of a safety guard\".\n\nSee also\nGrid connection\nSmart grid\n\nReferences\nExternal links\nOfficial website\nFirstEnergyTV's channel on YouTube\nBusiness data for FirstEnergy Corp.:",
  "clean_text": "FirstEnergy Corp. is an electric utility headquartered in Akron, Ohio. It was established when Ohio Edison merged with Centerior Energy in 1997. Its subsidiaries and affiliates are involved in distributing, transmitting, and generating electricity, energy management, and other energy-related services. Its ten electric utility operating companies comprise one of the United States' largest investor-owned utilities, based on serving 6 million customers within a 65,000-square-mile (170,000 km2) area of Ohio, Pennsylvania, West Virginia, Virginia, Maryland, New Jersey, and New York. In 2018, FirstEnergy ranked 219 on the Fortune 500 list of the largest public corporations in the United States by revenue. FirstEnergy has 3106.4 MW of energy generation capacity, with coal making up 99.2% of that capacity and solar power accounting for the remaining amount. On July 21, 2020, Speaker of the Ohio House of Representatives, Larry Householder, former Ohio Republican Party Chairman Matt Borges, and three others were accused of accepting $60 million in bribes from FirstEnergy in exchange for $1.3 billion worth of benefits in the form of Ohio House Bill 6, as part of what became known as the Ohio nuclear bribery scandal. The stock price of the company plummeted within hours of the arrests being made. On July 22, 2021, the U.S. Attorney for the Southern District of Ohio announced that FirstEnergy would be fined $230 million for their part in the scandal. This was the largest criminal fine ever collected by the Southern District. History Ohio Edison Ohio Edison Company (formerly OEC on the NYSE) was a publicly traded holding company that began in 1930 with the consolidation of 200 electric companies. By 1950, it ended up with two utility operating companies, Pennsylvania Power and Ohio Edison. It continued in existence until 1997 when its merger with Centerior formed FirstEnergy. Subsidiaries In 1944, the Pennsylvania Power Company became a subsidiary of Ohio Edison and is now one of the ten operating utilities. In 1950, the Ohio Edison Company merged with the Ohio Public Service Company, which continued to operate under its new name. It is now one of the ten FirstEnergy operating companies and the main power provider for northeastern Ohio outside of Cleveland. Centerior Centerior Energy Corporation (formerly CX on the NYSE) was formed in 1986 from the affiliation of two public utilities. Centerior was based in Independence, Ohio and existed as a publicly traded holding company for ten years until its merger with Ohio Edison formed FirstEnergy in 1997: The Cleveland Electric Illuminating Company, commonly known as The Illuminating Company (known locally as CEI), was a publicly traded utility company through 1986 until it affiliated with Toledo Edison to come under the control of Centerior. Having been formed in 1929, by 1940 it had become one of ten major direct subsidiaries of North American Company, which in turn had been one of the original 12 stocks listed in the Dow Jones Industrial Average. In 1978, Cleveland Electric Illuminating Company sought to buy Muny Light when Cleveland defaulted because bank credit was not extended without sale of the city's power company. The Nuclear Regulatory Commission charged Cleveland Electric Illuminating with a series of antitrust violations. It is one of three power companies serving Greater Cleveland, the others being city-owned Cleveland Public Power and Painesville Municipal Electric. Toledo Edison Company (formerly TED on the NYSE) was a publicly traded utility company, until it affiliated with The Illuminating Company to form Centerior in 1986. It is the main power provider for northwestern Ohio. GPU General Public Utilities (formerly GPU on the NYSE) was a publicly traded utility holding company in Parsippany, New Jersey. In 1996, the company was reorganized and renamed GPU, Inc. Also in 1996, it formed a new division, GPU Energy, which became the holding company for GPU's three utility operating companies: Jersey Central Power and Light (JCP&L, serving most of central and northwestern New Jersey) Pennsylvania Electric Company (Penelec, serving northern and central Pennsylvania) Metropolitan Edison (Met-Ed, serving eastern and south-central Pennsylvania) In 2001, FirstEnergy, with its four utility operating companies, merged with GPU, Inc., folding GPU's three additional operating companies into FirstEnergy. Through the 2001 acquisition of GPU, FirstEnergy also acquired MYR Group (formerly MYR on the NYSE), a subsidiary that GPU had created as a publicly traded company in the 1996 reorganization. MYR Group's services included installing and maintaining utility power lines and cellular telephone communications towers. GPU is best known as the former owner of the Three Mile Island nuclear plant. In 1989, Standley H. Hoch, a former executive with General Dynamics, became the CEO of GPU. Hoch had two main goals: cut costs and fight to repeal the Public Utility Holding Company Act of 1935, which made it difficult for utilities to operate across state lines. Northeast blackout of 2003 On Thursday, August 14, 2003, a widespread power outage across the Northeast and Midwest of the United States, as well as Ontario, affected 55 million people and left them without power until it was fully restored on August 16. The outage was attributed mostly to FirstEnergy's failure to trim the trees around its high voltage lines in a certain sector of Ohio; heat and extreme power needs caused the lines to sag, coming into contact with the trees and causing flashover. Allegheny Energy Allegheny Energy was an electric utility serving customers in Pennsylvania, West Virginia, Virginia, and Maryland. Its regulated subsidiaries were West Penn Power (serving Southwestern and Central Pennsylvania), Monongahela Power (a.k.a. \"Mon Power\", serving Northern and Southern West Virginia), and The Potomac Edison Company (western and central Maryland, parts of eastern West Virginia, and northern Virginia). The electric generating plants were operated by subsidiary Allegheny Energy Supply Company and Monongahela Power. Before the formation of Allegheny Energy, the holding company was known as Allegheny Power System which had the three utility operating units. The brand name Allegheny Power was used on customer bills, trucks and company equipment starting in 1996. In 1997, the company attempted to merge with Pittsburgh-based Duquesne Light Company. The merger was withdrawn by both parties, and the companies did not merge. In 1999, Allegheny Power purchased the West Virginia operations of UtiliCorp United's West Virginia Power. UtiliCorp purchased Virginia Electric and Power Company's (present day Dominion Resources) West Virginia service area in 1986 and renamed the acquired service area as West Virginia Power. In February 2010, Allegheny Energy announced plans to merge with FirstEnergy. The merger was approved by stockholders of both companies, by the Federal Energy Regulatory Commission, and by the regulatory commissions in Virginia, West Virginia, Maryland, and Pennsylvania. The merger was finalized when the Pennsylvania Public Utilities Commission approved the merger on February 24, 2011. The merger officially closed on February 25, 2011. The merger did not include Allegheny's service area in Virginia, which was purchased in 2010 by the Shenandoah Valley Electric Cooperative and the Rappahannock Electric Cooperative. After the merger with Allegheny Energy, FirstEnergy was the largest investor-owned electric utility in the country (based on customers served) for a short period, before the Exelon/Constellation and Duke Energy/Progress Energy mergers. FirstEnergy Formation FirstEnergy was formed on November 7, 1997, when Ohio Edison acquired Centerior Energy and its subsidiaries for $1.6 billion in stock. The company was acquired with plans for a restructuring and layoffs to cut costs. That same month the Public Utilities Commission of Ohio (PUCO) initiated an investigation into the reliability of FirstEnergy's energy transmission in the context of possible plant shutdowns and prior problems with Centerior. Bankruptcy of FirstEnergy Services Corp. and formation of Energy Harbor Corp. FirstEnergy Services Corp. was incorporated on August 8, 1997, with the primary purpose of providing intracompany services, such as the operation of subsidiary generation companies and financial transactions. It underwent several mergers and fictitious name filings beginning with its first filed merger on March 31, 1998. As of September 1, 2001, FirstEnergy Services Corp. became FirstEnergy Solutions Corp. On March 31, 2018, FirstEnergy Solutions Corp. filed for bankruptcy. FirstEnergy Solutions Corp. was a member of FirstEnergy Generation, LLC–itself a generation subsidiary of FirstEnergy Corp.–while FirstEnergy Corp. itself remained solvent. The case has been closely watched as it could have significant implications for the U.S. power sector. For instance, the U.S. Bankruptcy Court for the Northern District of Ohio has asserted its primacy over the Federal Energy Regulatory Commission (FERC) relating to some of FirstEnergy Solutions Corp.’s FERC-regulated power purchase agreements. FirstEnergy Solutions Corp. filed its eighth amended bankruptcy plan on October 14, 2019. In 2020, it emerged from bankruptcy. The company's post-bankruptcy fate was two-fold. First, the company was incorporated in Delaware under the name Energy Harbor Corp. and has since continued to operate in Ohio under the same name. For legal purposes, Energy Harbor Corp. is registered in Ohio as a foreign entity. Secondly regarding post-bankruptcy fate, FirstEnergy Solutions Corp. has also continued its existence as an actively chartered Ohio company, but this is only on paper rather than in practice: that entity does not conduct any business. Intent to exit non-regulated business FirstEnergy announced its intent in November 2016 to exit the competitive businesses while staying in the regulated businesses and also to become a fully regulated company during the following 18 months. FirstEnergy Solutions Corp., the company's then-competitive subsidiary, managed 13,000 MW of generating capacity and was a leading energy supplier serving residential, commercial and industrial customers in the Northeast, Midwest and Mid-Atlantic regions. It was anticipated that some generating units would be sold and that others would be shut down. Robert E. Murray, CEO of Murray Energy, warned in August 2017 that FirstEnergy Solutions Corp. was in danger of bankruptcy if the White House would not issue an emergency order to open coal-fired plants. The Federal Energy Regulatory Commission (FERC) unanimously rejected a United States Department of Energy (DOE) Notice of Proposed Rulemaking (NOPR) to subsidize coal and nuclear plants in January, 2018. FirstEnergy Solutions Corp. filed for Chapter 11 bankruptcy on March 31, 2018. As a result of the bankruptcy, FirstEnergy Solutions Corp. sought federal intervention of invoking Section 202(c) of the Federal Power Act to keep their plants operating. Proposed power plant closures and bailout In February 2018, FirstEnergy announced plans to deactivate or sell Pleasants Power Station in West Virginia. In March 2018, FirstEnergy announced the closure of Perry Nuclear Generating Station and Davis–Besse Nuclear Power Station, both in Ohio and the closure of Beaver Valley Nuclear Power Station in Pennsylvania. This was followed in August 2018 with the announcement of the closure of two coal-fired plants, the W.H. Sammis Power Plant in Stratton, Ohio and the Bruce Mansfield Power Plant in Shippingport, Pennsylvania by June 2022. However, the closure of the Perry, Davis–Besse, and Sammis plants were rescinded in July 2019 when the State of Ohio passed and signed into law a subsidy to support the Perry and Davis–Besse nuclear plants. Recent A 2019 report by the Institute on Taxation and Economic Policy found that FirstEnergy \"paid an effective federal tax rate of 0% or less\" as a result of the Tax Cuts and Jobs Act of 2017. During the COVID-19 pandemic in March 2020, the company stopped power shutoffs and restored connections for those whose power had been terminated because of non-payment. They also requested that customers who were facing hardship paying their utility bills contact the company to set up alternate payment programs, energy assistance programs or other energy arrangements, based on the customer's ability to pay. This included customers of all ten FirstEnergy utility companies in its entire six-state footprint. Charles E. Jones was the president and chief executive officer of FirstEnergy Corp. from 2015 until his termination on October 29, 2020. Steven E. Strah was acting chief executive officer until September 16, 2022, with John Somerhalder serving as interim CEO through June 1, 2023. On March 27, 2023, FirstEnergy Corp. announced Brian X. Tierney, a former executive at American Electric Power, as president and CEO of FirstEnergy Corp. His role became effective June 1, 2023. In May 2023, FirstEnergy vacated their longtime headquarters in Downtown Akron along with their Brecksville offices to consolidate their operations in their West Akron campus. Bribery scandal On July 21, 2020, Speaker of the Ohio House of Representatives, Larry Householder, former Ohio Republican Party Chairman Matt Borges, and three others were accused of accepting $60 million in bribes from FirstEnergy in exchange for $1.3 billion worth of benefits in the form of Ohio House Bill 6, which increased electricity rates and provided that money as a $150 million per year bailout for the two above-mentioned nuclear plants (Perry and Davis–Besse). The stock price of the company plummeted within hours of the arrests being made. FirstEnergy denied involvement in the charges. State legislators quickly announced plans for a bill to repeal H.B. 6. Several organizations called on the Ohio Attorney General to begin revoking the charter of FirstEnergy. On October 29, 2020, The Independent Review Committee of the Board of Directors of FirstEnergy Corp. announced a leadership transition, including the termination of the company's Chief Executive Officer, Charles E. Jones, effective immediately. FirstEnergy also announced on the same day the termination of two other executives: its Senior Vice President of Product Development, Marketing, and Branding; and its Senior Vice President of External Affairs, effective immediately. During the course of the company's previously disclosed internal review related to the government investigations, the Independent Review Committee of the Board determined that these executives violated certain FirstEnergy policies and its code of conduct. Concurrently, Steven E. Strah, President of FirstEnergy, has been appointed Acting Chief Executive Officer, effective immediately. On July 22, 2021, Acting U.S. Attorney for the Southern District of Ohio, announced that FirstEnergy would be fined $230 million for its part in the scandal. The bribery scandal ended up also affecting the company's major naming rights deal with the Cleveland Browns for FirstEnergy Stadium, which was originally to run from 2013 through the end of the 2029 NFL season. The Cleveland city council passed a resolution in June 2022 to urge FirstEnergy to relinquish the rights. At the time, the Browns nor FirstEnergy motioned that the agreement would be revoked. The Browns then announced on April 13, 2023, that the team and FirstEnergy had come to an agreement to immediately terminate the naming rights deal, restoring the name of the venue to Cleveland Browns Stadium. Electric companies Ohio Edison (Northeastern Ohio) Illuminating Company (Northeastern Ohio) Toledo Edison (Northwestern Ohio) Met-Ed (Eastern Pennsylvania) Penelec (Central and Northern Pennsylvania) Penn Power (Western Pennsylvania) West Penn Power (Western and Central Pennsylvania) Jersey Central Power & Light (Eastern and Northwestern New Jersey) Mon Power (Northern West Virginia) Potomac Edison (Western Maryland and West Virginia panhandle) Environmental record In 2024, FirstEnergy generated 15,665,952 MWh from coal in 2024 compared to 29,937 MWh from solar power. The company directly generated 13,905,260 metric tons of CO2 emissions from coal combustion and resulted in the emission of 16,004,265 metric tons through electricity purchases from other generation companies. A 2017 report conducted by the University of Massachusetts Amherst placed FirstEnergy as the country's ninth largest greenhouse gas polluter. In 2008, FirstEnergy was required to pay US$1.5 billion by 2011 as part of a settlement to end a lawsuit filed by the United States Environmental Protection Agency. This lawsuit alleged that the company failed to install pollution control equipment when upgrading its coal-burning plants. Also as part of the settlement, major pollution control equipment was installed at the W. H. Sammis Power Plant and at other sites. This lawsuit was one of the New Source Review lawsuits filed in the 1990s. In response, the company announced plans in April 2009 to modify its R.E. Burger Power Station in Shadyside, Ohio, to generate electricity with biomass instead of coal, but abandoned the project a year later. In November 2009, FirstEnergy purchased the rights to develop a compressed-air energy storage generation plant in Norton, Ohio, but suspended this plan in July 2013 citing market conditions. A study funded by the United States Department of Energytested carbon sequestration on one of the remaining coal units at R.E. Burger, which was less successful than expected, resulting in the sequestration of only 50 metric tons of CO2, compared to the 1.7 million tons of CO2 emitted in the previous year. In 2008, Ohio lawmakers passed an energy efficiency standards law with the goal of reducing energy use by 22 percent by 2025. After four years of lobbying against the law, in November 2012, FirstEnergy temporarily suspended its \"behind-the-scene lobbying campaign\" to persuade lawmakers to gut the energy efficiency law. However, two years later the company supported the 2014 Ohio Senate Bill 310 which reversed energy efficiency standards and cut their work on improving energy efficiency, despite stating the programs were cost-effective. FirstEnergy spent over $60 million to support House Bill 6, a 2019 law that raised electricity rates to provide subsidies for their power plants. Allegations of bribary resulted in the Ohio nuclear bribery scandal. The subsidies ended in August 2025 after Ohio House Bill 15 was signed into law. Little Blue Run Several cases have been brought against FirstEnergy for its dumping of coal waste into Little Blue Run Lake in West Virginia and Pennsylvania. FirstEnergy has dumped more than 20 billion gallons of coal ash and smokestack scrubber waste into the body of water which has contaminated local water supplies with arsenic, sulfates, sodium, calcium, magnesium and chloride. A July 2012 consent decree from the Pennsylvania Department of Environmental Protection forces FirstEnergy to close the Little Blue Run Lake, which is an unlined waste impoundment in Beaver County, Pennsylvania and Hancock County, West Virginia. FirstEnergy had piped coal ash waste slurry from its Bruce Mansfield Power Plant since 1974. The reservoir at Little Blue Run is the country's largest coal ash impoundment. Pollutants including sulfates, chlorides, and arsenic have been found in groundwater nearby. Per the consent decree, FirstEnergy must stop dumping coal ash at the site by 2016, pay a penalty of $800,000, provide clean water to local residents, and monitor the environment for signs of seeps for toxic pollutants including selenium, boron and arsenic. Notable accidents and incidents In 2005, the NRC identified two earlier incidents at Davis–Besse as being among the top five events (excluding the actual disaster at Three Mile Island) most likely to have resulted in a nuclear disaster in the event of a subsequent failure. On Friday, January 20, 2006, FirstEnergy acknowledged a cover-up of serious safety violations by former workers at the Davis–Besse Nuclear Power Station and accepted a plea bargain with the U.S. Department of Justice in lieu of possible federal criminal prosecution. The plea bargain relates to the March 2002 discovery of severe corrosion in the pressure vessel of the nuclear reactor, contained within the plant's containment building. In the agreement, the company agreed to pay fines of US$23 million, with an additional $5 million to be contributed toward research on alternative energy sources and to Habitat for Humanity, as well as to pay for costs related to the investigation. In addition, two former employees and one former contractor were indicted for purposely deceiving Nuclear Regulatory Commission inspectors in multiple documents (including one videotape) over several years, hiding evidence that boric acid was seriously corroding the reactor pressure vessel. The maximum penalty for each of the three indicted persons is 25 years in prison. The indictments also cite other employees as providing false information to inspectors, but they are not named. In 2011, a 20-year employee was electrocuted to death when a supervisor ordered an unsafe operation. The parent company, FirstEnergy, and Ohio Edison were sued as a result, citing an intentional tort statute relating to \"the deliberate removal of a safety guard\"."
}