{
  "ticker": "FFIV",
  "cik": "0001048695",
  "company_name": "F5, Inc.",
  "corrected_name": "F5, Inc.",
  "wiki_title_used": "F5, Inc.",
  "exists": true,
  "raw_text": "F5, Inc. is an American technology company specializing in application security, multi-cloud management, online fraud prevention, application delivery networking (ADN), application availability and performance, and network security, access, and authorization.\nF5 originally offered application delivery controller (ADC) technology, but has since expanded into application layer, automation, multi-cloud, and security services. As ransomware, data leaks, DDoS, and other attacks on businesses of all sizes are arising, companies such as F5 have continued to reinvent themselves.\nF5 is headquartered in Seattle, Washington in F5 Tower, with an additional 75 offices in 43 countries focusing on account management, global services support, product development, manufacturing, software engineering, and administrative jobs. Notable office locations include Spokane, Washington; New York, New York; Boulder, Colorado; London, England; San Jose, California; and San Francisco, California.\nWhile the majority of F5's revenue continues to be attributed to its hardware products, such as the BIG-IP iSeries systems, the company has begun to offer additional modules on its proprietary operating system, TMOS (Traffic Management Operating System). These modules include Local Traffic Manager (LTM), Advanced Web Application Firewall (AWAF), DNS (previously named GTM), and Access Policy Manager (APM). These offer organizations that run BIG-IP systems the ability to deploy load balancing, Layer 7 application firewalls, single sign-on (for Azure AD, Active Directory, LDAP, and Okta), as well as enterprise-level VPNs. While the BIG-IP was traditionally a hardware product, F5 now offers it as a virtual machine, which it has branded as the BIG-IP Virtual Edition. The BIG-IP Virtual Edition is cloud-agnostic and can be deployed on-premises in a public and/or hybrid cloud environment.\n\nHistory\nF5, Inc., originally named \"F5 Labs\" and formerly branded \"F5 Networks, Inc.\" was established in 1996. Currently, the company's public-facing branding generally presents the company as just \"F5.\" The company's name is a reference to the highest intensity tornado on the Fujita scale.\nIn 1997, F5 launched its first product, a load balancer called BIG-IP. BIG-IP served the purpose of reallocating server traffic away from overloaded servers. In June 1999, the company had its initial public offering and was listed on the Nasdaq stock exchange with the symbol FFIV.\nIn 2017, François Locoh-Donou replaced John McAdam as president and CEO. Later in 2017, F5 launched a dedicated site and organization focused on gathering global threat intelligence data, analyzing application threats, and publishing related findings, dubbed \"F5 Labs\" in a nod to the company's history. The team continues to research application threats and publish findings every week. On May 3, 2017, F5 announced that it would move from its longtime headquarters on the waterfront near Seattle Center to a downtown Seattle skyscraper that would be called F5 Tower. The move occurred in early 2019.\nF5 employees include Dahl-Nygaard laureate Gilad Bracha, Google click fraud czar Shuman Ghosemajumder, and Defense.Net founder Barrett Lyon.\n48 of the Fortune 50 companies use F5 for load balancing, Layer 7 application security, fraud prevention, and API management.\n\nProducts\nF5 Application Delivery and Security Platform (ADSP)\nIn 2025, F5 introduced the Application Delivery and Security Platform (ADSP), a unified offering that combines application delivery, API protection, and threat mitigation across hardware, software, and SaaS environments. ADSP is designed to support hybrid and multicloud deployments and includes capabilities such as load balancing, web application firewalls, DDoS protection, and encrypted traffic inspection.\n\nF5 BIG-IP\nF5's BIG-IP product family comprises hardware, modularized software, and virtual appliances that run the F5 TMOS operating system. Depending on the appliance selected, one or more BIG-IP product modules can be added.\nIn 1997, the company introduced its flagship product, BIG-IP.\n\nBIG-IP history\nOn September 7, 2004, F5 Networks released version 9.0 of the BIG-IP software in addition to appliances to run the software. Version 9.0 also marked the introduction of the company's TMOS architecture, with enhancements including:\n\nThe move from BSD to Linux to handle system management functions (disks, logging, bootup, console access, etc.)\nThe creation of a Traffic Management Microkernel (TMM) to directly talk to the networking hardware and handle all network activities.\n\nF5 NGINX\nSince the NGINX, Inc. acquisition in 2019, F5 has offered an enterprise offering of NGINX with advanced features, multiple support SLAs, and regular software updates.\n\nF5 Distributed Cloud Services\nDuring F5 Agility 2022, F5 announced a new product offering being built on the platforms of BIG-IP, Shape Security, and Volterra. The primary offering in this suite is the SaaS-based web application and API protection (WAAP). F5 Distributed Cloud Services enable organizations to deploy, secure, and manage their applications across various environments, including data centers, multi-cloud setups, and the network or enterprise edge.\n\nAcquisitions\nMantisNet, Inc.\nIn August 2025, F5 acquired MantisNet, Inc., a company specializing in real-time network observability using extended Berkeley Packet Filter (eBPF) technology. MantisNet’s tools provided telemetry and visibility into encrypted traffic within containerized environments. The acquisition was intended to support observability and monitoring in cloud-native architectures.\n\nFletch, Inc.\nIn June 2025, F5 acquired Fletch, Inc., a cybersecurity startup founded in 2020 that developed agentic AI tools for threat detection and prioritization. Fletch’s technology was designed to analyze large volumes of threat intelligence and reduce alert fatigue by surfacing relevant security signals. The acquisition was part of a broader industry trend of integrating AI-based threat analysis into security platforms.\n\nuRoam, Inc.\nF5 acquired uRoam, Inc. in 2003 for a total cash deal size of $25 million. The strategic intent behind F5 Networks' acquisition of uRoam was to diversify its product offerings beyond its core application delivery and security services. This move aimed to address the growing demand for secure remote access to corporate networks and applications, aligning with industry trends.\n\nMagniFire Websystems, Inc.\nF5 acquired MagniFire Websystems in 2004 for a total cash deal size of $29 million. This acquisition allowed F5 to enter the web application security space within the BIG-IP platform. MagniFire Websystems products were sold independently when the deal first closed, then were quickly bundled into the BIG-IP product group.\n\nSwan Labs Corporation\nIn September 2005, F5 announced they had acquired Swan Labs for a total of $43 million to incorporate WAN optimization and application acceleration technology into the BIG-IP platform, specifically to improve their load balancing offering.\n\nTraffix Systems, Inc.\nIn 2005, F5 Networks, Inc. at the time, now F5, Inc., announced it has acquired Traffix Systems for a total value of $135 million. Traffix Systems product was integrated within the F5 BIG-IP Local Traffic Manager (LTM) product line.\n\nAcopia Networks, Inc.\nIn August 2007, F5, Inc., at the time, F5 Networks, Inc., announced they acquired Acopia Networks, Inc. to add file-area networking to the F5 BIG-IP application-delivery product line, also known as the Local Traffic Manager (LTM) module on the BIG-IP platforms. The deal was valued at $210 million.\n\nLineRate Systems, Inc.\nIn February 2013, F5 Networks acquired LineRate Systems, a developer of software-defined networking (SDN) services, to enhance its application-layer intelligence within software-defined data centers. This acquisition provided F5 with access to LineRate's layer 7+ networking services technology, intellectual property, and engineering talent. The company says that the integration of LineRate's programmable network capabilities bolstered F5's efforts to extend its market leadership in SDN services.\n\nDefense.Net, Inc.\nIn May 2014, F5, Inc. (then F5 Networks, Inc.) announced it had acquired Defense.Net, Inc., a company offering cloud-based DDoS mitigation services. The Defense.Net product would later become F5 Silverline. As of December 2022, the Silverline brand was retired, and the managed service offerings Silverline offered were merged into the F5 Distributed Cloud Services product portfolio.\n\nNGINX, Inc.\nIn March 2019, F5 acquired NGINX, Inc., a company responsible for widely used open-source web server software, for $670 million.\nOn 18 January 2022, original NGINX developer Igor Sysoev left F5, Inc. Later on, forks maintaining open-source licenses such as Angie and freenginx started being developed. Igor Sysoev is not actively involved in this project.\n\nShape Security, Inc.\nIn January 2020, F5 acquired Shape Security, Inc., an AI-based bot detection company, for $1 billion. F5 Networks then used the acquisition to introduce a new fraud detection engine.\n\nVolterra, Inc.\nIn January 2021, F5 acquired Volterra, Inc., an edge networking company that sells SaaS security services, for $500 million. The previously Volterra-branded products were incorporated into F5 Distributed Cloud Services, as of 2022.\n\nThreat Stack, Inc.\nIn October 2021, F5 acquired Threat Stack, Inc., a Boston cloud computing security startup company for a reported $68 million. As of December 15, 2022, the previous Threat Stack offering has been rolled into the F5 Distributed Cloud platform.\n\nLilac Cloud, Inc.\nIn January 2023, F5 announced it had entered into an agreement to purchase Lilac Cloud, an application services delivery provider. Lilac Cloud, based in Cupertino, California, was F5's CDN provider for its Distributed Cloud Services. The entire Lilac Cloud offering will be rolled into the overall F5 Distributed Cloud Services product line.\n\nSuborbital Software Systems, Inc.\nIn July 2023, Suborbital Software Systems, Inc., a technology startup that aimed to build cloud-native platforms on WebAssembly, announced it had been acquired by F5, Inc. The details of this acquisition were not disclosed due to the small nature of Suborbital's operations. The entire Suborbital product will be used within the F5 Distributed Cloud Services product line.\n\nWib Security, Inc.\nIn February 2024 at AppWorld, F5's application security and delivery conference in San Jose, California, F5 announced it had acquired Wib: an API security company based in Tel Aviv, Israel, focused on vulnerability detection and observability in application development. The financial details of the Wib acquisition were not disclosed. As of February 2024, F5 was adding the Wib API intellectual property to the F5 Distributed Cloud Services product line.\n\nHeyhack\nIn March 2024, F5 announced it had acquired Heyhack ApS, a Denmark-based and operated security penetration SaaS company. The financial details of this acquisition were not disclosed. F5 announced Heyhack's intellectual property—such as its automated security reconnaissance and penetration testing solution—would be rolled into the F5 Distributed Cloud Services platform.\n\nLeakSignal\nIn March 2025, F5, Inc. acquired LeakSignal, a cybersecurity company specializing in real-time data protection and governance for AI applications. The acquisition aimed to enhance the F5 Application Delivery and Security Platform (ADSP) with capabilities such as AI-driven data classification, policy enforcement, and compliance monitoring. LeakSignal had been recognized by the National Institute of Standards and Technology (NIST) for its innovations in securing data in transit, and its integration into F5’s portfolio supports the growing need for data protection in generative AI and multicloud environments.\n\nFletch\nIn June 2025, F5 acquired Fletch, a San Francisco startup specializing in agentic AI for threat intelligence and alert prioritization. Fletch’s technology ingests disparate threat feeds and internal logs to surface high-value security signals in real time, reducing noise and aiding operator decision-making. With its 15-member team joining F5, the acquisition enhances the F5 Application Delivery and Security Platform with AI-native threat context and automation.\n\nMantisNet\nIn August 2025, F5 acquired MantisNet, a Reston-based provider of eBPF-powered, cloud-native network observability and real-time network intelligence. MantisNet’s agentless telemetry technology enables visibility into encrypted, ephemeral, and east–west traffic without performance overhead. The integration with the F5 Application Delivery and Security Platform gives operators deeper insight into containerized environments and 5G architectures while streamlining observability and security functions in cloud-native deployments.\n\nCalypsoAI\nIn September 2025, F5 announced its intent to acquire CalypsoAI, a Dublin-based startup specializing in runtime AI security and adaptive guardrails, for approximately US $180 million. CalypsoAI’s platform offers techniques such as red teaming, inference-layer defenses, and policy enforcement suited for generative and agentic AI workloads. Once closed, the acquisition is expected to strengthen F5’s ADSP by embedding enterprise-grade AI security across AI deployment lifecycles and reducing risk from AI-specific attack vectors. On September 29, 2025, F5 announced the CalypsoAI acquisition closed and the CalypsoAI products joined the F5 ADSP as F5 AI Guardrails and F5 AI Red Team.\n\nReferences\nExternal links\nBusiness data for F5, Inc.:",
  "clean_text": "F5, Inc. is an American technology company specializing in application security, multi-cloud management, online fraud prevention, application delivery networking (ADN), application availability and performance, and network security, access, and authorization. F5 originally offered application delivery controller (ADC) technology, but has since expanded into application layer, automation, multi-cloud, and security services. As ransomware, data leaks, DDoS, and other attacks on businesses of all sizes are arising, companies such as F5 have continued to reinvent themselves. F5 is headquartered in Seattle, Washington in F5 Tower, with an additional 75 offices in 43 countries focusing on account management, global services support, product development, manufacturing, software engineering, and administrative jobs. Notable office locations include Spokane, Washington; New York, New York; Boulder, Colorado; London, England; San Jose, California; and San Francisco, California. While the majority of F5's revenue continues to be attributed to its hardware products, such as the BIG-IP iSeries systems, the company has begun to offer additional modules on its proprietary operating system, TMOS (Traffic Management Operating System). These modules include Local Traffic Manager (LTM), Advanced Web Application Firewall (AWAF), DNS (previously named GTM), and Access Policy Manager (APM). These offer organizations that run BIG-IP systems the ability to deploy load balancing, Layer 7 application firewalls, single sign-on (for Azure AD, Active Directory, LDAP, and Okta), as well as enterprise-level VPNs. While the BIG-IP was traditionally a hardware product, F5 now offers it as a virtual machine, which it has branded as the BIG-IP Virtual Edition. The BIG-IP Virtual Edition is cloud-agnostic and can be deployed on-premises in a public and/or hybrid cloud environment. History F5, Inc., originally named \"F5 Labs\" and formerly branded \"F5 Networks, Inc.\" was established in 1996. Currently, the company's public-facing branding generally presents the company as just \"F5.\" The company's name is a reference to the highest intensity tornado on the Fujita scale. In 1997, F5 launched its first product, a load balancer called BIG-IP. BIG-IP served the purpose of reallocating server traffic away from overloaded servers. In June 1999, the company had its initial public offering and was listed on the Nasdaq stock exchange with the symbol FFIV. In 2017, François Locoh-Donou replaced John McAdam as president and CEO. Later in 2017, F5 launched a dedicated site and organization focused on gathering global threat intelligence data, analyzing application threats, and publishing related findings, dubbed \"F5 Labs\" in a nod to the company's history. The team continues to research application threats and publish findings every week. On May 3, 2017, F5 announced that it would move from its longtime headquarters on the waterfront near Seattle Center to a downtown Seattle skyscraper that would be called F5 Tower. The move occurred in early 2019. F5 employees include Dahl-Nygaard laureate Gilad Bracha, Google click fraud czar Shuman Ghosemajumder, and Defense.Net founder Barrett Lyon. 48 of the Fortune 50 companies use F5 for load balancing, Layer 7 application security, fraud prevention, and API management. Products F5 Application Delivery and Security Platform (ADSP) In 2025, F5 introduced the Application Delivery and Security Platform (ADSP), a unified offering that combines application delivery, API protection, and threat mitigation across hardware, software, and SaaS environments. ADSP is designed to support hybrid and multicloud deployments and includes capabilities such as load balancing, web application firewalls, DDoS protection, and encrypted traffic inspection. F5 BIG-IP F5's BIG-IP product family comprises hardware, modularized software, and virtual appliances that run the F5 TMOS operating system. Depending on the appliance selected, one or more BIG-IP product modules can be added. In 1997, the company introduced its flagship product, BIG-IP. BIG-IP history On September 7, 2004, F5 Networks released version 9.0 of the BIG-IP software in addition to appliances to run the software. Version 9.0 also marked the introduction of the company's TMOS architecture, with enhancements including: The move from BSD to Linux to handle system management functions (disks, logging, bootup, console access, etc.) The creation of a Traffic Management Microkernel (TMM) to directly talk to the networking hardware and handle all network activities. F5 NGINX Since the NGINX, Inc. acquisition in 2019, F5 has offered an enterprise offering of NGINX with advanced features, multiple support SLAs, and regular software updates. F5 Distributed Cloud Services During F5 Agility 2022, F5 announced a new product offering being built on the platforms of BIG-IP, Shape Security, and Volterra. The primary offering in this suite is the SaaS-based web application and API protection (WAAP). F5 Distributed Cloud Services enable organizations to deploy, secure, and manage their applications across various environments, including data centers, multi-cloud setups, and the network or enterprise edge. Acquisitions MantisNet, Inc. In August 2025, F5 acquired MantisNet, Inc., a company specializing in real-time network observability using extended Berkeley Packet Filter (eBPF) technology. MantisNet’s tools provided telemetry and visibility into encrypted traffic within containerized environments. The acquisition was intended to support observability and monitoring in cloud-native architectures. Fletch, Inc. In June 2025, F5 acquired Fletch, Inc., a cybersecurity startup founded in 2020 that developed agentic AI tools for threat detection and prioritization. Fletch’s technology was designed to analyze large volumes of threat intelligence and reduce alert fatigue by surfacing relevant security signals. The acquisition was part of a broader industry trend of integrating AI-based threat analysis into security platforms. uRoam, Inc. F5 acquired uRoam, Inc. in 2003 for a total cash deal size of $25 million. The strategic intent behind F5 Networks' acquisition of uRoam was to diversify its product offerings beyond its core application delivery and security services. This move aimed to address the growing demand for secure remote access to corporate networks and applications, aligning with industry trends. MagniFire Websystems, Inc. F5 acquired MagniFire Websystems in 2004 for a total cash deal size of $29 million. This acquisition allowed F5 to enter the web application security space within the BIG-IP platform. MagniFire Websystems products were sold independently when the deal first closed, then were quickly bundled into the BIG-IP product group. Swan Labs Corporation In September 2005, F5 announced they had acquired Swan Labs for a total of $43 million to incorporate WAN optimization and application acceleration technology into the BIG-IP platform, specifically to improve their load balancing offering. Traffix Systems, Inc. In 2005, F5 Networks, Inc. at the time, now F5, Inc., announced it has acquired Traffix Systems for a total value of $135 million. Traffix Systems product was integrated within the F5 BIG-IP Local Traffic Manager (LTM) product line. Acopia Networks, Inc. In August 2007, F5, Inc., at the time, F5 Networks, Inc., announced they acquired Acopia Networks, Inc. to add file-area networking to the F5 BIG-IP application-delivery product line, also known as the Local Traffic Manager (LTM) module on the BIG-IP platforms. The deal was valued at $210 million. LineRate Systems, Inc. In February 2013, F5 Networks acquired LineRate Systems, a developer of software-defined networking (SDN) services, to enhance its application-layer intelligence within software-defined data centers. This acquisition provided F5 with access to LineRate's layer 7+ networking services technology, intellectual property, and engineering talent. The company says that the integration of LineRate's programmable network capabilities bolstered F5's efforts to extend its market leadership in SDN services. Defense.Net, Inc. In May 2014, F5, Inc. (then F5 Networks, Inc.) announced it had acquired Defense.Net, Inc., a company offering cloud-based DDoS mitigation services. The Defense.Net product would later become F5 Silverline. As of December 2022, the Silverline brand was retired, and the managed service offerings Silverline offered were merged into the F5 Distributed Cloud Services product portfolio. NGINX, Inc. In March 2019, F5 acquired NGINX, Inc., a company responsible for widely used open-source web server software, for $670 million. On 18 January 2022, original NGINX developer Igor Sysoev left F5, Inc. Later on, forks maintaining open-source licenses such as Angie and freenginx started being developed. Igor Sysoev is not actively involved in this project. Shape Security, Inc. In January 2020, F5 acquired Shape Security, Inc., an AI-based bot detection company, for $1 billion. F5 Networks then used the acquisition to introduce a new fraud detection engine. Volterra, Inc. In January 2021, F5 acquired Volterra, Inc., an edge networking company that sells SaaS security services, for $500 million. The previously Volterra-branded products were incorporated into F5 Distributed Cloud Services, as of 2022. Threat Stack, Inc. In October 2021, F5 acquired Threat Stack, Inc., a Boston cloud computing security startup company for a reported $68 million. As of December 15, 2022, the previous Threat Stack offering has been rolled into the F5 Distributed Cloud platform. Lilac Cloud, Inc. In January 2023, F5 announced it had entered into an agreement to purchase Lilac Cloud, an application services delivery provider. Lilac Cloud, based in Cupertino, California, was F5's CDN provider for its Distributed Cloud Services. The entire Lilac Cloud offering will be rolled into the overall F5 Distributed Cloud Services product line. Suborbital Software Systems, Inc. In July 2023, Suborbital Software Systems, Inc., a technology startup that aimed to build cloud-native platforms on WebAssembly, announced it had been acquired by F5, Inc. The details of this acquisition were not disclosed due to the small nature of Suborbital's operations. The entire Suborbital product will be used within the F5 Distributed Cloud Services product line. Wib Security, Inc. In February 2024 at AppWorld, F5's application security and delivery conference in San Jose, California, F5 announced it had acquired Wib: an API security company based in Tel Aviv, Israel, focused on vulnerability detection and observability in application development. The financial details of the Wib acquisition were not disclosed. As of February 2024, F5 was adding the Wib API intellectual property to the F5 Distributed Cloud Services product line. Heyhack In March 2024, F5 announced it had acquired Heyhack ApS, a Denmark-based and operated security penetration SaaS company. The financial details of this acquisition were not disclosed. F5 announced Heyhack's intellectual property—such as its automated security reconnaissance and penetration testing solution—would be rolled into the F5 Distributed Cloud Services platform. LeakSignal In March 2025, F5, Inc. acquired LeakSignal, a cybersecurity company specializing in real-time data protection and governance for AI applications. The acquisition aimed to enhance the F5 Application Delivery and Security Platform (ADSP) with capabilities such as AI-driven data classification, policy enforcement, and compliance monitoring. LeakSignal had been recognized by the National Institute of Standards and Technology (NIST) for its innovations in securing data in transit, and its integration into F5’s portfolio supports the growing need for data protection in generative AI and multicloud environments. Fletch In June 2025, F5 acquired Fletch, a San Francisco startup specializing in agentic AI for threat intelligence and alert prioritization. Fletch’s technology ingests disparate threat feeds and internal logs to surface high-value security signals in real time, reducing noise and aiding operator decision-making. With its 15-member team joining F5, the acquisition enhances the F5 Application Delivery and Security Platform with AI-native threat context and automation. MantisNet In August 2025, F5 acquired MantisNet, a Reston-based provider of eBPF-powered, cloud-native network observability and real-time network intelligence. MantisNet’s agentless telemetry technology enables visibility into encrypted, ephemeral, and east–west traffic without performance overhead. The integration with the F5 Application Delivery and Security Platform gives operators deeper insight into containerized environments and 5G architectures while streamlining observability and security functions in cloud-native deployments. CalypsoAI In September 2025, F5 announced its intent to acquire CalypsoAI, a Dublin-based startup specializing in runtime AI security and adaptive guardrails, for approximately US $180 million. CalypsoAI’s platform offers techniques such as red teaming, inference-layer defenses, and policy enforcement suited for generative and agentic AI workloads. Once closed, the acquisition is expected to strengthen F5’s ADSP by embedding enterprise-grade AI security across AI deployment lifecycles and reducing risk from AI-specific attack vectors. On September 29, 2025, F5 announced the CalypsoAI acquisition closed and the CalypsoAI products joined the F5 ADSP as F5 AI Guardrails and F5 AI Red Team."
}