{
  "ticker": "FICO",
  "cik": "0000814547",
  "company_name": "Fair Isaac",
  "corrected_name": "Fair Isaac",
  "wiki_title_used": "Fair Isaac",
  "exists": true,
  "raw_text": "FICO (legal name: Fair Isaac Corporation), originally Fair, Isaac and Company, is an American data analytics company based in Bozeman, Montana, focused on credit scoring services. It was founded by Bill Fair and Earl Isaac in 1956. Its FICO score, a measure of consumer credit risk, has become a fixture of consumer lending in the United States.\nIn 2013, lenders purchased more than 10 billion FICO scores and about 30 million American consumers accessed their scores themselves. The company reported a revenue of $1.29 billion for the fiscal year of 2020.\n\nHistory\nFICO was founded in 1956 as Fair, Isaac and Company by engineer William R. \"Bill\" Fair and mathematician Earl Judson Isaac. The two met while working at the Stanford Research Institute in Menlo Park, California. Selling its first credit scoring system two years after the company's creation, FICO pitched its system to fifty American lenders.\nFICO went public in July 1987 and is traded on the New York Stock Exchange. The company debuted its first general-purpose FICO score in 1989. FICO scores are based on credit reports and \"base\" FICO scores range from 300 to 850, while industry-specific scores range from 250 to 900.\nLenders use the scores to gauge a potential borrower's creditworthiness.\nFannie Mae and Freddie Mac first began using FICO scores to help determine which American consumers qualified for mortgages bought and sold by the companies in 1995.\n\nName changes\nOriginally called Fair, Isaac and Company (hence the abbreviation FICO), this name was changed to Fair Isaac Corporation in 2003.\n\nHeadquarters moves\nOriginally based in San Rafael, California, FICO moved its headquarters to Minneapolis, Minnesota, in 2004, a few years after Minnesota resident Thomas Grudnowski took over as CEO. In 2013, it moved its headquarters to San Jose, California, a year after CEO William Lansing joined. In 2016, it opened an office in Bozeman, Montana, which later became its headquarters.\n\nAcquisitions\nDynaMark 1992\nRisk Management Technologies 1997\nPrevision 1997\nNykamp Consulting Group 2001\nHNC Software 2002\nNAREX 2003\nDiversified Healthcare Services 2003\nSeurat (2003)\nLondon Bridge Software 2004\nBraun Consulting 2004\nRulesPower 2005\nDash Optimization 2008\nEntiera 2012\nAdeptra 2012\nCR Software 2012\nInfoglide 2013\nInfoCentricity 2014\nKarmasphere 2014\nTONBELLER AG 2015\nQuadMetrics 2016\nGoOn 2018\nEZMCOM 2019\n\nAntitrust issues\nIn March 2020, the US Department of Justice (DOJ) opened an antitrust investigation into FICO, which was reported to be closed in December 2020. In March 2024, US Senator Josh Hawley sent a letter to the DOJ's Antitrust Division urging them to open an investigation into FICO for anti-competitive practices, stating that the company \"appears to be using its monopolistic power over the credit scoring market to increase costs for mortgage lenders.\"\nBetween 2020 and 2023, at least 10 antitrust class action lawsuits were filed against FICO involving \"business to business\" purchases of FICO scores, with the plaintiffs alleging that FICO maintains monopoly power through anticompetitive agreements and charges artificially inflated prices for FICO scores. In September 2023 US District Judge Edmond Chang ruled that the plaintiffs, which include credit unions, banks, mortgage lenders, real estate brokerages, auto dealers, and other companies, had presented enough evidence that FICO had violated antitrust law to allow the lawsuits to proceed.\n\nOperations\nFICO is headquartered in Bozeman, Montana and it has additional U.S. locations in San Jose, California, Roseville, Minnesota, San Diego, California, San Rafael, California, Fairfax, Virginia, and Austin, Texas.\nThe company has international locations in Australia, Brazil, Canada, China, Germany, India, Italy, Japan, South Korea, Lithuania, Malaysia, the Philippines, Poland, Russia, Singapore, South Africa, Spain, Taiwan, Thailand, Turkey, and the United Kingdom.\n\nFICO score\nA measure of credit risk, FICO scores are available through all of the major consumer reporting agencies in the United States: Equifax, Experian, and TransUnion. FICO scores are also offered in other markets, including Mexico and Canada, as well as through the fourth U.S. credit reporting bureau, PRBC.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Fair Isaac Corporation: \nHow Does FICO Calculate a Score?",
  "clean_text": "FICO (legal name: Fair Isaac Corporation), originally Fair, Isaac and Company, is an American data analytics company based in Bozeman, Montana, focused on credit scoring services. It was founded by Bill Fair and Earl Isaac in 1956. Its FICO score, a measure of consumer credit risk, has become a fixture of consumer lending in the United States. In 2013, lenders purchased more than 10 billion FICO scores and about 30 million American consumers accessed their scores themselves. The company reported a revenue of $1.29 billion for the fiscal year of 2020. History FICO was founded in 1956 as Fair, Isaac and Company by engineer William R. \"Bill\" Fair and mathematician Earl Judson Isaac. The two met while working at the Stanford Research Institute in Menlo Park, California. Selling its first credit scoring system two years after the company's creation, FICO pitched its system to fifty American lenders. FICO went public in July 1987 and is traded on the New York Stock Exchange. The company debuted its first general-purpose FICO score in 1989. FICO scores are based on credit reports and \"base\" FICO scores range from 300 to 850, while industry-specific scores range from 250 to 900. Lenders use the scores to gauge a potential borrower's creditworthiness. Fannie Mae and Freddie Mac first began using FICO scores to help determine which American consumers qualified for mortgages bought and sold by the companies in 1995. Name changes Originally called Fair, Isaac and Company (hence the abbreviation FICO), this name was changed to Fair Isaac Corporation in 2003. Headquarters moves Originally based in San Rafael, California, FICO moved its headquarters to Minneapolis, Minnesota, in 2004, a few years after Minnesota resident Thomas Grudnowski took over as CEO. In 2013, it moved its headquarters to San Jose, California, a year after CEO William Lansing joined. In 2016, it opened an office in Bozeman, Montana, which later became its headquarters. Acquisitions DynaMark 1992 Risk Management Technologies 1997 Prevision 1997 Nykamp Consulting Group 2001 HNC Software 2002 NAREX 2003 Diversified Healthcare Services 2003 Seurat (2003) London Bridge Software 2004 Braun Consulting 2004 RulesPower 2005 Dash Optimization 2008 Entiera 2012 Adeptra 2012 CR Software 2012 Infoglide 2013 InfoCentricity 2014 Karmasphere 2014 TONBELLER AG 2015 QuadMetrics 2016 GoOn 2018 EZMCOM 2019 Antitrust issues In March 2020, the US Department of Justice (DOJ) opened an antitrust investigation into FICO, which was reported to be closed in December 2020. In March 2024, US Senator Josh Hawley sent a letter to the DOJ's Antitrust Division urging them to open an investigation into FICO for anti-competitive practices, stating that the company \"appears to be using its monopolistic power over the credit scoring market to increase costs for mortgage lenders.\" Between 2020 and 2023, at least 10 antitrust class action lawsuits were filed against FICO involving \"business to business\" purchases of FICO scores, with the plaintiffs alleging that FICO maintains monopoly power through anticompetitive agreements and charges artificially inflated prices for FICO scores. In September 2023 US District Judge Edmond Chang ruled that the plaintiffs, which include credit unions, banks, mortgage lenders, real estate brokerages, auto dealers, and other companies, had presented enough evidence that FICO had violated antitrust law to allow the lawsuits to proceed. Operations FICO is headquartered in Bozeman, Montana and it has additional U.S. locations in San Jose, California, Roseville, Minnesota, San Diego, California, San Rafael, California, Fairfax, Virginia, and Austin, Texas. The company has international locations in Australia, Brazil, Canada, China, Germany, India, Italy, Japan, South Korea, Lithuania, Malaysia, the Philippines, Poland, Russia, Singapore, South Africa, Spain, Taiwan, Thailand, Turkey, and the United Kingdom. FICO score A measure of credit risk, FICO scores are available through all of the major consumer reporting agencies in the United States: Equifax, Experian, and TransUnion. FICO scores are also offered in other markets, including Mexico and Canada, as well as through the fourth U.S. credit reporting bureau, PRBC."
}