{
  "ticker": "FISV",
  "cik": "0000798354",
  "company_name": "Fiserv",
  "corrected_name": "Fiserv",
  "wiki_title_used": "Fiserv",
  "exists": true,
  "raw_text": "Fiserv, Inc. ( fy-SURV) is an American multinational financial technology company headquartered in Milwaukee, Wisconsin. The company processes debit and credit card transactions, loyalty programs, loans, electronic bill pay, wires and ACH transfers, check deposits, and ATM transactions on behalf of banking institutions. The company also produces debit and credit cards and point of sale terminals.\nCustomers primarily include companies in the financial services sector, including banks, savings and loan associations, credit unions, securities broker dealers, mortgage, insurance, leasing and finance companies, and retailers. In 2024, 85% of the company's revenues were from the U.S. and Canada, while 15% of revenues were from other countries. Processing represented 81% of revenues and products, including software, hardware, and physical cards, represented 19% of revenue. The company is ranked 208th on the Fortune 500 and 269th on the Forbes Global 2000.\n\nHistory\n1980s and 1990s\nFiserv was founded in 1984, and within two years, it was listed on NASDAQ. The company experienced rapid growth mainly due to a series of acquisitions, including Citicorp Information Resources, a subsidiary of Citicorp, which was the largest acquisition in its early years. This acquisition put Fiserv into the commercial banking, internal and credit union core account processing market space.\nIn 1995, Fiserv acquired Information Technology, Inc., (ITI) of Lincoln, Nebraska. Thus, Fiserv acquired Premier, which at that time was the most widely implemented account processing platform in the US, and represented an increase in Fiserv's account processing clients. Fiserv also launched its website in 1995, and introduced fully electronic bill payment (branded as E-bills) in 1997, reaching $1 billion in revenue.\n\n2000s\nIn 2003, Fiserv acquired General American Corporation. It also acquired Consumer Network Services from Electronic Data Systems for $320 million.\nIn 2005, Jeff Yabuki became Fiserv's CEO, and the company acquired a number of businesses, including Del Mar Database, assets of U.S. eLending business from Emergis, Interactive Technologies, Administrative Services Group Inc., JW Hutton, BillMatrix, VerticalPoint, and Xcipio, Inc.\nIn 2006, Fiserv acquired CareGain, Inc., Asset of CT Insurance Services & CCH Wall Street.\nIn 2007, Fiserv acquired NetEconomy and CheckFree — which had itself just acquired Corillian, Carreker, PhoneCharge and Upstream Technologies LLC. This was Fiserv's largest acquisition to date; CheckFree was at that time the leading provider of online banking, online bill payment, electronic bill payment services, and software for check clearance and ACH (also known as direct debit) processing.\nIn 2008, Fiserv made an acquisition of Interactive Technologies, Inc., provider of billing software and ancillary products for the banking and investment advisory industries, granting Fiserv control of their \"Advantage Fee System\" which calculates complex billing for fees and commissions. In the same year, Fiserv acquired i_Tech, a Montana-based item processing company that had been owned by First Interstate Bank.  Fiserv also acquired The Data Center, a Texas-based item processing company, from BBVA Compass Bank.\n\n2010s\nIn 2010, Fiserv acquired AdviceAmerica, provider of software for financial institutions.\nIn 2011, Fiserv acquired M-Com. Established in 2000 and based in Auckland, New Zealand, M-Com developed mobile banking apps. Fiserv also in 2011 acquired Maverick Network Solutions, established in 2006 and based in Brandywine Hundred, Delaware, and CashEdge, developer of payment solutions, including Popmoney.\nIn 2013, Open Solutions, Inc., an account processing platform, was yet another company acquired by Fiserv, following a rebrand of Open Solutions managed by branding agency Bob's Your Uncle. Fiserv paid $55 million to acquire Open Solutions, by taking on $960 million in debt.\nIn 2016, Fiserv acquired Community Financial Services from ACI Worldwide  and Convenience Pay from Hewlett Packard.\nIn 2017, Fiserv acquired Dovetail and Monitise.\nIn August 2017, Fiserv acquired PCLender.\nIn 2018, Fiserv acquired MoneyPass, a surcharge-free debit card and ATM processing network, from Elan Financial Services, a unit of U.S. Bancorp.\nIn 2019, First Data, a payment processor, was acquired for $22 billion, making it one of the largest acquisitions in the financial technology sector.\n\n2020s\nIn 2020, Fiserv made an acquisition of Bypass Mobile, enterprise point of sale platform. In the same year, CEO Jeffery Yabuki stepped down and was replaced by Frank Bisignano.\nIn 2021, Fiserv acquired Ondot Systems, a digital experience platform for financial institutions; NetPay, a payment facilitator; and BentoBox, provider of online restaurant operations.\nIn 2022, Fiserv acquired Finxact, provider of cloud-based core banking services. The company also acquired TIF District in the same year. \nThe city of Milwaukee created a tax incremental financing district to incentivize Fiserv to remain in downtown Milwaukee, Wisconsin. The 7 million dollars will be available through annual payments, with the condition Fiserv must base at least 780 employees at the downtown location.\nOn June 6, 2023, Fiserv switched its stock listing from Nasdaq to the New York Stock Exchange and changed its ticker symbol from FISV to FI.\nIn October 2023, Fiserv acquired Skytef, the primary distributor of Software Express payment solution SiTef.\nIn March 2025, Fiserv completed the acquisition of Payfare.\nIn April 2025, Fiserv acquired Australian payment facilitator Pinch Payments for an undisclosed sum.\nIn April 2025, Fiserv agreed to acquire Money Money Servicos Financeiros S.A., a Brazil-based financial technology company.\nIn 2025, CEO Frank Bisignano resigned after he was confirmed as commissioner of the Social Security Administration.\nIn October 2025, Fiserv stock lost more than 40% of its value after the company reported lower quarter earnings and a lower forecast for the year, citing customer complaints of fees related to its Clover platform.\nOn November 11, 2025, after over 2 years on the NYSE under the symbol FI, Fiserv switched its stock exchange listing back to the Nasdaq Global Select Market and changed its ticker symbol back to the one it used when it was on the Nasdaq, FISV.\n\nLitigation with Shift4\nFollowing its 2019 acquisition of First Data, Fiserv inherited a significant legal dispute between its subsidiary CardConnect and rival payments company Shift4. The lawsuit included allegations of breach of contract and lasted for several years. The case was ultimately settled in late 2022 after a direct agreement was reached between Fiserv CEO Frank Bisignano and Shift4 CEO Jared Isaacman. The terms of the settlement remain confidential.\n\nAcquisitions and mergers\nLargest acquisition: First Data Corporation in 2019 for $22 billion\nTotal acquisitions: Over 24 companies since inception\nFocus areas: Payments, financial technology, banking services, and digital solutions\n\nProducts\nFiserv offers multiple products, including:\n\nCarat, a platform that organizes payments and experiences for large businesses\nCardHub, which allows customers to get digital payment cards\nClover, for small businesses to accept payments at the point of sale, as well as to track sales\nPinch Payments, a payment facilitator providing embedded card processing and direct debit to SaaS and to small businesses via proprietary SaaS that integrates with Xero, Quickbooks and MYOB.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Fiserv, Inc.:",
  "clean_text": "Fiserv, Inc. ( fy-SURV) is an American multinational financial technology company headquartered in Milwaukee, Wisconsin. The company processes debit and credit card transactions, loyalty programs, loans, electronic bill pay, wires and ACH transfers, check deposits, and ATM transactions on behalf of banking institutions. The company also produces debit and credit cards and point of sale terminals. Customers primarily include companies in the financial services sector, including banks, savings and loan associations, credit unions, securities broker dealers, mortgage, insurance, leasing and finance companies, and retailers. In 2024, 85% of the company's revenues were from the U.S. and Canada, while 15% of revenues were from other countries. Processing represented 81% of revenues and products, including software, hardware, and physical cards, represented 19% of revenue. The company is ranked 208th on the Fortune 500 and 269th on the Forbes Global 2000. History 1980s and 1990s Fiserv was founded in 1984, and within two years, it was listed on NASDAQ. The company experienced rapid growth mainly due to a series of acquisitions, including Citicorp Information Resources, a subsidiary of Citicorp, which was the largest acquisition in its early years. This acquisition put Fiserv into the commercial banking, internal and credit union core account processing market space. In 1995, Fiserv acquired Information Technology, Inc., (ITI) of Lincoln, Nebraska. Thus, Fiserv acquired Premier, which at that time was the most widely implemented account processing platform in the US, and represented an increase in Fiserv's account processing clients. Fiserv also launched its website in 1995, and introduced fully electronic bill payment (branded as E-bills) in 1997, reaching $1 billion in revenue. 2000s In 2003, Fiserv acquired General American Corporation. It also acquired Consumer Network Services from Electronic Data Systems for $320 million. In 2005, Jeff Yabuki became Fiserv's CEO, and the company acquired a number of businesses, including Del Mar Database, assets of U.S. eLending business from Emergis, Interactive Technologies, Administrative Services Group Inc., JW Hutton, BillMatrix, VerticalPoint, and Xcipio, Inc. In 2006, Fiserv acquired CareGain, Inc., Asset of CT Insurance Services & CCH Wall Street. In 2007, Fiserv acquired NetEconomy and CheckFree — which had itself just acquired Corillian, Carreker, PhoneCharge and Upstream Technologies LLC. This was Fiserv's largest acquisition to date; CheckFree was at that time the leading provider of online banking, online bill payment, electronic bill payment services, and software for check clearance and ACH (also known as direct debit) processing. In 2008, Fiserv made an acquisition of Interactive Technologies, Inc., provider of billing software and ancillary products for the banking and investment advisory industries, granting Fiserv control of their \"Advantage Fee System\" which calculates complex billing for fees and commissions. In the same year, Fiserv acquired i_Tech, a Montana-based item processing company that had been owned by First Interstate Bank. Fiserv also acquired The Data Center, a Texas-based item processing company, from BBVA Compass Bank. 2010s In 2010, Fiserv acquired AdviceAmerica, provider of software for financial institutions. In 2011, Fiserv acquired M-Com. Established in 2000 and based in Auckland, New Zealand, M-Com developed mobile banking apps. Fiserv also in 2011 acquired Maverick Network Solutions, established in 2006 and based in Brandywine Hundred, Delaware, and CashEdge, developer of payment solutions, including Popmoney. In 2013, Open Solutions, Inc., an account processing platform, was yet another company acquired by Fiserv, following a rebrand of Open Solutions managed by branding agency Bob's Your Uncle. Fiserv paid $55 million to acquire Open Solutions, by taking on $960 million in debt. In 2016, Fiserv acquired Community Financial Services from ACI Worldwide and Convenience Pay from Hewlett Packard. In 2017, Fiserv acquired Dovetail and Monitise. In August 2017, Fiserv acquired PCLender. In 2018, Fiserv acquired MoneyPass, a surcharge-free debit card and ATM processing network, from Elan Financial Services, a unit of U.S. Bancorp. In 2019, First Data, a payment processor, was acquired for $22 billion, making it one of the largest acquisitions in the financial technology sector. 2020s In 2020, Fiserv made an acquisition of Bypass Mobile, enterprise point of sale platform. In the same year, CEO Jeffery Yabuki stepped down and was replaced by Frank Bisignano. In 2021, Fiserv acquired Ondot Systems, a digital experience platform for financial institutions; NetPay, a payment facilitator; and BentoBox, provider of online restaurant operations. In 2022, Fiserv acquired Finxact, provider of cloud-based core banking services. The company also acquired TIF District in the same year. The city of Milwaukee created a tax incremental financing district to incentivize Fiserv to remain in downtown Milwaukee, Wisconsin. The 7 million dollars will be available through annual payments, with the condition Fiserv must base at least 780 employees at the downtown location. On June 6, 2023, Fiserv switched its stock listing from Nasdaq to the New York Stock Exchange and changed its ticker symbol from FISV to FI. In October 2023, Fiserv acquired Skytef, the primary distributor of Software Express payment solution SiTef. In March 2025, Fiserv completed the acquisition of Payfare. In April 2025, Fiserv acquired Australian payment facilitator Pinch Payments for an undisclosed sum. In April 2025, Fiserv agreed to acquire Money Money Servicos Financeiros S.A., a Brazil-based financial technology company. In 2025, CEO Frank Bisignano resigned after he was confirmed as commissioner of the Social Security Administration. In October 2025, Fiserv stock lost more than 40% of its value after the company reported lower quarter earnings and a lower forecast for the year, citing customer complaints of fees related to its Clover platform. On November 11, 2025, after over 2 years on the NYSE under the symbol FI, Fiserv switched its stock exchange listing back to the Nasdaq Global Select Market and changed its ticker symbol back to the one it used when it was on the Nasdaq, FISV. Litigation with Shift4 Following its 2019 acquisition of First Data, Fiserv inherited a significant legal dispute between its subsidiary CardConnect and rival payments company Shift4. The lawsuit included allegations of breach of contract and lasted for several years. The case was ultimately settled in late 2022 after a direct agreement was reached between Fiserv CEO Frank Bisignano and Shift4 CEO Jared Isaacman. The terms of the settlement remain confidential. Acquisitions and mergers Largest acquisition: First Data Corporation in 2019 for $22 billion Total acquisitions: Over 24 companies since inception Focus areas: Payments, financial technology, banking services, and digital solutions Products Fiserv offers multiple products, including: Carat, a platform that organizes payments and experiences for large businesses CardHub, which allows customers to get digital payment cards Clover, for small businesses to accept payments at the point of sale, as well as to track sales Pinch Payments, a payment facilitator providing embedded card processing and direct debit to SaaS and to small businesses via proprietary SaaS that integrates with Xero, Quickbooks and MYOB."
}