{
  "ticker": "FITB",
  "cik": "0000035527",
  "company_name": "Fifth Third Bancorp",
  "corrected_name": "Fifth Third Bancorp",
  "wiki_title_used": "Fifth Third Bancorp",
  "exists": true,
  "raw_text": "Fifth Third Bancorp is a bank holding company headquartered in Cincinnati, Ohio. It is the parent company of Fifth Third Bank (5/3 Bank), which operates 1,100 branches and 2,400 automated teller machines, across 12 states: Ohio, Florida, Georgia, Illinois, Indiana, Kentucky, Michigan, North Carolina, South Carolina, Tennessee, Alabama, and West Virginia. It is on the list of largest banks in the United States and is ranked 321st on the Fortune 500. The name \"Fifth Third\" is derived from the names of the bank's two predecessor companies, Fifth National Bank and Third National Bank, which merged in 1908.\n\nHistory\nPre-merger (1858-1908)\nOn June 17, 1858, the Bank of the Ohio Valley, founded by William W. Scarborough, opened in Cincinnati, Ohio. On June 23, 1863, the Third National Bank was organized. On April 29, 1871, Third National Bank acquired Bank of the Ohio Valley. In 1888, Queen City National Bank changed its name to Fifth National Bank.\n\nMerger of Third National Bank and Fifth National Bank (1908)\nOn June 1, 1908, Third National Bank and Fifth National Bank merged to become the Fifth–Third National Bank of Cincinnati; the hyphen was later dropped. The merger took place when prohibitionist ideas were gaining popularity, and it is a legend that \"Fifth Third\" was better than \"Third Fifth\", which could have been construed as a reference to three fifths of alcohol. The name went through several changes—the most recent being Fifth Third Union Trust Company—until March 24, 1969, when it was changed to Fifth Third Bank.\n\nPost-merger\nIn 1999, the bank acquired Emerald Financial for $204 million.\nIn November 2008, the United States Department of the Treasury invested $3.4 billion in the company as part of the Troubled Asset Relief Program and in February 2011, the company repurchased the investment from the Treasury.\nIn 2009, Fifth Third completed the corporate spin-off of Fifth Third Processing Solutions, which was acquired by Worldpay, Inc. in 2012.\nIn May 2018, Fifth Third acquired MB Financial in a $4.7 billion transaction.\nIn August 2020, the bank partnered with Trust & Will.\nIn May 2022, Fifth Third acquired Dividend Finance, a San Francisco–based residential solar power lender.\nIn May 2023, the bank acquired Rize Money. Also in May 2023, the bank acquired Big Data Healthcare.\nIn 2025, Fifth Third was ranked as offering the best mobile banking app experience in a J.D. Power survey.\nOn October 6, 2025, Fifth Third announced that it signed a definitive agreement to acquire Comerica Bank for $10.9 billion. If approved by regulators, the all-stock deal is expected to close in March 2026; existing Fifth Third shareholders would own about 73% of the combined company, and existing Comerica shareholders would own about 27%. The combined entity would be the ninth-largest bank in the United States, and is reportedly expected to phase out the Comerica brand by 2027.\n\nLawsuits\nIn September 2015, the US Department of Justice and the Consumer Financial Protection Bureau announced an $18 million settlement to resolve allegations that Fifth Third Bank engaged in a pattern or practice of discrimination against African–American and Hispanic borrowers in its indirect auto lending business.\nIn December 2016, small business owners sued Fifth Third, along with Vantiv and National Processing Company, for violating telemarketing laws. On August 4, 2022, a $50 million settlement was finalized.\nOn March 9, 2020, the Consumer Financial Protection Bureau (CFPB) charged Fifth Third with illegal cross-selling; the suit was resolved in 2024 with the bank paying $20 million and taking remedial actions. A class action suit was filed on behalf of former MB Financial shareholders, alleging that the cross-selling strategy artificially inflated Fifth Third's stock price and thus MB Financial's shareholders were not honestly compensated when the purchase occurred. The case was settled on September 14, 2023, with Fifth Third paying former MB Financial shareholders $5.5 million.\nOn April 27, 2023, a jury ruled Fifth Third breached its Early Access loan program, but customers were not awarded damages because they had been fully informed of the terms. Fifth Third listed the APR estimate of 120%, the actual number was higher if the loan was paid off early due to the fee structure.\nOn March 8, 2024, the Minnesota Attorney General filed suit against Fifth Third subsidiary Dividend Finance and three other lending companies (GoodLeap, Sunlight Financial, and Solar Mosaic), following an investigation that uncovered they charged Minnesotans $35 million in hidden fees on nearly 5,000 loans to finance sales of residential solar panels. The lawsuit alleges the lenders violated Minnesota state laws against deceptive trade practices, deceptive lending, and illegally high rates of interest.\n\nNotable corporate buildings\nNaming rights and sponsorships\nFifth Third Bank is a sponsor of the following:\n\nSee also\nBanks portal\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Fifth Third Bank:",
  "clean_text": "Fifth Third Bancorp is a bank holding company headquartered in Cincinnati, Ohio. It is the parent company of Fifth Third Bank (5/3 Bank), which operates 1,100 branches and 2,400 automated teller machines, across 12 states: Ohio, Florida, Georgia, Illinois, Indiana, Kentucky, Michigan, North Carolina, South Carolina, Tennessee, Alabama, and West Virginia. It is on the list of largest banks in the United States and is ranked 321st on the Fortune 500. The name \"Fifth Third\" is derived from the names of the bank's two predecessor companies, Fifth National Bank and Third National Bank, which merged in 1908. History Pre-merger (1858-1908) On June 17, 1858, the Bank of the Ohio Valley, founded by William W. Scarborough, opened in Cincinnati, Ohio. On June 23, 1863, the Third National Bank was organized. On April 29, 1871, Third National Bank acquired Bank of the Ohio Valley. In 1888, Queen City National Bank changed its name to Fifth National Bank. Merger of Third National Bank and Fifth National Bank (1908) On June 1, 1908, Third National Bank and Fifth National Bank merged to become the Fifth–Third National Bank of Cincinnati; the hyphen was later dropped. The merger took place when prohibitionist ideas were gaining popularity, and it is a legend that \"Fifth Third\" was better than \"Third Fifth\", which could have been construed as a reference to three fifths of alcohol. The name went through several changes—the most recent being Fifth Third Union Trust Company—until March 24, 1969, when it was changed to Fifth Third Bank. Post-merger In 1999, the bank acquired Emerald Financial for $204 million. In November 2008, the United States Department of the Treasury invested $3.4 billion in the company as part of the Troubled Asset Relief Program and in February 2011, the company repurchased the investment from the Treasury. In 2009, Fifth Third completed the corporate spin-off of Fifth Third Processing Solutions, which was acquired by Worldpay, Inc. in 2012. In May 2018, Fifth Third acquired MB Financial in a $4.7 billion transaction. In August 2020, the bank partnered with Trust & Will. In May 2022, Fifth Third acquired Dividend Finance, a San Francisco–based residential solar power lender. In May 2023, the bank acquired Rize Money. Also in May 2023, the bank acquired Big Data Healthcare. In 2025, Fifth Third was ranked as offering the best mobile banking app experience in a J.D. Power survey. On October 6, 2025, Fifth Third announced that it signed a definitive agreement to acquire Comerica Bank for $10.9 billion. If approved by regulators, the all-stock deal is expected to close in March 2026; existing Fifth Third shareholders would own about 73% of the combined company, and existing Comerica shareholders would own about 27%. The combined entity would be the ninth-largest bank in the United States, and is reportedly expected to phase out the Comerica brand by 2027. Lawsuits In September 2015, the US Department of Justice and the Consumer Financial Protection Bureau announced an $18 million settlement to resolve allegations that Fifth Third Bank engaged in a pattern or practice of discrimination against African–American and Hispanic borrowers in its indirect auto lending business. In December 2016, small business owners sued Fifth Third, along with Vantiv and National Processing Company, for violating telemarketing laws. On August 4, 2022, a $50 million settlement was finalized. On March 9, 2020, the Consumer Financial Protection Bureau (CFPB) charged Fifth Third with illegal cross-selling; the suit was resolved in 2024 with the bank paying $20 million and taking remedial actions. A class action suit was filed on behalf of former MB Financial shareholders, alleging that the cross-selling strategy artificially inflated Fifth Third's stock price and thus MB Financial's shareholders were not honestly compensated when the purchase occurred. The case was settled on September 14, 2023, with Fifth Third paying former MB Financial shareholders $5.5 million. On April 27, 2023, a jury ruled Fifth Third breached its Early Access loan program, but customers were not awarded damages because they had been fully informed of the terms. Fifth Third listed the APR estimate of 120%, the actual number was higher if the loan was paid off early due to the fee structure. On March 8, 2024, the Minnesota Attorney General filed suit against Fifth Third subsidiary Dividend Finance and three other lending companies (GoodLeap, Sunlight Financial, and Solar Mosaic), following an investigation that uncovered they charged Minnesotans $35 million in hidden fees on nearly 5,000 loans to finance sales of residential solar panels. The lawsuit alleges the lenders violated Minnesota state laws against deceptive trade practices, deceptive lending, and illegally high rates of interest. Notable corporate buildings Naming rights and sponsorships Fifth Third Bank is a sponsor of the following:"
}