{
  "ticker": "FOX",
  "cik": "0001754301",
  "company_name": "Fox Corporation (Class B)",
  "corrected_name": "Fox Corporation",
  "wiki_title_used": "Fox Corporation",
  "exists": true,
  "raw_text": "Fox Corporation (commonly referred to as Fox Corp or simply Fox) is an American multinational mass media company headquartered at 1211 Avenue of the Americas in Midtown Manhattan and incorporated in Reno, Nevada, with offices also in Burbank, California. Named after William Fox and incorporated in Delaware, it was formed as a spin-off of 21st Century Fox's television broadcasting, news, and sports assets on March 19, 2019. 21CF went defunct the next day. The company is controlled by Lachlan Murdoch through a family trust with 36% voting shares. Rupert Murdoch is chairman emeritus, while his son Lachlan Murdoch is chairman and CEO.  \nFox Corp deals primarily in the television broadcast, news, and sports broadcasting industries. Its assets include Fox Broadcasting Company, Fox Television Stations, Fox News, Fox Business, Fox Sports, Tubi, Fox One and others. Murdoch's newspaper interests and other media assets are held by News Corp, which is also under his control and was split from News Corporation in 2013, alongside 21CF. On September 21, 2023, Rupert Murdoch announced that he was retiring as the chairman of Fox Corp, effective November 2023.\n\nHistory\nFormation\nOn December 14, 2017, the Walt Disney Company announced its intent to acquire the motion picture, television production, cable entertainment, and direct broadcast satellite divisions of 21st Century Fox (the former News Corporation, which spun off its publishing assets in 2013), including 20th Century Fox and FX Networks, for $52.4 billion. The remainder of the company would form a so-called \"New Fox\", maintaining control of assets such as Fox's television network and broadcast stations (which Disney, already owning ABC, would be legally unable to own due to an FCC policy known as the \"dual network rule\", which prohibits mergers between the top broadcast networks), Fox News, the national operations of Fox Sports, and the 20th Century Fox studio lot, which would be leased to Disney for seven years. Fox's regional sports networks were also included in the sale, but were later divested by order of the Department of Justice, on the grounds that the Fox regional networks' combination with Disney's 80% ownership of ESPN would make Disney too dominant in the cable sports market.\nIn May 2018, it was confirmed that Lachlan Murdoch, rather than James Murdoch, would take charge of the New Fox company.\nIn mid-2018, NBCUniversal's parent company Comcast instigated bidding wars over both the Fox assets Disney planned to purchase, and the British broadcaster Sky plc (a company that 21st Century Fox held a stake in, and was planning to acquire the remainder). In July 2018, Fox agreed to an increase of Disney's offer to $71.3 billion to fend off Comcast's counter-bid. British regulators ordered that a blind auction be held for Sky's assets, which was won by Comcast.\nOn October 10, 2018, it was reported that in preparation for the impending completion of the sale, the new, post-merger organizational structure of \"New Fox\" would be implemented by January 1, 2019. On November 14, 2018, it was revealed that the new independent company would maintain the original Fox name. On January 7, 2019, Fox Corporation's registration statement was filed by the U.S. Securities and Exchange Commission.\nOn January 11, 2019, Fox stated in a securities filing that it had no plans to bid on its former regional sports networks; they would instead go to a consortium led by Sinclair Broadcast Group, with Fox Corp continuing to license the FSN name to those stations until Sinclair developed a new brand (the networks would eventually become Bally Sports). On March 12, 2019, Disney announced that the sale would be completed by March 20, 2019. On March 19, 2019, Fox Corp officially began trading on the S&P 500, replacing 21st Century Fox on the index. Republican politician and former Speaker of the House Paul Ryan also joined Fox Corp's board at this time.\nUnder the terms of the acquisition, Disney would remove the Fox brand usage by 2024, to avoid confusion with Fox Corp.\n\nOperations\nFox Corp began operating separately on March 19, 2019. Chairman and CEO Lachlan Murdoch led a town hall meeting three days later, indicating that stock would be issued to the corporation's employees based on longevity.\nIn May 2019, via the Fox Sports division, Fox Corp acquired a 4.99% stake in Canadian online gambling operator The Stars Group for $236 million. As a result, it was also announced that the companies would co-develop sports betting products for the U.S. market under the branding Fox Bet.\nIn early July 2019, Fox Entertainment announced the formation of SideCar, with executives led by Gail Berman. SideCar was a content development unit for Fox and other outlets. In June 2020, SideCar was shut down by Fox.\nIn August 2019, Fox Corp acquired a 67-percent majority stake in Credible Labs for $397 million and animation studio Bento Box Entertainment for $50 million. On April 20, 2020, Fox Corp acquired streaming service Tubi for $440 million. In September 2021, Fox Corp acquired TMZ from WarnerMedia in a deal worth about $50 million, with TMZ being operated under the Fox Entertainment division. In December 2021, Fox Corp acquired the film and television production studio MarVista Entertainment.\nIn September 2022, Fox Corp announced the launch of Fox Entertainment Studios. This is the company's first venture into entirely in-house television production. The studio's first show, Monarch, premiered on September 11, 2022. Fox also announced that Fox Entertainment would re-enter the international distribution business by launching a sales unit called Fox Entertainment Global.\nOn October 14, 2022, it was announced that, under the instruction of Rupert Murdoch, a special committee had been established to explore a potential merger of Fox and News Corp, bringing the two companies back together since the former 21st Century Fox was spun-off from News Corp in 2013.  Although Lachlan Murdoch supported his father in the proposal, James Murdoch opposed it, as did many shareholders. On January 24, 2023, the proposed merger was abandoned by Murdoch.\nIn April 2023, Fox announced it would be forming Tubi Media Group. This would be a standalone digital business unit, encompassing Tubi, Credible Labs, Blockchain Creative Labs, along with several other Fox digital sports, news and entertainment platforms and teams, in which Paul Cheesbrough was announced as CEO.\nIn September 2024, Rupert Murdoch applied to a Nevada probate court to remove voting rights from his children other than Lachlan, as set out in the irrevocable family trust. The other siblings, Prudence MacLeod, Elisabeth Murdoch, and James Murdoch, are more moderate politically than their father or brother, and Rupert was keen to keep the conservative political bias in his media outlets. On December 9, 2024, The New York Times reported that the court had ruled against the Murdochs, who, the probate commissioner wrote, had acted in bad faith when trying to change the trust. \nIn February 2025, Fox acquired the podcast and media company Red Seat Ventures, in a move to expand Fox's reach into the podcast market. Red Seat Ventures would continue to operate as an independent company, and be placed under Tubi Media Group.\nIn May 2025, Fox announced plans to launch Fox One, a new American streaming service targeting cord-cutters and cord-nevers, which includes the Fox broadcast network and the company's cable channels. The service launched on August 21.\nIn June 2025, Fox announced the acquisition of Caliente TV, a Mexican sports broadcasting platform. As a result, this would allow Fox to expand its portfolio of sports-related programming as well as establishing a firmer hold in sports broadcasting in Mexico. To help lead this company, Fox named Carlos Martinez as executive vice president and managing director of Latin America for the Fox Corp.\nIn July 2025, Fox Corporation announced that it would acquire a one-third stake in Penske Entertainment, parent company of the IndyCar Series and Indianapolis Motor Speedway. The acquisition includes an unspecified extension of its media rights to the IndyCar Series, which began in the 2025 season.\nIn October 2025, Fox Entertainment invested in vertical video company Holywater. As part of the deal, Fox Entertainment Studios will create and produce more than 200 vertical video titles for My Drama over the next two years.\n\nAssets\nThe company consists of the former 21st Century Fox's media and broadcasting properties that were owned by its predecessor, such as the Fox Broadcasting Company and Fox Sports Media Group.\n\nSee also\nSuccession of Rupert Murdoch – a 2024 court case\n\nReferences\nExternal links\nOfficial website \nBusiness data for Fox Corporation (Class A): \nBusiness data for Fox Corporation (Class B):",
  "clean_text": "Fox Corporation (commonly referred to as Fox Corp or simply Fox) is an American multinational mass media company headquartered at 1211 Avenue of the Americas in Midtown Manhattan and incorporated in Reno, Nevada, with offices also in Burbank, California. Named after William Fox and incorporated in Delaware, it was formed as a spin-off of 21st Century Fox's television broadcasting, news, and sports assets on March 19, 2019. 21CF went defunct the next day. The company is controlled by Lachlan Murdoch through a family trust with 36% voting shares. Rupert Murdoch is chairman emeritus, while his son Lachlan Murdoch is chairman and CEO. Fox Corp deals primarily in the television broadcast, news, and sports broadcasting industries. Its assets include Fox Broadcasting Company, Fox Television Stations, Fox News, Fox Business, Fox Sports, Tubi, Fox One and others. Murdoch's newspaper interests and other media assets are held by News Corp, which is also under his control and was split from News Corporation in 2013, alongside 21CF. On September 21, 2023, Rupert Murdoch announced that he was retiring as the chairman of Fox Corp, effective November 2023. History Formation On December 14, 2017, the Walt Disney Company announced its intent to acquire the motion picture, television production, cable entertainment, and direct broadcast satellite divisions of 21st Century Fox (the former News Corporation, which spun off its publishing assets in 2013), including 20th Century Fox and FX Networks, for $52.4 billion. The remainder of the company would form a so-called \"New Fox\", maintaining control of assets such as Fox's television network and broadcast stations (which Disney, already owning ABC, would be legally unable to own due to an FCC policy known as the \"dual network rule\", which prohibits mergers between the top broadcast networks), Fox News, the national operations of Fox Sports, and the 20th Century Fox studio lot, which would be leased to Disney for seven years. Fox's regional sports networks were also included in the sale, but were later divested by order of the Department of Justice, on the grounds that the Fox regional networks' combination with Disney's 80% ownership of ESPN would make Disney too dominant in the cable sports market. In May 2018, it was confirmed that Lachlan Murdoch, rather than James Murdoch, would take charge of the New Fox company. In mid-2018, NBCUniversal's parent company Comcast instigated bidding wars over both the Fox assets Disney planned to purchase, and the British broadcaster Sky plc (a company that 21st Century Fox held a stake in, and was planning to acquire the remainder). In July 2018, Fox agreed to an increase of Disney's offer to $71.3 billion to fend off Comcast's counter-bid. British regulators ordered that a blind auction be held for Sky's assets, which was won by Comcast. On October 10, 2018, it was reported that in preparation for the impending completion of the sale, the new, post-merger organizational structure of \"New Fox\" would be implemented by January 1, 2019. On November 14, 2018, it was revealed that the new independent company would maintain the original Fox name. On January 7, 2019, Fox Corporation's registration statement was filed by the U.S. Securities and Exchange Commission. On January 11, 2019, Fox stated in a securities filing that it had no plans to bid on its former regional sports networks; they would instead go to a consortium led by Sinclair Broadcast Group, with Fox Corp continuing to license the FSN name to those stations until Sinclair developed a new brand (the networks would eventually become Bally Sports). On March 12, 2019, Disney announced that the sale would be completed by March 20, 2019. On March 19, 2019, Fox Corp officially began trading on the S&P 500, replacing 21st Century Fox on the index. Republican politician and former Speaker of the House Paul Ryan also joined Fox Corp's board at this time. Under the terms of the acquisition, Disney would remove the Fox brand usage by 2024, to avoid confusion with Fox Corp. Operations Fox Corp began operating separately on March 19, 2019. Chairman and CEO Lachlan Murdoch led a town hall meeting three days later, indicating that stock would be issued to the corporation's employees based on longevity. In May 2019, via the Fox Sports division, Fox Corp acquired a 4.99% stake in Canadian online gambling operator The Stars Group for $236 million. As a result, it was also announced that the companies would co-develop sports betting products for the U.S. market under the branding Fox Bet. In early July 2019, Fox Entertainment announced the formation of SideCar, with executives led by Gail Berman. SideCar was a content development unit for Fox and other outlets. In June 2020, SideCar was shut down by Fox. In August 2019, Fox Corp acquired a 67-percent majority stake in Credible Labs for $397 million and animation studio Bento Box Entertainment for $50 million. On April 20, 2020, Fox Corp acquired streaming service Tubi for $440 million. In September 2021, Fox Corp acquired TMZ from WarnerMedia in a deal worth about $50 million, with TMZ being operated under the Fox Entertainment division. In December 2021, Fox Corp acquired the film and television production studio MarVista Entertainment. In September 2022, Fox Corp announced the launch of Fox Entertainment Studios. This is the company's first venture into entirely in-house television production. The studio's first show, Monarch, premiered on September 11, 2022. Fox also announced that Fox Entertainment would re-enter the international distribution business by launching a sales unit called Fox Entertainment Global. On October 14, 2022, it was announced that, under the instruction of Rupert Murdoch, a special committee had been established to explore a potential merger of Fox and News Corp, bringing the two companies back together since the former 21st Century Fox was spun-off from News Corp in 2013. Although Lachlan Murdoch supported his father in the proposal, James Murdoch opposed it, as did many shareholders. On January 24, 2023, the proposed merger was abandoned by Murdoch. In April 2023, Fox announced it would be forming Tubi Media Group. This would be a standalone digital business unit, encompassing Tubi, Credible Labs, Blockchain Creative Labs, along with several other Fox digital sports, news and entertainment platforms and teams, in which Paul Cheesbrough was announced as CEO. In September 2024, Rupert Murdoch applied to a Nevada probate court to remove voting rights from his children other than Lachlan, as set out in the irrevocable family trust. The other siblings, Prudence MacLeod, Elisabeth Murdoch, and James Murdoch, are more moderate politically than their father or brother, and Rupert was keen to keep the conservative political bias in his media outlets. On December 9, 2024, The New York Times reported that the court had ruled against the Murdochs, who, the probate commissioner wrote, had acted in bad faith when trying to change the trust. In February 2025, Fox acquired the podcast and media company Red Seat Ventures, in a move to expand Fox's reach into the podcast market. Red Seat Ventures would continue to operate as an independent company, and be placed under Tubi Media Group. In May 2025, Fox announced plans to launch Fox One, a new American streaming service targeting cord-cutters and cord-nevers, which includes the Fox broadcast network and the company's cable channels. The service launched on August 21. In June 2025, Fox announced the acquisition of Caliente TV, a Mexican sports broadcasting platform. As a result, this would allow Fox to expand its portfolio of sports-related programming as well as establishing a firmer hold in sports broadcasting in Mexico. To help lead this company, Fox named Carlos Martinez as executive vice president and managing director of Latin America for the Fox Corp. In July 2025, Fox Corporation announced that it would acquire a one-third stake in Penske Entertainment, parent company of the IndyCar Series and Indianapolis Motor Speedway. The acquisition includes an unspecified extension of its media rights to the IndyCar Series, which began in the 2025 season. In October 2025, Fox Entertainment invested in vertical video company Holywater. As part of the deal, Fox Entertainment Studios will create and produce more than 200 vertical video titles for My Drama over the next two years. Assets The company consists of the former 21st Century Fox's media and broadcasting properties that were owned by its predecessor, such as the Fox Broadcasting Company and Fox Sports Media Group."
}