{
  "ticker": "FSLR",
  "cik": "0001274494",
  "company_name": "First Solar",
  "corrected_name": "First Solar",
  "wiki_title_used": "First Solar",
  "exists": true,
  "raw_text": "First Solar, Inc. is a publicly traded American manufacturer of solar panels. It provides end-of-life panel recycling at each of its manufacturing facilities. First Solar uses rigid thin-film modules for its solar panels, and produces CdTe panels using cadmium telluride (CdTe) as a semiconductor. \nThe company was founded in 1990 by inventor Harold McMaster as Solar Cells, Inc. In 1999 it was purchased by True North Partners, LLC, which rebranded it as First Solar, Inc. \nThe company went public in 2006, trading on the NASDAQ as FSLR. It has been listed on the Photovoltaik Global 30 Index since the beginning of this stock index in 2009. Its current chief executive is Mark Widmar, who succeeded the previous CEO, James Hughes, July 1, 2016. \nThe Arizona-based manufacturer opened a $1.1 billion manufacturing facility in Alabama in September 2024. The company operates three manufacturing facilities in Ohio and is currently constructing a $1.1 billion 3.5 GW plant in Louisiana (expected to come online in late 2025). Once the Louisiana facility is operational, the company expects to have more than 14 GW of domestic capacity by 2026.\n\nTechnology\nFirst Solar manufactures cadmium telluride (CdTe)-based photovoltaic (PV) modules, which produce electricity with a thin film CdTe semiconductor. This technology provides superior performance in degradation rate, temperature coefficient, spectral response, and shading response. At each First Solar manufacturing facility, a vertically integrated, continuous process enables full quality control under one roof, converting a sheet of glass into a fully functional solar panel in approximately four hours.4 First Solar’s manufacturing process uses 98 percent less semiconductor material than traditional crystalline silicon solar panels and yields the lowest carbon footprint, lowest water footprint, and fastest energy payback time in the industry.\nIn 2013, the company produced CdTe-panels with an efficiency of about 14 percent at a reported cost of 59 cents per watt. In August 2019, researchers from NREL and First Solar published a Nature Energy article demonstrating a way to achieve 20.8% solar cell efficiency.\nFirst Solar’s CuRe technology, currently incorporated into its Series 6 Plus V2 modules, provides an industry-best warranted annual degradation rate of 0.1%.\nThe company has invested a cumulative $2 billion + in the research and development of its technology.\nSolar modules\n\nSeries 6 Plus\nSeries 6 Plus Bifacial — added bifacial energy yield\nSeries 6 Plus V2 with CuRe technology — reduces long-term degradation\nSeries 6 Plus SHL — designed for coastal regions with higher wind loads\nSeries 7\n\nHistory\nIn 1984, inventor and entrepreneur Harold McMaster founded Glasstech Solar. After trying amorphous silicon, he shifted to CdTe and founded Solar Cells, Inc. (SCI) in 1990. In February 1999, SCI was acquired by True North Partners, which then formed First Solar, LLC.\nThe company is headquartered in Tempe, Arizona, and has manufacturing facilities in Perrysburg, Ohio; Trinity, Alabama; New Iberia, Louisiana; Kulim, Malaysia; Ho Chi Minh City, Vietnam; and Chennai, India.\nAt the end of 2009, First Solar had surpassed an energy power production rate of 1 GW and was the largest producer of PV cells in the world. That same year, First Solar became the first solar panel manufacturing company to lower its manufacturing cost to $1 per watt. \nIn July 2010, First Solar formed a utility systems business group to address the large-scale PV systems solutions market. Utility systems are now the company's core business focus, with a strategy to focus on markets that do not require subsidies to support the solar generation business.\nOn April 17, 2012, First Solar announced it would restructure operations worldwide. This restructuring process included phasing out operations in Frankfurt (Oder), Germany and idling four production lines in Kulim, Malaysia. Approximately 30% of First Solar's workforce was laid off as a result of these actions, which were blamed on market volatility and reduced demand. Mark Widmar, then the CFO of First Solar, said, \"We need to resize our business to a level of demand that is highly reliable and predictable.\"\nOn July 1, 2016, Mark Widmar was appointed CEO of First Solar. Previously he had been chief financial officer. Former CEO Mike Ahearn remains chairman of the board. \nAs of 2022, First Solar was considered the fourth-largest solar company on American stock exchanges by 12-month trailing revenue. \nIn 2022, under the Inflation Reduction Act, First Solar became the biggest beneficiary of $1 trillion in environmental spending. First Solar executives and lobbyists met at least four times in late 2022 and 2023 with administration officials who oversaw the measure’s environmental provisions. Democratic donors had invested heavily in the company prior to the act being signed into law.\nIn May 2023, First Solar acquired Evolar, a European company that provided perovskite technology. The deal was valued at $38M USD.\nIn 2024, First Solar communicated an audit had discovered use of forced labor in a Malaysian factory that produces parts for the company.\nIn 2024, First Solar commissioned a new research and development (R&D) innovation center in Lake Township, Ohio, which is believed to be the largest facility of its kind in the Western Hemisphere. The 1.3 million square-foot Jim Nolan Center for Solar Innovation is dedicated to the late James “Jim” F. Nolan, a former member of First Solar’s Board of Directors and the architect of the company’s CdTe semiconductor platform.\nRecognition\n\n2025: Named one of “America’s Most Responsible Companies” by Newsweek and Statista (fourth consecutive year)\n2025: Ranked #14 on the “Global 100 Most Sustainable Corporations in the World” by Corporate Knights\n2024: Named one of “World’s Best Companies” by TIME and Statista\n2024: Named one of “15 Climate Tech Companies to Watch” by MIT Technology Review\n2024: First solar company to achieve the EPEAT Climate+ designation, which helps purchasers and investors prioritize ultra-low carbon solar technologies that meaningfully support decarbonization efforts.\n2012 & 2013: Listed as No. 1 in Solar Power World magazine's rankings of solar contractors.\n2012: Ranked sixth in Fast Company's list of the world's 50 most innovative companies.\n2011: Ranked first on Forbes's list of America's 25 fastest-growing technology companies.\n\nMarket history\nHistorically, First Solar sold its products to solar project developers, system integrators, and independent power producers. Early sales were primarily in Germany because of strong incentives for solar enacted in the German Renewable Energy Sources Act (EEG) of 2000 (cp. Solar power in Germany). Declines and uncertainty in feed-in-tariff subsidies for solar power in European markets, including Germany, France, Italy and Spain, prompted major PV manufacturers, such as First Solar, to accelerate their expansion into other markets, including the U.S., India and China.\nBeginning in December 2011, First Solar shifted away from existing markets that are heavily dependent on government subsidies and toward providing utility-scale PV systems in sustainable markets with immediate need. As a result, it began competing against conventional power generators, and has reduced its focus on the rooftop market.\nOn February 24, 2009, First Solar's cost per watt broke $1 reaching $0.98. In 2023, the company sold 11.4 GW of solar modules. Production costs of 18.8 cents/watt were forecast in February 2024, with average sales prices of 18.2 cent/kWh for sales of around 16 GW in 2024. In 2024, the company sold a record 14.1 GW of solar modules.\nFirst Solar sold $857 million in Inflation Reduction Act transferable tax credits generated from its U.S.-based manufacturing facilities in February 2025. The tax credits are from the sale of solar modules produced in 2024 at First Solar’s U.S. manufacturing facilities, including three factories in Ohio and a new Alabama facility.\n\nProduction history\nCommercial production started in Perrysburg, Ohio, in 2002. Between 2007 and 2012, production grew with additional plants in Frankfurt (Oder) in Germany; Kulim Hi-Tech Park in Malaysia; and France. The German and French factories are no longer in operation. Other locations considered for expansions before 2012 included Mesa, Arizona. International expansion has also included new factories in Ho Chim Minh City, Vietnam (commissioned in 2018) and Tamil Nadu, India (2024). Two new manufacturing facilities were commissioned in Ohio (in 2019 and 2023). A new manufacturing facility was commission in Trinity, Alabama, in 2024, followed by a new facility in New Iberia, Louisiana, in 2025.\nFirst Solar's 2024 Sustainability Report highlights findings related to Environmental, Social, and Governance (ESG) metrics, including modern slavery and forced labor findings. Report findings shared with media support the company's proactive efforts and due diligence to address human right violations within the solar power supply chain as they are discovered. First Solar's products have been released by U.S. Customs and Border Protection and comply with the Uyghur Forced Labor Prevention Act.\n\nFirst Solar sold $857 million in Inflation Reduction Act transferable tax credits generated from its U.S.-based manufacturing facilities. The tax credits were from the sale of solar modules produced in 2024 at First Solar’s U.S. manufacturing facilities, including three factories in Ohio and the new Alabama facility.\n\nMarket performance\nWhile First Solar witnessed record sales of over $3.37 billion in 2012, its restructuring efforts impacted the bottom line, leading to a net loss of $96.3 million – or $1.11 per share – for the year.\nHistorically, the low cost of First Solar's modules has been the key to its market performance. The use of cadmium telluride instead of silicon allowed it to achieve a significantly lower module cost ($0.67 per watt), compared to crystalline-silicon PV, which averaged $1.85 per watt in 2010.\nAs the company shifts its focus away from module sales to utility-scale projects, it will need to become price competitive with non-solar power sources, a move which its executives say will require the company to reduce manufacturing costs and optimize efficiency.\n\nInstallations\nFirst Solar had installed 1,505 MW of solar capacity as of 2012. As of 2019, First Solar has over 17GW deployed globally. Below are some of First Solar's solar installations and development projects:\n\nNorth America\n802 MW Copper Mountain Solar Facility near Boulder City, NV, constructed in 5 phases for Sempra Energy and Consolidated Edison.\n550 MW Topaz Solar Farm in San Luis Obispo County, CA, acquired by MidAmerican Energy Holdings.\n550 MW Desert Sunlight Solar Farm in Riverside County, CA, acquired by NextEra Energy and GE Energy Financial Services.\n290 MW Agua Caliente Solar Project in Yuma County, AZ, constructed for NRG Energy and MidAmerican Renewables.\n230 MW Antelope Valley Solar Ranch in Los Angeles, CA, completed 2014 and acquired by Exelon Corp.\n80 MW Sarnia Solar Farm in Ontario, Canada, completed, owned by Enbridge.\n50 MW Silver State North Solar Project, in Boulder County, NV, completed, acquired by Enbridge.\n\nEurope, Middle East, and North Africa\nMohammed bin Rashid Al Maktoum Solar Park in Saih Al-Dahal, UAE, includes a 13 MWDC solar power plant built by First Solar for the Dubai Electricity & Water Authority (DEWA).\nStadtwerke Trier (SWT) in Trier, Germany, is one of the world's largest thin-film solar plants. As of February 2009, it was estimated the facility would produce over 9 GWh per year, which would supply power to more than 2,400 homes each year. Additionally, it is estimated the facility will conserve 100,000 tons of CO2 over 20 years.\nThe Ramat Hovav solar field is the largest PV power plant built so far in Israel's solar power sector. Constructed by Belectric over a previous evaporation pond, it has a nominal capacity of 37.5 MW. The facility became fully operational in December 2014.\nWaldpolenz Solar Park near Leipzig, Germany, was built and developed by Juwi Group, and has a capacity of 40 MW. The facility became fully operational in 2008.\nIn December 2009, the Lieberose Photovoltaic Park, Germany's biggest conversion land project (126 hectares) on a former military training area, was opened with an output of 53 MW. The solar park uses 700,000 solar modules.\nFor the Sports Stadium Bentegodi in Verona, Italy, First Solar supplied more than 13,000 thin film modules for a rooftop installation.\n\nAsia and Australia\n10 MW Greenough River Solar Farm in Western Australia, completed for Verve Energy and GE Energy Financial Services.\n159 MW AGL Energy projects, to be constructed in Nyngan and Broken Hill, New South Wales. The 53 MW Broken Hill project was completed in 2015.\n\nSee also\nThin film solar cell\nCadmium telluride photovoltaics\nCopper indium gallium selenide (CIGS)\nPhotovoltaic power stations\nSolarCity\nSolar power in Germany\n5N Plus Inc.\n\nReferences\nExternal links\nOfficial website\nBusiness data for First Solar, Inc.:",
  "clean_text": "First Solar, Inc. is a publicly traded American manufacturer of solar panels. It provides end-of-life panel recycling at each of its manufacturing facilities. First Solar uses rigid thin-film modules for its solar panels, and produces CdTe panels using cadmium telluride (CdTe) as a semiconductor. The company was founded in 1990 by inventor Harold McMaster as Solar Cells, Inc. In 1999 it was purchased by True North Partners, LLC, which rebranded it as First Solar, Inc. The company went public in 2006, trading on the NASDAQ as FSLR. It has been listed on the Photovoltaik Global 30 Index since the beginning of this stock index in 2009. Its current chief executive is Mark Widmar, who succeeded the previous CEO, James Hughes, July 1, 2016. The Arizona-based manufacturer opened a $1.1 billion manufacturing facility in Alabama in September 2024. The company operates three manufacturing facilities in Ohio and is currently constructing a $1.1 billion 3.5 GW plant in Louisiana (expected to come online in late 2025). Once the Louisiana facility is operational, the company expects to have more than 14 GW of domestic capacity by 2026. Technology First Solar manufactures cadmium telluride (CdTe)-based photovoltaic (PV) modules, which produce electricity with a thin film CdTe semiconductor. This technology provides superior performance in degradation rate, temperature coefficient, spectral response, and shading response. At each First Solar manufacturing facility, a vertically integrated, continuous process enables full quality control under one roof, converting a sheet of glass into a fully functional solar panel in approximately four hours.4 First Solar’s manufacturing process uses 98 percent less semiconductor material than traditional crystalline silicon solar panels and yields the lowest carbon footprint, lowest water footprint, and fastest energy payback time in the industry. In 2013, the company produced CdTe-panels with an efficiency of about 14 percent at a reported cost of 59 cents per watt. In August 2019, researchers from NREL and First Solar published a Nature Energy article demonstrating a way to achieve 20.8% solar cell efficiency. First Solar’s CuRe technology, currently incorporated into its Series 6 Plus V2 modules, provides an industry-best warranted annual degradation rate of 0.1%. The company has invested a cumulative $2 billion + in the research and development of its technology. Solar modules Series 6 Plus Series 6 Plus Bifacial — added bifacial energy yield Series 6 Plus V2 with CuRe technology — reduces long-term degradation Series 6 Plus SHL — designed for coastal regions with higher wind loads Series 7 History In 1984, inventor and entrepreneur Harold McMaster founded Glasstech Solar. After trying amorphous silicon, he shifted to CdTe and founded Solar Cells, Inc. (SCI) in 1990. In February 1999, SCI was acquired by True North Partners, which then formed First Solar, LLC. The company is headquartered in Tempe, Arizona, and has manufacturing facilities in Perrysburg, Ohio; Trinity, Alabama; New Iberia, Louisiana; Kulim, Malaysia; Ho Chi Minh City, Vietnam; and Chennai, India. At the end of 2009, First Solar had surpassed an energy power production rate of 1 GW and was the largest producer of PV cells in the world. That same year, First Solar became the first solar panel manufacturing company to lower its manufacturing cost to $1 per watt. In July 2010, First Solar formed a utility systems business group to address the large-scale PV systems solutions market. Utility systems are now the company's core business focus, with a strategy to focus on markets that do not require subsidies to support the solar generation business. On April 17, 2012, First Solar announced it would restructure operations worldwide. This restructuring process included phasing out operations in Frankfurt (Oder), Germany and idling four production lines in Kulim, Malaysia. Approximately 30% of First Solar's workforce was laid off as a result of these actions, which were blamed on market volatility and reduced demand. Mark Widmar, then the CFO of First Solar, said, \"We need to resize our business to a level of demand that is highly reliable and predictable.\" On July 1, 2016, Mark Widmar was appointed CEO of First Solar. Previously he had been chief financial officer. Former CEO Mike Ahearn remains chairman of the board. As of 2022, First Solar was considered the fourth-largest solar company on American stock exchanges by 12-month trailing revenue. In 2022, under the Inflation Reduction Act, First Solar became the biggest beneficiary of $1 trillion in environmental spending. First Solar executives and lobbyists met at least four times in late 2022 and 2023 with administration officials who oversaw the measure’s environmental provisions. Democratic donors had invested heavily in the company prior to the act being signed into law. In May 2023, First Solar acquired Evolar, a European company that provided perovskite technology. The deal was valued at $38M USD. In 2024, First Solar communicated an audit had discovered use of forced labor in a Malaysian factory that produces parts for the company. In 2024, First Solar commissioned a new research and development (R&D) innovation center in Lake Township, Ohio, which is believed to be the largest facility of its kind in the Western Hemisphere. The 1.3 million square-foot Jim Nolan Center for Solar Innovation is dedicated to the late James “Jim” F. Nolan, a former member of First Solar’s Board of Directors and the architect of the company’s CdTe semiconductor platform. Recognition 2025: Named one of “America’s Most Responsible Companies” by Newsweek and Statista (fourth consecutive year) 2025: Ranked #14 on the “Global 100 Most Sustainable Corporations in the World” by Corporate Knights 2024: Named one of “World’s Best Companies” by TIME and Statista 2024: Named one of “15 Climate Tech Companies to Watch” by MIT Technology Review 2024: First solar company to achieve the EPEAT Climate+ designation, which helps purchasers and investors prioritize ultra-low carbon solar technologies that meaningfully support decarbonization efforts. 2012 & 2013: Listed as No. 1 in Solar Power World magazine's rankings of solar contractors. 2012: Ranked sixth in Fast Company's list of the world's 50 most innovative companies. 2011: Ranked first on Forbes's list of America's 25 fastest-growing technology companies. Market history Historically, First Solar sold its products to solar project developers, system integrators, and independent power producers. Early sales were primarily in Germany because of strong incentives for solar enacted in the German Renewable Energy Sources Act (EEG) of 2000 (cp. Solar power in Germany). Declines and uncertainty in feed-in-tariff subsidies for solar power in European markets, including Germany, France, Italy and Spain, prompted major PV manufacturers, such as First Solar, to accelerate their expansion into other markets, including the U.S., India and China. Beginning in December 2011, First Solar shifted away from existing markets that are heavily dependent on government subsidies and toward providing utility-scale PV systems in sustainable markets with immediate need. As a result, it began competing against conventional power generators, and has reduced its focus on the rooftop market. On February 24, 2009, First Solar's cost per watt broke $1 reaching $0.98. In 2023, the company sold 11.4 GW of solar modules. Production costs of 18.8 cents/watt were forecast in February 2024, with average sales prices of 18.2 cent/kWh for sales of around 16 GW in 2024. In 2024, the company sold a record 14.1 GW of solar modules. First Solar sold $857 million in Inflation Reduction Act transferable tax credits generated from its U.S.-based manufacturing facilities in February 2025. The tax credits are from the sale of solar modules produced in 2024 at First Solar’s U.S. manufacturing facilities, including three factories in Ohio and a new Alabama facility. Production history Commercial production started in Perrysburg, Ohio, in 2002. Between 2007 and 2012, production grew with additional plants in Frankfurt (Oder) in Germany; Kulim Hi-Tech Park in Malaysia; and France. The German and French factories are no longer in operation. Other locations considered for expansions before 2012 included Mesa, Arizona. International expansion has also included new factories in Ho Chim Minh City, Vietnam (commissioned in 2018) and Tamil Nadu, India (2024). Two new manufacturing facilities were commissioned in Ohio (in 2019 and 2023). A new manufacturing facility was commission in Trinity, Alabama, in 2024, followed by a new facility in New Iberia, Louisiana, in 2025. First Solar's 2024 Sustainability Report highlights findings related to Environmental, Social, and Governance (ESG) metrics, including modern slavery and forced labor findings. Report findings shared with media support the company's proactive efforts and due diligence to address human right violations within the solar power supply chain as they are discovered. First Solar's products have been released by U.S. Customs and Border Protection and comply with the Uyghur Forced Labor Prevention Act. First Solar sold $857 million in Inflation Reduction Act transferable tax credits generated from its U.S.-based manufacturing facilities. The tax credits were from the sale of solar modules produced in 2024 at First Solar’s U.S. manufacturing facilities, including three factories in Ohio and the new Alabama facility. Market performance While First Solar witnessed record sales of over $3.37 billion in 2012, its restructuring efforts impacted the bottom line, leading to a net loss of $96.3 million – or $1.11 per share – for the year. Historically, the low cost of First Solar's modules has been the key to its market performance. The use of cadmium telluride instead of silicon allowed it to achieve a significantly lower module cost ($0.67 per watt), compared to crystalline-silicon PV, which averaged $1.85 per watt in 2010. As the company shifts its focus away from module sales to utility-scale projects, it will need to become price competitive with non-solar power sources, a move which its executives say will require the company to reduce manufacturing costs and optimize efficiency. Installations First Solar had installed 1,505 MW of solar capacity as of 2012. As of 2019, First Solar has over 17GW deployed globally. Below are some of First Solar's solar installations and development projects: North America 802 MW Copper Mountain Solar Facility near Boulder City, NV, constructed in 5 phases for Sempra Energy and Consolidated Edison. 550 MW Topaz Solar Farm in San Luis Obispo County, CA, acquired by MidAmerican Energy Holdings. 550 MW Desert Sunlight Solar Farm in Riverside County, CA, acquired by NextEra Energy and GE Energy Financial Services. 290 MW Agua Caliente Solar Project in Yuma County, AZ, constructed for NRG Energy and MidAmerican Renewables. 230 MW Antelope Valley Solar Ranch in Los Angeles, CA, completed 2014 and acquired by Exelon Corp. 80 MW Sarnia Solar Farm in Ontario, Canada, completed, owned by Enbridge. 50 MW Silver State North Solar Project, in Boulder County, NV, completed, acquired by Enbridge. Europe, Middle East, and North Africa Mohammed bin Rashid Al Maktoum Solar Park in Saih Al-Dahal, UAE, includes a 13 MWDC solar power plant built by First Solar for the Dubai Electricity & Water Authority (DEWA). Stadtwerke Trier (SWT) in Trier, Germany, is one of the world's largest thin-film solar plants. As of February 2009, it was estimated the facility would produce over 9 GWh per year, which would supply power to more than 2,400 homes each year. Additionally, it is estimated the facility will conserve 100,000 tons of CO2 over 20 years. The Ramat Hovav solar field is the largest PV power plant built so far in Israel's solar power sector. Constructed by Belectric over a previous evaporation pond, it has a nominal capacity of 37.5 MW. The facility became fully operational in December 2014. Waldpolenz Solar Park near Leipzig, Germany, was built and developed by Juwi Group, and has a capacity of 40 MW. The facility became fully operational in 2008. In December 2009, the Lieberose Photovoltaic Park, Germany's biggest conversion land project (126 hectares) on a former military training area, was opened with an output of 53 MW. The solar park uses 700,000 solar modules. For the Sports Stadium Bentegodi in Verona, Italy, First Solar supplied more than 13,000 thin film modules for a rooftop installation. Asia and Australia 10 MW Greenough River Solar Farm in Western Australia, completed for Verve Energy and GE Energy Financial Services. 159 MW AGL Energy projects, to be constructed in Nyngan and Broken Hill, New South Wales. The 53 MW Broken Hill project was completed in 2015."
}