{
  "ticker": "FTV",
  "cik": "0001659166",
  "company_name": "Fortive",
  "corrected_name": "Fortive",
  "wiki_title_used": "Fortive",
  "exists": true,
  "raw_text": "Fortive Corporation is an American industrial technology conglomerate company headquartered in Everett, Washington. The company specializes in providing essential technologies for connected workflow solutions; designing, developing, manufacturing and distributing professional and engineered products, software and services. Their products and services are split into three strategic segments; Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions. As of December 2022, Fortive has over 18,000 employees in 60 countries worldwide. \nFortive was spun off from Danaher in July 2016. Brothers Steven and Mitchell Rales, Danaher's founders, retained board seats with Fortive after the separation. At the point of its independent incorporation, Fortive immediately became a component of the S&P 500. Later the transportation, automation and franchise distribution businesses would be spun off. In 2018 and 2019, Fortune named Fortive as a Future 50 company. In 2020, Fortune named Fortive one of the world's most admired companies.\n\nAcquisitions\n2016\nIn September 2016, Fortive subsidiary Fluke, which specializes in electronic test equipment, acquired eMaint, a CMMS IIoT system. In October 2016, another subsidiary Gilbarco Veeder-Root which specializes in industrial sales software, purchased Global Transportation Technologies (GTT), a provider in traffic management.\n\n2017\nIn July 2017, Fortive acquired Pittsburgh-based Industrial Scientific, which manufactures gas detection products. Fortive established their second quarters in the Industrial Scientific building housing many of their data science and analytics teams.\nIn September 2017, Fortive purchased Landauer for $770 million. Landauer is a provider of subscription-based technical and analytical services to determine occupational and environmental radiation exposure, as well as a domestic provider of outsourced medical physics services. They are headquartered in Glenwood, Illinois.\nFortive subsidiary Gilbarco Veeder Root acquired Orpak Systems, which delivers technologies to oil companies and commercial fleets.\n\n2018\nIn July 2018, Fortive announced it was buying software firm Accruent for about $2 billion. Accruent makes software to track real estate and facilities. Also in July 2018, Fortive announced it would buy construction software company Gordian for $775 million from private equity firm Warburg Pincus. Gordian, based in Greenville, South Carolina, makes software that tracks costs of construction projects, manages facility operations and generally gives building companies more insight into big projects. In December 2018 Tektronix acquired Initial State.\n\n2019\nIn June 2018, Fortive made a binding offer to buy Johnson & Johnson's Advanced Sterilization Products (ASP) business. The deal was valued at $2.8 billion, made up of $2.7 billion in cash from Fortive and $0.1 billion of retained net receivables, and closed in April 2019. Furthering their investment in healthcare, in November 2019 Fortive acquired Censis Technologies, a SaaS-based provider of inventory management in the surgical field, headquartered in Franklin, Tenn., from Riverside, a global private equity firm headquartered in Cleveland Ohio. Terms of the deal were not disclosed.\nIn July 2019, Fluke acquired Germany based Pruftechnik, in precision laser shaft alignment, condition monitoring, and non-destructive testing, to further their reliability business unit.\nIn addition to previous acquisitions, like Predictive Solutions (Jan 2017) and ActiveBlu (2017), Industrial Scientific has made multiple acquisitions as part of Fortive. In June 2019 Industrial Scientific entered in a definitive agreement to buy Canadian based Intelex, a provider of SaaS-based Environmental, Health, Safety and Quality (EHSQ) management software. The following month (July 2019), Industrial Scientific entered a definitive agreement to acquire SAFER Systems, a provider for the chemical, oil & gas, and transportation industries.\n\n2020\nIn November, Intelex Technologies, a subsidiary of Industrial Scientific, announced that it has acquired ehsAI, a compliance automation technology provider.\n\n2021\nIn July Fortive exercised their option on TeamSense, finalizing the acquisition from PSL. Later that month, Fortive entered into a definitive agreement with Bayard Capital and Accel Partners to acquire ServiceChannel, a leading global provider of SaaS-based multi-site facilities maintenance service solutions with an integrated service-provider network. Fortive anticipates that the acquisition will close in the third quarter of 2021. ServiceChannel FY 2021 revenue expected to be approximately $125 million (recurring revenue of approximately $117 million); expected long-term revenue growth rate of mid-teens. This acquisition expected to enhance Fortive's revenue growth profile by approximately 50 basis points; anticipated to reach 10% ROIC target in 5 years. The purchase price for the acquisition is approximately $1.2 billion and is expected to be funded primarily with available cash. Upon closing, ServiceChannel is expected to be an independent operating company within Fortive's Intelligent Operating Solutions segment. ServiceChannel expands Fortive's leading offering of Facility and Asset Lifecycle workflow solutions, alongside Accruent and Gordian.  It was announced in December Fortive entered into an agreement to buy healthcare software maker Provation from private equity firm Clearlake Capital Group.\n\n2023\nIn October 2023, Fortive acquired German manufacturer Elektro-Automatik for $1.45 billion to strengthen Fortive's position in the electronic test and measurement market.\n\nDivestitures\nIn October 2018, Fortive spun off their automation businesses, namely, Kollmorgen, Thomson, Portescap, Jacobs Vehicle Systems, and associated subsidiaries to Altra Industrial Motion for an estimated $3 billion.\nIn September 2019, Fortive announced its intention to split into two separate publicly traded companies. In January 2020, the name of the new company was announced as Vontier. Vontier would comprise the transportation and franchises businesses. Specifically, the spin off would include Gilbarco Veeder Root, Matco Tools, Hennessey, GTT, Teletrac Navman, and associated subsidiaries. An IPO was estimated to yield $1 billion, but was postponed in April 2020 due to uncertainty in the market stemming from the COVID pandemic. Instead, Fortive chose to spin the business off to shareholders in October 2020 without first having the IPO. Upon separation, Vontier replaced Noble Energy as a member of the S&P 500.\nIn July 2025, Fortive spun off their precision technologies business into Ralliant Corporation, an independent, publicly traded company.\n\nInnovation\nHistorically, growth in Fortive's portfolio companies had primarily come from M&A activity and operational excellence under the vaunted Danaher Business System. Fortive has sought to achieve organic growth through establishing a culture of experimentation and innovation. Early on, this meant working with Innovators DNA to incorporate best practices. Fortive's approach has proved successful. Notable new product introductions have included Tektronix MS05X \"Elemental\", Fluke's T6, Invetech's Formulate and Fill platform, Anderson-Negele's paperless recorder, and Fluke's ii900. In the middle of the COVID pandemic, when there was a shortage of N-95 masks, ASP quickly innovated on existing technology to allow hospitals to clean masks.\nIn May 2020, Fortive partnered with Pioneer Square Labs (PSL) to launch tech startups. In June 2020, Fortive, in partnership with PSL, launched TeamSense.\n\nCulture\nFortive's culture dates back to the Toyota Production System adopted by Danaher. At Fortive it has been branded as the Fortive Business System or FBS for short. FBS has been referenced on multiple earnings calls as a key driver for sustained growth and operational excellence within the various operating companies. Fortive's culture around integrity and compliance has led to several initiatives around Inclusion and Diversity. Fortive has been named among the best places to work for LGBTQ Equality by the Human Rights Campaign several times.\nFortive allows each of its associates a paid day of leave each year to volunteer in their local community. In 2020, Newsweek named Fortive as one of their top 500 most responsible companies.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Fortive:",
  "clean_text": "Fortive Corporation is an American industrial technology conglomerate company headquartered in Everett, Washington. The company specializes in providing essential technologies for connected workflow solutions; designing, developing, manufacturing and distributing professional and engineered products, software and services. Their products and services are split into three strategic segments; Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions. As of December 2022, Fortive has over 18,000 employees in 60 countries worldwide. Fortive was spun off from Danaher in July 2016. Brothers Steven and Mitchell Rales, Danaher's founders, retained board seats with Fortive after the separation. At the point of its independent incorporation, Fortive immediately became a component of the S&P 500. Later the transportation, automation and franchise distribution businesses would be spun off. In 2018 and 2019, Fortune named Fortive as a Future 50 company. In 2020, Fortune named Fortive one of the world's most admired companies. Acquisitions 2016 In September 2016, Fortive subsidiary Fluke, which specializes in electronic test equipment, acquired eMaint, a CMMS IIoT system. In October 2016, another subsidiary Gilbarco Veeder-Root which specializes in industrial sales software, purchased Global Transportation Technologies (GTT), a provider in traffic management. 2017 In July 2017, Fortive acquired Pittsburgh-based Industrial Scientific, which manufactures gas detection products. Fortive established their second quarters in the Industrial Scientific building housing many of their data science and analytics teams. In September 2017, Fortive purchased Landauer for $770 million. Landauer is a provider of subscription-based technical and analytical services to determine occupational and environmental radiation exposure, as well as a domestic provider of outsourced medical physics services. They are headquartered in Glenwood, Illinois. Fortive subsidiary Gilbarco Veeder Root acquired Orpak Systems, which delivers technologies to oil companies and commercial fleets. 2018 In July 2018, Fortive announced it was buying software firm Accruent for about $2 billion. Accruent makes software to track real estate and facilities. Also in July 2018, Fortive announced it would buy construction software company Gordian for $775 million from private equity firm Warburg Pincus. Gordian, based in Greenville, South Carolina, makes software that tracks costs of construction projects, manages facility operations and generally gives building companies more insight into big projects. In December 2018 Tektronix acquired Initial State. 2019 In June 2018, Fortive made a binding offer to buy Johnson & Johnson's Advanced Sterilization Products (ASP) business. The deal was valued at $2.8 billion, made up of $2.7 billion in cash from Fortive and $0.1 billion of retained net receivables, and closed in April 2019. Furthering their investment in healthcare, in November 2019 Fortive acquired Censis Technologies, a SaaS-based provider of inventory management in the surgical field, headquartered in Franklin, Tenn., from Riverside, a global private equity firm headquartered in Cleveland Ohio. Terms of the deal were not disclosed. In July 2019, Fluke acquired Germany based Pruftechnik, in precision laser shaft alignment, condition monitoring, and non-destructive testing, to further their reliability business unit. In addition to previous acquisitions, like Predictive Solutions (Jan 2017) and ActiveBlu (2017), Industrial Scientific has made multiple acquisitions as part of Fortive. In June 2019 Industrial Scientific entered in a definitive agreement to buy Canadian based Intelex, a provider of SaaS-based Environmental, Health, Safety and Quality (EHSQ) management software. The following month (July 2019), Industrial Scientific entered a definitive agreement to acquire SAFER Systems, a provider for the chemical, oil & gas, and transportation industries. 2020 In November, Intelex Technologies, a subsidiary of Industrial Scientific, announced that it has acquired ehsAI, a compliance automation technology provider. 2021 In July Fortive exercised their option on TeamSense, finalizing the acquisition from PSL. Later that month, Fortive entered into a definitive agreement with Bayard Capital and Accel Partners to acquire ServiceChannel, a leading global provider of SaaS-based multi-site facilities maintenance service solutions with an integrated service-provider network. Fortive anticipates that the acquisition will close in the third quarter of 2021. ServiceChannel FY 2021 revenue expected to be approximately $125 million (recurring revenue of approximately $117 million); expected long-term revenue growth rate of mid-teens. This acquisition expected to enhance Fortive's revenue growth profile by approximately 50 basis points; anticipated to reach 10% ROIC target in 5 years. The purchase price for the acquisition is approximately $1.2 billion and is expected to be funded primarily with available cash. Upon closing, ServiceChannel is expected to be an independent operating company within Fortive's Intelligent Operating Solutions segment. ServiceChannel expands Fortive's leading offering of Facility and Asset Lifecycle workflow solutions, alongside Accruent and Gordian. It was announced in December Fortive entered into an agreement to buy healthcare software maker Provation from private equity firm Clearlake Capital Group. 2023 In October 2023, Fortive acquired German manufacturer Elektro-Automatik for $1.45 billion to strengthen Fortive's position in the electronic test and measurement market. Divestitures In October 2018, Fortive spun off their automation businesses, namely, Kollmorgen, Thomson, Portescap, Jacobs Vehicle Systems, and associated subsidiaries to Altra Industrial Motion for an estimated $3 billion. In September 2019, Fortive announced its intention to split into two separate publicly traded companies. In January 2020, the name of the new company was announced as Vontier. Vontier would comprise the transportation and franchises businesses. Specifically, the spin off would include Gilbarco Veeder Root, Matco Tools, Hennessey, GTT, Teletrac Navman, and associated subsidiaries. An IPO was estimated to yield $1 billion, but was postponed in April 2020 due to uncertainty in the market stemming from the COVID pandemic. Instead, Fortive chose to spin the business off to shareholders in October 2020 without first having the IPO. Upon separation, Vontier replaced Noble Energy as a member of the S&P 500. In July 2025, Fortive spun off their precision technologies business into Ralliant Corporation, an independent, publicly traded company. Innovation Historically, growth in Fortive's portfolio companies had primarily come from M&A activity and operational excellence under the vaunted Danaher Business System. Fortive has sought to achieve organic growth through establishing a culture of experimentation and innovation. Early on, this meant working with Innovators DNA to incorporate best practices. Fortive's approach has proved successful. Notable new product introductions have included Tektronix MS05X \"Elemental\", Fluke's T6, Invetech's Formulate and Fill platform, Anderson-Negele's paperless recorder, and Fluke's ii900. In the middle of the COVID pandemic, when there was a shortage of N-95 masks, ASP quickly innovated on existing technology to allow hospitals to clean masks. In May 2020, Fortive partnered with Pioneer Square Labs (PSL) to launch tech startups. In June 2020, Fortive, in partnership with PSL, launched TeamSense. Culture Fortive's culture dates back to the Toyota Production System adopted by Danaher. At Fortive it has been branded as the Fortive Business System or FBS for short. FBS has been referenced on multiple earnings calls as a key driver for sustained growth and operational excellence within the various operating companies. Fortive's culture around integrity and compliance has led to several initiatives around Inclusion and Diversity. Fortive has been named among the best places to work for LGBTQ Equality by the Human Rights Campaign several times. Fortive allows each of its associates a paid day of leave each year to volunteer in their local community. In 2020, Newsweek named Fortive as one of their top 500 most responsible companies."
}