{
  "ticker": "GD",
  "cik": "0000040533",
  "company_name": "General Dynamics",
  "corrected_name": "General Dynamics",
  "wiki_title_used": "General Dynamics",
  "exists": true,
  "raw_text": "General Dynamics Corporation (GD), headquartered in Reston, Virginia, is an American industrial and technology company. It is primarily a developer and producer of advanced military equipment of a wide variety, such as nuclear submarines, main battle tanks, and armoured fighting vehicles. It is also the manufacturer of the civilian aviation Gulfstream business jets and a provider of information technology services. The company is the 3rd largest of the top 100 contractors of the U.S. federal government; it receives over 3% of total spending by the federal government of the United States on contractors.\nThe company is ranked 96th on the Fortune 100 and 242nd on the Forbes Global 2000. In 2024, 69% of revenue was from the federal government of the United States, 14% was from U.S. commercial customers, 10% was from non-U.S. government customers and 7% was from non-U.S. commercial customers.\nThe company was formed in 1952 via the merger of submarine manufacturer Electric Boat and aircraft manufacturer Canadair.\n\nHistory\n1899–1920\nIsaac Leopold Rice bought the Holland Torpedo Boat Company from John Philip Holland in 1899. Holland continued to work at the company as chief engineer and the company was renamed Electric Boat Company. Electric Boat was responsible for designing and building the USS Holland, purchased by the United States Navy in 1900 for $150,000 (roughly $5.75M in 2025).\nElectric Boat also sold modified Holland-class and Plunger-class submarines to the British Royal Navy through the English armaments company Vickers as well as to Japan and Russia. In 1906, Electric Boat won contracts to design C-class submarines but subcontracted the construction to the Fore River Shipyard in Quincy, Massachusetts.\nWhen Holland passed away in 1914, Lawrence Spear (who replaced him as chief engineer) redesigned the Holland submarine. The redesign replaced the submarine's observation dome with a conning tower, a periscope, and first-of-its-kind torpedo tubes.\nIn 1911, Electric Boat acquired the New London Ship and Engine Company in Groton, Connecticut, to build parts for submarines, diesel engines, and commercial ships. Isaac Rice died in 1915 and was replaced by his associate Henry Carse. Carse expanded the company with the purchase of several companies, including Electro Dynamics, Elco Motor Yacht, and New London Ship & Engine of Groton, Connecticut. Following the acquisitions, the company was renamed Submarine Boat Corporation. During World War I, the company received orders from the U.S. Navy to build 85 submarines, 722 submarine chasers, and 118 surface ships.\n\n1921–1940\nIn 1924, the Peruvian government ordered two submarines built at the New London Ship & Engine shipyard in Groton, Connecticut. In 1925, Carse reorganized the company, emphasized production of surface ships, and brought back the Electric Boat Company. In 1933, Electric Boat expanded its presence in Groton, Connecticut, by acquiring a second shipyard to build submarines. The USS Cuttlefish was the first submarine built at the Groton Shipyard. In the early 1930s, the U.S. government placed orders for submarines and PT (patrol/torpedo) boats from Electric Boat facilities at Groton and the Elco plant in New Jersey, respectively. Lawrence Spear retired in 1937, replaced by John Jay Hopkins. Hopkins led the company's strong re-emergence as a shipbuilder in World War II.\n\n1941–1960\nDuring World War II, Electric Boat and its Elco Yacht and Electro Dynamic subsidiaries mobilized full-capacity production. The sudden production expansion led to a labor shortage, and women filled the open jobs as welders and riveters. During World War II, Electric Boat produced 74 submarines and 398 PT boats. When the war ended in 1945, the Navy reduced its orders for new vessels, and the company reduced its workforce from 13,000 to 4,000.\nElectric Boat diversified at the end of WWII, so John Jay Hopkins acquired the Canadian government-owned Canadair for $10 million in 1946. The factory alone was worth more than $22 million, according to the Canadian government's calculations, excluding the value of the remaining contracts for planes or spare parts. However, Canadair's production line and inventory systems were in disorder when Electric Boat purchased the company. Hopkins hired Canadian-born mass-production specialist H. Oliver West to take over the president's role and return Canadair to profitability. Shortly after the takeover, Canadair began delivering its new Canadair North Star (a version of the Douglas DC-4) and was able to deliver aircraft to Trans-Canada Airlines, Canadian Pacific Airlines, and British Overseas, and Airways Corporation (BOAC) well in advance of their contracted delivery times.\nDefense spending increased with the onset of the Cold War, and Canadair went on to win many Canadian military contracts for the Royal Canadian Air Force and became a major aerospace company. These included Canadair CT-133 Silver Star trainer, the Canadair Argus long-range maritime reconnaissance and transport aircraft, and the Canadair F-86 Sabre. Between 1950 and 1958, 1,815 Sabres were built. Canadair also produced 200 CF-104 Starfighter supersonic fighter aircraft, a license-built version of the Lockheed F-104.\nIn 1951, the company was awarded the contract to build the world's first nuclear-powered submarine, the USS Nautilus (SSN571). The submarine was launched in 1954.\nAircraft production became increasingly important at Canadair, and Hopkins argued that the name \"Electric Boat\" was no longer appropriate. In 1952, Hopkins established the General Dynamics Corporation as a parent company holding Electric Boat and Canadair. \nIn 1953, General Dynamics (GD) purchased Convair from the Atlas Group. The sale was approved by government oversight with the provision that GD would continue to operate out of Air Force Plant 4 in Fort Worth, Texas. This factory had been set up in order to spread out strategic aircraft production, and it was rented to Convair during the war to produce B-24 Liberator bombers. Convair worked as an independent division inside General Dynamics and, over the next decade, developed the F-106 Delta Dart interceptor, the B-58 Hustler bomber, and the Convair 880 and 990 airliners. Convair also developed the Atlas missile, the U.S.'s first operational intercontinental ballistic missile. Convair led the development of the American nuclear aircraft program, which the Pentagon enthusiastically supported. CEO Hopkins was a strong advocate of nuclear power and its numerous applications, but the nuclear airplane, or 'N-bomber,' was later found to be impractical, and the project was abandoned. \nIn the late 1950s, General Dynamics hired Erik Nitsche as a graphic designer to develop corporate reports and advertising material designs, including the \"Atoms for Peace\" series of posters for the 1955 International Conference on Peaceful Uses of Atomic Energy in Geneva, Switzerland. These designs have become iconic examples of the mid-century modernist graphic design style.\nIn 1957, Hopkins fell seriously ill and was replaced by Frank Pace later that year. John Naish succeeded Joseph McNarney as president of Convair. In the same year, General Dynamics purchased Liquid Carbonic Corporation in September 1957 and controlled it as a wholly owned subsidiary. \nIn 1959, the U.S. Navy commissioned Electric Boat to design and build the first fleet ballistic-missile submarine, USS George Washington (SSBN598). The George Washington-class ballistic missile submarines were derived from the Skipjack-class submarine design, with a 130-foot missile compartment inserted between the control and reactor sections. The USS George Washington (SSBN-598) was initially laid down as the Skipjack-class USS Scorpion (SSN-589), but was repurposed during construction to accommodate the Polaris missile system. Materials from other planned attack submarines, including USS Sculpin (SSN-590), were also reallocated to the program.\nThe same year, Chicago industrialist Henry Crown became the company's largest shareholder and merged his Material Service Corporation with General Dynamics in 1959. General Dynamics subsequently reorganized into Eastern Group in New York City and Western Group in San Diego, California, with the latter taking over all of the aerospace activities and dropping the Convair brand name from its aircraft in the process. The board decided to build all future planes in Fort Worth, Texas, ending plane production at Convair's original plant in San Diego, California, but continuing with space and missile development there.\n\n1961–1980\nIn 1961, Secretary of Defense Robert McNamara initiated the Tactical Fighter Experimental (TFX) program to develop a single aircraft design for the Air Force, Navy, and Marine Corps. General Dynamics and Boeing were selected to submit updated designs. McNamara selected General Dynamics' proposal due to the greater commonality between its versions. The Boeing aircraft shared less than half of the major structural components. The F-111's design pioneered variable-sweep wings, after-burning turbofan engines, and automated terrain-following radar for low-level, high-speed flight. General Dynamics continued to develop its version of the F-111 at the former Convair facility in Fort Worth, Texas. The company built 563 F-111s. \nIn 1962, Roger Lewis was appointed Chairman and CEO of General Dynamics. In 1963, General Dynamics purchased the Quincy Shipbuilding Works from Bethlehem Steel. In 1965, General Dynamics reorganized into 12 operating divisions based on product lines. In 1967, Electric Boat launched the USS Sturgeon (SSN637), the lead ship in the Sturgeon class of attack submarines. In 1970, the board replaced Roger Lewis with former McDonnell Douglas president David S. Lewis as Chief Executive Officer. David S. Lewis relocated the company headquarters to St. Louis, Missouri, in 1971. Later that year, Electric Boat and Newport News Shipbuilding were awarded contracts to co-manufacture the Los Angeles-class submarines. In 1972, Electric Boat received contracts for the design and development of the Ohio-class ballistic missile submarine. Electric Boat also developed a new modular process to build the 560-foot submarines; the process remains the industry standard. Construction of the flagship Los Angeles-class attack submarine began the same year. In 1973, General Dynamics established the Quonset Point Facility in North Kingstown, Rhode Island, to provide off-site manufacturing support for the Groton facility. Production began the following year.\nThe U.S. Air Force initiated the Lightweight Fighter (LWF) program to develop a new fighter aircraft that met the requirements of Major John Boyd's \"energy-maneuverability\" theory. General Dynamics organized its own version of Lockheed's Skunk Works, the Advanced Concepts Laboratory, and responded with a new aircraft design incorporating advanced technologies. General Dynamics submitted a design in 1972 for a new lightweight fighter, the YF-16. The YF-16 first flew in January 1974 and proved slightly better performance than the Northrop Grumman YF-17 in head-to-head testing. General Dynamics YF-16 was selected as the first Lightweight Fighter for the U.S. Air Force. It entered production as the F-16 Fighting Falcon in January 1975 with an initial order of 650 and 1,388. The F-16 also won contracts worldwide, beating the F-17 in foreign competition. General Dynamics built an aircraft production factory in Fort Worth, Texas to fulfill the contracts, and F-16 orders eventually totaled more than 4,600, making it the company's largest aircraft program. \nIn 1975, General Dynamics Electric Boat broke ground on a land-level submarine construction facility in Groton, Connecticut.\n\nLand Systems and Marine Systems focus\nIn 1976, General Dynamics sold the struggling Canadair back to the Canadian government for $38 million. By 1984, General Dynamics had four divisions: Convair in San Diego, General Dynamics-Fort Worth, General Dynamics-Pomona, and General Dynamics-Electronics. In 1985 a further reorganization created the Space Systems Division from the Convair Space division. In 1985, GD also acquired Cessna. In 1986 the Pomona division (which mainly produced the Standard Missile and the Phalanx CIWS for the Navy) was split up, creating the Valley Systems Division. Valley Systems produced the Stinger surface-to-air missile and the Rolling Airframe Missile (RAM). Both units were recombined into one entity in 1992. In 1986, the General Dynamics Quincy Shipbuilding Division was closed.\nHenry Crown, still GD's largest shareholder, died on 15 August 1990. Following this, the company started to rapidly divest its under-performing divisions under CEO William Anders. Cessna was re-sold to Textron in January 1992, the San Diego and Pomona missile production units to General Motors-Hughes Aerospace in May 1992, the Fort Worth aircraft production to Lockheed in March 1993 (a nearby electronics production facility was separately sold to Israeli-based Elbit Systems, marking that company's entry into the US market), and its Space Systems Division to Martin Marietta in 1994. The remaining Convair Aircraft Structure unit was sold to McDonnell Douglas in 1994. The remains of the Convair Division were simply closed in 1996. GD's exit from the aviation world was short-lived, and in 1999 the company acquired Gulfstream Aerospace. The Pomona operation was closed shortly after its sale to Hughes Aircraft.\nIn 1995, General Dynamics purchased the privately held Bath Iron Works shipyard in Bath, Maine, for $300 million, diversifying its shipbuilding portfolio to include U.S. Navy surface ships such as guided-missile destroyers. In 1998, the company acquired NASSCO, formerly National Steel and Shipbuilding Company, for $415 million. The San Diego shipyard produces U.S. Navy auxiliary and support ships as well as commercial ships that are eligible to be U.S.-flagged under the Jones Act.\nHaving divested itself of its aviation holdings, GD concentrated on land and sea products. GD purchased Chrysler's defense divisions in 1982, renaming them General Dynamics Land Systems. In 2003, it purchased the defense divisions of General Motors as well. It is now a major supplier of armored vehicles of all types, including the M1 Abrams, LAV 25, Stryker, and a wide variety of vehicles based on these chassis. Force Protection, Inc. was acquired by General Dynamics Land Systems in November 2011 for $350 million.\n\nGeneral Dynamics UK\nIn 1997, General Dynamics acquired Computing Devices Ltd based in Hastings, England, which had developed avionics and mission systems for the Panavia Tornado, British Aerospace Harrier II and Hawker Siddeley Nimrod. In 2001, Computing Devices Canada (CDC) was awarded a contract from the UK Ministry of Defence to supply tactical communication systems for their Bowman program. The work for this was carried out at its new UK headquarters in Oakdale, Wales, and the company was renamed General Dynamics UK Limited. As of 2020, it comprises two business units: General Dynamics Land Systems – UK and General Dynamics Mission Systems – UK and operates in eight sites across the United Kingdom. It is currently responsible for delivering the General Dynamics Ajax family of armored vehicles, the Foxhound light protected patrol vehicle and the Morpheus communications system to the UK Ministry of Defence.\n\n21st century\nIn 2004, General Dynamics bid for the UK company Alvis plc, the leading British manufacturer of armored vehicles. In March the board of Alvis Vickers voted in favor of the £309m takeover. However at the last minute BAE Systems offered £355m for the company. This deal was finalized in June 2004.\nOn August 19, 2008, GD agreed to pay $4 million to settle a lawsuit brought by the US Government claiming that a GD unit fraudulently billed the government for defectively manufactured parts used in US military aircraft and submarines. The US alleged that GD defectively manufactured or failed to test parts used in US military aircraft from September 2001 to August 2003, such as for the C-141 Starlifter transport plane. The GD unit involved, based in Glen Cove, New York, closed in 2004.\nIn 2014, the government of Canada announced it had selected the General Dynamics Land Systems subsidiary in London, Ontario, to produce Light Armoured Vehicles for Saudi Arabia as part of a $10 billion deal with the Canadian Commercial Corporation. The sale has been criticized by political opponents because of the Saudi Arabian-led intervention in Yemen. In December 2018, after Prime Minister Justin Trudeau suggested Canada might scrap the deal, the company warned that doing so could lead to \"billions of dollars in liability\" and risk the loss of thousands of jobs. Trudeau has since said that while he is critical of Saudi conduct, he cannot simply scrap the deal because \"Canada as a country of the rule of law needs to respect its contracts.\" On 30 January 2019, CEO Phebe Novakovic warned investors that the matter had \"significantly impacted\" the company's cash flow because Saudi Arabia was nearly $2 billion in arrears on its payments.\nIn 2018, General Dynamics acquired information technology services giant CSRA for $9.7 billion, and merged it with GDIT.\nGeneral Dynamics has been accused by groups such as Code Pink and Green America of \"making money from human suffering by profiting off the migrant children held at U.S. detention camps\" due to its IT services contracts with the Department of Health and Human Services' Office of Refugee Resettlement, the government agency that operates shelters for unaccompanied children to include those separated from their families as part of the Trump administration family separation policy. The company says it has no role in constructing or operating detention centers, and that its contracts to provide training and technical services began in 2000 and have spanned across four presidential administrations.\nIt was announced in September 2018 that the U.S. Navy awarded contracts for 10 new Arleigh Burke-class destroyers from General Dynamics Bath Iron Works and Huntington Ingalls Industries.\nFormer U.S. Secretary of Defense General Jim Mattis re-joined the company's board of directors in August 2019. He had previously served on the board, but resigned and divested before becoming Secretary of Defense.\nIn September 2020, General Dynamics announced a strategic counter-drone partnership, providing General Dynamics' global network with access to Dedrone's complete drone detection and defeat technology.\nIn December 2020, the board of directors for General Dynamics announced a regular quarterly dividend of $1.10, payable on February 5, 2021.\nOn December 26, 2020, General Dynamics confirmed that their business division General Dynamics Land Systems was awarded a $4.6 billion contract by the U.S. Army for M1A2 SEPv3 Abrams main battle tanks.\nAccording to a report by Reuters, General Dynamics was the primary contractor for a United States military-run propaganda campaign to spread disinformation about the Sinovac Chinese COVID-19 vaccine, including using fake social media accounts to spread the disinformation that the Sinovac vaccine contained pork-derived ingredients and was therefore haram under Islamic law. The campaign primarily targeted people in the Philippines and used a social media hashtag for \"China is the virus\" in Tagalog. The campaign ran from the spring of 2020 to mid-2021. In 2024, General Dynamics IT was awarded a $493 million contract by The Pentagon. According to an unnamed source cited by Reuters, a military audit of General Dynamics's work on the project concluded that the company had engaged in sloppy tradecraft and took inadequate precautions to conceal the origins of the fake accounts created for the campaign.\nGeneral Dynamics' supply of weapons to Israel in the Gaza war has led to protests at facilities in Pittsfield, Massachusetts; Lincoln, Nebraska; Saco, Maine; New London, Connecticut; Red Lion, Pennsylvania;and Garland, Texas.\n\nOperations\nThe company's Gulfstream Aerospace division (23% of 2024 revenues) produces business jets including the Gulfstream G650/G700/G800 series and offers business aircraft services under Jet Aviation. The company's marine systems division (30% of 2024 revenues) designs and builds nuclear submarines and includes Bath Iron Works, General Dynamics Electric Boat, and National Steel and Shipbuilding Company. The company's combat systems division (19% of 2024 revenues) includes General Dynamics Land Systems, General Dynamics European Land Systems (GDELS), Steyr-Daimler-Puch, and Santa Bárbara Sistemas, and produces Phalanx CIWS, Expeditionary tanks, the M1 Abrams series main battle tank, Expeditionary Fighting Vehicles, M104 Wolverine, LAV III, Stryker armoured fighting vehicles, XM2001 Crusader self-propelled howitzer, GAU-17 (Minigun), GAU-19, ASCOD AFV, Pandur II, Mowag (including Mowag Duro, Mowag Eagle, and Mowag Piranha), Leopard 2E, and Scout SV. The company's technologies division (28% of 2024 revenues) includes General Dynamics Mission Systems and provides services such as consulting, mission-support, mobile communication, computers, command-and-control and cyber (C5) mission systems, and intelligence, surveillance and reconnaissance. It is modernizing the information technology systems of the United States Central Command and for the Centers for Medicare and Medicaid Services.\n\nAcquisitions timeline\n20th-century acquisitions\nCorporate affairs\nCorporate governance\nGeneral Dynamics current chairman and chief executive officer is Phebe Novakovic.\n\nAs of December 2022.\n\nFinancials\nAs of January 2023.\n\nCarbon emissions\nGeneral Dynamics reported Total CO2e emissions (Direct + Indirect) for 2021 at 696,118 mt (-8.7% year over year) and aims to reducing greenhouse gas emissions 40% by 2034. The company is on track to become carbon neutral before 2060.\n\nCompany demographics\nIn 2021, General Dynamics's U.S. workforce was 21% veterans, 23% female, and 27% people of color. The US Department of Labor awarded the company the 2021 HIRE Vets Gold Award. The company has 26 Employee Resource Groups serving 10 employee segments. Approximately 20% of the company's employees are represented by labor unions such as International Association of Machinists and Aerospace Workers (IAM), The International Union, and United Auto Workers (UAW). Independent research published by American Association of People with Disabilities (AAPD), U.S. Department of Labor, Military Times, U.S. Veterans Magazine, Professional Women's Magazine, Forbes, and Fortune selected General Dynamics as a top employer. General Dynamics' community contributions in 2021 were 70% in Education & Social Services, 18% in Arts & Culture, and 12% in Service Member Support.\n\nSee also\nTop 100 Contractors of the U.S. federal government\nList of companies headquartered in Northern Virginia\nList of military aircraft of the United States\nList of United States defense contractors\nList of current ships of the United States Navy\nList of currently active United States military land vehicles\nList of shipbuilders and shipyards\n\nReferences\nCitations\nSources\nExternal links\n\nOfficial website\nGeneral Dynamics European Land Systems (Gdels.com) site\nBusiness data for General Dynamics:",
  "clean_text": "General Dynamics Corporation (GD), headquartered in Reston, Virginia, is an American industrial and technology company. It is primarily a developer and producer of advanced military equipment of a wide variety, such as nuclear submarines, main battle tanks, and armoured fighting vehicles. It is also the manufacturer of the civilian aviation Gulfstream business jets and a provider of information technology services. The company is the 3rd largest of the top 100 contractors of the U.S. federal government; it receives over 3% of total spending by the federal government of the United States on contractors. The company is ranked 96th on the Fortune 100 and 242nd on the Forbes Global 2000. In 2024, 69% of revenue was from the federal government of the United States, 14% was from U.S. commercial customers, 10% was from non-U.S. government customers and 7% was from non-U.S. commercial customers. The company was formed in 1952 via the merger of submarine manufacturer Electric Boat and aircraft manufacturer Canadair. History 1899–1920 Isaac Leopold Rice bought the Holland Torpedo Boat Company from John Philip Holland in 1899. Holland continued to work at the company as chief engineer and the company was renamed Electric Boat Company. Electric Boat was responsible for designing and building the USS Holland, purchased by the United States Navy in 1900 for $150,000 (roughly $5.75M in 2025). Electric Boat also sold modified Holland-class and Plunger-class submarines to the British Royal Navy through the English armaments company Vickers as well as to Japan and Russia. In 1906, Electric Boat won contracts to design C-class submarines but subcontracted the construction to the Fore River Shipyard in Quincy, Massachusetts. When Holland passed away in 1914, Lawrence Spear (who replaced him as chief engineer) redesigned the Holland submarine. The redesign replaced the submarine's observation dome with a conning tower, a periscope, and first-of-its-kind torpedo tubes. In 1911, Electric Boat acquired the New London Ship and Engine Company in Groton, Connecticut, to build parts for submarines, diesel engines, and commercial ships. Isaac Rice died in 1915 and was replaced by his associate Henry Carse. Carse expanded the company with the purchase of several companies, including Electro Dynamics, Elco Motor Yacht, and New London Ship & Engine of Groton, Connecticut. Following the acquisitions, the company was renamed Submarine Boat Corporation. During World War I, the company received orders from the U.S. Navy to build 85 submarines, 722 submarine chasers, and 118 surface ships. 1921–1940 In 1924, the Peruvian government ordered two submarines built at the New London Ship & Engine shipyard in Groton, Connecticut. In 1925, Carse reorganized the company, emphasized production of surface ships, and brought back the Electric Boat Company. In 1933, Electric Boat expanded its presence in Groton, Connecticut, by acquiring a second shipyard to build submarines. The USS Cuttlefish was the first submarine built at the Groton Shipyard. In the early 1930s, the U.S. government placed orders for submarines and PT (patrol/torpedo) boats from Electric Boat facilities at Groton and the Elco plant in New Jersey, respectively. Lawrence Spear retired in 1937, replaced by John Jay Hopkins. Hopkins led the company's strong re-emergence as a shipbuilder in World War II. 1941–1960 During World War II, Electric Boat and its Elco Yacht and Electro Dynamic subsidiaries mobilized full-capacity production. The sudden production expansion led to a labor shortage, and women filled the open jobs as welders and riveters. During World War II, Electric Boat produced 74 submarines and 398 PT boats. When the war ended in 1945, the Navy reduced its orders for new vessels, and the company reduced its workforce from 13,000 to 4,000. Electric Boat diversified at the end of WWII, so John Jay Hopkins acquired the Canadian government-owned Canadair for $10 million in 1946. The factory alone was worth more than $22 million, according to the Canadian government's calculations, excluding the value of the remaining contracts for planes or spare parts. However, Canadair's production line and inventory systems were in disorder when Electric Boat purchased the company. Hopkins hired Canadian-born mass-production specialist H. Oliver West to take over the president's role and return Canadair to profitability. Shortly after the takeover, Canadair began delivering its new Canadair North Star (a version of the Douglas DC-4) and was able to deliver aircraft to Trans-Canada Airlines, Canadian Pacific Airlines, and British Overseas, and Airways Corporation (BOAC) well in advance of their contracted delivery times. Defense spending increased with the onset of the Cold War, and Canadair went on to win many Canadian military contracts for the Royal Canadian Air Force and became a major aerospace company. These included Canadair CT-133 Silver Star trainer, the Canadair Argus long-range maritime reconnaissance and transport aircraft, and the Canadair F-86 Sabre. Between 1950 and 1958, 1,815 Sabres were built. Canadair also produced 200 CF-104 Starfighter supersonic fighter aircraft, a license-built version of the Lockheed F-104. In 1951, the company was awarded the contract to build the world's first nuclear-powered submarine, the USS Nautilus (SSN571). The submarine was launched in 1954. Aircraft production became increasingly important at Canadair, and Hopkins argued that the name \"Electric Boat\" was no longer appropriate. In 1952, Hopkins established the General Dynamics Corporation as a parent company holding Electric Boat and Canadair. In 1953, General Dynamics (GD) purchased Convair from the Atlas Group. The sale was approved by government oversight with the provision that GD would continue to operate out of Air Force Plant 4 in Fort Worth, Texas. This factory had been set up in order to spread out strategic aircraft production, and it was rented to Convair during the war to produce B-24 Liberator bombers. Convair worked as an independent division inside General Dynamics and, over the next decade, developed the F-106 Delta Dart interceptor, the B-58 Hustler bomber, and the Convair 880 and 990 airliners. Convair also developed the Atlas missile, the U.S.'s first operational intercontinental ballistic missile. Convair led the development of the American nuclear aircraft program, which the Pentagon enthusiastically supported. CEO Hopkins was a strong advocate of nuclear power and its numerous applications, but the nuclear airplane, or 'N-bomber,' was later found to be impractical, and the project was abandoned. In the late 1950s, General Dynamics hired Erik Nitsche as a graphic designer to develop corporate reports and advertising material designs, including the \"Atoms for Peace\" series of posters for the 1955 International Conference on Peaceful Uses of Atomic Energy in Geneva, Switzerland. These designs have become iconic examples of the mid-century modernist graphic design style. In 1957, Hopkins fell seriously ill and was replaced by Frank Pace later that year. John Naish succeeded Joseph McNarney as president of Convair. In the same year, General Dynamics purchased Liquid Carbonic Corporation in September 1957 and controlled it as a wholly owned subsidiary. In 1959, the U.S. Navy commissioned Electric Boat to design and build the first fleet ballistic-missile submarine, USS George Washington (SSBN598). The George Washington-class ballistic missile submarines were derived from the Skipjack-class submarine design, with a 130-foot missile compartment inserted between the control and reactor sections. The USS George Washington (SSBN-598) was initially laid down as the Skipjack-class USS Scorpion (SSN-589), but was repurposed during construction to accommodate the Polaris missile system. Materials from other planned attack submarines, including USS Sculpin (SSN-590), were also reallocated to the program. The same year, Chicago industrialist Henry Crown became the company's largest shareholder and merged his Material Service Corporation with General Dynamics in 1959. General Dynamics subsequently reorganized into Eastern Group in New York City and Western Group in San Diego, California, with the latter taking over all of the aerospace activities and dropping the Convair brand name from its aircraft in the process. The board decided to build all future planes in Fort Worth, Texas, ending plane production at Convair's original plant in San Diego, California, but continuing with space and missile development there. 1961–1980 In 1961, Secretary of Defense Robert McNamara initiated the Tactical Fighter Experimental (TFX) program to develop a single aircraft design for the Air Force, Navy, and Marine Corps. General Dynamics and Boeing were selected to submit updated designs. McNamara selected General Dynamics' proposal due to the greater commonality between its versions. The Boeing aircraft shared less than half of the major structural components. The F-111's design pioneered variable-sweep wings, after-burning turbofan engines, and automated terrain-following radar for low-level, high-speed flight. General Dynamics continued to develop its version of the F-111 at the former Convair facility in Fort Worth, Texas. The company built 563 F-111s. In 1962, Roger Lewis was appointed Chairman and CEO of General Dynamics. In 1963, General Dynamics purchased the Quincy Shipbuilding Works from Bethlehem Steel. In 1965, General Dynamics reorganized into 12 operating divisions based on product lines. In 1967, Electric Boat launched the USS Sturgeon (SSN637), the lead ship in the Sturgeon class of attack submarines. In 1970, the board replaced Roger Lewis with former McDonnell Douglas president David S. Lewis as Chief Executive Officer. David S. Lewis relocated the company headquarters to St. Louis, Missouri, in 1971. Later that year, Electric Boat and Newport News Shipbuilding were awarded contracts to co-manufacture the Los Angeles-class submarines. In 1972, Electric Boat received contracts for the design and development of the Ohio-class ballistic missile submarine. Electric Boat also developed a new modular process to build the 560-foot submarines; the process remains the industry standard. Construction of the flagship Los Angeles-class attack submarine began the same year. In 1973, General Dynamics established the Quonset Point Facility in North Kingstown, Rhode Island, to provide off-site manufacturing support for the Groton facility. Production began the following year. The U.S. Air Force initiated the Lightweight Fighter (LWF) program to develop a new fighter aircraft that met the requirements of Major John Boyd's \"energy-maneuverability\" theory. General Dynamics organized its own version of Lockheed's Skunk Works, the Advanced Concepts Laboratory, and responded with a new aircraft design incorporating advanced technologies. General Dynamics submitted a design in 1972 for a new lightweight fighter, the YF-16. The YF-16 first flew in January 1974 and proved slightly better performance than the Northrop Grumman YF-17 in head-to-head testing. General Dynamics YF-16 was selected as the first Lightweight Fighter for the U.S. Air Force. It entered production as the F-16 Fighting Falcon in January 1975 with an initial order of 650 and 1,388. The F-16 also won contracts worldwide, beating the F-17 in foreign competition. General Dynamics built an aircraft production factory in Fort Worth, Texas to fulfill the contracts, and F-16 orders eventually totaled more than 4,600, making it the company's largest aircraft program. In 1975, General Dynamics Electric Boat broke ground on a land-level submarine construction facility in Groton, Connecticut. Land Systems and Marine Systems focus In 1976, General Dynamics sold the struggling Canadair back to the Canadian government for $38 million. By 1984, General Dynamics had four divisions: Convair in San Diego, General Dynamics-Fort Worth, General Dynamics-Pomona, and General Dynamics-Electronics. In 1985 a further reorganization created the Space Systems Division from the Convair Space division. In 1985, GD also acquired Cessna. In 1986 the Pomona division (which mainly produced the Standard Missile and the Phalanx CIWS for the Navy) was split up, creating the Valley Systems Division. Valley Systems produced the Stinger surface-to-air missile and the Rolling Airframe Missile (RAM). Both units were recombined into one entity in 1992. In 1986, the General Dynamics Quincy Shipbuilding Division was closed. Henry Crown, still GD's largest shareholder, died on 15 August 1990. Following this, the company started to rapidly divest its under-performing divisions under CEO William Anders. Cessna was re-sold to Textron in January 1992, the San Diego and Pomona missile production units to General Motors-Hughes Aerospace in May 1992, the Fort Worth aircraft production to Lockheed in March 1993 (a nearby electronics production facility was separately sold to Israeli-based Elbit Systems, marking that company's entry into the US market), and its Space Systems Division to Martin Marietta in 1994. The remaining Convair Aircraft Structure unit was sold to McDonnell Douglas in 1994. The remains of the Convair Division were simply closed in 1996. GD's exit from the aviation world was short-lived, and in 1999 the company acquired Gulfstream Aerospace. The Pomona operation was closed shortly after its sale to Hughes Aircraft. In 1995, General Dynamics purchased the privately held Bath Iron Works shipyard in Bath, Maine, for $300 million, diversifying its shipbuilding portfolio to include U.S. Navy surface ships such as guided-missile destroyers. In 1998, the company acquired NASSCO, formerly National Steel and Shipbuilding Company, for $415 million. The San Diego shipyard produces U.S. Navy auxiliary and support ships as well as commercial ships that are eligible to be U.S.-flagged under the Jones Act. Having divested itself of its aviation holdings, GD concentrated on land and sea products. GD purchased Chrysler's defense divisions in 1982, renaming them General Dynamics Land Systems. In 2003, it purchased the defense divisions of General Motors as well. It is now a major supplier of armored vehicles of all types, including the M1 Abrams, LAV 25, Stryker, and a wide variety of vehicles based on these chassis. Force Protection, Inc. was acquired by General Dynamics Land Systems in November 2011 for $350 million. General Dynamics UK In 1997, General Dynamics acquired Computing Devices Ltd based in Hastings, England, which had developed avionics and mission systems for the Panavia Tornado, British Aerospace Harrier II and Hawker Siddeley Nimrod. In 2001, Computing Devices Canada (CDC) was awarded a contract from the UK Ministry of Defence to supply tactical communication systems for their Bowman program. The work for this was carried out at its new UK headquarters in Oakdale, Wales, and the company was renamed General Dynamics UK Limited. As of 2020, it comprises two business units: General Dynamics Land Systems – UK and General Dynamics Mission Systems – UK and operates in eight sites across the United Kingdom. It is currently responsible for delivering the General Dynamics Ajax family of armored vehicles, the Foxhound light protected patrol vehicle and the Morpheus communications system to the UK Ministry of Defence. 21st century In 2004, General Dynamics bid for the UK company Alvis plc, the leading British manufacturer of armored vehicles. In March the board of Alvis Vickers voted in favor of the £309m takeover. However at the last minute BAE Systems offered £355m for the company. This deal was finalized in June 2004. On August 19, 2008, GD agreed to pay $4 million to settle a lawsuit brought by the US Government claiming that a GD unit fraudulently billed the government for defectively manufactured parts used in US military aircraft and submarines. The US alleged that GD defectively manufactured or failed to test parts used in US military aircraft from September 2001 to August 2003, such as for the C-141 Starlifter transport plane. The GD unit involved, based in Glen Cove, New York, closed in 2004. In 2014, the government of Canada announced it had selected the General Dynamics Land Systems subsidiary in London, Ontario, to produce Light Armoured Vehicles for Saudi Arabia as part of a $10 billion deal with the Canadian Commercial Corporation. The sale has been criticized by political opponents because of the Saudi Arabian-led intervention in Yemen. In December 2018, after Prime Minister Justin Trudeau suggested Canada might scrap the deal, the company warned that doing so could lead to \"billions of dollars in liability\" and risk the loss of thousands of jobs. Trudeau has since said that while he is critical of Saudi conduct, he cannot simply scrap the deal because \"Canada as a country of the rule of law needs to respect its contracts.\" On 30 January 2019, CEO Phebe Novakovic warned investors that the matter had \"significantly impacted\" the company's cash flow because Saudi Arabia was nearly $2 billion in arrears on its payments. In 2018, General Dynamics acquired information technology services giant CSRA for $9.7 billion, and merged it with GDIT. General Dynamics has been accused by groups such as Code Pink and Green America of \"making money from human suffering by profiting off the migrant children held at U.S. detention camps\" due to its IT services contracts with the Department of Health and Human Services' Office of Refugee Resettlement, the government agency that operates shelters for unaccompanied children to include those separated from their families as part of the Trump administration family separation policy. The company says it has no role in constructing or operating detention centers, and that its contracts to provide training and technical services began in 2000 and have spanned across four presidential administrations. It was announced in September 2018 that the U.S. Navy awarded contracts for 10 new Arleigh Burke-class destroyers from General Dynamics Bath Iron Works and Huntington Ingalls Industries. Former U.S. Secretary of Defense General Jim Mattis re-joined the company's board of directors in August 2019. He had previously served on the board, but resigned and divested before becoming Secretary of Defense. In September 2020, General Dynamics announced a strategic counter-drone partnership, providing General Dynamics' global network with access to Dedrone's complete drone detection and defeat technology. In December 2020, the board of directors for General Dynamics announced a regular quarterly dividend of $1.10, payable on February 5, 2021. On December 26, 2020, General Dynamics confirmed that their business division General Dynamics Land Systems was awarded a $4.6 billion contract by the U.S. Army for M1A2 SEPv3 Abrams main battle tanks. According to a report by Reuters, General Dynamics was the primary contractor for a United States military-run propaganda campaign to spread disinformation about the Sinovac Chinese COVID-19 vaccine, including using fake social media accounts to spread the disinformation that the Sinovac vaccine contained pork-derived ingredients and was therefore haram under Islamic law. The campaign primarily targeted people in the Philippines and used a social media hashtag for \"China is the virus\" in Tagalog. The campaign ran from the spring of 2020 to mid-2021. In 2024, General Dynamics IT was awarded a $493 million contract by The Pentagon. According to an unnamed source cited by Reuters, a military audit of General Dynamics's work on the project concluded that the company had engaged in sloppy tradecraft and took inadequate precautions to conceal the origins of the fake accounts created for the campaign. General Dynamics' supply of weapons to Israel in the Gaza war has led to protests at facilities in Pittsfield, Massachusetts; Lincoln, Nebraska; Saco, Maine; New London, Connecticut; Red Lion, Pennsylvania;and Garland, Texas. Operations The company's Gulfstream Aerospace division (23% of 2024 revenues) produces business jets including the Gulfstream G650/G700/G800 series and offers business aircraft services under Jet Aviation. The company's marine systems division (30% of 2024 revenues) designs and builds nuclear submarines and includes Bath Iron Works, General Dynamics Electric Boat, and National Steel and Shipbuilding Company. The company's combat systems division (19% of 2024 revenues) includes General Dynamics Land Systems, General Dynamics European Land Systems (GDELS), Steyr-Daimler-Puch, and Santa Bárbara Sistemas, and produces Phalanx CIWS, Expeditionary tanks, the M1 Abrams series main battle tank, Expeditionary Fighting Vehicles, M104 Wolverine, LAV III, Stryker armoured fighting vehicles, XM2001 Crusader self-propelled howitzer, GAU-17 (Minigun), GAU-19, ASCOD AFV, Pandur II, Mowag (including Mowag Duro, Mowag Eagle, and Mowag Piranha), Leopard 2E, and Scout SV. The company's technologies division (28% of 2024 revenues) includes General Dynamics Mission Systems and provides services such as consulting, mission-support, mobile communication, computers, command-and-control and cyber (C5) mission systems, and intelligence, surveillance and reconnaissance. It is modernizing the information technology systems of the United States Central Command and for the Centers for Medicare and Medicaid Services. Acquisitions timeline 20th-century acquisitions Corporate affairs Corporate governance General Dynamics current chairman and chief executive officer is Phebe Novakovic. As of December 2022. Financials As of January 2023. Carbon emissions General Dynamics reported Total CO2e emissions (Direct + Indirect) for 2021 at 696,118 mt (-8.7% year over year) and aims to reducing greenhouse gas emissions 40% by 2034. The company is on track to become carbon neutral before 2060. Company demographics In 2021, General Dynamics's U.S. workforce was 21% veterans, 23% female, and 27% people of color. The US Department of Labor awarded the company the 2021 HIRE Vets Gold Award. The company has 26 Employee Resource Groups serving 10 employee segments. Approximately 20% of the company's employees are represented by labor unions such as International Association of Machinists and Aerospace Workers (IAM), The International Union, and United Auto Workers (UAW). Independent research published by American Association of People with Disabilities (AAPD), U.S. Department of Labor, Military Times, U.S. Veterans Magazine, Professional Women's Magazine, Forbes, and Fortune selected General Dynamics as a top employer. General Dynamics' community contributions in 2021 were 70% in Education & Social Services, 18% in Arts & Culture, and 12% in Service Member Support."
}