{
  "ticker": "GEV",
  "cik": "0001996810",
  "company_name": "GE Vernova",
  "corrected_name": "GE Vernova",
  "wiki_title_used": "GE Vernova",
  "exists": true,
  "raw_text": "GE Vernova, Inc. is an energy equipment manufacturing and services company headquartered in Cambridge, Massachusetts. \nGE Vernova was formed from the merger and subsequent spin-off of General Electric's energy businesses in 2024: GE Power, GE Renewable Energy, GE Digital and GE Energy Financial Services.\n\nHistory\nFounding of GE Power\nGE Power was founded as GE Energy in 2008, and was a division of General Electric. GE Energy was headquartered in Atlanta, Georgia. GE Energy was founded as part of a company-wide reorganization prompted by financial losses leading to the formation from GE Infrastructure division. In 2012 GE Power was created following the spin-off of GE Energy.\n\nAcquisition of Alstom's energy business\nBetween April and June 2014, General Electric entered into negotiations to acquire the energy business of the French group Alstom. On April 24, 2014, the first information was published about General Electric's partial takeover of Alstom for $13 billion. On April 30, Alstom's board of directors accepted General Electric's €12.35 billion offer for its energy business. General Electric confirmed its offer of $16.9 billion. In 2015, the Franco-American subsidiary GE Renewable Energy was created from the acquisition of the energy activities (Alstom Power and Alstom Grid) of Alstom, which specializes in renewable energies. It was headquartered in Boulogne-Billancourt, France and focused on the production of energy systems that use renewable sources. Its products included wind (onshore and offshore), hydroelectric and solar (concentrated and photovoltaic) power generating facilities.\nIn January 2016, General Electric announced that it was cutting 6,500 jobs in its energy division, GE Power. In October 2016, General Electric announced the acquisition of LM Wind Power, a Danish company that is one of its main suppliers of wind turbine blades, for $1.65 billion.\nIn May 2018, Alstom announced the sale of its interests in its three joint ventures with General Electric to GE for €2.594 billion. These joint ventures were active in the power grid, nuclear and renewable energy sectors.\nIn July 2018, one month after buying all the shares in its joint venture with Alstom, General Electric announced a restructuring plan for the Hydro division, cutting 1,330 jobs worldwide, including 293 jobs in Grenoble, France even though GE had committed to creating 1,000 jobs in France when it bought Alstom's energy division.\nOn April 18, 2021, GE Steam Power's management announced that it was reducing its job cuts plan, deciding to save 94 jobs and thus cut 144. On April 30, 2021, the unions in France announced that they would continue to blockade the steam power site in Belfort \"for as long as necessary\", also blocking the special convoy transporting a turbine to the Hinkley Point nuclear power plant in the UK.\n\nSpin-off\nOn November 9, 2021, General Electric announced that it would split into three publicly traded companies. The following year, they announced the names would be GE HealthCare, GE Aerospace, and GE Vernova. GE Healthcare was the first to be spun off, on January 4, 2023. GE Vernova was the second to be spun off. In preparation for the spin-off, GE Vernova, LLC was founded on February 28, 2023. The LLC was incorporated on April 2, 2024, as GE Vernova Inc. and was listed on the New York Stock Exchange under ticker symbol GEV. After the completion of the two spin-offs, the remaining part of General Electric rebranded itself GE Aerospace.\n\nSale of nuclear turbine business\nIn January 2022, France's EDF and General Electric agreed on a takeover of a major part of GE Steam Power (formerly Alstom Power), GE Power's nuclear activities. EDF will pay around €175 million for this transaction, once the cash and debt of the acquired business have been taken into account. This former Alstom Power business, valued at one billion euros, specialises in nuclear turbine-generator sets, in particular \"Arabelle\", and the maintenance services associated with the reactors deployed. It sold this subsidiary to EDF in May 2024.\n\nStructure\nGE Vernova is organized into four divisions based in the United States, France and Denmark:\n\nPower, led by Mavi Zingoni (Cambridge, Massachusetts);\nGas Power, led by Eric Gray (Schenectady, New York);\nSteam Power, formerly GE Steam Power, led by Valérie Marjollet (Baden, Switzerland), sold almost entirely to EDF in May 2024, now Arabelle Solutions;\nGE Hitachi Nuclear Energy, led by Craig Ranson (Wilmington, North Carolina);\nHydro Power, formerly Alstom Power Hydro (Grenoble, France);\nWind, led by Vic Abate (Schenectady, New York);\nOnshore Wind (Schenectady, New York);\nOffshore Wind, formerly GE Offshore Wind, formerly Alstom Wind (Nantes, France);\nLM Wind Power (Kolding, Denmark);\nElectrification Systems, led by Philippe Piron (Boulogne-Billancourt, France);\nPower Conversion and Storage, formerly GE Power Conversion (Paris-Saclay, France);\nGrid Solutions, formerly Alstom Grid (Boulogne-Billancourt, France);\nElectrification Software, formerly GE Digital, led by Scott Reese (Charlotte, North Carolina).\n\nReferences\nExternal links\nOfficial website \nBusiness data for GE Vernova Inc.:",
  "clean_text": "GE Vernova, Inc. is an energy equipment manufacturing and services company headquartered in Cambridge, Massachusetts. GE Vernova was formed from the merger and subsequent spin-off of General Electric's energy businesses in 2024: GE Power, GE Renewable Energy, GE Digital and GE Energy Financial Services. History Founding of GE Power GE Power was founded as GE Energy in 2008, and was a division of General Electric. GE Energy was headquartered in Atlanta, Georgia. GE Energy was founded as part of a company-wide reorganization prompted by financial losses leading to the formation from GE Infrastructure division. In 2012 GE Power was created following the spin-off of GE Energy. Acquisition of Alstom's energy business Between April and June 2014, General Electric entered into negotiations to acquire the energy business of the French group Alstom. On April 24, 2014, the first information was published about General Electric's partial takeover of Alstom for $13 billion. On April 30, Alstom's board of directors accepted General Electric's €12.35 billion offer for its energy business. General Electric confirmed its offer of $16.9 billion. In 2015, the Franco-American subsidiary GE Renewable Energy was created from the acquisition of the energy activities (Alstom Power and Alstom Grid) of Alstom, which specializes in renewable energies. It was headquartered in Boulogne-Billancourt, France and focused on the production of energy systems that use renewable sources. Its products included wind (onshore and offshore), hydroelectric and solar (concentrated and photovoltaic) power generating facilities. In January 2016, General Electric announced that it was cutting 6,500 jobs in its energy division, GE Power. In October 2016, General Electric announced the acquisition of LM Wind Power, a Danish company that is one of its main suppliers of wind turbine blades, for $1.65 billion. In May 2018, Alstom announced the sale of its interests in its three joint ventures with General Electric to GE for €2.594 billion. These joint ventures were active in the power grid, nuclear and renewable energy sectors. In July 2018, one month after buying all the shares in its joint venture with Alstom, General Electric announced a restructuring plan for the Hydro division, cutting 1,330 jobs worldwide, including 293 jobs in Grenoble, France even though GE had committed to creating 1,000 jobs in France when it bought Alstom's energy division. On April 18, 2021, GE Steam Power's management announced that it was reducing its job cuts plan, deciding to save 94 jobs and thus cut 144. On April 30, 2021, the unions in France announced that they would continue to blockade the steam power site in Belfort \"for as long as necessary\", also blocking the special convoy transporting a turbine to the Hinkley Point nuclear power plant in the UK. Spin-off On November 9, 2021, General Electric announced that it would split into three publicly traded companies. The following year, they announced the names would be GE HealthCare, GE Aerospace, and GE Vernova. GE Healthcare was the first to be spun off, on January 4, 2023. GE Vernova was the second to be spun off. In preparation for the spin-off, GE Vernova, LLC was founded on February 28, 2023. The LLC was incorporated on April 2, 2024, as GE Vernova Inc. and was listed on the New York Stock Exchange under ticker symbol GEV. After the completion of the two spin-offs, the remaining part of General Electric rebranded itself GE Aerospace. Sale of nuclear turbine business In January 2022, France's EDF and General Electric agreed on a takeover of a major part of GE Steam Power (formerly Alstom Power), GE Power's nuclear activities. EDF will pay around €175 million for this transaction, once the cash and debt of the acquired business have been taken into account. This former Alstom Power business, valued at one billion euros, specialises in nuclear turbine-generator sets, in particular \"Arabelle\", and the maintenance services associated with the reactors deployed. It sold this subsidiary to EDF in May 2024. Structure GE Vernova is organized into four divisions based in the United States, France and Denmark: Power, led by Mavi Zingoni (Cambridge, Massachusetts); Gas Power, led by Eric Gray (Schenectady, New York); Steam Power, formerly GE Steam Power, led by Valérie Marjollet (Baden, Switzerland), sold almost entirely to EDF in May 2024, now Arabelle Solutions; GE Hitachi Nuclear Energy, led by Craig Ranson (Wilmington, North Carolina); Hydro Power, formerly Alstom Power Hydro (Grenoble, France); Wind, led by Vic Abate (Schenectady, New York); Onshore Wind (Schenectady, New York); Offshore Wind, formerly GE Offshore Wind, formerly Alstom Wind (Nantes, France); LM Wind Power (Kolding, Denmark); Electrification Systems, led by Philippe Piron (Boulogne-Billancourt, France); Power Conversion and Storage, formerly GE Power Conversion (Paris-Saclay, France); Grid Solutions, formerly Alstom Grid (Boulogne-Billancourt, France); Electrification Software, formerly GE Digital, led by Scott Reese (Charlotte, North Carolina)."
}