{
  "ticker": "GILD",
  "cik": "0000882095",
  "company_name": "Gilead Sciences",
  "corrected_name": "Gilead Sciences",
  "wiki_title_used": "Gilead Sciences",
  "exists": true,
  "raw_text": "Gilead Sciences, Inc. () is an American biopharmaceutical company headquartered in Foster City, California, that focuses on researching and developing antiviral drugs used in the treatment of HIV/AIDS, hepatitis B, hepatitis C, influenza, and COVID-19, including ledipasvir/sofosbuvir and sofosbuvir. Gilead is a member of the Nasdaq-100 and the S&P 100.\nGilead was founded in 1987 under the name Oligogen by Michael L. Riordan. The original name was a reference to oligonucleotides, small strands of DNA used to target genetic sequences. Gilead held its initial public offering in 1992, and successfully developed drugs like Tamiflu and Vistide that decade.\nIn the 2000s, Gilead received approval for drugs including Viread and Hepsera, among others. It began evolving from a biotechnology company into a pharmaceutical company, acquiring several subsidiaries, though it still relied heavily on contracting to manufacture its drugs.\nThe company continued its growth in the 2010s. However, it came under heavy scrutiny over its business practices, including extremely high pricing of drugs such as Sovaldi and Truvada in the United States relative to production cost and cost in the developing world.\n\nHistory\nFoundation\nIn June 1987, Gilead Sciences was originally founded under the name Oligogen by Michael L. Riordan, a medical doctor. Riordan graduated from Washington University in St. Louis, the Johns Hopkins School of Medicine, and the Harvard Business School. The idea for Gilead began as a research project at Menlo Ventures, where Michael was an associate. Three scientific advisers worked with Riordan to create the company: Peter Dervan of Caltech, Doug Melton of Harvard, and Harold M. Weintraub of the Fred Hutchinson Cancer Research Center, along with H. Dubose Montgomery, one of Menlo Ventures founders. Riordan served as CEO from the company's founding until 1996. Menlo Ventures subsequently made the first investment in Gilead of $2 million. Riordan also recruited scientific advisers, including Harold Varmus, a Nobel laureate who later became Director of the National Institutes of Health, and Jack Szostak, recipient of the Nobel Prize for Physiology or Medicine in 2009.\nThe company's primary therapeutic focus was in antiviral medicines, a field that piqued Riordan's interest after he contracted dengue fever. Riordan recruited Donald Rumsfeld to join the board of directors in 1988, followed by Benno C. Schmidt, Sr., Gordon Moore, and George P. Shultz. Riordan tried to recruit Warren Buffett as an investor and board member but was unsuccessful.\nThe company focused its early research on making small strands of DNA (oligomers, or more particularly, oligonucleotides) to target specific genetic code sequences – that is, antisense therapy, a form of gene therapy. According to Riordan, he had always wanted to use the name Gilead Sciences all along. Still, he used Oligogen as a temporary name because he needed to deal with a trademark clearance issue with a California nonprofit organization that was already using the word Gilead in its name.  He had first heard of the Balm of Gilead when he read Lanford Wilson's play Balm in Gilead while in medical school, then learned that naturally occurring acetylsalicylic acid (aspirin) had been found in modern times in a willow tree species from that part of that world, and was therefore inspired to name his company Gilead.  After founding Oligogen, he contacted the nonprofit about the naming issue and secured the right to use the Gilead Sciences name in exchange for a $1,000 donation.\nBy 1988, the company had moved its headquarters to Foster City's Vintage Park neighborhood, where it has been based ever since. The company began to develop small molecule antiviral therapeutics in 1991, when the company in-licensed a group of nucleotide compounds including tenofovir.\nRiordan later recalled that Gilead's first decade as a startup was an extremely stressful experience for him, as a young venture capitalist serving for the first time as the founder, chairman, and chief executive officer of his own biotech company.  The new company had no products and very little income, and narrowly escaped going out of business on several occasions: \"It was touch and go for a long time\".  Finding a way for Gilead to make money was Riordan's top priority \"every second of the day for eight years\".\n\n1990–1999: IPO\nGilead's antisense intellectual property portfolio was sold to Ionis Pharmaceuticals. Gilead debuted on the NASDAQ in January 1992. Its initial public offering raised $86.25 million in proceeds.\nIn June 1996, Gilead launched Vistide (cidofovir injection) for the treatment of cytomegalovirus (CMV) retinitis in patients with AIDS.\nIn January 1997, Donald Rumsfeld was appointed chairman, but left the board in January 2001 when he was appointed United States Secretary of Defense during George W. Bush's first term as president.\nIn March 1999, Gilead acquired NeXstar Pharmaceuticals of Boulder, Colorado. At the time, NeXstar's annual sales of $130 million was three times Gilead's sales; it sold AmBisome, an injectable fungal treatment, and DaunoXome, an oncology drug taken by HIV patients. That same year, Roche announced FDA approval of Tamiflu (oseltamivir) for the treatment of influenza. Tamiflu was originally discovered by Gilead and licensed to Roche for late-phase development and marketing.\nOne reason for entering into the Tamiflu licensing agreement was that with only 350 employees, Gilead still did not yet have the capability to sell its drugs directly to overseas buyers. To avoid having to license future drugs in order to access international markets, Gilead simply acquired the 480-employee NeXstar, which had already built its own sales force in Europe to market AmBisome there.\n\n2000 to 2009\nViread (tenofovir) achieved first approval in 2001 for the treatment of HIV.\nIn 2002, Gilead changed its corporate strategy to focus exclusively on antivirals, and sold its cancer assets to OSI Pharmaceuticals for $200 million.\nIn December 2002, Gilead and Triangle Pharmaceuticals announced that Gilead would acquire Triangle for around $464 million; Triangle's lead drug was emtricitabine that was near FDA approval, and it had two other antivirals in its pipeline. The company also announced its first full year of profitability. Later that year, Hepsera (adefovir) was approved for the treatment of chronic hepatitis B, and Emtriva (emtricitabine) for the treatment of HIV.\nDuring this era, Gilead completed its gradual evolution from a biotech startup into a pharmaceutical company. The San Francisco Chronicle noted that by 2003, the Gilead corporate campus in Foster City had expanded to \"seven low-slung sand-colored buildings around a tiny lake on which ducks happily paddle.\" Like many startups, Gilead originally leased its space, but in 2004, the company paid $123 million to buy all its headquarters buildings from its landlords. However, even as Gilead developed its ability to distribute and sell its own drugs, it remained distinct from most pharmaceutical companies in terms of its strong reliance on subcontracting most of its manufacturing to contract manufacturing organizations.\nIn 2004, during the Avian flu pandemic scare, Gilead Sciences' revenue from Tamiflu almost quadrupled to $44.6m as more than 60 national governments stockpiled the antiviral drug, though the firm had made a loss in 2003 before concern about the flu started. As stocks soared, US Defense Secretary and Pentagon chief Donald Rumsfeld sold shares of the company, receiving more than $5 million in capital gains, while still maintaining up to $25m-worth of shares by the end of the year. Sales of Tamiflu almost quadrupled again in 2005, to $161.6m, during which time the share price tripled. A 2005 report showed that, in all, Rumsfeld owned shares worth up to $95.9m, from which he got an income of up to $13m.\nIn 2006, the company acquired Corus Pharma, Inc. for $365 million. The acquisition of Corus signaled Gilead's entry into the respiratory arena. Corus was developing aztreonam lysine for the treatment of patients with cystic fibrosis who are infected with Pseudomonas aeruginosa.\nIn July 2006, the U.S. Food and Drug Administration (FDA) approved Atripla, a once a day single tablet regimen for HIV, combining Sustiva (efavirenz), a Bristol-Myers Squibb product, and Truvada (emtricitabine and tenofovir disoproxil), a Gilead product.\nGilead purchased Raylo Chemicals, Inc. in November 2006, for a price of US$133.3 million. Raylo Chemical, based in Edmonton, Alberta, was a wholly owned subsidiary of Degussa AG, a German company. Raylo Chemical was a custom manufacturer of active pharmaceutical ingredients and advanced intermediates for the pharmaceutical and biopharmaceutical industries.\nLater in the same year, Gilead acquired Myogen, Inc. for $2.5 billion (then its largest acquisition). With two drugs in development (ambrisentan and darusentan), and one marketed product (Flolan) for pulmonary diseases, the acquisition of Myogen has solidified Gilead's position in this therapeutic arena. Under an agreement with GlaxoSmithKline, Myogen marketed Flolan (epoprostenol sodium) in the United States for the treatment of primary pulmonary hypertension. Additionally, Myogen was developing (in Phase 3 studies) darusentan, also an endothelin receptor antagonist, for the potential treatment of resistant hypertension.\nGilead expanded its move into respiratory therapeutics in 2007 by entering into a licensing agreement with Parion for an epithelial sodium channel inhibitor for the treatment of pulmonary diseases, including cystic fibrosis, chronic obstructive pulmonary disease and bronchiectasis.\nIn 2009, the company acquired CV Therapeutics, Inc. for $1.4 billion, bringing Ranexa and Lexiscan into Gilead. Ranexa is a cardiovascular drug used to treat chest pain related to coronary artery disease, with both of these products and pipeline building out Gilead's cardiovascular franchise. Later that year, the company was named one of the Fastest Growing Companies by Fortune.\n\n2010 to 2019\nIn 2010, the company acquired CGI Pharmaceuticals for $120 million, expanding Gilead's research expertise into kinase biology and chemistry. Later that year, the company acquired Arresto Biosciences, Inc. for $225 million, obtaining developmental-stage research for treating fibrotic diseases and cancer.\nIn February 2011, the company acquired Calistoga Pharmaceuticals for US$375 million ($225 million plus milestone payments). The acquisition boosted Gilead's oncology and inflammation areas. Later that year, Gilead made its most important acquisition – and by then most expensive – with the US$10.4 billion purchase of Pharmasset, Inc. This transaction helped cement Gilead as the leader in treatment of the hepatitis C virus by giving it control of sofosbuvir (see below).\nIn October 2011, Gilead broke ground on a massive multi-year expansion of its 17-building headquarters campus in Foster City. By replacing eight one or two-story buildings with seven new structures ranging as tall as 10 stories, Gilead nearly doubled its headquarters real estate footprint from about 620,000 square feet to about 1.2 million square feet.\nOn July 16, 2012, the FDA approved Gilead's Truvada for prevention of HIV infection (it was already approved for treating HIV). The pill was a preventive measure (PrEP) for people at high risk of getting HIV through sexual activity.\nIn 2013, the company acquired YM Biosciences, Inc. for $510 million. The acquisition brings drug candidate CYT387, an orally administered, once-daily, selective inhibitor of the Janus kinase (JAK) family, specifically JAK1 and JAK2, into Gilead's oncology pipeline. The JAK enzymes have been implicated in myeloproliferative diseases, inflammatory disorders, and certain cancers.\nIn 2015, the company made a trio of acquisitions:\n\nIt bought Phenex Pharmaceuticals for $470 million. Its Farnesoid X receptor (FXR) program used small-molecule FXR agonists in the treatment of liver diseases such as non-alcoholic steatohepatitis.\nIt bought EpiTherapeutics for $65 million. This acquisition gave Gilead first-in-class small molecule inhibitors of histone demethylases involved in regulating gene transcription in cancer.\nIt paid $425 million for a 15% equity stake in Galapagos NV, with additional payments for Gilead to license the experimental anti-inflammatory drug filgotinib, which may treat rheumatoid arthritis, ulcerative colitis, and Crohn's disease.\nIn 2016, the company acquired Nimbus Apollo, Inc. for $400 million, giving Gilead control of the compound NDI-010976 (an ACC inhibitor) and other preclinical ACC inhibitors for the treatment of non-alcoholic steatohepatitis and for the potential treatment of hepatocellular carcinoma. Also in 2016, the company was named the most generous company on the 2016 Fortune list of The Most Generous Companies of the Fortune 500. Charitable donations to HIV/AIDS and liver disease organizations totaled over 440 million in 2015.\nIn August 2017, the company announced it would acquire Kite Pharma for $11.9 billion, equating to $180 cash per share, a 29% premium over the closing price of the shares. The deal was Gilead's entry into the cell therapy market and added a chimeric antigen receptor T cell (CAR-T) therapy candidate to the company's portfolio.  By 2022 this acquisition had led to two marketed products for lymphoma: Yescarta and Tecartus.  In November, the company announced it will acquire Cell Design Labs for up to $567 million, after it indirectly acquired a stake of 12.2% via the Kite Pharma deal.\nOn May 9, 2019, the U.S. Department of Health and Human Services announced that Gilead Sciences will donate Truvada, the only drug approved to prevent infection with H.I.V., for free to 200,000 patients annually for 11 years. On December 3, 2019, HHS explained how the government would distribute the donated drugs. HHS Secretary Alex Azar explained that the U.S. government will pay Gilead $200 per bottle for 30 pills for costs associated with getting the drug from factories into the eventual hands of patients.\n\n2020 onwards\nIn March 2020, the company announced it would acquire Forty Seven Inc. for $95.50 a share ($4.9 billion in total). On April 7, 2020, Gilead completed acquisition of Forty Seven, Inc. for \"$95.50 per share, net to the seller in cash, without interest, or approximately $4.9 billion in the aggregate.\"\nIn June 2020, Bloomberg reported that AstraZeneca Plc had made a preliminary approach to Gilead for a potential merger, worth almost $240 billion. In the same month, the company announced it would acquire a 49.9% stake in privately held Pionyr Immunotherapeutics Inc for $275 million.\nIn September 2020, Gilead announced it had reached a deal to acquire Immunomedics for $21 billion ($88 per share), gaining control of the cancer treatment Trodelvy (Sacituzumab govitecan-hziy) – a first-in-class Trop-2 antibody-drug conjugate. In December, the business announced it would acquire German biotech, MYR GmbH, for €1.15 billion plus up to a further €300 million. MYR focuses on the treatment of chronic hepatitis delta virus.\nOn August 11, 2021, U.S. Senator Rand Paul disclosed that his wife Kelley Paul had purchased a stake in Gilead Sciences on February 26, 2020.\nIn November 2021, the company was added to the Dow Jones Sustainability World Index.\nIn January 2022, Gilead pulled its cancer drug Zydelig (idelalisib) from its accelerated approval in relapsed follicular B-cell non-Hodgkin lymphoma (FL) and relapsed small lymphocytic leukemia (SLL). In September, the company completed its acquisition of MiroBio for $405 million.\nIn February 2023, the business, through Kite Pharma completed its acquisition of Tmunity Therapeutics In May, the business announced it would acquire XinThera and its small molecule inhibitors.\nIn February 2024, the company acquired CymaBay Therapeutics, and in September, paid Genesis Therapeutics $35 million for AI-based drug discovery work.\nIn May 2025, Gilead Sciences  announced it would pay $10 million for sole ownership of arenavirus immunotherapies for hepatitis B (HBV) and HIV resulting from the company's collaboration with Hookipa Pharma.\n\nAcquisition history\nTreatments for hepatitis C\nThe drug sofosbuvir had been part of the 2011 acquisition of Pharmasset. In 2013, the FDA approved this drug, under the trade name Sovaldi, as a treatment for the hepatitis C virus. Forbes magazine ranked Gilead its number 4 drug company, citing a market capitalization of US$113 billion and stock appreciation of 100%, and describing their 2011 purchase of Pharmasset for $11 billion as \"one of the best pharma acquisitions ever\". Deutsche Bank estimated Sovaldi sales in the year's final quarter would be $53 million, and Barron's noted the FDA approval and subsequent strong sales of the \"potentially revolutionary\" drug as a positive indicator for the stock.\nOn July 11, 2014, the United States Senate Committee on Finance investigated Sovaldi's high price ($1,000 per pill; $84,000 for the full 12-week regimen). Senators questioned the extent to which the market was operating \"efficiently and rationally\", and committee chairman Ron Wyden (D-Oregon) and ranking minority member Chuck Grassley (R-Iowa) wrote to CEO John C. Martin asking Gilead to justify the price for this drug. The committee hearings did not result in new law, but in 2014 and 2015, due to negotiated and mandated discounts, Sovaldi was sold well below the list price. For poorer countries, Gilead licensed multiple companies to produce generic versions of Sovaldi; in India, a pill's price was as low as $4.29.\nGilead later combined Sovaldi with other antivirals in single-pill combinations. First, Sovaldi was combined with ledipasvir and marketed as Harvoni. This treatment for hepatitis C cures the patient in 94% to 99% of cases (HCV genotype 1). By 2017, Gilead was reporting drastic drops in Sovaldi revenue from year to year, not only because of pricing pressure but because the number of suitable patients decreased. Later single-pill combinations were Epclusa (with velpatasvir) and Vosevi (with velpatasvir and voxilaprevir).\n\nFinances\nFor the fiscal year 2017, Gilead Sciences  reported earnings of US$4.628 billion and annual revenue of US$26.107 billion, a decline of 14.1% over the previous fiscal cycle. Gilead Sciences's shares traded at over $70 per share, and its market capitalization was valued at US$93.4 billion in October 2018.\n\nProspects for the future\nAs of 2017, Gilead's challenge is to develop or acquire new blockbuster drugs before its current revenue-producers wane or their patent protection expires. Gilead benefited from the expansion of Medicaid in the ACA; Leerink analyst Geoffrey Porges wrote that Gilead's HIV drugs could face funding pressure under reform proposals. Gilead has $32 billion in cash, but $27.4 billion is outside the U.S. and is unavailable for acquisitions unless Gilead pays U.S. tax on it, though it could borrow against it. Gilead would benefit from proposals to let companies repatriate offshore capital with minimal further taxation.\nGilead's Entospletinib has shown a 90% complete response rate for MLL type acute myeloid leukaemia (AML).\n\nCriticisms\nTAF development delays\nSeveral mass tort lawsuits  have been filed against Gilead alleging that the company deliberately delayed development of antiretroviral drugs based on tenofovir alafenamide fumarate (TAF) in order to maximize profits from previous-generation medications containing tenofovir disoproxil fumarate (TDF). Plaintiffs allege that Gilead suspended TAF in 2004 despite clear evidence indicating that TAF-based medications were safer than TDF, a compound whose long-term use was associated with adverse side effects such as nephrotoxicity and bone density loss.\nGilead's first TAF medication, marketed under the trade name Genvoya, came out in 2015. Lawsuits allege that in the interim period, many HIV patients who continuously took Gilead's older TDF-based drugs suffered severe side effects, including nephrotoxicity.\n\nPricing\nBiktarvy\nIn 2023, the Institute for Clinical and Economic Review (ICER) identified Biktarvy (bictegravir/emtricitabine/tenofovir alafenamide) as one of five high-expenditure drugs that experienced significant net price increases without new clinical evidence to justify the hikes. Specifically, Biktarvy's wholesale acquisition cost rose by 5.49%, leading to an additional $815 million in costs to U.S. payers.\n\nSovaldi\nGilead came under intense criticism for its high pricing of its patented drug sofosbuvir (sold under the brand name Sovaldi), used to treat hepatitis C. In the US, for instance, it was launched at $1,000 per pill or $84,000 for the standard 84-day course, but it was drastically cheaper in the developing world; in India, it dropped as low as $4.29 per pill. While Sovaldi represented a significant improvement over contemporary treatments, the controversy surrounding its price ignited a national debate in the US, according to Reuters.\nThe United States Senate Committee on Finance launched an 18-month investigation of Gilead's Sovaldi pricing, and argued in its 2015 report that Gilead set prices high in disregard of the human cost and in order to set the stage for a higher eventual price for Sovaldi's successor, Harvoni. The committee's investigation, based in part on internal documents obtained from Gilead, revealed that the company had considered prices ranging from $50,000 to $115,000 per year, trying to strike a balance between revenue and predicted activist and public relations blowback, with little regard to research and development costs.\nThe high prices forced state Medicaid programs to ration treatment to patients, delaying treatment of less advanced hepatitis C cases. In Oregon, for example, 10,000 Medicaid patients were deemed good candidates for Sovaldi therapy, but the Oregon Health Authority estimated that treating half of these patients would more than double the state's total drug expenditures. The state thus opted to limit treatment to 500 patients per year.\n\nTruvada and Descovy\nTruvada was introduced to the market by Gilead in 2004 to treat HIV infections. In the following years, the United States government conducted research demonstrating that Truvada was able to prevent HIV infection. The US Centers for Disease Control holds the patent for this use of Truvada as pre-exposure prophylaxis (PreP).\nGilead introduced Truvada for PreP in 2012, at which point a prescription cost approximately $1,200 per month in the United States. By 2018, this price had increased to up to $2,000, despite generally costing less than $100 outside the U.S. Gilead made over $3 billion in sales of Truvada in 2018.\nThe high price drew the ire of activist groups such as ACT UP and was the subject of a Congressional hearing in May 2019. Gilead's CEO defended its pricing in the hearing by noting the large sums the company spends on HIV/AIDS research. Activists pressured the US government to enforce its patent on Truvada in order to combat the high prices set by Gilead.\nIn May 2019, Gilead announced it would donate enough Truvada to treat up to 200,000 patients annually for up to 11 years, the result of discussions with the Department of Health and Human Services under Trump. Dr. Rochelle Walensky noted that the donations still covered less than one-fifth of the people who need the drug, and argued it was possibly a move to help the company market Descovy, a more advanced successor drug. Walensky led a 2020 study that concluded the high costs of Descovy would on the whole negate any comparative advantage of prescribing it over a generic Truvada alternative.\nIn July 2021, Gilead announced it would decrease 340B Drug Pricing Program reimbursements to clinics serving primarily low-income communities; clinics argued this severely hinders their ability to provide HIV/AIDS prevention and treatment services among vulnerable populations.\n\nAnticompetitive behavior\nGilead has also been accused of stifling competition. A lawsuit filed in the United States in 2019 alleged that the company entered \"pay for delay\" agreements with other manufacturers, wherein the manufacturers agreed to delay releasing generic versions of Truvada. In 2021, CVS Pharmacy and Rite Aid filed a lawsuit on similar grounds against Gilead, Bristol-Myers Squibb, and Teva Pharmaceuticals in 2021.\nIn response to criticisms over the price of Sovaldi, Gilead began licensing the rights to produce generic versions of the drug to select producers in India in 2015. Included in the licensing agreements were 'anti-diversion' provisions, designed to prevent the drug from being exported back to developed countries where the cheaper, generic alternatives were still unavailable. (In India, a one-month treatment cost approximately US$300, versus $1,000 per pill in the United States.) Gilead required the Indian producers to screen patients to determine who could buy Sovaldi, which was criticized by Médecins Sans Frontières since it could lead to the exclusion of vulnerable groups like refugees and migrants from accessing the medicines. In response to the criticism, Gilead eventually relaxed these requirements.\n\nTax structures and tax avoidance\nGilead has been criticized for tax avoidance. Tax avoidance, as opposed to tax evasion, is the use of legal means to shift tax burdens from the one jurisdiction to overseas affiliates that pay a lower tax rate, even if revenue is primarily generated outside the overseas jurisdiction.\nA 2016 report by the liberal think tank Americans for Tax Fairness argued that Gilead was able to avoid up to $10 billion in taxes on U.S. sales through mechanisms such as transfer pricing, the sale of assets between affiliated entities. In particular, Gilead sells intellectual property to an Irish subsidiary, which then sells the finished products, such as Sovaldi, in the United States and elsewhere, paying the low Irish tax rate on profits. The practice is common among multinational pharmaceutical companies like Gilead.\nOn December 26, 2018, The Times reported that Gilead had used the Double Irish arrangement to avoid U.S. corporate taxes on global profits, stating that the firm \"used a controversial tax loophole arrangement to shift almost €20 billion in profits through an Irish entity in just two years\" without paying Irish taxes. The company repatriated a portion of the Irish subsidiary's holdings, $28 billion, to the United States in 2018 following reductions of the corporate tax rate. For this it paid an estimated $5.5 billion in tax.\n\nRemdesivir\nGilead sought and obtained orphan drug designation for remdesivir from the US Food and Drug Administration (FDA) on March 23, 2020. This designation is intended to encourage the development of drugs affecting fewer than 200,000 Americans by granting strengthened and extended legal monopoly rights to the manufacturer, along with waivers on taxes and government fees.\nRemdesivir became a candidate for treating COVID-19; at the time the status was granted, fewer than 200,000 Americans had COVID-19, but numbers were climbing rapidly as the COVID-19 pandemic reached the US, and crossing the threshold soon was considered inevitable. Gilead retains 20-year remdesivir patents in more than 70 countries.\nIn 2021, remdesivir (tradename Veklury) generated more than $4.5 billion in annual revenues, and was Gilead's highest selling product.\n\nCOVID-19\nEmergency use authorization for remdesivir was granted in the U.S. on May 1, 2020, for people hospitalized with severe COVID-19. In September 2020 following a review of the evidence, the WHO issued guidance not to use remdesivir for people with COVID-19, as there was no good evidence of benefit. However, over 2020–22 with further clinical research, remdesivir had been approved for treatment of hospitalized people with COVID-19 in the United States, European Union, and multiple other countries. In 2022, the Canadian component of the WHO international Solidarity Trial reported that in-hospital people with COVID-19 treated with remdesivir had lower death rates (by about 4%) and reduced need for oxygen and mechanical ventilation compared to people receiving standard-of-care treatments.\n\nRegulatory approval\nVeklury received approval from the US Food and Drug Administration (FDA) in October 2020 use in hospitalized adults and children 12 years and older for treatment of severe COVID-19 infections. In January 2022, the FDA gave regulatory approval to Veklury for use in adults and children (12 years of age and older who weigh at least 40 kilograms (88 lb) and are positive for COVID-19, not hospitalized, and are ill having high risk for developing severe COVID-19, including hospitalization or death.\nThe FDA also provided Emergency Use Authorization for Veklury treatment of children under age 12 who are COVID-positive and not hospitalized, but have mild-to-moderate COVID-19 with high risk of developing severe COVID-19, including hospitalization or death.\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Gilead Sciences, Inc.:",
  "clean_text": "Gilead Sciences, Inc. () is an American biopharmaceutical company headquartered in Foster City, California, that focuses on researching and developing antiviral drugs used in the treatment of HIV/AIDS, hepatitis B, hepatitis C, influenza, and COVID-19, including ledipasvir/sofosbuvir and sofosbuvir. Gilead is a member of the Nasdaq-100 and the S&P 100. Gilead was founded in 1987 under the name Oligogen by Michael L. Riordan. The original name was a reference to oligonucleotides, small strands of DNA used to target genetic sequences. Gilead held its initial public offering in 1992, and successfully developed drugs like Tamiflu and Vistide that decade. In the 2000s, Gilead received approval for drugs including Viread and Hepsera, among others. It began evolving from a biotechnology company into a pharmaceutical company, acquiring several subsidiaries, though it still relied heavily on contracting to manufacture its drugs. The company continued its growth in the 2010s. However, it came under heavy scrutiny over its business practices, including extremely high pricing of drugs such as Sovaldi and Truvada in the United States relative to production cost and cost in the developing world. History Foundation In June 1987, Gilead Sciences was originally founded under the name Oligogen by Michael L. Riordan, a medical doctor. Riordan graduated from Washington University in St. Louis, the Johns Hopkins School of Medicine, and the Harvard Business School. The idea for Gilead began as a research project at Menlo Ventures, where Michael was an associate. Three scientific advisers worked with Riordan to create the company: Peter Dervan of Caltech, Doug Melton of Harvard, and Harold M. Weintraub of the Fred Hutchinson Cancer Research Center, along with H. Dubose Montgomery, one of Menlo Ventures founders. Riordan served as CEO from the company's founding until 1996. Menlo Ventures subsequently made the first investment in Gilead of $2 million. Riordan also recruited scientific advisers, including Harold Varmus, a Nobel laureate who later became Director of the National Institutes of Health, and Jack Szostak, recipient of the Nobel Prize for Physiology or Medicine in 2009. The company's primary therapeutic focus was in antiviral medicines, a field that piqued Riordan's interest after he contracted dengue fever. Riordan recruited Donald Rumsfeld to join the board of directors in 1988, followed by Benno C. Schmidt, Sr., Gordon Moore, and George P. Shultz. Riordan tried to recruit Warren Buffett as an investor and board member but was unsuccessful. The company focused its early research on making small strands of DNA (oligomers, or more particularly, oligonucleotides) to target specific genetic code sequences – that is, antisense therapy, a form of gene therapy. According to Riordan, he had always wanted to use the name Gilead Sciences all along. Still, he used Oligogen as a temporary name because he needed to deal with a trademark clearance issue with a California nonprofit organization that was already using the word Gilead in its name. He had first heard of the Balm of Gilead when he read Lanford Wilson's play Balm in Gilead while in medical school, then learned that naturally occurring acetylsalicylic acid (aspirin) had been found in modern times in a willow tree species from that part of that world, and was therefore inspired to name his company Gilead. After founding Oligogen, he contacted the nonprofit about the naming issue and secured the right to use the Gilead Sciences name in exchange for a $1,000 donation. By 1988, the company had moved its headquarters to Foster City's Vintage Park neighborhood, where it has been based ever since. The company began to develop small molecule antiviral therapeutics in 1991, when the company in-licensed a group of nucleotide compounds including tenofovir. Riordan later recalled that Gilead's first decade as a startup was an extremely stressful experience for him, as a young venture capitalist serving for the first time as the founder, chairman, and chief executive officer of his own biotech company. The new company had no products and very little income, and narrowly escaped going out of business on several occasions: \"It was touch and go for a long time\". Finding a way for Gilead to make money was Riordan's top priority \"every second of the day for eight years\". 1990–1999: IPO Gilead's antisense intellectual property portfolio was sold to Ionis Pharmaceuticals. Gilead debuted on the NASDAQ in January 1992. Its initial public offering raised $86.25 million in proceeds. In June 1996, Gilead launched Vistide (cidofovir injection) for the treatment of cytomegalovirus (CMV) retinitis in patients with AIDS. In January 1997, Donald Rumsfeld was appointed chairman, but left the board in January 2001 when he was appointed United States Secretary of Defense during George W. Bush's first term as president. In March 1999, Gilead acquired NeXstar Pharmaceuticals of Boulder, Colorado. At the time, NeXstar's annual sales of $130 million was three times Gilead's sales; it sold AmBisome, an injectable fungal treatment, and DaunoXome, an oncology drug taken by HIV patients. That same year, Roche announced FDA approval of Tamiflu (oseltamivir) for the treatment of influenza. Tamiflu was originally discovered by Gilead and licensed to Roche for late-phase development and marketing. One reason for entering into the Tamiflu licensing agreement was that with only 350 employees, Gilead still did not yet have the capability to sell its drugs directly to overseas buyers. To avoid having to license future drugs in order to access international markets, Gilead simply acquired the 480-employee NeXstar, which had already built its own sales force in Europe to market AmBisome there. 2000 to 2009 Viread (tenofovir) achieved first approval in 2001 for the treatment of HIV. In 2002, Gilead changed its corporate strategy to focus exclusively on antivirals, and sold its cancer assets to OSI Pharmaceuticals for $200 million. In December 2002, Gilead and Triangle Pharmaceuticals announced that Gilead would acquire Triangle for around $464 million; Triangle's lead drug was emtricitabine that was near FDA approval, and it had two other antivirals in its pipeline. The company also announced its first full year of profitability. Later that year, Hepsera (adefovir) was approved for the treatment of chronic hepatitis B, and Emtriva (emtricitabine) for the treatment of HIV. During this era, Gilead completed its gradual evolution from a biotech startup into a pharmaceutical company. The San Francisco Chronicle noted that by 2003, the Gilead corporate campus in Foster City had expanded to \"seven low-slung sand-colored buildings around a tiny lake on which ducks happily paddle.\" Like many startups, Gilead originally leased its space, but in 2004, the company paid $123 million to buy all its headquarters buildings from its landlords. However, even as Gilead developed its ability to distribute and sell its own drugs, it remained distinct from most pharmaceutical companies in terms of its strong reliance on subcontracting most of its manufacturing to contract manufacturing organizations. In 2004, during the Avian flu pandemic scare, Gilead Sciences' revenue from Tamiflu almost quadrupled to $44.6m as more than 60 national governments stockpiled the antiviral drug, though the firm had made a loss in 2003 before concern about the flu started. As stocks soared, US Defense Secretary and Pentagon chief Donald Rumsfeld sold shares of the company, receiving more than $5 million in capital gains, while still maintaining up to $25m-worth of shares by the end of the year. Sales of Tamiflu almost quadrupled again in 2005, to $161.6m, during which time the share price tripled. A 2005 report showed that, in all, Rumsfeld owned shares worth up to $95.9m, from which he got an income of up to $13m. In 2006, the company acquired Corus Pharma, Inc. for $365 million. The acquisition of Corus signaled Gilead's entry into the respiratory arena. Corus was developing aztreonam lysine for the treatment of patients with cystic fibrosis who are infected with Pseudomonas aeruginosa. In July 2006, the U.S. Food and Drug Administration (FDA) approved Atripla, a once a day single tablet regimen for HIV, combining Sustiva (efavirenz), a Bristol-Myers Squibb product, and Truvada (emtricitabine and tenofovir disoproxil), a Gilead product. Gilead purchased Raylo Chemicals, Inc. in November 2006, for a price of US$133.3 million. Raylo Chemical, based in Edmonton, Alberta, was a wholly owned subsidiary of Degussa AG, a German company. Raylo Chemical was a custom manufacturer of active pharmaceutical ingredients and advanced intermediates for the pharmaceutical and biopharmaceutical industries. Later in the same year, Gilead acquired Myogen, Inc. for $2.5 billion (then its largest acquisition). With two drugs in development (ambrisentan and darusentan), and one marketed product (Flolan) for pulmonary diseases, the acquisition of Myogen has solidified Gilead's position in this therapeutic arena. Under an agreement with GlaxoSmithKline, Myogen marketed Flolan (epoprostenol sodium) in the United States for the treatment of primary pulmonary hypertension. Additionally, Myogen was developing (in Phase 3 studies) darusentan, also an endothelin receptor antagonist, for the potential treatment of resistant hypertension. Gilead expanded its move into respiratory therapeutics in 2007 by entering into a licensing agreement with Parion for an epithelial sodium channel inhibitor for the treatment of pulmonary diseases, including cystic fibrosis, chronic obstructive pulmonary disease and bronchiectasis. In 2009, the company acquired CV Therapeutics, Inc. for $1.4 billion, bringing Ranexa and Lexiscan into Gilead. Ranexa is a cardiovascular drug used to treat chest pain related to coronary artery disease, with both of these products and pipeline building out Gilead's cardiovascular franchise. Later that year, the company was named one of the Fastest Growing Companies by Fortune. 2010 to 2019 In 2010, the company acquired CGI Pharmaceuticals for $120 million, expanding Gilead's research expertise into kinase biology and chemistry. Later that year, the company acquired Arresto Biosciences, Inc. for $225 million, obtaining developmental-stage research for treating fibrotic diseases and cancer. In February 2011, the company acquired Calistoga Pharmaceuticals for US$375 million ($225 million plus milestone payments). The acquisition boosted Gilead's oncology and inflammation areas. Later that year, Gilead made its most important acquisition – and by then most expensive – with the US$10.4 billion purchase of Pharmasset, Inc. This transaction helped cement Gilead as the leader in treatment of the hepatitis C virus by giving it control of sofosbuvir (see below). In October 2011, Gilead broke ground on a massive multi-year expansion of its 17-building headquarters campus in Foster City. By replacing eight one or two-story buildings with seven new structures ranging as tall as 10 stories, Gilead nearly doubled its headquarters real estate footprint from about 620,000 square feet to about 1.2 million square feet. On July 16, 2012, the FDA approved Gilead's Truvada for prevention of HIV infection (it was already approved for treating HIV). The pill was a preventive measure (PrEP) for people at high risk of getting HIV through sexual activity. In 2013, the company acquired YM Biosciences, Inc. for $510 million. The acquisition brings drug candidate CYT387, an orally administered, once-daily, selective inhibitor of the Janus kinase (JAK) family, specifically JAK1 and JAK2, into Gilead's oncology pipeline. The JAK enzymes have been implicated in myeloproliferative diseases, inflammatory disorders, and certain cancers. In 2015, the company made a trio of acquisitions: It bought Phenex Pharmaceuticals for $470 million. Its Farnesoid X receptor (FXR) program used small-molecule FXR agonists in the treatment of liver diseases such as non-alcoholic steatohepatitis. It bought EpiTherapeutics for $65 million. This acquisition gave Gilead first-in-class small molecule inhibitors of histone demethylases involved in regulating gene transcription in cancer. It paid $425 million for a 15% equity stake in Galapagos NV, with additional payments for Gilead to license the experimental anti-inflammatory drug filgotinib, which may treat rheumatoid arthritis, ulcerative colitis, and Crohn's disease. In 2016, the company acquired Nimbus Apollo, Inc. for $400 million, giving Gilead control of the compound NDI-010976 (an ACC inhibitor) and other preclinical ACC inhibitors for the treatment of non-alcoholic steatohepatitis and for the potential treatment of hepatocellular carcinoma. Also in 2016, the company was named the most generous company on the 2016 Fortune list of The Most Generous Companies of the Fortune 500. Charitable donations to HIV/AIDS and liver disease organizations totaled over 440 million in 2015. In August 2017, the company announced it would acquire Kite Pharma for $11.9 billion, equating to $180 cash per share, a 29% premium over the closing price of the shares. The deal was Gilead's entry into the cell therapy market and added a chimeric antigen receptor T cell (CAR-T) therapy candidate to the company's portfolio. By 2022 this acquisition had led to two marketed products for lymphoma: Yescarta and Tecartus. In November, the company announced it will acquire Cell Design Labs for up to $567 million, after it indirectly acquired a stake of 12.2% via the Kite Pharma deal. On May 9, 2019, the U.S. Department of Health and Human Services announced that Gilead Sciences will donate Truvada, the only drug approved to prevent infection with H.I.V., for free to 200,000 patients annually for 11 years. On December 3, 2019, HHS explained how the government would distribute the donated drugs. HHS Secretary Alex Azar explained that the U.S. government will pay Gilead $200 per bottle for 30 pills for costs associated with getting the drug from factories into the eventual hands of patients. 2020 onwards In March 2020, the company announced it would acquire Forty Seven Inc. for $95.50 a share ($4.9 billion in total). On April 7, 2020, Gilead completed acquisition of Forty Seven, Inc. for \"$95.50 per share, net to the seller in cash, without interest, or approximately $4.9 billion in the aggregate.\" In June 2020, Bloomberg reported that AstraZeneca Plc had made a preliminary approach to Gilead for a potential merger, worth almost $240 billion. In the same month, the company announced it would acquire a 49.9% stake in privately held Pionyr Immunotherapeutics Inc for $275 million. In September 2020, Gilead announced it had reached a deal to acquire Immunomedics for $21 billion ($88 per share), gaining control of the cancer treatment Trodelvy (Sacituzumab govitecan-hziy) – a first-in-class Trop-2 antibody-drug conjugate. In December, the business announced it would acquire German biotech, MYR GmbH, for €1.15 billion plus up to a further €300 million. MYR focuses on the treatment of chronic hepatitis delta virus. On August 11, 2021, U.S. Senator Rand Paul disclosed that his wife Kelley Paul had purchased a stake in Gilead Sciences on February 26, 2020. In November 2021, the company was added to the Dow Jones Sustainability World Index. In January 2022, Gilead pulled its cancer drug Zydelig (idelalisib) from its accelerated approval in relapsed follicular B-cell non-Hodgkin lymphoma (FL) and relapsed small lymphocytic leukemia (SLL). In September, the company completed its acquisition of MiroBio for $405 million. In February 2023, the business, through Kite Pharma completed its acquisition of Tmunity Therapeutics In May, the business announced it would acquire XinThera and its small molecule inhibitors. In February 2024, the company acquired CymaBay Therapeutics, and in September, paid Genesis Therapeutics $35 million for AI-based drug discovery work. In May 2025, Gilead Sciences announced it would pay $10 million for sole ownership of arenavirus immunotherapies for hepatitis B (HBV) and HIV resulting from the company's collaboration with Hookipa Pharma. Acquisition history Treatments for hepatitis C The drug sofosbuvir had been part of the 2011 acquisition of Pharmasset. In 2013, the FDA approved this drug, under the trade name Sovaldi, as a treatment for the hepatitis C virus. Forbes magazine ranked Gilead its number 4 drug company, citing a market capitalization of US$113 billion and stock appreciation of 100%, and describing their 2011 purchase of Pharmasset for $11 billion as \"one of the best pharma acquisitions ever\". Deutsche Bank estimated Sovaldi sales in the year's final quarter would be $53 million, and Barron's noted the FDA approval and subsequent strong sales of the \"potentially revolutionary\" drug as a positive indicator for the stock. On July 11, 2014, the United States Senate Committee on Finance investigated Sovaldi's high price ($1,000 per pill; $84,000 for the full 12-week regimen). Senators questioned the extent to which the market was operating \"efficiently and rationally\", and committee chairman Ron Wyden (D-Oregon) and ranking minority member Chuck Grassley (R-Iowa) wrote to CEO John C. Martin asking Gilead to justify the price for this drug. The committee hearings did not result in new law, but in 2014 and 2015, due to negotiated and mandated discounts, Sovaldi was sold well below the list price. For poorer countries, Gilead licensed multiple companies to produce generic versions of Sovaldi; in India, a pill's price was as low as $4.29. Gilead later combined Sovaldi with other antivirals in single-pill combinations. First, Sovaldi was combined with ledipasvir and marketed as Harvoni. This treatment for hepatitis C cures the patient in 94% to 99% of cases (HCV genotype 1). By 2017, Gilead was reporting drastic drops in Sovaldi revenue from year to year, not only because of pricing pressure but because the number of suitable patients decreased. Later single-pill combinations were Epclusa (with velpatasvir) and Vosevi (with velpatasvir and voxilaprevir). Finances For the fiscal year 2017, Gilead Sciences reported earnings of US$4.628 billion and annual revenue of US$26.107 billion, a decline of 14.1% over the previous fiscal cycle. Gilead Sciences's shares traded at over $70 per share, and its market capitalization was valued at US$93.4 billion in October 2018. Prospects for the future As of 2017, Gilead's challenge is to develop or acquire new blockbuster drugs before its current revenue-producers wane or their patent protection expires. Gilead benefited from the expansion of Medicaid in the ACA; Leerink analyst Geoffrey Porges wrote that Gilead's HIV drugs could face funding pressure under reform proposals. Gilead has $32 billion in cash, but $27.4 billion is outside the U.S. and is unavailable for acquisitions unless Gilead pays U.S. tax on it, though it could borrow against it. Gilead would benefit from proposals to let companies repatriate offshore capital with minimal further taxation. Gilead's Entospletinib has shown a 90% complete response rate for MLL type acute myeloid leukaemia (AML). Criticisms TAF development delays Several mass tort lawsuits have been filed against Gilead alleging that the company deliberately delayed development of antiretroviral drugs based on tenofovir alafenamide fumarate (TAF) in order to maximize profits from previous-generation medications containing tenofovir disoproxil fumarate (TDF). Plaintiffs allege that Gilead suspended TAF in 2004 despite clear evidence indicating that TAF-based medications were safer than TDF, a compound whose long-term use was associated with adverse side effects such as nephrotoxicity and bone density loss. Gilead's first TAF medication, marketed under the trade name Genvoya, came out in 2015. Lawsuits allege that in the interim period, many HIV patients who continuously took Gilead's older TDF-based drugs suffered severe side effects, including nephrotoxicity. Pricing Biktarvy In 2023, the Institute for Clinical and Economic Review (ICER) identified Biktarvy (bictegravir/emtricitabine/tenofovir alafenamide) as one of five high-expenditure drugs that experienced significant net price increases without new clinical evidence to justify the hikes. Specifically, Biktarvy's wholesale acquisition cost rose by 5.49%, leading to an additional $815 million in costs to U.S. payers. Sovaldi Gilead came under intense criticism for its high pricing of its patented drug sofosbuvir (sold under the brand name Sovaldi), used to treat hepatitis C. In the US, for instance, it was launched at $1,000 per pill or $84,000 for the standard 84-day course, but it was drastically cheaper in the developing world; in India, it dropped as low as $4.29 per pill. While Sovaldi represented a significant improvement over contemporary treatments, the controversy surrounding its price ignited a national debate in the US, according to Reuters. The United States Senate Committee on Finance launched an 18-month investigation of Gilead's Sovaldi pricing, and argued in its 2015 report that Gilead set prices high in disregard of the human cost and in order to set the stage for a higher eventual price for Sovaldi's successor, Harvoni. The committee's investigation, based in part on internal documents obtained from Gilead, revealed that the company had considered prices ranging from $50,000 to $115,000 per year, trying to strike a balance between revenue and predicted activist and public relations blowback, with little regard to research and development costs. The high prices forced state Medicaid programs to ration treatment to patients, delaying treatment of less advanced hepatitis C cases. In Oregon, for example, 10,000 Medicaid patients were deemed good candidates for Sovaldi therapy, but the Oregon Health Authority estimated that treating half of these patients would more than double the state's total drug expenditures. The state thus opted to limit treatment to 500 patients per year. Truvada and Descovy Truvada was introduced to the market by Gilead in 2004 to treat HIV infections. In the following years, the United States government conducted research demonstrating that Truvada was able to prevent HIV infection. The US Centers for Disease Control holds the patent for this use of Truvada as pre-exposure prophylaxis (PreP). Gilead introduced Truvada for PreP in 2012, at which point a prescription cost approximately $1,200 per month in the United States. By 2018, this price had increased to up to $2,000, despite generally costing less than $100 outside the U.S. Gilead made over $3 billion in sales of Truvada in 2018. The high price drew the ire of activist groups such as ACT UP and was the subject of a Congressional hearing in May 2019. Gilead's CEO defended its pricing in the hearing by noting the large sums the company spends on HIV/AIDS research. Activists pressured the US government to enforce its patent on Truvada in order to combat the high prices set by Gilead. In May 2019, Gilead announced it would donate enough Truvada to treat up to 200,000 patients annually for up to 11 years, the result of discussions with the Department of Health and Human Services under Trump. Dr. Rochelle Walensky noted that the donations still covered less than one-fifth of the people who need the drug, and argued it was possibly a move to help the company market Descovy, a more advanced successor drug. Walensky led a 2020 study that concluded the high costs of Descovy would on the whole negate any comparative advantage of prescribing it over a generic Truvada alternative. In July 2021, Gilead announced it would decrease 340B Drug Pricing Program reimbursements to clinics serving primarily low-income communities; clinics argued this severely hinders their ability to provide HIV/AIDS prevention and treatment services among vulnerable populations. Anticompetitive behavior Gilead has also been accused of stifling competition. A lawsuit filed in the United States in 2019 alleged that the company entered \"pay for delay\" agreements with other manufacturers, wherein the manufacturers agreed to delay releasing generic versions of Truvada. In 2021, CVS Pharmacy and Rite Aid filed a lawsuit on similar grounds against Gilead, Bristol-Myers Squibb, and Teva Pharmaceuticals in 2021. In response to criticisms over the price of Sovaldi, Gilead began licensing the rights to produce generic versions of the drug to select producers in India in 2015. Included in the licensing agreements were 'anti-diversion' provisions, designed to prevent the drug from being exported back to developed countries where the cheaper, generic alternatives were still unavailable. (In India, a one-month treatment cost approximately US$300, versus $1,000 per pill in the United States.) Gilead required the Indian producers to screen patients to determine who could buy Sovaldi, which was criticized by Médecins Sans Frontières since it could lead to the exclusion of vulnerable groups like refugees and migrants from accessing the medicines. In response to the criticism, Gilead eventually relaxed these requirements. Tax structures and tax avoidance Gilead has been criticized for tax avoidance. Tax avoidance, as opposed to tax evasion, is the use of legal means to shift tax burdens from the one jurisdiction to overseas affiliates that pay a lower tax rate, even if revenue is primarily generated outside the overseas jurisdiction. A 2016 report by the liberal think tank Americans for Tax Fairness argued that Gilead was able to avoid up to $10 billion in taxes on U.S. sales through mechanisms such as transfer pricing, the sale of assets between affiliated entities. In particular, Gilead sells intellectual property to an Irish subsidiary, which then sells the finished products, such as Sovaldi, in the United States and elsewhere, paying the low Irish tax rate on profits. The practice is common among multinational pharmaceutical companies like Gilead. On December 26, 2018, The Times reported that Gilead had used the Double Irish arrangement to avoid U.S. corporate taxes on global profits, stating that the firm \"used a controversial tax loophole arrangement to shift almost €20 billion in profits through an Irish entity in just two years\" without paying Irish taxes. The company repatriated a portion of the Irish subsidiary's holdings, $28 billion, to the United States in 2018 following reductions of the corporate tax rate. For this it paid an estimated $5.5 billion in tax. Remdesivir Gilead sought and obtained orphan drug designation for remdesivir from the US Food and Drug Administration (FDA) on March 23, 2020. This designation is intended to encourage the development of drugs affecting fewer than 200,000 Americans by granting strengthened and extended legal monopoly rights to the manufacturer, along with waivers on taxes and government fees. Remdesivir became a candidate for treating COVID-19; at the time the status was granted, fewer than 200,000 Americans had COVID-19, but numbers were climbing rapidly as the COVID-19 pandemic reached the US, and crossing the threshold soon was considered inevitable. Gilead retains 20-year remdesivir patents in more than 70 countries. In 2021, remdesivir (tradename Veklury) generated more than $4.5 billion in annual revenues, and was Gilead's highest selling product. COVID-19 Emergency use authorization for remdesivir was granted in the U.S. on May 1, 2020, for people hospitalized with severe COVID-19. In September 2020 following a review of the evidence, the WHO issued guidance not to use remdesivir for people with COVID-19, as there was no good evidence of benefit. However, over 2020–22 with further clinical research, remdesivir had been approved for treatment of hospitalized people with COVID-19 in the United States, European Union, and multiple other countries. In 2022, the Canadian component of the WHO international Solidarity Trial reported that in-hospital people with COVID-19 treated with remdesivir had lower death rates (by about 4%) and reduced need for oxygen and mechanical ventilation compared to people receiving standard-of-care treatments. Regulatory approval Veklury received approval from the US Food and Drug Administration (FDA) in October 2020 use in hospitalized adults and children 12 years and older for treatment of severe COVID-19 infections. In January 2022, the FDA gave regulatory approval to Veklury for use in adults and children (12 years of age and older who weigh at least 40 kilograms (88 lb) and are positive for COVID-19, not hospitalized, and are ill having high risk for developing severe COVID-19, including hospitalization or death. The FDA also provided Emergency Use Authorization for Veklury treatment of children under age 12 who are COVID-positive and not hospitalized, but have mild-to-moderate COVID-19 with high risk of developing severe COVID-19, including hospitalization or death."
}