{
  "ticker": "GL",
  "cik": "0000320335",
  "company_name": "Globe Life",
  "corrected_name": "Globe Life",
  "wiki_title_used": "Globe Life",
  "exists": true,
  "raw_text": "Globe Life Inc. (GL) is an American financial services holding company listed on the New York Stock Exchange which operates through its wholly owned subsidiaries providing life insurance, annuity, and supplemental health insurance products. The company is based in McKinney, Texas.\n\nHistory\nThe original core of Globe Life, Liberty National Life Insurance Company was founded in 1900 as the Heralds of Liberty, a fraternal benefit society. The company was headquartered in Birmingham, Alabama, until 2006 when it moved to McKinney, Texas.\nIn 1980, Liberty National acquired Globe Life And Accident Insurance Company and formed the holding company, Torchmark Corporation (ticker TMK).\nIn 1981, TMK acquired United Investors Life Insurance Company (UIL), United American Insurance Company, and Waddell and Reed Financial.\nIn 1994, TMK acquired American Income Life Insurance Company.\nIn 1998, TMK spun off Waddell and Reed Financial, a mutual fund subsidiary.\nIn 2006, TMK began moving its headquarters from Birmingham, AL to McKinney, TX.\nIn 2010, TMK sold United Investors Life Insurance Company (UIL) to Protective Life Corporation.\nIn 2012, TMK acquired Family Heritage Life Insurance Company of America (FHL). It was renamed Globe Life Family Heritage Division in 2019.\nOn February 5, 2014, Torchmark's subsidiary Globe Life purchased the naming rights of Globe Life Park in Arlington, formerly Rangers Ballpark in Arlington, the home of Major League Baseball's Texas Rangers Baseball Club located in Arlington, TX. The naming rights were eventually transferred to Globe Life Field, the Rangers' new home park, alongside extending the naming rights through 2048.\nIn August 2001, a mutual fund company filed a civil racketeering suit against Torchmark Corp., which accused Torchmark Corp. and its former chief executive of scheming to continue control over Waddell & Reed Financial Inc. after Torchmark spun it off in 1998. However, in a series of orders dated February 20, 2003, August 20, 2004, and September 28, 2004, the United States District Court for the Northern District of Kansas later granted summary judgment against plaintiff Waddell & Reed and in favor of Torchmark and the other defendants named in the action.\nOn August 8, 2019, Torchmark Corporation was renamed to Globe Life and its ticker symbol changed from \"TMK\" to \"GL\".\nOn April 11, 2024, Globe Life's share price experienced its biggest single-day decline, falling by 53.14% from $104.93 to $49.17. This came after Fuzzy Panda Research, which had taken a short position on the company, alleged that Globe Life committed numerous instances of insurance fraud, allegations which Globe Life rejected. The company completed a review of the allegations in July, and by August 29th, 2024, the share price had regained its value and closed at $104.98. On December 4, 2024, short seller Fuzzy Panda issued new claims that Globe Life had shuttered offices, suggesting a shrinking workforce, causing its stock to fall again.  The company disputed the claims, issuing a statement that since the Covid pandemic, they were transitioning to a virtual business model.\n\nSubsidiaries\nGlobe Life Liberty National Division, McKinney, Texas\nGlobe Life And Accident Insurance Company, Oklahoma City, Oklahoma\nUnited American Insurance Company, McKinney, Texas\nAmerican Income Life Insurance Company, Waco, Texas\nGlobe Life Family Heritage Division (previously known as Family Heritage Life Insurance Company of America)\n\nSee also\nList of Texas companies (T)\n\nReferences\nExternal links\nOfficial website\nBusiness data for Globe Life Inc.:",
  "clean_text": "Globe Life Inc. (GL) is an American financial services holding company listed on the New York Stock Exchange which operates through its wholly owned subsidiaries providing life insurance, annuity, and supplemental health insurance products. The company is based in McKinney, Texas. History The original core of Globe Life, Liberty National Life Insurance Company was founded in 1900 as the Heralds of Liberty, a fraternal benefit society. The company was headquartered in Birmingham, Alabama, until 2006 when it moved to McKinney, Texas. In 1980, Liberty National acquired Globe Life And Accident Insurance Company and formed the holding company, Torchmark Corporation (ticker TMK). In 1981, TMK acquired United Investors Life Insurance Company (UIL), United American Insurance Company, and Waddell and Reed Financial. In 1994, TMK acquired American Income Life Insurance Company. In 1998, TMK spun off Waddell and Reed Financial, a mutual fund subsidiary. In 2006, TMK began moving its headquarters from Birmingham, AL to McKinney, TX. In 2010, TMK sold United Investors Life Insurance Company (UIL) to Protective Life Corporation. In 2012, TMK acquired Family Heritage Life Insurance Company of America (FHL). It was renamed Globe Life Family Heritage Division in 2019. On February 5, 2014, Torchmark's subsidiary Globe Life purchased the naming rights of Globe Life Park in Arlington, formerly Rangers Ballpark in Arlington, the home of Major League Baseball's Texas Rangers Baseball Club located in Arlington, TX. The naming rights were eventually transferred to Globe Life Field, the Rangers' new home park, alongside extending the naming rights through 2048. In August 2001, a mutual fund company filed a civil racketeering suit against Torchmark Corp., which accused Torchmark Corp. and its former chief executive of scheming to continue control over Waddell & Reed Financial Inc. after Torchmark spun it off in 1998. However, in a series of orders dated February 20, 2003, August 20, 2004, and September 28, 2004, the United States District Court for the Northern District of Kansas later granted summary judgment against plaintiff Waddell & Reed and in favor of Torchmark and the other defendants named in the action. On August 8, 2019, Torchmark Corporation was renamed to Globe Life and its ticker symbol changed from \"TMK\" to \"GL\". On April 11, 2024, Globe Life's share price experienced its biggest single-day decline, falling by 53.14% from $104.93 to $49.17. This came after Fuzzy Panda Research, which had taken a short position on the company, alleged that Globe Life committed numerous instances of insurance fraud, allegations which Globe Life rejected. The company completed a review of the allegations in July, and by August 29th, 2024, the share price had regained its value and closed at $104.98. On December 4, 2024, short seller Fuzzy Panda issued new claims that Globe Life had shuttered offices, suggesting a shrinking workforce, causing its stock to fall again. The company disputed the claims, issuing a statement that since the Covid pandemic, they were transitioning to a virtual business model. Subsidiaries Globe Life Liberty National Division, McKinney, Texas Globe Life And Accident Insurance Company, Oklahoma City, Oklahoma United American Insurance Company, McKinney, Texas American Income Life Insurance Company, Waco, Texas Globe Life Family Heritage Division (previously known as Family Heritage Life Insurance Company of America)"
}