{
  "ticker": "GLW",
  "cik": "0000024741",
  "company_name": "Corning Inc.",
  "corrected_name": "Corning Inc.",
  "wiki_title_used": "Corning Inc.",
  "exists": true,
  "raw_text": "Corning Incorporated is an American multinational technology company specializing in glass, ceramics, and related materials and technologies including advanced optics, primarily for industrial and scientific applications. The company was named Corning Glass Works until 1989. Corning divested its consumer product lines (including CorningWare and Visions Pyroceram-based cookware, Corelle Vitrelle tableware, and Pyrex glass bakeware) in 1998 by selling the Corning Consumer Products Company subsidiary (later Corelle Brands) to Borden.\nAs of 2014, Corning had five major business sectors: display technologies, environmental technologies, life sciences, optical communications, and specialty materials. Corning is involved in two joint ventures: Dow Corning and Pittsburgh Corning. The company completed the corporate spin-offs of Quest Diagnostics and Covance (now Fortrea) in January 1997. Corning is one of the main suppliers to Apple Inc. Since working with Steve Jobs in 2007, to develop the iPhone; Corning develops and manufactures Gorilla Glass, which is used by many smartphone makers. It is one of the world's biggest glassmakers. Corning won the National Medal of Technology and Innovation four times for its product and process innovations.\nCorning continues to maintain its world headquarters at Corning, N.Y. The firm also established one of the first industrial research labs there in 1908. It continues to expand the nearby research and development facility, as well as operations associated with catalytic converters and diesel engine filter product lines. Corning has a long history of community development and has assured community leaders that it intends to remain headquartered in its small upstate New York hometown.\n\nHistory\nCorning Glass Works was founded in 1851 by Amory Houghton, in Somerville, Massachusetts, originally as the Bay State Glass Co. It later moved to Williamsburg, Brooklyn, and operated as the Brooklyn Flint Glass Works. The company moved again to its ultimate home and eponym, the city of Corning, New York, in 1868, under leadership of the founder's son, Amory Houghton Jr.\nIn 1915, Corning created an improved heat resistant glass formula and launched Pyrex, the first-ever consumer cooking products made with temperature-resistant glass, in 1915. \nThe California Institute of Technology's 200-inch (5.1 m) telescope mirror at Palomar Observatory was cast by Corning during 1934–1936, out of low expansion borosilicate glass.  In 1932, George Ellery Hale approached Corning with the challenge of fabricating the required optic for his Palomar project.  A previous effort to fabricate the optic from fused quartz had failed.  Corning's first attempt was a failure, the cast blank having voids.  Using lessons learned, Corning was successful in the casting of the second blank.  After a year of cooling, during which it was almost lost to a flood, in 1935, the blank was completed.  The first blank now resides in Corning's Museum of Glass.\nIn 1935, Corning formed a partnership with bottle maker Owens-Illinois, which formed the company known today as Owens Corning.  Owens Corning was spun off as a separate company in 1938.\n\nThe company had a history of science-based innovations following World War II and the strategy by management was research and \"disruptive\" and \"on demand\" product innovation.\nIn 1962, Corning developed Chemcor, a new toughened automobile windshield designed to be thinner and lighter than existing windshields, which reduced danger of personal injury by shattering into small granules when smashed. This toughened glass had a chemically hardened outer layer, and its manufacture incorporated an ion exchange and a \"fusion process\" in special furnaces that Corning built in its Christiansburg, Virginia facility. Corning developed it as an alternative to laminated windshields with the intention of becoming an automotive industry supplier. After being installed as side glass in a limited run of 1968 Plymouth Barracudas and Dodge Darts, Chemcor windshields debuted on the 1970 model year Javelins and AMXs built by American Motors Corporation (AMC). As there were no mandatory safety standards for motor vehicle windshields, the larger automakers had no financial incentive to change from the cheaper existing products. Corning terminated its windshield project in 1971, after it turned out to be one of the company's \"biggest and most expensive failures.\"  However, like many Corning innovations, the unique process to manufacture this automotive glass was resurrected and is today the basis of their very profitable LCD glass business.\nIn late 1970, the company announced that researchers Robert D. Maurer, Donald Keck, Peter C. Schultz, and Frank Zimar had demonstrated an optical fiber with a low optical attenuation of 17 dB per kilometer by doping silica glass with titanium. A few years later they produced a fiber with only 4 dB/km, using germanium oxide as the core dopant. Such low attenuations made fiber optics practical for telecommunications and networking. Corning became the world's leading manufacturer of optical fiber.\nIn 1977, considerable attention was given to Corning's Z Glass project. Z Glass was a product used in television picture tubes. Due to a number of factors, the exact nature of which are subject to dispute, this project was considered a steep loss in profit and productivity. The following year the project made a partial recovery. This incident has been cited as a case study by the Harvard School of Business.\nIn 1998, the kitchenware division of Corning Inc. responsible for the development of Pyrex spun off from its parent company as Corning Consumer Products Company, subsequently renamed Corelle Brands. Corning Inc. no longer manufactures or markets consumer products, only industrial ones. \nCompany profits soared in the late 1990s during the dot-com boom, and Corning expanded its fiber operations significantly through the acquisition of telecommunications company Oak Industries and building several new plants.  The company also entered the photonics market, investing heavily with the intent of becoming the leading provider of complete fiber-optic systems.  Failure to succeed in photonics and the collapse in 2000 of the dot-com market had a major impact on the company, and Corning stock plummeted to $1 per share. However, as of 2007 the company had posted five straight years of improving financial performance.\n\nTechnologies\nThe turning point for Corning came when Apple approached it to develop a robust display screen for its upcoming iPhone. Later, other companies also adopted its Gorilla Glass screen. In 2011, Corning announced the expansion of existing facilities and the construction of a Gen 10 facility co-located with the Sharp Corporation manufacturing complex in Sakai, Osaka, Japan. The LCD glass substrate is produced without heavy metals. Corning is a leading manufacturer of the glass used in liquid crystal displays.\nThe company continues to produce optical fiber and cable for the communications industry at its Wilmington and Concord plants in North Carolina. It is also a major manufacturer of ceramic emission control devices for catalytic converters in cars and light trucks that use gasoline engines. The company is also investing in the production of ceramic emission control products for diesel engines as a result of tighter emission standards for those engines both in the U.S. and abroad.\nIn 2007, Corning introduced an optic fiber, ClearCurve, which uses nanostructure technology to facilitate the small radius bending found in FTTX installations.\n\nGorilla Glass, an outgrowth of the 1960s Chemcor project, is a high-strength alkali-aluminosilicate thin sheet glass used as a protective cover glass offering scratch resistance and durability in many touchscreens. According to the book Steve Jobs by Walter Isaacson, Gorilla Glass was used in the first iPhone released in 2007.\nOn October 25, 2011, Corning unveiled Lotus Glass, an environmentally friendly and high-performance glass developed for OLED and LCD displays.\nCorning invests about 10% of revenue in research and development, and has allocated US$300 million towards further expansion of its Sullivan Park research facility near headquarters in Corning, New York.\nCorning Incorporated manufactures a high-purity fused silica employed in microlithography systems, a low expansion glass utilized in the construction of reflective mirror blanks, windows for U.S. Space Shuttles, and Steuben art glass. The number of Corning facilities employing the traditional tanks of molten glass has declined over the years, but it maintains the capacity to supply bulk or finished glass of many types.\nCorning is engaged in research and development on green lasers, mercury abatement, microreactors, photovoltaics, and silicon on glass. Through its Life Sciences division, the company offers products to support life science research, including stem-cell culture products.\nIn September 2019, Apple announced that it would invest $250 million in Corning, in an effort to develop and manufacture the glass needed for many of its products, including the iPhone, Apple Watch, and iPad. Though not confirmed by either company, the investment could be used to develop new products in the future. Apple had already invested $200 million in Corning in 2017.\nIn November 2024, The European Commission announced that Corning Inc. was under investigation for potential antitrust violations related to exclusive supply agreements with mobile phone manufacturers and raw glass processors, which may hinder competition in the specialty glass market.\n\nOther activities\nCorning employs roughly 61,200 people worldwide and had sales of $14.08 billion in 2021. The company has been listed for many years among Fortune's 500 largest companies, and was ranked No. 297 in 2015.\nAlthough the company has long been publicly owned, James R. Houghton, great-great-grandson of the founder, served as chairman of the board of directors from 2001 to 2007. Over the years Houghton family ownership has declined to about 2%. Wendell Weeks has been with the company since 1983 and as of March 2013 was chairman, chief executive officer, and president.\nOver its 160-year history Corning invented a process for rapid and inexpensive production of light bulbs, including developing the glass for Thomas Edison's light bulb. Corning was the glass supplier for lightbulbs for General Electric after Edison General Electric merged with Thomson-Houston Electric Company in 1892. It was an early major manufacturer of glass panels and funnels for television tubes, invented and produced Vycor (high temperature glass with high thermal shock resistance). Corning invented and produced Pyrex, CorningWare and Visions Pyroceram glass-ceramic cookware, and Corelle durable glass dinnerware. Corning manufactured the windows for US crewed space vehicles, and supplied the glass blank for the primary mirror in the Hubble Space Telescope.\nIn 1982, Corning launched Chameleon® Sunglasses and Serengeti® sunglasses at retail, featuring the exclusive combination of Photochromic and Spectral Control® technologies in the lenses.\nIn July 2008, Corning announced the sale of Steuben Glass Works to Steuben Glass LLC, an affiliate of the private equity firm Schottenstein Stores Corporation.  Steuben Glass had been unprofitable for more than a decade, losing 30 million dollars over the previous five years.\nIn February 2011, Corning acquired MobileAccess Networks, an Israeli company that develops distributed antenna systems, which are often used by universities, stadiums and airports to ensure seamless wireless coverage throughout a facility. MobileAccess Networks became part of Corning's telecommunications business unit. In July 2017, Corning acquired SpiderCloud Wireless. In December 2017, Corning acquired all of 3M Communication Market Division, in a cash transaction of approximately $900 million. Acquisition closed during 2018; 3M Communication Market Division became part of Corning Optical Communications business unit.\n\nBoard of directors\nAs of 2024:\n\nDonald W. Blair: retired executive vice president and chief financial officer, NIKE, Inc.\nLeslie A. Brun: chairman and chief executive officer, Sarr Group\nRichard T. Clark: retired chairman, president and chief executive officer, Merck & Co., Inc.\nPamela J. Craig: retired chief financial officer, Accenture plc.\nRobert F. Cummings, Jr.: retired vice chairman of investment banking, JPMorgan Chase & Co.\nRoger W. Ferguson Jr.: Steven A. Tananbaum Distinguished Fellow for International Economics, Council on Foreign Relations\nThomas D. French: senior partner emeritus, McKinsey & Company, Inc.\nDeborah A. Henretta: retired group president of global e-business, Procter & Gamble Company\nDaniel P. Huttenlocher: dean, MIT\nKurt M. Landgraf: retired president and chief executive officer, Educational Testing Service\nKevin Martin: vice president, US public policy, Meta Platforms, Inc.\nDeborah D. Rieman: retired executive chairman, MetaMarkets Group\nHansel E. Tookes II: retired chairman and chief executive officer, Raytheon Aircraft Company\nWendell P. Weeks: chairman, chief executive officer, and president, Corning Incorporated\nMark S. Wrighton: professor of chemistry and chancellor emeritas, Washington University in St. Louis\n\nSee also\nCorelle Brands LLC, the later name adopted by the Corning Consumer Products Company subsidiary that was sold to Borden in 1998, before it merged with Instant Brands in 2019.\nCorning Museum of Glass\nCity of Corning, NY\nHoughton family\nMacor, a machineable glass-ceramic developed by Corning\nOverflow downdraw method, a technology applied by Corning Incorporated for producing flat panel displays\n\nReferences\nFurther reading\n\"The Trials of Amory Houghton Jr\". Forbes. September 1977. Archived from the original on November 8, 2022.\nGardiner, Bryan (September 24, 2012). \"Glass Works: How Corning Created the Ultrathin, Ultrastrong Material of the Future\". Wired.\n\nExternal links\n\nOfficial website\nBusiness data for Corning Inc.:",
  "clean_text": "Corning Incorporated is an American multinational technology company specializing in glass, ceramics, and related materials and technologies including advanced optics, primarily for industrial and scientific applications. The company was named Corning Glass Works until 1989. Corning divested its consumer product lines (including CorningWare and Visions Pyroceram-based cookware, Corelle Vitrelle tableware, and Pyrex glass bakeware) in 1998 by selling the Corning Consumer Products Company subsidiary (later Corelle Brands) to Borden. As of 2014, Corning had five major business sectors: display technologies, environmental technologies, life sciences, optical communications, and specialty materials. Corning is involved in two joint ventures: Dow Corning and Pittsburgh Corning. The company completed the corporate spin-offs of Quest Diagnostics and Covance (now Fortrea) in January 1997. Corning is one of the main suppliers to Apple Inc. Since working with Steve Jobs in 2007, to develop the iPhone; Corning develops and manufactures Gorilla Glass, which is used by many smartphone makers. It is one of the world's biggest glassmakers. Corning won the National Medal of Technology and Innovation four times for its product and process innovations. Corning continues to maintain its world headquarters at Corning, N.Y. The firm also established one of the first industrial research labs there in 1908. It continues to expand the nearby research and development facility, as well as operations associated with catalytic converters and diesel engine filter product lines. Corning has a long history of community development and has assured community leaders that it intends to remain headquartered in its small upstate New York hometown. History Corning Glass Works was founded in 1851 by Amory Houghton, in Somerville, Massachusetts, originally as the Bay State Glass Co. It later moved to Williamsburg, Brooklyn, and operated as the Brooklyn Flint Glass Works. The company moved again to its ultimate home and eponym, the city of Corning, New York, in 1868, under leadership of the founder's son, Amory Houghton Jr. In 1915, Corning created an improved heat resistant glass formula and launched Pyrex, the first-ever consumer cooking products made with temperature-resistant glass, in 1915. The California Institute of Technology's 200-inch (5.1 m) telescope mirror at Palomar Observatory was cast by Corning during 1934–1936, out of low expansion borosilicate glass. In 1932, George Ellery Hale approached Corning with the challenge of fabricating the required optic for his Palomar project. A previous effort to fabricate the optic from fused quartz had failed. Corning's first attempt was a failure, the cast blank having voids. Using lessons learned, Corning was successful in the casting of the second blank. After a year of cooling, during which it was almost lost to a flood, in 1935, the blank was completed. The first blank now resides in Corning's Museum of Glass. In 1935, Corning formed a partnership with bottle maker Owens-Illinois, which formed the company known today as Owens Corning. Owens Corning was spun off as a separate company in 1938. The company had a history of science-based innovations following World War II and the strategy by management was research and \"disruptive\" and \"on demand\" product innovation. In 1962, Corning developed Chemcor, a new toughened automobile windshield designed to be thinner and lighter than existing windshields, which reduced danger of personal injury by shattering into small granules when smashed. This toughened glass had a chemically hardened outer layer, and its manufacture incorporated an ion exchange and a \"fusion process\" in special furnaces that Corning built in its Christiansburg, Virginia facility. Corning developed it as an alternative to laminated windshields with the intention of becoming an automotive industry supplier. After being installed as side glass in a limited run of 1968 Plymouth Barracudas and Dodge Darts, Chemcor windshields debuted on the 1970 model year Javelins and AMXs built by American Motors Corporation (AMC). As there were no mandatory safety standards for motor vehicle windshields, the larger automakers had no financial incentive to change from the cheaper existing products. Corning terminated its windshield project in 1971, after it turned out to be one of the company's \"biggest and most expensive failures.\" However, like many Corning innovations, the unique process to manufacture this automotive glass was resurrected and is today the basis of their very profitable LCD glass business. In late 1970, the company announced that researchers Robert D. Maurer, Donald Keck, Peter C. Schultz, and Frank Zimar had demonstrated an optical fiber with a low optical attenuation of 17 dB per kilometer by doping silica glass with titanium. A few years later they produced a fiber with only 4 dB/km, using germanium oxide as the core dopant. Such low attenuations made fiber optics practical for telecommunications and networking. Corning became the world's leading manufacturer of optical fiber. In 1977, considerable attention was given to Corning's Z Glass project. Z Glass was a product used in television picture tubes. Due to a number of factors, the exact nature of which are subject to dispute, this project was considered a steep loss in profit and productivity. The following year the project made a partial recovery. This incident has been cited as a case study by the Harvard School of Business. In 1998, the kitchenware division of Corning Inc. responsible for the development of Pyrex spun off from its parent company as Corning Consumer Products Company, subsequently renamed Corelle Brands. Corning Inc. no longer manufactures or markets consumer products, only industrial ones. Company profits soared in the late 1990s during the dot-com boom, and Corning expanded its fiber operations significantly through the acquisition of telecommunications company Oak Industries and building several new plants. The company also entered the photonics market, investing heavily with the intent of becoming the leading provider of complete fiber-optic systems. Failure to succeed in photonics and the collapse in 2000 of the dot-com market had a major impact on the company, and Corning stock plummeted to $1 per share. However, as of 2007 the company had posted five straight years of improving financial performance. Technologies The turning point for Corning came when Apple approached it to develop a robust display screen for its upcoming iPhone. Later, other companies also adopted its Gorilla Glass screen. In 2011, Corning announced the expansion of existing facilities and the construction of a Gen 10 facility co-located with the Sharp Corporation manufacturing complex in Sakai, Osaka, Japan. The LCD glass substrate is produced without heavy metals. Corning is a leading manufacturer of the glass used in liquid crystal displays. The company continues to produce optical fiber and cable for the communications industry at its Wilmington and Concord plants in North Carolina. It is also a major manufacturer of ceramic emission control devices for catalytic converters in cars and light trucks that use gasoline engines. The company is also investing in the production of ceramic emission control products for diesel engines as a result of tighter emission standards for those engines both in the U.S. and abroad. In 2007, Corning introduced an optic fiber, ClearCurve, which uses nanostructure technology to facilitate the small radius bending found in FTTX installations. Gorilla Glass, an outgrowth of the 1960s Chemcor project, is a high-strength alkali-aluminosilicate thin sheet glass used as a protective cover glass offering scratch resistance and durability in many touchscreens. According to the book Steve Jobs by Walter Isaacson, Gorilla Glass was used in the first iPhone released in 2007. On October 25, 2011, Corning unveiled Lotus Glass, an environmentally friendly and high-performance glass developed for OLED and LCD displays. Corning invests about 10% of revenue in research and development, and has allocated US$300 million towards further expansion of its Sullivan Park research facility near headquarters in Corning, New York. Corning Incorporated manufactures a high-purity fused silica employed in microlithography systems, a low expansion glass utilized in the construction of reflective mirror blanks, windows for U.S. Space Shuttles, and Steuben art glass. The number of Corning facilities employing the traditional tanks of molten glass has declined over the years, but it maintains the capacity to supply bulk or finished glass of many types. Corning is engaged in research and development on green lasers, mercury abatement, microreactors, photovoltaics, and silicon on glass. Through its Life Sciences division, the company offers products to support life science research, including stem-cell culture products. In September 2019, Apple announced that it would invest $250 million in Corning, in an effort to develop and manufacture the glass needed for many of its products, including the iPhone, Apple Watch, and iPad. Though not confirmed by either company, the investment could be used to develop new products in the future. Apple had already invested $200 million in Corning in 2017. In November 2024, The European Commission announced that Corning Inc. was under investigation for potential antitrust violations related to exclusive supply agreements with mobile phone manufacturers and raw glass processors, which may hinder competition in the specialty glass market. Other activities Corning employs roughly 61,200 people worldwide and had sales of $14.08 billion in 2021. The company has been listed for many years among Fortune's 500 largest companies, and was ranked No. 297 in 2015. Although the company has long been publicly owned, James R. Houghton, great-great-grandson of the founder, served as chairman of the board of directors from 2001 to 2007. Over the years Houghton family ownership has declined to about 2%. Wendell Weeks has been with the company since 1983 and as of March 2013 was chairman, chief executive officer, and president. Over its 160-year history Corning invented a process for rapid and inexpensive production of light bulbs, including developing the glass for Thomas Edison's light bulb. Corning was the glass supplier for lightbulbs for General Electric after Edison General Electric merged with Thomson-Houston Electric Company in 1892. It was an early major manufacturer of glass panels and funnels for television tubes, invented and produced Vycor (high temperature glass with high thermal shock resistance). Corning invented and produced Pyrex, CorningWare and Visions Pyroceram glass-ceramic cookware, and Corelle durable glass dinnerware. Corning manufactured the windows for US crewed space vehicles, and supplied the glass blank for the primary mirror in the Hubble Space Telescope. In 1982, Corning launched Chameleon® Sunglasses and Serengeti® sunglasses at retail, featuring the exclusive combination of Photochromic and Spectral Control® technologies in the lenses. In July 2008, Corning announced the sale of Steuben Glass Works to Steuben Glass LLC, an affiliate of the private equity firm Schottenstein Stores Corporation. Steuben Glass had been unprofitable for more than a decade, losing 30 million dollars over the previous five years. In February 2011, Corning acquired MobileAccess Networks, an Israeli company that develops distributed antenna systems, which are often used by universities, stadiums and airports to ensure seamless wireless coverage throughout a facility. MobileAccess Networks became part of Corning's telecommunications business unit. In July 2017, Corning acquired SpiderCloud Wireless. In December 2017, Corning acquired all of 3M Communication Market Division, in a cash transaction of approximately $900 million. Acquisition closed during 2018; 3M Communication Market Division became part of Corning Optical Communications business unit. Board of directors As of 2024: Donald W. Blair: retired executive vice president and chief financial officer, NIKE, Inc. Leslie A. Brun: chairman and chief executive officer, Sarr Group Richard T. Clark: retired chairman, president and chief executive officer, Merck & Co., Inc. Pamela J. Craig: retired chief financial officer, Accenture plc. Robert F. Cummings, Jr.: retired vice chairman of investment banking, JPMorgan Chase & Co. Roger W. Ferguson Jr.: Steven A. Tananbaum Distinguished Fellow for International Economics, Council on Foreign Relations Thomas D. French: senior partner emeritus, McKinsey & Company, Inc. Deborah A. Henretta: retired group president of global e-business, Procter & Gamble Company Daniel P. Huttenlocher: dean, MIT Kurt M. Landgraf: retired president and chief executive officer, Educational Testing Service Kevin Martin: vice president, US public policy, Meta Platforms, Inc. Deborah D. Rieman: retired executive chairman, MetaMarkets Group Hansel E. Tookes II: retired chairman and chief executive officer, Raytheon Aircraft Company Wendell P. Weeks: chairman, chief executive officer, and president, Corning Incorporated Mark S. Wrighton: professor of chemistry and chancellor emeritas, Washington University in St. Louis"
}