{
  "ticker": "GNRC",
  "cik": "0001474735",
  "company_name": "Generac",
  "corrected_name": "Generac",
  "wiki_title_used": "Generac",
  "exists": true,
  "raw_text": "Generac Holdings Inc., commonly referred to as Generac (derived from a combination of generating and AC), is a Fortune 1000 American manufacturer of backup power generation products for residential, light commercial and industrial markets. Generac's power systems range in output from 800 watts to 9 megawatts, and are available through  independent dealers, retailers and wholesalers. Generac is headquartered in Waukesha, Wisconsin, and has manufacturing facilities in Berlin, Oshkosh, Jefferson, Eagle, and Whitewater; all in Wisconsin.\n\nHistory\nFounded by Robert Kern in 1959, the company soon began producing portable generators for Sears, Roebuck and Co. under the Craftsman brand. During the 1970s, Generac expanded its offerings in the portable and recreational vehicle markets, and in the 1980s the company entered the commercial and industrial markets with its backup power generation systems.\nBy end of the 1980s, the company was manufacturing residential, commercial and industrial generators, and in 1989, Generac introduced the first gaseous-fueled automatic home standby system.\nIn 1992, Generac began private labeling generator sets for Caterpillar, Inc. As the partnership grew between the two companies, they discussed a potential acquisition of Generac by Caterpillar, although a deal was never finalized. In June 1996, Caterpillar decided to terminate the private labeling agreement. Generac then sued Caterpillar under the Wisconsin Fair Dealership Law (\"WFDL\"), the Sherman Antitrust Act, the Wisconsin common law concerning restrictive covenants, and the Illinois Consumer Fraud and Deceptive Business Practices Act. The federal district court, in two separate orders, disposed of the action in Caterpillar's favor. Generac then challenged the lower court's rulings in the U.S. 7th Circuit Court of Appeals, which ruled that Generac's claims were properly dismissed by the lower court. Generac continued to supply some transfer switches to Caterpillar until 2002, when Caterpillar changed suppliers.\nIn 1998, Generac sold its portable products division to the Beacon group, a private equity firm, who later sold it to Briggs & Stratton. Upon expiration of a non-compete agreement related to the sale in 2007, Generac re-entered the portable generator market in 2008.\nIn late 2006, Generac was purchased by CCMP Capital of New York. In 2009 CCMP took a write-off, described as a non-cash goodwill and trade name impairment charge, of $583.5 million against their purchase of Generac.\nAaron Jagdfeld was appointed president and chief executive officer in September, 2008 and is the current CEO.\n\nGenerac goes public\nOn February 11, 2010, Generac Holdings Inc. (NYSE: GNRC), parent company of Generac Power Systems, Inc., began trading on the New York Stock Exchange under the ticker symbol GNRC.  The initial public offering provided $224 million in net proceeds, which were used to pay down debt.\n\nRecognition\nGenerac is a recipient of Milwaukee Magazine’s “Best Places to Work” award for Southeastern Wisconsin.\nGenerac's industrial sizing application, Power Design Pro, received silver in the 2010 Plant Engineering \"Product of the Year\" award.\nThe company has also earned the Good Housekeeping Seal for its Guardian Series home standby generators and several portable generators.\nGenerac was honored with the 2014 Natural Gas Generator Company of the Year Award from Frost & Sullivan for its contribution to the North American natural gas generator set industry.\n\nProducts\nGenerac manufactures gasoline-fueled, diesel-fueled and bi-fuel engine-driven power generation equipment, modular paralleling systems, automatic transfer switches and small engines. The company supplies products to the industrial, commercial, and portable generator markets through many different distributors.\nIn December 2009, Generac introduced Generac Industrial Power (a rebranding of its industrial products division) to include new engines, new enclosures, ergonomic changes and aesthetic changes. This included a partnership with Fiat Powertrain Technologies to supply Generac with industrial diesel engines for use in industrial generators.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Generac Holdings:",
  "clean_text": "Generac Holdings Inc., commonly referred to as Generac (derived from a combination of generating and AC), is a Fortune 1000 American manufacturer of backup power generation products for residential, light commercial and industrial markets. Generac's power systems range in output from 800 watts to 9 megawatts, and are available through independent dealers, retailers and wholesalers. Generac is headquartered in Waukesha, Wisconsin, and has manufacturing facilities in Berlin, Oshkosh, Jefferson, Eagle, and Whitewater; all in Wisconsin. History Founded by Robert Kern in 1959, the company soon began producing portable generators for Sears, Roebuck and Co. under the Craftsman brand. During the 1970s, Generac expanded its offerings in the portable and recreational vehicle markets, and in the 1980s the company entered the commercial and industrial markets with its backup power generation systems. By end of the 1980s, the company was manufacturing residential, commercial and industrial generators, and in 1989, Generac introduced the first gaseous-fueled automatic home standby system. In 1992, Generac began private labeling generator sets for Caterpillar, Inc. As the partnership grew between the two companies, they discussed a potential acquisition of Generac by Caterpillar, although a deal was never finalized. In June 1996, Caterpillar decided to terminate the private labeling agreement. Generac then sued Caterpillar under the Wisconsin Fair Dealership Law (\"WFDL\"), the Sherman Antitrust Act, the Wisconsin common law concerning restrictive covenants, and the Illinois Consumer Fraud and Deceptive Business Practices Act. The federal district court, in two separate orders, disposed of the action in Caterpillar's favor. Generac then challenged the lower court's rulings in the U.S. 7th Circuit Court of Appeals, which ruled that Generac's claims were properly dismissed by the lower court. Generac continued to supply some transfer switches to Caterpillar until 2002, when Caterpillar changed suppliers. In 1998, Generac sold its portable products division to the Beacon group, a private equity firm, who later sold it to Briggs & Stratton. Upon expiration of a non-compete agreement related to the sale in 2007, Generac re-entered the portable generator market in 2008. In late 2006, Generac was purchased by CCMP Capital of New York. In 2009 CCMP took a write-off, described as a non-cash goodwill and trade name impairment charge, of $583.5 million against their purchase of Generac. Aaron Jagdfeld was appointed president and chief executive officer in September, 2008 and is the current CEO. Generac goes public On February 11, 2010, Generac Holdings Inc. (NYSE: GNRC), parent company of Generac Power Systems, Inc., began trading on the New York Stock Exchange under the ticker symbol GNRC. The initial public offering provided $224 million in net proceeds, which were used to pay down debt. Recognition Generac is a recipient of Milwaukee Magazine’s “Best Places to Work” award for Southeastern Wisconsin. Generac's industrial sizing application, Power Design Pro, received silver in the 2010 Plant Engineering \"Product of the Year\" award. The company has also earned the Good Housekeeping Seal for its Guardian Series home standby generators and several portable generators. Generac was honored with the 2014 Natural Gas Generator Company of the Year Award from Frost & Sullivan for its contribution to the North American natural gas generator set industry. Products Generac manufactures gasoline-fueled, diesel-fueled and bi-fuel engine-driven power generation equipment, modular paralleling systems, automatic transfer switches and small engines. The company supplies products to the industrial, commercial, and portable generator markets through many different distributors. In December 2009, Generac introduced Generac Industrial Power (a rebranding of its industrial products division) to include new engines, new enclosures, ergonomic changes and aesthetic changes. This included a partnership with Fiat Powertrain Technologies to supply Generac with industrial diesel engines for use in industrial generators."
}