{
  "ticker": "GPC",
  "cik": "0000040987",
  "company_name": "Genuine Parts Company",
  "corrected_name": "Genuine Parts Company",
  "wiki_title_used": "Genuine Parts Company",
  "exists": true,
  "raw_text": "Genuine Parts Company (GPC) is an American automotive and industrial parts distributor based in Atlanta, Georgia. Established by brothers Carlyle and Malcolm Fraser in 1928, the company has approximately 60,000 employees. In addition to the United States, GPC has operated in Australasia, Belgium, Canada, France, Germany, Mexico, the Netherlands, Poland, and the United Kingdom. GPC's subsidiaries include industrial parts distributor Motion as well as NAPA Auto Parts, which primarily sells parts in North America.\n\nCompany overview\nFounded in 1925, GPC is headquartered in Atlanta, Georgia and consists of multiple subsidiaries that distribute automotive replacement parts, industrial replacement parts, office products and electrical/electronic materials. The company has paid a cash dividend to shareholders every year since going public in 1948. The company moved into its new headquarters building in the Wildwood area of Cobb County, Georgia in June 2016.\nS. P. Richards was sold on June 30, 2020, to H.I.G. Capital.\n\nCompany History\nGenuine Parts Company (GPC) was founded by brothers Carlyle and Malcolm Fraser in Atlanta in 1928.\nGPC's headquarters were located at Atlanta's Circle 75, in Cobb County, starting in 1979. Approximately 400 employees worked in the 115,000-square-foot space. In 2014, GPC announced plans to relocate its headquarters to Wildwood Office Park, next to an existing operational support facility.\nWilliam P. Stengel II is GPC's president and chief executive officer (CEO). He joined the company as GPC's first chief transformation officer in 2019, became president in 2021, and became chief operating officer in 2023. Stengel succeeded Paul Donahue, who became the CEO of GPC in 2016. Donahue succeeded Tom Gallagher, who initially continued as chairperson, until Donahue was elected by the board of directors to that role in 2019. Donahue transitioned to executive chairman in 2024.\nGPC ranked number 239 on Forbes' America's Best Employers list in 2017 and number 262 on the magazine's list of America's Largest Public Companies in 2018. The company also ranked number 678 on Forbes' World Best Employers list in 2020, and number 731 on the Forbes Global 2000 list in 2024.\n\nCompany timeline\n1925    National Automotive Parts Association established.\n1928    Genuine Parts Company established.\n1948    GPC Initial Public Offering.\n1975    Acquired S.P. Richards Company.\n1976    Acquired Motion Industries.\n1994    Joint Venture with Auto Todo.\n1998    Acquired EIS.\n2008    Acquired Altrom.\n2013    Acquired GPC Asia Pacific.\n2016    Acquired AMX Superstores\n2016    Acquired Auto-Camping\n2017    Acquired Inenco Group (Australia).\n2021    Acquired RSP Automotive & Industrial.\n2024    Acquired Motor Parts & Equipment Corporation (MPEC)\n\nSubsidiaries\nGPC has two primary business segments: Motion, which focuses on industrial products, and the automotive brand NAPA Auto Parts.\nAccording to Industrial Distribution, Motion started as a distributor of bearings and industrial supplies, and expanded to offer products related to automation, conveyance, hydraulics, fluid power, and robotics. GPC acquired Motion in 1976. GPC's electrical products division, EIS Inc., merged with Motion in 2018, before being sold in October 2019. Based in Birmingham, Alabama, Motion has approximately 9,000 employees and 170,000 customers as of 2023.\nNAPA Auto Parts was established in 1925. Some NAPA Auto Parts stores are owned and operated by GPC, but most are independently owned and operated. There were approximately 6,000 NAPA Auto Parts stores in 2020.\nGPC acquired UAP Inc. of Canada in 1998 and the Australian car parts supplier Exego Group in 2013. GPC and its four business units acquired nineteen companies in 2016. In 2017, GPC acquired a 35 percent stake in industrial distributor Inenco Group, as well as Alliance Automotive Group. GPC acquired Kaman Distribution Group (KDG), a provider of industrial solutions such as automation, conveyance, and fluid power, in 2022.\n\nFormer subsidiaries\nIn 1975, GPC acquired S.P. Richards, which was described by Industrial Distribution as \"a distributor of general office products, technology products and accessories, office furniture, JanSan and safety supplies\".\nIn 2018, GPC announced plans to merge the \"workplace essentials distributor\" Essendant into S.P. Richards, following a spin-off of S.P. Richards to become an independent company called Essendant. GPC sold S.P. Richards through a series of transactions in 2020, starting with the Canada division in January. The U.S. operations were sold to an investor group and the Supply Source Enterprise business, which included The Safety Zone and Impact Products operations, were sold to an affiliate of H.I.G. Capital. GPC continued with Motion and NAPA Auto Parts.\n\nReferences\nExternal links\nBusiness data for Genuine Parts Company:",
  "clean_text": "Genuine Parts Company (GPC) is an American automotive and industrial parts distributor based in Atlanta, Georgia. Established by brothers Carlyle and Malcolm Fraser in 1928, the company has approximately 60,000 employees. In addition to the United States, GPC has operated in Australasia, Belgium, Canada, France, Germany, Mexico, the Netherlands, Poland, and the United Kingdom. GPC's subsidiaries include industrial parts distributor Motion as well as NAPA Auto Parts, which primarily sells parts in North America. Company overview Founded in 1925, GPC is headquartered in Atlanta, Georgia and consists of multiple subsidiaries that distribute automotive replacement parts, industrial replacement parts, office products and electrical/electronic materials. The company has paid a cash dividend to shareholders every year since going public in 1948. The company moved into its new headquarters building in the Wildwood area of Cobb County, Georgia in June 2016. S. P. Richards was sold on June 30, 2020, to H.I.G. Capital. Company History Genuine Parts Company (GPC) was founded by brothers Carlyle and Malcolm Fraser in Atlanta in 1928. GPC's headquarters were located at Atlanta's Circle 75, in Cobb County, starting in 1979. Approximately 400 employees worked in the 115,000-square-foot space. In 2014, GPC announced plans to relocate its headquarters to Wildwood Office Park, next to an existing operational support facility. William P. Stengel II is GPC's president and chief executive officer (CEO). He joined the company as GPC's first chief transformation officer in 2019, became president in 2021, and became chief operating officer in 2023. Stengel succeeded Paul Donahue, who became the CEO of GPC in 2016. Donahue succeeded Tom Gallagher, who initially continued as chairperson, until Donahue was elected by the board of directors to that role in 2019. Donahue transitioned to executive chairman in 2024. GPC ranked number 239 on Forbes' America's Best Employers list in 2017 and number 262 on the magazine's list of America's Largest Public Companies in 2018. The company also ranked number 678 on Forbes' World Best Employers list in 2020, and number 731 on the Forbes Global 2000 list in 2024. Company timeline 1925 National Automotive Parts Association established. 1928 Genuine Parts Company established. 1948 GPC Initial Public Offering. 1975 Acquired S.P. Richards Company. 1976 Acquired Motion Industries. 1994 Joint Venture with Auto Todo. 1998 Acquired EIS. 2008 Acquired Altrom. 2013 Acquired GPC Asia Pacific. 2016 Acquired AMX Superstores 2016 Acquired Auto-Camping 2017 Acquired Inenco Group (Australia). 2021 Acquired RSP Automotive & Industrial. 2024 Acquired Motor Parts & Equipment Corporation (MPEC) Subsidiaries GPC has two primary business segments: Motion, which focuses on industrial products, and the automotive brand NAPA Auto Parts. According to Industrial Distribution, Motion started as a distributor of bearings and industrial supplies, and expanded to offer products related to automation, conveyance, hydraulics, fluid power, and robotics. GPC acquired Motion in 1976. GPC's electrical products division, EIS Inc., merged with Motion in 2018, before being sold in October 2019. Based in Birmingham, Alabama, Motion has approximately 9,000 employees and 170,000 customers as of 2023. NAPA Auto Parts was established in 1925. Some NAPA Auto Parts stores are owned and operated by GPC, but most are independently owned and operated. There were approximately 6,000 NAPA Auto Parts stores in 2020. GPC acquired UAP Inc. of Canada in 1998 and the Australian car parts supplier Exego Group in 2013. GPC and its four business units acquired nineteen companies in 2016. In 2017, GPC acquired a 35 percent stake in industrial distributor Inenco Group, as well as Alliance Automotive Group. GPC acquired Kaman Distribution Group (KDG), a provider of industrial solutions such as automation, conveyance, and fluid power, in 2022. Former subsidiaries In 1975, GPC acquired S.P. Richards, which was described by Industrial Distribution as \"a distributor of general office products, technology products and accessories, office furniture, JanSan and safety supplies\". In 2018, GPC announced plans to merge the \"workplace essentials distributor\" Essendant into S.P. Richards, following a spin-off of S.P. Richards to become an independent company called Essendant. GPC sold S.P. Richards through a series of transactions in 2020, starting with the Canada division in January. The U.S. operations were sold to an investor group and the Supply Source Enterprise business, which included The Safety Zone and Impact Products operations, were sold to an affiliate of H.I.G. Capital. GPC continued with Motion and NAPA Auto Parts."
}