{
  "ticker": "GPN",
  "cik": "0001123360",
  "company_name": "Global Payments",
  "corrected_name": "Global Payments",
  "wiki_title_used": "Global Payments",
  "exists": true,
  "raw_text": "Global Payments Inc. is an American multinational financial technology company that provides payment technology and services to merchants, issuers and consumers. In June 2021, the company was named to the Fortune 500. The company processes payments made through credit cards, debit cards, and digital and contactless payments.\n\nHistory\nGlobal Payments was founded in 1996 and spun off from National Data Corporation, its former parent company, in 2001. Global Payments has been an independent, publicly traded company on the New York Stock Exchange having the ticker symbol “GPN” since its spin off.\nIn 2009, it paid $75 million for United Card Service, Russia's leading credit card processing company. In 2011, Global Payments's United Card Service bought Alfa-Bank's credit card processing unit. In October 2012, it acquired the smaller Accelerated Payment Technologies for $413 million. In October 2014, it purchased Australian payment processing company Ezidebit for $305 million. In January 2015, it bought Payment Processing (also known as PayPros), a California company, for $420 million.\nIn March 2015, Global Payments bought Realex Payments, an Irish-based payments gateway services company, for €115 million. On April 25, 2016, Global Payments completed the acquisition of Heartland Payment Systems for $4.3 billion. Both Global Payments and its subsidiary Heartland Payment Systems were among the leading credit card processing companies in 2016, according to Business Insider.  Its headquarters moved from Sandy Springs, Georgia to Atlanta, Georgia in 2016.\nIn 2017, Global Payments initiated acquiring divisions of Active Networks. In 2018, Global Payments completed the acquisition of AdvancedMD. Also in 2018, Global Payments completed the acquisition of Sentral Education.\nOn May 28, 2019, Global Payments announced a $21.5 billion merger with TSYS. The merger was expected to trigger a Federal Trade Commission investigation. However, no such investigation occurred.\nIn August 2022, Global Payments entered a definitive agreement to acquire EVO Payments Inc. for nearly $4 billion.\nOn May 1, 2023, the company announced that CEO Jeffrey M. Sloan would resign, effective June 1, 2023. COO Cameron M. Bready succeeded him as CEO and president. As of July 2023, no single COO of the company had been named. Instead, two individuals were appointed to oversee domestic and international operations as Senior Executive Vice Presidents: Vince Lombardo and Bob Cortopassi, respectively.\nStarting in early 2024 and continuing into September, Global Payments began laying off staff. These layoffs took place in the US, Canada, UK and India, as well as other smaller regional markets. Approximately 5400 employees were laid off during this time. Just weeks before the September lay offs were announced, Global Payments reported their second quarter results. Global Payments reported a net income of $296.4 million, a significant increase of $46.6 million compared to $249.7 million in the same quarter of 2023.\nIn April 2025, Global Payments agreed to acquire Worldpay, a payments technology provider, for $22 billion.\n\nServices and operations\nGlobal Payments provides payment services directly to merchants and indirectly through other financial organizations. Its technology-enabled services also support integrated payments, e-commerce, and omni-channel services.\nThrough Total System Services (TSYS), its issuer processor business, Global Payments helps banks manage credit and debit card portfolios.\nGlobal Payments operates in more than 100 countries and serves 3.5 million merchants as well as 1,300 financial institutions. The company processes more than 50 billion transactions per year. After merging with TSYS in 2019, Global Payments has nearly 24,000 employees.\nIn 2020, 63 percent of the company's revenue was derived from \"Merchant Solutions\"  26 percent from Issuer Solutions, and 11 percent from the Business and Consumer Solutions segment, which operates as NetSpend. Eighty percent of Global Payments Merchant Solutions revenue was from North America, 15 percent was from Europe, and five percent was from Asia. Additionally in 2020, the company was recognized as the first payment processor to win the J.D. Power Award for excellence in customer service; an effort spearheaded by Senior Vice President Jim Hightower and now-Senior Executive Vice President Bob Cortopassi.\nAs of 2023, Global Payments does not have a singular Chief Operating Officer (COO). Instead the company divides operations into two distinct branches: domestic \"US Merchant Solutions\" headed by Senior Executive Vice President Vince Lombardo and international and vertical markets headed by Senior Executive Vice President Bob Cortopassi. Current CEO Cameron M. Bready was formerly the COO of the company, but no COO was announced as part of the succession plan.\n\nData breaches and faults\nIn 2012, a data breach at Global Payments affected 1.5 million credit and debit card numbers.  This breach eventually cost the company around $100 million.  In 2015, a technical fault with Global Payments' systems led to thousands of British businesses being unable to accept credit card payments on Valentine's Day weekend.\n\nLawsuits\nStory v. Heartland Payments Systems\nIn 2019, Global Payments subsidiary Heartland Payments Systems was sued by Florida resident Max Story, alleging that Heartland defrauded parents of school children by leading them to believe that fees collected by the MySchoolBucks online lunch payment service, which Heartland owns and operates and which is used by 2 million people with children in 30,000 schools in the US, were going to their children's schools when in fact the money was going to Heartland. Shortly after the lawsuit was filed, Heartland deposited $40,000 into Story's bank account in an attempt to nullify Story's legal standing to sue, but Story refused to accept the payment and reversed the deposit. To limit the number of people who could potentially join the lawsuit if it is granted class action status, Heartland also updated its terms of service in 2019 to require MySchoolBucks users to accept that they \"will not be permitted to participate in the Story case as a class member.\"\n\nMerger with TSYS\nTotal System Services, Inc. (commonly referred to as TSYS), was an American financial technology company headquartered in Columbus, Georgia. In 2019, TSYS was merged into Global Payments Inc. TSYS is the largest third-party payment processor for issuing banks in North America, with a 40% market share, and one of the largest in Europe. It provides payment processing services, merchant services and related payment services. It also provides reloadable prepaid debit cards and payroll cards, and demand deposit accounts to the underbanked.\nIn 1959, TSYS was founded as a division of Columbus Bank and Trust (now Synovus). In 1974, it began processing credit cards for other banks. In August 1983, the company became a public company via an initial public offering.\nIn 1995, the company merged its merchant processing services with those of Visa Inc. In August 2004, the company acquired Clarity Payment Solutions for $53 million. In 2007, Synovus completed the corporate spin-off of TSYS. In July 2004, the company began processing the credit cards issued by J.P. Morgan Chase. In 2008, the company launched n>genuity, a quarterly publication on the world of payments.\nIn 2010, the company acquired a 51% stake in the merchant acquisition business of First National Bank of Omaha for $150.5 million, which was renamed TSYS Merchant Solutions. The remaining 49% stake was acquired in January 2011. In May 2011, the company acquired TermNet. In August 2012, the company announced a joint venture with Central Payment Co. LLC, a direct merchant acquirer. In December 2012, the company acquired ProPay, a Utah-based company with over 250,000 merchants.\nIn July 2013, the company acquired Netspend, a prepaid debit card provider, for $1.4 billion. In November 2013, the company announced TSYS Merchant Insights, a partnership with Womply, a San Francisco-based startup, to provide revenue, social media, and reputation analysis tools to all TSYS merchants.\nIn June 2014, CEO Philip W. Tomlinson retired and was replaced with M. Troy Woods, then the president and COO. In April 2016, the company acquired TransFirst for $2.35 billion, making it the 6th largest acquirer in the United States. In June 2016, the company acquired the remaining 45% stake in TSYS Managed Services EMEA from The Merchants Group Limited.\nIn February 2017, the company's lobbying of the Republican Party was credited for a bill that would remove the Consumer Financial Protection Bureau's limits on overdraft fees. 10-12% of NetSpend's revenue comes from these fees.\nIn late 2017, the company acquired a former Citigroup card production facility in Columbus, Ohio and invested $25 million to build out a second, 200,000 square feet (19,000 m2) credit card production facility, with a capacity to produce 67 million credit cards per year.\nIn January 2018, the company acquired Cayan for $1.05 billion. In June 2018, the company acquired Jacksonville, Florida-based iMobile3 for $13.4 million.\nOn September 18, 2019, TSYS and Global Payments completed their merger agreement for $21.5 billion.\n\nReferences\nExternal links\nBusiness data for Global Payments Inc.:",
  "clean_text": "Global Payments Inc. is an American multinational financial technology company that provides payment technology and services to merchants, issuers and consumers. In June 2021, the company was named to the Fortune 500. The company processes payments made through credit cards, debit cards, and digital and contactless payments. History Global Payments was founded in 1996 and spun off from National Data Corporation, its former parent company, in 2001. Global Payments has been an independent, publicly traded company on the New York Stock Exchange having the ticker symbol “GPN” since its spin off. In 2009, it paid $75 million for United Card Service, Russia's leading credit card processing company. In 2011, Global Payments's United Card Service bought Alfa-Bank's credit card processing unit. In October 2012, it acquired the smaller Accelerated Payment Technologies for $413 million. In October 2014, it purchased Australian payment processing company Ezidebit for $305 million. In January 2015, it bought Payment Processing (also known as PayPros), a California company, for $420 million. In March 2015, Global Payments bought Realex Payments, an Irish-based payments gateway services company, for €115 million. On April 25, 2016, Global Payments completed the acquisition of Heartland Payment Systems for $4.3 billion. Both Global Payments and its subsidiary Heartland Payment Systems were among the leading credit card processing companies in 2016, according to Business Insider. Its headquarters moved from Sandy Springs, Georgia to Atlanta, Georgia in 2016. In 2017, Global Payments initiated acquiring divisions of Active Networks. In 2018, Global Payments completed the acquisition of AdvancedMD. Also in 2018, Global Payments completed the acquisition of Sentral Education. On May 28, 2019, Global Payments announced a $21.5 billion merger with TSYS. The merger was expected to trigger a Federal Trade Commission investigation. However, no such investigation occurred. In August 2022, Global Payments entered a definitive agreement to acquire EVO Payments Inc. for nearly $4 billion. On May 1, 2023, the company announced that CEO Jeffrey M. Sloan would resign, effective June 1, 2023. COO Cameron M. Bready succeeded him as CEO and president. As of July 2023, no single COO of the company had been named. Instead, two individuals were appointed to oversee domestic and international operations as Senior Executive Vice Presidents: Vince Lombardo and Bob Cortopassi, respectively. Starting in early 2024 and continuing into September, Global Payments began laying off staff. These layoffs took place in the US, Canada, UK and India, as well as other smaller regional markets. Approximately 5400 employees were laid off during this time. Just weeks before the September lay offs were announced, Global Payments reported their second quarter results. Global Payments reported a net income of $296.4 million, a significant increase of $46.6 million compared to $249.7 million in the same quarter of 2023. In April 2025, Global Payments agreed to acquire Worldpay, a payments technology provider, for $22 billion. Services and operations Global Payments provides payment services directly to merchants and indirectly through other financial organizations. Its technology-enabled services also support integrated payments, e-commerce, and omni-channel services. Through Total System Services (TSYS), its issuer processor business, Global Payments helps banks manage credit and debit card portfolios. Global Payments operates in more than 100 countries and serves 3.5 million merchants as well as 1,300 financial institutions. The company processes more than 50 billion transactions per year. After merging with TSYS in 2019, Global Payments has nearly 24,000 employees. In 2020, 63 percent of the company's revenue was derived from \"Merchant Solutions\" 26 percent from Issuer Solutions, and 11 percent from the Business and Consumer Solutions segment, which operates as NetSpend. Eighty percent of Global Payments Merchant Solutions revenue was from North America, 15 percent was from Europe, and five percent was from Asia. Additionally in 2020, the company was recognized as the first payment processor to win the J.D. Power Award for excellence in customer service; an effort spearheaded by Senior Vice President Jim Hightower and now-Senior Executive Vice President Bob Cortopassi. As of 2023, Global Payments does not have a singular Chief Operating Officer (COO). Instead the company divides operations into two distinct branches: domestic \"US Merchant Solutions\" headed by Senior Executive Vice President Vince Lombardo and international and vertical markets headed by Senior Executive Vice President Bob Cortopassi. Current CEO Cameron M. Bready was formerly the COO of the company, but no COO was announced as part of the succession plan. Data breaches and faults In 2012, a data breach at Global Payments affected 1.5 million credit and debit card numbers. This breach eventually cost the company around $100 million. In 2015, a technical fault with Global Payments' systems led to thousands of British businesses being unable to accept credit card payments on Valentine's Day weekend. Lawsuits Story v. Heartland Payments Systems In 2019, Global Payments subsidiary Heartland Payments Systems was sued by Florida resident Max Story, alleging that Heartland defrauded parents of school children by leading them to believe that fees collected by the MySchoolBucks online lunch payment service, which Heartland owns and operates and which is used by 2 million people with children in 30,000 schools in the US, were going to their children's schools when in fact the money was going to Heartland. Shortly after the lawsuit was filed, Heartland deposited $40,000 into Story's bank account in an attempt to nullify Story's legal standing to sue, but Story refused to accept the payment and reversed the deposit. To limit the number of people who could potentially join the lawsuit if it is granted class action status, Heartland also updated its terms of service in 2019 to require MySchoolBucks users to accept that they \"will not be permitted to participate in the Story case as a class member.\" Merger with TSYS Total System Services, Inc. (commonly referred to as TSYS), was an American financial technology company headquartered in Columbus, Georgia. In 2019, TSYS was merged into Global Payments Inc. TSYS is the largest third-party payment processor for issuing banks in North America, with a 40% market share, and one of the largest in Europe. It provides payment processing services, merchant services and related payment services. It also provides reloadable prepaid debit cards and payroll cards, and demand deposit accounts to the underbanked. In 1959, TSYS was founded as a division of Columbus Bank and Trust (now Synovus). In 1974, it began processing credit cards for other banks. In August 1983, the company became a public company via an initial public offering. In 1995, the company merged its merchant processing services with those of Visa Inc. In August 2004, the company acquired Clarity Payment Solutions for $53 million. In 2007, Synovus completed the corporate spin-off of TSYS. In July 2004, the company began processing the credit cards issued by J.P. Morgan Chase. In 2008, the company launched n>genuity, a quarterly publication on the world of payments. In 2010, the company acquired a 51% stake in the merchant acquisition business of First National Bank of Omaha for $150.5 million, which was renamed TSYS Merchant Solutions. The remaining 49% stake was acquired in January 2011. In May 2011, the company acquired TermNet. In August 2012, the company announced a joint venture with Central Payment Co. LLC, a direct merchant acquirer. In December 2012, the company acquired ProPay, a Utah-based company with over 250,000 merchants. In July 2013, the company acquired Netspend, a prepaid debit card provider, for $1.4 billion. In November 2013, the company announced TSYS Merchant Insights, a partnership with Womply, a San Francisco-based startup, to provide revenue, social media, and reputation analysis tools to all TSYS merchants. In June 2014, CEO Philip W. Tomlinson retired and was replaced with M. Troy Woods, then the president and COO. In April 2016, the company acquired TransFirst for $2.35 billion, making it the 6th largest acquirer in the United States. In June 2016, the company acquired the remaining 45% stake in TSYS Managed Services EMEA from The Merchants Group Limited. In February 2017, the company's lobbying of the Republican Party was credited for a bill that would remove the Consumer Financial Protection Bureau's limits on overdraft fees. 10-12% of NetSpend's revenue comes from these fees. In late 2017, the company acquired a former Citigroup card production facility in Columbus, Ohio and invested $25 million to build out a second, 200,000 square feet (19,000 m2) credit card production facility, with a capacity to produce 67 million credit cards per year. In January 2018, the company acquired Cayan for $1.05 billion. In June 2018, the company acquired Jacksonville, Florida-based iMobile3 for $13.4 million. On September 18, 2019, TSYS and Global Payments completed their merger agreement for $21.5 billion."
}