{
  "ticker": "GWW",
  "cik": "0000277135",
  "company_name": "W. W. Grainger",
  "corrected_name": "W. W. Grainger",
  "wiki_title_used": "W. W. Grainger",
  "exists": true,
  "raw_text": "W. W. Grainger, Inc. is an American Fortune 500 industrial supply company founded in 1927 in Chicago by William W. (Bill) Grainger. He founded the company to provide consumers with access to a consistent supply of motors.  The company now serves more than 4.5 million customers worldwide with offerings such as motors, lighting, material handling, fasteners, plumbing, tools, and safety supplies, along with inventory management services and technical support.  Revenue is generally from business-to-business sales rather than retail sales. Grainger serves its customers through a network of approximately 331 branches, online channels (such as Grainger.com, KeepStock and eProcurement), and 34 distribution facilities. Their motto is \"for the ones who get it done\".\n\nHistory\nThe company was founded as a supplier for businesses by William Wallace Grainger in 1927 in Chicago, Illinois, and incorporated as W. W. Grainger, Inc., in 1928. Sales in the early days were generated primarily through mail order via post cards and a catalog. The MotorBook, as the catalog was originally called, was the basis for today's Grainger catalog. Grainger headquarters are now located in Lake Forest, Illinois. By 1936, Grainger had established 15 branches to improve customer service. The company was passed down to David William Grainger, the son of W.W. Grainger. David Grainger attended Phillips Exeter Academy.\nIn 1967, Grainger became a publicly traded company. Grainger is a profitable corporation and has increased dividends to its shareholders for forty five consecutive years. The company has grown consistently since becoming public and reported US$11.5 billion in annual sales, as of the end of 2019.\n\nDigital operations\nIn 1995 the grainger.com website was launched with an electronic catalog, later evolving to an eCommerce platform. In 2016, Grainger was named the 11th largest eCommerce retailer in North America by Internet Retailer. In 2019, more than 70 percent of Grainger orders in the U.S. originated via a digital channel (including Grainger.com, inventory management systems, and eProcurement) and more than 85 percent of orders were shipped directly to the customer or made immediately available through onsite services.\n\nCOVID-19 pandemic\nGrainger was designated as an essential business during the early days of the coronavirus pandemic.  Though there were virus outbreaks in certain facilities, stricter measures including temperature checks have since been instated. As orders for personal protective equipment (PPE) increased, Grainger and other re-sellers were hit with supply drops and price hikes.\nIn March 2020, Grainger was sent a letter from the Wisconsin Department of Agriculture, Trade and Consumer Protection accusing them of price gouging. Grainger had increased its prices for surgical masks from $0.17 to $1.00 per mask. A spokesman for the company stated that the price increases were a result of increased costs from suppliers and overall shortages of PPE.\nFastenal Company and Grainger, two industrial suppliers, also saw surges in PPE sales. The AP's data includes $99 million in personal protective equipment sales to 32 states by Fastenal, and $50 million in protective equipment sales to 40 states by Grainger, which said its profits on those sales were affected by increased freight costs and previous contracts with reduced prices.\n\nSubsidiaries\nGrainger's subsidiary Zoro Tools, Inc. and website zoro.com was launched in 2011 to serve the American small business market through a web-only transaction-based model, while grainger.com serves primarily large and mid-sized customers. Both online stores also sell products to individuals. \nMonotaro was established in 2000 as a joint venture between Grainger and Sumitomo. It has online-only operations serving Japan and other Asian markets.\nGrainger's fastest-growing and most profitable subsidiary, Imperial Supplies, was acquired by the company in 2009.\nGrainger divested Grainger China and Netherlands-based Fabory in 2020.\n\nAcquisitions\nSeptember 1, 2015: Cromwell Group Holdings (UK) Ltd The initial aggregate purchase price for the acquisition under the definitive share purchase agreement was £310 million ($476 million), subject to customary adjustment.\nDecember 3, 2013: Safety Solutions Incorporated. The purchase price is $30 million, less cash acquired.\nAugust 23, 2013: E&R Industrial Sales Inc. The purchase price is $116 million, less cash acquired.\nDecember 31, 2012: Techni-tool, Inc. of Worcester, Pennsylvania. The purchase price is $40 million, less cash acquired.\nApril 2, 2012: Anfreixo\nAugust 31, 2011: Fabory Group The purchase price is $346 million, less cash acquired.\nOctober 14, 2010: SafetyCertified\nNovember 18, 2009: Alliance Energy Solutions\nOctober 13, 2009: Imperial Supplies\n\nAwards and honors\nGrainger was named by Fortune magazine as one of the top 100 companies to work for in 2013, citing the company's generous profit-sharing plan, where employees with five years of service had 20% of their pay added to their retirement plan. However, the profit sharing plan was discontinued in 2021.\n\nSee also\nGrainger College of Engineering\nGrainger Engineering Library\n\nReferences\nExternal links\nOfficial website\nBusiness data for W.W. Grainger, Inc.:",
  "clean_text": "W. W. Grainger, Inc. is an American Fortune 500 industrial supply company founded in 1927 in Chicago by William W. (Bill) Grainger. He founded the company to provide consumers with access to a consistent supply of motors. The company now serves more than 4.5 million customers worldwide with offerings such as motors, lighting, material handling, fasteners, plumbing, tools, and safety supplies, along with inventory management services and technical support. Revenue is generally from business-to-business sales rather than retail sales. Grainger serves its customers through a network of approximately 331 branches, online channels (such as Grainger.com, KeepStock and eProcurement), and 34 distribution facilities. Their motto is \"for the ones who get it done\". History The company was founded as a supplier for businesses by William Wallace Grainger in 1927 in Chicago, Illinois, and incorporated as W. W. Grainger, Inc., in 1928. Sales in the early days were generated primarily through mail order via post cards and a catalog. The MotorBook, as the catalog was originally called, was the basis for today's Grainger catalog. Grainger headquarters are now located in Lake Forest, Illinois. By 1936, Grainger had established 15 branches to improve customer service. The company was passed down to David William Grainger, the son of W.W. Grainger. David Grainger attended Phillips Exeter Academy. In 1967, Grainger became a publicly traded company. Grainger is a profitable corporation and has increased dividends to its shareholders for forty five consecutive years. The company has grown consistently since becoming public and reported US$11.5 billion in annual sales, as of the end of 2019. Digital operations In 1995 the grainger.com website was launched with an electronic catalog, later evolving to an eCommerce platform. In 2016, Grainger was named the 11th largest eCommerce retailer in North America by Internet Retailer. In 2019, more than 70 percent of Grainger orders in the U.S. originated via a digital channel (including Grainger.com, inventory management systems, and eProcurement) and more than 85 percent of orders were shipped directly to the customer or made immediately available through onsite services. COVID-19 pandemic Grainger was designated as an essential business during the early days of the coronavirus pandemic. Though there were virus outbreaks in certain facilities, stricter measures including temperature checks have since been instated. As orders for personal protective equipment (PPE) increased, Grainger and other re-sellers were hit with supply drops and price hikes. In March 2020, Grainger was sent a letter from the Wisconsin Department of Agriculture, Trade and Consumer Protection accusing them of price gouging. Grainger had increased its prices for surgical masks from $0.17 to $1.00 per mask. A spokesman for the company stated that the price increases were a result of increased costs from suppliers and overall shortages of PPE. Fastenal Company and Grainger, two industrial suppliers, also saw surges in PPE sales. The AP's data includes $99 million in personal protective equipment sales to 32 states by Fastenal, and $50 million in protective equipment sales to 40 states by Grainger, which said its profits on those sales were affected by increased freight costs and previous contracts with reduced prices. Subsidiaries Grainger's subsidiary Zoro Tools, Inc. and website zoro.com was launched in 2011 to serve the American small business market through a web-only transaction-based model, while grainger.com serves primarily large and mid-sized customers. Both online stores also sell products to individuals. Monotaro was established in 2000 as a joint venture between Grainger and Sumitomo. It has online-only operations serving Japan and other Asian markets. Grainger's fastest-growing and most profitable subsidiary, Imperial Supplies, was acquired by the company in 2009. Grainger divested Grainger China and Netherlands-based Fabory in 2020. Acquisitions September 1, 2015: Cromwell Group Holdings (UK) Ltd The initial aggregate purchase price for the acquisition under the definitive share purchase agreement was £310 million ($476 million), subject to customary adjustment. December 3, 2013: Safety Solutions Incorporated. The purchase price is $30 million, less cash acquired. August 23, 2013: E&R Industrial Sales Inc. The purchase price is $116 million, less cash acquired. December 31, 2012: Techni-tool, Inc. of Worcester, Pennsylvania. The purchase price is $40 million, less cash acquired. April 2, 2012: Anfreixo August 31, 2011: Fabory Group The purchase price is $346 million, less cash acquired. October 14, 2010: SafetyCertified November 18, 2009: Alliance Energy Solutions October 13, 2009: Imperial Supplies Awards and honors Grainger was named by Fortune magazine as one of the top 100 companies to work for in 2013, citing the company's generous profit-sharing plan, where employees with five years of service had 20% of their pay added to their retirement plan. However, the profit sharing plan was discontinued in 2021."
}