{
  "ticker": "HAS",
  "cik": "0000046080",
  "company_name": "Hasbro",
  "corrected_name": "Hasbro",
  "wiki_title_used": "Hasbro",
  "exists": true,
  "raw_text": "Hasbro, Inc. (; a syllabic abbreviation of its original name, Hassenfeld Brothers) is an American multinational toy manufacturing and entertainment holding company founded on December 6, 1923 by Henry, Hillel and Herman Hassenfeld and is incorporated and headquartered in Pawtucket, Rhode Island. Hasbro owns the trademarks and products of Kenner, Milton Bradley, Parker Brothers, and Wizards of the Coast, among others. As of August 2020, over 81.5% of its shares were held by large financial institutions.\nAmong Hasbro's products are Transformers, G.I. Joe, Power Rangers, Rom the Space Knight, Micronauts, M.A.S.K., Monopoly, Furby, Nerf, Potato Head, Bop It!, Play-Doh, Twister, and My Little Pony, and with the Entertainment One (now Lionsgate Canada) acquisition on December 30, 2019, franchises like Peppa Pig and PJ Masks. Hasbro also spawned TV shows to promote its products, such as Family Game Night on Discovery Family, which has been co-owned by Hasbro since 2010. The company sold Entertainment One to Lionsgate (now Starz Entertainment) on December 27, 2023, however, it kept eOne's family brands and eOne's stake in Astley Baker Davies, placing them into a new division known as Hasbro Entertainment, formed on August 16, 2023. The company celebrated their 100th anniversary on December 6, 2023. Hasbro primarily competes with Mattel.\n\nHistory\nHassenfeld Brothers\nThree Polish-Jewish brothers, Herman, Hillel, and Henry Hassenfeld, founded Hassenfeld Brothers in Providence, Rhode Island, in late 1923, a company selling textile remnants. Over the next two decades, the company expanded to produce pencil cases and school supplies. On January 8, 1926, Hassenfeld Brothers was incorporated in Rhode Island; Hillel left for another textile business while Henry took charge of the corporation. They began making their own pencils after their pencil supplier began making pencil cases as well.\nHassenfeld Brothers produced modeling clay and then doctor and nurse kits as their first toys, and they became primarily a toy company by 1942. Hillel died in 1943 and Henry Hassenfeld became CEO, while his son Anthony Merrill became president. The company entered the plastic fields during World War II to support its toy line. The Hassenfeld brothers, immigrants from Ulanów, Poland, also spent the war years helping to rescue and employ fellow Jews from Ulanów; Jacob Klapper, a Holocaust survivor born in Ulanów, recalled being told when he arrived in the United States that Hassenfeld Brothers would employ any survivor from Ulanów, no questions asked. Hassenfeld Brothers' first popular toy was Mr. Potato Head, which the company purchased from George Lerner in 1952. In 1954, the company became a Disney major licensee.\n\nIn 1960, Henry died and Merrill took over the parent company, and his older brother Harold ran the pencil-making business of Empire Pencil. Hassenfeld Brothers expanded to Canada with Hassenfeld Brothers (Canada) Ltd. in 1961.\nIn 1962, Hasbro purchased the former Potter & Johnston manufacturing company building on Newport Avenue in Pawtucket, Rhode Island. The Pawtucket plant facilities were eventually expanded to over 300,000 square feet.\nIn 1963 the company introduced Flubber, but reports of sore throats and rashes from the product and knock-offs prompted an investigation by the Food and Drug Administration and a voluntary recall by Hassenfeld Brothers. The company was approached in 1963 to license a toy based on The Lieutenant, which they turned down because they did not want to be tied to a possibly short-lived television series. Instead, Hassenfeld Brothers produced the G.I. Joe toy in 1964 which they termed an \"action figure\" in order to market it to boys who wouldn't want to play with dolls. In 1964 and 1965, G.I. Joe accounted for two-thirds of Hassenfeld's sales.\n\nHasbro Industries\nThe company had previously sold toys under the Hasbro trade name, and it shortened its name to Hasbro Industries on July 12, 1968, and sold a minor stake in the corporation to the public. The Vietnam War was at its height in 1969, so Hasbro redesigned GI Joe to be less militaristic and more adventure-oriented. Its promotional efforts included the catchphrase \"Boy Oh Boy! It's A Hasbro Toy!\" in television commercials and print ads. Also in 1969, Hasbro bought Burt Claster Enterprises which produced \"Romper Room\" and had just begun a Romper Room toy line. A month-long Teamsters strike and Far Eastern supplier troubles caused the company to post a $1 million loss for the year.\nIn 1970, Hasbro began a plan of diversification and opened the Romper Room Nursery School franchise chain to cash in on President Richard Nixon's Family Assistance Plan which subsidized day care for working mothers. By 1975, the company had ended the nursery chain. Hasbro also entered the cookware field with the Galloping Gourmet line based on a television cooking show.\nTwo new 1970s toys were public relations disasters. One of the toys was named Javelin Darts which were similar to the ancient Roman plumbata. On December 19, 1988, the Consumer Product Safety Commission banned lawn darts from sale in the United States due to their hazards as a flying projectile with a sharp metal point causing multiple deaths. The other toy was named The Hypo-Squirt, a hypodermic needle-shaped water gun tagged by the press as a \"junior junkie\" kit. Both were recalled. Romper Room and its toy line had continued success, although Action for Children's Television citizens group considered the program to be an advertising channel for toys.\nMerrill Hassenfeld took over as CEO in 1974, and his son Stephen D. Hassenfeld became president. The company became profitable once again but had mixed results due to cash flow problems from increasing the number of toys in the line to offset G.I. Joe's declining sales. Hasbro ended the G.I. Joe line in 1975 because of the rising prices of plastic and crude oil. In 1977, Hasbro's losses were $2.5 million, and the company held a large debt load. That same year, Hasbro acquired licensing rights to Peanuts cartoon characters. With the financial situation poor, Hasbro's bankers made the company temporarily stop dividend payments in early 1979. The toy division's losses increased Harold Hassenfeld's resentment regarding the company's treatment of the Empire Pencil subsidiary as Empire received lower levels of capital spending relative to profits than did the toy division.\nWith Merrill's death in 1979, Harold did not recognize Stephen's authority as the successor to the chairman and CEO position. As a solution, Hasbro spun off Empire Pencil in 1980, which was the nation's largest pencil maker, with Harold trading his Hasbro shares for those of Empire. Stephen then became both the CEO and chairman of the board. Between 1978 and 1981, Stephen reduced the Hasbro product line by one-third and its new products by one-half. Hasbro focused on simple, low-cost, longer life-cycle toys like Mr. Potato Head. Hasbro thus stayed out of the electronic games field which went bust in the early 1980s.\nIn 1982, Hasbro revived its G.I. Joe line with the help of Marvel Comics, as an anti-terrorist special forces team based on current events. Following an interest in Takara's Diaclone and Micro Change toylines in the 1983 International Tokyo Toy Show, the company licensed the toylines and subsequently launched the successful Transformers toy line along with a children's animated TV series two years later. With the toys and TV series being popular, Stephen Hassenfeld posed with the toys for a People magazine cover photo.\nIn 1982, Hasbro produced the successful toy franchise My Little Pony. In 1983, they purchased GLENCO Infant Items, a manufacturer of infant products and the world's largest bib producer, and Knickerbocker Toy Company, a struggling Warner Communications subsidiary. Hasbro paid 37% of its stock to Warner, which was paid into Hasbro's executive-controlled voting trust, and also received a cash infusion. In 1984, Alan G. Hassenfeld took over as president from his brother Stephen, who continued as CEO and chairman. That same year, the company was the nation's sixth best-selling toymaker, and then acquired the Milton Bradley Company, which was the nation's fifth best-selling toymaker. This brought The Game of Life, Twister, Easy Money, and Playskool into the Hasbro fold and on September 10 transformed Hasbro into Hasbro Bradley. Stephen Hassenfeld became the merged company's president and CEO, with Milton Bradley chief James Shea Jr. taking the chairman position. However, the executives clashed and Shea left after a few months, and Stephen and Alan returned to their previous positions.\n\nHasbro\n1985–2007\nOn June 6, 1985, the company changed its name again to just Hasbro, Inc. The Jumpstarters toys were the subject of a lawsuit in 1985 when Hasbro sued a toy manufacturer for selling toys based on their Transformers design. Hasbro won the suit.\nIn the mid-1980s, Hasbro moved past Mattel to become the world's largest toy company. Hasbro then moved to outsell Mattel's Barbie in the fashion doll market with the 1986 introduction of Jem, a record producer/rock musician dual identity fashion doll. Jem initially posted strong sales but plummeted and was withdrawn from the market in 1987. Hasbro followed up in 1988 with Maxie, a Barbie-sized blonde doll, so that Barbie clothing and accessories would fit. Maxie lasted until 1990.\nUnder Alan's initiative in the late 1980s, Hasbro moved to increase international sales by taking toys overseas that had failed in the US market and selling them for as much as four times the original price. This increased international sales from $268 million in 1985 to $433 million in 1988.\nIn 1988, Hasbro purchased part of Coleco Industries' indoor and outdoor children's furniture and ride-on toy product lines for $21 million including two just closed manufacturing plants in Amsterdam, New York. In July 1989, Hasbro acquired bankrupt Coleco for $85 million. Stephen Hassenfeld died later that year with the company having gone from sales of $104 million in the year he took control to 1989 sales of over $1.4 billion.\nAlan succeeded Stephen as chairman and CEO. In 1991, Hasbro purchased Tonka Corp. for $486 million, along with its units Parker Brothers, the maker of Monopoly, and Kenner Products. Milton Bradley and Parker Brothers were merged into one division. Alan moved to expand Hasbro overseas with new units in Greece, Hungary, and Mexico.\nAlan saw the Far East as an important market to expand. In 1992, Hasbro purchased Nomura Toys Ltd. in Japan, and majority ownership of Palmyra, a Southeast Asian toy distributor. These increased the proportion of international sales from 22% in 1985 to 45% ($1.28 billion) in 1995. In 1993, Hasbro lost its bid for J. W. Spear & Sons, a U.K.-based game maker, to Mattel.\nIn the US, Hasbro's growth since 1980 was from acquisitions and the leveraging of the new assets. New product development was not as successful except for film and TV tie-in product lines with Jurassic Park and Barney. Thus, US sales were stagnant in the early 1990s, falling from 1993 to 1995. To turn domestic performance around in 1994, Hasbro merged the Hasbro Toy, Playskool, Playskool Baby, Kenner, and Kid Dimension units into the Hasbro Toy Group.  Meanwhile, Mattel purchased Fisher-Price and retook the top spot in the toy industry.\nHasbro Interactive was started in 1995 and released the Monopoly game on CD-ROM. Mattel also proposed a merger that year, but was turned down by the Hasbro board in 1996 due to antitrust issues and Justice Department investigation into exclusionary policies between toy manufacturers and toy retailers, particularly Toys \"R\" Us.\n\nIn 1998, Hasbro bought Avalon Hill for $6 million and Galoob for $220 million. That same year, Milton Bradley merged with Parker Bros. to form Hasbro Games. In 1999, Hasbro paid $325 million for rights to Pokémon toys. The same year, Wizards of the Coast was bought in a deal worth $325 million. Wizards of the Coast is now a subsidiary of Hasbro and has Avalon Hill as its division. In 2001 money-losing Hasbro Interactive was sold to Infogrames, a French software concern, for $100 million. Hasbro entered the building block toy with its Built to Rule line in 2003, which did not hold together well or were too hard for the targeted age group, thus ended in 2005.\nIn 2004, the company entered into a deal with Paramount Home Entertainment to release its programs based on its games and toys on VHS and DVD.\n\n2008–2018\nIn 2008, Hasbro acquired game maker Cranium, Inc. for $77.5 million. The deal was announced on January 4 and closed on January 25.\nHasbro and Universal Pictures signed an agreement in February 2008 to derive four films from seven Hasbro properties for production. In May, Bennett Schneir was hired to lead its Hasbro Films division, while Hasbro also reacquired series based on their properties from Sunbow Productions.\nThe year of his promotion to CEO of Hasbro, Brian Goldner was named CEO of the year by News Corporation affiliate website MarketWatch.com. Goldner became the first person not from the founding Hassenfeld family to hold the position.\nIn 2009, the Milton Bradley and Parker Bros. brands were retired after 25 years and eighteen years of Hasbro ownership respectively. That same year, Hasbro Studios was formed for TV development, production and distribution. On December 11, 2012, Hasbro transferred all entertainment divisions to Hasbro Studios, including their LA-based film group, and Cake Mix Studio, the company's Rhode Island–based producer of commercials and short form content.\nHasbro collaborated with Discovery on The Hub, a cable television network targeting younger children and families, which launched on October 10, 2010. The venture found unexpected success with the revival of the My Little Pony franchise, My Little Pony: Friendship Is Magic, which became the network's highest-rated program and attracted a significant cult following among teens and adults. The Hub was renamed to Hub Network in 2013, and was rebranded again as Discovery Family on October 13, 2014. In 2013, Hasbro renewed its deal to produce Marvel Comics and Star Wars toys through at least 2020.\nIn 2011, Greenpeace accused Hasbro of purchasing paper for its packaging from ancient forests in Indonesia. Hasbro changed its paper purchasing policy, earning the company praise from Greenpeace executive director Phil Radford, who said: \"The new Hasbro policy will also increase the recycled and Forest Stewardship Council (FSC) certified paper in its toy packaging. Hasbro's new commitments are great news for Indonesian rainforests and the people and wildlife that depend on them.\"\nBy April 2011, Hasbro started 360 Manufacturing Services, a contract OEM game manufacturing operating out of Hasbro's USA plant. Having been absent from the building block market since the failure of the Built to Rule line, Hasbro re-entered the market with the Kre-O line in late 2011, starting with some Transformers-based sets.\nIn 2012, Hasbro received a $1.6 million tax credit from the state of Rhode Island with a promise to create 245 new jobs in the state. Instead, they laid off more than 125 workers. This was followed in 2013 with further layoffs of North American workers, amounting to 10% of its salaried employees. Meanwhile, CEO Brian Goldner signed a new five-year contract. As of fiscal year 2012, Goldner had a total calculated compensation of $9,684,285. On July 9, 2013, Backflip Studios sold a 70% stake in the company to Hasbro for $112 million in cash.\nOn November 6, 2012, it was rumored that the Walt Disney Company was discussing a multi-billion dollar deal to acquire Hasbro. While Hasbro declined to discuss the rumor, advisors stated there was \"absolutely nothing going on\" they knew of between the two companies. Additionally, financial analysts said the deal was illogical, as the rumor came out just a week after Disney had bought out Lucasfilm.\nHasbro was named by Fortune magazine as one of the top 100 companies to work for in 2013, citing that the \"company enhanced its vacation policy by giving new employees three weeks off in their first year instead of having to wait five years.\"\nOn November 12, 2014, it was reported that Hasbro was in talks to buy DreamWorks Animation. The proposal reportedly calls for the combined company to take the name \"DreamWorks-Hasbro\" and for Jeffrey Katzenberg to become its chairman, but as a matter of policy, neither Hasbro nor DreamWorks publicly comment on mergers and acquisitions. Two days later, the talks were reported to have fallen through. The company has been owned by Comcast subsidiary NBCUniversal since 2016.\nOn July 14, 2015, the company announced the intent to sell its last two factories, in Ireland and East Longmeadow, Massachusetts (including its 360 Manufacturing Services), to Cartamundi. The deal was set to close in sixty days. Hasbro signed a five-year deal with Cartamundi to produce their board games at the East Longmeadow plant.\nWith Mattel adding two competing lines, and the expiration of their Disney Princess license at the end of 2015, Disney gave Hasbro a chance to gain the license given their work on Star Wars, which led to a Descendants license. DCP was also attempting to evolve the brand from one of them less as damsels and more as heroines. In September 2014, Disney announced that Hasbro would be the doll licensee for the Disney Princess line starting on January 1, 2016.\nOn July 13, 2016, Hasbro acquired Dublin-based Boulder Media Limited and placed it under the control of its chief content officer. Hasbro announced that it would launch its own convention, named HasCon, and featuring \"all things Hasbro\" in 2016, with the inaugural event being held at the Rhode Island Convention Center in September 2017.\nOn November 15, 2017, Mattel rejected an offer from the company. At the time, Mattel's worth was $5 billion, while Hasbro's worth was about $11 billion. On February 27, 2018, Variety reported in a detailed article that Hasbro came close to buying Lionsgate (now Starz Entertainment), exploring options to expand its entertainment division and bolster its content production capabilities due to interest in film and television ventures, but the deal fell through.\n\n2018–2021\nOn February 16, 2018, Saban Brands appointed Hasbro as the global master toy licensee for Power Rangers with a future collaboration and option to purchase the franchise. On May 1, 2018, Hasbro agreed to purchase Power Rangers and other entertainment assets from Saban Brands for $522 million in cash and stock with the licensing fee recently paid with credit. The sale, which also collaborated with  My Pet Monster, Popples, Julius Jr., Treehouse Detectives and additional properties, was expected to close in the second quarter until it was finished with Saban's collab. On October 19, 2018, the company announced plans to cut jobs amounting to less than 10% of its 5,000-plus global workforce in response to changes in how consumers buy toys.\nIn 2018, Hasbro signed a number of licensing agreements for hospitality deals based on Hasbro brands. On May 1, 2018, the Monopoly Mansion hotel agreement was announced by Hasbro, with M101 Holdings overseeing construction and M101's Sirocco Group assigned to manage the hotel when it opened in 2019. Later in May 23, 2018 launched the lost kitties franschise. Lost Kitties were cat figures hidden in milk cartons. Hasbro granted Kingsmen Creatives a license to build a chain of NERF Action Xperience family entertainment centers, with the first to be opened in Singapore in fall/winter 2019. In November, the company issued a license for family entertainment centers to Kilburn Live, who were to launch a new division for the centers. That December, the company granted a license for theme parks to Imagine Resorts and Hotels, co-founded by Bruce Neviaser. Neviaser had previously co-founded Great Lakes Companies, which launched Great Wolf Resorts indoor waterpark resorts. On December 18, 2019, Hasbro and West Edmonton Mall announced that Galaxyland would get a makeover, with rides being redone and renamed to Hasbro properties. Construction was begun later that month and scheduled to wrap up in late 2020.\nOn August 22, 2019, Hasbro announced its purchase of Entertainment One for about US$4 billion. The deal was completed on December 30, 2019. On October 24, 2019, Hasbro announced the closing of Backflip Studios, while its Wizards of the Coast subsidiary purchased Tuque Games in October. On February 28, 2020, Hasbro announced that Campbell Arnott's former CMO David McNeil had joined the company as the managing director for Pacific operations. On September 30, 2020, Renegade Game Studios announced they had acquired licensing for creating tabletop games for multiple Hasbro brands. Several of the games would be using the 5E role-playing system owned by Wizards of the Coast.\nOn February 25, 2021, during the 2021 Investor Event, Hasbro announced a company reorganization with three divisions: Consumer Products, Entertainment, and Wizards & Digital. The Wall Street Journal reported that \"Hasbro's net revenue fell 8% last year to $5.47 billion, due in part to retail shutdowns related to Covid-19,\" however, its Wizards of the Coast subsidiary \"posted revenue of $816 million last year, up 24% from 2019, fueled by what Hasbro says were record years for\" Dungeons & Dragons and Magic: The Gathering. ICv2 reported, \"the WotC and Digital Gaming segment is over $112 million more than the operating profit for Hasbro's entire consumer products segment\" and that \"Wizards of the Coast on its own is also more profitable than Hasbro's consumer products segment [...]. From the outside, Hasbro looks like a toy company, but with these numbers, it's revealed to be a geek game company with toy and entertainment divisions\".\nIn April 2021, Hasbro agreed to sell eOne Music unit to Blackstone for $385 million, offloading part of the Entertainment One operations that it acquired in 2019.\n\n2021–present: Restructuring and turnaround\nHasbro's longtime CEO Brian Goldner died on October 12, 2021, after a 7-year battle with cancer. Richard Stoddart served as the interim CEO of the company following Goldner's death; Chris Cocks was named as Goldner's successor on January 5, 2022, and became CEO on February 25, 2022. Cocks was formerly the president and chief operating officer of Wizards of the Coast, a division of Hasbro.\nIn June 2022, Hasbro defeated a board challenge from activist investor Alta Fox Capital Management LLC. The hedge fund company, which owns a 2.5% stake of Hasbro, had been pushing to spin out Wizards of the Coast \"into its own company in an attempt to create what they saw was more value by making a second publicly traded company with a more profitable line of business\".\nOn November 17, 2022, Hasbro announced they had put Entertainment One up for sale. This includes their film and TV business but would exclude the company's kids and family division, which would remain under Hasbro. On March 15, 2023, it was reported that Fremantle, Lionsgate and Legendary Entertainment are interested in the buyout. However, Fremantle dropped out of the bid while CVC Capital Partners and GoDigital Media Group joined in the bid for the eOne buyout. On April 20, 2023, it was reported that Hasbro was in talks with Throop on the possibility of buying the company back. On July 17, 2023, Deadline reported that Lionsgate was a frontrunner to acquire eOne.  In June 2023, Hasbro announced the return of Furby, an interactive plush toy that was highly popular in the late 1990s and early 2000s.\nOn August 3, 2023, Hasbro announced that Lionsgate would acquire Entertainment One for $500 million, with the transaction closed on December 27, 2023. eOne was rebranded as Lionsgate Canada in 2024, the same year that it became a subsidiary of Lionsgate Studios. Hasbro kept eOne’s family brands and its stake in Astley Baker Davies, and created a division called Hasbro Entertainment later that month, which held Astley Baker Davies and Discovery Family.\nOn December 12, 2023, TechCrunch reported that paperwork Hasbro filed with the SEC contained information announcing layoffs of 1,100 employees (20% of their entire workforce across all divisions) effective immediately. President and COO Eric Nyman left the company. Hasbro's CEO, Chris Cocks, stated that this reduction is part of a broader cost-saving strategy, aimed at saving $350 million to $400 million by 2025, with a renewed focus on high-profit areas like licensing and entertainment, particularly in the Wizards of the Coast division. Hasbro also announced to have signed a deal with McFarlane Toys as part the latter's Page Punchers line-up.\nOn February 13, 2024, following the completion of its sale of Entertainment One assets, Hasbro reported losses of $1 billion for the fourth quarter of 2023 and $1.49 billion for the full year, resulting in its entire total net income from December 31, 2019 to December 31, 2023 to plummet to $0. The company now plans to cut its costs by $750 million by December 31, 2024.\nOn July 18, 2024, Hasbro announced the appointment of two new leadership positions: Holly Barbacovi, former COO of Bungie, as Chief People Officer, and John Hight, previously the Senior Vice President and General Manager of the Warcraft Franchise at Blizzard Entertainment, as President of Wizards of the Coast and Digital Gaming.\nOn November 20, 2024, Cocks announced to Bloomberg that Hasbro would stop co-financing future movies based on the company's list of brands in order to focus on mobile games and digital entertainment, leaving film studios that hold the film rights to various Hasbro brands to exclusively finance such projects.\nOn September 8, 2025, Hasbro announced that after 63 years, it would move its global east coast headquarters from Pawtucket to the 400 Summer Street tower in Boston, Massachusetts. Headquarters for the company's gaming and digital divisions, including Wizards of the Coast would remain in Renton, Washington. The move is scheduled to be completed by the end of 2026.\n\nSubsidiaries\nConsumer products\nHasbro Games (formerly named as Hasbro Gaming)\nAvalon Hill (brand)\nHasbro Retro Arcade\nHasLab (defunct in 2012, re-established in 2018)\nHasbro Pulse\nPlayskool\nTonka\n\nEntertainment\nHasbro Entertainment\nDiscovery Family (40% with The Cartoon Network, Inc.)\nAstley Baker Davies (70%)\nLeft Foot Blue\nCake Mix Studios\nSCG Characters LLC\nSCG Power Rangers LLC\nSCG Luna Petunia LLC\nTreehouse Detectives LLC\nSaban Brands Voyagers LLC\n\nWizards & Digital\nWizards of the Coast\nArchetype Entertainment\nAtomic Arcade\nD&D Beyond\nInvoke Studios\nMirrorstone Books\n\nDivested\nBoulder Media (sold to Princess Pictures)\nEntertainment One (sold to Lionsgate (now Starz Entertainment) in 2023, renamed as Lionsgate Canada)\nSecret Location\nThe Mark Gordon Company\nAutoMatik\neOne Films (merged into Lionsgate Films)\nAmblin Partners (minority)\nAmblin Entertainment\nAmblin Television\nDreamWorks Pictures\nMakeready\nMomentum Pictures\nLes Films Séville\nSéville International\nSierra/Affinity\neOne Music (sold to The Blackstone Group, renamed as MNRK Music Group)\neOne Television (merged into Lionsgate Television)\nDaisybeck Studios (United Kingdom)\nWhizz Kid Entertainment (United Kingdom)\nBlackfin (United States)\nRenegade83 (United States)\nRound Room Entertainment\nHasbro Interactive (Sold to Infogrames Entertainment SA in January 2001, rebranded Infogrames Interactive, Inc. and Atari Interactive, Inc.)\nAtari Interactive, Inc.\nMicroProse\nAllspark (formerly Hasbro Studios, LLC, folded into Entertainment One)\nAllspark Pictures (formerly Hasbro Films/Hasbro Film Group, folded into Entertainment One)\nBackflip Studios (70%) (known for making the popular mobile games Paper Toss and Graffiti Ball)\nClaster Television\nCranium, Inc.\nEmpire Pencil\neOne Family & Brands (replaced by Hasbro Entertainment)\nGaloob\nKenner Products\nLarami (name is now retired and part of the Nerf brand)\nMilton Bradley Company\nParker Brothers\nSelchow and Righter\nSaban Brands\nSecret Location\nTiger Electronics\nWrebbit\n\nToys and games\nHasbro has several brands of toys and games aimed at different demographics. Some of its better-known toy lines (past and present) are:\n\nLost Kitties (Discontinued in 2022)\nHasbro is the largest producer of board games in the world as a result of its component brands, such as Parker Brothers, Waddingtons, Milton Bradley, Wizards of the Coast, and Avalon Hill (all acquisitions since the 1980s). As a result, it has well known and top selling games such as:\n\nHasbro also produces many variations of most of their games. For example, in addition to original Scrabble, the game is also available as \"Scrabble Deluxe Edition\", \"Scrabble Deluxe Travel Edition\", \"Scrabble Junior\", and \"Scrabble Onyx Edition\".\nHasbro also offers Game of skill such as:\n\nBop It\nJenga\nThey also formerly sold:\n\nBrain Warp and its sister products which include Brain Shift, Brain Bash, Death Star Escape, Hyperslide and Torx.\nBull's-Eye Ball\nHasbro also offers a memory game called Simon which involves memorising sequences of colors and lights.\n\nIn 1995, Hasbro began a short-lived video game development and publishing venture called Hasbro Interactive, but disbanded it in 2001 when it was bought by the now defunct Infogrames. Now Hasbro develops video games based on its brands through third-party developers and licensing strategies, notably with major American companies such as Activision, Electronic Arts, and THQ. Following the rise of smartphones and tablet PCs in the 2010s, as well as major video gaming publishers cutting back on releasing games based on licensed IPs for various reasons, such as economic slumps, several of Hasbro's brands were licensed towards mobile game developers such as Gameloft, releasing their games under the label Hasbro Gaming.\nOn February 25, 2005, Hasbro announced that it would be introducing a musical toothbrush to the market. The Tooth Tunes, released in early 2007, transmits music from the jawbone to the ear when the bristles touch the teeth.\nIn November 2023, Hasbro signed a licensing deal with Ageless Innovation to design toys and games for people over 65. Hasbro will produce \"Generations\" versions of known games such as Scrabble, Life, and Trivial Pursuit. The new versions will include larger fonts and game pieces as well as content that is relevant to different generations.\nIn January 2024, Hasbro launched a new line of Star Wars figures to join The Black Series and The Vintage Collection for the 25th anniversary of The Phantom Menace. The line includes a Destroyer Droid that can roll. In the same month, Hasbro announced a pre-order for a new crowdfunding project; the creation of Omega Prime, a Transformer that is a combination of the Robots in Disguise 2001 iterations of Optimus Prime and Ultra Magnus.\nIn February 2024, Hasbro announced a new game, Life in Reterra, a Eurogame-style board game created by Eric M. Lang and Ken Gruhl.\n\nCriticism and controversy\nIn 2007, a workers' rights group investigated several of Hasbro's Chinese suppliers and found that, in one instance, a toy factory in China's Guangxi Province had hired 1000 junior high school students. The same group discovered other widespread labor violations, including unsafe working conditions, mandatory overtime, verbal abuse and sexual harassment of employees. Hasbro issued a statement, saying that it would \"act swiftly and decisively in making any necessary changes\" and had \"increased the intensity of [its] ongoing safety review efforts.\" Critics pointed out that Hasbro had no official regulatory control of these factories. Hasbro responded by hiring independent auditors. These auditors made unannounced visits to the East Asian subcontractors. Reports then emerged that the factory managers have been coached in how to deceive the auditors.\nHasbro has also been criticized for focusing some of its products on specific demographic groups. For example, a letter spread widely on social media in November 2012 written by a six-year-old Irish girl complaining about the lack of female characters in the guessing game Guess Who?. This garnered attention in the press after the girl's mother posted the exchange on her blog. Guess Who? had previously received complaints over gender and ethnic bias in its choice of 24 images.\nHasbro primarily sells toys directed at girl or boy markets. As such, there have been criticisms that Hasbro's toys reinforce gender stereotypes. For example, in December 2012, 13-year-old McKenna Pope started a campaign on Change.org, calling on the company to create a \"boy-friendly\" version of the popular Easy-Bake Oven and to feature boys on their packaging and materials. Within a week, over 30,000 people signed her petition.\nHasbro was criticized for \"sexist\" product design when its 2015 Star Wars Monopoly board game failed to feature Rey, the female protagonist in Star Wars: The Force Awakens, while including all of the supporting male characters. Hasbro explained that Rey was left out of the Monopoly game to avoid spoilers, because the game was released months before the movies. On January 5, 2016, Hasbro announced that Rey would be included in future versions.  Hasbro later stated that it struggled to distribute the updated Monopoly game that includes the Rey piece, because retailers (especially in the United States) showed \"insufficient interest\" after having already purchased stock of the first release.\nOn October 2, 2015, Lorraine Markham sued Hasbro for breach of contract for failure to pay royalties to her. She was seeking a declaration from the U.S. District Court in Providence that her husband Bill Markham was the sole creator of The Game of Life.\nOn August 7, 2020, Hasbro produced a DreamWorks Animation Troll doll device for pre-school children which had an unadvertised activator on the doll's private parts that caused the device to emit several audio recordings that were questioned by some American mothers; in particular one of them posted a Facebook video stream that went viral. In it, she questioned whether the intent was to groom children for depravity. A Hasbro senior officer for global communications said that it was \"not intentional\" and the company removed the device from the marketplace. A writer for USA Today opined that \"We rate the claim that the doll was designed to groom children as PARTLY FALSE.\"\nIn late December 2022, continuing into 2023, Hasbro and subsidiary company Wizards of the Coast received backlash from Dungeons & Dragons fans due to leaked information indicating the companies planned to revoke a longstanding open license and to replace it with one that imposed severe new regulations on content created under the previous license agreement. The legality of this move by Hasbro has been debated.\nIn 2023, subsidiary Wizards of the Coast hired several Pinkerton employees to seize the upcoming March of the Machine: The Aftermath card set for trading card game Magic: The Gathering from a YouTuber who had purchased them from a local game store and published their contents on YouTube ahead of release.\n\nPhilanthropy\nIn 2017, Corporate Responsibility Magazine rated Hasbro number one on its 100 Best Corporate Citizens list, a measure of corporate philanthropy. The company was ranked number five for 2018, and number 13 in 2019.\n\nConventions\nHasCon (2017)\nHasCon was a fan convention created by Hasbro to promote its various licensed properties, including Transformers, G.I. Joe, My Little Pony: Friendship Is Magic, and Magic: The Gathering. It thus replaces the previous fan convention from Fun Publications, BotCon. However, Fun Publications' G. I. Joe Convention continued to be held as of 2017. It was subsequently announced that the first HasCon is scheduled for September 8–10, 2017, at the Rhode Island Convention Center. Meanwhile, Summer Hayes, LLC., which organizes My Little Pony Fair convention, has announced that their convention will not be held for 2017, and would collaborate with HasCon instead.\nThere was supposed to be a HasCon event in 2019 at the Rhode Island Convention Center and Dunkin' Donuts Center in Providence, Rhode Island, but it has been cancelled due the COVID-19 pandemic.\n\nHasbro Pulse Con (Since 2020)\nHasbro Pulse Con is a virtual convention held through the Hasbro Pulse website due the COVID-19 pandemic, following the cancellation of HasCon 2019. Since 2020, four yearly conventions were made at the moment.\n\nOther\nBotCon (1994–2002, 2005–2016)\nOTFCC (Official Transformers Collectors Convention) (2003–2004)\nG.I. Joe Collectors Club (by Fun Publications, 2005–2016)\nTransformers Collectors Club (by Fun Publications, 2005–2018)\n\nOther media\nList of comics based on Hasbro properties\nList of television programs based on Hasbro properties\nList of films based on Hasbro properties\n\nSee also\nList of game manufacturers\nFisher-Price\nBandai\nLEGO\nMattel\nSpin Master\nMGA Entertainment\nTOMY\n\nNotes\nReferences\nExternal links\n\nOfficial website \nBusiness data for Hasbro:",
  "clean_text": "Hasbro, Inc. (; a syllabic abbreviation of its original name, Hassenfeld Brothers) is an American multinational toy manufacturing and entertainment holding company founded on December 6, 1923 by Henry, Hillel and Herman Hassenfeld and is incorporated and headquartered in Pawtucket, Rhode Island. Hasbro owns the trademarks and products of Kenner, Milton Bradley, Parker Brothers, and Wizards of the Coast, among others. As of August 2020, over 81.5% of its shares were held by large financial institutions. Among Hasbro's products are Transformers, G.I. Joe, Power Rangers, Rom the Space Knight, Micronauts, M.A.S.K., Monopoly, Furby, Nerf, Potato Head, Bop It!, Play-Doh, Twister, and My Little Pony, and with the Entertainment One (now Lionsgate Canada) acquisition on December 30, 2019, franchises like Peppa Pig and PJ Masks. Hasbro also spawned TV shows to promote its products, such as Family Game Night on Discovery Family, which has been co-owned by Hasbro since 2010. The company sold Entertainment One to Lionsgate (now Starz Entertainment) on December 27, 2023, however, it kept eOne's family brands and eOne's stake in Astley Baker Davies, placing them into a new division known as Hasbro Entertainment, formed on August 16, 2023. The company celebrated their 100th anniversary on December 6, 2023. Hasbro primarily competes with Mattel. History Hassenfeld Brothers Three Polish-Jewish brothers, Herman, Hillel, and Henry Hassenfeld, founded Hassenfeld Brothers in Providence, Rhode Island, in late 1923, a company selling textile remnants. Over the next two decades, the company expanded to produce pencil cases and school supplies. On January 8, 1926, Hassenfeld Brothers was incorporated in Rhode Island; Hillel left for another textile business while Henry took charge of the corporation. They began making their own pencils after their pencil supplier began making pencil cases as well. Hassenfeld Brothers produced modeling clay and then doctor and nurse kits as their first toys, and they became primarily a toy company by 1942. Hillel died in 1943 and Henry Hassenfeld became CEO, while his son Anthony Merrill became president. The company entered the plastic fields during World War II to support its toy line. The Hassenfeld brothers, immigrants from Ulanów, Poland, also spent the war years helping to rescue and employ fellow Jews from Ulanów; Jacob Klapper, a Holocaust survivor born in Ulanów, recalled being told when he arrived in the United States that Hassenfeld Brothers would employ any survivor from Ulanów, no questions asked. Hassenfeld Brothers' first popular toy was Mr. Potato Head, which the company purchased from George Lerner in 1952. In 1954, the company became a Disney major licensee. In 1960, Henry died and Merrill took over the parent company, and his older brother Harold ran the pencil-making business of Empire Pencil. Hassenfeld Brothers expanded to Canada with Hassenfeld Brothers (Canada) Ltd. in 1961. In 1962, Hasbro purchased the former Potter & Johnston manufacturing company building on Newport Avenue in Pawtucket, Rhode Island. The Pawtucket plant facilities were eventually expanded to over 300,000 square feet. In 1963 the company introduced Flubber, but reports of sore throats and rashes from the product and knock-offs prompted an investigation by the Food and Drug Administration and a voluntary recall by Hassenfeld Brothers. The company was approached in 1963 to license a toy based on The Lieutenant, which they turned down because they did not want to be tied to a possibly short-lived television series. Instead, Hassenfeld Brothers produced the G.I. Joe toy in 1964 which they termed an \"action figure\" in order to market it to boys who wouldn't want to play with dolls. In 1964 and 1965, G.I. Joe accounted for two-thirds of Hassenfeld's sales. Hasbro Industries The company had previously sold toys under the Hasbro trade name, and it shortened its name to Hasbro Industries on July 12, 1968, and sold a minor stake in the corporation to the public. The Vietnam War was at its height in 1969, so Hasbro redesigned GI Joe to be less militaristic and more adventure-oriented. Its promotional efforts included the catchphrase \"Boy Oh Boy! It's A Hasbro Toy!\" in television commercials and print ads. Also in 1969, Hasbro bought Burt Claster Enterprises which produced \"Romper Room\" and had just begun a Romper Room toy line. A month-long Teamsters strike and Far Eastern supplier troubles caused the company to post a $1 million loss for the year. In 1970, Hasbro began a plan of diversification and opened the Romper Room Nursery School franchise chain to cash in on President Richard Nixon's Family Assistance Plan which subsidized day care for working mothers. By 1975, the company had ended the nursery chain. Hasbro also entered the cookware field with the Galloping Gourmet line based on a television cooking show. Two new 1970s toys were public relations disasters. One of the toys was named Javelin Darts which were similar to the ancient Roman plumbata. On December 19, 1988, the Consumer Product Safety Commission banned lawn darts from sale in the United States due to their hazards as a flying projectile with a sharp metal point causing multiple deaths. The other toy was named The Hypo-Squirt, a hypodermic needle-shaped water gun tagged by the press as a \"junior junkie\" kit. Both were recalled. Romper Room and its toy line had continued success, although Action for Children's Television citizens group considered the program to be an advertising channel for toys. Merrill Hassenfeld took over as CEO in 1974, and his son Stephen D. Hassenfeld became president. The company became profitable once again but had mixed results due to cash flow problems from increasing the number of toys in the line to offset G.I. Joe's declining sales. Hasbro ended the G.I. Joe line in 1975 because of the rising prices of plastic and crude oil. In 1977, Hasbro's losses were $2.5 million, and the company held a large debt load. That same year, Hasbro acquired licensing rights to Peanuts cartoon characters. With the financial situation poor, Hasbro's bankers made the company temporarily stop dividend payments in early 1979. The toy division's losses increased Harold Hassenfeld's resentment regarding the company's treatment of the Empire Pencil subsidiary as Empire received lower levels of capital spending relative to profits than did the toy division. With Merrill's death in 1979, Harold did not recognize Stephen's authority as the successor to the chairman and CEO position. As a solution, Hasbro spun off Empire Pencil in 1980, which was the nation's largest pencil maker, with Harold trading his Hasbro shares for those of Empire. Stephen then became both the CEO and chairman of the board. Between 1978 and 1981, Stephen reduced the Hasbro product line by one-third and its new products by one-half. Hasbro focused on simple, low-cost, longer life-cycle toys like Mr. Potato Head. Hasbro thus stayed out of the electronic games field which went bust in the early 1980s. In 1982, Hasbro revived its G.I. Joe line with the help of Marvel Comics, as an anti-terrorist special forces team based on current events. Following an interest in Takara's Diaclone and Micro Change toylines in the 1983 International Tokyo Toy Show, the company licensed the toylines and subsequently launched the successful Transformers toy line along with a children's animated TV series two years later. With the toys and TV series being popular, Stephen Hassenfeld posed with the toys for a People magazine cover photo. In 1982, Hasbro produced the successful toy franchise My Little Pony. In 1983, they purchased GLENCO Infant Items, a manufacturer of infant products and the world's largest bib producer, and Knickerbocker Toy Company, a struggling Warner Communications subsidiary. Hasbro paid 37% of its stock to Warner, which was paid into Hasbro's executive-controlled voting trust, and also received a cash infusion. In 1984, Alan G. Hassenfeld took over as president from his brother Stephen, who continued as CEO and chairman. That same year, the company was the nation's sixth best-selling toymaker, and then acquired the Milton Bradley Company, which was the nation's fifth best-selling toymaker. This brought The Game of Life, Twister, Easy Money, and Playskool into the Hasbro fold and on September 10 transformed Hasbro into Hasbro Bradley. Stephen Hassenfeld became the merged company's president and CEO, with Milton Bradley chief James Shea Jr. taking the chairman position. However, the executives clashed and Shea left after a few months, and Stephen and Alan returned to their previous positions. Hasbro 1985–2007 On June 6, 1985, the company changed its name again to just Hasbro, Inc. The Jumpstarters toys were the subject of a lawsuit in 1985 when Hasbro sued a toy manufacturer for selling toys based on their Transformers design. Hasbro won the suit. In the mid-1980s, Hasbro moved past Mattel to become the world's largest toy company. Hasbro then moved to outsell Mattel's Barbie in the fashion doll market with the 1986 introduction of Jem, a record producer/rock musician dual identity fashion doll. Jem initially posted strong sales but plummeted and was withdrawn from the market in 1987. Hasbro followed up in 1988 with Maxie, a Barbie-sized blonde doll, so that Barbie clothing and accessories would fit. Maxie lasted until 1990. Under Alan's initiative in the late 1980s, Hasbro moved to increase international sales by taking toys overseas that had failed in the US market and selling them for as much as four times the original price. This increased international sales from $268 million in 1985 to $433 million in 1988. In 1988, Hasbro purchased part of Coleco Industries' indoor and outdoor children's furniture and ride-on toy product lines for $21 million including two just closed manufacturing plants in Amsterdam, New York. In July 1989, Hasbro acquired bankrupt Coleco for $85 million. Stephen Hassenfeld died later that year with the company having gone from sales of $104 million in the year he took control to 1989 sales of over $1.4 billion. Alan succeeded Stephen as chairman and CEO. In 1991, Hasbro purchased Tonka Corp. for $486 million, along with its units Parker Brothers, the maker of Monopoly, and Kenner Products. Milton Bradley and Parker Brothers were merged into one division. Alan moved to expand Hasbro overseas with new units in Greece, Hungary, and Mexico. Alan saw the Far East as an important market to expand. In 1992, Hasbro purchased Nomura Toys Ltd. in Japan, and majority ownership of Palmyra, a Southeast Asian toy distributor. These increased the proportion of international sales from 22% in 1985 to 45% ($1.28 billion) in 1995. In 1993, Hasbro lost its bid for J. W. Spear & Sons, a U.K.-based game maker, to Mattel. In the US, Hasbro's growth since 1980 was from acquisitions and the leveraging of the new assets. New product development was not as successful except for film and TV tie-in product lines with Jurassic Park and Barney. Thus, US sales were stagnant in the early 1990s, falling from 1993 to 1995. To turn domestic performance around in 1994, Hasbro merged the Hasbro Toy, Playskool, Playskool Baby, Kenner, and Kid Dimension units into the Hasbro Toy Group. Meanwhile, Mattel purchased Fisher-Price and retook the top spot in the toy industry. Hasbro Interactive was started in 1995 and released the Monopoly game on CD-ROM. Mattel also proposed a merger that year, but was turned down by the Hasbro board in 1996 due to antitrust issues and Justice Department investigation into exclusionary policies between toy manufacturers and toy retailers, particularly Toys \"R\" Us. In 1998, Hasbro bought Avalon Hill for $6 million and Galoob for $220 million. That same year, Milton Bradley merged with Parker Bros. to form Hasbro Games. In 1999, Hasbro paid $325 million for rights to Pokémon toys. The same year, Wizards of the Coast was bought in a deal worth $325 million. Wizards of the Coast is now a subsidiary of Hasbro and has Avalon Hill as its division. In 2001 money-losing Hasbro Interactive was sold to Infogrames, a French software concern, for $100 million. Hasbro entered the building block toy with its Built to Rule line in 2003, which did not hold together well or were too hard for the targeted age group, thus ended in 2005. In 2004, the company entered into a deal with Paramount Home Entertainment to release its programs based on its games and toys on VHS and DVD. 2008–2018 In 2008, Hasbro acquired game maker Cranium, Inc. for $77.5 million. The deal was announced on January 4 and closed on January 25. Hasbro and Universal Pictures signed an agreement in February 2008 to derive four films from seven Hasbro properties for production. In May, Bennett Schneir was hired to lead its Hasbro Films division, while Hasbro also reacquired series based on their properties from Sunbow Productions. The year of his promotion to CEO of Hasbro, Brian Goldner was named CEO of the year by News Corporation affiliate website MarketWatch.com. Goldner became the first person not from the founding Hassenfeld family to hold the position. In 2009, the Milton Bradley and Parker Bros. brands were retired after 25 years and eighteen years of Hasbro ownership respectively. That same year, Hasbro Studios was formed for TV development, production and distribution. On December 11, 2012, Hasbro transferred all entertainment divisions to Hasbro Studios, including their LA-based film group, and Cake Mix Studio, the company's Rhode Island–based producer of commercials and short form content. Hasbro collaborated with Discovery on The Hub, a cable television network targeting younger children and families, which launched on October 10, 2010. The venture found unexpected success with the revival of the My Little Pony franchise, My Little Pony: Friendship Is Magic, which became the network's highest-rated program and attracted a significant cult following among teens and adults. The Hub was renamed to Hub Network in 2013, and was rebranded again as Discovery Family on October 13, 2014. In 2013, Hasbro renewed its deal to produce Marvel Comics and Star Wars toys through at least 2020. In 2011, Greenpeace accused Hasbro of purchasing paper for its packaging from ancient forests in Indonesia. Hasbro changed its paper purchasing policy, earning the company praise from Greenpeace executive director Phil Radford, who said: \"The new Hasbro policy will also increase the recycled and Forest Stewardship Council (FSC) certified paper in its toy packaging. Hasbro's new commitments are great news for Indonesian rainforests and the people and wildlife that depend on them.\" By April 2011, Hasbro started 360 Manufacturing Services, a contract OEM game manufacturing operating out of Hasbro's USA plant. Having been absent from the building block market since the failure of the Built to Rule line, Hasbro re-entered the market with the Kre-O line in late 2011, starting with some Transformers-based sets. In 2012, Hasbro received a $1.6 million tax credit from the state of Rhode Island with a promise to create 245 new jobs in the state. Instead, they laid off more than 125 workers. This was followed in 2013 with further layoffs of North American workers, amounting to 10% of its salaried employees. Meanwhile, CEO Brian Goldner signed a new five-year contract. As of fiscal year 2012, Goldner had a total calculated compensation of $9,684,285. On July 9, 2013, Backflip Studios sold a 70% stake in the company to Hasbro for $112 million in cash. On November 6, 2012, it was rumored that the Walt Disney Company was discussing a multi-billion dollar deal to acquire Hasbro. While Hasbro declined to discuss the rumor, advisors stated there was \"absolutely nothing going on\" they knew of between the two companies. Additionally, financial analysts said the deal was illogical, as the rumor came out just a week after Disney had bought out Lucasfilm. Hasbro was named by Fortune magazine as one of the top 100 companies to work for in 2013, citing that the \"company enhanced its vacation policy by giving new employees three weeks off in their first year instead of having to wait five years.\" On November 12, 2014, it was reported that Hasbro was in talks to buy DreamWorks Animation. The proposal reportedly calls for the combined company to take the name \"DreamWorks-Hasbro\" and for Jeffrey Katzenberg to become its chairman, but as a matter of policy, neither Hasbro nor DreamWorks publicly comment on mergers and acquisitions. Two days later, the talks were reported to have fallen through. The company has been owned by Comcast subsidiary NBCUniversal since 2016. On July 14, 2015, the company announced the intent to sell its last two factories, in Ireland and East Longmeadow, Massachusetts (including its 360 Manufacturing Services), to Cartamundi. The deal was set to close in sixty days. Hasbro signed a five-year deal with Cartamundi to produce their board games at the East Longmeadow plant. With Mattel adding two competing lines, and the expiration of their Disney Princess license at the end of 2015, Disney gave Hasbro a chance to gain the license given their work on Star Wars, which led to a Descendants license. DCP was also attempting to evolve the brand from one of them less as damsels and more as heroines. In September 2014, Disney announced that Hasbro would be the doll licensee for the Disney Princess line starting on January 1, 2016. On July 13, 2016, Hasbro acquired Dublin-based Boulder Media Limited and placed it under the control of its chief content officer. Hasbro announced that it would launch its own convention, named HasCon, and featuring \"all things Hasbro\" in 2016, with the inaugural event being held at the Rhode Island Convention Center in September 2017. On November 15, 2017, Mattel rejected an offer from the company. At the time, Mattel's worth was $5 billion, while Hasbro's worth was about $11 billion. On February 27, 2018, Variety reported in a detailed article that Hasbro came close to buying Lionsgate (now Starz Entertainment), exploring options to expand its entertainment division and bolster its content production capabilities due to interest in film and television ventures, but the deal fell through. 2018–2021 On February 16, 2018, Saban Brands appointed Hasbro as the global master toy licensee for Power Rangers with a future collaboration and option to purchase the franchise. On May 1, 2018, Hasbro agreed to purchase Power Rangers and other entertainment assets from Saban Brands for $522 million in cash and stock with the licensing fee recently paid with credit. The sale, which also collaborated with My Pet Monster, Popples, Julius Jr., Treehouse Detectives and additional properties, was expected to close in the second quarter until it was finished with Saban's collab. On October 19, 2018, the company announced plans to cut jobs amounting to less than 10% of its 5,000-plus global workforce in response to changes in how consumers buy toys. In 2018, Hasbro signed a number of licensing agreements for hospitality deals based on Hasbro brands. On May 1, 2018, the Monopoly Mansion hotel agreement was announced by Hasbro, with M101 Holdings overseeing construction and M101's Sirocco Group assigned to manage the hotel when it opened in 2019. Later in May 23, 2018 launched the lost kitties franschise. Lost Kitties were cat figures hidden in milk cartons. Hasbro granted Kingsmen Creatives a license to build a chain of NERF Action Xperience family entertainment centers, with the first to be opened in Singapore in fall/winter 2019. In November, the company issued a license for family entertainment centers to Kilburn Live, who were to launch a new division for the centers. That December, the company granted a license for theme parks to Imagine Resorts and Hotels, co-founded by Bruce Neviaser. Neviaser had previously co-founded Great Lakes Companies, which launched Great Wolf Resorts indoor waterpark resorts. On December 18, 2019, Hasbro and West Edmonton Mall announced that Galaxyland would get a makeover, with rides being redone and renamed to Hasbro properties. Construction was begun later that month and scheduled to wrap up in late 2020. On August 22, 2019, Hasbro announced its purchase of Entertainment One for about US$4 billion. The deal was completed on December 30, 2019. On October 24, 2019, Hasbro announced the closing of Backflip Studios, while its Wizards of the Coast subsidiary purchased Tuque Games in October. On February 28, 2020, Hasbro announced that Campbell Arnott's former CMO David McNeil had joined the company as the managing director for Pacific operations. On September 30, 2020, Renegade Game Studios announced they had acquired licensing for creating tabletop games for multiple Hasbro brands. Several of the games would be using the 5E role-playing system owned by Wizards of the Coast. On February 25, 2021, during the 2021 Investor Event, Hasbro announced a company reorganization with three divisions: Consumer Products, Entertainment, and Wizards & Digital. The Wall Street Journal reported that \"Hasbro's net revenue fell 8% last year to $5.47 billion, due in part to retail shutdowns related to Covid-19,\" however, its Wizards of the Coast subsidiary \"posted revenue of $816 million last year, up 24% from 2019, fueled by what Hasbro says were record years for\" Dungeons & Dragons and Magic: The Gathering. ICv2 reported, \"the WotC and Digital Gaming segment is over $112 million more than the operating profit for Hasbro's entire consumer products segment\" and that \"Wizards of the Coast on its own is also more profitable than Hasbro's consumer products segment [...]. From the outside, Hasbro looks like a toy company, but with these numbers, it's revealed to be a geek game company with toy and entertainment divisions\". In April 2021, Hasbro agreed to sell eOne Music unit to Blackstone for $385 million, offloading part of the Entertainment One operations that it acquired in 2019. 2021–present: Restructuring and turnaround Hasbro's longtime CEO Brian Goldner died on October 12, 2021, after a 7-year battle with cancer. Richard Stoddart served as the interim CEO of the company following Goldner's death; Chris Cocks was named as Goldner's successor on January 5, 2022, and became CEO on February 25, 2022. Cocks was formerly the president and chief operating officer of Wizards of the Coast, a division of Hasbro. In June 2022, Hasbro defeated a board challenge from activist investor Alta Fox Capital Management LLC. The hedge fund company, which owns a 2.5% stake of Hasbro, had been pushing to spin out Wizards of the Coast \"into its own company in an attempt to create what they saw was more value by making a second publicly traded company with a more profitable line of business\". On November 17, 2022, Hasbro announced they had put Entertainment One up for sale. This includes their film and TV business but would exclude the company's kids and family division, which would remain under Hasbro. On March 15, 2023, it was reported that Fremantle, Lionsgate and Legendary Entertainment are interested in the buyout. However, Fremantle dropped out of the bid while CVC Capital Partners and GoDigital Media Group joined in the bid for the eOne buyout. On April 20, 2023, it was reported that Hasbro was in talks with Throop on the possibility of buying the company back. On July 17, 2023, Deadline reported that Lionsgate was a frontrunner to acquire eOne. In June 2023, Hasbro announced the return of Furby, an interactive plush toy that was highly popular in the late 1990s and early 2000s. On August 3, 2023, Hasbro announced that Lionsgate would acquire Entertainment One for $500 million, with the transaction closed on December 27, 2023. eOne was rebranded as Lionsgate Canada in 2024, the same year that it became a subsidiary of Lionsgate Studios. Hasbro kept eOne’s family brands and its stake in Astley Baker Davies, and created a division called Hasbro Entertainment later that month, which held Astley Baker Davies and Discovery Family. On December 12, 2023, TechCrunch reported that paperwork Hasbro filed with the SEC contained information announcing layoffs of 1,100 employees (20% of their entire workforce across all divisions) effective immediately. President and COO Eric Nyman left the company. Hasbro's CEO, Chris Cocks, stated that this reduction is part of a broader cost-saving strategy, aimed at saving $350 million to $400 million by 2025, with a renewed focus on high-profit areas like licensing and entertainment, particularly in the Wizards of the Coast division. Hasbro also announced to have signed a deal with McFarlane Toys as part the latter's Page Punchers line-up. On February 13, 2024, following the completion of its sale of Entertainment One assets, Hasbro reported losses of $1 billion for the fourth quarter of 2023 and $1.49 billion for the full year, resulting in its entire total net income from December 31, 2019 to December 31, 2023 to plummet to $0. The company now plans to cut its costs by $750 million by December 31, 2024. On July 18, 2024, Hasbro announced the appointment of two new leadership positions: Holly Barbacovi, former COO of Bungie, as Chief People Officer, and John Hight, previously the Senior Vice President and General Manager of the Warcraft Franchise at Blizzard Entertainment, as President of Wizards of the Coast and Digital Gaming. On November 20, 2024, Cocks announced to Bloomberg that Hasbro would stop co-financing future movies based on the company's list of brands in order to focus on mobile games and digital entertainment, leaving film studios that hold the film rights to various Hasbro brands to exclusively finance such projects. On September 8, 2025, Hasbro announced that after 63 years, it would move its global east coast headquarters from Pawtucket to the 400 Summer Street tower in Boston, Massachusetts. Headquarters for the company's gaming and digital divisions, including Wizards of the Coast would remain in Renton, Washington. The move is scheduled to be completed by the end of 2026. Subsidiaries Consumer products Hasbro Games (formerly named as Hasbro Gaming) Avalon Hill (brand) Hasbro Retro Arcade HasLab (defunct in 2012, re-established in 2018) Hasbro Pulse Playskool Tonka Entertainment Hasbro Entertainment Discovery Family (40% with The Cartoon Network, Inc.) Astley Baker Davies (70%) Left Foot Blue Cake Mix Studios SCG Characters LLC SCG Power Rangers LLC SCG Luna Petunia LLC Treehouse Detectives LLC Saban Brands Voyagers LLC Wizards & Digital Wizards of the Coast Archetype Entertainment Atomic Arcade D&D Beyond Invoke Studios Mirrorstone Books Divested Boulder Media (sold to Princess Pictures) Entertainment One (sold to Lionsgate (now Starz Entertainment) in 2023, renamed as Lionsgate Canada) Secret Location The Mark Gordon Company AutoMatik eOne Films (merged into Lionsgate Films) Amblin Partners (minority) Amblin Entertainment Amblin Television DreamWorks Pictures Makeready Momentum Pictures Les Films Séville Séville International Sierra/Affinity eOne Music (sold to The Blackstone Group, renamed as MNRK Music Group) eOne Television (merged into Lionsgate Television) Daisybeck Studios (United Kingdom) Whizz Kid Entertainment (United Kingdom) Blackfin (United States) Renegade83 (United States) Round Room Entertainment Hasbro Interactive (Sold to Infogrames Entertainment SA in January 2001, rebranded Infogrames Interactive, Inc. and Atari Interactive, Inc.) Atari Interactive, Inc. MicroProse Allspark (formerly Hasbro Studios, LLC, folded into Entertainment One) Allspark Pictures (formerly Hasbro Films/Hasbro Film Group, folded into Entertainment One) Backflip Studios (70%) (known for making the popular mobile games Paper Toss and Graffiti Ball) Claster Television Cranium, Inc. Empire Pencil eOne Family & Brands (replaced by Hasbro Entertainment) Galoob Kenner Products Larami (name is now retired and part of the Nerf brand) Milton Bradley Company Parker Brothers Selchow and Righter Saban Brands Secret Location Tiger Electronics Wrebbit Toys and games Hasbro has several brands of toys and games aimed at different demographics. Some of its better-known toy lines (past and present) are: Lost Kitties (Discontinued in 2022) Hasbro is the largest producer of board games in the world as a result of its component brands, such as Parker Brothers, Waddingtons, Milton Bradley, Wizards of the Coast, and Avalon Hill (all acquisitions since the 1980s). As a result, it has well known and top selling games such as: Hasbro also produces many variations of most of their games. For example, in addition to original Scrabble, the game is also available as \"Scrabble Deluxe Edition\", \"Scrabble Deluxe Travel Edition\", \"Scrabble Junior\", and \"Scrabble Onyx Edition\". Hasbro also offers Game of skill such as: Bop It Jenga They also formerly sold: Brain Warp and its sister products which include Brain Shift, Brain Bash, Death Star Escape, Hyperslide and Torx. Bull's-Eye Ball Hasbro also offers a memory game called Simon which involves memorising sequences of colors and lights. In 1995, Hasbro began a short-lived video game development and publishing venture called Hasbro Interactive, but disbanded it in 2001 when it was bought by the now defunct Infogrames. Now Hasbro develops video games based on its brands through third-party developers and licensing strategies, notably with major American companies such as Activision, Electronic Arts, and THQ. Following the rise of smartphones and tablet PCs in the 2010s, as well as major video gaming publishers cutting back on releasing games based on licensed IPs for various reasons, such as economic slumps, several of Hasbro's brands were licensed towards mobile game developers such as Gameloft, releasing their games under the label Hasbro Gaming. On February 25, 2005, Hasbro announced that it would be introducing a musical toothbrush to the market. The Tooth Tunes, released in early 2007, transmits music from the jawbone to the ear when the bristles touch the teeth. In November 2023, Hasbro signed a licensing deal with Ageless Innovation to design toys and games for people over 65. Hasbro will produce \"Generations\" versions of known games such as Scrabble, Life, and Trivial Pursuit. The new versions will include larger fonts and game pieces as well as content that is relevant to different generations. In January 2024, Hasbro launched a new line of Star Wars figures to join The Black Series and The Vintage Collection for the 25th anniversary of The Phantom Menace. The line includes a Destroyer Droid that can roll. In the same month, Hasbro announced a pre-order for a new crowdfunding project; the creation of Omega Prime, a Transformer that is a combination of the Robots in Disguise 2001 iterations of Optimus Prime and Ultra Magnus. In February 2024, Hasbro announced a new game, Life in Reterra, a Eurogame-style board game created by Eric M. Lang and Ken Gruhl. Criticism and controversy In 2007, a workers' rights group investigated several of Hasbro's Chinese suppliers and found that, in one instance, a toy factory in China's Guangxi Province had hired 1000 junior high school students. The same group discovered other widespread labor violations, including unsafe working conditions, mandatory overtime, verbal abuse and sexual harassment of employees. Hasbro issued a statement, saying that it would \"act swiftly and decisively in making any necessary changes\" and had \"increased the intensity of [its] ongoing safety review efforts.\" Critics pointed out that Hasbro had no official regulatory control of these factories. Hasbro responded by hiring independent auditors. These auditors made unannounced visits to the East Asian subcontractors. Reports then emerged that the factory managers have been coached in how to deceive the auditors. Hasbro has also been criticized for focusing some of its products on specific demographic groups. For example, a letter spread widely on social media in November 2012 written by a six-year-old Irish girl complaining about the lack of female characters in the guessing game Guess Who?. This garnered attention in the press after the girl's mother posted the exchange on her blog. Guess Who? had previously received complaints over gender and ethnic bias in its choice of 24 images. Hasbro primarily sells toys directed at girl or boy markets. As such, there have been criticisms that Hasbro's toys reinforce gender stereotypes. For example, in December 2012, 13-year-old McKenna Pope started a campaign on Change.org, calling on the company to create a \"boy-friendly\" version of the popular Easy-Bake Oven and to feature boys on their packaging and materials. Within a week, over 30,000 people signed her petition. Hasbro was criticized for \"sexist\" product design when its 2015 Star Wars Monopoly board game failed to feature Rey, the female protagonist in Star Wars: The Force Awakens, while including all of the supporting male characters. Hasbro explained that Rey was left out of the Monopoly game to avoid spoilers, because the game was released months before the movies. On January 5, 2016, Hasbro announced that Rey would be included in future versions. Hasbro later stated that it struggled to distribute the updated Monopoly game that includes the Rey piece, because retailers (especially in the United States) showed \"insufficient interest\" after having already purchased stock of the first release. On October 2, 2015, Lorraine Markham sued Hasbro for breach of contract for failure to pay royalties to her. She was seeking a declaration from the U.S. District Court in Providence that her husband Bill Markham was the sole creator of The Game of Life. On August 7, 2020, Hasbro produced a DreamWorks Animation Troll doll device for pre-school children which had an unadvertised activator on the doll's private parts that caused the device to emit several audio recordings that were questioned by some American mothers; in particular one of them posted a Facebook video stream that went viral. In it, she questioned whether the intent was to groom children for depravity. A Hasbro senior officer for global communications said that it was \"not intentional\" and the company removed the device from the marketplace. A writer for USA Today opined that \"We rate the claim that the doll was designed to groom children as PARTLY FALSE.\" In late December 2022, continuing into 2023, Hasbro and subsidiary company Wizards of the Coast received backlash from Dungeons & Dragons fans due to leaked information indicating the companies planned to revoke a longstanding open license and to replace it with one that imposed severe new regulations on content created under the previous license agreement. The legality of this move by Hasbro has been debated. In 2023, subsidiary Wizards of the Coast hired several Pinkerton employees to seize the upcoming March of the Machine: The Aftermath card set for trading card game Magic: The Gathering from a YouTuber who had purchased them from a local game store and published their contents on YouTube ahead of release. Philanthropy In 2017, Corporate Responsibility Magazine rated Hasbro number one on its 100 Best Corporate Citizens list, a measure of corporate philanthropy. The company was ranked number five for 2018, and number 13 in 2019. Conventions HasCon (2017) HasCon was a fan convention created by Hasbro to promote its various licensed properties, including Transformers, G.I. Joe, My Little Pony: Friendship Is Magic, and Magic: The Gathering. It thus replaces the previous fan convention from Fun Publications, BotCon. However, Fun Publications' G. I. Joe Convention continued to be held as of 2017. It was subsequently announced that the first HasCon is scheduled for September 8–10, 2017, at the Rhode Island Convention Center. Meanwhile, Summer Hayes, LLC., which organizes My Little Pony Fair convention, has announced that their convention will not be held for 2017, and would collaborate with HasCon instead. There was supposed to be a HasCon event in 2019 at the Rhode Island Convention Center and Dunkin' Donuts Center in Providence, Rhode Island, but it has been cancelled due the COVID-19 pandemic. Hasbro Pulse Con (Since 2020) Hasbro Pulse Con is a virtual convention held through the Hasbro Pulse website due the COVID-19 pandemic, following the cancellation of HasCon 2019. Since 2020, four yearly conventions were made at the moment. Other BotCon (1994–2002, 2005–2016) OTFCC (Official Transformers Collectors Convention) (2003–2004) G.I. Joe Collectors Club (by Fun Publications, 2005–2016) Transformers Collectors Club (by Fun Publications, 2005–2018) Other media List of comics based on Hasbro properties List of television programs based on Hasbro properties List of films based on Hasbro properties"
}