{
  "ticker": "HBAN",
  "cik": "0000049196",
  "company_name": "Huntington Bancshares",
  "corrected_name": "Huntington Bancshares",
  "wiki_title_used": "Huntington Bancshares",
  "exists": true,
  "raw_text": "Huntington Bancshares Incorporated is an American bank holding company headquartered in Columbus, Ohio. Its banking subsidiary, The Huntington National Bank, operates 1,047 banking offices, primarily in the Midwest: 459 in Ohio, 290 in Michigan, 80 in Minnesota, 51 in Pennsylvania, 45 in Indiana, 35 in Illinois, 32 in Colorado, 29 in West Virginia, 16 in Wisconsin, 10 in Kentucky, and one in North Carolina.\nThe company is ranked 466th on the Fortune 500 as of 2024. It is on the list of largest banks in the United States. It is the largest originator of SBA 7(a) loans.\n\nHistory\n20th century\nP. W. Huntington formed P. W. Huntington & Company in 1866, operating on the northwest corner of High and Broad Streets; the site now houses the regional headquarters for rival U.S. Bancorp. Huntington built its first five-story building in 1878, on the intersection's southwest corner. Four of P. W.'s five sons became partners during the 1890s and early 1900s. The bank was incorporated in 1905 as The Huntington National Bank of Columbus. Huntington died in 1918 shortly after turning the bank over to his sons.\nFrancis Huntington became president and provided active leadership for 14 years. In 1915, the bank received limited trust powers. In 1922, it received full trust powers from the Federal Reserve System. In 1923, Huntington purchased Columbus-based State Savings Bank & Trust Company and the Hayden-Clinton National Bank of Columbus, swelling its capital base.\nIn 1958, Huntington acquired the Columbus-based The Market Exchange Bank Company. In 1962, it acquired both First National Bank of Grove City and The People's Bank of Canal Winchester. In 1963, it acquired both The Columbus Savings Bank and the Columbus-based The Northern Savings Bank. In 1966, it reorganized as a holding company, Huntington Bancshares Incorporated. In 1967, Huntington Bancshares acquired the Washington Court House-based The Washington Savings Bank. In 1969, it acquired the Ashland-based Farmers Bank. In 1970, it also acquired the Bowling Green-based Bank of Wood County Company, the Toledo-based Lucas County State Bank, and Lagonda National Bank of Springfield. In 1971, it acquired First National Bank & Trust Company of Lima, The Woodville State Bank, and the Kent-based Portage National Bank. In 1972, it acquired The First National Bank of Wadsworth and The First National Bank of Kenton, also establishing the first 24-hour, fully automated banking office.\nIn 1973, Alger Savings Bank merged into an affiliate in Kenton, Ohio. In 1976, The Huntington Mortgage Company formed as a subsidiary of Huntington Bancshares, with The Pickerington Bank merged into the bank. In 1977, Huntington Bancshares acquired The Bellefontaine National Bank, The Central National Bank of London, and the Columbus-based Franklin National Bank. In 1979, a loan production office opened in Dayton, Ohio. In 1975, the company changed its logo to its current \"honeycomb\" logo. In 1980, Farmers & Merchants Bank, Milford Center, and The First National Bank of Burton merged with Huntington Bancshares. In 1981, the bank acquired Alexandria Bank Company and renamed it The Huntington State Bank, with a loan production office opening in Cincinnati.\nIn 1982, the bank merged with the Reeves Banking and Trust Company. Huntington acquired the tiny Savings Bank of Chillicothe, Ohio, in the early 1980s, which gained some fame in 2011 when 100-year-old June Gregg revealed to Huntington officials that her father had opened a savings account for her as a baby with Savings Bank in 1913 and that she had kept the account open. Huntington officials later confirmed it and gave her account a temporary interest rate increase to 5% as a centenarian present for her 98-year loyalty to Huntington and the Chillicothe branch's predecessor, Savings Bank.\nIn 1983, the bank acquired Cleveland-based Union Commerce Bank. In 1997, it acquired First Michigan Bank Corporation of Holland, Michigan.\n\n21st century\nIn 2002, the company sold its branches in Florida to SunTrust Banks for $705 million. In 2006, it acquired Unizan Financial. In 2007, the company acquired Sky Financial Group Inc., based in Bowling Green, Ohio, which increased its presence in Indiana and Ohio and expanded it into Western Pennsylvania for the first time. In 2008, the United States Department of the Treasury invested $1.4 billion in the company as part of the Troubled Asset Relief Program, and in 2010, the company repaid the Treasury. The U.S. government made a profit of over $144 million from its investment in the company.\nIn 2009, the bank's board of directors named Steve Steinour as president, CEO, and chairman, succeeding Thomas Hoaglan, who retired after eight years in those positions. Huntington bid against Fifth Third Bank to acquire National City Corp. branches in the Pittsburgh region from PNC Financial Services. The United States Department of Justice ordered PNC to sell the branches to comply with United States antitrust law after the National City acquisition by PNC. PNC sold the overlapping branches to First Niagara Bank. On October 3, 2009, the Federal Deposit Insurance Corporation named Huntington as receiver of a $400 million deposit portfolio from the bank failure of Warren Bank in Warren, Michigan. On December 18, 2009, Huntington signed a 45-day lease with the FDIC to run a bridge bank for the failed Citizens State Bank in New Baltimore, Michigan.\nIn 2011, three word marks and two icons were placed atop the 200 Public Square building in Cleveland. The building was constructed in 1985 as the headquarters for formerly the headquarters for Standard Oil of Ohio (Sohio) and in the early 1990s became BP Building or BP America Building when the company unified its North American operations under one brand. In March 2012, the bank acquired Dearborn-based Fidelity Bank. In 2012, Huntington was in merger discussions with Flint, Michigan-based Citizens Republic Bancorp. Discussions stalled and FirstMerit purchased Citizens Republic in September 2012. FirstMerit was itself acquired by Huntington in 2016.\nIn the first quarter of 2013, Huntington changed its ATMs to ones that allow customers to make deposits by inserting cash and checks. In 2014, the bank began offering deposits from mobile phones and through online transfers. In March 2014, the company acquired Ohio-based Camco Financial, holding company for Advantage Bank, for $97 million in stock. In September 2014, the company acquired 24 offices of Bank of America in Central Michigan, including the Port Huron, Flint, and Saginaw markets. This raised the number of Huntington branches in Michigan to 173, including over 40 in Meijer stores. In March 2015, the company acquired Michigan-based Macquarie Equipment Finance, Inc. from Sydney, Australia-based Macquarie Group for $458 million. In January 2016, Huntington announced it would purchase Akron-based FirstMerit Corporation for $3.4 billion, placing the Huntington word mark on the FirstMerit Tower in Akron, Ohio, and making it one of Ohio's largest banks. Due to Sherman Antitrust Act concerns by the United States Department of Justice, it sold 11 branches in Canton and two in Ashtabula to First Commonwealth Bank. Additionally, 107 branches within 2.5 miles of other Huntington / FirstMerit branches closed.\nIn October 2020, the bank announced expansion plans to Philadelphia. On December 13, 2020, Huntington announced the acquisition of Detroit-based TCF Financial Corporation. As part of the merger, the company also announced it would close 198 branches due to overlap. This included all 97 branches inside Meijer stores in Michigan. Regulators required the firm to sell 13 branches in Michigan as a condition of approval. Horizon Bank purchased these branches at the end of the third quarter. The merger was completed on June 9, 2021. It resulted in expansion to Minnesota and Colorado for the first time. TCF branches were converted in the fourth quarter of 2021.\nAs of 2021, Huntington is the sixth-largest bank in the Pittsburgh market by deposits. In June 2022, Huntington completed its acquisition of Capstone Partners, an investment bank and advisory firm based in Boston. By 2023, the bank had invested $100 million in venture capital.\nIn July 2025, Huntington Bancshares announced its acquisition of Texas-based lender Veritex Community Bank for $1.9 billion in an all-stock transaction.\nOn 27 October 2025, Huntington Bancshares announced the acquisition of Cadence Bank for  $7.4 billion in an all-stock deal. The transaction is expected to create a bank with assets of $276 billion and deposits of $220 billion.\n\nHuntington Preferred Capital\nHuntington Bancshares also operates Huntington Preferred Capital, a real estate investment trust (REIT). It was organized under Ohio law in 1992 and designated a REIT in 1998. Four related parties own HPCI's common stock: Huntington Capital Financing LLC; Huntington Preferred Capital II, Inc.; Huntington Preferred Capital Holdings, Inc.; and Huntington Bancshares Incorporated. All these entities are tied via ownership and/or interlocking directorships to Huntington Bancshares, directly or through Huntington National Bank. In addition to the common stock, Huntington Preferred Capital also issued two million shares of preferred stock, paying a quarterly cash dividend of $0.4925 per share. This stock is largely held by the same companies as the common stock, but a small fraction of the available shares are sold on the open market. Huntington Preferred Capital had one subsidiary, HPCLI, Inc., a taxable REIT subsidiary formed in 2001 for the purpose of holding certain assets (primarily leasehold improvements). On December 31, 2007, Huntington Preferred Capital paid common stock dividends consisting of cash and the stock of HPCLI to its common stock shareholders. After the stock dividend was paid, HPCLI became a wholly owned subsidiary of Huntington Preferred Capital Holdings, which holds all the shares of HPCLI.\n\nOld checks\nIn 2012, Huntington started displaying checks written by famous people, including 24 former U.S. presidents, such as Abraham Lincoln, George Washington, Thomas Jefferson, Andrew Jackson, Theodore Roosevelt, Franklin Roosevelt, and Niles, Ohio native William McKinley. Other checks were signed by Charles Dickens, Thomas Edison, Ernest Hemingway, and Susan B. Anthony. The most notable check was one written by Lincoln to \"self\" for $800 dated April 13, 1865, the day before his assassination. The checks are estimated to be worth over $75,000 today. Huntington acquired the checks in 1983 when it purchased Union Commerce Bank and received several boxes of old documents, but were only discovered in 2011, when a Huntington employee was looking through the documents.\n\nSponsorships\nHuntington owns the naming rights to:\n\nHuntington Bank Pavilion in Chicago\nHuntington Bank Stadium in Minneapolis\nHuntington Center in Toledo\nHuntington Convention Center of Cleveland\nHuntington Park in Columbus\nHuntington Place in Detroit\nHuntington Bank Field in Cleveland\n\nGallery\nSee also\nBanks portal\n\nReferences\nFurther reading\nExternal links\n\nOfficial website\nBusiness data for Huntington Bancshares:",
  "clean_text": "Huntington Bancshares Incorporated is an American bank holding company headquartered in Columbus, Ohio. Its banking subsidiary, The Huntington National Bank, operates 1,047 banking offices, primarily in the Midwest: 459 in Ohio, 290 in Michigan, 80 in Minnesota, 51 in Pennsylvania, 45 in Indiana, 35 in Illinois, 32 in Colorado, 29 in West Virginia, 16 in Wisconsin, 10 in Kentucky, and one in North Carolina. The company is ranked 466th on the Fortune 500 as of 2024. It is on the list of largest banks in the United States. It is the largest originator of SBA 7(a) loans. History 20th century P. W. Huntington formed P. W. Huntington & Company in 1866, operating on the northwest corner of High and Broad Streets; the site now houses the regional headquarters for rival U.S. Bancorp. Huntington built its first five-story building in 1878, on the intersection's southwest corner. Four of P. W.'s five sons became partners during the 1890s and early 1900s. The bank was incorporated in 1905 as The Huntington National Bank of Columbus. Huntington died in 1918 shortly after turning the bank over to his sons. Francis Huntington became president and provided active leadership for 14 years. In 1915, the bank received limited trust powers. In 1922, it received full trust powers from the Federal Reserve System. In 1923, Huntington purchased Columbus-based State Savings Bank & Trust Company and the Hayden-Clinton National Bank of Columbus, swelling its capital base. In 1958, Huntington acquired the Columbus-based The Market Exchange Bank Company. In 1962, it acquired both First National Bank of Grove City and The People's Bank of Canal Winchester. In 1963, it acquired both The Columbus Savings Bank and the Columbus-based The Northern Savings Bank. In 1966, it reorganized as a holding company, Huntington Bancshares Incorporated. In 1967, Huntington Bancshares acquired the Washington Court House-based The Washington Savings Bank. In 1969, it acquired the Ashland-based Farmers Bank. In 1970, it also acquired the Bowling Green-based Bank of Wood County Company, the Toledo-based Lucas County State Bank, and Lagonda National Bank of Springfield. In 1971, it acquired First National Bank & Trust Company of Lima, The Woodville State Bank, and the Kent-based Portage National Bank. In 1972, it acquired The First National Bank of Wadsworth and The First National Bank of Kenton, also establishing the first 24-hour, fully automated banking office. In 1973, Alger Savings Bank merged into an affiliate in Kenton, Ohio. In 1976, The Huntington Mortgage Company formed as a subsidiary of Huntington Bancshares, with The Pickerington Bank merged into the bank. In 1977, Huntington Bancshares acquired The Bellefontaine National Bank, The Central National Bank of London, and the Columbus-based Franklin National Bank. In 1979, a loan production office opened in Dayton, Ohio. In 1975, the company changed its logo to its current \"honeycomb\" logo. In 1980, Farmers & Merchants Bank, Milford Center, and The First National Bank of Burton merged with Huntington Bancshares. In 1981, the bank acquired Alexandria Bank Company and renamed it The Huntington State Bank, with a loan production office opening in Cincinnati. In 1982, the bank merged with the Reeves Banking and Trust Company. Huntington acquired the tiny Savings Bank of Chillicothe, Ohio, in the early 1980s, which gained some fame in 2011 when 100-year-old June Gregg revealed to Huntington officials that her father had opened a savings account for her as a baby with Savings Bank in 1913 and that she had kept the account open. Huntington officials later confirmed it and gave her account a temporary interest rate increase to 5% as a centenarian present for her 98-year loyalty to Huntington and the Chillicothe branch's predecessor, Savings Bank. In 1983, the bank acquired Cleveland-based Union Commerce Bank. In 1997, it acquired First Michigan Bank Corporation of Holland, Michigan. 21st century In 2002, the company sold its branches in Florida to SunTrust Banks for $705 million. In 2006, it acquired Unizan Financial. In 2007, the company acquired Sky Financial Group Inc., based in Bowling Green, Ohio, which increased its presence in Indiana and Ohio and expanded it into Western Pennsylvania for the first time. In 2008, the United States Department of the Treasury invested $1.4 billion in the company as part of the Troubled Asset Relief Program, and in 2010, the company repaid the Treasury. The U.S. government made a profit of over $144 million from its investment in the company. In 2009, the bank's board of directors named Steve Steinour as president, CEO, and chairman, succeeding Thomas Hoaglan, who retired after eight years in those positions. Huntington bid against Fifth Third Bank to acquire National City Corp. branches in the Pittsburgh region from PNC Financial Services. The United States Department of Justice ordered PNC to sell the branches to comply with United States antitrust law after the National City acquisition by PNC. PNC sold the overlapping branches to First Niagara Bank. On October 3, 2009, the Federal Deposit Insurance Corporation named Huntington as receiver of a $400 million deposit portfolio from the bank failure of Warren Bank in Warren, Michigan. On December 18, 2009, Huntington signed a 45-day lease with the FDIC to run a bridge bank for the failed Citizens State Bank in New Baltimore, Michigan. In 2011, three word marks and two icons were placed atop the 200 Public Square building in Cleveland. The building was constructed in 1985 as the headquarters for formerly the headquarters for Standard Oil of Ohio (Sohio) and in the early 1990s became BP Building or BP America Building when the company unified its North American operations under one brand. In March 2012, the bank acquired Dearborn-based Fidelity Bank. In 2012, Huntington was in merger discussions with Flint, Michigan-based Citizens Republic Bancorp. Discussions stalled and FirstMerit purchased Citizens Republic in September 2012. FirstMerit was itself acquired by Huntington in 2016. In the first quarter of 2013, Huntington changed its ATMs to ones that allow customers to make deposits by inserting cash and checks. In 2014, the bank began offering deposits from mobile phones and through online transfers. In March 2014, the company acquired Ohio-based Camco Financial, holding company for Advantage Bank, for $97 million in stock. In September 2014, the company acquired 24 offices of Bank of America in Central Michigan, including the Port Huron, Flint, and Saginaw markets. This raised the number of Huntington branches in Michigan to 173, including over 40 in Meijer stores. In March 2015, the company acquired Michigan-based Macquarie Equipment Finance, Inc. from Sydney, Australia-based Macquarie Group for $458 million. In January 2016, Huntington announced it would purchase Akron-based FirstMerit Corporation for $3.4 billion, placing the Huntington word mark on the FirstMerit Tower in Akron, Ohio, and making it one of Ohio's largest banks. Due to Sherman Antitrust Act concerns by the United States Department of Justice, it sold 11 branches in Canton and two in Ashtabula to First Commonwealth Bank. Additionally, 107 branches within 2.5 miles of other Huntington / FirstMerit branches closed. In October 2020, the bank announced expansion plans to Philadelphia. On December 13, 2020, Huntington announced the acquisition of Detroit-based TCF Financial Corporation. As part of the merger, the company also announced it would close 198 branches due to overlap. This included all 97 branches inside Meijer stores in Michigan. Regulators required the firm to sell 13 branches in Michigan as a condition of approval. Horizon Bank purchased these branches at the end of the third quarter. The merger was completed on June 9, 2021. It resulted in expansion to Minnesota and Colorado for the first time. TCF branches were converted in the fourth quarter of 2021. As of 2021, Huntington is the sixth-largest bank in the Pittsburgh market by deposits. In June 2022, Huntington completed its acquisition of Capstone Partners, an investment bank and advisory firm based in Boston. By 2023, the bank had invested $100 million in venture capital. In July 2025, Huntington Bancshares announced its acquisition of Texas-based lender Veritex Community Bank for $1.9 billion in an all-stock transaction. On 27 October 2025, Huntington Bancshares announced the acquisition of Cadence Bank for $7.4 billion in an all-stock deal. The transaction is expected to create a bank with assets of $276 billion and deposits of $220 billion. Huntington Preferred Capital Huntington Bancshares also operates Huntington Preferred Capital, a real estate investment trust (REIT). It was organized under Ohio law in 1992 and designated a REIT in 1998. Four related parties own HPCI's common stock: Huntington Capital Financing LLC; Huntington Preferred Capital II, Inc.; Huntington Preferred Capital Holdings, Inc.; and Huntington Bancshares Incorporated. All these entities are tied via ownership and/or interlocking directorships to Huntington Bancshares, directly or through Huntington National Bank. In addition to the common stock, Huntington Preferred Capital also issued two million shares of preferred stock, paying a quarterly cash dividend of $0.4925 per share. This stock is largely held by the same companies as the common stock, but a small fraction of the available shares are sold on the open market. Huntington Preferred Capital had one subsidiary, HPCLI, Inc., a taxable REIT subsidiary formed in 2001 for the purpose of holding certain assets (primarily leasehold improvements). On December 31, 2007, Huntington Preferred Capital paid common stock dividends consisting of cash and the stock of HPCLI to its common stock shareholders. After the stock dividend was paid, HPCLI became a wholly owned subsidiary of Huntington Preferred Capital Holdings, which holds all the shares of HPCLI. Old checks In 2012, Huntington started displaying checks written by famous people, including 24 former U.S. presidents, such as Abraham Lincoln, George Washington, Thomas Jefferson, Andrew Jackson, Theodore Roosevelt, Franklin Roosevelt, and Niles, Ohio native William McKinley. Other checks were signed by Charles Dickens, Thomas Edison, Ernest Hemingway, and Susan B. Anthony. The most notable check was one written by Lincoln to \"self\" for $800 dated April 13, 1865, the day before his assassination. The checks are estimated to be worth over $75,000 today. Huntington acquired the checks in 1983 when it purchased Union Commerce Bank and received several boxes of old documents, but were only discovered in 2011, when a Huntington employee was looking through the documents. Sponsorships Huntington owns the naming rights to: Huntington Bank Pavilion in Chicago Huntington Bank Stadium in Minneapolis Huntington Center in Toledo Huntington Convention Center of Cleveland Huntington Park in Columbus Huntington Place in Detroit Huntington Bank Field in Cleveland Gallery"
}