{
  "ticker": "HCA",
  "cik": "0000860730",
  "company_name": "HCA Healthcare",
  "corrected_name": "HCA Healthcare",
  "wiki_title_used": "HCA Healthcare",
  "exists": true,
  "raw_text": "HCA Healthcare, Inc. (historically known as Hospital Corporation of America) is an American for-profit operator of health care facilities that was founded in 1968. It is based in Nashville, Tennessee, and, as of May 2020, owned and operated 186 hospitals and approximately 2,400 sites of care, including surgery centers, freestanding emergency rooms, urgent care centers and physician clinics in 20 states and the United Kingdom. As of 2024, HCA Healthcare is ranked #61 on the Fortune 500 rankings of the largest United States corporations by total revenue. In the 1990s, the company engaged in illegal accounting and other crimes that resulted in the payment of more than $2 billion in federal fines and other penalties, and the dismissal of the CEO Rick Scott by the board of directors.\n\nHistory\nEarly years\nThe Hospital Corporation of America (HCA) was founded in 1968 in Nashville, Tennessee, by  Thomas F. Frist Sr., Thomas F. Frist Jr. and Jack C. Massey. The founders envisioned a company that would bring together hospitals to deliver patient-focused care while using the combined resources of the organization to strengthen hospitals and improve the practice of medicine. The company began with Nashville's Park View Hospital, which the elder Frist had founded in 1960 with other doctors and where he was serving as chief executive.\nThe company included 11 hospitals when it filed its initial public offering on the New York Stock Exchange (NYSE) in 1969 and had 26 hospitals and 3,000 beds by the end of the year.\n\nGrowth and merger\nThe 1970s were characterized by rapid growth in the industry and for HCA Healthcare. In the early 1980s, the focus shifted to consolidation with HCA Healthcare acquiring General Care Corporation, General Health Services, Hospital Affiliates International and Health Care Corporation. By the end of 1981, the company operated 349 hospitals with more than 49,000 beds. Operating revenues had grown to $2.4 billion.\nIn 1987, HCA Healthcare, which had grown to operate 463 hospitals (255 owned and 208 managed), spun off HealthTrust, a privately owned, 104-hospital company. Believing its stock was undervalued, the company completed a $5.1 billion leveraged management buyout led by chairman Thomas F. Frist Jr. in 1988. HCA Healthcare re-emerged as a public company in 1992.\nIn February 1994, HCA Healthcare merged with Louisville, Kentucky-based Columbia Hospital Corporation, which earlier had acquired 73 hospitals of Galen Health Care from Humana, \nto form Columbia/HCA Healthcare Corporation. Related names of note include HCA International and Health Corporation of America.\n\nColumbia Hospital Corporation\nIn 1988, Rick Scott and Richard Rainwater each put up $125,000 in working capital in their new company, Columbia Hospital Corporation; they borrowed the remaining money needed to purchase two struggling hospitals in El Paso for $60 million. Then they acquired a neighboring hospital and shut it down. Within a year, the remaining two were doing much better. By the end of 1989, Columbia Hospital Corporation owned four hospitals with a total of 833 beds.\nIn 1992, Columbia made a stock purchase of Basic American Medical, which owned eight hospitals, primarily in southwestern Florida. In September 1993, Columbia did another stock purchase, worth $3.4 billion, of Galen Healthcare, which had been spun off by Humana Inc. several months earlier. At the time, Galen had approximately 90 hospitals. After the purchase, Galen stockholders had 82% of the stock in the combined company, with Scott still running the company.\n\nRecent history\nOn November 17, 2006, HCA became a private company for the third time when it completed a merger in which the company was acquired by a private investor group including affiliates of Kohlberg Kravis Roberts and Bain Capital, together with Merrill Lynch and HCA Healthcare founder Thomas F. Frist Jr. The total transaction was valued at approximately $33 billion, making it the largest leveraged buyout in history at the time, eclipsing the 1989 buyout of RJR Nabisco.\nIn May 2010, HCA announced that the corporation would once again go public with an expected $4.6-billion IPO as HCA Holdings, Inc. In March 2011, HCA sold 126.2 million shares for $30 each, raising about $3.79 billion, at that time, the largest private-equity backed IPO in U.S. history.  In May 2017, the corporation was renamed HCA Healthcare.\nIn December 2018, a historical marker was installed in the parking lot of HCA's Sarah Cannon Cancer Center in Nashville, formerly the location of HCA's first hospital, Park View Hospital.\nIn 2018, the company was ranked No. 67 in the 2019 Fortune 500 list of the largest United States corporations by total revenue.\nIn May 2021, the company finalized a deal with Google to develop healthcare algorithms using patient records. In August 2021, HCA announced a deal with venture capital firm General Catalyst to develop digital solutions to streamline workflows and improve patient care; as part of the deal, HCA sold its healthcare app development firm PatientKeeper to General Catalyst's portfolio company Commure.\nIn April 2022, HCA Healthcare announced a $1.5 million partnership with Florida International University's Nicole Wertheim college of Nursing and Health Sciences, to expand its facilities to address the national nursing shortage.\nIn October 2022, LCMC Health in partnership with Tulane University announced that it would acquire Tulane Medical Center, Lakeview Regional Medical Center, and Tulane Lakeside Hospital from HCA for $150 million pending regulatory approval.\nIn March 2024, it was announced HCA had completed the sale of West Hills Hospital and Medical Center and related assets in Los Angeles, California to UCLA Health, for an undisclosed amount.\n\nFacilities\nUnited States\nAs of 2024, HCA has 186 hospitals. They also report operating more than 2,400 additional sites of care, including surgery centers, freestanding ERs, urgent care centers, and physician clinics located in 20 U.S. states and in the United Kingdom.  A significant portion of those hospitals are situated in Florida and Texas. As of 2022, HCA had 47 hospitals and 31 surgery centers in Florida, and 45 hospitals and 632 affiliated sites of care in Texas. In 2021, it announced plans to build 3 new hospitals in Florida. In 2022, The Dallas Morning News reported that HCA will build 5 new hospitals in Texas. They also have a strong presence in Tennessee, where it began. HCA had 13 hospitals there as of 2019.\nBetween 2003 and 2017, HCA did not enter any new markets. However, in July 2007, HCA sold its hospitals in Switzerland.\nIn 2017, HCA acquired the Memorial University Medical Center in Savannah, Georgia. That same year, they acquired three Houston, Texas, hospitals from Tenet Healthcare.\nIn 2019 they purchased Mission Health System which operates hospitals in North Carolina.\nIn January 2020, HCA Healthcare acquired Valify, a healthcare cost-management company. In May 2020, HCA acquired 49-bed Shands Starke (Fla.) Regional Medical Center and 25-bed Shands Live Oak (Fla.) Regional Medical Center from CHS. HCA is operating the two facilities as off-campus emergency departments of Lake City (Fla.) Medical Center and North Florida Regional Medical Center in Gainesville. Later that year, it signed an agreement to sell Garden Park Medical Center to Singing River Health System.\nIn 2021, HCA sold Redmond Regional Medical Center to AdventHealth for $635M, and four other Georgia hospitals to Piedmont Healthcare for $950 million.  They also announced the acquisition of  Meadows Regional Medical Center.\n\nUnited Kingdom\nHCA International, the UK arm of Hospital Corporation of America, \"caters for around half of all private patients in London.\" The main hospital sites within the United Kingdom it operates include:\n\nIt opened urgent care walk-in centres at London Bridge Hospital and the Portland Hospital in March 2018. It claims that patients, on average, wait just seven minutes to see a nurse and 17 minutes to see a doctor. In February 2022, outsourced cleaning staff at London Bridge Hospital reported a lack of PPE, no access to sick pay, a lack of training and no prior warning about which rooms may be contaminated with the virus through the COVID-19 pandemic.\nThe Princess Grace Hospital specializes in breast cancer and surgery, aided by Kefah Mokbel and Nick Perry who, in 2005, founded The London Breast Institute.\nThe company intends to open The Harborne Hospital, a new-built private hospital located close to the Queen Elizabeth Hospital, Birmingham, in January 2024.\n\nSignificant areas of operation\nMedical education\nIn recent years, HCA Healthcare has become a significant provider of clinical and medical education. It is the largest sponsor of graduate medical education programs in the U.S., with 56 teaching hospitals in 14 states, primarily in regions with a deficit of physician training programs. The company includes Research College of Nursing and Mercy School of Nursing, and has several advanced nursing simulation training centers. In early 2020, it completed the purchase of a majority stake in Galen College of Nursing, which operates 21 campuses in 12 states, offering Bachelor of Science and Associate of Science nursing degrees.\n\nControversies\nMedicare billing practices lawsuit\nIn 1993, lawsuits were filed against HCA by former employees who alleged that the company had engaged in questionable Medicare billing practices. In 1997, with a federal investigation by the FBI, the IRS and the Department of Health and Human Services in its early stages, the Columbia/HCA board of directors forced Rick Scott to resign as chairman and CEO amid growing evidence that the company \"had kept two sets of books, one to show the government and one with actual expenses listed.\" Thomas Frist, a co-founder of HCA and brother of U.S. Senator Bill Frist, returned to the company as CEO in 1997 and called on longtime friend and colleague Jack O. Bovender Jr. to help him turn the company around.\nThe federal probe culminated in 2003 with \"the government receiving a total of over $2 billion in criminal fines and civil penalties for systematically defrauding federal health care programs.\"   Columbia/HCA pleaded guilty to 14 felonies and admitted to systematically overcharging the government. The federal probe has been referred to as the longest and costliest investigation for health-care fraud in U.S. history.\n\n2005 insider trading suit\nIn July 2005, U.S. Senator Bill Frist sold all of his HCA shares, which were held in a blind trust, two weeks before disappointing earnings sent the stock on a 9-point plunge. At the time, Frist was considering a run for president and said that he had sold his shares to avoid the appearance of a conflict of interest.  When the company disclosed that other executives had also sold their shares during that same time, shareholders alleged that the company had made false claims about its profits to drive up the price, which then fell when the company reported disappointing financial results. Eleven of HCA's senior officers were sued for accounting fraud and insider trading. HCA settled the lawsuit in August 2007, agreeing to pay $20 million to the shareholders but admitting no wrongdoing, and no charges were brought.\n\nCOVID-19 PPE\nDuring the COVID-19 pandemic in the United States, HCA hospital nurses and other workers spoke out about the lack of PPE. In April 2020, there was an outcry against HCA following the deaths of two nurses Celia Yap-Banago and Rosa Luna who worked at HCA hospitals in Kansas City and California and had contracted coronavirus, despite the alarm having been raised about the lack of PPE at work.\n\nMission Hospital Acquisition Complaints\nOn December 14, 2023, the North Carolina Attorney General sued HCA for violating the terms of an agreement that allowed HCA to purchase Mission Health.\nOn February 13, 2024, HCA Healthcare denied the allegations and asked a judge to dismiss the lawsuit by the Attorney General, and in return the hospital network filed a counterclaim against the Attorney General.\n\nSee also\nPrivate medicine in the United Kingdom\n\nReferences\nFurther reading\nLutz, Sandy; Gee, E. Preston (1998). Columbia/HCA: Healthcare on Overdrive. McGraw-Hill. ISBN 0070248044.\n\"2015 Annual Report to Shareholders\" (PDF). Investor.healthcare.com. Archived from the original (PDF) on 15 December 2017. Retrieved 2 October 2017.\n\nExternal links\nOfficial website \n\nBusiness data for HCA Healthcare:",
  "clean_text": "HCA Healthcare, Inc. (historically known as Hospital Corporation of America) is an American for-profit operator of health care facilities that was founded in 1968. It is based in Nashville, Tennessee, and, as of May 2020, owned and operated 186 hospitals and approximately 2,400 sites of care, including surgery centers, freestanding emergency rooms, urgent care centers and physician clinics in 20 states and the United Kingdom. As of 2024, HCA Healthcare is ranked #61 on the Fortune 500 rankings of the largest United States corporations by total revenue. In the 1990s, the company engaged in illegal accounting and other crimes that resulted in the payment of more than $2 billion in federal fines and other penalties, and the dismissal of the CEO Rick Scott by the board of directors. History Early years The Hospital Corporation of America (HCA) was founded in 1968 in Nashville, Tennessee, by Thomas F. Frist Sr., Thomas F. Frist Jr. and Jack C. Massey. The founders envisioned a company that would bring together hospitals to deliver patient-focused care while using the combined resources of the organization to strengthen hospitals and improve the practice of medicine. The company began with Nashville's Park View Hospital, which the elder Frist had founded in 1960 with other doctors and where he was serving as chief executive. The company included 11 hospitals when it filed its initial public offering on the New York Stock Exchange (NYSE) in 1969 and had 26 hospitals and 3,000 beds by the end of the year. Growth and merger The 1970s were characterized by rapid growth in the industry and for HCA Healthcare. In the early 1980s, the focus shifted to consolidation with HCA Healthcare acquiring General Care Corporation, General Health Services, Hospital Affiliates International and Health Care Corporation. By the end of 1981, the company operated 349 hospitals with more than 49,000 beds. Operating revenues had grown to $2.4 billion. In 1987, HCA Healthcare, which had grown to operate 463 hospitals (255 owned and 208 managed), spun off HealthTrust, a privately owned, 104-hospital company. Believing its stock was undervalued, the company completed a $5.1 billion leveraged management buyout led by chairman Thomas F. Frist Jr. in 1988. HCA Healthcare re-emerged as a public company in 1992. In February 1994, HCA Healthcare merged with Louisville, Kentucky-based Columbia Hospital Corporation, which earlier had acquired 73 hospitals of Galen Health Care from Humana, to form Columbia/HCA Healthcare Corporation. Related names of note include HCA International and Health Corporation of America. Columbia Hospital Corporation In 1988, Rick Scott and Richard Rainwater each put up $125,000 in working capital in their new company, Columbia Hospital Corporation; they borrowed the remaining money needed to purchase two struggling hospitals in El Paso for $60 million. Then they acquired a neighboring hospital and shut it down. Within a year, the remaining two were doing much better. By the end of 1989, Columbia Hospital Corporation owned four hospitals with a total of 833 beds. In 1992, Columbia made a stock purchase of Basic American Medical, which owned eight hospitals, primarily in southwestern Florida. In September 1993, Columbia did another stock purchase, worth $3.4 billion, of Galen Healthcare, which had been spun off by Humana Inc. several months earlier. At the time, Galen had approximately 90 hospitals. After the purchase, Galen stockholders had 82% of the stock in the combined company, with Scott still running the company. Recent history On November 17, 2006, HCA became a private company for the third time when it completed a merger in which the company was acquired by a private investor group including affiliates of Kohlberg Kravis Roberts and Bain Capital, together with Merrill Lynch and HCA Healthcare founder Thomas F. Frist Jr. The total transaction was valued at approximately $33 billion, making it the largest leveraged buyout in history at the time, eclipsing the 1989 buyout of RJR Nabisco. In May 2010, HCA announced that the corporation would once again go public with an expected $4.6-billion IPO as HCA Holdings, Inc. In March 2011, HCA sold 126.2 million shares for $30 each, raising about $3.79 billion, at that time, the largest private-equity backed IPO in U.S. history. In May 2017, the corporation was renamed HCA Healthcare. In December 2018, a historical marker was installed in the parking lot of HCA's Sarah Cannon Cancer Center in Nashville, formerly the location of HCA's first hospital, Park View Hospital. In 2018, the company was ranked No. 67 in the 2019 Fortune 500 list of the largest United States corporations by total revenue. In May 2021, the company finalized a deal with Google to develop healthcare algorithms using patient records. In August 2021, HCA announced a deal with venture capital firm General Catalyst to develop digital solutions to streamline workflows and improve patient care; as part of the deal, HCA sold its healthcare app development firm PatientKeeper to General Catalyst's portfolio company Commure. In April 2022, HCA Healthcare announced a $1.5 million partnership with Florida International University's Nicole Wertheim college of Nursing and Health Sciences, to expand its facilities to address the national nursing shortage. In October 2022, LCMC Health in partnership with Tulane University announced that it would acquire Tulane Medical Center, Lakeview Regional Medical Center, and Tulane Lakeside Hospital from HCA for $150 million pending regulatory approval. In March 2024, it was announced HCA had completed the sale of West Hills Hospital and Medical Center and related assets in Los Angeles, California to UCLA Health, for an undisclosed amount. Facilities United States As of 2024, HCA has 186 hospitals. They also report operating more than 2,400 additional sites of care, including surgery centers, freestanding ERs, urgent care centers, and physician clinics located in 20 U.S. states and in the United Kingdom. A significant portion of those hospitals are situated in Florida and Texas. As of 2022, HCA had 47 hospitals and 31 surgery centers in Florida, and 45 hospitals and 632 affiliated sites of care in Texas. In 2021, it announced plans to build 3 new hospitals in Florida. In 2022, The Dallas Morning News reported that HCA will build 5 new hospitals in Texas. They also have a strong presence in Tennessee, where it began. HCA had 13 hospitals there as of 2019. Between 2003 and 2017, HCA did not enter any new markets. However, in July 2007, HCA sold its hospitals in Switzerland. In 2017, HCA acquired the Memorial University Medical Center in Savannah, Georgia. That same year, they acquired three Houston, Texas, hospitals from Tenet Healthcare. In 2019 they purchased Mission Health System which operates hospitals in North Carolina. In January 2020, HCA Healthcare acquired Valify, a healthcare cost-management company. In May 2020, HCA acquired 49-bed Shands Starke (Fla.) Regional Medical Center and 25-bed Shands Live Oak (Fla.) Regional Medical Center from CHS. HCA is operating the two facilities as off-campus emergency departments of Lake City (Fla.) Medical Center and North Florida Regional Medical Center in Gainesville. Later that year, it signed an agreement to sell Garden Park Medical Center to Singing River Health System. In 2021, HCA sold Redmond Regional Medical Center to AdventHealth for $635M, and four other Georgia hospitals to Piedmont Healthcare for $950 million. They also announced the acquisition of Meadows Regional Medical Center. United Kingdom HCA International, the UK arm of Hospital Corporation of America, \"caters for around half of all private patients in London.\" The main hospital sites within the United Kingdom it operates include: It opened urgent care walk-in centres at London Bridge Hospital and the Portland Hospital in March 2018. It claims that patients, on average, wait just seven minutes to see a nurse and 17 minutes to see a doctor. In February 2022, outsourced cleaning staff at London Bridge Hospital reported a lack of PPE, no access to sick pay, a lack of training and no prior warning about which rooms may be contaminated with the virus through the COVID-19 pandemic. The Princess Grace Hospital specializes in breast cancer and surgery, aided by Kefah Mokbel and Nick Perry who, in 2005, founded The London Breast Institute. The company intends to open The Harborne Hospital, a new-built private hospital located close to the Queen Elizabeth Hospital, Birmingham, in January 2024. Significant areas of operation Medical education In recent years, HCA Healthcare has become a significant provider of clinical and medical education. It is the largest sponsor of graduate medical education programs in the U.S., with 56 teaching hospitals in 14 states, primarily in regions with a deficit of physician training programs. The company includes Research College of Nursing and Mercy School of Nursing, and has several advanced nursing simulation training centers. In early 2020, it completed the purchase of a majority stake in Galen College of Nursing, which operates 21 campuses in 12 states, offering Bachelor of Science and Associate of Science nursing degrees. Controversies Medicare billing practices lawsuit In 1993, lawsuits were filed against HCA by former employees who alleged that the company had engaged in questionable Medicare billing practices. In 1997, with a federal investigation by the FBI, the IRS and the Department of Health and Human Services in its early stages, the Columbia/HCA board of directors forced Rick Scott to resign as chairman and CEO amid growing evidence that the company \"had kept two sets of books, one to show the government and one with actual expenses listed.\" Thomas Frist, a co-founder of HCA and brother of U.S. Senator Bill Frist, returned to the company as CEO in 1997 and called on longtime friend and colleague Jack O. Bovender Jr. to help him turn the company around. The federal probe culminated in 2003 with \"the government receiving a total of over $2 billion in criminal fines and civil penalties for systematically defrauding federal health care programs.\" Columbia/HCA pleaded guilty to 14 felonies and admitted to systematically overcharging the government. The federal probe has been referred to as the longest and costliest investigation for health-care fraud in U.S. history. 2005 insider trading suit In July 2005, U.S. Senator Bill Frist sold all of his HCA shares, which were held in a blind trust, two weeks before disappointing earnings sent the stock on a 9-point plunge. At the time, Frist was considering a run for president and said that he had sold his shares to avoid the appearance of a conflict of interest. When the company disclosed that other executives had also sold their shares during that same time, shareholders alleged that the company had made false claims about its profits to drive up the price, which then fell when the company reported disappointing financial results. Eleven of HCA's senior officers were sued for accounting fraud and insider trading. HCA settled the lawsuit in August 2007, agreeing to pay $20 million to the shareholders but admitting no wrongdoing, and no charges were brought. COVID-19 PPE During the COVID-19 pandemic in the United States, HCA hospital nurses and other workers spoke out about the lack of PPE. In April 2020, there was an outcry against HCA following the deaths of two nurses Celia Yap-Banago and Rosa Luna who worked at HCA hospitals in Kansas City and California and had contracted coronavirus, despite the alarm having been raised about the lack of PPE at work. Mission Hospital Acquisition Complaints On December 14, 2023, the North Carolina Attorney General sued HCA for violating the terms of an agreement that allowed HCA to purchase Mission Health. On February 13, 2024, HCA Healthcare denied the allegations and asked a judge to dismiss the lawsuit by the Attorney General, and in return the hospital network filed a counterclaim against the Attorney General."
}