{
  "ticker": "HD",
  "cik": "0000354950",
  "company_name": "Home Depot (The)",
  "corrected_name": "The Home Depot",
  "wiki_title_used": "The Home Depot",
  "exists": true,
  "raw_text": "The Home Depot, Inc., often referred to as Home Depot, is an American multinational home improvement retail corporation which sells tools, construction products, appliances, and services including fuel and transportation rentals. Home Depot is the largest home improvement retailer in the United States. In 2021, the company had 490,600 employees and more than $151 billion in revenue. The company is headquartered in Cobb County, Georgia with an Atlanta mailing address.\nHome Depot operates many big-box format stores across the United States (including the District of Columbia, Guam, Puerto Rico and the U.S. Virgin Islands); all 10 provinces of Canada; and all 32 Mexican states and Mexico City. Interline Brands (The Home Depot Pro), a maintenance, repair, and operations company  is also owned by The Home Depot, with 70 distribution centers across the United States. It is the seventh largest United States–based employer globally.\n\nHistory\n1978–1999\nThe Home Depot was co-founded by Bernard Marcus, Arthur Blank, Ron Brill, Pat Farrah, and Ken Langone in 1978. The Home Depot's proposition was to build home-improvement superstores, larger than any of their competitors' facilities.  Investment banker Ken Langone helped Marcus and Blank to secure the necessary capital.\n\nOn June 22, 1979, the first two stores, built in spaces leased from J. C. Penney that were originally Treasure Island \"hypermarket\" (discount department and grocery) stores, opened in metro Atlanta (in Doraville and on Memorial Drive in Decatur, both near I-285). On September 22, 1981, The Home Depot went public on the NASDAQ, raising $4.093 million. The Home Depot joined the New York Stock Exchange on April 19, 1984.\nThe Home Depot began to branch out of Georgia to Florida in 1981 with stores opening in Hollywood and Fort Lauderdale. By 1984, The Home Depot was operating 19 stores with sales of over $256 million. To enter the Dallas market The Home Depot acquired Bowater Home Center from Bowater Inc. on October 31, 1984, for $40 million. The increased expansion of The Home Depot in the mid-1980s created financial difficulties with earnings falling by 42% and debt rising to $200 million. The financial difficulties of The Home Depot also caused the stock price to fall. To curb The Home Depot difficulties, it opened only 10 stores in 1986 with a stock offering of 2.99 million shares at $17 per share which helped The Home Depot to restructure its debts.\n\nIn 1989, The Home Depot became the largest home improvement store in the United States, surpassing Lowe's. In the 1990s, The Home Depot searched for ways to redefine its marketplace. The EXPO Design Center subsidiary was launched in 1991 to provide high-end products and design services. A 480-page book, Home Improvement 1-2-3, was published in 1995.\nIt opened its first Utah store in Riverdale on September 25, 1994, inaugurating a 102,000-square-foot retail space along with a 28,000-square-foot garden center and employing approximately 110 staff.\nThe Canadian hardware chain Aikenhead's Hardware was acquired by The Home Depot in 1994 for $150 million with a 75% share. All of the Aikenhead's Hardware stores were later converted to The Home Depot stores. By 1995, sales reached $10 billion while operating 350 stores. Former General Electric executive Robert Nardelli became CEO and president of The Home Depot in 2000.\n\n2000–2007\nSan Diego maintenance and repair supplies company Maintenance Warehouse was purchased by The Home Depot in 1997 for $245 million. Maintenance Warehouse was a leading direct-mail marketer of maintenance, repair and operations supplies that could reach customers out of reach by The Home Depot. Atlanta-based company Apex Supply was acquired by The Home Depot in 1999. Apex Supply is a wholesale distributor of plumbing, HVAC, industrial pipe and fittings. Apex Supply and Maintenance Warehouse stores were rebranded in 2004 as \"The Home Depot Supply\".\nIn 2004, Home Depot employees at a suburban Detroit store in Harper Woods, Michigan, rejected a bid to be represented by a labor union, voting 115 to 42 against joining the United Food and Commercial Workers. If the union had won, the Michigan store would have been the first Home Depot to have union representation.\nYour Other Warehouse, a large plumbing distributor with a focus on special order fulfillment, was acquired by The Home Depot in 2001. Your Other Warehouse also supplied two divisions of The Home Depot and the EXPO Design Centers. The \"EXPO Design Center\" division was reorganized in 2001 with three divisions based in the Northeast at South Plainfield, New Jersey, the West at Orange, California, and the Southeast at Atlanta, Georgia.\nThe Home Depot entered the Mexican market in 2002 with the acquisition of the home improvement chain Del Norte. In addition, The Home Depot had begun construction of stores in Mexicali and Tijuana. In the same year the Home Depot Landscape Supply was launched to integrate professional landscapers and upscale plants into a plant nursery retail chain. Home Depot Landscape Supply lasted only five years with only a few stores each in metro Atlanta and Dallas/Fort Worth. The Home Depot decided to close all Home Depot Landscape Supply stores in late 2007.\nIn September 2005, Home Depot Direct launched its online home-furnishings store, 10 Crescent Lane, shortly followed by the launch of \"Paces Trading Company\", its online lighting store. In mid-2006, the Home Depot acquired Home Decorators Collection, which was placed as an additional brand under its Home Depot Direct division.\nIn 2006, the Home Depot acquired Hughes Supply the largest home construction wholesaler in the United States for $3.2 billion. Hughes Supply was integrated into The Home Depot Supply to better serve business-to-business customers. The Home Depot Supply rebranded under the new name HD Supply in January 2007. Five months later, The Home Depot sold HD Supply to a consortium of three private equity firms, The Carlyle Group, Bain Capital and Clayton, Dubilier and Rice (with each agreeing to buy a one-third stake in the division).\n\n2007–present\nOn January 2, 2007, The Home Depot and Robert Nardelli mutually agreed on Nardelli's resignation as CEO after a six-year tenure. Nardelli resigned amid complaints about his heavy-handed management and whether his pay package of $123.7 million (excluding stock option grants) over the previous five years was excessive, considering the stock's poor performance versus its competitor Lowe's. His severance package of $210 million was criticized because when the stock went down, his pay went up.\nHis successor, Frank Blake, previously served as the company's vice chairman of the board and executive vice president. Blake agreed to a much more conservative compensation package than Nardelli, which is very heavily dependent upon the success of the company. Although a longtime deputy to Nardelli at GE and Home Depot, Blake was said to lack Nardelli's hard edge and instead preferred to make decisions by consensus. Indeed, Blake repudiated many of his predecessor's strategies, and it has been reported that the two men have not spoken since Nardelli departed Home Depot.\nIn 2008 and 2009, with the downturn in the housing market, The Home Depot announced the layoff of several thousand associates, as well as the closing of 54 stores nationwide, including the entire EXPO Design Center chain. Associates at EXPO were allowed to re-apply for Home Depot jobs after the layoffs, and did not lose any tenure if hired back. In the year of February 2009, sales totaled $71.288 billion, more than $20 billion down from the peak of two years earlier due to the sale of HD Supply and falling revenue at the retained business. In 2012, they proceeded to close the big-box style stores that they had in China, however, smaller stores that specialized in custom products and that focused on more intimate interactions between customers and associates remain open there. In 2013, The Home Depot established two large distribution centers in Atlanta and Los Angeles.\n\nIn August 2014, it was announced that Frank Blake would step down as CEO and would be replaced by 57-year-old Craig Menear. The change occurred on November 1, 2014. Blake continued with the company as chairman. Menear joined The Home Depot in 1997 and served in various management and vice-presidential positions, until 2003, including merchandising vice president of hardware, merchandising vice president of the Southwest Division, and divisional merchandise manager of the Southwest Division. He subsequently served as senior vice president of merchandising from August 2003 to April 2007. He then served as an executive vice president of merchandising from April 2007 to February 2014. Until becoming CEO, Menear served as president of U.S. Retail from February 2014 to November 1, 2014.\nThe company had a data breach in September 2014. One major reason for the data breach was the practice of entering credit card numbers directly into computers at the service-desk and pro-desk, and in specialty departments including flooring, kitchen cabinets, appliances, and millwork, rather than using POS credit card terminals directly. The practice was stopped, and Home Depot offered a year of free credit monitoring through AllClearID for any customers who requested it. There were also reports of credit card numbers being stolen when used to make purchases on Homedepot.com.\nOn July 22, 2015, Home Depot acquired Interline Brands from P2 Capital Partners, Goldman Sachs' private equity arm, and the management of Interline Brands for $1.6 billion. Interline Brands became fully integrated with The Home Depot in August 2016 with the Interline Brands website merging with The Home Depot website. The subsidiaries of Interline Brands are now companies of The Home Depot.\nIn 2017, Home Depot acquired the online presence of The Company Store from Hanover Direct. The Company Store was founded in 1911, operating primarily as a catalog and online sales operation, but with five physical locations. The five physical locations were not included in the deal. In December 2020, Home Depot bought back HD Supply for $8 billion. In January 2022, The Home Depot announced Craig Menear would be stepping down as the CEO and president effective March 1, 2022, while continuing to serve as the chairman of the board. He was replaced by former executive vice president Ted Decker.\nIn February 2023, Home Depot announced that it would spend $1 billion to raise hourly employee wages. On March 28, 2024 the company announced it would acquire SRS Distribution for $18.25 billion; SRS is based in McKinney, Texas. In turn, Home Depot agreed to buy Gypsum Management & Supply, Inc. (GMS) of Tucker, Georgia in late June 2025 for approximately $4.3 billion.The acquisition was finalized in September 2025.\n\nFinances\nAs of 2020, Home Depot is ranked No. 26 on the Fortune 500 rankings of the largest United States corporations by total revenue. In 2023, the company was ranked 67th in the Forbes Global 2000.\nFor the Q2 of 2020, the company reported sales of $38.1 billion, which represented a growth of 23.4% from the same period, the previous year. The net earnings for the period of three months (ending August 2) rose 27% up to $4.3 billion. The growth in the sales was a result of Americans staying at home as a result of the COVID-19 pandemic. In the Q3 for 2020, ending November 1, Home Depot reported a revenue of $33.5 billion; it represents a year-on-year increase of 24 per cent.\n\nMascot\nThe Home Depot's mascot has been Homer D. Poe since 1981 when he was first used in advertising. Gwyn Raker, the illustrator, says, \"I designed him to be a funny guy next door who wasn't intimidating.\" The Homer Fund, a for-associate charity, is named after the mascot, who since its creation, has been a part of Home Depot culture ever since. This includes signage, advertising, awards, and even a life-size costume for stores to rent out. Homer has a wife, named Daisy, and a dog, named Carl.\n\nOperation\nHome Depot stores average 105,000 ft2 (9,755 m2) in size and are organized warehouse-style, stocking a large range of supplies. Home Depot's two largest stores are located in Vauxhall, New Jersey, which encompasses 217,000 ft2 of space, and in Anaheim Hills, California, where it encompasses 204,000 ft2. The company color is a bright orange (PMS 165, CMYK 60M100Y, HEX FF6600), on signs, equipment and employee aprons.\n\nContractors\nContractors make up only  five percent of Home Depot's customers but they account for 45 percent of the companies $132 billion in annual sales. To address these contractor customers the company is building new flatbed distribution centers designed specifically to cater to builders that roll up in a contractor flatbed trucks.\n\nMarketing\nThe Home Depot announced the new slogan \"How Doers Get More Done\" on December 5, 2019, replacing the previous slogan \"More saving. More doing.\" which was introduced in the March 18, 2009, circular, replacing \"You can do it. We can help.\" which had been used since 2003. Other slogans used in the past 25 years include \"The Home Depot, Low prices are just the beginning\" in the early 1990s and \"When you're at the Home Depot, You'll feel right at home\" in the late 1990s and \"The Home Depot: First In Home Improvement!\" from 1999 to 2003.\n\nU.S. Stores division\nLong-time employee Marc Powers became the head of Home Depot's U.S. stores division in 2014. He took the place of Marvin Ellison, who left to become the chief executive of J.C. Penney. In January 2016, Home Depot announced the departure of Powers as division head, to be replaced by another veteran employee, Ann-Marie Campbell, one of Powers' deputies. The change in leadership is effective as of February 1, 2016. Ms. Campbell has been employed by Home Depot for over 30 years, beginning as a cashier in a branch in South Florida. Her most recent role was as president of Home Depot's Southern division.\n\nDistribution centers\nThe Home Depot has over 90 distribution centers throughout the United States to serve over 2,000 The Home Depot stores.\n\nOnline\nThe domain homedepot.com attracted at least 120 million visitors annually by 2008 according to a Compete.com survey. In the US HomeDepot.com has 5 Call centers located in Kennesaw, GA; Atlanta, GA; Marietta, GA; Ogden, UT; and Tempe, AZ. Home Depot online offers in-store pickup and online returns.\n\nFuel centers\nIn 2006, The Home Depot began testing fuel centers at some of its stores. The first two \"Home Depot Fuel\" convenience stores (C-Store) were located in Tennessee. Four additional prototype stores were built in Acworth, Georgia; Smyrna, Tennessee; Greensboro, Georgia; and Winchester, Tennessee. In 2012, Home Depot VP of Corporate Communication Stephen Holmes said that the company had no plans for additional fuel centers or growth in that area.\n\nTool, vehicle and equipment rental\nThe Home Depot offers tool, vehicle, and equipment rentals at most of its locations. Truck and van options include flatbed trucks, cargo vans, and box trucks in various sizes. Professional-quality construction, landscaping, and household equipment, ranging from hand tools to large machinery, are available. Rentals are offered in 4-hour, daily, weekly, and monthly terms.\n\nSubsidiaries and private brands\nWholly owned subsidiaries\nBlinds.com\nBlinds.com is an e-commerce retailer of window blinds and window coverings. Blinds.com was founded by Jay Steinfeld in 1993. By 2006, the company was named No. 186 on the Internet Retailer Top 500 Guide, as well as the 10th fastest-growing e-commerce company on the list. In 2009, Blinds.com was given the Marketer of the Year Award by the American Marketing Association, in recognition of its innovative marketing strategy. In response to demand for window coverings that could be installed quickly and easily, CMO Daniel Cotlar led a partnership with a manufacturing vendor to design a window shade that could be installed without tools or adhesive.  This led to the company's patent-pending Instafit shade product. In January 2014, Blinds.com was acquired by The Home Depot.\n\nCompact Power Equipment Inc.\nPower equipment rental company that prior to 2017 provided equipment to rental departments in over 1,000 Home Depots in North America. Acquired by The Home Depot on July 6, 2017.\n\nInterline Brands\nInterline Brands (renamed in 2018 as The Home Depot Pro) has over 90 distribution centers throughout the United States, Canada, and Puerto Rico that serve customer needs for MRO supplies.\nThe brands of Interline Brands include:\n\nWilmar Industries (MRO)\nBarnett (MRO, contractor supplies)\nMaintenance USA (MRO)\nSupplyWorks (janitorial, packaging, MRO)\nUS Lock (keys, security devices)\nHardware Express (hardware supplies)\nLeran Gas Products (propane accessories)\n\nThe Company Store\nOnline seller of textile and textile goods for the home decor market. Originally founded in 1911 as a purveyor of home furnishings, its online division—only—was acquired by THD in 2017.\n\nRedbeacon\nOnline contractor referral service founded in 2009; now called THD Pro Referral.\n\nHD Supply\nHD Supply is an industrial supply and distribution company. The company, formerly called The Maintenance Warehouse, provided infrastructure and construction support services for businesses throughout North America. Renamed as HD Supply, the business was re-acquired by THD in December 2020.\n\nExclusive brand names\nThe Home Depot exclusively carries several major brands: \n\nChem-Dry (carpet cleaning, upholstery cleaning, tile and grout services)\nBehr paints\nHomelite (outdoor and power tools)\nMartha Stewart Living Omnimedia (outdoor furniture, indoor organization)\nRyobi and Ridgid (power tools)\nAmerican Woodmark cabinetry\nThomasville Furniture Industries cabinetry\n\nHouse brands\nAdditionally, the retailer sells the following private-label house brands, although it does not manufacture any of the goods itself:\n\nCommercial Electric\nEverbilt\nGlacier Bay — kitchen sinks, faucets\nHampton Bay — ceiling fans, lighting fixtures, outdoor furniture\nHDX — a low-cost brand introduced in February 2012, replacing the Workforce brand  The quality of products sold under the brand has an overall negative review from Consumer Reports (2017), and mixed reviews on individual products (2022).\nHome Decorators Collection\nHusky\n\nCorporate affairs\nOwnership\nHome Depot is mainly owned by institutional investors, who own around 70% of shares. The largest shareholders in December 2023 were:\n\nThe Vanguard Group (9.49%)\nBlackRock (7.15%)\nState Street Corporation (4.35%)\nCapital World Investors (3.86%)\nGeode Capital Management (2.01%)\nMorgan Stanley (1.93%)\nCapital Research Global Investors (1.48%)\nBank of America (1.45%)\nCharles Schwab Corporation (1.33%)\nNorges Bank (1.25%)\n\nPhilanthropy\nThe Home Depot Foundation is the philanthropic arm of the company created in 2002. It has contributed over $200 million in time, labor, money, and supplies to a number of causes, including Habitat for Humanity, California-based City of Hope National Medical Center, and playground construction organization KaBOOM! Home Depot supports the U.S. Military community with a 10% military discount. Since 1993, the \"Team Depot\" program has provided grants to veteran-based organizations and has workers from a local store do volunteer work that would benefit veterans.\nThe Home Depot has partnered with the Georgia Emergency Management Agency's Ready Georgia campaign, leading both supplies and facility use to this statewide effort to increase emergency preparedness among Georgia's children. The company also provided ready kits and other prizes for an art and essay contest for Georgia elementary school students.\nIn March 2018, the company donated $50 million to train 20,000 people as construction workers over the next decade. The Home Builders Institute will use the money to train veterans and U.S. Army soldiers, high school students, and disadvantaged youth. The financial support from Home Depot was to help address the needs of the shortage of construction workers.\n\nEnvironmental record\nOn their website the company says they have a commitment to \"continue to lead by example, demonstrating to the world that sustainability business practices are not only possible, they are good for business.\" The Home Depot introduced a label on nearly 3,000 products in 2007. The label promotes energy conservation, sustainable forestry, and clean water. Home Depot executives said that as the world's largest buyer of construction material, their company had the power to persuade thousands of suppliers, homebuilders, and consumers to follow its lead on environment sustainability. \"Who in the world has a chance to have a bigger impact on this sector than Home Depot?\" asked Ron Jarvis, vice president for environmental innovation at Home Depot. This program is following The Home Depot's promise in the late 1990s to eliminate the number of sales of lumber from endangered forests in countries including Chile and Indonesia.\nAdditionally, The Home Depot promotes recycling compact fluorescent light bulbs in its stores. As part of this effort, the company created the largest recycling program in the United States for the bulbs.\nIn March 2013, Home Depot locations in Canada stopped accepting compact fluorescent light bulbs for recycling.\n\nTelevision\nIn 2002, The Home Depot joined PBS as a sponsor of This Old House and Ask This Old House. In 2003, The Home Depot became a sponsor for Trading Spaces.\n\nSports\nCompany co-founder Arthur Blank purchased the Atlanta Falcons franchise of the National Football League in February 2002; Blank later acquired an expansion franchise in Major League Soccer, Atlanta United FC, in April 2014 with the soccer club beginning play in March 2017. The Home Depot made no formal association with the Falcons until April 2017, when The Home Depot acquired the naming rights to the 11-acre (44,520 m2) park adjacent to Mercedes-Benz Stadium. The Home Depot Backyard occupies the site of the former Georgia Dome, and serves as parking and tailgating space during Falcons' and Atlanta United FC home games and public use greenspace during non-event days. The park opened on September 11, 2018. The Home Depot is a sponsor of the 2026 FIFA World Cup, which will take place in the United States, Canada, and Mexico.\n\nSince 1991, the company has become a large supporter of athletics, sponsoring the United States and Canadian Olympic teams, and launching a program which offered employment to athletes that accommodates their training and competition schedules. The Home Depot ceased to be a sponsor of the Canadian Olympic Team in 2005 and ended a sponsorship program for the United States Olympic team in 2009.\nThe Home Depot was a major sponsor for Joe Gibbs Racing in NASCAR from 1999 to 2014. Their arrival into the series coincided with Tony Stewart leaving the Indy Racing League to join the NASCAR Cup Series. Stewart drove The Home Depot-sponsored No. 20 car for Joe Gibbs Racing until 2008, winning 2 of his 3 series championships in the car, and was succeeded by Joey Logano, who took the car to victory lane twice. After Matt Kenseth joined the team, The Home Depot's status as the No. 20's primary sponsor was taken over by Dollar General, but the company still served as its most frequent secondary sponsor through its Husky Tools division. On June 23, 2014, the company announced it would end its NASCAR sponsorship after 2014.\n\nThe Home Depot was the title sponsor of The Home Depot Center in Carson, California, home to the Los Angeles Galaxy of Major League Soccer; the venue was formerly the home of Chivas USA of MLS, which folded in 2014, and the Los Angeles Riptide of Major League Lacrosse, which folded in 2008. The venue is now called Dignity Health Sports Park.\nIn 2006, The Home Depot partnered with Duke University's Edmund T. Pratt Jr. School of Engineering to create \"The Home Depot Smart Home\". The smart home is a live-in laboratory for ten upper-class engineering students that allows them to immerse themselves in the work. The goal of the project is to help provide innovative solutions for the home in areas such as security and home monitoring, communications, energy efficiency, entertainment, environment, and health. In January 2007, The Home Depot became the official home improvement sponsor of ESPN's College Gameday.\n\nPolitics\nSeventy-three percent of The Home Depot's campaign contributions went to Republican candidates in the 2005–2006 US elections. \"Home Depot's PAC gives money based on a candidate's voting record, committee assignment and leadership position,\" said company spokesman Jerry Shields. The CEO in this period was Bob Nardelli, a friend of U.S. President George W. Bush.  Nardelli hosted a garden reception/fundraiser for Bush at his Atlanta home on May 20, 2004.\nIn 2005, The Home Depot was among 53 entities that contributed the maximum of $250,000 to the second inauguration of President George W. Bush. According to the watchdog group Documented, in 2020, The Home Depot contributed $125,000 to the Rule of Law Defense Fund, a fundraising arm of the Republican Attorneys General Association.\nIn April 2021, Black faith leaders in Georgia called for a nationwide boycott of The Home Depot after the company did not take a stand against the Election Integrity Act of 2021. Georgia Governor Brian Kemp criticized the boycott, saying \"this insanity needs to stop\" and contending that it \"puts partisan politics ahead of people's paychecks.\"\nIn 2023, Home Depot Vice President of Asset Protection Scott Glenn urged Congress to pass legislation aimed at combating organized retail crime groups by testifying before the House Homeland Security Committee's Subcommittee on Counterterrorism, Law Enforcement and Intelligence. The bill was introduced to Congress in early 2024 and would serve to increase federal coordination with state and local law enforcement in the fight against retail crime.\n\nOutside the US\nCanada\nHome Depot Canada is the Canadian unit of the Home Depot and one of Canada's top home improvement retailers. The Canadian operation consists of 182 stores and employs over 28,000 people in Canada. Home Depot Canada has stores in all ten Canadian provinces and serves territorial Nunavut, Northwest Territories, and Yukon through electronic means (Online Sales). The Canadian head office is located in Toronto.\nThe Canadian unit was created with the purchase of Aikenhead's Hardware. Home Depot management had an ambitious plan to overtake its biggest competitor, RONA, which has about four times as many stores. However, some of RONA's stores are smaller than the typical Home Depot store. In terms of big box stores, the Home Depot has more stores than RONA (not including other Rona banners such as Réno-Dépôt or Cashway). As of 2007, RONA pulled ahead of The Home Depot in total retail sales, due to aggressive consolidation efforts by RONA, combined with the loss of The Home Depot's industrial supply division, HD Supply, in July 2007. The Home Depot faced competition from Lowe's after it entered the Canadian market at the end of 2007. In 2016, Lowe's purchased RONA, increasing its total store count to over 500 locations. In 2022, Lowe's announced it would sell its Canadian operations, including RONA, to Sycamore Partners.\nIn Quebec, where it has 22 stores, The Home Depot is branded simply Home Depot (using English words but without the definite article \"The\"). The Canadian operation is a participant in the voluntary Scanner Price Accuracy Code managed by the Retail Council of Canada.\n\nMexico\nThe Home Depot operates 140 stores and employs more than 18,000 associates as of early 2025, making it one of the largest retailers in Mexico since entering the market in 2001. The company expanded its presence in 2004 with the acquisition of Home Mart, then the second-largest home improvement retailer in Mexico.\nIn February 2025, The Home Depot announced it would invest $1.3 billion in Mexico over a three-year period, with plans to open five stores per year and generate 12,000 direct and indirect jobs.\n\nChina\nIn December 2006, The Home Depot announced its acquisition of the Chinese home improvement retailer The Home Way. The acquisition gave The Home Depot an immediate presence in China, with 12 stores in six cities. In April 2011, Home Depot shut its last Beijing store, the fifth Home Depot to close in China in the previous two years. In September 2012, The Home Depot announced it was closing all big box stores in China. The Home Depot retained two specialty stores in China, a Home Decorators Collection Store and a paint and flooring store.\nAs of September 16, 2012, all seven of the box stores in China had been shut down. The Home Depot has no immediate plans to further expand its specialty stores in China. The company is taking a \"wait-and-see\" attitude towards the Chinese market, but does not want to completely pull out because re-entry into the market would be very costly.\nThe Home Depot's lack of success in China has been attributed to the disconnect between The Home Depot's do-it-yourself ethos and Chinese culture. In 2012, The Home Depot conceded that it misread the country's appetite for do-it-yourself products. As a spokeswoman for the company said in an interview with the Wall Street Journal, \"The market trend says this is more of a do-it-for-me culture.\" Some have speculated that The Home Depot could have offered a do-it-for-me model to Chinese consumers. Chinese consumers prefer to see a finished product, such as a renovated room, rather than light bulbs and lumber. The same issue does not exist outside of China, especially in Canada, where Chinese Home Depot advertisements and store signage can be found in areas with large Chinese demographics.\n\nUnited Kingdom\nThere were reports that The Home Depot was interested in acquiring B&Q, the largest DIY retailer in the United Kingdom, Ireland, and China. B&Q had notably mimicked the design of Home Depot stores in the US when it introduced its large format \"Warehouse\" stores in the 1990s, even extending to changing its corporate colours to the same shade of orange as Home Depot. Speculation of a takeover began in 1999 when the retailer Asda was purchased by Walmart. The Home Depot would have to acquire Kingfisher plc, B&Q's parent company, to acquire B&Q. Kingfisher consists of several European DIY chains; however, the Home Depot was only interested in B&Q operations and says that it would dispose of the Castorama chain which operates in France, Italy, Poland and Russia. Talks ending in 2005 did not result in any takeover deal.\n\nSouth America\nIn 1993, Home Depot opened its first and only store in Peru, however, low sales and weak promotion for the brand led to its closure the following year. In 1997, Home Depot entered the Chilean and Argentine markets. While the venture was viewed with great optimism by founders Bernard Marcus and Arthur Blank, it eventually proved unprofitable. In October 2001, Chilean partners Falabella bought out Home Depot's share of the five Chilean Home Center stores and rebranded them Home Store. In 2003, after merging with Sodimac, all stores adopted that brand. The company has since expanded across Latin America very profitably and successfully. It's currently the largest home improvement company in South America. In 2002, Argentina's Home Depots were bought out by Chilean company Cencosud and rebranded Easy stores, a company that has also expanded across South America. It's the second largest home improvement company in South America.\n\nControversies\nWhistleblower case\nThe Home Depot was embroiled in whistleblower litigation brought under the Sarbanes-Oxley Act (SOX) law. In July 2005, former employee Michael Davis, represented by attorney Mark D. Schwartz, filed a whistleblower lawsuit against the Home Depot, alleging that his discharge was in retaliation for refusing to make unwarranted back charges against vendors. Davis alleges that the Home Depot forced its employees to meet a set quota of back charges to cover damaged or defective merchandise, forcing employees to make chargebacks to vendors for merchandise that was undamaged and not defective. The Home Depot alleges that it fired Davis for repeatedly failing to show up for work.\nThe trial initially was concluded in June 2006, but in April 2007, U.S. Department of Labor Judge Pamela Lakes Wood ordered the case reopened after the Home Depot's law firm Akin Gump Strauss Hauer & Feld revealed that the retail giant's in-house counsel had told them that two Home Depot employees who testified at the trial had lied. Akin Gump sent Wood a letter on September 29, 2006, in which the law firm requested that the testimony be stricken. In response to Akin Gump's revelation, Davis' attorney, Schwartz, asked for the case to be reopened to permit further questioning of the witnesses. On April 6, 2007, Wood ordered the case to be reopened.\nThe Home Depot settled the dispute. A stipulation of settlement dated March 28, 2008 was released. In the settlement, The Home Depot changed some of its corporate governance provisions. The Home Depot also agreed to pay the plaintiff's counsel $6 million in cash and $8.5 million in common stock.\n\nPatent law controversy\nPowell v. Home Depot USA, Inc. (2008cv61862) (2011) was a decision by the United States District Court for the Southern District of Florida concerning patent infringement on a \"safe hands\" device that Michael Powell, an independent contractor for Home Depot, created in response to injuries to the hands of associates using in-store radial arm saws. The district court jury returned a verdict in favor of Powell.\nIn 2011, Home Depot appealed against the decision to the United States Court of Appeals for the Federal Circuit, challenging the district court's denial of its renewed motion for judgment as a matter of law on the issues of infringement, willfulness, and damages. They also challenged the district court's claim construction, inequitable conduct, and attorney fees determinations. The appellate court found no inequitable conduct and insufficiently egregious misconduct on the part of Powell's attorney.\n\nTilt-up construction design of stores\nIn the wake of the 2011 Joplin tornado in which the walls of a Home Depot collapsed after being hit by an EF5 tornado, The Kansas City Star, citing engineers, criticized Home Depot's practice of using tilt-up construction in hundreds of its big-box stores (other nearby big-box stores in Joplin, including a Walmart and Academy Sports + Outdoors, which had concrete block construction, lost their roofs but the walls remained intact). In tilt-up construction, the concrete is poured onsite, lifted into place, and then attached to the roof. The engineers told the Star that the practice, while normally safe and efficient, is dangerous in major storms because once the roof is lifted (as happened in Joplin) the walls collapse in a domino effect. Seven people were killed in the front of the store when the 100,000-pound walls collapsed on them, while 28 people in the back of the store survived when those walls collapsed outward. Only two of the slab walls in the Home Depot survived. In contrast, three people died in the Walmart but 200 survived. Engineers noted that when concrete block construction fails, structural elements break in pieces and usually not in huge slabs. Home Depot said it fundamentally disagreed with the engineers quoted by the Star and said it would use tilt-up construction when it rebuilds the Joplin store.\n\nPayment-system breach\nOn September 2, 2014, security news reporter Brian Krebs reported that he was seeing evidence of credit card numbers linked to Home Depot purchases being sold online, which he concluded to suggest that The Home Depot's payment systems were breached by hackers. On September 8, 2014, Home Depot confirmed that their payment systems were compromised. According to their press release, this breach affected any customers who made purchases at any Home Depot store from April 2014 to September 2014. Home Depot offered its affected customers a free one-year credit monitoring service from AllClear ID. Also in their press release, they made sure to emphasize that there was no evidence to suggest that online customers were affected by the breach. On September 18, 2014, Home Depot released a statement saying that the hackers obtained a total of 56 million credit card numbers as a result of the breach. Since the breach, Home Depot has rolled out new encryption technology for its cash registers and self-checkout systems to protect customers. A class-action lawsuit was filed against the company.\nIn March 2016, Home Depot agreed to pay at least $19.5 million to compensate the more than 50 million consumers affected. The settlement terms included a $13 million fund to reimburse shoppers and a $6.5 million fund for cardholder identity protection services.\n\nEEOC disability discrimination suit\nIn September 2012, Home Depot agreed to pay $100,000 and furnish other relief to settle a disability discrimination lawsuit filed by the U.S. Equal Employment Opportunity Commission, for the alleged failure to provide a reasonable accommodation for a cashier with cancer at its Towson, Maryland, store and then for purportedly firing her because of her condition.\n\nLead paint\nIn December 2020, The Home Depot was fined $20.75 million for lead paint violations. Home Depot were accused of hiring contractors for their home renovation services who did not use proper lead abatement procedures during renovation projects.\n\nSee also\nMenards, privately held American chain of home improvement centers that competes with The Home Depot in the Midwestern United States.\n\nReferences\nExternal links\n\nHome Depot, Inc.; (corporate website)\nHome Depot USA; (retail website)\n'How I Built This'; podcast – live episode! The Home Depot: Arthur Blank – audio interview with co-founder\n\"Hampton Bay\".\nBusiness data for The Home Depot, Inc.:",
  "clean_text": "The Home Depot, Inc., often referred to as Home Depot, is an American multinational home improvement retail corporation which sells tools, construction products, appliances, and services including fuel and transportation rentals. Home Depot is the largest home improvement retailer in the United States. In 2021, the company had 490,600 employees and more than $151 billion in revenue. The company is headquartered in Cobb County, Georgia with an Atlanta mailing address. Home Depot operates many big-box format stores across the United States (including the District of Columbia, Guam, Puerto Rico and the U.S. Virgin Islands); all 10 provinces of Canada; and all 32 Mexican states and Mexico City. Interline Brands (The Home Depot Pro), a maintenance, repair, and operations company is also owned by The Home Depot, with 70 distribution centers across the United States. It is the seventh largest United States–based employer globally. History 1978–1999 The Home Depot was co-founded by Bernard Marcus, Arthur Blank, Ron Brill, Pat Farrah, and Ken Langone in 1978. The Home Depot's proposition was to build home-improvement superstores, larger than any of their competitors' facilities. Investment banker Ken Langone helped Marcus and Blank to secure the necessary capital. On June 22, 1979, the first two stores, built in spaces leased from J. C. Penney that were originally Treasure Island \"hypermarket\" (discount department and grocery) stores, opened in metro Atlanta (in Doraville and on Memorial Drive in Decatur, both near I-285). On September 22, 1981, The Home Depot went public on the NASDAQ, raising $4.093 million. The Home Depot joined the New York Stock Exchange on April 19, 1984. The Home Depot began to branch out of Georgia to Florida in 1981 with stores opening in Hollywood and Fort Lauderdale. By 1984, The Home Depot was operating 19 stores with sales of over $256 million. To enter the Dallas market The Home Depot acquired Bowater Home Center from Bowater Inc. on October 31, 1984, for $40 million. The increased expansion of The Home Depot in the mid-1980s created financial difficulties with earnings falling by 42% and debt rising to $200 million. The financial difficulties of The Home Depot also caused the stock price to fall. To curb The Home Depot difficulties, it opened only 10 stores in 1986 with a stock offering of 2.99 million shares at $17 per share which helped The Home Depot to restructure its debts. In 1989, The Home Depot became the largest home improvement store in the United States, surpassing Lowe's. In the 1990s, The Home Depot searched for ways to redefine its marketplace. The EXPO Design Center subsidiary was launched in 1991 to provide high-end products and design services. A 480-page book, Home Improvement 1-2-3, was published in 1995. It opened its first Utah store in Riverdale on September 25, 1994, inaugurating a 102,000-square-foot retail space along with a 28,000-square-foot garden center and employing approximately 110 staff. The Canadian hardware chain Aikenhead's Hardware was acquired by The Home Depot in 1994 for $150 million with a 75% share. All of the Aikenhead's Hardware stores were later converted to The Home Depot stores. By 1995, sales reached $10 billion while operating 350 stores. Former General Electric executive Robert Nardelli became CEO and president of The Home Depot in 2000. 2000–2007 San Diego maintenance and repair supplies company Maintenance Warehouse was purchased by The Home Depot in 1997 for $245 million. Maintenance Warehouse was a leading direct-mail marketer of maintenance, repair and operations supplies that could reach customers out of reach by The Home Depot. Atlanta-based company Apex Supply was acquired by The Home Depot in 1999. Apex Supply is a wholesale distributor of plumbing, HVAC, industrial pipe and fittings. Apex Supply and Maintenance Warehouse stores were rebranded in 2004 as \"The Home Depot Supply\". In 2004, Home Depot employees at a suburban Detroit store in Harper Woods, Michigan, rejected a bid to be represented by a labor union, voting 115 to 42 against joining the United Food and Commercial Workers. If the union had won, the Michigan store would have been the first Home Depot to have union representation. Your Other Warehouse, a large plumbing distributor with a focus on special order fulfillment, was acquired by The Home Depot in 2001. Your Other Warehouse also supplied two divisions of The Home Depot and the EXPO Design Centers. The \"EXPO Design Center\" division was reorganized in 2001 with three divisions based in the Northeast at South Plainfield, New Jersey, the West at Orange, California, and the Southeast at Atlanta, Georgia. The Home Depot entered the Mexican market in 2002 with the acquisition of the home improvement chain Del Norte. In addition, The Home Depot had begun construction of stores in Mexicali and Tijuana. In the same year the Home Depot Landscape Supply was launched to integrate professional landscapers and upscale plants into a plant nursery retail chain. Home Depot Landscape Supply lasted only five years with only a few stores each in metro Atlanta and Dallas/Fort Worth. The Home Depot decided to close all Home Depot Landscape Supply stores in late 2007. In September 2005, Home Depot Direct launched its online home-furnishings store, 10 Crescent Lane, shortly followed by the launch of \"Paces Trading Company\", its online lighting store. In mid-2006, the Home Depot acquired Home Decorators Collection, which was placed as an additional brand under its Home Depot Direct division. In 2006, the Home Depot acquired Hughes Supply the largest home construction wholesaler in the United States for $3.2 billion. Hughes Supply was integrated into The Home Depot Supply to better serve business-to-business customers. The Home Depot Supply rebranded under the new name HD Supply in January 2007. Five months later, The Home Depot sold HD Supply to a consortium of three private equity firms, The Carlyle Group, Bain Capital and Clayton, Dubilier and Rice (with each agreeing to buy a one-third stake in the division). 2007–present On January 2, 2007, The Home Depot and Robert Nardelli mutually agreed on Nardelli's resignation as CEO after a six-year tenure. Nardelli resigned amid complaints about his heavy-handed management and whether his pay package of $123.7 million (excluding stock option grants) over the previous five years was excessive, considering the stock's poor performance versus its competitor Lowe's. His severance package of $210 million was criticized because when the stock went down, his pay went up. His successor, Frank Blake, previously served as the company's vice chairman of the board and executive vice president. Blake agreed to a much more conservative compensation package than Nardelli, which is very heavily dependent upon the success of the company. Although a longtime deputy to Nardelli at GE and Home Depot, Blake was said to lack Nardelli's hard edge and instead preferred to make decisions by consensus. Indeed, Blake repudiated many of his predecessor's strategies, and it has been reported that the two men have not spoken since Nardelli departed Home Depot. In 2008 and 2009, with the downturn in the housing market, The Home Depot announced the layoff of several thousand associates, as well as the closing of 54 stores nationwide, including the entire EXPO Design Center chain. Associates at EXPO were allowed to re-apply for Home Depot jobs after the layoffs, and did not lose any tenure if hired back. In the year of February 2009, sales totaled $71.288 billion, more than $20 billion down from the peak of two years earlier due to the sale of HD Supply and falling revenue at the retained business. In 2012, they proceeded to close the big-box style stores that they had in China, however, smaller stores that specialized in custom products and that focused on more intimate interactions between customers and associates remain open there. In 2013, The Home Depot established two large distribution centers in Atlanta and Los Angeles. In August 2014, it was announced that Frank Blake would step down as CEO and would be replaced by 57-year-old Craig Menear. The change occurred on November 1, 2014. Blake continued with the company as chairman. Menear joined The Home Depot in 1997 and served in various management and vice-presidential positions, until 2003, including merchandising vice president of hardware, merchandising vice president of the Southwest Division, and divisional merchandise manager of the Southwest Division. He subsequently served as senior vice president of merchandising from August 2003 to April 2007. He then served as an executive vice president of merchandising from April 2007 to February 2014. Until becoming CEO, Menear served as president of U.S. Retail from February 2014 to November 1, 2014. The company had a data breach in September 2014. One major reason for the data breach was the practice of entering credit card numbers directly into computers at the service-desk and pro-desk, and in specialty departments including flooring, kitchen cabinets, appliances, and millwork, rather than using POS credit card terminals directly. The practice was stopped, and Home Depot offered a year of free credit monitoring through AllClearID for any customers who requested it. There were also reports of credit card numbers being stolen when used to make purchases on Homedepot.com. On July 22, 2015, Home Depot acquired Interline Brands from P2 Capital Partners, Goldman Sachs' private equity arm, and the management of Interline Brands for $1.6 billion. Interline Brands became fully integrated with The Home Depot in August 2016 with the Interline Brands website merging with The Home Depot website. The subsidiaries of Interline Brands are now companies of The Home Depot. In 2017, Home Depot acquired the online presence of The Company Store from Hanover Direct. The Company Store was founded in 1911, operating primarily as a catalog and online sales operation, but with five physical locations. The five physical locations were not included in the deal. In December 2020, Home Depot bought back HD Supply for $8 billion. In January 2022, The Home Depot announced Craig Menear would be stepping down as the CEO and president effective March 1, 2022, while continuing to serve as the chairman of the board. He was replaced by former executive vice president Ted Decker. In February 2023, Home Depot announced that it would spend $1 billion to raise hourly employee wages. On March 28, 2024 the company announced it would acquire SRS Distribution for $18.25 billion; SRS is based in McKinney, Texas. In turn, Home Depot agreed to buy Gypsum Management & Supply, Inc. (GMS) of Tucker, Georgia in late June 2025 for approximately $4.3 billion.The acquisition was finalized in September 2025. Finances As of 2020, Home Depot is ranked No. 26 on the Fortune 500 rankings of the largest United States corporations by total revenue. In 2023, the company was ranked 67th in the Forbes Global 2000. For the Q2 of 2020, the company reported sales of $38.1 billion, which represented a growth of 23.4% from the same period, the previous year. The net earnings for the period of three months (ending August 2) rose 27% up to $4.3 billion. The growth in the sales was a result of Americans staying at home as a result of the COVID-19 pandemic. In the Q3 for 2020, ending November 1, Home Depot reported a revenue of $33.5 billion; it represents a year-on-year increase of 24 per cent. Mascot The Home Depot's mascot has been Homer D. Poe since 1981 when he was first used in advertising. Gwyn Raker, the illustrator, says, \"I designed him to be a funny guy next door who wasn't intimidating.\" The Homer Fund, a for-associate charity, is named after the mascot, who since its creation, has been a part of Home Depot culture ever since. This includes signage, advertising, awards, and even a life-size costume for stores to rent out. Homer has a wife, named Daisy, and a dog, named Carl. Operation Home Depot stores average 105,000 ft2 (9,755 m2) in size and are organized warehouse-style, stocking a large range of supplies. Home Depot's two largest stores are located in Vauxhall, New Jersey, which encompasses 217,000 ft2 of space, and in Anaheim Hills, California, where it encompasses 204,000 ft2. The company color is a bright orange (PMS 165, CMYK 60M100Y, HEX FF6600), on signs, equipment and employee aprons. Contractors Contractors make up only five percent of Home Depot's customers but they account for 45 percent of the companies $132 billion in annual sales. To address these contractor customers the company is building new flatbed distribution centers designed specifically to cater to builders that roll up in a contractor flatbed trucks. Marketing The Home Depot announced the new slogan \"How Doers Get More Done\" on December 5, 2019, replacing the previous slogan \"More saving. More doing.\" which was introduced in the March 18, 2009, circular, replacing \"You can do it. We can help.\" which had been used since 2003. Other slogans used in the past 25 years include \"The Home Depot, Low prices are just the beginning\" in the early 1990s and \"When you're at the Home Depot, You'll feel right at home\" in the late 1990s and \"The Home Depot: First In Home Improvement!\" from 1999 to 2003. U.S. Stores division Long-time employee Marc Powers became the head of Home Depot's U.S. stores division in 2014. He took the place of Marvin Ellison, who left to become the chief executive of J.C. Penney. In January 2016, Home Depot announced the departure of Powers as division head, to be replaced by another veteran employee, Ann-Marie Campbell, one of Powers' deputies. The change in leadership is effective as of February 1, 2016. Ms. Campbell has been employed by Home Depot for over 30 years, beginning as a cashier in a branch in South Florida. Her most recent role was as president of Home Depot's Southern division. Distribution centers The Home Depot has over 90 distribution centers throughout the United States to serve over 2,000 The Home Depot stores. Online The domain homedepot.com attracted at least 120 million visitors annually by 2008 according to a Compete.com survey. In the US HomeDepot.com has 5 Call centers located in Kennesaw, GA; Atlanta, GA; Marietta, GA; Ogden, UT; and Tempe, AZ. Home Depot online offers in-store pickup and online returns. Fuel centers In 2006, The Home Depot began testing fuel centers at some of its stores. The first two \"Home Depot Fuel\" convenience stores (C-Store) were located in Tennessee. Four additional prototype stores were built in Acworth, Georgia; Smyrna, Tennessee; Greensboro, Georgia; and Winchester, Tennessee. In 2012, Home Depot VP of Corporate Communication Stephen Holmes said that the company had no plans for additional fuel centers or growth in that area. Tool, vehicle and equipment rental The Home Depot offers tool, vehicle, and equipment rentals at most of its locations. Truck and van options include flatbed trucks, cargo vans, and box trucks in various sizes. Professional-quality construction, landscaping, and household equipment, ranging from hand tools to large machinery, are available. Rentals are offered in 4-hour, daily, weekly, and monthly terms. Subsidiaries and private brands Wholly owned subsidiaries Blinds.com Blinds.com is an e-commerce retailer of window blinds and window coverings. Blinds.com was founded by Jay Steinfeld in 1993. By 2006, the company was named No. 186 on the Internet Retailer Top 500 Guide, as well as the 10th fastest-growing e-commerce company on the list. In 2009, Blinds.com was given the Marketer of the Year Award by the American Marketing Association, in recognition of its innovative marketing strategy. In response to demand for window coverings that could be installed quickly and easily, CMO Daniel Cotlar led a partnership with a manufacturing vendor to design a window shade that could be installed without tools or adhesive. This led to the company's patent-pending Instafit shade product. In January 2014, Blinds.com was acquired by The Home Depot. Compact Power Equipment Inc. Power equipment rental company that prior to 2017 provided equipment to rental departments in over 1,000 Home Depots in North America. Acquired by The Home Depot on July 6, 2017. Interline Brands Interline Brands (renamed in 2018 as The Home Depot Pro) has over 90 distribution centers throughout the United States, Canada, and Puerto Rico that serve customer needs for MRO supplies. The brands of Interline Brands include: Wilmar Industries (MRO) Barnett (MRO, contractor supplies) Maintenance USA (MRO) SupplyWorks (janitorial, packaging, MRO) US Lock (keys, security devices) Hardware Express (hardware supplies) Leran Gas Products (propane accessories) The Company Store Online seller of textile and textile goods for the home decor market. Originally founded in 1911 as a purveyor of home furnishings, its online division—only—was acquired by THD in 2017. Redbeacon Online contractor referral service founded in 2009; now called THD Pro Referral. HD Supply HD Supply is an industrial supply and distribution company. The company, formerly called The Maintenance Warehouse, provided infrastructure and construction support services for businesses throughout North America. Renamed as HD Supply, the business was re-acquired by THD in December 2020. Exclusive brand names The Home Depot exclusively carries several major brands: Chem-Dry (carpet cleaning, upholstery cleaning, tile and grout services) Behr paints Homelite (outdoor and power tools) Martha Stewart Living Omnimedia (outdoor furniture, indoor organization) Ryobi and Ridgid (power tools) American Woodmark cabinetry Thomasville Furniture Industries cabinetry House brands Additionally, the retailer sells the following private-label house brands, although it does not manufacture any of the goods itself: Commercial Electric Everbilt Glacier Bay — kitchen sinks, faucets Hampton Bay — ceiling fans, lighting fixtures, outdoor furniture HDX — a low-cost brand introduced in February 2012, replacing the Workforce brand The quality of products sold under the brand has an overall negative review from Consumer Reports (2017), and mixed reviews on individual products (2022). Home Decorators Collection Husky Corporate affairs Ownership Home Depot is mainly owned by institutional investors, who own around 70% of shares. The largest shareholders in December 2023 were: The Vanguard Group (9.49%) BlackRock (7.15%) State Street Corporation (4.35%) Capital World Investors (3.86%) Geode Capital Management (2.01%) Morgan Stanley (1.93%) Capital Research Global Investors (1.48%) Bank of America (1.45%) Charles Schwab Corporation (1.33%) Norges Bank (1.25%) Philanthropy The Home Depot Foundation is the philanthropic arm of the company created in 2002. It has contributed over $200 million in time, labor, money, and supplies to a number of causes, including Habitat for Humanity, California-based City of Hope National Medical Center, and playground construction organization KaBOOM! Home Depot supports the U.S. Military community with a 10% military discount. Since 1993, the \"Team Depot\" program has provided grants to veteran-based organizations and has workers from a local store do volunteer work that would benefit veterans. The Home Depot has partnered with the Georgia Emergency Management Agency's Ready Georgia campaign, leading both supplies and facility use to this statewide effort to increase emergency preparedness among Georgia's children. The company also provided ready kits and other prizes for an art and essay contest for Georgia elementary school students. In March 2018, the company donated $50 million to train 20,000 people as construction workers over the next decade. The Home Builders Institute will use the money to train veterans and U.S. Army soldiers, high school students, and disadvantaged youth. The financial support from Home Depot was to help address the needs of the shortage of construction workers. Environmental record On their website the company says they have a commitment to \"continue to lead by example, demonstrating to the world that sustainability business practices are not only possible, they are good for business.\" The Home Depot introduced a label on nearly 3,000 products in 2007. The label promotes energy conservation, sustainable forestry, and clean water. Home Depot executives said that as the world's largest buyer of construction material, their company had the power to persuade thousands of suppliers, homebuilders, and consumers to follow its lead on environment sustainability. \"Who in the world has a chance to have a bigger impact on this sector than Home Depot?\" asked Ron Jarvis, vice president for environmental innovation at Home Depot. This program is following The Home Depot's promise in the late 1990s to eliminate the number of sales of lumber from endangered forests in countries including Chile and Indonesia. Additionally, The Home Depot promotes recycling compact fluorescent light bulbs in its stores. As part of this effort, the company created the largest recycling program in the United States for the bulbs. In March 2013, Home Depot locations in Canada stopped accepting compact fluorescent light bulbs for recycling. Television In 2002, The Home Depot joined PBS as a sponsor of This Old House and Ask This Old House. In 2003, The Home Depot became a sponsor for Trading Spaces. Sports Company co-founder Arthur Blank purchased the Atlanta Falcons franchise of the National Football League in February 2002; Blank later acquired an expansion franchise in Major League Soccer, Atlanta United FC, in April 2014 with the soccer club beginning play in March 2017. The Home Depot made no formal association with the Falcons until April 2017, when The Home Depot acquired the naming rights to the 11-acre (44,520 m2) park adjacent to Mercedes-Benz Stadium. The Home Depot Backyard occupies the site of the former Georgia Dome, and serves as parking and tailgating space during Falcons' and Atlanta United FC home games and public use greenspace during non-event days. The park opened on September 11, 2018. The Home Depot is a sponsor of the 2026 FIFA World Cup, which will take place in the United States, Canada, and Mexico. Since 1991, the company has become a large supporter of athletics, sponsoring the United States and Canadian Olympic teams, and launching a program which offered employment to athletes that accommodates their training and competition schedules. The Home Depot ceased to be a sponsor of the Canadian Olympic Team in 2005 and ended a sponsorship program for the United States Olympic team in 2009. The Home Depot was a major sponsor for Joe Gibbs Racing in NASCAR from 1999 to 2014. Their arrival into the series coincided with Tony Stewart leaving the Indy Racing League to join the NASCAR Cup Series. Stewart drove The Home Depot-sponsored No. 20 car for Joe Gibbs Racing until 2008, winning 2 of his 3 series championships in the car, and was succeeded by Joey Logano, who took the car to victory lane twice. After Matt Kenseth joined the team, The Home Depot's status as the No. 20's primary sponsor was taken over by Dollar General, but the company still served as its most frequent secondary sponsor through its Husky Tools division. On June 23, 2014, the company announced it would end its NASCAR sponsorship after 2014. The Home Depot was the title sponsor of The Home Depot Center in Carson, California, home to the Los Angeles Galaxy of Major League Soccer; the venue was formerly the home of Chivas USA of MLS, which folded in 2014, and the Los Angeles Riptide of Major League Lacrosse, which folded in 2008. The venue is now called Dignity Health Sports Park. In 2006, The Home Depot partnered with Duke University's Edmund T. Pratt Jr. School of Engineering to create \"The Home Depot Smart Home\". The smart home is a live-in laboratory for ten upper-class engineering students that allows them to immerse themselves in the work. The goal of the project is to help provide innovative solutions for the home in areas such as security and home monitoring, communications, energy efficiency, entertainment, environment, and health. In January 2007, The Home Depot became the official home improvement sponsor of ESPN's College Gameday. Politics Seventy-three percent of The Home Depot's campaign contributions went to Republican candidates in the 2005–2006 US elections. \"Home Depot's PAC gives money based on a candidate's voting record, committee assignment and leadership position,\" said company spokesman Jerry Shields. The CEO in this period was Bob Nardelli, a friend of U.S. President George W. Bush. Nardelli hosted a garden reception/fundraiser for Bush at his Atlanta home on May 20, 2004. In 2005, The Home Depot was among 53 entities that contributed the maximum of $250,000 to the second inauguration of President George W. Bush. According to the watchdog group Documented, in 2020, The Home Depot contributed $125,000 to the Rule of Law Defense Fund, a fundraising arm of the Republican Attorneys General Association. In April 2021, Black faith leaders in Georgia called for a nationwide boycott of The Home Depot after the company did not take a stand against the Election Integrity Act of 2021. Georgia Governor Brian Kemp criticized the boycott, saying \"this insanity needs to stop\" and contending that it \"puts partisan politics ahead of people's paychecks.\" In 2023, Home Depot Vice President of Asset Protection Scott Glenn urged Congress to pass legislation aimed at combating organized retail crime groups by testifying before the House Homeland Security Committee's Subcommittee on Counterterrorism, Law Enforcement and Intelligence. The bill was introduced to Congress in early 2024 and would serve to increase federal coordination with state and local law enforcement in the fight against retail crime. Outside the US Canada Home Depot Canada is the Canadian unit of the Home Depot and one of Canada's top home improvement retailers. The Canadian operation consists of 182 stores and employs over 28,000 people in Canada. Home Depot Canada has stores in all ten Canadian provinces and serves territorial Nunavut, Northwest Territories, and Yukon through electronic means (Online Sales). The Canadian head office is located in Toronto. The Canadian unit was created with the purchase of Aikenhead's Hardware. Home Depot management had an ambitious plan to overtake its biggest competitor, RONA, which has about four times as many stores. However, some of RONA's stores are smaller than the typical Home Depot store. In terms of big box stores, the Home Depot has more stores than RONA (not including other Rona banners such as Réno-Dépôt or Cashway). As of 2007, RONA pulled ahead of The Home Depot in total retail sales, due to aggressive consolidation efforts by RONA, combined with the loss of The Home Depot's industrial supply division, HD Supply, in July 2007. The Home Depot faced competition from Lowe's after it entered the Canadian market at the end of 2007. In 2016, Lowe's purchased RONA, increasing its total store count to over 500 locations. In 2022, Lowe's announced it would sell its Canadian operations, including RONA, to Sycamore Partners. In Quebec, where it has 22 stores, The Home Depot is branded simply Home Depot (using English words but without the definite article \"The\"). The Canadian operation is a participant in the voluntary Scanner Price Accuracy Code managed by the Retail Council of Canada. Mexico The Home Depot operates 140 stores and employs more than 18,000 associates as of early 2025, making it one of the largest retailers in Mexico since entering the market in 2001. The company expanded its presence in 2004 with the acquisition of Home Mart, then the second-largest home improvement retailer in Mexico. In February 2025, The Home Depot announced it would invest $1.3 billion in Mexico over a three-year period, with plans to open five stores per year and generate 12,000 direct and indirect jobs. China In December 2006, The Home Depot announced its acquisition of the Chinese home improvement retailer The Home Way. The acquisition gave The Home Depot an immediate presence in China, with 12 stores in six cities. In April 2011, Home Depot shut its last Beijing store, the fifth Home Depot to close in China in the previous two years. In September 2012, The Home Depot announced it was closing all big box stores in China. The Home Depot retained two specialty stores in China, a Home Decorators Collection Store and a paint and flooring store. As of September 16, 2012, all seven of the box stores in China had been shut down. The Home Depot has no immediate plans to further expand its specialty stores in China. The company is taking a \"wait-and-see\" attitude towards the Chinese market, but does not want to completely pull out because re-entry into the market would be very costly. The Home Depot's lack of success in China has been attributed to the disconnect between The Home Depot's do-it-yourself ethos and Chinese culture. In 2012, The Home Depot conceded that it misread the country's appetite for do-it-yourself products. As a spokeswoman for the company said in an interview with the Wall Street Journal, \"The market trend says this is more of a do-it-for-me culture.\" Some have speculated that The Home Depot could have offered a do-it-for-me model to Chinese consumers. Chinese consumers prefer to see a finished product, such as a renovated room, rather than light bulbs and lumber. The same issue does not exist outside of China, especially in Canada, where Chinese Home Depot advertisements and store signage can be found in areas with large Chinese demographics. United Kingdom There were reports that The Home Depot was interested in acquiring B&Q, the largest DIY retailer in the United Kingdom, Ireland, and China. B&Q had notably mimicked the design of Home Depot stores in the US when it introduced its large format \"Warehouse\" stores in the 1990s, even extending to changing its corporate colours to the same shade of orange as Home Depot. Speculation of a takeover began in 1999 when the retailer Asda was purchased by Walmart. The Home Depot would have to acquire Kingfisher plc, B&Q's parent company, to acquire B&Q. Kingfisher consists of several European DIY chains; however, the Home Depot was only interested in B&Q operations and says that it would dispose of the Castorama chain which operates in France, Italy, Poland and Russia. Talks ending in 2005 did not result in any takeover deal. South America In 1993, Home Depot opened its first and only store in Peru, however, low sales and weak promotion for the brand led to its closure the following year. In 1997, Home Depot entered the Chilean and Argentine markets. While the venture was viewed with great optimism by founders Bernard Marcus and Arthur Blank, it eventually proved unprofitable. In October 2001, Chilean partners Falabella bought out Home Depot's share of the five Chilean Home Center stores and rebranded them Home Store. In 2003, after merging with Sodimac, all stores adopted that brand. The company has since expanded across Latin America very profitably and successfully. It's currently the largest home improvement company in South America. In 2002, Argentina's Home Depots were bought out by Chilean company Cencosud and rebranded Easy stores, a company that has also expanded across South America. It's the second largest home improvement company in South America. Controversies Whistleblower case The Home Depot was embroiled in whistleblower litigation brought under the Sarbanes-Oxley Act (SOX) law. In July 2005, former employee Michael Davis, represented by attorney Mark D. Schwartz, filed a whistleblower lawsuit against the Home Depot, alleging that his discharge was in retaliation for refusing to make unwarranted back charges against vendors. Davis alleges that the Home Depot forced its employees to meet a set quota of back charges to cover damaged or defective merchandise, forcing employees to make chargebacks to vendors for merchandise that was undamaged and not defective. The Home Depot alleges that it fired Davis for repeatedly failing to show up for work. The trial initially was concluded in June 2006, but in April 2007, U.S. Department of Labor Judge Pamela Lakes Wood ordered the case reopened after the Home Depot's law firm Akin Gump Strauss Hauer & Feld revealed that the retail giant's in-house counsel had told them that two Home Depot employees who testified at the trial had lied. Akin Gump sent Wood a letter on September 29, 2006, in which the law firm requested that the testimony be stricken. In response to Akin Gump's revelation, Davis' attorney, Schwartz, asked for the case to be reopened to permit further questioning of the witnesses. On April 6, 2007, Wood ordered the case to be reopened. The Home Depot settled the dispute. A stipulation of settlement dated March 28, 2008 was released. In the settlement, The Home Depot changed some of its corporate governance provisions. The Home Depot also agreed to pay the plaintiff's counsel $6 million in cash and $8.5 million in common stock. Patent law controversy Powell v. Home Depot USA, Inc. (2008cv61862) (2011) was a decision by the United States District Court for the Southern District of Florida concerning patent infringement on a \"safe hands\" device that Michael Powell, an independent contractor for Home Depot, created in response to injuries to the hands of associates using in-store radial arm saws. The district court jury returned a verdict in favor of Powell. In 2011, Home Depot appealed against the decision to the United States Court of Appeals for the Federal Circuit, challenging the district court's denial of its renewed motion for judgment as a matter of law on the issues of infringement, willfulness, and damages. They also challenged the district court's claim construction, inequitable conduct, and attorney fees determinations. The appellate court found no inequitable conduct and insufficiently egregious misconduct on the part of Powell's attorney. Tilt-up construction design of stores In the wake of the 2011 Joplin tornado in which the walls of a Home Depot collapsed after being hit by an EF5 tornado, The Kansas City Star, citing engineers, criticized Home Depot's practice of using tilt-up construction in hundreds of its big-box stores (other nearby big-box stores in Joplin, including a Walmart and Academy Sports + Outdoors, which had concrete block construction, lost their roofs but the walls remained intact). In tilt-up construction, the concrete is poured onsite, lifted into place, and then attached to the roof. The engineers told the Star that the practice, while normally safe and efficient, is dangerous in major storms because once the roof is lifted (as happened in Joplin) the walls collapse in a domino effect. Seven people were killed in the front of the store when the 100,000-pound walls collapsed on them, while 28 people in the back of the store survived when those walls collapsed outward. Only two of the slab walls in the Home Depot survived. In contrast, three people died in the Walmart but 200 survived. Engineers noted that when concrete block construction fails, structural elements break in pieces and usually not in huge slabs. Home Depot said it fundamentally disagreed with the engineers quoted by the Star and said it would use tilt-up construction when it rebuilds the Joplin store. Payment-system breach On September 2, 2014, security news reporter Brian Krebs reported that he was seeing evidence of credit card numbers linked to Home Depot purchases being sold online, which he concluded to suggest that The Home Depot's payment systems were breached by hackers. On September 8, 2014, Home Depot confirmed that their payment systems were compromised. According to their press release, this breach affected any customers who made purchases at any Home Depot store from April 2014 to September 2014. Home Depot offered its affected customers a free one-year credit monitoring service from AllClear ID. Also in their press release, they made sure to emphasize that there was no evidence to suggest that online customers were affected by the breach. On September 18, 2014, Home Depot released a statement saying that the hackers obtained a total of 56 million credit card numbers as a result of the breach. Since the breach, Home Depot has rolled out new encryption technology for its cash registers and self-checkout systems to protect customers. A class-action lawsuit was filed against the company. In March 2016, Home Depot agreed to pay at least $19.5 million to compensate the more than 50 million consumers affected. The settlement terms included a $13 million fund to reimburse shoppers and a $6.5 million fund for cardholder identity protection services. EEOC disability discrimination suit In September 2012, Home Depot agreed to pay $100,000 and furnish other relief to settle a disability discrimination lawsuit filed by the U.S. Equal Employment Opportunity Commission, for the alleged failure to provide a reasonable accommodation for a cashier with cancer at its Towson, Maryland, store and then for purportedly firing her because of her condition. Lead paint In December 2020, The Home Depot was fined $20.75 million for lead paint violations. Home Depot were accused of hiring contractors for their home renovation services who did not use proper lead abatement procedures during renovation projects."
}