{
  "ticker": "HIG",
  "cik": "0000874766",
  "company_name": "Hartford (The)",
  "corrected_name": "The Hartford",
  "wiki_title_used": "The Hartford",
  "exists": true,
  "raw_text": "The Hartford Insurance Group, Inc., usually known as The Hartford, is an American investment and insurance company. The Hartford is a Fortune 500 company headquartered in its namesake city of Hartford, Connecticut. It was ranked 160th in Fortune 500 in the year of 2020. The company's earnings are divided between property-and-casualty operations, group benefits and mutual funds.\nThe Hartford is the 13th-largest property and casualty insurance company in the United States. It sells products primarily through a network of agents and brokers, and has also been the auto and home insurance writer for AARP members for more than 25 years.\n\nHistory\nThe Hartford was founded in 1810 in Hartford, Connecticut. A group of local merchants gathered in a Hartford inn and, with working capital of $15,000, founded the Hartford Fire Insurance Company. The company survived some of the greatest peacetime tragedies in American history. After a huge fire destroyed New York's financial district in 1835, The Hartford's president, Eliphalet Terry, used his personal wealth to cover all the company's damage claims. Other catastrophic events included the Chicago fire of 1871 and the 1906 San Francisco earthquake and fire.\n\nThe Hartford Stag\nAlthough it is unknown exactly when the iconic symbol first appeared as The Hartford's logo, the earliest use on record is on the 1861 policy issued to Abraham Lincoln. It depicts a hart (a deer) fording (crossing) a stream. The company's logo was likely inspired by the seal of the city of Hartford, which in turn borrowed from the 17th-century seal of Hertford, England. By 1867, the logo began to echo the majestic stag depicted in Sir Edwin Landseer's 1851 painting, “The Monarch of the Glen.” The logo art and style have continued to shift throughout the years to adjust to the changing art and print needs, however, the stag remains a clear descendant of the “Monarch of the Glen.”\n\nAcquisitions, divestitures and related changes\n2025: The Hartford rebrands and reveals a new logo.\n2021: Chubb makes three takeover offers for The Hartford, but the offers were rejected on 28 April.\n2020: Castel Underwriting Europe B.V. has decided to acquire from The Hartford the renewal rights for a Navigators Europe book consisting mostly of Dutch naval freight, inland hull, land-based equipment and liability company.\n2019: Acquired Navigators, adding specialty products across 22 vertical markets, and offices in the United Kingdom, Continental Europe and Asia.\n2018, Acquired Y-Risk, a managing general underwriter specializing in economy risks, with managing general agencies across the U.S.\n2014: Sold its Japan annuities business to Orix Life Insurance Corp.\n2013: Sold its life insurance business to Prudential, retirement plans to MassMutual and a broker-dealer to AIG.\n2012: Announced it would focus on property and casualty insurance, group benefits and mutual funds, and would sell its wealth management businesses.\n2009: The company announced that it was withdrawing its business activities from Europe.\n2004: Purchased the Group Benefits Division of CNA Financial.  The division was based in Chicago, Illinois.\n2000: Reacquired all the shares of Hartford Life (HLI was delisted from the New York Stock Exchange in 2006).\n1997: Changed name from ITT-Hartford Group, Inc. to the Hartford Financial Services Group, Inc., and also issued an IPO for its Hartford Life business under the ticker symbol \"HLI.\"\n1995: ITT decided to streamline its operations and release some of its subsidiaries, and The Hartford became an independent entity once again, trading on the New York Stock Exchange under the symbol \"HIG.\"\n1970: The Hartford was acquired by ITT Corporation for $1.4 billion, at the time the largest corporate takeover in American history. The combined company was renamed ITT-Hartford Group, Inc.\n1959: Expanded into the life insurance business by acquiring The Columbian National Life Insurance Company in Boston, Massachusetts.\n1913: Formed the Hartford Accident and Indemnity Company to provide a wide variety of insurance coverage, including accident, automobile-liability, personal-damage, business-interruption and more.\n\nSee also\nGreat Fire of New York\nHartford Fire Insurance Co. v. California\nList of United States insurance companies\nThe Monarch of the Glen (painting), upon which the company logo is based\n\nReferences\nExternal links\nOfficial website\nBusiness data for The Hartford:",
  "clean_text": "The Hartford Insurance Group, Inc., usually known as The Hartford, is an American investment and insurance company. The Hartford is a Fortune 500 company headquartered in its namesake city of Hartford, Connecticut. It was ranked 160th in Fortune 500 in the year of 2020. The company's earnings are divided between property-and-casualty operations, group benefits and mutual funds. The Hartford is the 13th-largest property and casualty insurance company in the United States. It sells products primarily through a network of agents and brokers, and has also been the auto and home insurance writer for AARP members for more than 25 years. History The Hartford was founded in 1810 in Hartford, Connecticut. A group of local merchants gathered in a Hartford inn and, with working capital of $15,000, founded the Hartford Fire Insurance Company. The company survived some of the greatest peacetime tragedies in American history. After a huge fire destroyed New York's financial district in 1835, The Hartford's president, Eliphalet Terry, used his personal wealth to cover all the company's damage claims. Other catastrophic events included the Chicago fire of 1871 and the 1906 San Francisco earthquake and fire. The Hartford Stag Although it is unknown exactly when the iconic symbol first appeared as The Hartford's logo, the earliest use on record is on the 1861 policy issued to Abraham Lincoln. It depicts a hart (a deer) fording (crossing) a stream. The company's logo was likely inspired by the seal of the city of Hartford, which in turn borrowed from the 17th-century seal of Hertford, England. By 1867, the logo began to echo the majestic stag depicted in Sir Edwin Landseer's 1851 painting, “The Monarch of the Glen.” The logo art and style have continued to shift throughout the years to adjust to the changing art and print needs, however, the stag remains a clear descendant of the “Monarch of the Glen.” Acquisitions, divestitures and related changes 2025: The Hartford rebrands and reveals a new logo. 2021: Chubb makes three takeover offers for The Hartford, but the offers were rejected on 28 April. 2020: Castel Underwriting Europe B.V. has decided to acquire from The Hartford the renewal rights for a Navigators Europe book consisting mostly of Dutch naval freight, inland hull, land-based equipment and liability company. 2019: Acquired Navigators, adding specialty products across 22 vertical markets, and offices in the United Kingdom, Continental Europe and Asia. 2018, Acquired Y-Risk, a managing general underwriter specializing in economy risks, with managing general agencies across the U.S. 2014: Sold its Japan annuities business to Orix Life Insurance Corp. 2013: Sold its life insurance business to Prudential, retirement plans to MassMutual and a broker-dealer to AIG. 2012: Announced it would focus on property and casualty insurance, group benefits and mutual funds, and would sell its wealth management businesses. 2009: The company announced that it was withdrawing its business activities from Europe. 2004: Purchased the Group Benefits Division of CNA Financial. The division was based in Chicago, Illinois. 2000: Reacquired all the shares of Hartford Life (HLI was delisted from the New York Stock Exchange in 2006). 1997: Changed name from ITT-Hartford Group, Inc. to the Hartford Financial Services Group, Inc., and also issued an IPO for its Hartford Life business under the ticker symbol \"HLI.\" 1995: ITT decided to streamline its operations and release some of its subsidiaries, and The Hartford became an independent entity once again, trading on the New York Stock Exchange under the symbol \"HIG.\" 1970: The Hartford was acquired by ITT Corporation for $1.4 billion, at the time the largest corporate takeover in American history. The combined company was renamed ITT-Hartford Group, Inc. 1959: Expanded into the life insurance business by acquiring The Columbian National Life Insurance Company in Boston, Massachusetts. 1913: Formed the Hartford Accident and Indemnity Company to provide a wide variety of insurance coverage, including accident, automobile-liability, personal-damage, business-interruption and more."
}