{
  "ticker": "HII",
  "cik": "0001501585",
  "company_name": "Huntington Ingalls Industries",
  "corrected_name": "Huntington Ingalls Industries",
  "wiki_title_used": "Huntington Ingalls Industries",
  "exists": true,
  "raw_text": "Huntington Ingalls Industries, Inc. (HII) is the largest military shipbuilding company in the United States as well as a provider of professional services to partners in government and industry. HII was formed on 31 March 2011, as a divestiture from  Northrop Grumman.\nHII comprises three divisions: Newport News Shipbuilding in Virginia, Ingalls Shipbuilding in Mississippi, and Mission Technologies.\nIn April 2022, Huntington Ingalls Industries changed its branding name to HII.\n\nHistory\nWhen it spun off as a new company on 31 March 2011, Huntington Ingalls Industries comprised Northrop Grumman’s shipbuilding businesses in Newport News, Virginia, Pascagoula, Mississippi, and Avondale, Louisiana; Avondale was closed in 2014.\nSince its creation, HII has built and expanded its professional and government services through the acquisitions of UniversalPegasus International, the S.M. Stoller Corporation, Camber Corporation, Novonics, the Columbia Group's Engineering Solutions division, G2 Inc., Alion Science and Technology, and Fulcrum IT Services.\nIn 2016, HII established a third division, Technical Solutions (now Mission Technologies), comprising the company's services capabilities. HII’s Mission Technologies division is headquartered in McLean, Virginia, with more than 100 facilities across the globe.\nHII is named for the founders of its shipbuilding divisions: Collis Potter Huntington, who founded Newport News Shipbuilding and Drydock Company, and Robert Ingersoll Ingalls Sr., who established Ingalls Shipbuilding.\nOn October 10, 2024, the People's Republic of China announced sanctions on three U.S. military-industrial companies and 10 Americans, including Huntington Ingalls Industries and its president and CEO Christopher D. Kastner, for participating in arms sales to Taiwan.\n\nDivisions\nNewport News Shipbuilding, Newport News, Virginia (U.S. Navy nuclear aircraft carriers, submarines, refueling and complex overhaul, carrier inactivation)\nIngalls Shipbuilding, Pascagoula, Mississippi (U.S. Navy surface combatants, amphibious warships, and U.S. Coast Guard National Security Cutters)\nMission Technologies, (U.S. unified combatant command support, U.S. Navy fleet support, USAF and Air National Guard training support, software engineering and IT solutions, cybersecurity, other DoD training, unmanned systems, intelligence analysis, Department of Energy nuclear operations, nuclear fabrication, oil and gas services)\n\nIngalls Shipbuilding\nIn 1938, Ingalls Shipbuilding Corporation was founded by Robert Ingersoll Ingalls Sr. (1882–1951), on the East Bank of the Pascagoula River in Mississippi. It started out building commercial ships until the 1950s, when Ingalls started bidding on Navy work.\nEmploying more than 11,000 employees, HII's Ingalls Shipbuilding is the largest manufacturing employer in Mississippi and a major contributor to the economic growth of Alabama. For 85 years, Ingalls has designed, built and maintained amphibious ships, destroyers, and cutters for the U.S. Navy and the U.S. Coast Guard. The largest supplier of U.S. Navy surface combatants, Ingalls is simultaneously building four classes of ships.\nKari Wilkinson is executive vice president of HII and president of Ingalls Shipbuilding. Named to this position in April 2021, she is responsible for all programs and operations at Ingalls, including the U.S. Navy’s amphibious assault and surface combatant ship programs.\n\nNewport News Shipbuilding\nFounded in 1886, HII's Newport News Shipbuilding, headquartered in Newport News, Virginia, is the nation’s sole designer, builder and refueler of nuclear-powered aircraft carriers and one of only two shipyards capable of designing and building nuclear-powered submarines. The division's legacy of “Always Good Ships,” includes the design, construction, overhaul and repair of more than 800 ships for the U.S. Navy and commercial customers.\nJennifer Boykin is president of Newport News Shipbuilding and executive vice president of HII. Named to this position in 2017, she is the 20th person and the first woman to serve as president of the Newport News shipyard, which has approximately $5.8 billion in annual revenues.\n\nFacilities\nHII operates facilities in several key locations across the US:\n\nNewport News Shipbuilding, Newport News, Virginia (nuclear-powered aircraft carriers and submarines, refueling and complex overhaul, aircraft carrier inactivation)\nIngalls Shipbuilding, Pascagoula, Mississippi (U.S. Navy surface combatants, amphibious assault ships; U.S. Coast Guard national security cutters)\nVirginia Beach, Virginia (fleet support, training)\nSan Diego, California (fleet support and repair)\nHuntsville, Alabama (modeling and simulation, training, professional services)\nFairfax, Virginia (IT and cybersecurity services)\n\nFormer facilities\nGulfport, Mississippi (composite R&D, composite components)\nTallulah, Louisiana (components and subassemblies, closed in 2011)\nWaggaman, Louisiana (closed in 2011)\nAvondale Shipyard, New Orleans, Louisiana (amphibs, auxiliaries, closed in October 2014)\n\nProjects\nIn 2023, HII received $5.4 billion in new contract awards, resulting in a backlog of approximately $49 billion.\n\nGerald R. Ford-class aircraft carriers\nAs the nation’s sole designer, builder of nuclear-powered aircraft carriers, HII is currently designing and building the next-generation of aircraft carriers – the Gerald R. Ford class, the first new design for an aircraft carrier in decades – that use new technologies to provide the U.S. Navy with a highly flexible and survivable platform to meet the operational needs of the 21st century with increased power and reduced manning. The company is to build ten Gerald R. Ford-class aircraft carriers for the U.S. Navy and is scheduled to deliver one carrier every five years starting in 2015.\n\nIn 2019, the U.S. Navy awarded HII a $15.2 billion block contract for the detail design and construction of Enterprise (CVN-80) and Doris Miller (CVN-81).\n\nAircraft Carrier Refueling and Complex Overhaul (RCOH)\nHII's Newport News Shipbuilding is the only shipyard to perform refueling and complex overhaul (RCOH) work on aircraft carriers. This massive undertaking was described in a 2002 Rand Study as one of the most challenging engineering and industrial tasks undertaken anywhere by any organization.\nThe multi-year project is performed only once during a carrier’s 50-year life and includes refueling of the ship’s two nuclear reactors, as well as significant repair, upgrade and modernization work. HII have completed the refueling and complex overhaul of the first six ships of the Nimitz-class, USS Nimitz (CVN 68), USS Dwight D. Eisenhower (CVN 69), USS Carl Vinson (CVN 70), USS Theodore Roosevelt (CVN 71), USS Abraham Lincoln (CVN 72) and USS George Washington (CVN 73). As of 2024, HII is performing this work on the seventh ship in the class, USS John C. Stennis (CVN 74).\n\nAircraft carrier inactivation\nNewport News Shipbuilding also offers inactivation services for nuclear-powered aircraft carriers. In 2018, NNS successfully completed the inactivation of Enterprise (CVN 65), which began in 2013. The NNS-built Enterprise was the world’s first nuclear-powered aircraft carrier and the only ship of its class.\n\nColumbia-class submarines\nHII's Newport News Shipbuilding is a major shipbuilding partner in the Columbia-class program, constructing and delivering six module sections per submarine under contract to General Dynamics Electric Boat to support the Navy’s plan to replace the aging Ohio-class.\nThe new submarines will make up one leg of the U.S. strategic nuclear deterrent triad. The 561-foot-long submarines will include a new life-of-ship reactor, an electric drive propulsion system and field 16 Trident II D5 ballistic missiles.\nBuilding on the success of the Virginia-class submarine program, NNS is participating in the construction of 12 Columbia-class submarines with Electric Boat as the prime contractor. Newport News Shipbuilding is manufacturing major Columbia-class assemblies and modules, including the bow, stern, auxiliary machinery room, superstructure and weapons modules.\n\nVirginia-class attack submarines\nHII's Newport News Shipbuilding is one of only two U.S. shipyards capable of designing and building nuclear-powered submarines. Currently, NNS is building the most advanced attack submarines in the world—the Virginia class.\nDesigned to meet the Navy’s requirements in a post-Cold War era, Virginia-class submarines use advanced technologies to increase firepower, maneuverability and stealth. The submarines are capable of submerged speeds of more than 25 knots and can stay submerged for up to three months at a time.\nUnder an innovative agreement, Newport News Shipbuilding is producing these submarines as part of a teaming agreement with General Dynamics Electric Boat.\nPrior to the Virginia-class, Newport News Shipbuilding designed the Los Angeles-class submarines and constructed 29 of the 62 boats built.\n\nAmerica-class amphibious assault ships\nUSS America (LHA 6) was delivered in April 2014 and commissioned 11 October 2014. It is first in the new class of amphibious assault ships for the U.S. Navy, replacing USS Tarawa (LHA 1). Ingalls’ next ship in the class, Tripoli (LHA 7), was delivered to the Navy on 28 February 2020. The ship was christened on 16 September 2017.\nOn 16 June 2017, Ingalls Shipbuilding was awarded $3.1 billion contract to build Bougainville (LHA 8). Construction started on LHA 8 on 15 October 2018, and the ship's keel was laid on 13 March 2019.\n\nArleigh Burke-class destroyers\nOn 27 September 2018, Ingalls Shipbuilding won a $5.1 billion multi-year contract to build an additional six DDG-51s. These destroyers are equipped with the Navy's Aegis Combat System. The first Flight III ship, Jack. H. Lucas (DDG-125), started fabrication on 7 May 2018. Ingalls has built and delivered 31 ships to the U.S. Navy, with four more under construction. Paul Ignatius (DDG-117), is scheduled for commissioning on 27 July in Fort Lauderdale, Florida.\n\nAmphibious ships\nHII builds LPD 17 San Antonio and LHA America classes of amphibious warships. Designed and built for survivability and flexibility, U.S. Navy amphibious warships are unique combat warships that make possible complex joint U.S. military operations to respond swiftly to crisis anywhere in the world, from deterrence and major combat operations to humanitarian assistance and disaster relief.\n\nLPD San Antonio-class\nHII's Ingalls Shipbuilding is building the entire San Antonio class of ships, the newest addition to the Navy's 21st century amphibious assault force. LPDs 17 to 28 have been delivered to the U.S. Navy. The latest, USS Fort Lauderdale (LPD 28), was delivered in March 2022.\nIn March 2023, Ingalls received a $1.3 billion modification to a previously awarded contract from the U.S. Navy for the procurement of the detail design and construction of amphibious transport dock LPD 32. The ship will be the 16th in the San Antonio class and the third Flight II LPD.\n\nLHA 6 America-class\nThe America-class LHA ships are a variant of the extremely successful Wasp-class LHD amphibious assault ships that are presently serving as workhorses in the U. S. Navy fleet. Also known as “Large Deck amphibious ships,” they are the centerpieces of amphibious ready groups and a U.S. Marine Corps Air-Ground Task Force.\n\nHII's Ingalls Shipbuilding has delivered two America-class amphibious assault ships to the U.S. Navy: America (LHA 6) in April 2014, and Tripoli (LHA 7) in February 2020.\n\nU.S. Coast Guard National Security Cutters\nHII's Ingalls Shipbuilding provides the U.S. Coast Guard with Legend-class National Security Cutters, the flagships of the Coast Guard's cutter fleet. They are designed to replace the 378-foot Hamilton-class high-endurance cutters, which entered service during the 1960s. The National Security Cutter is the first new design for the service in 20 years.\nThe current Program of Record is for 11 ships, of which the first nine have been successfully delivered to the U.S. Coast Guard. Ingalls' ninth NSC, Stone (WMSL 758), was delivered in November 2020.\nIn December 2018, Ingalls received two contracts from the U.S. Coast Guard to build a 10th and 11th NSC. The contracts are valued at $468.75 million and $462.13 million, respectively. On June 5, 2025, the Secretary of Homeland Security cancelled the 11th cutter's contract due to continued delays past the 2024 delivery date.\n\nUnmanned Systems\nHII creates advanced unmanned solutions for defense, marine research and commercial applications. Serving customers in more than 30 countries, HII provides design, autonomy, manufacturing, testing, operations and sustainment of unmanned systems, including unmanned underwater vehicles (UUVs) and unmanned surface vessels (USVs). The company's REMUS UUVs - world-leading, untethered, autonomous marine robots - carry advanced sensors and payloads to collect valuable data for a variety of applications.\n\nMission Technologies contracts\nIn August 2023, HII's Mission Technologies division received its largest contract win through the $1.4 billion Joint Network Engineering and Emerging Operations (J-NEEO) task order.\nHII's Mission Technologies also celebrated other several large contract wins:\n\n1.3 billion to support the U.S. Africa Command (AFRICOM) Personnel Recovery Enterprise Services and Solutions (PRESS) task order\nA $995 million contract to provide Advisory and Assistance Services (A&AS) for the U.S. Air Forces in Europe-Air Forces Africa (USAFE-AFAFRICA)\nA $242 million contract to provide shore-based training, engineering and development support (SBEDS) for the U.S. Navy\n\nVertical Launch Support\nIn April 2024, Mission Technologies was awarded a contract by the U.S. Navy to analyse, research and develop enhanced capabilities for the Mk 41 and Mk 57 vertical launching systems (VLS) onboard U.S. Navy surface ships. HII is also to equip the first Zumwalt-class destroyer (DDG 1001) with a universal electronics module for the Mk 57 vertical launch system.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Huntington Ingalls Industries, Inc.:",
  "clean_text": "Huntington Ingalls Industries, Inc. (HII) is the largest military shipbuilding company in the United States as well as a provider of professional services to partners in government and industry. HII was formed on 31 March 2011, as a divestiture from Northrop Grumman. HII comprises three divisions: Newport News Shipbuilding in Virginia, Ingalls Shipbuilding in Mississippi, and Mission Technologies. In April 2022, Huntington Ingalls Industries changed its branding name to HII. History When it spun off as a new company on 31 March 2011, Huntington Ingalls Industries comprised Northrop Grumman’s shipbuilding businesses in Newport News, Virginia, Pascagoula, Mississippi, and Avondale, Louisiana; Avondale was closed in 2014. Since its creation, HII has built and expanded its professional and government services through the acquisitions of UniversalPegasus International, the S.M. Stoller Corporation, Camber Corporation, Novonics, the Columbia Group's Engineering Solutions division, G2 Inc., Alion Science and Technology, and Fulcrum IT Services. In 2016, HII established a third division, Technical Solutions (now Mission Technologies), comprising the company's services capabilities. HII’s Mission Technologies division is headquartered in McLean, Virginia, with more than 100 facilities across the globe. HII is named for the founders of its shipbuilding divisions: Collis Potter Huntington, who founded Newport News Shipbuilding and Drydock Company, and Robert Ingersoll Ingalls Sr., who established Ingalls Shipbuilding. On October 10, 2024, the People's Republic of China announced sanctions on three U.S. military-industrial companies and 10 Americans, including Huntington Ingalls Industries and its president and CEO Christopher D. Kastner, for participating in arms sales to Taiwan. Divisions Newport News Shipbuilding, Newport News, Virginia (U.S. Navy nuclear aircraft carriers, submarines, refueling and complex overhaul, carrier inactivation) Ingalls Shipbuilding, Pascagoula, Mississippi (U.S. Navy surface combatants, amphibious warships, and U.S. Coast Guard National Security Cutters) Mission Technologies, (U.S. unified combatant command support, U.S. Navy fleet support, USAF and Air National Guard training support, software engineering and IT solutions, cybersecurity, other DoD training, unmanned systems, intelligence analysis, Department of Energy nuclear operations, nuclear fabrication, oil and gas services) Ingalls Shipbuilding In 1938, Ingalls Shipbuilding Corporation was founded by Robert Ingersoll Ingalls Sr. (1882–1951), on the East Bank of the Pascagoula River in Mississippi. It started out building commercial ships until the 1950s, when Ingalls started bidding on Navy work. Employing more than 11,000 employees, HII's Ingalls Shipbuilding is the largest manufacturing employer in Mississippi and a major contributor to the economic growth of Alabama. For 85 years, Ingalls has designed, built and maintained amphibious ships, destroyers, and cutters for the U.S. Navy and the U.S. Coast Guard. The largest supplier of U.S. Navy surface combatants, Ingalls is simultaneously building four classes of ships. Kari Wilkinson is executive vice president of HII and president of Ingalls Shipbuilding. Named to this position in April 2021, she is responsible for all programs and operations at Ingalls, including the U.S. Navy’s amphibious assault and surface combatant ship programs. Newport News Shipbuilding Founded in 1886, HII's Newport News Shipbuilding, headquartered in Newport News, Virginia, is the nation’s sole designer, builder and refueler of nuclear-powered aircraft carriers and one of only two shipyards capable of designing and building nuclear-powered submarines. The division's legacy of “Always Good Ships,” includes the design, construction, overhaul and repair of more than 800 ships for the U.S. Navy and commercial customers. Jennifer Boykin is president of Newport News Shipbuilding and executive vice president of HII. Named to this position in 2017, she is the 20th person and the first woman to serve as president of the Newport News shipyard, which has approximately $5.8 billion in annual revenues. Facilities HII operates facilities in several key locations across the US: Newport News Shipbuilding, Newport News, Virginia (nuclear-powered aircraft carriers and submarines, refueling and complex overhaul, aircraft carrier inactivation) Ingalls Shipbuilding, Pascagoula, Mississippi (U.S. Navy surface combatants, amphibious assault ships; U.S. Coast Guard national security cutters) Virginia Beach, Virginia (fleet support, training) San Diego, California (fleet support and repair) Huntsville, Alabama (modeling and simulation, training, professional services) Fairfax, Virginia (IT and cybersecurity services) Former facilities Gulfport, Mississippi (composite R&D, composite components) Tallulah, Louisiana (components and subassemblies, closed in 2011) Waggaman, Louisiana (closed in 2011) Avondale Shipyard, New Orleans, Louisiana (amphibs, auxiliaries, closed in October 2014) Projects In 2023, HII received $5.4 billion in new contract awards, resulting in a backlog of approximately $49 billion. Gerald R. Ford-class aircraft carriers As the nation’s sole designer, builder of nuclear-powered aircraft carriers, HII is currently designing and building the next-generation of aircraft carriers – the Gerald R. Ford class, the first new design for an aircraft carrier in decades – that use new technologies to provide the U.S. Navy with a highly flexible and survivable platform to meet the operational needs of the 21st century with increased power and reduced manning. The company is to build ten Gerald R. Ford-class aircraft carriers for the U.S. Navy and is scheduled to deliver one carrier every five years starting in 2015. In 2019, the U.S. Navy awarded HII a $15.2 billion block contract for the detail design and construction of Enterprise (CVN-80) and Doris Miller (CVN-81). Aircraft Carrier Refueling and Complex Overhaul (RCOH) HII's Newport News Shipbuilding is the only shipyard to perform refueling and complex overhaul (RCOH) work on aircraft carriers. This massive undertaking was described in a 2002 Rand Study as one of the most challenging engineering and industrial tasks undertaken anywhere by any organization. The multi-year project is performed only once during a carrier’s 50-year life and includes refueling of the ship’s two nuclear reactors, as well as significant repair, upgrade and modernization work. HII have completed the refueling and complex overhaul of the first six ships of the Nimitz-class, USS Nimitz (CVN 68), USS Dwight D. Eisenhower (CVN 69), USS Carl Vinson (CVN 70), USS Theodore Roosevelt (CVN 71), USS Abraham Lincoln (CVN 72) and USS George Washington (CVN 73). As of 2024, HII is performing this work on the seventh ship in the class, USS John C. Stennis (CVN 74). Aircraft carrier inactivation Newport News Shipbuilding also offers inactivation services for nuclear-powered aircraft carriers. In 2018, NNS successfully completed the inactivation of Enterprise (CVN 65), which began in 2013. The NNS-built Enterprise was the world’s first nuclear-powered aircraft carrier and the only ship of its class. Columbia-class submarines HII's Newport News Shipbuilding is a major shipbuilding partner in the Columbia-class program, constructing and delivering six module sections per submarine under contract to General Dynamics Electric Boat to support the Navy’s plan to replace the aging Ohio-class. The new submarines will make up one leg of the U.S. strategic nuclear deterrent triad. The 561-foot-long submarines will include a new life-of-ship reactor, an electric drive propulsion system and field 16 Trident II D5 ballistic missiles. Building on the success of the Virginia-class submarine program, NNS is participating in the construction of 12 Columbia-class submarines with Electric Boat as the prime contractor. Newport News Shipbuilding is manufacturing major Columbia-class assemblies and modules, including the bow, stern, auxiliary machinery room, superstructure and weapons modules. Virginia-class attack submarines HII's Newport News Shipbuilding is one of only two U.S. shipyards capable of designing and building nuclear-powered submarines. Currently, NNS is building the most advanced attack submarines in the world—the Virginia class. Designed to meet the Navy’s requirements in a post-Cold War era, Virginia-class submarines use advanced technologies to increase firepower, maneuverability and stealth. The submarines are capable of submerged speeds of more than 25 knots and can stay submerged for up to three months at a time. Under an innovative agreement, Newport News Shipbuilding is producing these submarines as part of a teaming agreement with General Dynamics Electric Boat. Prior to the Virginia-class, Newport News Shipbuilding designed the Los Angeles-class submarines and constructed 29 of the 62 boats built. America-class amphibious assault ships USS America (LHA 6) was delivered in April 2014 and commissioned 11 October 2014. It is first in the new class of amphibious assault ships for the U.S. Navy, replacing USS Tarawa (LHA 1). Ingalls’ next ship in the class, Tripoli (LHA 7), was delivered to the Navy on 28 February 2020. The ship was christened on 16 September 2017. On 16 June 2017, Ingalls Shipbuilding was awarded $3.1 billion contract to build Bougainville (LHA 8). Construction started on LHA 8 on 15 October 2018, and the ship's keel was laid on 13 March 2019. Arleigh Burke-class destroyers On 27 September 2018, Ingalls Shipbuilding won a $5.1 billion multi-year contract to build an additional six DDG-51s. These destroyers are equipped with the Navy's Aegis Combat System. The first Flight III ship, Jack. H. Lucas (DDG-125), started fabrication on 7 May 2018. Ingalls has built and delivered 31 ships to the U.S. Navy, with four more under construction. Paul Ignatius (DDG-117), is scheduled for commissioning on 27 July in Fort Lauderdale, Florida. Amphibious ships HII builds LPD 17 San Antonio and LHA America classes of amphibious warships. Designed and built for survivability and flexibility, U.S. Navy amphibious warships are unique combat warships that make possible complex joint U.S. military operations to respond swiftly to crisis anywhere in the world, from deterrence and major combat operations to humanitarian assistance and disaster relief. LPD San Antonio-class HII's Ingalls Shipbuilding is building the entire San Antonio class of ships, the newest addition to the Navy's 21st century amphibious assault force. LPDs 17 to 28 have been delivered to the U.S. Navy. The latest, USS Fort Lauderdale (LPD 28), was delivered in March 2022. In March 2023, Ingalls received a $1.3 billion modification to a previously awarded contract from the U.S. Navy for the procurement of the detail design and construction of amphibious transport dock LPD 32. The ship will be the 16th in the San Antonio class and the third Flight II LPD. LHA 6 America-class The America-class LHA ships are a variant of the extremely successful Wasp-class LHD amphibious assault ships that are presently serving as workhorses in the U. S. Navy fleet. Also known as “Large Deck amphibious ships,” they are the centerpieces of amphibious ready groups and a U.S. Marine Corps Air-Ground Task Force. HII's Ingalls Shipbuilding has delivered two America-class amphibious assault ships to the U.S. Navy: America (LHA 6) in April 2014, and Tripoli (LHA 7) in February 2020. U.S. Coast Guard National Security Cutters HII's Ingalls Shipbuilding provides the U.S. Coast Guard with Legend-class National Security Cutters, the flagships of the Coast Guard's cutter fleet. They are designed to replace the 378-foot Hamilton-class high-endurance cutters, which entered service during the 1960s. The National Security Cutter is the first new design for the service in 20 years. The current Program of Record is for 11 ships, of which the first nine have been successfully delivered to the U.S. Coast Guard. Ingalls' ninth NSC, Stone (WMSL 758), was delivered in November 2020. In December 2018, Ingalls received two contracts from the U.S. Coast Guard to build a 10th and 11th NSC. The contracts are valued at $468.75 million and $462.13 million, respectively. On June 5, 2025, the Secretary of Homeland Security cancelled the 11th cutter's contract due to continued delays past the 2024 delivery date. Unmanned Systems HII creates advanced unmanned solutions for defense, marine research and commercial applications. Serving customers in more than 30 countries, HII provides design, autonomy, manufacturing, testing, operations and sustainment of unmanned systems, including unmanned underwater vehicles (UUVs) and unmanned surface vessels (USVs). The company's REMUS UUVs - world-leading, untethered, autonomous marine robots - carry advanced sensors and payloads to collect valuable data for a variety of applications. Mission Technologies contracts In August 2023, HII's Mission Technologies division received its largest contract win through the $1.4 billion Joint Network Engineering and Emerging Operations (J-NEEO) task order. HII's Mission Technologies also celebrated other several large contract wins: 1.3 billion to support the U.S. Africa Command (AFRICOM) Personnel Recovery Enterprise Services and Solutions (PRESS) task order A $995 million contract to provide Advisory and Assistance Services (A&AS) for the U.S. Air Forces in Europe-Air Forces Africa (USAFE-AFAFRICA) A $242 million contract to provide shore-based training, engineering and development support (SBEDS) for the U.S. Navy Vertical Launch Support In April 2024, Mission Technologies was awarded a contract by the U.S. Navy to analyse, research and develop enhanced capabilities for the Mk 41 and Mk 57 vertical launching systems (VLS) onboard U.S. Navy surface ships. HII is also to equip the first Zumwalt-class destroyer (DDG 1001) with a universal electronics module for the Mk 57 vertical launch system."
}