{
  "ticker": "HLT",
  "cik": "0001585689",
  "company_name": "Hilton Worldwide",
  "corrected_name": "Hilton Worldwide",
  "wiki_title_used": "Hilton Worldwide",
  "exists": true,
  "raw_text": "Hilton Worldwide Holdings Inc. is an American multinational hospitality company that manages and franchises a broad portfolio of hotels, resorts, and timeshare properties. Founded by Conrad Hilton in May 1919, the company is now led by Christopher J. Nassetta. Hilton is headquartered in Tysons, Virginia, United States.\nAs of December 31, 2023, the company's portfolio includes 7,530 properties (including timeshare properties) with 1,182,937 rooms in 118 countries and territories. Hilton owns or leases 51 properties, manages 800 properties, and franchises out 6,679 properties to independent franchisees or companies.\nHilton has 22 brands across different market segments, including Conrad Hotels & Resorts, Canopy by Hilton, Curio, Hilton Hotels & Resorts, DoubleTree by Hilton, Embassy Suites by Hilton, Hilton Garden Inn, Hampton by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton, Hilton Grand Vacations Club, Hilton Vacation Club, Hilton Club, LXR Hotels and Resorts by Hilton, Waldorf Astoria Hotels & Resorts, Signia by Hilton, Tru by Hilton, Tapestry Collection by Hilton, Tempo by Hilton, Motto by Hilton, Spark by Hilton, LivSmart Studios by Hilton, Graduate Hotels, and NoMad Hotels.\nOn December 12, 2013, Hilton again became a public company, raising an estimated $2.35 billion in its second IPO. At the time, Blackstone Inc. held a 45.8 percent stake in the company. In October 2016, China's HNA Group agreed to acquire a 25 percent equity interest in Hilton from Blackstone. The transaction was expected to close in the first quarter of 2017. Hilton's largest stockholders were until mid-2018 HNA Group, Blackstone, and Wellington Management Company, which as of March 2017 owned 25%, 15.2%, and 6.7% of Hilton common stock respectively.\nThe company was founded by Conrad Hilton in 1919 as Hilton Hotels Corporation in Cisco, Texas, and it had its headquarters in Beverly Hills, California, from 1969 until 2009. In August 2009, the company moved to Tysons, unincorporated Fairfax County, Virginia, near McLean.\n\nHistory\nFoundation and early years\nIn 1919, Conrad Hilton purchased his first hotel, the 40-room Mobley Hotel in Cisco, Texas, and bought additional Texas hotels as the years passed.\nIn 1925, the Dallas Hilton became the first hotel to use the Hilton name. In 1927, Hilton expanded to Waco, Texas, where he opened the first hotel with air-conditioning in public areas and cold running water.\nIn 1943, Hilton assumed management of the Roosevelt Hotel and purchased the Plaza Hotel, both well-established high-end luxury hotels less than a mile apart in New York City's Midtown Manhattan neighborhood. With this pair of acquisitions, Hilton established the first hospitality company to span the contiguous United States.\nThe company was incorporated in 1946 as the Hilton Hotels Corporation and subsequently began public trading of shares on the New York Stock Exchange. In 1947, the Roosevelt Hotel became the first hotel in the world to have televisions in its rooms.\nIn 1947, Hilton assumed management of the Palacio Hilton hotel in Chihuahua, Mexico, which became the chain's first international property. That same year, they assumed management of four hotels on the island of Bermuda.\nHilton International was founded as a wholly owned subsidiary in 1948, just before the 1949 opening of the Caribe Hilton Hotel in Puerto Rico. Barman Ramon \"Monchito\" Marreno claimed he created the piña colada cocktail at this resort. Hilton purchased The Waldorf-Astoria in New York in the same year.\n\nHilton in the 1950s - 1980s\nIn 1953, Hilton opened its first hotel in Europe, the Castellana Hilton in Madrid, Spain.\nThe Hotels Statler Company was acquired in 1954 for $111 million in what was then the world's most expensive real estate transaction. \nHilton is credited with several early innovations. In 1954, Hilton created the world's first central reservations office, titled \"HILCRON\". The reservations team in 1955 consisted of eight members on staff booking reservations for any of Hilton's then 28 hotels. Reservations agents used the \"availability board\" to track records. The chalkboard measured 30 feet (9.1 m) by 6 feet (1.8 m) and allowed HILCRON to make over 6,000 reservations in 1955. Bookings could be made for any Hilton via telephone, telegram, or Teletype. Later in 1955, Hilton launched a program to ensure every hotel room would include air conditioning. Hilton is also credited with pioneering the airport hotel concept with the opening of the Hilton Inn at San Francisco International Airport in 1959.\nInternational expansion continued in this era. In late 1955, Hilton opened the Istanbul Hilton, the first post–World War II property in Istanbul, Turkey. In 1957, Hilton assumed management of its first hotel in Central America, the El Panama Hilton in Panama City, Panama. In 1958, Hilton opened its first hotel in Canada, The Queen Elizabeth in Montreal, Quebec. In 1959, Hilton opened its first hotel in Africa, the Nile Hilton in Cairo, Egypt. In 1960, Hilton opened its first hotel in Oceania, the Chevron Hilton in Sydney, Australia. In 1961, Hilton assumed management of its first hotel in South America, the Hotel Carrera in Santiago, Chile. In 1963, Hilton opened its first hotels in Asia, the Hong Kong Hilton and the Tokyo Hilton, and the Royal Tehran Hilton.\nIn 1965, Hilton launched Lady Hilton, the first hotel concept created specifically for women guests. To appeal to female travelers, many properties offered floors occupied by only women along with distinct amenities for their usage.\nBetween 1970 and 1971, Hilton acquired the International Leisure Company, including the International Hotel and the Flamingo Hotel, which were renamed the Las Vegas Hilton and the Flamingo Hilton. The properties would become the first in the domestic gaming business to be listed on the NYSE.\nIn 1977, Hilton International opened its first property behind the \"Iron Curtain\" in Communist Europe, the Budapest Hilton.\nIn 1979, founder Conrad Hilton died at the age of 91. Hilton Hotels Corporation later created the Conrad Hotels brand in honor of Hilton.\nHilton Honors (formerly Hilton HHonors), the company's guest loyalty program, was initiated in 1987. In 1994, the Honors surpassed competing hotel loyalty programs by offering members both hotel credit points and airline credit miles.\nIn 1998, Hilton spun off its gambling operations into a separate, publicly held company called Park Place Entertainment (later Caesars Entertainment, Inc.) In 1999, Hilton acquired Promus Hotel Corporation, which included the DoubleTree, Red Lion, Embassy Suites, Hampton Inn, and Homewood Suites brands.\n\nTwo chains with one name\nThe company spun off its international operations into a separately traded company on December 1, 1964, known as \"Hilton International Co.\" It was acquired in 1967 by Trans World Corp., the holding company for Trans World Airlines. \nAs a result, there were two separate, fully independent companies operating hotels under the Hilton name. Because the two chains were contractually forbidden to operate hotels in the other's territory under the Hilton name, for many years hotels run by Hilton International in the U.S. were called Vista International Hotels, while hotels operated by the American arm of Hilton outside the U.S. were named Conrad Hotels. Those Hilton Hotels outside the U.S. were, until 2006, styled as \"Hilton International\" hotels.\nIn 1986, Hilton International was sold to UAL Corp., the holding company for United Airlines, for $980 million. UAL was reorganized as Allegis Corp. in an attempt to re-incarnate itself as a full-service travel company, encompassing Westin Hotels and Hertz rental cars in addition to Hilton International and United Airlines. In 1987, after a corporate putsch, the renamed Allegis sold Hilton International to Ladbroke Group plc, a British leisure and gambling company, for $1.07 billion. In May 1999, Ladbrokes was reorganized as \"Hilton Group plc.\"\n\nIn 1997, to minimize longtime consumer confusion, the American-owned Hilton and British-owned Hilton International companies adopted a joint marketing agreement, under which they shared the same logos, promoted each other's brands, and maintained joint reservation systems. At that point, the Vista chain was phased out, while Conrad was restyled as one of the luxury brands of Hilton, operating hotels within the U.S. and abroad.\n\n21st century\nIn 2001, Hilton agreed to sell Red Lion to WestCoast Hospitality.\nOn December 29, 2005, Hilton Hotels Corporation agreed to re-acquire the Hilton International chain from its British owner, Hilton Group plc, for £3.3 billion ($5.71 billion). As well as bringing the two Hilton companies back together as a single entity, this deal also included Hilton plc properties operating as Conrad Hotels, Scandic Hotels, and LivingWell Health Clubs. On February 23, 2006, the deal closed, making Hilton Hotels the world's fifth-largest hotel operator in number of rooms. Scandic Hotels was sold the next year on March 1 to EQT AB.\nOn July 3, 2007, Hilton Hotels Corp. agreed to an all-cash buyout from the Blackstone Group LP in a $26 billion (including debt) deal that would make Blackstone the world's largest hotel owner. At $47.50 per share, the buyout price was 32 percent higher than the closing value of a share of Hilton stock on July 3. The deal was the culmination of a year of on and off discussions with Blackstone. In October 2007, Christopher J. Nassetta was appointed president and chief executive officer of Hilton. In February 2009, Hilton Hotels Corp. announced that its headquarters were moving from Beverly Hills, California to Fairfax County, Virginia.\nWhile Blackstone saw an opportunity to streamline the company and push Hilton's expansion overseas when Blackstone pursued Hilton in 2006 and 2007, the buyout saddled the company with $20 billion of debt just before the 2008 financial crisis. In April 2010, Hilton and Blackstone restructured the debt with Blackstone invested a further $800 million of equity and the debt was reduced to $16 billion.\nHilton returned to being a public company on December 12, 2013. This second IPO in the company's history raised an estimated $2.35 billion. The Blackstone Group retained a 45.8% stake in the company.\nThe company announced in February 2016 that Hilton would turn its hotel holdings into a real estate investment trust.\nIn February 2016, Hilton announced its intention to spin off its timeshare and real estate businesses, creating three independent public companies. The spin-offs of Park Hotels & Resorts and Hilton Grand Vacations were completed in January 2017. As of 2018, the company is a fully independent publicly traded company after the exits of Blackstone and HNA.\nOn February 7, 2024, Hilton announced an exclusive partnership with Small Luxury Hotels of the World.\nOn April 3, 2024, Hilton announced its acquisition of a majority controlling interest in Sydell Group, the owner of NoMad Hotels, aiming to expand the luxury lifestyle brand with up to 100 new NoMad hotels globally.\n\nBrands\nHilton's business model for its various brands is based on largely on franchising rather than direct ownership and management of properties. Hilton Worldwide has full ownership of the hotel and resort brands as well as the intellectual property associated with them, however the vast majority of Hilton branded properties are not owned and operated by Hilton, instead they are independently owned and operated by independent franchisees or hospitality companies. As of 2025, Hilton Worldwide owns 22 hotel and resort brands that cover a variety of areas in the hospitality sector in six internal categories:\n\nLuxury\nWaldorf Astoria Hotels & Resorts\nConrad Hotels\nLXR Hotels & Resorts\nNoMad Hotels\n\nLifestyle\nCanopy by Hilton\nCurio Collection by Hilton\nGraduate by Hilton\nTapestry Collection by Hilton\nTempo by Hilton\nMotto by Hilton\n\nFull Service\nHilton Hotels & Resorts\nDoubleTree by Hilton\n\nFocused Service\nHilton Garden Inn\nHampton by Hilton\nTru by Hilton\nSpark by Hilton\n\nAll Suites\nEmbassy Suites by Hilton\nHomewood Suites by Hilton\nHome2 Suites by Hilton\nLivSmart Studios by Hilton\n\nVacation Ownership\nHilton Grand Vacations\n\nFranchising\nAs of February 2024, 6,679 of Hilton's 7,530 hotels and timeshare resorts worldwide are owned and operated by independent franchisees or companies and not by Hilton Worldwide itself, this includes Hilton Grand Vacations which was a division of Hilton Worldwide until it was spun off into a separate company to act as a franchisee for Hilton's timeshare brands. Through this franchising model Hilton Worldwide owns the Hilton hotel and resort brands along with the Intellectual property associated with them but does not own nor operate the physical hotels and resorts that bear those brand names. Additionally, Hilton Worldwide does not employ the staff that works at these franchised properties, instead the staff are employed by the independent franchisees or companies. The practice of franchising means that Hilton Worldwide is not responsible for the operational costs, real estate costs, maintenance costs, staff wages, and other costs that they would be if they were the ones owning and operating the properties, instead the independent franchisee or company incurs those costs. Hilton Worldwide profits from the franchisees through franchise fees, licensing fees, and agreements which give Hilton Worldwide a certain percentage the income. In order to utilize the Hilton brands, the independent franchisees and companies must follow strict brand standards to maintain a licensing agreement with Hilton Worldwide. The franchise model makes Hilton Worldwide a more profitable company along with increasing its value for shareholders due to it having less capital and being able to focus more on its brand. Many of Hilton's flagship properties, airport properties, and largest resorts, however, are corporately managed.\n\nCorporate affairs\nHead offices\nThe company has its headquarters in Tysons, Virginia, and an operations center in Memphis. Its Asia-Pacific operations are managed out of Singapore, its Middle East and Africa operations are managed out of Dubai, and its European operations are based in Watford, UK.\nHilton Honors (formerly Hilton HHonors) is Hilton's guest loyalty program, through which frequent guests can accumulate points and airline miles by staying within the Hilton portfolio. The program is one of the largest of its type, with approximately 195 million members. There are four levels of elite status within the Hilton Honors program including Member, Silver, Gold, and Diamond. Hilton points average a value of 0.58¢ each. Hilton renamed the Hilton HHonors program to Hilton Honors in February 2017.\nRecent changes announced in September 2025 include significantly increased redemption point costs at luxury and peak-rate Hilton properties (for example, Waldorf Astoria Maldives rising from 190,000 to 250,000 points per night), limited promotional bonuses for elite statuses, and broader concerns among members that benefits are becoming harder to access without high rates of spending.\n\nCompany culture\nAccording to Careerbliss.com, Hilton ranked first in the list of \"2012 Happiest Companies in America\", with a score of 4.36 out of 5. The survey looked at job reviews from more than 100,000 employees, with such characteristics life as work-life balance, company culture and reputation, and the relationships employees have with their bosses. Hilton has scored 100% on the Corporate Equality Index each year from 2014 to 2017.\nIn 2016, Hilton was named one of the \"World's 25 Best Multinational Workplaces\" by Fortune and Great Place to Work. In 2017, Fortune ranked Hilton number 26 in their list of \"The 100 Best Companies to Work For\". In 2019, Fortune ranked Hilton number 1 in their list of \"The 100 Best Companies to Work For\".\n\nSustainability\nAnimal welfare\nIn 2015, Hilton committed to sourcing 100% cage-free eggs by December 31, 2017, and sourcing pork products without gestation crates by December 31, 2018.\n\nHilton in popular culture\nKeith Richards and Mick Jagger performed in the East Penthouse on the 45th floor of the New York Hilton on October 28, 1965.\nOn the rotating wheel space station in Stanley Kubrick's 1968 film 2001: A Space Odyssey, a receptionist is shown sitting at the entrance to the Hilton Space Station 5.\nJohn Lennon and Yoko Ono honeymooned in the presidential suite at the Hilton Amsterdam, where they hosted one of their famous \"Bed-Ins\" for a full week in 1969.\nIn 1971, Diamonds Are Forever was filmed at the Las Vegas Hilton.\nOn April 3, 1973, Dr. Martin Cooper made the world's first cell phone call in front of the New York Hilton Midtown. A press conference was held at the hotel later that day to mark the milestone.\nIn 1976, during a music tour, Ike and Tina Turner were staying at the Statler Hilton (now the Statler Hotel & Residences) in downtown Dallas when Tina decided to leave Ike. Her moments of getting away from Ike and fleeing the hotel were included in her book I, Tina and in the movie What's Love Got to Do with It.\nThe Bodyguard with Whitney Houston and Kevin Costner was filmed at the Fontainebleau Hilton in Miami in 1992. On February 11, 2012, Houston died in her bathtub in Suite 434 of the Beverly Hilton after a drug overdose. Hotel management has since renovated the room.\nIn 1995, the James Bond movie GoldenEye was filmed at the Langham Hilton.\nThe Insider was filmed in 1999 at the Seelbach Hilton.\nIn 2006, several movies including Spider-Man 3, Michael Clayton, and American Gangster were filmed at the New York Hilton.\nConrad Hilton (played by actor Chelcie Ross) features as a major character in the third season of Mad Men, as lead character Don Draper creates a series of ad campaigns for Hilton Hotels. The Drapers travel during one episode to the Cavalieri Hilton in Rome, though the scenes were actually shot at the Dorothy Chandler Pavilion in Los Angeles.\nHilton Hotel is featured in Mukoma wa Ngugi's crime fiction novel, Nairobi Heat.\n\nReferences\nExternal links\n Media related to Hilton Worldwide at Wikimedia Commons\nOfficial website\nBusiness data for Hilton Worldwide Holdings Inc.:",
  "clean_text": "Hilton Worldwide Holdings Inc. is an American multinational hospitality company that manages and franchises a broad portfolio of hotels, resorts, and timeshare properties. Founded by Conrad Hilton in May 1919, the company is now led by Christopher J. Nassetta. Hilton is headquartered in Tysons, Virginia, United States. As of December 31, 2023, the company's portfolio includes 7,530 properties (including timeshare properties) with 1,182,937 rooms in 118 countries and territories. Hilton owns or leases 51 properties, manages 800 properties, and franchises out 6,679 properties to independent franchisees or companies. Hilton has 22 brands across different market segments, including Conrad Hotels & Resorts, Canopy by Hilton, Curio, Hilton Hotels & Resorts, DoubleTree by Hilton, Embassy Suites by Hilton, Hilton Garden Inn, Hampton by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton, Hilton Grand Vacations Club, Hilton Vacation Club, Hilton Club, LXR Hotels and Resorts by Hilton, Waldorf Astoria Hotels & Resorts, Signia by Hilton, Tru by Hilton, Tapestry Collection by Hilton, Tempo by Hilton, Motto by Hilton, Spark by Hilton, LivSmart Studios by Hilton, Graduate Hotels, and NoMad Hotels. On December 12, 2013, Hilton again became a public company, raising an estimated $2.35 billion in its second IPO. At the time, Blackstone Inc. held a 45.8 percent stake in the company. In October 2016, China's HNA Group agreed to acquire a 25 percent equity interest in Hilton from Blackstone. The transaction was expected to close in the first quarter of 2017. Hilton's largest stockholders were until mid-2018 HNA Group, Blackstone, and Wellington Management Company, which as of March 2017 owned 25%, 15.2%, and 6.7% of Hilton common stock respectively. The company was founded by Conrad Hilton in 1919 as Hilton Hotels Corporation in Cisco, Texas, and it had its headquarters in Beverly Hills, California, from 1969 until 2009. In August 2009, the company moved to Tysons, unincorporated Fairfax County, Virginia, near McLean. History Foundation and early years In 1919, Conrad Hilton purchased his first hotel, the 40-room Mobley Hotel in Cisco, Texas, and bought additional Texas hotels as the years passed. In 1925, the Dallas Hilton became the first hotel to use the Hilton name. In 1927, Hilton expanded to Waco, Texas, where he opened the first hotel with air-conditioning in public areas and cold running water. In 1943, Hilton assumed management of the Roosevelt Hotel and purchased the Plaza Hotel, both well-established high-end luxury hotels less than a mile apart in New York City's Midtown Manhattan neighborhood. With this pair of acquisitions, Hilton established the first hospitality company to span the contiguous United States. The company was incorporated in 1946 as the Hilton Hotels Corporation and subsequently began public trading of shares on the New York Stock Exchange. In 1947, the Roosevelt Hotel became the first hotel in the world to have televisions in its rooms. In 1947, Hilton assumed management of the Palacio Hilton hotel in Chihuahua, Mexico, which became the chain's first international property. That same year, they assumed management of four hotels on the island of Bermuda. Hilton International was founded as a wholly owned subsidiary in 1948, just before the 1949 opening of the Caribe Hilton Hotel in Puerto Rico. Barman Ramon \"Monchito\" Marreno claimed he created the piña colada cocktail at this resort. Hilton purchased The Waldorf-Astoria in New York in the same year. Hilton in the 1950s - 1980s In 1953, Hilton opened its first hotel in Europe, the Castellana Hilton in Madrid, Spain. The Hotels Statler Company was acquired in 1954 for $111 million in what was then the world's most expensive real estate transaction. Hilton is credited with several early innovations. In 1954, Hilton created the world's first central reservations office, titled \"HILCRON\". The reservations team in 1955 consisted of eight members on staff booking reservations for any of Hilton's then 28 hotels. Reservations agents used the \"availability board\" to track records. The chalkboard measured 30 feet (9.1 m) by 6 feet (1.8 m) and allowed HILCRON to make over 6,000 reservations in 1955. Bookings could be made for any Hilton via telephone, telegram, or Teletype. Later in 1955, Hilton launched a program to ensure every hotel room would include air conditioning. Hilton is also credited with pioneering the airport hotel concept with the opening of the Hilton Inn at San Francisco International Airport in 1959. International expansion continued in this era. In late 1955, Hilton opened the Istanbul Hilton, the first post–World War II property in Istanbul, Turkey. In 1957, Hilton assumed management of its first hotel in Central America, the El Panama Hilton in Panama City, Panama. In 1958, Hilton opened its first hotel in Canada, The Queen Elizabeth in Montreal, Quebec. In 1959, Hilton opened its first hotel in Africa, the Nile Hilton in Cairo, Egypt. In 1960, Hilton opened its first hotel in Oceania, the Chevron Hilton in Sydney, Australia. In 1961, Hilton assumed management of its first hotel in South America, the Hotel Carrera in Santiago, Chile. In 1963, Hilton opened its first hotels in Asia, the Hong Kong Hilton and the Tokyo Hilton, and the Royal Tehran Hilton. In 1965, Hilton launched Lady Hilton, the first hotel concept created specifically for women guests. To appeal to female travelers, many properties offered floors occupied by only women along with distinct amenities for their usage. Between 1970 and 1971, Hilton acquired the International Leisure Company, including the International Hotel and the Flamingo Hotel, which were renamed the Las Vegas Hilton and the Flamingo Hilton. The properties would become the first in the domestic gaming business to be listed on the NYSE. In 1977, Hilton International opened its first property behind the \"Iron Curtain\" in Communist Europe, the Budapest Hilton. In 1979, founder Conrad Hilton died at the age of 91. Hilton Hotels Corporation later created the Conrad Hotels brand in honor of Hilton. Hilton Honors (formerly Hilton HHonors), the company's guest loyalty program, was initiated in 1987. In 1994, the Honors surpassed competing hotel loyalty programs by offering members both hotel credit points and airline credit miles. In 1998, Hilton spun off its gambling operations into a separate, publicly held company called Park Place Entertainment (later Caesars Entertainment, Inc.) In 1999, Hilton acquired Promus Hotel Corporation, which included the DoubleTree, Red Lion, Embassy Suites, Hampton Inn, and Homewood Suites brands. Two chains with one name The company spun off its international operations into a separately traded company on December 1, 1964, known as \"Hilton International Co.\" It was acquired in 1967 by Trans World Corp., the holding company for Trans World Airlines. As a result, there were two separate, fully independent companies operating hotels under the Hilton name. Because the two chains were contractually forbidden to operate hotels in the other's territory under the Hilton name, for many years hotels run by Hilton International in the U.S. were called Vista International Hotels, while hotels operated by the American arm of Hilton outside the U.S. were named Conrad Hotels. Those Hilton Hotels outside the U.S. were, until 2006, styled as \"Hilton International\" hotels. In 1986, Hilton International was sold to UAL Corp., the holding company for United Airlines, for $980 million. UAL was reorganized as Allegis Corp. in an attempt to re-incarnate itself as a full-service travel company, encompassing Westin Hotels and Hertz rental cars in addition to Hilton International and United Airlines. In 1987, after a corporate putsch, the renamed Allegis sold Hilton International to Ladbroke Group plc, a British leisure and gambling company, for $1.07 billion. In May 1999, Ladbrokes was reorganized as \"Hilton Group plc.\" In 1997, to minimize longtime consumer confusion, the American-owned Hilton and British-owned Hilton International companies adopted a joint marketing agreement, under which they shared the same logos, promoted each other's brands, and maintained joint reservation systems. At that point, the Vista chain was phased out, while Conrad was restyled as one of the luxury brands of Hilton, operating hotels within the U.S. and abroad. 21st century In 2001, Hilton agreed to sell Red Lion to WestCoast Hospitality. On December 29, 2005, Hilton Hotels Corporation agreed to re-acquire the Hilton International chain from its British owner, Hilton Group plc, for £3.3 billion ($5.71 billion). As well as bringing the two Hilton companies back together as a single entity, this deal also included Hilton plc properties operating as Conrad Hotels, Scandic Hotels, and LivingWell Health Clubs. On February 23, 2006, the deal closed, making Hilton Hotels the world's fifth-largest hotel operator in number of rooms. Scandic Hotels was sold the next year on March 1 to EQT AB. On July 3, 2007, Hilton Hotels Corp. agreed to an all-cash buyout from the Blackstone Group LP in a $26 billion (including debt) deal that would make Blackstone the world's largest hotel owner. At $47.50 per share, the buyout price was 32 percent higher than the closing value of a share of Hilton stock on July 3. The deal was the culmination of a year of on and off discussions with Blackstone. In October 2007, Christopher J. Nassetta was appointed president and chief executive officer of Hilton. In February 2009, Hilton Hotels Corp. announced that its headquarters were moving from Beverly Hills, California to Fairfax County, Virginia. While Blackstone saw an opportunity to streamline the company and push Hilton's expansion overseas when Blackstone pursued Hilton in 2006 and 2007, the buyout saddled the company with $20 billion of debt just before the 2008 financial crisis. In April 2010, Hilton and Blackstone restructured the debt with Blackstone invested a further $800 million of equity and the debt was reduced to $16 billion. Hilton returned to being a public company on December 12, 2013. This second IPO in the company's history raised an estimated $2.35 billion. The Blackstone Group retained a 45.8% stake in the company. The company announced in February 2016 that Hilton would turn its hotel holdings into a real estate investment trust. In February 2016, Hilton announced its intention to spin off its timeshare and real estate businesses, creating three independent public companies. The spin-offs of Park Hotels & Resorts and Hilton Grand Vacations were completed in January 2017. As of 2018, the company is a fully independent publicly traded company after the exits of Blackstone and HNA. On February 7, 2024, Hilton announced an exclusive partnership with Small Luxury Hotels of the World. On April 3, 2024, Hilton announced its acquisition of a majority controlling interest in Sydell Group, the owner of NoMad Hotels, aiming to expand the luxury lifestyle brand with up to 100 new NoMad hotels globally. Brands Hilton's business model for its various brands is based on largely on franchising rather than direct ownership and management of properties. Hilton Worldwide has full ownership of the hotel and resort brands as well as the intellectual property associated with them, however the vast majority of Hilton branded properties are not owned and operated by Hilton, instead they are independently owned and operated by independent franchisees or hospitality companies. As of 2025, Hilton Worldwide owns 22 hotel and resort brands that cover a variety of areas in the hospitality sector in six internal categories: Luxury Waldorf Astoria Hotels & Resorts Conrad Hotels LXR Hotels & Resorts NoMad Hotels Lifestyle Canopy by Hilton Curio Collection by Hilton Graduate by Hilton Tapestry Collection by Hilton Tempo by Hilton Motto by Hilton Full Service Hilton Hotels & Resorts DoubleTree by Hilton Focused Service Hilton Garden Inn Hampton by Hilton Tru by Hilton Spark by Hilton All Suites Embassy Suites by Hilton Homewood Suites by Hilton Home2 Suites by Hilton LivSmart Studios by Hilton Vacation Ownership Hilton Grand Vacations Franchising As of February 2024, 6,679 of Hilton's 7,530 hotels and timeshare resorts worldwide are owned and operated by independent franchisees or companies and not by Hilton Worldwide itself, this includes Hilton Grand Vacations which was a division of Hilton Worldwide until it was spun off into a separate company to act as a franchisee for Hilton's timeshare brands. Through this franchising model Hilton Worldwide owns the Hilton hotel and resort brands along with the Intellectual property associated with them but does not own nor operate the physical hotels and resorts that bear those brand names. Additionally, Hilton Worldwide does not employ the staff that works at these franchised properties, instead the staff are employed by the independent franchisees or companies. The practice of franchising means that Hilton Worldwide is not responsible for the operational costs, real estate costs, maintenance costs, staff wages, and other costs that they would be if they were the ones owning and operating the properties, instead the independent franchisee or company incurs those costs. Hilton Worldwide profits from the franchisees through franchise fees, licensing fees, and agreements which give Hilton Worldwide a certain percentage the income. In order to utilize the Hilton brands, the independent franchisees and companies must follow strict brand standards to maintain a licensing agreement with Hilton Worldwide. The franchise model makes Hilton Worldwide a more profitable company along with increasing its value for shareholders due to it having less capital and being able to focus more on its brand. Many of Hilton's flagship properties, airport properties, and largest resorts, however, are corporately managed. Corporate affairs Head offices The company has its headquarters in Tysons, Virginia, and an operations center in Memphis. Its Asia-Pacific operations are managed out of Singapore, its Middle East and Africa operations are managed out of Dubai, and its European operations are based in Watford, UK. Hilton Honors (formerly Hilton HHonors) is Hilton's guest loyalty program, through which frequent guests can accumulate points and airline miles by staying within the Hilton portfolio. The program is one of the largest of its type, with approximately 195 million members. There are four levels of elite status within the Hilton Honors program including Member, Silver, Gold, and Diamond. Hilton points average a value of 0.58¢ each. Hilton renamed the Hilton HHonors program to Hilton Honors in February 2017. Recent changes announced in September 2025 include significantly increased redemption point costs at luxury and peak-rate Hilton properties (for example, Waldorf Astoria Maldives rising from 190,000 to 250,000 points per night), limited promotional bonuses for elite statuses, and broader concerns among members that benefits are becoming harder to access without high rates of spending. Company culture According to Careerbliss.com, Hilton ranked first in the list of \"2012 Happiest Companies in America\", with a score of 4.36 out of 5. The survey looked at job reviews from more than 100,000 employees, with such characteristics life as work-life balance, company culture and reputation, and the relationships employees have with their bosses. Hilton has scored 100% on the Corporate Equality Index each year from 2014 to 2017. In 2016, Hilton was named one of the \"World's 25 Best Multinational Workplaces\" by Fortune and Great Place to Work. In 2017, Fortune ranked Hilton number 26 in their list of \"The 100 Best Companies to Work For\". In 2019, Fortune ranked Hilton number 1 in their list of \"The 100 Best Companies to Work For\". Sustainability Animal welfare In 2015, Hilton committed to sourcing 100% cage-free eggs by December 31, 2017, and sourcing pork products without gestation crates by December 31, 2018. Hilton in popular culture Keith Richards and Mick Jagger performed in the East Penthouse on the 45th floor of the New York Hilton on October 28, 1965. On the rotating wheel space station in Stanley Kubrick's 1968 film 2001: A Space Odyssey, a receptionist is shown sitting at the entrance to the Hilton Space Station 5. John Lennon and Yoko Ono honeymooned in the presidential suite at the Hilton Amsterdam, where they hosted one of their famous \"Bed-Ins\" for a full week in 1969. In 1971, Diamonds Are Forever was filmed at the Las Vegas Hilton. On April 3, 1973, Dr. Martin Cooper made the world's first cell phone call in front of the New York Hilton Midtown. A press conference was held at the hotel later that day to mark the milestone. In 1976, during a music tour, Ike and Tina Turner were staying at the Statler Hilton (now the Statler Hotel & Residences) in downtown Dallas when Tina decided to leave Ike. Her moments of getting away from Ike and fleeing the hotel were included in her book I, Tina and in the movie What's Love Got to Do with It. The Bodyguard with Whitney Houston and Kevin Costner was filmed at the Fontainebleau Hilton in Miami in 1992. On February 11, 2012, Houston died in her bathtub in Suite 434 of the Beverly Hilton after a drug overdose. Hotel management has since renovated the room. In 1995, the James Bond movie GoldenEye was filmed at the Langham Hilton. The Insider was filmed in 1999 at the Seelbach Hilton. In 2006, several movies including Spider-Man 3, Michael Clayton, and American Gangster were filmed at the New York Hilton. Conrad Hilton (played by actor Chelcie Ross) features as a major character in the third season of Mad Men, as lead character Don Draper creates a series of ad campaigns for Hilton Hotels. The Drapers travel during one episode to the Cavalieri Hilton in Rome, though the scenes were actually shot at the Dorothy Chandler Pavilion in Los Angeles. Hilton Hotel is featured in Mukoma wa Ngugi's crime fiction novel, Nairobi Heat."
}