{
  "ticker": "HOLX",
  "cik": "0000859737",
  "company_name": "Hologic",
  "corrected_name": "Hologic",
  "wiki_title_used": "Hologic",
  "exists": true,
  "raw_text": "Hologic, Inc. is an American medical technology company primarily focused on women's health; it sells medical devices for diagnostics, surgery, and medical imaging.\n\nHistory\nIn late November 2013, activist investor Carl Icahn disclosed a 12.5% stake in the company. Subsequently, the company adopted a poison pill to prevent a hostile takeover. In negotiations with the company's board of directors, two additional directors backed by Icahn were added to the board, each managing directors of Icahn holding companies. Icahn considered his investment and intervention into Hologic to have been a success, with his nominees to the board of directors resigning on March 3, 2016 and exiting his position by May 16, 2016.\nIn 2017, Hologic acquired Westford, Massachusetts-based aesthetic medicine company Cynosure for $1.65 billion.\nOn November 20, 2019, Hologic announced the divestment of Cynosure to Clayton, Dubilier & Rice for $205 million; this was completed on December 30, 2019. Cynosure had ~825 employees at the time of the divestiture.\nIn March 2020, Hologic received emergency use authorization from the FDA for a test for SARS-CoV-2 to help mitigate the COVID-19 pandemic. In May 2020, Hologic received a second emergency use authorization from the FDA for 2019-nCov to increase potential throughput of testing.\nIn June 2020, Hologic collaborated with Grifols, a global producer of plasma-driven medicines, to increase Spain's testing capacity for COVID-19.\nIn November 2020, Hologic won a $119 million contract from the U.S. Department of Health and Human Services and the Department of Defense to help expand production facilities in three states, Wisconsin, Maine, and California, with the goal to provide 13 million COVID tests per month by January 2022.\nIn January 2021, the company announced it would acquire Biotheranostics and its breast and metastatic cancer test portfolio for $230 million and SOMATEX for $64 Million.\nIn April 2021, the company announced it will acquire Mobidiag, a molecular diagnostics firm with multiplex technology, for $795 million. The acquisition completed in June 2021.\nIn March 2022, Hologic became the title sponsor of the WTA Tour in women's professional tennis. As part of the sponsorship, the company was also named the \"official health partner\" of the Women's Tennis Association.\nIn April 2024, Hologic agreed to acquire British medical device manufacturer Endomag for $310 million. The acquisition completed in July that year.\nIn 2025, Hologic acquired Gynesonics for $350 million, which developed the Sonata System, an ultrasound imaging device for uterine fibroids.\nIn October 2025, private equity firms Blackstone and TPG announced they had agreed a deal to buy Hologic for $18.3 billion including debt, taking the company private. It was reported to be the largest medical devices deal in almost two decades, since Boston Scientific bought Guidant Corp for $27 billion in 2006.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Hologic, Inc.:",
  "clean_text": "Hologic, Inc. is an American medical technology company primarily focused on women's health; it sells medical devices for diagnostics, surgery, and medical imaging. History In late November 2013, activist investor Carl Icahn disclosed a 12.5% stake in the company. Subsequently, the company adopted a poison pill to prevent a hostile takeover. In negotiations with the company's board of directors, two additional directors backed by Icahn were added to the board, each managing directors of Icahn holding companies. Icahn considered his investment and intervention into Hologic to have been a success, with his nominees to the board of directors resigning on March 3, 2016 and exiting his position by May 16, 2016. In 2017, Hologic acquired Westford, Massachusetts-based aesthetic medicine company Cynosure for $1.65 billion. On November 20, 2019, Hologic announced the divestment of Cynosure to Clayton, Dubilier & Rice for $205 million; this was completed on December 30, 2019. Cynosure had ~825 employees at the time of the divestiture. In March 2020, Hologic received emergency use authorization from the FDA for a test for SARS-CoV-2 to help mitigate the COVID-19 pandemic. In May 2020, Hologic received a second emergency use authorization from the FDA for 2019-nCov to increase potential throughput of testing. In June 2020, Hologic collaborated with Grifols, a global producer of plasma-driven medicines, to increase Spain's testing capacity for COVID-19. In November 2020, Hologic won a $119 million contract from the U.S. Department of Health and Human Services and the Department of Defense to help expand production facilities in three states, Wisconsin, Maine, and California, with the goal to provide 13 million COVID tests per month by January 2022. In January 2021, the company announced it would acquire Biotheranostics and its breast and metastatic cancer test portfolio for $230 million and SOMATEX for $64 Million. In April 2021, the company announced it will acquire Mobidiag, a molecular diagnostics firm with multiplex technology, for $795 million. The acquisition completed in June 2021. In March 2022, Hologic became the title sponsor of the WTA Tour in women's professional tennis. As part of the sponsorship, the company was also named the \"official health partner\" of the Women's Tennis Association. In April 2024, Hologic agreed to acquire British medical device manufacturer Endomag for $310 million. The acquisition completed in July that year. In 2025, Hologic acquired Gynesonics for $350 million, which developed the Sonata System, an ultrasound imaging device for uterine fibroids. In October 2025, private equity firms Blackstone and TPG announced they had agreed a deal to buy Hologic for $18.3 billion including debt, taking the company private. It was reported to be the largest medical devices deal in almost two decades, since Boston Scientific bought Guidant Corp for $27 billion in 2006."
}