{
  "ticker": "HOOD",
  "cik": "0001783879",
  "company_name": "Robinhood Markets",
  "corrected_name": "Robinhood Markets",
  "wiki_title_used": "Robinhood Markets",
  "exists": true,
  "raw_text": "Robinhood Markets, Inc. is an American financial services company based in Menlo Park, California. It provides an electronic trading platform that facilitates trades of stocks, exchange-traded funds, options, index options, futures contracts, outcomes on prediction markets, and cryptocurrency. It also offers cryptocurrency wallets, wealth management, credit cards and other banking services, some in partnership with banks insured by the FDIC, as well as a news website, Sherwood.News. The company's revenue comes from payment for order flow and commissions on options (27% of Q2 2025 revenues), cryptocurrency (16% of Q2 2025 revenues), equities (7% of Q2 2025 revenues), and other products such as futures and event contracts (5% of Q2 2025 revenues); net interest income (primarily from margin lending, interest earned on corporate and customer cash balances, securities lending, and credit cards; 36% of Q2 2025 revenues), and other sources (subscription fees and advertising revenue on Sherwood.News; 9% of Q2 2025 revenues). The company has 27.4 million funded customers and $279 billion in assets under custody. Its platform is available in the U.S., the UK, and, for trading cryptocurrency and tokenized stocks and ETFs only, in the European Union. Approximately 2 billion option contracts are traded annually on the Robinhood platform.\nThe company is named after Robin Hood, based on its mission to \"provide everyone with access to the financial markets, not just the wealthy\". The company has been referred to as an innovator in zero-commission stock trading, as it relies on other sources of revenues. Robinhood has targeted millennials as customers; in March 2025, the average age of its customers was 35.\nThe company does not allow trading in mutual funds, preferred stocks, bonds, some high-risk penny stocks, and new positions in options on their expiration dates in the last 30 minutes of the trading day.\n\nHistory\nRobinhood was founded in April 2013 by Vladimir Tenev and Baiju Bhatt, who had previously built high-frequency trading platforms for financial institutions in New York City. They aimed to design a mobile app that was free, easy to use, and addictive. Tenev and Bhatt served as co-CEOs from 2013 to 2020, when Tenev became the sole CEO and Bhatt became chief creative officer.\nThe founders presented the mobile app at LA Hacks in April 2014 and launched a beta release in December on the Apple App Store. The mobile app was launched officially in March 2015.\nIn February 2018, the company announced that it would be moving its headquarters from Palo Alto to the former headquarters of Sunset magazine in Menlo Park. That same month, Robinhood launched cryptocurrency trading.\nRobinhood launched banking products with insurance from the Federal Deposit Insurance Corporation via partner banks in December 2019.\nIn the second quarter of 2020, during the 2020 stock market crash, compared to the first quarter of 2020, trading volumes increased 139%, more than any other major brokerage. In July 2021, the company went public and was listed on  Nasdaq.\nIn April 2022, Robinhood cut its workforce by 9%. In August that year, the company announced additional layoffs of 23% of its workforce, mostly in operations, marketing and program management. The following June, Robinhood announced additional layoffs of 150 employees or about 7% of its staff.\nIn March 2024, Robinhood expanded its services to the United Kingdom. The following month, Robinhood launched its \"Sherwood News\" website and a rebrand of its financial newsletter Snacks.\nIn March 2025, Robinhood announced the launch of wealth management services. The following month, the Bank of Lithuania granted the company a brokerage license to operate in Lithuania. Soon after, Robinhood received its MiFID and MICA licenses, allowing Robinhood Europe to operate as a cryptocurrency exchange. In June 2025, the company launched trading in tokenized ETFs and stocks in the European Union.\n\nAcquisitions\nFinancing history\nIn December 2013, Robinhood closed its seed funding round, securing $3 million in an investment led by Index Ventures, with participation from Andreessen Horowitz, Rothenberg Ventures, Tim Draper, and Howard Lindzon. The following September, Robinhood raised $13 million in a Series A round, with returning investors Index Ventures and Howard Lindzon, as well as new investors Ribbit Capital, Aaron Levie, Dave Morin, Jared Leto, Snoop Dogg, and Nas. In May 2015, the company raised $50 million in a Series B round led by New Enterprise Associates.\nRobinhood raised $110 million in a Series C round at a $1.3 billion valuation in April 2017, bringing its total funding raised to $176 million. Investors included Yuri Milner of DST Global, Greenoaks Capital, and Thrive Capital. In May 2018, Robinhood closed a $363 million Series D financing round led by DST Global, bringing its total equity funding to $539 million. Robinhood raised $323 million in a Series E venture funding round led by DST Global, the following July.\nIn May 2020, Robinhood raised $280 million in a Series F venture funding round led by Sequoia Capital at a pre-money valuation of $8.3 billion. Three months later, the company announced a $200 million Series G funding round from a new investor, D1 Capital Partners.\nThe company went public via an initial public offering on the Nasdaq on July 29, 2021, raising approximately $2.1 billion and valuing Robinhood at about $32 billion.\nIn November 2022, as part of the bankruptcy of FTX, the U.S. government seized the 7.6% stake in Robinhood owned by Alameda Research, which were used as partial collateral for a transfer of at least $4 billion from FTX. The shares were sold back to Robinhood for $605 million, or $10.96 per share.\n\nControversies\nOrder execution\nRobinhood receives a significant portion of its revenue from payment for order flow and relies on this source of revenue more than its rivals. This has been criticized as a \"backdoor commission\" or kickback. The company has been criticized for routing orders to market makers that pay the most instead of those that offer the best order execution. The Financial Industry Regulatory Authority fined Robinhood $1.25 million in December 2019 for failing to ensure that its customers received the best price for orders, instead routing orders based on payments that it receives from market makers.\nIn December 2020, the company paid $65 million to settle accusations by the U.S. Securities and Exchange Commission that it failed to disclose these kickbacks, that Robinhood customers' orders were executed at prices that were inferior to other brokers' prices resulting in $34.1 million in losses by customers on certain trades compared to if they were executed by other brokers at the best execution, and that Robinhood made false and misleading statements to the contrary.\nAlso in December 2020, Robinhood was sued in the United States District Court for the Northern District of California for failing to disclose to customers that it received payment for order flow, leading to inferior trade prices. As of January 2025, the plaintiffs were seeking class action status. The case was consolidated with others under Kwon v. Robinhood Financial LLC.\n\nSecurity breaches\nIn July 2019, Robinhood admitted to storing some customer passwords in an unencrypted cleartext format within internal systems. However, the company found no evidence of abuse. Passwords were then hashed using the Bcrypt algorithm and the company advised customers to change their passwords.\nIn October 2020, Robinhood found that almost 2,000 Robinhood accounts were compromised and that the hackers had siphoned off customer funds. The incident did not stem from a breach of company systems; the users' personal email addresses had been compromised outside of Robinhood.\nIn November 2021, a voice phishing scheme on a Robinhood employee resulted in about 5 million customers having their email addresses stolen, 2 million customers having their full names disclosed and 300 customers having their dates of birth disclosed. It is believed that Conor Brian Fitzpatrick, owner of BreachForums, who was responsible for the 2021 FBI email hack and was arrested in March 2023, was responsible for the breach.\n\nSystem outages during the COVID-19 pandemic\nOn Monday, March 2, 2020, during the COVID-19 pandemic, likely due to high trading volumes, Robinhood suffered a systemwide, all-day outage that prevented users from accessing the mobile app on a day when the S&P 500 climbed more than 4.6%. Robinhood experienced shorter systemwide outages on March 3 and 9. Robinhood offered compensation on a case-by-case basis. In late June 2021, Robinhood was fined $57 million by the Financial Industry Regulatory Authority (FINRA) and was ordered to pay $13 million in restitution to clients affected by outages and misleading communications in March 2020 in the largest penalty ever issued by the agency. In March 2023, the company agreed to pay $10 million to settle class action lawsuits regarding trading losses due to the outages.\n\nSuicide of Alexander E. Kearns\nIn June 2020, 20-year old University of Nebraska–Lincoln student Alexander E. Kearns committed suicide after seeing a negative cash balance of $730,000 in his Robinhood account after the expiration, exercise, and assignment of options positions, likely a bull spread. It was later discovered that this balance was not complete as it did not reflect settlement of an offsetting position. In his suicide note, Kearns accused Robinhood of allowing him to take too much risk. The company also was criticized for not responding timely to inquiries by Kearns about the negative balance. Robinhood then began offering additional guidance and requiring additional criteria and education for customers seeking authorization to trade options. Kearns' family filed and later settled a wrongful death claim.\n\nRegulatory issues\nIn August 2022, Robinhood's cryptocurrency division was fined $30 million by the New York State Department of Financial Services for allegedly violating anti-money-laundering and cybersecurity regulations, in the department's first cryptocurrency-related enforcement action.\nOn December 16, 2020, the Securities Division of the Massachusetts Secretary of the Commonwealth filed an administrative complaint alleging violation of state securities laws by \"marketing itself to Massachusetts investors without regard for the best interests of its customers and failing to maintain the infrastructures and procedures necessary to meet the demands of its rapidly growing customer base\" and that Robinhood exploits novice investors with gamification. In March 2022, in a win for Robinhood, the Suffolk County Superior Court declared that the new fiduciary duty rule underlying parts of the case was invalid. In February 2024, the company paid $7.5 million and agreed to overhaul its digital engagement practices to settle the remaining claims.\nRobinhood received a Wells notice from the U.S. Securities and Exchange Commission in May 2024 alleging that the company had violated securities laws over crypto tokens traded on its platform; Robinhood countered that cryptocurrencies are not securities and are not covered by securities laws.\nIn September 2024, Robinhood paid $3.9 million and instituted changes to settle claims by the State of California that, between 2018 and 2022, customers could not make timely withdrawals of cryptocurrency from their Robinhood accounts to cryptocurrency wallets.\nIn March 2025, the Financial Industry Regulatory Authority imposed a $26 million penalty on Robinhood Financial and Robinhood Securities for violating numerous FINRA rules, including failing to establish and implement adequate anti-money laundering programs, which led to the firms’ inability to detect, investigate, or report suspicious activities such as manipulative trading, suspicious money movements, and cases of third-party account takeovers. Robinhood Financial was also ordered to pay $3.75 million in restitution to certain customers whose market orders were restricted and canceled, leading them to re-enter their orders and receive executions at a less favorable price.\n\n2021 short squeeze\nOn January 28, 2021, several stockbrokers, including Robinhood, restricted the trading of certain stocks, most notably GameStop, to meet collateral requirements at its clearing house, the National Securities Clearing Corporation, following an effort by users of the r/wallstreetbets subreddit to drive up share prices. Robinhood faced an increase in its collateral requirement from $700 million to $3.7 billion, later reduced to $1.4 billion, and the inability to meet this requirement may have resulted in insolvency in a matter similar to the bankruptcy of Lehman Brothers. Robinhood was able to quickly raise funds to meet the reduced requirements. The company began once again allowing trading in the affected stocks on January 29.\nThe decision to halt trading was criticized by customers as well as politicians including Ted Cruz and Alexandria Ocasio-Cortez. The House Committee on Financial Services questioned Robinhood CEO Vladimir Tenev during a hearing on February 18, 2021.\nFollowing the controversy, the Robinhood mobile app was review bombed on the Google Play app store. Google deleted at least 100,000 such reviews, calling them \"coordinated or inorganic\". However, after additional negative reviews on the app that resulted in a 1.1-star rating, Google confirmed that the new reviews do not violate Google policies and will not be removed.\nProtests were held outside Robinhood headquarters in Menlo Park, California, at the U.S. Securities and Exchange Commission headquarters in Washington, D.C., and the New York Stock Exchange.\nOn January 28, 2021, a class-action lawsuit against Robinhood was filed in the Southern District of New York alleging market manipulation and collusion with market maker Citadel Securities to deprive investors of the ability to invest in the open market in violation of Section 1 of the Sherman Antitrust Act, which prohibits agreements in restraint of trade. The case was dismissed by the Miami federal court in November 2021 on the grounds that the plaintiffs fell short of providing direct evidence of an antitrust conspiracy and that its terms of service allowed the company to prohibit trading by customers. In 2024, an appeals court affirmed the dismissal of the case.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Robinhood Markets, Inc.:",
  "clean_text": "Robinhood Markets, Inc. is an American financial services company based in Menlo Park, California. It provides an electronic trading platform that facilitates trades of stocks, exchange-traded funds, options, index options, futures contracts, outcomes on prediction markets, and cryptocurrency. It also offers cryptocurrency wallets, wealth management, credit cards and other banking services, some in partnership with banks insured by the FDIC, as well as a news website, Sherwood.News. The company's revenue comes from payment for order flow and commissions on options (27% of Q2 2025 revenues), cryptocurrency (16% of Q2 2025 revenues), equities (7% of Q2 2025 revenues), and other products such as futures and event contracts (5% of Q2 2025 revenues); net interest income (primarily from margin lending, interest earned on corporate and customer cash balances, securities lending, and credit cards; 36% of Q2 2025 revenues), and other sources (subscription fees and advertising revenue on Sherwood.News; 9% of Q2 2025 revenues). The company has 27.4 million funded customers and $279 billion in assets under custody. Its platform is available in the U.S., the UK, and, for trading cryptocurrency and tokenized stocks and ETFs only, in the European Union. Approximately 2 billion option contracts are traded annually on the Robinhood platform. The company is named after Robin Hood, based on its mission to \"provide everyone with access to the financial markets, not just the wealthy\". The company has been referred to as an innovator in zero-commission stock trading, as it relies on other sources of revenues. Robinhood has targeted millennials as customers; in March 2025, the average age of its customers was 35. The company does not allow trading in mutual funds, preferred stocks, bonds, some high-risk penny stocks, and new positions in options on their expiration dates in the last 30 minutes of the trading day. History Robinhood was founded in April 2013 by Vladimir Tenev and Baiju Bhatt, who had previously built high-frequency trading platforms for financial institutions in New York City. They aimed to design a mobile app that was free, easy to use, and addictive. Tenev and Bhatt served as co-CEOs from 2013 to 2020, when Tenev became the sole CEO and Bhatt became chief creative officer. The founders presented the mobile app at LA Hacks in April 2014 and launched a beta release in December on the Apple App Store. The mobile app was launched officially in March 2015. In February 2018, the company announced that it would be moving its headquarters from Palo Alto to the former headquarters of Sunset magazine in Menlo Park. That same month, Robinhood launched cryptocurrency trading. Robinhood launched banking products with insurance from the Federal Deposit Insurance Corporation via partner banks in December 2019. In the second quarter of 2020, during the 2020 stock market crash, compared to the first quarter of 2020, trading volumes increased 139%, more than any other major brokerage. In July 2021, the company went public and was listed on Nasdaq. In April 2022, Robinhood cut its workforce by 9%. In August that year, the company announced additional layoffs of 23% of its workforce, mostly in operations, marketing and program management. The following June, Robinhood announced additional layoffs of 150 employees or about 7% of its staff. In March 2024, Robinhood expanded its services to the United Kingdom. The following month, Robinhood launched its \"Sherwood News\" website and a rebrand of its financial newsletter Snacks. In March 2025, Robinhood announced the launch of wealth management services. The following month, the Bank of Lithuania granted the company a brokerage license to operate in Lithuania. Soon after, Robinhood received its MiFID and MICA licenses, allowing Robinhood Europe to operate as a cryptocurrency exchange. In June 2025, the company launched trading in tokenized ETFs and stocks in the European Union. Acquisitions Financing history In December 2013, Robinhood closed its seed funding round, securing $3 million in an investment led by Index Ventures, with participation from Andreessen Horowitz, Rothenberg Ventures, Tim Draper, and Howard Lindzon. The following September, Robinhood raised $13 million in a Series A round, with returning investors Index Ventures and Howard Lindzon, as well as new investors Ribbit Capital, Aaron Levie, Dave Morin, Jared Leto, Snoop Dogg, and Nas. In May 2015, the company raised $50 million in a Series B round led by New Enterprise Associates. Robinhood raised $110 million in a Series C round at a $1.3 billion valuation in April 2017, bringing its total funding raised to $176 million. Investors included Yuri Milner of DST Global, Greenoaks Capital, and Thrive Capital. In May 2018, Robinhood closed a $363 million Series D financing round led by DST Global, bringing its total equity funding to $539 million. Robinhood raised $323 million in a Series E venture funding round led by DST Global, the following July. In May 2020, Robinhood raised $280 million in a Series F venture funding round led by Sequoia Capital at a pre-money valuation of $8.3 billion. Three months later, the company announced a $200 million Series G funding round from a new investor, D1 Capital Partners. The company went public via an initial public offering on the Nasdaq on July 29, 2021, raising approximately $2.1 billion and valuing Robinhood at about $32 billion. In November 2022, as part of the bankruptcy of FTX, the U.S. government seized the 7.6% stake in Robinhood owned by Alameda Research, which were used as partial collateral for a transfer of at least $4 billion from FTX. The shares were sold back to Robinhood for $605 million, or $10.96 per share. Controversies Order execution Robinhood receives a significant portion of its revenue from payment for order flow and relies on this source of revenue more than its rivals. This has been criticized as a \"backdoor commission\" or kickback. The company has been criticized for routing orders to market makers that pay the most instead of those that offer the best order execution. The Financial Industry Regulatory Authority fined Robinhood $1.25 million in December 2019 for failing to ensure that its customers received the best price for orders, instead routing orders based on payments that it receives from market makers. In December 2020, the company paid $65 million to settle accusations by the U.S. Securities and Exchange Commission that it failed to disclose these kickbacks, that Robinhood customers' orders were executed at prices that were inferior to other brokers' prices resulting in $34.1 million in losses by customers on certain trades compared to if they were executed by other brokers at the best execution, and that Robinhood made false and misleading statements to the contrary. Also in December 2020, Robinhood was sued in the United States District Court for the Northern District of California for failing to disclose to customers that it received payment for order flow, leading to inferior trade prices. As of January 2025, the plaintiffs were seeking class action status. The case was consolidated with others under Kwon v. Robinhood Financial LLC. Security breaches In July 2019, Robinhood admitted to storing some customer passwords in an unencrypted cleartext format within internal systems. However, the company found no evidence of abuse. Passwords were then hashed using the Bcrypt algorithm and the company advised customers to change their passwords. In October 2020, Robinhood found that almost 2,000 Robinhood accounts were compromised and that the hackers had siphoned off customer funds. The incident did not stem from a breach of company systems; the users' personal email addresses had been compromised outside of Robinhood. In November 2021, a voice phishing scheme on a Robinhood employee resulted in about 5 million customers having their email addresses stolen, 2 million customers having their full names disclosed and 300 customers having their dates of birth disclosed. It is believed that Conor Brian Fitzpatrick, owner of BreachForums, who was responsible for the 2021 FBI email hack and was arrested in March 2023, was responsible for the breach. System outages during the COVID-19 pandemic On Monday, March 2, 2020, during the COVID-19 pandemic, likely due to high trading volumes, Robinhood suffered a systemwide, all-day outage that prevented users from accessing the mobile app on a day when the S&P 500 climbed more than 4.6%. Robinhood experienced shorter systemwide outages on March 3 and 9. Robinhood offered compensation on a case-by-case basis. In late June 2021, Robinhood was fined $57 million by the Financial Industry Regulatory Authority (FINRA) and was ordered to pay $13 million in restitution to clients affected by outages and misleading communications in March 2020 in the largest penalty ever issued by the agency. In March 2023, the company agreed to pay $10 million to settle class action lawsuits regarding trading losses due to the outages. Suicide of Alexander E. Kearns In June 2020, 20-year old University of Nebraska–Lincoln student Alexander E. Kearns committed suicide after seeing a negative cash balance of $730,000 in his Robinhood account after the expiration, exercise, and assignment of options positions, likely a bull spread. It was later discovered that this balance was not complete as it did not reflect settlement of an offsetting position. In his suicide note, Kearns accused Robinhood of allowing him to take too much risk. The company also was criticized for not responding timely to inquiries by Kearns about the negative balance. Robinhood then began offering additional guidance and requiring additional criteria and education for customers seeking authorization to trade options. Kearns' family filed and later settled a wrongful death claim. Regulatory issues In August 2022, Robinhood's cryptocurrency division was fined $30 million by the New York State Department of Financial Services for allegedly violating anti-money-laundering and cybersecurity regulations, in the department's first cryptocurrency-related enforcement action. On December 16, 2020, the Securities Division of the Massachusetts Secretary of the Commonwealth filed an administrative complaint alleging violation of state securities laws by \"marketing itself to Massachusetts investors without regard for the best interests of its customers and failing to maintain the infrastructures and procedures necessary to meet the demands of its rapidly growing customer base\" and that Robinhood exploits novice investors with gamification. In March 2022, in a win for Robinhood, the Suffolk County Superior Court declared that the new fiduciary duty rule underlying parts of the case was invalid. In February 2024, the company paid $7.5 million and agreed to overhaul its digital engagement practices to settle the remaining claims. Robinhood received a Wells notice from the U.S. Securities and Exchange Commission in May 2024 alleging that the company had violated securities laws over crypto tokens traded on its platform; Robinhood countered that cryptocurrencies are not securities and are not covered by securities laws. In September 2024, Robinhood paid $3.9 million and instituted changes to settle claims by the State of California that, between 2018 and 2022, customers could not make timely withdrawals of cryptocurrency from their Robinhood accounts to cryptocurrency wallets. In March 2025, the Financial Industry Regulatory Authority imposed a $26 million penalty on Robinhood Financial and Robinhood Securities for violating numerous FINRA rules, including failing to establish and implement adequate anti-money laundering programs, which led to the firms’ inability to detect, investigate, or report suspicious activities such as manipulative trading, suspicious money movements, and cases of third-party account takeovers. Robinhood Financial was also ordered to pay $3.75 million in restitution to certain customers whose market orders were restricted and canceled, leading them to re-enter their orders and receive executions at a less favorable price. 2021 short squeeze On January 28, 2021, several stockbrokers, including Robinhood, restricted the trading of certain stocks, most notably GameStop, to meet collateral requirements at its clearing house, the National Securities Clearing Corporation, following an effort by users of the r/wallstreetbets subreddit to drive up share prices. Robinhood faced an increase in its collateral requirement from $700 million to $3.7 billion, later reduced to $1.4 billion, and the inability to meet this requirement may have resulted in insolvency in a matter similar to the bankruptcy of Lehman Brothers. Robinhood was able to quickly raise funds to meet the reduced requirements. The company began once again allowing trading in the affected stocks on January 29. The decision to halt trading was criticized by customers as well as politicians including Ted Cruz and Alexandria Ocasio-Cortez. The House Committee on Financial Services questioned Robinhood CEO Vladimir Tenev during a hearing on February 18, 2021. Following the controversy, the Robinhood mobile app was review bombed on the Google Play app store. Google deleted at least 100,000 such reviews, calling them \"coordinated or inorganic\". However, after additional negative reviews on the app that resulted in a 1.1-star rating, Google confirmed that the new reviews do not violate Google policies and will not be removed. Protests were held outside Robinhood headquarters in Menlo Park, California, at the U.S. Securities and Exchange Commission headquarters in Washington, D.C., and the New York Stock Exchange. On January 28, 2021, a class-action lawsuit against Robinhood was filed in the Southern District of New York alleging market manipulation and collusion with market maker Citadel Securities to deprive investors of the ability to invest in the open market in violation of Section 1 of the Sherman Antitrust Act, which prohibits agreements in restraint of trade. The case was dismissed by the Miami federal court in November 2021 on the grounds that the plaintiffs fell short of providing direct evidence of an antitrust conspiracy and that its terms of service allowed the company to prohibit trading by customers. In 2024, an appeals court affirmed the dismissal of the case."
}