{
  "ticker": "HPE",
  "cik": "0001645590",
  "company_name": "Hewlett Packard Enterprise",
  "corrected_name": "Hewlett Packard Enterprise",
  "wiki_title_used": "Hewlett Packard Enterprise",
  "exists": true,
  "raw_text": "The Hewlett Packard Enterprise Company (HPE) is an American multinational information technology company based in Spring, Texas. It is a business-focused organization which works in servers, storage, networking, containerization software and consulting and support. HPE was ranked No. 107 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.\nHPE was founded on November 1, 2015, in Palo Alto, California, as part of the splitting of the Hewlett-Packard company. The split was structured so that the former Hewlett-Packard Company would change its name to HP Inc. and spin off Hewlett Packard Enterprise as a newly created company. HP Inc. retained the old HP's personal computer and printing business, as well as its stock-price history and original NYSE ticker symbol for Hewlett-Packard; Enterprise trades under its own ticker symbol: HPE. At the time of the spin-off, HPE's revenue was slightly less than that of HP Inc. The company relocated to Texas in 2020.\nIn 2017, HPE spun off its Enterprise Services business and merged it with Computer Sciences Corporation to become DXC Technology. Also in 2017, it spun off its software business segment and merged it with Micro Focus. Also in 2024, as part of the change in strategy, HPE's telecommunications business unit, the Communication Technology Group (CTG), was acquired by HCLTech for $225 million.\n\nNaming\nThe full name for the company is \"Hewlett Packard Enterprise Company\", which drops the hyphen that previously existed between the \"Hewlett\" and \"Packard\" of the former Hewlett-Packard Company. The company is commonly referred to as \"Hewlett Packard Enterprise\" or by its initials \"HPE\".\nThe company has also been referred to as \"HP Enterprise\" by some media outlets and has even been incorrectly referred to as \"HP Enterprises\".\n\nHistory\nIn May 2016, the company announced it would sell its enterprise services division to one of its competitors, Computer Sciences Corporation in a deal valued at US$8.5 billion. The merger of HPE Enterprise Services with CSC, to form a new company DXC Technology, was completed on March 10, 2017. Approximately 100,000 current HPE employees were affected. More than 30,000 services employees from other areas of the HPE business remained at HPE including technology services support and consulting as well as software professional services.\nIn August 2016, the company announced plans to acquire Silicon Graphics International (SGI), known for their capabilities in high performance computing. On November 1, 2016, HPE announced it completed the acquisition, for US$7.75 per share in cash, a transaction valued at approximately US$275 million, net of cash and debt.\nOn September 7, 2016, HPE announced a \"spin-merge\" with Micro Focus, who would acquire HPE's \"non-core\" software (which included the HP Autonomy unit), and HPE shareholders would own 50.1 percent of the merged company, which would retain its current name. The merger concluded on September 1, 2017.\n\nIn September 2016, Hewlett Packard Enterprise transferred two patents to Texas-based wholly owned shell company Plectrum LLC. These two patents were originated at 3Com Corporation, which was bought by HP in 2010, along with about 1,400 patents.\nOn April 11, 2017, it was reported that Synack had raised US$21 million in a round of funding that included Hewlett Packard Enterprise.\nIn January 2017, the company acquired data management platform SimpliVity, the developer of the OmniCube hyper-converged infrastructure appliance, for US$650M.\nIn April 2017, Hewlett Packard Enterprise completed its acquisition of hybrid flash and all flash manufacturer, Nimble Storage Inc, for US$1.2 billion or US$12.50 per share. In October, Reuters reported that the company had allowed a Russian defense agency to examine a cyber-defense system used by The Pentagon. The report noted: \"Six former U.S. intelligence officials, as well as former ArcSight [Hewlett Packard Enterprise] employees and independent security experts, said the source code review could help Moscow discover weaknesses in the software, potentially helping attackers to blind the U.S. military to a cyber attack.\"\n\nIn November 2017, Meg Whitman announced that she would be stepping down as CEO, after six years at the helm of HP and HPE, stating that, on February 1, 2018, Antonio Neri would officially become HPE's president and chief executive officer. The announcement created controversy leading to a 6% drop in stock price, which quickly recovered during the next few days.\nIn June 2018, Hewlett Packard Enterprise launched a hybrid cloud service called GreenLake Hybrid Cloud, built on top of HPE's OneSphere cloud management SaaS console, offered under its brand HPE GreenLake. GreenLake is designed to provide cloud management, cost control, and compliance control capabilities, and will run on AWS and Microsoft Azure. GreenLake includes cloud data services for containers, machine learning, storage, compute, data protection and networking through a management portal called GreenLake Central.\nIn February 2019, Meg Whitman announced she would not be seeking re-election to the board of directors, ending her professional involvement in HPE.\nIn May 2019, Hewlett Packard Enterprise announced plans to acquire Cray Inc for US$35 per share. The announcement came soon after Cray had landed a US$600 million US Department of Energy contract to supply the Frontier supercomputer to Oak Ridge National Laboratory in 2021. The acquisition was completed in September 2019 in a transaction valued at approximately US$1.4 billion.\nIn December 2020, Hewlett Packard Enterprise disclosed it is relocating its corporate headquarters from San Jose, California, to Spring, Texas, a northern suburb of Houston. From December 2021 to April 2022, HPE headquarters was located at the former HP property and headquarters campus of Compaq in northwest Harris County near SH 249 and Louetta. Construction of the new Springwoods Village campus in Spring was completed in early 2022. Concerns about major flooding at the Compaq complex were a contributing factor for HPE CEO Antonio Neri to have the new campus built. The old campus had previously been flooded by Hurricane Harvey in 2017. In April 2022, HPE relocated from the Compaq complex to its recently finished Spring campus, coinciding with the sale of the former complex to Mexican beverage distributor Mexcor that month.\nHPE's proposed $14 billion acquisition of Juniper Networks was subjected to an investigation by the UK's antitrust watchdog, the Competition and Markets Authority. On June 19, 2024, the Competition and Markets Authority announced that it had initiated a merger inquiry to assess potential competition concerns arising from the deal, setting an August 14, 2024 deadline to decide whether to conduct a full investigation. At the time the deal was announced, HPE had agreed to pay $40 per share in cash for Juniper. In January 2025, the US Department of Justice Antitrust Division filed an antitrust lawsuit against HPE to block its acquisition of Juniper Networks, alleging that the proposed deal would raise prices, harm competition, and reduce innovation. Following a settlement with the DOJ, in which HPE agreed to divest their Instant On wireless division and license the source code for Juniper's Mist AI (a key component of Juniper's WLAN products), the acquisition was completed on July 2, 2025. Later that month, Axios reported that the U.S. Intelligence Community had earlier directly intervened to persuade DOJ to allow the acquisition, arguing that blocking the merger would have harmed U.S. companies and strengthened Chinese competitors—particularly Huawei—framing the decision as critical to national security. In September 2025, attorneys general from 20 states voiced support of further investigation in a letter to the courts. The letter proposed that the acquisition may not be in the best interest of the public.\n\nCorporate affairs\nThe company's headquarters is in Houston, in a limited purpose annexation area.\n\nOperating segments\nIntelligent Edge (10% of FY20 revenue) – offers platforms designed for network security, including Aruba Networks and Silver Peak Systems\nHPC & MCS (11% of FY20 revenue) – High Performance Compute and Mission Critical Systems. Also includes Hewlett Packard Labs\nCompute (44% of FY20 revenue) – the core server business\nStorage (17% of FY20 revenue) – the core storage business, including recent acquisition Zerto\nHPE Financial Services (12% of FY20 revenue) – provides financing services for HPE customers and partners\nA&PS (4% of FY20 revenue) – Advisory and Professional Services through 'HPE Pointnext'.\nCorporate Investments (2% of FY20 revenue) – includes 'HPE Pathfinder' (HPE's venture capital arm) and the Communications Technology Group\nCEO Antonio Neri announced in 2019 that he expects all products to be sold 'as a service' by 2022  via HPE Greenlake.\n\nFinances\nThe key trends for Hewlett Packard Enterprise are (as of the financial year ending December 31):\n\nOwnership\nHPE is mainly owned by institutional investors, who hold around 88% of all shares. The 5 largest shareholders in mid-2025 were:\n\nVanguard Group Inc (169,804,055 shares held)\nBlackrock Inc. (137,553,957 shared held)\nCapital World Investors (73,552,085 shares held)\nBank of America (51,846,776 shares held)\nJPMorgan Chase (47,124,039 shares held)\n\nProducts\nIntelligent Edge: Aruba Networks, Silver Peak Systems, FlexFabric\nHPC & MCS: Apollo (High-Performance Computing), Cray\nCompute: HP XP, HPE GreenLake Hybrid Cloud, Edgeline, Cloudline, Synergy, OneView, OneSphere, ProLiant, Synergy, Cloudline, Edgeline, HPE Integrity Servers, NonStop, HPE Superdome, Apollo (High-Performance Computing), Simplivity (HyperConvergence)\nStorage: HPE 3PAR, StoreOnce, StoreEver, Nimble Storage, HP XP, HPE GreenLake Hybrid Cloud, HPE Alletra, HPE Primera, MSA, Nimble & Alletra dHCI\nCommunications Technology Group: OpenCall and Service Activator\n\nHuman Rights Violations\nIn 2025 the Office of the United Nations High Commissioner for Human Rights (OHCHR) published a report on companies facilitating the occupation of Palestine. Hewlett Packard Enterprise (HPE) is clearly identified by the report, that indicates \"Before IBM, Hewlett Packard Enterprises (HPE) maintained the database and its Israeli subsidiary is still providing servers. Hewlett Packard (HP) has long enabled the apartheid systems of Israel, supplying technology to the Coordination of Government Activities in the Territories (COGAT), the prison service and police. Since the 2015 split of the company into Hewlett Packard Enterprises and HP Inc., opaque business structures have obscured the roles of their seven remaining Israeli subsidiaries.\"\nFor more details, see Hewlett-Packard Israel.\n\nAcquisitions\nNote: Aruba Networks was acquired by the Hewlett-Packard Company before demerger and was inducted into Hewlett Packard Enterprise while demerging.\n\nCarbon footprint\nHPE reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 30 September 2020 at 343 Kt (-48 /-12.4% y-o-y). The company commits to reduce emissions by 55% by 2025 from 2016 base year, and this science-based target is aligned with the Paris Agreement to limit global warming to 1.5 °C above pre-industrial levels.\n\nSee also\nList of networking hardware vendors\nHP Inc. – the demerged sibling company that offers printers and personal computers.\nHP Release Control\nHewlett Packard Labs – the research & development arm of Hewlett Packard Enterprise.\n\nReferences\nExternal links\nOfficial website",
  "clean_text": "The Hewlett Packard Enterprise Company (HPE) is an American multinational information technology company based in Spring, Texas. It is a business-focused organization which works in servers, storage, networking, containerization software and consulting and support. HPE was ranked No. 107 in the 2018 Fortune 500 list of the largest United States corporations by total revenue. HPE was founded on November 1, 2015, in Palo Alto, California, as part of the splitting of the Hewlett-Packard company. The split was structured so that the former Hewlett-Packard Company would change its name to HP Inc. and spin off Hewlett Packard Enterprise as a newly created company. HP Inc. retained the old HP's personal computer and printing business, as well as its stock-price history and original NYSE ticker symbol for Hewlett-Packard; Enterprise trades under its own ticker symbol: HPE. At the time of the spin-off, HPE's revenue was slightly less than that of HP Inc. The company relocated to Texas in 2020. In 2017, HPE spun off its Enterprise Services business and merged it with Computer Sciences Corporation to become DXC Technology. Also in 2017, it spun off its software business segment and merged it with Micro Focus. Also in 2024, as part of the change in strategy, HPE's telecommunications business unit, the Communication Technology Group (CTG), was acquired by HCLTech for $225 million. Naming The full name for the company is \"Hewlett Packard Enterprise Company\", which drops the hyphen that previously existed between the \"Hewlett\" and \"Packard\" of the former Hewlett-Packard Company. The company is commonly referred to as \"Hewlett Packard Enterprise\" or by its initials \"HPE\". The company has also been referred to as \"HP Enterprise\" by some media outlets and has even been incorrectly referred to as \"HP Enterprises\". History In May 2016, the company announced it would sell its enterprise services division to one of its competitors, Computer Sciences Corporation in a deal valued at US$8.5 billion. The merger of HPE Enterprise Services with CSC, to form a new company DXC Technology, was completed on March 10, 2017. Approximately 100,000 current HPE employees were affected. More than 30,000 services employees from other areas of the HPE business remained at HPE including technology services support and consulting as well as software professional services. In August 2016, the company announced plans to acquire Silicon Graphics International (SGI), known for their capabilities in high performance computing. On November 1, 2016, HPE announced it completed the acquisition, for US$7.75 per share in cash, a transaction valued at approximately US$275 million, net of cash and debt. On September 7, 2016, HPE announced a \"spin-merge\" with Micro Focus, who would acquire HPE's \"non-core\" software (which included the HP Autonomy unit), and HPE shareholders would own 50.1 percent of the merged company, which would retain its current name. The merger concluded on September 1, 2017. In September 2016, Hewlett Packard Enterprise transferred two patents to Texas-based wholly owned shell company Plectrum LLC. These two patents were originated at 3Com Corporation, which was bought by HP in 2010, along with about 1,400 patents. On April 11, 2017, it was reported that Synack had raised US$21 million in a round of funding that included Hewlett Packard Enterprise. In January 2017, the company acquired data management platform SimpliVity, the developer of the OmniCube hyper-converged infrastructure appliance, for US$650M. In April 2017, Hewlett Packard Enterprise completed its acquisition of hybrid flash and all flash manufacturer, Nimble Storage Inc, for US$1.2 billion or US$12.50 per share. In October, Reuters reported that the company had allowed a Russian defense agency to examine a cyber-defense system used by The Pentagon. The report noted: \"Six former U.S. intelligence officials, as well as former ArcSight [Hewlett Packard Enterprise] employees and independent security experts, said the source code review could help Moscow discover weaknesses in the software, potentially helping attackers to blind the U.S. military to a cyber attack.\" In November 2017, Meg Whitman announced that she would be stepping down as CEO, after six years at the helm of HP and HPE, stating that, on February 1, 2018, Antonio Neri would officially become HPE's president and chief executive officer. The announcement created controversy leading to a 6% drop in stock price, which quickly recovered during the next few days. In June 2018, Hewlett Packard Enterprise launched a hybrid cloud service called GreenLake Hybrid Cloud, built on top of HPE's OneSphere cloud management SaaS console, offered under its brand HPE GreenLake. GreenLake is designed to provide cloud management, cost control, and compliance control capabilities, and will run on AWS and Microsoft Azure. GreenLake includes cloud data services for containers, machine learning, storage, compute, data protection and networking through a management portal called GreenLake Central. In February 2019, Meg Whitman announced she would not be seeking re-election to the board of directors, ending her professional involvement in HPE. In May 2019, Hewlett Packard Enterprise announced plans to acquire Cray Inc for US$35 per share. The announcement came soon after Cray had landed a US$600 million US Department of Energy contract to supply the Frontier supercomputer to Oak Ridge National Laboratory in 2021. The acquisition was completed in September 2019 in a transaction valued at approximately US$1.4 billion. In December 2020, Hewlett Packard Enterprise disclosed it is relocating its corporate headquarters from San Jose, California, to Spring, Texas, a northern suburb of Houston. From December 2021 to April 2022, HPE headquarters was located at the former HP property and headquarters campus of Compaq in northwest Harris County near SH 249 and Louetta. Construction of the new Springwoods Village campus in Spring was completed in early 2022. Concerns about major flooding at the Compaq complex were a contributing factor for HPE CEO Antonio Neri to have the new campus built. The old campus had previously been flooded by Hurricane Harvey in 2017. In April 2022, HPE relocated from the Compaq complex to its recently finished Spring campus, coinciding with the sale of the former complex to Mexican beverage distributor Mexcor that month. HPE's proposed $14 billion acquisition of Juniper Networks was subjected to an investigation by the UK's antitrust watchdog, the Competition and Markets Authority. On June 19, 2024, the Competition and Markets Authority announced that it had initiated a merger inquiry to assess potential competition concerns arising from the deal, setting an August 14, 2024 deadline to decide whether to conduct a full investigation. At the time the deal was announced, HPE had agreed to pay $40 per share in cash for Juniper. In January 2025, the US Department of Justice Antitrust Division filed an antitrust lawsuit against HPE to block its acquisition of Juniper Networks, alleging that the proposed deal would raise prices, harm competition, and reduce innovation. Following a settlement with the DOJ, in which HPE agreed to divest their Instant On wireless division and license the source code for Juniper's Mist AI (a key component of Juniper's WLAN products), the acquisition was completed on July 2, 2025. Later that month, Axios reported that the U.S. Intelligence Community had earlier directly intervened to persuade DOJ to allow the acquisition, arguing that blocking the merger would have harmed U.S. companies and strengthened Chinese competitors—particularly Huawei—framing the decision as critical to national security. In September 2025, attorneys general from 20 states voiced support of further investigation in a letter to the courts. The letter proposed that the acquisition may not be in the best interest of the public. Corporate affairs The company's headquarters is in Houston, in a limited purpose annexation area. Operating segments Intelligent Edge (10% of FY20 revenue) – offers platforms designed for network security, including Aruba Networks and Silver Peak Systems HPC & MCS (11% of FY20 revenue) – High Performance Compute and Mission Critical Systems. Also includes Hewlett Packard Labs Compute (44% of FY20 revenue) – the core server business Storage (17% of FY20 revenue) – the core storage business, including recent acquisition Zerto HPE Financial Services (12% of FY20 revenue) – provides financing services for HPE customers and partners A&PS (4% of FY20 revenue) – Advisory and Professional Services through 'HPE Pointnext'. Corporate Investments (2% of FY20 revenue) – includes 'HPE Pathfinder' (HPE's venture capital arm) and the Communications Technology Group CEO Antonio Neri announced in 2019 that he expects all products to be sold 'as a service' by 2022 via HPE Greenlake. Finances The key trends for Hewlett Packard Enterprise are (as of the financial year ending December 31): Ownership HPE is mainly owned by institutional investors, who hold around 88% of all shares. The 5 largest shareholders in mid-2025 were: Vanguard Group Inc (169,804,055 shares held) Blackrock Inc. (137,553,957 shared held) Capital World Investors (73,552,085 shares held) Bank of America (51,846,776 shares held) JPMorgan Chase (47,124,039 shares held) Products Intelligent Edge: Aruba Networks, Silver Peak Systems, FlexFabric HPC & MCS: Apollo (High-Performance Computing), Cray Compute: HP XP, HPE GreenLake Hybrid Cloud, Edgeline, Cloudline, Synergy, OneView, OneSphere, ProLiant, Synergy, Cloudline, Edgeline, HPE Integrity Servers, NonStop, HPE Superdome, Apollo (High-Performance Computing), Simplivity (HyperConvergence) Storage: HPE 3PAR, StoreOnce, StoreEver, Nimble Storage, HP XP, HPE GreenLake Hybrid Cloud, HPE Alletra, HPE Primera, MSA, Nimble & Alletra dHCI Communications Technology Group: OpenCall and Service Activator Human Rights Violations In 2025 the Office of the United Nations High Commissioner for Human Rights (OHCHR) published a report on companies facilitating the occupation of Palestine. Hewlett Packard Enterprise (HPE) is clearly identified by the report, that indicates \"Before IBM, Hewlett Packard Enterprises (HPE) maintained the database and its Israeli subsidiary is still providing servers. Hewlett Packard (HP) has long enabled the apartheid systems of Israel, supplying technology to the Coordination of Government Activities in the Territories (COGAT), the prison service and police. Since the 2015 split of the company into Hewlett Packard Enterprises and HP Inc., opaque business structures have obscured the roles of their seven remaining Israeli subsidiaries.\" For more details, see Hewlett-Packard Israel. Acquisitions Note: Aruba Networks was acquired by the Hewlett-Packard Company before demerger and was inducted into Hewlett Packard Enterprise while demerging. Carbon footprint HPE reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 30 September 2020 at 343 Kt (-48 /-12.4% y-o-y). The company commits to reduce emissions by 55% by 2025 from 2016 base year, and this science-based target is aligned with the Paris Agreement to limit global warming to 1.5 °C above pre-industrial levels."
}