{
  "ticker": "HRL",
  "cik": "0000048465",
  "company_name": "Hormel Foods",
  "corrected_name": "Hormel Foods",
  "wiki_title_used": "Hormel Foods",
  "exists": true,
  "raw_text": "Hormel Foods Corporation, doing business as Hormel Foods or simply Hormel, is an American multinational food processing company founded in 1891 in Austin, Minnesota, by George A. Hormel as George A. Hormel & Company. The company originally focused on the packaging and selling of ham, sausage and other pork, chicken, beef and lamb products to consumers, adding Spam in 1937. By the 1980s, Hormel began offering a wider range of packaged and refrigerated foods. The company changed its name to Hormel Foods Corporation in 1993 and uses the Hormel brand on many of its products; the company's other brands include Planters, Columbus Craft Meats, Dinty Moore, Jennie-O, and Skippy. The company's products are available in over 80 countries.\n\nHistory\n1890–1920\nThe company was founded as George A. Hormel & Company in Austin, Minnesota, by George A. Hormel in 1891. It changed its name to Hormel Foods in 1993.\nBorn 1860 in Buffalo, New York, Hormel worked in a Chicago slaughterhouse before becoming a traveling wool and hide buyer. His travels took him to Austin and he decided to settle there. He borrowed $500 and opened a meat business. Hormel handled the production side of the business and his partner, Albert Friedrich, handled the retail. Their partnership dissolved in 1891 as Hormel started his own meat packing operation in northeast Austin in a creamery building on the Cedar River.\nTo make ends meet in those early days, Hormel continued to trade in hides, eggs, wool, and poultry. The name Dairy Brand was first used in 1903. In the first decade of the 20th century distribution centers were opened in St. Paul, Minneapolis, Duluth, San Antonio, Dallas, Chicago, Atlanta, and Birmingham.\nIn 1915, Hormel began selling dry sausages under the names of Cedar Cervelat, Holsteiner and Noxall Salami. Hormel products began appearing in national magazines, such as Good Housekeeping, as early as 1916.\n\n1920–1950\nIn 1921, when George's son Jay Hormel returned from service in World War I, he uncovered that assistant controller Cy Thomson had embezzled $1,187,000 from the company over the previous ten years. The scandal provided George Hormel with additional incentive to professionalize his company. He did so by arranging for more reliable capital management, by dismissing unproductive employees, and by continuing to develop new products, reportedly with the mantra \"Originate, don't imitate\". In 1926, the company introduced Hormel Flavor-Sealed Ham, America's first canned ham, and added a canned chicken product line in 1928. Throughout the 1930s, Hormel ads were featured on the radio program The George Burns and Gracie Allen Show.\nIn 1933, workers, led by itinerant butcher Frank Ellis, formed the Independent Union of All Workers and conducted one of the nation's first successful sit-down strikes; the union would later join the Congress of Industrial Organizations (CIO, later AFL-CIO).\nHormel Chili and Spam were introduced in 1936 and 1937 respectively. In 1938, Jay C. Hormel introduced the \"Joint Savings Plan\" which allowed employees to share in the profits of the company.\nBy 1942, George and Jay established the Hormel Foundation to act as trustees of the family trusts. The Foundation funded the Hormel Institute at the University of Minnesota, initially started with a study of the food value of soybeans. The institute's scope later grew towards studying nutrition, animal diseases and food technology. Hormel's production increased to aid in World War II and 65% of its products were purchased by the U.S. government by 1945. founder George Hormel died in March 1946 at age 85.\n\n1950–2000\nDuring six years of the 1950s, Hormel Foods used an advertising campaign produced by Al Sheehan where pretty girls in white cars sold the company's meat products.\nIn 1959, Hormel was the first meatpacker to receive the Seal of Approval of the American Humane Society for its practice of anesthetizing animals before slaughter.\n\nLittle Sizzlers sausages were introduced in 1961 and Cure 81 hams were introduced in 1963. Little Sizzler's sausage has been discontinued per 10/10/19 email from Hormel's Customer Service.\nNot-So-Sloppy-Joe Sloppy Joe sauce made its debut in 1985. In 1986, Hormel Foods acquired Jennie-O Foods and also began an exclusive licensing arrangement to produce Chi-Chi's brand products. The following year, Hormel Foods introduced the Top Shelf line of microwavable non-frozen products. The company added to their poultry offerings by purchasing Chicken by George, created by former Miss America Phyllis George, in 1988. That same year, Hormel Foods also introduced microwave bacon. In 1984, Hormel introduced the Frank 'n Stuff brand of stuffed hot dogs.\nIn August 1985, Hormel workers went on strike at the Hormel headquarters in Austin, Minnesota. In the early 1980s, recession impacted several meatpacking companies, decreasing demand and increasing competition which led smaller and less-efficient companies to go out of business. In an effort to keep plants from closing, many instituted wage cuts. Wilson Food Company declared bankruptcy in 1983, allowing them to cut wages from $10.69 to $6.50 and significantly reduce benefits. Hormel Foods had avoided such drastic action, but by 1985, pressure to stay competitive remained.\nWorkers had already labored under a wage freeze and dangerous working conditions, leading to many cases of repetitive strain injury. When management demanded a 23% wage cut from the workers they decided to begin the strike. It became one of the longest strikes of the 1980s.\nThe local chapter of the United Food and Commercial Workers Union, Local P-9, led the strike, but was not supported by their parent union. A commemorative mural painted by Mike Alewitz and P-9 workers during the strike was destroyed by the UFCW months after the strike ended. The strike gained national attention and led to a widely publicized consumer boycott of Hormel products. The strike ended in June 1986, after lasting 10 months.\n\n2000–2010\nThe Spam Museum in Austin, Minnesota, was opened in 2001. That same year, Hormel Foods acquired the Turkey Store, the business was combined with Jennie-O Foods to form Jennie-O Turkey Store.\nAccording to Triple Pundit, Hormel Foods began CSR reporting in 2006. The company has been included in Corporate Responsibility magazine's list of the \"100 best corporate citizens\" for 10 consecutive years.\nIn 2008 an article in the New York Times, \"SPAM Turns Serious and Hormel Turns Out More\", detailed an overwhelming spike in the demand for SPAM, perhaps due to the flagging economy. In 2009 Hormel and Herdez del Fuerte created the joint venture MegaMex Foods to market and distribute Mexican food in the United States. Brands included in the venture include Herdez, La Victoria, Chi Chi's, El Torito, Embasa, Wholly Guacamole, Del Fuerte, Dona Maria, Bufalo, and Don Miguel.\nIn September 2008, animal rights organization PETA released a video recorded over the course of three months showing workers at a pig factory farm in Iowa abusing pigs. The factory farm was owned by Natural Pork Production II LLP of Iowa until August 18, 2008, at which point ownership had transferred to MowMar LLP. Hormel spokeswoman Julie Henderson Craven, who responded to the PETA video, called the videotaped abuses \"completely unacceptable\". In their 2007 Corporate Responsibility Report, Hormel Foods stated that all suppliers are expected to comply with several welfare programs to ensure that the hogs purchased are treated humanely. Because of the investigation, several employees of the farm were fired and six individuals faced charges due to the abuse.\n\n2010–present\nIn 2011, Hormel Foods announced a two-for-one stock split. In 2013, Hormel Foods purchased Skippy—the best-selling brand of peanut butter in China and the second-best-selling brand in the world—from Unilever for $700 million; the sale included Skippy's American and Chinese factories.\nIn May 2015, Hormel revealed it would acquire meat-processing firm Applegate Farms for around $775 million, expanding its range of meat products.\nIn 2015, the Hormel Health Labs division of Hormel Foods launched its Hormel Vital Cuisine line of packaged ready to eat meals, nutrition shakes and whey protein powders geared towards cancer patients and made available for home delivery. The line was developed in concert with three parties, as \"Hormel brought food formulation, packaging and shelf stability knowledge, (chef de cuisine) Ron DeSantis brought taste and texture expertise, and the Cancer Nutrition Consortium offered the nutritional framework.\"\nIn 2015, SPAMMY became available for purchase under Title I for U.S. Department of Agriculture (USDA) feeding programs and Title II for U.S. Agency for International Development (USAID) programs under the name fortified poultry-based spread (FPBS). Four years earlier, the company had made an initial three-year commitment to deliver 1 million cans of this product to in-need families in Guatemala.\nAlso in 2015, after an undercover investigation by a group known as Compassion Over Killing at an Austin, Minnesota, processing plant, Hormel Foods announced it was \"bringing humane handling officers to a Quality Pork Processors Incorporated facility to ensure compliance with its own animal welfare standards\". It has also told QPP to provide extra training, enhance compliance oversight and increase third-party auditing. According to Reuters, \"in one scene of the video, pigs covered in feces or pus-filled abscesses are sent down the plant's conveyor belt. At one point, a knife is used to cut open abscesses on dead pigs.\"\nIn 2016, Peak Rock Capital purchased the Diamond Crystal Brands Inc. unit, purchased by Hormel in 2002 for $155 million from Imperial Sugar. Also in 2016, Hormel acquired the nut butter producer Justin's for 280 million.\nIn 2016, 2017, and 2018, the company was named as one of the Human Rights Campaign's Best Places to Work for LGBT equality. In 2019, Hormel was again named to one of the best places to work for LGBT equality, as the company obtained a 95 out of 100 score in the Human Rights Campaign's Corporate Equality Index. The almost-perfect score was due to the area of \"equivalency in same and different-sex domestic partner medical and soft benefits\", where Hormel received half-credit for providing parity in some, but not all, benefits.\nIn 2017, Hormel sold Clougherty Packing, owner of the Farmer John and Saag's brands, to Smithfield Foods.\nIn October 2017, Hormel announced it would acquire deli meat company Columbus Manufacturing for $850 million.\nIn 2017, Mercy For Animals released undercover video footage of pigs being abused at The Maschhoffs LLC., a Hormel pork supplier in Hinton, Oklahoma, with piglets being castrated and having their tails cut off without any anesthetic, piglets left to suffer from untreated illness or injuries, and mother pigs crammed into gestation crates unable to move. In response, Hormel temporarily suspended its buying from the supplier.\nAccording to the Military Times, the company has been listed in the top 100 Best for Vets Employers category consistently since 2013.\nIn April 2019, together with Harvard University Dining Services, the company hosted the Small Change Big Impact Food Summit at Harvard University.\nIn September 2019, Hormel Foods announced that they had achieved their non-renewable energy use reduction goal a year ahead of schedule.\nAlso in September 2019, the company launched a vegetarian meat alternative called Happy Little Plants for foodservice and retail customers.\nOn September 18, 2020, Hormel Foods hosted the world's largest virtual pizza party, when more than 3,000 people joined a Zoom-hosted pizza party. In order to break the record, at least 500 photos of individuals needed to be uploaded during the one-hour event. The final tally was 907 photos.\nIn February 2021, Kraft Heinz sold Planters and its other nuts businesses to Hormel for $3.35 billion.\n\nEffect of the COVID-19 pandemic\nOn April 18, 2020, local health officials shut down a Hormel Foods plant in Rochelle, Illinois, that employed 800 people after at least 24 workers tested positive for coronavirus. On April 21, Hormel announced the closure of three meat processing plants, including its Alma Foods plant in Alma, Kansas. That plant employs about 100 workers and at least one worker tested positive for the coronavirus. Hormel also closed its Don Miguel Foods factory in Dallas, Texas, which is a joint venture with a Mexico City company, Herdez Del Fuerte. The plant made pork, beef and chicken burritos and tacos, and employed about 700 workers. On April 24, Hormel announced the closure of two plants in Willmar, Minnesota, after 14 workers tested positive for coronavirus. These Jennie-O turkey plants employed over 1,200 workers.\nIn October 2020, Hormel launched a bacon scented protective mask giveaway charity promotion.\n\nLeadership timeline\nMegaMex Foods\nIn 2009, California-based MegaMex Foods was created as a joint venture by US-based Hormel and Mexico-based Herdez del Fuerte to manufacture, market and distribute Mexican-style sauces and related other foods in the United States. Initial brands included Chi-Chi's, La Victoria, Búfalo, Doña María, and Herdez.\nDon Miguel Foods Corporation was acquired by MegaMex in 2010. Don Miguel manufactured fresh and frozen prepared foods, such as mini tacos, flautas, taquitos, empanadas, burritos and roller grill items.\nIn 2011, MegaMex acquired Texas-based Fresherized Foods, one of the largest provider of refrigerated guacamole in the United States and the manufacturer of Wholly Guacamole, Wholly Salsa, and Wholly Queso.\nIn 2021, MegaMex expanded their offerings to the wholesale food service industry by debuting their Tres Cocinas brand of pepper pastes.\n\nControversy\nIn 2013, an Office of Inspector General Audit Report raised ethical concerns about Hormel's participation in the USDA pilot program known as HIMP, which allegedly enabled high-speed slaughter of pigs with reduced oversight.\nIn 2016, the Animal Legal Defense Fund (ALDF) raised a lawsuit against Hormel for misleading advertising. They claimed that products marked as \"natural\" or listed under the Natural Choice brand were not produced with any higher health or animal welfare standards.\n\nSee also\nList of food companies\nPhilip Danforth Armour\nGustavus Franklin Swift\nHormel Historic Home\nImpact of the COVID-19 pandemic on the meat industry in the United States\n\nNotes\nReferences\nFurther reading\nKnowlton, Richard L.; Beyma, Ron (2010). Points of Difference: Transforming Hormel (1st ed.). Garden City, New York: Morgan James. ISBN 9781614481126. OCLC 826657964.\nCooper, Jake (1988). Lessons of the P-9 Strike. San Francisco: Socialist Action. OCLC 40950771.\nGenoways, Ted (2014). The Chain: Farm, Factory, and the Fate of our Food. HarperCollins. ISBN 9780062288752. OCLC 926727755.\nWhite, John H. (1986). The Great Yellow Fleet: A History of American Railroad Refrigerator Cars. San Marino, California: Golden West Books. ISBN 9780870950919. OCLC 907747754.\n\nExternal links\nOfficial website\nHormel brand website\nBusiness data for Hormel Foods Corporation:",
  "clean_text": "Hormel Foods Corporation, doing business as Hormel Foods or simply Hormel, is an American multinational food processing company founded in 1891 in Austin, Minnesota, by George A. Hormel as George A. Hormel & Company. The company originally focused on the packaging and selling of ham, sausage and other pork, chicken, beef and lamb products to consumers, adding Spam in 1937. By the 1980s, Hormel began offering a wider range of packaged and refrigerated foods. The company changed its name to Hormel Foods Corporation in 1993 and uses the Hormel brand on many of its products; the company's other brands include Planters, Columbus Craft Meats, Dinty Moore, Jennie-O, and Skippy. The company's products are available in over 80 countries. History 1890–1920 The company was founded as George A. Hormel & Company in Austin, Minnesota, by George A. Hormel in 1891. It changed its name to Hormel Foods in 1993. Born 1860 in Buffalo, New York, Hormel worked in a Chicago slaughterhouse before becoming a traveling wool and hide buyer. His travels took him to Austin and he decided to settle there. He borrowed $500 and opened a meat business. Hormel handled the production side of the business and his partner, Albert Friedrich, handled the retail. Their partnership dissolved in 1891 as Hormel started his own meat packing operation in northeast Austin in a creamery building on the Cedar River. To make ends meet in those early days, Hormel continued to trade in hides, eggs, wool, and poultry. The name Dairy Brand was first used in 1903. In the first decade of the 20th century distribution centers were opened in St. Paul, Minneapolis, Duluth, San Antonio, Dallas, Chicago, Atlanta, and Birmingham. In 1915, Hormel began selling dry sausages under the names of Cedar Cervelat, Holsteiner and Noxall Salami. Hormel products began appearing in national magazines, such as Good Housekeeping, as early as 1916. 1920–1950 In 1921, when George's son Jay Hormel returned from service in World War I, he uncovered that assistant controller Cy Thomson had embezzled $1,187,000 from the company over the previous ten years. The scandal provided George Hormel with additional incentive to professionalize his company. He did so by arranging for more reliable capital management, by dismissing unproductive employees, and by continuing to develop new products, reportedly with the mantra \"Originate, don't imitate\". In 1926, the company introduced Hormel Flavor-Sealed Ham, America's first canned ham, and added a canned chicken product line in 1928. Throughout the 1930s, Hormel ads were featured on the radio program The George Burns and Gracie Allen Show. In 1933, workers, led by itinerant butcher Frank Ellis, formed the Independent Union of All Workers and conducted one of the nation's first successful sit-down strikes; the union would later join the Congress of Industrial Organizations (CIO, later AFL-CIO). Hormel Chili and Spam were introduced in 1936 and 1937 respectively. In 1938, Jay C. Hormel introduced the \"Joint Savings Plan\" which allowed employees to share in the profits of the company. By 1942, George and Jay established the Hormel Foundation to act as trustees of the family trusts. The Foundation funded the Hormel Institute at the University of Minnesota, initially started with a study of the food value of soybeans. The institute's scope later grew towards studying nutrition, animal diseases and food technology. Hormel's production increased to aid in World War II and 65% of its products were purchased by the U.S. government by 1945. founder George Hormel died in March 1946 at age 85. 1950–2000 During six years of the 1950s, Hormel Foods used an advertising campaign produced by Al Sheehan where pretty girls in white cars sold the company's meat products. In 1959, Hormel was the first meatpacker to receive the Seal of Approval of the American Humane Society for its practice of anesthetizing animals before slaughter. Little Sizzlers sausages were introduced in 1961 and Cure 81 hams were introduced in 1963. Little Sizzler's sausage has been discontinued per 10/10/19 email from Hormel's Customer Service. Not-So-Sloppy-Joe Sloppy Joe sauce made its debut in 1985. In 1986, Hormel Foods acquired Jennie-O Foods and also began an exclusive licensing arrangement to produce Chi-Chi's brand products. The following year, Hormel Foods introduced the Top Shelf line of microwavable non-frozen products. The company added to their poultry offerings by purchasing Chicken by George, created by former Miss America Phyllis George, in 1988. That same year, Hormel Foods also introduced microwave bacon. In 1984, Hormel introduced the Frank 'n Stuff brand of stuffed hot dogs. In August 1985, Hormel workers went on strike at the Hormel headquarters in Austin, Minnesota. In the early 1980s, recession impacted several meatpacking companies, decreasing demand and increasing competition which led smaller and less-efficient companies to go out of business. In an effort to keep plants from closing, many instituted wage cuts. Wilson Food Company declared bankruptcy in 1983, allowing them to cut wages from $10.69 to $6.50 and significantly reduce benefits. Hormel Foods had avoided such drastic action, but by 1985, pressure to stay competitive remained. Workers had already labored under a wage freeze and dangerous working conditions, leading to many cases of repetitive strain injury. When management demanded a 23% wage cut from the workers they decided to begin the strike. It became one of the longest strikes of the 1980s. The local chapter of the United Food and Commercial Workers Union, Local P-9, led the strike, but was not supported by their parent union. A commemorative mural painted by Mike Alewitz and P-9 workers during the strike was destroyed by the UFCW months after the strike ended. The strike gained national attention and led to a widely publicized consumer boycott of Hormel products. The strike ended in June 1986, after lasting 10 months. 2000–2010 The Spam Museum in Austin, Minnesota, was opened in 2001. That same year, Hormel Foods acquired the Turkey Store, the business was combined with Jennie-O Foods to form Jennie-O Turkey Store. According to Triple Pundit, Hormel Foods began CSR reporting in 2006. The company has been included in Corporate Responsibility magazine's list of the \"100 best corporate citizens\" for 10 consecutive years. In 2008 an article in the New York Times, \"SPAM Turns Serious and Hormel Turns Out More\", detailed an overwhelming spike in the demand for SPAM, perhaps due to the flagging economy. In 2009 Hormel and Herdez del Fuerte created the joint venture MegaMex Foods to market and distribute Mexican food in the United States. Brands included in the venture include Herdez, La Victoria, Chi Chi's, El Torito, Embasa, Wholly Guacamole, Del Fuerte, Dona Maria, Bufalo, and Don Miguel. In September 2008, animal rights organization PETA released a video recorded over the course of three months showing workers at a pig factory farm in Iowa abusing pigs. The factory farm was owned by Natural Pork Production II LLP of Iowa until August 18, 2008, at which point ownership had transferred to MowMar LLP. Hormel spokeswoman Julie Henderson Craven, who responded to the PETA video, called the videotaped abuses \"completely unacceptable\". In their 2007 Corporate Responsibility Report, Hormel Foods stated that all suppliers are expected to comply with several welfare programs to ensure that the hogs purchased are treated humanely. Because of the investigation, several employees of the farm were fired and six individuals faced charges due to the abuse. 2010–present In 2011, Hormel Foods announced a two-for-one stock split. In 2013, Hormel Foods purchased Skippy—the best-selling brand of peanut butter in China and the second-best-selling brand in the world—from Unilever for $700 million; the sale included Skippy's American and Chinese factories. In May 2015, Hormel revealed it would acquire meat-processing firm Applegate Farms for around $775 million, expanding its range of meat products. In 2015, the Hormel Health Labs division of Hormel Foods launched its Hormel Vital Cuisine line of packaged ready to eat meals, nutrition shakes and whey protein powders geared towards cancer patients and made available for home delivery. The line was developed in concert with three parties, as \"Hormel brought food formulation, packaging and shelf stability knowledge, (chef de cuisine) Ron DeSantis brought taste and texture expertise, and the Cancer Nutrition Consortium offered the nutritional framework.\" In 2015, SPAMMY became available for purchase under Title I for U.S. Department of Agriculture (USDA) feeding programs and Title II for U.S. Agency for International Development (USAID) programs under the name fortified poultry-based spread (FPBS). Four years earlier, the company had made an initial three-year commitment to deliver 1 million cans of this product to in-need families in Guatemala. Also in 2015, after an undercover investigation by a group known as Compassion Over Killing at an Austin, Minnesota, processing plant, Hormel Foods announced it was \"bringing humane handling officers to a Quality Pork Processors Incorporated facility to ensure compliance with its own animal welfare standards\". It has also told QPP to provide extra training, enhance compliance oversight and increase third-party auditing. According to Reuters, \"in one scene of the video, pigs covered in feces or pus-filled abscesses are sent down the plant's conveyor belt. At one point, a knife is used to cut open abscesses on dead pigs.\" In 2016, Peak Rock Capital purchased the Diamond Crystal Brands Inc. unit, purchased by Hormel in 2002 for $155 million from Imperial Sugar. Also in 2016, Hormel acquired the nut butter producer Justin's for 280 million. In 2016, 2017, and 2018, the company was named as one of the Human Rights Campaign's Best Places to Work for LGBT equality. In 2019, Hormel was again named to one of the best places to work for LGBT equality, as the company obtained a 95 out of 100 score in the Human Rights Campaign's Corporate Equality Index. The almost-perfect score was due to the area of \"equivalency in same and different-sex domestic partner medical and soft benefits\", where Hormel received half-credit for providing parity in some, but not all, benefits. In 2017, Hormel sold Clougherty Packing, owner of the Farmer John and Saag's brands, to Smithfield Foods. In October 2017, Hormel announced it would acquire deli meat company Columbus Manufacturing for $850 million. In 2017, Mercy For Animals released undercover video footage of pigs being abused at The Maschhoffs LLC., a Hormel pork supplier in Hinton, Oklahoma, with piglets being castrated and having their tails cut off without any anesthetic, piglets left to suffer from untreated illness or injuries, and mother pigs crammed into gestation crates unable to move. In response, Hormel temporarily suspended its buying from the supplier. According to the Military Times, the company has been listed in the top 100 Best for Vets Employers category consistently since 2013. In April 2019, together with Harvard University Dining Services, the company hosted the Small Change Big Impact Food Summit at Harvard University. In September 2019, Hormel Foods announced that they had achieved their non-renewable energy use reduction goal a year ahead of schedule. Also in September 2019, the company launched a vegetarian meat alternative called Happy Little Plants for foodservice and retail customers. On September 18, 2020, Hormel Foods hosted the world's largest virtual pizza party, when more than 3,000 people joined a Zoom-hosted pizza party. In order to break the record, at least 500 photos of individuals needed to be uploaded during the one-hour event. The final tally was 907 photos. In February 2021, Kraft Heinz sold Planters and its other nuts businesses to Hormel for $3.35 billion. Effect of the COVID-19 pandemic On April 18, 2020, local health officials shut down a Hormel Foods plant in Rochelle, Illinois, that employed 800 people after at least 24 workers tested positive for coronavirus. On April 21, Hormel announced the closure of three meat processing plants, including its Alma Foods plant in Alma, Kansas. That plant employs about 100 workers and at least one worker tested positive for the coronavirus. Hormel also closed its Don Miguel Foods factory in Dallas, Texas, which is a joint venture with a Mexico City company, Herdez Del Fuerte. The plant made pork, beef and chicken burritos and tacos, and employed about 700 workers. On April 24, Hormel announced the closure of two plants in Willmar, Minnesota, after 14 workers tested positive for coronavirus. These Jennie-O turkey plants employed over 1,200 workers. In October 2020, Hormel launched a bacon scented protective mask giveaway charity promotion. Leadership timeline MegaMex Foods In 2009, California-based MegaMex Foods was created as a joint venture by US-based Hormel and Mexico-based Herdez del Fuerte to manufacture, market and distribute Mexican-style sauces and related other foods in the United States. Initial brands included Chi-Chi's, La Victoria, Búfalo, Doña María, and Herdez. Don Miguel Foods Corporation was acquired by MegaMex in 2010. Don Miguel manufactured fresh and frozen prepared foods, such as mini tacos, flautas, taquitos, empanadas, burritos and roller grill items. In 2011, MegaMex acquired Texas-based Fresherized Foods, one of the largest provider of refrigerated guacamole in the United States and the manufacturer of Wholly Guacamole, Wholly Salsa, and Wholly Queso. In 2021, MegaMex expanded their offerings to the wholesale food service industry by debuting their Tres Cocinas brand of pepper pastes. Controversy In 2013, an Office of Inspector General Audit Report raised ethical concerns about Hormel's participation in the USDA pilot program known as HIMP, which allegedly enabled high-speed slaughter of pigs with reduced oversight. In 2016, the Animal Legal Defense Fund (ALDF) raised a lawsuit against Hormel for misleading advertising. They claimed that products marked as \"natural\" or listed under the Natural Choice brand were not produced with any higher health or animal welfare standards."
}