{
  "ticker": "HSIC",
  "cik": "0001000228",
  "company_name": "Henry Schein",
  "corrected_name": "Henry Schein",
  "wiki_title_used": "Henry Schein",
  "exists": true,
  "raw_text": "Henry Schein, Inc. is an American distributor of health care products and services, with operations in 33 countries and territories. It is the world’s largest provider of health care solutions to office-based dental and medical practitioners. For 14 consecutive years, the company has been named as one of the World's Most Ethical Companies by  Ethisphere, most recently in 2025.\n\nHistory\nIn 1932, Henry Schein, a graduate of Columbia University College of Pharmacy, borrowed $500 and opened a pharmacy in Queens, New York. The company expanded into dental supplies in the 1960s, and by the late 1980s, Henry Schein held approximately 10 percent of the dental-supply market. Marvin Schein, Henry Schein's son, took over management of daily operations in 1971.\nIn 1978, founder Henry Schein's son Jay Schein became CEO of the company. When Jay Schein died of cancer in 1989, Stanley Bergman took over as CEO. Bergman was born in South Africa and came to New York in 1976, where he became an accountant. In 1980, he joined Henry Schein and was promoted to CFO.\nHenry Schein Inc. filed with the U.S. Securities and Exchange Commission in 1995 to sell 6.2 million shares in an initial public offering with William Blair & Company as the lead underwriter. The IPO raised $72.8 million and began trading on the Nasdaq. By 1996, the company was up to $1.4 billion in sales and $29 million in profit under Bergman's leadership. That year, the company made seventeen acquisitions.\nIn August 1997, Henry Schein Inc. agreed to buy Sullivan Dental Products Inc. for approximately $318 million. The purchase made the company the world's largest distributor of dental equipment and supplies. By that point, Henry Schein had made 16 acquisitions in 1997. Also in 1997, Henry Schein acquired New York-based medical-products distributor Micro BioMedics Inc as well as Dentrix Dental Systems.\nHenry Schein announced the acquisition of demedis GmbH and Euro Dental Holding GmbH in June 2004. In November 2009, it was announced that Henry Schein Inc. and Butler Animal Health Supply would be launching joint venture Butler Schein Animal Health, the largest veterinary sales and distribution company in the United States. Butler Schein Animal Health was rebranded as Henry Schein Animal Health in 2013. Between 1989 and 2016, Henry Schein purchased approximately 200 companies. The company's chief executive officer, Stanley Bergman, was announced as Chief Executive Magazine's CEO of the Year in May 2017.\nIn 2018, the FTC accused Benco Dental, Patterson Companies, and Henry Schein of violating antitrust laws. In October 2019, the FTC’s Chief Administrative Law Judge dismissed the claims against Henry Schein while finding that Benco and Patterson violated U.S. antitrust laws.\nIn February 2019, Henry Schein spun off the company's animal health business and merged it with Vets First Choice to form a new company. The new company is established as Covetrus.\nHenry Schein Inc. was one of the six main defendants in lawsuits with state and local governments of the opioid epidemic in the United States. The company was dismissed as a defendant in October 2019 in the bellwether Summit County, Ohio litigation.\nIn July 2022, Henry Schein acquired Condor Dental, a dental distribution company. \nIn April 2023, Henry Schein acquired Biotech Dental, a provider of dental implants, clear aligners, and digital dental software, based in Salon-de-Provence, France.\nIn July 2023, Henry Schein acquired S.I.N Implant System, a major provider of dental implants in Brazil.\nOn October 14 2023, Henry Schein reported a major hack into its core systems, which included investor information, and payroll data - amounting to 35 Terabytes of data being exfiltrated from the company. This resulted in its applications and e-commerce site being unavailable for several days.\nIn July 2025, Henry Schein announced that Stanley Bergman would be stepping down as CEO at the end of 2025, however he will continue to serve as Chairman of the Board.\n\nOperations\nDental\nIn 1997, Henry Schein acquired Sullivan Dental Products and Dentrix Dental Systems, making it the world's largest distributor of dental equipment and supplies. Dentrix Ascend, Henry Schein's cloud-based software designed for dental offices, is a scalable system. Its interface was built to be intuitive and the company works with users to include features dental offices require.\nHenry Schein established the Henry Schein Dental Business Institute in March 2015 to teach owners and operators of dental practices the fundamentals of business. The first class to complete the program graduated in March 2016. Henry Schein also launched the Henry Schein Digital Dentistry Program at Temple University's Maurice H. Kornberg School of Dentistry in 2016.\nIn May 2016, Henry Schein's entity Dentrix presented the DEXIS software's ability to integrate X-rays into a patient's chart. Zahn Dental, Henry Schein's laboratory supply business, acquired Custom Automated Prosthetics in June 2016. The acquisition enabled Henry Schein to expand its prosthetic offerings.\nIn August 2019, Henry Schein acquired a majority equity stake in Cliniclands, a distributor serving dental practices throughout Sweden, Denmark, and Norway. \nIn May 2021, Henry Schein announced it acquired an 80% ownership position in Jarvis Analytics, a software company that develops comprehensive data analytics tools for dental practitioners. \nIn June 2021, Henry Schein acquired a 70% ownership position in eAssist Dental Solutions (eAssist), the developer of a virtual dental billing outsourcing service. \nIn August 2022, Henry Schein acquired Midway Dental Supply, a full-service dental distributor serving across the Midwestern United States. \nIn January 2023, Henry Schein announced its subsidiary, eAssist Dental Solutions (eAssist), acquired a majority interest in Unitas PPO Solutions (Unitas), a service provider that works with dental practices to assess their commercial insurance participation, set competitive fee-for-service rates, and negotiate contracted reimbursement with commercial insurers.\nIn July 2024, Henry Schein acquired abc dental AG, a full-service dental distributor offering consumables, equipment, and technical service to general practitioners, specialists, and dental laboratories in Switzerland.\n\nHenry Schein One\nIn July 2018, Henry Schein and Internet Brands completed a joint venture to form Henry Schein One. The new company delivers integrated dental technology to help improve practice management and marketing as well as patient communication. \nIn July 2019, Henry Schein One acquired Elite Computer Italia S.r.L. (Elite), a full-service software company that delivers practice management solutions to dental practices in Italy.\nIn November 2022, Henry Schein One announced a partnership with VideaHealth, a dental AI platform. As a result, Henry Schein One introduced Dentrix Detect AI, an AI-enabled X-Ray analysis tool. The integration with VideaHealth’s FDA-cleared computer-assisted detection (CADe) device can help oral health professionals use AI in dental practices.\nIn December 2023, Henry Schein One was named to Utah Business Magazine’s Best Companies to Work For list.\n\nMedical\nIn November 2014, Henry Schein Medical announced a strategic arrangement with Cardinal Health. Cardinal Health's physician office-sales organization consolidated into Henry Schein Medical.\nIn March 2019, Henry Schein acquired North American Rescue (NAR), the leading provider of survivability and casualty-care medical products to the defense and public-safety markets.\nIn January 2021, Henry Schein acquired a majority ownership position in Prism Medical Products, LLC (PRISM), a nationwide provider of specialty home medical supplies with a core competency in advanced wound care products.\nIn October 2023, Henry Schein acquired Shield Healthcare, Inc., a supplier of homecare medical products delivered directly to patients in their homes.\nIn April 2024, Henry Schein acquired TriMed, a developer of orthopedic devices for lower extremities (foot and ankle) and upper extremities (hand and wrist).\nIn January 2025, Henry Schein acquired all of the assets of Acentus, a medical supplier specializing in Continuous Glucose Monitors (CGMs).\n\nFormer division\nAnimal health\nHenry Schein has spun off this division in early 2019 produces software that is used in veterinary practices designed to improve communication and data management including the online cloud-based application, Rapport. In February 2016, Henry Schein released Axis-Q, a software application designed to ease the recording and access of veterinary medical records.\n\nPhilanthropy\nIn 1998, Henry Schein’s Back to School program was launched; this program provides underserved children with school supplies and has helped over 65,000 students since its foundation. \nSince 1999, Henry Schein has held its annual ‘Holiday Cheer for Children’ program, which donates clothing, toys, and gift cards to over 20,000 children and their families throughout the holiday season. \nIn 2015, the Alpha Omega International Dental Society and Henry Schein Cares partnered to create the Alpha Omega-Henry Schein Cares Holocaust Survivors Oral Health Program, which offers pro bono oral care to Holocaust survivors. Since its inception, the program has provided treatment to over 1,600 individuals in the United States and Canada. \nSince 2018, Henry Schein has supported the Special Olympics, in particular its Healthy Athletes program, through essential health care donations. \nIn April 2023, Henry Schein launched its Practice Green initiative, which seeks to encourage U.S. and Canada healthcare professionals to transition towards sustainable practices.\nHenry Schein has also served as the exclusive product sponsor for the American Dental Association’s Give Kids A Smile Program. Henry Schein has contributed $20 million in oral health care products and more than 40,000 dental kits.\nIn April 2025, the Science Based Targets initiative (SBTi) approved Henry Schein’s near-term and long-term science-based emissions reduction targets, verifying its net-zero science-based target by 2050.\n\nSee also\nDentrix\nHenry Schein, Inc. v. Archer & White Sales, Inc.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Henry Schein:",
  "clean_text": "Henry Schein, Inc. is an American distributor of health care products and services, with operations in 33 countries and territories. It is the world’s largest provider of health care solutions to office-based dental and medical practitioners. For 14 consecutive years, the company has been named as one of the World's Most Ethical Companies by Ethisphere, most recently in 2025. History In 1932, Henry Schein, a graduate of Columbia University College of Pharmacy, borrowed $500 and opened a pharmacy in Queens, New York. The company expanded into dental supplies in the 1960s, and by the late 1980s, Henry Schein held approximately 10 percent of the dental-supply market. Marvin Schein, Henry Schein's son, took over management of daily operations in 1971. In 1978, founder Henry Schein's son Jay Schein became CEO of the company. When Jay Schein died of cancer in 1989, Stanley Bergman took over as CEO. Bergman was born in South Africa and came to New York in 1976, where he became an accountant. In 1980, he joined Henry Schein and was promoted to CFO. Henry Schein Inc. filed with the U.S. Securities and Exchange Commission in 1995 to sell 6.2 million shares in an initial public offering with William Blair & Company as the lead underwriter. The IPO raised $72.8 million and began trading on the Nasdaq. By 1996, the company was up to $1.4 billion in sales and $29 million in profit under Bergman's leadership. That year, the company made seventeen acquisitions. In August 1997, Henry Schein Inc. agreed to buy Sullivan Dental Products Inc. for approximately $318 million. The purchase made the company the world's largest distributor of dental equipment and supplies. By that point, Henry Schein had made 16 acquisitions in 1997. Also in 1997, Henry Schein acquired New York-based medical-products distributor Micro BioMedics Inc as well as Dentrix Dental Systems. Henry Schein announced the acquisition of demedis GmbH and Euro Dental Holding GmbH in June 2004. In November 2009, it was announced that Henry Schein Inc. and Butler Animal Health Supply would be launching joint venture Butler Schein Animal Health, the largest veterinary sales and distribution company in the United States. Butler Schein Animal Health was rebranded as Henry Schein Animal Health in 2013. Between 1989 and 2016, Henry Schein purchased approximately 200 companies. The company's chief executive officer, Stanley Bergman, was announced as Chief Executive Magazine's CEO of the Year in May 2017. In 2018, the FTC accused Benco Dental, Patterson Companies, and Henry Schein of violating antitrust laws. In October 2019, the FTC’s Chief Administrative Law Judge dismissed the claims against Henry Schein while finding that Benco and Patterson violated U.S. antitrust laws. In February 2019, Henry Schein spun off the company's animal health business and merged it with Vets First Choice to form a new company. The new company is established as Covetrus. Henry Schein Inc. was one of the six main defendants in lawsuits with state and local governments of the opioid epidemic in the United States. The company was dismissed as a defendant in October 2019 in the bellwether Summit County, Ohio litigation. In July 2022, Henry Schein acquired Condor Dental, a dental distribution company. In April 2023, Henry Schein acquired Biotech Dental, a provider of dental implants, clear aligners, and digital dental software, based in Salon-de-Provence, France. In July 2023, Henry Schein acquired S.I.N Implant System, a major provider of dental implants in Brazil. On October 14 2023, Henry Schein reported a major hack into its core systems, which included investor information, and payroll data - amounting to 35 Terabytes of data being exfiltrated from the company. This resulted in its applications and e-commerce site being unavailable for several days. In July 2025, Henry Schein announced that Stanley Bergman would be stepping down as CEO at the end of 2025, however he will continue to serve as Chairman of the Board. Operations Dental In 1997, Henry Schein acquired Sullivan Dental Products and Dentrix Dental Systems, making it the world's largest distributor of dental equipment and supplies. Dentrix Ascend, Henry Schein's cloud-based software designed for dental offices, is a scalable system. Its interface was built to be intuitive and the company works with users to include features dental offices require. Henry Schein established the Henry Schein Dental Business Institute in March 2015 to teach owners and operators of dental practices the fundamentals of business. The first class to complete the program graduated in March 2016. Henry Schein also launched the Henry Schein Digital Dentistry Program at Temple University's Maurice H. Kornberg School of Dentistry in 2016. In May 2016, Henry Schein's entity Dentrix presented the DEXIS software's ability to integrate X-rays into a patient's chart. Zahn Dental, Henry Schein's laboratory supply business, acquired Custom Automated Prosthetics in June 2016. The acquisition enabled Henry Schein to expand its prosthetic offerings. In August 2019, Henry Schein acquired a majority equity stake in Cliniclands, a distributor serving dental practices throughout Sweden, Denmark, and Norway. In May 2021, Henry Schein announced it acquired an 80% ownership position in Jarvis Analytics, a software company that develops comprehensive data analytics tools for dental practitioners. In June 2021, Henry Schein acquired a 70% ownership position in eAssist Dental Solutions (eAssist), the developer of a virtual dental billing outsourcing service. In August 2022, Henry Schein acquired Midway Dental Supply, a full-service dental distributor serving across the Midwestern United States. In January 2023, Henry Schein announced its subsidiary, eAssist Dental Solutions (eAssist), acquired a majority interest in Unitas PPO Solutions (Unitas), a service provider that works with dental practices to assess their commercial insurance participation, set competitive fee-for-service rates, and negotiate contracted reimbursement with commercial insurers. In July 2024, Henry Schein acquired abc dental AG, a full-service dental distributor offering consumables, equipment, and technical service to general practitioners, specialists, and dental laboratories in Switzerland. Henry Schein One In July 2018, Henry Schein and Internet Brands completed a joint venture to form Henry Schein One. The new company delivers integrated dental technology to help improve practice management and marketing as well as patient communication. In July 2019, Henry Schein One acquired Elite Computer Italia S.r.L. (Elite), a full-service software company that delivers practice management solutions to dental practices in Italy. In November 2022, Henry Schein One announced a partnership with VideaHealth, a dental AI platform. As a result, Henry Schein One introduced Dentrix Detect AI, an AI-enabled X-Ray analysis tool. The integration with VideaHealth’s FDA-cleared computer-assisted detection (CADe) device can help oral health professionals use AI in dental practices. In December 2023, Henry Schein One was named to Utah Business Magazine’s Best Companies to Work For list. Medical In November 2014, Henry Schein Medical announced a strategic arrangement with Cardinal Health. Cardinal Health's physician office-sales organization consolidated into Henry Schein Medical. In March 2019, Henry Schein acquired North American Rescue (NAR), the leading provider of survivability and casualty-care medical products to the defense and public-safety markets. In January 2021, Henry Schein acquired a majority ownership position in Prism Medical Products, LLC (PRISM), a nationwide provider of specialty home medical supplies with a core competency in advanced wound care products. In October 2023, Henry Schein acquired Shield Healthcare, Inc., a supplier of homecare medical products delivered directly to patients in their homes. In April 2024, Henry Schein acquired TriMed, a developer of orthopedic devices for lower extremities (foot and ankle) and upper extremities (hand and wrist). In January 2025, Henry Schein acquired all of the assets of Acentus, a medical supplier specializing in Continuous Glucose Monitors (CGMs). Former division Animal health Henry Schein has spun off this division in early 2019 produces software that is used in veterinary practices designed to improve communication and data management including the online cloud-based application, Rapport. In February 2016, Henry Schein released Axis-Q, a software application designed to ease the recording and access of veterinary medical records. Philanthropy In 1998, Henry Schein’s Back to School program was launched; this program provides underserved children with school supplies and has helped over 65,000 students since its foundation. Since 1999, Henry Schein has held its annual ‘Holiday Cheer for Children’ program, which donates clothing, toys, and gift cards to over 20,000 children and their families throughout the holiday season. In 2015, the Alpha Omega International Dental Society and Henry Schein Cares partnered to create the Alpha Omega-Henry Schein Cares Holocaust Survivors Oral Health Program, which offers pro bono oral care to Holocaust survivors. Since its inception, the program has provided treatment to over 1,600 individuals in the United States and Canada. Since 2018, Henry Schein has supported the Special Olympics, in particular its Healthy Athletes program, through essential health care donations. In April 2023, Henry Schein launched its Practice Green initiative, which seeks to encourage U.S. and Canada healthcare professionals to transition towards sustainable practices. Henry Schein has also served as the exclusive product sponsor for the American Dental Association’s Give Kids A Smile Program. Henry Schein has contributed $20 million in oral health care products and more than 40,000 dental kits. In April 2025, the Science Based Targets initiative (SBTi) approved Henry Schein’s near-term and long-term science-based emissions reduction targets, verifying its net-zero science-based target by 2050."
}