{
  "ticker": "HST",
  "cik": "0001070750",
  "company_name": "Host Hotels & Resorts",
  "corrected_name": "Host Hotels & Resorts",
  "wiki_title_used": "Host Hotels & Resorts",
  "exists": true,
  "raw_text": "Host Hotels & Resorts, Inc., based in Bethesda, Maryland, is an American real estate investment trust that invests in hotels. As of December 31, 2024, the company owned 81 upscale hotels containing about 43,400 rooms in the United States, Brazil, and Canada.\n\nHistory\nIn 1897, the Van Noy Brothers of Kansas City, Missouri, formed Van Noy Railway News and Hotel Company to operate news stands along the Missouri Pacific and other regional railroads. The company expanded to various hospitality services, including hotels. After several name and business changes it became the Host International Company in 1968.\nIn 1927, John Willard Marriott and his wife Alice opened a root beer stand in Washington, D.C., that they named “The Hot Shoppe”. It became a public company and in 1957, Hot Shoppes, Inc. expanded into the lodging business with the opening of its first hotel in Arlington, Virginia. In 1967, the company was renamed Marriott Corporation.\nIn 1982, Marriott acquired Host International Company.\nIn 1993, Marriott split its business into Marriott International, Inc., which took over management and franchising; and Host Marriott Corporation, which became the new name for the original Marriott Corporation. Host Marriott managed lodging and travel concessions at airports and along turnpikes and interstate highways. The concession businesses were further spun off as Host Marriott Services, now HMSHost. \nThe company divested its non-hotel business and reorganized as a real estate investment trust in 1998. It adopted its current name—Host Hotels & Resorts, Inc.—in 2006.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Host Hotels & Resorts, Inc.:",
  "clean_text": "Host Hotels & Resorts, Inc., based in Bethesda, Maryland, is an American real estate investment trust that invests in hotels. As of December 31, 2024, the company owned 81 upscale hotels containing about 43,400 rooms in the United States, Brazil, and Canada. History In 1897, the Van Noy Brothers of Kansas City, Missouri, formed Van Noy Railway News and Hotel Company to operate news stands along the Missouri Pacific and other regional railroads. The company expanded to various hospitality services, including hotels. After several name and business changes it became the Host International Company in 1968. In 1927, John Willard Marriott and his wife Alice opened a root beer stand in Washington, D.C., that they named “The Hot Shoppe”. It became a public company and in 1957, Hot Shoppes, Inc. expanded into the lodging business with the opening of its first hotel in Arlington, Virginia. In 1967, the company was renamed Marriott Corporation. In 1982, Marriott acquired Host International Company. In 1993, Marriott split its business into Marriott International, Inc., which took over management and franchising; and Host Marriott Corporation, which became the new name for the original Marriott Corporation. Host Marriott managed lodging and travel concessions at airports and along turnpikes and interstate highways. The concession businesses were further spun off as Host Marriott Services, now HMSHost. The company divested its non-hotel business and reorganized as a real estate investment trust in 1998. It adopted its current name—Host Hotels & Resorts, Inc.—in 2006."
}