{
  "ticker": "HUBB",
  "cik": "0000048898",
  "company_name": "Hubbell Incorporated",
  "corrected_name": "Hubbell Incorporated",
  "wiki_title_used": "Hubbell Incorporated",
  "exists": true,
  "raw_text": "Hubbell Incorporated, headquartered in Shelton, Connecticut, is an American company that designs, manufactures, and sells electrical and electronic products for non-residential and residential construction, industrial, and utility applications. Hubbell was founded by Harvey Hubbell as a proprietorship in 1888, and was incorporated in Connecticut in 1905.\nThe company is ranked 651st on the Fortune 500 list of the largest United States corporations by total revenue.\nThe company operates two segments: the utility solutions segment, which produces items such as arresters, insulators, connectors, anchors, bushings, enclosures, cutoffs and switches and the electrical solutions segment, which produces application wiring device products, rough-in electrical products, connector and grounding products, and lighting fixtures, as well as other electrical equipment.\nHubbell has manufacturing facilities in the United States, Canada, Switzerland, Puerto Rico, Mexico, China, Italy, the United Kingdom, Brazil and Australia and maintains sales offices in Singapore, China, India, Mexico, South Korea, and countries in the Middle East.\n\nHistory\nHubbell Incorporated was founded as a proprietorship in 1888 by Harvey Hubbell II. Born in Connecticut in 1857, he was a U.S. inventor, entrepreneur, and industrialist. Hubbell's best-known inventions are the U.S. electrical plug and the pull-chain light socket. Hubbell graduated from high school and began working for companies manufacturing marine engines and printing machinery. During this time, he accumulated several ideas for new inventions, and in 1888, he set out on his own, opening a small manufacturing facility in Bridgeport, Connecticut. Hubbell's first product was taken from his own patent for a paper roll holder with a toothed blade for use in stores that sold wrapping paper. This cutter stand became a tremendous success; it was a common feature of retail stores that used wrapping paper in the early 1900s and remained widely used into the late 20th century.\nSoon, Hubbell discovered that he had to design machinery to make its parts. One of the first was a tapping machine, as was its patent. Around 1896, with his business in machinery progressing, Hubbell's next patent was a major breakthrough in the fastener industry: the process and machinery for cold rolled screw threads which reduced the rate of material lost in production by more than 50%. He designed and built progressive blanking and forming dies, patented machinery to slot screw heads, a machine to assemble screws and small parts, devised tools to indicate speed, and patented a changeable speed screwdriver. Hubbell's idea was to provide convenience, safety, and control to an electric light with his new \"pull socket\" which was patented in August 1896. The same familiar device with its on/off pull chain is still in use today. Hubbell built three prototypes by hand using metal and insulated wood parts to design a product with individual wires permanently attached in the proper sequence and correct polarity, and one which could be connected or disconnected, easily and safely, to a power supply in the wall. Cartridge fuses and fuse block, lamp holders, key sockets, soon followed the same path Later, Hubbell's \"separable plug\" design took shape on the drawing board back in Bridgeport, and then submitted to the patent office in Washington, D.C. Additional designs based on that basic concept separable plugs in different configurations, a single flush mounted receptacle as well as new products for electrical circuits. One of the most successful and familiar today, was the duplex receptacle which is still found everywhere that electrical power is used.\nIn 1901, Hubbell published a 12-page catalogue that listed 63 electrical products of his company's manufacture, and four years later he incorporated his enterprise as Harvey Hubbell, Incorporated. In the same year, the company registered its trademark of \"...a sphere with meridian lines and the name 'Hubbell' centered within\". Hubbell's pace of new ideas and product design did not falter. In 1909, the company began constructing a four-floor factory and office building that would become the first building in New England made of reinforced concrete.\nBetween 1896 and 1909, he was granted 45 patents on a wide variety of electrical products company's product lines had been continuously expanded. Catalogue No. 17 was published in March 1917. The catalogue had more than 100 pages and listed more than a thousand products. In bulb sockets alone, the company manufactured 277 different types and sizes. Hubbell's toggle action light switch which incorporated a \"quick make or break\" feature to meet the rigid requirements of Underwriters' Laboratories (UL) was replacing the former two button type push switch. Hubbell designed a \"Loxin\" mechanism which fit into any standard socket and locked the bulb in place. Falling lightbulbs no longer endangered streetcar passengers, and overly thrifty commuters had to find a new source of replacement bulbs for home use. For the home, the company developed a system for lighting fixture connections called \"Elexit\" which allowed the homeowner to install most fixtures without hiring an electrician.\nCompany's first era ended when its founder Harvey Hubbell II died on December 17, 1927. He was succeeded as president of the company by his son, Harvey Hubbell III. Twenty-six years old when he succeeded his father, Harvey Hubbell III had already spent years working in the business. That early experience with electrical equipment engineering and learning the discipline of production was to stand the company in good stead in the decades to come.\nHarvey Hubbell III soon showed that he had inherited his father's twin acumen for product innovation and business development. In product innovation, he devised the company's lines of Twist-Lock industrial connectors with new 2-, 3-, and 4-wire devices of various ratings, designed a whole new series of locking connectors for industrial use which he named \"Hubbellock\", and introduced heavy-duty, circuit-breaking devices. The company played a large part in the war effort by meeting the demand for electrical components and systems to power the nation's industries and by developing products for the special applications needed by the military. These included components for military vehicle electrical circuits, battery-charging systems for M-4 tanks, power jacks for test meters, vacuum tube sockets for radio communications, and a line of electrical and electronic connectors for aircraft. The company's years of experience in building devices reliable enough for industrial use was a valuable asset in the production of products that could perform under rugged battlefield conditions. A second plant was opened in Lexington, Kentucky, in order to meet the demand and as a safety measure since the main plant in Bridgeport was considered vulnerable to air or sea attack.\nHubbell Inc. assisted Allied efforts during World War II by manufacturing military vehicle electrical circuits, battery-charging systems for M4 Sherman tanks, power jacks for test meters, vacuum tube sockets for radio communications, and a line of electrical and electronic connectors for aircraft.\nHubbell had been one of the first to manufacture flush toggle switches for alternating current only. The first Safety Receptacle was designed and produced as were the original \"grounding only\" devices which helped to set the standards for the industry. And while Hubbell was busy on land, the company found new opportunities at sea. In 1952, the ocean liner \"SS United States\" was launched in Newport News, Virginia. Queen of the seas for many years, the ship was completely fitted with Hubbell wiring devices designed expressly for narrow stateroom partitions and to withstand the effects of salt air. An ardent yachtsman himself, Harvey Hubbell III designed a complete family of corrosion resistant devices including both on-board and dockside equipment for the expanding pleasure boat industry. Familiar sights at marinas today, these first products were so successful that alternative designs were produced for many industrial applications where corrosive atmospheres and materials posed challenges for standard wiring devices.\nThe company's sales in new products and continuing lines increased proportionately to these successes, but more was to come as Harvey Hubbell Incorporated added diversification. Beginning in 1960, the company entered a new period of rapidly expanding growth in both sales and income. Much of the growth resulted from the company's internal product development, a longstanding Hubbell tradition, and a source that expanded under the industry leadership of Harvey Hubbell III and other Hubbell engineers. A second source of growth through acquisition, from 1960 onwards to now, Hubbell Incorporated has acquired many companies working for power, electric, lighting sectors. Hubbell Incorporated has grown to be an international manufacturer of electrical and electronic products for a broad range of non-residential and residential construction, industrial, and utility applications.\nIn 2010, the company moved its headquarters from Orange, Connecticut to Shelton, Connecticut.\nIn October 2021, Hubbell announced an agreement to sell its Commercial and Industrial Lighting business to GE Current, a Daintree company (now Current Lighting Solutions). The agreement did not include Bell, Chalmit Lighting, Killark, or Progress Lighting (which all make lighting products). \nIn the first quarter of 2024, Hubbell completed the sale of Progress Lighting. In 2023, Progress Lighting had revenue of $187.1 million (Hubbell Lighting had revenue of $515 million in 2022) and the sale amounted to $131 million.\nIn March 2024, Hubbell was named one of Ethisphere Institute's World's Most Ethical Companies of the Year for the fourth time. In 2024, 136 honourees from 20 countries and 44 industries were recognised.\n\nAcquisitions\nOperations\nHubbell designs, manufactures, and sells various product under two major sections which are Electrical Solutions and Utility Solutions.\n\nThe utility segment markets products under the following brands:\n\nAclara\nChance\nAnderson\nPenCell\nFargo\nHubbell\nPolycast\nOpti-loop Design\nQuazite\nQuadri*sil\nTrinetics\nReuel\nElectro Composites\nUSCO\nDual-Lite\nCDR\nRFL Design\nHot Box\nPCORE\nDelmar\nTurner Electric\nEMC\nLongbow\nOhio Brass\nMeramec\nReliaguard\nGreenjacket\nArmorcast\nBeckwith Electric\nContinental\nR.W. Lyall\nGas Breaker\nAEC\nRipley\nThe electrical solutions division markets products under the following brands:\n\nHubbell\nBellRaco\nGleason Reel\nACME Electric\nKellems\nTayMac\nHipotronics\nPowerohm\nEC&M Design\nBryant\nWiegmann\nAccelTex Solutions\niDevices\nBurndy\nKillark\nGAI-Tronics\nConnector Products\nAustdac\nCMC\nHawke\nChalmit\nPCX\n\nKey competitors\nEaton Corporation (Cooper Wiring Devices)\nLegrand (Pass & Seymour)\nLeviton\nLutron Electronics Company\n\n\n== References ==",
  "clean_text": "Hubbell Incorporated, headquartered in Shelton, Connecticut, is an American company that designs, manufactures, and sells electrical and electronic products for non-residential and residential construction, industrial, and utility applications. Hubbell was founded by Harvey Hubbell as a proprietorship in 1888, and was incorporated in Connecticut in 1905. The company is ranked 651st on the Fortune 500 list of the largest United States corporations by total revenue. The company operates two segments: the utility solutions segment, which produces items such as arresters, insulators, connectors, anchors, bushings, enclosures, cutoffs and switches and the electrical solutions segment, which produces application wiring device products, rough-in electrical products, connector and grounding products, and lighting fixtures, as well as other electrical equipment. Hubbell has manufacturing facilities in the United States, Canada, Switzerland, Puerto Rico, Mexico, China, Italy, the United Kingdom, Brazil and Australia and maintains sales offices in Singapore, China, India, Mexico, South Korea, and countries in the Middle East. History Hubbell Incorporated was founded as a proprietorship in 1888 by Harvey Hubbell II. Born in Connecticut in 1857, he was a U.S. inventor, entrepreneur, and industrialist. Hubbell's best-known inventions are the U.S. electrical plug and the pull-chain light socket. Hubbell graduated from high school and began working for companies manufacturing marine engines and printing machinery. During this time, he accumulated several ideas for new inventions, and in 1888, he set out on his own, opening a small manufacturing facility in Bridgeport, Connecticut. Hubbell's first product was taken from his own patent for a paper roll holder with a toothed blade for use in stores that sold wrapping paper. This cutter stand became a tremendous success; it was a common feature of retail stores that used wrapping paper in the early 1900s and remained widely used into the late 20th century. Soon, Hubbell discovered that he had to design machinery to make its parts. One of the first was a tapping machine, as was its patent. Around 1896, with his business in machinery progressing, Hubbell's next patent was a major breakthrough in the fastener industry: the process and machinery for cold rolled screw threads which reduced the rate of material lost in production by more than 50%. He designed and built progressive blanking and forming dies, patented machinery to slot screw heads, a machine to assemble screws and small parts, devised tools to indicate speed, and patented a changeable speed screwdriver. Hubbell's idea was to provide convenience, safety, and control to an electric light with his new \"pull socket\" which was patented in August 1896. The same familiar device with its on/off pull chain is still in use today. Hubbell built three prototypes by hand using metal and insulated wood parts to design a product with individual wires permanently attached in the proper sequence and correct polarity, and one which could be connected or disconnected, easily and safely, to a power supply in the wall. Cartridge fuses and fuse block, lamp holders, key sockets, soon followed the same path Later, Hubbell's \"separable plug\" design took shape on the drawing board back in Bridgeport, and then submitted to the patent office in Washington, D.C. Additional designs based on that basic concept separable plugs in different configurations, a single flush mounted receptacle as well as new products for electrical circuits. One of the most successful and familiar today, was the duplex receptacle which is still found everywhere that electrical power is used. In 1901, Hubbell published a 12-page catalogue that listed 63 electrical products of his company's manufacture, and four years later he incorporated his enterprise as Harvey Hubbell, Incorporated. In the same year, the company registered its trademark of \"...a sphere with meridian lines and the name 'Hubbell' centered within\". Hubbell's pace of new ideas and product design did not falter. In 1909, the company began constructing a four-floor factory and office building that would become the first building in New England made of reinforced concrete. Between 1896 and 1909, he was granted 45 patents on a wide variety of electrical products company's product lines had been continuously expanded. Catalogue No. 17 was published in March 1917. The catalogue had more than 100 pages and listed more than a thousand products. In bulb sockets alone, the company manufactured 277 different types and sizes. Hubbell's toggle action light switch which incorporated a \"quick make or break\" feature to meet the rigid requirements of Underwriters' Laboratories (UL) was replacing the former two button type push switch. Hubbell designed a \"Loxin\" mechanism which fit into any standard socket and locked the bulb in place. Falling lightbulbs no longer endangered streetcar passengers, and overly thrifty commuters had to find a new source of replacement bulbs for home use. For the home, the company developed a system for lighting fixture connections called \"Elexit\" which allowed the homeowner to install most fixtures without hiring an electrician. Company's first era ended when its founder Harvey Hubbell II died on December 17, 1927. He was succeeded as president of the company by his son, Harvey Hubbell III. Twenty-six years old when he succeeded his father, Harvey Hubbell III had already spent years working in the business. That early experience with electrical equipment engineering and learning the discipline of production was to stand the company in good stead in the decades to come. Harvey Hubbell III soon showed that he had inherited his father's twin acumen for product innovation and business development. In product innovation, he devised the company's lines of Twist-Lock industrial connectors with new 2-, 3-, and 4-wire devices of various ratings, designed a whole new series of locking connectors for industrial use which he named \"Hubbellock\", and introduced heavy-duty, circuit-breaking devices. The company played a large part in the war effort by meeting the demand for electrical components and systems to power the nation's industries and by developing products for the special applications needed by the military. These included components for military vehicle electrical circuits, battery-charging systems for M-4 tanks, power jacks for test meters, vacuum tube sockets for radio communications, and a line of electrical and electronic connectors for aircraft. The company's years of experience in building devices reliable enough for industrial use was a valuable asset in the production of products that could perform under rugged battlefield conditions. A second plant was opened in Lexington, Kentucky, in order to meet the demand and as a safety measure since the main plant in Bridgeport was considered vulnerable to air or sea attack. Hubbell Inc. assisted Allied efforts during World War II by manufacturing military vehicle electrical circuits, battery-charging systems for M4 Sherman tanks, power jacks for test meters, vacuum tube sockets for radio communications, and a line of electrical and electronic connectors for aircraft. Hubbell had been one of the first to manufacture flush toggle switches for alternating current only. The first Safety Receptacle was designed and produced as were the original \"grounding only\" devices which helped to set the standards for the industry. And while Hubbell was busy on land, the company found new opportunities at sea. In 1952, the ocean liner \"SS United States\" was launched in Newport News, Virginia. Queen of the seas for many years, the ship was completely fitted with Hubbell wiring devices designed expressly for narrow stateroom partitions and to withstand the effects of salt air. An ardent yachtsman himself, Harvey Hubbell III designed a complete family of corrosion resistant devices including both on-board and dockside equipment for the expanding pleasure boat industry. Familiar sights at marinas today, these first products were so successful that alternative designs were produced for many industrial applications where corrosive atmospheres and materials posed challenges for standard wiring devices. The company's sales in new products and continuing lines increased proportionately to these successes, but more was to come as Harvey Hubbell Incorporated added diversification. Beginning in 1960, the company entered a new period of rapidly expanding growth in both sales and income. Much of the growth resulted from the company's internal product development, a longstanding Hubbell tradition, and a source that expanded under the industry leadership of Harvey Hubbell III and other Hubbell engineers. A second source of growth through acquisition, from 1960 onwards to now, Hubbell Incorporated has acquired many companies working for power, electric, lighting sectors. Hubbell Incorporated has grown to be an international manufacturer of electrical and electronic products for a broad range of non-residential and residential construction, industrial, and utility applications. In 2010, the company moved its headquarters from Orange, Connecticut to Shelton, Connecticut. In October 2021, Hubbell announced an agreement to sell its Commercial and Industrial Lighting business to GE Current, a Daintree company (now Current Lighting Solutions). The agreement did not include Bell, Chalmit Lighting, Killark, or Progress Lighting (which all make lighting products). In the first quarter of 2024, Hubbell completed the sale of Progress Lighting. In 2023, Progress Lighting had revenue of $187.1 million (Hubbell Lighting had revenue of $515 million in 2022) and the sale amounted to $131 million. In March 2024, Hubbell was named one of Ethisphere Institute's World's Most Ethical Companies of the Year for the fourth time. In 2024, 136 honourees from 20 countries and 44 industries were recognised. Acquisitions Operations Hubbell designs, manufactures, and sells various product under two major sections which are Electrical Solutions and Utility Solutions. The utility segment markets products under the following brands: Aclara Chance Anderson PenCell Fargo Hubbell Polycast Opti-loop Design Quazite Quadri*sil Trinetics Reuel Electro Composites USCO Dual-Lite CDR RFL Design Hot Box PCORE Delmar Turner Electric EMC Longbow Ohio Brass Meramec Reliaguard Greenjacket Armorcast Beckwith Electric Continental R.W. Lyall Gas Breaker AEC Ripley The electrical solutions division markets products under the following brands: Hubbell BellRaco Gleason Reel ACME Electric Kellems TayMac Hipotronics Powerohm EC&M Design Bryant Wiegmann AccelTex Solutions iDevices Burndy Killark GAI-Tronics Connector Products Austdac CMC Hawke Chalmit PCX Key competitors Eaton Corporation (Cooper Wiring Devices) Legrand (Pass & Seymour) Leviton Lutron Electronics Company == References =="
}