{
  "ticker": "HUM",
  "cik": "0000049071",
  "company_name": "Humana",
  "corrected_name": "Humana",
  "wiki_title_used": "Humana",
  "exists": true,
  "raw_text": "Humana Inc. is an American for-profit health insurance company based in Louisville, Kentucky. In 2024, the company ranked 92 on the Fortune 500 list, which made it the highest ranked (by revenues) company based in Kentucky. It is the fourth largest health insurance provider in the U.S.\n\nHistory\n1961–1983: Nursing homes and hospitals\nLawyers David A. Jones Sr. and Wendell Cherry founded a nursing home company in 1961. The company, known in 1968 as Extendicare Inc., became the largest nursing home company in the United States. In 1972, Jones and Cherry sold the nursing home chain to purchase hospitals.\nIn 1974, the partners changed the corporate name to Humana Inc. The name was meant to change public perception from 'warehousing' or indifferently treating people to providing a higher level of human care and, by extension, more humane care. It grew in the following years, both by business and in 1978 through the takeover of American Medicorp Inc., which doubled the company's size, and grew into the world's largest hospital company in the 1980s. During this period, Humana developed the double corridor model for hospital construction. This design minimized the distance between patients and nurses by placing nursing support services in the interior of the building with patient rooms surrounding the perimeter.\n\n1984–present\nAs the American health care system changed in the 1980s, \"one of its hospitals in Arizona lost a contract with the largest health-maintenance organization in the area [and] Humana created its own health insurance plan.\"\nIn 1993, Humana had become the largest hospital operator in the country, owning 77 hospitals. Humana executives spun off hospital operations from health insurance operations to create Galen Health Care. The following year they sold the 73 hospitals of Galen Health Care Inc. to Nashville-based Columbia Hospital Corporation of America for $3.4 billion.\nIn 1998, one year after Jones had stepped aside as CEO, United Healthcare made an unsuccessful attempt to acquire Humana. Humana pulled out of the acquisition after United stock dropped $2.9 billion in value. In 2001, Humana was a cofounder of Availity.\nIn 2005, Humana entered into a business partnership with Virgin Group, offering financial incentives to members for healthy behavior, such as regular exercise.\nOn November 16, 2006, the Centers for Disease Control and Prevention (CDC) and Humana Inc. partnered to expand on traditional private-sector approaches to population health management.\nIn 2010, Humana bought Texas-based Concentra Inc., which owns urgent-care and physical therapy centers, for $790 million, effectively returning to healthcare services. In May 2011, Humana announced it would be using mobileStorm to transmit protected health information to patients.\nIn March 2015, Humana announced the sale of Concentra to private equity firm Welsh, Carson, Anderson & Stowe and Select Medical Holdings Corporation for about $1 billion, with proceeds to fund a \"$2 billion share buyback program and other corporate spending.\"\nIn July 2015, Aetna announced that it would acquire Humana for $37 billion in cash and stock (approximately $230 a share at that time). Aetna and Humana shareholders would own 74% and 26% of the new combined company, however the merger was blocked by a federal judge in January 2017. In February 2017, Aetna Inc. and Humana Inc. quashed a $34 billion merger agreement after judges ruled against the merger for a second time.\nIn July 2018, Humana joined two private equity firms in the acquisition of Kindred Healthcare. The deal provided Humana with a 40% stake in the company's home health, hospice and community care businesses, called \"Kindred at Home,\" for approximately $800 million. In August 2018, Humana announced the creation of a digital health and analytics division called Humana Studio H.\nIn December 2019, the company announced it would acquire Enclara Healthcare from Consonance Capital Partners and Enclara management.\nIn 2021, Susan Diamond, formerly occupying an interim position, was announced to be the new permanent CFO. Her appointment to the position comes with the company's focus being turned towards the home healthcare business, acquiring in April of the same year a 60% stake in Kindred at Home, an in-home care and hospice business.\nIn April 2022, it was announced Humana would sell a 60% interest of its Kindred at Home division to the private investment company, Clayton, Dubilier & Rice, for US$2.8 billion.\nIn February 2023, Humana announced they were exiting the employer-based commercial group insurance market.\n\nCorporate affairs\nSponsorship\nHumana is the presenting sponsor of the Grand Ole Opry and the National Senior Games.\nSince 1979, Humana has been a principal sponsor of the annual Humana Festival of New American Plays in Louisville, Kentucky.\nLPGA player Nancy Scranton was a spokesperson for Humana. In the past, PGA Tour player David Toms' David Toms Foundation has partnered with the Humana Foundation to provide grants to several children's charities in New Orleans. Humana is the official health benefits provider of the PGA Tour and Champions Tour.\nThe Humana Distaff Handicap is a Grade 1 race for thoroughbred fillies and mares, four-years-old and up. The race is run each spring on Kentucky Derby day at Churchill Downs and set at a distance of 7 furlongs for a purse of $250,000.\n\nHumana Military Healthcare Services\nIn 1993, Humana founded Humana Military Healthcare Services (HMHS) as a wholly owned subsidiary. They were awarded their first TRICARE contract in 1995, and began serving military beneficiaries in 1996.\nFrom 2004 to 2009, HMHS was the managed care contractor for the Department of Defense Military Health System TRICARE South Region.\nIn 2009, HMHS' Managed Care Support Contract was awarded to United Military and Veterans Services, a subsidiary of UnitedHealth Group. HMHS protested that decision and the Government Accountability Office upheld the protest in late 2009.\nIn 2011, HMHS regained the five-year contract to administer medical benefits to military members and families in the South region, a contract worth $23.5 billion. In 2018, this was moved to the new TRICARE East region during the TRICARE regional realignment.\nOn December 22, 2022, the Department of Defense announced the award of the managed care support contract for the TRICARE East Region to Humana Military.\n\nLegal campaign against drug price fixing\nHumana filed a lawsuit in August 2019, alleging that 37 defendants engaged in a “far-reaching conspiracy” to “blatantly fix the price” of generic drugs.  This follows a similar smaller lawsuit from October 2018.\n\nControversy\nIn 1987, Humana sued NBC over a story line in the television medical drama St. Elsewhere in which the hospital was to be sold to a for-profit medical corporation and renamed \"Ecumena\", with subsequent changes to the hospital, both positive and negative, emanating from that change. The company claimed that the program infringed on the Humana trademark. Humana failed to block the airing of the show, but was successful at forcing NBC into showing a disclaimer at the beginning of the September 30 episode saying that the drama had no connection whatsoever with Humana.\nOn May 30, 1996, Linda Peeno, a physician who was contracted to work for Humana for nine months, testified before Congress as to the downside of managed care. Peeno said she was effectively rewarded by her employer for causing the death of a patient, because it saved the company a half-million dollars. Peeno stated that she felt the \"managed care\" model was inherently unethical.\nIn 1999, season one of Michael Moore's TV series The Awful Truth reported on Humana refusing to pay for a diabetic patient with pancreatic failure needing a transplant. The man's policy stated it covered all of his diabetes-related expenses, but another section of the policy stated that it did not cover organ transplants. Moore conducted a fake funeral on the front steps of the Humana building, and three days later Humana changed its policy and authorized the man's treatment.\nMichael Moore's 2007 documentary Sicko used the video of Linda Peeno's testimony. On June 28, 2007, Humana declared that Peeno was never a Humana \"associate\" (permanent, full-time employee), but rather a \"part-time contractor.\" Humana disputed portions of her Congressional testimony by saying that because the patient's healthcare plan did not cover heart transplants, denial of coverage was valid.\nOn September 21, 2009, the U.S. Dept. of Health and Human Services opened an investigation into Humana for sending flyers to Medicare recipients that the AARP characterized as deceptive. The mail was made to appear to contain official information about Medicare Advantage and prescription drug benefit information, but instead alleged that core Medicare benefits could be cut by the Obama administration's healthcare reform, a claim refuted by John Rother, AARP's executive vice president. Douglas Elmendorf, the head of the Congressional Budget Office (CBO), supported the claim that Medicare benefits could be cut, but his comments were in reference to just one of several congressional bills. CBO estimates of another healthcare reform bill found that changes to premiums would vary. The Centers for Medicare and Medicaid Services instructed Humana to cease all such mailings to Medicare plan members pending an investigation. HHS Secretary Kathleen Sebelius, in a letter to the insurance industry, threatened that bad actors may be excluded from new health insurance markets that were to open in 2014. Senate Republicans pointed out in a letter to Sebelius that a 1997 directive from the Centers for Medicare and Medicaid Services explicitly allowed HMOs to tell members about legislation and urge them to express opinions.\n\nSee also\nTop 100 Contractors of the U.S. federal government\nList of major employers in Louisville, Kentucky\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Humana:",
  "clean_text": "Humana Inc. is an American for-profit health insurance company based in Louisville, Kentucky. In 2024, the company ranked 92 on the Fortune 500 list, which made it the highest ranked (by revenues) company based in Kentucky. It is the fourth largest health insurance provider in the U.S. History 1961–1983: Nursing homes and hospitals Lawyers David A. Jones Sr. and Wendell Cherry founded a nursing home company in 1961. The company, known in 1968 as Extendicare Inc., became the largest nursing home company in the United States. In 1972, Jones and Cherry sold the nursing home chain to purchase hospitals. In 1974, the partners changed the corporate name to Humana Inc. The name was meant to change public perception from 'warehousing' or indifferently treating people to providing a higher level of human care and, by extension, more humane care. It grew in the following years, both by business and in 1978 through the takeover of American Medicorp Inc., which doubled the company's size, and grew into the world's largest hospital company in the 1980s. During this period, Humana developed the double corridor model for hospital construction. This design minimized the distance between patients and nurses by placing nursing support services in the interior of the building with patient rooms surrounding the perimeter. 1984–present As the American health care system changed in the 1980s, \"one of its hospitals in Arizona lost a contract with the largest health-maintenance organization in the area [and] Humana created its own health insurance plan.\" In 1993, Humana had become the largest hospital operator in the country, owning 77 hospitals. Humana executives spun off hospital operations from health insurance operations to create Galen Health Care. The following year they sold the 73 hospitals of Galen Health Care Inc. to Nashville-based Columbia Hospital Corporation of America for $3.4 billion. In 1998, one year after Jones had stepped aside as CEO, United Healthcare made an unsuccessful attempt to acquire Humana. Humana pulled out of the acquisition after United stock dropped $2.9 billion in value. In 2001, Humana was a cofounder of Availity. In 2005, Humana entered into a business partnership with Virgin Group, offering financial incentives to members for healthy behavior, such as regular exercise. On November 16, 2006, the Centers for Disease Control and Prevention (CDC) and Humana Inc. partnered to expand on traditional private-sector approaches to population health management. In 2010, Humana bought Texas-based Concentra Inc., which owns urgent-care and physical therapy centers, for $790 million, effectively returning to healthcare services. In May 2011, Humana announced it would be using mobileStorm to transmit protected health information to patients. In March 2015, Humana announced the sale of Concentra to private equity firm Welsh, Carson, Anderson & Stowe and Select Medical Holdings Corporation for about $1 billion, with proceeds to fund a \"$2 billion share buyback program and other corporate spending.\" In July 2015, Aetna announced that it would acquire Humana for $37 billion in cash and stock (approximately $230 a share at that time). Aetna and Humana shareholders would own 74% and 26% of the new combined company, however the merger was blocked by a federal judge in January 2017. In February 2017, Aetna Inc. and Humana Inc. quashed a $34 billion merger agreement after judges ruled against the merger for a second time. In July 2018, Humana joined two private equity firms in the acquisition of Kindred Healthcare. The deal provided Humana with a 40% stake in the company's home health, hospice and community care businesses, called \"Kindred at Home,\" for approximately $800 million. In August 2018, Humana announced the creation of a digital health and analytics division called Humana Studio H. In December 2019, the company announced it would acquire Enclara Healthcare from Consonance Capital Partners and Enclara management. In 2021, Susan Diamond, formerly occupying an interim position, was announced to be the new permanent CFO. Her appointment to the position comes with the company's focus being turned towards the home healthcare business, acquiring in April of the same year a 60% stake in Kindred at Home, an in-home care and hospice business. In April 2022, it was announced Humana would sell a 60% interest of its Kindred at Home division to the private investment company, Clayton, Dubilier & Rice, for US$2.8 billion. In February 2023, Humana announced they were exiting the employer-based commercial group insurance market. Corporate affairs Sponsorship Humana is the presenting sponsor of the Grand Ole Opry and the National Senior Games. Since 1979, Humana has been a principal sponsor of the annual Humana Festival of New American Plays in Louisville, Kentucky. LPGA player Nancy Scranton was a spokesperson for Humana. In the past, PGA Tour player David Toms' David Toms Foundation has partnered with the Humana Foundation to provide grants to several children's charities in New Orleans. Humana is the official health benefits provider of the PGA Tour and Champions Tour. The Humana Distaff Handicap is a Grade 1 race for thoroughbred fillies and mares, four-years-old and up. The race is run each spring on Kentucky Derby day at Churchill Downs and set at a distance of 7 furlongs for a purse of $250,000. Humana Military Healthcare Services In 1993, Humana founded Humana Military Healthcare Services (HMHS) as a wholly owned subsidiary. They were awarded their first TRICARE contract in 1995, and began serving military beneficiaries in 1996. From 2004 to 2009, HMHS was the managed care contractor for the Department of Defense Military Health System TRICARE South Region. In 2009, HMHS' Managed Care Support Contract was awarded to United Military and Veterans Services, a subsidiary of UnitedHealth Group. HMHS protested that decision and the Government Accountability Office upheld the protest in late 2009. In 2011, HMHS regained the five-year contract to administer medical benefits to military members and families in the South region, a contract worth $23.5 billion. In 2018, this was moved to the new TRICARE East region during the TRICARE regional realignment. On December 22, 2022, the Department of Defense announced the award of the managed care support contract for the TRICARE East Region to Humana Military. Legal campaign against drug price fixing Humana filed a lawsuit in August 2019, alleging that 37 defendants engaged in a “far-reaching conspiracy” to “blatantly fix the price” of generic drugs. This follows a similar smaller lawsuit from October 2018. Controversy In 1987, Humana sued NBC over a story line in the television medical drama St. Elsewhere in which the hospital was to be sold to a for-profit medical corporation and renamed \"Ecumena\", with subsequent changes to the hospital, both positive and negative, emanating from that change. The company claimed that the program infringed on the Humana trademark. Humana failed to block the airing of the show, but was successful at forcing NBC into showing a disclaimer at the beginning of the September 30 episode saying that the drama had no connection whatsoever with Humana. On May 30, 1996, Linda Peeno, a physician who was contracted to work for Humana for nine months, testified before Congress as to the downside of managed care. Peeno said she was effectively rewarded by her employer for causing the death of a patient, because it saved the company a half-million dollars. Peeno stated that she felt the \"managed care\" model was inherently unethical. In 1999, season one of Michael Moore's TV series The Awful Truth reported on Humana refusing to pay for a diabetic patient with pancreatic failure needing a transplant. The man's policy stated it covered all of his diabetes-related expenses, but another section of the policy stated that it did not cover organ transplants. Moore conducted a fake funeral on the front steps of the Humana building, and three days later Humana changed its policy and authorized the man's treatment. Michael Moore's 2007 documentary Sicko used the video of Linda Peeno's testimony. On June 28, 2007, Humana declared that Peeno was never a Humana \"associate\" (permanent, full-time employee), but rather a \"part-time contractor.\" Humana disputed portions of her Congressional testimony by saying that because the patient's healthcare plan did not cover heart transplants, denial of coverage was valid. On September 21, 2009, the U.S. Dept. of Health and Human Services opened an investigation into Humana for sending flyers to Medicare recipients that the AARP characterized as deceptive. The mail was made to appear to contain official information about Medicare Advantage and prescription drug benefit information, but instead alleged that core Medicare benefits could be cut by the Obama administration's healthcare reform, a claim refuted by John Rother, AARP's executive vice president. Douglas Elmendorf, the head of the Congressional Budget Office (CBO), supported the claim that Medicare benefits could be cut, but his comments were in reference to just one of several congressional bills. CBO estimates of another healthcare reform bill found that changes to premiums would vary. The Centers for Medicare and Medicaid Services instructed Humana to cease all such mailings to Medicare plan members pending an investigation. HHS Secretary Kathleen Sebelius, in a letter to the insurance industry, threatened that bad actors may be excluded from new health insurance markets that were to open in 2014. Senate Republicans pointed out in a letter to Sebelius that a 1997 directive from the Centers for Medicare and Medicaid Services explicitly allowed HMOs to tell members about legislation and urge them to express opinions."
}