{
  "ticker": "HWM",
  "cik": "0000004281",
  "company_name": "Howmet Aerospace",
  "corrected_name": "Howmet Aerospace",
  "wiki_title_used": "Howmet Aerospace",
  "exists": true,
  "raw_text": "Howmet Aerospace Inc. is an American aerospace company based in Pittsburgh, Pennsylvania. The company manufactures components for jet engines, fasteners, titanium structures for aerospace applications, and forged aluminum wheels for heavy trucks.\nThe firm operates 27 facilities in the United States, Canada, Mexico, France, the United Kingdom, China, Brazil, Hungary and Japan.\n\nHistory\nBefore Alcoa acquisition\nHowmet's roots go back to 1926, when Austenal, a company that manufactured materials for dental appliances, was founded. Its founders, Reiner Erdle and Charles Prange, worked to improve investment chrome base castings using two separate investments: The first coating, named \"protective coat\", gives a smooth finish. It was smothered with alcohol binder investment to obtain a correct expansion. This technology replaced gold alloy with vitallium and was popular during the Great Depression.\nDuring the 1930s, Austenal expanded into aircraft engine superchargers with superior castings when General Electric asked for help to improve manufacturing practices for wartime production demands.\nIn 1958, Howe Sound Company, a metals and mining business, acquired Austenal. In 1959, Howe acquired Michigan Steel Casting Co. (MISCO), which provided the monolithic shell process. This process uses a ceramic shell with thin, strong walls to increase control of the solidification process and produce a sounder casting.\nHowe became Howmet in 1965, marking a transition from a mining company to a manufacturer of precision metal products. Howmet, in turn, was purchased in 1975 by Pechiney, a multinational aluminum company. In 1989, Pechiney purchased the Cercast group of companies, bringing Howmet into the aluminum casting industry.\nIn 1995, Pechiney sold Howmet to a joint venture between Thiokol and The Carlyle Group. By late 1997, the ownership structure of Howmet had become Thiokol, with 62% ownership, Carlyle 23%, and the public 15%. In 1998, Thiokol changed its name to Cordant Technologies Inc.; by February 1999, Cordant owned 84.7% of Howmet.\n\nAs Alcoa Inc. and Arconic Inc.\nIn 2000, Cordant sold its stake in Howmet to Alcoa, which placed Howmet into its Alcoa Industrial Components unit. In 2004, Howmet was part of a merger that created Alcoa Investment Casting and Forged Products unit. In 2007, Howmet was renamed Alcoa Howmet as a newly formed Alcoa Power and Propulsion unit division.\nOn November 1, 2016, Alcoa Inc. spun off its bauxite, alumina, and aluminum operations to a new company called Alcoa Corp. Alcoa Inc. was renamed Arconic Inc., and retained the operations in aluminum rolling (excluding the Warrick operations), aluminum plate, precision castings, and aerospace and industrial fasteners. Its focus became turning aluminum and other lightweight metals into engineered products such as turbine blades for sectors including aerospace and automotive.\nOn January 31, 2017, the hedge fund Elliott Management Corporation launched a proxy contest against Arconic. Elliott publicly called for firing Arconic's CEO, Klaus Kleinfeld, citing the company's lackluster stock performance, missed profit forecasts, and inefficient spending. On April 17, 2017, Kleinfeld resigned as chairman and CEO by mutual agreement with the board of Arconic, after sending an unauthorized letter to Elliott.\nOn February 8, 2019, Arconic announced that it would split into two separate businesses. Arconic Inc. would be renamed Howmet Aerospace Inc. and a new company, Arconic Corporation, would be set up and spun out. Arconic Corporation will be focused on rolled aluminum products, and Howmet Aerospace will focus on engineered products. The separation was scheduled to become effective on April 1, 2020.\nIn 2024, during the Gaza war, Howmet's Pittsburgh headquarters were targeted by pro-Palestinian protestors--Howmet produces titanium components used in Lockheed Martin fighter jets that have been sold to Israel.\n\nSee also\nHowmet TX - Howmet-backed turbine race car.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Howmet Aerospace Inc.:",
  "clean_text": "Howmet Aerospace Inc. is an American aerospace company based in Pittsburgh, Pennsylvania. The company manufactures components for jet engines, fasteners, titanium structures for aerospace applications, and forged aluminum wheels for heavy trucks. The firm operates 27 facilities in the United States, Canada, Mexico, France, the United Kingdom, China, Brazil, Hungary and Japan. History Before Alcoa acquisition Howmet's roots go back to 1926, when Austenal, a company that manufactured materials for dental appliances, was founded. Its founders, Reiner Erdle and Charles Prange, worked to improve investment chrome base castings using two separate investments: The first coating, named \"protective coat\", gives a smooth finish. It was smothered with alcohol binder investment to obtain a correct expansion. This technology replaced gold alloy with vitallium and was popular during the Great Depression. During the 1930s, Austenal expanded into aircraft engine superchargers with superior castings when General Electric asked for help to improve manufacturing practices for wartime production demands. In 1958, Howe Sound Company, a metals and mining business, acquired Austenal. In 1959, Howe acquired Michigan Steel Casting Co. (MISCO), which provided the monolithic shell process. This process uses a ceramic shell with thin, strong walls to increase control of the solidification process and produce a sounder casting. Howe became Howmet in 1965, marking a transition from a mining company to a manufacturer of precision metal products. Howmet, in turn, was purchased in 1975 by Pechiney, a multinational aluminum company. In 1989, Pechiney purchased the Cercast group of companies, bringing Howmet into the aluminum casting industry. In 1995, Pechiney sold Howmet to a joint venture between Thiokol and The Carlyle Group. By late 1997, the ownership structure of Howmet had become Thiokol, with 62% ownership, Carlyle 23%, and the public 15%. In 1998, Thiokol changed its name to Cordant Technologies Inc.; by February 1999, Cordant owned 84.7% of Howmet. As Alcoa Inc. and Arconic Inc. In 2000, Cordant sold its stake in Howmet to Alcoa, which placed Howmet into its Alcoa Industrial Components unit. In 2004, Howmet was part of a merger that created Alcoa Investment Casting and Forged Products unit. In 2007, Howmet was renamed Alcoa Howmet as a newly formed Alcoa Power and Propulsion unit division. On November 1, 2016, Alcoa Inc. spun off its bauxite, alumina, and aluminum operations to a new company called Alcoa Corp. Alcoa Inc. was renamed Arconic Inc., and retained the operations in aluminum rolling (excluding the Warrick operations), aluminum plate, precision castings, and aerospace and industrial fasteners. Its focus became turning aluminum and other lightweight metals into engineered products such as turbine blades for sectors including aerospace and automotive. On January 31, 2017, the hedge fund Elliott Management Corporation launched a proxy contest against Arconic. Elliott publicly called for firing Arconic's CEO, Klaus Kleinfeld, citing the company's lackluster stock performance, missed profit forecasts, and inefficient spending. On April 17, 2017, Kleinfeld resigned as chairman and CEO by mutual agreement with the board of Arconic, after sending an unauthorized letter to Elliott. On February 8, 2019, Arconic announced that it would split into two separate businesses. Arconic Inc. would be renamed Howmet Aerospace Inc. and a new company, Arconic Corporation, would be set up and spun out. Arconic Corporation will be focused on rolled aluminum products, and Howmet Aerospace will focus on engineered products. The separation was scheduled to become effective on April 1, 2020. In 2024, during the Gaza war, Howmet's Pittsburgh headquarters were targeted by pro-Palestinian protestors--Howmet produces titanium components used in Lockheed Martin fighter jets that have been sold to Israel."
}