{
  "ticker": "IBKR",
  "cik": "0001381197",
  "company_name": "Interactive Brokers",
  "corrected_name": "Interactive Brokers",
  "wiki_title_used": "Interactive Brokers",
  "exists": true,
  "raw_text": "Interactive Brokers, Inc. (abbreviated as IB or IBKR) is an American multinational brokerage firm headquartered in Greenwich, Connecticut. It operates the largest electronic trading platform in the United States by number of daily average revenue trades. In 2024, the platform processed an average of 2.6 million trades per trading day. Interactive Brokers is the largest foreign exchange market broker and is one of the largest prime brokers servicing commodity brokers. The company brokers stocks, options, futures contracts, exchange of futures for physicals, options on futures, bonds, mutual funds, currency, cryptocurrency, contracts for difference, derivatives, and trading in prediction markets. Interactive Brokers offers direct market access, omnibus and non-disclosed broker accounts, and provides clearing services. The firm has operations in 36 countries and 28 currencies. As of December 31, 2024, it had 3.337 million institutional and individual brokerage customers, with total customer equity of US$568.2 billion. In addition to its headquarters in Greenwich, on the Gold Coast of Connecticut, the company has offices in major financial centers worldwide. More than half of the company's customers reside outside the United States, in approximately 200 countries. \nThe broker was founded and is chaired by Thomas Peterffy, an early innovator in computer-assisted trading. Approximately 25.8% of the company is publicly held, while the remainder is owned by IBG Holdings LLC, which is 91.4% owned by Thomas Peterffy and affiliates. Interactive Brokers is ranked 473rd on the Fortune 500.\nThe company traces its roots to T.P. & Co., a market maker founded in 1977 and renamed Timber Hill Inc. in 1982. In 1979, it became the first to use fair value pricing sheets on a stock exchange trading floor. In 1983, it became the first to use handheld computers for trading. In 1987, Peterffy also created the first fully automated algorithmic trading system, to automatically create and submit orders to a market. Between 1993 and 1994, the corporate group Interactive Brokers Group was created, and the subsidiary Interactive Brokers LLC was created to control its electronic brokerage, and to keep it separate from Timber Hill, which conducts market making. In 2014, Interactive Brokers became the first online broker to offer direct access to IEX, a private forum for trading securities. In 2021, the company launched trading in cryptocurrencies, including Bitcoin and Ethereum.\n\nHistory\nIn 1977, Thomas Peterffy left his job designing commodity trading software for Mocatta Metals, and bought a seat on the American Stock Exchange (AMEX) as an individual market maker. The following year, he formed his first company, named T.P. & Co., to expand trading activities to several members under badge number 549. At the time, trading used an open outcry system; Peterffy developed algorithms to determine the best prices for options and used those on the trading floor, and thus the firm became the first to use daily printed fair value pricing sheets. In 1979, the company expanded to employ four traders, three of whom were AMEX members. In 1982, Peterffy renamed T.P. & Co. to Timber Hill Inc.; he named it after a road to a favorite retreat, one of his properties on Hutchin Hill Road in Woodstock, New York. By 1983, Peterffy was sending orders to the floor from his upstairs office; he devised a system to read the data from a Quotron machine by measuring the electric pulses in the wire and decoding them. The data would then be sent through Peterffy's trading algorithms, and then Peterffy would call down the trades. After pressure to become a true market maker and keep constant bids and offers, Peterffy knew that he would need his employees to closely pay attention to market movements, and that handheld computers would help. At the time, the AMEX didn't permit computers on the trading floor. Because of this, Peterffy had an assistant deliver market information from his office in the World Trade Center. In November 1983, he convinced the exchange to allow computer use on the floor.\nIn 1983, Peterffy sought to computerize the options market, and he first targeted the Chicago Board Options Exchange (CBOE). At the time, brokers still used fair value pricing sheets, which were by then updated once or twice a day. In 1983, Timber Hill created the first handheld computers used for trading. As Peterffy explained in a 2016 interview, the battery-powered units had touch screens for the user to input a stock price and it would produce the recommended option prices, and it also tracked positions and continually repriced options on stocks. However, he immediately encountered opposition from the heads of the exchange. When he first brought a 12-inch-long (30 cm) by 9-inch-wide (23 cm) device to the exchange floor, a committee in the exchange told him it was too big. When he made the device smaller, the committee stated that no analytic devices were allowed to be used on the exchange floor. Effectively blocked from using the CBOE, he sought to use his devices in other exchanges.\n\nAlso in 1983, Timber Hill expanded to 12 employees and began trading on the Philadelphia Stock Exchange. In 1984, Timber Hill began coding a computerized stock index futures and options trading system and, in February 1985, Timber Hill's system and network was brought online. The system was designed to centrally price and manage risk on a portfolio of equity derivatives traded in multiple locations around the country. In 1985, Peterffy introduced his computer system to the New York Stock Exchange (NYSE), which allowed it. However, the stock exchange only allowed it to be used at trading booths several yards away from where transactions were executed. Peterffy responded by designing a code system for his traders to read colored bars emitted in patterns from the video displays of computers in the booths. This caused the exchange and other members to be suspicious of insider trading, which convinced Timber Hill to distribute instructions throughout the exchange, describing how to read the displays. In response, the exchange required the company to turn the screens away from the trading floor, which prompted Peterffy to hire a clerk to communicate with the traders via hand signals. Eventually computers were allowed on the trading floor.\n\nTimber Hill joined the Options Clearing Corporation in 1984, the New York Futures Exchange in 1985, and the Pacific Stock Exchange and the options division of the NYSE the following year. Also in 1985, the firm joined and began trading on the Chicago Mercantile Exchange, the Chicago Board of Trade and the Chicago Board Options Exchange. In 1986, the company moved its headquarters to the World Trade Center to control activity at multiple exchanges. Peterffy again hired workers to sprint from his offices to the exchanges with updated handheld devices, which he later superseded with phone lines carrying data to computers at the exchanges. Peterffy later built miniature radio transmitters into the handhelds and the exchange computers to allow data to automatically flow to them.\nIn 1987, Timber Hill joined the National Securities Clearing Corporation and the Depository Trust Company (now merged as the Depository Trust & Clearing Corporation). By 1987, Timber Hill had 67 employees and had become self-clearing in equities. In 1987, the CBOE was about to close down its S&P 500 options market due to the options not attracting sufficient trader interest. Because of this, Peterffy pledged that Timber Hill would make tight markets in the product for a year if the exchange would allow the traders to use handheld computers on the trading floor. The exchange agreed, and more traders were attracted by the change in pricing; today S&P 500 options are the most actively traded stock market index options in the U.S. In 1990, Timber Hill Deutschland GmbH was incorporated in Germany, and shortly thereafter began trading equity derivatives at the Deutsche Terminbörse (DTB), marking the first time that Timber Hill used one of its trading systems on a fully automated exchange. In 1992, Timber Hill began trading at the Swiss Options and Financial Futures Exchange, which merged with DTB in 1998 to become Eurex. At that time, Timber Hill had 142 employees.\nWhile Peterffy was trading on the Nasdaq in 1987, he created the first fully automated algorithmic trading system. It consisted of an IBM computer that would pull data from a Nasdaq terminal connected to it and carry out trades on a fully automated basis. The machine, for which Peterffy wrote the software, worked faster than a trader could. Upon inspection, the Nasdaq banned direct interface with the terminal, and required trades to be typed in manually. Peterffy and his team designed a system with a camera to read the terminal, a computer to decode the visual data, and mechanical fingers to type in the trade orders, which was then accepted by the Nasdaq.\n\n1993 to 2000\nInteractive Brokers Inc. was incorporated in 1993 as a U.S. broker-dealer, to provide technology developed by Timber Hill for electronic network and trade execution services to customers.\nIn 1994, Timber Hill Europe began trading at the European Options Exchange, the OM Exchange and the London International Financial Futures and Options Exchange. Also in 1994, Timber Hill Deutschland became a member of the Belgium Futures and Options Exchange, IB became a member of the New York Stock Exchange, and the Timber Hill Group LLC was formed as a holding company of Timber Hill and IB's operations. Timber Hill UK Ltd was incorporated in November 1994.\nIn 1995, Timber Hill France S.A. was incorporated and began making markets at the Marché des Options Négociables de Paris (a subsidiary of Euronext Paris) and the Marché à Terme International de France futures exchange. Also in 1995, Timber Hill Hong Kong began market making at the Hong Kong Futures Exchange and IB created its primary trading platform Trader Workstation and executed its first trades for public customers.\nIn 1996, Timber Hill Securities Hong Kong Limited was incorporated and began trading at the Hong Kong Stock Exchange. In the next year, Timber Hill Australia Pty Limited was incorporated in Australia, and Timber Hill Europe began trading in Norway and became a member of the Austrian Derivatives Exchange. By 1997, Timber Hill had 284 employees. In 1998, Timber Hill Canada Company was formed, and IB began to clear online trades for retail customers connected directly to Globex to trade S&P 500 futures.\nIn 1999, IB introduced a smart order routing linkage for multiple-listed equity options and began to clear trades for its customer stocks and equity derivatives trades. Timber Hill Canada Co was founded in 1999. Also in that year, Goldman Sachs attempted to purchase the company and was rejected.\nIn 2000, Interactive Brokers (U.K.) Limited was formed and Timber Hill became a primary market maker on the International Securities Exchange (ISE).\n\n2001 to 2020\nIn 2001, the corporate name of the Timber Hill Group LLC was changed to Interactive Brokers Group LLC, which at the time handled 200,000 trades per day. In 2002, Interactive Brokers, along with the Bourse de Montréal and the Boston Stock Exchange, created the Boston Options Exchange. Also in 2002, the company introduced Mobile Trader and an application programming interface for customers and developers to integrate their mobile phone systems with the IB trading system. Also in 2002, Timber Hill became the major market maker for the newly introduced U.S. single-stock futures.\nIn 2003, the company expanded its trade execution and clearing services to include Belgian index options and futures, Canadian stocks, equity/index options and futures, Dutch index options and futures, German equity options, Italian index options and futures, Japanese index options and futures, and U.K. equity options. In 2004, the company introduced direct market access to its customers on the Frankfurt Stock Exchange and the Börse Stuttgart. In the same year, IB upgraded its account management system and Trader Workstation, adding real-time data including charts, scanners, fundamental analytics, and tools to the platform.\nIn 2005, the company launched its forex trading platform IdealPro (now Ideal FX). At that point, Interactive Brokers was one of the largest private securities firms in the United States with $2 billion in capital, it handled 20% of total options volume in the US and 16% worldwide.\nIn 2006, the IB Options Intelligence Report was launched to report on unusual concentrations of trading interests and changing levels of uncertainty in the option markets. Also that year, IBG took stakes in OneChicago, the ISE Stock Exchange, and the CBOE Stock Exchange. Later in 2006, Interactive Brokers began offering penny-priced options.\nOn May 3, 2007, the company went public via an initial public offering (IPO) on the Nasdaq, selling 40 million shares, or 10% of the company, at $30.01 per share via a Dutch auction in the largest brokerage IPO since 2005.\nIn December 2007, the company acquired FutureTrade Technologies, an integrated electronic equity and option trading service provider. In the following year, Interactive Brokers launched Risk Navigator, a real-time market risk management platform. Also in 2008, several trading algorithms were introduced to the Trader Workstation. Among these is the Accumulate-Distribute Algo, which allows traders to divide large orders into small non-uniform increments and release them at random intervals over time to achieve better prices for large volume orders.\nIn 2008, the company launched Risk Navigator, a real-time market risk management platform. Also in 2008, several trading algorithms were introduced to the Trader Workstation. Among these is the Accumulate-Distribute Algo, which allows traders to divide large orders into small non-uniform increments and release them at random intervals over time to achieve better prices for large volume orders.\nIn 2009, IB launched a mobile app for iOS. In March of the same year, the company launched brokerage services in India.\nIn 2011, the company introduced several new services, including the Interactive Brokers Information System, Hedge Fund Capital Introduction Program, and the Stock Yield Enhancement Program. Interactive Brokers also became in 2011 the largest online U.S. broker as measured by daily average revenue trades.\nDuring the Occupy Wall Street protests of 2011–2012, IB ran a series of television commercials with the catchphrase \"Join the 1%\", which were seen as a controversial criticism of the protests.\nIn 2012, the company began offering money manager accounts and opened the fully electronic Money Manager Marketplace. IB also released the TWS Mosaic trading interface and the Tax Optimizer for managing capital gains and capital losses.\nIn 2013, the company released the Probability Lab tool and Traders' Insight, a service that provides daily commentary by Interactive Brokers traders and third party contributors. Also in 2013, IB integrated its trading notification tool (called IB FYI) into the TWS. The tool keeps customers informed of upcoming announcements that could impact their account, and a customer can set it to automatically act to exercise options early if the action is projected to be beneficial for the customer. An IB FYI also can act to automatically suspend a customer's orders before the announcement of major economic events that influence the market. Between 2007 and 2013, Interactive's brokerage arm revenue and pretax profits grew from $391 to $814 mln, however, the marketmaker's profits dropped drastically from $331 mln to $72 mln.\nOn April 3, 2014, the company became the first online broker to offer direct access to IEX, a private electronic communication network for trading securities, which was subsequently registered as an exchange.\nIn May 2015, the company acquired investment management platform Covestor. In the same year, Interactive Brokers launched Investors' Marketplace, which allows customers to find investors and other service providers in the financial industry. For the 4th quarter 2015, IB reported a 17% net revenue decrease to $208.1 mln, though total daily average revenue trades reached 619,000, while total noninterest expenses declined 37%. Meanwhile, IB's market making division, Timber Hill, reported a 49% drop in pre-tax income to $15.1 mln.\nA mobile app for the Apple Watch was released in March 2016.\nIn October 2017, the company sold its market maker business, Timber Hill, to Two Sigma Investments.\nThe company's founder Thomas Peterffy stepped down from CEO position in 2019, when he turned 75. He retained the position of Chairman, while President Milan Galik was appointed CEO.\nIn September 2019, the company launched commission-free trades via \"IBKR Lite\". Two months later, the company began offering fractional share trading.\n\n2020 to present\nIn 2020, the company reported reaching a customer base of one million users. In December 2020, IB acquired the retail operations of Folio Investments, including 70,000 accounts, from Goldman Sachs.\nIn May 2021, IB launched trading in spot gold for U.S. clients. In September 2021, the company introduced trading in cryptocurrencies, including Bitcoin and Ethereum. In May 2024, the platform was expanded to clients in the United Kingdom.\nIn July 2023, the company launched trading on the Taiwan Stock Exchange. A month later, IB launched fractional share trading in Canadian securities and launched trading on Bursa Malaysia.\nIn 2024, the platform processed an average of 2.6 million trades per trading day. In late 2024, the company began offering trading in prediction markets including forecast contracts on the 2024 United States presidential election. It became the second brokerage to offer this instrument after Kalshi. Though in 2020 the CFTC approved the issuance of event contracts, the regulator soon questioned its decision and reported serious concerns about them. The Authority believes that event contracts are structured as binary options, long banned in Europe because of their gambling nature. The CFTC has been engaged in a prolonged legal battle with Kalshi over political contracts. Meanwhile in 2025, IB launched forecast contracts in Canada.\n\nLawsuits and fines\nSanctions violations\nOn 15 July 2025, the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) announced a $11.8 mln settlement with Interactive Brokers LLC for apparent violations of several OFAC sanctions programs. According to the agency, since July 2016 IB had provided brokerage and investment services to individuals located in Iran, Cuba, Syria, and the Crimea region. The company also processed transactions in securities associated with the Chinese Military-Industrial Complex program, as well as trades involving sanctioned individuals under OFAC's Russia, Global Magnitsky, Venezuela, and Syria sanctions programs. OFAC emphasized that the violations could have been avoided through regular and effective maintenance of the firm's compliance systems. Between July 2016 and July 2021 alone, Interactive Brokers provided services to more than 200 account holders from Iran, Cuba, Syria, and Crimea, who collectively executed over 12,000 transactions.\n\nOperational and trading failures\nOn 20 April 2020, West Texas Intermediate futures for May delivery plunged to -$40.32 per barrel, marking the first time in history oil futures traded at negative prices. Many Interactive Brokers clients incurred losses exceeding the equity available in their accounts. Following an investigation, in September 2021 the Commodity Futures Trading Commission (CFTC) ordered the company to pay a $1.75 million civil penalty and reimburse affected customers $82.57 million. The regulator concluded that Interactive Brokers had received prior warnings about the risk of negative pricing but failed to update or properly configure its electronic trading system. As a result, the platform was unable to display negative prices, and minimum margin requirements were not enforced before trades in WTI contracts were executed.\nIn June 2024, Interactive Brokers recorded a $48 million loss due to a technical malfunction during early trading of Berkshire Hathaway Class A shares on the New York Stock Exchange (NYSE). The stock price briefly crashed from $622,000 to $185 per share, triggering a surge in client purchases. When trading resumed two hours later, the stock rebounded sharply to $741,941. The NYSE subsequently cancelled all trades executed below $603,718.30, leaving Interactive Brokers responsible for covering the majority of client losses.\n\nRegulatory fines and oversight\nUnited States\nIn August 2018, Interactive Brokers was fined $5.5 million for violating federal regulations on naked short selling. According to the Financial Industry Regulatory Authority (FINRA), the firm failed to properly supervise such activity between July 2012 and June 2015, despite internally identifying the issue. No corrective action was taken to update its supervisory systems during that period.\nIn August 2020, the company agreed to pay over $38 million in total penalties to multiple U.S. regulators. FINRA imposed a $15 million fine for persistent anti–money laundering (AML) deficiencies. From June 2014 to November 2018, Interactive Brokers failed to file over 150 suspicious activity reports (SARs), including one involving a New York-based trader who defrauded investors of more than $23 million. Additionally, hundreds of millions of dollars in wire transfers went unmonitored. The U.S. Securities and Exchange Commission (SEC) levied a separate $23 million fine for repeated failures to file SARs and for inadequate oversight of employees managing customer accounts. The Commodity Futures Trading Commission (CFTC) added $706,214 in disgorgement for related violations.\nIn October 2023, the SEC fined Interactive Brokers $35 million for \"widespread and longstanding failures to maintain and preserve electronic communications.\" According to the investigation, since at least 2019, senior employees routinely used unauthorized communication channels such as private messaging apps and WhatsApp. The CFTC imposed a concurrent $20 million penalty for the same violations.\nIn April 2024, Nasdaq fined the firm $475,000 for improperly handling five corporate actions between January 2020 and June 2021. The enforcement report cited multiple supervisory and systems failures, including cases in which clients were able to sell shares they did not actually own.\nIn October 2024, FINRA issued a separate $475,000 fine for violations of the Customer Protection Rule during the period June–December 2021. The regulator identified over 800 instances in which the firm miscalculated the number of excess shares of stocks listed on European exchanges available for return to customers. It also found that an unregistered individual was given authority over adjustments to the securities lending algorithm. \nIn December 2024, FINRA fined Interactive Brokers $2.25 million for more than 4.2 million instances of free-riding (a practice involving securities transactions without sufficient capital). In May 2025, the firm was fined an additional $400,000 after FINRA discovered further compliance failures. From January 2020 to June 2022, Interactive Brokers failed to accurately report required statistical summaries of written customer complaints. Moreover, 91 instances of regulatory or civil enforcement actions dating from July 2011 to September 2022 were omitted from required disclosures.\n\nUnited Kingdom\nIn January 2018, the Financial Conduct Authority (FCA) fined Interactive Brokers £1,049,412 (approximately $1.43 million) for deficiencies in its market abuse surveillance systems. The FCA found that between February 2014 and February 2015, the company failed to adequately detect and report potentially suspicious trading activity. The regulator noted that Interactive Brokers did not implement effective controls to identify manipulative or abusive trading patterns.\n\nAustralia\nIn September 2023, the Australian Securities and Investments Commission (ASIC) imposed a AUD $832,500 penalty on Interactive Brokers Australia Pty Ltd for negligent and reckless conduct related to suspicious trading activity. According to ASIC, the firm failed to properly monitor its clients' trading and did not investigate several red flags between July and September 2021, during which a client engaged in potentially manipulative trading in contract for difference (CFD) products. ASIC stated that Interactive Brokers did not have adequate systems and controls to detect and respond to such conduct, and that the firm's compliance team was understaffed and undertrained.\n\nHong Kong\nIn April 2025, the Securities and Futures Commission (SFC) fined the Hong Kong unit of Interactive Brokers HK$4.2 million (US$541,453.42) for mishandling client assets. Between 3 December 2017 and 23 October 2020, the firm had erroneously loaned securities belonging to its clients to other market participants without obtaining valid authorization. The SFC determined that 7,911 clients were affected, with the market value of the misused securities estimated at over HK$586 billion. The regulator described the breach as a serious failure in the firm's internal controls and compliance processes.\n\nFrauds and lawsuits\nPonzi schemes\nIn 2021, Interactive Brokers was sued by Benjamin Chang, a victim of Haena Park's Ponzi-scheme, accusing IB of aiding and abetting Park in her fraud. Through her IB account, Park had lost more than $19 mio. of investors' money. Since 2012, Park has consistently funded the account and then lost on high-risk trades in amounts far in excess of her net worth and the earnings data she provided. IB's compliance department reported her account's activity as suspicious at least 12 times, but every time IB supervisors ignored the reports. When in 2015 a compliance analyst ultimately reported her account, IB compliance officers overrode the Customer Account Supervision System to allow Park to continue trading. She was arrested in June 2016 and sentenced in 2017 to three years in prison. The lawsuit against Interactive Brokers was dismissed by Judge Nathanael Cousins of the California Northern District Court on 25 April 2022.\nIn January 2025, David A. Castleman sued Interactive Brokers LLC in the New York Southern District Court, accusing the broker of negligence and aiding breach of fiduciary duty. Castleman was a client of EminiFX, a trading platform under the CEO Eddy Alexandre. Alexandre lured tens of thousands of investors into a Ponzi scheme by promising high returns with no risk, and defrauded them of more than $248 mln. He was later sentenced to nine years in prison. Among the rest, in December 2021 and January 2022, Alexandre transferred $9 mln from his personal bank account to his account at IB and engaged in high-risk trading, eventually losing more than $7 mln in short order. Castleman claimed that IB either knew or should have known from the due diligence and investigation it undertook that EminiFX was a Ponzi scheme and that Alexandre was wasting his investors' money. However, the lawsuit was terminated by Judge Valerie E. Caproni on 10 April 2025.\n\nClient fraud and oversight failures\nThe New Jersey Division of Consumer Affairs and the Bureau of Securities determined that Interactive Brokers had allowed Peter Zuck, a three-time convicted financial felon, to open and operate accounts on its platform despite being permanently barred by the National Futures Association (NFA). Zuck was permitted to open at least 16 accounts, including two master accounts in his own name and eleven sub-accounts in the names of other individuals that were linked to the same master account. Zuck lured investors into his Osiris Fund Limited Partnership and used the IB platform to defraud them of more than $7.5 million. The Bureau emphasized that IB failed to conduct the NFA BASIC search during the account opening process and thereby facilitated Zuck's illegal scheme. On 11 February 2019, the Bureau announced that IB had agreed to pay a $100,000 civil penalty.\n\nPrivate litigation and negligence\nIn 2015, Robert Scott Batchelar filed a lawsuit against Interactive Brokers over breach of contract, negligence, and commercially unreasonable liquidation of pledged collateral. According to Batchelar, IB's trading software was negligently designed, coded, maintained and used in a way that an automatic liquidation of the positions in his account cost him thousands of dollars more than it should have. On September 28, 2016, the Court dismissed his complaint. It has been revived later, though stuck in discovery. As of June 2025, Interactive Brokers seeks a protective order forbidding the apex deposition of Thomas Peterffy.\n\nFurther reading\nAutomate This: How Algorithms Came to Rule Our World by Christopher Steiner (2012) - The first chapter describes Thomas Peterffy's development of Interactive Brokers and the technologies that have led to the modern automated market.\nDark Pools: The Rise of the Machine Traders and the Rigging of the U.S. Stock Market by Scott Patterson (2013)\n\nSee also\nFinancial innovation\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Interactive Brokers Group, Inc.:",
  "clean_text": "Interactive Brokers, Inc. (abbreviated as IB or IBKR) is an American multinational brokerage firm headquartered in Greenwich, Connecticut. It operates the largest electronic trading platform in the United States by number of daily average revenue trades. In 2024, the platform processed an average of 2.6 million trades per trading day. Interactive Brokers is the largest foreign exchange market broker and is one of the largest prime brokers servicing commodity brokers. The company brokers stocks, options, futures contracts, exchange of futures for physicals, options on futures, bonds, mutual funds, currency, cryptocurrency, contracts for difference, derivatives, and trading in prediction markets. Interactive Brokers offers direct market access, omnibus and non-disclosed broker accounts, and provides clearing services. The firm has operations in 36 countries and 28 currencies. As of December 31, 2024, it had 3.337 million institutional and individual brokerage customers, with total customer equity of US$568.2 billion. In addition to its headquarters in Greenwich, on the Gold Coast of Connecticut, the company has offices in major financial centers worldwide. More than half of the company's customers reside outside the United States, in approximately 200 countries. The broker was founded and is chaired by Thomas Peterffy, an early innovator in computer-assisted trading. Approximately 25.8% of the company is publicly held, while the remainder is owned by IBG Holdings LLC, which is 91.4% owned by Thomas Peterffy and affiliates. Interactive Brokers is ranked 473rd on the Fortune 500. The company traces its roots to T.P. & Co., a market maker founded in 1977 and renamed Timber Hill Inc. in 1982. In 1979, it became the first to use fair value pricing sheets on a stock exchange trading floor. In 1983, it became the first to use handheld computers for trading. In 1987, Peterffy also created the first fully automated algorithmic trading system, to automatically create and submit orders to a market. Between 1993 and 1994, the corporate group Interactive Brokers Group was created, and the subsidiary Interactive Brokers LLC was created to control its electronic brokerage, and to keep it separate from Timber Hill, which conducts market making. In 2014, Interactive Brokers became the first online broker to offer direct access to IEX, a private forum for trading securities. In 2021, the company launched trading in cryptocurrencies, including Bitcoin and Ethereum. History In 1977, Thomas Peterffy left his job designing commodity trading software for Mocatta Metals, and bought a seat on the American Stock Exchange (AMEX) as an individual market maker. The following year, he formed his first company, named T.P. & Co., to expand trading activities to several members under badge number 549. At the time, trading used an open outcry system; Peterffy developed algorithms to determine the best prices for options and used those on the trading floor, and thus the firm became the first to use daily printed fair value pricing sheets. In 1979, the company expanded to employ four traders, three of whom were AMEX members. In 1982, Peterffy renamed T.P. & Co. to Timber Hill Inc.; he named it after a road to a favorite retreat, one of his properties on Hutchin Hill Road in Woodstock, New York. By 1983, Peterffy was sending orders to the floor from his upstairs office; he devised a system to read the data from a Quotron machine by measuring the electric pulses in the wire and decoding them. The data would then be sent through Peterffy's trading algorithms, and then Peterffy would call down the trades. After pressure to become a true market maker and keep constant bids and offers, Peterffy knew that he would need his employees to closely pay attention to market movements, and that handheld computers would help. At the time, the AMEX didn't permit computers on the trading floor. Because of this, Peterffy had an assistant deliver market information from his office in the World Trade Center. In November 1983, he convinced the exchange to allow computer use on the floor. In 1983, Peterffy sought to computerize the options market, and he first targeted the Chicago Board Options Exchange (CBOE). At the time, brokers still used fair value pricing sheets, which were by then updated once or twice a day. In 1983, Timber Hill created the first handheld computers used for trading. As Peterffy explained in a 2016 interview, the battery-powered units had touch screens for the user to input a stock price and it would produce the recommended option prices, and it also tracked positions and continually repriced options on stocks. However, he immediately encountered opposition from the heads of the exchange. When he first brought a 12-inch-long (30 cm) by 9-inch-wide (23 cm) device to the exchange floor, a committee in the exchange told him it was too big. When he made the device smaller, the committee stated that no analytic devices were allowed to be used on the exchange floor. Effectively blocked from using the CBOE, he sought to use his devices in other exchanges. Also in 1983, Timber Hill expanded to 12 employees and began trading on the Philadelphia Stock Exchange. In 1984, Timber Hill began coding a computerized stock index futures and options trading system and, in February 1985, Timber Hill's system and network was brought online. The system was designed to centrally price and manage risk on a portfolio of equity derivatives traded in multiple locations around the country. In 1985, Peterffy introduced his computer system to the New York Stock Exchange (NYSE), which allowed it. However, the stock exchange only allowed it to be used at trading booths several yards away from where transactions were executed. Peterffy responded by designing a code system for his traders to read colored bars emitted in patterns from the video displays of computers in the booths. This caused the exchange and other members to be suspicious of insider trading, which convinced Timber Hill to distribute instructions throughout the exchange, describing how to read the displays. In response, the exchange required the company to turn the screens away from the trading floor, which prompted Peterffy to hire a clerk to communicate with the traders via hand signals. Eventually computers were allowed on the trading floor. Timber Hill joined the Options Clearing Corporation in 1984, the New York Futures Exchange in 1985, and the Pacific Stock Exchange and the options division of the NYSE the following year. Also in 1985, the firm joined and began trading on the Chicago Mercantile Exchange, the Chicago Board of Trade and the Chicago Board Options Exchange. In 1986, the company moved its headquarters to the World Trade Center to control activity at multiple exchanges. Peterffy again hired workers to sprint from his offices to the exchanges with updated handheld devices, which he later superseded with phone lines carrying data to computers at the exchanges. Peterffy later built miniature radio transmitters into the handhelds and the exchange computers to allow data to automatically flow to them. In 1987, Timber Hill joined the National Securities Clearing Corporation and the Depository Trust Company (now merged as the Depository Trust & Clearing Corporation). By 1987, Timber Hill had 67 employees and had become self-clearing in equities. In 1987, the CBOE was about to close down its S&P 500 options market due to the options not attracting sufficient trader interest. Because of this, Peterffy pledged that Timber Hill would make tight markets in the product for a year if the exchange would allow the traders to use handheld computers on the trading floor. The exchange agreed, and more traders were attracted by the change in pricing; today S&P 500 options are the most actively traded stock market index options in the U.S. In 1990, Timber Hill Deutschland GmbH was incorporated in Germany, and shortly thereafter began trading equity derivatives at the Deutsche Terminbörse (DTB), marking the first time that Timber Hill used one of its trading systems on a fully automated exchange. In 1992, Timber Hill began trading at the Swiss Options and Financial Futures Exchange, which merged with DTB in 1998 to become Eurex. At that time, Timber Hill had 142 employees. While Peterffy was trading on the Nasdaq in 1987, he created the first fully automated algorithmic trading system. It consisted of an IBM computer that would pull data from a Nasdaq terminal connected to it and carry out trades on a fully automated basis. The machine, for which Peterffy wrote the software, worked faster than a trader could. Upon inspection, the Nasdaq banned direct interface with the terminal, and required trades to be typed in manually. Peterffy and his team designed a system with a camera to read the terminal, a computer to decode the visual data, and mechanical fingers to type in the trade orders, which was then accepted by the Nasdaq. 1993 to 2000 Interactive Brokers Inc. was incorporated in 1993 as a U.S. broker-dealer, to provide technology developed by Timber Hill for electronic network and trade execution services to customers. In 1994, Timber Hill Europe began trading at the European Options Exchange, the OM Exchange and the London International Financial Futures and Options Exchange. Also in 1994, Timber Hill Deutschland became a member of the Belgium Futures and Options Exchange, IB became a member of the New York Stock Exchange, and the Timber Hill Group LLC was formed as a holding company of Timber Hill and IB's operations. Timber Hill UK Ltd was incorporated in November 1994. In 1995, Timber Hill France S.A. was incorporated and began making markets at the Marché des Options Négociables de Paris (a subsidiary of Euronext Paris) and the Marché à Terme International de France futures exchange. Also in 1995, Timber Hill Hong Kong began market making at the Hong Kong Futures Exchange and IB created its primary trading platform Trader Workstation and executed its first trades for public customers. In 1996, Timber Hill Securities Hong Kong Limited was incorporated and began trading at the Hong Kong Stock Exchange. In the next year, Timber Hill Australia Pty Limited was incorporated in Australia, and Timber Hill Europe began trading in Norway and became a member of the Austrian Derivatives Exchange. By 1997, Timber Hill had 284 employees. In 1998, Timber Hill Canada Company was formed, and IB began to clear online trades for retail customers connected directly to Globex to trade S&P 500 futures. In 1999, IB introduced a smart order routing linkage for multiple-listed equity options and began to clear trades for its customer stocks and equity derivatives trades. Timber Hill Canada Co was founded in 1999. Also in that year, Goldman Sachs attempted to purchase the company and was rejected. In 2000, Interactive Brokers (U.K.) Limited was formed and Timber Hill became a primary market maker on the International Securities Exchange (ISE). 2001 to 2020 In 2001, the corporate name of the Timber Hill Group LLC was changed to Interactive Brokers Group LLC, which at the time handled 200,000 trades per day. In 2002, Interactive Brokers, along with the Bourse de Montréal and the Boston Stock Exchange, created the Boston Options Exchange. Also in 2002, the company introduced Mobile Trader and an application programming interface for customers and developers to integrate their mobile phone systems with the IB trading system. Also in 2002, Timber Hill became the major market maker for the newly introduced U.S. single-stock futures. In 2003, the company expanded its trade execution and clearing services to include Belgian index options and futures, Canadian stocks, equity/index options and futures, Dutch index options and futures, German equity options, Italian index options and futures, Japanese index options and futures, and U.K. equity options. In 2004, the company introduced direct market access to its customers on the Frankfurt Stock Exchange and the Börse Stuttgart. In the same year, IB upgraded its account management system and Trader Workstation, adding real-time data including charts, scanners, fundamental analytics, and tools to the platform. In 2005, the company launched its forex trading platform IdealPro (now Ideal FX). At that point, Interactive Brokers was one of the largest private securities firms in the United States with $2 billion in capital, it handled 20% of total options volume in the US and 16% worldwide. In 2006, the IB Options Intelligence Report was launched to report on unusual concentrations of trading interests and changing levels of uncertainty in the option markets. Also that year, IBG took stakes in OneChicago, the ISE Stock Exchange, and the CBOE Stock Exchange. Later in 2006, Interactive Brokers began offering penny-priced options. On May 3, 2007, the company went public via an initial public offering (IPO) on the Nasdaq, selling 40 million shares, or 10% of the company, at $30.01 per share via a Dutch auction in the largest brokerage IPO since 2005. In December 2007, the company acquired FutureTrade Technologies, an integrated electronic equity and option trading service provider. In the following year, Interactive Brokers launched Risk Navigator, a real-time market risk management platform. Also in 2008, several trading algorithms were introduced to the Trader Workstation. Among these is the Accumulate-Distribute Algo, which allows traders to divide large orders into small non-uniform increments and release them at random intervals over time to achieve better prices for large volume orders. In 2008, the company launched Risk Navigator, a real-time market risk management platform. Also in 2008, several trading algorithms were introduced to the Trader Workstation. Among these is the Accumulate-Distribute Algo, which allows traders to divide large orders into small non-uniform increments and release them at random intervals over time to achieve better prices for large volume orders. In 2009, IB launched a mobile app for iOS. In March of the same year, the company launched brokerage services in India. In 2011, the company introduced several new services, including the Interactive Brokers Information System, Hedge Fund Capital Introduction Program, and the Stock Yield Enhancement Program. Interactive Brokers also became in 2011 the largest online U.S. broker as measured by daily average revenue trades. During the Occupy Wall Street protests of 2011–2012, IB ran a series of television commercials with the catchphrase \"Join the 1%\", which were seen as a controversial criticism of the protests. In 2012, the company began offering money manager accounts and opened the fully electronic Money Manager Marketplace. IB also released the TWS Mosaic trading interface and the Tax Optimizer for managing capital gains and capital losses. In 2013, the company released the Probability Lab tool and Traders' Insight, a service that provides daily commentary by Interactive Brokers traders and third party contributors. Also in 2013, IB integrated its trading notification tool (called IB FYI) into the TWS. The tool keeps customers informed of upcoming announcements that could impact their account, and a customer can set it to automatically act to exercise options early if the action is projected to be beneficial for the customer. An IB FYI also can act to automatically suspend a customer's orders before the announcement of major economic events that influence the market. Between 2007 and 2013, Interactive's brokerage arm revenue and pretax profits grew from $391 to $814 mln, however, the marketmaker's profits dropped drastically from $331 mln to $72 mln. On April 3, 2014, the company became the first online broker to offer direct access to IEX, a private electronic communication network for trading securities, which was subsequently registered as an exchange. In May 2015, the company acquired investment management platform Covestor. In the same year, Interactive Brokers launched Investors' Marketplace, which allows customers to find investors and other service providers in the financial industry. For the 4th quarter 2015, IB reported a 17% net revenue decrease to $208.1 mln, though total daily average revenue trades reached 619,000, while total noninterest expenses declined 37%. Meanwhile, IB's market making division, Timber Hill, reported a 49% drop in pre-tax income to $15.1 mln. A mobile app for the Apple Watch was released in March 2016. In October 2017, the company sold its market maker business, Timber Hill, to Two Sigma Investments. The company's founder Thomas Peterffy stepped down from CEO position in 2019, when he turned 75. He retained the position of Chairman, while President Milan Galik was appointed CEO. In September 2019, the company launched commission-free trades via \"IBKR Lite\". Two months later, the company began offering fractional share trading. 2020 to present In 2020, the company reported reaching a customer base of one million users. In December 2020, IB acquired the retail operations of Folio Investments, including 70,000 accounts, from Goldman Sachs. In May 2021, IB launched trading in spot gold for U.S. clients. In September 2021, the company introduced trading in cryptocurrencies, including Bitcoin and Ethereum. In May 2024, the platform was expanded to clients in the United Kingdom. In July 2023, the company launched trading on the Taiwan Stock Exchange. A month later, IB launched fractional share trading in Canadian securities and launched trading on Bursa Malaysia. In 2024, the platform processed an average of 2.6 million trades per trading day. In late 2024, the company began offering trading in prediction markets including forecast contracts on the 2024 United States presidential election. It became the second brokerage to offer this instrument after Kalshi. Though in 2020 the CFTC approved the issuance of event contracts, the regulator soon questioned its decision and reported serious concerns about them. The Authority believes that event contracts are structured as binary options, long banned in Europe because of their gambling nature. The CFTC has been engaged in a prolonged legal battle with Kalshi over political contracts. Meanwhile in 2025, IB launched forecast contracts in Canada. Lawsuits and fines Sanctions violations On 15 July 2025, the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) announced a $11.8 mln settlement with Interactive Brokers LLC for apparent violations of several OFAC sanctions programs. According to the agency, since July 2016 IB had provided brokerage and investment services to individuals located in Iran, Cuba, Syria, and the Crimea region. The company also processed transactions in securities associated with the Chinese Military-Industrial Complex program, as well as trades involving sanctioned individuals under OFAC's Russia, Global Magnitsky, Venezuela, and Syria sanctions programs. OFAC emphasized that the violations could have been avoided through regular and effective maintenance of the firm's compliance systems. Between July 2016 and July 2021 alone, Interactive Brokers provided services to more than 200 account holders from Iran, Cuba, Syria, and Crimea, who collectively executed over 12,000 transactions. Operational and trading failures On 20 April 2020, West Texas Intermediate futures for May delivery plunged to -$40.32 per barrel, marking the first time in history oil futures traded at negative prices. Many Interactive Brokers clients incurred losses exceeding the equity available in their accounts. Following an investigation, in September 2021 the Commodity Futures Trading Commission (CFTC) ordered the company to pay a $1.75 million civil penalty and reimburse affected customers $82.57 million. The regulator concluded that Interactive Brokers had received prior warnings about the risk of negative pricing but failed to update or properly configure its electronic trading system. As a result, the platform was unable to display negative prices, and minimum margin requirements were not enforced before trades in WTI contracts were executed. In June 2024, Interactive Brokers recorded a $48 million loss due to a technical malfunction during early trading of Berkshire Hathaway Class A shares on the New York Stock Exchange (NYSE). The stock price briefly crashed from $622,000 to $185 per share, triggering a surge in client purchases. When trading resumed two hours later, the stock rebounded sharply to $741,941. The NYSE subsequently cancelled all trades executed below $603,718.30, leaving Interactive Brokers responsible for covering the majority of client losses. Regulatory fines and oversight United States In August 2018, Interactive Brokers was fined $5.5 million for violating federal regulations on naked short selling. According to the Financial Industry Regulatory Authority (FINRA), the firm failed to properly supervise such activity between July 2012 and June 2015, despite internally identifying the issue. No corrective action was taken to update its supervisory systems during that period. In August 2020, the company agreed to pay over $38 million in total penalties to multiple U.S. regulators. FINRA imposed a $15 million fine for persistent anti–money laundering (AML) deficiencies. From June 2014 to November 2018, Interactive Brokers failed to file over 150 suspicious activity reports (SARs), including one involving a New York-based trader who defrauded investors of more than $23 million. Additionally, hundreds of millions of dollars in wire transfers went unmonitored. The U.S. Securities and Exchange Commission (SEC) levied a separate $23 million fine for repeated failures to file SARs and for inadequate oversight of employees managing customer accounts. The Commodity Futures Trading Commission (CFTC) added $706,214 in disgorgement for related violations. In October 2023, the SEC fined Interactive Brokers $35 million for \"widespread and longstanding failures to maintain and preserve electronic communications.\" According to the investigation, since at least 2019, senior employees routinely used unauthorized communication channels such as private messaging apps and WhatsApp. The CFTC imposed a concurrent $20 million penalty for the same violations. In April 2024, Nasdaq fined the firm $475,000 for improperly handling five corporate actions between January 2020 and June 2021. The enforcement report cited multiple supervisory and systems failures, including cases in which clients were able to sell shares they did not actually own. In October 2024, FINRA issued a separate $475,000 fine for violations of the Customer Protection Rule during the period June–December 2021. The regulator identified over 800 instances in which the firm miscalculated the number of excess shares of stocks listed on European exchanges available for return to customers. It also found that an unregistered individual was given authority over adjustments to the securities lending algorithm. In December 2024, FINRA fined Interactive Brokers $2.25 million for more than 4.2 million instances of free-riding (a practice involving securities transactions without sufficient capital). In May 2025, the firm was fined an additional $400,000 after FINRA discovered further compliance failures. From January 2020 to June 2022, Interactive Brokers failed to accurately report required statistical summaries of written customer complaints. Moreover, 91 instances of regulatory or civil enforcement actions dating from July 2011 to September 2022 were omitted from required disclosures. United Kingdom In January 2018, the Financial Conduct Authority (FCA) fined Interactive Brokers £1,049,412 (approximately $1.43 million) for deficiencies in its market abuse surveillance systems. The FCA found that between February 2014 and February 2015, the company failed to adequately detect and report potentially suspicious trading activity. The regulator noted that Interactive Brokers did not implement effective controls to identify manipulative or abusive trading patterns. Australia In September 2023, the Australian Securities and Investments Commission (ASIC) imposed a AUD $832,500 penalty on Interactive Brokers Australia Pty Ltd for negligent and reckless conduct related to suspicious trading activity. According to ASIC, the firm failed to properly monitor its clients' trading and did not investigate several red flags between July and September 2021, during which a client engaged in potentially manipulative trading in contract for difference (CFD) products. ASIC stated that Interactive Brokers did not have adequate systems and controls to detect and respond to such conduct, and that the firm's compliance team was understaffed and undertrained. Hong Kong In April 2025, the Securities and Futures Commission (SFC) fined the Hong Kong unit of Interactive Brokers HK$4.2 million (US$541,453.42) for mishandling client assets. Between 3 December 2017 and 23 October 2020, the firm had erroneously loaned securities belonging to its clients to other market participants without obtaining valid authorization. The SFC determined that 7,911 clients were affected, with the market value of the misused securities estimated at over HK$586 billion. The regulator described the breach as a serious failure in the firm's internal controls and compliance processes. Frauds and lawsuits Ponzi schemes In 2021, Interactive Brokers was sued by Benjamin Chang, a victim of Haena Park's Ponzi-scheme, accusing IB of aiding and abetting Park in her fraud. Through her IB account, Park had lost more than $19 mio. of investors' money. Since 2012, Park has consistently funded the account and then lost on high-risk trades in amounts far in excess of her net worth and the earnings data she provided. IB's compliance department reported her account's activity as suspicious at least 12 times, but every time IB supervisors ignored the reports. When in 2015 a compliance analyst ultimately reported her account, IB compliance officers overrode the Customer Account Supervision System to allow Park to continue trading. She was arrested in June 2016 and sentenced in 2017 to three years in prison. The lawsuit against Interactive Brokers was dismissed by Judge Nathanael Cousins of the California Northern District Court on 25 April 2022. In January 2025, David A. Castleman sued Interactive Brokers LLC in the New York Southern District Court, accusing the broker of negligence and aiding breach of fiduciary duty. Castleman was a client of EminiFX, a trading platform under the CEO Eddy Alexandre. Alexandre lured tens of thousands of investors into a Ponzi scheme by promising high returns with no risk, and defrauded them of more than $248 mln. He was later sentenced to nine years in prison. Among the rest, in December 2021 and January 2022, Alexandre transferred $9 mln from his personal bank account to his account at IB and engaged in high-risk trading, eventually losing more than $7 mln in short order. Castleman claimed that IB either knew or should have known from the due diligence and investigation it undertook that EminiFX was a Ponzi scheme and that Alexandre was wasting his investors' money. However, the lawsuit was terminated by Judge Valerie E. Caproni on 10 April 2025. Client fraud and oversight failures The New Jersey Division of Consumer Affairs and the Bureau of Securities determined that Interactive Brokers had allowed Peter Zuck, a three-time convicted financial felon, to open and operate accounts on its platform despite being permanently barred by the National Futures Association (NFA). Zuck was permitted to open at least 16 accounts, including two master accounts in his own name and eleven sub-accounts in the names of other individuals that were linked to the same master account. Zuck lured investors into his Osiris Fund Limited Partnership and used the IB platform to defraud them of more than $7.5 million. The Bureau emphasized that IB failed to conduct the NFA BASIC search during the account opening process and thereby facilitated Zuck's illegal scheme. On 11 February 2019, the Bureau announced that IB had agreed to pay a $100,000 civil penalty. Private litigation and negligence In 2015, Robert Scott Batchelar filed a lawsuit against Interactive Brokers over breach of contract, negligence, and commercially unreasonable liquidation of pledged collateral. According to Batchelar, IB's trading software was negligently designed, coded, maintained and used in a way that an automatic liquidation of the positions in his account cost him thousands of dollars more than it should have. On September 28, 2016, the Court dismissed his complaint. It has been revived later, though stuck in discovery. As of June 2025, Interactive Brokers seeks a protective order forbidding the apex deposition of Thomas Peterffy. Further reading Automate This: How Algorithms Came to Rule Our World by Christopher Steiner (2012) - The first chapter describes Thomas Peterffy's development of Interactive Brokers and the technologies that have led to the modern automated market. Dark Pools: The Rise of the Machine Traders and the Rigging of the U.S. Stock Market by Scott Patterson (2013)"
}