{
  "ticker": "IDXX",
  "cik": "0000874716",
  "company_name": "Idexx Laboratories",
  "corrected_name": "Idexx Laboratories",
  "wiki_title_used": "Idexx Laboratories",
  "exists": true,
  "raw_text": "IDEXX Laboratories, Inc. is an American multinational corporation engaged in the development, manufacture, and distribution of products and services for the companion animal veterinary, livestock and poultry, water testing, and dairy markets. Incorporated in 1983 by David Evans Shaw, the company is headquartered in Westbrook, Maine, and in Hoofddorp, Netherlands for its EMEA divisions.\nIDEXX offers products to customers in over 175 countries around the world and employs approximately 9,200 people in full-and part-time positions (as of 7 February 2020). There are three main segments of the company: Companion Animal Group, Water, and Livestock, Poultry and Dairy (LPD). In addition, the company also manufactures and sells pet-side SNAP tests for a variety of animal health diagnostic uses.\nIn 2002, Jon Ayers succeeded company founder Shaw as chairman and CEO. During Ayers 20-year tenure, the company's annual revenue grew from $380 million to $3 billion, raising share prices by more than 100 times. In 2019, Jay Mazelsky succeeded Ayers in the role of CEO.\n\nProducts and services\nCompanion Animal Group\nThe Companion Animal Group (CAG) provides in-clinic laboratory analyzers for companion animals. Analyzers measure blood cell counts as well as levels of certain enzymes in blood or urine for the purpose of monitoring health conditions. Major products of this segment are the Catalyst Dx Chemistry Analyzer and the VetTest Chemistry Analyzer, Symmetric dimethylarginine (SDMA), ProCyte Dx Hematology Analyzer, the LaserCyte Hematology Analyzer, the IDEXX VetAutoread Hematology Analyzer, the SNAP Pro analyzer, and so on, among other laboratory equipment and analytical services.  Other areas of the CAG division are centered on diagnostic imaging and veterinary practice management software systems, including the flagship program Cornerstone, as well as DVMax (acquired from Sneakers Software, Inc., a New York City-based company, under terms of Ch. 11 reorganization) in late 2012, Animana and several legacy practice management software systems.\n\nWater testing\nThe Water segment provides products to measure microbiological parameters in water. Popular products of this segment include Colilert, Colilert-18, and Colisure for detecting total coliform and E. coli. Water products are sold in over 120 countries around the globe.\n\nLivestock and Poultry Diagnostics\nThe Livestock and Poultry Diagnostics division provides products to detect diseases in livestock and poultry. Products of this segment include tests for avian influenza, bovine viral diarrhoea virus, porcine reproductive and respiratory syndrome (PRRS), and bovine spongiform encephalopathy (BSE or mad cow disease).\n\nReferences\nExternal links\nOfficial website\nBusiness data for IDEXX Laboratories, Inc.:",
  "clean_text": "IDEXX Laboratories, Inc. is an American multinational corporation engaged in the development, manufacture, and distribution of products and services for the companion animal veterinary, livestock and poultry, water testing, and dairy markets. Incorporated in 1983 by David Evans Shaw, the company is headquartered in Westbrook, Maine, and in Hoofddorp, Netherlands for its EMEA divisions. IDEXX offers products to customers in over 175 countries around the world and employs approximately 9,200 people in full-and part-time positions (as of 7 February 2020). There are three main segments of the company: Companion Animal Group, Water, and Livestock, Poultry and Dairy (LPD). In addition, the company also manufactures and sells pet-side SNAP tests for a variety of animal health diagnostic uses. In 2002, Jon Ayers succeeded company founder Shaw as chairman and CEO. During Ayers 20-year tenure, the company's annual revenue grew from $380 million to $3 billion, raising share prices by more than 100 times. In 2019, Jay Mazelsky succeeded Ayers in the role of CEO. Products and services Companion Animal Group The Companion Animal Group (CAG) provides in-clinic laboratory analyzers for companion animals. Analyzers measure blood cell counts as well as levels of certain enzymes in blood or urine for the purpose of monitoring health conditions. Major products of this segment are the Catalyst Dx Chemistry Analyzer and the VetTest Chemistry Analyzer, Symmetric dimethylarginine (SDMA), ProCyte Dx Hematology Analyzer, the LaserCyte Hematology Analyzer, the IDEXX VetAutoread Hematology Analyzer, the SNAP Pro analyzer, and so on, among other laboratory equipment and analytical services. Other areas of the CAG division are centered on diagnostic imaging and veterinary practice management software systems, including the flagship program Cornerstone, as well as DVMax (acquired from Sneakers Software, Inc., a New York City-based company, under terms of Ch. 11 reorganization) in late 2012, Animana and several legacy practice management software systems. Water testing The Water segment provides products to measure microbiological parameters in water. Popular products of this segment include Colilert, Colilert-18, and Colisure for detecting total coliform and E. coli. Water products are sold in over 120 countries around the globe. Livestock and Poultry Diagnostics The Livestock and Poultry Diagnostics division provides products to detect diseases in livestock and poultry. Products of this segment include tests for avian influenza, bovine viral diarrhoea virus, porcine reproductive and respiratory syndrome (PRRS), and bovine spongiform encephalopathy (BSE or mad cow disease)."
}