{
  "ticker": "IEX",
  "cik": "0000832101",
  "company_name": "IDEX Corporation",
  "corrected_name": "IDEX Corporation",
  "wiki_title_used": "IDEX Corporation",
  "exists": true,
  "raw_text": "IDEX Corporation is a global industrial company based in Northbrook, Illinois. IDEX develops, designs, and manufactures fluidics systems, optics systems, fire and rescue equipment, and other specialty engineered products. As of February 2025, IDEX operated in approximately 20 countries and had approximately employed 9,000 employees. The company is publicly traded and a component of the S&P 500 index.\n\nHistory\nIDEX was formed in 1988, when Kohlberg Kravis Roberts purchased several divisions of Houdaille Industries, which had recently been sold by KKR to Tube Instruments. Its first chairman and CEO was Donald N. Boyce. The company raised $3.3 million with its initial public offering in June 1989.\nIn May 1994, IDEX reached an agreement to acquire Hale Products, Inc., of Conshohocken, Pa., for $90 million. Hale sells fire-trucks, portable pumps, ventilation systems, and is part of IDEX's fire and safety division, which includes the Hurst \"Jaws of Life\". By 1996, IDEX had acquired ten other companies and its annual revenue was approximately $562 million.\nIn January 1998, IDEX agreed to buy Gast Manufacturing of Benton Harbor, Michigan, for $118 million. Gast manufactures compressors, vacuum pumps, air motors and other products. The following year, the company's original CEO Donald Boyce stepped down from his position. IDEX COO Frank Hansen took over as chief executive.\nIn 2011, Andrew Silvernail took over as CEO and chairman.\nIn 2011, IDEX acquired Microfluidics International, a company that designs and manufactures equipment that used to produce nanoparticles. This acquisition supported IDEX's existing work in pharmaceutical research and production.\nIn June 2018, IDEX Corporation announced its acquisition of Phantom Controls, a company that manufactures pump systems.\nIn March 2021, IDEX announced that it was acquiring Abel Pumps LP, a manufacturer of reciprocating positive displacement pumps used in mining, marine, and power industries. The following month, IDEX announced it had agreed to acquire Airtech Group, Inc. and US Valve Corporation. Airtech is a manufacturer of pressure technology products such as pumps and compressor systems and valves.\nIn September 2022, IDEX announced that it would acquire the Netherlands-based micro-precision technology conglomerate Muon Group, and that Muon's several subsidiaries, such as LouwersHanique and Millux, would be incorporated into IDEX's health and science technologies segment. In July 2024, IDEX announced that it would soon purchase Mott Corp, a filtration products manufacturer, to further bolster the company's health and science technologies segment.\n\nFinance\nThe key financial trends for IDEX Corporation are based on fiscal years ending December 31:\n\nIn Q1 2025, IDEX beat Wall Street earnings and revenue estimates, reporting revenue of US $814.3 million and adjusted EPS of $1.75, citing strong demand in its Health & Science Technologies segment.\nFor Q2 2025, the company posted revenue of US $865.4 million (up 7.2% YoY) and EPS of $2.07, outperforming forecasts, though it lowered full-year adjusted EPS guidance to a range of $7.85–$7.95 due to softening demand trends.\n\nOperations\nIDEX's name is an acronym for \"Innovation, Diversity, and Excellence.\" The company is composed of more than 50 largely decentralized businesses that operate as subsidiaries. It operates in approximately 20 countries and its business is organized into three segments: Fluid and Metering Technologies, Health and Science Technologies, and Fire and Safety and Diversified products.\nIDEX is headquartered in Northbrook, Illinois. Its CEO is Eric Ashleman. As of February 2025, it employs approximately 9,000 people. The company is publicly traded on the New York Stock Exchange and is included in the S&P 500.\n\nProducts\nIDEX manufactures industrial equipment and components for diversified markets, including the agricultural, pharmaceutical, semiconductor, and fire safety sectors. Its products include fluid-handling apparatuses like pumps, valves, and flow meters. It also makes air compressors, optical filters, hydraulic rescue tools, and fire suppression equipment.\n\n\n== References ==",
  "clean_text": "IDEX Corporation is a global industrial company based in Northbrook, Illinois. IDEX develops, designs, and manufactures fluidics systems, optics systems, fire and rescue equipment, and other specialty engineered products. As of February 2025, IDEX operated in approximately 20 countries and had approximately employed 9,000 employees. The company is publicly traded and a component of the S&P 500 index. History IDEX was formed in 1988, when Kohlberg Kravis Roberts purchased several divisions of Houdaille Industries, which had recently been sold by KKR to Tube Instruments. Its first chairman and CEO was Donald N. Boyce. The company raised $3.3 million with its initial public offering in June 1989. In May 1994, IDEX reached an agreement to acquire Hale Products, Inc., of Conshohocken, Pa., for $90 million. Hale sells fire-trucks, portable pumps, ventilation systems, and is part of IDEX's fire and safety division, which includes the Hurst \"Jaws of Life\". By 1996, IDEX had acquired ten other companies and its annual revenue was approximately $562 million. In January 1998, IDEX agreed to buy Gast Manufacturing of Benton Harbor, Michigan, for $118 million. Gast manufactures compressors, vacuum pumps, air motors and other products. The following year, the company's original CEO Donald Boyce stepped down from his position. IDEX COO Frank Hansen took over as chief executive. In 2011, Andrew Silvernail took over as CEO and chairman. In 2011, IDEX acquired Microfluidics International, a company that designs and manufactures equipment that used to produce nanoparticles. This acquisition supported IDEX's existing work in pharmaceutical research and production. In June 2018, IDEX Corporation announced its acquisition of Phantom Controls, a company that manufactures pump systems. In March 2021, IDEX announced that it was acquiring Abel Pumps LP, a manufacturer of reciprocating positive displacement pumps used in mining, marine, and power industries. The following month, IDEX announced it had agreed to acquire Airtech Group, Inc. and US Valve Corporation. Airtech is a manufacturer of pressure technology products such as pumps and compressor systems and valves. In September 2022, IDEX announced that it would acquire the Netherlands-based micro-precision technology conglomerate Muon Group, and that Muon's several subsidiaries, such as LouwersHanique and Millux, would be incorporated into IDEX's health and science technologies segment. In July 2024, IDEX announced that it would soon purchase Mott Corp, a filtration products manufacturer, to further bolster the company's health and science technologies segment. Finance The key financial trends for IDEX Corporation are based on fiscal years ending December 31: In Q1 2025, IDEX beat Wall Street earnings and revenue estimates, reporting revenue of US $814.3 million and adjusted EPS of $1.75, citing strong demand in its Health & Science Technologies segment. For Q2 2025, the company posted revenue of US $865.4 million (up 7.2% YoY) and EPS of $2.07, outperforming forecasts, though it lowered full-year adjusted EPS guidance to a range of $7.85–$7.95 due to softening demand trends. Operations IDEX's name is an acronym for \"Innovation, Diversity, and Excellence.\" The company is composed of more than 50 largely decentralized businesses that operate as subsidiaries. It operates in approximately 20 countries and its business is organized into three segments: Fluid and Metering Technologies, Health and Science Technologies, and Fire and Safety and Diversified products. IDEX is headquartered in Northbrook, Illinois. Its CEO is Eric Ashleman. As of February 2025, it employs approximately 9,000 people. The company is publicly traded on the New York Stock Exchange and is included in the S&P 500. Products IDEX manufactures industrial equipment and components for diversified markets, including the agricultural, pharmaceutical, semiconductor, and fire safety sectors. Its products include fluid-handling apparatuses like pumps, valves, and flow meters. It also makes air compressors, optical filters, hydraulic rescue tools, and fire suppression equipment. == References =="
}