{
  "ticker": "IFF",
  "cik": "0000051253",
  "company_name": "International Flavors & Fragrances",
  "corrected_name": "International Flavors & Fragrances",
  "wiki_title_used": "International Flavors & Fragrances",
  "exists": true,
  "raw_text": "International Flavors & Fragrances Inc. (IFF) is an American corporation that creates products across taste, texture, scent, nutrition, enzymes, cultures, soy proteins, and probiotics categories, which it markets globally. It is headquartered in New York City and has creative, sales, and manufacturing facilities in 44 countries. The company is a member of the S&P 500 index.\n\nHistory\nInternational Flavors & Fragrances was formed in 1958 by the merger between Polak & Schwarz (P&S) and van Ameringen-Haebler. Polak & Schwarz was founded in 1889 by Leopold Schwarz, who had an interest in spices, flavors, and fragrances, and his brother-in-law, Joseph Polak in the small Dutch town of Zutphen. P&S quickly grew to 36 sites globally. Arnold Louis (A.L.) van Ameringen was hired by Polak & Schwarz to open P&S's U.S. office in 1917 before losing his job with them. Relieved of his duties, he opened van Ameringen & Co. at 13 Gold Street in Manhattan, took over Morana, Inc. in 1920, and became van Ameringen-Haebler (VAH) in 1929.\nConstant Cornelis (Cook) Brummer was a director at Polak & Schwarz during World War II. Because he saved hundreds of Jewish workers' lives, he is compared to Oskar Schindler. He was recognized by Israel as Righteous Among the Nations in January 2017, for risking his own life to save others from the Nazis.\nThe two companies did well through the bulk of the 20th century, despite difficulties for P&S during World War II. While both companies managed flavors and fragrances, Polak & Schwarz had particular strengths in flavors and van Ameringen-Haebler built a powerful reputation in fragrances. In 1958, the two companies announced their merger to become International Flavors & Fragrances Inc. IFF was listed on the New York Stock Exchange in 1964. It was cross listed to the Euronext Paris Market in 2015, becoming the first U.S.-listed company to make use of Euronext Paris Fast Path process.\nIn 1968, in conjunction with the Monell Foundation, IFF established the Monell Chemical Senses Center, dedicated to the research of taste and smell.\nIn 1985, Dr. Braja D. Mookherjee, a scientist at IFF, pioneered Living Flower technology, which changed the way perfumes are created. In 1990, IFF broke ground in their R&D facility located in Union Beach, NJ, to develop its 5,000-square-foot greenhouse and botanical garden, which can maintain tropical and subtropical temperature zones for more than 1,300 varieties of exotic plants.\nIt is home to a miniature rose called \"Overnight Scentsation\" (also known as the \"Space Rose\") which was cultivated for experiments in space and left the Earth during a 10-day flight on board the shuttle Discovery (STS-95) in 1998. Low gravity critically altered the fragrance of the rose, which was later commercialized by IFF and Shiseido.\nHenry G. Walter, Jr., former IFF Chairman, 1962–1985, was a noted philanthropist and prolific writer, who pioneered the field of aromatherapy. He is considered one of the most influential people in the Industry. It has been speculated that he inspired some of the storylines and characters in the book Masters of Sex by Thomas Maier, as well as the Showtime series by the same the name. During World War II, his wife, Rosalind (Palmer) Walter worked on the night shift as a riveter on the Corsair, the F4U Marine gull-winged, fighter airplane, inspiring the song \"Rosie the Riveter.\"\nIn 2000, IFF acquired Laboratoire Monique Rémy based in Grasse, France and forms IFF LMR Naturals, strengthening its position in the development and use of raw materials, natural ingredients for fragrances and flavors. In 2000, IFF acquired Bush Boake Allen with its complementary products, technologies, and presence in key markets, making IFF the largest flavor and fragrance house in the world for several years.\nIn 2014, IFF acquired Aromor Flavors and Fragrances Ltd., a privately held manufacturer and marketer of complex specialty ingredients that are used in fragrances and flavors based in Israel in Kibbutz Givat Oz.\nIn 2015, IFF announced that it completed the acquisition of Ottens Flavors. This was followed in 2016 with the acquisition of David Michael & Company. Using this merger as a catalyst, they have since launched Tastepoint by IFF to serve dynamic middle-tier customers.\nIn 2015, IFF acquired Lucas Meyer Cosmetics, a cosmetic actives firm based in Canada that develops, manufactures and markets innovative ingredients for the cosmetic and personal care industry. Lucas Meyer Cosmetics was sold to Clariant in April 2024. \nIFF has creative, sales, and manufacturing facilities in 44 countries and is a member of the S&P 500 Index. IFF is a $10.8 billion market capital company with a global footprint that generated over 75 percent of its 2016 sales outside the United States and 51 percent in the emerging markets. In 2014, the Company celebrated its 125th anniversary year, from the founding of Polak & Schwarz on January 27, 1889 in Zutphen, Netherlands, to the 1958 merger with van Ameringen-Haebler to form IFF. IFF is ranked among Forbes Best Employers.\nOn May 8, 2018, IFF acquired the Israeli company Frutarom for $7.1 Billion.\nBetween 2016 and 2018, Kirsten, Finn and Jorn Rausing became the top shareholders of IFF, having bought nearly 20% of the shares via entities in Singapore and Liechtenstein.\nIn 2019, IFF announced the merger of IFF and DuPont's Nutrition & Biosciences (N&B) business in a Reverse Morris Trust transaction. The deal values the combined company at $45.4 billion on an enterprise value basis, reflecting a value of $26.2 billion for the N&B business based on IFF's share price as of December 13, 2019.\nIn December 2022, French private equity firm PAI Partners announced their acquisition of IFF's Savory Solutions Group, which is valued at about $900 million. Upon the deal's completion, the private equity firm rebranded the solutions group as NovaTaste. \nIn March 2024, it was announced IFF has sold its IFF Pharma Solutions division to the France-based family owned company, Roquette for $2.85 billion.\n\nEnvironmental record\nIFF published its first external sustainability report: Sustainability: The Essence of IFF in 2011. In 2012, IFF adopted the 12 Principles of Green Chemistry as an important differentiator in product design and development.\nIn 2014, IFF opened a 4,000 kilowatt Photovoltaic Solar Installation in New Jersey, which supplies approximately 40 percent of the electricity needs of its Hazlet, NJ fragrances manufacturing and creative center facilities. It has more than 16,000 modules and approximately 1 million solar cells covering 20 acres of IFF property, making IFF a leader in renewable energy in its sector.\nIn 2015, IFF achieved LEED Silver Certification for its Flavors Creative Center in Indonesia and achieved Roundtable for Sustainable Palm Oil (RSPO) Supply Chain Certification for its facilities in the United States, the United Kingdom and the Netherlands.\nIn 2015, Coca-Cola, FUJIFILM, International Flavors and Fragrances, Agristo, Cofely and Water Board De Dommel opened a collective wastewater treatment plant on the premises of FUJIFILM in Tilburg, Netherlands. The wastewater treatment plant can process about 10 million litre per day or more than 3.5 billion litre wastewater per year. The plant has a low level of energy consumption and implements the latest technology in the field of water treatment. After treatment, the wastewater is discharged as clean water into the Wilhelmina Canal, making it available for reuse by the four companies, or for another sustainable use in the Tilburg region.\nIn 2016, IFF was awarded a place on the CDP Climate \"A\" List for the 2nd year in a row and achieved a 7% year-over-year reduction in GHG emissions intensity. IFF also became the first flavors and fragrances company to join Together for Sustainability (TfS), driving responsible sourcing throughout their supply chain.\nIn 2016, IFF deployed the industry's first-ever on-site wind turbine at its Tilburg, Netherlands manufacturing facility. It has an output of 2.4 megawatts, producing approximately 6.5 million kWh of renewable electricity per year, which provides up to 30 percent of the site's electricity needs, and when combined with purchased green electricity the facility is powered by 100 percent renewable electricity.\nIn 2016, IFF released the First-Ever Cradle to Cradle Certified™ Fragrance: PuraVita™. Designed through a mindset of sustainability the fragrance earned IFF a Platinum level Material Health Certificate.\nIn 2016, IFF and Unilever launched the Vetiver Together Partnership to Improve the Lives of Vetiver Farming Communities in Haiti and strengthen the supply chain. The project is supported by the Enhancing Livelihoods Fund – a partnership between Unilever, Oxfam Great Britain, and the Ford Foundation and is being implemented by Heifer International in Haiti.\nIFF is rated gold by EcoVadis for sustainability, which ranks it as a top supplier and partner.\nIn 2017, IFF, headquartered in Manhattan, New York City, joined the We Are Still In network demonstrating America's enduring commitment to tackling climate change, ensuring a clean energy future, and upholding the Paris Agreement. IFF announced that it joined the American Business Act on Climate Pledge in 2015.\nIn 2017, International Flavors & Fragrances' South Brunswick, New Jersey facility earned GreenCircle Certified LLC Zero Waste to Landfill facility status, making it the only facility of its kind in the flavor and fragrance industry to achieve GreenCircle's zero waste status.\nIFF was recognized as one of the top green companies in the U.S. in the 2016 Newsweek Green Rankings  and named on Barron's 100 Most Sustainable Companies List  in 2018.\n\nPartnerships\nIn 2001, IFF collaborated with the Cosmetic Executive Women (CEW) at the Raymond-Poincaré hospital in Garches, France to develop Olfactotherapy, based on the link between smells and memories, which is now used in several hospitals to help patients with brain injuries, stroke victims and Alzheimer's patients with memory impairment or of language.\nIn 2016, IFF joined the Well Living Lab as a Sustaining Alliance Member. The Well Living Lab is a collaboration of the Mayo Clinic and Delos Innovate Well that is seeking to, among other things, study indoor environments and create healthier indoor spaces.\nIn 2017, IFF Lucas Meyer Cosmetics invested in Bio ForeXtra to expand its raw material access.\nIFF is a member of the European Flavour Association.\n\nControversy\nIFF has been involved in several lawsuits relating to cases of bronchiolitis obliterans allegedly resulting from exposure to diacetyl in butter flavorings by workers at the Gilster-Mary Lee popcorn plant in Jasper, Missouri. The plaintiffs claim the manufacturers knew about the dangers of the butter flavoring used in the popcorn factory but failed to give a warning. The defendants said they were unaware of the risk and suggested there was not enough evidence to prove their product had caused the disease. Several suits have already been settled amounting to almost $53 million in damages.\n\nCEOs\nJ. Erik Fyrwald: 2024–present\nFrank Clyburn: 2022–2024\nAndreas Fibig: 2014–2022\nDoug Tough: 2010–2014 \nRobert Amen: 2006–2009\n\nSee also\nFirmenich\nTakasago\nSymrise\nGivaudan\nFrutarom\n\nReferences\nExternal links\nOfficial website\nBusiness data for International Flavors & Fragrances Inc.: \nThe World of Smell: An Inside Tour of the World's Largest Perfume Lab Archived 2011-04-25 at the Wayback Machine Time magazine, 2007",
  "clean_text": "International Flavors & Fragrances Inc. (IFF) is an American corporation that creates products across taste, texture, scent, nutrition, enzymes, cultures, soy proteins, and probiotics categories, which it markets globally. It is headquartered in New York City and has creative, sales, and manufacturing facilities in 44 countries. The company is a member of the S&P 500 index. History International Flavors & Fragrances was formed in 1958 by the merger between Polak & Schwarz (P&S) and van Ameringen-Haebler. Polak & Schwarz was founded in 1889 by Leopold Schwarz, who had an interest in spices, flavors, and fragrances, and his brother-in-law, Joseph Polak in the small Dutch town of Zutphen. P&S quickly grew to 36 sites globally. Arnold Louis (A.L.) van Ameringen was hired by Polak & Schwarz to open P&S's U.S. office in 1917 before losing his job with them. Relieved of his duties, he opened van Ameringen & Co. at 13 Gold Street in Manhattan, took over Morana, Inc. in 1920, and became van Ameringen-Haebler (VAH) in 1929. Constant Cornelis (Cook) Brummer was a director at Polak & Schwarz during World War II. Because he saved hundreds of Jewish workers' lives, he is compared to Oskar Schindler. He was recognized by Israel as Righteous Among the Nations in January 2017, for risking his own life to save others from the Nazis. The two companies did well through the bulk of the 20th century, despite difficulties for P&S during World War II. While both companies managed flavors and fragrances, Polak & Schwarz had particular strengths in flavors and van Ameringen-Haebler built a powerful reputation in fragrances. In 1958, the two companies announced their merger to become International Flavors & Fragrances Inc. IFF was listed on the New York Stock Exchange in 1964. It was cross listed to the Euronext Paris Market in 2015, becoming the first U.S.-listed company to make use of Euronext Paris Fast Path process. In 1968, in conjunction with the Monell Foundation, IFF established the Monell Chemical Senses Center, dedicated to the research of taste and smell. In 1985, Dr. Braja D. Mookherjee, a scientist at IFF, pioneered Living Flower technology, which changed the way perfumes are created. In 1990, IFF broke ground in their R&D facility located in Union Beach, NJ, to develop its 5,000-square-foot greenhouse and botanical garden, which can maintain tropical and subtropical temperature zones for more than 1,300 varieties of exotic plants. It is home to a miniature rose called \"Overnight Scentsation\" (also known as the \"Space Rose\") which was cultivated for experiments in space and left the Earth during a 10-day flight on board the shuttle Discovery (STS-95) in 1998. Low gravity critically altered the fragrance of the rose, which was later commercialized by IFF and Shiseido. Henry G. Walter, Jr., former IFF Chairman, 1962–1985, was a noted philanthropist and prolific writer, who pioneered the field of aromatherapy. He is considered one of the most influential people in the Industry. It has been speculated that he inspired some of the storylines and characters in the book Masters of Sex by Thomas Maier, as well as the Showtime series by the same the name. During World War II, his wife, Rosalind (Palmer) Walter worked on the night shift as a riveter on the Corsair, the F4U Marine gull-winged, fighter airplane, inspiring the song \"Rosie the Riveter.\" In 2000, IFF acquired Laboratoire Monique Rémy based in Grasse, France and forms IFF LMR Naturals, strengthening its position in the development and use of raw materials, natural ingredients for fragrances and flavors. In 2000, IFF acquired Bush Boake Allen with its complementary products, technologies, and presence in key markets, making IFF the largest flavor and fragrance house in the world for several years. In 2014, IFF acquired Aromor Flavors and Fragrances Ltd., a privately held manufacturer and marketer of complex specialty ingredients that are used in fragrances and flavors based in Israel in Kibbutz Givat Oz. In 2015, IFF announced that it completed the acquisition of Ottens Flavors. This was followed in 2016 with the acquisition of David Michael & Company. Using this merger as a catalyst, they have since launched Tastepoint by IFF to serve dynamic middle-tier customers. In 2015, IFF acquired Lucas Meyer Cosmetics, a cosmetic actives firm based in Canada that develops, manufactures and markets innovative ingredients for the cosmetic and personal care industry. Lucas Meyer Cosmetics was sold to Clariant in April 2024. IFF has creative, sales, and manufacturing facilities in 44 countries and is a member of the S&P 500 Index. IFF is a $10.8 billion market capital company with a global footprint that generated over 75 percent of its 2016 sales outside the United States and 51 percent in the emerging markets. In 2014, the Company celebrated its 125th anniversary year, from the founding of Polak & Schwarz on January 27, 1889 in Zutphen, Netherlands, to the 1958 merger with van Ameringen-Haebler to form IFF. IFF is ranked among Forbes Best Employers. On May 8, 2018, IFF acquired the Israeli company Frutarom for $7.1 Billion. Between 2016 and 2018, Kirsten, Finn and Jorn Rausing became the top shareholders of IFF, having bought nearly 20% of the shares via entities in Singapore and Liechtenstein. In 2019, IFF announced the merger of IFF and DuPont's Nutrition & Biosciences (N&B) business in a Reverse Morris Trust transaction. The deal values the combined company at $45.4 billion on an enterprise value basis, reflecting a value of $26.2 billion for the N&B business based on IFF's share price as of December 13, 2019. In December 2022, French private equity firm PAI Partners announced their acquisition of IFF's Savory Solutions Group, which is valued at about $900 million. Upon the deal's completion, the private equity firm rebranded the solutions group as NovaTaste. In March 2024, it was announced IFF has sold its IFF Pharma Solutions division to the France-based family owned company, Roquette for $2.85 billion. Environmental record IFF published its first external sustainability report: Sustainability: The Essence of IFF in 2011. In 2012, IFF adopted the 12 Principles of Green Chemistry as an important differentiator in product design and development. In 2014, IFF opened a 4,000 kilowatt Photovoltaic Solar Installation in New Jersey, which supplies approximately 40 percent of the electricity needs of its Hazlet, NJ fragrances manufacturing and creative center facilities. It has more than 16,000 modules and approximately 1 million solar cells covering 20 acres of IFF property, making IFF a leader in renewable energy in its sector. In 2015, IFF achieved LEED Silver Certification for its Flavors Creative Center in Indonesia and achieved Roundtable for Sustainable Palm Oil (RSPO) Supply Chain Certification for its facilities in the United States, the United Kingdom and the Netherlands. In 2015, Coca-Cola, FUJIFILM, International Flavors and Fragrances, Agristo, Cofely and Water Board De Dommel opened a collective wastewater treatment plant on the premises of FUJIFILM in Tilburg, Netherlands. The wastewater treatment plant can process about 10 million litre per day or more than 3.5 billion litre wastewater per year. The plant has a low level of energy consumption and implements the latest technology in the field of water treatment. After treatment, the wastewater is discharged as clean water into the Wilhelmina Canal, making it available for reuse by the four companies, or for another sustainable use in the Tilburg region. In 2016, IFF was awarded a place on the CDP Climate \"A\" List for the 2nd year in a row and achieved a 7% year-over-year reduction in GHG emissions intensity. IFF also became the first flavors and fragrances company to join Together for Sustainability (TfS), driving responsible sourcing throughout their supply chain. In 2016, IFF deployed the industry's first-ever on-site wind turbine at its Tilburg, Netherlands manufacturing facility. It has an output of 2.4 megawatts, producing approximately 6.5 million kWh of renewable electricity per year, which provides up to 30 percent of the site's electricity needs, and when combined with purchased green electricity the facility is powered by 100 percent renewable electricity. In 2016, IFF released the First-Ever Cradle to Cradle Certified™ Fragrance: PuraVita™. Designed through a mindset of sustainability the fragrance earned IFF a Platinum level Material Health Certificate. In 2016, IFF and Unilever launched the Vetiver Together Partnership to Improve the Lives of Vetiver Farming Communities in Haiti and strengthen the supply chain. The project is supported by the Enhancing Livelihoods Fund – a partnership between Unilever, Oxfam Great Britain, and the Ford Foundation and is being implemented by Heifer International in Haiti. IFF is rated gold by EcoVadis for sustainability, which ranks it as a top supplier and partner. In 2017, IFF, headquartered in Manhattan, New York City, joined the We Are Still In network demonstrating America's enduring commitment to tackling climate change, ensuring a clean energy future, and upholding the Paris Agreement. IFF announced that it joined the American Business Act on Climate Pledge in 2015. In 2017, International Flavors & Fragrances' South Brunswick, New Jersey facility earned GreenCircle Certified LLC Zero Waste to Landfill facility status, making it the only facility of its kind in the flavor and fragrance industry to achieve GreenCircle's zero waste status. IFF was recognized as one of the top green companies in the U.S. in the 2016 Newsweek Green Rankings and named on Barron's 100 Most Sustainable Companies List in 2018. Partnerships In 2001, IFF collaborated with the Cosmetic Executive Women (CEW) at the Raymond-Poincaré hospital in Garches, France to develop Olfactotherapy, based on the link between smells and memories, which is now used in several hospitals to help patients with brain injuries, stroke victims and Alzheimer's patients with memory impairment or of language. In 2016, IFF joined the Well Living Lab as a Sustaining Alliance Member. The Well Living Lab is a collaboration of the Mayo Clinic and Delos Innovate Well that is seeking to, among other things, study indoor environments and create healthier indoor spaces. In 2017, IFF Lucas Meyer Cosmetics invested in Bio ForeXtra to expand its raw material access. IFF is a member of the European Flavour Association. Controversy IFF has been involved in several lawsuits relating to cases of bronchiolitis obliterans allegedly resulting from exposure to diacetyl in butter flavorings by workers at the Gilster-Mary Lee popcorn plant in Jasper, Missouri. The plaintiffs claim the manufacturers knew about the dangers of the butter flavoring used in the popcorn factory but failed to give a warning. The defendants said they were unaware of the risk and suggested there was not enough evidence to prove their product had caused the disease. Several suits have already been settled amounting to almost $53 million in damages. CEOs J. Erik Fyrwald: 2024–present Frank Clyburn: 2022–2024 Andreas Fibig: 2014–2022 Doug Tough: 2010–2014 Robert Amen: 2006–2009"
}