{
  "ticker": "INCY",
  "cik": "0000879169",
  "company_name": "Incyte",
  "corrected_name": "Incyte",
  "wiki_title_used": "Incyte",
  "exists": true,
  "raw_text": "Incyte Corporation is an American multinational pharmaceutical company with headquarters in Wilmington, Delaware. The company currently operates manufacturing and R&D locations in North America, Europe, and Asia.\nIncyte Corporation currently develops and manufactures prescription biopharmaceutical medications in multiple therapeutic areas including oncology, inflammation, and autoimmunity.\n\nHistory\nIn June 2025, Incyte named Bill Meury president, CEO, and a member of the Board of Directors.  He replaced Hervé Hoppenot, who retired after 11 years of service.\nIn September 2015, the company announced it had gained exclusive development and commercial right pertaining to Jiangsu Hengrui Medicine Co., Ltd's anti-PD-1 monoclonal antibody, SHR-1210, in a deal worth $795+ million.\nIn January 2020, Incyte signed a collaboration and license agreement for the global development and commercialization of tafasitamab with MorphoSys. On March 3, 2020, the agreement received antitrust clearance and thus became effective.\nIncyte established a European headquarters in Morges, Switzerland, in 2021.\n\nPharmaceuticals\nIncyte Corporation currently has seven marketed and co-marketed pharmaceutical products, including Jakafi (ruxolitinib), Pemazyre (pemigatinib), Monjuvi (tafasitamab-cxix), Opzelura (Ruxolitinib),  Tabrecta (capmatinib), Olumiant (Baricitinib), and Iclusig (ponatinib).\n\nIn 2013, Novartis acquired Incyte's c-Met inhibitor capmatinib (INC280,  INCB028060), which is marketed under the brand name Tabrecta.\nAs of 2014, the company was developing baricitinib, an oral JAK1 and JAK2 inhibitor drug for rheumatoid arthritis in partnership with Eli Lilly. It gained EU approval in February 2017. In April 2017, the US FDA issued a rejection, citing concerns about dosing and safety. In May 2018, baricitinib was approved in the United States for the treatment of rheumatoid arthritis under the brand name Olumiant.\nAs of 2016 epacadostat, an indoleamine 2,3-dioxygenase (IDO1) inhibitor, was in development for various cancers and was in combination trials with Merck's pembrolizumab (Keytruda) and Bristol Myers Squibb's nivolumab (Opdivo).\n\nAcquisition history\nIncyte has made a total of 3 acquisitions.\n\nMaxia Pharmaceuticals (2003): An early acquisition in Incyte's history, the company purchased Maxia in 2003 for $42 million. \nVillaris Therapeutics (2022): This acquisition was valued at approximately $1.4 billion and included an upfront payment along with milestones. It added new assets to Incyte's portfolio for treating vitiligo and other autoimmune conditions. \nEscient Pharmaceuticals (2024): In May 2024, Incyte acquired this San Diego-based, clinical-stage company for $750 million. The acquisition provided Incyte with two oral drug candidates for inflammatory diseases, EP262 and EP547.\n\nReferences\nExternal links\nBusiness data for Incyte:",
  "clean_text": "Incyte Corporation is an American multinational pharmaceutical company with headquarters in Wilmington, Delaware. The company currently operates manufacturing and R&D locations in North America, Europe, and Asia. Incyte Corporation currently develops and manufactures prescription biopharmaceutical medications in multiple therapeutic areas including oncology, inflammation, and autoimmunity. History In June 2025, Incyte named Bill Meury president, CEO, and a member of the Board of Directors. He replaced Hervé Hoppenot, who retired after 11 years of service. In September 2015, the company announced it had gained exclusive development and commercial right pertaining to Jiangsu Hengrui Medicine Co., Ltd's anti-PD-1 monoclonal antibody, SHR-1210, in a deal worth $795+ million. In January 2020, Incyte signed a collaboration and license agreement for the global development and commercialization of tafasitamab with MorphoSys. On March 3, 2020, the agreement received antitrust clearance and thus became effective. Incyte established a European headquarters in Morges, Switzerland, in 2021. Pharmaceuticals Incyte Corporation currently has seven marketed and co-marketed pharmaceutical products, including Jakafi (ruxolitinib), Pemazyre (pemigatinib), Monjuvi (tafasitamab-cxix), Opzelura (Ruxolitinib), Tabrecta (capmatinib), Olumiant (Baricitinib), and Iclusig (ponatinib). In 2013, Novartis acquired Incyte's c-Met inhibitor capmatinib (INC280, INCB028060), which is marketed under the brand name Tabrecta. As of 2014, the company was developing baricitinib, an oral JAK1 and JAK2 inhibitor drug for rheumatoid arthritis in partnership with Eli Lilly. It gained EU approval in February 2017. In April 2017, the US FDA issued a rejection, citing concerns about dosing and safety. In May 2018, baricitinib was approved in the United States for the treatment of rheumatoid arthritis under the brand name Olumiant. As of 2016 epacadostat, an indoleamine 2,3-dioxygenase (IDO1) inhibitor, was in development for various cancers and was in combination trials with Merck's pembrolizumab (Keytruda) and Bristol Myers Squibb's nivolumab (Opdivo). Acquisition history Incyte has made a total of 3 acquisitions. Maxia Pharmaceuticals (2003): An early acquisition in Incyte's history, the company purchased Maxia in 2003 for $42 million. Villaris Therapeutics (2022): This acquisition was valued at approximately $1.4 billion and included an upfront payment along with milestones. It added new assets to Incyte's portfolio for treating vitiligo and other autoimmune conditions. Escient Pharmaceuticals (2024): In May 2024, Incyte acquired this San Diego-based, clinical-stage company for $750 million. The acquisition provided Incyte with two oral drug candidates for inflammatory diseases, EP262 and EP547."
}