{
  "ticker": "INVH",
  "cik": "0001687229",
  "company_name": "Invitation Homes",
  "corrected_name": "Invitation Homes",
  "wiki_title_used": "Invitation Homes",
  "exists": true,
  "raw_text": "Invitation Homes Inc. is a public company traded on the New York Stock Exchange. It is headquartered in the Lincoln Center building in Dallas, Texas. Dallas B. Tanner is chief executive officer. As of 2017, the company was reportedly the largest owner of single-family rental homes in the United States. As of July 2024, the company owned about 84,000 rental homes in 16 markets. Seventeen percent of their rental income is from California.\n\nHistory\n2005–2012: Background and formation\nIn 2005, entrepreneur Dallas Tanner and several others formed the housing and apartment investment company Treehouse Group in Arizona.  Between 2010 and 2011, it bought 1,000 distressed houses in Phoenix, Arizona, a city heavily impacted by foreclosures caused by the subprime mortgage crisis and one of the first areas where private equity investor purchases of homes for rent took place after the Great Recession.\nIn 2011, Treehouse merged with the Dallas-based property management firm Riverstone Residential. The company was acquired by Blackstone Inc in the spring of 2012, forming Invitation Homes, with Blackstone giving Treehouse and Residential more capital to expand the business.\n\n2012–2017: Initial purchases\nInvitation Homes' first home purchase was in April 2012, and within a year the company had spent $4 billion on 24,000 homes in the United States, becoming the largest buyer of homes for rent in the United States; section 8 properties made up 16% of the portfolio. In April 2013, it made a $100-million-plus purchase of 1,400 Atlanta homes from Building and Land Technology.\nFrom August 2012 to June 2013, Invitation Homes purchased 1,650 homes in the Tampa Bay Area for over $250 million. In June, 85% of Tampa Bay online listings by Invitation Homes were above the area's average rent of $1,200.\nAt the time, corporate home owners like Invitation Homes were purchasing houses in \"strike zones,\" neighborhoods located near several jobs, schools, and transportation systems that were also facing high amounts of foreclosures, and rented them to middle-aged parents raising children making around $100,000 a year or more.\nIn 2013, Invitation Homes created an asset class of single-family rental securities (SFR) to raise money for purchasing and restoring houses.\nIn 2016, Invitation Homes instituted its \"Resident First Look\" program where some renters would be given an option to purchase the homes they rent.\n\n2017–present: Initial public offering and merger\nBy January 2017, nearly $10 billion of the company's SFR bonds were sold a number that went to $15 billion in July 2018. On January 23, 2017, Fannie Mae funded $1 billion of debt to Invitation Homes as back-up money; four years prior, Fannie stopped another government-sponsored entity buying distressed homes, and Fannie's acquisition with the Blackstone entity was the first time in history it backstopped a single-family house landlord company. According to Corinne Russell, spokesperson of Fannie Mae regulator Federal Housing Finance Agency (FHFA), the deal was a way for Fannie Mae and Freddie Mac to learn about the mechanics of the single-family rent market and what the government enterprises' role should be in it. The decision received criticism from more than 25 affordable-housing advocate groups, who believed Fannie Mae wasn't following its principle of protecting home owners. In February, Invitation Homes became a public company via an initial public offering, the second-largest initial public offering of a real estate investment trust in the United States with $1.77 billion. In November 2017, Invitation Homes merged with Starwood Waypoint, a corporate spin-off of Starwood Capital Group, the resulting company will be known as Invitation Homes.\nIn November 2019, Blackstone divested its share of Invitation Homes. \nIn October 2020, Invitation Homes created a joint venture with Rockpoint Group to purchase $1 billion in single-family homes in Dallas, Seattle, South Florida and other U.S. markets. \nIn July 2021, the company launched a joint venture with Atlanta, Georgia-based home construction company PulteGroup, where Pulte was projected to design and build approximately 7,500 new homes over the next five years for sale to Invitation Homes for inclusion in their single-family rental leasing portfolio.\n\nBusiness model\nAs of 2017, the company was reportedly the largest owner of single-family rental homes in the United States. As of December 2022, the company owned about 83,000 rental homes in 16 markets. The Wall Street Journal described Invitation Homes as competing \"at the high end of the rental market\". Tenants are typically in their late-30s with children and household income of approximately $100,000.\n\nCriticism\nWall Street companies in the rent industry, especially Invitation Homes, have garnered strong backlash from real estate experts and affordable-housing activists for taking advantage of tenants to fulfill investors' pockets; the primary argument is that the corporations are incentivized to keep repair costs low and fees and rent prices high in order to increase bond sales that determine their scale. California Reinvestment Coalition's Kevin Stein derogatorily labeled the business model \"securitization of rental income.\"\nAn analysis of Census and property data by Massachusetts Institute of Technology researcher Maya Abood of four Los Angeles County neighborhoods where Invitation Homes single-family rents are located show that the percentages of rents it owns in a neighborhood ranged from 10% to up to 25%.\nA December 2016 Federal Reserve Bank of Atlanta study stated Wall Street rent corporations evicted tenants significantly more than regular mom-and-pop landlords; it reported Invitation Homes evicting 15% of its renters, and the entity it would later merge with, Starwood Waypoint, 30%, and stated being African-American also increased chances of being evicted if under a company like Invitation Homes.\nComplaints and horror stories from Invitation Homes' customers have been covered on publications and news stations such as WGCL-TV, CBS Sacramento, The Arizona Republic, and WTVF. Mold, sewage, and water leakage; nails poking out; infestation of vermin such as spiders, cockroaches, and ants; broken appliances such as garage doors, heating systems, stoves, and microwaves; and unfulfilled repair requests are frequent issues. Invitation Homes has raised rents by an average of as much as 10% per year in some markets such as Oakland, California, double the norm for these markets, according to the Alliance of Californians for Community Empowerment (ACCE). There have been three protests at Blackstone's California offices by Invitation Homes tenants organized by ACCE, such as one in October 2017 at Blackstone's Santa Monica headquarters, which involved the tenants placing letters on the desks to hold a meeting with the corporation's executives and stop practices of excessive rent prices, fees, and poor maintenance; the company never got back to them.\nInvitation Homes has faced several lawsuits from courts throughout the country. In May 2018, tenants filed a class action against the corporation in the United States District Court for the Northern District of California, with a rationale of excessive rent price increases and fees; they reported being charged $95 if even a minute late on a rent payment, regardless if the company's online payment system is broken, and filing eviction notices that added more \"unfair\" legal costs, fees, and penalties for them to bear. On July 20, Invitation Homes responded with a motion that stated the class action group and its plaintiff had too little evidence.\nStaff of Invitation Homes has responded to the criticisms, including chief operating officer Charles Young who in July 2018 stated the company had an average rating of 4.32 stars out of five from tenant surveys it ran.\nDespite Congress passing legislation banning broker's price opinions after the mortgage crisis, it's legal for Invitation Homes to use them due to a loophole where the law doesn't apply to bonds of multiple homes. For the entity, the other firm's BPOs are a less-costly alternative to mortgage appraisal by licensed contractors typical of the housing market; according to an investigation by the Securities and Exchange Commission that started in September 2017, they involve inspections by independent contractors unlicensed to do appraisals, who are only assigned to inspect the exteriors with the assumption that the interiors were already renovated.\nOne of the single-family securities looked at by Reuters contained 7,024 houses, each of which was making the entity an average rent of $1,538 a month and $985 a year for other fees. Reuters also interviewed five Invitation Homes ex-employees that stated the company spent too little on repairs; the bond data showed it spent a per-house annual average of $1,142 on maintenance, less than the typical $3,100 average most Americans spend for the same services, although the entity responded that the $750 spent on system back-up costs wasn't shown.\nIn September 2024, Invitation Homes reached a settlement with the Federal Trade Commission (FTC), in which the company agreed to refund $48 million to customers harmed by its actions, which according the FTC allegedly included \"a variety of unfair and deceptive tactics, from saddling people with hidden fees and unjustly withholding security deposits to misleading people about eviction policies during the pandemic.\"\n\nSee also\nHistory and impact of institutional investment in housing in the United States\n\nReferences\nExternal links\nOfficial website\nBusiness data for Invitation Homes Inc.:",
  "clean_text": "Invitation Homes Inc. is a public company traded on the New York Stock Exchange. It is headquartered in the Lincoln Center building in Dallas, Texas. Dallas B. Tanner is chief executive officer. As of 2017, the company was reportedly the largest owner of single-family rental homes in the United States. As of July 2024, the company owned about 84,000 rental homes in 16 markets. Seventeen percent of their rental income is from California. History 2005–2012: Background and formation In 2005, entrepreneur Dallas Tanner and several others formed the housing and apartment investment company Treehouse Group in Arizona. Between 2010 and 2011, it bought 1,000 distressed houses in Phoenix, Arizona, a city heavily impacted by foreclosures caused by the subprime mortgage crisis and one of the first areas where private equity investor purchases of homes for rent took place after the Great Recession. In 2011, Treehouse merged with the Dallas-based property management firm Riverstone Residential. The company was acquired by Blackstone Inc in the spring of 2012, forming Invitation Homes, with Blackstone giving Treehouse and Residential more capital to expand the business. 2012–2017: Initial purchases Invitation Homes' first home purchase was in April 2012, and within a year the company had spent $4 billion on 24,000 homes in the United States, becoming the largest buyer of homes for rent in the United States; section 8 properties made up 16% of the portfolio. In April 2013, it made a $100-million-plus purchase of 1,400 Atlanta homes from Building and Land Technology. From August 2012 to June 2013, Invitation Homes purchased 1,650 homes in the Tampa Bay Area for over $250 million. In June, 85% of Tampa Bay online listings by Invitation Homes were above the area's average rent of $1,200. At the time, corporate home owners like Invitation Homes were purchasing houses in \"strike zones,\" neighborhoods located near several jobs, schools, and transportation systems that were also facing high amounts of foreclosures, and rented them to middle-aged parents raising children making around $100,000 a year or more. In 2013, Invitation Homes created an asset class of single-family rental securities (SFR) to raise money for purchasing and restoring houses. In 2016, Invitation Homes instituted its \"Resident First Look\" program where some renters would be given an option to purchase the homes they rent. 2017–present: Initial public offering and merger By January 2017, nearly $10 billion of the company's SFR bonds were sold a number that went to $15 billion in July 2018. On January 23, 2017, Fannie Mae funded $1 billion of debt to Invitation Homes as back-up money; four years prior, Fannie stopped another government-sponsored entity buying distressed homes, and Fannie's acquisition with the Blackstone entity was the first time in history it backstopped a single-family house landlord company. According to Corinne Russell, spokesperson of Fannie Mae regulator Federal Housing Finance Agency (FHFA), the deal was a way for Fannie Mae and Freddie Mac to learn about the mechanics of the single-family rent market and what the government enterprises' role should be in it. The decision received criticism from more than 25 affordable-housing advocate groups, who believed Fannie Mae wasn't following its principle of protecting home owners. In February, Invitation Homes became a public company via an initial public offering, the second-largest initial public offering of a real estate investment trust in the United States with $1.77 billion. In November 2017, Invitation Homes merged with Starwood Waypoint, a corporate spin-off of Starwood Capital Group, the resulting company will be known as Invitation Homes. In November 2019, Blackstone divested its share of Invitation Homes. In October 2020, Invitation Homes created a joint venture with Rockpoint Group to purchase $1 billion in single-family homes in Dallas, Seattle, South Florida and other U.S. markets. In July 2021, the company launched a joint venture with Atlanta, Georgia-based home construction company PulteGroup, where Pulte was projected to design and build approximately 7,500 new homes over the next five years for sale to Invitation Homes for inclusion in their single-family rental leasing portfolio. Business model As of 2017, the company was reportedly the largest owner of single-family rental homes in the United States. As of December 2022, the company owned about 83,000 rental homes in 16 markets. The Wall Street Journal described Invitation Homes as competing \"at the high end of the rental market\". Tenants are typically in their late-30s with children and household income of approximately $100,000. Criticism Wall Street companies in the rent industry, especially Invitation Homes, have garnered strong backlash from real estate experts and affordable-housing activists for taking advantage of tenants to fulfill investors' pockets; the primary argument is that the corporations are incentivized to keep repair costs low and fees and rent prices high in order to increase bond sales that determine their scale. California Reinvestment Coalition's Kevin Stein derogatorily labeled the business model \"securitization of rental income.\" An analysis of Census and property data by Massachusetts Institute of Technology researcher Maya Abood of four Los Angeles County neighborhoods where Invitation Homes single-family rents are located show that the percentages of rents it owns in a neighborhood ranged from 10% to up to 25%. A December 2016 Federal Reserve Bank of Atlanta study stated Wall Street rent corporations evicted tenants significantly more than regular mom-and-pop landlords; it reported Invitation Homes evicting 15% of its renters, and the entity it would later merge with, Starwood Waypoint, 30%, and stated being African-American also increased chances of being evicted if under a company like Invitation Homes. Complaints and horror stories from Invitation Homes' customers have been covered on publications and news stations such as WGCL-TV, CBS Sacramento, The Arizona Republic, and WTVF. Mold, sewage, and water leakage; nails poking out; infestation of vermin such as spiders, cockroaches, and ants; broken appliances such as garage doors, heating systems, stoves, and microwaves; and unfulfilled repair requests are frequent issues. Invitation Homes has raised rents by an average of as much as 10% per year in some markets such as Oakland, California, double the norm for these markets, according to the Alliance of Californians for Community Empowerment (ACCE). There have been three protests at Blackstone's California offices by Invitation Homes tenants organized by ACCE, such as one in October 2017 at Blackstone's Santa Monica headquarters, which involved the tenants placing letters on the desks to hold a meeting with the corporation's executives and stop practices of excessive rent prices, fees, and poor maintenance; the company never got back to them. Invitation Homes has faced several lawsuits from courts throughout the country. In May 2018, tenants filed a class action against the corporation in the United States District Court for the Northern District of California, with a rationale of excessive rent price increases and fees; they reported being charged $95 if even a minute late on a rent payment, regardless if the company's online payment system is broken, and filing eviction notices that added more \"unfair\" legal costs, fees, and penalties for them to bear. On July 20, Invitation Homes responded with a motion that stated the class action group and its plaintiff had too little evidence. Staff of Invitation Homes has responded to the criticisms, including chief operating officer Charles Young who in July 2018 stated the company had an average rating of 4.32 stars out of five from tenant surveys it ran. Despite Congress passing legislation banning broker's price opinions after the mortgage crisis, it's legal for Invitation Homes to use them due to a loophole where the law doesn't apply to bonds of multiple homes. For the entity, the other firm's BPOs are a less-costly alternative to mortgage appraisal by licensed contractors typical of the housing market; according to an investigation by the Securities and Exchange Commission that started in September 2017, they involve inspections by independent contractors unlicensed to do appraisals, who are only assigned to inspect the exteriors with the assumption that the interiors were already renovated. One of the single-family securities looked at by Reuters contained 7,024 houses, each of which was making the entity an average rent of $1,538 a month and $985 a year for other fees. Reuters also interviewed five Invitation Homes ex-employees that stated the company spent too little on repairs; the bond data showed it spent a per-house annual average of $1,142 on maintenance, less than the typical $3,100 average most Americans spend for the same services, although the entity responded that the $750 spent on system back-up costs wasn't shown. In September 2024, Invitation Homes reached a settlement with the Federal Trade Commission (FTC), in which the company agreed to refund $48 million to customers harmed by its actions, which according the FTC allegedly included \"a variety of unfair and deceptive tactics, from saddling people with hidden fees and unjustly withholding security deposits to misleading people about eviction policies during the pandemic.\""
}