{
  "ticker": "IQV",
  "cik": "0001478242",
  "company_name": "IQVIA",
  "corrected_name": "IQVIA",
  "wiki_title_used": "IQVIA",
  "exists": true,
  "raw_text": "IQVIA Holdings, Inc., headquartered in Durham, North Carolina, is an American company focused on health information technology and clinical research. \nThe company operates three divisions: Technology & Analytics  (40% of 2024 revenues), focused on health information technology  with access to 1.2 billion unique non-identified patient records globally, offers cloud-based customer relationship management application software as well as analytics consulting services all to the healthcare industry; Research & Development (55% of 2024 revenues), which is a contract research organization that handles all aspects of clinical trials including phase I through IV clinical trial management, clinical pharmacology, post-approval services, regulatory affairs, protocol design, operational planning, study and site start-up, patient recruitment, project management, monitoring, data management and biostatistics; and Contract Sales & Medical (5% of 2024 revenues), which offers contract sales to healthcare providers and patient engagement services.\nThe company is ranked 282nd on the Fortune 500 and 680th on the Forbes Global 2000.\nThe company has been criticized for collecting and selling patient medical records even though the data is anonymized.\nIQVIA was formed in 2016 from the merger of Quintiles, a contract research organization, and IMS Health, a healthcare data and analytics provider and the largest vendor of U.S. physician prescribing data. The IQVIA name is a combination of: I (IMS Health), Q (Quintiles), and VIA (by way of).\n\nHistory\nIMS Health\nThe original name of the company was Intercontinental Marketing Statistics, hence the IMS name. IMS Health's corporate headquarters is located in Danbury, Connecticut, United States. The company's chairman and CEO is Ari Bousbib.\n\nIn 1998, the parent company, Cognizant Corporation, split into two companies: IMS Health and Nielsen Media Research. After this restructuring, Cognizant Technology Solutions became a public subsidiary of IMS Health\nIn 2002, IMS Health acquired Cambridge Pharma Consultancy, a privately held international firm that provides strategic advice to pharmaceutical management.\nIn 2002, IMS Health acquired the Rosenblatt Klauber Group, a privately held international consultancy that provides forecasting, opportunity assessment & management development services to pharmaceutical companies.\nIn 2003, acquired Marketing Initiatives, a specialist in healthcare facility profile data, and Data Niche Associates, a provider of rebate validation services for Medicaid and managed care. In 2003, IMS Health sold its entire 56% stake in Cognizant and both companies are separated into two independent entities as IMS Health and Cognizant\nIn 2004, United Research China Shanghai was acquired, providing coverage of China's consumer health market.\nIn 2005, acquired PharMetrics, a U.S. provider of patient-centric integrated claims data.\nIn 2006, acquired the Life Sciences practice of Strategic Decisions Group, a portfolio strategy consultant to the life sciences industry.\nIn 2007, IMS Health acquired IHS and MedInitiatives, providers of healthcare data management analytics and technology services. That same year, ValueMedics Research was acquired, extending IMS Health's health economics and outcomes research capabilities.\nIn 2007, ranked in the Businessweek 50. This list represents \"best in class\" companies from the ten economic sectors that make up the S&P 500.\nIn 2008, named to the World's Most Admired Companies list by Fortune. The company received the recognition again in 2010.\nIn 2008, acquired RMBC, a provider of national pharmaceutical market intelligence and analytics in Russia.\nIn 2008, acquired the Skura professional services group, based out of Mississauga, Ontario, Canada and specialized in data integration, consulting and services in business intelligence platforms to pharmaceutical and healthcare clients in North America and Europe.\nIn 2009, named to the Dow Jones Sustainability North America Index in recognition of the company's economic, environmental and social performance among the largest 600 North American companies.\nIn February 2010, IMS Health was taken private by TPG Capital, CPP Investment Board, and Leonard Green & Partners.\nIn 2010, acquired Brogan, Inc., a privately held market research and consulting firm serving the Canada healthcare market.\nIn 2011, expanded its specialty and patient-level data assets in the United States with the acquisition of SDI Health. Also that year, the company acquired Ardentia Ltd in the UK, and Med-Vantage in the United States to build on its payer services in those markets.\nIn 2012, acquired PharmARC Analytic Solutions Pvt. Ltd, a Bangalore-based analytics company.\nIn 2012, acquired DecisionView, a software solutions company that helps life sciences organizations plan and track patient enrollment for clinical trials and TTC, a benchmarking solutions and analytics company that helps clients plan for and negotiate the costs of clinical trials. Also in 2012, the company purchased PharmaDeals Ltd., a provider of online information about business transactions, licensing, and mergers and acquisitions activity within the pharmaceutical industry.\nIn 2013, acquired several companies to expand its portfolio of SaaS products: Incential Software, a provider of sales performance management technology services; 360 Vantage, which delivers multi-channel CRM software capabilities; Appature, which offers a relationship marketing platform; and Semantelli, a provider of social media analytics for the global healthcare industry.\nIn May 2015, IMS increased its software development capability by acquiring Dataline Software Ltd, a bespoke software development company and big data research specialist in the UK.\nIn April 2015, IMS Health completed the purchase of Cegedim's Customer Relationship Management (CRM) software and Strategic Data business for €396 million. Cegedim acquired the software and related business when it purchased Dendrite International in 2007.\nIn August 2015, IMS Health completed the purchase of Boston Biomedical Consultants, a provider of market data and market research covering the in vitro Diagnostics market\nIn May 2016, the company announced it would merge with Quintiles  IMS Health shareholders received 0.384 shares of Quintiles common stock for each share of IMS Health common stock they held, leaving the split of ownership at 51.4% IMS and 48.6% Quintiles. The merger was completed in October and the resulting company was a $17.6 billion company called QuintilesIMS.\nOn November 6, 2017, the company adopted the new name of IQVIA.\n\nQuintiles\nQuintiles was the world's largest provider of biopharmaceutical development and commercial outsourcing services. The company offered clinical data management, clinical trial execution services, pharmaceuticals, drug development, financial partnering, and commercialization expertise to companies in the biotechnology, pharmaceutical and healthcare sectors.\nIn 1982, Dennis Gillings founded and incorporated Quintiles Transnational in North Carolina. Quintiles Transnational established Quintiles Pacific Inc. and Quintiles Ireland Ltd. in 1990. In 1991 Quintiles GmbH was established in Germany and Quintiles Laboratories Ltd. was established in Atlanta, Georgia. In September 1996, Quintiles purchased Innovex Ltd. of Britain for $747.5 million in stock. Quintiles went public in 1997 and completed a successful secondary stock offering.\n\nIn 1974, Dennis Gillings signs the first contract to provide statistical and data management consulting for pharmaceutical clients.\nIn 1982, Quintiles, Inc., is incorporated in North Carolina.\nIn 1990, Quintiles Pacific Inc. and Quintiles Ireland Ltd. are established.\nIn 1991, Quintiles GmbH is established in Germany; Quintiles Laboratories Ltd. is established in Atlanta, Georgia.\nIn 1996, Quintiles buys Innovex Ltd. and BRI International Inc., becoming the world's largest CRO.\nIn 1997, Quintiles goes public, completing a successful secondary stock offering.\nIn 1998, Quintiles becomes the first company in the industry to break the $1 billion mark, when it reports net revenues of $1.19 billion.\nIn 1999, the company joins the S&P 500 Index.\nIn 2003, the Board of Directors agrees to merge with Pharma Services Holdings Inc; Quintiles becomes a private company.\nIn 2009, Quintiles opens new corporate headquarters in Durham, North Carolina.\nIn 2010, Quintiles opens new European headquarters in the UK and establishes operations in East Africa.\nIn 2011, Quintiles buys Advion Biosciences, a bioanalytical lab based out of Ithaca, New York.\nIn 2013, Quintiles filed for an IPO on 15 February in order to go public again; Quintiles begins trading on the New York Stock Exchange (NYSE) under ticker symbol Q.\"\n\nMerger of IMS Health and Quintiles\nIn October 2016, Quintiles merged with IMS Health to form QuintilesIMS. In November 2017, the company adopted the new name of IQVIA.\n\nControversies\nIMS Health's business of collecting and selling pharmaceutical sales data, even though it is anonymized, was under scrutiny from both the media and the legal system.\nIMS Health v. Ayotte was a free speech case involving IMS Health.\nSorrell v. IMS Health Inc. was a case about physician-data privacy, which went to the U.S. Supreme Court. The High Court ruled in favor of the company.\nIQVIA was contracted by the UK government's Office of National Statistics to provide data on the prevalence of COVID-19 infection in the population. Some users of the survey reported problems contacting IQVIA and arranging for testing. The problems with how the survey results were collected were criticised for potentially leading to biased data by New Scientist.\nOn July 17, 2023, the Federal Trade Commission sued to block IQVIA’s acquisition of Propel Media alleging in an administrative complaint that the acquisition would give IQVIA a market-leading position in health care programmatic advertising and would raise health-care prices for consumers. In December 2023, U.S. District Court Judge Edgardo Ramos issued an order granting the FTC’s motion for preliminary injunction to block the merger. Speaking in favor of the FTC, Ramos said, \"The FTC has shown that there is a reasonable probability that the proposed acquisition will substantially impair competition in the relevant market and that the equities weigh in favor of injunctive relief.\" An administrative trial was scheduled to start on January 18, 2024. However, on January 5, 2024, IQVIA and Propel Media announced that they had mutually agreed to abandon the proposed merger.\n\nReferences\nExternal links\n\nBusiness data for IQVIA:",
  "clean_text": "IQVIA Holdings, Inc., headquartered in Durham, North Carolina, is an American company focused on health information technology and clinical research. The company operates three divisions: Technology & Analytics (40% of 2024 revenues), focused on health information technology with access to 1.2 billion unique non-identified patient records globally, offers cloud-based customer relationship management application software as well as analytics consulting services all to the healthcare industry; Research & Development (55% of 2024 revenues), which is a contract research organization that handles all aspects of clinical trials including phase I through IV clinical trial management, clinical pharmacology, post-approval services, regulatory affairs, protocol design, operational planning, study and site start-up, patient recruitment, project management, monitoring, data management and biostatistics; and Contract Sales & Medical (5% of 2024 revenues), which offers contract sales to healthcare providers and patient engagement services. The company is ranked 282nd on the Fortune 500 and 680th on the Forbes Global 2000. The company has been criticized for collecting and selling patient medical records even though the data is anonymized. IQVIA was formed in 2016 from the merger of Quintiles, a contract research organization, and IMS Health, a healthcare data and analytics provider and the largest vendor of U.S. physician prescribing data. The IQVIA name is a combination of: I (IMS Health), Q (Quintiles), and VIA (by way of). History IMS Health The original name of the company was Intercontinental Marketing Statistics, hence the IMS name. IMS Health's corporate headquarters is located in Danbury, Connecticut, United States. The company's chairman and CEO is Ari Bousbib. In 1998, the parent company, Cognizant Corporation, split into two companies: IMS Health and Nielsen Media Research. After this restructuring, Cognizant Technology Solutions became a public subsidiary of IMS Health In 2002, IMS Health acquired Cambridge Pharma Consultancy, a privately held international firm that provides strategic advice to pharmaceutical management. In 2002, IMS Health acquired the Rosenblatt Klauber Group, a privately held international consultancy that provides forecasting, opportunity assessment & management development services to pharmaceutical companies. In 2003, acquired Marketing Initiatives, a specialist in healthcare facility profile data, and Data Niche Associates, a provider of rebate validation services for Medicaid and managed care. In 2003, IMS Health sold its entire 56% stake in Cognizant and both companies are separated into two independent entities as IMS Health and Cognizant In 2004, United Research China Shanghai was acquired, providing coverage of China's consumer health market. In 2005, acquired PharMetrics, a U.S. provider of patient-centric integrated claims data. In 2006, acquired the Life Sciences practice of Strategic Decisions Group, a portfolio strategy consultant to the life sciences industry. In 2007, IMS Health acquired IHS and MedInitiatives, providers of healthcare data management analytics and technology services. That same year, ValueMedics Research was acquired, extending IMS Health's health economics and outcomes research capabilities. In 2007, ranked in the Businessweek 50. This list represents \"best in class\" companies from the ten economic sectors that make up the S&P 500. In 2008, named to the World's Most Admired Companies list by Fortune. The company received the recognition again in 2010. In 2008, acquired RMBC, a provider of national pharmaceutical market intelligence and analytics in Russia. In 2008, acquired the Skura professional services group, based out of Mississauga, Ontario, Canada and specialized in data integration, consulting and services in business intelligence platforms to pharmaceutical and healthcare clients in North America and Europe. In 2009, named to the Dow Jones Sustainability North America Index in recognition of the company's economic, environmental and social performance among the largest 600 North American companies. In February 2010, IMS Health was taken private by TPG Capital, CPP Investment Board, and Leonard Green & Partners. In 2010, acquired Brogan, Inc., a privately held market research and consulting firm serving the Canada healthcare market. In 2011, expanded its specialty and patient-level data assets in the United States with the acquisition of SDI Health. Also that year, the company acquired Ardentia Ltd in the UK, and Med-Vantage in the United States to build on its payer services in those markets. In 2012, acquired PharmARC Analytic Solutions Pvt. Ltd, a Bangalore-based analytics company. In 2012, acquired DecisionView, a software solutions company that helps life sciences organizations plan and track patient enrollment for clinical trials and TTC, a benchmarking solutions and analytics company that helps clients plan for and negotiate the costs of clinical trials. Also in 2012, the company purchased PharmaDeals Ltd., a provider of online information about business transactions, licensing, and mergers and acquisitions activity within the pharmaceutical industry. In 2013, acquired several companies to expand its portfolio of SaaS products: Incential Software, a provider of sales performance management technology services; 360 Vantage, which delivers multi-channel CRM software capabilities; Appature, which offers a relationship marketing platform; and Semantelli, a provider of social media analytics for the global healthcare industry. In May 2015, IMS increased its software development capability by acquiring Dataline Software Ltd, a bespoke software development company and big data research specialist in the UK. In April 2015, IMS Health completed the purchase of Cegedim's Customer Relationship Management (CRM) software and Strategic Data business for €396 million. Cegedim acquired the software and related business when it purchased Dendrite International in 2007. In August 2015, IMS Health completed the purchase of Boston Biomedical Consultants, a provider of market data and market research covering the in vitro Diagnostics market In May 2016, the company announced it would merge with Quintiles IMS Health shareholders received 0.384 shares of Quintiles common stock for each share of IMS Health common stock they held, leaving the split of ownership at 51.4% IMS and 48.6% Quintiles. The merger was completed in October and the resulting company was a $17.6 billion company called QuintilesIMS. On November 6, 2017, the company adopted the new name of IQVIA. Quintiles Quintiles was the world's largest provider of biopharmaceutical development and commercial outsourcing services. The company offered clinical data management, clinical trial execution services, pharmaceuticals, drug development, financial partnering, and commercialization expertise to companies in the biotechnology, pharmaceutical and healthcare sectors. In 1982, Dennis Gillings founded and incorporated Quintiles Transnational in North Carolina. Quintiles Transnational established Quintiles Pacific Inc. and Quintiles Ireland Ltd. in 1990. In 1991 Quintiles GmbH was established in Germany and Quintiles Laboratories Ltd. was established in Atlanta, Georgia. In September 1996, Quintiles purchased Innovex Ltd. of Britain for $747.5 million in stock. Quintiles went public in 1997 and completed a successful secondary stock offering. In 1974, Dennis Gillings signs the first contract to provide statistical and data management consulting for pharmaceutical clients. In 1982, Quintiles, Inc., is incorporated in North Carolina. In 1990, Quintiles Pacific Inc. and Quintiles Ireland Ltd. are established. In 1991, Quintiles GmbH is established in Germany; Quintiles Laboratories Ltd. is established in Atlanta, Georgia. In 1996, Quintiles buys Innovex Ltd. and BRI International Inc., becoming the world's largest CRO. In 1997, Quintiles goes public, completing a successful secondary stock offering. In 1998, Quintiles becomes the first company in the industry to break the $1 billion mark, when it reports net revenues of $1.19 billion. In 1999, the company joins the S&P 500 Index. In 2003, the Board of Directors agrees to merge with Pharma Services Holdings Inc; Quintiles becomes a private company. In 2009, Quintiles opens new corporate headquarters in Durham, North Carolina. In 2010, Quintiles opens new European headquarters in the UK and establishes operations in East Africa. In 2011, Quintiles buys Advion Biosciences, a bioanalytical lab based out of Ithaca, New York. In 2013, Quintiles filed for an IPO on 15 February in order to go public again; Quintiles begins trading on the New York Stock Exchange (NYSE) under ticker symbol Q.\" Merger of IMS Health and Quintiles In October 2016, Quintiles merged with IMS Health to form QuintilesIMS. In November 2017, the company adopted the new name of IQVIA. Controversies IMS Health's business of collecting and selling pharmaceutical sales data, even though it is anonymized, was under scrutiny from both the media and the legal system. IMS Health v. Ayotte was a free speech case involving IMS Health. Sorrell v. IMS Health Inc. was a case about physician-data privacy, which went to the U.S. Supreme Court. The High Court ruled in favor of the company. IQVIA was contracted by the UK government's Office of National Statistics to provide data on the prevalence of COVID-19 infection in the population. Some users of the survey reported problems contacting IQVIA and arranging for testing. The problems with how the survey results were collected were criticised for potentially leading to biased data by New Scientist. On July 17, 2023, the Federal Trade Commission sued to block IQVIA’s acquisition of Propel Media alleging in an administrative complaint that the acquisition would give IQVIA a market-leading position in health care programmatic advertising and would raise health-care prices for consumers. In December 2023, U.S. District Court Judge Edgardo Ramos issued an order granting the FTC’s motion for preliminary injunction to block the merger. Speaking in favor of the FTC, Ramos said, \"The FTC has shown that there is a reasonable probability that the proposed acquisition will substantially impair competition in the relevant market and that the equities weigh in favor of injunctive relief.\" An administrative trial was scheduled to start on January 18, 2024. However, on January 5, 2024, IQVIA and Propel Media announced that they had mutually agreed to abandon the proposed merger."
}