{
  "ticker": "IR",
  "cik": "0001699150",
  "company_name": "Ingersoll Rand",
  "corrected_name": "Ingersoll Rand",
  "wiki_title_used": "Ingersoll Rand",
  "exists": true,
  "raw_text": "Ingersoll Rand Inc. is an American multinational company that provides flow creation and industrial products. The company was formed in February 2020 through the spinoff of the industrial segment of Ingersoll-Rand plc (now known as Trane Technologies) and its merger with Gardner Denver. Its products are sold under more than 40 brands across all major global markets.\nBased in Davidson, North Carolina, Ingersoll Rand operates in two segments: Industrial Technologies and Services and Precision and Science Technologies.\n\nHistory\nHistory of Ingersoll Rand\nSimon Ingersoll founded Ingersoll Rock Drill Company in 1871 in New York, and in 1888, it combined with Sergeant Drill to form Ingersoll Sergeant Drill Company.\nAlso in 1871, brothers Addison Rand and Jasper Rand, Jr. established Rand Drill Company with its main manufacturing plant in Tarrytown, New York. Rand drills cleared New York's treacherous Hell Gate channel and were used in the construction of water aqueducts for New York City and Washington, D.C., as well as tunnels in Haverstraw and West Point, New York, and in Weehawken, New Jersey.\nIn 1905, Ingersoll-Sergeant Drill Company merged with the Rand Drill Company to form Ingersoll Rand.\nIn the 1920s, Ingersoll Rand supplied diesel engines for locomotives built by both General Electric and ALCO.\n\nHistory of Gardner Denver\nRobert Gardner founded the Gardner Governor Company in 1859 in Quincy, Illinois and introduced an early effective speed controls for steam engines. This innovation, known as the flyball governor, helped pave the way for the later production of other industrial products such as air compressors. By the turn of the century, the company had sold more than 150,000 governors across the United States and Canada.\nThe Gardner Governor Company merged with the Denver Rock Drill Company in 1927 to form Gardner-Denver.\nGardner Denver grew during the early decades of the 1900s and transformed through acquisitions. In 1943, Gardner Denver was listed on the New York Stock Exchange for the first time.\nIn the late 1950s, merger negotiations with Dresser Industries yielded no agreement, and the same outcome occurred with Cooper-Bessemer. In 1979, Gardner Denver was acquired by C-B's successor, Cooper Industries Inc. In 1994, Cooper spun off the Gardner Denver Industrial Machinery Division as an independent company. Gardner Denver Inc traded on the New York Stock Exchange until it was acquired by private equity firm Kohlberg Kravis Roberts & Co. L.P. in 2013. Gardner Denver returned to public ownership in 2017 through an initial public offering.\nFlowserve purchased Ingersoll-Dresser Pumps, a business unit of Ingersoll-Rand Co., for $775 million in the year 2000, creating the world’s second largest pump company. (https://www.flowserve.com/en/about-flowserve/company/history/)\n\nMerger of Ingersoll Rand's Industrial Segment and Gardner Denver\nIn April 2019, Ingersoll-Rand Plc and Gardner Denver Holdings, Inc. jointly announced an agreement through which Ingersoll Rand's Industrial segment would be spun-off and merged with Gardner Denver in a Reverse Morris Trust transaction. The merger transaction was completed on February 29, 2020.\n\nEmployee Ownership Initiatives\nWhen Gardner Denver completed its initial public offering in May 2017, it granted deferred stock units to substantially all permanent employees. The grant had a value of approximately $100 million.\nFollowing the merger in 2020, the company granted stock units worth approximately $150 million to substantially all of its 16,000 global employees that had not already received equity-based incentive awards. The amount of the equity grant, equal to approximately 20% of its employee's pay, was one of the largest equity grants ever given to employees in an industrial company.\n\nBusiness segments\nAs of July 2021, Ingersoll Rand operates with two business segments.\n\nThe Industrial Technologies and Services (ITS) segment designs, manufactures, markets and services a broad range of air and gas compression, vacuum and blower products, fluid transfer equipment, loading systems, power tools and lifting equipment. The principal brands include Ingersoll Rand, Gardner Denver, CompAir, Nash and Elmo Rietschle.\nThe Precision and Science Technologies (PST) segment designs, manufactures and markets specialized positive displacement pumps, fluid management equipment, liquid and precision syringe pumps and compressors, and aftermarket parts. Principal brands include Milton Roy, Haskel, ARO, Thomas, Welch, Dosatron, YZ, SEEPEX and others.\nIn April 2021, a controlling interest in its High Pressure Solutions segment was sold to American Industrial Partners for $278 million.\nIn June 2021, Club Car, previously Ingersoll Rand's Specialty Vehicles Technologies segment, was sold to Platinum Equity Advisors for $1.68 billion.\nIn October 2022, Ingersoll Rand announced it would acquire Everest Group, an India-based manufacturer of blowers and vacuum systems and Airmax Groupe, a French manufacturer of compressed air systems.\nIn February 2024, Ingersoll Rand acquired Friulair, a company out of Friuli, Italy which specializes in chillers and dryers. Ingersoll Rand paid a lump sum of $146 million.\n\nReferences\nGardner Denver 1859-2009 Sesquicentennial, 150 Years of Industrial Innovation, Donning Company Publishers, 2009\nGardner Denver press release: \"KKR Completes Acquisition of Gardner Denver\" http://www.gardnerdenver.com/company/news___events/ Archived 2017-01-23 at the Wayback Machine\nBloomberg Press releases for Gardner Denver, Inc. https://www.bloomberg.com/topics/companies/GDI:US\nMSN money article \"Gardner Denver, Inc. Reports Preliminary First Quarter 2009 Financial Results\" http://news.moneycentral.msn.com/provider/providerarticle.aspx?feed=MW&date=20090423&id=9833173 \nGardner Denver press release; \"Gardner Denver, Inc. Announces Manufacturing Consolidation Project\" http://www.marketwire.com/press-release/Gardner-Denver-Inc-NYSE-GDI-973780.html Archived 2009-12-26 at the Wayback Machine\nIngersoll Rand Products: https://airvacuum.com.vn/en/ingersoll-rand\n\nExternal links\nBusiness data for Ingersoll Rand Inc.:",
  "clean_text": "Ingersoll Rand Inc. is an American multinational company that provides flow creation and industrial products. The company was formed in February 2020 through the spinoff of the industrial segment of Ingersoll-Rand plc (now known as Trane Technologies) and its merger with Gardner Denver. Its products are sold under more than 40 brands across all major global markets. Based in Davidson, North Carolina, Ingersoll Rand operates in two segments: Industrial Technologies and Services and Precision and Science Technologies. History History of Ingersoll Rand Simon Ingersoll founded Ingersoll Rock Drill Company in 1871 in New York, and in 1888, it combined with Sergeant Drill to form Ingersoll Sergeant Drill Company. Also in 1871, brothers Addison Rand and Jasper Rand, Jr. established Rand Drill Company with its main manufacturing plant in Tarrytown, New York. Rand drills cleared New York's treacherous Hell Gate channel and were used in the construction of water aqueducts for New York City and Washington, D.C., as well as tunnels in Haverstraw and West Point, New York, and in Weehawken, New Jersey. In 1905, Ingersoll-Sergeant Drill Company merged with the Rand Drill Company to form Ingersoll Rand. In the 1920s, Ingersoll Rand supplied diesel engines for locomotives built by both General Electric and ALCO. History of Gardner Denver Robert Gardner founded the Gardner Governor Company in 1859 in Quincy, Illinois and introduced an early effective speed controls for steam engines. This innovation, known as the flyball governor, helped pave the way for the later production of other industrial products such as air compressors. By the turn of the century, the company had sold more than 150,000 governors across the United States and Canada. The Gardner Governor Company merged with the Denver Rock Drill Company in 1927 to form Gardner-Denver. Gardner Denver grew during the early decades of the 1900s and transformed through acquisitions. In 1943, Gardner Denver was listed on the New York Stock Exchange for the first time. In the late 1950s, merger negotiations with Dresser Industries yielded no agreement, and the same outcome occurred with Cooper-Bessemer. In 1979, Gardner Denver was acquired by C-B's successor, Cooper Industries Inc. In 1994, Cooper spun off the Gardner Denver Industrial Machinery Division as an independent company. Gardner Denver Inc traded on the New York Stock Exchange until it was acquired by private equity firm Kohlberg Kravis Roberts & Co. L.P. in 2013. Gardner Denver returned to public ownership in 2017 through an initial public offering. Flowserve purchased Ingersoll-Dresser Pumps, a business unit of Ingersoll-Rand Co., for $775 million in the year 2000, creating the world’s second largest pump company. (https://www.flowserve.com/en/about-flowserve/company/history/) Merger of Ingersoll Rand's Industrial Segment and Gardner Denver In April 2019, Ingersoll-Rand Plc and Gardner Denver Holdings, Inc. jointly announced an agreement through which Ingersoll Rand's Industrial segment would be spun-off and merged with Gardner Denver in a Reverse Morris Trust transaction. The merger transaction was completed on February 29, 2020. Employee Ownership Initiatives When Gardner Denver completed its initial public offering in May 2017, it granted deferred stock units to substantially all permanent employees. The grant had a value of approximately $100 million. Following the merger in 2020, the company granted stock units worth approximately $150 million to substantially all of its 16,000 global employees that had not already received equity-based incentive awards. The amount of the equity grant, equal to approximately 20% of its employee's pay, was one of the largest equity grants ever given to employees in an industrial company. Business segments As of July 2021, Ingersoll Rand operates with two business segments. The Industrial Technologies and Services (ITS) segment designs, manufactures, markets and services a broad range of air and gas compression, vacuum and blower products, fluid transfer equipment, loading systems, power tools and lifting equipment. The principal brands include Ingersoll Rand, Gardner Denver, CompAir, Nash and Elmo Rietschle. The Precision and Science Technologies (PST) segment designs, manufactures and markets specialized positive displacement pumps, fluid management equipment, liquid and precision syringe pumps and compressors, and aftermarket parts. Principal brands include Milton Roy, Haskel, ARO, Thomas, Welch, Dosatron, YZ, SEEPEX and others. In April 2021, a controlling interest in its High Pressure Solutions segment was sold to American Industrial Partners for $278 million. In June 2021, Club Car, previously Ingersoll Rand's Specialty Vehicles Technologies segment, was sold to Platinum Equity Advisors for $1.68 billion. In October 2022, Ingersoll Rand announced it would acquire Everest Group, an India-based manufacturer of blowers and vacuum systems and Airmax Groupe, a French manufacturer of compressed air systems. In February 2024, Ingersoll Rand acquired Friulair, a company out of Friuli, Italy which specializes in chillers and dryers. Ingersoll Rand paid a lump sum of $146 million."
}