{
  "ticker": "ISRG",
  "cik": "0001035267",
  "company_name": "Intuitive Surgical",
  "corrected_name": "Intuitive Surgical",
  "wiki_title_used": "Intuitive Surgical",
  "exists": true,
  "raw_text": "Intuitive Surgical, Inc. is an American biotechnology company that develops, manufactures, and markets robotic products designed to improve clinical outcomes of patients through minimally invasive surgery, most notably with the da Vinci Surgical System.  The company is part of the Nasdaq-100, S&P 100 and S&P 500. As of 31 December 2021, Intuitive Surgical had an installed base of 6,730 da Vinci Surgical Systems, including 4,139 in the U.S., 1,199 in Europe, 1,050 in Asia, and 342 in the rest of the world.\nIntuitive Surgical made its debut on the Fortune 500 list in 2024, ranking #497.\n\nHistory\nThe research that eventually led to the development of the da Vinci Surgical System was performed in the late 1980s by Ajit Shah and Gary Guthart at research institute SRI International.  In 1990, SRI received funding from the National Institutes of Health.  SRI developed a prototype robotic surgical system that caught the interest of the Defense Advanced Research Projects Agency (DARPA), which was interested in the system for its potential to allow surgeons to operate remotely on soldiers wounded on the battlefield.\nIn 1994, Dr. Frederic Moll became interested in the SRI System, as the device was known at the time. At the time, Moll was employed by Guidant. He tried to interest Guidant in backing it but to no avail. In 1995 Moll was introduced to John Freund who had recently left Acuson Corporation. Freund negotiated an option to acquire SRI's intellectual property and incorporated a new company that he named Intuitive Surgical Devices, Inc.\nAt that point Freund, Moll, and Robert Younge (also from Acuson) wrote the business plan for the company and raised its initial venture capital.  Early investors included the Mayfield Fund, Sierra Ventures, and Morgan Stanley.\nThe company refined the SRI System into a prototype known originally as \"Lenny\" (after Leonardo da Vinci), which was ready for testing in 1997. As the company's prototypes became more advanced, they were named using da Vinci themes. One was named \"Leonardo\", and another was \"Mona\". The final version of the prototype was nicknamed the da Vinci Surgical System, and the name stuck when the system was eventually commercialized. After further testing, Intuitive Surgical began marketing this system in Europe in 1999, while awaiting FDA approval in the United States.\nThe company raised $46 million in an initial public offering in 2000.  That same year, the FDA approved use of the da Vinci Surgical System for general laparoscopic surgery, which can be used to address gallbladder disease and gastroesophageal disease.  In 2001, the FDA approved use of the system for prostate surgery.  The FDA has subsequently approved the system for thoracoscopic surgery, cardiac procedures performed with adjunctive incisions, and gynecologic procedures.\nShortly before going public, Intuitive Surgical was sued for patent infringement by Computer Motion, Inc, its chief rival.  Computer Motion had actually gotten into the robotic surgery field earlier than Intuitive Surgical, with its own system, the ZEUS Robotic Surgical System.  Although the ZEUS system was approved in Europe, the U.S. Food and Drug Administration had not yet approved it for any procedure at the time that the FDA first approved the da Vinci system.  The uncertainty created by the litigation between the companies was a drag on each company's growth. In 2003, Intuitive Surgical and Computer Motion agreed to merge, thus ending the litigation between them.  The ZEUS system was ultimately phased out in favor of the da Vinci system. Computer Motion was led by Chairman Robert Duggan from 1990 until 2003, when the two companies merged.\nBefore the buyout of Computer Motion, the stock of Intuitive was selling at around $14 per share, adjusted for stock splits. After the merger, the stock price rose significantly (and by 2015 it was at about $500), primarily because of the growth in systems sold (60 in 2002 compared with 431 in 2014) and the number of surgical procedures performed (less than 1,000 in 2002 compared with 540,000 in 2014).\n\nFinances\nFor the fiscal year 2017, Intuitive Surgical reported earnings of US$660 million, with an annual revenue of US$3.129 billion, an increase of 15.7% over the previous fiscal cycle. Intuitive Surgical's shares traded at over $307 per share, and its market capitalization was valued at over US$58 billion in November 2018.\n\nda Vinci Surgical System\nThe da Vinci Surgical System is a robotic surgical system. The system is controlled by a surgeon from a console. \nThis minimally invasive surgical approach is commonly used for prostatectomies and increasingly for cardiac valve repair and gynaecologic surgical procedures. \nA da Vinci Surgical System costs approximately $1.5 million. The da Vinci SI released in April 2009 cost about $1.75 million. In addition, there are maintenance contracts plus expenditures for instruments used during surgery. In 2008, The New York Times reported that most hospitals and clinics have a hard time recovering the cost of the robot.\n\nLawsuits\nIn June 2018, Intuitive Surgical settled class action suits of its shareholders for a payment of $43 million. Originally filed in 2013, shareholders alleged Intuitive Surgical failed to report injuries related to their da Vinci robot, thus violating federal security laws. \nIn 2021, Intuitive was sued for alleged abuse of its monopolist position. Specifically, replacement part manufacturer Rebotix Repair accused Intuitive of anticompetitive behavior in the robots' aftermarket business and overcharging of hospitals for replacement parts. The initiative was followed up by a wave of similar class-action lawsuits shortly afterwards, including those filed by Kaleida Health and Franciscan Health. In August of 2022, Rebotix v. Intuitive settled out of court shortly before trial was set to begin.\nSultzer v. Intuitive Surgical, Inc. involved a claim against Intuitive that a defect in its da Vinci surgical robot allowed electricity to arc through a patient's spine, resulting in her death. Intuitive was represented by Bradley Arant Boult Cummings. On July 12, 2024, the plaintiff agreed to drop the case.\n\nReferences\nExternal links\n\nOfficial website\nIntuitive Surgical Product Recalls by FDA\nBusiness data for Intuitive Surgical, Inc.:",
  "clean_text": "Intuitive Surgical, Inc. is an American biotechnology company that develops, manufactures, and markets robotic products designed to improve clinical outcomes of patients through minimally invasive surgery, most notably with the da Vinci Surgical System. The company is part of the Nasdaq-100, S&P 100 and S&P 500. As of 31 December 2021, Intuitive Surgical had an installed base of 6,730 da Vinci Surgical Systems, including 4,139 in the U.S., 1,199 in Europe, 1,050 in Asia, and 342 in the rest of the world. Intuitive Surgical made its debut on the Fortune 500 list in 2024, ranking #497. History The research that eventually led to the development of the da Vinci Surgical System was performed in the late 1980s by Ajit Shah and Gary Guthart at research institute SRI International. In 1990, SRI received funding from the National Institutes of Health. SRI developed a prototype robotic surgical system that caught the interest of the Defense Advanced Research Projects Agency (DARPA), which was interested in the system for its potential to allow surgeons to operate remotely on soldiers wounded on the battlefield. In 1994, Dr. Frederic Moll became interested in the SRI System, as the device was known at the time. At the time, Moll was employed by Guidant. He tried to interest Guidant in backing it but to no avail. In 1995 Moll was introduced to John Freund who had recently left Acuson Corporation. Freund negotiated an option to acquire SRI's intellectual property and incorporated a new company that he named Intuitive Surgical Devices, Inc. At that point Freund, Moll, and Robert Younge (also from Acuson) wrote the business plan for the company and raised its initial venture capital. Early investors included the Mayfield Fund, Sierra Ventures, and Morgan Stanley. The company refined the SRI System into a prototype known originally as \"Lenny\" (after Leonardo da Vinci), which was ready for testing in 1997. As the company's prototypes became more advanced, they were named using da Vinci themes. One was named \"Leonardo\", and another was \"Mona\". The final version of the prototype was nicknamed the da Vinci Surgical System, and the name stuck when the system was eventually commercialized. After further testing, Intuitive Surgical began marketing this system in Europe in 1999, while awaiting FDA approval in the United States. The company raised $46 million in an initial public offering in 2000. That same year, the FDA approved use of the da Vinci Surgical System for general laparoscopic surgery, which can be used to address gallbladder disease and gastroesophageal disease. In 2001, the FDA approved use of the system for prostate surgery. The FDA has subsequently approved the system for thoracoscopic surgery, cardiac procedures performed with adjunctive incisions, and gynecologic procedures. Shortly before going public, Intuitive Surgical was sued for patent infringement by Computer Motion, Inc, its chief rival. Computer Motion had actually gotten into the robotic surgery field earlier than Intuitive Surgical, with its own system, the ZEUS Robotic Surgical System. Although the ZEUS system was approved in Europe, the U.S. Food and Drug Administration had not yet approved it for any procedure at the time that the FDA first approved the da Vinci system. The uncertainty created by the litigation between the companies was a drag on each company's growth. In 2003, Intuitive Surgical and Computer Motion agreed to merge, thus ending the litigation between them. The ZEUS system was ultimately phased out in favor of the da Vinci system. Computer Motion was led by Chairman Robert Duggan from 1990 until 2003, when the two companies merged. Before the buyout of Computer Motion, the stock of Intuitive was selling at around $14 per share, adjusted for stock splits. After the merger, the stock price rose significantly (and by 2015 it was at about $500), primarily because of the growth in systems sold (60 in 2002 compared with 431 in 2014) and the number of surgical procedures performed (less than 1,000 in 2002 compared with 540,000 in 2014). Finances For the fiscal year 2017, Intuitive Surgical reported earnings of US$660 million, with an annual revenue of US$3.129 billion, an increase of 15.7% over the previous fiscal cycle. Intuitive Surgical's shares traded at over $307 per share, and its market capitalization was valued at over US$58 billion in November 2018. da Vinci Surgical System The da Vinci Surgical System is a robotic surgical system. The system is controlled by a surgeon from a console. This minimally invasive surgical approach is commonly used for prostatectomies and increasingly for cardiac valve repair and gynaecologic surgical procedures. A da Vinci Surgical System costs approximately $1.5 million. The da Vinci SI released in April 2009 cost about $1.75 million. In addition, there are maintenance contracts plus expenditures for instruments used during surgery. In 2008, The New York Times reported that most hospitals and clinics have a hard time recovering the cost of the robot. Lawsuits In June 2018, Intuitive Surgical settled class action suits of its shareholders for a payment of $43 million. Originally filed in 2013, shareholders alleged Intuitive Surgical failed to report injuries related to their da Vinci robot, thus violating federal security laws. In 2021, Intuitive was sued for alleged abuse of its monopolist position. Specifically, replacement part manufacturer Rebotix Repair accused Intuitive of anticompetitive behavior in the robots' aftermarket business and overcharging of hospitals for replacement parts. The initiative was followed up by a wave of similar class-action lawsuits shortly afterwards, including those filed by Kaleida Health and Franciscan Health. In August of 2022, Rebotix v. Intuitive settled out of court shortly before trial was set to begin. Sultzer v. Intuitive Surgical, Inc. involved a claim against Intuitive that a defect in its da Vinci surgical robot allowed electricity to arc through a patient's spine, resulting in her death. Intuitive was represented by Bradley Arant Boult Cummings. On July 12, 2024, the plaintiff agreed to drop the case."
}