{
  "ticker": "IT",
  "cik": "0000749251",
  "company_name": "Gartner",
  "corrected_name": "Gartner",
  "wiki_title_used": "Gartner",
  "exists": true,
  "raw_text": "Gartner, Inc. is an American research and advisory firm focusing on business and technology topics. Gartner provides its products and services through research reports, conferences, and consulting. Its clients include large corporations, government agencies, technology companies, and investment firms.\n\nOperations\nGartner is a research and advisory firm with three business segments: research, conferences, and consulting. As of December 2024, Gartner has over 21,000 employees globally and operates in 90 countries and territories. It is headquartered in Stamford, Connecticut. Gene A. Hall is the chief executive officer.\nGartner is a publicly traded company listed on the S&P 500.\n\nHistory\n1980s\nGideon Gartner  and David Stein founded Gartner, Inc. in 1979 to provide IT industry research and analysis to businesses buying and selling computer hardware. Gideon Gartner had previously worked at IBM, and his new firm specialized in information about IBM and its products.\nGartner's reports were often delivered as a one-pager containing only high-level insights. Gartner analysts developed the Magic Quadrant visual framework of placing companies within defined market quadrants during the early 1980s and began to integrate the methodology into their presentations and later reports. By 1983, the firm employed 80 research analysts and generated $8 million in revenue.\nIn 1985, Gartner's brokerage and investment division separated from the firm to become a wholly owned subsidiary called Gartner Securities. Two years later, the name was changed to SoundView Financial Group, which eventually operated as SoundView Technology Group.\nIn July 1986, Gartner rebranded as Gartner Group and became a publicly traded company. In January 1987, Gartner Group acquired another technology research firm, the Cupertino-based Infocorp. That same year Gartner reported $25 million in sales and $1.9 million in earnings.\nThe U.K.-based Saatchi & Saatchi acquired Gartner Group in 1988.\n\n1990s\nIn 1990, Gartner Group was taken private by Gideon Gartner and other executives in an acquisition deal backed by funding from Bain Capital and Dun & Bradstreet, then a Bain client. Under Bain ownership, Gartner refocused on IT industry pricing data and expanded its profit margins from 10 percent to 30 percent. Dun & Bradstreet acquired a majority share in Gartner in 1993.\nGartner went public again in October 1993, with Dun & Bradstreet maintaining a 50 percent stake.\nOver the next eight years, Gartner acquired or made substantial investments in 30 companies, including the market research firm Dataquest and the online news outlet TechRepublic. The deals were part of a diversification strategy that coincided with the dot-com bubble, and Gartner acknowledged that it struggled to integrate these new companies into its operations. Gartner sold TechRepublic to CNET only a year after acquiring the company.\nIn 1995, Gartner introduced its hype cycle framework, which purported to show how emerging technology is applied and adopted over a typical life cycle.\n\n2000s–present\nIn August 2004, Gene A. Hall became Gartner's new CEO, replacing Michael D. Fleisher. Hall previously worked with the consulting firm McKinsey & Company before managing a division at Automatic Data Processing.\nIn 2008, Gartner reached $1.3 billion in revenues and achieved 40 percent of the IT research market.\nIn 2009, Gartner acquired AMR Research, a Boston-based research and advisory firm focused on supply chain management. The acquisition of AMR and direct competitors like META Group and the Burton Group allowed Gartner to expand its global operations and product and service offerings.\nIn March 2014, Gartner announced that it had acquired the privately held company Software Advice for an undisclosed amount. Also in 2014, Gartner coined the term \"Digital BizOps\" and further developed the early philosophy for digital business operations. In July 2015, Gartner acquired Nubera, the business app discovery network that owns properties like GetApp (a peer review site), AppStorm, AppAppeal, and CloudWork. Terms of the deal were not disclosed. In September 2015, it acquired the privately held peer review site (PRS) Capterra.\nIn June 2016, Gartner announced that it had acquired the privately held company SCM World, headquartered in London. In 2017, Gartner acquired CEB, an Arlington-based talent management and operations consulting firm, for $2.6 billion. The deal included $700 million in CEB debt. Two months later, Gartner further expanded its marketing offerings with the acquisition of Scott Galloway's digital benchmarking firm L2.\nOn May 26, 2023 the Securities and Exchange Commission (SEC) settled charges against Gartner for violating the Foreign Corrupt Practices Act (FCPA). The SEC asserted that from approximately December 2014 through August 2015 Gartner had a corrupt relationship with a South African company with close ties to the South African government, which Gartner knew would result in official bribery. In the settlement, the SEC ordered Gartner to stop violating the FCPA and Gartner agreed to pay $2,456,764. The SEC made note that Gartner was open and cooperative.\n\nSee also\nGartner hype cycle, a graphical presentation developed by Gartner\nMagic Quadrant, a market research report type published by Gartner\nSoundView Technology Group, founded as a financial service for Gartner\n\nReferences\nExternal links\nOfficial website\nBusiness data for Gartner, Inc.:",
  "clean_text": "Gartner, Inc. is an American research and advisory firm focusing on business and technology topics. Gartner provides its products and services through research reports, conferences, and consulting. Its clients include large corporations, government agencies, technology companies, and investment firms. Operations Gartner is a research and advisory firm with three business segments: research, conferences, and consulting. As of December 2024, Gartner has over 21,000 employees globally and operates in 90 countries and territories. It is headquartered in Stamford, Connecticut. Gene A. Hall is the chief executive officer. Gartner is a publicly traded company listed on the S&P 500. History 1980s Gideon Gartner and David Stein founded Gartner, Inc. in 1979 to provide IT industry research and analysis to businesses buying and selling computer hardware. Gideon Gartner had previously worked at IBM, and his new firm specialized in information about IBM and its products. Gartner's reports were often delivered as a one-pager containing only high-level insights. Gartner analysts developed the Magic Quadrant visual framework of placing companies within defined market quadrants during the early 1980s and began to integrate the methodology into their presentations and later reports. By 1983, the firm employed 80 research analysts and generated $8 million in revenue. In 1985, Gartner's brokerage and investment division separated from the firm to become a wholly owned subsidiary called Gartner Securities. Two years later, the name was changed to SoundView Financial Group, which eventually operated as SoundView Technology Group. In July 1986, Gartner rebranded as Gartner Group and became a publicly traded company. In January 1987, Gartner Group acquired another technology research firm, the Cupertino-based Infocorp. That same year Gartner reported $25 million in sales and $1.9 million in earnings. The U.K.-based Saatchi & Saatchi acquired Gartner Group in 1988. 1990s In 1990, Gartner Group was taken private by Gideon Gartner and other executives in an acquisition deal backed by funding from Bain Capital and Dun & Bradstreet, then a Bain client. Under Bain ownership, Gartner refocused on IT industry pricing data and expanded its profit margins from 10 percent to 30 percent. Dun & Bradstreet acquired a majority share in Gartner in 1993. Gartner went public again in October 1993, with Dun & Bradstreet maintaining a 50 percent stake. Over the next eight years, Gartner acquired or made substantial investments in 30 companies, including the market research firm Dataquest and the online news outlet TechRepublic. The deals were part of a diversification strategy that coincided with the dot-com bubble, and Gartner acknowledged that it struggled to integrate these new companies into its operations. Gartner sold TechRepublic to CNET only a year after acquiring the company. In 1995, Gartner introduced its hype cycle framework, which purported to show how emerging technology is applied and adopted over a typical life cycle. 2000s–present In August 2004, Gene A. Hall became Gartner's new CEO, replacing Michael D. Fleisher. Hall previously worked with the consulting firm McKinsey & Company before managing a division at Automatic Data Processing. In 2008, Gartner reached $1.3 billion in revenues and achieved 40 percent of the IT research market. In 2009, Gartner acquired AMR Research, a Boston-based research and advisory firm focused on supply chain management. The acquisition of AMR and direct competitors like META Group and the Burton Group allowed Gartner to expand its global operations and product and service offerings. In March 2014, Gartner announced that it had acquired the privately held company Software Advice for an undisclosed amount. Also in 2014, Gartner coined the term \"Digital BizOps\" and further developed the early philosophy for digital business operations. In July 2015, Gartner acquired Nubera, the business app discovery network that owns properties like GetApp (a peer review site), AppStorm, AppAppeal, and CloudWork. Terms of the deal were not disclosed. In September 2015, it acquired the privately held peer review site (PRS) Capterra. In June 2016, Gartner announced that it had acquired the privately held company SCM World, headquartered in London. In 2017, Gartner acquired CEB, an Arlington-based talent management and operations consulting firm, for $2.6 billion. The deal included $700 million in CEB debt. Two months later, Gartner further expanded its marketing offerings with the acquisition of Scott Galloway's digital benchmarking firm L2. On May 26, 2023 the Securities and Exchange Commission (SEC) settled charges against Gartner for violating the Foreign Corrupt Practices Act (FCPA). The SEC asserted that from approximately December 2014 through August 2015 Gartner had a corrupt relationship with a South African company with close ties to the South African government, which Gartner knew would result in official bribery. In the settlement, the SEC ordered Gartner to stop violating the FCPA and Gartner agreed to pay $2,456,764. The SEC made note that Gartner was open and cooperative."
}