{
  "ticker": "ITW",
  "cik": "0000049826",
  "company_name": "Illinois Tool Works",
  "corrected_name": "Illinois Tool Works",
  "wiki_title_used": "Illinois Tool Works",
  "exists": true,
  "raw_text": "Illinois Tool Works Inc. (ITW) is an American Fortune 500 company that produces engineered fasteners and components, equipment and consumable systems, and specialty products. It was founded in 1912 by Byron L. Smith and has built its growth on a \"small-wins strategy\" based on decentralization, simplicity, customer-focused innovation, and acquisitions.\nAs of 2024, ITW employed 44,000 employees in 51 countries and held 20,900 granted and pending patent applications worldwide. The company is based in Glenview, Illinois, a suburb of Chicago.\n\nWynn's\nWynn's International was begun by a 70-year-old retired attorney, Chestein Wynn, in a garage in San Gabriel, California, making a product to reduce friction in engines. On May 28, 1947 , Carl Wynn incorporated Wynn Oil Company at 1222 Duarte Road, San Gabriel, California\n\nITW subsidiaries\nITW comprises a number of subsidiaries. Notable brands include Hobart, Miller Electric, Paslode, Foster Refrigerator, Brooks Instrument, and Permatex adhesives. In August 2018, U.S. Tax Court Judge Albert G. Lauber determined that ITW owed no tax on over $356 million in repatriated funds from its foreign subsidiaries because the transactions had been sufficiently structured as debt.\n\nIllegal exports\nThe United States Department of Commerce imposed a $142,000 civil penalty on Illinois Tool Works in 2000, to settle allegations that the company illegally exported chemicals to Brazil on seven occasions between March 1994 and October 1997 without the required licenses and making false or misleading statements on Shipper's Export Declarations. Illinois Tool Works agreed to pay the penalty. $37,000 was suspended as part of the settlement. The chemicals exported can be used for commercial purposes and in the making of chemical weapons as well.\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Illinois Tool Works:",
  "clean_text": "Illinois Tool Works Inc. (ITW) is an American Fortune 500 company that produces engineered fasteners and components, equipment and consumable systems, and specialty products. It was founded in 1912 by Byron L. Smith and has built its growth on a \"small-wins strategy\" based on decentralization, simplicity, customer-focused innovation, and acquisitions. As of 2024, ITW employed 44,000 employees in 51 countries and held 20,900 granted and pending patent applications worldwide. The company is based in Glenview, Illinois, a suburb of Chicago. Wynn's Wynn's International was begun by a 70-year-old retired attorney, Chestein Wynn, in a garage in San Gabriel, California, making a product to reduce friction in engines. On May 28, 1947 , Carl Wynn incorporated Wynn Oil Company at 1222 Duarte Road, San Gabriel, California ITW subsidiaries ITW comprises a number of subsidiaries. Notable brands include Hobart, Miller Electric, Paslode, Foster Refrigerator, Brooks Instrument, and Permatex adhesives. In August 2018, U.S. Tax Court Judge Albert G. Lauber determined that ITW owed no tax on over $356 million in repatriated funds from its foreign subsidiaries because the transactions had been sufficiently structured as debt. Illegal exports The United States Department of Commerce imposed a $142,000 civil penalty on Illinois Tool Works in 2000, to settle allegations that the company illegally exported chemicals to Brazil on seven occasions between March 1994 and October 1997 without the required licenses and making false or misleading statements on Shipper's Export Declarations. Illinois Tool Works agreed to pay the penalty. $37,000 was suspended as part of the settlement. The chemicals exported can be used for commercial purposes and in the making of chemical weapons as well."
}