{
  "ticker": "IVZ",
  "cik": "0000914208",
  "company_name": "Invesco",
  "corrected_name": "Invesco",
  "wiki_title_used": "Invesco",
  "exists": true,
  "raw_text": "Invesco Ltd. is an American (formerly British) independent investment management company headquartered in Atlanta, Georgia, with branch offices in 20 countries. Its common stock is a constituent of the S&P 500 and trades on the New York Stock Exchange. Invesco operates under the Invesco, Invesco Perpetual, and Powershares brand names.\n\nHistory\nInvesco (then officially spelled with all-capital letters: INVESCO) was founded in Atlanta in 1978 when Citizens & Southern National Bank divested its money management operations. In 1988, the company was purchased by the British firm Britannia Arrow, based in London, which later took the INVESCO name. In 1997 INVESCO PLC merged with AIM Investments. Upon completion of the merger the company adopted the name Amvescap. In 2007 the company reverted to the Invesco name.\nSince 2000, Invesco has grown through acquisitions such as the ETF firm PowerShares Capital Management and the restructuring of WL Ross & Co.\nIn 2004, the company agreed to a $450 million settlement with the Attorneys General of New York, Colorado and the SEC after allegations of improper trading practices.\nIn May 2007, the company changed their name to Invesco (initial cap only) PLC, moved its primary stock market listing from the London Stock Exchange to the American NYSE and became domiciled in Bermuda, adopting the name Invesco Ltd. As a result, the company's shares were withdrawn from the FTSE 100 Index and added to the Russell 1000 Index. In November 2007, Invesco moved its headquarters from London to Atlanta.\nInvesco planned to list the PowerShares Global Progressive Transportation Portfolio (PTRP on the Nasdaq Stock Market). This fund was closed in 2010.\nOn October 19, 2009, Invesco bought Morgan Stanley's Retail Unit, including Van Kampen Investments for $1.5 billion.\nIn April 2010, Invesco Aim became Invesco. Later that year, it was reported that Invesco had plans to introduce a Risk parity commodity fund according to regulatory filings.\nIn December 2013, Invesco reported assets under management (AUM) of $778.7 billion\nIn September 2017, Invesco agreed to buy Guggenheim Investment's exchange-traded fund business for $1.2 billion in cash.\nOn October 18, 2018, Invesco purchased OppenheimerFunds from MassMutual for about $5.7 billion in stock.\nIn March 2020, amid a major stock market crash triggered by the COVID-19 pandemic, Invesco Mortgage Capital Inc., a branch handling real estate investment trusts, announced they were unable to cover margin calls due to dramatic devaluations and investors selling shares.\nIn February 2025, a group of 17 U.S. state attorneys general criticized Invesco for making improper or inadequate disclosures about investments in China.\n\nFinancial statistics\nReferences\nExternal links\nInvesco Official website\nBusiness data for Invesco:",
  "clean_text": "Invesco Ltd. is an American (formerly British) independent investment management company headquartered in Atlanta, Georgia, with branch offices in 20 countries. Its common stock is a constituent of the S&P 500 and trades on the New York Stock Exchange. Invesco operates under the Invesco, Invesco Perpetual, and Powershares brand names. History Invesco (then officially spelled with all-capital letters: INVESCO) was founded in Atlanta in 1978 when Citizens & Southern National Bank divested its money management operations. In 1988, the company was purchased by the British firm Britannia Arrow, based in London, which later took the INVESCO name. In 1997 INVESCO PLC merged with AIM Investments. Upon completion of the merger the company adopted the name Amvescap. In 2007 the company reverted to the Invesco name. Since 2000, Invesco has grown through acquisitions such as the ETF firm PowerShares Capital Management and the restructuring of WL Ross & Co. In 2004, the company agreed to a $450 million settlement with the Attorneys General of New York, Colorado and the SEC after allegations of improper trading practices. In May 2007, the company changed their name to Invesco (initial cap only) PLC, moved its primary stock market listing from the London Stock Exchange to the American NYSE and became domiciled in Bermuda, adopting the name Invesco Ltd. As a result, the company's shares were withdrawn from the FTSE 100 Index and added to the Russell 1000 Index. In November 2007, Invesco moved its headquarters from London to Atlanta. Invesco planned to list the PowerShares Global Progressive Transportation Portfolio (PTRP on the Nasdaq Stock Market). This fund was closed in 2010. On October 19, 2009, Invesco bought Morgan Stanley's Retail Unit, including Van Kampen Investments for $1.5 billion. In April 2010, Invesco Aim became Invesco. Later that year, it was reported that Invesco had plans to introduce a Risk parity commodity fund according to regulatory filings. In December 2013, Invesco reported assets under management (AUM) of $778.7 billion In September 2017, Invesco agreed to buy Guggenheim Investment's exchange-traded fund business for $1.2 billion in cash. On October 18, 2018, Invesco purchased OppenheimerFunds from MassMutual for about $5.7 billion in stock. In March 2020, amid a major stock market crash triggered by the COVID-19 pandemic, Invesco Mortgage Capital Inc., a branch handling real estate investment trusts, announced they were unable to cover margin calls due to dramatic devaluations and investors selling shares. In February 2025, a group of 17 U.S. state attorneys general criticized Invesco for making improper or inadequate disclosures about investments in China. Financial statistics"
}