{
  "ticker": "J",
  "cik": "0000052988",
  "company_name": "Jacobs Solutions",
  "corrected_name": "Jacobs Solutions",
  "wiki_title_used": "Jacobs Solutions",
  "exists": true,
  "raw_text": "Jacobs Solutions Inc. is an American international technical professional services firm based in Dallas. The company provides engineering, technical, professional, and construction services as well as scientific and specialty consulting for a broad range of clients globally, including companies, organizations, and government agencies. Jacobs has consistently ranked No. 1 on both Engineering News-Record (ENR)'s 2018, 2019, 2020, 2021, 2022, and 2023 Top 500 Design Firms and Trenchless Technology’s 2018, 2019, 2020, and 2021 Top 50 Trenchless Engineering Firms. Its worldwide annual revenue were over $12 billion in the 2025 fiscal year, and earnings dropped to $289 million.\n\nOverview\nJacobs Engineering was founded in 1947, by Joseph J. Jacobs. The company's chief executive officer is Bob Pragada. He has been the CEO since January 2023. Steve Demetriou, the CEO from 2015 to 2023, now serves as the executive chair. The previous president and CEO was Craig L. Martin from 2006 until 2014.\nThe company is publicly traded as a Fortune 500 company. As of September 2018, Jacobs had more than 80,800 employees globally, and more than 400 offices in North America, South America, Europe, the Middle East, Australia, Africa, and Asia. In October 2016, the company moved its headquarters from Pasadena, California to Dallas.\nOn August 9, 2017, the Pentagon awarded a $4.6 billion Integrated Research & Development for Enterprise Solutions (IRES) follow-on contract to Jacobs Technology Inc, a unit of Jacobs Engineering Group Inc. to provide products and services for the Missile Defense Agency and its Missile Defense Integration and Operations Center. In October 2018, Jacobs agreed to sell its Energy, Chemicals and Resources (ECR) segment to WorleyParsons, a company in North Sydney, Australia. In April 2021, the Institute on Taxation and Economic Policy listed the top 55 corporations which paid $0 in taxes for the year 2020. Jacobs' federal income taxes for that year were negative $37 million dollars for an effective tax rate of −17.4%.\nAs of 2023, the company forms part of the Dow Jones Sustainability Indices. In 2024, Jacobs spun-off its Critical Mission Solutions and Cyber and Intelligence Government Services businesses which merged with privately held Amentum Government Services Holding LLC to create a new, publicly traded company, Amentum.\n\nAcquisitions\nOn December 10, 1998, it was announced that Jacobs would acquire closely held engineering firm, Sverdrup Corporation for $200 million. In 2001, Jacobs acquired the international operations, including the international consultancy Sir Alexander Gibb & Partners (Gibb Ltd) based in the UK, from Law Engineering and Environmental Services in Atlanta.\nIn FY 2007, Jacobs acquired the privately held planning, engineering and design firm, Edwards and Kelcey of Morristown, New Jersey for an undisclosed amount. In FY 2008, Jacobs spent $264 million to acquire Carter and Burgess, Lindsey Engineering and a 60% stake in Zamel and Turbag Consulting Engineers. In FY 2010, Jacobs acquired TechTeam, Tybrin, and Jordan, Jones and Goulding. They paid $259.5 million for the three companies.\nIn FY 2014, Jacobs announced it completed a merger transaction with Sinclair Knight Merz (SKM), a 6,900-person professional services firm headquartered in Sydney. The purchase price was an enterprise value of AUS$1.2 billion (US$1.1 billion) plus adjustments for cash, debt and other items. On August 2, 2017, Jacobs acquired CH2M based in Englewood, Colorado– an engineering firm in infrastructure and government service sectors, including water, transportation, environmental and nuclear, in a $3.27 billion cash-and-stock deal.\nIn March 2020, Jacobs acquired Wood Nuclear, the nuclear services arm of John Wood Group of the UK, for £250 million, adding 2000 staff. Jacobs' total UK workforce was now almost 11,000. In December 2020, Jacobs announced it would be investing in PA Consulting based in London, in a deal valued at £1.825 billion. Completion of the deal was expected to take place by the end of Q1 2021. On February 7, 2022, Jacobs announced that it would enter into a joint venture with the Qatar based entity Locus Engineering Management and Services Co. W.L.L, an Asset Management company with interests in building maintenance, infrastructure, oil and gas support services, and engineering. The terms of the venture were not disclosed.\n\nControversies\nKingston coal ash cleanup\nThe Kingston Fossil Plant coal fly ash slurry spill was an environmental and industrial disaster which occurred on Monday December 22, 2008, when a dike ruptured at a coal ash pond at the Tennessee Valley Authority's Kingston Fossil Plant in Harriman, Tennessee releasing 1.1 billion U.S. gallons (4.2 million cubic meters) of coal fly ash slurry. The Tennessee Valley Authority hired Jacobs Engineering to clean up the spill. In the years after the spill at the cleanup site, a number of workers suffered health effects.\nAs early as 2012, workers began to report illnesses which they believed were caused by the cleanup, and by the ten year anniversary of the event, hundreds of workers had been sickened and more than 30 had died. In May 2023, it was reported that more than 50 workers had died and 150 were sick. In 2013, 50 workers and their families filed a lawsuit against contractor Jacobs Engineering. They were represented by Knoxville lawyer James K. Scott and the lawsuit was dismissed by judge Thomas A. Varlan, chief justice for the U.S. District Court for the Eastern District of Tennessee in 2014. This ruling was reversed by the U.S. Court of Appeals for the Sixth Circuit after evidence was discovered that Jacobs Engineering had misled the workers about the dangers of coal ash.\nA federal jury ruled in favor of the workers seeking compensation in November 2018. The ruling held that Jacobs Engineering had failed to keep the workers safe from environmental hazards, and had misled them about the dangers of coal ash, mainly by claiming that extra protective equipment, such as masks and protective clothing, was unnecessary. In a phase two of the trial, the Kingston cleanup workers will be able to seek damages. In April 2020, 52 workers rejected a $10 million settlement offered by Jacobs Engineering.\n\nHinkley Point\nJacobs Engineering is building the Hinkley Point C nuclear reactor, controversial for the reason of its excessive delays and cost overruns. “It’s three times over cost and three times over time where it’s been built in Finland and France,” said Paul Dorfman of UCL (University College London) Energy Institute. The companies involved have been accused of a conflict of interest as the company advising the UK about cost management was owned by Jacobs Engineering, while Jacobs was working for the company managing an Électricité de France project. Thus, a subsidiary of a company hired by EDF was advising the UK how much money to grant EDF.\n\nWoonsocket Regional Wastewater Treatment Facility\nThe Rhode Island Department of Environmental Management is investigating the WRWTF plant, which is run by Jacobs, for spillage of an estimated 10 million gallons of wastewater with incomplete treatment into the Blackstone River in June 2022. Previous investigations resulted in letters of noncompliance given to Jacobs in 2021 and 2020.\n\nSee also\nTop 100 Contractors of the U.S. federal government\n\nReferences\nExternal links\nOfficial website\nBusiness data for Jacobs Solutions Inc.:",
  "clean_text": "Jacobs Solutions Inc. is an American international technical professional services firm based in Dallas. The company provides engineering, technical, professional, and construction services as well as scientific and specialty consulting for a broad range of clients globally, including companies, organizations, and government agencies. Jacobs has consistently ranked No. 1 on both Engineering News-Record (ENR)'s 2018, 2019, 2020, 2021, 2022, and 2023 Top 500 Design Firms and Trenchless Technology’s 2018, 2019, 2020, and 2021 Top 50 Trenchless Engineering Firms. Its worldwide annual revenue were over $12 billion in the 2025 fiscal year, and earnings dropped to $289 million. Overview Jacobs Engineering was founded in 1947, by Joseph J. Jacobs. The company's chief executive officer is Bob Pragada. He has been the CEO since January 2023. Steve Demetriou, the CEO from 2015 to 2023, now serves as the executive chair. The previous president and CEO was Craig L. Martin from 2006 until 2014. The company is publicly traded as a Fortune 500 company. As of September 2018, Jacobs had more than 80,800 employees globally, and more than 400 offices in North America, South America, Europe, the Middle East, Australia, Africa, and Asia. In October 2016, the company moved its headquarters from Pasadena, California to Dallas. On August 9, 2017, the Pentagon awarded a $4.6 billion Integrated Research & Development for Enterprise Solutions (IRES) follow-on contract to Jacobs Technology Inc, a unit of Jacobs Engineering Group Inc. to provide products and services for the Missile Defense Agency and its Missile Defense Integration and Operations Center. In October 2018, Jacobs agreed to sell its Energy, Chemicals and Resources (ECR) segment to WorleyParsons, a company in North Sydney, Australia. In April 2021, the Institute on Taxation and Economic Policy listed the top 55 corporations which paid $0 in taxes for the year 2020. Jacobs' federal income taxes for that year were negative $37 million dollars for an effective tax rate of −17.4%. As of 2023, the company forms part of the Dow Jones Sustainability Indices. In 2024, Jacobs spun-off its Critical Mission Solutions and Cyber and Intelligence Government Services businesses which merged with privately held Amentum Government Services Holding LLC to create a new, publicly traded company, Amentum. Acquisitions On December 10, 1998, it was announced that Jacobs would acquire closely held engineering firm, Sverdrup Corporation for $200 million. In 2001, Jacobs acquired the international operations, including the international consultancy Sir Alexander Gibb & Partners (Gibb Ltd) based in the UK, from Law Engineering and Environmental Services in Atlanta. In FY 2007, Jacobs acquired the privately held planning, engineering and design firm, Edwards and Kelcey of Morristown, New Jersey for an undisclosed amount. In FY 2008, Jacobs spent $264 million to acquire Carter and Burgess, Lindsey Engineering and a 60% stake in Zamel and Turbag Consulting Engineers. In FY 2010, Jacobs acquired TechTeam, Tybrin, and Jordan, Jones and Goulding. They paid $259.5 million for the three companies. In FY 2014, Jacobs announced it completed a merger transaction with Sinclair Knight Merz (SKM), a 6,900-person professional services firm headquartered in Sydney. The purchase price was an enterprise value of AUS$1.2 billion (US$1.1 billion) plus adjustments for cash, debt and other items. On August 2, 2017, Jacobs acquired CH2M based in Englewood, Colorado– an engineering firm in infrastructure and government service sectors, including water, transportation, environmental and nuclear, in a $3.27 billion cash-and-stock deal. In March 2020, Jacobs acquired Wood Nuclear, the nuclear services arm of John Wood Group of the UK, for £250 million, adding 2000 staff. Jacobs' total UK workforce was now almost 11,000. In December 2020, Jacobs announced it would be investing in PA Consulting based in London, in a deal valued at £1.825 billion. Completion of the deal was expected to take place by the end of Q1 2021. On February 7, 2022, Jacobs announced that it would enter into a joint venture with the Qatar based entity Locus Engineering Management and Services Co. W.L.L, an Asset Management company with interests in building maintenance, infrastructure, oil and gas support services, and engineering. The terms of the venture were not disclosed. Controversies Kingston coal ash cleanup The Kingston Fossil Plant coal fly ash slurry spill was an environmental and industrial disaster which occurred on Monday December 22, 2008, when a dike ruptured at a coal ash pond at the Tennessee Valley Authority's Kingston Fossil Plant in Harriman, Tennessee releasing 1.1 billion U.S. gallons (4.2 million cubic meters) of coal fly ash slurry. The Tennessee Valley Authority hired Jacobs Engineering to clean up the spill. In the years after the spill at the cleanup site, a number of workers suffered health effects. As early as 2012, workers began to report illnesses which they believed were caused by the cleanup, and by the ten year anniversary of the event, hundreds of workers had been sickened and more than 30 had died. In May 2023, it was reported that more than 50 workers had died and 150 were sick. In 2013, 50 workers and their families filed a lawsuit against contractor Jacobs Engineering. They were represented by Knoxville lawyer James K. Scott and the lawsuit was dismissed by judge Thomas A. Varlan, chief justice for the U.S. District Court for the Eastern District of Tennessee in 2014. This ruling was reversed by the U.S. Court of Appeals for the Sixth Circuit after evidence was discovered that Jacobs Engineering had misled the workers about the dangers of coal ash. A federal jury ruled in favor of the workers seeking compensation in November 2018. The ruling held that Jacobs Engineering had failed to keep the workers safe from environmental hazards, and had misled them about the dangers of coal ash, mainly by claiming that extra protective equipment, such as masks and protective clothing, was unnecessary. In a phase two of the trial, the Kingston cleanup workers will be able to seek damages. In April 2020, 52 workers rejected a $10 million settlement offered by Jacobs Engineering. Hinkley Point Jacobs Engineering is building the Hinkley Point C nuclear reactor, controversial for the reason of its excessive delays and cost overruns. “It’s three times over cost and three times over time where it’s been built in Finland and France,” said Paul Dorfman of UCL (University College London) Energy Institute. The companies involved have been accused of a conflict of interest as the company advising the UK about cost management was owned by Jacobs Engineering, while Jacobs was working for the company managing an Électricité de France project. Thus, a subsidiary of a company hired by EDF was advising the UK how much money to grant EDF. Woonsocket Regional Wastewater Treatment Facility The Rhode Island Department of Environmental Management is investigating the WRWTF plant, which is run by Jacobs, for spillage of an estimated 10 million gallons of wastewater with incomplete treatment into the Blackstone River in June 2022. Previous investigations resulted in letters of noncompliance given to Jacobs in 2021 and 2020."
}