{
  "ticker": "JBHT",
  "cik": "0000728535",
  "company_name": "J.B. Hunt",
  "corrected_name": "J.B. Hunt",
  "wiki_title_used": "J.B. Hunt",
  "exists": true,
  "raw_text": "J.B. Hunt Transport Services, Inc. is an American transportation and logistics company based in Lowell, Arkansas. It was founded by Johnnie Bryan Hunt and Johnelle Hunt in Arkansas on August 10, 1961. By 1983, J.B. Hunt had grown into the 80th largest trucking firm in the US, with $623.47 million in revenue. At that time J.B. Hunt operated 550 tractors, 1,049 trailers, and had roughly 1,050 employees. J.B. Hunt primarily operates semi-trailer trucks and provides transportation services throughout the continental US, Canada and Mexico. The company's fleet consists of over 12,000 trucks and 145,000 trailers and containers.\n\nHistory\nThe company was founded in 1961. By 1983, J.B. Hunt became a publicly held company and has grown into the 3rd largest trucking firm in the U.S.\nIn 1989, J.B. Hunt Transport began partnering with railroads to offer intermodal service. The initial partnership was with the Atchison, Topeka and Santa Fe Railway later part of the BNSF Railway, and has since grown to other Class I railroads including Norfolk Southern, CSX, CN, and KCS. The company's operations are distributed in four business segments (intermodal transport, contract services, logistics and truckload shipping), providing delivery services in the continental United States, Canada, and Mexico. About two-thirds of the company's revenues and profits come from intermodal.\nThe company introduced a dedicated service in 1993.\nOn February 7, 2017, J. B. Hunt became a NASDAQ-100 company.\nOn Feb 22, 2024, J.B.Hunt entered into a multi-year agreement with Wal-Mart Stores Inc. As part of this deal JBH acquired all of WM's Intermodal trailing equipment. This acquisition of roughly 15,500 trailers brings JBH's total Intermodal trailing equipment count up to 118,171 intermodal boxes. \nIn 2024, J.B. Hunt purchased 20 hydrogen trucks from Nikola Corporation.\nIn 2025, J.B. Hunt, with BNSF Railway and Mexican company GMXT, launched a service called Quantum de Mexico for rail intermodal freight deliveries between the U.S. and Mexico.\n\nPhilanthropy\nSince launching their J.B. Hunt scholarships for families program in 2022, JBH has awarded a total of $687,500 in scholarships to the families of J.B. Hunt employees. The J.B. Hunt Scholarship Program for Families is supported by Scholarship America®, an organization that works to enrich education by assisting individuals, corporations and communities with fundraising and awarding scholarships to students. J.B. Hunt plans to continue the program for a third consecutive year. \nDec 12, 2023, J.B. Hunt continued its participation in Wreaths Across America for the tenth consecutive year this week, helping ensure the delivery of more than 355,000 wreaths for the annual event remembering fallen veterans during the holiday season.\n\nCorporate responsibility\nSustainability\nThe company uses load optimization software to decrease empty miles for drivers and GHG emission, improving overall route efficiency. J.B. Hunt also reserved several Tesla electric trucks and added the first-ever, all-electric box trucks to its fleet. \nIn 2019, the company received the SmartWay Excellence Award from the U.S. Environmental Protection Agency(EPA) for the 10th consecutive year.\n\nSafety\nJ.B. Hunt added hair testing for drugs to all pre-employment tests since May 2006, in addition to Federal Motor Carrier Safety Administration (FMCSA) mandated urine testing. Hair testing can detect prior drug usage for up to 90 days. Drivers are also trained and certified in the safety training program Smith System.\nAug 14, 2024, J.B. Hunt Transportation was awarded Verisk CargoNet’s Best in Cargo Security recognition for its preventive measures, program engagement, and response preparedness to address cargo theft in real time throughout 2023.\n\nReferences\nExternal links\nOfficial website\nBusiness data for J.B. Hunt Transport Services, Inc.:",
  "clean_text": "J.B. Hunt Transport Services, Inc. is an American transportation and logistics company based in Lowell, Arkansas. It was founded by Johnnie Bryan Hunt and Johnelle Hunt in Arkansas on August 10, 1961. By 1983, J.B. Hunt had grown into the 80th largest trucking firm in the US, with $623.47 million in revenue. At that time J.B. Hunt operated 550 tractors, 1,049 trailers, and had roughly 1,050 employees. J.B. Hunt primarily operates semi-trailer trucks and provides transportation services throughout the continental US, Canada and Mexico. The company's fleet consists of over 12,000 trucks and 145,000 trailers and containers. History The company was founded in 1961. By 1983, J.B. Hunt became a publicly held company and has grown into the 3rd largest trucking firm in the U.S. In 1989, J.B. Hunt Transport began partnering with railroads to offer intermodal service. The initial partnership was with the Atchison, Topeka and Santa Fe Railway later part of the BNSF Railway, and has since grown to other Class I railroads including Norfolk Southern, CSX, CN, and KCS. The company's operations are distributed in four business segments (intermodal transport, contract services, logistics and truckload shipping), providing delivery services in the continental United States, Canada, and Mexico. About two-thirds of the company's revenues and profits come from intermodal. The company introduced a dedicated service in 1993. On February 7, 2017, J. B. Hunt became a NASDAQ-100 company. On Feb 22, 2024, J.B.Hunt entered into a multi-year agreement with Wal-Mart Stores Inc. As part of this deal JBH acquired all of WM's Intermodal trailing equipment. This acquisition of roughly 15,500 trailers brings JBH's total Intermodal trailing equipment count up to 118,171 intermodal boxes. In 2024, J.B. Hunt purchased 20 hydrogen trucks from Nikola Corporation. In 2025, J.B. Hunt, with BNSF Railway and Mexican company GMXT, launched a service called Quantum de Mexico for rail intermodal freight deliveries between the U.S. and Mexico. Philanthropy Since launching their J.B. Hunt scholarships for families program in 2022, JBH has awarded a total of $687,500 in scholarships to the families of J.B. Hunt employees. The J.B. Hunt Scholarship Program for Families is supported by Scholarship America®, an organization that works to enrich education by assisting individuals, corporations and communities with fundraising and awarding scholarships to students. J.B. Hunt plans to continue the program for a third consecutive year. Dec 12, 2023, J.B. Hunt continued its participation in Wreaths Across America for the tenth consecutive year this week, helping ensure the delivery of more than 355,000 wreaths for the annual event remembering fallen veterans during the holiday season. Corporate responsibility Sustainability The company uses load optimization software to decrease empty miles for drivers and GHG emission, improving overall route efficiency. J.B. Hunt also reserved several Tesla electric trucks and added the first-ever, all-electric box trucks to its fleet. In 2019, the company received the SmartWay Excellence Award from the U.S. Environmental Protection Agency(EPA) for the 10th consecutive year. Safety J.B. Hunt added hair testing for drugs to all pre-employment tests since May 2006, in addition to Federal Motor Carrier Safety Administration (FMCSA) mandated urine testing. Hair testing can detect prior drug usage for up to 90 days. Drivers are also trained and certified in the safety training program Smith System. Aug 14, 2024, J.B. Hunt Transportation was awarded Verisk CargoNet’s Best in Cargo Security recognition for its preventive measures, program engagement, and response preparedness to address cargo theft in real time throughout 2023."
}