{
  "ticker": "JBL",
  "cik": "0000898293",
  "company_name": "Jabil",
  "corrected_name": "Jabil",
  "wiki_title_used": "Jabil",
  "exists": true,
  "raw_text": "Jabil Inc. is an American multinational manufacturing company involved in the design, engineering, and manufacturing of electronic circuit board assemblies and systems, along with supply chain services, primarily serving original equipment manufacturers. It is headquartered in the Gateway area of St. Petersburg, Florida. It is one of the largest companies in the Tampa Bay area.\n\nHistory\nFounded in 1966 in the Detroit area, Jabil initially focused on circuit board assembly production and repair for Control Data Systems. The company name, Jabil, derives from the combination of the first names of its founders, James Golden and Bill Morean. After Golden exited the business, Bill Morean's son, William, joined the company and gradually began to shape its direction by signing new contracts, including an offer to purchase a majority stake in the company.\nIn 1979, Jabil established a high-volume manufacturing partnership with General Motors (GM), moving towards automated manufacturing and advanced assembly technology.\nIn 1981, Jabil introduced independent test engineering and development services. A year later, the company started volume production of circuit boards with manual surface-mount technology (SMT) processes. By 1984, Jabil had implemented computer-aided design services for production. A year later, the company transitioned to highly automated volume production using SMT processes. Towards the end of the 1980s, Jabil adopted the automated tape-automated bonding (TAB) process for circuit board production.\nIn 1982, Jabil moved its headquarters from Detroit to St. Petersburg, Florida.\nIn April 1993, Jabil became a publicly traded company, listing its shares on the New York Stock Exchange.\nIn 1997, Jabil expanded its manufacturing capacity and workforce, completing a new 120,000-square-foot building in St. Petersburg.\nIn 2001, Jabil was added to the S&P 500 Index. \nIn 2013, William D. Morean retired and was succeeded by Timothy Main as board chairman. Later, William E. Peters was named president and Mark Mondello was appointed CEO.\nIn 2014, Jabil was moved from the S&P 500 Index to the S&P MidCap 400 Index.\nIn 2017, Jabil announced that it would be closing its first European international plant in Livingston, United Kingdom, by the end of the year. Two hundred sixty-six employees in Livingston would lose their jobs. Jabil laid off approximately 400 people in September 2016, 100 of those being corporate employees located in St. Petersburg Florida. In March 2024, the company announced it would lay off 120 workers in Vancouver, Washington.\nIn January 2023, it was reported that Jabil had started manufacturing components for AirPods in India. In December 2023, Jabil rejoined the S&P 500 index.\nOn 19 April 2024, Jabil announced that CEO Kenny Wilson would take paid leave pending an investigation related to company policies, although not affecting the company's financial statements or reporting. Following Wilson's leave, which began on April 15, CFO Michael Dastoor was appointed as interim CEO by the board of directors. Following the completion of the investigation, Wilson resigned from the company and Dastoor was named CEO.\n\nAcquisitions and mergers\nJabil has acquired numerous companies and arms of companies. Their acquisitions have expanded their presence in countries such as China, Mexico, India, Spain, the Netherlands and Russia. \nIn 1999, Jabil began its operations in China by acquiring GET Manufacturing.\nIn 2001, Jabil expanded its manufacturing capability and acquired Intel's manufacturing facility in Malaysia. A year later, the company acquired a factory of Lucent Technologies in Shanghai. In 2002, the company also acquired contract manufacturing services of Philips.\nIn 2005, Jabil acquired Varian's electronics manufacturing business for $195 million. A year later, Jabil expanded its operations to Taiwan and acquired Green Point for $881 million through its subsidiary Jabil Circuit Taiwan.\nIn 2011, Jabil acquired Telmar Network, a communication network service provider based in Texas.\nIn February 2013, Jabil acquired Nypro for $665 million in cash. The purchase was completed in July 2013.\nIn 2015, Jabil acquired Shemer Group, an Israeli metal fabrication company specializing in contract manufacturing for high-tech capital equipment manufacturers. In the same year, the company acquired Plasticos Castella, a Spain-based food and consumer packaging manufacturer.\nIn 2018, Jabil acquired the medical devices business of Johnson & Johnson.\nIn 2021, Jabil acquired Ecologic Brands.\nIn August 2023, Jabil sold its mobility business in China to BYD. In November 2023, Jabil acquired the Silicon Photonics business of Intel.\nIn November 2023, Jabil acquired ProcureAbility.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Jabil Inc.:",
  "clean_text": "Jabil Inc. is an American multinational manufacturing company involved in the design, engineering, and manufacturing of electronic circuit board assemblies and systems, along with supply chain services, primarily serving original equipment manufacturers. It is headquartered in the Gateway area of St. Petersburg, Florida. It is one of the largest companies in the Tampa Bay area. History Founded in 1966 in the Detroit area, Jabil initially focused on circuit board assembly production and repair for Control Data Systems. The company name, Jabil, derives from the combination of the first names of its founders, James Golden and Bill Morean. After Golden exited the business, Bill Morean's son, William, joined the company and gradually began to shape its direction by signing new contracts, including an offer to purchase a majority stake in the company. In 1979, Jabil established a high-volume manufacturing partnership with General Motors (GM), moving towards automated manufacturing and advanced assembly technology. In 1981, Jabil introduced independent test engineering and development services. A year later, the company started volume production of circuit boards with manual surface-mount technology (SMT) processes. By 1984, Jabil had implemented computer-aided design services for production. A year later, the company transitioned to highly automated volume production using SMT processes. Towards the end of the 1980s, Jabil adopted the automated tape-automated bonding (TAB) process for circuit board production. In 1982, Jabil moved its headquarters from Detroit to St. Petersburg, Florida. In April 1993, Jabil became a publicly traded company, listing its shares on the New York Stock Exchange. In 1997, Jabil expanded its manufacturing capacity and workforce, completing a new 120,000-square-foot building in St. Petersburg. In 2001, Jabil was added to the S&P 500 Index. In 2013, William D. Morean retired and was succeeded by Timothy Main as board chairman. Later, William E. Peters was named president and Mark Mondello was appointed CEO. In 2014, Jabil was moved from the S&P 500 Index to the S&P MidCap 400 Index. In 2017, Jabil announced that it would be closing its first European international plant in Livingston, United Kingdom, by the end of the year. Two hundred sixty-six employees in Livingston would lose their jobs. Jabil laid off approximately 400 people in September 2016, 100 of those being corporate employees located in St. Petersburg Florida. In March 2024, the company announced it would lay off 120 workers in Vancouver, Washington. In January 2023, it was reported that Jabil had started manufacturing components for AirPods in India. In December 2023, Jabil rejoined the S&P 500 index. On 19 April 2024, Jabil announced that CEO Kenny Wilson would take paid leave pending an investigation related to company policies, although not affecting the company's financial statements or reporting. Following Wilson's leave, which began on April 15, CFO Michael Dastoor was appointed as interim CEO by the board of directors. Following the completion of the investigation, Wilson resigned from the company and Dastoor was named CEO. Acquisitions and mergers Jabil has acquired numerous companies and arms of companies. Their acquisitions have expanded their presence in countries such as China, Mexico, India, Spain, the Netherlands and Russia. In 1999, Jabil began its operations in China by acquiring GET Manufacturing. In 2001, Jabil expanded its manufacturing capability and acquired Intel's manufacturing facility in Malaysia. A year later, the company acquired a factory of Lucent Technologies in Shanghai. In 2002, the company also acquired contract manufacturing services of Philips. In 2005, Jabil acquired Varian's electronics manufacturing business for $195 million. A year later, Jabil expanded its operations to Taiwan and acquired Green Point for $881 million through its subsidiary Jabil Circuit Taiwan. In 2011, Jabil acquired Telmar Network, a communication network service provider based in Texas. In February 2013, Jabil acquired Nypro for $665 million in cash. The purchase was completed in July 2013. In 2015, Jabil acquired Shemer Group, an Israeli metal fabrication company specializing in contract manufacturing for high-tech capital equipment manufacturers. In the same year, the company acquired Plasticos Castella, a Spain-based food and consumer packaging manufacturer. In 2018, Jabil acquired the medical devices business of Johnson & Johnson. In 2021, Jabil acquired Ecologic Brands. In August 2023, Jabil sold its mobility business in China to BYD. In November 2023, Jabil acquired the Silicon Photonics business of Intel. In November 2023, Jabil acquired ProcureAbility."
}