{
  "ticker": "JCI",
  "cik": "0000833444",
  "company_name": "Johnson Controls",
  "corrected_name": "Johnson Controls",
  "wiki_title_used": "Johnson Controls",
  "exists": true,
  "raw_text": "Johnson Controls International plc is an American, Irish-domiciled multinational conglomerate headquartered in Cork, Ireland, that produces fire, HVAC, and security equipment for buildings. As of mid-2019, it employed 105,000 people in around 2,000 locations across six continents. In 2017 it was listed as 389th in the Fortune Global 500. It became ineligible for the Fortune 500 in subsequent years since it relocated its headquarters outside the U.S.\nThe company was formed via the merger of American company Johnson Controls with Tyco International, announced on 25 January 2016. The merger led to the avoidance of taxation on foreign market operations and a financial windfall for the CEO of Johnson Controls at that time, Alex Molinaroli.\n\nHistory\nIn 1883, Warren S. Johnson, a professor at the Whitewater Normal School (now University of Wisconsin–Whitewater) in Whitewater, Wisconsin, received a patent for the first electric room thermostat. His invention helped launch the building control industry and was the impetus for a new company. Johnson and a group of Milwaukee investors led by William Plankinton incorporated the Johnson Electric Service Company in 1885 to manufacture, install and service automatic temperature regulation systems for buildings. After Johnson died in 1911, the company decided to focus on its temperature control business for non-residential buildings.\nIn 1970, the company took over clock manufacturer Standard Electric Time Company. The company was renamed Johnson Controls in 1974. In 1978, Johnson Controls acquired the battery company Globe-Union. That same year, the company divested itself of the Standard Electric Time Company and sold it to Faraday. In 1985, Johnson Controls acquired automotive seating companies Hoover Universal and Ferro Manufacturing. \nIn 1989, Johnson acquired Pan Am World Services, which provides facilities management for airports, military bases and the two space centers of the U.S. Government. The acquisition would more than double Johnson Controls' facilities management business and diversify away from the cyclical construction business. Revenue from facilities maintenance contributed about one-third of Johnson's in 1988.\nDuring the 2007–2009 recession, the company's president, Keith Wandell, lobbied the U.S. Congress for a bailout of the companies that Johnson supplied. The Johnson Controls plant in Lakeshore, Ontario, closed in late March 2010 and the property was sold. In 2013, Stephen Roell retired and Alex Molinaroli took his position as CEO and chairman of the board.\n\nSubsequent history\nOn 31 October 2016, the former Johnson Controls Automotive Experience division was spun off as a separate, publicly traded company, Adient, and began trading on the New York Stock Exchange. In March 2017, it was announced that Scott Safety, its safety gear business, would be bought by 3M for $2 billion.\nOn 1 September 2017, George Oliver was appointed as chairman and CEO, an acceleration by 6 months from the original plans.\nOn 12 May 2021, Johnson Controls completed the acquisition of Silent-Aire, a Canadian firm that specialized in data center cooling systems. The deal was structured as follows: Johnson Controls paid $630 million upfront, and additional payments were made contingent upon reaching certain milestones, with total price capped at $870 million.)\nIn October 2021, it was announced that Johnson Controls had chosen Ava Robotics to power its new fully autonomous Tyco Security Robot.\nIn September 2023, Johnson Controls' experienced a ransomware attack, encrypting numerous company devices and servers, prompting the company to immediately shut down specific IT systems.\nIn July 2024, Johnson Controls announced their plans to sell a portfolio of heating and ventilation units to Germany's Bosch Group for $6.7 billion.\n\nWomen's work rights\nIn 1982, Johnson Controls enacted what it called a \"fetal protection policy\", which denied women the right to work on the battery production line because of the potential harm to a fetus they might conceive. Women were allowed to work on the production line only if they could prove that \"... their inability to bear children had been medically documented.\"\nIn April 1984, the United Automobile Workers sued Johnson Controls on behalf of three employees. These employees were Mary Craig, who had chosen to be sterilized to avoid losing her job; Elsie Nason, a 50-year-old divorcee, who had suffered a loss of compensation when she was transferred from a high paying job that exposed her to lead; and Donald Penney, who had been denied a request for a leave of absence for the purpose of lowering his blood lead levels because he intended to become a father. The case was argued before the Supreme Court of the United States on 10 October 1990 and was decided on 20 March 1991. The Court ruled in favor of the plaintiffs. This was a landmark ruling because it affirmed that \"... it is no more appropriate for the courts than it is for individual employers to decide whether a woman's reproductive role is more important to herself and her family than her economic role.\"\n\nBusiness units\nThe company's operations focus on Building Efficiency.\n\nBuilding Technologies and Solutions\nThe Building Technologies and Solutions business unit designs, produces, installs and services heating, ventilation and air conditioning systems, industrial refrigeration, building management systems, fire and security systems and mechanical equipment for commercial and residential buildings. The brands produced under this business unit are York, TempMaster, Metasys, Panoptix, Frick and Sabroe. This unit also works with organizations to reduce the energy consumption and operating costs of their buildings. This includes retrofitting existing buildings such as the Empire State Building and working on maximizing efficiency in new construction such as the Burj Khalifa in Dubai.  Building Technologies & Solutions is the company's longest-running business unit, dating to 1885 when Johnson founded the Johnson Electric Service Company after patenting the electric thermostat in 1883. As of 2012, the business unit operated from 700 branch offices in more than 150 countries.\nJohnson Controls was one of the defendants in a multimillion-dollar federal court lawsuit in San Juan, Puerto Rico in a case where 98 people perished and 140 were injured in a fire at the DuPont Plaza Hotel and its casino on New Year's Eve, 31 December 1986. The plaintiffs claimed that Johnson Controls sold and installed an energy management system that failed to give early warning of the fire. After nine months of trial, the company and its energy management system were absolved of blame when the court issued a directed verdict. When the trial was completed the plaintiffs had accumulated approximately $220,908,549.00 in damages as a result of various settlements and a jury verdict against some other defendants.\n\nFormer business units\nPower Solutions\nThis unit was sold to Brookfield Business Partners and re-made into a new company, Clarios, as of 1 May 2019.\nThe Power Solutions business unit designs and manufactures automotive batteries for passenger cars, heavy and light duty trucks, utility vehicles, motorcycles, golf carts and boats. It supplies more than one third of the world's lead-acid batteries to automakers and aftermarket retailers including Wal-Mart, Sears, Toyota, and BMW. Lead acid battery brands produced under this business unit include Continental, OPTIMA, Heliar, LTH, Delkor and VARTA automotive batteries. This part of the company also manufactures Lithium-ion cells and complete battery systems to power hybrid and electric vehicles such as the Ford Transit Connect electric van and Mercedes S-Class 400 hybrid. Additionally, it manufactures absorbent glass mat (AGM) and enhanced flooded batteries (EFB) batteries to power Start-Stop vehicles such as the Chevy Malibu and Ford Fusion. As of 2012, the business unit operated from 60 locations worldwide. On 13 November 2018 Johnson Controls agrees to sell its Power Solutions Division to Brookfield Business Partners.\n\nAutomotive Experience\nThis business unit was spun off into a new company named Adient on 31 October 2016.\n\nGlobal WorkPlace Solutions\nThe Global WorkPlace Solutions business unit provides outsourced facilities management services globally. It also manages corporate real estate on behalf of its customers including acquiring and disposing of property, administering leases, and managing building related projects such as equipment replacements. On 23 September 2015,  CBRE, Inc. purchased the Global Workplace Solutions business unit, retaining the name \"Global Workplace Solutions\".\n\nJoint ventures\nAmaron: Amara Raja Batteries of India signed a joint venture with Johnson Controls in December 1997 to manufacture automotive batteries in India, under the brand name  \"Amaron\". Amara Raja Batteries terminated the partnership with Johnson Controls on 1 April 2019.\n Brookfield Johnson Controls: A joint venture with Brookfield Properties to provide commercial property management services in Canada. Established in 1992, it was known as Brookfield LePage Johnson Controls or BLJC until May 2015. In 2013, Johnson Controls and Brookfield Asset Management formed a similar joint venture in Australia and New Zealand. In 2015, JCI pulled out and the company continued as Brookfield Global Integrated Solutions.\nDiniz Johnson Controls : A joint venture with Diniz Holding in Turkey building complete automotive seats for major OEMs.\nJohnson Controls Hitachi : A joint venture in 2015 with Hitachi in Japan for RAC, PAC, VRF and Chiller business.\nJohnson Controls-Saft Advanced Power Solutions: Johnson Controls-Saft Advanced Power Solutions (JCS) was a joint venture between Johnson Controls and French battery company Saft Groupe S.A. It was officially launched in January 2006.\nVARTA established a JCS development centre at its German HQ, following the setting-up of VARTA-Saft joint venture.\nJohnson Controls is exhibiting a plug-in hybrid concept called the re3. Johnson Controls produced cells for lithium-ion hybrid vehicle batteries in France under the joint venture with Saft. Battery assemblies were developed and produced in Hannover(Germany), Zwickau (Germany) and Milwaukee (US)\nDespite some signs of promise, Johnson Controls was increasingly dissatisfied with the restrictions of the agreement and also sought a more important ally. In May 2011, the American company requested the dissolution of Johnson Controls-Saft Advanced Power Solutions LLC to the Delaware Court of Chancery. The two companies agreed to the separation and Johnson Controls paid Saft $145 million for its shares in the joint venture, as well as for the right to use certain technology developed by it. Johnson Controls retained the Michigan facility built by the partnership. The French joint facility was transferred to Saft.\n\nBrands\nColeman Heating & Air Conditioning\nColeman Heating & Air Conditioning is a major manufacturing brand of HVAC equipment, and was formerly an independent HVAC manufacturing company. The company began as a division of the Coleman Company  in 1958 and was acquired by Evcon in 1990, which in turn was acquired by Johnson Controls in 1996.  Of the twelve largest American furnace brand names represented at Gas Furnace Guide, the Coleman brand received an average ranking of 3.7 out of 5 stars.\n\nYork International\nYork International is the final name of a company started in York, Pennsylvania, US, in 1874, which developed the York brand of refrigeration and HVAC equipment. The York brand has been owned since August 2005 by Johnson Controls, when it was sold to them for $3.2 billion. At the time of the acquisition, it was the world's largest independent manufacturer of air conditioning, heating, and refrigeration machinery. Its stock symbol was formerly YRK.\n\nManufacturing\nJohnson Controls operates HVAC manufacturing plants in the United States in Wichita, Kansas and Norman, Oklahoma. The Wichita plant primarily produces residential unitary equipment, such as air conditioners, furnaces, and heat pumps for the North American Market under various brands including York and Coleman. The Norman plant primarily produces rooftop units (RTUs) for commercial use.\n\nControversies\nMerger with Tyco\nOn 25 January 2016, Johnson Controls announced that it would merge with Tyco International to create Johnson Controls International plc, a company headquartered in Cork, Ireland. The merger was completed in September 2016. Merging with the Irish company allowed Johnson Controls to become an Irish company itself, and enjoy sharply lowered corporate taxes, a process known as a tax inversion. This restructuring came at great expense of the workforce which was reduced by 52% between 2016 and 2022. The same occurred after the takeover of York International in 2005, which led to a reduction of 76% of the workforce between 2005 and 2016.\nHillary Clinton condemned the company for wanting to escape United States taxes through the merger after having \"begged\" the government for financial help in 2008. The Johnson deal was termed \"outrageous\" by Fortune magazine. The firm estimated that it would save about US$150 million a year by avoiding American taxes.\n\nTyco international scandal\nIn 2002, former chairman and chief executive Dennis Kozlowski and former chief financial officer Mark H. Swartz were accused of the theft of more than US$150 million from the company. During their trial in March 2004, they contended the board of directors authorized it as compensation.\nKozlowski was tried twice. The first attempt was a ruled mistrial when one of the jurors was threatened by the public after being reported to have made an OK sign towards Kozlowski's lawyers. Kozlowski testified on his own behalf during the second trial, stating that his pay package was \"confusing\" and \"almost embarrassingly big,\" but that he never committed a crime as the company's top executive.\nOn 17 June 2005, after a retrial, Kozlowski and Swartz were convicted on all but one of the more than 30 counts against them. The verdicts carry potential jail terms of up to 25 years in state prison. Kozlowski and Swartz were each sentenced to no less than eight years and four months and no more than 25 years in prison. Then in May 2007, New Hampshire Federal District Court Judge Paul Barbadoro approved a class action settlement whereby Tyco agreed to pay $2.92 billion (in conjunction with $225 million by Pricewaterhouse Coopers, their auditors) to a class of defrauded shareholders represented by Grant & Eisenhofer P.A., Schiffrin, Barroway, Topaz & Kessler, and Milberg Weiss & Bershad.\nOn 17 January 2014, Kozlowski was granted parole from Lincoln Correctional Facility in New York City.\n\nBribery charges in China\nIn 2016, Johnson Controls agreed to pay $14.4M to settle Foreign Corrupt Practices Act charges with the SEC. According to the SEC, employees of China Marine, a subsidiary of Johnson Controls, employed sham vendors to transfer $4.9M worth of bribes to Chinese government-owned shipyards, to win over businesses and enrich themselves.\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Johnson Controls:",
  "clean_text": "Johnson Controls International plc is an American, Irish-domiciled multinational conglomerate headquartered in Cork, Ireland, that produces fire, HVAC, and security equipment for buildings. As of mid-2019, it employed 105,000 people in around 2,000 locations across six continents. In 2017 it was listed as 389th in the Fortune Global 500. It became ineligible for the Fortune 500 in subsequent years since it relocated its headquarters outside the U.S. The company was formed via the merger of American company Johnson Controls with Tyco International, announced on 25 January 2016. The merger led to the avoidance of taxation on foreign market operations and a financial windfall for the CEO of Johnson Controls at that time, Alex Molinaroli. History In 1883, Warren S. Johnson, a professor at the Whitewater Normal School (now University of Wisconsin–Whitewater) in Whitewater, Wisconsin, received a patent for the first electric room thermostat. His invention helped launch the building control industry and was the impetus for a new company. Johnson and a group of Milwaukee investors led by William Plankinton incorporated the Johnson Electric Service Company in 1885 to manufacture, install and service automatic temperature regulation systems for buildings. After Johnson died in 1911, the company decided to focus on its temperature control business for non-residential buildings. In 1970, the company took over clock manufacturer Standard Electric Time Company. The company was renamed Johnson Controls in 1974. In 1978, Johnson Controls acquired the battery company Globe-Union. That same year, the company divested itself of the Standard Electric Time Company and sold it to Faraday. In 1985, Johnson Controls acquired automotive seating companies Hoover Universal and Ferro Manufacturing. In 1989, Johnson acquired Pan Am World Services, which provides facilities management for airports, military bases and the two space centers of the U.S. Government. The acquisition would more than double Johnson Controls' facilities management business and diversify away from the cyclical construction business. Revenue from facilities maintenance contributed about one-third of Johnson's in 1988. During the 2007–2009 recession, the company's president, Keith Wandell, lobbied the U.S. Congress for a bailout of the companies that Johnson supplied. The Johnson Controls plant in Lakeshore, Ontario, closed in late March 2010 and the property was sold. In 2013, Stephen Roell retired and Alex Molinaroli took his position as CEO and chairman of the board. Subsequent history On 31 October 2016, the former Johnson Controls Automotive Experience division was spun off as a separate, publicly traded company, Adient, and began trading on the New York Stock Exchange. In March 2017, it was announced that Scott Safety, its safety gear business, would be bought by 3M for $2 billion. On 1 September 2017, George Oliver was appointed as chairman and CEO, an acceleration by 6 months from the original plans. On 12 May 2021, Johnson Controls completed the acquisition of Silent-Aire, a Canadian firm that specialized in data center cooling systems. The deal was structured as follows: Johnson Controls paid $630 million upfront, and additional payments were made contingent upon reaching certain milestones, with total price capped at $870 million.) In October 2021, it was announced that Johnson Controls had chosen Ava Robotics to power its new fully autonomous Tyco Security Robot. In September 2023, Johnson Controls' experienced a ransomware attack, encrypting numerous company devices and servers, prompting the company to immediately shut down specific IT systems. In July 2024, Johnson Controls announced their plans to sell a portfolio of heating and ventilation units to Germany's Bosch Group for $6.7 billion. Women's work rights In 1982, Johnson Controls enacted what it called a \"fetal protection policy\", which denied women the right to work on the battery production line because of the potential harm to a fetus they might conceive. Women were allowed to work on the production line only if they could prove that \"... their inability to bear children had been medically documented.\" In April 1984, the United Automobile Workers sued Johnson Controls on behalf of three employees. These employees were Mary Craig, who had chosen to be sterilized to avoid losing her job; Elsie Nason, a 50-year-old divorcee, who had suffered a loss of compensation when she was transferred from a high paying job that exposed her to lead; and Donald Penney, who had been denied a request for a leave of absence for the purpose of lowering his blood lead levels because he intended to become a father. The case was argued before the Supreme Court of the United States on 10 October 1990 and was decided on 20 March 1991. The Court ruled in favor of the plaintiffs. This was a landmark ruling because it affirmed that \"... it is no more appropriate for the courts than it is for individual employers to decide whether a woman's reproductive role is more important to herself and her family than her economic role.\" Business units The company's operations focus on Building Efficiency. Building Technologies and Solutions The Building Technologies and Solutions business unit designs, produces, installs and services heating, ventilation and air conditioning systems, industrial refrigeration, building management systems, fire and security systems and mechanical equipment for commercial and residential buildings. The brands produced under this business unit are York, TempMaster, Metasys, Panoptix, Frick and Sabroe. This unit also works with organizations to reduce the energy consumption and operating costs of their buildings. This includes retrofitting existing buildings such as the Empire State Building and working on maximizing efficiency in new construction such as the Burj Khalifa in Dubai. Building Technologies & Solutions is the company's longest-running business unit, dating to 1885 when Johnson founded the Johnson Electric Service Company after patenting the electric thermostat in 1883. As of 2012, the business unit operated from 700 branch offices in more than 150 countries. Johnson Controls was one of the defendants in a multimillion-dollar federal court lawsuit in San Juan, Puerto Rico in a case where 98 people perished and 140 were injured in a fire at the DuPont Plaza Hotel and its casino on New Year's Eve, 31 December 1986. The plaintiffs claimed that Johnson Controls sold and installed an energy management system that failed to give early warning of the fire. After nine months of trial, the company and its energy management system were absolved of blame when the court issued a directed verdict. When the trial was completed the plaintiffs had accumulated approximately $220,908,549.00 in damages as a result of various settlements and a jury verdict against some other defendants. Former business units Power Solutions This unit was sold to Brookfield Business Partners and re-made into a new company, Clarios, as of 1 May 2019. The Power Solutions business unit designs and manufactures automotive batteries for passenger cars, heavy and light duty trucks, utility vehicles, motorcycles, golf carts and boats. It supplies more than one third of the world's lead-acid batteries to automakers and aftermarket retailers including Wal-Mart, Sears, Toyota, and BMW. Lead acid battery brands produced under this business unit include Continental, OPTIMA, Heliar, LTH, Delkor and VARTA automotive batteries. This part of the company also manufactures Lithium-ion cells and complete battery systems to power hybrid and electric vehicles such as the Ford Transit Connect electric van and Mercedes S-Class 400 hybrid. Additionally, it manufactures absorbent glass mat (AGM) and enhanced flooded batteries (EFB) batteries to power Start-Stop vehicles such as the Chevy Malibu and Ford Fusion. As of 2012, the business unit operated from 60 locations worldwide. On 13 November 2018 Johnson Controls agrees to sell its Power Solutions Division to Brookfield Business Partners. Automotive Experience This business unit was spun off into a new company named Adient on 31 October 2016. Global WorkPlace Solutions The Global WorkPlace Solutions business unit provides outsourced facilities management services globally. It also manages corporate real estate on behalf of its customers including acquiring and disposing of property, administering leases, and managing building related projects such as equipment replacements. On 23 September 2015, CBRE, Inc. purchased the Global Workplace Solutions business unit, retaining the name \"Global Workplace Solutions\". Joint ventures Amaron: Amara Raja Batteries of India signed a joint venture with Johnson Controls in December 1997 to manufacture automotive batteries in India, under the brand name \"Amaron\". Amara Raja Batteries terminated the partnership with Johnson Controls on 1 April 2019. Brookfield Johnson Controls: A joint venture with Brookfield Properties to provide commercial property management services in Canada. Established in 1992, it was known as Brookfield LePage Johnson Controls or BLJC until May 2015. In 2013, Johnson Controls and Brookfield Asset Management formed a similar joint venture in Australia and New Zealand. In 2015, JCI pulled out and the company continued as Brookfield Global Integrated Solutions. Diniz Johnson Controls : A joint venture with Diniz Holding in Turkey building complete automotive seats for major OEMs. Johnson Controls Hitachi : A joint venture in 2015 with Hitachi in Japan for RAC, PAC, VRF and Chiller business. Johnson Controls-Saft Advanced Power Solutions: Johnson Controls-Saft Advanced Power Solutions (JCS) was a joint venture between Johnson Controls and French battery company Saft Groupe S.A. It was officially launched in January 2006. VARTA established a JCS development centre at its German HQ, following the setting-up of VARTA-Saft joint venture. Johnson Controls is exhibiting a plug-in hybrid concept called the re3. Johnson Controls produced cells for lithium-ion hybrid vehicle batteries in France under the joint venture with Saft. Battery assemblies were developed and produced in Hannover(Germany), Zwickau (Germany) and Milwaukee (US) Despite some signs of promise, Johnson Controls was increasingly dissatisfied with the restrictions of the agreement and also sought a more important ally. In May 2011, the American company requested the dissolution of Johnson Controls-Saft Advanced Power Solutions LLC to the Delaware Court of Chancery. The two companies agreed to the separation and Johnson Controls paid Saft $145 million for its shares in the joint venture, as well as for the right to use certain technology developed by it. Johnson Controls retained the Michigan facility built by the partnership. The French joint facility was transferred to Saft. Brands Coleman Heating & Air Conditioning Coleman Heating & Air Conditioning is a major manufacturing brand of HVAC equipment, and was formerly an independent HVAC manufacturing company. The company began as a division of the Coleman Company in 1958 and was acquired by Evcon in 1990, which in turn was acquired by Johnson Controls in 1996. Of the twelve largest American furnace brand names represented at Gas Furnace Guide, the Coleman brand received an average ranking of 3.7 out of 5 stars. York International York International is the final name of a company started in York, Pennsylvania, US, in 1874, which developed the York brand of refrigeration and HVAC equipment. The York brand has been owned since August 2005 by Johnson Controls, when it was sold to them for $3.2 billion. At the time of the acquisition, it was the world's largest independent manufacturer of air conditioning, heating, and refrigeration machinery. Its stock symbol was formerly YRK. Manufacturing Johnson Controls operates HVAC manufacturing plants in the United States in Wichita, Kansas and Norman, Oklahoma. The Wichita plant primarily produces residential unitary equipment, such as air conditioners, furnaces, and heat pumps for the North American Market under various brands including York and Coleman. The Norman plant primarily produces rooftop units (RTUs) for commercial use. Controversies Merger with Tyco On 25 January 2016, Johnson Controls announced that it would merge with Tyco International to create Johnson Controls International plc, a company headquartered in Cork, Ireland. The merger was completed in September 2016. Merging with the Irish company allowed Johnson Controls to become an Irish company itself, and enjoy sharply lowered corporate taxes, a process known as a tax inversion. This restructuring came at great expense of the workforce which was reduced by 52% between 2016 and 2022. The same occurred after the takeover of York International in 2005, which led to a reduction of 76% of the workforce between 2005 and 2016. Hillary Clinton condemned the company for wanting to escape United States taxes through the merger after having \"begged\" the government for financial help in 2008. The Johnson deal was termed \"outrageous\" by Fortune magazine. The firm estimated that it would save about US$150 million a year by avoiding American taxes. Tyco international scandal In 2002, former chairman and chief executive Dennis Kozlowski and former chief financial officer Mark H. Swartz were accused of the theft of more than US$150 million from the company. During their trial in March 2004, they contended the board of directors authorized it as compensation. Kozlowski was tried twice. The first attempt was a ruled mistrial when one of the jurors was threatened by the public after being reported to have made an OK sign towards Kozlowski's lawyers. Kozlowski testified on his own behalf during the second trial, stating that his pay package was \"confusing\" and \"almost embarrassingly big,\" but that he never committed a crime as the company's top executive. On 17 June 2005, after a retrial, Kozlowski and Swartz were convicted on all but one of the more than 30 counts against them. The verdicts carry potential jail terms of up to 25 years in state prison. Kozlowski and Swartz were each sentenced to no less than eight years and four months and no more than 25 years in prison. Then in May 2007, New Hampshire Federal District Court Judge Paul Barbadoro approved a class action settlement whereby Tyco agreed to pay $2.92 billion (in conjunction with $225 million by Pricewaterhouse Coopers, their auditors) to a class of defrauded shareholders represented by Grant & Eisenhofer P.A., Schiffrin, Barroway, Topaz & Kessler, and Milberg Weiss & Bershad. On 17 January 2014, Kozlowski was granted parole from Lincoln Correctional Facility in New York City. Bribery charges in China In 2016, Johnson Controls agreed to pay $14.4M to settle Foreign Corrupt Practices Act charges with the SEC. According to the SEC, employees of China Marine, a subsidiary of Johnson Controls, employed sham vendors to transfer $4.9M worth of bribes to Chinese government-owned shipyards, to win over businesses and enrich themselves."
}