{
  "ticker": "JKHY",
  "cik": "0000779152",
  "company_name": "Jack Henry & Associates",
  "corrected_name": "Jack Henry & Associates",
  "wiki_title_used": "Jack Henry & Associates",
  "exists": true,
  "raw_text": "Jack Henry and Associates, also known as Jack Henry is an American company founded in 1976 and devoted to financial technology and payment processing services, mostly for community banks and credit unions.  They assist regional banks and credit unions to control risk, make regulatory filings and add or improve their online banking services. Jack Henry stock trades on the NASDAQ exchange under the symbol JKHY, and is also part of the S&P 400 for mid-size American companies.\n\nHistory\nJack Henry was formed in 1976 by Jack Henry and Jerry Hall in Monett, Missouri. The company was incorporated in 1977.\nOn November 20, 1985, an initial public offering made Jack Henry a public company on the NASDAQ exchange under the symbol JKHY. In its first year of incorporation, the company generated $115,222 in revenue.  In 2012, Jack Henry announced $1 billion in annual revenue.  \nAs of 2021, the company had more than 6,800 employees in more than 20 states and was recognized by Forbes as one of America’s \"Best Large Employers\" for the fourth time.\n\nFinance\nThe key financial trends for Jack Henry & Associates, Inc. are as follows, based on fiscal years ending December 31:\n\nIn February 2025, the company reported a 6.4% rise in second-quarter net income (to $97.8 million, or $1.34 per share) as services and support revenue increased 3.5% and processing revenue climbed 7.3%.\n\nReferences\nExternal links\nBusiness data for Jack Henry & Associates, Inc.:",
  "clean_text": "Jack Henry and Associates, also known as Jack Henry is an American company founded in 1976 and devoted to financial technology and payment processing services, mostly for community banks and credit unions. They assist regional banks and credit unions to control risk, make regulatory filings and add or improve their online banking services. Jack Henry stock trades on the NASDAQ exchange under the symbol JKHY, and is also part of the S&P 400 for mid-size American companies. History Jack Henry was formed in 1976 by Jack Henry and Jerry Hall in Monett, Missouri. The company was incorporated in 1977. On November 20, 1985, an initial public offering made Jack Henry a public company on the NASDAQ exchange under the symbol JKHY. In its first year of incorporation, the company generated $115,222 in revenue. In 2012, Jack Henry announced $1 billion in annual revenue. As of 2021, the company had more than 6,800 employees in more than 20 states and was recognized by Forbes as one of America’s \"Best Large Employers\" for the fourth time. Finance The key financial trends for Jack Henry & Associates, Inc. are as follows, based on fiscal years ending December 31: In February 2025, the company reported a 6.4% rise in second-quarter net income (to $97.8 million, or $1.34 per share) as services and support revenue increased 3.5% and processing revenue climbed 7.3%."
}