{
  "ticker": "JNJ",
  "cik": "0000200406",
  "company_name": "Johnson & Johnson",
  "corrected_name": "Johnson & Johnson",
  "wiki_title_used": "Johnson & Johnson",
  "exists": true,
  "raw_text": "Johnson & Johnson (J&J) is an American multinational pharmaceutical, biotechnology, and medical technologies corporation headquartered in New Brunswick, New Jersey, and publicly traded on the New York Stock Exchange. Its common stock is a component of the Dow Jones Industrial Average, and the company is ranked No. 42 on the 2024 Fortune 500 list of the largest United States corporations. In 2024, the company was ranked 45th in the Forbes Global 2000. Johnson & Johnson has a global workforce of approximately 138,000 employees who are led by the company's current chairman and chief executive officer, Joaquin Duato. Johnson & Johnson is one of the world's most valuable companies and is one of only two U.S.-based companies that has a prime credit rating of AAA.\nJohnson & Johnson was founded in 1886 by three brothers, Robert Wood Johnson, James Wood Johnson, and Edward Mead Johnson, selling ready-to-use sterile surgical dressings. Over time, it developed some of the most recognizable healthcare products, including the first commercial first aid kit, maternity kits, baby powder, Band-Aids, Tylenol, and disposable contact lenses, establishing itself as a leading provider of medical products and consumer healthcare solutions.\nJohnson & Johnson expanded globally through acquisitions of major pharmaceutical and medical device companies such as Janssen, Ethicon, McNeil, and Actelion. It developed breakthrough treatments including RhoGAM for Rh incompatibility, HIV therapies, and the antidepressant Spravato (esketamine). The company has played major roles during public health crises from the 1918 influenza pandemic to COVID-19.\nJohnson & Johnson has faced significant legal and ethical challenges, including the Tylenol murders, hip implant failures, Risperdal marketing claims, transvaginal mesh lawsuits, and talc-related cancer cases. In 2023, it spun off its consumer health division as the publicly traded Kenvue, focusing its business on Innovative Medicine and MedTech. By 2025, the company reported nearly $89 billion in revenue, continued large-scale acquisitions.\n\nHistory\n1873–1885: Before Johnson & Johnson\nRobert Wood Johnson began his professional training at age 16 as a pharmaceutical apprentice at an apothecary run by his mother's cousin, James G. Wood, in Poughkeepsie, New York. Johnson co-founded his own company with George Seabury in 1873. The New York-based Seabury & Johnson became known for its medicated plasters. Robert Wood Johnson represented the company at the 1876 World's Fair. There he heard Joseph Lister's explanation of a new procedure: antiseptic surgery. Johnson parted ways with his business partner Seabury in 1885.\n\n1886: Founding of Johnson & Johnson\nRobert Wood Johnson joined his brothers, James Wood Johnson and Edward Mead Johnson, and created a line of ready-to-use sterile surgical dressings in 1886. They founded Johnson & Johnson in 1886 with 14 employees, eight women and six men. Johnson & Johnson opened its first factory building in the old Janeway and Carpenter factory on Neilson Street in New Brunswick, New Jersey.\nThey manufactured sterile surgical supplies, household products, and medical guides. Those products initially featured a logo that resembled the signature of James Wood Johnson. Robert Wood Johnson served as the first president of the company.\n\n1887–1942: Early history\nThe company sold medicated plasters such as Johnson & Johnson's Black Perfect Taffeta Court Plaster and also manufactured the world's first sterile surgical products, including sutures, absorbent cotton, and gauze. The company published \"Modern Methods of Antiseptic Wound Treatment\", a guide on how to do sterile surgery using its products, and in 1888, distributed 85,000 copies to doctors and pharmacists across the United States. The manual was translated into three languages and distributed worldwide. The first commercial first aid kit was designed in 1888 to support railroad construction workers, who were often hundreds of miles from medical care. The kits included antiseptic emergency supplies and directions for field use. In 1901, the company published the Handbook of First Aid, a guide on applying first aid.\nIn 1889, the company hired pharmacist Fred Kilmer as its first scientific director, who led its scientific research and wrote educational manuals. Kilmer's first achievement as scientific director was developing the industrial sterilization process. He was employed at the company until 1934.\nJohnson & Johnson had more than 400 employees and 14 buildings by 1894. In 1894, the company began producing Johnson's Baby Powder, the company's first baby product.\nThe company introduced the world's first maternity kit in 1894 to aid at-home births, called Dr. Simpson's Maternity Packet, presumably after Scottish obstetrician James Young Simpson. The kit included a washcloth; safety pins; sterile sutures, sponges, and gauze; antiseptic soap; an obstetric sheet and ligatures; flannel to wrap the baby in; and a chart for keeping birth records. The products were later marketed separately, including \"Lister's Towels\", the world's first mass-produced sanitary napkins. Kilmer wrote \"Hygiene in Maternity\", an instructional guide for mothers before and after delivery. In 1904, the company expanded its baby care products with \"Lister's Sanitary Diapers\", a diaper product for infants.\nDuring the Spanish–American War, Johnson & Johnson developed and donated 300,000 packaged compressed surgical dressings for soldiers in the field and created a trauma stretcher for field medics. The company donated its products in disaster relief efforts of the 1900 Galveston hurricane and the 1906 San Francisco earthquake.\nJohnson & Johnson vaccinated all of its employees against smallpox during the 1901 smallpox epidemic. The firm employed more than 1,200 people by 1910. Women accounted for half of the company's workforce and led a quarter of its departments.\nRobert Wood Johnson died in 1910, and he was succeeded as president of the company by his brother James Wood Johnson.\nDuring World War I, Johnson & Johnson factories increased production to meet wartime demands for sterile surgical products. In 1916, the company acquired Chicopee Manufacturing Company in Chicopee Falls, Massachusetts, to meet demand. Near the end of World War I, the 1918 flu pandemic broke out. The company invented and distributed an epidemic mask that helped prevent the spread of the flu.\nIn 1919, Johnson & Johnson opened the Gilmour Plant near Montreal, its first factory outside the United States, which produced surgical products for international customers. In 1924 the company's first overseas manufacturing facility was opened in Slough, England.\nIn 1920, Earle Dickson combined two Johnson & Johnson products, adhesive tape and gauze, to create the first commercial adhesive bandage. Band-Aid Brand Adhesive Bandages began sales the following year. In 1921, the company released Johnson's Baby Soap. Named after its Massachusetts facility, Johnson & Johnson built a textile mill and company town, Chicopee, outside Gainesville, Georgia. In the 1930s, the company expanded operations to Argentina, Brazil, Mexico, and South Africa. In 1931, Johnson & Johnson introduced the first prescription contraceptive gel marketed as Ortho-Gynol.\nRobert Wood Johnson II became president of the company in 1932.\nDuring The Great Depression Johnson & Johnson kept all its workers employed and raised wages by 5%. In 1933, Robert Wood Johnson II wrote a letter to Franklin D. Roosevelt, calling for a federal law to increase wages and reduce hours for all American workers. The company also opened a new facility in Chicago during that period. Johnson wrote and distributed \"Try Reality: A Discussion of Hours, Wages, and The Industrial Future\" to persuade business leaders to follow his lead, advocating that business is more than profit and that companies have responsibilities to consumers, employees, and society. In \"Try Reality\", the section titled \"An Industrial Philosophy\" would later become the company's credo.\nIn 1935, Johnson's Baby Oil was added to its line of baby products. Both male and female Johnson & Johnson employees were drafted and enlisted during World War II. The company ensured no one would lose their job when they returned home. Robert Wood Johnson II was appointed head of the Smaller War Plants Corporation in Washington, D.C. His work ensured U.S. factories with under 500 employees were awarded government contracts.\n\n1943: Credo and going public\nIn 1943, as the company was preparing for its initial public offering (IPO), Robert Wood Johnson wrote what the company would call, \"Our Credo\", a defining document that has been used to guide the company's decisions over the years. The company completed its IPO and became a public company in 1944.\nIn 1943, Vesta Stoudt identified a need for waterproof tape for ammunition boxes in World War Two. She wrote to Franklin D. Roosevelt with the idea; the president commissioned Revolite, a subsidiary of Johnson & Johnson at the time, to develop and manufacture a cloth-based adhesive tape.\n\n1944–1999: Acquisitions and international expansion\nIn 1944, the company began selling Johnson's Baby Lotion. The same year, the company established Ethicon Suture Laboratories. In 1947, G. F. Merson Ltd. was acquired to expand the company's suture business in the United Kingdom. The company was rebranded and absorbed into Ethicon.\nJohnson & Johnson chairman of the board, Robert Wood Johnson, published Or Forfeit Freedom, in 1947. The book outlined that businesses need to develop sustainable methods of using natural resources for the future of business and the planet.\nIn 1955, Ethicon developed a micro-point reverse-cutting ophthalmic needle attached to the suture. Micro-point surgical needles and sutures allowed for advances in modern vision surgery. In 1956, the company opened its first Asia-based operating company in the Philippines. The following year, an operating company opened in India.\nIn 1959, Johnson & Johnson acquired McNeil Laboratories. A year later, the company sold Tylenol for the first time without a prescription. In the same year, Cilag Chemie joined Johnson & Johnson as Cilag. \nIn 1961, Johnson & Johnson acquired Janssen Pharmaceuticals, which had been founded in 1953 by Belgian scientist Paul Janssen, the inventor of Fentanyl.\nIn 1963, Philip B. Hofmann succeeded Robert Wood Johnson as chairman and CEO. He was the first non-Johnson family member to become chief executive. Hofmann also helped found the Robert Wood Johnson Foundation. In the same year, the Food and Drug Administration approved a synthetic hormone contraceptive pill, Ortho-Novum.\nIn 1965, Johnson & Johnson acquired Codman & Shurtleff. The acquired company produced neurovascular devices and neurosurgery technologies. In 1968, the company developed the RhoGAM vaccine. The vaccine prevented Rh hemolytic disease in newborns.\nIn 1969, Ortho Diagnostics, a company subsidiary, launched the Sickledex Tube Test for detecting anemia. The same year, the FDA approved the Johnson & Johnson arterial graft. In 1971, the company launched Hapindex Diagnostic Test, a rapid hepatitis B test for blood donors. The test was developed to prevent the spread of hepatitis B through blood transfusions.\nIn the 1970s, Johnson & Johnson hired Henry N. Cobb from Pei Cobb Freed & Partners to design its new headquarters. The firm designed Johnson & Johnson Plaza across the railroad tracks from the older section of the Johnson & Johnson campus.\nIn 1973, Richard Sellars became chairman and CEO of Johnson & Johnson. In 1976, James E. Burke became the company's chairman and CEO. During Burke's tenure, he managed the 1982 Tylenol tampering incident. It became a case study on crisis management. Under his leadership, the company recalled 31 million bottles of Tylenol, relaunched the product with a triple tamper-evident seal, and urged consumers not to use if tampered with. These practices became the pharmaceutical and packaged food industry norm.\nJohnson & Johnson opened operating companies in China and Egypt in 1985. In 1987, Acuvue contact lenses became the first disposable contact lenses available to consumers. The lenses lasted up to one week, reducing the cost of contact lenses. In the same year, the company launched One Touch, a blood glucose monitoring system. In 1989, Ralph S. Larsen was appointed chairman and CEO of the company.\nAfter the dissolution of the Soviet Union, Johnson & Johnson expanded into eastern Europe. By 1991, the company had a presence in Hungary, Russia, the Czech Republic, and Poland. In the 1990s, the company acquired many familiar consumer health brands that made up the Johnson & Johnson family of companies. These acquisitions included Clean & Clear, Neutrogena, Motrin, and Aveeno.\nJohnson & Johnson opened an operating company in Israel in 1996. In 1997, Johnson & Johnson acquired Biosense Webster. DePuy was acquired by Johnson & Johnson in 1998, rolling it into the Medtech business group.\n\n2000–present\nWilliam C. Weldon was appointed chairman and CEO of the company in 2002. In 2003, Ethicon launched Vicryl Plus Antibacterial Sutures. The products prevent post-surgery infection within stitches. In 2006, Johnson & Johnson acquired Pfizer's consumer healthcare business and merged it with its consumer healthcare business group. The acquisition added brands like Listerine, Bengay, and Neosporin to the company's portfolio. In the same year, Johnson & Johnson's Janssen Pharmaceuticals, launched Prezista, a protease inhibitor for patients with failed previous HIV therapies.\nIn 2008, Johnson & Johnson acquired Mentor Corporation for $1 billion and merge its operations into Ethicon. In 2009, the company acquired HealthMedia, later renamed to Health & Wellness Solutions and the Human Performance Institute. In October 2010, J&J acquired Crucell for $2.4 billion. The subsidiary operates as the centre for vaccines, within Johnson & Johnson pharmaceuticals business group.\nIn 2012, Alex Gorsky became chairman and CEO of Johnson & Johnson. In November 2015, Biosense Webster, Inc. acquired Coherex Medical Inc. expanding the company's range of treatment options for patients with atrial fibrillation.\nIn 2017, Johnson & Johnson acquired Abbott Medical Optics from Abbott Laboratories for $4.325 billion, adding the new division into Johnson & Johnson Vision Care, Inc. in 2017. That same year, Johnson & Johnson acquired Actelion in a $30 billion deal, the largest ever purchase by the company. After the purchase, Johnson & Johnson spun off Actelion's research and development unit into a separate legal entity. In July 2017, Johnson & Johnson Vision Care, Inc acquired TearScience. In September 2017, the company acquired subscription-based contact lens startup Sightbox. In September of the same year Johnson & Johnson Medical GmbH acquired Emerging Implant Technologies GmbH, manufacturer of 3D-printed titanium interbody implants for spinal fusion surgery.\nIn March 2019, the FDA approved esketamine for the treatment of severe depression, which is marketed as Spravato by Janssen Pharmaceuticals. In 2019, Johnson & Johnson announced the release of photochromic contact lenses. The lenses adjust to sunlight and help eyes recover from bright light exposure faster. The lenses contain a photochromic additive that adapts visible light amounts filtered to the eyes and are the first to use such additives.\nIn November 2020, Johnson & Johnson acquired Momenta Pharmaceuticals for $6.5 billion.\nIn January 2022, Joaquin Duato became CEO of Johnson & Johnson.\nIn December 2022, Johnson & Johnson acquired cardiovascular medical technology company Abiomed Inc. for $16.6 billion.\nJohnson & Johnson began the separation of their consumer healthcare business segment in November 2021. In the split, Johnson & Johnson will retain the Johnson & Johnson name for prescription drugs and medical devices, while the second company will sell consumer health products and take over the Neutrogena, Aveeno, Tylenol, Listerine, Johnson's, Band-Aid and other brands. In September 2022, Johnson & Johnson chose Kenvue as the new name for its Consumer Health business. Kenvue went public through an IPO in May 2023, with Johnson & Johnson maintaining a controlling stake of around 91 percent. On July 24, 2023, Johnson & Johnson launched an exchange offer to split-off Kenvue. Following the completion of the exchange offer, Johnson & Johnson will retain approximately 9.5% of the outstanding shares of Kenvue common stock.In 2024, Johnson & Johnson sold off its remaining 9.5% stake in Kenvue, its former consumer products business.\nJohnson & Johnson holds a patent on the tuberculosis-treating drug bedaquiline, with secondary patents in at least 25 out of 43 countries with a high burden of tuberculosis blocking affordable generic versions of the drug, preventing millions of people from accessing the life-saving treatment. Though the patent was set to expire in many countries in 2023, Johnson & Johnson applied to extend the patent. On July 13, 2023, Stop TB Partnership announced that after negotiations with Johnson & Johnson, they had been granted licenses to produce generic versions of the drug.\nJohnson & Johnson announced several acquisitions in 2024: Ambrx Biopharma for $2 billion (in January), Shockwave Medical for $13.1 billion (in April), and Proteologix for $850 million (in May). In 2024, Johnson & Johnson MedTech released Polyphonic, a digital surgical platform. The platform features surgery planning, surgical video, and telepresence services for laparoscopic surgeries.\nIn January 2025, Johnson & Johnson announced it would acquire neurological drug maker Intra-Cellular Therapies for $14.6 billion, a company specializing in medications for behavioral disorders, including schizophrenia, depression, and bipolar disorder.\n\nCoronavirus (COVID-19) response\nJohnson & Johnson committed over $1 billion toward the development of a not-for-profit COVID-19 vaccine in partnership with the Biomedical Advanced Research and Development Authority (BARDA) Office of the Assistant Secretary for Preparedness and Response (ASPR) at the U.S. Department of Health and Human Services (HHS). Paul Stoffels of Johnson & Johnson said, \"In order to go fast, the people of Johnson & Johnson are committed to do this and all together we say we're going to do this not for profit. That's the fastest and the best way to find all the collaborations in the world to make this happen so we commit to bring this at a not-for-profit level.\"\nJanssen Vaccines, in partnership with Beth Israel Deaconess Medical Center (BIDMC), is responsible for developing the vaccine candidate, based on the same technology used to make its Ebola vaccine. The vaccine candidate is expected to enter phase 1 human clinical study in September 2020.\nDemand for the product Tylenol surged two to four times normal levels in March 2020. In response, the company increased production globally. For example, the Tylenol plant in Puerto Rico ran 24 hours a day, seven days a week.\nIn response to the shortage of ventilators, Ethicon, with Prisma Health, made and distributed the VESper Ventilator Expansion Splitter, which uses 3D printing technology, to allow one ventilator to support two patients.\n\nJanssen COVID-19 vaccine\nIn June 2020, Johnson & Johnson and the National Institute of Allergy and Infectious Diseases (NIAID) confirmed its intention to start a clinical trials of J&J's vaccine in September 2020, with the possibility of Phase 1/2a human clinical trials starting at an accelerated pace in the second half of July.\nOn August 5, 2020, the US government agreed to pay more than $1 billion to Johnson & Johnson (medical device company) for the production of 100 million doses of COVID-19 vaccine. As part of the agreed-upon deal, the U.S. can order up to 200 million additional doses of SARS-CoV-2 vaccine.\nIn September 2020, Johnson & Johnson started its 60,000-person phase 3 adenovirus-based vaccine trial. The trial was paused on October 12, 2020, because a volunteer became ill, but the company said it found no evidence that the vaccine had caused the illness and announced on October 23, 2020, that it would resume the trial.\nIn April 2021, the company reported that its COVID-19 vaccine achieved $100 million sales in the first quarter, accounting for less than 1% of its total revenue.\n\nJnJ Acquisition history\nBusiness segments\nThe company's business is divided into two business segments: Innovative Medicine and MedTech.\nJohnson & Johnson Innovation, LLC (JJI) is a subsidiary of Johnson & Johnson. JJI focuses on early-stage, life science, and technology innovations to advance the company's research and development pipeline. JJI provides startups with sourcing, infrastructure, and capital equipment at JLABS, financing & venture capital at JJDC, Inc., and collaborations leading to the potential development of medical device technologies, pharmaceuticals, and therapeutics. There are 4 JJI Innovation Centers located in London, Shanghai, Boston (Cambridge), and the San Francisco Bay Area. There are 13 JLABS incubators located in the Bay Area (San Francisco and South San Francisco), Belgium (Beerse), Boston (Cambridge and Lowell), Houston (TMC), New York City, Philadelphia, San Diego, Shanghai, Toronto, and Washington, D.C.\n\nInnovative Medicine\nThe Innovative Medicine (formerly known as pharmaceuticals) segment is focused on six therapeutic areas: immunology (rheumatoid arthritis, inflammatory bowel disease and psoriasis); infectious diseases (HIV/AIDS); neuroscience (mood disorders, neurodegenerative disorders and schizophrenia); oncology (solid tumours including lung cancer, prostate cancer and bladder cancer, and hematologic malignancies); cardiovascular, metabolism, retina (thrombosis and diabetes), and pulmonary hypertension (pulmonary arterial hypertension).\n\nMedTech\nThe Cardiovascular & Specialty Solutions Group includes electrophysiology products that diagnose and treat cardiac arrhythmias; devices used in the endovascular treatment of hemorrhagic and ischemic stroke; solutions that focus on breast reconstruction and aesthetics, and ear, nose and throat procedures.\nThe orthopaedics portfolio is composed of specialties including joint reconstruction, trauma, extremities, craniomaxillofacial, spinal surgery and sports medicine, in addition to the VELYS digital surgery portfolio.\nThe surgery portfolio includes advanced surgical innovations and solutions such as sutures, staplers, energy devices, and advanced hemostats along with interventional ablation, surgical robotics, and digital solutions.\nThe Johnson & Johnson Vision portfolio includes contact lenses, intraocular lens, automated treatment for dry eye, and four brands of laser vision correction systems.\n\nFinance\nFor the fiscal year 2024, Johnson & Johnson reported earnings of $14.07 billion, with an annual revenue of $88.82 billion. Johnson & Johnson's shares traded at over $165 per share, and its market capitalization was valued at over $394 billion in March 2025.\n\nPricing\nIn 2023, the Institute for Clinical and Economic Review (ICER) identified Darzalex (daratumumab), developed by Johnson & Johnson as one of five high-expenditure drugs that experienced significant net price increases without new clinical evidence to justify the hikes. Specifically, Darzalex's wholesale acquisition cost rose by approximately 7.6%, leading to an additional $190 million in costs to U.S. payers.\n\nCorporate governance\nAs of December 2024, the members of the board of directors of Johnson & Johnson are Joaquin Duato, Darius Adamczyk, Mary C. Beckerle, Jennifer A. Doudna, Marillyn A. Hewson, Paula A. Johnson, Hubert Joly, Mark B. McClellan, Anne M. Mulcahy, Mark A. Weinberger, Nadja Y. West, and Eugene A. Woods.\nAs of December 2024, the members of the executive committee of Johnson & Johnson are Joaquin Duato, Vanessa Broadhurst, Liz Forminard, Kristen Mulholland, Tim Schmid, John C. Reed, James Swanson, Jennifer Taubert, Kathy E. Wengel, and Joseph J. Wolk.\nJoaquin Duato is chairman and chief executive officer.\n\nChairmen\nRobert Wood Johnson I (1887–1910)\nJames Wood Johnson (1910–1932)\nRobert Wood Johnson II (1932–1963)\nPhilip B. Hofmann (1963–1973)\nRichard B. Sellars (1973–1976)\nJames E. Burke (1976–1989)\nRalph S. Larsen (1989–2002)\nWilliam C. Weldon (2002–2012)\nAlex Gorsky (2012–2022)\nJoaquin Duato (2023–present)\n\nOwnership\nInstitutional Investors hold 73.57% of outstanding shares. The ten largest shareholders as of December 2024:\n\nThe Vanguard Group (9.67%)\nBlackRock (8.36%)\nState Street Corporation (5.58%)\nGeode Capital Management (2.40%)\nMorgan Stanley (1.82%)\nJPMorgan Chase (1.61%)\nState Farm (1.32%)\nNorthern Trust (1.28%)\nNorges Bank (1.26%)\nWellington Management Group (1.01%)\n\nEnvironmental record\nJohnson & Johnson has set several positive goals to keep the company environmentally friendly and was ranked third among the United States's largest companies in Newsweek's \"Green Rankings\". Some examples are the reduction in water use, waste, and energy use and an increased level of transparency. Johnson & Johnson agreed to change its packaging of plastic bottles used in the manufacturing process, switching their packaging of liquids to non-polyvinyl chloride containers. The corporation is working with the Climate Northwest Initiative and the EPA National Environmental Performance Track program. As a member of the national Green Power Partnership, Johnson & Johnson operates the largest solar power generator in Pennsylvania at its site in Fort Washington, Pennsylvania.\n\nRecalls and litigation\n1982 Chicago Tylenol murders\nOn September 29, 1982, a \"Tylenol scare\" began when the first of seven individuals died in Chicago metropolitan area, after ingesting Extra Strength Tylenol that had been deliberately laced with cyanide. Within a week, the company pulled 31 million bottles of capsules back from retailers, making it one of the first major recalls in American history. The incident led to reforms in the packaging of over-the-counter substances and to federal anti-tampering laws. The case remains unsolved and no suspects have been charged. Johnson & Johnson's quick response, including a nationwide recall, was widely praised by public relations experts and the media and was the gold standard for corporate crisis management.\n\n2010 children's product recall\nOn April 30, 2010, McNeil Consumer Healthcare, a subsidiary of Johnson & Johnson, voluntarily recalled 43 over-the-counter children's medicines, including Tylenol, Tylenol Plus, Motrin, Zyrtec and Benadryl. The recall was conducted after a routine inspection at a manufacturing facility in Fort Washington, Pennsylvania, United States, revealed that some \"products may not fully meet the required manufacturing specifications\". Affected products may contain a \"higher concentration of active ingredients\" or exhibit other manufacturing defects. Products shipped to Canada, Dominican Republic, Mexico, Guam, Guatemala, Jamaica, Puerto Rico, Panama, Trinidad and Tobago, the United Arab Emirates, Kuwait and Fiji were included in the recall. In a statement, Johnson & Johnson said \"a comprehensive quality assessment across its manufacturing operations\" was underway. A dedicated website was established by the company listing affected products and other consumer information.\n\n2010 hip-replacement recall\nOn August 24, 2010, DePuy, a subsidiary of American giant Johnson & Johnson, recalled its ASR (articular surface replacement) hip prostheses from the market. DePuy said the recall was due to unpublished National Joint Registry data showing a 12% revision rate for resurfacing at five years and an ASR XL revision rate of 13%. All hip prostheses fail in some patients, but it is expected that the rate will be about 1% a year.\nPathologically, the failing prosthesis had several effects. Metal debris from wear of the implant led to a reaction that destroyed the soft tissues surrounding the joint, leaving some patients with long term disability. Ions of cobalt and chromium – the metals from which the implant was made – were also released into the blood and cerebrospinal fluid in some patients.\nIn March 2013, a jury in Los Angeles ordered Johnson & Johnson to pay more than $8.3 million in damages to a Montana man in the first of more than 10,000 lawsuits pending against the company in connection with the now-recalled DePuy hip.\nSome lawyers and industry analysts have estimated that the suits ultimately will cost Johnson & Johnson billions of dollars to resolve.\n\n2010 Tylenol recall\nIn 2010 and 2011, Johnson & Johnson voluntarily recalled some over-the-counter products, including Tylenol, due to an odor caused by tribromoanisole. In this case, 2,4,6-tribromophenol was used to treat wooden pallets on which product packaging materials were transported and stored.\n\nShareholders lawsuit\nIn 2010 a group of shareholders sued the board for allegedly failing to take action to prevent serious failings and illegalities since the 1990s, including manufacturing problems, bribing officials, covering up adverse effects and misleading marketing for unapproved uses. The judge initially dismissed the case in September 2011, but allowed the plaintiffs opportunity to refile at a later time. In 2012 Johnson and Johnson proposed a settlement with the shareholders, whereby the company would institute new oversight, quality and compliance procedures binding for five years.\n\nIllegal marketing of Risperdal\nJuries in several US states have found J&J guilty of concealing the adverse effects of Janssen Pharmaceuticals' antipsychotic medication Risperdal, produced by its unit, to promote it to doctors and patients as better than cheaper generics, and of falsely marketing it for treating patients with dementia. States that have awarded damages include Texas ($158 million), South Carolina ($327 million), Louisiana ($258 million), and most notably Arkansas ($1.2 billion).\nIn 2010, the United States Department of Justice joined a whistleblowers suit accusing the company of illegally marketing Risperdal through Omnicare, the largest company supplying pharmaceuticals to nursing homes. The allegations include that J&J were warned by the FDA to not promote Risperdal as effective and safe for elderly patients, but they did so, and that they paid Omnicare to promote the drug to care home physicians. The settlement was finalized on November 4, 2013, with J&J agreeing to pay a penalty of around $2.2 billion, \"including criminal fines and forfeiture totaling $485 million and civil settlements with the federal government and states totaling $1.72 billion\".\nJohnson & Johnson has also been subject to congressional investigations related to payments given to psychiatrists to promote its products and ghost write articles, notably Joseph Biederman and his pediatric bipolar disorder research unit.\n\nForeign bribery\nIn 2011, J&J settled litigation brought by the US Securities and Exchange Commission under the Foreign Corrupt Practices Act and paid around $70M in disgorgement and fines. J&J's employees had given kickbacks and bribes to doctors in Greece, Poland, and Romania to obtain business selling drugs and medical devices and had bribed officials in Iraq to win contracts under the Oil for Food program. J&J fully cooperated with the investigation once the problems came to light.\n\nConsumer fraud settlements\nIn May 2017, J&J reached an agreement to pay $33 million to several states to settle consumer fraud allegations in some of the company's over-the-counter drugs.\n\nUse of the Red Cross symbol\nJohnson & Johnson registered the Red Cross as a U.S. trademark for \"medicinal and surgical plasters\" in 1905 and has used the design since 1887. The Geneva Conventions, which reserved the Red Cross emblem for specific uses, were first approved in 1864 and ratified by the United States in 1882. However, the emblem was not protected by U.S. law for the use of the American Red Cross (ARC) and the U.S. military until after Johnson & Johnson had obtained its trademark. A clause in this law (now 18 U.S.C. 706) permits this pre-existing use of the Red Cross to continue.\nA declaration made by the U.S. upon its ratification of the 1949 Geneva Conventions includes a reservation that pre-1905 U.S. domestic uses of the Red Cross, such as Johnson & Johnson's, would remain lawful as long as the cross is not used on \"aircraft, vessels, vehicles, buildings or other structures, or upon the ground\", i.e., uses which could be confused with its military uses. This means that the U.S. did not agree to any interpretation of the 1949 Geneva Conventions that would overrule Johnson & Johnson's trademark. The American Red Cross continues to recognize the validity of Johnson & Johnson's trademark.\nIn August 2007, Johnson & Johnson filed a lawsuit against the ARC, demanding that the charity halt the use of the red cross symbol on products it sells to the public, though the company takes no issue with the charity's use of the mark for nonprofit purposes. In May 2008, the judge in the case dismissed most of Johnson & Johnson's claims, and a month later the two organizations announced a settlement had been reached in which both parties would continue to use the symbol.\n\nBoston Scientific lawsuits\nSince 2003, Johnson & Johnson and Boston Scientific have both claimed that the other had infringed on their patents covering heart stent medical devices. The litigation was settled when Boston Scientific agreed to pay $716 million to Johnson & Johnson in September 2009 and an additional $1.73 billion in February 2010. Their dispute was renewed in 2014, now on the grounds of a contract dispute.\n\nPatent-infringement case against Abbott\nIn 2007, Johnson & Johnson sued Abbott Laboratories over the development and sale of the arthritis drug Humira, claiming Abbott used technology licensed exclusively to Johnson & Johnson's Centocor division. Johnson & Johnson won the court case, and in 2009 Abbott was ordered to pay Johnson & Johnson $1.17 billion in lost revenues and $504 million in royalties. The judge also added $175.6 million in interest to bring the total to $1.84 billion. This was the largest patent-infringement award in U.S. history until the 2013 decision against Teva in favor of Takeda and Pfizer for over $2.1 billion. In 2010 Abbott appealed the verdict and in 2011 won the appeal.\n\nVaginal mesh implants\nTens of thousands of women worldwide have taken legal action against Johnson & Johnson after suffering serious complications following a vaginal mesh implant procedure. In Australia, more than 700 women began a class action against the company in the Federal Court of Australia in 2017, telling the court they \"suffered irreparable, debilitating pain after the devices began to erode into surrounding tissue and organs, causing infections and complications\". The class action alleged that Johnson & Johnson, which \"aggressively marketed\" the implants \"failed to properly warn patients and surgeons of the risk, or test the devices adequately\". Emails between executives show the company was aware of the risks in 2005 but still went ahead and made the product available. In November 2019 the Federal Court of Australia found Johnson & Johnson negligent. The judgment was appealed, with the appeals court upholding all findings of Justice Anna Katzman. Ethicon then sought a High Court decision but this was not permitted by the High Court of Australia. Subsequently (September 2022) a A$300,000,000 compensation agreement was reached between Shine Lawyers and J&J but this agreement remains subject to approval by the Federal Court of Australia.\nIn the US in 2016 the U.S. states of California and Washington filed a lawsuit against the company, accusing it of deception. In October 2019, the company and its subsidiary, Ethicon, Inc. reached a settlement with 41 states and the District of Columbia, with no admission of liability, in a suit alleging deceptive marketing of transvaginal surgical-mesh devices. The suit also alleges that the company failed to disclose risks associated with the product, which J&J pulled from the US market in 2012. The amount settled in the suit was about $117 million.\n\nBaby powder\nJ&J has been the subject of over 60,000 lawsuits claiming that its baby powder causes ovarian cancer. The lawsuits focus on claims that the talc-based powder is contaminated with asbestos, a known carcinogen commonly found in places where talc is mined.\nIn 2016, J&J was ordered to pay $72 million in damages to the family of Jacqueline Fox, a 62-year-old woman who died of ovarian cancer in 2015. The company said it would appeal. A year later, over 1,000 U.S. women had sued J&J for covering up the possible cancer risk from its Baby Powder product. The company says that 70% of its Baby Powder is used by adults. Later that year, a California jury ordered Johnson & Johnson to pay $417 million to a woman who claimed she developed ovarian cancer after using the company's talc-based products like Johnson's Baby Powder for feminine hygiene. The verdict included $70 million in compensatory damages and $347 million in punitive damages. J&J said they would appeal the verdict. The Missouri Eastern District appeals court later negated a $72 million jury verdict in the Jacqueline Fox lawsuit, ruling it lacked jurisdiction in Missouri because of a U.S. Supreme Court decision that imposed limits on where injury lawsuit can be filed. Subsequently, this ruling killed three other recent St. Louis jury verdicts of more than $200 million combined. Fox, 62, of Birmingham, Alabama, died in 2015, about four months before her trial was held in St. Louis Circuit Court. She was among 65 plaintiffs, of whom only two were from Missouri.\nA St. Louis jury awarded nearly $4.7 billion in damages to 22 women and their families in 2018 after they claimed that asbestos in Johnson & Johnson talcum powder caused their ovarian cancer. In August, J&J said that it removed several chemicals from baby powder products and re-engineered them to make consumers more confident that products were safer for children. The company was forced to release internal documents with 11,700 people suing J&J over cancers allegedly caused by baby powder. The documents showed that the company had known about asbestos contamination since at least as early as 1971 and had spent decades finding ways to conceal the evidence from the public.\nThe company lost its request to reverse a jury verdict that ruled in favor of the accusers, which required the company to pay $4.14 billion in punitive damages and $550 million in compensatory damages. A large study performed in 2003 found that ovarian cancer risk increased from a baseline of 0.0121% to 0.0161% in people who reported regularly using talc in the genital area. Two more studies over the next twelve years, which also relied on self-reporting, had similar results; however, none of the three studies showed a relationship between how long someone used talc and how much their cancer risk increased, which is expected in experiments with carcinogens and other toxic substances (see dose–response relationship).\nConversely, a St. Louis jury ruled in favor of Johnson & Johnson in the case of a single plaintiff who had used the company's talc-containing baby powder for thirty years with a similar claim. The company's CEO, Alex Gorsky, declined to appear at a United States congressional hearing on the safety of J&J's Baby Powder and other talc-based cosmetics. J&J spokesman Ernie Knewitz said that the subcommittee had rejected the company's offers to send a talc testing expert or a J&J executive in charge of consumer products. In response to declining demand, J&J announced it would discontinue the sale of talc-based baby powder in the United States and Canada in 2020, but would continue to sell it in other markets. In a statement, the company said that the existing retail inventory of the talc-based powder will sell until it runs out, while the company's cornstarch-based baby powder will continue to sell in the United States and Canada.\nThe Supreme Court of Missouri refused to consider J&J's appeal of a $2.12 billion damages award to women who blamed their ovarian cancer on its talc-based products.\nThe Supreme Court of the United States also refused to consider an appeal from J&J, leaving in place a judgment from a state appeal court that had cut the original award to $2.1 billion. Two of the justices had to recuse: Samuel Alito because either he and/or his wife owning or recently owning stock in J&J, and Brett Kavanaugh, whose father led an industry group lobbying against safety warnings on talc products. Representing the affected women during the trial, Mark Lanier remarked that the Supreme Court's decision sent \"a clear message to the rich and powerful: You will be held to account when you cause grievous harm under our system of equal justice under law.\" J&J had argued that the combined claims in the St. Louis trial were too different, yet the short jury deliberation and identical payouts were, therefore, a violation of the company's due process and also that the high punitive award was unconstitutional.\nIn 2021, Johnson & Johnson subsidiary LTL Management LLC, using a process called a Texas divisional merger, filed for Chapter 11 bankruptcy in North Carolina. The process allowed by Texas law lets a company create a separate subsidiary to take over liabilities, with the existing company operating normally. The new company, with a different name, can locate in a state such as North Carolina where bankruptcy laws are different, and then declare bankruptcy, paying less than the original company would have. In the case of LTL, a $2 billion trust will be created, compared to $25 billion if Johnson & Johnson had declared bankruptcy. According to the filing, a company known as Old JJCI took on the baby powder related liabilities in 1979, while Johnson & Johnson remained a defendant. LTL and New JJCI were created with LTL taking the baby powder related liabilities and some assets, and New JJCI taking the remaining assets. Johnson & Johnson says LTL is now based in New Jersey.\nThe company announced that it would stop making talc-based powder by 2023 and replace it with cornstarch-based powders. The company says the talc-based powder is safe to use and does not contain asbestos.\nLawsuits showed connections between Johnson & Johnson and the Holmesburg Prison experiments.\nIn 2023, the number of lawsuits regarding talc-based baby powder exceeded 40,000 as more claimants came forward to say that the company's product caused them to have cancer. Johnson & Johnson offered $9 billion to settle all the lawsuits against the company, up from the previous figure of $2 billion.\nIn February 2025, as the number of talc-based powder related lawsuits sits at over 62,000, Johnson & Johnson offered a settlement of $10 billion to end litigation, funded by a subsidiary's filing for Chapter 11 bankruptcy, reliant on the approval from Houston bankruptcy judge, Judge Christopher Lopez. While the proposal showed significantly more support compared to their last bankruptcy attempts, there are accusations of the company pushing against negative votes, and widely accepting positive ones. Adam Silverstein, an attorney representing plaintiffs rejecting the proposal, branded the move as a \"blatant double standard\" in a statement to Lopez. The judged ultimately denied J&J's attempt. \nIn October 2025, a Los Angeles court ordered J&J to pay $966 million to the family of a woman who died from mesothelioma in 2021. The ruling came days after a South Carolina court rejected a lawsuit of a man that similarly claimed asbestos fibers in baby powder caused his cancer. J&J called the ruling unconstitutional and said it would appeal. Since this ruling, J&J has seen a 17% rise in talc cancer related suits.\n\nOpioid epidemic\nBy 2018, the company had become embroiled in the opioid epidemic in the United States and had become a target of lawsuits. Over 500 opioid-related cases have been filed as of May 2018 against J&J and its competitors. In Idaho, J&J is part of a lawsuit accusing the company for being partially to blame for opioid-related overdose deaths. The first major trial began in Oklahoma in May 2019. On August 26, 2019, the Oklahoma judge ordered J&J to pay $572 million for their part in the opioid crisis, and in October J&J paid $20.4 million to two Ohio counties fighting the opioid epidemic. In January 2022, Johnson & Johnson agreed to pay up to $5 billion as part of a $26 billion settlement which included McKesson, AmerisourceBergen, and Cardinal Health. Had the states gone to court, the companies could have faced up to $95 billion in penalties.\n\nNortheastern Ohio Settlement\nIn October 2019, the company agreed to a settlement of $20.4 million with northeastern Ohio's most populous counties of Cuyahoga (containing Cleveland) and Summit (Akron). The settlement allows the company avoidance of a trial accusing J&J and many other pharmaceutical manufacturers of helping to spark the US opioid epidemic. The trial was thought to be an indicator for thousands of opioid-related lawsuits against many drug manufacturers. The arrangement, which contains no admission of liability by the company, provides the counties $10 million in cash, $5 million for legal expenses and $5.4 million in contributions to opioid-related nonprofit organizations in the counties.\n\nPublic-private engagement\nJohnson & Johnson and its subsidiaries engage with the public and private sectors in a variety of settings including to promote research and development, academic funding, event sponsorship, philanthropy, and political lobbying.\n\nAcademia\nJ&J is a matching gift donor to the Institute for Advanced Study.\n\nActivism\nJ&J is a corporate partner of Human Rights Campaign, a large LGBT advocacy group.\nJ&J is a financial supporter of Women Deliver.\n\nPolitical lobbying\nJohnson & Johnson is engaged in various forms of lobbying in the United States, Canada and internationally, including through corporate philanthropy and membership in lobbying organizations.\n\nJ&J is one of the largest donors to the Foundation for the National Institutes of Health (FNIH), having donated $5–10 million from 2000 to 2020.\nJ&J is a partner of the Pandemic Action Network.\nJ&J is a member company of the Biotechnology Innovation Organization (BIO) and the Pharmaceutical Research and Manufacturers of America (PhRMA),  trade associations that lobby the U.S. Government on behalf of the Biotechnology Industry and pharmaceutical industry. BIO and PhRMA have offices in Washington, D.C., with PhRMA also having locations in Japan and the United Arab Emirates.\nJ&J is a member of the Personalized Medicine Coalition, a medical research advocacy group that lobbies on behalf of the pharmaceutical industry to increase funding for personalized medicine research and development.\nJ&J is a member company of the National Pharmaceutical Council (NPC), a nonprofit that advocates for expanded research funding and innovation.\n\nResearch and development\nJ&J has provided research grants and major funding to the C. D. Howe Institute.\n\nSee also\nZodiac (schooner)\n\nReferences\nExternal links\n\nOfficial website \nJohnson & Johnson on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nBusiness data for Johnson & Johnson:",
  "clean_text": "Johnson & Johnson (J&J) is an American multinational pharmaceutical, biotechnology, and medical technologies corporation headquartered in New Brunswick, New Jersey, and publicly traded on the New York Stock Exchange. Its common stock is a component of the Dow Jones Industrial Average, and the company is ranked No. 42 on the 2024 Fortune 500 list of the largest United States corporations. In 2024, the company was ranked 45th in the Forbes Global 2000. Johnson & Johnson has a global workforce of approximately 138,000 employees who are led by the company's current chairman and chief executive officer, Joaquin Duato. Johnson & Johnson is one of the world's most valuable companies and is one of only two U.S.-based companies that has a prime credit rating of AAA. Johnson & Johnson was founded in 1886 by three brothers, Robert Wood Johnson, James Wood Johnson, and Edward Mead Johnson, selling ready-to-use sterile surgical dressings. Over time, it developed some of the most recognizable healthcare products, including the first commercial first aid kit, maternity kits, baby powder, Band-Aids, Tylenol, and disposable contact lenses, establishing itself as a leading provider of medical products and consumer healthcare solutions. Johnson & Johnson expanded globally through acquisitions of major pharmaceutical and medical device companies such as Janssen, Ethicon, McNeil, and Actelion. It developed breakthrough treatments including RhoGAM for Rh incompatibility, HIV therapies, and the antidepressant Spravato (esketamine). The company has played major roles during public health crises from the 1918 influenza pandemic to COVID-19. Johnson & Johnson has faced significant legal and ethical challenges, including the Tylenol murders, hip implant failures, Risperdal marketing claims, transvaginal mesh lawsuits, and talc-related cancer cases. In 2023, it spun off its consumer health division as the publicly traded Kenvue, focusing its business on Innovative Medicine and MedTech. By 2025, the company reported nearly $89 billion in revenue, continued large-scale acquisitions. History 1873–1885: Before Johnson & Johnson Robert Wood Johnson began his professional training at age 16 as a pharmaceutical apprentice at an apothecary run by his mother's cousin, James G. Wood, in Poughkeepsie, New York. Johnson co-founded his own company with George Seabury in 1873. The New York-based Seabury & Johnson became known for its medicated plasters. Robert Wood Johnson represented the company at the 1876 World's Fair. There he heard Joseph Lister's explanation of a new procedure: antiseptic surgery. Johnson parted ways with his business partner Seabury in 1885. 1886: Founding of Johnson & Johnson Robert Wood Johnson joined his brothers, James Wood Johnson and Edward Mead Johnson, and created a line of ready-to-use sterile surgical dressings in 1886. They founded Johnson & Johnson in 1886 with 14 employees, eight women and six men. Johnson & Johnson opened its first factory building in the old Janeway and Carpenter factory on Neilson Street in New Brunswick, New Jersey. They manufactured sterile surgical supplies, household products, and medical guides. Those products initially featured a logo that resembled the signature of James Wood Johnson. Robert Wood Johnson served as the first president of the company. 1887–1942: Early history The company sold medicated plasters such as Johnson & Johnson's Black Perfect Taffeta Court Plaster and also manufactured the world's first sterile surgical products, including sutures, absorbent cotton, and gauze. The company published \"Modern Methods of Antiseptic Wound Treatment\", a guide on how to do sterile surgery using its products, and in 1888, distributed 85,000 copies to doctors and pharmacists across the United States. The manual was translated into three languages and distributed worldwide. The first commercial first aid kit was designed in 1888 to support railroad construction workers, who were often hundreds of miles from medical care. The kits included antiseptic emergency supplies and directions for field use. In 1901, the company published the Handbook of First Aid, a guide on applying first aid. In 1889, the company hired pharmacist Fred Kilmer as its first scientific director, who led its scientific research and wrote educational manuals. Kilmer's first achievement as scientific director was developing the industrial sterilization process. He was employed at the company until 1934. Johnson & Johnson had more than 400 employees and 14 buildings by 1894. In 1894, the company began producing Johnson's Baby Powder, the company's first baby product. The company introduced the world's first maternity kit in 1894 to aid at-home births, called Dr. Simpson's Maternity Packet, presumably after Scottish obstetrician James Young Simpson. The kit included a washcloth; safety pins; sterile sutures, sponges, and gauze; antiseptic soap; an obstetric sheet and ligatures; flannel to wrap the baby in; and a chart for keeping birth records. The products were later marketed separately, including \"Lister's Towels\", the world's first mass-produced sanitary napkins. Kilmer wrote \"Hygiene in Maternity\", an instructional guide for mothers before and after delivery. In 1904, the company expanded its baby care products with \"Lister's Sanitary Diapers\", a diaper product for infants. During the Spanish–American War, Johnson & Johnson developed and donated 300,000 packaged compressed surgical dressings for soldiers in the field and created a trauma stretcher for field medics. The company donated its products in disaster relief efforts of the 1900 Galveston hurricane and the 1906 San Francisco earthquake. Johnson & Johnson vaccinated all of its employees against smallpox during the 1901 smallpox epidemic. The firm employed more than 1,200 people by 1910. Women accounted for half of the company's workforce and led a quarter of its departments. Robert Wood Johnson died in 1910, and he was succeeded as president of the company by his brother James Wood Johnson. During World War I, Johnson & Johnson factories increased production to meet wartime demands for sterile surgical products. In 1916, the company acquired Chicopee Manufacturing Company in Chicopee Falls, Massachusetts, to meet demand. Near the end of World War I, the 1918 flu pandemic broke out. The company invented and distributed an epidemic mask that helped prevent the spread of the flu. In 1919, Johnson & Johnson opened the Gilmour Plant near Montreal, its first factory outside the United States, which produced surgical products for international customers. In 1924 the company's first overseas manufacturing facility was opened in Slough, England. In 1920, Earle Dickson combined two Johnson & Johnson products, adhesive tape and gauze, to create the first commercial adhesive bandage. Band-Aid Brand Adhesive Bandages began sales the following year. In 1921, the company released Johnson's Baby Soap. Named after its Massachusetts facility, Johnson & Johnson built a textile mill and company town, Chicopee, outside Gainesville, Georgia. In the 1930s, the company expanded operations to Argentina, Brazil, Mexico, and South Africa. In 1931, Johnson & Johnson introduced the first prescription contraceptive gel marketed as Ortho-Gynol. Robert Wood Johnson II became president of the company in 1932. During The Great Depression Johnson & Johnson kept all its workers employed and raised wages by 5%. In 1933, Robert Wood Johnson II wrote a letter to Franklin D. Roosevelt, calling for a federal law to increase wages and reduce hours for all American workers. The company also opened a new facility in Chicago during that period. Johnson wrote and distributed \"Try Reality: A Discussion of Hours, Wages, and The Industrial Future\" to persuade business leaders to follow his lead, advocating that business is more than profit and that companies have responsibilities to consumers, employees, and society. In \"Try Reality\", the section titled \"An Industrial Philosophy\" would later become the company's credo. In 1935, Johnson's Baby Oil was added to its line of baby products. Both male and female Johnson & Johnson employees were drafted and enlisted during World War II. The company ensured no one would lose their job when they returned home. Robert Wood Johnson II was appointed head of the Smaller War Plants Corporation in Washington, D.C. His work ensured U.S. factories with under 500 employees were awarded government contracts. 1943: Credo and going public In 1943, as the company was preparing for its initial public offering (IPO), Robert Wood Johnson wrote what the company would call, \"Our Credo\", a defining document that has been used to guide the company's decisions over the years. The company completed its IPO and became a public company in 1944. In 1943, Vesta Stoudt identified a need for waterproof tape for ammunition boxes in World War Two. She wrote to Franklin D. Roosevelt with the idea; the president commissioned Revolite, a subsidiary of Johnson & Johnson at the time, to develop and manufacture a cloth-based adhesive tape. 1944–1999: Acquisitions and international expansion In 1944, the company began selling Johnson's Baby Lotion. The same year, the company established Ethicon Suture Laboratories. In 1947, G. F. Merson Ltd. was acquired to expand the company's suture business in the United Kingdom. The company was rebranded and absorbed into Ethicon. Johnson & Johnson chairman of the board, Robert Wood Johnson, published Or Forfeit Freedom, in 1947. The book outlined that businesses need to develop sustainable methods of using natural resources for the future of business and the planet. In 1955, Ethicon developed a micro-point reverse-cutting ophthalmic needle attached to the suture. Micro-point surgical needles and sutures allowed for advances in modern vision surgery. In 1956, the company opened its first Asia-based operating company in the Philippines. The following year, an operating company opened in India. In 1959, Johnson & Johnson acquired McNeil Laboratories. A year later, the company sold Tylenol for the first time without a prescription. In the same year, Cilag Chemie joined Johnson & Johnson as Cilag. In 1961, Johnson & Johnson acquired Janssen Pharmaceuticals, which had been founded in 1953 by Belgian scientist Paul Janssen, the inventor of Fentanyl. In 1963, Philip B. Hofmann succeeded Robert Wood Johnson as chairman and CEO. He was the first non-Johnson family member to become chief executive. Hofmann also helped found the Robert Wood Johnson Foundation. In the same year, the Food and Drug Administration approved a synthetic hormone contraceptive pill, Ortho-Novum. In 1965, Johnson & Johnson acquired Codman & Shurtleff. The acquired company produced neurovascular devices and neurosurgery technologies. In 1968, the company developed the RhoGAM vaccine. The vaccine prevented Rh hemolytic disease in newborns. In 1969, Ortho Diagnostics, a company subsidiary, launched the Sickledex Tube Test for detecting anemia. The same year, the FDA approved the Johnson & Johnson arterial graft. In 1971, the company launched Hapindex Diagnostic Test, a rapid hepatitis B test for blood donors. The test was developed to prevent the spread of hepatitis B through blood transfusions. In the 1970s, Johnson & Johnson hired Henry N. Cobb from Pei Cobb Freed & Partners to design its new headquarters. The firm designed Johnson & Johnson Plaza across the railroad tracks from the older section of the Johnson & Johnson campus. In 1973, Richard Sellars became chairman and CEO of Johnson & Johnson. In 1976, James E. Burke became the company's chairman and CEO. During Burke's tenure, he managed the 1982 Tylenol tampering incident. It became a case study on crisis management. Under his leadership, the company recalled 31 million bottles of Tylenol, relaunched the product with a triple tamper-evident seal, and urged consumers not to use if tampered with. These practices became the pharmaceutical and packaged food industry norm. Johnson & Johnson opened operating companies in China and Egypt in 1985. In 1987, Acuvue contact lenses became the first disposable contact lenses available to consumers. The lenses lasted up to one week, reducing the cost of contact lenses. In the same year, the company launched One Touch, a blood glucose monitoring system. In 1989, Ralph S. Larsen was appointed chairman and CEO of the company. After the dissolution of the Soviet Union, Johnson & Johnson expanded into eastern Europe. By 1991, the company had a presence in Hungary, Russia, the Czech Republic, and Poland. In the 1990s, the company acquired many familiar consumer health brands that made up the Johnson & Johnson family of companies. These acquisitions included Clean & Clear, Neutrogena, Motrin, and Aveeno. Johnson & Johnson opened an operating company in Israel in 1996. In 1997, Johnson & Johnson acquired Biosense Webster. DePuy was acquired by Johnson & Johnson in 1998, rolling it into the Medtech business group. 2000–present William C. Weldon was appointed chairman and CEO of the company in 2002. In 2003, Ethicon launched Vicryl Plus Antibacterial Sutures. The products prevent post-surgery infection within stitches. In 2006, Johnson & Johnson acquired Pfizer's consumer healthcare business and merged it with its consumer healthcare business group. The acquisition added brands like Listerine, Bengay, and Neosporin to the company's portfolio. In the same year, Johnson & Johnson's Janssen Pharmaceuticals, launched Prezista, a protease inhibitor for patients with failed previous HIV therapies. In 2008, Johnson & Johnson acquired Mentor Corporation for $1 billion and merge its operations into Ethicon. In 2009, the company acquired HealthMedia, later renamed to Health & Wellness Solutions and the Human Performance Institute. In October 2010, J&J acquired Crucell for $2.4 billion. The subsidiary operates as the centre for vaccines, within Johnson & Johnson pharmaceuticals business group. In 2012, Alex Gorsky became chairman and CEO of Johnson & Johnson. In November 2015, Biosense Webster, Inc. acquired Coherex Medical Inc. expanding the company's range of treatment options for patients with atrial fibrillation. In 2017, Johnson & Johnson acquired Abbott Medical Optics from Abbott Laboratories for $4.325 billion, adding the new division into Johnson & Johnson Vision Care, Inc. in 2017. That same year, Johnson & Johnson acquired Actelion in a $30 billion deal, the largest ever purchase by the company. After the purchase, Johnson & Johnson spun off Actelion's research and development unit into a separate legal entity. In July 2017, Johnson & Johnson Vision Care, Inc acquired TearScience. In September 2017, the company acquired subscription-based contact lens startup Sightbox. In September of the same year Johnson & Johnson Medical GmbH acquired Emerging Implant Technologies GmbH, manufacturer of 3D-printed titanium interbody implants for spinal fusion surgery. In March 2019, the FDA approved esketamine for the treatment of severe depression, which is marketed as Spravato by Janssen Pharmaceuticals. In 2019, Johnson & Johnson announced the release of photochromic contact lenses. The lenses adjust to sunlight and help eyes recover from bright light exposure faster. The lenses contain a photochromic additive that adapts visible light amounts filtered to the eyes and are the first to use such additives. In November 2020, Johnson & Johnson acquired Momenta Pharmaceuticals for $6.5 billion. In January 2022, Joaquin Duato became CEO of Johnson & Johnson. In December 2022, Johnson & Johnson acquired cardiovascular medical technology company Abiomed Inc. for $16.6 billion. Johnson & Johnson began the separation of their consumer healthcare business segment in November 2021. In the split, Johnson & Johnson will retain the Johnson & Johnson name for prescription drugs and medical devices, while the second company will sell consumer health products and take over the Neutrogena, Aveeno, Tylenol, Listerine, Johnson's, Band-Aid and other brands. In September 2022, Johnson & Johnson chose Kenvue as the new name for its Consumer Health business. Kenvue went public through an IPO in May 2023, with Johnson & Johnson maintaining a controlling stake of around 91 percent. On July 24, 2023, Johnson & Johnson launched an exchange offer to split-off Kenvue. Following the completion of the exchange offer, Johnson & Johnson will retain approximately 9.5% of the outstanding shares of Kenvue common stock.In 2024, Johnson & Johnson sold off its remaining 9.5% stake in Kenvue, its former consumer products business. Johnson & Johnson holds a patent on the tuberculosis-treating drug bedaquiline, with secondary patents in at least 25 out of 43 countries with a high burden of tuberculosis blocking affordable generic versions of the drug, preventing millions of people from accessing the life-saving treatment. Though the patent was set to expire in many countries in 2023, Johnson & Johnson applied to extend the patent. On July 13, 2023, Stop TB Partnership announced that after negotiations with Johnson & Johnson, they had been granted licenses to produce generic versions of the drug. Johnson & Johnson announced several acquisitions in 2024: Ambrx Biopharma for $2 billion (in January), Shockwave Medical for $13.1 billion (in April), and Proteologix for $850 million (in May). In 2024, Johnson & Johnson MedTech released Polyphonic, a digital surgical platform. The platform features surgery planning, surgical video, and telepresence services for laparoscopic surgeries. In January 2025, Johnson & Johnson announced it would acquire neurological drug maker Intra-Cellular Therapies for $14.6 billion, a company specializing in medications for behavioral disorders, including schizophrenia, depression, and bipolar disorder. Coronavirus (COVID-19) response Johnson & Johnson committed over $1 billion toward the development of a not-for-profit COVID-19 vaccine in partnership with the Biomedical Advanced Research and Development Authority (BARDA) Office of the Assistant Secretary for Preparedness and Response (ASPR) at the U.S. Department of Health and Human Services (HHS). Paul Stoffels of Johnson & Johnson said, \"In order to go fast, the people of Johnson & Johnson are committed to do this and all together we say we're going to do this not for profit. That's the fastest and the best way to find all the collaborations in the world to make this happen so we commit to bring this at a not-for-profit level.\" Janssen Vaccines, in partnership with Beth Israel Deaconess Medical Center (BIDMC), is responsible for developing the vaccine candidate, based on the same technology used to make its Ebola vaccine. The vaccine candidate is expected to enter phase 1 human clinical study in September 2020. Demand for the product Tylenol surged two to four times normal levels in March 2020. In response, the company increased production globally. For example, the Tylenol plant in Puerto Rico ran 24 hours a day, seven days a week. In response to the shortage of ventilators, Ethicon, with Prisma Health, made and distributed the VESper Ventilator Expansion Splitter, which uses 3D printing technology, to allow one ventilator to support two patients. Janssen COVID-19 vaccine In June 2020, Johnson & Johnson and the National Institute of Allergy and Infectious Diseases (NIAID) confirmed its intention to start a clinical trials of J&J's vaccine in September 2020, with the possibility of Phase 1/2a human clinical trials starting at an accelerated pace in the second half of July. On August 5, 2020, the US government agreed to pay more than $1 billion to Johnson & Johnson (medical device company) for the production of 100 million doses of COVID-19 vaccine. As part of the agreed-upon deal, the U.S. can order up to 200 million additional doses of SARS-CoV-2 vaccine. In September 2020, Johnson & Johnson started its 60,000-person phase 3 adenovirus-based vaccine trial. The trial was paused on October 12, 2020, because a volunteer became ill, but the company said it found no evidence that the vaccine had caused the illness and announced on October 23, 2020, that it would resume the trial. In April 2021, the company reported that its COVID-19 vaccine achieved $100 million sales in the first quarter, accounting for less than 1% of its total revenue. JnJ Acquisition history Business segments The company's business is divided into two business segments: Innovative Medicine and MedTech. Johnson & Johnson Innovation, LLC (JJI) is a subsidiary of Johnson & Johnson. JJI focuses on early-stage, life science, and technology innovations to advance the company's research and development pipeline. JJI provides startups with sourcing, infrastructure, and capital equipment at JLABS, financing & venture capital at JJDC, Inc., and collaborations leading to the potential development of medical device technologies, pharmaceuticals, and therapeutics. There are 4 JJI Innovation Centers located in London, Shanghai, Boston (Cambridge), and the San Francisco Bay Area. There are 13 JLABS incubators located in the Bay Area (San Francisco and South San Francisco), Belgium (Beerse), Boston (Cambridge and Lowell), Houston (TMC), New York City, Philadelphia, San Diego, Shanghai, Toronto, and Washington, D.C. Innovative Medicine The Innovative Medicine (formerly known as pharmaceuticals) segment is focused on six therapeutic areas: immunology (rheumatoid arthritis, inflammatory bowel disease and psoriasis); infectious diseases (HIV/AIDS); neuroscience (mood disorders, neurodegenerative disorders and schizophrenia); oncology (solid tumours including lung cancer, prostate cancer and bladder cancer, and hematologic malignancies); cardiovascular, metabolism, retina (thrombosis and diabetes), and pulmonary hypertension (pulmonary arterial hypertension). MedTech The Cardiovascular & Specialty Solutions Group includes electrophysiology products that diagnose and treat cardiac arrhythmias; devices used in the endovascular treatment of hemorrhagic and ischemic stroke; solutions that focus on breast reconstruction and aesthetics, and ear, nose and throat procedures. The orthopaedics portfolio is composed of specialties including joint reconstruction, trauma, extremities, craniomaxillofacial, spinal surgery and sports medicine, in addition to the VELYS digital surgery portfolio. The surgery portfolio includes advanced surgical innovations and solutions such as sutures, staplers, energy devices, and advanced hemostats along with interventional ablation, surgical robotics, and digital solutions. The Johnson & Johnson Vision portfolio includes contact lenses, intraocular lens, automated treatment for dry eye, and four brands of laser vision correction systems. Finance For the fiscal year 2024, Johnson & Johnson reported earnings of $14.07 billion, with an annual revenue of $88.82 billion. Johnson & Johnson's shares traded at over $165 per share, and its market capitalization was valued at over $394 billion in March 2025. Pricing In 2023, the Institute for Clinical and Economic Review (ICER) identified Darzalex (daratumumab), developed by Johnson & Johnson as one of five high-expenditure drugs that experienced significant net price increases without new clinical evidence to justify the hikes. Specifically, Darzalex's wholesale acquisition cost rose by approximately 7.6%, leading to an additional $190 million in costs to U.S. payers. Corporate governance As of December 2024, the members of the board of directors of Johnson & Johnson are Joaquin Duato, Darius Adamczyk, Mary C. Beckerle, Jennifer A. Doudna, Marillyn A. Hewson, Paula A. Johnson, Hubert Joly, Mark B. McClellan, Anne M. Mulcahy, Mark A. Weinberger, Nadja Y. West, and Eugene A. Woods. As of December 2024, the members of the executive committee of Johnson & Johnson are Joaquin Duato, Vanessa Broadhurst, Liz Forminard, Kristen Mulholland, Tim Schmid, John C. Reed, James Swanson, Jennifer Taubert, Kathy E. Wengel, and Joseph J. Wolk. Joaquin Duato is chairman and chief executive officer. Chairmen Robert Wood Johnson I (1887–1910) James Wood Johnson (1910–1932) Robert Wood Johnson II (1932–1963) Philip B. Hofmann (1963–1973) Richard B. Sellars (1973–1976) James E. Burke (1976–1989) Ralph S. Larsen (1989–2002) William C. Weldon (2002–2012) Alex Gorsky (2012–2022) Joaquin Duato (2023–present) Ownership Institutional Investors hold 73.57% of outstanding shares. The ten largest shareholders as of December 2024: The Vanguard Group (9.67%) BlackRock (8.36%) State Street Corporation (5.58%) Geode Capital Management (2.40%) Morgan Stanley (1.82%) JPMorgan Chase (1.61%) State Farm (1.32%) Northern Trust (1.28%) Norges Bank (1.26%) Wellington Management Group (1.01%) Environmental record Johnson & Johnson has set several positive goals to keep the company environmentally friendly and was ranked third among the United States's largest companies in Newsweek's \"Green Rankings\". Some examples are the reduction in water use, waste, and energy use and an increased level of transparency. Johnson & Johnson agreed to change its packaging of plastic bottles used in the manufacturing process, switching their packaging of liquids to non-polyvinyl chloride containers. The corporation is working with the Climate Northwest Initiative and the EPA National Environmental Performance Track program. As a member of the national Green Power Partnership, Johnson & Johnson operates the largest solar power generator in Pennsylvania at its site in Fort Washington, Pennsylvania. Recalls and litigation 1982 Chicago Tylenol murders On September 29, 1982, a \"Tylenol scare\" began when the first of seven individuals died in Chicago metropolitan area, after ingesting Extra Strength Tylenol that had been deliberately laced with cyanide. Within a week, the company pulled 31 million bottles of capsules back from retailers, making it one of the first major recalls in American history. The incident led to reforms in the packaging of over-the-counter substances and to federal anti-tampering laws. The case remains unsolved and no suspects have been charged. Johnson & Johnson's quick response, including a nationwide recall, was widely praised by public relations experts and the media and was the gold standard for corporate crisis management. 2010 children's product recall On April 30, 2010, McNeil Consumer Healthcare, a subsidiary of Johnson & Johnson, voluntarily recalled 43 over-the-counter children's medicines, including Tylenol, Tylenol Plus, Motrin, Zyrtec and Benadryl. The recall was conducted after a routine inspection at a manufacturing facility in Fort Washington, Pennsylvania, United States, revealed that some \"products may not fully meet the required manufacturing specifications\". Affected products may contain a \"higher concentration of active ingredients\" or exhibit other manufacturing defects. Products shipped to Canada, Dominican Republic, Mexico, Guam, Guatemala, Jamaica, Puerto Rico, Panama, Trinidad and Tobago, the United Arab Emirates, Kuwait and Fiji were included in the recall. In a statement, Johnson & Johnson said \"a comprehensive quality assessment across its manufacturing operations\" was underway. A dedicated website was established by the company listing affected products and other consumer information. 2010 hip-replacement recall On August 24, 2010, DePuy, a subsidiary of American giant Johnson & Johnson, recalled its ASR (articular surface replacement) hip prostheses from the market. DePuy said the recall was due to unpublished National Joint Registry data showing a 12% revision rate for resurfacing at five years and an ASR XL revision rate of 13%. All hip prostheses fail in some patients, but it is expected that the rate will be about 1% a year. Pathologically, the failing prosthesis had several effects. Metal debris from wear of the implant led to a reaction that destroyed the soft tissues surrounding the joint, leaving some patients with long term disability. Ions of cobalt and chromium – the metals from which the implant was made – were also released into the blood and cerebrospinal fluid in some patients. In March 2013, a jury in Los Angeles ordered Johnson & Johnson to pay more than $8.3 million in damages to a Montana man in the first of more than 10,000 lawsuits pending against the company in connection with the now-recalled DePuy hip. Some lawyers and industry analysts have estimated that the suits ultimately will cost Johnson & Johnson billions of dollars to resolve. 2010 Tylenol recall In 2010 and 2011, Johnson & Johnson voluntarily recalled some over-the-counter products, including Tylenol, due to an odor caused by tribromoanisole. In this case, 2,4,6-tribromophenol was used to treat wooden pallets on which product packaging materials were transported and stored. Shareholders lawsuit In 2010 a group of shareholders sued the board for allegedly failing to take action to prevent serious failings and illegalities since the 1990s, including manufacturing problems, bribing officials, covering up adverse effects and misleading marketing for unapproved uses. The judge initially dismissed the case in September 2011, but allowed the plaintiffs opportunity to refile at a later time. In 2012 Johnson and Johnson proposed a settlement with the shareholders, whereby the company would institute new oversight, quality and compliance procedures binding for five years. Illegal marketing of Risperdal Juries in several US states have found J&J guilty of concealing the adverse effects of Janssen Pharmaceuticals' antipsychotic medication Risperdal, produced by its unit, to promote it to doctors and patients as better than cheaper generics, and of falsely marketing it for treating patients with dementia. States that have awarded damages include Texas ($158 million), South Carolina ($327 million), Louisiana ($258 million), and most notably Arkansas ($1.2 billion). In 2010, the United States Department of Justice joined a whistleblowers suit accusing the company of illegally marketing Risperdal through Omnicare, the largest company supplying pharmaceuticals to nursing homes. The allegations include that J&J were warned by the FDA to not promote Risperdal as effective and safe for elderly patients, but they did so, and that they paid Omnicare to promote the drug to care home physicians. The settlement was finalized on November 4, 2013, with J&J agreeing to pay a penalty of around $2.2 billion, \"including criminal fines and forfeiture totaling $485 million and civil settlements with the federal government and states totaling $1.72 billion\". Johnson & Johnson has also been subject to congressional investigations related to payments given to psychiatrists to promote its products and ghost write articles, notably Joseph Biederman and his pediatric bipolar disorder research unit. Foreign bribery In 2011, J&J settled litigation brought by the US Securities and Exchange Commission under the Foreign Corrupt Practices Act and paid around $70M in disgorgement and fines. J&J's employees had given kickbacks and bribes to doctors in Greece, Poland, and Romania to obtain business selling drugs and medical devices and had bribed officials in Iraq to win contracts under the Oil for Food program. J&J fully cooperated with the investigation once the problems came to light. Consumer fraud settlements In May 2017, J&J reached an agreement to pay $33 million to several states to settle consumer fraud allegations in some of the company's over-the-counter drugs. Use of the Red Cross symbol Johnson & Johnson registered the Red Cross as a U.S. trademark for \"medicinal and surgical plasters\" in 1905 and has used the design since 1887. The Geneva Conventions, which reserved the Red Cross emblem for specific uses, were first approved in 1864 and ratified by the United States in 1882. However, the emblem was not protected by U.S. law for the use of the American Red Cross (ARC) and the U.S. military until after Johnson & Johnson had obtained its trademark. A clause in this law (now 18 U.S.C. 706) permits this pre-existing use of the Red Cross to continue. A declaration made by the U.S. upon its ratification of the 1949 Geneva Conventions includes a reservation that pre-1905 U.S. domestic uses of the Red Cross, such as Johnson & Johnson's, would remain lawful as long as the cross is not used on \"aircraft, vessels, vehicles, buildings or other structures, or upon the ground\", i.e., uses which could be confused with its military uses. This means that the U.S. did not agree to any interpretation of the 1949 Geneva Conventions that would overrule Johnson & Johnson's trademark. The American Red Cross continues to recognize the validity of Johnson & Johnson's trademark. In August 2007, Johnson & Johnson filed a lawsuit against the ARC, demanding that the charity halt the use of the red cross symbol on products it sells to the public, though the company takes no issue with the charity's use of the mark for nonprofit purposes. In May 2008, the judge in the case dismissed most of Johnson & Johnson's claims, and a month later the two organizations announced a settlement had been reached in which both parties would continue to use the symbol. Boston Scientific lawsuits Since 2003, Johnson & Johnson and Boston Scientific have both claimed that the other had infringed on their patents covering heart stent medical devices. The litigation was settled when Boston Scientific agreed to pay $716 million to Johnson & Johnson in September 2009 and an additional $1.73 billion in February 2010. Their dispute was renewed in 2014, now on the grounds of a contract dispute. Patent-infringement case against Abbott In 2007, Johnson & Johnson sued Abbott Laboratories over the development and sale of the arthritis drug Humira, claiming Abbott used technology licensed exclusively to Johnson & Johnson's Centocor division. Johnson & Johnson won the court case, and in 2009 Abbott was ordered to pay Johnson & Johnson $1.17 billion in lost revenues and $504 million in royalties. The judge also added $175.6 million in interest to bring the total to $1.84 billion. This was the largest patent-infringement award in U.S. history until the 2013 decision against Teva in favor of Takeda and Pfizer for over $2.1 billion. In 2010 Abbott appealed the verdict and in 2011 won the appeal. Vaginal mesh implants Tens of thousands of women worldwide have taken legal action against Johnson & Johnson after suffering serious complications following a vaginal mesh implant procedure. In Australia, more than 700 women began a class action against the company in the Federal Court of Australia in 2017, telling the court they \"suffered irreparable, debilitating pain after the devices began to erode into surrounding tissue and organs, causing infections and complications\". The class action alleged that Johnson & Johnson, which \"aggressively marketed\" the implants \"failed to properly warn patients and surgeons of the risk, or test the devices adequately\". Emails between executives show the company was aware of the risks in 2005 but still went ahead and made the product available. In November 2019 the Federal Court of Australia found Johnson & Johnson negligent. The judgment was appealed, with the appeals court upholding all findings of Justice Anna Katzman. Ethicon then sought a High Court decision but this was not permitted by the High Court of Australia. Subsequently (September 2022) a A$300,000,000 compensation agreement was reached between Shine Lawyers and J&J but this agreement remains subject to approval by the Federal Court of Australia. In the US in 2016 the U.S. states of California and Washington filed a lawsuit against the company, accusing it of deception. In October 2019, the company and its subsidiary, Ethicon, Inc. reached a settlement with 41 states and the District of Columbia, with no admission of liability, in a suit alleging deceptive marketing of transvaginal surgical-mesh devices. The suit also alleges that the company failed to disclose risks associated with the product, which J&J pulled from the US market in 2012. The amount settled in the suit was about $117 million. Baby powder J&J has been the subject of over 60,000 lawsuits claiming that its baby powder causes ovarian cancer. The lawsuits focus on claims that the talc-based powder is contaminated with asbestos, a known carcinogen commonly found in places where talc is mined. In 2016, J&J was ordered to pay $72 million in damages to the family of Jacqueline Fox, a 62-year-old woman who died of ovarian cancer in 2015. The company said it would appeal. A year later, over 1,000 U.S. women had sued J&J for covering up the possible cancer risk from its Baby Powder product. The company says that 70% of its Baby Powder is used by adults. Later that year, a California jury ordered Johnson & Johnson to pay $417 million to a woman who claimed she developed ovarian cancer after using the company's talc-based products like Johnson's Baby Powder for feminine hygiene. The verdict included $70 million in compensatory damages and $347 million in punitive damages. J&J said they would appeal the verdict. The Missouri Eastern District appeals court later negated a $72 million jury verdict in the Jacqueline Fox lawsuit, ruling it lacked jurisdiction in Missouri because of a U.S. Supreme Court decision that imposed limits on where injury lawsuit can be filed. Subsequently, this ruling killed three other recent St. Louis jury verdicts of more than $200 million combined. Fox, 62, of Birmingham, Alabama, died in 2015, about four months before her trial was held in St. Louis Circuit Court. She was among 65 plaintiffs, of whom only two were from Missouri. A St. Louis jury awarded nearly $4.7 billion in damages to 22 women and their families in 2018 after they claimed that asbestos in Johnson & Johnson talcum powder caused their ovarian cancer. In August, J&J said that it removed several chemicals from baby powder products and re-engineered them to make consumers more confident that products were safer for children. The company was forced to release internal documents with 11,700 people suing J&J over cancers allegedly caused by baby powder. The documents showed that the company had known about asbestos contamination since at least as early as 1971 and had spent decades finding ways to conceal the evidence from the public. The company lost its request to reverse a jury verdict that ruled in favor of the accusers, which required the company to pay $4.14 billion in punitive damages and $550 million in compensatory damages. A large study performed in 2003 found that ovarian cancer risk increased from a baseline of 0.0121% to 0.0161% in people who reported regularly using talc in the genital area. Two more studies over the next twelve years, which also relied on self-reporting, had similar results; however, none of the three studies showed a relationship between how long someone used talc and how much their cancer risk increased, which is expected in experiments with carcinogens and other toxic substances (see dose–response relationship). Conversely, a St. Louis jury ruled in favor of Johnson & Johnson in the case of a single plaintiff who had used the company's talc-containing baby powder for thirty years with a similar claim. The company's CEO, Alex Gorsky, declined to appear at a United States congressional hearing on the safety of J&J's Baby Powder and other talc-based cosmetics. J&J spokesman Ernie Knewitz said that the subcommittee had rejected the company's offers to send a talc testing expert or a J&J executive in charge of consumer products. In response to declining demand, J&J announced it would discontinue the sale of talc-based baby powder in the United States and Canada in 2020, but would continue to sell it in other markets. In a statement, the company said that the existing retail inventory of the talc-based powder will sell until it runs out, while the company's cornstarch-based baby powder will continue to sell in the United States and Canada. The Supreme Court of Missouri refused to consider J&J's appeal of a $2.12 billion damages award to women who blamed their ovarian cancer on its talc-based products. The Supreme Court of the United States also refused to consider an appeal from J&J, leaving in place a judgment from a state appeal court that had cut the original award to $2.1 billion. Two of the justices had to recuse: Samuel Alito because either he and/or his wife owning or recently owning stock in J&J, and Brett Kavanaugh, whose father led an industry group lobbying against safety warnings on talc products. Representing the affected women during the trial, Mark Lanier remarked that the Supreme Court's decision sent \"a clear message to the rich and powerful: You will be held to account when you cause grievous harm under our system of equal justice under law.\" J&J had argued that the combined claims in the St. Louis trial were too different, yet the short jury deliberation and identical payouts were, therefore, a violation of the company's due process and also that the high punitive award was unconstitutional. In 2021, Johnson & Johnson subsidiary LTL Management LLC, using a process called a Texas divisional merger, filed for Chapter 11 bankruptcy in North Carolina. The process allowed by Texas law lets a company create a separate subsidiary to take over liabilities, with the existing company operating normally. The new company, with a different name, can locate in a state such as North Carolina where bankruptcy laws are different, and then declare bankruptcy, paying less than the original company would have. In the case of LTL, a $2 billion trust will be created, compared to $25 billion if Johnson & Johnson had declared bankruptcy. According to the filing, a company known as Old JJCI took on the baby powder related liabilities in 1979, while Johnson & Johnson remained a defendant. LTL and New JJCI were created with LTL taking the baby powder related liabilities and some assets, and New JJCI taking the remaining assets. Johnson & Johnson says LTL is now based in New Jersey. The company announced that it would stop making talc-based powder by 2023 and replace it with cornstarch-based powders. The company says the talc-based powder is safe to use and does not contain asbestos. Lawsuits showed connections between Johnson & Johnson and the Holmesburg Prison experiments. In 2023, the number of lawsuits regarding talc-based baby powder exceeded 40,000 as more claimants came forward to say that the company's product caused them to have cancer. Johnson & Johnson offered $9 billion to settle all the lawsuits against the company, up from the previous figure of $2 billion. In February 2025, as the number of talc-based powder related lawsuits sits at over 62,000, Johnson & Johnson offered a settlement of $10 billion to end litigation, funded by a subsidiary's filing for Chapter 11 bankruptcy, reliant on the approval from Houston bankruptcy judge, Judge Christopher Lopez. While the proposal showed significantly more support compared to their last bankruptcy attempts, there are accusations of the company pushing against negative votes, and widely accepting positive ones. Adam Silverstein, an attorney representing plaintiffs rejecting the proposal, branded the move as a \"blatant double standard\" in a statement to Lopez. The judged ultimately denied J&J's attempt. In October 2025, a Los Angeles court ordered J&J to pay $966 million to the family of a woman who died from mesothelioma in 2021. The ruling came days after a South Carolina court rejected a lawsuit of a man that similarly claimed asbestos fibers in baby powder caused his cancer. J&J called the ruling unconstitutional and said it would appeal. Since this ruling, J&J has seen a 17% rise in talc cancer related suits. Opioid epidemic By 2018, the company had become embroiled in the opioid epidemic in the United States and had become a target of lawsuits. Over 500 opioid-related cases have been filed as of May 2018 against J&J and its competitors. In Idaho, J&J is part of a lawsuit accusing the company for being partially to blame for opioid-related overdose deaths. The first major trial began in Oklahoma in May 2019. On August 26, 2019, the Oklahoma judge ordered J&J to pay $572 million for their part in the opioid crisis, and in October J&J paid $20.4 million to two Ohio counties fighting the opioid epidemic. In January 2022, Johnson & Johnson agreed to pay up to $5 billion as part of a $26 billion settlement which included McKesson, AmerisourceBergen, and Cardinal Health. Had the states gone to court, the companies could have faced up to $95 billion in penalties. Northeastern Ohio Settlement In October 2019, the company agreed to a settlement of $20.4 million with northeastern Ohio's most populous counties of Cuyahoga (containing Cleveland) and Summit (Akron). The settlement allows the company avoidance of a trial accusing J&J and many other pharmaceutical manufacturers of helping to spark the US opioid epidemic. The trial was thought to be an indicator for thousands of opioid-related lawsuits against many drug manufacturers. The arrangement, which contains no admission of liability by the company, provides the counties $10 million in cash, $5 million for legal expenses and $5.4 million in contributions to opioid-related nonprofit organizations in the counties. Public-private engagement Johnson & Johnson and its subsidiaries engage with the public and private sectors in a variety of settings including to promote research and development, academic funding, event sponsorship, philanthropy, and political lobbying. Academia J&J is a matching gift donor to the Institute for Advanced Study. Activism J&J is a corporate partner of Human Rights Campaign, a large LGBT advocacy group. J&J is a financial supporter of Women Deliver. Political lobbying Johnson & Johnson is engaged in various forms of lobbying in the United States, Canada and internationally, including through corporate philanthropy and membership in lobbying organizations. J&J is one of the largest donors to the Foundation for the National Institutes of Health (FNIH), having donated $5–10 million from 2000 to 2020. J&J is a partner of the Pandemic Action Network. J&J is a member company of the Biotechnology Innovation Organization (BIO) and the Pharmaceutical Research and Manufacturers of America (PhRMA), trade associations that lobby the U.S. Government on behalf of the Biotechnology Industry and pharmaceutical industry. BIO and PhRMA have offices in Washington, D.C., with PhRMA also having locations in Japan and the United Arab Emirates. J&J is a member of the Personalized Medicine Coalition, a medical research advocacy group that lobbies on behalf of the pharmaceutical industry to increase funding for personalized medicine research and development. J&J is a member company of the National Pharmaceutical Council (NPC), a nonprofit that advocates for expanded research funding and innovation. Research and development J&J has provided research grants and major funding to the C. D. Howe Institute."
}