{
  "ticker": "K",
  "cik": "0000055067",
  "company_name": "Kellanova",
  "corrected_name": "Kellanova",
  "wiki_title_used": "Kellanova",
  "exists": true,
  "raw_text": "Kellanova, formerly known as the Kellogg Company, is an American multinational food manufacturing company headquartered in Chicago, Illinois. The renaming took effect on October 2, 2023, and the company's North American cereal operations were spun off to form the WK Kellogg Co at the same time. Kellanova produces and markets convenience foods and snack foods, including crackers and toaster pastries, cereal, and markets their products by several well-known brands including Kellogg's, Rice Krispies Treats, Pringles, Eggo, and Cheez-It.  Outside North America, Kellanova markets cereals such as Corn Flakes, Rice Krispies, Frosties and Coco Pops.\nKellanova's products are manufactured and marketed in over 180 countries. Kellanova's largest factory is at Trafford Park in Greater Manchester, United Kingdom, which is also the location of its UK headquarters. Other corporate office locations outside of Chicago include Battle Creek, Dublin (European Headquarters), Shanghai, and Querétaro City, Mexico. As Kellogg's, the company held a Royal Warrant from Queen Elizabeth II until her death in 2022.\nKellogg's was split into two companies on October 2, 2023, with WK Kellogg Co owning the North American cereal division, and the existing company being rebranded to \"Kellanova\", owning snack brands such as Pop-Tarts and Pringles alongside the international cereal division. The purpose of the split was to separate the convenience food, and international cereal products market, from the North American cereal market. Thus facilitating the former Ferrero takeover. \"Kellogg's\" itself became a brand name of both companies.\nMars Inc., the owner of M&M's and Snickers, agreed to acquire Kellanova for nearly $30 billion in August 2024.\n\nHistory\nIn 1876, John Harvey Kellogg became the superintendent of the Battle Creek Sanitarium (originally the Western Health Reform Institute founded by Ellen White), and his brother, W. K. Kellogg, worked as the bookkeeper. This is where corn flakes were created and led to the eventual formation of the Kellogg Company.\nFor years, W. K. Kellogg assisted his brother in research to improve the vegetarian diet of the Battle Creek Sanitarium's patients, especially in the search for wheat-based granola. The Kelloggs are best known for the invention of the famous breakfast cereal corn flakes. The development of the flaked cereal in 1894 has been variously described by those involved: Ella Eaton Kellogg, John Harvey Kellogg, his younger brother Will Keith Kellogg, and other family members. There is considerable disagreement over who was involved in the development and the roles that they played.\nIt is generally agreed that, upon being called out one night, John Kellogg left a batch of wheat-berry dough behind. Rather than throwing it out the following day, he sent it through the rollers and was surprised to obtain delicate flakes, which could then be baked.\nW. K. Kellogg persuaded his brother to serve the food in a flake form. Soon the flaked wheat was being packaged to meet hundreds of guest mail-order requests after they left the Sanitarium. However, John forbade his brother Will to distribute the cereal beyond his own consumers. As a result, the brothers fell out, and W. K. launched the Battle Creek Toasted Corn Flake Company on February 19, 1906. On July 4, 1907, a fire destroyed the main factory building. W. K. Kellogg had the new plant in full operation six months after the fire.\nConvincing his brother to relinquish rights to the product, Will's company produced and marketed the hugely successful Kellogg's Toasted Corn Flakes and was renamed to the Kellogg Toasted Corn Flake Company in 1909 and to the Kellogg Company in 1922. By 1909, Will's company produced 120,000 cases of Corn Flakes daily. John, who resented his brother's success, filed suit against Will's company in 1906 for the right to use the family name. The resulting legal battle, which included a trial that lasted an entire month, ended in December 1920 when the Michigan Supreme Court ruled in Will's favor.\n\nIn 1931, the Kellogg Company announced that most of its factories would shift towards 30-hour work weeks from the usual 40.  W. K. Kellogg stated that he did this so that an additional shift of workers would be employed to support people through the depression era. This practice remained until World War II and continued briefly after the war, although some departments and factories remained locked into 30-hour work weeks until 1980.\nThe company went public in 1952. In 1964, Kellogg's introduced its first non-cereal product: a pastry which can be heated in a toaster, called Pop-Tarts. From 1969 to 1970, the slogan “Kellogg's puts more into your day” was used on Sunday morning TV shows. From 1969 to 1977, Kellogg's acquired various small businesses, including Salada Tea, Fearn International, Mrs. Smith's Pies, Eggo, and Pure Packed Foods; however, it was later criticized for not diversifying further, as General Mills and Quaker Oats had. After underspending its competition in marketing and product development, Kellogg's US market share hit a low of 36.7% in 1983. According to Kellogg's chairman William E. LaMothe, a prominent Wall Street analyst had described Kellogg's \"a fine company that's past its prime,\" and the cereal market was being regarded as \"mature\". LaMothe and his team took this critique as a challenge, shifting their focus to approaching the demographic of 80 million baby boomers rather than marketing children-oriented cereals. In emphasizing cereal's convenience and nutritional value, Kellogg's helped persuade U.S. consumers aged 25 to 49 to eat 26% more cereal than people of that age ate five years prior. The U.S. ready-to-eat cereal market, worth $3.7 billion at retail in 1983, totaled $5.4 billion by 1988 and had expanded three times as fast as the average grocery category. Kellogg's also introduced new products, including Crispix, Raisin Squares, and Nutri-Grain Biscuits, and reached out internationally with Just Right aimed at Australians and Genmai Flakes for Japan. During this time, the company maintained success over its top competitors, General Mills, which largely marketed children's cereals, and Post, which had difficulty in the adult cereal market.\n\n21st century\nIn 2001, Kellogg's acquired the Keebler Company for $3.87 billion. Over the years, it has also gone on to acquire Morningstar Farms and Kashi divisions or subsidiaries. Kellogg's also owns the Bear Naked, Natural Touch, Cheez-It, Murray, Austin cookies and crackers, Famous Amos, Gardenburger (acquired 2007), and Plantation brands. Presently, Kellogg's is a member of the World Cocoa Foundation.\nIn 2005, Kellogg's acquired Kraft's fruit snack business and with it the license for Nickelodeon fruit snacks.\nIn 2012, Kellogg's became the world's second-largest snack food company (after PepsiCo) by acquiring the potato chip brand Pringles from Procter & Gamble for $2.7 billion in a cash deal.\nIn 2017, Kellogg's acquired Chicago-based food company Rxbar for $654 million. Earlier that year, Kellogg's also opened new corporate office space in Chicago's Merchandise Mart for its global growth and IT departments. In the UK, Kellogg's also released the W. K. Kellogg brand of organic, vegan and plant-based cereals (such as granolas, organic wholegrain wheat, and \"super grains\") with no added sugars.\nIn 2018, Kellogg's decided to cease their operations in Venezuela due to the economic crisis in the country. Their factories were taken by the Venezuelan state under the Nicolás Maduro administration. In mid-2019, Venezuelan Kellogg's cereal boxes began portraying the Venezuelan flag and a motto from Maduro: \"Together, everything is possible\" (Spanish: Juntos todo es posible) alongside Kellogg's logo and mascots were sold all over the country. Kellogg's considers it as an illicit use, and the company stated they would take legal action.\nOn April 1, 2019, it was announced that Kellogg's was selling Famous Amos, Murray's, Keebler, Mother's, and Little Brownie Bakers (one of the producers of the cookies for the Girl Scouts of the USA) to Ferrero SpA for $1.4 billion. On July 29, 2019, that sale was completed.  Kellogg's kept the Keebler cracker line and replaced the Keebler name on their crackers with the Kellogg's name.\nIn October 2019, Kellogg's partnered with GLAAD by \"launching a new limited edition \"All Together Cereal\" and donating $50,000 to support GLAAD's anti-bullying and LGBTQ advocacy efforts\".  The All Together cereal consists of six mini cereal boxes combined into one package.\nIn January 2020, Kellogg's decided to work with suppliers to phase out the use of glyphosate by 2025, which some farmers have used as a drying agent for wheat and oats supplied to Kellogg's.\nIn October 2021, workers at all of Kellogg's cereal-producing plants in the United States went on a strike conducted by the Bakery, Confectionery, Tobacco Workers and Grain Millers' International Union over disagreements over the terms of a new labor contract. On December 3, 2021, a tentative deal was struck to end the worker strike, but the union members overwhelmingly rejected the tentative agreement and Kellogg's management announced they would seek to replace all 1,400 striking workers. On December 21, 2021, about 1,400 Kellogg workers approved a collective bargaining agreement, ending the strike, which had lasted 77 days.\nOn June 21, 2022, Kellogg's announced a plan to spin off its three cereal, snacks, and plant-based food divisions into separate companies. The North American cereal and plant-based food spin-off companies were to keep Battle Creek as their headquarters and the new snack and international cereal company will be based in Chicago. The successor company, known as Global Snacking Co. temporarily, represented 80 percent or $11.4 billion of Kellogg's sales. 60 percent of Global Snacking's business was snacks, and nearly half of the company's business was in the United States. The cereal business, temporarily called North America Cereal Co., was to be the second-largest American cereal company and the largest in Canada and the Caribbean, with 5 of the top 11 brands and $2.4 billion in annual sales. Plant-based foods, representing $340 million in annual sales, were to be called \"Plant Co.\" and could potentially be sold.\nIn January 2023, Kellogg's shelved its plans to spin off its plant food business and retained it as part of Global Snacking Co. On March 15, 2023, Kellogg's announced that North America Cereal Co. branch will be named WK Kellogg Co and Global Snacking Co. branch will be called Kellanova. The split was structured with Kellanova as the surviving company, using the ticker symbol \"K\" on the NYSE. The WK Kellogg Co took the NYSE stock symbol \"KLG\". The split was completed on October 2, 2023.\nOn August 14, 2024, Mars Inc., the owner of M&M's and Snickers, agreed to purchase Kellanova for nearly $30 billion.  The purchase, originally planned to close in the first half of 2025 was approved by the FTC in the US but as of October 2025 faced scrutiny by EU competition authorities.\n\nOperations\nFinances\nFor the fiscal year 2017, Kellogg's reported earnings of US$1.269 billion, with an annual revenue of US$12.932 billion, a decline of 0.7% over the previous fiscal cycle. Kellogg's market capitalization was valued at over US$22.1 billion in November 2018.\n\nBrands\nCereal\nHere is a list of Kellanova's cereals (international only) with available varieties:\n\nDiscontinued cereals and foods\nMarketing\nVarious methods have been used in the company's history to promote the company and its brands. Foremost among these is the design of the Kellogg's logo by Ferris Crane under the art direction of type guru Y. Ames.  Another was the well-remembered jingle \"K E double-L, O double-good, Kellogg's best to you!\".\nWith the rising popularity of patent medicine in early 20th century advertising, The Kellogg Company of Canada published a book named A New Way of Living that showed readers \"how to achieve a new way of living; how to preserve vitality; how to maintain enthusiasm and energy; how to get the most out of life because of a physical ability to enjoy it\". It touted the All-Bran cereal as the secret to leading \"normal\" lives free of constipation.\nKellogg's was a major sponsor throughout the run of the hit CBS panel show What's My Line? It and its associated products Frosted Flakes and Rice Krispies were also major sponsors for the PBS Kids children's animated series Dragon Tales.\nKellogg's was a sponsor of USA Gymnastics and produced the Kellogg's Tour of Gymnastics, a 36-city tour held in 2016 after the Olympic games and featured performances by recent medal-winning gymnasts from the United States.\nKellogg's is currently the title sponsor of three college football bowl games.  In 2019, Kellogg's became the new title sponsor of the Sun Bowl game, with the game being branded as the \"Tony the Tiger Sun Bowl\". This was followed in 2020 by the company using its Cheez-It brand to sponsor of the game now known as the Pop-Tarts Bowl. In 2022, Kellogg's added the Citrus Bowl to its bowl sponsorships, with the game branded as the \"Cheez-It Citrus Bowl\".\n\nPremiums and prizes\nW. K. Kellogg was the first to introduce prizes in boxes of cereal.  The marketing strategy that he established has produced thousands of different cereal box prizes that have been distributed by the tens of billions.\n\nChildren's premiums\nBeginning in 1909, Kellogg's Corn Flakes had the first cereal premium with The Funny Jungleland Moving Pictures Book. The book was originally available as a prize that was given to the customer in the store with the purchase of two packages of the cereal. But in 1909, Kellogg's changed the book giveaway to a premium mail-in offer for the cost of a dime. Over 2.5 million copies of the book were distributed in different editions over a period of 23 years.\n\nCereal box prizes\nIn 1945, Kellogg's inserted a prize in the form of pin-back buttons into each box of Pep cereal. Pep pins have included U.S. Army squadrons as well as characters from newspaper comics and were available through 1947. There were five series of comic characters and 18 different buttons in each set, with a total of 90 in the collection.  Other manufacturers of major brands of cereal, including General Mills, Malt-O-Meal, Nestlé, Post Foods, and Quaker Oats, followed suit and inserted prizes into boxes of cereal to promote sales and brand loyalty.\n\nMascots\nLicensed brands have been omitted since the corresponding mascots would be obvious (for example, Spider-Man is the mascot for Spider-Man Spidey-Berry).\n\nMotorsports\nKellogg's made its first foray into auto racing between 1991 and 1992 when the company sponsored the #41 Chevrolets fielded by Larry Hedrick Motorsports in the NASCAR Winston Cup Series and driven by Phil Parsons, Dave Marcis, Greg Sacks, Hut Stricklin, and Richard Petty, but they gained greater prominence for their sponsorship of two-time Winston Cup Champion Terry Labonte from 1993 to 2006, the last 12 years of that as the sponsor for Hendrick Motorsports' No.5 car. Kellogg's sponsored the No.5 car for Labonte, Kyle Busch, Casey Mears, and Mark Martin until 2010, and it then served as an associate sponsor for Carl Edwards' #99 car for Roush Fenway Racing.\nKellogg's placed Dale Earnhardt on Kellogg's Corn Flakes boxes for 1993 six-time Winston Cup champion and 1994 seven-time Winston Cup champion, as well as Jeff Gordon on the Mini Wheats box for the 1993 Rookie of the Year, 1995 Brickyard 400 inaugural race, 1997 Champion, and 1998 three-time champion, and a special three-pack racing box set with Dale Earnhardt, Jeff Gordon, Terry Labonte, and Dale Jarrett in 1996.\n\nMerchandising\nKellogg's has used some merchandising for their products. Entertainer Jimmy Durante appeared in some Kellogg's commercials in the 1960s. Kellogg's once released Mission Nutrition, a PC game that came free with special packs of cereal. It played in a similar fashion as Donkey Kong Country; users could play as Tony the Tiger, Coco the Monkey, or Snap, Crackle, and Pop.\nKellogg's has also released \"Talking\" games. The two current versions are Talking Tony and Talking Sam. In these games, a microphone is used to play games and create voice commands for their computers. In Talking Tony, Tony the Tiger, a famous Kellogg's mascot, would be the main and only character in the game. In Talking Sam, Toucan Sam, would be in the game, instead. Some [toy cars] have the Kellogg's logo on them, and occasionally their mascots. There was also a Talking Snap Crackle and Pop software.\n\nOlympic Games\nKellogg's frequently partners with the U.S. Olympic Committee to feature American athletes from the U.S. Olympic and Paralympic Teams on the packages of its cereal brands. In 2011 it became an official sponsor for the 2012, 2014 and 2016 U.S. Olympic and Paralympic Teams. Its sponsorship at the 2018 Winter Olympic Games featured American athletes Nathan Chen, Kelly Clark, Meghan Duggan and Mike Schultz. The sponsorship was renewed for the 2018 and 2020 Olympic and Paralympic Games.\n\nRestaurant\nFrom 2016 to 2019, Kellogg's operated \"Kellogg's NYC\", a branded café in New York City that sold bowls of cereal with optional toppings.\n\nPolitical involvement\nGenetically modified foods labeling\nKellogg's donated around US$2 million opposing California Proposition 37, a 2012 ballot initiative that, if enacted, would have required compulsory labeling of genetically engineered food products. In March 2016, though, they vowed to label all of their products with genetically modified organisms as such by 2020.\n\nClimate change\nIn August 2014, Kellogg's called on the President to support the Paris Agreement on climate change. In 2016, Kellogg Company urged President-elect Donald Trump to \"continue the Paris Climate Agreement\".\n\nVoter ID laws\nKellogg's has donated to notable groups opposing voter-ID laws, such as the Applied Research Center (now RaceForward).  The company also decided to remove their advertisements from the Breitbart News website. Breitbart News in turn called for a boycott of Kellogg's products.\n\nEducation grant\nIn January 2012, Kellogg's gave the Calhoun School a $250,000 grant for a \"three-part youth-based project on issues of white privilege and institutionalized racism\". As of 2024, Kellanova has total assets of over $15,000,000,000.\n\nControversies\nMisleading claims\nAdvertising\nOn June 3, 2010, Kellogg's was found to be making unsubstantiated and misleading claims in advertising their cereal products by the Federal Trade Commission (FTC). Kellogg's responded by stating \"We stand behind the validity of our product claims and research, so we agreed to an order that covers those claims. We believe that the revisions to the existing consent agreement satisfied any remaining concerns.\"\nThe FTC had previously found fault with Kellogg's claims that Frosted Mini-Wheats cereal improved kids' attentiveness by nearly 20%. The Children's Advertising Review Unit of the Council of Better Business Bureaus has also suggested that the language on Kellogg Pop-Tarts packages saying the pastries are \"Made with Real Fruit\" should be taken off the products. In July 2012, the UK banned a \"Special K\" advertisement due to its citing caloric values that did not take into account the caloric value of milk consumed with the cereal. In 2016 an ad telling UK consumers that Special K is “full of goodness” and “nutritious” was banned.\nIn 2016, it was revealed that members of the Kellogg Breakfast Council, a group of nutrition experts purported to be \"independent\" on their website, were in fact paid an annual stipend by Kellogg to promote the brand's products online, in speeches, and amongst their peers. The company responded by saying that they assumed their sponsorship was implied by putting their name on the group, but agreed to stop describing the council as independent. The council was disbanded in May 2016 following the expiration of its members' contracts.\n\nQuestionable nutritional value\nSome of Kellogg's marketing has been questioned in the press, prompted by an increase in consumer awareness of the mismatch between the marketing messages and the products themselves.\nFood bloggers are also questioning the marketing methods used by cereal manufacturing companies such as Kellogg's, due to their high sugar content and use of ingredients such as high-fructose corn syrup.\n\n2021 Pop-Tarts lawsuit\nA class-action lawsuit was filed by attorney Spencer Sheehan in October 2021 claiming they did not put enough strawberries in their strawberry flavored Pop-Tarts, and seeking $5 million in damages. In April 2022, the lawsuit was dismissed by a federal judge.\nSheehan filed another lawsuit against Kellogg's in 2021, with the plaintiff claiming that Kellogg's defrauded customers regarding the contents of its Frosted Chocolate Fudge Pop-Tarts. The plaintiff stated she would not have purchased the Pop-Tarts had she known they did not contain milk, milkfat, or butter.  In June 2022, a US district judge dismissed the lawsuit, stating that a reasonable consumer would not expect those ingredients.\n\nRecalls\n2010 cereal recall\nOn June 25, the company voluntarily began to recall about 28 million boxes of Apple Jacks, Corn Pops, Froot Loops and Honey Smacks because of an unusual smell and flavor from the packages' liners that could make people ill. Kellogg's said about 20 people complained about the cereals, including five who reported nausea and vomiting. Consumers reported the cereal smelled or tasted waxy or like metal or soap. Company spokeswoman J. Adaire Putnam said some described it as tasting stale. However, no serious health problems had been reported.\nThe suspected chemical that caused the illnesses was 2-methylnaphthalene, used in the cereal packaging process. Little is known about 2-methylnaphthalene's impact on human health as the Food and Drug Administration has no scientific data on its impact on humans, and the United States Environmental Protection Agency (EPA) also does not have health and safety data regarding it. This is despite the EPA having sought information on it from the chemical industry for 16 years.  2-Methylnaphthalene is a component of crude oil and is \"structurally related to naphthalene, an ingredient in mothballs and toilet-deodorant blocks\" that the EPA considers a possible human carcinogen.\nKellogg's offered consumers refunds in the meantime. Only products with the letters \"KN\" following the use-by date were included in the recall. The products were distributed throughout the US and began arriving in stores in late March 2010. Products in Canada were not affected.\n\n2012 cereal recall\nKellogg's issued a voluntary recall of some of its \"Frosted Mini-Wheats Bite Size Original\" and \"Mini-Wheats Unfrosted Bite Size\" products due to the possibility of flexible metal mesh fragments in the food. The affected products varied in size from single-serving bowls to large 70-ounce cartons. Use-by dates printed on the recalled packages ranged from April 1, 2013, to September 21, 2013, and were accompanied by the letters KB, AP or FK.\n\nHuman rights violations and strikes\nHuman right violations of palm oil in 2016\nAccording to Amnesty International in 2016, Kellogg's palm oil provider Wilmar International profited from 8 to 14-year-old child labor and forced labor. Some workers were extorted, threatened or not paid for work. Some workers suffered severe injuries from chemicals such as Paraquat. Kellogg's alleged not being aware of the child abuses due to traceability; Amnesty's human rights director replied that \"Using mealy-mouthed excuses about 'traceability' is a total cop-out.\"\n\n2021 strike\nIn October 2021, over a thousand employees at four Kellogg's manufacturing plants in the United States went on strike for better working conditions and higher wages. Two months into the strikes, Kellogg's fired all the striking workers and posted their jobs in December after negotiations with the BCTGM union failed. During the talks, Kellogg's had threatened to move jobs to Mexico if the union did not agree to Kellogg's proposal. Kelloggs also filed a lawsuit against the union. As a result, several calls for a boycott went viral on social media.\n\nSee also\nW. K. Kellogg Foundation\nKellogg's Cereal City USA – a former tourist attraction in Battle Creek, Michigan focused on the company's history\nList of breakfast cereals\nToucan Sam#Maya Archaeology Initiative for a 2011 trademark dispute over another organization's toucan logo\nA. D. David Mackay\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Kellanova:",
  "clean_text": "Kellanova, formerly known as the Kellogg Company, is an American multinational food manufacturing company headquartered in Chicago, Illinois. The renaming took effect on October 2, 2023, and the company's North American cereal operations were spun off to form the WK Kellogg Co at the same time. Kellanova produces and markets convenience foods and snack foods, including crackers and toaster pastries, cereal, and markets their products by several well-known brands including Kellogg's, Rice Krispies Treats, Pringles, Eggo, and Cheez-It. Outside North America, Kellanova markets cereals such as Corn Flakes, Rice Krispies, Frosties and Coco Pops. Kellanova's products are manufactured and marketed in over 180 countries. Kellanova's largest factory is at Trafford Park in Greater Manchester, United Kingdom, which is also the location of its UK headquarters. Other corporate office locations outside of Chicago include Battle Creek, Dublin (European Headquarters), Shanghai, and Querétaro City, Mexico. As Kellogg's, the company held a Royal Warrant from Queen Elizabeth II until her death in 2022. Kellogg's was split into two companies on October 2, 2023, with WK Kellogg Co owning the North American cereal division, and the existing company being rebranded to \"Kellanova\", owning snack brands such as Pop-Tarts and Pringles alongside the international cereal division. The purpose of the split was to separate the convenience food, and international cereal products market, from the North American cereal market. Thus facilitating the former Ferrero takeover. \"Kellogg's\" itself became a brand name of both companies. Mars Inc., the owner of M&M's and Snickers, agreed to acquire Kellanova for nearly $30 billion in August 2024. History In 1876, John Harvey Kellogg became the superintendent of the Battle Creek Sanitarium (originally the Western Health Reform Institute founded by Ellen White), and his brother, W. K. Kellogg, worked as the bookkeeper. This is where corn flakes were created and led to the eventual formation of the Kellogg Company. For years, W. K. Kellogg assisted his brother in research to improve the vegetarian diet of the Battle Creek Sanitarium's patients, especially in the search for wheat-based granola. The Kelloggs are best known for the invention of the famous breakfast cereal corn flakes. The development of the flaked cereal in 1894 has been variously described by those involved: Ella Eaton Kellogg, John Harvey Kellogg, his younger brother Will Keith Kellogg, and other family members. There is considerable disagreement over who was involved in the development and the roles that they played. It is generally agreed that, upon being called out one night, John Kellogg left a batch of wheat-berry dough behind. Rather than throwing it out the following day, he sent it through the rollers and was surprised to obtain delicate flakes, which could then be baked. W. K. Kellogg persuaded his brother to serve the food in a flake form. Soon the flaked wheat was being packaged to meet hundreds of guest mail-order requests after they left the Sanitarium. However, John forbade his brother Will to distribute the cereal beyond his own consumers. As a result, the brothers fell out, and W. K. launched the Battle Creek Toasted Corn Flake Company on February 19, 1906. On July 4, 1907, a fire destroyed the main factory building. W. K. Kellogg had the new plant in full operation six months after the fire. Convincing his brother to relinquish rights to the product, Will's company produced and marketed the hugely successful Kellogg's Toasted Corn Flakes and was renamed to the Kellogg Toasted Corn Flake Company in 1909 and to the Kellogg Company in 1922. By 1909, Will's company produced 120,000 cases of Corn Flakes daily. John, who resented his brother's success, filed suit against Will's company in 1906 for the right to use the family name. The resulting legal battle, which included a trial that lasted an entire month, ended in December 1920 when the Michigan Supreme Court ruled in Will's favor. In 1931, the Kellogg Company announced that most of its factories would shift towards 30-hour work weeks from the usual 40. W. K. Kellogg stated that he did this so that an additional shift of workers would be employed to support people through the depression era. This practice remained until World War II and continued briefly after the war, although some departments and factories remained locked into 30-hour work weeks until 1980. The company went public in 1952. In 1964, Kellogg's introduced its first non-cereal product: a pastry which can be heated in a toaster, called Pop-Tarts. From 1969 to 1970, the slogan “Kellogg's puts more into your day” was used on Sunday morning TV shows. From 1969 to 1977, Kellogg's acquired various small businesses, including Salada Tea, Fearn International, Mrs. Smith's Pies, Eggo, and Pure Packed Foods; however, it was later criticized for not diversifying further, as General Mills and Quaker Oats had. After underspending its competition in marketing and product development, Kellogg's US market share hit a low of 36.7% in 1983. According to Kellogg's chairman William E. LaMothe, a prominent Wall Street analyst had described Kellogg's \"a fine company that's past its prime,\" and the cereal market was being regarded as \"mature\". LaMothe and his team took this critique as a challenge, shifting their focus to approaching the demographic of 80 million baby boomers rather than marketing children-oriented cereals. In emphasizing cereal's convenience and nutritional value, Kellogg's helped persuade U.S. consumers aged 25 to 49 to eat 26% more cereal than people of that age ate five years prior. The U.S. ready-to-eat cereal market, worth $3.7 billion at retail in 1983, totaled $5.4 billion by 1988 and had expanded three times as fast as the average grocery category. Kellogg's also introduced new products, including Crispix, Raisin Squares, and Nutri-Grain Biscuits, and reached out internationally with Just Right aimed at Australians and Genmai Flakes for Japan. During this time, the company maintained success over its top competitors, General Mills, which largely marketed children's cereals, and Post, which had difficulty in the adult cereal market. 21st century In 2001, Kellogg's acquired the Keebler Company for $3.87 billion. Over the years, it has also gone on to acquire Morningstar Farms and Kashi divisions or subsidiaries. Kellogg's also owns the Bear Naked, Natural Touch, Cheez-It, Murray, Austin cookies and crackers, Famous Amos, Gardenburger (acquired 2007), and Plantation brands. Presently, Kellogg's is a member of the World Cocoa Foundation. In 2005, Kellogg's acquired Kraft's fruit snack business and with it the license for Nickelodeon fruit snacks. In 2012, Kellogg's became the world's second-largest snack food company (after PepsiCo) by acquiring the potato chip brand Pringles from Procter & Gamble for $2.7 billion in a cash deal. In 2017, Kellogg's acquired Chicago-based food company Rxbar for $654 million. Earlier that year, Kellogg's also opened new corporate office space in Chicago's Merchandise Mart for its global growth and IT departments. In the UK, Kellogg's also released the W. K. Kellogg brand of organic, vegan and plant-based cereals (such as granolas, organic wholegrain wheat, and \"super grains\") with no added sugars. In 2018, Kellogg's decided to cease their operations in Venezuela due to the economic crisis in the country. Their factories were taken by the Venezuelan state under the Nicolás Maduro administration. In mid-2019, Venezuelan Kellogg's cereal boxes began portraying the Venezuelan flag and a motto from Maduro: \"Together, everything is possible\" (Spanish: Juntos todo es posible) alongside Kellogg's logo and mascots were sold all over the country. Kellogg's considers it as an illicit use, and the company stated they would take legal action. On April 1, 2019, it was announced that Kellogg's was selling Famous Amos, Murray's, Keebler, Mother's, and Little Brownie Bakers (one of the producers of the cookies for the Girl Scouts of the USA) to Ferrero SpA for $1.4 billion. On July 29, 2019, that sale was completed. Kellogg's kept the Keebler cracker line and replaced the Keebler name on their crackers with the Kellogg's name. In October 2019, Kellogg's partnered with GLAAD by \"launching a new limited edition \"All Together Cereal\" and donating $50,000 to support GLAAD's anti-bullying and LGBTQ advocacy efforts\". The All Together cereal consists of six mini cereal boxes combined into one package. In January 2020, Kellogg's decided to work with suppliers to phase out the use of glyphosate by 2025, which some farmers have used as a drying agent for wheat and oats supplied to Kellogg's. In October 2021, workers at all of Kellogg's cereal-producing plants in the United States went on a strike conducted by the Bakery, Confectionery, Tobacco Workers and Grain Millers' International Union over disagreements over the terms of a new labor contract. On December 3, 2021, a tentative deal was struck to end the worker strike, but the union members overwhelmingly rejected the tentative agreement and Kellogg's management announced they would seek to replace all 1,400 striking workers. On December 21, 2021, about 1,400 Kellogg workers approved a collective bargaining agreement, ending the strike, which had lasted 77 days. On June 21, 2022, Kellogg's announced a plan to spin off its three cereal, snacks, and plant-based food divisions into separate companies. The North American cereal and plant-based food spin-off companies were to keep Battle Creek as their headquarters and the new snack and international cereal company will be based in Chicago. The successor company, known as Global Snacking Co. temporarily, represented 80 percent or $11.4 billion of Kellogg's sales. 60 percent of Global Snacking's business was snacks, and nearly half of the company's business was in the United States. The cereal business, temporarily called North America Cereal Co., was to be the second-largest American cereal company and the largest in Canada and the Caribbean, with 5 of the top 11 brands and $2.4 billion in annual sales. Plant-based foods, representing $340 million in annual sales, were to be called \"Plant Co.\" and could potentially be sold. In January 2023, Kellogg's shelved its plans to spin off its plant food business and retained it as part of Global Snacking Co. On March 15, 2023, Kellogg's announced that North America Cereal Co. branch will be named WK Kellogg Co and Global Snacking Co. branch will be called Kellanova. The split was structured with Kellanova as the surviving company, using the ticker symbol \"K\" on the NYSE. The WK Kellogg Co took the NYSE stock symbol \"KLG\". The split was completed on October 2, 2023. On August 14, 2024, Mars Inc., the owner of M&M's and Snickers, agreed to purchase Kellanova for nearly $30 billion. The purchase, originally planned to close in the first half of 2025 was approved by the FTC in the US but as of October 2025 faced scrutiny by EU competition authorities. Operations Finances For the fiscal year 2017, Kellogg's reported earnings of US$1.269 billion, with an annual revenue of US$12.932 billion, a decline of 0.7% over the previous fiscal cycle. Kellogg's market capitalization was valued at over US$22.1 billion in November 2018. Brands Cereal Here is a list of Kellanova's cereals (international only) with available varieties: Discontinued cereals and foods Marketing Various methods have been used in the company's history to promote the company and its brands. Foremost among these is the design of the Kellogg's logo by Ferris Crane under the art direction of type guru Y. Ames. Another was the well-remembered jingle \"K E double-L, O double-good, Kellogg's best to you!\". With the rising popularity of patent medicine in early 20th century advertising, The Kellogg Company of Canada published a book named A New Way of Living that showed readers \"how to achieve a new way of living; how to preserve vitality; how to maintain enthusiasm and energy; how to get the most out of life because of a physical ability to enjoy it\". It touted the All-Bran cereal as the secret to leading \"normal\" lives free of constipation. Kellogg's was a major sponsor throughout the run of the hit CBS panel show What's My Line? It and its associated products Frosted Flakes and Rice Krispies were also major sponsors for the PBS Kids children's animated series Dragon Tales. Kellogg's was a sponsor of USA Gymnastics and produced the Kellogg's Tour of Gymnastics, a 36-city tour held in 2016 after the Olympic games and featured performances by recent medal-winning gymnasts from the United States. Kellogg's is currently the title sponsor of three college football bowl games. In 2019, Kellogg's became the new title sponsor of the Sun Bowl game, with the game being branded as the \"Tony the Tiger Sun Bowl\". This was followed in 2020 by the company using its Cheez-It brand to sponsor of the game now known as the Pop-Tarts Bowl. In 2022, Kellogg's added the Citrus Bowl to its bowl sponsorships, with the game branded as the \"Cheez-It Citrus Bowl\". Premiums and prizes W. K. Kellogg was the first to introduce prizes in boxes of cereal. The marketing strategy that he established has produced thousands of different cereal box prizes that have been distributed by the tens of billions. Children's premiums Beginning in 1909, Kellogg's Corn Flakes had the first cereal premium with The Funny Jungleland Moving Pictures Book. The book was originally available as a prize that was given to the customer in the store with the purchase of two packages of the cereal. But in 1909, Kellogg's changed the book giveaway to a premium mail-in offer for the cost of a dime. Over 2.5 million copies of the book were distributed in different editions over a period of 23 years. Cereal box prizes In 1945, Kellogg's inserted a prize in the form of pin-back buttons into each box of Pep cereal. Pep pins have included U.S. Army squadrons as well as characters from newspaper comics and were available through 1947. There were five series of comic characters and 18 different buttons in each set, with a total of 90 in the collection. Other manufacturers of major brands of cereal, including General Mills, Malt-O-Meal, Nestlé, Post Foods, and Quaker Oats, followed suit and inserted prizes into boxes of cereal to promote sales and brand loyalty. Mascots Licensed brands have been omitted since the corresponding mascots would be obvious (for example, Spider-Man is the mascot for Spider-Man Spidey-Berry). Motorsports Kellogg's made its first foray into auto racing between 1991 and 1992 when the company sponsored the #41 Chevrolets fielded by Larry Hedrick Motorsports in the NASCAR Winston Cup Series and driven by Phil Parsons, Dave Marcis, Greg Sacks, Hut Stricklin, and Richard Petty, but they gained greater prominence for their sponsorship of two-time Winston Cup Champion Terry Labonte from 1993 to 2006, the last 12 years of that as the sponsor for Hendrick Motorsports' No.5 car. Kellogg's sponsored the No.5 car for Labonte, Kyle Busch, Casey Mears, and Mark Martin until 2010, and it then served as an associate sponsor for Carl Edwards' #99 car for Roush Fenway Racing. Kellogg's placed Dale Earnhardt on Kellogg's Corn Flakes boxes for 1993 six-time Winston Cup champion and 1994 seven-time Winston Cup champion, as well as Jeff Gordon on the Mini Wheats box for the 1993 Rookie of the Year, 1995 Brickyard 400 inaugural race, 1997 Champion, and 1998 three-time champion, and a special three-pack racing box set with Dale Earnhardt, Jeff Gordon, Terry Labonte, and Dale Jarrett in 1996. Merchandising Kellogg's has used some merchandising for their products. Entertainer Jimmy Durante appeared in some Kellogg's commercials in the 1960s. Kellogg's once released Mission Nutrition, a PC game that came free with special packs of cereal. It played in a similar fashion as Donkey Kong Country; users could play as Tony the Tiger, Coco the Monkey, or Snap, Crackle, and Pop. Kellogg's has also released \"Talking\" games. The two current versions are Talking Tony and Talking Sam. In these games, a microphone is used to play games and create voice commands for their computers. In Talking Tony, Tony the Tiger, a famous Kellogg's mascot, would be the main and only character in the game. In Talking Sam, Toucan Sam, would be in the game, instead. Some [toy cars] have the Kellogg's logo on them, and occasionally their mascots. There was also a Talking Snap Crackle and Pop software. Olympic Games Kellogg's frequently partners with the U.S. Olympic Committee to feature American athletes from the U.S. Olympic and Paralympic Teams on the packages of its cereal brands. In 2011 it became an official sponsor for the 2012, 2014 and 2016 U.S. Olympic and Paralympic Teams. Its sponsorship at the 2018 Winter Olympic Games featured American athletes Nathan Chen, Kelly Clark, Meghan Duggan and Mike Schultz. The sponsorship was renewed for the 2018 and 2020 Olympic and Paralympic Games. Restaurant From 2016 to 2019, Kellogg's operated \"Kellogg's NYC\", a branded café in New York City that sold bowls of cereal with optional toppings. Political involvement Genetically modified foods labeling Kellogg's donated around US$2 million opposing California Proposition 37, a 2012 ballot initiative that, if enacted, would have required compulsory labeling of genetically engineered food products. In March 2016, though, they vowed to label all of their products with genetically modified organisms as such by 2020. Climate change In August 2014, Kellogg's called on the President to support the Paris Agreement on climate change. In 2016, Kellogg Company urged President-elect Donald Trump to \"continue the Paris Climate Agreement\". Voter ID laws Kellogg's has donated to notable groups opposing voter-ID laws, such as the Applied Research Center (now RaceForward). The company also decided to remove their advertisements from the Breitbart News website. Breitbart News in turn called for a boycott of Kellogg's products. Education grant In January 2012, Kellogg's gave the Calhoun School a $250,000 grant for a \"three-part youth-based project on issues of white privilege and institutionalized racism\". As of 2024, Kellanova has total assets of over $15,000,000,000. Controversies Misleading claims Advertising On June 3, 2010, Kellogg's was found to be making unsubstantiated and misleading claims in advertising their cereal products by the Federal Trade Commission (FTC). Kellogg's responded by stating \"We stand behind the validity of our product claims and research, so we agreed to an order that covers those claims. We believe that the revisions to the existing consent agreement satisfied any remaining concerns.\" The FTC had previously found fault with Kellogg's claims that Frosted Mini-Wheats cereal improved kids' attentiveness by nearly 20%. The Children's Advertising Review Unit of the Council of Better Business Bureaus has also suggested that the language on Kellogg Pop-Tarts packages saying the pastries are \"Made with Real Fruit\" should be taken off the products. In July 2012, the UK banned a \"Special K\" advertisement due to its citing caloric values that did not take into account the caloric value of milk consumed with the cereal. In 2016 an ad telling UK consumers that Special K is “full of goodness” and “nutritious” was banned. In 2016, it was revealed that members of the Kellogg Breakfast Council, a group of nutrition experts purported to be \"independent\" on their website, were in fact paid an annual stipend by Kellogg to promote the brand's products online, in speeches, and amongst their peers. The company responded by saying that they assumed their sponsorship was implied by putting their name on the group, but agreed to stop describing the council as independent. The council was disbanded in May 2016 following the expiration of its members' contracts. Questionable nutritional value Some of Kellogg's marketing has been questioned in the press, prompted by an increase in consumer awareness of the mismatch between the marketing messages and the products themselves. Food bloggers are also questioning the marketing methods used by cereal manufacturing companies such as Kellogg's, due to their high sugar content and use of ingredients such as high-fructose corn syrup. 2021 Pop-Tarts lawsuit A class-action lawsuit was filed by attorney Spencer Sheehan in October 2021 claiming they did not put enough strawberries in their strawberry flavored Pop-Tarts, and seeking $5 million in damages. In April 2022, the lawsuit was dismissed by a federal judge. Sheehan filed another lawsuit against Kellogg's in 2021, with the plaintiff claiming that Kellogg's defrauded customers regarding the contents of its Frosted Chocolate Fudge Pop-Tarts. The plaintiff stated she would not have purchased the Pop-Tarts had she known they did not contain milk, milkfat, or butter. In June 2022, a US district judge dismissed the lawsuit, stating that a reasonable consumer would not expect those ingredients. Recalls 2010 cereal recall On June 25, the company voluntarily began to recall about 28 million boxes of Apple Jacks, Corn Pops, Froot Loops and Honey Smacks because of an unusual smell and flavor from the packages' liners that could make people ill. Kellogg's said about 20 people complained about the cereals, including five who reported nausea and vomiting. Consumers reported the cereal smelled or tasted waxy or like metal or soap. Company spokeswoman J. Adaire Putnam said some described it as tasting stale. However, no serious health problems had been reported. The suspected chemical that caused the illnesses was 2-methylnaphthalene, used in the cereal packaging process. Little is known about 2-methylnaphthalene's impact on human health as the Food and Drug Administration has no scientific data on its impact on humans, and the United States Environmental Protection Agency (EPA) also does not have health and safety data regarding it. This is despite the EPA having sought information on it from the chemical industry for 16 years. 2-Methylnaphthalene is a component of crude oil and is \"structurally related to naphthalene, an ingredient in mothballs and toilet-deodorant blocks\" that the EPA considers a possible human carcinogen. Kellogg's offered consumers refunds in the meantime. Only products with the letters \"KN\" following the use-by date were included in the recall. The products were distributed throughout the US and began arriving in stores in late March 2010. Products in Canada were not affected. 2012 cereal recall Kellogg's issued a voluntary recall of some of its \"Frosted Mini-Wheats Bite Size Original\" and \"Mini-Wheats Unfrosted Bite Size\" products due to the possibility of flexible metal mesh fragments in the food. The affected products varied in size from single-serving bowls to large 70-ounce cartons. Use-by dates printed on the recalled packages ranged from April 1, 2013, to September 21, 2013, and were accompanied by the letters KB, AP or FK. Human rights violations and strikes Human right violations of palm oil in 2016 According to Amnesty International in 2016, Kellogg's palm oil provider Wilmar International profited from 8 to 14-year-old child labor and forced labor. Some workers were extorted, threatened or not paid for work. Some workers suffered severe injuries from chemicals such as Paraquat. Kellogg's alleged not being aware of the child abuses due to traceability; Amnesty's human rights director replied that \"Using mealy-mouthed excuses about 'traceability' is a total cop-out.\" 2021 strike In October 2021, over a thousand employees at four Kellogg's manufacturing plants in the United States went on strike for better working conditions and higher wages. Two months into the strikes, Kellogg's fired all the striking workers and posted their jobs in December after negotiations with the BCTGM union failed. During the talks, Kellogg's had threatened to move jobs to Mexico if the union did not agree to Kellogg's proposal. Kelloggs also filed a lawsuit against the union. As a result, several calls for a boycott went viral on social media."
}