{
  "ticker": "KEY",
  "cik": "0000091576",
  "company_name": "KeyCorp",
  "corrected_name": "KeyCorp",
  "wiki_title_used": "KeyCorp",
  "exists": true,
  "raw_text": "KeyBank is an American regional bank headquartered in Cleveland, Ohio, and the 27th largest bank in the United States. Organized under the publicly traded KeyCorp, KeyBank was formed from the 1994 merger of the Cleveland-based Society Corporation, which operated Society National Bank, and the Albany-headquartered KeyCorp. The company today operates nearly 1,000 branches and over 1,200 ATMs, mostly concentrated in the Midwest and Northeast United States, though also operates in the Pacific Northwest as well as in Alaska, Colorado, Texas and Utah.\n\nHistory\nKeyBank is the primary subsidiary of KeyCorp, which was formed in 1994 through the merger of Society Corporation of Cleveland, Ohio (\"Society Bank\") and KeyCorp (\"Old KeyCorp\") of Albany, New York. The merger briefly made Key the 10th largest US bank. Its roots trace back to the Commercial Bank of Albany in 1825 and Cleveland's Society for Savings, founded in 1849.\n\nSociety Corporation (Society National Bank)\nSociety For Savings originated in 1849 as a mutual savings bank, founded by Samuel H. Mather. In 1867, the modest but growing bank built Cleveland's first skyscraper, the 10-story Society for Savings Building on Public Square. Despite erecting the tallest structure between New York and Chicago at the time, the bank largely eschewed expansion. That aspect is highlighted by the fact that when it celebrated its 100th anniversary in 1949, it still only had one office although it had over $200 million (~$2.08 billion in 2024) in deposits. This conservatism helped the bank sidestep many depressions and financial panics. In 1958, Society converted from a mutual to a public company, which enabled it to grow quickly by acquiring 12 community banks between 1958 and 1978 under the banner Society National Bank. It went through another growth spurt from 1979 to 1989, as it acquired dozens of small banks and completed four mergers worth one billion dollars, most notably Cleveland-based Central National Bank in 1986. In 1987, Society CEO Gordon E. Heffern retired and was succeeded by Robert W. Gillespie, who, although just 42, was a major figure and part of the office of the chairman for more than 5 years. Gillespie was also named chairman. Gillespie started as a teller with Society to earn money while he was finishing his graduate studies.\nSociety Corporation acquired Toledo, Ohio-based Trustcorp in 1990 and holding company AmeriTrust Corporation, in September 1991. Ameritrust was the successor to Cleveland Trust Company, which was Ohio's largest bank during the 1940s through the late 1970s. The AmeriTrust deal established Society as a large regional bank. However, its footing became unsteady due to bad real estate loans, forcing the resignation of AmeriTrust chairman Jerry V. Jarrett in 1990. Moreover, Gillespie was able to outbid Society's larger rival, National City Corp., which also bid for Cleveland Trust.\n\nKeyCorp (KeyBank)\nIn 1825, New York Governor DeWitt Clinton signed a bill chartering the Commercial Bank of Albany. In 1865, Commercial Bank was reorganized under the National Banking Act of 1864, and changed its name to National Commercial Bank of Albany. Over a hundred years passed before National Commercial merged with First Trust and Deposit of Syracuse to become First Commercial Banks in 1971, still a modest New York State bank with 89 offices. Victor J. Riley Jr. became president and CEO in 1973, and changed First Commercial's name to Key Bank Inc. in 1979.\nRiley embarked on a plan to grow Key through acquisitions. From the mid-1970s to the early 1980s, it made numerous acquisitions throughout upstate New York. Beginning in the 1980s, Riley looked outside New York, expanding Key's footprint with an acquisition in Maine, and eventually adding branches in Massachusetts and Vermont. However, by the mid-1980s, banking regulators in New England began looking askance at New York-based banks controlling the region's capital. That, coupled with increasing competition for acquisition targets, caused Riley to essentially abandon the Northeast. Instead, he began searching for prey in the Pacific Northwest. Riley found a target-rich environment in rural and underserved areas. He snapped up small banks in Wyoming, Idaho, Utah, Washington and Oregon. He even went so far as to buy two banks in Alaska, for which he was flogged in the media and in banking circles. Unorthodox strategy aside, Riley quintupled Key's assets from $3 billion to $15 billion in just four years between 1985 and 1990.\nWhile the early 1990s recession rocked many banks, Key had ample capital. It bought the assets of two failed thrifts from the government: Empire Federal Savings and Loan and Goldome Savings Bank. In March 1992, it acquired Tacoma-based Puget Sound Bancorp for $807.2 million (~$1.62 billion in 2024) to bolster its presence in Washington. Also in 1992, Key acquired Home Federal Savings of Fort Collins, its first move into Colorado. Key soon amassed nearly 700 banking offices.\nThe result was two separate banking networks united under a single corporate umbrella. However, this strategy actually worked well for Key. Not only was it insulated from regional economic downturns, but it avoided bad loans by lending primarily to customers in the areas it served. When Key acquired a bank, it retained most of the bank's personnel. Riley argued that a bank that entered new territory and \"start(ed) shuffling people around\" could not brand itself as a community bank.\nBy 1993, the rural strategy with local management and minimal technology made Key a very profitable bank. However, it was getting tougher for Riley and CFO William Dougherty to maintain their 15% return on equity target and investors were cooling on Key stock after many high growth years. Key began testing a Vision 2001 computer system, which sped up and enhanced the loan process through faster credit scoring, loan servicing, and collection capabilities.\n\nSociety National Bank and KeyBank merger (1994)\nAlthough Gillespie had built Society into a regional powerhouse in the Midwest, he wanted to vault the bank into the big leagues. He concluded Key, a bank with similar ambitions, was a suitable partner. Society and Key held talks in 1990 at Gillespie's prompting, but Riley decided to stay the course of smaller, more lucrative acquisitions with obvious synergies. Yet, news reports swirled that a possible merger was in the works in the fall of 1993. Key was the 29th largest U.S. bank with $26 billion in assets, while Society was the 25th largest with $32 billion in assets. Both needed a merger to improve their prospects. For its part, Key needed a succession plan due to the lack of an obvious successor to the 62-year-old Riley. In one week in June 1993, the bench had become barren – Chief Banking Officer James Waterston, hired the year before, quit and publicly stated that he was frustrated with the pace of achieving his goal of running a large bank. The head of KeyBank of Washington, Hans Harjo, was pushed out over an apparent dispute to move its headquarters from Seattle to Tacoma. It also became clear that Key had to undertake a technology infrastructure upgrade to connect its far-flung offices. Meanwhile, Society was in search of higher growth and longed to expand its presence outside of the so-called rust belt states of Ohio, Michigan, and Indiana.\nThe merger was announced in early October 1993. This time it was Riley who made the first move; he called Gillespie while recuperating at his Albany home after breaking his hip in a horse-riding accident in Wyoming. The two quickly sketched out the deal. The banks were roughly the same size in assets and had very little geographic overlap, so it was touted as an out-of-market merger in which few branches needed to be sold off. It created a $58 billion banking behemoth with a footprint that literally stretched from Portland, Maine to Portland, Oregon. Furthermore, the deal plugged many of the perceived holes for both partners. The soft-spoken Gillespie was just 49 and Society had cultivated a deep bench of lieutenants. More importantly, Society had the computer systems and technology expertise to combine the two banks, along with Chief Information Officer Allen J. Gula. Riley also lamented the modest Albany International Airport, which lost service from several major airlines in the 1980's and complicated air travel for Key executives. Ohio also had lower state taxes than New York. Lastly, Society had recently built Society Center (now Key Tower), a 947-foot skyscraper that was more commensurate with a major bank headquarters than the modest buildings used in Albany. These issues made Cleveland the preferable location for the merged bank's headquarters. Conversely, Key's brand was more recognizable.\nThe deal was structured as a merger of equals. The merged bank took the KeyCorp name, and operates under the charter of the old KeyCorp. However, Society was the nominal survivor; the merged bank was headquartered in Cleveland and retains Society's pre-1994 stock price history. The Society name continued to be used in Society's former footprint for an additional two more years before it was retired in June 1996 and the charters were merged.\nRiley became chairman and CEO of the \"new\" KeyCorp, with Gillespie as president and chief operating officer. Despite assurances from both Riley and Gillespie, the city of Albany and then-Governor Mario Cuomo openly fretted that the merger would be bad for the state capital since Key and its subsidiaries owned or leased more than 10% of Albany's commercial office space. By 2014, only about 225 non-branch employees were still based in Albany at the former KeyCorp Tower.\nSociety and Key completed the merger on March 1, 1994, after regulatory approval. Although it was touted as a merger of equals, Key and Society were an odd couple. As mentioned above, Key was a decentralized community bank combining two banking networks—an eastern network in New England and upstate New York and a western one in the Rockies and Pacific Northwest—within a single corporate structure. Society, in contrast, was a classic big-city commercial bank with a centralized structure largely concentrated in three states.\nRiley planned to retire as CEO at the end of 1995. He decided to accelerate it by four months, however, instead stepping down on September 1, 1995. Gillespie took the helm as CEO and later chairman, allowing his protege Henry Meyer to become COO and later president.\n\nPost-merger\nWhile still integrating Society Bank and KeyBank, Gillespie attempted to turn Key into a financial services powerhouse. Between 1995 and 2001, Gillespie initiated nine significant acquisitions and 6 divestitures.\nIn late 1998, Key bought Cleveland-based brokerage firm, McDonald & Co. for $653 million (~$1.17 billion in 2024) in stock. The McDonald acquisition was the largest non-banking deal in both size and impact on Key. McDonald was sold to the U.S. investment arm of UBS AG in 2007 for roughly $280 million (~$407 million in 2024). As a result, Key began processing all subsequent securities transactions under its new broker-dealer name, \"KeyBanc Capital Markets Inc\", in April 2007.\nHowever, investors became wary of all the Gillespie-era deals. Some believed that Gillespie was making all the moves to cover up poor performance, although in hindsight that appears to be far from the truth. The concept was dubbed \"burning the furniture\", implying that Key would sell an asset to obfuscate earnings. For instance, Key sold its residential mortgage servicing to Countrywide Financial (now Bank of America Home Loans) in 1995, shareholder services in 1996, various chunks of the bank in 1997–1999 (i.e. Wyoming, Florida, and Long Island), and credit card operations to The Associates in 2000 (which was quickly thereafter acquired by Citigroup).\nBut Gillespie was attempting to increase fee-income by acquiring high-growth businesses, including McDonald and equipment financing firm Leastec, and decreasing the exposure to the bank's shrinking population base in its primary footprint, so-called rust belt states such as Ohio, Michigan, and Indiana. Gillespie resigned from the CEO position on February 1, 2001, and then as chairman at the annual meeting on May 17 during which he was replaced by Henry Meyer.\nIn October 2008, Key received approximately $2.5 billion (~$3.57 billion in 2024) in investment from the Troubled Asset Relief Program. In March 2011, Key was one of the last major banks to pay back TARP funds.\nIn May 2011, Key made history by naming Beth E. Mooney, previously the bank's president, as the first female chairman and CEO of a top 20 bank.\nIn January 2012, Key acquired 37 former HSBC Bank USA branches in Upstate New York from First Niagara Bank for $110 million.\nIn May 2013, the company acquired mortgage servicing rights from Bank of America.\nIn January 2015, KeyBank participated in the construction debt financing syndicate behind the Balko Wind Project purchased from Apex Clean Energy by D.E. Shaw Renewable Investments.\n\nFirst Niagara Bank and KeyBank merger\nOn July 29, 2016, KeyCorp acquired First Niagara Bank for $4.1 billion (~$5.24 billion in 2024) in cash and stock. The deal strengthened Key's position in Upstate New York and New England, as well as entering Pennsylvania for the first time with a presence in both Philadelphia and Pittsburgh. The deal made Key one of the largest banks in Pittsburgh, and gave it branches that were once part of the crosstown rival National City Corp., which Key tried to acquire from PNC Financial Services following the National City acquisition by PNC in 2008 before being outbid by First Niagara. As a result, KeyCorp now held much of the core of what had been Marine Midland Bank, old KeyCorp's longtime rival. Five years earlier, First Niagara had acquired most of the upstate New York branch network of HSBC Bank USA, which had changed its name from Marine Midland in 1999; as mentioned above, Key had acquired 37 HSBC branches in 2012.\nAs part of the transaction, 18 First Niagara branches in Erie and Niagara Counties in New York were sold to Northwest Savings Bank for antitrust reasons.\n\nCurrent day operations\nKeyBank continues to play an important role in the regional economy of Cleveland, having 6,400 employees.\nIn April 2019, Keybank acquired Laurel Road. On May 13, 2019, it announced it would be opening its first tellerless branch in Boulder, Colorado. Instead of teller lines, the branch features private offices where clients can interact with bankers trained as \"financial wellness consultants\".\nIn September 2019, Christopher Gorman was appointed president. On May 1, 2020, Christopher M. Gorman assumed the role of Chairman, Chief Executive Officer, and President of KeyCorp bringing more than 30 years of financial services experience to his role.\nIn 2021, KeyBank originated 52,366 mortgages worth $25 billion (~$28.5 billion in 2024).\nKeyBank provided $21 Million in financing options for seniors in a senior housing initiative based in New York in June 2023. However, in May earlier that year, multiple groups claim that they broke a $16.5 billion promise.\n\nNaming rights and sponsorships\nKeyBank is a sponsor of:\n\nSee also\nTheodore John Conrad - a man who successfully embezzled money from Society Bank and was able to keep it secret until his death in 2021.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for KeyBank:",
  "clean_text": "KeyBank is an American regional bank headquartered in Cleveland, Ohio, and the 27th largest bank in the United States. Organized under the publicly traded KeyCorp, KeyBank was formed from the 1994 merger of the Cleveland-based Society Corporation, which operated Society National Bank, and the Albany-headquartered KeyCorp. The company today operates nearly 1,000 branches and over 1,200 ATMs, mostly concentrated in the Midwest and Northeast United States, though also operates in the Pacific Northwest as well as in Alaska, Colorado, Texas and Utah. History KeyBank is the primary subsidiary of KeyCorp, which was formed in 1994 through the merger of Society Corporation of Cleveland, Ohio (\"Society Bank\") and KeyCorp (\"Old KeyCorp\") of Albany, New York. The merger briefly made Key the 10th largest US bank. Its roots trace back to the Commercial Bank of Albany in 1825 and Cleveland's Society for Savings, founded in 1849. Society Corporation (Society National Bank) Society For Savings originated in 1849 as a mutual savings bank, founded by Samuel H. Mather. In 1867, the modest but growing bank built Cleveland's first skyscraper, the 10-story Society for Savings Building on Public Square. Despite erecting the tallest structure between New York and Chicago at the time, the bank largely eschewed expansion. That aspect is highlighted by the fact that when it celebrated its 100th anniversary in 1949, it still only had one office although it had over $200 million (~$2.08 billion in 2024) in deposits. This conservatism helped the bank sidestep many depressions and financial panics. In 1958, Society converted from a mutual to a public company, which enabled it to grow quickly by acquiring 12 community banks between 1958 and 1978 under the banner Society National Bank. It went through another growth spurt from 1979 to 1989, as it acquired dozens of small banks and completed four mergers worth one billion dollars, most notably Cleveland-based Central National Bank in 1986. In 1987, Society CEO Gordon E. Heffern retired and was succeeded by Robert W. Gillespie, who, although just 42, was a major figure and part of the office of the chairman for more than 5 years. Gillespie was also named chairman. Gillespie started as a teller with Society to earn money while he was finishing his graduate studies. Society Corporation acquired Toledo, Ohio-based Trustcorp in 1990 and holding company AmeriTrust Corporation, in September 1991. Ameritrust was the successor to Cleveland Trust Company, which was Ohio's largest bank during the 1940s through the late 1970s. The AmeriTrust deal established Society as a large regional bank. However, its footing became unsteady due to bad real estate loans, forcing the resignation of AmeriTrust chairman Jerry V. Jarrett in 1990. Moreover, Gillespie was able to outbid Society's larger rival, National City Corp., which also bid for Cleveland Trust. KeyCorp (KeyBank) In 1825, New York Governor DeWitt Clinton signed a bill chartering the Commercial Bank of Albany. In 1865, Commercial Bank was reorganized under the National Banking Act of 1864, and changed its name to National Commercial Bank of Albany. Over a hundred years passed before National Commercial merged with First Trust and Deposit of Syracuse to become First Commercial Banks in 1971, still a modest New York State bank with 89 offices. Victor J. Riley Jr. became president and CEO in 1973, and changed First Commercial's name to Key Bank Inc. in 1979. Riley embarked on a plan to grow Key through acquisitions. From the mid-1970s to the early 1980s, it made numerous acquisitions throughout upstate New York. Beginning in the 1980s, Riley looked outside New York, expanding Key's footprint with an acquisition in Maine, and eventually adding branches in Massachusetts and Vermont. However, by the mid-1980s, banking regulators in New England began looking askance at New York-based banks controlling the region's capital. That, coupled with increasing competition for acquisition targets, caused Riley to essentially abandon the Northeast. Instead, he began searching for prey in the Pacific Northwest. Riley found a target-rich environment in rural and underserved areas. He snapped up small banks in Wyoming, Idaho, Utah, Washington and Oregon. He even went so far as to buy two banks in Alaska, for which he was flogged in the media and in banking circles. Unorthodox strategy aside, Riley quintupled Key's assets from $3 billion to $15 billion in just four years between 1985 and 1990. While the early 1990s recession rocked many banks, Key had ample capital. It bought the assets of two failed thrifts from the government: Empire Federal Savings and Loan and Goldome Savings Bank. In March 1992, it acquired Tacoma-based Puget Sound Bancorp for $807.2 million (~$1.62 billion in 2024) to bolster its presence in Washington. Also in 1992, Key acquired Home Federal Savings of Fort Collins, its first move into Colorado. Key soon amassed nearly 700 banking offices. The result was two separate banking networks united under a single corporate umbrella. However, this strategy actually worked well for Key. Not only was it insulated from regional economic downturns, but it avoided bad loans by lending primarily to customers in the areas it served. When Key acquired a bank, it retained most of the bank's personnel. Riley argued that a bank that entered new territory and \"start(ed) shuffling people around\" could not brand itself as a community bank. By 1993, the rural strategy with local management and minimal technology made Key a very profitable bank. However, it was getting tougher for Riley and CFO William Dougherty to maintain their 15% return on equity target and investors were cooling on Key stock after many high growth years. Key began testing a Vision 2001 computer system, which sped up and enhanced the loan process through faster credit scoring, loan servicing, and collection capabilities. Society National Bank and KeyBank merger (1994) Although Gillespie had built Society into a regional powerhouse in the Midwest, he wanted to vault the bank into the big leagues. He concluded Key, a bank with similar ambitions, was a suitable partner. Society and Key held talks in 1990 at Gillespie's prompting, but Riley decided to stay the course of smaller, more lucrative acquisitions with obvious synergies. Yet, news reports swirled that a possible merger was in the works in the fall of 1993. Key was the 29th largest U.S. bank with $26 billion in assets, while Society was the 25th largest with $32 billion in assets. Both needed a merger to improve their prospects. For its part, Key needed a succession plan due to the lack of an obvious successor to the 62-year-old Riley. In one week in June 1993, the bench had become barren – Chief Banking Officer James Waterston, hired the year before, quit and publicly stated that he was frustrated with the pace of achieving his goal of running a large bank. The head of KeyBank of Washington, Hans Harjo, was pushed out over an apparent dispute to move its headquarters from Seattle to Tacoma. It also became clear that Key had to undertake a technology infrastructure upgrade to connect its far-flung offices. Meanwhile, Society was in search of higher growth and longed to expand its presence outside of the so-called rust belt states of Ohio, Michigan, and Indiana. The merger was announced in early October 1993. This time it was Riley who made the first move; he called Gillespie while recuperating at his Albany home after breaking his hip in a horse-riding accident in Wyoming. The two quickly sketched out the deal. The banks were roughly the same size in assets and had very little geographic overlap, so it was touted as an out-of-market merger in which few branches needed to be sold off. It created a $58 billion banking behemoth with a footprint that literally stretched from Portland, Maine to Portland, Oregon. Furthermore, the deal plugged many of the perceived holes for both partners. The soft-spoken Gillespie was just 49 and Society had cultivated a deep bench of lieutenants. More importantly, Society had the computer systems and technology expertise to combine the two banks, along with Chief Information Officer Allen J. Gula. Riley also lamented the modest Albany International Airport, which lost service from several major airlines in the 1980's and complicated air travel for Key executives. Ohio also had lower state taxes than New York. Lastly, Society had recently built Society Center (now Key Tower), a 947-foot skyscraper that was more commensurate with a major bank headquarters than the modest buildings used in Albany. These issues made Cleveland the preferable location for the merged bank's headquarters. Conversely, Key's brand was more recognizable. The deal was structured as a merger of equals. The merged bank took the KeyCorp name, and operates under the charter of the old KeyCorp. However, Society was the nominal survivor; the merged bank was headquartered in Cleveland and retains Society's pre-1994 stock price history. The Society name continued to be used in Society's former footprint for an additional two more years before it was retired in June 1996 and the charters were merged. Riley became chairman and CEO of the \"new\" KeyCorp, with Gillespie as president and chief operating officer. Despite assurances from both Riley and Gillespie, the city of Albany and then-Governor Mario Cuomo openly fretted that the merger would be bad for the state capital since Key and its subsidiaries owned or leased more than 10% of Albany's commercial office space. By 2014, only about 225 non-branch employees were still based in Albany at the former KeyCorp Tower. Society and Key completed the merger on March 1, 1994, after regulatory approval. Although it was touted as a merger of equals, Key and Society were an odd couple. As mentioned above, Key was a decentralized community bank combining two banking networks—an eastern network in New England and upstate New York and a western one in the Rockies and Pacific Northwest—within a single corporate structure. Society, in contrast, was a classic big-city commercial bank with a centralized structure largely concentrated in three states. Riley planned to retire as CEO at the end of 1995. He decided to accelerate it by four months, however, instead stepping down on September 1, 1995. Gillespie took the helm as CEO and later chairman, allowing his protege Henry Meyer to become COO and later president. Post-merger While still integrating Society Bank and KeyBank, Gillespie attempted to turn Key into a financial services powerhouse. Between 1995 and 2001, Gillespie initiated nine significant acquisitions and 6 divestitures. In late 1998, Key bought Cleveland-based brokerage firm, McDonald & Co. for $653 million (~$1.17 billion in 2024) in stock. The McDonald acquisition was the largest non-banking deal in both size and impact on Key. McDonald was sold to the U.S. investment arm of UBS AG in 2007 for roughly $280 million (~$407 million in 2024). As a result, Key began processing all subsequent securities transactions under its new broker-dealer name, \"KeyBanc Capital Markets Inc\", in April 2007. However, investors became wary of all the Gillespie-era deals. Some believed that Gillespie was making all the moves to cover up poor performance, although in hindsight that appears to be far from the truth. The concept was dubbed \"burning the furniture\", implying that Key would sell an asset to obfuscate earnings. For instance, Key sold its residential mortgage servicing to Countrywide Financial (now Bank of America Home Loans) in 1995, shareholder services in 1996, various chunks of the bank in 1997–1999 (i.e. Wyoming, Florida, and Long Island), and credit card operations to The Associates in 2000 (which was quickly thereafter acquired by Citigroup). But Gillespie was attempting to increase fee-income by acquiring high-growth businesses, including McDonald and equipment financing firm Leastec, and decreasing the exposure to the bank's shrinking population base in its primary footprint, so-called rust belt states such as Ohio, Michigan, and Indiana. Gillespie resigned from the CEO position on February 1, 2001, and then as chairman at the annual meeting on May 17 during which he was replaced by Henry Meyer. In October 2008, Key received approximately $2.5 billion (~$3.57 billion in 2024) in investment from the Troubled Asset Relief Program. In March 2011, Key was one of the last major banks to pay back TARP funds. In May 2011, Key made history by naming Beth E. Mooney, previously the bank's president, as the first female chairman and CEO of a top 20 bank. In January 2012, Key acquired 37 former HSBC Bank USA branches in Upstate New York from First Niagara Bank for $110 million. In May 2013, the company acquired mortgage servicing rights from Bank of America. In January 2015, KeyBank participated in the construction debt financing syndicate behind the Balko Wind Project purchased from Apex Clean Energy by D.E. Shaw Renewable Investments. First Niagara Bank and KeyBank merger On July 29, 2016, KeyCorp acquired First Niagara Bank for $4.1 billion (~$5.24 billion in 2024) in cash and stock. The deal strengthened Key's position in Upstate New York and New England, as well as entering Pennsylvania for the first time with a presence in both Philadelphia and Pittsburgh. The deal made Key one of the largest banks in Pittsburgh, and gave it branches that were once part of the crosstown rival National City Corp., which Key tried to acquire from PNC Financial Services following the National City acquisition by PNC in 2008 before being outbid by First Niagara. As a result, KeyCorp now held much of the core of what had been Marine Midland Bank, old KeyCorp's longtime rival. Five years earlier, First Niagara had acquired most of the upstate New York branch network of HSBC Bank USA, which had changed its name from Marine Midland in 1999; as mentioned above, Key had acquired 37 HSBC branches in 2012. As part of the transaction, 18 First Niagara branches in Erie and Niagara Counties in New York were sold to Northwest Savings Bank for antitrust reasons. Current day operations KeyBank continues to play an important role in the regional economy of Cleveland, having 6,400 employees. In April 2019, Keybank acquired Laurel Road. On May 13, 2019, it announced it would be opening its first tellerless branch in Boulder, Colorado. Instead of teller lines, the branch features private offices where clients can interact with bankers trained as \"financial wellness consultants\". In September 2019, Christopher Gorman was appointed president. On May 1, 2020, Christopher M. Gorman assumed the role of Chairman, Chief Executive Officer, and President of KeyCorp bringing more than 30 years of financial services experience to his role. In 2021, KeyBank originated 52,366 mortgages worth $25 billion (~$28.5 billion in 2024). KeyBank provided $21 Million in financing options for seniors in a senior housing initiative based in New York in June 2023. However, in May earlier that year, multiple groups claim that they broke a $16.5 billion promise. Naming rights and sponsorships KeyBank is a sponsor of:"
}