{
  "ticker": "KEYS",
  "cik": "0001601046",
  "company_name": "Keysight Technologies",
  "corrected_name": "Keysight Technologies",
  "wiki_title_used": "Keysight Technologies",
  "exists": true,
  "raw_text": "Keysight Technologies, Inc. is an American company that manufactures electronics test and measurement equipment and software. The company was formed as a spin-off of Agilent Technologies, which inherited and rebranded the test and measurement product lines developed and produced, from the late 1960s to the turn of the millennium, by Hewlett-Packard's Test and Measurement division. Its name is a portmanteau of key and insight.\n\nProducts\nKeysight's products include hardware and software for benchtop, modular, and field instruments. Instruments include oscilloscopes, multimeters, logic analyzers, signal generators, spectrum analyzers, vector network analyzers, atomic force microscopes (AFM), automated optical inspection, automated X-ray inspection (5DX), in-circuit testers, power supplies, tunable lasers, optical power meters, wavelength-meters, electro-optic converters, optical modulation analyzers and handheld tools. In addition, it produces electronic design automation (EDA) software (PathWave Design division). It mainly serves the telecommunications, aerospace/defense, industrial, computer, and semiconductor industries.\n\nHistory\nAcquisitions\nKeysight acquired British electronic measurement instrument maker Anite in 2015 for £388 million ($607 million).\nIn 2017, Keysight acquired data technology company Ixia for about $US1.6 billion in cash.\nThe company acquired British software testing company Eggplant Software from The Carlyle Group for $330 million in 2020.\nFrom 2019 to 2021, the company focused on 5G, introducing advanced products such as the Infiniium UXR-Series oscilloscopes. In 2023, the company acquired France-based ESI Group for approximately $1 billion.\nIn 2024, Keysight outbid Viavi Solutions to acquire British telecommunications testing company Spirent for $1.5 billion. That June, the US Department of Justice required the company to divest three of Spirent's businesses, prior to closing the sale, due to antitrust concerns. The sale is closed October 15, 2025, including the regulatory required spin off of three divisions.\n\nControversies\nOn August 3, 2021, Keysight entered into a consent agreement with the Directorate of Defense Trade Controls, Bureau of Political-Military Affairs, Department of State (\"DTCC\") to resolve alleged violations of the Arms Export Control Act and the International Traffic in Arms Regulations (\"ITAR\"). Pursuant to the consent agreement, Keysight was assessed a penalty of $6.6 million to be paid over three years, $2.5 million of which was suspended and designated for remediation activities over three years, including employment of a special compliance officer. The suspended portion of the penalty was satisfied by amounts spent on qualifying compliance activities. On April 23, 2024, Keysight made the final payment on the penalty, with the total amount then paid of $4.1 million. On May 3, 2024, Keysight submitted a letter to the DTCC certifying that it had implemented all aspects of the consent agreement and that the company's compliance program was adequate to identify, prevent, detect, correct, and report violations of the ITAR.\n\nResearch and development\nFrom its launch in 2014 until 2020, Keysight increased its investment in R&D from approximately 12% to 16%, a percentage increase that represented almost a doubling of the investment in absolute dollars.\n\nRecognition\nKeysight won the 2014 Global Frost & Sullivan award for market leadership with $300 million in instrumentation software revenue, with its R&D investment of 12% of revenue ($365 million in 2013) cited as an important factor.\nKeysight was ranked #46th on Fortune's 100 Best Companies to Work For list in 2022.\nTime ranked the company #127th of 500 on its Worlds Most sustainable Companies of 2025 list.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Keysight Technologies: \nTop 12 public test and measurement companies by revenue\nNew Keysight CEO kicks electronic measurement company into overdrive Archived 2015-02-27 at the Wayback Machine",
  "clean_text": "Keysight Technologies, Inc. is an American company that manufactures electronics test and measurement equipment and software. The company was formed as a spin-off of Agilent Technologies, which inherited and rebranded the test and measurement product lines developed and produced, from the late 1960s to the turn of the millennium, by Hewlett-Packard's Test and Measurement division. Its name is a portmanteau of key and insight. Products Keysight's products include hardware and software for benchtop, modular, and field instruments. Instruments include oscilloscopes, multimeters, logic analyzers, signal generators, spectrum analyzers, vector network analyzers, atomic force microscopes (AFM), automated optical inspection, automated X-ray inspection (5DX), in-circuit testers, power supplies, tunable lasers, optical power meters, wavelength-meters, electro-optic converters, optical modulation analyzers and handheld tools. In addition, it produces electronic design automation (EDA) software (PathWave Design division). It mainly serves the telecommunications, aerospace/defense, industrial, computer, and semiconductor industries. History Acquisitions Keysight acquired British electronic measurement instrument maker Anite in 2015 for £388 million ($607 million). In 2017, Keysight acquired data technology company Ixia for about $US1.6 billion in cash. The company acquired British software testing company Eggplant Software from The Carlyle Group for $330 million in 2020. From 2019 to 2021, the company focused on 5G, introducing advanced products such as the Infiniium UXR-Series oscilloscopes. In 2023, the company acquired France-based ESI Group for approximately $1 billion. In 2024, Keysight outbid Viavi Solutions to acquire British telecommunications testing company Spirent for $1.5 billion. That June, the US Department of Justice required the company to divest three of Spirent's businesses, prior to closing the sale, due to antitrust concerns. The sale is closed October 15, 2025, including the regulatory required spin off of three divisions. Controversies On August 3, 2021, Keysight entered into a consent agreement with the Directorate of Defense Trade Controls, Bureau of Political-Military Affairs, Department of State (\"DTCC\") to resolve alleged violations of the Arms Export Control Act and the International Traffic in Arms Regulations (\"ITAR\"). Pursuant to the consent agreement, Keysight was assessed a penalty of $6.6 million to be paid over three years, $2.5 million of which was suspended and designated for remediation activities over three years, including employment of a special compliance officer. The suspended portion of the penalty was satisfied by amounts spent on qualifying compliance activities. On April 23, 2024, Keysight made the final payment on the penalty, with the total amount then paid of $4.1 million. On May 3, 2024, Keysight submitted a letter to the DTCC certifying that it had implemented all aspects of the consent agreement and that the company's compliance program was adequate to identify, prevent, detect, correct, and report violations of the ITAR. Research and development From its launch in 2014 until 2020, Keysight increased its investment in R&D from approximately 12% to 16%, a percentage increase that represented almost a doubling of the investment in absolute dollars. Recognition Keysight won the 2014 Global Frost & Sullivan award for market leadership with $300 million in instrumentation software revenue, with its R&D investment of 12% of revenue ($365 million in 2013) cited as an important factor. Keysight was ranked #46th on Fortune's 100 Best Companies to Work For list in 2022. Time ranked the company #127th of 500 on its Worlds Most sustainable Companies of 2025 list."
}