{
  "ticker": "KHC",
  "cik": "0001637459",
  "company_name": "Kraft Heinz",
  "corrected_name": "Kraft Heinz",
  "wiki_title_used": "Kraft Heinz",
  "exists": true,
  "raw_text": "The Kraft Heinz Company (KHC), commonly known as Kraft Heinz (), is an American multinational food company formed by the merger of Kraft Foods Group, Inc. and the H.J. Heinz Company co-headquartered in Chicago and Pittsburgh. \nWidely seen as unsuccessful, the combined company was worth $12 billion less than the merger price in 2015. Kraft Heinz was the third-largest food and beverage company in North America and the fifth-largest in the world with over $26.0 billion in annual sales as of 2021. Its sister company, Mondelez International, was split from Kraft Foods Inc. in 2012, alongside Kraft before its merger with Heinz. Mondelez holds the old Kraft Foods' snack brands while Kraft Heinz holds the grocery and food processing brands. In addition to Kraft and Heinz, over 20 other brands are part of the company's profile, including Boca Burger, Gevalia, Grey Poupon, Oscar Mayer, Philadelphia Cream Cheese, Primal Kitchen, and Wattie's, eight of which have total individual sales of over $1 billion. Kraft Heinz ranked 114th in the 2018 Fortune 500 list of the largest United States corporations based on 2017 total revenue.\nOn September 2, 2025, Kraft Heinz announced that it would be splitting into two companies – tentatively named Global Taste Elevation Co. and  North American Grocery Co. – ten years after the merger was completed. The demerger, with one company focused on condiments and the other on grocery staples, is expected to be completed in the second half of 2026.\n\nHistory\nThe boards of both companies agreed to the merger of Kraft Foods and H.J. Heinz, with approval by shareholders and regulatory authorities in early 2015. The new Kraft Heinz Company became the world's fifth-largest food and beverage company and the third-largest in the United States. The Kraft Heinz co-headquarters are in Chicago at the Aon Center and in Pittsburgh at PPG Place, with other offices across the United States, Canada, South America, Europe, Asia, and Australia. The merger was completed on July 2, 2015.\nThe merger in 2015 did not immediately affect the naming rights to Heinz Field in Pittsburgh, home of the Pittsburgh Steelers. In July 2022 reports leaked that the company did not renew the rights, which Heinz initially acquired in 2001.\nOn February 17, 2017, it was reported that Kraft Heinz Co. had made a $143 billion approach to take over the British-Dutch multinational Unilever, a significantly larger competitor with 126,000 more employees and £24bn larger revenue than Kraft Heinz. Unilever declined the initial proposal. The takeover was subsequently abandoned on February 19 soon after UK Prime Minister Theresa May had ordered regulators to examine the potential deal.\nOn October 19, 2017, Kraft Heinz announced that it was acquiring Cerebos Pacific, including the Saxa salt, Gregg's, and Bisto brands, from Suntory. On March 9, 2018, New Zealand's Commerce Commission approved the purchase, on the condition that they sell the licenses for Gregg's brand of sauces and the F. Whitlock Worcestershire sauce brand due to competition concerns.\nIn May 2018, Kraft Heinz launched Springboard Brands, a business focused on growing organic, natural, and \"super-premium\" food brands. Later that year, it was announced Kraft Heinz would acquire the Primal Kitchen brand as part of the company's Springboard Incubator. The $200 million deal was completed in early 2019 and was expected to generate $50 million in new annual revenue.\nOn October 24, 2018, Kraft Heinz announced that it was selling its Indian nutritional beverage assets, including Complan and energy drink Glucon-D to Zydus Wellness. The sale was completed on January 30, 2019.\nIn April 2019, it was announced Miguel Patricio, former Chief Marketing Officer of InBev would replace Bernardo Hees as CEO of Kraft Heinz. Patricio took position of CEO in late June 2019 and Alex Behring remained chairman of the company. Later that year, Paulo Basilio returned to his role at Chief Financial Officer and Corrado Azzarita assumed the position of Chief Information Officer. Todd Kaplan has been named chief marketing officer of North America at Kraft Heinz.\nIn June 2019, Kraft Heinz reached a milestone in achieving a 100 percent Corporate Equality Index score from the Human Rights Campaign. The score recognized the company for its LGBTQ inclusion efforts and becoming a leader in the area among food CPG companies. On July 2, 2019, Kraft Heinz sold its Canadian natural cheese business, including the Cracker Barrel, P’tit Quebec, and aMOOza! brands to Parmalat for C$1.62 billion.\nIn September 2020, Kraft Heinz reached a deal to sell part of its cheese business to French multinational dairy product corporation Lactalis for $3.2 billion. The sale included the Breakstone's, Knudsen, Polly-O, Athenos, Hoffman's, and Cracker Barrel cheese brands for the United States, and Cheez Whiz outside of North America. Kraft Heinz then partnered with Lactalis to manufacture Kraft and Velveeta cheeses. On November 10, 2021, the U.S. Justice Department approved the acquisition on the condition that they divest the Athenos and Polly-O businesses. The sale was completed on November 29. The divestiture of Athenos to Emmi Roth was completed on December 1, while the divestiture of Polly-O to BelGioioso Cheese was completed on December 3.\nOn September 15, 2020, Kraft Heinz announced its new Strategic Transformation Plan, including a new company purpose, \"Let's Make Life Delicious\" and an all-new vision, \"To sustainably grow by delighting more consumers globally.\" The next day Kraft Heinz also released its updated 2020 Environmental Social Governance (ESG) report with goals to make 100% of Kraft Heinz product packaging recyclable, reusable, or compostable by 2025 and plans to sustainably source 100 percent of Heinz Ketchup tomatoes by 2025.\nOn February 11, 2021, Kraft Heinz announced its Q4 2020 and full-year results, resulting in 6.2 percent increased sales and over $26 billion in revenue. The same day, Kraft Heinz announced their plans to sell its nuts business, including the Planters brand to Hormel for $3.35 billion. The transaction was completed on June 7.\nOn March 9, 2021, Kraft Heinz announced an agreement with The Hershey Company to sell refrigerated Colliders desserts under Hershey's respective brands.\nIn September 2021, Kraft Heinz announced that Hemmer, a Brazilian company focused on condiments and sauces, was being acquired for an undisclosed amount. This acquisition followed the recent agreement to purchase Assan Foods – a Turkish company focused on sauces – belonging to Kibar Holding, for approximately $100 million.\nOn January 19, 2022, Kraft Heinz announced that it had completed its acquisition of an 85% stake in Germany-based Just Spices GmbH. Launched in 2014, Just Spices is a start-up with approximately €60 million annual sales. Its 170-plus product portfolio includes spice blends, salad dressings, easy-to-prepare \"In Minutes\" blends, and organic offerings for diverse meal occasions ranging from breakfast and light snacks to salads and baking, with a broad range of savory, sweet, classic, and exotic flavors. The proposed deal was first announced on Dec. 10, 2021.\nOn May 18, 2023, Kraft Heinz announced a new partnership with IHOP to sell IHOP-branded coffee at grocery stores nationwide. That partnership was expanded on July 23, 2024, to include the sale of pancake syrups.\nIn June 2025, Kraft Heinz announced it would eliminate artificial food, drug, and cosmetic colors from all U.S. products by the end of 2027, following increased pressure from health officials including HHS Secretary Robert F. Kennedy Jr. The company, which had already removed such dyes from many products, committed to using only natural colors in new items effective immediately. \nIn July 2025, it was reported that Kraft Heinz was planning a breakup of the company into two smaller companies. One company will be global in nature and focus on sauces, spreads and seasonings; the other will focus on grocery staples in North America. At the time of the breakup, the CEO noted Kraft Heinz had nearly 200 brands across 55 categories and 150 countries, \"making it difficult to fully invest in each of them\". Warren Buffet, who helped orchestrate the original merger in 2015 along with 3G Capital, and whose firm Berkshire Hathaway still owns 27.5% of the company, was reportedly \"disappointed\" with the announcement of the split and the prospect of shareholders being unable to vote on the demerger. Kraft Heinz projected only $300 million in dis-synergies.\n\nBrands\nAs of 2023, a partial list of global brands included in the Kraft Heinz portfolio:\nKraft and Heinz:\n\nKraft Dinner\nKraft Parmesan Cheese\nKraft Peanut Butter (Canada)\nHeinz Corned Beef (Africa and the Middle East)\nHeinz Ketchup\nOther:\n\nFinance\nFor the fiscal year 2017, Kraft Heinz reported earnings of US$11.0 billion, with annual revenue of US$26.2 billion, a decline of 0.6% over the previous fiscal cycle. Kraft Heinz's shares traded at over $61 per share, and its market capitalization was valued at over US$136 billion in September 2018.\nIn February 2019, shares in Kraft Heinz fell to a record low of under $35 after the company reported a $10.2bn loss for the previous year as the company announced that it would take a $15.4 billion writedown of its Kraft and Oscar Mayer brands, cut its dividend, and acknowledged that the U.S. Securities and Exchange Commission had opened a probe into its accounting practices. In August 2019, Kraft Heinz announced a further $1.22 billion in writedowns, as well as the return of its former CFO, Paulo Basilio, who held the position until 2017, to replace David Knopf, saying that it wanted a \"seasoned veteran\" following a series of accounting errors.\nOn February 21, 2019, Kraft Heinz reported that they received a Securities and Exchange Commission (SEC) subpoena in October that aimed to look into the company's accounting policies and internal controls. Kraft Heinz also announced that they cut their dividend from 62.5 cents a share to 40 cents. The company also announced a goodwill impairment charge that wrote down the value of the company's Kraft and Oscar Mayer brands of $15.4 billion in the fourth quarter, which resulted in a net loss of $12.61 billion. The all-resulting news made the company's stock crash more than 20% in after-hours trading. The stock plunge resulted in Berkshire Hathaway, the largest stockowner, recording a write down of $3 billion and a stock value loss of $4.3 billion just a day before Berkshire Hathaway's quarterly earnings and annual report to investors.\nIn September 2020, Kraft Heinz announced its new enterprise strategy, including plans to cut $2 billion in costs over five years, resulting in an estimated generation of 4% to 6% adjusted earnings per share growth. The announcement resulted in multiple stock upgrades by CFRA and Guggenheim due to the renewed positive financial outlook of the company.\nIn September 2021, Kraft Heinz was fined $62m to settle the U.S. Securities and Exchange Commission probe into an improper claim of $200m in cost savings. The $200 million in \"bogus cost savings\" (reportedly from merger) forced the company to restate its financial results for the years 2015 through 2018.\n\nAnimal welfare\nIn 2017, Kraft Heinz committed to making a number of improvements to the welfare of broiler chickens in their supply chains by 2024. These included commitments to source chickens from high welfare breeds, provide birds with more space, and implement third-party monitoring.\nIn 2019, Kraft Heinz made an updated pledge to comply with the European Chicken Commitment, an animal welfare standard, for 100% of the chickens in its supply chain, by 2026.\nIn 2021, the BBFAW, an animal welfare monitoring organization, gave Kraft Heinz a rating that indicated it had established animal welfare practices but still has room to grow. At that time, according to Kraft Heinz, 70% of the chickens in the company's supply chain were cage-free or free-range.\n\nControversies\nIn 2017, the claim that the Kraft Parmesan Cheese label was misleading was rejected by judges. The label reads \"Kraft 100% Grated Parmesan Cheese\". It was argued that a \"reasonable consumer\" would know the product could not be 100% cheese, as any dairy product degrades quickly without preservatives.\nOn December 1, 2023, a federal jury in Illinois awarded $17.8 million to several large food companies, including Kraft Heinz, in a lawsuit against Cal-Maine Foods, Inc. and others over allegations of egg price fixing. Cal-Maine Foods, contesting the verdict, insists on its innocence and the absence of wrongdoing in its business practices.\n\nSee also\nList of food companies\nList of brand name food products\nList of dairy product companies in the United States\n\nReferences\nFurther reading\nSusanna, Kim (March 25, 2015). \"How the New Kraft Heinz Co. Is About to Take Over Your Kitchen\". ABC News. Retrieved March 26, 2015.\n\nExternal links\n\nOfficial website\nBusiness data for The Kraft Heinz Company:",
  "clean_text": "The Kraft Heinz Company (KHC), commonly known as Kraft Heinz (), is an American multinational food company formed by the merger of Kraft Foods Group, Inc. and the H.J. Heinz Company co-headquartered in Chicago and Pittsburgh. Widely seen as unsuccessful, the combined company was worth $12 billion less than the merger price in 2015. Kraft Heinz was the third-largest food and beverage company in North America and the fifth-largest in the world with over $26.0 billion in annual sales as of 2021. Its sister company, Mondelez International, was split from Kraft Foods Inc. in 2012, alongside Kraft before its merger with Heinz. Mondelez holds the old Kraft Foods' snack brands while Kraft Heinz holds the grocery and food processing brands. In addition to Kraft and Heinz, over 20 other brands are part of the company's profile, including Boca Burger, Gevalia, Grey Poupon, Oscar Mayer, Philadelphia Cream Cheese, Primal Kitchen, and Wattie's, eight of which have total individual sales of over $1 billion. Kraft Heinz ranked 114th in the 2018 Fortune 500 list of the largest United States corporations based on 2017 total revenue. On September 2, 2025, Kraft Heinz announced that it would be splitting into two companies – tentatively named Global Taste Elevation Co. and North American Grocery Co. – ten years after the merger was completed. The demerger, with one company focused on condiments and the other on grocery staples, is expected to be completed in the second half of 2026. History The boards of both companies agreed to the merger of Kraft Foods and H.J. Heinz, with approval by shareholders and regulatory authorities in early 2015. The new Kraft Heinz Company became the world's fifth-largest food and beverage company and the third-largest in the United States. The Kraft Heinz co-headquarters are in Chicago at the Aon Center and in Pittsburgh at PPG Place, with other offices across the United States, Canada, South America, Europe, Asia, and Australia. The merger was completed on July 2, 2015. The merger in 2015 did not immediately affect the naming rights to Heinz Field in Pittsburgh, home of the Pittsburgh Steelers. In July 2022 reports leaked that the company did not renew the rights, which Heinz initially acquired in 2001. On February 17, 2017, it was reported that Kraft Heinz Co. had made a $143 billion approach to take over the British-Dutch multinational Unilever, a significantly larger competitor with 126,000 more employees and £24bn larger revenue than Kraft Heinz. Unilever declined the initial proposal. The takeover was subsequently abandoned on February 19 soon after UK Prime Minister Theresa May had ordered regulators to examine the potential deal. On October 19, 2017, Kraft Heinz announced that it was acquiring Cerebos Pacific, including the Saxa salt, Gregg's, and Bisto brands, from Suntory. On March 9, 2018, New Zealand's Commerce Commission approved the purchase, on the condition that they sell the licenses for Gregg's brand of sauces and the F. Whitlock Worcestershire sauce brand due to competition concerns. In May 2018, Kraft Heinz launched Springboard Brands, a business focused on growing organic, natural, and \"super-premium\" food brands. Later that year, it was announced Kraft Heinz would acquire the Primal Kitchen brand as part of the company's Springboard Incubator. The $200 million deal was completed in early 2019 and was expected to generate $50 million in new annual revenue. On October 24, 2018, Kraft Heinz announced that it was selling its Indian nutritional beverage assets, including Complan and energy drink Glucon-D to Zydus Wellness. The sale was completed on January 30, 2019. In April 2019, it was announced Miguel Patricio, former Chief Marketing Officer of InBev would replace Bernardo Hees as CEO of Kraft Heinz. Patricio took position of CEO in late June 2019 and Alex Behring remained chairman of the company. Later that year, Paulo Basilio returned to his role at Chief Financial Officer and Corrado Azzarita assumed the position of Chief Information Officer. Todd Kaplan has been named chief marketing officer of North America at Kraft Heinz. In June 2019, Kraft Heinz reached a milestone in achieving a 100 percent Corporate Equality Index score from the Human Rights Campaign. The score recognized the company for its LGBTQ inclusion efforts and becoming a leader in the area among food CPG companies. On July 2, 2019, Kraft Heinz sold its Canadian natural cheese business, including the Cracker Barrel, P’tit Quebec, and aMOOza! brands to Parmalat for C$1.62 billion. In September 2020, Kraft Heinz reached a deal to sell part of its cheese business to French multinational dairy product corporation Lactalis for $3.2 billion. The sale included the Breakstone's, Knudsen, Polly-O, Athenos, Hoffman's, and Cracker Barrel cheese brands for the United States, and Cheez Whiz outside of North America. Kraft Heinz then partnered with Lactalis to manufacture Kraft and Velveeta cheeses. On November 10, 2021, the U.S. Justice Department approved the acquisition on the condition that they divest the Athenos and Polly-O businesses. The sale was completed on November 29. The divestiture of Athenos to Emmi Roth was completed on December 1, while the divestiture of Polly-O to BelGioioso Cheese was completed on December 3. On September 15, 2020, Kraft Heinz announced its new Strategic Transformation Plan, including a new company purpose, \"Let's Make Life Delicious\" and an all-new vision, \"To sustainably grow by delighting more consumers globally.\" The next day Kraft Heinz also released its updated 2020 Environmental Social Governance (ESG) report with goals to make 100% of Kraft Heinz product packaging recyclable, reusable, or compostable by 2025 and plans to sustainably source 100 percent of Heinz Ketchup tomatoes by 2025. On February 11, 2021, Kraft Heinz announced its Q4 2020 and full-year results, resulting in 6.2 percent increased sales and over $26 billion in revenue. The same day, Kraft Heinz announced their plans to sell its nuts business, including the Planters brand to Hormel for $3.35 billion. The transaction was completed on June 7. On March 9, 2021, Kraft Heinz announced an agreement with The Hershey Company to sell refrigerated Colliders desserts under Hershey's respective brands. In September 2021, Kraft Heinz announced that Hemmer, a Brazilian company focused on condiments and sauces, was being acquired for an undisclosed amount. This acquisition followed the recent agreement to purchase Assan Foods – a Turkish company focused on sauces – belonging to Kibar Holding, for approximately $100 million. On January 19, 2022, Kraft Heinz announced that it had completed its acquisition of an 85% stake in Germany-based Just Spices GmbH. Launched in 2014, Just Spices is a start-up with approximately €60 million annual sales. Its 170-plus product portfolio includes spice blends, salad dressings, easy-to-prepare \"In Minutes\" blends, and organic offerings for diverse meal occasions ranging from breakfast and light snacks to salads and baking, with a broad range of savory, sweet, classic, and exotic flavors. The proposed deal was first announced on Dec. 10, 2021. On May 18, 2023, Kraft Heinz announced a new partnership with IHOP to sell IHOP-branded coffee at grocery stores nationwide. That partnership was expanded on July 23, 2024, to include the sale of pancake syrups. In June 2025, Kraft Heinz announced it would eliminate artificial food, drug, and cosmetic colors from all U.S. products by the end of 2027, following increased pressure from health officials including HHS Secretary Robert F. Kennedy Jr. The company, which had already removed such dyes from many products, committed to using only natural colors in new items effective immediately. In July 2025, it was reported that Kraft Heinz was planning a breakup of the company into two smaller companies. One company will be global in nature and focus on sauces, spreads and seasonings; the other will focus on grocery staples in North America. At the time of the breakup, the CEO noted Kraft Heinz had nearly 200 brands across 55 categories and 150 countries, \"making it difficult to fully invest in each of them\". Warren Buffet, who helped orchestrate the original merger in 2015 along with 3G Capital, and whose firm Berkshire Hathaway still owns 27.5% of the company, was reportedly \"disappointed\" with the announcement of the split and the prospect of shareholders being unable to vote on the demerger. Kraft Heinz projected only $300 million in dis-synergies. Brands As of 2023, a partial list of global brands included in the Kraft Heinz portfolio: Kraft and Heinz: Kraft Dinner Kraft Parmesan Cheese Kraft Peanut Butter (Canada) Heinz Corned Beef (Africa and the Middle East) Heinz Ketchup Other: Finance For the fiscal year 2017, Kraft Heinz reported earnings of US$11.0 billion, with annual revenue of US$26.2 billion, a decline of 0.6% over the previous fiscal cycle. Kraft Heinz's shares traded at over $61 per share, and its market capitalization was valued at over US$136 billion in September 2018. In February 2019, shares in Kraft Heinz fell to a record low of under $35 after the company reported a $10.2bn loss for the previous year as the company announced that it would take a $15.4 billion writedown of its Kraft and Oscar Mayer brands, cut its dividend, and acknowledged that the U.S. Securities and Exchange Commission had opened a probe into its accounting practices. In August 2019, Kraft Heinz announced a further $1.22 billion in writedowns, as well as the return of its former CFO, Paulo Basilio, who held the position until 2017, to replace David Knopf, saying that it wanted a \"seasoned veteran\" following a series of accounting errors. On February 21, 2019, Kraft Heinz reported that they received a Securities and Exchange Commission (SEC) subpoena in October that aimed to look into the company's accounting policies and internal controls. Kraft Heinz also announced that they cut their dividend from 62.5 cents a share to 40 cents. The company also announced a goodwill impairment charge that wrote down the value of the company's Kraft and Oscar Mayer brands of $15.4 billion in the fourth quarter, which resulted in a net loss of $12.61 billion. The all-resulting news made the company's stock crash more than 20% in after-hours trading. The stock plunge resulted in Berkshire Hathaway, the largest stockowner, recording a write down of $3 billion and a stock value loss of $4.3 billion just a day before Berkshire Hathaway's quarterly earnings and annual report to investors. In September 2020, Kraft Heinz announced its new enterprise strategy, including plans to cut $2 billion in costs over five years, resulting in an estimated generation of 4% to 6% adjusted earnings per share growth. The announcement resulted in multiple stock upgrades by CFRA and Guggenheim due to the renewed positive financial outlook of the company. In September 2021, Kraft Heinz was fined $62m to settle the U.S. Securities and Exchange Commission probe into an improper claim of $200m in cost savings. The $200 million in \"bogus cost savings\" (reportedly from merger) forced the company to restate its financial results for the years 2015 through 2018. Animal welfare In 2017, Kraft Heinz committed to making a number of improvements to the welfare of broiler chickens in their supply chains by 2024. These included commitments to source chickens from high welfare breeds, provide birds with more space, and implement third-party monitoring. In 2019, Kraft Heinz made an updated pledge to comply with the European Chicken Commitment, an animal welfare standard, for 100% of the chickens in its supply chain, by 2026. In 2021, the BBFAW, an animal welfare monitoring organization, gave Kraft Heinz a rating that indicated it had established animal welfare practices but still has room to grow. At that time, according to Kraft Heinz, 70% of the chickens in the company's supply chain were cage-free or free-range. Controversies In 2017, the claim that the Kraft Parmesan Cheese label was misleading was rejected by judges. The label reads \"Kraft 100% Grated Parmesan Cheese\". It was argued that a \"reasonable consumer\" would know the product could not be 100% cheese, as any dairy product degrades quickly without preservatives. On December 1, 2023, a federal jury in Illinois awarded $17.8 million to several large food companies, including Kraft Heinz, in a lawsuit against Cal-Maine Foods, Inc. and others over allegations of egg price fixing. Cal-Maine Foods, contesting the verdict, insists on its innocence and the absence of wrongdoing in its business practices."
}