{
  "ticker": "KIM",
  "cik": "0000879101",
  "company_name": "Kimco Realty",
  "corrected_name": "Kimco Realty",
  "wiki_title_used": "Kimco Realty",
  "exists": true,
  "raw_text": "Kimco Realty Corporation, headquartered in Jericho, New York, is a real estate investment trust that invests in shopping centers. \nAs of December 31, 2024, the company owned interests in 568 U.S. shopping centers and mixed-use assets comprising 101.1 million square feet of gross leasable space.\n\nHistory\nThe Kimco Corporation, the predecessor of the company, was founded in 1966 by a group of real estate investors, including Martin Kimmel and Milton Cooper, who merged their retail assets. This asset merger led to the new company being named Kim-co. The company was incorporated in 1973.\nIn 1988, the company acquired Gold Circle for $325 million.\nIn November 1991, the company became a public company via an initial public offering, raising $120 million.\nIn 1998, the company acquired Price REIT for $535 million in stock.\nIn October 2003, the company acquired Mid-Atlantic Realty Trust for $441 million.\nIn August 2021, the company acquired Weingarten Realty.\nIn November 2022, the company acquired a portfolio of eight Long Island, NY shopping centers for $375.8 million.\nIn January 2024, Kimco acquired RPT Realty, making the company the largest shopping center REIT.\nIn October 2024, the company acquired Waterford Lakes Town Center for $322 million.\n\nReferences\nExternal links\nBusiness data for Kimco Realty Corporation:",
  "clean_text": "Kimco Realty Corporation, headquartered in Jericho, New York, is a real estate investment trust that invests in shopping centers. As of December 31, 2024, the company owned interests in 568 U.S. shopping centers and mixed-use assets comprising 101.1 million square feet of gross leasable space. History The Kimco Corporation, the predecessor of the company, was founded in 1966 by a group of real estate investors, including Martin Kimmel and Milton Cooper, who merged their retail assets. This asset merger led to the new company being named Kim-co. The company was incorporated in 1973. In 1988, the company acquired Gold Circle for $325 million. In November 1991, the company became a public company via an initial public offering, raising $120 million. In 1998, the company acquired Price REIT for $535 million in stock. In October 2003, the company acquired Mid-Atlantic Realty Trust for $441 million. In August 2021, the company acquired Weingarten Realty. In November 2022, the company acquired a portfolio of eight Long Island, NY shopping centers for $375.8 million. In January 2024, Kimco acquired RPT Realty, making the company the largest shopping center REIT. In October 2024, the company acquired Waterford Lakes Town Center for $322 million."
}