{
  "ticker": "KKR",
  "cik": "0001404912",
  "company_name": "KKR & Co.",
  "corrected_name": "KKR & Co.",
  "wiki_title_used": "KKR & Co.",
  "exists": true,
  "raw_text": "KKR & Co. Inc., also known as Kohlberg Kravis Roberts & Co., is an American global private equity and investment company. As of December 31, 2024, the firm had completed 770 private-equity investments with approximately $790 billion of total enterprise value. Its assets under management (AUM) and fee paying assets under management (FPAUM) were $553 billion and $446 billion, respectively.\nKKR was founded in 1976 by Jerome Kohlberg Jr., and cousins Henry Kravis and George R. Roberts, all of whom had previously worked together at Bear Stearns, where they completed some of the earliest leveraged buyout transactions. Notable transactions by KKR include the 1989 leveraged buyout of RJR Nabisco as well as the 2007 buyout of TXU Energy, both of which, upon completion, were the largest buyouts ever to date.\nKKR is headquartered at 30 Hudson Yards, Manhattan, New York, with offices in Beijing, Dubai, Dublin, Houston, Hong Kong, London, Luxembourg, Madrid, Menlo Park, Mumbai, Paris, Riyadh, San Francisco, São Paulo, Seoul, Singapore, Shanghai, Sydney and Tokyo.\nIn a 2016 interview with Bloomberg, founder Henry Kravis described KKR in terms of three broad buckets: private markets, public markets, and capital markets.\n\nHistory\nFounding and early history\nWhile running the corporate finance department for Bear Stearns in the 1960s and 1970s, Jerome Kohlberg, Jr., and later Henry Kravis and George R. Roberts, completed a series of what they described as \"bootstrap\" investments. They targeted family-owned businesses, many of which had been founded in the years following World War II, that were facing succession issues. Many of these companies lacked a viable exit for their founders because they were too small to be taken public and the founders were reluctant to sell out to competitors.\nIn 1964, Lewis Cullman made what some people call the first significant leveraged buyout transaction, acquiring and then selling Orkin. In the following years the three Bear Stearns bankers completed a series of buyouts including Stern Metals (1965), Incom (a division of Rockwood International, 1971), Cobblers Industries ($27 million, 1971), and Boren Clay (1973), as well as Thompson Wire, Eagle Motors and Barrows through their investment in Stern Metals. Despite several highly successful investments, Cobblers ended in bankruptcy.\nBy 1976, tensions had built up between Bear Stearns and the three: most notably, executive Cy Lewis had rejected repeated proposals to form a dedicated in-house investment fund. This led them to form their own firm, Kohlberg Kravis Roberts & Co. The name had been planned to be Kohlberg Roberts Kravis, but public relations advisors preferred the sound of KKR.\nThe new KKR completed its first buyout, of manufacturer A.J. Industries, in 1976. KKR raised capital from a small group of investors including the Hillman Company and First Chicago Bank. By 1978, with the revision of the ERISA regulations, KKR was successful in raising its first institutional fund with over $30 million of investor commitments. In 1981, KKR expanded its investor base after the Oregon State Treasury's public pension fund invested in KKR's acquisition of retailer Fred Meyer, Inc. based in Portland. Oregon State remains an active investor in KKR funds.\nIn 1979, KKR completed a risky, precedent-setting $380 million public-to-private leveraged buyout of Houdaille Industries, a well-known producer of machine tools, industrial pipes, chrome-plated car bumpers and torsional viscous dampers. It soon ended in a spectacular failure, breakup of the half-century-old company, and the loss of thousands of jobs, even though creditors earned a profit.\nThe firm's acquisitions during the 1980s buyout boom include:\n\nBuyout of RJR Nabisco\nAt age 61, Kohlberg resigned in 1987. He later founded his own private equity firm, Kohlberg & Co.. Henry Kravis succeeded him as senior partner. Under Kravis and Roberts, the firm was responsible for the 1988 leveraged buyout of RJR Nabisco. RJR Nabisco was the largest buyout in history at that time, at $25 billion, and remained the largest for 17 years. The deal was chronicled in Barbarians at the Gate: The Fall of RJR Nabisco, and later made into a television movie starring James Garner.\nIn 1988, F. Ross Johnson was the president and CEO of RJR Nabisco, a leading producer of food and tobacco products, formed in 1985 by the merger of Nabisco Brands and R.J. Reynolds Tobacco Company. In October 1988, Johnson proposed a $17 billion ($75 per share) management buyout of the company with the financial backing of investment bank Shearson Lehman Hutton and its parent company, American Express.\nSeveral days later, Kravis, who had originally suggested the buyout to Johnson, presented a new bid for $20.3 billion ($90 per share) financed with Kravis' own aggressive debt package. KKR had the support of equity co-investments from pension funds and other institutional investors, including Coca-Cola, Georgia-Pacific and United Technologies corporate pension funds, as well as endowments from MIT, Harvard and the New York State Common Retirement Fund. However, KKR faced criticism from existing investors over the firm's use of a hostile takeover in the buyout of RJR.\nKKR proposed to provide a joint offer with Johnson and Shearson Lehman but was rebuffed and Johnson attempted to stonewall KKR's access to financial information from RJR. Rival private equity firm Forstmann Little & Co. was invited into the process by Shearson Lehman, and attempted to provide a bid for RJR with a consortium of Goldman Sachs Capital Partners, Procter & Gamble, Ralston Purina and Castle & Cooke. Ultimately, the Forstmann consortium came apart and did not provide a final bid for RJR.\nIn November 1988, RJR set guidelines for a final bid submission at the end of the month. The management and Shearson group submitted a final bid of $112, a figure they felt certain would enable them to outflank any response by Kravis and KKR. KKR's final bid of $109, while a lower dollar figure, was ultimately accepted by the board of directors of RJR Nabisco. KKR's offer was guaranteed, whereas the management offer lacked a \"reset\", meaning that the final share price might have been lower than their stated $112 per share.\nAdditionally, many in RJR's board of directors were concerned about disclosures of Ross Johnson's unprecedented golden parachute deal. Time magazine featured Johnson on the cover of its December 5, 1988 issue along with the headline, \"A Game of Greed: This man could pocket $100 million from the largest corporate takeover in history. Has the buyout craze gone too far?\". KKR's offer was welcomed by the board, and, to some observers, it appeared that the elevation of the reset issue as a deal-breaker in KKR's favor was little more than an excuse to reject Johnson's higher bid of $112 per share. Johnson received $53 million from the buyout. KKR collected a $75 million fee in the RJR takeover. At $31.1 billion of а transaction value including assumed debt, RJR Nabisco was, at the time, by far the largest leveraged buyout in history.\n\nEarly 1990s: The aftermath of RJR Nabisco\nThe buyout of RJR Nabisco was completed in April 1989 and KKR spent the early 1990s repaying the debt load through asset sales and restructuring transactions. KKR did not complete a single investment in 1990, the first such year since 1982. KKR began to focus primarily on its existing portfolio companies acquired during the buyout boom of the late 1980s. Six of KKR's portfolio companies completed IPOs in 1991, including RJR Nabisco and Duracell.\nIn January 1990, KKR completed the sale of RJR's Del Monte Foods to a group led by Merrill Lynch. KKR had originally identified a group of divisions that it could sell to reduce debt.\nKKR contributed $1.7 billion of new equity into RJR in July 1990 to complete a restructuring of the company's balance sheet. KKR's equity contribution as part of the original leveraged buyout of RJR had been only $1.5 billion. In December 1990, RJR announced an exchange offer to swap debt in RJR for a new public stock in the company, effectively an unusual means of an initial public offering and simultaneously reducing debt on the company.\nRJR issued additional stock to the public in March 1991 to reduce debt further, resulting in an upgrade of the credit rating of RJR's debt from junk to investment grade. KKR began to reduce its ownership in RJR in 1994, when its stock in RJR was used as part of the consideration for its leveraged buyout of Borden, a producer of food and beverage products, consumer products, and industrial products. In 1995, KKR divested itself of its final stake in RJR Nabisco when Borden sold a $638 million block of stock.\nWhile KKR no longer had any ownership of RJR Nabisco by 1995, its original investment was not be fully realized until KKR exited its last investment in 2004. After sixteen years of efforts, including contributing new equity, an IPO, asset sales, and exchanging shares of RJR for the ownership of Borden, KKR finally sold the last remnants of its 1989 investment. In July 2004, KKR agreed to sell its stock in Borden Chemical to Apollo Management for $1.2 billion.\n\nEarly 1990s: Investments\nIn the early 1990s, the absence of an active high yield market prompted KKR to change its tactics, avoiding large leveraged buyouts in favor of industry consolidations through what was described as leveraged buildups or rollups. One of KKR's largest investments in the 1990s was the leveraged buildup of Primedia (now Rent Group) in partnership with former executives of Macmillan Publishing, which KKR had failed to acquire in 1988. KKR created K-III Communications (now Rent Group), a platform to buy media properties, initially completing the $310 million divisional buyout of the book club division of Macmillan along with the assets of Intertec Publishing Corporation in May 1989.\nDuring the early 1990s, K-III continued acquiring publishing assets, including a $650 million acquisition from News Corporation in 1991. K-III went public, however instead of cashing out, KKR continued to make new investments in the company in 1998, 2000 and 2001 to support acquisition activity. In 2005, Primedia redeemed KKR's preferred stock in the company but KKR was estimated to have lost hundreds of millions of dollars on its common stock holdings as the price of the company's stock collapsed.\nIn 1991, KKR partnered with Fleet/Norstar Financial Group in the 1991 acquisition of the Bank of New England, from the Federal Deposit Insurance Corporation. In January 1996, KKR exchanged its investment for a 7.5% interest in Fleet Bank. In 1992, KKR completed the buyout of American Re Corporation from Aetna as well as a 47% interest in TW Corporation, later known as The Flagstar Companies and owner of Denny's. Among the other notable investments KKR completed in the early 1990s included World Color Press (1993–95), RELTEC Corporation (1995) and Bruno's (1995).\n\n1996–1999\nBy the mid-1990s, the debt markets were improving and KKR had moved on from the RJR Nabisco buyout. In 1996, KKR was able to complete the bulk of fundraising for what was then a record $6 billion private equity fund, the KKR 1996 Fund. However, KKR was still burdened by the performance of the RJR investment and repeated obituaries in the media. KKR was required by its investors to reduce the fees it charged and to calculate its carried interest based on the total profit of the fund (i.e., offsetting losses from failed deals against the profits from successful deals).\n\nKKR acquired Spalding Holdings Corporation and Evenflo in August 1996, Newsquest in January 1996, KinderCare Learning Centers in October 1996, Amphenol Corporation in January 1997, Randalls Food Markets in June 1997, MedCath Corporation in March 1998, The Boyds Collection in April 1998, Willis Group Holdings in July 1998, and Wincor Nixdorf in October 1999.\nKKR's largest investment of the 1990s was one of its least successful. In January 1998, KKR and Hicks, Muse, Tate & Furst agreed to the $1.5 billion buyouts of Regal Entertainment Group. KKR and Hicks Muse had initially intended to combine Regal with Act III Cinemas, which KKR had acquired in 1997 for $706 million and United Artists Theaters, which Hicks Muse had agreed to acquire for $840 million in November 1997. Shortly after agreeing to the Regal takeover, the deal with United Artists fell apart and the company was not able to scale up. In 2000, Regal encountered significant financial issues and filed bankruptcy protection and was acquired by Philip Anschutz.\n\n2000–2005\nLosses on such investments as Regal Entertainment Group, Spalding, Flagstar and K-III Communications (now Rent Group) were offset by successes in Willis Group, Wise Foods, Inc., Wincor Nixdorf and MTU Aero Engines, among others. The end of dot-com bubble affected buyout deals.\n\nIn November 1999, KKR acquired Shoppers Drug Mart. KKR was able to realize its investment in Shoppers Drug Mart through a 2002 IPO and subsequent public stock offerings.\nIn November 2002, KKR acquired Bell Canada Yellow Pages. In May 2004, directories business was sold in an initial public offering as Yellow Pages Income Fund, a Canadian income trust.\n\nIn 2004, in a club deal and one of the largest buyouts in years, KKR, Bain Capital and Vornado Realty Trust acquired Toys \"R\" Us for $6.6 billion after outbidding Cerberus Capital Management, which offered $5.5 billion.\nIn 2005, KKR partnered with Silver Lake Partners, Bain Capital, Goldman Sachs Capital Partners, Blackstone Group, Providence Equity Partners, and TPG Capital to acquire SunGard for $11.3 billion. This represented the largest leveraged buyout completed since the takeover of RJR Nabisco in 1988. SunGard was the largest buyout of a technology company until the buyout of Freescale Semiconductor by affiliates of The Blackstone Group. The SunGard transaction was notable given the number of firms involved in the transaction, the largest club deal completed to that point. The involvement of seven firms in the consortium was criticized by investors in private equity who considered cross-holdings among firms to be generally unattractive.\n\nBuyout boom (2006–2007)\nIn 2006, KKR raised $17.6 billion for the KKR 2006 Fund, with which the firm began executing a series of some of the largest buyouts in history. KKR's $44 billion takeover of Texas-based power utility TXU Energy in 2007 was the largest leveraged buyout of private equity in the 21st century and the largest buyout completed to date. Among the most notable companies acquired by KKR in 2006 and 2007 were the following:\n\nKKR acquired a 40% stake in Longview Power Plant in 2006; it filed for bankruptcy protection in 2020.\nIn October 2006, KKR acquired a 50% stake in Tarkett, a France-based distributor of flooring products, in a deal valued at about €1.4 billion ($1.8 billion).\nIn November 2006, KKR formed a A$4 billion partnership with the Seven Network of Australia.\nIn January 2007, KKR invested $700 million through a private investment in public equity in Sun Microsystems.\nIn January 2008, KKR made a $1.25 billion private investment in public equity in Legg Mason through a convertible preferred stock offering.\nOn April 26, 2007, Harman International Industries entered an agreement to be acquired by KKR and Goldman Sachs for $8 billion. However, in September 2007, the agreement was terminated after a drop in earnings at Harmon during the Great Recession.\n\nInitial public offering (2007)\nIn 2007, KKR filed with the Securities and Exchange Commission to raise $1.25 billion by selling an ownership interest in its management company. The filing came less than two weeks after the initial public offering of rival private equity firm Blackstone Inc. KKR had previously listed its KPE vehicle in 2006, but for the first time, KKR offered investors an ownership interest in the private equity firm itself. The onset of the credit crunch and the weak IPO market dampened the prospects of obtaining a valuation attractive to KKR. The flotation was repeatedly postponed and called off by the end of August.\nIn July 2008, KKR announced a reverse takeover of its listed affiliate KKR Private Equity Investors in exchange for a 21% interest in the firm to become a public company. In November 2008, the transaction was delayed until 2009. Shares of KPE had declined significantly in the second half of 2008 due to the 2008 financial crisis.\nIn October 2009, KKR listed shares in KKR & Co. on the Euronext exchange.\nIn March 2010, KKR filed to list its shares on the New York Stock Exchange (NYSE), Trading commenced on July 15, 2010.\n\n2010–2019\nIn December 2011, Samson Investment Company was acquired by a group of private equity investors led by KKR for approximately $7.2 billion and Samson Resources Corporation was formed. With the severe downturn in oil and natural gas prices, in September 2015, Samson filed Chapter 11 bankruptcy and during its bankruptcy process, sold several large assets.\nIn March 2013, a year after making her first retail real-estate investment in Illinois' Yorktown Center, it sold its 51% stake in BMG Rights Management to Bertelsmann. In January 2014, KKR acquired Sedgwick Claims Management Services Inc for $2.4 billion from two private equity companies - Stone Point, and Hellman & Friedman.\nIn June 2014, KKR acquired a one-third stake in Spanish energy business Acciona Energy, at a cost of €417 million ($567 million). The international renewable energy generation business operates renewable assets, largely wind farms, across 14 countries including the United States, Italy and South Africa.\nIn August, KKR invested $400 million for 18% of Fujian Sunner Development, China's largest chicken farmer, which breeds, processes and supplies frozen and fresh chickens to consumers and corporate clients, such as KFC and McDonald's, across China. In September, the firm invested $90 million in lighting and electrics firm Savant Systems.\nAlso in 2014, KKR acquired commercial landscaping company ValleyCrest from Michael Dell's investment firm MSD Capital, and combined it with landscape company Brickman, which it had owned since 2013, to form BrightView. The following year, in addition to acquiring Exponent's British rail ticket website Trainline, KKR bought a majority stake in Selecta Group, a European vending services operator, from Allianz Capital Partners.\nIn 2016, KKR purchased two Hispanic grocery chains, Northern California Mi Pueblo and Ontario, California–based Cardenas. In February, seven months before acquiring US software company Epicor, KKR invested $75 million in commercial real estate lender A10 Capital.\nIn October, it invested $250 million in OVH to be used for further international expansion; this funding round valued OVH at over $1 billion, making it a unicorn. In December, the firm sold Capsugel for $5.5 billion to the Lonza Group.\nIn March 2017, KKR partnered with a fund linked to Dell to acquire GfK. In August, a month after acquiring WebMD for $2.8 billion KKR acquired PharMerica for $1.4 billion including debt, Pepper Group Limited for $518 million, Covenant Surgical Partners, and Envision Healthcare Corporation's ambulance business (American Medical Response) for $2.4 billion.\nIn September, two months after KKR merged Mi Pueblo and Cardenas Market, Toys \"R\" Us, Inc. filed for Chapter 11 bankruptcy, stating the move would give it flexibility to deal with $5 billion in long-term debt, borrow $2 billion so it would be able to pay suppliers for the upcoming holiday season and invest in improving current operations.\nDuring 2017, KKR purchased an 80% stake in Dixon Hospitality Group for A$190 million, renaming it Australian Venue Co. (AVC); it was expanded and then sold for US$900 million in 2023.\nIn July 2018, while acquiringRBMedia, one of the largest independent publishers and distributors of audiobooks  and Taipei-based LCY Chemical for NT$47.8 billion ($1.56 billion US), the company sold Gallagher Shopping Park in the West Midlands to Hana Financial Group for £175 million.\nIn February 2019, KKR acquired Brightsprings, and in a 2022 letter from four U.S. senators including Elizabeth Warren and Bernie Sanders, Joseph Bae and Scott Nutall were asked to explain the substandard care since the acquisition. In the same month, it acquired Tele München Gruppe and the German film distributor Universum Film GmbH.\nIn April, three months before buying Corel, it acquired German film production company Wiedemann & Berg Film Production. In August, KKR acquired Arnott's Biscuits, the Australian snack unit of Campbell Soup Company, for $2.2 billion.\nAlso in August, KKR became the biggest shareholder of German media group Axel Springer SE, paying $3.2 billion for a 43.54% stake. Later that month, the firm also acquired a majority stake in Heidelpay from AnaCap Financial Partners for more than €600 million.\nIn December, KKR, together with Alberta Investment Management Corporation, acquired a 65% stake in the controversial Coastal GasLink Pipeline project from TC Energy.\n\n2020–2024\nIn May 2020, two months after acquiring Viridor for £4.2 billion, the company invested $750 million in cosmetics producer Coty and $1.5 billion in Jio Platforms. In June, it acquired it purchased OverDrive, Inc., a major e-book distributor for libraries that merged with its subsidiary RBMedia.\nIn June, when it led a $48 million funding round for Artlist, a provider of royalty-free music, sound effects and video, KKR acquired Roompot Group, a provider of holiday parks in Europe, from French private equity firm PAI Partners for approximately €1 billion. In August, a group primary represented by private-equity firm Clayton, Dubilier & Rice acquired Epicor for $4.7 billion.\nIn November, two months after investing $755 million in Reliance Industries' retail arm, it partnered with Rakuten to acquire 85% of Seiyu Group, the Japanese nationwide retail chain owned by Walmart. In January 2021, KKR acquired a majority stake in the catalogue of American musician Ryan Tedder, including his band OneRepublic and the songs that he composed for other artists since 2016.\nIn November 2021, in addition to selling Audiobooks.com to streaming company Storytel for $135 million, KKR partnered with Global Infrastructure Partners to acquire CyrusOne for $15 billion. In February 2022, the firm acquired 8.5% of Nexon.\nIn May 2022, after acquiring Mitsubishi UBS Realty, a Japanese real estate asset manager, it led about $200 million investment round in Semperis, a cybersecurity company focused on identity protection.\nIn June, when it sold Cardenas to funds affiliated with Apollo Global Management, the company rose to the top of Private Equity International's PEI 300 ranking for the first time, replacing Blackstone Inc. as the largest private equity firm in the world. KKR slipped back to second place in 2023 and 2024, before regaining top spot in the 2025 list.\nIn July, a month before acquiring Barracuda Networks, the firm purchased a 25% stake in Northumbrian Water Group, a UK water utility company, for approximately £870 million. In October, KKR acquired ISO tank services provider Boasso Global from Apax Partners.\nIn April 2023, it acquired a 30% stake in FGS Global that valued the company at about $1.4 billion. In August, KKR sold its controlling stakes in Australian Venue Co. to PAG for about A$1.4 billion.\nIn October, KKR acquired Simon & Schuster, a Big Five publisher, for $1.6 billion; Simon & Schuster employees received employee stock ownership in the company on completion of the acquisition. In the same month, it secured a minority stake in Catalio Capital Management, a firm specializing in the management of venture capital and medical investment funds.\nIn November 2023, KKR acquired Potter Global Technologies from Gryphon Investors.\nIn January 2023, KKR invested 700 billion won in 2023 after the first purchase of 400 billion won in private equity bonds by Taeyoung Group holding company TY Holdings.\nIn February 2024, KKR acquired the End-User Computing (EUC) division of VMware, which had been acquired by Broadcom, in a deal worth $3.8 billion. The division, renamed Omnissa, includes the VDI product Omnissa Horizon and the device management suite Workspace ONE UEM (formerly AirWatch). In April, KKR acquired Indian company Healthium MedTech in an $839 million deal.\nIn June, KKR retained second spot in Private Equity International's 2024 PEI 300 ranking, behind Blackstone Inc. In the same month, it acquired Superstruct Entertainment, owner of European music festivals including Wacken Open Air (Germany), Boardmasters (UK) and Zwarte Cross (The Netherlands) for approximately €1.3 billion.\nIn July, KKR acquired a majority stake in the US-based solar energy and energy storage developer Avantus. In November, CVC Capital Partners, TF1, RedBird Capital Partners, All3Media, Mediawan and KKR considered bidding for ITV plc and then selling ITV Studios and ITVX.\nAlso in 2024 the Hamburg-based asset manager of renewable energies Encavis AG was acquired (currently up to 91%) by KKR along with Viessmann and ABACON CAPITAL as co-investors.\n\n2025–present\nIn February 2025, a month after acquiring Dawsongroup, British healthcare property developer Assura rejected a $2 billion takeover bid from KKR and Universities Superannuation Scheme. That same month, in addition to purchasing 54% of Healthcare Global Enterprises for $400 million, it acquired Fuji Soft via a tender offer, after a bidding war with Bain Capital.\nIn April, in addition to buying Datagroup for around $500 million,  it agreed to acquire Assura for £1.6 billion in partnership with Stonepeak. In addition, it agreed to purchase for $3.1 billion a joint venture of S&P Global and CME Group called OSTTRA, responsible for providing services across interest rate, foreign exchange, equity and credit markets.\nOn June 3, it backed out of a deal five months after submitting a £4 billion equity bid to acquire a majority stake in Thames Water. In July, when it acquired ProTein, it said it teamed up with T-mobile to buy the fiber internet company Metronet, with the two buyers each paying $4.9 billion.\n\nManagement\nSenior leadership\nChairmen: Henry Kravis and George Roberts (since 1987)\nChief Executives: Scott Nuttall and Joseph Bae (since 2021)\n\nFormer leaders\nJerome Kohlberg Jr. (1976–1987); co-chairmen\nHenry Kravis, George R. Roberts, and Jerome Kohlberg Jr. (1976–1987); co-CEOs\nHenry Kravis and George R. Roberts (1987–2021); co-CEOs\n\nControversies\nInvestments in fossil fuel\nA report by the Private Equity Climate Risks project showed that despite stating that it would be dedicated to pursue a climate action strategy, KKR extensively invested in fossil fuel companies that were both harming local communities and destroying the environment.\n\n2020 Canadian pipeline and railway protests\nIn December 2019, KKR, together with Alberta Investment Management Corporation, acquired a 65% stake in the controversial Coastal GasLink Pipeline project from TC Energy. The pipeline route crosses the territory of the Wetʼsuwetʼen Nation, which opposes the project. Enforcement of an injunction to build through the Wet'suwet'en territory led to the 2020 Canadian pipeline and railway protests.\n\nBoycott of Superstruct Entertainment festivals\nThe company's €1.3 billion purchase of Superstruct Entertainment in June 2024 led to the boycott of Superstruct Entertainment festivals due to the company's investments in Israeli settlements, weapons companies, and the Coastal GasLink pipeline. Superstruct operates music festivals such as Sónar, Field Day, Viña Rock, Resurrection Fest, O Son do Camiño, Monegros Desert Festival, Arenal Sound Festival, Granada Sound, Festival Internacional de Benicàssim and also by event broadcasters like Boiler Room.\nMore than 70 artists of Sónar festival signed an open letter stating \"we oppose any affiliation between the cultural sector and entities complicit in war crimes\". More than 200 performers signed an open letter urging Field Day festival event organizers to cut ties with KKR. Boiler Room also issued a statement following pressure by artists and attendees explaining that they had no say on the acquisition by Superstruct Entertainment and reaffirmed their adherence to the Boycott, Divestment and Sanctions movement until international law and human rights are respected [by Israel].\n\nNotable associates\nJerome Kohlberg, Jr. - After a leave of absence due to illness in 1985, Kohlberg returned to find increasing differences in strategy with his partners, Kravis and Roberts. In 1987, Kohlberg left KKR to found a new private equity firm, Kohlberg & Company, which resumed the investment style that Kohlberg had practiced at Bear Stearns and in KKR's earlier years, acquiring smaller, middle-market companies.\nHenry Kravis\nGeorge R. Roberts\nScott C. Nuttall (born 1972) formerly headed KKR's fastest-growing department, the Global Capital and Asset Management Group. He joined KKR in November 1996 after leaving the Blackstone Group. With the support of co-founder George Roberts, Nuttall spearheaded the campaign to transform KKR from a private equity firm into an investment firm after noting lost opportunities amounting to billions of dollars that the company had had to turn down. He also has served on the board of Fiserv (a financial services firm) since it acquired, for $22 billion, in 2019, the KKR-backed First Data Corp. Nuttall was named co-president and co-COO, with Joseph Bae, on July 17, 2017, responsible for the day-to-day operations of the firm, concentrating on KKR's corporate and real estate credit, capital markets, hedge fund and capital raising businesses together with the firm's corporate development, balance sheet, and strategic growth initiatives. In 2021, he was promoted to co-CEO. He graduated, summa cum laude, from the Wharton School of the University of Pennsylvania with a Bachelor of Science degree.\nJoseph Bae (born 1972) joined KKR from Goldman Sachs in 1996. Most recently, he was the managing partner of KKR Asia and the global head of KKR's Infrastructure and Energy Real Asset businesses. Mr. Bae has been the architect of KKR's Asian expansion since 2005. He has been named co-president and co-chief operating officer with Scott Nuttall on July 17, 2017, to be responsible for the day-to-day operations of the firm. Bae focuses on KKR's global private equity businesses as well as the Firm's real asset platforms across energy, infrastructure, and real estate private equity. In 2021, he was promoted to co-CEO. He graduated with a Bachelor of Arts degree from Harvard College.\nAlex Navab (1965–2019) joined KKR from Goldman Sachs in 1993 and was the former head of Americas Private Equity. After spending 24 years at the firm, he stepped down as part of the Nuttall-Bae transition and would retire. In September 2017, he was elected to Columbia University's board of trustees. He was born in Isfahan, Iran, but followed his family and became a refugee in Greece following the Iranian Revolution. They immigrated to the United States two years later. He received a Bachelor of Arts degree from Columbia College, Columbia University, and an MBA degree from Harvard Business School. In 2016, he was honored with Ellis Island Medal of Honor. He died in July 2019 at age 53.\nSaul A. Fox left KKR in 1997 to found Fox Paine & Company, a middle market private equity firm with over $1.5 billion of capital under management\nClifton S. Robbins left KKR to join competitor General Atlantic Partners in 2000 and later founded Blue Harbour Group,\nEdward A. Gilhuly and Scott Stuart left KKR in 2004 to launch Sageview Capital. Prior to this, Gilhuly was the managing partner of KKR's London-based European operations. Stuart had managed KKR's energy and consumer products industry groups.\nTed Ammon, started several new ventures including Big Flower Press, which printed newspaper circulars, and Chancery Lane Capital, a boutique private equity firm, before being murdered in his Long Island home October 2001. The lover of his estranged, now deceased wife, Generosa Ammon, was later convicted.\nPaul Hazen, served as chairman and CEO of Wells Fargo (1995–2001). Hazen later returned to KKR to serve as chairman of Accel-KKR, a joint venture with Accel Partners, and later as chairman of KKR's publicly listed affiliate, KFN.\nClive Hollick, CEO of United News and Media (1996–2005)\nKen Mehlman joined KKR in 2008 as global head of public affairs.\nDavid Petraeus, selected to serve as chairman of the newly formed KKR Global Institute (2013—present)\nJoseph Grundfest, professor at Stanford Law School and youngest commissioner of the U.S. Securities and Exchange Commission\nMalcolm Turnbull, former Prime Minister of Australia.\n\nPublications about KKR\nReferences\nExternal links\n\nOfficial website\nBusiness data for KKR & Co. Inc.:",
  "clean_text": "KKR & Co. Inc., also known as Kohlberg Kravis Roberts & Co., is an American global private equity and investment company. As of December 31, 2024, the firm had completed 770 private-equity investments with approximately $790 billion of total enterprise value. Its assets under management (AUM) and fee paying assets under management (FPAUM) were $553 billion and $446 billion, respectively. KKR was founded in 1976 by Jerome Kohlberg Jr., and cousins Henry Kravis and George R. Roberts, all of whom had previously worked together at Bear Stearns, where they completed some of the earliest leveraged buyout transactions. Notable transactions by KKR include the 1989 leveraged buyout of RJR Nabisco as well as the 2007 buyout of TXU Energy, both of which, upon completion, were the largest buyouts ever to date. KKR is headquartered at 30 Hudson Yards, Manhattan, New York, with offices in Beijing, Dubai, Dublin, Houston, Hong Kong, London, Luxembourg, Madrid, Menlo Park, Mumbai, Paris, Riyadh, San Francisco, São Paulo, Seoul, Singapore, Shanghai, Sydney and Tokyo. In a 2016 interview with Bloomberg, founder Henry Kravis described KKR in terms of three broad buckets: private markets, public markets, and capital markets. History Founding and early history While running the corporate finance department for Bear Stearns in the 1960s and 1970s, Jerome Kohlberg, Jr., and later Henry Kravis and George R. Roberts, completed a series of what they described as \"bootstrap\" investments. They targeted family-owned businesses, many of which had been founded in the years following World War II, that were facing succession issues. Many of these companies lacked a viable exit for their founders because they were too small to be taken public and the founders were reluctant to sell out to competitors. In 1964, Lewis Cullman made what some people call the first significant leveraged buyout transaction, acquiring and then selling Orkin. In the following years the three Bear Stearns bankers completed a series of buyouts including Stern Metals (1965), Incom (a division of Rockwood International, 1971), Cobblers Industries ($27 million, 1971), and Boren Clay (1973), as well as Thompson Wire, Eagle Motors and Barrows through their investment in Stern Metals. Despite several highly successful investments, Cobblers ended in bankruptcy. By 1976, tensions had built up between Bear Stearns and the three: most notably, executive Cy Lewis had rejected repeated proposals to form a dedicated in-house investment fund. This led them to form their own firm, Kohlberg Kravis Roberts & Co. The name had been planned to be Kohlberg Roberts Kravis, but public relations advisors preferred the sound of KKR. The new KKR completed its first buyout, of manufacturer A.J. Industries, in 1976. KKR raised capital from a small group of investors including the Hillman Company and First Chicago Bank. By 1978, with the revision of the ERISA regulations, KKR was successful in raising its first institutional fund with over $30 million of investor commitments. In 1981, KKR expanded its investor base after the Oregon State Treasury's public pension fund invested in KKR's acquisition of retailer Fred Meyer, Inc. based in Portland. Oregon State remains an active investor in KKR funds. In 1979, KKR completed a risky, precedent-setting $380 million public-to-private leveraged buyout of Houdaille Industries, a well-known producer of machine tools, industrial pipes, chrome-plated car bumpers and torsional viscous dampers. It soon ended in a spectacular failure, breakup of the half-century-old company, and the loss of thousands of jobs, even though creditors earned a profit. The firm's acquisitions during the 1980s buyout boom include: Buyout of RJR Nabisco At age 61, Kohlberg resigned in 1987. He later founded his own private equity firm, Kohlberg & Co.. Henry Kravis succeeded him as senior partner. Under Kravis and Roberts, the firm was responsible for the 1988 leveraged buyout of RJR Nabisco. RJR Nabisco was the largest buyout in history at that time, at $25 billion, and remained the largest for 17 years. The deal was chronicled in Barbarians at the Gate: The Fall of RJR Nabisco, and later made into a television movie starring James Garner. In 1988, F. Ross Johnson was the president and CEO of RJR Nabisco, a leading producer of food and tobacco products, formed in 1985 by the merger of Nabisco Brands and R.J. Reynolds Tobacco Company. In October 1988, Johnson proposed a $17 billion ($75 per share) management buyout of the company with the financial backing of investment bank Shearson Lehman Hutton and its parent company, American Express. Several days later, Kravis, who had originally suggested the buyout to Johnson, presented a new bid for $20.3 billion ($90 per share) financed with Kravis' own aggressive debt package. KKR had the support of equity co-investments from pension funds and other institutional investors, including Coca-Cola, Georgia-Pacific and United Technologies corporate pension funds, as well as endowments from MIT, Harvard and the New York State Common Retirement Fund. However, KKR faced criticism from existing investors over the firm's use of a hostile takeover in the buyout of RJR. KKR proposed to provide a joint offer with Johnson and Shearson Lehman but was rebuffed and Johnson attempted to stonewall KKR's access to financial information from RJR. Rival private equity firm Forstmann Little & Co. was invited into the process by Shearson Lehman, and attempted to provide a bid for RJR with a consortium of Goldman Sachs Capital Partners, Procter & Gamble, Ralston Purina and Castle & Cooke. Ultimately, the Forstmann consortium came apart and did not provide a final bid for RJR. In November 1988, RJR set guidelines for a final bid submission at the end of the month. The management and Shearson group submitted a final bid of $112, a figure they felt certain would enable them to outflank any response by Kravis and KKR. KKR's final bid of $109, while a lower dollar figure, was ultimately accepted by the board of directors of RJR Nabisco. KKR's offer was guaranteed, whereas the management offer lacked a \"reset\", meaning that the final share price might have been lower than their stated $112 per share. Additionally, many in RJR's board of directors were concerned about disclosures of Ross Johnson's unprecedented golden parachute deal. Time magazine featured Johnson on the cover of its December 5, 1988 issue along with the headline, \"A Game of Greed: This man could pocket $100 million from the largest corporate takeover in history. Has the buyout craze gone too far?\". KKR's offer was welcomed by the board, and, to some observers, it appeared that the elevation of the reset issue as a deal-breaker in KKR's favor was little more than an excuse to reject Johnson's higher bid of $112 per share. Johnson received $53 million from the buyout. KKR collected a $75 million fee in the RJR takeover. At $31.1 billion of а transaction value including assumed debt, RJR Nabisco was, at the time, by far the largest leveraged buyout in history. Early 1990s: The aftermath of RJR Nabisco The buyout of RJR Nabisco was completed in April 1989 and KKR spent the early 1990s repaying the debt load through asset sales and restructuring transactions. KKR did not complete a single investment in 1990, the first such year since 1982. KKR began to focus primarily on its existing portfolio companies acquired during the buyout boom of the late 1980s. Six of KKR's portfolio companies completed IPOs in 1991, including RJR Nabisco and Duracell. In January 1990, KKR completed the sale of RJR's Del Monte Foods to a group led by Merrill Lynch. KKR had originally identified a group of divisions that it could sell to reduce debt. KKR contributed $1.7 billion of new equity into RJR in July 1990 to complete a restructuring of the company's balance sheet. KKR's equity contribution as part of the original leveraged buyout of RJR had been only $1.5 billion. In December 1990, RJR announced an exchange offer to swap debt in RJR for a new public stock in the company, effectively an unusual means of an initial public offering and simultaneously reducing debt on the company. RJR issued additional stock to the public in March 1991 to reduce debt further, resulting in an upgrade of the credit rating of RJR's debt from junk to investment grade. KKR began to reduce its ownership in RJR in 1994, when its stock in RJR was used as part of the consideration for its leveraged buyout of Borden, a producer of food and beverage products, consumer products, and industrial products. In 1995, KKR divested itself of its final stake in RJR Nabisco when Borden sold a $638 million block of stock. While KKR no longer had any ownership of RJR Nabisco by 1995, its original investment was not be fully realized until KKR exited its last investment in 2004. After sixteen years of efforts, including contributing new equity, an IPO, asset sales, and exchanging shares of RJR for the ownership of Borden, KKR finally sold the last remnants of its 1989 investment. In July 2004, KKR agreed to sell its stock in Borden Chemical to Apollo Management for $1.2 billion. Early 1990s: Investments In the early 1990s, the absence of an active high yield market prompted KKR to change its tactics, avoiding large leveraged buyouts in favor of industry consolidations through what was described as leveraged buildups or rollups. One of KKR's largest investments in the 1990s was the leveraged buildup of Primedia (now Rent Group) in partnership with former executives of Macmillan Publishing, which KKR had failed to acquire in 1988. KKR created K-III Communications (now Rent Group), a platform to buy media properties, initially completing the $310 million divisional buyout of the book club division of Macmillan along with the assets of Intertec Publishing Corporation in May 1989. During the early 1990s, K-III continued acquiring publishing assets, including a $650 million acquisition from News Corporation in 1991. K-III went public, however instead of cashing out, KKR continued to make new investments in the company in 1998, 2000 and 2001 to support acquisition activity. In 2005, Primedia redeemed KKR's preferred stock in the company but KKR was estimated to have lost hundreds of millions of dollars on its common stock holdings as the price of the company's stock collapsed. In 1991, KKR partnered with Fleet/Norstar Financial Group in the 1991 acquisition of the Bank of New England, from the Federal Deposit Insurance Corporation. In January 1996, KKR exchanged its investment for a 7.5% interest in Fleet Bank. In 1992, KKR completed the buyout of American Re Corporation from Aetna as well as a 47% interest in TW Corporation, later known as The Flagstar Companies and owner of Denny's. Among the other notable investments KKR completed in the early 1990s included World Color Press (1993–95), RELTEC Corporation (1995) and Bruno's (1995). 1996–1999 By the mid-1990s, the debt markets were improving and KKR had moved on from the RJR Nabisco buyout. In 1996, KKR was able to complete the bulk of fundraising for what was then a record $6 billion private equity fund, the KKR 1996 Fund. However, KKR was still burdened by the performance of the RJR investment and repeated obituaries in the media. KKR was required by its investors to reduce the fees it charged and to calculate its carried interest based on the total profit of the fund (i.e., offsetting losses from failed deals against the profits from successful deals). KKR acquired Spalding Holdings Corporation and Evenflo in August 1996, Newsquest in January 1996, KinderCare Learning Centers in October 1996, Amphenol Corporation in January 1997, Randalls Food Markets in June 1997, MedCath Corporation in March 1998, The Boyds Collection in April 1998, Willis Group Holdings in July 1998, and Wincor Nixdorf in October 1999. KKR's largest investment of the 1990s was one of its least successful. In January 1998, KKR and Hicks, Muse, Tate & Furst agreed to the $1.5 billion buyouts of Regal Entertainment Group. KKR and Hicks Muse had initially intended to combine Regal with Act III Cinemas, which KKR had acquired in 1997 for $706 million and United Artists Theaters, which Hicks Muse had agreed to acquire for $840 million in November 1997. Shortly after agreeing to the Regal takeover, the deal with United Artists fell apart and the company was not able to scale up. In 2000, Regal encountered significant financial issues and filed bankruptcy protection and was acquired by Philip Anschutz. 2000–2005 Losses on such investments as Regal Entertainment Group, Spalding, Flagstar and K-III Communications (now Rent Group) were offset by successes in Willis Group, Wise Foods, Inc., Wincor Nixdorf and MTU Aero Engines, among others. The end of dot-com bubble affected buyout deals. In November 1999, KKR acquired Shoppers Drug Mart. KKR was able to realize its investment in Shoppers Drug Mart through a 2002 IPO and subsequent public stock offerings. In November 2002, KKR acquired Bell Canada Yellow Pages. In May 2004, directories business was sold in an initial public offering as Yellow Pages Income Fund, a Canadian income trust. In 2004, in a club deal and one of the largest buyouts in years, KKR, Bain Capital and Vornado Realty Trust acquired Toys \"R\" Us for $6.6 billion after outbidding Cerberus Capital Management, which offered $5.5 billion. In 2005, KKR partnered with Silver Lake Partners, Bain Capital, Goldman Sachs Capital Partners, Blackstone Group, Providence Equity Partners, and TPG Capital to acquire SunGard for $11.3 billion. This represented the largest leveraged buyout completed since the takeover of RJR Nabisco in 1988. SunGard was the largest buyout of a technology company until the buyout of Freescale Semiconductor by affiliates of The Blackstone Group. The SunGard transaction was notable given the number of firms involved in the transaction, the largest club deal completed to that point. The involvement of seven firms in the consortium was criticized by investors in private equity who considered cross-holdings among firms to be generally unattractive. Buyout boom (2006–2007) In 2006, KKR raised $17.6 billion for the KKR 2006 Fund, with which the firm began executing a series of some of the largest buyouts in history. KKR's $44 billion takeover of Texas-based power utility TXU Energy in 2007 was the largest leveraged buyout of private equity in the 21st century and the largest buyout completed to date. Among the most notable companies acquired by KKR in 2006 and 2007 were the following: KKR acquired a 40% stake in Longview Power Plant in 2006; it filed for bankruptcy protection in 2020. In October 2006, KKR acquired a 50% stake in Tarkett, a France-based distributor of flooring products, in a deal valued at about €1.4 billion ($1.8 billion). In November 2006, KKR formed a A$4 billion partnership with the Seven Network of Australia. In January 2007, KKR invested $700 million through a private investment in public equity in Sun Microsystems. In January 2008, KKR made a $1.25 billion private investment in public equity in Legg Mason through a convertible preferred stock offering. On April 26, 2007, Harman International Industries entered an agreement to be acquired by KKR and Goldman Sachs for $8 billion. However, in September 2007, the agreement was terminated after a drop in earnings at Harmon during the Great Recession. Initial public offering (2007) In 2007, KKR filed with the Securities and Exchange Commission to raise $1.25 billion by selling an ownership interest in its management company. The filing came less than two weeks after the initial public offering of rival private equity firm Blackstone Inc. KKR had previously listed its KPE vehicle in 2006, but for the first time, KKR offered investors an ownership interest in the private equity firm itself. The onset of the credit crunch and the weak IPO market dampened the prospects of obtaining a valuation attractive to KKR. The flotation was repeatedly postponed and called off by the end of August. In July 2008, KKR announced a reverse takeover of its listed affiliate KKR Private Equity Investors in exchange for a 21% interest in the firm to become a public company. In November 2008, the transaction was delayed until 2009. Shares of KPE had declined significantly in the second half of 2008 due to the 2008 financial crisis. In October 2009, KKR listed shares in KKR & Co. on the Euronext exchange. In March 2010, KKR filed to list its shares on the New York Stock Exchange (NYSE), Trading commenced on July 15, 2010. 2010–2019 In December 2011, Samson Investment Company was acquired by a group of private equity investors led by KKR for approximately $7.2 billion and Samson Resources Corporation was formed. With the severe downturn in oil and natural gas prices, in September 2015, Samson filed Chapter 11 bankruptcy and during its bankruptcy process, sold several large assets. In March 2013, a year after making her first retail real-estate investment in Illinois' Yorktown Center, it sold its 51% stake in BMG Rights Management to Bertelsmann. In January 2014, KKR acquired Sedgwick Claims Management Services Inc for $2.4 billion from two private equity companies - Stone Point, and Hellman & Friedman. In June 2014, KKR acquired a one-third stake in Spanish energy business Acciona Energy, at a cost of €417 million ($567 million). The international renewable energy generation business operates renewable assets, largely wind farms, across 14 countries including the United States, Italy and South Africa. In August, KKR invested $400 million for 18% of Fujian Sunner Development, China's largest chicken farmer, which breeds, processes and supplies frozen and fresh chickens to consumers and corporate clients, such as KFC and McDonald's, across China. In September, the firm invested $90 million in lighting and electrics firm Savant Systems. Also in 2014, KKR acquired commercial landscaping company ValleyCrest from Michael Dell's investment firm MSD Capital, and combined it with landscape company Brickman, which it had owned since 2013, to form BrightView. The following year, in addition to acquiring Exponent's British rail ticket website Trainline, KKR bought a majority stake in Selecta Group, a European vending services operator, from Allianz Capital Partners. In 2016, KKR purchased two Hispanic grocery chains, Northern California Mi Pueblo and Ontario, California–based Cardenas. In February, seven months before acquiring US software company Epicor, KKR invested $75 million in commercial real estate lender A10 Capital. In October, it invested $250 million in OVH to be used for further international expansion; this funding round valued OVH at over $1 billion, making it a unicorn. In December, the firm sold Capsugel for $5.5 billion to the Lonza Group. In March 2017, KKR partnered with a fund linked to Dell to acquire GfK. In August, a month after acquiring WebMD for $2.8 billion KKR acquired PharMerica for $1.4 billion including debt, Pepper Group Limited for $518 million, Covenant Surgical Partners, and Envision Healthcare Corporation's ambulance business (American Medical Response) for $2.4 billion. In September, two months after KKR merged Mi Pueblo and Cardenas Market, Toys \"R\" Us, Inc. filed for Chapter 11 bankruptcy, stating the move would give it flexibility to deal with $5 billion in long-term debt, borrow $2 billion so it would be able to pay suppliers for the upcoming holiday season and invest in improving current operations. During 2017, KKR purchased an 80% stake in Dixon Hospitality Group for A$190 million, renaming it Australian Venue Co. (AVC); it was expanded and then sold for US$900 million in 2023. In July 2018, while acquiringRBMedia, one of the largest independent publishers and distributors of audiobooks and Taipei-based LCY Chemical for NT$47.8 billion ($1.56 billion US), the company sold Gallagher Shopping Park in the West Midlands to Hana Financial Group for £175 million. In February 2019, KKR acquired Brightsprings, and in a 2022 letter from four U.S. senators including Elizabeth Warren and Bernie Sanders, Joseph Bae and Scott Nutall were asked to explain the substandard care since the acquisition. In the same month, it acquired Tele München Gruppe and the German film distributor Universum Film GmbH. In April, three months before buying Corel, it acquired German film production company Wiedemann & Berg Film Production. In August, KKR acquired Arnott's Biscuits, the Australian snack unit of Campbell Soup Company, for $2.2 billion. Also in August, KKR became the biggest shareholder of German media group Axel Springer SE, paying $3.2 billion for a 43.54% stake. Later that month, the firm also acquired a majority stake in Heidelpay from AnaCap Financial Partners for more than €600 million. In December, KKR, together with Alberta Investment Management Corporation, acquired a 65% stake in the controversial Coastal GasLink Pipeline project from TC Energy. 2020–2024 In May 2020, two months after acquiring Viridor for £4.2 billion, the company invested $750 million in cosmetics producer Coty and $1.5 billion in Jio Platforms. In June, it acquired it purchased OverDrive, Inc., a major e-book distributor for libraries that merged with its subsidiary RBMedia. In June, when it led a $48 million funding round for Artlist, a provider of royalty-free music, sound effects and video, KKR acquired Roompot Group, a provider of holiday parks in Europe, from French private equity firm PAI Partners for approximately €1 billion. In August, a group primary represented by private-equity firm Clayton, Dubilier & Rice acquired Epicor for $4.7 billion. In November, two months after investing $755 million in Reliance Industries' retail arm, it partnered with Rakuten to acquire 85% of Seiyu Group, the Japanese nationwide retail chain owned by Walmart. In January 2021, KKR acquired a majority stake in the catalogue of American musician Ryan Tedder, including his band OneRepublic and the songs that he composed for other artists since 2016. In November 2021, in addition to selling Audiobooks.com to streaming company Storytel for $135 million, KKR partnered with Global Infrastructure Partners to acquire CyrusOne for $15 billion. In February 2022, the firm acquired 8.5% of Nexon. In May 2022, after acquiring Mitsubishi UBS Realty, a Japanese real estate asset manager, it led about $200 million investment round in Semperis, a cybersecurity company focused on identity protection. In June, when it sold Cardenas to funds affiliated with Apollo Global Management, the company rose to the top of Private Equity International's PEI 300 ranking for the first time, replacing Blackstone Inc. as the largest private equity firm in the world. KKR slipped back to second place in 2023 and 2024, before regaining top spot in the 2025 list. In July, a month before acquiring Barracuda Networks, the firm purchased a 25% stake in Northumbrian Water Group, a UK water utility company, for approximately £870 million. In October, KKR acquired ISO tank services provider Boasso Global from Apax Partners. In April 2023, it acquired a 30% stake in FGS Global that valued the company at about $1.4 billion. In August, KKR sold its controlling stakes in Australian Venue Co. to PAG for about A$1.4 billion. In October, KKR acquired Simon & Schuster, a Big Five publisher, for $1.6 billion; Simon & Schuster employees received employee stock ownership in the company on completion of the acquisition. In the same month, it secured a minority stake in Catalio Capital Management, a firm specializing in the management of venture capital and medical investment funds. In November 2023, KKR acquired Potter Global Technologies from Gryphon Investors. In January 2023, KKR invested 700 billion won in 2023 after the first purchase of 400 billion won in private equity bonds by Taeyoung Group holding company TY Holdings. In February 2024, KKR acquired the End-User Computing (EUC) division of VMware, which had been acquired by Broadcom, in a deal worth $3.8 billion. The division, renamed Omnissa, includes the VDI product Omnissa Horizon and the device management suite Workspace ONE UEM (formerly AirWatch). In April, KKR acquired Indian company Healthium MedTech in an $839 million deal. In June, KKR retained second spot in Private Equity International's 2024 PEI 300 ranking, behind Blackstone Inc. In the same month, it acquired Superstruct Entertainment, owner of European music festivals including Wacken Open Air (Germany), Boardmasters (UK) and Zwarte Cross (The Netherlands) for approximately €1.3 billion. In July, KKR acquired a majority stake in the US-based solar energy and energy storage developer Avantus. In November, CVC Capital Partners, TF1, RedBird Capital Partners, All3Media, Mediawan and KKR considered bidding for ITV plc and then selling ITV Studios and ITVX. Also in 2024 the Hamburg-based asset manager of renewable energies Encavis AG was acquired (currently up to 91%) by KKR along with Viessmann and ABACON CAPITAL as co-investors. 2025–present In February 2025, a month after acquiring Dawsongroup, British healthcare property developer Assura rejected a $2 billion takeover bid from KKR and Universities Superannuation Scheme. That same month, in addition to purchasing 54% of Healthcare Global Enterprises for $400 million, it acquired Fuji Soft via a tender offer, after a bidding war with Bain Capital. In April, in addition to buying Datagroup for around $500 million, it agreed to acquire Assura for £1.6 billion in partnership with Stonepeak. In addition, it agreed to purchase for $3.1 billion a joint venture of S&P Global and CME Group called OSTTRA, responsible for providing services across interest rate, foreign exchange, equity and credit markets. On June 3, it backed out of a deal five months after submitting a £4 billion equity bid to acquire a majority stake in Thames Water. In July, when it acquired ProTein, it said it teamed up with T-mobile to buy the fiber internet company Metronet, with the two buyers each paying $4.9 billion. Management Senior leadership Chairmen: Henry Kravis and George Roberts (since 1987) Chief Executives: Scott Nuttall and Joseph Bae (since 2021) Former leaders Jerome Kohlberg Jr. (1976–1987); co-chairmen Henry Kravis, George R. Roberts, and Jerome Kohlberg Jr. (1976–1987); co-CEOs Henry Kravis and George R. Roberts (1987–2021); co-CEOs Controversies Investments in fossil fuel A report by the Private Equity Climate Risks project showed that despite stating that it would be dedicated to pursue a climate action strategy, KKR extensively invested in fossil fuel companies that were both harming local communities and destroying the environment. 2020 Canadian pipeline and railway protests In December 2019, KKR, together with Alberta Investment Management Corporation, acquired a 65% stake in the controversial Coastal GasLink Pipeline project from TC Energy. The pipeline route crosses the territory of the Wetʼsuwetʼen Nation, which opposes the project. Enforcement of an injunction to build through the Wet'suwet'en territory led to the 2020 Canadian pipeline and railway protests. Boycott of Superstruct Entertainment festivals The company's €1.3 billion purchase of Superstruct Entertainment in June 2024 led to the boycott of Superstruct Entertainment festivals due to the company's investments in Israeli settlements, weapons companies, and the Coastal GasLink pipeline. Superstruct operates music festivals such as Sónar, Field Day, Viña Rock, Resurrection Fest, O Son do Camiño, Monegros Desert Festival, Arenal Sound Festival, Granada Sound, Festival Internacional de Benicàssim and also by event broadcasters like Boiler Room. More than 70 artists of Sónar festival signed an open letter stating \"we oppose any affiliation between the cultural sector and entities complicit in war crimes\". More than 200 performers signed an open letter urging Field Day festival event organizers to cut ties with KKR. Boiler Room also issued a statement following pressure by artists and attendees explaining that they had no say on the acquisition by Superstruct Entertainment and reaffirmed their adherence to the Boycott, Divestment and Sanctions movement until international law and human rights are respected [by Israel]. Notable associates Jerome Kohlberg, Jr. - After a leave of absence due to illness in 1985, Kohlberg returned to find increasing differences in strategy with his partners, Kravis and Roberts. In 1987, Kohlberg left KKR to found a new private equity firm, Kohlberg & Company, which resumed the investment style that Kohlberg had practiced at Bear Stearns and in KKR's earlier years, acquiring smaller, middle-market companies. Henry Kravis George R. Roberts Scott C. Nuttall (born 1972) formerly headed KKR's fastest-growing department, the Global Capital and Asset Management Group. He joined KKR in November 1996 after leaving the Blackstone Group. With the support of co-founder George Roberts, Nuttall spearheaded the campaign to transform KKR from a private equity firm into an investment firm after noting lost opportunities amounting to billions of dollars that the company had had to turn down. He also has served on the board of Fiserv (a financial services firm) since it acquired, for $22 billion, in 2019, the KKR-backed First Data Corp. Nuttall was named co-president and co-COO, with Joseph Bae, on July 17, 2017, responsible for the day-to-day operations of the firm, concentrating on KKR's corporate and real estate credit, capital markets, hedge fund and capital raising businesses together with the firm's corporate development, balance sheet, and strategic growth initiatives. In 2021, he was promoted to co-CEO. He graduated, summa cum laude, from the Wharton School of the University of Pennsylvania with a Bachelor of Science degree. Joseph Bae (born 1972) joined KKR from Goldman Sachs in 1996. Most recently, he was the managing partner of KKR Asia and the global head of KKR's Infrastructure and Energy Real Asset businesses. Mr. Bae has been the architect of KKR's Asian expansion since 2005. He has been named co-president and co-chief operating officer with Scott Nuttall on July 17, 2017, to be responsible for the day-to-day operations of the firm. Bae focuses on KKR's global private equity businesses as well as the Firm's real asset platforms across energy, infrastructure, and real estate private equity. In 2021, he was promoted to co-CEO. He graduated with a Bachelor of Arts degree from Harvard College. Alex Navab (1965–2019) joined KKR from Goldman Sachs in 1993 and was the former head of Americas Private Equity. After spending 24 years at the firm, he stepped down as part of the Nuttall-Bae transition and would retire. In September 2017, he was elected to Columbia University's board of trustees. He was born in Isfahan, Iran, but followed his family and became a refugee in Greece following the Iranian Revolution. They immigrated to the United States two years later. He received a Bachelor of Arts degree from Columbia College, Columbia University, and an MBA degree from Harvard Business School. In 2016, he was honored with Ellis Island Medal of Honor. He died in July 2019 at age 53. Saul A. Fox left KKR in 1997 to found Fox Paine & Company, a middle market private equity firm with over $1.5 billion of capital under management Clifton S. Robbins left KKR to join competitor General Atlantic Partners in 2000 and later founded Blue Harbour Group, Edward A. Gilhuly and Scott Stuart left KKR in 2004 to launch Sageview Capital. Prior to this, Gilhuly was the managing partner of KKR's London-based European operations. Stuart had managed KKR's energy and consumer products industry groups. Ted Ammon, started several new ventures including Big Flower Press, which printed newspaper circulars, and Chancery Lane Capital, a boutique private equity firm, before being murdered in his Long Island home October 2001. The lover of his estranged, now deceased wife, Generosa Ammon, was later convicted. Paul Hazen, served as chairman and CEO of Wells Fargo (1995–2001). Hazen later returned to KKR to serve as chairman of Accel-KKR, a joint venture with Accel Partners, and later as chairman of KKR's publicly listed affiliate, KFN. Clive Hollick, CEO of United News and Media (1996–2005) Ken Mehlman joined KKR in 2008 as global head of public affairs. David Petraeus, selected to serve as chairman of the newly formed KKR Global Institute (2013—present) Joseph Grundfest, professor at Stanford Law School and youngest commissioner of the U.S. Securities and Exchange Commission Malcolm Turnbull, former Prime Minister of Australia. Publications about KKR"
}