{
  "ticker": "KLAC",
  "cik": "0000319201",
  "company_name": "KLA Corporation",
  "corrected_name": "KLA Corporation",
  "wiki_title_used": "KLA Corporation",
  "exists": true,
  "raw_text": "KLA Corporation is an American company based in Milpitas, California that makes wafer fab equipment. It supplies process control and yield management systems for the semiconductor industry and other related nanoelectronics industries. The company's products and services are intended for all phases of wafer, reticle, integrated circuit (IC) and packaging production, from research and development to final volume manufacturing.\n\nHistory\nKLA Corporation was formed in 1997 as KLA-Tencor through the merger of KLA Instruments and Tencor Instruments, two companies in the semiconductor equipment and yield management systems industry. The merger was intended to create a single source for chip process and diagnostics equipment. KLA Instruments was founded in 1975 by Ken Levy and Bob Anderson, and focused on photomask detection to identify chip defects. KLA later broadened its product line to include wafer inspection, wafer metrology and integrated inspection and analysis software. Tencor was founded in 1976 by Czechoslovak scientist and US immigrant Karel Urbanek, along with colleague John Schwabacher. The company initially focused on making precise measurements of semiconductor film layer thickness, and in 1984, developed laser-scanning technology to detect particle and other contamination. The company also developed defect review and data analysis equipment. At the time of the merger, the companies' combined annual revenue was greater than $1 billion.\nIn February 1998, KLA-Tencor acquired Freiburg, Germany-based Nanopro GmbH, a company that used advanced interferometric technology for wafer shape and thickness measurements. In April, the company acquired Amray, Inc., a Bedford, Massachusetts-based provider of scanning electron microscope (SEM) systems for applications including semiconductor manufacturing. In June, the company acquired San Jose, CA-based VARS, a developer of image archiving and retrieval systems. In November, KLA-Tencor acquired the Quantox line of oxide monitoring products from Solon, Ohio-based measurement and instrument company Keithley Instruments.  In December, the company acquired the Ultrapointe subsidiary of Uniphase Corporation.\nIn December 1999, the company acquired Taiwan-based yield analysis software maker ACME Systems.\nIn February 2000, KLA-Tencor acquired Austin, Texas-based Finle Technologies, Inc., a developer of lithography modeling and analysis software. In March, the company acquired Austin, Texas-based advanced process control (APC) software developer Fab Solutions, from parent ObjectSpace.\nIn 2001, the company acquired yield management and process control company Phase Metrics, Inc.\nIn 2004, KLA-Tencor acquired surface inspection system manufacturer Candela Instruments, Inc. and the Wafer Inspection Systems business of Inspex, Inc.\nIn 2006, the company acquired ADE Corporation, a supplier of silicon wafer metrology and related gear.\nIn 2007, KLA-Tencor acquired lithography and plasma etch products manufacturer OnWafer Technologies, temperature monitoring firm SensArray Corporation and process control and metrology company Therma-Wave Corporation.\nIn 2008, the company acquired test and measurement company ICOS Vision Systems Corporation NV, and the Microelectronic Inspection Equipment (MIE) business unit of Vistec Semiconductor Systems, Inc.\nIn 2010, KLA-Tencor acquired technology hardware company Ambios Technology, Inc.\nIn 2014, the company acquired computational lithography and inspection company Luminescent Technologies, Inc.\nIn 2017, the company acquired optical profiling and inspection company Zeta Technologies Co. Ltd.\nIn 2018, KLA-Tencor acquired the Nano Indenter product line from Keysight Technologies. The company also acquired  Nanomechanics Inc. and MicroVision.\nIn March 2018, KLA-Tencor announced an agreement to acquire Yavne, Israel-based automated optical inspection equipment vendor Orbotech for approximately $3.4 billion. Orbotech also owned Newport, Wales, UK-based SPTS Technologies Ltd, a manufacturer of etch, PVD and CVD wafer processing equipment for the MEMS, advanced packaging, LED, high-speed RF, and power management devices.\n\nOn January 10, 2019, KLA-Tencor announced that they were changing their name to KLA Corporation.  In February, the company announced that its acquisition of Orbotech was complete. The company's name change took effect in July 2019. In June, KLA announced plans to open a second US headquarters near Ann Arbor, Michigan. The facility was scheduled to open in summer 2021, with plans to host 500-600 new hires, around 50% of whom were to be engineers. The facility would reportedly have a relationship with the University of Michigan and support automotive industry partnerships.\nIn August 2019, KLA-Tencor acquired the company Qoniac GmbH, a German software company specializing on process control software for the semiconductor industry.\nIn July 2021, the company introduced new inspection products for automotive chips. In November, KLA's new North American headquarters opened near Ann Arbor, Michigan. The facility is 230,000 square feet, and is designed to support 1,000 employees.\n\nIllegal stock options backdating\nIn January 2008, KLA paid $65 million to settle allegations that the company and certain executives had illegally backdated stock option grants. The U.S. Securities and Exchange Commission stated that \"KLA dramatically overstated its reported financial results, depriving investors of accurate information about the company's compensation costs and financial performance. It is especially troubling for a public company to engage in such misconduct even after being cautioned that these practices were impermissible.\"\n\nKLA Foundation\nKLA Foundation (originally KLA-Tencor Foundation) is the company's philanthropic arm, and was founded in 2000. KLA Foundation supports and benefits the global communities in which KLA employees live, such as donations to the Milpitas school district, the American Red Cross, and Silicon Valley Leadership Group's COVID-19 Aid Coalition.\n\nReferences\nExternal links\nOfficial website \nBusiness data for KLA-Tencor:",
  "clean_text": "KLA Corporation is an American company based in Milpitas, California that makes wafer fab equipment. It supplies process control and yield management systems for the semiconductor industry and other related nanoelectronics industries. The company's products and services are intended for all phases of wafer, reticle, integrated circuit (IC) and packaging production, from research and development to final volume manufacturing. History KLA Corporation was formed in 1997 as KLA-Tencor through the merger of KLA Instruments and Tencor Instruments, two companies in the semiconductor equipment and yield management systems industry. The merger was intended to create a single source for chip process and diagnostics equipment. KLA Instruments was founded in 1975 by Ken Levy and Bob Anderson, and focused on photomask detection to identify chip defects. KLA later broadened its product line to include wafer inspection, wafer metrology and integrated inspection and analysis software. Tencor was founded in 1976 by Czechoslovak scientist and US immigrant Karel Urbanek, along with colleague John Schwabacher. The company initially focused on making precise measurements of semiconductor film layer thickness, and in 1984, developed laser-scanning technology to detect particle and other contamination. The company also developed defect review and data analysis equipment. At the time of the merger, the companies' combined annual revenue was greater than $1 billion. In February 1998, KLA-Tencor acquired Freiburg, Germany-based Nanopro GmbH, a company that used advanced interferometric technology for wafer shape and thickness measurements. In April, the company acquired Amray, Inc., a Bedford, Massachusetts-based provider of scanning electron microscope (SEM) systems for applications including semiconductor manufacturing. In June, the company acquired San Jose, CA-based VARS, a developer of image archiving and retrieval systems. In November, KLA-Tencor acquired the Quantox line of oxide monitoring products from Solon, Ohio-based measurement and instrument company Keithley Instruments. In December, the company acquired the Ultrapointe subsidiary of Uniphase Corporation. In December 1999, the company acquired Taiwan-based yield analysis software maker ACME Systems. In February 2000, KLA-Tencor acquired Austin, Texas-based Finle Technologies, Inc., a developer of lithography modeling and analysis software. In March, the company acquired Austin, Texas-based advanced process control (APC) software developer Fab Solutions, from parent ObjectSpace. In 2001, the company acquired yield management and process control company Phase Metrics, Inc. In 2004, KLA-Tencor acquired surface inspection system manufacturer Candela Instruments, Inc. and the Wafer Inspection Systems business of Inspex, Inc. In 2006, the company acquired ADE Corporation, a supplier of silicon wafer metrology and related gear. In 2007, KLA-Tencor acquired lithography and plasma etch products manufacturer OnWafer Technologies, temperature monitoring firm SensArray Corporation and process control and metrology company Therma-Wave Corporation. In 2008, the company acquired test and measurement company ICOS Vision Systems Corporation NV, and the Microelectronic Inspection Equipment (MIE) business unit of Vistec Semiconductor Systems, Inc. In 2010, KLA-Tencor acquired technology hardware company Ambios Technology, Inc. In 2014, the company acquired computational lithography and inspection company Luminescent Technologies, Inc. In 2017, the company acquired optical profiling and inspection company Zeta Technologies Co. Ltd. In 2018, KLA-Tencor acquired the Nano Indenter product line from Keysight Technologies. The company also acquired Nanomechanics Inc. and MicroVision. In March 2018, KLA-Tencor announced an agreement to acquire Yavne, Israel-based automated optical inspection equipment vendor Orbotech for approximately $3.4 billion. Orbotech also owned Newport, Wales, UK-based SPTS Technologies Ltd, a manufacturer of etch, PVD and CVD wafer processing equipment for the MEMS, advanced packaging, LED, high-speed RF, and power management devices. On January 10, 2019, KLA-Tencor announced that they were changing their name to KLA Corporation. In February, the company announced that its acquisition of Orbotech was complete. The company's name change took effect in July 2019. In June, KLA announced plans to open a second US headquarters near Ann Arbor, Michigan. The facility was scheduled to open in summer 2021, with plans to host 500-600 new hires, around 50% of whom were to be engineers. The facility would reportedly have a relationship with the University of Michigan and support automotive industry partnerships. In August 2019, KLA-Tencor acquired the company Qoniac GmbH, a German software company specializing on process control software for the semiconductor industry. In July 2021, the company introduced new inspection products for automotive chips. In November, KLA's new North American headquarters opened near Ann Arbor, Michigan. The facility is 230,000 square feet, and is designed to support 1,000 employees. Illegal stock options backdating In January 2008, KLA paid $65 million to settle allegations that the company and certain executives had illegally backdated stock option grants. The U.S. Securities and Exchange Commission stated that \"KLA dramatically overstated its reported financial results, depriving investors of accurate information about the company's compensation costs and financial performance. It is especially troubling for a public company to engage in such misconduct even after being cautioned that these practices were impermissible.\" KLA Foundation KLA Foundation (originally KLA-Tencor Foundation) is the company's philanthropic arm, and was founded in 2000. KLA Foundation supports and benefits the global communities in which KLA employees live, such as donations to the Milpitas school district, the American Red Cross, and Silicon Valley Leadership Group's COVID-19 Aid Coalition."
}