{
  "ticker": "KMI",
  "cik": "0001506307",
  "company_name": "Kinder Morgan",
  "corrected_name": "Kinder Morgan",
  "wiki_title_used": "Kinder Morgan",
  "exists": true,
  "raw_text": "Kinder Morgan, Inc. is one of the largest energy infrastructure companies in North America.  The company specializes in owning and controlling oil and gas pipelines and terminals.\nKinder Morgan owns an interest in or operates approximately 83,000 miles (134,000 km) of pipelines and 143 terminals. The company's pipelines transport natural gas, liquefied natural gas, ethanol, biodiesel, hydrogen, refined petroleum products, crude oil, carbon dioxide, and more. Kinder Morgan also stores or handles a variety of products and materials at their terminals such as gasoline, jet fuel, ethanol, coal, petroleum coke, and steel.\nThe company has approximately 72,000 miles (116,000 km) of natural gas pipelines and is the largest natural gas pipeline operator in the United States, moving about 40 percent of the natural gas consumed in the country. The company previously had built a major presence in Canada with the Trans Mountain pipeline, but that infrastructure is now publicly owned and operated. The company's CO2 division traditionally provides carbon dioxide (CO2) for enhanced oil recovery projects in North America, but also increasingly for carbon sequestration efforts.\n\nHistory\nBeginnings\nKinder Morgan Energy Partners (KMP) was founded in 1997 when a group of investors acquired the general partner of a small, publicly traded pipeline limited partnership (Enron Liquids Pipeline, L.P.) later renamed Kinder Morgan Energy Partners, L.P. Its cofounder Rich Kinder had been the president of Enron. After Kinder was denied an expected promotion to replace Kenneth Lay as chief executive officer, he departed the company, purchasing its interest in ELP for $40 million. Later that year, Kinder Morgan Energy Partners acquired Santa Fe Pacific Pipeline Partners.\nIn 1999, Kinder Morgan conducted a reverse merger with KN Energy, a utility and pipeline company. Natural Gas Pipeline Company of America (NGPL), which serves the Chicago market, was acquired through this deal. KN Energy became Kinder Morgan's second publicly traded company, Kinder Morgan, Inc. (KMI).\nIn 2001, Kinder Morgan's third publicly traded company, Kinder Morgan Management, LLC (KMR) was formed to facilitate institutional ownership of KMP equity.\n\nLeveraged buyout\nOn August 28, 2006, Kinder Morgan announced that it would be taken private in a management-led leveraged buyout totaling approximately $22 billion. Outside participants in the transaction include Fayez Sarofim, Goldman Sachs Capital Partners and Highstar Capital (then owned by AIG). In 2007, Kinder Morgan sold KN Energy to General Electric Co. and Alinda Capital Partners, which renamed the company SourceGas.\nKMI began trading again on the NYSE on February 11, 2011, following the largest private-equity backed IPO offering in US history.\n\nSubsequent events\nIn October 2011, Kinder Morgan Inc. agreed to buy El Paso Corp. for $21.1 billion and gave the combined company 67,000 miles (108,000 km) of gas lines, eclipsing Enterprise Products Partners LP as the biggest US pipeline operator. The transaction was paid for with shares of Kinder Morgan, Kinder Morgan warrants, and a cash portion of $11.5 billion through Barclays borrowing.\nOn August 10, 2014, Kinder announced it was moving to full ownership of its partially owned subsidiaries Kinder Morgan Energy Partners, Kinder Morgan Management, and El Paso Pipeline Partners in a deal worth $71 billion. The transaction closed on November 26, 2014. Prior to November 26, 2014, the Kinder Morgan group publicly traded companies included Kinder Morgan, Inc. (NYSE: KMI), Kinder Morgan Energy Partners, L.P. (NYSE: KMP), Kinder Morgan Management, LLC (NYSE: KMR) and El Paso Pipeline Partners, L.P. (NYSE: EPB); a merger transaction combined all under Kinder Morgan, Inc. (NYSE: KMI), on November 26, 2014.\n\nAmerican Petroleum Tankers\nOn December 23, 2013, Kinder Morgan announced that, through its Kinder Morgan Energy partner subsidiary, it would acquire the US oil tanker operator American Petroleum Tankers and its affiliated company SCT (State Class Tankers) from the US private equity investment firms Blackstone Group and Cerberus Capital Management. APT operates a fleet of five US-flagged MR 50,000 tons—330,000 barrels—oil tankers and has four other similar tankers on order from the General Dynamics shipbuilding company NASSCO in California. This acquisition appears to be the first case whereby a pipeline operator will also be able to offer marine transportation.\nThis acquisition would facilitate the export of US natural resources to overseas markets, and Kinder Morgan had lined up several LNG export customers by July 2014.\n\nWinter Storm Uri\nDuring the 2021 Texas power crisis, Kinder Morgan posted a nearly $1 billion one-time net profit after the company voluntarily cut back on its own power (saving $116 million) and sold natural gas to electric utility companies at high prevailing prices (gaining $880 million). An analyst at Mizuho Securities said Kinder Morgan \"was not really on anyone’s list of potential winners from Winter Storm Uri. Shame on us [for not seeing it].\" Most of the extra gas Kinder Morgan sold went to electric utility companies whose usual non-Kinder suppliers had shut down or blacked out as the catastrophe intensified. Possible long-term ramifications of the storm may be that utilities pay more to guarantee uninterrupted gas deliveries from Kinder Morgan instead.\n\nCompanies\nPlantation Pipeline (2000) (with ExxonMobil)\nCalnev Pipeline (2001) (liquids) \nCentral Florida Pipeline (2001) (liquids) \nMidcontinent Express Pipeline (KM owned 50% by 2007) (gas transmission)\nFayetteville Express Pipeline LLC (co-owned with Energy Transfer Partners 2008) (gas transmission)\nKinder Morgan Altamont LLC (GG)\nKinder Morgan Cochin LLC (liquids)\nKinder Morgan CO2 Company, Houston, Texas\nKinder Morgan, Inc., Houston, Texas\nNatural Gas Pipeline Company of America (co-owned with Brookfield Infrastructure Partners L.P.) (gas transmission)\nKinder Morgan Terminals, Houston, Texas (liquids)\nKinder Morgan Terminals, Houston, Texas (Bulk)\nKinder Morgan Louisiana Pipeline LLC (KMLP), Crowley, Louisiana (gas transmission)\nKinder Morgan North Texas Pipeline (gas transmission)\nKinder Morgan Wink Pipeline (liquids)\nEl Paso Corporation was purchased in 2012 with subsidiaries:\n\nTennessee Gas Pipeline (gas transmission) (2012)\nSouthern Natural Gas Company (gas transmission) (2012)\nColorado Interstate Gas Co (liquids and gas transmission) (2012)\nRuby Pipeline (2012)\nWyoming Interstate Co (2012)\nEl Paso Natural Gas Co (gas transmission) (2012)\nMojave Pipeline Co (gas transmission) (2012)\nFlorida Gas Transmission Company, LLC (50% by 2014) (gas transmission)\n\nPipelines\nKinder Morgan owns or operates approximately 83,000 miles (134,000 km) of pipelines transporting primarily natural gas, crude oil, and petroleum products.\nIn Canada, Kinder Morgan operated (before being bought out by Canada's government) the Trans Mountain oil pipeline which links Alberta with Vancouver, British Columbia, as well as the Cochin pipeline between Western Canada and the American Midwest.\n\nTrans Mountain Pipeline\nIn 2013, Kinder Morgan filed its application to the Canadian National Energy Board (NEB) for building a second pipeline roughly parallel to the existing Trans Mountain, for transporting diluted bitumen between Edmonton, Alberta, and Burnaby, British Columbia. The new pipeline would nearly triple the transportation capacity from 300,000 to 850,000 barrels per day, for an estimated investment of $6.8 billion. This expansion would enable the export of larger volumes of Alberta's bituminous sands oil to the U.S. and to Asian countries.\nThe expansion project had support from the energy industry but opposition from First Nations among environmentalists and others. Protests started in 2014 and were continuing in the spring of 2018. The Liberal Party of Canada controlled Canadian government then purchased TransMountain from Kinder Morgan for C$4.5 billion to make it a government-run public works project in an effort to save the pipeline from environmental and political opposition.\n\nNortheast Energy Direct Pipeline\nThis high-pressure 30-inch (762 mm) gas transmission pipeline, proposed in 2014, was slated to pass from Wright, New York to Dracut, Massachusetts, to help alleviate New England’s high natural gas and electricity costs caused, in their estimation, by severely limited natural gas transportation capacity currently serving that region. But in 2016, Kinder Morgan suspended its effort to build the 412-mile (663 km) NED pipeline, citing economic difficulties and lack of distribution commitments for the gas.\n\nPalmetto Pipeline\nLikewise, Kinder Morgan's proposed Palmetto Pipeline, designed to go from the Gulf Coast to the Southeast markets, was nixed. Its path would have taken it through 201 miles (323 km) of eastern and coastal Georgia, and drew opposition from local residents and environmental groups. The company suspended work on the project after the Georgia General Assembly passed a temporary moratorium on the use of eminent domain for pipeline construction, and commissioned a study to review the project. The company filed an appeal.\n\nConnecticut Expansion Project\nKinder Morgan proposed a 13 miles (21 km) long 36-inch (914 mm) diameter high-pressure natural gas storage loop which would include a 4 miles (6.4 km) pipeline spur through Sandisfield, Massachusetts, crossing the Otis State Forest and using water from Spectacle Pond. The company invoked the U.S. Natural Gas Act to have the needed land condemned so they could seize it by eminent domain.  However, the Commonwealth of Massachusetts challenged Kinder Morgan in court, arguing that the state constitution's Article 97, which protects designated conservation land, forbids construction of a pipeline through protected lands.\n\nPermian Highway Pipeline\nIn late summer 2019, Kinder Morgan, EagleClaw Midstream and Altus Midstream Processing launched construction on the Permian Highway Pipeline, a 430-mile pipeline that will carry up to 2.1 billion cubic feet of natural gas from the Waha Hub in Pecos County, Texas, to the Gulf Coast. The pipeline would create 2,500 construction jobs and 18 permanent jobs, raise $42 million in additional yearly tax revenues for state and local authorities, and was planned to enter operation in 2021.\n\nControversies\nSafety violations\nIn 2009, the Pipeline and Hazardous Materials Safety Administration (PHMSA) cited Kinder Morgan for violating safety standards regarding the distance between a natural gas pipeline and a \"high consequence area\" such as a school or hospital; the pipeline was too close for safe operation in case of a leak.\nIn 2011, PHMSA cited Kinder Morgan for failing to maintain update maps showing pipeline locations, test pipeline safety devices, maintain firefighting equipment, inspect its pipelines as required, and adequately monitor pipes’ corrosion levels. Also in 2011, the U.S. Department of Transportation cited Kinder Morgan for violations including the company's failure to have and follow written startup and shutdown procedures, and failing to have or use other measures to detect abnormal operating conditions, and proposed a fine of $425,000.\nThe 2013 Wall Street Journal article \"Is Kinder Morgan Scrimping on its Pipelines?\" noted that one investment analyst claimed the company was deferring maintenance spending in order to return more cash to its investors.\nPHMSA's incident reports for Kinder Morgan's onshore gas transmission pipelines show that faulty infrastructure causes 45% of the significant leaks. Failure of the pipe, cracked welds, and faulty pipeline equipment together account for 28% of pipeline leaks, and corrosion of the pipe causes 17%.\n\nAccidents\nIn Texas from 2003 to 2016, Kinder Morgan experienced at least 48 \"significant incidents\" resulting in fatalities or hospitalization, fires, explosions, or spills. Throughout the U.S. from 2003 to 2016, Kinder Morgan and its subsidiaries' pipelines (of all kinds) were responsible for more than 400 incidents in 24 states, incurring more than 110 federal enforcement actions.  Kinder Morgan's natural gas transmission pipeline accidents caused $224 million in property damage.\nIn July 2007, a Kinder Morgan pipeline got ripped open by an excavator, spilling more than 250,000 liters of oil into a Burnaby neighborhood and 70,000 liters into nearby Burrard Inlet. The crude oil utterly carpeted cars, houses, roads, and lawns. About 250 people had to be evacuated and the spill cost $15 million to clean.\nA pipeline rupture on August 15, 2021, near Coolidge, Arizona left two dead and one severely burned.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Kinder Morgan:",
  "clean_text": "Kinder Morgan, Inc. is one of the largest energy infrastructure companies in North America. The company specializes in owning and controlling oil and gas pipelines and terminals. Kinder Morgan owns an interest in or operates approximately 83,000 miles (134,000 km) of pipelines and 143 terminals. The company's pipelines transport natural gas, liquefied natural gas, ethanol, biodiesel, hydrogen, refined petroleum products, crude oil, carbon dioxide, and more. Kinder Morgan also stores or handles a variety of products and materials at their terminals such as gasoline, jet fuel, ethanol, coal, petroleum coke, and steel. The company has approximately 72,000 miles (116,000 km) of natural gas pipelines and is the largest natural gas pipeline operator in the United States, moving about 40 percent of the natural gas consumed in the country. The company previously had built a major presence in Canada with the Trans Mountain pipeline, but that infrastructure is now publicly owned and operated. The company's CO2 division traditionally provides carbon dioxide (CO2) for enhanced oil recovery projects in North America, but also increasingly for carbon sequestration efforts. History Beginnings Kinder Morgan Energy Partners (KMP) was founded in 1997 when a group of investors acquired the general partner of a small, publicly traded pipeline limited partnership (Enron Liquids Pipeline, L.P.) later renamed Kinder Morgan Energy Partners, L.P. Its cofounder Rich Kinder had been the president of Enron. After Kinder was denied an expected promotion to replace Kenneth Lay as chief executive officer, he departed the company, purchasing its interest in ELP for $40 million. Later that year, Kinder Morgan Energy Partners acquired Santa Fe Pacific Pipeline Partners. In 1999, Kinder Morgan conducted a reverse merger with KN Energy, a utility and pipeline company. Natural Gas Pipeline Company of America (NGPL), which serves the Chicago market, was acquired through this deal. KN Energy became Kinder Morgan's second publicly traded company, Kinder Morgan, Inc. (KMI). In 2001, Kinder Morgan's third publicly traded company, Kinder Morgan Management, LLC (KMR) was formed to facilitate institutional ownership of KMP equity. Leveraged buyout On August 28, 2006, Kinder Morgan announced that it would be taken private in a management-led leveraged buyout totaling approximately $22 billion. Outside participants in the transaction include Fayez Sarofim, Goldman Sachs Capital Partners and Highstar Capital (then owned by AIG). In 2007, Kinder Morgan sold KN Energy to General Electric Co. and Alinda Capital Partners, which renamed the company SourceGas. KMI began trading again on the NYSE on February 11, 2011, following the largest private-equity backed IPO offering in US history. Subsequent events In October 2011, Kinder Morgan Inc. agreed to buy El Paso Corp. for $21.1 billion and gave the combined company 67,000 miles (108,000 km) of gas lines, eclipsing Enterprise Products Partners LP as the biggest US pipeline operator. The transaction was paid for with shares of Kinder Morgan, Kinder Morgan warrants, and a cash portion of $11.5 billion through Barclays borrowing. On August 10, 2014, Kinder announced it was moving to full ownership of its partially owned subsidiaries Kinder Morgan Energy Partners, Kinder Morgan Management, and El Paso Pipeline Partners in a deal worth $71 billion. The transaction closed on November 26, 2014. Prior to November 26, 2014, the Kinder Morgan group publicly traded companies included Kinder Morgan, Inc. (NYSE: KMI), Kinder Morgan Energy Partners, L.P. (NYSE: KMP), Kinder Morgan Management, LLC (NYSE: KMR) and El Paso Pipeline Partners, L.P. (NYSE: EPB); a merger transaction combined all under Kinder Morgan, Inc. (NYSE: KMI), on November 26, 2014. American Petroleum Tankers On December 23, 2013, Kinder Morgan announced that, through its Kinder Morgan Energy partner subsidiary, it would acquire the US oil tanker operator American Petroleum Tankers and its affiliated company SCT (State Class Tankers) from the US private equity investment firms Blackstone Group and Cerberus Capital Management. APT operates a fleet of five US-flagged MR 50,000 tons—330,000 barrels—oil tankers and has four other similar tankers on order from the General Dynamics shipbuilding company NASSCO in California. This acquisition appears to be the first case whereby a pipeline operator will also be able to offer marine transportation. This acquisition would facilitate the export of US natural resources to overseas markets, and Kinder Morgan had lined up several LNG export customers by July 2014. Winter Storm Uri During the 2021 Texas power crisis, Kinder Morgan posted a nearly $1 billion one-time net profit after the company voluntarily cut back on its own power (saving $116 million) and sold natural gas to electric utility companies at high prevailing prices (gaining $880 million). An analyst at Mizuho Securities said Kinder Morgan \"was not really on anyone’s list of potential winners from Winter Storm Uri. Shame on us [for not seeing it].\" Most of the extra gas Kinder Morgan sold went to electric utility companies whose usual non-Kinder suppliers had shut down or blacked out as the catastrophe intensified. Possible long-term ramifications of the storm may be that utilities pay more to guarantee uninterrupted gas deliveries from Kinder Morgan instead. Companies Plantation Pipeline (2000) (with ExxonMobil) Calnev Pipeline (2001) (liquids) Central Florida Pipeline (2001) (liquids) Midcontinent Express Pipeline (KM owned 50% by 2007) (gas transmission) Fayetteville Express Pipeline LLC (co-owned with Energy Transfer Partners 2008) (gas transmission) Kinder Morgan Altamont LLC (GG) Kinder Morgan Cochin LLC (liquids) Kinder Morgan CO2 Company, Houston, Texas Kinder Morgan, Inc., Houston, Texas Natural Gas Pipeline Company of America (co-owned with Brookfield Infrastructure Partners L.P.) (gas transmission) Kinder Morgan Terminals, Houston, Texas (liquids) Kinder Morgan Terminals, Houston, Texas (Bulk) Kinder Morgan Louisiana Pipeline LLC (KMLP), Crowley, Louisiana (gas transmission) Kinder Morgan North Texas Pipeline (gas transmission) Kinder Morgan Wink Pipeline (liquids) El Paso Corporation was purchased in 2012 with subsidiaries: Tennessee Gas Pipeline (gas transmission) (2012) Southern Natural Gas Company (gas transmission) (2012) Colorado Interstate Gas Co (liquids and gas transmission) (2012) Ruby Pipeline (2012) Wyoming Interstate Co (2012) El Paso Natural Gas Co (gas transmission) (2012) Mojave Pipeline Co (gas transmission) (2012) Florida Gas Transmission Company, LLC (50% by 2014) (gas transmission) Pipelines Kinder Morgan owns or operates approximately 83,000 miles (134,000 km) of pipelines transporting primarily natural gas, crude oil, and petroleum products. In Canada, Kinder Morgan operated (before being bought out by Canada's government) the Trans Mountain oil pipeline which links Alberta with Vancouver, British Columbia, as well as the Cochin pipeline between Western Canada and the American Midwest. Trans Mountain Pipeline In 2013, Kinder Morgan filed its application to the Canadian National Energy Board (NEB) for building a second pipeline roughly parallel to the existing Trans Mountain, for transporting diluted bitumen between Edmonton, Alberta, and Burnaby, British Columbia. The new pipeline would nearly triple the transportation capacity from 300,000 to 850,000 barrels per day, for an estimated investment of $6.8 billion. This expansion would enable the export of larger volumes of Alberta's bituminous sands oil to the U.S. and to Asian countries. The expansion project had support from the energy industry but opposition from First Nations among environmentalists and others. Protests started in 2014 and were continuing in the spring of 2018. The Liberal Party of Canada controlled Canadian government then purchased TransMountain from Kinder Morgan for C$4.5 billion to make it a government-run public works project in an effort to save the pipeline from environmental and political opposition. Northeast Energy Direct Pipeline This high-pressure 30-inch (762 mm) gas transmission pipeline, proposed in 2014, was slated to pass from Wright, New York to Dracut, Massachusetts, to help alleviate New England’s high natural gas and electricity costs caused, in their estimation, by severely limited natural gas transportation capacity currently serving that region. But in 2016, Kinder Morgan suspended its effort to build the 412-mile (663 km) NED pipeline, citing economic difficulties and lack of distribution commitments for the gas. Palmetto Pipeline Likewise, Kinder Morgan's proposed Palmetto Pipeline, designed to go from the Gulf Coast to the Southeast markets, was nixed. Its path would have taken it through 201 miles (323 km) of eastern and coastal Georgia, and drew opposition from local residents and environmental groups. The company suspended work on the project after the Georgia General Assembly passed a temporary moratorium on the use of eminent domain for pipeline construction, and commissioned a study to review the project. The company filed an appeal. Connecticut Expansion Project Kinder Morgan proposed a 13 miles (21 km) long 36-inch (914 mm) diameter high-pressure natural gas storage loop which would include a 4 miles (6.4 km) pipeline spur through Sandisfield, Massachusetts, crossing the Otis State Forest and using water from Spectacle Pond. The company invoked the U.S. Natural Gas Act to have the needed land condemned so they could seize it by eminent domain. However, the Commonwealth of Massachusetts challenged Kinder Morgan in court, arguing that the state constitution's Article 97, which protects designated conservation land, forbids construction of a pipeline through protected lands. Permian Highway Pipeline In late summer 2019, Kinder Morgan, EagleClaw Midstream and Altus Midstream Processing launched construction on the Permian Highway Pipeline, a 430-mile pipeline that will carry up to 2.1 billion cubic feet of natural gas from the Waha Hub in Pecos County, Texas, to the Gulf Coast. The pipeline would create 2,500 construction jobs and 18 permanent jobs, raise $42 million in additional yearly tax revenues for state and local authorities, and was planned to enter operation in 2021. Controversies Safety violations In 2009, the Pipeline and Hazardous Materials Safety Administration (PHMSA) cited Kinder Morgan for violating safety standards regarding the distance between a natural gas pipeline and a \"high consequence area\" such as a school or hospital; the pipeline was too close for safe operation in case of a leak. In 2011, PHMSA cited Kinder Morgan for failing to maintain update maps showing pipeline locations, test pipeline safety devices, maintain firefighting equipment, inspect its pipelines as required, and adequately monitor pipes’ corrosion levels. Also in 2011, the U.S. Department of Transportation cited Kinder Morgan for violations including the company's failure to have and follow written startup and shutdown procedures, and failing to have or use other measures to detect abnormal operating conditions, and proposed a fine of $425,000. The 2013 Wall Street Journal article \"Is Kinder Morgan Scrimping on its Pipelines?\" noted that one investment analyst claimed the company was deferring maintenance spending in order to return more cash to its investors. PHMSA's incident reports for Kinder Morgan's onshore gas transmission pipelines show that faulty infrastructure causes 45% of the significant leaks. Failure of the pipe, cracked welds, and faulty pipeline equipment together account for 28% of pipeline leaks, and corrosion of the pipe causes 17%. Accidents In Texas from 2003 to 2016, Kinder Morgan experienced at least 48 \"significant incidents\" resulting in fatalities or hospitalization, fires, explosions, or spills. Throughout the U.S. from 2003 to 2016, Kinder Morgan and its subsidiaries' pipelines (of all kinds) were responsible for more than 400 incidents in 24 states, incurring more than 110 federal enforcement actions. Kinder Morgan's natural gas transmission pipeline accidents caused $224 million in property damage. In July 2007, a Kinder Morgan pipeline got ripped open by an excavator, spilling more than 250,000 liters of oil into a Burnaby neighborhood and 70,000 liters into nearby Burrard Inlet. The crude oil utterly carpeted cars, houses, roads, and lawns. About 250 people had to be evacuated and the spill cost $15 million to clean. A pipeline rupture on August 15, 2021, near Coolidge, Arizona left two dead and one severely burned."
}