{
  "ticker": "KO",
  "cik": "0000021344",
  "company_name": "Coca-Cola Company (The)",
  "corrected_name": "The Coca-Cola Company",
  "wiki_title_used": "The Coca-Cola Company",
  "exists": true,
  "raw_text": "The Coca-Cola Company is an American multinational corporation founded in 1892 headquartered in Atlanta, Georgia. It manufactures, sells and markets soft drinks including Coca-Cola, other non-alcoholic beverage concentrates and syrups, and alcoholic beverages. Its stock is listed on the New York Stock Exchange and is a component of the DJIA and the S&P 500 and S&P 100 indices.\nCoca-Cola was developed in 1886 by pharmacist John Stith Pemberton. At the time it was introduced, the product contained the stimulants cocaine from coca leaves and caffeine from kola nuts which together acted synergistically. The coca and the kola are the source of the product name, and led to Coca-Cola's promotion as a \"healthy tonic\". Pemberton had been severely wounded in the American Civil War, and had become addicted to the pain medication morphine. At the time, cocaine was being promoted as a \"cure\" for opioid addiction, so he developed the beverage as a patent medicine in an effort to control his addiction.\nIn 1889, the formula and brand were sold for $2,300 (equivalent to $73,000 in 2024) to Asa Griggs Candler, who incorporated the Coca-Cola Company in Atlanta in 1892. The company has operated a franchised distribution system since 1889. The company largely produces syrup concentrate, which is then sold to various bottlers throughout the world who hold exclusive territories.\n\nHistory\nIn July 1886, pharmacist John Stith Pemberton from Columbus, Georgia, invented the original Coca-Cola drink, which was advertised as helpful in the relief of headache, to be placed on sale primarily in drugstores as a medicinal beverage. Pemberton had made many mixing experiments and reached his goal during the month of May, but the new product was as yet unnamed and uncarbonated. Pemberton's bookkeeper, Frank Mason Robinson, is credited with naming the product and creating its logo. Robinson chose the name Coca-Cola because of its two main ingredients (coca leaves and kola nuts) and because it is an alliteration. John Pemberton had taken a break and left Robinson to make, promote, and sell Coca-Cola on his own. Robinson promoted the drink with the limited budget that he had, and succeeded.\nAmerican businessman Asa Griggs Candler purchased the Coca-Cola formula and brand, forming the Coca-Cola Company in Atlanta in 1892. By 1895, Coca-Cola was being sold nationwide. In 1919, the company was sold to Ernest Woodruff's Trust Company of Georgia, after which it was soon reincorporated under the Delaware General Corporation Law that same year.\nCoca-Cola's first ad read \"Coca Cola. Delicious! Refreshing! Exhilarating! Invigorating!\" Candler was one of the first businessmen to use merchandising in his advertising strategy. As of 1948, Coca-Cola had claimed about 60% of its market share. By 1984, the Coca-Cola Company's market share decreased to 21.8% due to new competitors.\n\nAcquisitions\nCoca-Cola acquired Minute Maid in 1960 for an undisclosed amount. In 1982, it acquired the movie studio Columbia Pictures for $692 million. Coca-Cola then launched a series of entertainment takeovers, namely Merv Griffin Enterprises and Embassy Communications in the mid-1980s, forming the Entertainment Business Sector, which would later merge with Tri-Star Pictures to start out Columbia Pictures Entertainment, with CPE holding a stake in the company. Coca-Cola sold Columbia to Sony for $3 billion in 1989. In 1986, Coke sold off two assets, namely Presto Products and Winker-Flexible Products to an investment group led by E.O. Gaylord for $38 million.\nThe company acquired the Indian cola brand Thums Up in 1993, and the American soda company Barq's in 1995. In 1999, Coca-Cola purchased 50% of the shares of Inca Kola for $200 million, subsequently taking control of overseas marketing and production for the brand. In 2001, it acquired the Odwalla brand of fruit juices, smoothies, and bars for $181 million. It announced Odwalla's discontinuation in 2020. In 2007, it acquired Fuze Beverage from founder Lance Collins and Castanea Partners for an estimated $250 million.\nThe company's 2009 bid to buy Chinese juice maker Huiyuan Juice Group ended when China rejected its $2.4 billion bid, on the grounds the resulting company would be a virtual monopoly. Nationalism was also thought to be a reason for aborting the deal.\nIn 2011, it acquired the remaining stake in Honest Tea, having bought a 40% stake in 2008 for $43 million. In 2013, it finalized its purchase of ZICO, a coconut water company. In August 2014, it acquired a 16.7% (currently 19.36% due to stock buy backs) stake in Monster Beverage for $2.15 billion with an option to increase it to 25%, as part of a long-term strategic partnership that includes marketing and distribution alliance, and product line swap. In 2015, the company took a minority stake ownership in the cold pressed juice manufacturer, Suja Life LLC. In December 2016, it bought many of the former SABMiller's Coca-Cola operations. The Coca-Cola Company owns a 68.3% stake in Coca-Cola Bottlers Africa. Coca-Cola Bottlers Africa is headquartered in Port Elizabeth, South Africa.\nThe Coca-Cola Company acquired a 40% stake in Nigerian snack and beverage company Chi Limited on January 30, 2016. The Coca-Cola Company acquired the remaining 60% stake in Chi Ltd on January 30, 2019. In 2017, the Coca-Cola Company acquired Mexican sparkling water brand Topo Chico. On August 31, 2018, it agreed to acquire Costa Coffee from Whitbread for £3.9bn. The acquisition closed on January 3, 2019. During August 2018, the Coca-Cola Company acquired Moxie for an undisclosed amount. On August 14, 2018, the Coca-Cola Company announced a minority interest in Bodyarmor. On September 19, 2018, the Coca-Cola Company acquired Organic & Raw Trading Co. Pty Ltd, the manufacturer of Mojo Kombucha in Willunga, Australia. In 2022 Coca-Cola shut down production of Mojo.\n\nRevenue and sales\nAccording to the Coca-Cola Company's 2005 annual report, it had sold beverage products in more than 200 countries that year. The 2005 report further states that of the approximately 50 billion beverage servings of all types consumed worldwide, daily, beverages bearing the trademarks owned by or licensed to Coca-Cola account for more than 1.3 billion. Of these, beverages bearing the trademark \"Coca-Cola\" or \"Coke\" accounted for approximately 55% of the company's total gallon sales.\nIn 2010, it was announced that Coca-Cola had become the first brand to top £1 billion in annual UK grocery sales. In 2017, Coca-Cola sales were down 11% from the year before due to consumer tastes shifting away from sugary drinks.\n\nStock\nSince 1919, Coca-Cola has been a publicly traded company. Its stock is listed on the New York Stock Exchange under the ticker symbol \"KO\". One share of stock purchased in 1919 for $40, with all dividends reinvested, would have been worth $9.8 million in 2012, a 10.7% annual increase adjusted for inflation. A predecessor bank of SunTrust received $100,000 for underwriting Coca-Cola's 1919 public offering; the bank sold that stock for over $2 billion in 2012. In 1987, Coca-Cola once again became one of the 30 stocks which makes up the Dow Jones Industrial Average, which is commonly referenced as a proxy for stock market performance; it had previously been a Dow stock from 1932 to 1935. Coca-Cola has paid a dividend since 1920 and, as of 2019, had increased it each year for 57 years straight.\n\nShareholders\nThe 10 largest shareholder of Coca-Cola in March 2025 were:\n\nStaff and management\nThe following are key management as of March 2023 (excluding VP positions and regional leaders):\n\nThe following are all directors as of July 2025:\n\nBottlers\nIn general, the Coca-Cola Company and its subsidiaries only produce syrup concentrate, as well as sourcing beverage base including coffee beans, tea leaf, juices, etc., which is then sold to various bottlers throughout the world who hold a local Coca-Cola franchise. Coca-Cola bottlers, who hold territorially exclusive contracts with the company, produce the finished product in packages from the concentrate and beverage base, in combination with filtered water and sweeteners. The bottlers then sell, distribute, and merchandise the Coca-Cola product to retail stores, vending machines, restaurants, and food service distributors. Outside the United States, these bottlers also control the fountain business.\nSince the 1980s, the company has actively encouraged the consolidation of bottlers, with the company often owning a share of these \"anchor bottlers\".\nIn January 2006, the company formed the Bottling Investments Group (BIG), by bringing company-owned bottling operations together to strategically invest in select bottling operations, temporarily taking them under Coca-Cola ownership, and utilizing the leadership and resources of the company. Also, the company has accelerated refranchising both company-owned bottlers and independent bottling partners to consolidate their operations and move away from the capital-intensive and low-margin business of bottling, with maintaining minor share ownership of these consolidated bottlers and secure the right to nominate directors and/or executives through shareholders agreement and/or capital and business alliance agreement.\nAs a result of the refranchising and bottler consolidations, multi-national/large-scale bottlers and three U.S.-based bottlers now dominate the manufacturing and distribution of the company's products except the territories managed by BIG bottlers.\nMulti-national/large-scale bottlers\n\nCoca-Cola Europacific Partners PLC: Headquartered in the UK, operates 29 countries in Western Europe, Oceania, Indonesia, and Papua New Guinea. The company owns 19.36%.\nCoca-Cola FEMSA: Headquartered in Mexico, operating in Argentina, Brazil, Costa Rica, Guatemala, Nicaragua, Panama, Colombia, Mexico, Uruguay, and Venezuela. The company owns 27.8%.\nArca Continental: Headquartered in Mexico, operating in Mexico, Ecuador, Peru, Argentina, and the southwestern U.S. (Texas and parts of New Mexico, Oklahoma, and Arkansas). (Independent)\nEmbotelladora Andina (Coca-Cola Andina): Headquartered in Chile, operating in Argentine, Chile, Brazil, and Paraguay. The company owns 14.7% of series A common stock outstanding & 14.7% of series B common stock outstanding.\nCoca-Cola HBC AG: Headquartered in Switzerland, operating 28 countries in Western, Central, and Eastern Europe, Russia, and Nigeria. The company owns 23.2%.\nCoca-Cola Icecek: Headquartered in Turkey, operates in the Middle East and Central Asian Countries (Turkey, Pakistan, Kazakhstan, Iraq, Uzbekistan, Azerbaijan, Jordan, Turkmenistan, Kyrgyzstan, Tajikistan, and Syria). The company owns 20.1%.\nSwire Coca-Cola: Headquartered in Hong Kong, operates in 11 provinces and Shanghai municipality in China, Hong Kong, Macau, Taiwan, Vietnam, Cambodia, and 13 states in the U.S.\nCOFCO Coca-Cola: Operates 19 provinces and municipalities in China, a joint venture between COFCO Corporation and the Coca-Cola Company with 35% ownership.\nCoca-Cola Bottlers Japan Holdings: Headquartered and operates in Japan, covering ~90% of the volume sold in Japan. The company owns 18.88%.\nBottlers headquartered and operated in the U.S.\n\nCoca-Cola Bottling Co. Consolidated, based in Charlotte, North Carolina. 34.8% owned by the Coca-Cola Company and listed on the NASDAQ.\nCoca-Cola Beverages Northeast, based in Bedford, New Hampshire, and owned by Kirin Holdings.\nCoca-Cola Bottling Company United, based in Birmingham, Alabama (independent)\nCoca-Cola Beverages Florida, based in Tampa, Florida, and is a certified Minority owned business.\nCompany-owned bottling operation is now managed under BIG, which covers operations in Bangladesh, Cambodia, India, Malaysia, Myanmar, Nepal, Oman, Philippines, Singapore, and Sri Lanka as well as eastern African operation by Coca-Cola Beverages Africa in Port Elizabeth, South Africa. In 2021, the company announced its intention to list Coca-Cola Beverages Africa as a publicly traded company. However, in June 2022 it announced that it was delaying this plan, pending an evaluation of macroeconomic conditions.\n\nProducts and brands\nAs of 2020, the Coca-Cola Company offers more than 500 brands in over 200 countries. In September 2020, the company announced that it would cut more than half of its brands, as a result of the economic effects caused by the COVID-19 pandemic.\n\nNon-food assets\nColumbia Pictures\nCoca-Cola bought Columbia Pictures in 1982, owing to the low monetary value of the studio. The film company was the first and only studio ever owned by Coca-Cola. During its ownership of the studio, Columbia released many popular films including Ghostbusters, Stripes, The Karate Kid, and some others. However, two years after the critical and commercial failure of the 1987 film Ishtar, Columbia was spun-off and then sold to Tokyo-based Sony in 1989.\n\nWorld of Coca-Cola\nCoca-Cola operates a soft drink themed tourist attraction in Atlanta, Georgia; the World of Coca-Cola is a multi-storied exhibition. It features flavor sampling and a history museum, with locations in Las Vegas, Nevada, and Lake Buena Vista, Florida.\n\nBrands\nOther soft drinks\nThe Coca-Cola Company also produces a number of other soft drinks including Fanta (introduced circa 1941), Sprite and Lilt, which was discontinued after 50 years and renamed Fanta Pineapple & Grapefruit. Fanta's origins date back to World War II during a trade embargo against Germany on cola syrup, making it impossible to sell Coca-Cola in Germany. Max Keith, the head of Coca-Cola's German office during the war, decided to create a new product for the German market, made only from products available in Germany at the time, which they named Fanta. The drink proved to be a hit, and when Coke took over again after the war, it adopted the Fanta brand as well. Fanta was originally an orange-flavored soft drink that can come in plastic bottles or cans. It has become available in many different flavors now such as grape, peach, apple, pineapple, and strawberry.\nIn 1961, Coca-Cola introduced Sprite, a lemon-lime soft drink, another of the company's bestsellers and its response to 7 Up.\nTab was Coca-Cola's first attempt to develop a diet soft drink, using saccharin as a sugar substitute. Introduced in 1963, the product was sold until fall 2020, although its sales had dwindled since the introduction of Diet Coke.\nCoca-Cola South Africa also released Valpre Bottled \"still\" and \"sparkling\" water.\nIn 1969, the company released Simba, which was a take on Mountain Dew, and had packaging that was African desert-themed, replete with an African Lion as the symbol of the brand. The tagline was \"Simba – It Conquers the African Thirst.\"\nAlso in 1969, the company released a line of products under the name of Santiba, which was targeted for mixing cocktails and party usage, products including Quinine water and Ginger Ale. Like the above-mentioned Simba, the Santiba line of products was short-lived in the marketplace.\n\nBreakMate\nNo longer manufactured, the Coca-Cola BreakMate was a three-flavor dispenser introduced by Coca-Cola and Siemens in 1988. Intended for use in offices with five to fifty people, its refrigerated compartment held three individual one-litre plastic containers of soda syrup and a CO2 tank. Like a soda fountain, it mixed syrup in a 1:5 ratio with carbonated water. In North America, Coca-Cola discontinued spare BreakMate parts in 2007 and stopped distributing the syrup in 2010.\n\nHealthy beverages\nDuring the 1990s, the company responded to the growing consumer interest in healthy beverages by introducing several new non-carbonated beverage brands. These included Minute Maid Juices to Go, Powerade sports beverage, flavored tea Nestea (in a joint venture with Nestlé), Fruitopia fruit drink, and Dasani water, among others. In 2001, the Minute Maid division launched the Simply Orange brand of juices including orange juice. In 2016, Coca-Cola India introduced Vio to enter into the value-added dairy category. The product lays the foundation for Coca-Cola's new segment after carbonated beverages, water and juices.\nIn 2004, perhaps in response to the burgeoning popularity of low-carbohydrate diets such as the Atkins diet, Coca-Cola announced its intention to develop and sell a low-carbohydrate alternative to Coke Classic, dubbed C2 Cola. C2 contains a mix of high fructose corn syrup, aspartame, sucralose, and Acesulfame potassium. C2 is designed to more closely emulate the taste of Coca-Cola Classic. Even with less than half of the food energy and carbohydrates of standard soft drinks, C2 is not a replacement for zero-calorie soft drinks such as Diet Coke. C2 went on sale in the U.S. on June 11, 2004, and in Canada in August 2004; it was replaced in 2013 by Coca-Cola Life.\nStarting in 2009, the Coca-Cola Company invested in Innocent Drinks, first with a minor stake, increasing to 90% in the first quarter of 2013.\nIt was in May 2014 when Finley, a sparkling fruit-flavored drink, was launched in France. It was launched in other countries later, including Belgium and Luxembourg in September 2014. Coca-Cola first started developing the drink in Belgium in 2001. As of 2014, the drink is targeted for adults, and is low in sugar with four flavors.\n\nBest selling\nCoca-Cola is the best-selling soft drink in most countries, and was recognized as the number one global brand in 2010. While the Middle East is one of the few regions in the world where Coca-Cola is not the number one soda drink, Coca-Cola nonetheless holds almost 25% market share (to Pepsi's 75%) and had double-digit growth in 2003. Similarly, in Scotland, where the locally produced Irn-Bru was once more popular, 2005 figures show that both Coca-Cola and Diet Coke now outsell Irn-Bru. In Peru, the native Inca Kola has been more popular than Coca-Cola, which prompted Coca-Cola to enter in negotiations with the soft drink's company and buy 50% of its stakes. In Japan, the best selling soft drink is not cola, as (canned) tea and coffee are more popular. As such, the Coca-Cola Company's best selling brand there is not Coca-Cola, but Georgia. In May 2016, the Coca-Cola Company temporarily halted production of its signature drink in Venezuela due to sugar shortages. Since then, the Coca-Cola Company has been using \"minimum inventories of raw material\" to make their signature drinks at two production plants in Venezuela.\n\nInformation\nOn July 6, 2006, a Coca-Cola employee and two other people were arrested and charged with trying to sell trade secret information to the soft drink maker's competitor PepsiCo for $1.5 million. The recipe for Coca-Cola, perhaps the company's most closely guarded secret, was never in jeopardy; instead, the information was related to a new beverage in development. Coca-Cola executives verified that the trade secret documents in question were genuine and proprietary to the company. At least one glass vial containing a sample of a new drink was offered for sale, court documents said. The conspiracy was revealed by PepsiCo, which notified authorities when it was approached by the conspirators.\n\nGreen tea\nThe company announced a new \"negative calorie\" green tea drink, Enviga, in 2006, along with trying coffee retail concepts Far Coast and Chaqwa.\n\nGlaceau\nOn May 25, 2007, Coca-Cola announced it would purchase Glaceau, a maker of flavored vitamin-enhanced drinks (vitamin water), flavored waters, and Burn energy drinks, for $4.1 billion in cash.\n\nHuiyuan Juice\nOn September 3, 2008, Coca-Cola announced its intention to make cash offers to purchase China Huiyuan Juice Group Limited (which had a 42% share of the Chinese pure fruit juice market) for US$2.4bn (HK$12.20 per share). China's ministry of commerce blocked the deal on March 18, 2009, arguing that the deal would hurt small local juice companies, could have pushed up juice market prices, and limited consumers' choices.\n\nCoke Mini can\nIn October 2009, Coca-Cola revealed its new 90-calorie mini can that holds 7.5 fluid ounces. The mini can is often sold in 8 packs. Despite costing nearly 30 percent more per ounce, the mini cans have been met with positive sales figures.\n\nHoliday can\nIn November 2011, Coca-Cola revealed a seasonal design for its regular Coke cans as part of a partnership with the World Wildlife Fund. However, it was withdrawn only a month after release due to consumer complaints about a similar look to the silver cans commonly used for Diet Coke. There were also complaints about deviating from traditional red as the color of Coca-Cola cans previously.\n\nStake in Monster Beverage\nIt was announced on August 14, 2014, that the Coca-Cola Company was making a cash payment of $2.15 billion for a 16.7 percent stake in Monster Beverage Corp to expand its market for energy drinks, with Coke to transfer ownership in Full Throttle and Burn to Monster and Monster to transfer its ownership in Hansen's Natural Sodas, Peace Iced Tea, and Blue Sky Soda to the Coca-Cola Company. Muhtar Kent, Coke's former chief executive officer, stated that the company has the option to increase its stake to 25 percent but could not exceed that percentage in the next four years.\n\nAlcoholic beverages\nIn 2021, the Coca-Cola Co used its Mexican sparkling mineral water brand Topo Chico to launch a range of vegan friendly alcoholic hard seltzers in the United Kingdom and in the United States.\n\nAdvertising\nCoca-Cola advertising has \"been among the most prolific in marketing history,\" with a notable and major impact on popular culture and society. The company in recent years has spent approximately an annual $4 billion globally to promote its drinks to the public; and spent approximately $4.24 billion on advertising in fiscal year 2019, most of which was spent to advertise Coca-Cola.\nCoca-Cola advertises through direct marketing, web-based media, social media, text messaging, and sales promotions. The company also markets via mobile marketing in text messages, e.g. viral marketing campaigns.\nFan engagement spans 86 million globally across social media channels: online interaction, and social, cultural, or sporting events.\nIn the retail setting, direct store beverage delivery trucks (mobile advertising) as well as point of sale coolers and vending machines have bright red logo blazoned branding.\n\nFront groups\nAs part of its corporate propaganda campaign to deflect public attention away from the harmful health effects of its sugary drinks, the Coca-Cola Company has funded front organizations.\nThe Beverage Institute for Health and Wellness was led by Rhona S. Applebaum, who was also the Coca-Cola Company's Chief Science and Health Officer. It was announced in 2005, when Coca-Cola executive Donald Short, then the company's vice president, published a paper about his company's commitments to consumers' health in the American Journal of Clinical Nutrition. Their paid advisers include Baylor College of Medicine researcher John Foreyt. The Institute \"sponsors continuing professional education for registered dietitians, nurses and other professionals.\" This has led critics to say that \"corporate influence is both tainting the Academy of Nutrition and Dietetics's reputation and affecting its positions.\"\nThe company funded creation of the front organization the Global Energy Balance Network (GEBN) to address the growing evidence that the company's products are a leading cause of the epidemic of childhood obesity in the United States and the growing number of Americans, including children, with type 2 diabetes. GEBN designed its own studies to arrive at conclusions set in advance and cherry picked data to support its corporate public relations agenda. After an August 2015 investigative report exposed the GEBN as a Coca-Cola Company front organization, GEBN was shut down.\nThree years after the shutdown of GEBN, the company, together with several other junk food giants, was revealed to be behind an initiative in China called \"Happy 10 Minutes\", funded through a group called the International Life Sciences Institute (ILSI). The aim of the initiative was to address decades of research on diet-related diseases, such as Type 2 diabetes and hypertension, by promoting physical exercise to the population but avoiding discussion of the link between such diseases and junk foods, including sugary drinks. ILSI through the 1980s and 1990s had been promoting the tobacco industry's agenda in Europe and the United States.\n\nSponsorship\nCoca-Cola's advertising expenses accounted for US$3.256 billion in 2011.\n\nSports\nCoca-Cola sponsored the English Football League from the beginning of the 2004–05 season (beginning August 2004) to the start of 2010–11 season, when the Football League replaced it with NPower. Along with this, Coca-Cola sponsored the Coca-Cola Football Camp, that took place in Pretoria, South Africa during the 2010 FIFA World Cup.\nOther major sponsorships include the AFL, NHRA, NASCAR, the PGA Tour, NCAA Championships, the Olympic Games, the NRL, the FIFA World Cups, Premier League and the UEFA European Championships. The company partnered with Panini to produce the first virtual sticker album for the 2006 FIFA World Cup, and they have collaborated for every World Cup since. Each fall, Coca-Cola is the sponsor of the TOUR Championship by Coca-Cola held at the East Lake Golf Club in Atlanta, Georgia. The Tour Championship is the season-ending tournament of the PGA Tour. In the Philippines, it had a team in the Philippine Basketball Association, the Powerade Tigers.\nIn 2017, Major League Baseball signed a multi-year deal with Coca-Cola to be the official soft drink, replacing Pepsi. Nineteen MLB teams (Los Angeles Angels, Houston Astros, Toronto Blue Jays, Atlanta Braves, St. Louis Cardinals, Los Angeles Dodgers, San Francisco Giants, Seattle Mariners, New York Mets, Washington Nationals, San Diego Padres, Philadelphia Phillies, Pittsburgh Pirates, Texas Rangers, Tampa Bay Rays, Cincinnati Reds, Boston Red Sox, Colorado Rockies and Chicago White Sox ) have Coca-Cola products sold in their ballparks. In 2023, the Chicago Cubs and Milwaukee Brewers added Coca-Cola as the official soft drink.\nIn October 2018, Coca-Cola started sponsoring the Formula 1 team McLaren with several 1 year deals being signed since then.\nSince 2019, Coca-Cola has been the title sponsor of the Uzbekistan Super League in soccer, which is officially called Coca-Cola Uzbekistan Super League.\nCoca-Cola has also sponsored the Overwatch league since season two. They also sponsor all major Overwatch tournaments such as the world cup\n.\nIn February 2020, Coca-Cola became the title sponsor for the eNASCAR iRacing series.\nIn February 2025, Coca-Cola became a sponsor of the Northern Super League, the top women's soccer league in Canada.\n\nTelevision\nCoca-Cola sponsored Walt Disney's first television show \"One Hour in Wonderland\" broadcast on Christmas Day 1950.\nCoca-Cola sponsored the 1965 airing of the television special \"A Charlie Brown Christmas\".\nCoca-Cola also sponsored the popular Fox singing-competition series American Idol from 2002 until 2014.\nCoca-Cola was a sponsor of the nightly talk show on PBS, Charlie Rose in the US.\nCoca-Cola is also an executive producer of Coke Studio (Pakistan). It was a franchising that started in Brazil, broadcast by MTV Brasil and there are various adaptations of Coke Studio such as Coke Studio (India), Coke Studio Bangla and Coke Studio Africa.\n\nTheme parks\nWhile not necessarily having naming rights to anything in all locations, the company does sponsor and provide beverages in many theme parks, usually in an exclusive capacity. This includes the Disney Experiences, Merlin Entertainment, Universal Destinations & Experiences, Six Flags, Cedar Fair, and United Parks & Resorts which are six of the nine largest theme park operators worldwide (it is unknown whether OCT Parks China, the Chimelong Group, or Fantawild, the fourth, seventh, and eighth largest theme park operators respectively, use Coca-Cola).\nThe company also formerly sponsored, with naming rights, the Coca-Cola London Eye and the Coca-Cola Orlando Eye.\nThe company also operates \"Coca-Cola\" visitor centers in Israel, Belgium and Turkey.\n\nConsumer relations and civic involvement\nAfter Martin Luther King Jr. won the 1964 Nobel Peace Prize, plans for an interracial celebratory dinner in still-segregated Atlanta were not initially well supported by the city's business elite until Coca-Cola intervened.\n\nJ. Paul Austin, the chairman and CEO of Coca-Cola, and Mayor Ivan Allen summoned key Atlanta business leaders to the Commerce Club's eighteenth-floor dining room, where Austin told them flatly, 'It is embarrassing for Coca-Cola to be located in a city that refuses to honor its Nobel Prize winner. We are an international business. The Coca-Cola Company does not need Atlanta. You all need to decide whether Atlanta needs the Coca-Cola Company.' Within two hours of the end of that meeting, every ticket to the dinner was sold.\nThroughout 2012, Coca-Cola contributed $1,700,500 to a $46 million political campaign known as \"The Coalition Against The Costly Food Labeling Proposition, sponsored by Farmers and Food Producers\". This organization was set up to oppose a citizen's initiative, known as Proposition 37, demanding mandatory labeling of foods containing genetically modified ingredients.\nIn 2012, Coca-Cola was listed as a partner of the (RED) campaign, together with other brands such as Nike, Girl, American Express, and Converse. The campaign's mission is to prevent the transmission of the HIV virus from mother to child by 2015 (the campaign's byline is \"Fighting for an AIDS Free Generation\").\nIn 2024, Coca-Cola sponsored the presidential campaign of Donald J. Trump. Coca-Cola gifted President Donald Trump with a custom Coke bottle commemorating his inauguration in January 2025.\n\nCriticism\nSince the early 2000s, the criticisms over the use of Coca-Cola products as well as the company itself, escalated with concerns over health effects, environmental issues, animal testing, economic business practices and employee issues. The Coca-Cola Company has been faced with multiple lawsuits concerning these various criticisms.\n\nPlastic production and waste\nThe Coca-Cola Company produces over 3 million tonnes of plastic packaging each year including 110 billion plastic bottles.\nThe company has been referenced as \"the worst plastic polluter in the world\" pumping out 200,000 plastic bottles a minute. Problems also arose in places such as Samoa where Coca-Cola switched away from reusable glass bottles to one time use plastic bottles. Residents of Samoa have seen an increase in plastic pollution since this switch has been made. Alternatives to plastic such as aluminum have also been overlooked with Coca-Cola releasing a new plastic bottle slightly bigger than a can size.\nThe magazine Forbes has labeled Coca-Cola as the world's most polluting brand. The company's global chief executive stated that \"Coca-Cola has no plans to reduce its use of plastic bottles\" and opposes bottle bill legislation, as consumers prefer the plastic bottles that \"reseal and are lightweight\".\nIn 2018, Coca-Cola pledged to use 50% recycled materials in its packaging and to recycle the equivalent of 100% of its packaging by 2030. That same year, the company started to sell reusable bottles in Brazil, which customers could return to the point of sale for a discount of subsequent purchases. The initiative was expanded to several other South American countries by 2022. In 2019, the company's Swedish branch transitioned to solely using plastic bottles consisting of recycled material.\nA research study published in 2025 showed that Coca-Cola, together with PepsiCo and Nestlé contributed 14 to 21 million tons of plastic waste to aquatic environments in the time span 2000 to 2023.\n\nSustainability misses\nIn December 2024, Coca-Cola announced adjustments to its sustainability goals, specifically revising its target to recycle the equivalent of 100 percent of its packaging by 2030. The company has acknowledged that it will not meet this goal as initially set. Instead, Coca-Cola has decided to focus on other sustainability measures, which has sparked discussions among environmental advocates and industry analysts.\nIn 2023, Coca-Cola's packaging composition included 47.7% plastic, 26% aluminum, and 10.4% glass. The company's efforts towards increasing the reuse of packaging have been limited, with only 1.2% of its packaging being reusable in the previous year. Additionally, Coca-Cola has increased its use of virgin plastics by approximately 6% since 2019.\n\nEnergy usage of corn syrup manufacturing\nCoca-Cola's use of high-fructose corn syrup is less sustainable when compared to producing sugary drinks with sugar cane. High-fructose corn syrup is carbon intensive due to the substantial amounts of fossil fuels required to power heavy machinery. Turning corn into high-fructose corn syrup is an energy intensive process requiring large amounts of carbon to be expended especially during corn growth. Burning fossil fuels releases CO2 and CH4 which is the main source of energy for producing high-fructose corn syrup. The environmental impact of corn production can be attributed to three primary effects of field emissions, irrigation and grain decay.\n\nWater usage\nCoca-Cola has also been under fire for depleting water sources through their high water usages. Local villagers have testified that Coca-Cola's entry in Kaladera Rajasthan intensified lower water sources. Documents from the government's water ministry reveal water levels remained stable from 1995 until 2000, when the Coca-Cola was first operational. Water levels then dropped by almost ten meters during the next five years. Other communities in India that are located around Coca-Cola's bottling plants are experiencing water shortages as well as environmental damage taking heavy tolls on harvests as well as drying up wells.\n\nRacial discrimination\nIn November 2000, Coca-Cola agreed to pay $192.5 million to settle a class action racial discrimination lawsuit and promised to change the way it manages, promotes, and treats minority employees in the US. In 2003, protesters at Coca-Cola's annual meeting claimed that black people remained underrepresented in top management at the company, were paid less than white employees, and fired more often. In 2004, Luke Visconti, a co-founder of DiversityInc, which rates companies on their diversity efforts, said: \"Because of the settlement decree, Coca-Cola was forced to put in management practices that have put the company in the top 10 for diversity.\"\nIn March 2012, 16 workers of color sued Coca-Cola, claiming they had to work in a \"cesspool of racial discrimination\".\nIn February 2021, recordings of an employee training course were leaked on social media. The course instructed employees to \"be less white\", which the course equated with being less \"arrogant\" and \"oppressive\".\n\nLeadership\nPresidents and chairman of the company have been:\n\nPresident\nAsa Griggs Candler, 1892–1916\nCharles Howard Candler Sr., 1916–1919\nSamuel Candler Dobbs, 1919–1920\nCharles Howard Candler Sr., 1919–1923\nRobert Winship Woodruff, 1923–1939\nArthur A. Acklin, 1939–1945\nRobert Winship Woodruff, 1945–1946\nWilliam J. Hobbs, 1946–1952\nHammond Burke Nicholson Sr., 1952–1955\nWilliam Edward Robinson, 1955–1958\nLee Talley, 1958–1962\nJohn Paul Austin, 1962–1971\nCharles William Duncan Jr., 1971–1974\nJ. Lucian Smith, 1974–1980\nRoberto Críspulo Goizueta Cantera, 1980–1981\nDonald Raymond Keough, 1981–\n\nChairman of the Board\nCharles Howard Candler Sr., 1919–1920\nWilliam Clark Bradley, 1920–1939\nRobert Winship Woodruff, 1939–1942\nHarrison Jones, 1942–1952\nRobert Winship Woodruff, 1952–1955\nHammond Burke Nicholson Sr., 1955–1958\nWilliam Edward Robinson, 1958–1961\nLee Talley, 1961–1971\nJohn Paul Austin, 1971–1980\nRoberto Críspulo Goizueta Cantera, 1980–\n\nSee also\nList of assets owned by the Coca-Cola Company\nStepan Company – produces coca leaf extract\n\nNotes\nReferences\nFurther reading\nButler, David; Tischler, Linda (February 10, 2015). Design to Grow: How Coca-Cola Learned to Combine Scale and Agility (and How You Can Too) (1st ed.). New York, NY: Simon & Schuster. ISBN 978-1-4516-7627-3.\nGarcia, Christopher J.; Proffitt, Jennifer M. (October 20, 2022). \"\"We are Coca-Cola and so much more\": political economic analysis of non-carbonated SSB Coke brands\". Food, Culture & Society. 25 (5): 796–813. doi:10.1080/15528014.2021.1922192. ISSN 1552-8014.\nGarrett, Franklin Miller (1969). \"The Eighteen-Eighties\". Atlanta and Environs: A Chronicle of Its People and Events, 1880s-1930s (2nd ed.). Athens, Georgia.: University of Georgia Press. ISBN 978-0-8203-3128-7.\nGiebelhaus, August W. (May 13, 2008). \"Coca-Cola Company\". The New Georgia Encyclopedia. Georgia Humanities Council.\n\"Robinson, William E.: Papers, 1935–69\". Abilene, Kansas: Dwight D. Eisenhower Library.\nZyman, Sergio (June 1, 1999). The End of Marketing as We Know It. New York: HarperBusiness. ISBN 0-88730-986-0.\n\nExternal links\nOfficial website \nThe Coca-Cola Company companies grouped at OpenCorporates\nThe Coca-Cola Company on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nThe Coca-Cola Company on Ethical Consumer\nBusiness data for the Coca-Cola Company: \n Media related to the Coca-Cola Company at Wikimedia Commons",
  "clean_text": "The Coca-Cola Company is an American multinational corporation founded in 1892 headquartered in Atlanta, Georgia. It manufactures, sells and markets soft drinks including Coca-Cola, other non-alcoholic beverage concentrates and syrups, and alcoholic beverages. Its stock is listed on the New York Stock Exchange and is a component of the DJIA and the S&P 500 and S&P 100 indices. Coca-Cola was developed in 1886 by pharmacist John Stith Pemberton. At the time it was introduced, the product contained the stimulants cocaine from coca leaves and caffeine from kola nuts which together acted synergistically. The coca and the kola are the source of the product name, and led to Coca-Cola's promotion as a \"healthy tonic\". Pemberton had been severely wounded in the American Civil War, and had become addicted to the pain medication morphine. At the time, cocaine was being promoted as a \"cure\" for opioid addiction, so he developed the beverage as a patent medicine in an effort to control his addiction. In 1889, the formula and brand were sold for $2,300 (equivalent to $73,000 in 2024) to Asa Griggs Candler, who incorporated the Coca-Cola Company in Atlanta in 1892. The company has operated a franchised distribution system since 1889. The company largely produces syrup concentrate, which is then sold to various bottlers throughout the world who hold exclusive territories. History In July 1886, pharmacist John Stith Pemberton from Columbus, Georgia, invented the original Coca-Cola drink, which was advertised as helpful in the relief of headache, to be placed on sale primarily in drugstores as a medicinal beverage. Pemberton had made many mixing experiments and reached his goal during the month of May, but the new product was as yet unnamed and uncarbonated. Pemberton's bookkeeper, Frank Mason Robinson, is credited with naming the product and creating its logo. Robinson chose the name Coca-Cola because of its two main ingredients (coca leaves and kola nuts) and because it is an alliteration. John Pemberton had taken a break and left Robinson to make, promote, and sell Coca-Cola on his own. Robinson promoted the drink with the limited budget that he had, and succeeded. American businessman Asa Griggs Candler purchased the Coca-Cola formula and brand, forming the Coca-Cola Company in Atlanta in 1892. By 1895, Coca-Cola was being sold nationwide. In 1919, the company was sold to Ernest Woodruff's Trust Company of Georgia, after which it was soon reincorporated under the Delaware General Corporation Law that same year. Coca-Cola's first ad read \"Coca Cola. Delicious! Refreshing! Exhilarating! Invigorating!\" Candler was one of the first businessmen to use merchandising in his advertising strategy. As of 1948, Coca-Cola had claimed about 60% of its market share. By 1984, the Coca-Cola Company's market share decreased to 21.8% due to new competitors. Acquisitions Coca-Cola acquired Minute Maid in 1960 for an undisclosed amount. In 1982, it acquired the movie studio Columbia Pictures for $692 million. Coca-Cola then launched a series of entertainment takeovers, namely Merv Griffin Enterprises and Embassy Communications in the mid-1980s, forming the Entertainment Business Sector, which would later merge with Tri-Star Pictures to start out Columbia Pictures Entertainment, with CPE holding a stake in the company. Coca-Cola sold Columbia to Sony for $3 billion in 1989. In 1986, Coke sold off two assets, namely Presto Products and Winker-Flexible Products to an investment group led by E.O. Gaylord for $38 million. The company acquired the Indian cola brand Thums Up in 1993, and the American soda company Barq's in 1995. In 1999, Coca-Cola purchased 50% of the shares of Inca Kola for $200 million, subsequently taking control of overseas marketing and production for the brand. In 2001, it acquired the Odwalla brand of fruit juices, smoothies, and bars for $181 million. It announced Odwalla's discontinuation in 2020. In 2007, it acquired Fuze Beverage from founder Lance Collins and Castanea Partners for an estimated $250 million. The company's 2009 bid to buy Chinese juice maker Huiyuan Juice Group ended when China rejected its $2.4 billion bid, on the grounds the resulting company would be a virtual monopoly. Nationalism was also thought to be a reason for aborting the deal. In 2011, it acquired the remaining stake in Honest Tea, having bought a 40% stake in 2008 for $43 million. In 2013, it finalized its purchase of ZICO, a coconut water company. In August 2014, it acquired a 16.7% (currently 19.36% due to stock buy backs) stake in Monster Beverage for $2.15 billion with an option to increase it to 25%, as part of a long-term strategic partnership that includes marketing and distribution alliance, and product line swap. In 2015, the company took a minority stake ownership in the cold pressed juice manufacturer, Suja Life LLC. In December 2016, it bought many of the former SABMiller's Coca-Cola operations. The Coca-Cola Company owns a 68.3% stake in Coca-Cola Bottlers Africa. Coca-Cola Bottlers Africa is headquartered in Port Elizabeth, South Africa. The Coca-Cola Company acquired a 40% stake in Nigerian snack and beverage company Chi Limited on January 30, 2016. The Coca-Cola Company acquired the remaining 60% stake in Chi Ltd on January 30, 2019. In 2017, the Coca-Cola Company acquired Mexican sparkling water brand Topo Chico. On August 31, 2018, it agreed to acquire Costa Coffee from Whitbread for £3.9bn. The acquisition closed on January 3, 2019. During August 2018, the Coca-Cola Company acquired Moxie for an undisclosed amount. On August 14, 2018, the Coca-Cola Company announced a minority interest in Bodyarmor. On September 19, 2018, the Coca-Cola Company acquired Organic & Raw Trading Co. Pty Ltd, the manufacturer of Mojo Kombucha in Willunga, Australia. In 2022 Coca-Cola shut down production of Mojo. Revenue and sales According to the Coca-Cola Company's 2005 annual report, it had sold beverage products in more than 200 countries that year. The 2005 report further states that of the approximately 50 billion beverage servings of all types consumed worldwide, daily, beverages bearing the trademarks owned by or licensed to Coca-Cola account for more than 1.3 billion. Of these, beverages bearing the trademark \"Coca-Cola\" or \"Coke\" accounted for approximately 55% of the company's total gallon sales. In 2010, it was announced that Coca-Cola had become the first brand to top £1 billion in annual UK grocery sales. In 2017, Coca-Cola sales were down 11% from the year before due to consumer tastes shifting away from sugary drinks. Stock Since 1919, Coca-Cola has been a publicly traded company. Its stock is listed on the New York Stock Exchange under the ticker symbol \"KO\". One share of stock purchased in 1919 for $40, with all dividends reinvested, would have been worth $9.8 million in 2012, a 10.7% annual increase adjusted for inflation. A predecessor bank of SunTrust received $100,000 for underwriting Coca-Cola's 1919 public offering; the bank sold that stock for over $2 billion in 2012. In 1987, Coca-Cola once again became one of the 30 stocks which makes up the Dow Jones Industrial Average, which is commonly referenced as a proxy for stock market performance; it had previously been a Dow stock from 1932 to 1935. Coca-Cola has paid a dividend since 1920 and, as of 2019, had increased it each year for 57 years straight. Shareholders The 10 largest shareholder of Coca-Cola in March 2025 were: Staff and management The following are key management as of March 2023 (excluding VP positions and regional leaders): The following are all directors as of July 2025: Bottlers In general, the Coca-Cola Company and its subsidiaries only produce syrup concentrate, as well as sourcing beverage base including coffee beans, tea leaf, juices, etc., which is then sold to various bottlers throughout the world who hold a local Coca-Cola franchise. Coca-Cola bottlers, who hold territorially exclusive contracts with the company, produce the finished product in packages from the concentrate and beverage base, in combination with filtered water and sweeteners. The bottlers then sell, distribute, and merchandise the Coca-Cola product to retail stores, vending machines, restaurants, and food service distributors. Outside the United States, these bottlers also control the fountain business. Since the 1980s, the company has actively encouraged the consolidation of bottlers, with the company often owning a share of these \"anchor bottlers\". In January 2006, the company formed the Bottling Investments Group (BIG), by bringing company-owned bottling operations together to strategically invest in select bottling operations, temporarily taking them under Coca-Cola ownership, and utilizing the leadership and resources of the company. Also, the company has accelerated refranchising both company-owned bottlers and independent bottling partners to consolidate their operations and move away from the capital-intensive and low-margin business of bottling, with maintaining minor share ownership of these consolidated bottlers and secure the right to nominate directors and/or executives through shareholders agreement and/or capital and business alliance agreement. As a result of the refranchising and bottler consolidations, multi-national/large-scale bottlers and three U.S.-based bottlers now dominate the manufacturing and distribution of the company's products except the territories managed by BIG bottlers. Multi-national/large-scale bottlers Coca-Cola Europacific Partners PLC: Headquartered in the UK, operates 29 countries in Western Europe, Oceania, Indonesia, and Papua New Guinea. The company owns 19.36%. Coca-Cola FEMSA: Headquartered in Mexico, operating in Argentina, Brazil, Costa Rica, Guatemala, Nicaragua, Panama, Colombia, Mexico, Uruguay, and Venezuela. The company owns 27.8%. Arca Continental: Headquartered in Mexico, operating in Mexico, Ecuador, Peru, Argentina, and the southwestern U.S. (Texas and parts of New Mexico, Oklahoma, and Arkansas). (Independent) Embotelladora Andina (Coca-Cola Andina): Headquartered in Chile, operating in Argentine, Chile, Brazil, and Paraguay. The company owns 14.7% of series A common stock outstanding & 14.7% of series B common stock outstanding. Coca-Cola HBC AG: Headquartered in Switzerland, operating 28 countries in Western, Central, and Eastern Europe, Russia, and Nigeria. The company owns 23.2%. Coca-Cola Icecek: Headquartered in Turkey, operates in the Middle East and Central Asian Countries (Turkey, Pakistan, Kazakhstan, Iraq, Uzbekistan, Azerbaijan, Jordan, Turkmenistan, Kyrgyzstan, Tajikistan, and Syria). The company owns 20.1%. Swire Coca-Cola: Headquartered in Hong Kong, operates in 11 provinces and Shanghai municipality in China, Hong Kong, Macau, Taiwan, Vietnam, Cambodia, and 13 states in the U.S. COFCO Coca-Cola: Operates 19 provinces and municipalities in China, a joint venture between COFCO Corporation and the Coca-Cola Company with 35% ownership. Coca-Cola Bottlers Japan Holdings: Headquartered and operates in Japan, covering ~90% of the volume sold in Japan. The company owns 18.88%. Bottlers headquartered and operated in the U.S. Coca-Cola Bottling Co. Consolidated, based in Charlotte, North Carolina. 34.8% owned by the Coca-Cola Company and listed on the NASDAQ. Coca-Cola Beverages Northeast, based in Bedford, New Hampshire, and owned by Kirin Holdings. Coca-Cola Bottling Company United, based in Birmingham, Alabama (independent) Coca-Cola Beverages Florida, based in Tampa, Florida, and is a certified Minority owned business. Company-owned bottling operation is now managed under BIG, which covers operations in Bangladesh, Cambodia, India, Malaysia, Myanmar, Nepal, Oman, Philippines, Singapore, and Sri Lanka as well as eastern African operation by Coca-Cola Beverages Africa in Port Elizabeth, South Africa. In 2021, the company announced its intention to list Coca-Cola Beverages Africa as a publicly traded company. However, in June 2022 it announced that it was delaying this plan, pending an evaluation of macroeconomic conditions. Products and brands As of 2020, the Coca-Cola Company offers more than 500 brands in over 200 countries. In September 2020, the company announced that it would cut more than half of its brands, as a result of the economic effects caused by the COVID-19 pandemic. Non-food assets Columbia Pictures Coca-Cola bought Columbia Pictures in 1982, owing to the low monetary value of the studio. The film company was the first and only studio ever owned by Coca-Cola. During its ownership of the studio, Columbia released many popular films including Ghostbusters, Stripes, The Karate Kid, and some others. However, two years after the critical and commercial failure of the 1987 film Ishtar, Columbia was spun-off and then sold to Tokyo-based Sony in 1989. World of Coca-Cola Coca-Cola operates a soft drink themed tourist attraction in Atlanta, Georgia; the World of Coca-Cola is a multi-storied exhibition. It features flavor sampling and a history museum, with locations in Las Vegas, Nevada, and Lake Buena Vista, Florida. Brands Other soft drinks The Coca-Cola Company also produces a number of other soft drinks including Fanta (introduced circa 1941), Sprite and Lilt, which was discontinued after 50 years and renamed Fanta Pineapple & Grapefruit. Fanta's origins date back to World War II during a trade embargo against Germany on cola syrup, making it impossible to sell Coca-Cola in Germany. Max Keith, the head of Coca-Cola's German office during the war, decided to create a new product for the German market, made only from products available in Germany at the time, which they named Fanta. The drink proved to be a hit, and when Coke took over again after the war, it adopted the Fanta brand as well. Fanta was originally an orange-flavored soft drink that can come in plastic bottles or cans. It has become available in many different flavors now such as grape, peach, apple, pineapple, and strawberry. In 1961, Coca-Cola introduced Sprite, a lemon-lime soft drink, another of the company's bestsellers and its response to 7 Up. Tab was Coca-Cola's first attempt to develop a diet soft drink, using saccharin as a sugar substitute. Introduced in 1963, the product was sold until fall 2020, although its sales had dwindled since the introduction of Diet Coke. Coca-Cola South Africa also released Valpre Bottled \"still\" and \"sparkling\" water. In 1969, the company released Simba, which was a take on Mountain Dew, and had packaging that was African desert-themed, replete with an African Lion as the symbol of the brand. The tagline was \"Simba – It Conquers the African Thirst.\" Also in 1969, the company released a line of products under the name of Santiba, which was targeted for mixing cocktails and party usage, products including Quinine water and Ginger Ale. Like the above-mentioned Simba, the Santiba line of products was short-lived in the marketplace. BreakMate No longer manufactured, the Coca-Cola BreakMate was a three-flavor dispenser introduced by Coca-Cola and Siemens in 1988. Intended for use in offices with five to fifty people, its refrigerated compartment held three individual one-litre plastic containers of soda syrup and a CO2 tank. Like a soda fountain, it mixed syrup in a 1:5 ratio with carbonated water. In North America, Coca-Cola discontinued spare BreakMate parts in 2007 and stopped distributing the syrup in 2010. Healthy beverages During the 1990s, the company responded to the growing consumer interest in healthy beverages by introducing several new non-carbonated beverage brands. These included Minute Maid Juices to Go, Powerade sports beverage, flavored tea Nestea (in a joint venture with Nestlé), Fruitopia fruit drink, and Dasani water, among others. In 2001, the Minute Maid division launched the Simply Orange brand of juices including orange juice. In 2016, Coca-Cola India introduced Vio to enter into the value-added dairy category. The product lays the foundation for Coca-Cola's new segment after carbonated beverages, water and juices. In 2004, perhaps in response to the burgeoning popularity of low-carbohydrate diets such as the Atkins diet, Coca-Cola announced its intention to develop and sell a low-carbohydrate alternative to Coke Classic, dubbed C2 Cola. C2 contains a mix of high fructose corn syrup, aspartame, sucralose, and Acesulfame potassium. C2 is designed to more closely emulate the taste of Coca-Cola Classic. Even with less than half of the food energy and carbohydrates of standard soft drinks, C2 is not a replacement for zero-calorie soft drinks such as Diet Coke. C2 went on sale in the U.S. on June 11, 2004, and in Canada in August 2004; it was replaced in 2013 by Coca-Cola Life. Starting in 2009, the Coca-Cola Company invested in Innocent Drinks, first with a minor stake, increasing to 90% in the first quarter of 2013. It was in May 2014 when Finley, a sparkling fruit-flavored drink, was launched in France. It was launched in other countries later, including Belgium and Luxembourg in September 2014. Coca-Cola first started developing the drink in Belgium in 2001. As of 2014, the drink is targeted for adults, and is low in sugar with four flavors. Best selling Coca-Cola is the best-selling soft drink in most countries, and was recognized as the number one global brand in 2010. While the Middle East is one of the few regions in the world where Coca-Cola is not the number one soda drink, Coca-Cola nonetheless holds almost 25% market share (to Pepsi's 75%) and had double-digit growth in 2003. Similarly, in Scotland, where the locally produced Irn-Bru was once more popular, 2005 figures show that both Coca-Cola and Diet Coke now outsell Irn-Bru. In Peru, the native Inca Kola has been more popular than Coca-Cola, which prompted Coca-Cola to enter in negotiations with the soft drink's company and buy 50% of its stakes. In Japan, the best selling soft drink is not cola, as (canned) tea and coffee are more popular. As such, the Coca-Cola Company's best selling brand there is not Coca-Cola, but Georgia. In May 2016, the Coca-Cola Company temporarily halted production of its signature drink in Venezuela due to sugar shortages. Since then, the Coca-Cola Company has been using \"minimum inventories of raw material\" to make their signature drinks at two production plants in Venezuela. Information On July 6, 2006, a Coca-Cola employee and two other people were arrested and charged with trying to sell trade secret information to the soft drink maker's competitor PepsiCo for $1.5 million. The recipe for Coca-Cola, perhaps the company's most closely guarded secret, was never in jeopardy; instead, the information was related to a new beverage in development. Coca-Cola executives verified that the trade secret documents in question were genuine and proprietary to the company. At least one glass vial containing a sample of a new drink was offered for sale, court documents said. The conspiracy was revealed by PepsiCo, which notified authorities when it was approached by the conspirators. Green tea The company announced a new \"negative calorie\" green tea drink, Enviga, in 2006, along with trying coffee retail concepts Far Coast and Chaqwa. Glaceau On May 25, 2007, Coca-Cola announced it would purchase Glaceau, a maker of flavored vitamin-enhanced drinks (vitamin water), flavored waters, and Burn energy drinks, for $4.1 billion in cash. Huiyuan Juice On September 3, 2008, Coca-Cola announced its intention to make cash offers to purchase China Huiyuan Juice Group Limited (which had a 42% share of the Chinese pure fruit juice market) for US$2.4bn (HK$12.20 per share). China's ministry of commerce blocked the deal on March 18, 2009, arguing that the deal would hurt small local juice companies, could have pushed up juice market prices, and limited consumers' choices. Coke Mini can In October 2009, Coca-Cola revealed its new 90-calorie mini can that holds 7.5 fluid ounces. The mini can is often sold in 8 packs. Despite costing nearly 30 percent more per ounce, the mini cans have been met with positive sales figures. Holiday can In November 2011, Coca-Cola revealed a seasonal design for its regular Coke cans as part of a partnership with the World Wildlife Fund. However, it was withdrawn only a month after release due to consumer complaints about a similar look to the silver cans commonly used for Diet Coke. There were also complaints about deviating from traditional red as the color of Coca-Cola cans previously. Stake in Monster Beverage It was announced on August 14, 2014, that the Coca-Cola Company was making a cash payment of $2.15 billion for a 16.7 percent stake in Monster Beverage Corp to expand its market for energy drinks, with Coke to transfer ownership in Full Throttle and Burn to Monster and Monster to transfer its ownership in Hansen's Natural Sodas, Peace Iced Tea, and Blue Sky Soda to the Coca-Cola Company. Muhtar Kent, Coke's former chief executive officer, stated that the company has the option to increase its stake to 25 percent but could not exceed that percentage in the next four years. Alcoholic beverages In 2021, the Coca-Cola Co used its Mexican sparkling mineral water brand Topo Chico to launch a range of vegan friendly alcoholic hard seltzers in the United Kingdom and in the United States. Advertising Coca-Cola advertising has \"been among the most prolific in marketing history,\" with a notable and major impact on popular culture and society. The company in recent years has spent approximately an annual $4 billion globally to promote its drinks to the public; and spent approximately $4.24 billion on advertising in fiscal year 2019, most of which was spent to advertise Coca-Cola. Coca-Cola advertises through direct marketing, web-based media, social media, text messaging, and sales promotions. The company also markets via mobile marketing in text messages, e.g. viral marketing campaigns. Fan engagement spans 86 million globally across social media channels: online interaction, and social, cultural, or sporting events. In the retail setting, direct store beverage delivery trucks (mobile advertising) as well as point of sale coolers and vending machines have bright red logo blazoned branding. Front groups As part of its corporate propaganda campaign to deflect public attention away from the harmful health effects of its sugary drinks, the Coca-Cola Company has funded front organizations. The Beverage Institute for Health and Wellness was led by Rhona S. Applebaum, who was also the Coca-Cola Company's Chief Science and Health Officer. It was announced in 2005, when Coca-Cola executive Donald Short, then the company's vice president, published a paper about his company's commitments to consumers' health in the American Journal of Clinical Nutrition. Their paid advisers include Baylor College of Medicine researcher John Foreyt. The Institute \"sponsors continuing professional education for registered dietitians, nurses and other professionals.\" This has led critics to say that \"corporate influence is both tainting the Academy of Nutrition and Dietetics's reputation and affecting its positions.\" The company funded creation of the front organization the Global Energy Balance Network (GEBN) to address the growing evidence that the company's products are a leading cause of the epidemic of childhood obesity in the United States and the growing number of Americans, including children, with type 2 diabetes. GEBN designed its own studies to arrive at conclusions set in advance and cherry picked data to support its corporate public relations agenda. After an August 2015 investigative report exposed the GEBN as a Coca-Cola Company front organization, GEBN was shut down. Three years after the shutdown of GEBN, the company, together with several other junk food giants, was revealed to be behind an initiative in China called \"Happy 10 Minutes\", funded through a group called the International Life Sciences Institute (ILSI). The aim of the initiative was to address decades of research on diet-related diseases, such as Type 2 diabetes and hypertension, by promoting physical exercise to the population but avoiding discussion of the link between such diseases and junk foods, including sugary drinks. ILSI through the 1980s and 1990s had been promoting the tobacco industry's agenda in Europe and the United States. Sponsorship Coca-Cola's advertising expenses accounted for US$3.256 billion in 2011. Sports Coca-Cola sponsored the English Football League from the beginning of the 2004–05 season (beginning August 2004) to the start of 2010–11 season, when the Football League replaced it with NPower. Along with this, Coca-Cola sponsored the Coca-Cola Football Camp, that took place in Pretoria, South Africa during the 2010 FIFA World Cup. Other major sponsorships include the AFL, NHRA, NASCAR, the PGA Tour, NCAA Championships, the Olympic Games, the NRL, the FIFA World Cups, Premier League and the UEFA European Championships. The company partnered with Panini to produce the first virtual sticker album for the 2006 FIFA World Cup, and they have collaborated for every World Cup since. Each fall, Coca-Cola is the sponsor of the TOUR Championship by Coca-Cola held at the East Lake Golf Club in Atlanta, Georgia. The Tour Championship is the season-ending tournament of the PGA Tour. In the Philippines, it had a team in the Philippine Basketball Association, the Powerade Tigers. In 2017, Major League Baseball signed a multi-year deal with Coca-Cola to be the official soft drink, replacing Pepsi. Nineteen MLB teams (Los Angeles Angels, Houston Astros, Toronto Blue Jays, Atlanta Braves, St. Louis Cardinals, Los Angeles Dodgers, San Francisco Giants, Seattle Mariners, New York Mets, Washington Nationals, San Diego Padres, Philadelphia Phillies, Pittsburgh Pirates, Texas Rangers, Tampa Bay Rays, Cincinnati Reds, Boston Red Sox, Colorado Rockies and Chicago White Sox ) have Coca-Cola products sold in their ballparks. In 2023, the Chicago Cubs and Milwaukee Brewers added Coca-Cola as the official soft drink. In October 2018, Coca-Cola started sponsoring the Formula 1 team McLaren with several 1 year deals being signed since then. Since 2019, Coca-Cola has been the title sponsor of the Uzbekistan Super League in soccer, which is officially called Coca-Cola Uzbekistan Super League. Coca-Cola has also sponsored the Overwatch league since season two. They also sponsor all major Overwatch tournaments such as the world cup . In February 2020, Coca-Cola became the title sponsor for the eNASCAR iRacing series. In February 2025, Coca-Cola became a sponsor of the Northern Super League, the top women's soccer league in Canada. Television Coca-Cola sponsored Walt Disney's first television show \"One Hour in Wonderland\" broadcast on Christmas Day 1950. Coca-Cola sponsored the 1965 airing of the television special \"A Charlie Brown Christmas\". Coca-Cola also sponsored the popular Fox singing-competition series American Idol from 2002 until 2014. Coca-Cola was a sponsor of the nightly talk show on PBS, Charlie Rose in the US. Coca-Cola is also an executive producer of Coke Studio (Pakistan). It was a franchising that started in Brazil, broadcast by MTV Brasil and there are various adaptations of Coke Studio such as Coke Studio (India), Coke Studio Bangla and Coke Studio Africa. Theme parks While not necessarily having naming rights to anything in all locations, the company does sponsor and provide beverages in many theme parks, usually in an exclusive capacity. This includes the Disney Experiences, Merlin Entertainment, Universal Destinations & Experiences, Six Flags, Cedar Fair, and United Parks & Resorts which are six of the nine largest theme park operators worldwide (it is unknown whether OCT Parks China, the Chimelong Group, or Fantawild, the fourth, seventh, and eighth largest theme park operators respectively, use Coca-Cola). The company also formerly sponsored, with naming rights, the Coca-Cola London Eye and the Coca-Cola Orlando Eye. The company also operates \"Coca-Cola\" visitor centers in Israel, Belgium and Turkey. Consumer relations and civic involvement After Martin Luther King Jr. won the 1964 Nobel Peace Prize, plans for an interracial celebratory dinner in still-segregated Atlanta were not initially well supported by the city's business elite until Coca-Cola intervened. J. Paul Austin, the chairman and CEO of Coca-Cola, and Mayor Ivan Allen summoned key Atlanta business leaders to the Commerce Club's eighteenth-floor dining room, where Austin told them flatly, 'It is embarrassing for Coca-Cola to be located in a city that refuses to honor its Nobel Prize winner. We are an international business. The Coca-Cola Company does not need Atlanta. You all need to decide whether Atlanta needs the Coca-Cola Company.' Within two hours of the end of that meeting, every ticket to the dinner was sold. Throughout 2012, Coca-Cola contributed $1,700,500 to a $46 million political campaign known as \"The Coalition Against The Costly Food Labeling Proposition, sponsored by Farmers and Food Producers\". This organization was set up to oppose a citizen's initiative, known as Proposition 37, demanding mandatory labeling of foods containing genetically modified ingredients. In 2012, Coca-Cola was listed as a partner of the (RED) campaign, together with other brands such as Nike, Girl, American Express, and Converse. The campaign's mission is to prevent the transmission of the HIV virus from mother to child by 2015 (the campaign's byline is \"Fighting for an AIDS Free Generation\"). In 2024, Coca-Cola sponsored the presidential campaign of Donald J. Trump. Coca-Cola gifted President Donald Trump with a custom Coke bottle commemorating his inauguration in January 2025. Criticism Since the early 2000s, the criticisms over the use of Coca-Cola products as well as the company itself, escalated with concerns over health effects, environmental issues, animal testing, economic business practices and employee issues. The Coca-Cola Company has been faced with multiple lawsuits concerning these various criticisms. Plastic production and waste The Coca-Cola Company produces over 3 million tonnes of plastic packaging each year including 110 billion plastic bottles. The company has been referenced as \"the worst plastic polluter in the world\" pumping out 200,000 plastic bottles a minute. Problems also arose in places such as Samoa where Coca-Cola switched away from reusable glass bottles to one time use plastic bottles. Residents of Samoa have seen an increase in plastic pollution since this switch has been made. Alternatives to plastic such as aluminum have also been overlooked with Coca-Cola releasing a new plastic bottle slightly bigger than a can size. The magazine Forbes has labeled Coca-Cola as the world's most polluting brand. The company's global chief executive stated that \"Coca-Cola has no plans to reduce its use of plastic bottles\" and opposes bottle bill legislation, as consumers prefer the plastic bottles that \"reseal and are lightweight\". In 2018, Coca-Cola pledged to use 50% recycled materials in its packaging and to recycle the equivalent of 100% of its packaging by 2030. That same year, the company started to sell reusable bottles in Brazil, which customers could return to the point of sale for a discount of subsequent purchases. The initiative was expanded to several other South American countries by 2022. In 2019, the company's Swedish branch transitioned to solely using plastic bottles consisting of recycled material. A research study published in 2025 showed that Coca-Cola, together with PepsiCo and Nestlé contributed 14 to 21 million tons of plastic waste to aquatic environments in the time span 2000 to 2023. Sustainability misses In December 2024, Coca-Cola announced adjustments to its sustainability goals, specifically revising its target to recycle the equivalent of 100 percent of its packaging by 2030. The company has acknowledged that it will not meet this goal as initially set. Instead, Coca-Cola has decided to focus on other sustainability measures, which has sparked discussions among environmental advocates and industry analysts. In 2023, Coca-Cola's packaging composition included 47.7% plastic, 26% aluminum, and 10.4% glass. The company's efforts towards increasing the reuse of packaging have been limited, with only 1.2% of its packaging being reusable in the previous year. Additionally, Coca-Cola has increased its use of virgin plastics by approximately 6% since 2019. Energy usage of corn syrup manufacturing Coca-Cola's use of high-fructose corn syrup is less sustainable when compared to producing sugary drinks with sugar cane. High-fructose corn syrup is carbon intensive due to the substantial amounts of fossil fuels required to power heavy machinery. Turning corn into high-fructose corn syrup is an energy intensive process requiring large amounts of carbon to be expended especially during corn growth. Burning fossil fuels releases CO2 and CH4 which is the main source of energy for producing high-fructose corn syrup. The environmental impact of corn production can be attributed to three primary effects of field emissions, irrigation and grain decay. Water usage Coca-Cola has also been under fire for depleting water sources through their high water usages. Local villagers have testified that Coca-Cola's entry in Kaladera Rajasthan intensified lower water sources. Documents from the government's water ministry reveal water levels remained stable from 1995 until 2000, when the Coca-Cola was first operational. Water levels then dropped by almost ten meters during the next five years. Other communities in India that are located around Coca-Cola's bottling plants are experiencing water shortages as well as environmental damage taking heavy tolls on harvests as well as drying up wells. Racial discrimination In November 2000, Coca-Cola agreed to pay $192.5 million to settle a class action racial discrimination lawsuit and promised to change the way it manages, promotes, and treats minority employees in the US. In 2003, protesters at Coca-Cola's annual meeting claimed that black people remained underrepresented in top management at the company, were paid less than white employees, and fired more often. In 2004, Luke Visconti, a co-founder of DiversityInc, which rates companies on their diversity efforts, said: \"Because of the settlement decree, Coca-Cola was forced to put in management practices that have put the company in the top 10 for diversity.\" In March 2012, 16 workers of color sued Coca-Cola, claiming they had to work in a \"cesspool of racial discrimination\". In February 2021, recordings of an employee training course were leaked on social media. The course instructed employees to \"be less white\", which the course equated with being less \"arrogant\" and \"oppressive\". Leadership Presidents and chairman of the company have been: President Asa Griggs Candler, 1892–1916 Charles Howard Candler Sr., 1916–1919 Samuel Candler Dobbs, 1919–1920 Charles Howard Candler Sr., 1919–1923 Robert Winship Woodruff, 1923–1939 Arthur A. Acklin, 1939–1945 Robert Winship Woodruff, 1945–1946 William J. Hobbs, 1946–1952 Hammond Burke Nicholson Sr., 1952–1955 William Edward Robinson, 1955–1958 Lee Talley, 1958–1962 John Paul Austin, 1962–1971 Charles William Duncan Jr., 1971–1974 J. Lucian Smith, 1974–1980 Roberto Críspulo Goizueta Cantera, 1980–1981 Donald Raymond Keough, 1981– Chairman of the Board Charles Howard Candler Sr., 1919–1920 William Clark Bradley, 1920–1939 Robert Winship Woodruff, 1939–1942 Harrison Jones, 1942–1952 Robert Winship Woodruff, 1952–1955 Hammond Burke Nicholson Sr., 1955–1958 William Edward Robinson, 1958–1961 Lee Talley, 1961–1971 John Paul Austin, 1971–1980 Roberto Críspulo Goizueta Cantera, 1980–"
}