{
  "ticker": "KR",
  "cik": "0000056873",
  "company_name": "Kroger",
  "corrected_name": "Kroger",
  "wiki_title_used": "Kroger",
  "exists": true,
  "raw_text": "The Kroger Co., or simply Kroger, is an American retail company that operates (either directly or through its subsidiaries) supermarkets and multi-department stores throughout the United States.\nFounded by Bernard Kroger in 1883 in Cincinnati, Ohio, the company operates 2,719 grocery stores in 35 states (mostly in the South, Midwest and West) and the District of Columbia. Its store formats include 134 multi-department stores, 2,273 combo stores, 191 marketplace stores, and 121 price-impact warehouse stores. Kroger operates 33 manufacturing plants, 1,642 supermarket fuel centers, 2,254 pharmacies, 225 The Little Clinic in-store medical clinics, and 127 jewelry stores (782 convenience stores were sold to EG Group in 2018). Kroger's headquarters are located in downtown Cincinnati.\nThe Kroger Company is the largest supermarket operator in the U.S. by revenue and the country's fifth-largest general retailer. The company is one of the largest American-owned private employers in the United States. Additionally, Kroger is ranked No. 25 on the Fortune 500 rankings of the largest U.S. corporations by total revenue. Some sources list the company as a dividend-paying stock.\nAbout two-thirds of Kroger's employees are represented by collective bargaining agreements, with most being represented by the United Food and Commercial Workers (UFCW).\n\nHistory\nEarly history (1883 to 1950s)\nIn 1883, 23-year-old Bernard Kroger, the fifth of ten children of German immigrants, invested his life savings of $372 (equivalent to $12,554 in 2024) to open a grocery store at 66 Pearl Street in downtown Cincinnati. He ran his business with a simple motto: \"Be particular. Never sell anything you would not want yourself.\" He experimented with marketing products his company had produced so that his customers would not need to patronize separate stores and farms.\nIn 1884, Kroger opened his second store. By 1902, Kroger Grocery and Baking Company had been incorporated. By this time, the company had grown to forty stores, with annual merchandise sales of $1.75 million. In addition, Kroger became the first grocery chain to have its own bakery.\nIn 1916, Kroger company began using self-service shopping. Before this, all articles were kept behind counters. Customers would ask for them, then clerks would deliver them to customers.\nIn 1929, it was rumored that Safeway would merge with Kroger. Kroger announced in 2022 that it would acquire Safeway's parent company, Albertsons, but in December 2024 the merger fell through when a federal judge blocked the merger and Albertsons backed out of the deal. By the end of the 1920s, Kroger, through its acquisition of smaller chains, controlled more than 5,500 stores, mainly in the Midwest and South.\nIn the 1930s, Kroger Grocery and Baking Company became the first grocery chain to monitor product quality and to test foods offered to customers. It also became the first company with a store surrounded on all four sides by parking lots. In 1932, the company tested a pilot project after it opened a grocery store in Indianapolis. The facility, which was surrounded by a 75-car parking space, allowed the company to determine the close relationship between parking facilities and gross sales.\n\n1950s and 1960s\nBeginning in 1955, Kroger began acquiring supermarket chains, expanding into new markets. In May, Kroger entered the Houston, Texas, market by acquiring the Houston-based 26-store chain Henke & Pillot. In June, Kroger acquired the Krambo Food Stores, Inc. of Appleton, Wisconsin. In July, it purchased Child's Food Stores, Inc. of Jacksonville, Texas, and operated 25 supermarkets in Texas, Arkansas, and Louisiana.\nIn January 1956, the company bought out Big Chain Stores, Inc., a chain of seven stores based in Shreveport, Louisiana, later combining it with the Childs group. All of these chains adopted the Kroger banner in 1966.\nDuring all the acquisitions, in September 1957, Kroger sold off its Wichita, Kansas, store division, which consisted of 16 stores, to J. S. Dillon and Sons Stores Company, then headed by Ray S. Dillon, son of the company founder.\nIn October 1963, Kroger acquired the 56-store chain Market Basket, providing them with a foothold in the lucrative southern California market. Prior to this time, Kroger had no stores west of Kansas. Kroger, however, failed to make significant headway, only managing a 5 percent market share. By 1982, it withdrew from the California market.\nKroger opened stores in Florida under the SupeRx and Florida Choice banners from the 1960s until 1988, when the chain decided to exit the state and sold all of its stores; Kash n' Karry bought the largest share. The company also exited the Washington, D.C., market in 1966 after it sold its stores to another grocery chain operating in the area.\nIn 1967, the first bar code scanner was introduced in a Kroger supermarket in Cincinnati, Ohio. The adoption of this technology, however, was slow until the 1990s when supermarkets converted to its use.\n\n1970s\nIn the 1970s, Kroger became the first grocer in the United States to test an electronic scanner and the first to formalize consumer research.\nAlthough Kroger has long operated stores in the Huntsville-Decatur area of northern Alabama (as a southern extension of its Nashville, Tennessee, region), it has not operated in the state's largest market, Birmingham, since the early 1970s, when it exited as a result of intense competition from Winn-Dixie and local chains Bruno's Supermarkets and Western Supermarkets.\nKroger built an ultra-modern dairy plant (Crossroad Farms Dairy) in Indianapolis in 1972. At the time, it was considered the largest dairy plant in the world.\nKroger exited the Chicago market in 1970, selling its distribution warehouse in Northlake, Il. and 24 stores to the Dominick's Finer Foods grocery chain.\nKroger exited the Minneapolis–Saint Paul area in 1970, selling 16 stores to Quality Foods, which rebranded the stores to Piggly Wiggly.\nKroger exited Milwaukee in 1972, selling a few stores to Jewel. Kroger would later return in 2015 upon its acquisition of Roundy's.\nKroger entered the Charlotte market in 1977 and expanded rapidly throughout the 1980s when it bought some stores from BI-LO. However, most stores were in less desirable neighborhoods and did not fit in with Kroger's upscale image. Less than three months after BI-LO pulled out, that company decided to re-enter the Charlotte market, and in 1988, Kroger announced it was pulling out of the Charlotte market and put its stores up for sale. Ahold bought Kroger's remaining stores in the Charlotte area and converted them to BI-LO.\nIn 1978, sixteen retail members of Parkview Markets Inc., filed an anti-trust lawsuit against Kroger.\n\n1980s\nKroger had a number of stores in the Western Pennsylvania region, encompassing Pittsburgh and surrounding areas from 1928 until 1984 when the U.S. began experiencing a severe economic recession. The recession had two significant and related effects on Kroger's operations in the region. One of them was that the highly cyclical manufacturing-based economy of the region declined in greater proportion than the rest of the U.S., which undercut demand for the higher-end products and services offered by Kroger. \nKroger sought wage rollbacks in several areas during this time period including in Western Pennsylvania, Eastern Ohio, the West Virginia Panhandle and Michigan. The second effect of the economic recession was to worsen labor-management relations, causing a protracted labor strike in 1983 and 1984. During the strike, Kroger withdrew all of its stores from the Western Pennsylvania market, including some recently opened \"superstores\" and \"greenhouses\", selling these stores to Wetterau (now part of SuperValu), who promptly flipped the stores to independent owners while continuing to supply them under the FoodLand and Shop 'n Save brands. Kroger's exit ceded the market to lower-cost, locally owned rivals, most notably Giant Eagle and the SuperValu-supplied grocers. (Kroger purchased Eagle Grocery company, whose founders went on to create Giant Eagle.) Kroger still maintains a presence in the nearby Morgantown, West Virginia, Wheeling, West Virginia, and Weirton, West Virginia/Steubenville, Ohio, areas where Giant Eagle has a much smaller presence and the SuperValu-supplied stores are virtually nonexistent, though in all of these cases, Walmart remains a major competitor, with Aldi and IGA affiliate Reisbeck’s Food Market.\nKroger entered the San Antonio, Texas, market in 1980 but pulled out in mid-1993. On June 15, 1993, the company announced the closure of its 15 area stores. From 1984 to 1986, Kroger exited the Pittsburgh, Cleveland, Akron, and St. Louis markets. The company cited that higher wages for union employees made it unable to compete.\nThe chain closed several stores around Flint, Michigan, in 1981, which were converted by local businessman Al Kessel to a new chain called Kessel Food Markets. Kroger bought most of these stores back in 1999 and began reverting them. Several other Michigan stores were sold to another Flint-based chain, Hamady Brothers, in 1980. The Hamady acquisition was short-lived.\nIn 1982, Kroger sold the 65-store Market Basket chain it had operated for several years in southern California. The stores were reverted to the Boys Markets branding, after acquiring the chain. Boys Markets was acquired by the Yucaipa Companies in 1989. When Yucaipa acquired Ralphs, the Boys brand disappeared.\nIn 1983, The Kroger Company acquired Dillon Companies grocery chain in Kansas along with its subsidiaries (King Soopers, City Market, Fry's and Gerbes) and the convenience store chain Kwik Shop. David Dillon, a fourth-generation descendant of J. S. Dillon, the founder of Dillon Companies, became the CEO of Kroger.\nIn northeastern Ohio, Kroger had a plant in Solon, Ohio, until the mid-1980s. When that plant shut down, Kroger closed its northeastern Ohio stores in the Cleveland, Akron, and Youngstown areas. Some of those former Kroger stores were taken over by stores like Acme Fresh Markets, Giant Eagle, and Heinens.\nKroger opened and had about 50 stores in St. Louis until it left the market in 1986, saying that its stores were unprofitable. Most of its stores were bought by National, Schnucks, and Shop 'n Save. Most of the remaining Kroger stores in eastern Missouri and west-central Illinois became a western extension of the Central Division (headquartered in Indianapolis).\nKroger also experienced a similar withdrawal from Chattanooga, Tennessee, in 1989. Many of these stores were sold to the local grocery chain Red Food, which was in turn bought by BI-LO in 1994. Today, Chattanooga is the only metropolitan market in Tennessee in which Kroger does not operate with the nearest location being Dalton, Georgia, with 2 stores (Walnut Avenue and Cleveland Highway).\n\n1990s\nIn the 1990s, Kroger acquired Great Scott (Detroit), Pay Less Food Markets, Owen's Market, JayC Food Stores, and Hilander Foods. Additionally, the Houston market was strengthened when Kroger bought several stores from AppleTree Markets, which were former Safeway stores in early 1994.\nIn 1998, Kroger merged with the then fifth-largest grocery company Fred Meyer, along with its subsidiaries, Ralphs, QFC, and Smith's.\nIn the late 1990s, it acquired many stores from A&P as it exited many markets in the South.\nKroger also swapped all ten of its Greensboro, North Carolina-area stores in 1999 to Matthews, North Carolina-based Harris Teeter, for 11 of that company's stores in central and western Virginia. Kroger in turn would acquire Harris Teeter 15 years later.\n\n2000s\nLong the dominant grocer in western Virginia, Kroger entered the Richmond, Virginia, market in 2000, where it competes against market leaders Martin's (including former Ukrop's stores) and Food Lion. Kroger entered the market by purchasing Hannaford stores that either already existed or were being built in Richmond. Hannaford purchases also included the competitive Hampton Roads market, where it now competes with Farm Fresh, Harris Teeter (which is owned by Kroger), and Food Lion. The Hannaford locations in these markets were purchased from Delhaize by Kroger as a condition of Delhaize's 2000 acquisition of the Hannaford chain, which had previously competed against Food Lion, also owned by Delhaize. Walmart Supercenters are also major competitors in both markets, and the chain briefly competed against Winn-Dixie, which has now exited Virginia.\nIn 2001, Kroger acquired Baker's Supermarkets from Fleming Companies, Inc.\nAlbertsons exited the San Antonio and Houston markets in early 2002, selling many of the Houston stores to Kroger.\nIn 2004, Kroger bought most of the old Thriftway stores in Cincinnati, Ohio, when Winn-Dixie left the area. These stores were reopened as Kroger stores.\nIn 2007, Kroger acquired Scott's Food & Pharmacy from SuperValu Inc., and in the same year, also acquired 20 former Michigan Farmer Jack locations from A&P when A&P exited the Michigan Market.\n\nIn 2008, Kroger began a partnership with Murray's Cheese of New York City. Murray's Cheese counters within Kroger stores sell various artisanal cheese from all parts of the world.\n\n2010s\nOn July 9, 2013, Kroger announced that it would acquire the 212 stores of Charlotte-based Harris Teeter in a deal valued at $2.5 billion and that it would assume $100 million in the company's outstanding debt. Harris Teeter's stores are in eight Southern states, with a major portion of them in its headquarters state of North Carolina. Doing so, Kroger acquired Harris Teeter's click-and-collect program, which allows online ordering of groceries. Some industry experts saw this as a competitive move against online grocers such as AmazonFresh. The Harris Teeter acquisition marked Kroger's return to the Charlotte market after a 25-year absence. It also allowed Kroger to enter Asheville for the first time. Charlotte and Asheville had been the only large markets in North Carolina where Kroger had no presence.\nIn 2013, Kroger announced that the spouses of the company's unionized workers would no longer be covered by the company's insurance plan. The company cited the Patient Protection and Affordable Care Act as a prime reason for the move. The benefit cut affected roughly 11,000 workers in Indiana. The company announced in April 2013 that full-time employees would maintain their health insurance benefits. In 2013, Kroger was noted for carrying 17 out of 22  Red List species, four of which are in the top list of said species.\nOn February 11, 2014, Kroger announced it would acquire YOU Technology, a digital coupon/identity company founded by Ajay Amlani, that pioneered the ability for shoppers to load digital coupons onto their loyalty card profiles. It also specialized in being one of the earliest companies to use AI/ML to personalize digital coupons to shoppers based on their past purchase history and intent to buy. The company enabled the loading of billions of coupons  and singlehandedly drove the demise of paper coupons. It was later sold to by Kroger to Inmar with a $565 million price disclosed. \nOn March 3, 2015, Kroger announced it would enter Hawaii, having registered with the state as a new business in February 2015. Kroger was planning to expand to Hawaii in 2006 but withdrew after it had already submitted registration. Kroger, which is in the process of looking for locations to open its first store, will face competition from Honolulu-based rivals Foodland and Times; major retailers Safeway, Walmart, and Costco; Japanese-owned Don Quixote; and Department of Defense-owned DeCA Commissaries.\nOn May 1, 2015, Kroger announced the acquisition of the seven-store Hiller's Market chain in Southeast Michigan, and that it would operate all but one of those stores under the Kroger banner.\nIn June 2015, Kroger eliminated the Harris Teeter brand from the crowded Nashville, Tennessee, market, where its growth had been stunted by aggressive competition since it entered with six stores in the early 2000s. Kroger has traditionally had a market-leading presence in Nashville and initially promised to keep the five remaining Harris Teeter stores open when it acquired the chain, but the market \"did not support Harris Teeter's future business plans\". Two Harris Teeter stores were closed outright, and three closed temporarily while being converted to the Kroger brand (one of these would undergo a major remodeling and replace a neighboring Kroger store).\nOn November 11, 2015, Kroger and Roundy's announced a definitive merger, bringing Roundy's chain's 166 primarily Wisconsin-based chains under Kroger ownership. The merger is valued at $800 million, including debt. The acquisition, which brought Kroger back to Wisconsin after a 43-year absence, will retain the Roundy's, Pick 'n Save, Mariano's, Metro Market and Copps names, along with its Milwaukee operations. (Within a year-and-a-half, however, Kroger had rebranded all Copps locations to the Pick 'n Save banner.)\nIn April 2016, Kroger announced that it had made a \"meaningful investment\" in the Boulder, Colorado-based Lucky's Market, an organic foods supermarket chain that operated 17 stores in 13 states throughout the Midwest and Southeast United States.\nIn February 2017, Kroger withstood large community protests after announcing the closing of two smaller-sized Louisville-area stores.\nDespite high store volumes and high population densities, the Old Louisville (lease expiration) and Southland Terrace stores closed.\nOn February 7, 2017, it was announced that Kroger Co. had purchased Murray's Cheese.\nAs of 14 February 2017, Kroger is no longer offering a discount to senior citizens 59 and up.\nOn May 1, 2017, Kroger, along with the University of Kentucky and UK Athletics, sports and campus marketing partner JMI Sports, announced a 12-year, $1.85 million per year campus marketing agreement. Included in the agreement is the naming rights to Commonwealth Stadium, the university's football stadium, which will be renamed Kroger Field. This agreement makes the University of Kentucky the first school in the Southeastern Conference to enter into a corporate partnership for the naming rights to their football stadium.\nOn May 10, 2017, Kroger opened its first convenience store in Blacklick, Ohio, labeled \"Fresh Eats MKT\". The new prototype stores will have about 12,000 square feet (1,100 square meters) of space, and will be very similar to the Walmart Neighborhood Market project, as these stores only sell food. These stores have a Starbucks, and a Kroger Pharmacy. On June 1, 2017, Kroger opened their second Fresh Eats. Kroger is also going to convert some Turkey Hill stores into the concept store. The CFO, Mike Schlotman, has called these stores a \"small test.\" Local reaction to this new concept has been positive. The concept was discontinued in March 2020.\nIn February 2018, Kroger announced that it will be selling its 762 convenience stores to EG Group, a British service station operator, for $2.15 billion. They operate under the Turkey Hill, Loaf 'N Jug, Kwik Shop, Tom Thumb and Quik Stop banners. Kroger will retain just over 20 convenience stores.  Kroger's supermarket fuel centers are not included in the sale. The sale was closed on April 20, 2018.\nOn April 10, 2018, Kroger announced plans to hire an estimated 11,000 new employees. An estimated 2,000 managerial positions will be filled by the new hires. With the addition of these new hires, the total number of people employed by the company is close to half a million.\nOn May 17, 2018, Kroger announced a partnership with Ocado, a UK-based online supermarket. The partnership is designed to improve Kroger's ecommerce program, including online ordering, automated fulfillment, and home delivery via the construction of 20 new, automated fulfillment centers. The first of these fulfillment centers, located in Monroe, Ohio, opened in April 2021. As of September 2023, eight total fulfillment center locations have been constructed and opened, with additional locations in Groveland, Florida, Forest Park, Georgia, Pleasant Prairie, Wisconsin, Dallas, Texas, Romulus, Michigan, Aurora, Colorado, and Frederick, Maryland. Each fulfillment center also operate in conjunction with several \"spoke\" facilities, which assist to further extend the capable range of delivery. As of September 2023, the latest \"spoke\" facility to be opened is located in Johnstown, Colorado. Kroger has taken advantage of its investment in online shopping capability to grow rapidly during the pandemic. In 2020, Kroger's online sales grew by 116%, to over $10B annually.\nOn May 24, 2018, Kroger announced they were acquiring Home Chef for $200 million with an additional $500 million in incentives if certain targets are met by Home Chef.\nOn June 13, 2018, Kroger Mid-Atlantic announced the Kroger branding will be leaving the Raleigh-Durham area by eliminating all 14 Kroger-branded stores, eight of which will transition to Harris Teeter (also owned by Kroger). One will become a Crunch Fitness and another will become a Food Lion. The fate for the remaining four stores is unclear.\nIn July 2018, Kroger officials backed off a Net 90 payment plan to the produce industry.\nIn October 2018, Kroger announced online wine delivery to 14 states in partnership with DRINKS. Customers can select assorted wines in 6-bottle or 12-bottle packs.\nOn December 4, 2018, Kroger announced a deal to sell food inside drugstore Walgreens. Kroger Express will offer meal kits and other meal solutions.\nIn the light of increased self-checkout usage via kiosk or smartphone app in 2019, Kroger is gradually shifting towards creating more self-checkout smartphone apps and lanes than cashier lanes. The company has been investing millions of dollars, in replacing many cashier stations with automation by 2023. As many other supermarkets (such as Walmart and Target) are also shifting towards automation, and displacing cashiers in the near future.\nIn March 2019, Kroger announced it was expanding its service with robotics company Nuro to Houston, Texas, with Nuro's autonomous Priuses.\nIn August 2019, Kroger began charging customers between $0.50 and $3.50 for receiving cash back while making purchases with debit cards. The new fees were first test marketed in March at Kansas area Dillons stores, a Kroger-owned supermarket chain, before the new fees were rolled out to other Kroger-owned supermarket banners in the rest of the nation.\nIn September 2019, Kroger announced a partnership with the Plant Based Food Association (PFBA) to test a plant-based meat retail concept in 60 stores in Denver, and parts of Indiana and Illinois.\nIn November 2019, Kroger unveiled an updated logo for their stores and company, with the '\"Fresh For Everyone\" tagline and the \"Krojis\". The company also announced an expansion of its online wine delivery program into Arizona. In partnership with DRINKS, the service is now available in 19 states plus Washington D.C.\nIn December 2019, Kroger was named the second-largest grocer in the nation with $110 billion in 2016 sales. The same month, USA Today listed Kroger—and its brands—as the top supermarket (based on Google searches, Yelp data, and 24/7 Tempo's research) in Alaska, Indiana, Kentucky, Mississippi, Ohio, Oregon, Tennessee, Virginia, Washington, and West Virginia.\n\n2020s\nAccording to a PBS NewsHour February 13, 2021 broadcast, during the pandemic, Kroger provided their essential workers with a hazard pay, which the company called \"hero pay.\" The hero pay consisted of a raise of US$2 an hour from the end of March 2020 until May 2020, when the hero pay ended. In January 2021, the Long Beach City Council in California passed an ordinance making it mandatory for some large grocery stores—like Kroger—to provide their essential workers with a hazard pay increase of US$4 an hour \"effective immediately for 120 days\". The ordinance affected companies with \"more than 300 workers nationwide and more than 15 employees per store\".\nSeattle and Washington passed similar ordinances. In response, in early February, Kroger announced the closure and permanent termination of the entire operations of some of their stores—including a Ralphs and a Food4Less in Long Beach—\"for economic reasons including the economic cost mandated by the Long Beach ordinance requiring an increase in employee wages, four dollars an hour\". Kroger closed two Seattle QFC stores in April 2021 blaming that City's Covid Related Hazard Pay Law. The United Food and Commercial Workers (UFCW), with members whose jobs had been terminated, viewed the closures as a \"warning to other cities considering hazard pay mandates\".\nAndrea Zinder, president of the UFCW Local 324 that represents employees at the two Long Beach stores—Ralphs and a Food4Less—said that compared to the same time period in 2019 both stores saw an increase of about 30% in sales. In 2020, during the pandemic, Kroger's earnings increased by 87.7%. Kroger's quarterly revenues as reported by November 20, 2020, were US$29.72 billion, and the corporation's per-share earnings and dividends grew at a rapid rate in 2020. Its dividend increase was about 14% annually.\nStarting in early 2020, Berkshire Hathaway began buying shares of Kroger, and by August 2021 became a top ten shareholder.\nIn July 2021, a wrongful-death lawsuit was filed against Kroger by the family of worker Evan Seyfried. Seyfried committed suicide after allegedly enduring abuse at the Kroger location in Milford, Ohio, where he had worked for 19 years. According to the lawsuit, Seyfried was bullied for wearing a mask in the early days of the pandemic and taunted for his political views. Also on the receiving end of alleged workplace sabotage, one of Seyfried's co-workers called the company's ethics helpline and reported that she and Seyfried were being bullied. However, no action was taken. In December 2021, Kroger Co. announced the elimination of some COVID-19 benefits for unvaccinated employees.\nIn 2021, the company was reported to have been breached by a third-party hack which compromised the pharmacy records of Kroger owned Fred Meyer and QFC stores' customers.\nIn April 2021, Kroger sold what were previously Fred Meyer properties located in Shoreline, Puyallup and Tacoma to Benderson Development Company for a combined $98.7 million. In May 2021, Benderson Development bought an additional twenty-eight Fred Meyer properties (as part of a \"sale-leaseback investment\") for an estimated $500 million as part of a sale totaling 380 acres and 4.5 million square feet of retail space.\nOn August 2, 2021, Kroger announced that it had elected Elaine Chao to its board of directors. Chao was formerly Secretary of Labor under President George W. Bush and Secretary of Transportation under President Donald Trump. The news was met with backlash from a small number of Kroger customers on Twitter, with calls for a boycott trending nationally due to her ties to the Trump administration and to her husband, Mitch McConnell.\nOn September 23, 2021, a mass shooting occurred at a Kroger location in Collierville, Tennessee. One person was killed and 13 others were injured before the gunman, identified as 29-year-old Uk Thang, committed suicide by gunshot. Thang was working at the store as a third-party vendor. In the aftermath of the shooting, Kroger offered counseling services for its employees and closed down the store until November 10.\nIn September 2021, Kroger tweaked its logo to add the \"Fresh Cart\" symbol. The symbol is an abstract shopping cart with the basket represented as citrus slices.\nIn October 2021, Kroger announced an expansion into South Florida with its online delivery service, Kroger Delivery. To do this, Kroger will build two new automated fulfilment centers assisted and facilitated by the UK-based technology company Ocado Group. Kroger Delivery is also set to launch in the Northeast of the US and expand its operations in California, to be followed by sites in Texas, Georgia, Maryland, Wisconsin, Michigan, Arizona, and North Carolina. The company launched its online delivery services in Central Florida earlier in 2021.\nOn April 5, 2022, Kroger launched Kroger Restaurant Supply in the Dallas-Ft. Worth area, a new business distributing food and related supplies to restaurants, bakeries, and catering companies. For Kroger, this move into foodservice distribution represents an expansion beyond its core retail grocery operations.\nOn October 14, 2022, Kroger announced a merger with Albertsons in a deal worth $24.6 billion, combining both companies into one entity but divesting some stores to C&S Wholesale Grocers to secure regulatory approval.   However, in January 2024, Washington state sued to block the proposed $25 billion merger between Kroger and Albertsons, warning that if approved it could raise prices and harm consumers. In February 2024, Colorado Attorney General Phil Weiser also filed a lawsuit, saying consumers told him they feared it \"would lead to stores closing, higher prices, fewer jobs, worse customer service, and less resilient supply chains.\" In February 2024, the FTC sued to block the acquisition stating that the deal would negatively impact consumer prices and workers' wages.\nA 2022 Economic Roundtable survey of 10,000 Kroger's workers in Colorado, Southern California, Washington found that wages have declined over the last several years while over the same period executive pay has increased. The survey found that over 75% of workers experience food insecurity, over 66% struggle to meet basic needs and 14% experience homelessness, while CEO Rodney McMullen made over $22 million in 2020, compared to $12 million for the year 2018. According to Peter Dreier, who participated in the project: \"There are workers sleeping in RVs or couch surfing or living in parks somewhere. Americans go to their local supermarket every week and smile at the person cashing them out, not aware that the person they're talking to is going to sleep in a car after they clock out.\" About two-thirds of Kroger employees are part-time workers, whose schedules often change making it difficult to take a second job.\nIn March 2024, Kroger announced the closure of facilities servicing the Miami, San Antonio, and Austin regions, marking the end of their delivery service in those regions.\nOn July 9, 2024, Kroger released the complete list of 579 stores that would be divested in order to satisfy anti-trust concerns from the Federal Trade Commission. Within the list of stores being proposed for divestment, the Dallas market would be the most affected, with 26 Albertsons locations being sold which includes the Tom Thumb chain and six Market Street locations. Following the announcement, the United Food and Commercial Workers made a statement saying that they will continue to oppose the merger and that Kroger's announcement \"changes nothing\". In December, 2024, a U.S. district judge ruled against the proposed merger, stating that it would be bad for consumers and employees.\nIn November 2025, Kroger announced it would be closing distribution facilities in Groveland, Florida, Pleasant Prairie, Wisconsin, and Frederick, Maryland. As a result of the closures, Kroger is ending its delivery service in Florida and almost entirely leaving the state, while expanding its partnerships with Instacart, DoorDash, and Uber in other locations.\n\nBusiness trends\nChains\nKroger Marketplace\nKroger Marketplace is a chain of hypermarkets. The brand was introduced in 2004 in the Columbus, Ohio, area, which lost the Big Bear and Big Bear Plus chains in Penn Traffic's Chapter 11 bankruptcy. The Kroger Marketplace format is based on the Fry's Marketplace stores that the Arizona division of Kroger is currently operating. There are currently a total of 188 marketplaces.\nSimilar to rival chains Meijer, Kmart, Target, Walmart, and Albertsons; the stores are modeled after Kroger-owned Fred Meyer which house multiple departments. In addition to the grocery department, stores typically include a Fred Meyer Jewelers, Starbucks, Donatos Pizza, an in-store bank, and sections for toys, appliances, home furnishings as well as bed and bath; a format Big Bear had in their stores in the Columbus area.\nIn 2005, the company began renovating many Kroger Food & Drug stores in Ohio to an expanded and updated look, converting them to the Kroger Marketplace format. In February 2006, Kroger announced plans for two new Kroger Marketplace stores by the end of summer in Cincinnati suburbs Lebanon and Liberty Township. The store in Liberty Township opened in July 2006. On October 5, 2006, a new Kroger Marketplace opened in Gahanna. With the Gahanna opening, the number of Kroger Marketplace stores grew to six, four in the Columbus area and two in the Cincinnati area. Two more stores were planned in 2007, one in Middletown (which opened in April 2007, after the old store was razed and made part of the current parking lot) and one in Englewood.\nIn 2011, the Elder-Beerman in Centerville, Ohio, was demolished, and a new marketplace replaced it. The location has a fuel center and opened on December 8. This marketplace is the largest Kroger store ever built from ground up to date at 147,000 square feet (13,700 square meters).\nTwo more stores opened in the Cincinnati area, in the Northern Kentucky suburbs of Hebron and Walton which were completed in November 2008. Three Kroger Marketplace stores in Kentucky opened in 2009, two in Lexington and one in Newport. Another Marketplace opened in Beavercreek, Ohio. A Mount Orab, Ohio, store opened in the spring of 2010. Kroger opened a new 60,000 sq ft (5,600 m2) store in North Augusta, South Carolina. In 2015, a 145,000 sq ft (13,500 m2) Marketplace was opened in the Cincinnati suburb of Oakley.\nThe first Kroger Marketplace store in Tennessee opened in Farragut, Tennessee (a suburb of Knoxville), at the end of 2008, and a second store in Thompson's Station, Tennessee, about 20 miles (32 km) south of Nashville, opened in early 2009. A third location opened in Gallatin, Tennessee, on March 11, 2010.\n\nThe first Kroger Marketplace store in Texas opened on October 9, 2009, in the Waterside Marketplace in Richmond, Texas. The second Kroger Marketplace store in Rosenberg, Texas, opened on December 4, 2009. The third opened in Frisco, Texas, in early 2010. The fourth, in Willis, Texas, opened on August 11, 2011. Other Kroger Marketplace stores in Texas are in Little Elm, Texas; Fort Worth's Alliance Town Center; Mansfield; Wylie, Texas; and Baytown, Texas.\nThe first Kroger Marketplace in Arkansas opened in August 2010 on Chenal Parkway in Little Rock, Arkansas. Locations also opened in 2012 in Conway, Arkansas and 2014 in Jonesboro, Arkansas.\nThe first Kroger Marketplace in Indiana opened on September 29, 2011, on Dupont Road on Fort Wayne's northwest side. This store is a rebuilt Kroger Food & Drug. A second Kroger Marketplace opened on October 4, 2012, from a rebuilt Scott's Food and Pharmacy in the Village at Coventry on the southwest side of Fort Wayne. These two stores are part of a $100 million expansion project in the Fort Wayne area. In October 2016, it was announced that a Kroger Marketplace will open in La Porte, Indiana, within the NewPorte Landing development. Construction of the new 123,000-square-foot (11,400-square-meter) store is expected to begin early in 2018.\nThe first Kroger Marketplace in Virginia opened on Midlothian Turnpike in Richmond, Virginia, on the site of the former Cloverleaf Mall on December 6, 2012. Another Marketplace opened in Virginia Beach, Virginia, at the site of a former Super Kmart, on July 31, 2013.  The third location opened in December 2013 in the Staples Mill shopping Center in Henrico County.  A fourth location opened on October 15, 2014, in Portsmouth, Virginia, at the site of the former I.C. Norcom High School.\nThe first Kroger Marketplace in Michigan opened on June 14, 2013, at Sterns and Secor Roads in Lambertville (a suburb north of Toledo, Ohio). Formerly a conventional Kroger store, the square footage (square meterage) increased from 68,000 to 133,000 square feet (6,300 to 12,400 square meters). It carries toys, home essentials, apparel and shoes in addition to groceries. The state's second store opened in 2014 in Shelby Township on property that already contained a 2010-built Fuel Center, replacing a smaller Kroger store across Hayes Road in neighboring Macomb Township, which was soon converted into an Emagine Entertainment movie theater.  Three further locations opened in 2016, one in White Lake.\nThe first Kroger Marketplace in Mississippi opened on September 16, 2016, in Hernando (a suburb of Memphis, Tennessee) to much fanfare. This store was formally a Kroger Food & Drug with twelve aisles, now rebuilt with sixty-four, in addition to having a Starbucks, ClickList, and expanded deli inside.\nThe first Kroger Marketplace store in Alabama opened in Huntsville, Alabama in 2017.\n\nManufacturing and distribution\nDistribution and logistics\nFood distribution and buying takes place under various subsidiaries and divisions. These include:\n\nKroger Group Cooperative, Inc.\nKroger Group, Inc.\nPeytons\nWESCO\nInter-American Products\nKroger operates its own fleet of trucks and trailers to distribute products to its various stores, in addition to contracts with various trucking companies. In June 2018, Kroger announced testing driverless cars for delivering groceries. For this, Kroger is partnering with autonomous car company Nuro.\nIn addition to stocking a variety of regional brand products, The Kroger Company also employs one of the largest networks of private label manufacturing in the country. Thirty-three plants (either wholly owned or used with operating agreements) in seventeen states create about 40% of Kroger's private label products. Similar to most major supermarket retailers, Kroger uses a three-tiered private label marketing strategy. One private brand emphasizes no-frills products at the lowest possible price, another is intended to be comparable to leading national brands but a better value and the third is a premium (often organic) brand.\n\nPrivate label brands\nKroger offers a collection of its own branded products, referred to by the retailer as \"Our Brands\". The products are produced and sold in quality tiers, and account for over 30% of the retailer's unit sales.\n\nBanner Brand\nBanner Brand items are goods that bear the name of Kroger or its subsidiaries (i.e., Ralphs, King Soopers, etc.) or make reference to them (i.e., Big K), and are offered exclusively within Kroger-owned stores. These products are marketed to customers as budget-friendly, and account for over $13 billion in annual sales. Many of Kroger's health and beauty goods, one of the company's fastest-growing private label categories, are manufactured by third-party providers; these products include goods like ibuprofen and contact lens solution.\n\nPrivate Selection\nProducts marked Private Selection are offered to compare with gourmet brands or regional brands that may be considered more upscale than the standard Kroger brand products.\n\nSimple Truth\nSimple Truth is Kroger's flagship natural and organic brand, and has grown quickly since its launch in 2012. The brand's launch marked the first time Kroger had delved into making its own gluten-free products, including flour mixes, bread, etc. The Simple Truth brand became the first Kroger offering to be introduced in China, on Alibaba's Tmall platform. Simple Truth reached $2 billion in annual sales in 2018.\n\nSmart Way\nSmart Way is Kroger's budget-priced private label line that includes around 150 products. This line, which launched in two waves starting in September 2022, consolidates 16 legacy brands at a \"new opening price-point.\"\n\nOther private label brands\nIn addition to its core brands, Kroger's manufacturing creates a variety department-specific brands. These are featured especially in Fred Meyer stores, where more than half the goods sold are non-food, or in the smaller Fred Meyer-based Marketplace stores. The brands listed below may be found in various Kroger-owned stores.\n\nAbound – natural pet food\nBakery Fresh Goodness – fresh-baked foods\nBloom Haus – floral arrangements\nComforts – baby products\nDip – fast fashion brand designed by Joe Mimran\nEveryday Living – home goods\nHD Designs – upscale home goods\nHemisFares – imported foods\nHome Chef – meal kit and food delivery company acquired in 2018\nKroger Mercado – Hispanic-inspired food products\nLuvsome – pet food\nMurray's Cheese – artisanal cheese shop founded in Greenwich Village in 1940\nOfficeWorks – stationery and office supplies\nPet Pride – pet food\n\nOther operations\nPharmacy Group\nKroger previously owned and operated the SupeRx drug store chain. In 1985, Kroger outbid Rite Aid for the Hook's Drug Stores chain, based in Indianapolis, Indiana, and combined it with SupeRx to become Hook's-SupeRx. In 1994, Kroger decided to exit the stand-alone drugstore business and sold its Hook's and SupeRx stores to Revco, which later was sold to CVS.\nToday, Kroger operates 2,252 pharmacies, most of which are located inside its supermarkets. The Kroger Pharmacies continue as a profitable portion of the business and have been expanding to now include pharmacies in City Market, Dillons, Fred Meyer, Fry's, King Soopers, QFC, Ralphs, Harris Teeter, Smith's Food and Drug, and Kroger Supermarkets.\n\nSupermarket Petroleum Group\nSince 1998, Kroger has added fuel centers in the parking lots of its supermarkets. More recently, the company has begun opening standalone fuel centers, often near stores whose parking lots could not accommodate a fuel center. As of Q2 2022, Kroger operated 1,629 supermarket fuel centers.\nIn 2006, Kroger introduced a new common logo for all of its convenience store chains that is now also used at the fuel centers of all of its supermarket chains—a rhombus with a white, stylized image of the continental United States in the center bordered by four colored areas: dark blue representing the Pacific Ocean, red representing Canada, green representing the Atlantic Ocean, and yellow representing the Gulf of Mexico. This logo is also still used at the convenience stores that were sold to EG Group in 2018.\n\nKroger Personal Finance\nKroger Personal Finance was introduced in 2007 to offer branded Visa cards, mortgages, home equity loans, pet, renter's and home insurance, identity theft protection, and wireless services. In 2017, MasterCard became the network for Kroger's newly branded 1-2-3 REWARDS credit card issued by U.S. Bank. In 2019, Kroger banned the use of Visa credit cards (but not debit cards) at two of its subsidiary chains: Foods Co. Supermarkets and Smiths, citing rising costs from premium cards.\n\nKroger Wireless\nKroger Wireless, formerly known as i-wireless, is a national private label wireless service provider sold in over 2,200 retail locations within the Kroger family of stores across 31 states.  Kroger Wireless service functions over the nationwide T-Mobile network. Customers can choose from \"Unlimited\" rate plans including unlimited talk/text and with data allotments up to and including unlimited data. Kroger Wireless allows customers to purchase phones at select Kroger store locations, via their website, or by bringing their eligible T-Mobile device for activation.\n\n84.51°\n84.51° is a wholly owned subsidiary of Kroger engaged in data science and consumer insights, created in April 2015, as a result of Kroger purchasing the remaining half of its then-joint venture Dunnhumby USA from Tesco.\n\nControversies\nPricing discrepancies and overcharges\nIn 2025, an investigation by The Guardian, Consumer Reports, and the Food & Environment Reporting Network revealed widespread overcharging at Kroger stores across multiple states due to expired sale tags leading to higher prices at checkout. Tests in 26 stores across 14 states and Washington, D.C., identified over 150 items with expired sale tags, averaging a $1.70 overcharge per item, or 18% above the advertised sale price. In Colorado, union tests at over 30 King Soopers stores found more than 300 expired tags, with overcharges averaging nearly 15%. An internal Kroger audit at one western U.S. store reported approximately 6% of price tags were incorrect, exceeding the company’s 1% error threshold. The investigation, supported by customer complaints and union reports, linked the issue to chronic understaffing, with expired tags remaining on shelves for weeks. Kroger denied systemic pricing issues, asserting that errors were a small fraction of billions of annual transactions and emphasizing regular audits to ensure pricing accuracy.\n\nAnimal welfare\nIn 2017, Kroger announced that it would transition to 100% cage-free eggs by 2025, responding to pressure from animal welfare groups. In 2022, they loosened the commitment, aiming instead for 70% cage-free eggs by 2030.\n\nReferences\nFurther reading\nThe Kroger story: A century of innovation by George Laycock, The Kroger Company, Cincinnati, Ohio. 1983, 143p.\nPhillips, Charles F. (Winter 1936). \"A History of the Kroger Grocery & Baking Company\". National Marketing Review. Vol. 1, no. 3. pp. 204–215. JSTOR 4291319.\n\nVideos\n\"Is Amazon Killing Kroger?\". CNBC. February 21, 2019. Archived from the original on December 21, 2021.\n\nExternal links\n \nOfficial website\nBusiness data for Kroger Co:",
  "clean_text": "The Kroger Co., or simply Kroger, is an American retail company that operates (either directly or through its subsidiaries) supermarkets and multi-department stores throughout the United States. Founded by Bernard Kroger in 1883 in Cincinnati, Ohio, the company operates 2,719 grocery stores in 35 states (mostly in the South, Midwest and West) and the District of Columbia. Its store formats include 134 multi-department stores, 2,273 combo stores, 191 marketplace stores, and 121 price-impact warehouse stores. Kroger operates 33 manufacturing plants, 1,642 supermarket fuel centers, 2,254 pharmacies, 225 The Little Clinic in-store medical clinics, and 127 jewelry stores (782 convenience stores were sold to EG Group in 2018). Kroger's headquarters are located in downtown Cincinnati. The Kroger Company is the largest supermarket operator in the U.S. by revenue and the country's fifth-largest general retailer. The company is one of the largest American-owned private employers in the United States. Additionally, Kroger is ranked No. 25 on the Fortune 500 rankings of the largest U.S. corporations by total revenue. Some sources list the company as a dividend-paying stock. About two-thirds of Kroger's employees are represented by collective bargaining agreements, with most being represented by the United Food and Commercial Workers (UFCW). History Early history (1883 to 1950s) In 1883, 23-year-old Bernard Kroger, the fifth of ten children of German immigrants, invested his life savings of $372 (equivalent to $12,554 in 2024) to open a grocery store at 66 Pearl Street in downtown Cincinnati. He ran his business with a simple motto: \"Be particular. Never sell anything you would not want yourself.\" He experimented with marketing products his company had produced so that his customers would not need to patronize separate stores and farms. In 1884, Kroger opened his second store. By 1902, Kroger Grocery and Baking Company had been incorporated. By this time, the company had grown to forty stores, with annual merchandise sales of $1.75 million. In addition, Kroger became the first grocery chain to have its own bakery. In 1916, Kroger company began using self-service shopping. Before this, all articles were kept behind counters. Customers would ask for them, then clerks would deliver them to customers. In 1929, it was rumored that Safeway would merge with Kroger. Kroger announced in 2022 that it would acquire Safeway's parent company, Albertsons, but in December 2024 the merger fell through when a federal judge blocked the merger and Albertsons backed out of the deal. By the end of the 1920s, Kroger, through its acquisition of smaller chains, controlled more than 5,500 stores, mainly in the Midwest and South. In the 1930s, Kroger Grocery and Baking Company became the first grocery chain to monitor product quality and to test foods offered to customers. It also became the first company with a store surrounded on all four sides by parking lots. In 1932, the company tested a pilot project after it opened a grocery store in Indianapolis. The facility, which was surrounded by a 75-car parking space, allowed the company to determine the close relationship between parking facilities and gross sales. 1950s and 1960s Beginning in 1955, Kroger began acquiring supermarket chains, expanding into new markets. In May, Kroger entered the Houston, Texas, market by acquiring the Houston-based 26-store chain Henke & Pillot. In June, Kroger acquired the Krambo Food Stores, Inc. of Appleton, Wisconsin. In July, it purchased Child's Food Stores, Inc. of Jacksonville, Texas, and operated 25 supermarkets in Texas, Arkansas, and Louisiana. In January 1956, the company bought out Big Chain Stores, Inc., a chain of seven stores based in Shreveport, Louisiana, later combining it with the Childs group. All of these chains adopted the Kroger banner in 1966. During all the acquisitions, in September 1957, Kroger sold off its Wichita, Kansas, store division, which consisted of 16 stores, to J. S. Dillon and Sons Stores Company, then headed by Ray S. Dillon, son of the company founder. In October 1963, Kroger acquired the 56-store chain Market Basket, providing them with a foothold in the lucrative southern California market. Prior to this time, Kroger had no stores west of Kansas. Kroger, however, failed to make significant headway, only managing a 5 percent market share. By 1982, it withdrew from the California market. Kroger opened stores in Florida under the SupeRx and Florida Choice banners from the 1960s until 1988, when the chain decided to exit the state and sold all of its stores; Kash n' Karry bought the largest share. The company also exited the Washington, D.C., market in 1966 after it sold its stores to another grocery chain operating in the area. In 1967, the first bar code scanner was introduced in a Kroger supermarket in Cincinnati, Ohio. The adoption of this technology, however, was slow until the 1990s when supermarkets converted to its use. 1970s In the 1970s, Kroger became the first grocer in the United States to test an electronic scanner and the first to formalize consumer research. Although Kroger has long operated stores in the Huntsville-Decatur area of northern Alabama (as a southern extension of its Nashville, Tennessee, region), it has not operated in the state's largest market, Birmingham, since the early 1970s, when it exited as a result of intense competition from Winn-Dixie and local chains Bruno's Supermarkets and Western Supermarkets. Kroger built an ultra-modern dairy plant (Crossroad Farms Dairy) in Indianapolis in 1972. At the time, it was considered the largest dairy plant in the world. Kroger exited the Chicago market in 1970, selling its distribution warehouse in Northlake, Il. and 24 stores to the Dominick's Finer Foods grocery chain. Kroger exited the Minneapolis–Saint Paul area in 1970, selling 16 stores to Quality Foods, which rebranded the stores to Piggly Wiggly. Kroger exited Milwaukee in 1972, selling a few stores to Jewel. Kroger would later return in 2015 upon its acquisition of Roundy's. Kroger entered the Charlotte market in 1977 and expanded rapidly throughout the 1980s when it bought some stores from BI-LO. However, most stores were in less desirable neighborhoods and did not fit in with Kroger's upscale image. Less than three months after BI-LO pulled out, that company decided to re-enter the Charlotte market, and in 1988, Kroger announced it was pulling out of the Charlotte market and put its stores up for sale. Ahold bought Kroger's remaining stores in the Charlotte area and converted them to BI-LO. In 1978, sixteen retail members of Parkview Markets Inc., filed an anti-trust lawsuit against Kroger. 1980s Kroger had a number of stores in the Western Pennsylvania region, encompassing Pittsburgh and surrounding areas from 1928 until 1984 when the U.S. began experiencing a severe economic recession. The recession had two significant and related effects on Kroger's operations in the region. One of them was that the highly cyclical manufacturing-based economy of the region declined in greater proportion than the rest of the U.S., which undercut demand for the higher-end products and services offered by Kroger. Kroger sought wage rollbacks in several areas during this time period including in Western Pennsylvania, Eastern Ohio, the West Virginia Panhandle and Michigan. The second effect of the economic recession was to worsen labor-management relations, causing a protracted labor strike in 1983 and 1984. During the strike, Kroger withdrew all of its stores from the Western Pennsylvania market, including some recently opened \"superstores\" and \"greenhouses\", selling these stores to Wetterau (now part of SuperValu), who promptly flipped the stores to independent owners while continuing to supply them under the FoodLand and Shop 'n Save brands. Kroger's exit ceded the market to lower-cost, locally owned rivals, most notably Giant Eagle and the SuperValu-supplied grocers. (Kroger purchased Eagle Grocery company, whose founders went on to create Giant Eagle.) Kroger still maintains a presence in the nearby Morgantown, West Virginia, Wheeling, West Virginia, and Weirton, West Virginia/Steubenville, Ohio, areas where Giant Eagle has a much smaller presence and the SuperValu-supplied stores are virtually nonexistent, though in all of these cases, Walmart remains a major competitor, with Aldi and IGA affiliate Reisbeck’s Food Market. Kroger entered the San Antonio, Texas, market in 1980 but pulled out in mid-1993. On June 15, 1993, the company announced the closure of its 15 area stores. From 1984 to 1986, Kroger exited the Pittsburgh, Cleveland, Akron, and St. Louis markets. The company cited that higher wages for union employees made it unable to compete. The chain closed several stores around Flint, Michigan, in 1981, which were converted by local businessman Al Kessel to a new chain called Kessel Food Markets. Kroger bought most of these stores back in 1999 and began reverting them. Several other Michigan stores were sold to another Flint-based chain, Hamady Brothers, in 1980. The Hamady acquisition was short-lived. In 1982, Kroger sold the 65-store Market Basket chain it had operated for several years in southern California. The stores were reverted to the Boys Markets branding, after acquiring the chain. Boys Markets was acquired by the Yucaipa Companies in 1989. When Yucaipa acquired Ralphs, the Boys brand disappeared. In 1983, The Kroger Company acquired Dillon Companies grocery chain in Kansas along with its subsidiaries (King Soopers, City Market, Fry's and Gerbes) and the convenience store chain Kwik Shop. David Dillon, a fourth-generation descendant of J. S. Dillon, the founder of Dillon Companies, became the CEO of Kroger. In northeastern Ohio, Kroger had a plant in Solon, Ohio, until the mid-1980s. When that plant shut down, Kroger closed its northeastern Ohio stores in the Cleveland, Akron, and Youngstown areas. Some of those former Kroger stores were taken over by stores like Acme Fresh Markets, Giant Eagle, and Heinens. Kroger opened and had about 50 stores in St. Louis until it left the market in 1986, saying that its stores were unprofitable. Most of its stores were bought by National, Schnucks, and Shop 'n Save. Most of the remaining Kroger stores in eastern Missouri and west-central Illinois became a western extension of the Central Division (headquartered in Indianapolis). Kroger also experienced a similar withdrawal from Chattanooga, Tennessee, in 1989. Many of these stores were sold to the local grocery chain Red Food, which was in turn bought by BI-LO in 1994. Today, Chattanooga is the only metropolitan market in Tennessee in which Kroger does not operate with the nearest location being Dalton, Georgia, with 2 stores (Walnut Avenue and Cleveland Highway). 1990s In the 1990s, Kroger acquired Great Scott (Detroit), Pay Less Food Markets, Owen's Market, JayC Food Stores, and Hilander Foods. Additionally, the Houston market was strengthened when Kroger bought several stores from AppleTree Markets, which were former Safeway stores in early 1994. In 1998, Kroger merged with the then fifth-largest grocery company Fred Meyer, along with its subsidiaries, Ralphs, QFC, and Smith's. In the late 1990s, it acquired many stores from A&P as it exited many markets in the South. Kroger also swapped all ten of its Greensboro, North Carolina-area stores in 1999 to Matthews, North Carolina-based Harris Teeter, for 11 of that company's stores in central and western Virginia. Kroger in turn would acquire Harris Teeter 15 years later. 2000s Long the dominant grocer in western Virginia, Kroger entered the Richmond, Virginia, market in 2000, where it competes against market leaders Martin's (including former Ukrop's stores) and Food Lion. Kroger entered the market by purchasing Hannaford stores that either already existed or were being built in Richmond. Hannaford purchases also included the competitive Hampton Roads market, where it now competes with Farm Fresh, Harris Teeter (which is owned by Kroger), and Food Lion. The Hannaford locations in these markets were purchased from Delhaize by Kroger as a condition of Delhaize's 2000 acquisition of the Hannaford chain, which had previously competed against Food Lion, also owned by Delhaize. Walmart Supercenters are also major competitors in both markets, and the chain briefly competed against Winn-Dixie, which has now exited Virginia. In 2001, Kroger acquired Baker's Supermarkets from Fleming Companies, Inc. Albertsons exited the San Antonio and Houston markets in early 2002, selling many of the Houston stores to Kroger. In 2004, Kroger bought most of the old Thriftway stores in Cincinnati, Ohio, when Winn-Dixie left the area. These stores were reopened as Kroger stores. In 2007, Kroger acquired Scott's Food & Pharmacy from SuperValu Inc., and in the same year, also acquired 20 former Michigan Farmer Jack locations from A&P when A&P exited the Michigan Market. In 2008, Kroger began a partnership with Murray's Cheese of New York City. Murray's Cheese counters within Kroger stores sell various artisanal cheese from all parts of the world. 2010s On July 9, 2013, Kroger announced that it would acquire the 212 stores of Charlotte-based Harris Teeter in a deal valued at $2.5 billion and that it would assume $100 million in the company's outstanding debt. Harris Teeter's stores are in eight Southern states, with a major portion of them in its headquarters state of North Carolina. Doing so, Kroger acquired Harris Teeter's click-and-collect program, which allows online ordering of groceries. Some industry experts saw this as a competitive move against online grocers such as AmazonFresh. The Harris Teeter acquisition marked Kroger's return to the Charlotte market after a 25-year absence. It also allowed Kroger to enter Asheville for the first time. Charlotte and Asheville had been the only large markets in North Carolina where Kroger had no presence. In 2013, Kroger announced that the spouses of the company's unionized workers would no longer be covered by the company's insurance plan. The company cited the Patient Protection and Affordable Care Act as a prime reason for the move. The benefit cut affected roughly 11,000 workers in Indiana. The company announced in April 2013 that full-time employees would maintain their health insurance benefits. In 2013, Kroger was noted for carrying 17 out of 22 Red List species, four of which are in the top list of said species. On February 11, 2014, Kroger announced it would acquire YOU Technology, a digital coupon/identity company founded by Ajay Amlani, that pioneered the ability for shoppers to load digital coupons onto their loyalty card profiles. It also specialized in being one of the earliest companies to use AI/ML to personalize digital coupons to shoppers based on their past purchase history and intent to buy. The company enabled the loading of billions of coupons and singlehandedly drove the demise of paper coupons. It was later sold to by Kroger to Inmar with a $565 million price disclosed. On March 3, 2015, Kroger announced it would enter Hawaii, having registered with the state as a new business in February 2015. Kroger was planning to expand to Hawaii in 2006 but withdrew after it had already submitted registration. Kroger, which is in the process of looking for locations to open its first store, will face competition from Honolulu-based rivals Foodland and Times; major retailers Safeway, Walmart, and Costco; Japanese-owned Don Quixote; and Department of Defense-owned DeCA Commissaries. On May 1, 2015, Kroger announced the acquisition of the seven-store Hiller's Market chain in Southeast Michigan, and that it would operate all but one of those stores under the Kroger banner. In June 2015, Kroger eliminated the Harris Teeter brand from the crowded Nashville, Tennessee, market, where its growth had been stunted by aggressive competition since it entered with six stores in the early 2000s. Kroger has traditionally had a market-leading presence in Nashville and initially promised to keep the five remaining Harris Teeter stores open when it acquired the chain, but the market \"did not support Harris Teeter's future business plans\". Two Harris Teeter stores were closed outright, and three closed temporarily while being converted to the Kroger brand (one of these would undergo a major remodeling and replace a neighboring Kroger store). On November 11, 2015, Kroger and Roundy's announced a definitive merger, bringing Roundy's chain's 166 primarily Wisconsin-based chains under Kroger ownership. The merger is valued at $800 million, including debt. The acquisition, which brought Kroger back to Wisconsin after a 43-year absence, will retain the Roundy's, Pick 'n Save, Mariano's, Metro Market and Copps names, along with its Milwaukee operations. (Within a year-and-a-half, however, Kroger had rebranded all Copps locations to the Pick 'n Save banner.) In April 2016, Kroger announced that it had made a \"meaningful investment\" in the Boulder, Colorado-based Lucky's Market, an organic foods supermarket chain that operated 17 stores in 13 states throughout the Midwest and Southeast United States. In February 2017, Kroger withstood large community protests after announcing the closing of two smaller-sized Louisville-area stores. Despite high store volumes and high population densities, the Old Louisville (lease expiration) and Southland Terrace stores closed. On February 7, 2017, it was announced that Kroger Co. had purchased Murray's Cheese. As of 14 February 2017, Kroger is no longer offering a discount to senior citizens 59 and up. On May 1, 2017, Kroger, along with the University of Kentucky and UK Athletics, sports and campus marketing partner JMI Sports, announced a 12-year, $1.85 million per year campus marketing agreement. Included in the agreement is the naming rights to Commonwealth Stadium, the university's football stadium, which will be renamed Kroger Field. This agreement makes the University of Kentucky the first school in the Southeastern Conference to enter into a corporate partnership for the naming rights to their football stadium. On May 10, 2017, Kroger opened its first convenience store in Blacklick, Ohio, labeled \"Fresh Eats MKT\". The new prototype stores will have about 12,000 square feet (1,100 square meters) of space, and will be very similar to the Walmart Neighborhood Market project, as these stores only sell food. These stores have a Starbucks, and a Kroger Pharmacy. On June 1, 2017, Kroger opened their second Fresh Eats. Kroger is also going to convert some Turkey Hill stores into the concept store. The CFO, Mike Schlotman, has called these stores a \"small test.\" Local reaction to this new concept has been positive. The concept was discontinued in March 2020. In February 2018, Kroger announced that it will be selling its 762 convenience stores to EG Group, a British service station operator, for $2.15 billion. They operate under the Turkey Hill, Loaf 'N Jug, Kwik Shop, Tom Thumb and Quik Stop banners. Kroger will retain just over 20 convenience stores. Kroger's supermarket fuel centers are not included in the sale. The sale was closed on April 20, 2018. On April 10, 2018, Kroger announced plans to hire an estimated 11,000 new employees. An estimated 2,000 managerial positions will be filled by the new hires. With the addition of these new hires, the total number of people employed by the company is close to half a million. On May 17, 2018, Kroger announced a partnership with Ocado, a UK-based online supermarket. The partnership is designed to improve Kroger's ecommerce program, including online ordering, automated fulfillment, and home delivery via the construction of 20 new, automated fulfillment centers. The first of these fulfillment centers, located in Monroe, Ohio, opened in April 2021. As of September 2023, eight total fulfillment center locations have been constructed and opened, with additional locations in Groveland, Florida, Forest Park, Georgia, Pleasant Prairie, Wisconsin, Dallas, Texas, Romulus, Michigan, Aurora, Colorado, and Frederick, Maryland. Each fulfillment center also operate in conjunction with several \"spoke\" facilities, which assist to further extend the capable range of delivery. As of September 2023, the latest \"spoke\" facility to be opened is located in Johnstown, Colorado. Kroger has taken advantage of its investment in online shopping capability to grow rapidly during the pandemic. In 2020, Kroger's online sales grew by 116%, to over $10B annually. On May 24, 2018, Kroger announced they were acquiring Home Chef for $200 million with an additional $500 million in incentives if certain targets are met by Home Chef. On June 13, 2018, Kroger Mid-Atlantic announced the Kroger branding will be leaving the Raleigh-Durham area by eliminating all 14 Kroger-branded stores, eight of which will transition to Harris Teeter (also owned by Kroger). One will become a Crunch Fitness and another will become a Food Lion. The fate for the remaining four stores is unclear. In July 2018, Kroger officials backed off a Net 90 payment plan to the produce industry. In October 2018, Kroger announced online wine delivery to 14 states in partnership with DRINKS. Customers can select assorted wines in 6-bottle or 12-bottle packs. On December 4, 2018, Kroger announced a deal to sell food inside drugstore Walgreens. Kroger Express will offer meal kits and other meal solutions. In the light of increased self-checkout usage via kiosk or smartphone app in 2019, Kroger is gradually shifting towards creating more self-checkout smartphone apps and lanes than cashier lanes. The company has been investing millions of dollars, in replacing many cashier stations with automation by 2023. As many other supermarkets (such as Walmart and Target) are also shifting towards automation, and displacing cashiers in the near future. In March 2019, Kroger announced it was expanding its service with robotics company Nuro to Houston, Texas, with Nuro's autonomous Priuses. In August 2019, Kroger began charging customers between $0.50 and $3.50 for receiving cash back while making purchases with debit cards. The new fees were first test marketed in March at Kansas area Dillons stores, a Kroger-owned supermarket chain, before the new fees were rolled out to other Kroger-owned supermarket banners in the rest of the nation. In September 2019, Kroger announced a partnership with the Plant Based Food Association (PFBA) to test a plant-based meat retail concept in 60 stores in Denver, and parts of Indiana and Illinois. In November 2019, Kroger unveiled an updated logo for their stores and company, with the '\"Fresh For Everyone\" tagline and the \"Krojis\". The company also announced an expansion of its online wine delivery program into Arizona. In partnership with DRINKS, the service is now available in 19 states plus Washington D.C. In December 2019, Kroger was named the second-largest grocer in the nation with $110 billion in 2016 sales. The same month, USA Today listed Kroger—and its brands—as the top supermarket (based on Google searches, Yelp data, and 24/7 Tempo's research) in Alaska, Indiana, Kentucky, Mississippi, Ohio, Oregon, Tennessee, Virginia, Washington, and West Virginia. 2020s According to a PBS NewsHour February 13, 2021 broadcast, during the pandemic, Kroger provided their essential workers with a hazard pay, which the company called \"hero pay.\" The hero pay consisted of a raise of US$2 an hour from the end of March 2020 until May 2020, when the hero pay ended. In January 2021, the Long Beach City Council in California passed an ordinance making it mandatory for some large grocery stores—like Kroger—to provide their essential workers with a hazard pay increase of US$4 an hour \"effective immediately for 120 days\". The ordinance affected companies with \"more than 300 workers nationwide and more than 15 employees per store\". Seattle and Washington passed similar ordinances. In response, in early February, Kroger announced the closure and permanent termination of the entire operations of some of their stores—including a Ralphs and a Food4Less in Long Beach—\"for economic reasons including the economic cost mandated by the Long Beach ordinance requiring an increase in employee wages, four dollars an hour\". Kroger closed two Seattle QFC stores in April 2021 blaming that City's Covid Related Hazard Pay Law. The United Food and Commercial Workers (UFCW), with members whose jobs had been terminated, viewed the closures as a \"warning to other cities considering hazard pay mandates\". Andrea Zinder, president of the UFCW Local 324 that represents employees at the two Long Beach stores—Ralphs and a Food4Less—said that compared to the same time period in 2019 both stores saw an increase of about 30% in sales. In 2020, during the pandemic, Kroger's earnings increased by 87.7%. Kroger's quarterly revenues as reported by November 20, 2020, were US$29.72 billion, and the corporation's per-share earnings and dividends grew at a rapid rate in 2020. Its dividend increase was about 14% annually. Starting in early 2020, Berkshire Hathaway began buying shares of Kroger, and by August 2021 became a top ten shareholder. In July 2021, a wrongful-death lawsuit was filed against Kroger by the family of worker Evan Seyfried. Seyfried committed suicide after allegedly enduring abuse at the Kroger location in Milford, Ohio, where he had worked for 19 years. According to the lawsuit, Seyfried was bullied for wearing a mask in the early days of the pandemic and taunted for his political views. Also on the receiving end of alleged workplace sabotage, one of Seyfried's co-workers called the company's ethics helpline and reported that she and Seyfried were being bullied. However, no action was taken. In December 2021, Kroger Co. announced the elimination of some COVID-19 benefits for unvaccinated employees. In 2021, the company was reported to have been breached by a third-party hack which compromised the pharmacy records of Kroger owned Fred Meyer and QFC stores' customers. In April 2021, Kroger sold what were previously Fred Meyer properties located in Shoreline, Puyallup and Tacoma to Benderson Development Company for a combined $98.7 million. In May 2021, Benderson Development bought an additional twenty-eight Fred Meyer properties (as part of a \"sale-leaseback investment\") for an estimated $500 million as part of a sale totaling 380 acres and 4.5 million square feet of retail space. On August 2, 2021, Kroger announced that it had elected Elaine Chao to its board of directors. Chao was formerly Secretary of Labor under President George W. Bush and Secretary of Transportation under President Donald Trump. The news was met with backlash from a small number of Kroger customers on Twitter, with calls for a boycott trending nationally due to her ties to the Trump administration and to her husband, Mitch McConnell. On September 23, 2021, a mass shooting occurred at a Kroger location in Collierville, Tennessee. One person was killed and 13 others were injured before the gunman, identified as 29-year-old Uk Thang, committed suicide by gunshot. Thang was working at the store as a third-party vendor. In the aftermath of the shooting, Kroger offered counseling services for its employees and closed down the store until November 10. In September 2021, Kroger tweaked its logo to add the \"Fresh Cart\" symbol. The symbol is an abstract shopping cart with the basket represented as citrus slices. In October 2021, Kroger announced an expansion into South Florida with its online delivery service, Kroger Delivery. To do this, Kroger will build two new automated fulfilment centers assisted and facilitated by the UK-based technology company Ocado Group. Kroger Delivery is also set to launch in the Northeast of the US and expand its operations in California, to be followed by sites in Texas, Georgia, Maryland, Wisconsin, Michigan, Arizona, and North Carolina. The company launched its online delivery services in Central Florida earlier in 2021. On April 5, 2022, Kroger launched Kroger Restaurant Supply in the Dallas-Ft. Worth area, a new business distributing food and related supplies to restaurants, bakeries, and catering companies. For Kroger, this move into foodservice distribution represents an expansion beyond its core retail grocery operations. On October 14, 2022, Kroger announced a merger with Albertsons in a deal worth $24.6 billion, combining both companies into one entity but divesting some stores to C&S Wholesale Grocers to secure regulatory approval. However, in January 2024, Washington state sued to block the proposed $25 billion merger between Kroger and Albertsons, warning that if approved it could raise prices and harm consumers. In February 2024, Colorado Attorney General Phil Weiser also filed a lawsuit, saying consumers told him they feared it \"would lead to stores closing, higher prices, fewer jobs, worse customer service, and less resilient supply chains.\" In February 2024, the FTC sued to block the acquisition stating that the deal would negatively impact consumer prices and workers' wages. A 2022 Economic Roundtable survey of 10,000 Kroger's workers in Colorado, Southern California, Washington found that wages have declined over the last several years while over the same period executive pay has increased. The survey found that over 75% of workers experience food insecurity, over 66% struggle to meet basic needs and 14% experience homelessness, while CEO Rodney McMullen made over $22 million in 2020, compared to $12 million for the year 2018. According to Peter Dreier, who participated in the project: \"There are workers sleeping in RVs or couch surfing or living in parks somewhere. Americans go to their local supermarket every week and smile at the person cashing them out, not aware that the person they're talking to is going to sleep in a car after they clock out.\" About two-thirds of Kroger employees are part-time workers, whose schedules often change making it difficult to take a second job. In March 2024, Kroger announced the closure of facilities servicing the Miami, San Antonio, and Austin regions, marking the end of their delivery service in those regions. On July 9, 2024, Kroger released the complete list of 579 stores that would be divested in order to satisfy anti-trust concerns from the Federal Trade Commission. Within the list of stores being proposed for divestment, the Dallas market would be the most affected, with 26 Albertsons locations being sold which includes the Tom Thumb chain and six Market Street locations. Following the announcement, the United Food and Commercial Workers made a statement saying that they will continue to oppose the merger and that Kroger's announcement \"changes nothing\". In December, 2024, a U.S. district judge ruled against the proposed merger, stating that it would be bad for consumers and employees. In November 2025, Kroger announced it would be closing distribution facilities in Groveland, Florida, Pleasant Prairie, Wisconsin, and Frederick, Maryland. As a result of the closures, Kroger is ending its delivery service in Florida and almost entirely leaving the state, while expanding its partnerships with Instacart, DoorDash, and Uber in other locations. Business trends Chains Kroger Marketplace Kroger Marketplace is a chain of hypermarkets. The brand was introduced in 2004 in the Columbus, Ohio, area, which lost the Big Bear and Big Bear Plus chains in Penn Traffic's Chapter 11 bankruptcy. The Kroger Marketplace format is based on the Fry's Marketplace stores that the Arizona division of Kroger is currently operating. There are currently a total of 188 marketplaces. Similar to rival chains Meijer, Kmart, Target, Walmart, and Albertsons; the stores are modeled after Kroger-owned Fred Meyer which house multiple departments. In addition to the grocery department, stores typically include a Fred Meyer Jewelers, Starbucks, Donatos Pizza, an in-store bank, and sections for toys, appliances, home furnishings as well as bed and bath; a format Big Bear had in their stores in the Columbus area. In 2005, the company began renovating many Kroger Food & Drug stores in Ohio to an expanded and updated look, converting them to the Kroger Marketplace format. In February 2006, Kroger announced plans for two new Kroger Marketplace stores by the end of summer in Cincinnati suburbs Lebanon and Liberty Township. The store in Liberty Township opened in July 2006. On October 5, 2006, a new Kroger Marketplace opened in Gahanna. With the Gahanna opening, the number of Kroger Marketplace stores grew to six, four in the Columbus area and two in the Cincinnati area. Two more stores were planned in 2007, one in Middletown (which opened in April 2007, after the old store was razed and made part of the current parking lot) and one in Englewood. In 2011, the Elder-Beerman in Centerville, Ohio, was demolished, and a new marketplace replaced it. The location has a fuel center and opened on December 8. This marketplace is the largest Kroger store ever built from ground up to date at 147,000 square feet (13,700 square meters). Two more stores opened in the Cincinnati area, in the Northern Kentucky suburbs of Hebron and Walton which were completed in November 2008. Three Kroger Marketplace stores in Kentucky opened in 2009, two in Lexington and one in Newport. Another Marketplace opened in Beavercreek, Ohio. A Mount Orab, Ohio, store opened in the spring of 2010. Kroger opened a new 60,000 sq ft (5,600 m2) store in North Augusta, South Carolina. In 2015, a 145,000 sq ft (13,500 m2) Marketplace was opened in the Cincinnati suburb of Oakley. The first Kroger Marketplace store in Tennessee opened in Farragut, Tennessee (a suburb of Knoxville), at the end of 2008, and a second store in Thompson's Station, Tennessee, about 20 miles (32 km) south of Nashville, opened in early 2009. A third location opened in Gallatin, Tennessee, on March 11, 2010. The first Kroger Marketplace store in Texas opened on October 9, 2009, in the Waterside Marketplace in Richmond, Texas. The second Kroger Marketplace store in Rosenberg, Texas, opened on December 4, 2009. The third opened in Frisco, Texas, in early 2010. The fourth, in Willis, Texas, opened on August 11, 2011. Other Kroger Marketplace stores in Texas are in Little Elm, Texas; Fort Worth's Alliance Town Center; Mansfield; Wylie, Texas; and Baytown, Texas. The first Kroger Marketplace in Arkansas opened in August 2010 on Chenal Parkway in Little Rock, Arkansas. Locations also opened in 2012 in Conway, Arkansas and 2014 in Jonesboro, Arkansas. The first Kroger Marketplace in Indiana opened on September 29, 2011, on Dupont Road on Fort Wayne's northwest side. This store is a rebuilt Kroger Food & Drug. A second Kroger Marketplace opened on October 4, 2012, from a rebuilt Scott's Food and Pharmacy in the Village at Coventry on the southwest side of Fort Wayne. These two stores are part of a $100 million expansion project in the Fort Wayne area. In October 2016, it was announced that a Kroger Marketplace will open in La Porte, Indiana, within the NewPorte Landing development. Construction of the new 123,000-square-foot (11,400-square-meter) store is expected to begin early in 2018. The first Kroger Marketplace in Virginia opened on Midlothian Turnpike in Richmond, Virginia, on the site of the former Cloverleaf Mall on December 6, 2012. Another Marketplace opened in Virginia Beach, Virginia, at the site of a former Super Kmart, on July 31, 2013. The third location opened in December 2013 in the Staples Mill shopping Center in Henrico County. A fourth location opened on October 15, 2014, in Portsmouth, Virginia, at the site of the former I.C. Norcom High School. The first Kroger Marketplace in Michigan opened on June 14, 2013, at Sterns and Secor Roads in Lambertville (a suburb north of Toledo, Ohio). Formerly a conventional Kroger store, the square footage (square meterage) increased from 68,000 to 133,000 square feet (6,300 to 12,400 square meters). It carries toys, home essentials, apparel and shoes in addition to groceries. The state's second store opened in 2014 in Shelby Township on property that already contained a 2010-built Fuel Center, replacing a smaller Kroger store across Hayes Road in neighboring Macomb Township, which was soon converted into an Emagine Entertainment movie theater. Three further locations opened in 2016, one in White Lake. The first Kroger Marketplace in Mississippi opened on September 16, 2016, in Hernando (a suburb of Memphis, Tennessee) to much fanfare. This store was formally a Kroger Food & Drug with twelve aisles, now rebuilt with sixty-four, in addition to having a Starbucks, ClickList, and expanded deli inside. The first Kroger Marketplace store in Alabama opened in Huntsville, Alabama in 2017. Manufacturing and distribution Distribution and logistics Food distribution and buying takes place under various subsidiaries and divisions. These include: Kroger Group Cooperative, Inc. Kroger Group, Inc. Peytons WESCO Inter-American Products Kroger operates its own fleet of trucks and trailers to distribute products to its various stores, in addition to contracts with various trucking companies. In June 2018, Kroger announced testing driverless cars for delivering groceries. For this, Kroger is partnering with autonomous car company Nuro. In addition to stocking a variety of regional brand products, The Kroger Company also employs one of the largest networks of private label manufacturing in the country. Thirty-three plants (either wholly owned or used with operating agreements) in seventeen states create about 40% of Kroger's private label products. Similar to most major supermarket retailers, Kroger uses a three-tiered private label marketing strategy. One private brand emphasizes no-frills products at the lowest possible price, another is intended to be comparable to leading national brands but a better value and the third is a premium (often organic) brand. Private label brands Kroger offers a collection of its own branded products, referred to by the retailer as \"Our Brands\". The products are produced and sold in quality tiers, and account for over 30% of the retailer's unit sales. Banner Brand Banner Brand items are goods that bear the name of Kroger or its subsidiaries (i.e., Ralphs, King Soopers, etc.) or make reference to them (i.e., Big K), and are offered exclusively within Kroger-owned stores. These products are marketed to customers as budget-friendly, and account for over $13 billion in annual sales. Many of Kroger's health and beauty goods, one of the company's fastest-growing private label categories, are manufactured by third-party providers; these products include goods like ibuprofen and contact lens solution. Private Selection Products marked Private Selection are offered to compare with gourmet brands or regional brands that may be considered more upscale than the standard Kroger brand products. Simple Truth Simple Truth is Kroger's flagship natural and organic brand, and has grown quickly since its launch in 2012. The brand's launch marked the first time Kroger had delved into making its own gluten-free products, including flour mixes, bread, etc. The Simple Truth brand became the first Kroger offering to be introduced in China, on Alibaba's Tmall platform. Simple Truth reached $2 billion in annual sales in 2018. Smart Way Smart Way is Kroger's budget-priced private label line that includes around 150 products. This line, which launched in two waves starting in September 2022, consolidates 16 legacy brands at a \"new opening price-point.\" Other private label brands In addition to its core brands, Kroger's manufacturing creates a variety department-specific brands. These are featured especially in Fred Meyer stores, where more than half the goods sold are non-food, or in the smaller Fred Meyer-based Marketplace stores. The brands listed below may be found in various Kroger-owned stores. Abound – natural pet food Bakery Fresh Goodness – fresh-baked foods Bloom Haus – floral arrangements Comforts – baby products Dip – fast fashion brand designed by Joe Mimran Everyday Living – home goods HD Designs – upscale home goods HemisFares – imported foods Home Chef – meal kit and food delivery company acquired in 2018 Kroger Mercado – Hispanic-inspired food products Luvsome – pet food Murray's Cheese – artisanal cheese shop founded in Greenwich Village in 1940 OfficeWorks – stationery and office supplies Pet Pride – pet food Other operations Pharmacy Group Kroger previously owned and operated the SupeRx drug store chain. In 1985, Kroger outbid Rite Aid for the Hook's Drug Stores chain, based in Indianapolis, Indiana, and combined it with SupeRx to become Hook's-SupeRx. In 1994, Kroger decided to exit the stand-alone drugstore business and sold its Hook's and SupeRx stores to Revco, which later was sold to CVS. Today, Kroger operates 2,252 pharmacies, most of which are located inside its supermarkets. The Kroger Pharmacies continue as a profitable portion of the business and have been expanding to now include pharmacies in City Market, Dillons, Fred Meyer, Fry's, King Soopers, QFC, Ralphs, Harris Teeter, Smith's Food and Drug, and Kroger Supermarkets. Supermarket Petroleum Group Since 1998, Kroger has added fuel centers in the parking lots of its supermarkets. More recently, the company has begun opening standalone fuel centers, often near stores whose parking lots could not accommodate a fuel center. As of Q2 2022, Kroger operated 1,629 supermarket fuel centers. In 2006, Kroger introduced a new common logo for all of its convenience store chains that is now also used at the fuel centers of all of its supermarket chains—a rhombus with a white, stylized image of the continental United States in the center bordered by four colored areas: dark blue representing the Pacific Ocean, red representing Canada, green representing the Atlantic Ocean, and yellow representing the Gulf of Mexico. This logo is also still used at the convenience stores that were sold to EG Group in 2018. Kroger Personal Finance Kroger Personal Finance was introduced in 2007 to offer branded Visa cards, mortgages, home equity loans, pet, renter's and home insurance, identity theft protection, and wireless services. In 2017, MasterCard became the network for Kroger's newly branded 1-2-3 REWARDS credit card issued by U.S. Bank. In 2019, Kroger banned the use of Visa credit cards (but not debit cards) at two of its subsidiary chains: Foods Co. Supermarkets and Smiths, citing rising costs from premium cards. Kroger Wireless Kroger Wireless, formerly known as i-wireless, is a national private label wireless service provider sold in over 2,200 retail locations within the Kroger family of stores across 31 states. Kroger Wireless service functions over the nationwide T-Mobile network. Customers can choose from \"Unlimited\" rate plans including unlimited talk/text and with data allotments up to and including unlimited data. Kroger Wireless allows customers to purchase phones at select Kroger store locations, via their website, or by bringing their eligible T-Mobile device for activation. 84.51° 84.51° is a wholly owned subsidiary of Kroger engaged in data science and consumer insights, created in April 2015, as a result of Kroger purchasing the remaining half of its then-joint venture Dunnhumby USA from Tesco. Controversies Pricing discrepancies and overcharges In 2025, an investigation by The Guardian, Consumer Reports, and the Food & Environment Reporting Network revealed widespread overcharging at Kroger stores across multiple states due to expired sale tags leading to higher prices at checkout. Tests in 26 stores across 14 states and Washington, D.C., identified over 150 items with expired sale tags, averaging a $1.70 overcharge per item, or 18% above the advertised sale price. In Colorado, union tests at over 30 King Soopers stores found more than 300 expired tags, with overcharges averaging nearly 15%. An internal Kroger audit at one western U.S. store reported approximately 6% of price tags were incorrect, exceeding the company’s 1% error threshold. The investigation, supported by customer complaints and union reports, linked the issue to chronic understaffing, with expired tags remaining on shelves for weeks. Kroger denied systemic pricing issues, asserting that errors were a small fraction of billions of annual transactions and emphasizing regular audits to ensure pricing accuracy. Animal welfare In 2017, Kroger announced that it would transition to 100% cage-free eggs by 2025, responding to pressure from animal welfare groups. In 2022, they loosened the commitment, aiming instead for 70% cage-free eggs by 2030."
}