{
  "ticker": "L",
  "cik": "0000060086",
  "company_name": "Loews Corporation",
  "corrected_name": "Loews Corporation",
  "wiki_title_used": "Loews Corporation",
  "exists": true,
  "raw_text": "Loews Corporation is an American conglomerate headquartered in New York City. The company's majority-stake holdings include CNA Financial Corporation, Boardwalk Pipeline Partners, Loews Hotels and Altium Packaging.\nThe corporation positions itself as a value investor with a long-term focus. In recent years, Loews has also allocated significant capital for share buybacks. In the three years preceding December 31, 2012, Loews spent $1.3 billion repurchasing shares. Between 1971 and 2020, the corporation reduced its shares outstanding from 1.3 billion shares to 291 million shares.\n\nHistory\nLoews Corporation traces its roots to 1946 when Laurence Tisch persuaded his parents to invest $125,000 to buy a resort hotel in Lakewood, New Jersey.  Laurence's brother Robert joined the business shortly thereafter. The Tisch brothers began to invest their profits in expanding the hotel business. By 1956, the brothers were in a position to build their first hotel, the Americana in Bal Harbour, Florida, for $17 million in cash.\nIn the wake of the landmark 1948 Supreme Court antitrust ruling in United States v. Paramount Pictures, Inc., all the major movie studios, including Metro-Goldwyn-Mayer (MGM), were ordered to sell off the movie theater chains they owned and operated.\nIn 1959, the Tisch brothers purchased a controlling interest in Loew's Theatres, a nationwide chain of 102 movie theaters, from MGM. This acquisition formed the foundation of the modern-day Loews Corporation, and the company was listed on the New York Stock Exchange that same year.\nBy the summer of 1960, the brothers had gained control of the company; the brothers became co-chairmen. The theaters were aging and not suited to then-current movie-going trends, which anticipated the multiplex; however, the theaters were located on highly valuable city property. Almost immediately, the Tisch brothers began closing and demolishing many of these theaters, selling the vacant lots to developers.  This hastened the end of the classic movie \"palaces\" from the Golden Age of Hollywood.\nThe brothers soon diversified the Loews business, successfully venturing into a variety of areas as the 1960s and 1970s progressed. Loews acquired Lorillard Tobacco Company in 1968, CNA Financial in 1974, and the Bulova Watch Company in 1979. Through acquisitions, Loews's revenues grew from $100 million in 1970 to more than $3 billion by a decade later.\nLoews sold the theater business in 1985 (it continued operating under the Loew's brand name, while the investment operates as Loews). Laurence Tisch briefly owned, through Loews, a significant portion of US television and radio broadcaster CBS in the 1980s. As chairman of CBS, he also approved the deal that brought late-night host David Letterman to the network from NBC.  Loews involvement in CBS ended in 1995, with the sale of CBS to Westinghouse Electric Corporation for $5.4 billion.\nIn the past two decades, Loews further diversified into the energy business. In 1989, the company acquired Diamond M Drilling.  The subsidiary acquired ODECO in 1992, adding 39 oil rigs.  A year later, the combined businesses were renamed Diamond Offshore. The operating subsidiary, which went public in 1995, provides contract drilling services to the energy industry globally.\nIn 2003, Loews purchased Texas Gas Transmission, then bought Gulf South Pipeline Company a year later. These two companies were consolidated into a new entity, Boardwalk Pipeline Partners, which went public in 2005. Structured as a midstream master limited partnership (MLP), Boardwalk Pipeline provides transportation, storage, gathering, and processing of natural gas and liquids for its customers.\nOn May 10, 2006, Loews Corporation announced that it would offer 15 million shares of Carolina Group via a public offering, with the proceeds to be used for general corporate purposes. The sale's value was $740 million.\nLoews Corporation was the parent company of Bulova until 2007, when it sold the company to Citizen Watch.\nOn June 4, 2007, Loews Corporation announced it would acquire a portion of the operations of Dominion Resources for $4.03 billion dollars. Loews rebranded the assets HighMount Exploration & Production. This wholly owned subsidiary is engaged in the exploration and production of natural gas and natural gas liquids. On May 23, 2014, Loews announced that HighMount is pursuing strategic alternatives, including a potential sale of business. HighMount was sold later that year to the private equity firm EnerVest.\nOn December 17, 2007, Loews Corporation announced a plan to spin off its entire ownership interest in Lorillard to holders of Carolina Group stock and Loews common stock.\n\nManagement\nFounders Laurence and Robert Tisch served as co-CEOs until 1998 when they retired as part of a generational shift in corporate leadership. That year, James Tisch was named president and CEO, and the Office of the president was created with three members: James Tisch, Andrew Tisch, and Jonathan Tisch. In 2006, Jonathan Tisch and Andrew Tisch were elected co-chairmen of the board. The company has issued only a single class of common stock and all shareholders have equal voting rights.\n\nGovernance\nThe current members of the board of directors of Loews Corporation are Ann E. Berman, Joseph L. Bower, Charles D. Davidson, Charles M. Diker, Paul J. Fribourg, Walter L. Harris, Philip A. Laskawy, Susan P. Peters, Anthony Welters, Andrew H. Tisch, James S. Tisch and Jonathan M. Tisch.\n\nRestatement\nOn February 13, 2003, the company restated its financial statements as of and for the years ended December 31, 2001 to 2000 as well as its interim financial statements for the first three quarters of 2002 to reflect an adjustment to the company's historical accounting for CNA's investment in life settlement contracts and the related revenue recognition.  On March 19, 2003, the company announced a revision to its previously reported fourth-quarter and year-end 2002 results to reflect an additional $28.9 million of impairment losses on equity securities at the company's CNA Financial Corporation subsidiary.  On February 16, 2006, the company restated results from 2001 through September 2005 to correct accounting for discontinued operations acquired in CNA's merger with the Continental Corp. in 1995.  On March 8, 2006, the company said that financial statements for periods from 2001 to 2004 and the first three quarters of 2005 shouldn't be relied on because of accounting classification errors at its majority-owned subsidiary CNA Financial Corp, and it would restate financial statements for 2003 and 2004 and for the first three quarters of 2005 to correct the classification errors.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Loews Corporation: \nYahoo! - Loews Corporation Company Profile\nForbes.com: Forbes 400 Richest in America - Tisch, Preston Robert",
  "clean_text": "Loews Corporation is an American conglomerate headquartered in New York City. The company's majority-stake holdings include CNA Financial Corporation, Boardwalk Pipeline Partners, Loews Hotels and Altium Packaging. The corporation positions itself as a value investor with a long-term focus. In recent years, Loews has also allocated significant capital for share buybacks. In the three years preceding December 31, 2012, Loews spent $1.3 billion repurchasing shares. Between 1971 and 2020, the corporation reduced its shares outstanding from 1.3 billion shares to 291 million shares. History Loews Corporation traces its roots to 1946 when Laurence Tisch persuaded his parents to invest $125,000 to buy a resort hotel in Lakewood, New Jersey. Laurence's brother Robert joined the business shortly thereafter. The Tisch brothers began to invest their profits in expanding the hotel business. By 1956, the brothers were in a position to build their first hotel, the Americana in Bal Harbour, Florida, for $17 million in cash. In the wake of the landmark 1948 Supreme Court antitrust ruling in United States v. Paramount Pictures, Inc., all the major movie studios, including Metro-Goldwyn-Mayer (MGM), were ordered to sell off the movie theater chains they owned and operated. In 1959, the Tisch brothers purchased a controlling interest in Loew's Theatres, a nationwide chain of 102 movie theaters, from MGM. This acquisition formed the foundation of the modern-day Loews Corporation, and the company was listed on the New York Stock Exchange that same year. By the summer of 1960, the brothers had gained control of the company; the brothers became co-chairmen. The theaters were aging and not suited to then-current movie-going trends, which anticipated the multiplex; however, the theaters were located on highly valuable city property. Almost immediately, the Tisch brothers began closing and demolishing many of these theaters, selling the vacant lots to developers. This hastened the end of the classic movie \"palaces\" from the Golden Age of Hollywood. The brothers soon diversified the Loews business, successfully venturing into a variety of areas as the 1960s and 1970s progressed. Loews acquired Lorillard Tobacco Company in 1968, CNA Financial in 1974, and the Bulova Watch Company in 1979. Through acquisitions, Loews's revenues grew from $100 million in 1970 to more than $3 billion by a decade later. Loews sold the theater business in 1985 (it continued operating under the Loew's brand name, while the investment operates as Loews). Laurence Tisch briefly owned, through Loews, a significant portion of US television and radio broadcaster CBS in the 1980s. As chairman of CBS, he also approved the deal that brought late-night host David Letterman to the network from NBC. Loews involvement in CBS ended in 1995, with the sale of CBS to Westinghouse Electric Corporation for $5.4 billion. In the past two decades, Loews further diversified into the energy business. In 1989, the company acquired Diamond M Drilling. The subsidiary acquired ODECO in 1992, adding 39 oil rigs. A year later, the combined businesses were renamed Diamond Offshore. The operating subsidiary, which went public in 1995, provides contract drilling services to the energy industry globally. In 2003, Loews purchased Texas Gas Transmission, then bought Gulf South Pipeline Company a year later. These two companies were consolidated into a new entity, Boardwalk Pipeline Partners, which went public in 2005. Structured as a midstream master limited partnership (MLP), Boardwalk Pipeline provides transportation, storage, gathering, and processing of natural gas and liquids for its customers. On May 10, 2006, Loews Corporation announced that it would offer 15 million shares of Carolina Group via a public offering, with the proceeds to be used for general corporate purposes. The sale's value was $740 million. Loews Corporation was the parent company of Bulova until 2007, when it sold the company to Citizen Watch. On June 4, 2007, Loews Corporation announced it would acquire a portion of the operations of Dominion Resources for $4.03 billion dollars. Loews rebranded the assets HighMount Exploration & Production. This wholly owned subsidiary is engaged in the exploration and production of natural gas and natural gas liquids. On May 23, 2014, Loews announced that HighMount is pursuing strategic alternatives, including a potential sale of business. HighMount was sold later that year to the private equity firm EnerVest. On December 17, 2007, Loews Corporation announced a plan to spin off its entire ownership interest in Lorillard to holders of Carolina Group stock and Loews common stock. Management Founders Laurence and Robert Tisch served as co-CEOs until 1998 when they retired as part of a generational shift in corporate leadership. That year, James Tisch was named president and CEO, and the Office of the president was created with three members: James Tisch, Andrew Tisch, and Jonathan Tisch. In 2006, Jonathan Tisch and Andrew Tisch were elected co-chairmen of the board. The company has issued only a single class of common stock and all shareholders have equal voting rights. Governance The current members of the board of directors of Loews Corporation are Ann E. Berman, Joseph L. Bower, Charles D. Davidson, Charles M. Diker, Paul J. Fribourg, Walter L. Harris, Philip A. Laskawy, Susan P. Peters, Anthony Welters, Andrew H. Tisch, James S. Tisch and Jonathan M. Tisch. Restatement On February 13, 2003, the company restated its financial statements as of and for the years ended December 31, 2001 to 2000 as well as its interim financial statements for the first three quarters of 2002 to reflect an adjustment to the company's historical accounting for CNA's investment in life settlement contracts and the related revenue recognition. On March 19, 2003, the company announced a revision to its previously reported fourth-quarter and year-end 2002 results to reflect an additional $28.9 million of impairment losses on equity securities at the company's CNA Financial Corporation subsidiary. On February 16, 2006, the company restated results from 2001 through September 2005 to correct accounting for discontinued operations acquired in CNA's merger with the Continental Corp. in 1995. On March 8, 2006, the company said that financial statements for periods from 2001 to 2004 and the first three quarters of 2005 shouldn't be relied on because of accounting classification errors at its majority-owned subsidiary CNA Financial Corp, and it would restate financial statements for 2003 and 2004 and for the first three quarters of 2005 to correct the classification errors."
}