{
  "ticker": "LDOS",
  "cik": "0001336920",
  "company_name": "Leidos",
  "corrected_name": "Leidos",
  "wiki_title_used": "Leidos",
  "exists": true,
  "raw_text": "Leidos Holdings, Inc. is an American defense, aviation, information technology, and biomedical research company headquartered in Reston, Virginia, that provides scientific, engineering, systems integration, and technical services. Founded as Science Applications International Corporation (SAIC), Leidos merged with Lockheed Martin's IT sector, Information Systems & Global Solutions (Lockheed Martin IS&GS), in August 2016 to create the defense industry’s largest IT services provider. The Leidos-Lockheed Martin merger is one of the biggest transactions thus far in the consolidation of the defense sector. Leidos contracts extensively with the Department of Defense, the Department of Homeland Security, and the Intelligence Community, as well as other U.S. government agencies and select commercial markets.\n\nHistory\nAs SAIC\nThe company was founded by J. Robert \"Bob\" Beyster in 1969 in the La Jolla neighborhood of San Diego, California, as Science Applications Incorporated (SAI). Beyster, a former scientist for the Westinghouse Atomic Power Division and Los Alamos National Laboratory, who became the chairman of the Accelerator Physics Department of General Atomics in 1957, raised the money to start SAI by selling stock he had received from General Atomics, combined with funds raised from the early employees who bought stock in the young enterprise.\nInitially, the company's focus was on projects for the U.S. government related to nuclear power and weapons effects study programs.  The company was renamed Science Applications International Corporation (SAIC) as it expanded its operations. Major projects during Beyster's tenure included work on radiation therapy for the Los Alamos National Laboratory; technical support and management assistance to the development of the cruise missile in the 1970s; the cleanups of the Three Mile Island Nuclear Generating Station after its major accident, and of the contaminated community of Love Canal; design and performance evaluation of the Stars & Stripes 87, the winning ship for the 1987 America's Cup; and the design of the first luggage inspection machine to pass new Federal Aviation Administration tests following the terrorist bombing of Pan American flight 103 over Lockerbie, Scotland.\nContrary to traditional business models, Beyster originally designed SAIC as an employee-owned company. This shared ownership was accompanied by shared responsibility and freedom in business development, and allowed SAIC to attract and retain highly educated and motivated employees that helped the company to grow and diversify. After Beyster's retirement in 2003, SAIC conducted an initial public offering of common stock on October 17, 2006. The offering of 86,250,000 shares of common stock was priced at $15.00 per share. The underwriters, Bear Stearns and Morgan Stanley, exercised overallotment options, resulting in 11.25 million shares. The IPO raised US$1.245 billion. Even then, employee shares retained a privileged status, having ten times the voting power per share over common stock.\nIn September 2009, SAIC moved its corporate headquarters to Tysons Corner in unincorporated Fairfax County, Virginia, near McLean.\nIn 2012, SAIC was ordered to pay $550 million to the City of New York for overbilling over seven years on the CityTime contract. In 2014, Gerard Denault, SAIC's CityTime program manager, and his two accomplices within the city's government were sentenced to twenty years in prison for fraud and bribery related to that contract.\n\nAs Leidos\nIn August 2012, SAIC announced plans to split into two publicly traded companies. The company spun off about a third of its business, forming an approximately $4 billion-per-year service company focused on government services, including systems engineering, technical assistance, financial analysis, and program office support. The remaining part became a $7 billion-per-year IT company specializing in technology for the national security, health, and engineering sectors. The smaller company was led by Tony Moraco, who beforehand was leading SAIC's Intelligence, Surveillance and Reconnaissance group, and the bigger one was led by John P. Jumper. The split has allowed both companies to pursue more business, which it could not pursue as a single company which would have resulted in conflicts of interest. In February 2013, it was announced that the smaller spin-off company would get the name \"Science Applications International Corporation\" and stay in the current headquarters, while the larger company would change its name to Leidos, (created by clipping the word kaleidoscope) and would move its headquarters to Reston, Virginia. The split was structured in a way that SAIC changed its name to Leidos, then spun off the new SAIC as a separate publicly traded company. However, Leidos is the legal successor of the original SAIC and retains SAIC's pre-2013 stock price and corporate filing history.\nBefore the split, Leidos employed 39,600 employees and reported $11.17 billion in revenue and $525 million net income for its fiscal year ended January 31, 2013, making it number 240 on the Fortune 500 list. In 2014, Leidos reported US$5.06 billion in revenue.\nIn August 2016, the deal to merge with the entirety of Lockheed Martin's Information Systems & Global Solutions (IS&GS) business came to a close, more than doubling the size of Leidos and its portfolio, and positioning the company as the global defense industry's largest enterprise in the federal technology sector. \nIn January 2020, Leidos purchased defense contractor Dynetics for approximately $1.65 billion.  In May 2020 it purchased the Security Detection and Automation Systems division of L3Harris (notable for providing the detection screeners that all airport travelers pass through when flying).\nAs of December 2023, the company has 47,000 employees. In 2023, Leidos reported US$15.4 billion in revenue. It ranked 266 on the 2024 Fortune 500 list.\nOn March 4, 2025, the Chinese Ministry of Commerce placed 15 U.S. entities (including Leidos) on its export control list, barring the export of dual-use commodities to that business. In May, the Department of Homeland Security terminated for convenience its $2.4 billion cybersecurity services contract with Leidos.\n\nStructure\nLeidos has four central divisions: Civil, Health, Advanced Solutions, and Defense & Intelligence. The Civil Division focuses on integrating aviation systems, securing transportation measures, modernizing IT infrastructure, and engineering energy efficiently. The Health Division focuses on optimizing medical enterprises, securing private medical data, and improving collection and data entry methods. The Advanced Solutions Division is centered around data analysis, integrating advanced defense and intelligence systems, and increasing surveillance and reconnaissance efficiency. The Defense & Intelligence Division focuses on providing air service systems, geospatial analysis, cybersecurity, intelligence analysis, and supporting operations efforts.\n\nManagement\nRetired Air Force general John P. Jumper was appointed CEO in 2012, and he oversaw the restructuring of SAIC into SAIC and Leidos. On July 1, 2014, Leidos announced that Roger Krone would become its CEO on July 14, 2014. On February 27, 2023, Leidos announced the appointment of Thomas Bell as Chief Executive Officer starting on May 3, 2023.\n\nSubsidiaries\nDynetics, Inc., a wholly owned subsidiary of Leidos since Jan 2020.\nLeidos Biomedical Research, Inc., formerly SAIC - Frederick, a wholly owned subsidiary of Leidos manages Frederick National Laboratory for Cancer Research.\nGibbs & Cox, a wholly owned subsidiary of Leidos since May 7, 2021.\nMEDPROTECT, LLC supports US government health-payer organizations\nReveal, develops dual-energy X-ray computed tomography systems for explosives-detection at airports and similar facilities\nCloudShield Technologies a wholly owned subsidiary, specializing in cyber-security\nVarec, Inc., liquid petroleum asset management company\nLeidos Health\nLeidos Canada, formerly SAIC Canada, wholly owned subsidiary, works with Canadian government.\nLeidos Australia (Leidos Pty Ltd), wholly owned subsidiary, specializing in document technologies and cyber-security. Produces TeraText software.\nLeidos UK (Leidos Innovations UK Ltd, Leidos Europe Ltd, Leidos Supply Ltd & Leidos Ltd), wholly owned subsidiary, specializing in managed IT Services, developing of bespoke products. Produces, supports & maintains the Chroma Airport Suite, also responsible for the MOD's Supply Chain.\nLeidos Engineering, LLC, formerly SAIC Energy, Environment & Infrastructure LLC, assembles the legacy of engineering capabilities of Benham Investment Holdings, LLC, R. W. Beck Group, Inc., and Patrick Energy Services.\nLeidos QTC Health Services (formerly QTC Management), acquired by merging with Lockheed Martin IS&GS.\nSystems Made Simple (SMS), acquired by merging with Lockheed Martin IS&GS.\n\nFormer subsidiaries\nAMSEC LLC, a business partnership between SAIC and Northrop Grumman subsidiary Newport News Shipbuilding divested on July 13, 2007. Network Solutions was acquired by SAIC in 1995, and subsequently was acquired by VeriSign, Inc. for $21 billion.Leidos Cyber, Inc., formerly Lockheed Martin Industrial Defender, acquired by merging with Lockheed Martin IS&GS, was sold to Capgemini in 2018.\n\nControversies\nAs SAIC\nThen-SAIC had as part of its management and on its board of directors, many well-known ex-government personnel including Melvin Laird, Secretary of Defense in the  Nixon administration; William Perry, Secretary of Defense for Bill Clinton; John M. Deutch, Director of Central Intelligence under President Clinton; Admiral Bobby Ray Inman who served in various capacities in the National Security Agency (NSA) and Central Intelligence Agency (CIA) for the Ford, Carter and Reagan administrations; and David Kay who led the search for weapons of mass destruction after the 1991 Gulf War and served under the Bush administration after the 2003 invasion of Iraq. In 2022, 30 out of 38 Leidos Inc. lobbyists previously held government jobs.\nIn June 2001, the Federal Bureau of Investigation (FBI) paid SAIC US$122 million to create a Virtual Case File (VCF) software system to speed up the sharing of information among agents. But the FBI abandoned VCF when it failed to function adequately. Robert Mueller, FBI Director, testified to a congressional committee, \"When SAIC delivered the first product in December 2003 we immediately identified a number of deficiencies – 17 at the outset. That soon cascaded to 50 or more and ultimately to 400 problems with that software ... We were indeed disappointed.\"\nIn 2005, then-SAIC executive vice president Arnold L. Punaro claimed that the company had \"fully conformed to the contract we have and gave the taxpayers real value for their money.\" He blamed the FBI for the initial problems, saying the agency had a parade of program managers and demanded too many design changes. He stated that during 15 months that SAIC worked on the program, 19 different government managers were involved and 36 contract modifications were ordered. \"There were an average of 1.3 changes every day from the FBI, for a total of 399 changes during the period,\" Punaro said.\nIn 2011–2012, then-SAIC was among the 8 top contributors to federal candidates, parties, and outside groups with US$1,209,611 (equivalent to $1,656,706 in 2024) during the 2011–2012 election cycle according to information from the Federal Election Commission. The top candidate recipient was Barack Obama.\n\nAs Leidos\nIn a heavily redacted report dated January 3, 2018, the Inspector General for the Department of Defense determined that a supervisor at Leidos made “inappropriate sexual and racial comments to” a female contractor, and that when she complained of a hostile work environment, Leidos retaliated by excluding her from further work on an additional contract. The report found that Leidos's claim that the contract employee “exhibited poor performance throughout her employment\" lacked supporting evidence. It recommended that U.S. Secretary of Defense Jim Mattis “consider appropriate action against Leidos” such as “compensatory damages, including back pay, employee benefits and other terms and conditions of employment” that the contractor would have received under the additional contract.\nIn 2018, Leidos donated to the Senate campaign of Cindy Hyde-Smith. However, after a video was released showing Hyde-Smith speaking fondly of participating in \"public hangings\", Leidos said the company would never have made the donation if it had known about the comment. During Hyde-Smith's 2020 re-election bid, Leidos again donated to her.\nIn 2022, it was revealed Leidos is embroiled in dual criminal investigations concerning potential foreign bribery and antitrust violations. In August 2023, the company received a grand jury subpoena from the Justice Department’s antitrust division related to three government contracts from 2021 and 2022, coinciding with heightened enforcement of antitrust laws by the Biden administration. Additionally, in September 2023, Leidos was served with a separate grand jury subpoena regarding possible violations of the U.S. Foreign Corrupt Practices Act, linked to activities within its international operations that were identified in late 2021. The company has stated that it is cooperating with the investigations and conducting its own internal reviews into both matters.\nLeidos is facing scrutiny following the leak of internal documents reportedly stolen by hackers, believed to be linked to a previously disclosed breach of a Diligent Corp. system that Leidos utilized. The company is currently investigating the matter, which led to a more than 4% drop in its shares during after-hours trading. A spokesperson confirmed that the leak originated from a prior incident involving a third-party vendor and emphasized that it did not affect Leidos' network or sensitive customer data. The breach is thought to be connected to a 2022 hack of Diligent's subsidiary, Steele Compliance Solutions, which affected fewer than 15 customers, including Leidos. Diligent stated that it promptly notified impacted clients and took corrective actions following the incident.\nLeidos is facing increasing scrutiny regarding its handling of sexual assault and harassment incidents at facilities operated for the U.S. Antarctic Program (USAP). In a letter from House Science Committee Chair Frank Lucas (R-OK) and Ranking Member Zoe Lofgren (D-CA), the company was criticized for allegedly failing to address these serious issues adequately. This concern follows a 2021 National Science Foundation (NSF) report that highlighted pervasive problems of sexual misconduct in Antarctica. The committee accused Leidos of inaccurately reporting that it had received no sexual assault allegations and claimed that its employees were not fully cooperating with NSF investigators. Leidos has reported five allegations of sexual harassment and zero of sexual assault between May 2017 and April 2022, a claim that Lucas and Lofgren disputed, citing evidence of prior reports. The NSF has since implemented new measures to combat these issues through its Sexual Assault and Harassment Prevention and Response (SAHPR) program. The controversy has drawn attention to the broader challenges of addressing sexual misconduct in remote work environments, with advocacy groups like Ice Allies calling for more robust action since 2019.\n\nSee also\nTop 100 Contractors of the U.S. federal government\nEspionage\nCounterespionage\n\nReferences\nFurther reading\nBeyster, Dr.J. Robert; Economy, Peter (2007). The SAIC Solution: How We Built an $8 Billion Employee-Owned Technology Company (1st ed.). Hoboken, NJ: Wiley. ISBN 978-0-470-09752-6.\n\nExternal links\n\nOfficial website\nBusiness data for Leidos:",
  "clean_text": "Leidos Holdings, Inc. is an American defense, aviation, information technology, and biomedical research company headquartered in Reston, Virginia, that provides scientific, engineering, systems integration, and technical services. Founded as Science Applications International Corporation (SAIC), Leidos merged with Lockheed Martin's IT sector, Information Systems & Global Solutions (Lockheed Martin IS&GS), in August 2016 to create the defense industry’s largest IT services provider. The Leidos-Lockheed Martin merger is one of the biggest transactions thus far in the consolidation of the defense sector. Leidos contracts extensively with the Department of Defense, the Department of Homeland Security, and the Intelligence Community, as well as other U.S. government agencies and select commercial markets. History As SAIC The company was founded by J. Robert \"Bob\" Beyster in 1969 in the La Jolla neighborhood of San Diego, California, as Science Applications Incorporated (SAI). Beyster, a former scientist for the Westinghouse Atomic Power Division and Los Alamos National Laboratory, who became the chairman of the Accelerator Physics Department of General Atomics in 1957, raised the money to start SAI by selling stock he had received from General Atomics, combined with funds raised from the early employees who bought stock in the young enterprise. Initially, the company's focus was on projects for the U.S. government related to nuclear power and weapons effects study programs. The company was renamed Science Applications International Corporation (SAIC) as it expanded its operations. Major projects during Beyster's tenure included work on radiation therapy for the Los Alamos National Laboratory; technical support and management assistance to the development of the cruise missile in the 1970s; the cleanups of the Three Mile Island Nuclear Generating Station after its major accident, and of the contaminated community of Love Canal; design and performance evaluation of the Stars & Stripes 87, the winning ship for the 1987 America's Cup; and the design of the first luggage inspection machine to pass new Federal Aviation Administration tests following the terrorist bombing of Pan American flight 103 over Lockerbie, Scotland. Contrary to traditional business models, Beyster originally designed SAIC as an employee-owned company. This shared ownership was accompanied by shared responsibility and freedom in business development, and allowed SAIC to attract and retain highly educated and motivated employees that helped the company to grow and diversify. After Beyster's retirement in 2003, SAIC conducted an initial public offering of common stock on October 17, 2006. The offering of 86,250,000 shares of common stock was priced at $15.00 per share. The underwriters, Bear Stearns and Morgan Stanley, exercised overallotment options, resulting in 11.25 million shares. The IPO raised US$1.245 billion. Even then, employee shares retained a privileged status, having ten times the voting power per share over common stock. In September 2009, SAIC moved its corporate headquarters to Tysons Corner in unincorporated Fairfax County, Virginia, near McLean. In 2012, SAIC was ordered to pay $550 million to the City of New York for overbilling over seven years on the CityTime contract. In 2014, Gerard Denault, SAIC's CityTime program manager, and his two accomplices within the city's government were sentenced to twenty years in prison for fraud and bribery related to that contract. As Leidos In August 2012, SAIC announced plans to split into two publicly traded companies. The company spun off about a third of its business, forming an approximately $4 billion-per-year service company focused on government services, including systems engineering, technical assistance, financial analysis, and program office support. The remaining part became a $7 billion-per-year IT company specializing in technology for the national security, health, and engineering sectors. The smaller company was led by Tony Moraco, who beforehand was leading SAIC's Intelligence, Surveillance and Reconnaissance group, and the bigger one was led by John P. Jumper. The split has allowed both companies to pursue more business, which it could not pursue as a single company which would have resulted in conflicts of interest. In February 2013, it was announced that the smaller spin-off company would get the name \"Science Applications International Corporation\" and stay in the current headquarters, while the larger company would change its name to Leidos, (created by clipping the word kaleidoscope) and would move its headquarters to Reston, Virginia. The split was structured in a way that SAIC changed its name to Leidos, then spun off the new SAIC as a separate publicly traded company. However, Leidos is the legal successor of the original SAIC and retains SAIC's pre-2013 stock price and corporate filing history. Before the split, Leidos employed 39,600 employees and reported $11.17 billion in revenue and $525 million net income for its fiscal year ended January 31, 2013, making it number 240 on the Fortune 500 list. In 2014, Leidos reported US$5.06 billion in revenue. In August 2016, the deal to merge with the entirety of Lockheed Martin's Information Systems & Global Solutions (IS&GS) business came to a close, more than doubling the size of Leidos and its portfolio, and positioning the company as the global defense industry's largest enterprise in the federal technology sector. In January 2020, Leidos purchased defense contractor Dynetics for approximately $1.65 billion. In May 2020 it purchased the Security Detection and Automation Systems division of L3Harris (notable for providing the detection screeners that all airport travelers pass through when flying). As of December 2023, the company has 47,000 employees. In 2023, Leidos reported US$15.4 billion in revenue. It ranked 266 on the 2024 Fortune 500 list. On March 4, 2025, the Chinese Ministry of Commerce placed 15 U.S. entities (including Leidos) on its export control list, barring the export of dual-use commodities to that business. In May, the Department of Homeland Security terminated for convenience its $2.4 billion cybersecurity services contract with Leidos. Structure Leidos has four central divisions: Civil, Health, Advanced Solutions, and Defense & Intelligence. The Civil Division focuses on integrating aviation systems, securing transportation measures, modernizing IT infrastructure, and engineering energy efficiently. The Health Division focuses on optimizing medical enterprises, securing private medical data, and improving collection and data entry methods. The Advanced Solutions Division is centered around data analysis, integrating advanced defense and intelligence systems, and increasing surveillance and reconnaissance efficiency. The Defense & Intelligence Division focuses on providing air service systems, geospatial analysis, cybersecurity, intelligence analysis, and supporting operations efforts. Management Retired Air Force general John P. Jumper was appointed CEO in 2012, and he oversaw the restructuring of SAIC into SAIC and Leidos. On July 1, 2014, Leidos announced that Roger Krone would become its CEO on July 14, 2014. On February 27, 2023, Leidos announced the appointment of Thomas Bell as Chief Executive Officer starting on May 3, 2023. Subsidiaries Dynetics, Inc., a wholly owned subsidiary of Leidos since Jan 2020. Leidos Biomedical Research, Inc., formerly SAIC - Frederick, a wholly owned subsidiary of Leidos manages Frederick National Laboratory for Cancer Research. Gibbs & Cox, a wholly owned subsidiary of Leidos since May 7, 2021. MEDPROTECT, LLC supports US government health-payer organizations Reveal, develops dual-energy X-ray computed tomography systems for explosives-detection at airports and similar facilities CloudShield Technologies a wholly owned subsidiary, specializing in cyber-security Varec, Inc., liquid petroleum asset management company Leidos Health Leidos Canada, formerly SAIC Canada, wholly owned subsidiary, works with Canadian government. Leidos Australia (Leidos Pty Ltd), wholly owned subsidiary, specializing in document technologies and cyber-security. Produces TeraText software. Leidos UK (Leidos Innovations UK Ltd, Leidos Europe Ltd, Leidos Supply Ltd & Leidos Ltd), wholly owned subsidiary, specializing in managed IT Services, developing of bespoke products. Produces, supports & maintains the Chroma Airport Suite, also responsible for the MOD's Supply Chain. Leidos Engineering, LLC, formerly SAIC Energy, Environment & Infrastructure LLC, assembles the legacy of engineering capabilities of Benham Investment Holdings, LLC, R. W. Beck Group, Inc., and Patrick Energy Services. Leidos QTC Health Services (formerly QTC Management), acquired by merging with Lockheed Martin IS&GS. Systems Made Simple (SMS), acquired by merging with Lockheed Martin IS&GS. Former subsidiaries AMSEC LLC, a business partnership between SAIC and Northrop Grumman subsidiary Newport News Shipbuilding divested on July 13, 2007. Network Solutions was acquired by SAIC in 1995, and subsequently was acquired by VeriSign, Inc. for $21 billion.Leidos Cyber, Inc., formerly Lockheed Martin Industrial Defender, acquired by merging with Lockheed Martin IS&GS, was sold to Capgemini in 2018. Controversies As SAIC Then-SAIC had as part of its management and on its board of directors, many well-known ex-government personnel including Melvin Laird, Secretary of Defense in the Nixon administration; William Perry, Secretary of Defense for Bill Clinton; John M. Deutch, Director of Central Intelligence under President Clinton; Admiral Bobby Ray Inman who served in various capacities in the National Security Agency (NSA) and Central Intelligence Agency (CIA) for the Ford, Carter and Reagan administrations; and David Kay who led the search for weapons of mass destruction after the 1991 Gulf War and served under the Bush administration after the 2003 invasion of Iraq. In 2022, 30 out of 38 Leidos Inc. lobbyists previously held government jobs. In June 2001, the Federal Bureau of Investigation (FBI) paid SAIC US$122 million to create a Virtual Case File (VCF) software system to speed up the sharing of information among agents. But the FBI abandoned VCF when it failed to function adequately. Robert Mueller, FBI Director, testified to a congressional committee, \"When SAIC delivered the first product in December 2003 we immediately identified a number of deficiencies – 17 at the outset. That soon cascaded to 50 or more and ultimately to 400 problems with that software ... We were indeed disappointed.\" In 2005, then-SAIC executive vice president Arnold L. Punaro claimed that the company had \"fully conformed to the contract we have and gave the taxpayers real value for their money.\" He blamed the FBI for the initial problems, saying the agency had a parade of program managers and demanded too many design changes. He stated that during 15 months that SAIC worked on the program, 19 different government managers were involved and 36 contract modifications were ordered. \"There were an average of 1.3 changes every day from the FBI, for a total of 399 changes during the period,\" Punaro said. In 2011–2012, then-SAIC was among the 8 top contributors to federal candidates, parties, and outside groups with US$1,209,611 (equivalent to $1,656,706 in 2024) during the 2011–2012 election cycle according to information from the Federal Election Commission. The top candidate recipient was Barack Obama. As Leidos In a heavily redacted report dated January 3, 2018, the Inspector General for the Department of Defense determined that a supervisor at Leidos made “inappropriate sexual and racial comments to” a female contractor, and that when she complained of a hostile work environment, Leidos retaliated by excluding her from further work on an additional contract. The report found that Leidos's claim that the contract employee “exhibited poor performance throughout her employment\" lacked supporting evidence. It recommended that U.S. Secretary of Defense Jim Mattis “consider appropriate action against Leidos” such as “compensatory damages, including back pay, employee benefits and other terms and conditions of employment” that the contractor would have received under the additional contract. In 2018, Leidos donated to the Senate campaign of Cindy Hyde-Smith. However, after a video was released showing Hyde-Smith speaking fondly of participating in \"public hangings\", Leidos said the company would never have made the donation if it had known about the comment. During Hyde-Smith's 2020 re-election bid, Leidos again donated to her. In 2022, it was revealed Leidos is embroiled in dual criminal investigations concerning potential foreign bribery and antitrust violations. In August 2023, the company received a grand jury subpoena from the Justice Department’s antitrust division related to three government contracts from 2021 and 2022, coinciding with heightened enforcement of antitrust laws by the Biden administration. Additionally, in September 2023, Leidos was served with a separate grand jury subpoena regarding possible violations of the U.S. Foreign Corrupt Practices Act, linked to activities within its international operations that were identified in late 2021. The company has stated that it is cooperating with the investigations and conducting its own internal reviews into both matters. Leidos is facing scrutiny following the leak of internal documents reportedly stolen by hackers, believed to be linked to a previously disclosed breach of a Diligent Corp. system that Leidos utilized. The company is currently investigating the matter, which led to a more than 4% drop in its shares during after-hours trading. A spokesperson confirmed that the leak originated from a prior incident involving a third-party vendor and emphasized that it did not affect Leidos' network or sensitive customer data. The breach is thought to be connected to a 2022 hack of Diligent's subsidiary, Steele Compliance Solutions, which affected fewer than 15 customers, including Leidos. Diligent stated that it promptly notified impacted clients and took corrective actions following the incident. Leidos is facing increasing scrutiny regarding its handling of sexual assault and harassment incidents at facilities operated for the U.S. Antarctic Program (USAP). In a letter from House Science Committee Chair Frank Lucas (R-OK) and Ranking Member Zoe Lofgren (D-CA), the company was criticized for allegedly failing to address these serious issues adequately. This concern follows a 2021 National Science Foundation (NSF) report that highlighted pervasive problems of sexual misconduct in Antarctica. The committee accused Leidos of inaccurately reporting that it had received no sexual assault allegations and claimed that its employees were not fully cooperating with NSF investigators. Leidos has reported five allegations of sexual harassment and zero of sexual assault between May 2017 and April 2022, a claim that Lucas and Lofgren disputed, citing evidence of prior reports. The NSF has since implemented new measures to combat these issues through its Sexual Assault and Harassment Prevention and Response (SAHPR) program. The controversy has drawn attention to the broader challenges of addressing sexual misconduct in remote work environments, with advocacy groups like Ice Allies calling for more robust action since 2019."
}