{
  "ticker": "LEN",
  "cik": "0000920760",
  "company_name": "Lennar",
  "corrected_name": "Lennar",
  "wiki_title_used": "Lennar",
  "exists": true,
  "raw_text": "Lennar Corporation is an American home construction company based in Miami-Dade County, Florida. As of 2025, it is the second-largest home construction company in the United States based on the number of homes sold. Lennar has investments in multifamily and single-family residential rental properties, luxury development, property technology with LenX, and mortgage lending from Lennar Mortgage.\nWith a total annual revenue of over $35 billion in 2024, Lennar operates in 30 states and 75 markets nationwide. In 2023, the company was ranked 119th on the Fortune 500. Lennar stock (LEN) was added to the New York Stock Exchange in 1982 and as of 2024 has a market cap of around $47 billion.\nThe name Lennar is a portmanteau of the first names of two of the company's founders, Leonard Miller and Arnold Rosen.\n\nHistory\n20th century\nLennar dates back to F&R Builders, a company founded in 1954 by Gene Fisher and real estate developer Arnold P. Rosen. In 1956, Leonard Miller, who later became the namesake of the Miller School of Medicine at the University of Miami, a 23-year-old entrepreneur that owned 42 lots in Miami-Dade County, Florida, invested $10,000 and partnered with the company.\nIn 1969, Lennar reached an equity base of $1 million, and by 1971, Miller and Rosen changed the name to Lennar Corporation. That year the firm became a public company via an initial public offering, raising $8.7 million. It was listed on the New York Stock Exchange in 1972.\nIn 1973, the company acquired Mastercraft Homes, based in Phoenix, Arizona, for approximately $2 million, as well as the Womack Development Company. Shortly thereafter, the company established operations in the Midwestern United States, purchasing Bert L. Smokler & Company, based in Detroit, Michigan, and Dreyfus Interstate Development Corp., based in Minneapolis–Saint Paul.\nLennar acquired H. Miller & Sons in 1984 for $24 million.\nIn January 1989, the company acquired Richmond American Homes of Florida for $18 million.\nIn February 1992, the company acquired Amerifirst's $1 billion real estate portfolio in a joint venture with Morgan Stanley.\nIn October 1992, following Hurricane Andrew, the company faced several lawsuits from homeowners alleging careless building quality.\nIn July 1993, the company formed a joint venture with Westinghouse Electric Corporation and Lehman Brothers to acquire a $2 billion face-value loan portfolio from Westinghouse Electric Corporation for $1.1 billion.\nIn 1995, the company acquired Friendswood Development Company from Exxon, and acquired California company Bramalea.\nIn 1996, the company acquired Winncrest Homes. The company also acquired 2,200 acres (8.9 km2) acres in and took over management of Coto de Caza, California, a census-designated place and a gated community, from Chevron Corporation.\nIn 1997, Stuart Miller, the son of co-founder Leonard Miller, became CEO of the company. Leonard Miller died in 2002. Stuart Miller served as Lennar's CEO until 2018 when he pivoted to an executive chairman position. As Lennar CEO, Stuart Miller is credited for navigating the company through the US housing crisis from 2007 to 2010.\nIn 1997, the company acquired West Venture Homes. In 2002, the company merged with Pacific Greystone, and acquired Theyst Venture Homes, which held 2700 homes in the North Natomas Community and 800 in San Diego. In 1998, the company acquired North American Title Company, Winncrest Homes, Polygon, and ColRich Communities. The company also acquired 3 closely held home construction companies operating in California for $370 million. The following year the company acquired Eagle Home Mortgage and Souththeyst Land Title.\n\n21st century\nIn 2000, the company acquired U.S. Home Corporation for $476 million in cash and stock, which resulted in the company doubling in size.\nIn 2001, the company acquired home building operations from Fortress Investment Group.\nIn 2002, the company acquired Patriot Homes based in Columbia, Maryland, Barry Andrews Homes in Baltimore, Maryland, as well as Don Galloway Homes, The Genesee Company, Cambridge Homes, and Sunstar Communities. It also acquired Concord Homes and Summit Homes, both based in Chicago.\nThe company then acquired 650 acres (2.6 km2) on Mare Island, in a closed Navy base, for redevelopment.\nIn 2003, Lennar acquired Coleman Homes.\nIn 2004, the company acquired Newhall Land and Farming Company for $990 million. The company also acquired the assets of Queens Properties for $33.8 million, in addition to Connel-Barron Homes and Classic American Homes.\nIn 2005, Lennar acquired Barker Coleman Homes, and the company acquired the 3,718-acre Marine Corps Air Station El Toro for redevelopment.\nIn 2006, Lennar spun off its commercial servicing division, LNR Property Corporation, which was acquired by Starwood Capital Group in 2012.\nIn November 2006, Lennar chairman Robert J. Strudler died.\nIn December 2007, during the subprime mortgage crisis, the company sold an 80% interest in 11,000 properties for 40% of their previously stated book value to Morgan Stanley.\nIn 2007, Lennar founded Rialto Capital Management, which was originated to acquire distressed real estate and mortgage debt.\nIn 2008 and 2009, former businessman and convicted felon Barry Minkow engaged in an extortion scheme, spreading false information about the company that resulted in its stock price falling 26% in one day. Minkow was sentenced to 5 years in prison and was ordered to pay $584 million in restitution.\nSan Diego real estate developer Nicolas Marsch III hired Minkow to back his claims that Lennar cheated Marsch out of millions of dollars on a private golf community. After a trial, a Superior Court judge decided in July 2010 that Marsch actually owed Lennar $17 million for the development. A subsequent civil suit filed by Lennar against Marsch resulted in a $1 billion judgement in December 2013 for Lennar, $802 million in damages and $200 million in punitive damages.\nIn February 2017, the company acquired WCI Communities, which operated in Florida, for $643 million.\nIn 2018, Burger King moved into a new headquarters down the street from its old one, and Lennar moved into Burger King's former headquarters in the Waterford District near Miami International Airport.\nIn February 2018, the company acquired CalAtlantic Homes. The same year, Lennar developed a venture capital arm, Lennar Ventures, dubbed LenX. In 2021, LenX announced strategic partnerships with companies ICON and Veev. With Veev's collapse in 2023, LenX acquired the company.\nIn November 2024, Lennar acquired Arkansas based builder Rausch Coleman Homes. With this acquisition, Lennar entered the Birmingham, Kansas City, Little Rock, Northwest Arkansas, Tulsa and Tuscaloosa markets. In addition, it expanded its presence in Houston, Huntsville, Northwest Florida, Oklahoma City and San Antonio.\nIn February 2025, Lennar spun off Millrose Properties, Inc., a \"first-of-its-kind\" homesite option purchase platform. Millrose became an independent publicly traded company and began trading on the NYSE under the symbol \"MRP.\"\n\nCorporate affairs\nLennar Foundation\nFounded in 1989, the Lennar Foundation receives $1,000 per home sold by the company to fund Focused Acts of Caring and various grants, with a focus on supporting at-risk children, medical research, and other philanthropic efforts. The foundation also partners with the Miami Dolphins Challenge Cancer initiative and regularly donates to the Sylvester Comprehensive Cancer Center at the University of Miami.\n\nFacilities\nLennar is headquartered in Miami as part of the Waterford Business District located near the Miami International Airport neighboring other large companies. The company moved into the new 200,000 square feet facility in 2019 as part of a lease and later purchased the property in 2023. Other corporate office locations include Dallas and Irvine, California in addition to dozens of Lennar Welcome Home Centers across the nation.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Lennar Corporation:",
  "clean_text": "Lennar Corporation is an American home construction company based in Miami-Dade County, Florida. As of 2025, it is the second-largest home construction company in the United States based on the number of homes sold. Lennar has investments in multifamily and single-family residential rental properties, luxury development, property technology with LenX, and mortgage lending from Lennar Mortgage. With a total annual revenue of over $35 billion in 2024, Lennar operates in 30 states and 75 markets nationwide. In 2023, the company was ranked 119th on the Fortune 500. Lennar stock (LEN) was added to the New York Stock Exchange in 1982 and as of 2024 has a market cap of around $47 billion. The name Lennar is a portmanteau of the first names of two of the company's founders, Leonard Miller and Arnold Rosen. History 20th century Lennar dates back to F&R Builders, a company founded in 1954 by Gene Fisher and real estate developer Arnold P. Rosen. In 1956, Leonard Miller, who later became the namesake of the Miller School of Medicine at the University of Miami, a 23-year-old entrepreneur that owned 42 lots in Miami-Dade County, Florida, invested $10,000 and partnered with the company. In 1969, Lennar reached an equity base of $1 million, and by 1971, Miller and Rosen changed the name to Lennar Corporation. That year the firm became a public company via an initial public offering, raising $8.7 million. It was listed on the New York Stock Exchange in 1972. In 1973, the company acquired Mastercraft Homes, based in Phoenix, Arizona, for approximately $2 million, as well as the Womack Development Company. Shortly thereafter, the company established operations in the Midwestern United States, purchasing Bert L. Smokler & Company, based in Detroit, Michigan, and Dreyfus Interstate Development Corp., based in Minneapolis–Saint Paul. Lennar acquired H. Miller & Sons in 1984 for $24 million. In January 1989, the company acquired Richmond American Homes of Florida for $18 million. In February 1992, the company acquired Amerifirst's $1 billion real estate portfolio in a joint venture with Morgan Stanley. In October 1992, following Hurricane Andrew, the company faced several lawsuits from homeowners alleging careless building quality. In July 1993, the company formed a joint venture with Westinghouse Electric Corporation and Lehman Brothers to acquire a $2 billion face-value loan portfolio from Westinghouse Electric Corporation for $1.1 billion. In 1995, the company acquired Friendswood Development Company from Exxon, and acquired California company Bramalea. In 1996, the company acquired Winncrest Homes. The company also acquired 2,200 acres (8.9 km2) acres in and took over management of Coto de Caza, California, a census-designated place and a gated community, from Chevron Corporation. In 1997, Stuart Miller, the son of co-founder Leonard Miller, became CEO of the company. Leonard Miller died in 2002. Stuart Miller served as Lennar's CEO until 2018 when he pivoted to an executive chairman position. As Lennar CEO, Stuart Miller is credited for navigating the company through the US housing crisis from 2007 to 2010. In 1997, the company acquired West Venture Homes. In 2002, the company merged with Pacific Greystone, and acquired Theyst Venture Homes, which held 2700 homes in the North Natomas Community and 800 in San Diego. In 1998, the company acquired North American Title Company, Winncrest Homes, Polygon, and ColRich Communities. The company also acquired 3 closely held home construction companies operating in California for $370 million. The following year the company acquired Eagle Home Mortgage and Souththeyst Land Title. 21st century In 2000, the company acquired U.S. Home Corporation for $476 million in cash and stock, which resulted in the company doubling in size. In 2001, the company acquired home building operations from Fortress Investment Group. In 2002, the company acquired Patriot Homes based in Columbia, Maryland, Barry Andrews Homes in Baltimore, Maryland, as well as Don Galloway Homes, The Genesee Company, Cambridge Homes, and Sunstar Communities. It also acquired Concord Homes and Summit Homes, both based in Chicago. The company then acquired 650 acres (2.6 km2) on Mare Island, in a closed Navy base, for redevelopment. In 2003, Lennar acquired Coleman Homes. In 2004, the company acquired Newhall Land and Farming Company for $990 million. The company also acquired the assets of Queens Properties for $33.8 million, in addition to Connel-Barron Homes and Classic American Homes. In 2005, Lennar acquired Barker Coleman Homes, and the company acquired the 3,718-acre Marine Corps Air Station El Toro for redevelopment. In 2006, Lennar spun off its commercial servicing division, LNR Property Corporation, which was acquired by Starwood Capital Group in 2012. In November 2006, Lennar chairman Robert J. Strudler died. In December 2007, during the subprime mortgage crisis, the company sold an 80% interest in 11,000 properties for 40% of their previously stated book value to Morgan Stanley. In 2007, Lennar founded Rialto Capital Management, which was originated to acquire distressed real estate and mortgage debt. In 2008 and 2009, former businessman and convicted felon Barry Minkow engaged in an extortion scheme, spreading false information about the company that resulted in its stock price falling 26% in one day. Minkow was sentenced to 5 years in prison and was ordered to pay $584 million in restitution. San Diego real estate developer Nicolas Marsch III hired Minkow to back his claims that Lennar cheated Marsch out of millions of dollars on a private golf community. After a trial, a Superior Court judge decided in July 2010 that Marsch actually owed Lennar $17 million for the development. A subsequent civil suit filed by Lennar against Marsch resulted in a $1 billion judgement in December 2013 for Lennar, $802 million in damages and $200 million in punitive damages. In February 2017, the company acquired WCI Communities, which operated in Florida, for $643 million. In 2018, Burger King moved into a new headquarters down the street from its old one, and Lennar moved into Burger King's former headquarters in the Waterford District near Miami International Airport. In February 2018, the company acquired CalAtlantic Homes. The same year, Lennar developed a venture capital arm, Lennar Ventures, dubbed LenX. In 2021, LenX announced strategic partnerships with companies ICON and Veev. With Veev's collapse in 2023, LenX acquired the company. In November 2024, Lennar acquired Arkansas based builder Rausch Coleman Homes. With this acquisition, Lennar entered the Birmingham, Kansas City, Little Rock, Northwest Arkansas, Tulsa and Tuscaloosa markets. In addition, it expanded its presence in Houston, Huntsville, Northwest Florida, Oklahoma City and San Antonio. In February 2025, Lennar spun off Millrose Properties, Inc., a \"first-of-its-kind\" homesite option purchase platform. Millrose became an independent publicly traded company and began trading on the NYSE under the symbol \"MRP.\" Corporate affairs Lennar Foundation Founded in 1989, the Lennar Foundation receives $1,000 per home sold by the company to fund Focused Acts of Caring and various grants, with a focus on supporting at-risk children, medical research, and other philanthropic efforts. The foundation also partners with the Miami Dolphins Challenge Cancer initiative and regularly donates to the Sylvester Comprehensive Cancer Center at the University of Miami. Facilities Lennar is headquartered in Miami as part of the Waterford Business District located near the Miami International Airport neighboring other large companies. The company moved into the new 200,000 square feet facility in 2019 as part of a lease and later purchased the property in 2023. Other corporate office locations include Dallas and Irvine, California in addition to dozens of Lennar Welcome Home Centers across the nation."
}