{
  "ticker": "LH",
  "cik": "0000920148",
  "company_name": "Labcorp",
  "corrected_name": "Labcorp",
  "wiki_title_used": "Labcorp",
  "exists": true,
  "raw_text": "Labcorp Holdings Inc., operating under the brand name Labcorp, headquartered in Burlington, North Carolina, provides laboratory services used for diagnosis and healthcare decisions. It operates one of the largest clinical laboratory networks in the world and has operations in over 100 countries; although its operations are primarily in the U.S.\nIts Diagnostics Laboratories segment operates 2,000 patient service centers with more than 6,000 in-office phlebotomists in the United States. In addition to healthcare testing such as oncology testing, human immunodeficiency virus (HIV) genotyping and phenotyping, it provides testing for: employment, DNA testing to determine parentage and to determine immigration eligibility, environmental issues, wellness, toxicology, pain management, and medical drug monitoring. It also provides 50 tests that patients can complete at home. It processes over 160 million tests per year. Approximately 10% of this segment’s revenue are from the U.S. Medicare health insurance program.\nIts Biopharma Laboratory Services segment provides drug development, medical device and diagnostic development services to pharmaceutical, biotechnology, medical device, and diagnostic companies. In 2023, this division provided support to 84% of the new drugs and therapeutic products approved by the Food and Drug Administration.\nLabcorp performs its largest volume of specialty testing at its Center for Esoteric Testing in Burlington, North Carolina.\nLabcorp was an early pioneer of genomic testing using polymerase chain reaction (PCR) technology at its Center for Molecular Biology and Pathology in Research Triangle Park, North Carolina, where it also performs other molecular diagnostics. Labcorp operates the National Genetics Institute, Inc. (NGI), in Los Angeles, California, which develops PCR testing methods.\n\nHistory\n1971-2000\nIn 1971, Revlon acquired DCL BioMedical, a clinical laboratory business founded in 1968. In 1974, it changed its name to National Health Laboratories Incorporated. By 1977, it operated clinical testing laboratories in 13 cities and maintained auxiliary service centers and satellite laboratories in 15 other cities. In 1978, it acquired American Biomedical Corporation, giving it operations in the Southwestern United States and data processing technology. In 1985, Revlon was acquired by Ronald Perelman. Revlon divested its other businesses and a major stake in the company was acquired by MacAndrews & Forbes.\nIn 1988, National Health Laboratories became a public company via an initial public offering on the NASDAQ exchange.\nIn 1989, the company generated revenue of about US$400 million, with about US$70 million in earnings.\nIn the early 1990s, worries about malpractice lawsuits led doctors to conduct more clinical testing before diagnosing, which increased business for the company.\nIn 1990, the company's revenues reached US$500 million, with over US$70 million in earnings.\nIn 1991, National Health Laboratories moved its listing from the NASDAQ to the New York Stock Exchange.\nIn June 1992, the company offered to acquire Damon Corporation for $260 million in cash and stock. However, the company was outbid by Corning Inc., which acquired Damon for $370 million.\nBy 1993, the company had 22 major laboratories.\nOn March 8, 1994, National Health Laboratories Inc. reorganized as a holding company, National Health Laboratories Holdings Inc.\nIn 1994, National Health Laboratories acquired Allied Clinical Laboratories. The acquisition price was reduced to $204 million after federal officials issued subpoenas in an investigation of Medicare billing practices.\nIn April 1995, Hoffmann-La Roche, a division of Roche, contributed Roche Biomedical Laboratories, Inc. and US$186.7 million in cash to National Health Laboratories Holdings, in exchange for 49.9% of the combined company. Perelman received about US$100 million from the deal, which made the new company the largest blood-testing company in the United States. The company changed its name to Laboratory Corporation of America Holdings and relocated its headquarters to Burlington, North Carolina.\nIn July 1998, Labcorp acquired the Michigan-based laboratory division of Universal Standard Healthcare (UHCI) and made an equity investment in the company. Labcorp also became UHCI's clinical laboratory long-term testing provider but terminated this agreement in March 1999.\n\n2000s\nIn June 2000, Labcorp acquired the laboratory testing business of Pathology Medical Laboratories.\nIn May 2001, Labcorp acquired Path Lab Holdings, the largest regional laboratory in New England.\nIn June 2001, it acquired ViroMed, which specialized on clinical diagnostic testing in virology, molecular biology, serology, microbiology, mycology and mycobacteriology, as well as in tissue and eye bank testing. In 2013, it closed the Viromed facility in Minnetonka, Minnesota and laid off 79 workers.\nIn December 2001, Labcorp became the exclusive marketer for genomics and proteomics tests for breast cancer, colon cancer, melanoma, and hypertension made by Myriad Genetics.\nIn March 2002, Roche sold its remaining interest in the company.\nIn May 2002, Labcorp acquired Dynacare, a Canadian medical laboratory services company, for $480 million.\nIn January 2003, Labcorp acquired Dianon, a provider of oncology and genomic diagnostic testing services, for $598 million in cash.\nIn February 2005, the company acquired US Pathology Labs Inc., a provider of anatomical pathology and oncology testing services, for $155 million.\nIn March 2005, Labcorp acquired Esoterix, a provider of specialty reference testing, for approximately $150 million in cash from Behrman Capital.\nIn November 2006, Labcorp acquired Litholink, a kidney stone analysis laboratory.\nIn January 2008, Labcorp acquired Tandem Labs, a contract research organization specializing in advanced mass spectrometry, immunoanalytical support, pharmacokinetics, and pharmacodynamics.\nIn June 2009, Labcorp acquired Monogram Biosciences, a diagnostic lab specializing in HIV resistance testing, for approximately $155 million including debt.\n\n2010s\nIn September 2010, Labcorp acquired Genzyme Genetics, formerly a division of Genzyme Corporation, with 9 testing laboratories and approximately 1,900 employees, for $925 million in cash.\nIn February 2011, Labcorp acquired the assets of bankrupt Westcliff Medical Laboratory. The FTC challenged the acquisition but lost in court.\nIn June 2011, Labcorp acquired Canadian central labs partner Clearstone from Czura Thornton, adding laboratories in China, France, Singapore and Canada, and the central laboratory protocol management system APOLLO CLPM.\nIn November 2011, Labcorp acquired more than 90% of the shares of DNA testing company Orchid Cellmark for $85 million. To receive approval of the transaction from the Federal Trade Commission, Labcorp sold parts of Orchid's DNA paternity testing business to DNA Diagnostics Center.\nIn May 2012, Labcorp Clinical Trials sold its European biological sampling kit building operation located in Hamburg to Marken.\nIn August 2012, Labcorp acquired testing lab Medtox Scientific for $241 million.\nIn September 2013, Labcorp acquired MuirLab, the clinical laboratory outreach business of John Muir Health.\nIn November 2014, Labcorp acquired LipoScience, a developer of diagnostic tests based on nuclear magnetic resonance spectroscopy measuring heart disease risk, for $85 million.\nIn December 2014, Labcorp acquired Bode Technology Group, a provider of forensic DNA analysis, DNA collection products, and relationship testing and the largest DNA forensic testing company in the U.S., from SolutionPoint International.\nIn February 2015, Labcorp acquired Covance for $6.1 billion.\nIn October 2015, Labcorp acquired Safe Foods International Holdings and its two operating companies, International Food Network and The National Food Laboratory, expanding its capabilities in food and beverage product-development and product-integrity.\nIn March 2016, Labcorp acquired Pathology Inc., a provider of reproductive donor testing as well as anatomic, molecular and digital pathology services focused on women's health.\nIn September 2016, Labcorp acquired Sequenom for $371 million including debt, expanding its operations in Europe and Asia.\nIn October 2016, Labcorp acquired ClearPath Diagnostics, a provider of laboratory diagnostic services in the Northeastern United States, from Shore Capital Partners.\nIn May 2017, Labcorp acquired Pathology Associates Medical Laboratories from Providence Health & Services and Catholic Health Initiatives.\nIn September 2017, Labcorp acquired Chiltern, a contract research organization (CRO), for $1.2 billion, and contributed it to Covance.\nIn 2019, Labcorp acquired Wellness Corporate Solutions, a workplace wellness company.\n\n2020s\nDuring the COVID-19 pandemic, the company was one of the major developers and processors of COVID-19 testing. In March 2020, Labcorp received emergency use authorization from the FDA for a test for SARS-CoV-2. In April 2020, the company developed the first COVID-19 test in which people were able to collect a sample at home. In July 2020, the company was processing 165,000 COVID-19 tests per day.\nIn December 2021, the company acquired Toxikon, a contract research organization developing non-clinical testing services. \nIn February 2022, the company acquired Personal Genome Diagnostics and its liquid biopsy and tissue-based genomic product, for $450 million in cash plus a possible earn-out of an additional $125 million. \nAlso in February 2022, Labcorp entered into agreements with Ascension, one of the nation’s largest Catholic and nonprofit health systems, to manage Ascension's hospital-based laboratories in ten states and purchase assets of the health system's outreach laboratory business.\nIn June 2023, Labcorp completed the corporate spin-off of Fortrea.\nIn August 2024, Labcorp acquired the assets of bankrupt Invitae for $234 million.\n\nAcquisition history\nControversies\nOverbilling the government\nIn 1992, the company was one of the first to be prosecuted as part of Operation Labscam, a nationwide crackdown on fraud in the healthcare system initiated by the U.S. Attorney's Office in San Diego, California. The company and others were accused of routinely submitting false claims to Medicare and Medicaid for unnecessary tests on blood samples that physicians had never ordered. In addition, charges for the tests billed to the government were significantly higher than what the company charged private insurers. That year, the company agreed to pay $111 million to settle claims. In November 1996, the company agreed to pay a total of $182 million as a result of the investigation.\nIn February 2023, the company paid $19 million to resolve allegations that it violated the False Claims Act of 1863 by its submission of false claims to Medicare.\n\nConflicts of interest\nIn 2012, Labcorp was criticized for its practice of paying the salaries of genetic counselors in hospitals and doctors' offices, which is perceived to be a possible conflict of interest.\n\nData breaches\nIn July 2018, Labcorp's servers were affected by a variant of the SamSam ransomware, with the goal of locking or disabling computers and servers to prevent access to data. The attack resulted in delays, but no data was believed to have been stolen. The malware was blocked on the network by midnight on July 14, 2018.\n\nFaulty paternity tests\nLabcorp has been criticized over faulty paternity tests, many of which have resulted in lawsuits. The most notable case was the 2005 false accusation of Washington hairdresser Andre Chreky, who spent $200,000 and years in court proving, despite a false-positive test, that he was not the father. In the trial, it was determined that only five people at Labcorp reviewed data and made paternity determinations, including during 10 hour shifts that required making determinations every 4 minutes.\n\nSharing of patient data\nIn 2024, Labcorp faced a class action lawsuit for allowing Google to collect confidential patient information such as appointments made and website login details.\n\nLabor concerns\nEmployees have criticized the company's productivity goals, in which they say volume and speed of work done is prioritized over quality. Labs face staffing shortages and employees say they are overworked.\nLabcorp has been criticized for its process of having all employees terminated upon hospital laboratory management acquisitions, and making them reapply with LabCorp, thereby losing accrued employee benefits, including employee eligibility for Public Service Loan Forgiveness (PSLF) in the case of non-profit hospitals.\nIn 2024, Labcorp stated that its goal is to \"operate the company in a non-union environment.\" After Labcorp became the manager of laboratories of Legacy Health, outsourced laboratory personnel unionized with the Oregon Federation of Nurses and Health Professionals.\n\nAircraft\nLabcorp (ICAO: SKQ, call sign: SKYLAB) utilizes a fleet of 12 Pilatus PC-12 and a single Pilatus PC-24 aircraft on nightly runs from Burlington for use on the East Coast. Prior to the acquisition of PC-12 aircraft Labcorp utilized seven PA-31-350s.\n\nNotable employees\nMark Elliott Brecher, retired Chief Medical Officer of LabCorp, Emeritus Professor University of North Carolina\n\nReferences\nExternal links\nOfficial website \nBusiness data for Laboratory Corporation of America Holdings: \nLabcorp Profile at Wikinvest",
  "clean_text": "Labcorp Holdings Inc., operating under the brand name Labcorp, headquartered in Burlington, North Carolina, provides laboratory services used for diagnosis and healthcare decisions. It operates one of the largest clinical laboratory networks in the world and has operations in over 100 countries; although its operations are primarily in the U.S. Its Diagnostics Laboratories segment operates 2,000 patient service centers with more than 6,000 in-office phlebotomists in the United States. In addition to healthcare testing such as oncology testing, human immunodeficiency virus (HIV) genotyping and phenotyping, it provides testing for: employment, DNA testing to determine parentage and to determine immigration eligibility, environmental issues, wellness, toxicology, pain management, and medical drug monitoring. It also provides 50 tests that patients can complete at home. It processes over 160 million tests per year. Approximately 10% of this segment’s revenue are from the U.S. Medicare health insurance program. Its Biopharma Laboratory Services segment provides drug development, medical device and diagnostic development services to pharmaceutical, biotechnology, medical device, and diagnostic companies. In 2023, this division provided support to 84% of the new drugs and therapeutic products approved by the Food and Drug Administration. Labcorp performs its largest volume of specialty testing at its Center for Esoteric Testing in Burlington, North Carolina. Labcorp was an early pioneer of genomic testing using polymerase chain reaction (PCR) technology at its Center for Molecular Biology and Pathology in Research Triangle Park, North Carolina, where it also performs other molecular diagnostics. Labcorp operates the National Genetics Institute, Inc. (NGI), in Los Angeles, California, which develops PCR testing methods. History 1971-2000 In 1971, Revlon acquired DCL BioMedical, a clinical laboratory business founded in 1968. In 1974, it changed its name to National Health Laboratories Incorporated. By 1977, it operated clinical testing laboratories in 13 cities and maintained auxiliary service centers and satellite laboratories in 15 other cities. In 1978, it acquired American Biomedical Corporation, giving it operations in the Southwestern United States and data processing technology. In 1985, Revlon was acquired by Ronald Perelman. Revlon divested its other businesses and a major stake in the company was acquired by MacAndrews & Forbes. In 1988, National Health Laboratories became a public company via an initial public offering on the NASDAQ exchange. In 1989, the company generated revenue of about US$400 million, with about US$70 million in earnings. In the early 1990s, worries about malpractice lawsuits led doctors to conduct more clinical testing before diagnosing, which increased business for the company. In 1990, the company's revenues reached US$500 million, with over US$70 million in earnings. In 1991, National Health Laboratories moved its listing from the NASDAQ to the New York Stock Exchange. In June 1992, the company offered to acquire Damon Corporation for $260 million in cash and stock. However, the company was outbid by Corning Inc., which acquired Damon for $370 million. By 1993, the company had 22 major laboratories. On March 8, 1994, National Health Laboratories Inc. reorganized as a holding company, National Health Laboratories Holdings Inc. In 1994, National Health Laboratories acquired Allied Clinical Laboratories. The acquisition price was reduced to $204 million after federal officials issued subpoenas in an investigation of Medicare billing practices. In April 1995, Hoffmann-La Roche, a division of Roche, contributed Roche Biomedical Laboratories, Inc. and US$186.7 million in cash to National Health Laboratories Holdings, in exchange for 49.9% of the combined company. Perelman received about US$100 million from the deal, which made the new company the largest blood-testing company in the United States. The company changed its name to Laboratory Corporation of America Holdings and relocated its headquarters to Burlington, North Carolina. In July 1998, Labcorp acquired the Michigan-based laboratory division of Universal Standard Healthcare (UHCI) and made an equity investment in the company. Labcorp also became UHCI's clinical laboratory long-term testing provider but terminated this agreement in March 1999. 2000s In June 2000, Labcorp acquired the laboratory testing business of Pathology Medical Laboratories. In May 2001, Labcorp acquired Path Lab Holdings, the largest regional laboratory in New England. In June 2001, it acquired ViroMed, which specialized on clinical diagnostic testing in virology, molecular biology, serology, microbiology, mycology and mycobacteriology, as well as in tissue and eye bank testing. In 2013, it closed the Viromed facility in Minnetonka, Minnesota and laid off 79 workers. In December 2001, Labcorp became the exclusive marketer for genomics and proteomics tests for breast cancer, colon cancer, melanoma, and hypertension made by Myriad Genetics. In March 2002, Roche sold its remaining interest in the company. In May 2002, Labcorp acquired Dynacare, a Canadian medical laboratory services company, for $480 million. In January 2003, Labcorp acquired Dianon, a provider of oncology and genomic diagnostic testing services, for $598 million in cash. In February 2005, the company acquired US Pathology Labs Inc., a provider of anatomical pathology and oncology testing services, for $155 million. In March 2005, Labcorp acquired Esoterix, a provider of specialty reference testing, for approximately $150 million in cash from Behrman Capital. In November 2006, Labcorp acquired Litholink, a kidney stone analysis laboratory. In January 2008, Labcorp acquired Tandem Labs, a contract research organization specializing in advanced mass spectrometry, immunoanalytical support, pharmacokinetics, and pharmacodynamics. In June 2009, Labcorp acquired Monogram Biosciences, a diagnostic lab specializing in HIV resistance testing, for approximately $155 million including debt. 2010s In September 2010, Labcorp acquired Genzyme Genetics, formerly a division of Genzyme Corporation, with 9 testing laboratories and approximately 1,900 employees, for $925 million in cash. In February 2011, Labcorp acquired the assets of bankrupt Westcliff Medical Laboratory. The FTC challenged the acquisition but lost in court. In June 2011, Labcorp acquired Canadian central labs partner Clearstone from Czura Thornton, adding laboratories in China, France, Singapore and Canada, and the central laboratory protocol management system APOLLO CLPM. In November 2011, Labcorp acquired more than 90% of the shares of DNA testing company Orchid Cellmark for $85 million. To receive approval of the transaction from the Federal Trade Commission, Labcorp sold parts of Orchid's DNA paternity testing business to DNA Diagnostics Center. In May 2012, Labcorp Clinical Trials sold its European biological sampling kit building operation located in Hamburg to Marken. In August 2012, Labcorp acquired testing lab Medtox Scientific for $241 million. In September 2013, Labcorp acquired MuirLab, the clinical laboratory outreach business of John Muir Health. In November 2014, Labcorp acquired LipoScience, a developer of diagnostic tests based on nuclear magnetic resonance spectroscopy measuring heart disease risk, for $85 million. In December 2014, Labcorp acquired Bode Technology Group, a provider of forensic DNA analysis, DNA collection products, and relationship testing and the largest DNA forensic testing company in the U.S., from SolutionPoint International. In February 2015, Labcorp acquired Covance for $6.1 billion. In October 2015, Labcorp acquired Safe Foods International Holdings and its two operating companies, International Food Network and The National Food Laboratory, expanding its capabilities in food and beverage product-development and product-integrity. In March 2016, Labcorp acquired Pathology Inc., a provider of reproductive donor testing as well as anatomic, molecular and digital pathology services focused on women's health. In September 2016, Labcorp acquired Sequenom for $371 million including debt, expanding its operations in Europe and Asia. In October 2016, Labcorp acquired ClearPath Diagnostics, a provider of laboratory diagnostic services in the Northeastern United States, from Shore Capital Partners. In May 2017, Labcorp acquired Pathology Associates Medical Laboratories from Providence Health & Services and Catholic Health Initiatives. In September 2017, Labcorp acquired Chiltern, a contract research organization (CRO), for $1.2 billion, and contributed it to Covance. In 2019, Labcorp acquired Wellness Corporate Solutions, a workplace wellness company. 2020s During the COVID-19 pandemic, the company was one of the major developers and processors of COVID-19 testing. In March 2020, Labcorp received emergency use authorization from the FDA for a test for SARS-CoV-2. In April 2020, the company developed the first COVID-19 test in which people were able to collect a sample at home. In July 2020, the company was processing 165,000 COVID-19 tests per day. In December 2021, the company acquired Toxikon, a contract research organization developing non-clinical testing services. In February 2022, the company acquired Personal Genome Diagnostics and its liquid biopsy and tissue-based genomic product, for $450 million in cash plus a possible earn-out of an additional $125 million. Also in February 2022, Labcorp entered into agreements with Ascension, one of the nation’s largest Catholic and nonprofit health systems, to manage Ascension's hospital-based laboratories in ten states and purchase assets of the health system's outreach laboratory business. In June 2023, Labcorp completed the corporate spin-off of Fortrea. In August 2024, Labcorp acquired the assets of bankrupt Invitae for $234 million. Acquisition history Controversies Overbilling the government In 1992, the company was one of the first to be prosecuted as part of Operation Labscam, a nationwide crackdown on fraud in the healthcare system initiated by the U.S. Attorney's Office in San Diego, California. The company and others were accused of routinely submitting false claims to Medicare and Medicaid for unnecessary tests on blood samples that physicians had never ordered. In addition, charges for the tests billed to the government were significantly higher than what the company charged private insurers. That year, the company agreed to pay $111 million to settle claims. In November 1996, the company agreed to pay a total of $182 million as a result of the investigation. In February 2023, the company paid $19 million to resolve allegations that it violated the False Claims Act of 1863 by its submission of false claims to Medicare. Conflicts of interest In 2012, Labcorp was criticized for its practice of paying the salaries of genetic counselors in hospitals and doctors' offices, which is perceived to be a possible conflict of interest. Data breaches In July 2018, Labcorp's servers were affected by a variant of the SamSam ransomware, with the goal of locking or disabling computers and servers to prevent access to data. The attack resulted in delays, but no data was believed to have been stolen. The malware was blocked on the network by midnight on July 14, 2018. Faulty paternity tests Labcorp has been criticized over faulty paternity tests, many of which have resulted in lawsuits. The most notable case was the 2005 false accusation of Washington hairdresser Andre Chreky, who spent $200,000 and years in court proving, despite a false-positive test, that he was not the father. In the trial, it was determined that only five people at Labcorp reviewed data and made paternity determinations, including during 10 hour shifts that required making determinations every 4 minutes. Sharing of patient data In 2024, Labcorp faced a class action lawsuit for allowing Google to collect confidential patient information such as appointments made and website login details. Labor concerns Employees have criticized the company's productivity goals, in which they say volume and speed of work done is prioritized over quality. Labs face staffing shortages and employees say they are overworked. Labcorp has been criticized for its process of having all employees terminated upon hospital laboratory management acquisitions, and making them reapply with LabCorp, thereby losing accrued employee benefits, including employee eligibility for Public Service Loan Forgiveness (PSLF) in the case of non-profit hospitals. In 2024, Labcorp stated that its goal is to \"operate the company in a non-union environment.\" After Labcorp became the manager of laboratories of Legacy Health, outsourced laboratory personnel unionized with the Oregon Federation of Nurses and Health Professionals. Aircraft Labcorp (ICAO: SKQ, call sign: SKYLAB) utilizes a fleet of 12 Pilatus PC-12 and a single Pilatus PC-24 aircraft on nightly runs from Burlington for use on the East Coast. Prior to the acquisition of PC-12 aircraft Labcorp utilized seven PA-31-350s. Notable employees Mark Elliott Brecher, retired Chief Medical Officer of LabCorp, Emeritus Professor University of North Carolina"
}