{
  "ticker": "LHX",
  "cik": "0000202058",
  "company_name": "L3Harris",
  "corrected_name": "L3Harris",
  "wiki_title_used": "L3Harris",
  "exists": true,
  "raw_text": "L3Harris Technologies, Inc. is an American technology company, defense contractor, and information technology services provider that produces products for command and control systems, wireless equipment, tactical radios, avionics and electronic systems, night vision equipment, intelligence, surveillance and reconnaissance (C3ISR) systems and products, ocean systems, instrumentation, navigation products, training devices and services, and both terrestrial/spaceborne antennas for use in the government, defense, and commercial sectors.\nThe company was formed from the merger of L3 Technologies and Harris Corporation on June 29, 2019, which made it the sixth-largest defense contractor in the United States.\n\nHistory\nThe \"Harris Automatic Press Company\" was founded by Alfred S. Harris in Niles, Ohio, in 1895. The company spent the next 60 years developing lithographic processes and printing presses before acquiring typesetting company Intertype Corporation. In 1967, they merged with Radiation, Inc. of Melbourne, Florida, a developer of antenna, integrated circuit, and modem technology used in the space race. The company headquarters was moved from Cleveland to Melbourne in 1978. In May 2015, Harris finalized the purchase of competitor Exelis Inc., almost doubling the size of the original company.\nL-3 Communications was formed in 1997 to acquire certain business units from Lockheed Martin that had previously been part of Loral Corporation. These units had belonged to Lockheed Corporation and Martin Marietta, which had merged three years before in 1993.  The company was founded by, and named for, Frank Lanza and Robert LaPenta in partnership with Lehman Brothers. Lanza and LaPenta had both served as executives at Loral and Lockheed. The company continued to expand through mergers and acquisitions to become one of the top ten U.S. government contractors. At the end of 2016, the company changed its name from L-3 Communications Holdings, Inc. to L3 Technologies, Inc. to better reflect the company's wider focus since its founding in 1997.\nBetween 1999 and August 2021, L3Harris and predecessors spent $131.9 million lobbying for ICE radio procurement ($20,000), the Intelligence Authorization Act ($​1,510,000), DHS fund appropriations for unmanned vehicles ($430,000), and night vision systems research ($20,000).\nIn 2008, 72 Iraqi civilians sued L3 Services and CACI for human rights violations including \"torture; cruel, inhuman, or degrading treatment; war crimes; assault and battery; sexual assault and battery; intentional infliction of emotional distress; negligent hiring and supervision; and negligent infliction of emotional distress.\" A settlement was reached on October 10, 2012, which was the \"first positive resolution to a U.S. civil case challenging detainee treatment outside the United States in the larger 'war on terror' context\".\nIn 2012, L3 subsidiary KDI Precision Products participated in the sale of 11,500 JDAM bomb fuzes to Israel, part of a $647 million contract deal. These were among the weapons used by the IDF in the 2014 Gaza War; after the use of weapons in densely populated civilian areas, the U.N. High Commissioner for Human Rights highlighted the IDF's weapons usages as constituting potential war crimes.\nIn October 2018, Harris and L3 announced an all-stock \"merger of equals\". As part of that deal, Harris was required to sell its night vision division. The reasoning was that a merger of Harris and L3's night vision departments would create an effective monopoly on the night vision industry. The merger was completed in June 2019. The new company, L3Harris Technologies, Inc., is based in Melbourne, Florida, where Harris was headquartered. The new company was led by former Harris CEO William M. Brown as the Chairman and CEO, with former L3 CEO as the President and COO. In June 2021, Brown turned over the role of CEO to Chris Kubasik, retaining the title of Executive Chair, and Kubasik adding the title of Vice Chair.\nBetween 2006 and July 2021, L3Harris was awarded 136 U.S. Customs and Border Protection and Immigration and Customs Enforcement contracts totalling $308.2 million, \"as well as six blanket purchase orders potentially worth up to $6 billion\".\nIn 2018, L3Harris acquired two Australian zero-day exploit development companies, Azimuth Security and Linchpin Labs, which were merged as Trenchant. The two companies are reportedly suppliers of zero-day exploits for the Five Eyes and the Federal Bureau of Investigation.\nIn 2019, L3Harris paid $13 million to settle allegations that Harris, before the merger, violated Arms Export Control Act and International Traffic in Arms Regulations regulations. According to a proposed charging letter  Harris Corporation violated AECA (22U.S.C.2751 et seq.) and ITAR (22 CFR parts 120–131) for a total of 131 separate violations.\nIn January 2022, L3Harris reorganized its business structure, eliminating the Aviation Systems business segment and distributing its divisions between the remaining three Integrated Mission Systems, Space & Airborne Systems, and Communications Systems segments.\nIn June 2022, Chris Kubasik succeeded as the Chair following Bill Brown's retirement.\nIn June 2022, it was reported to have held talks to purchase the Israeli company NSO, which builds Pegasus spyware. White House officials heard of the talks and voiced opposition, resulting in L3Harris discontinuing its plans.\nIn December 2022, L3Harris agreed to buy Aerojet Rocketdyne Holdings for $4.7 billion in cash. The acquisition was completed on 28 July 2023.\nIn October 2025, Israel entered into a memorandum of understanding with the US defense contractor L3Harris to facilitate the acquisition of new light attack aircraft intended for border defense, aimed at developing the Israeli Sky Warden variant.\n\nBusiness organization\nAs of 2023, L3Harris is organized under four business segments: Integrated Mission Systems, Space & Airborne Systems, Communication Systems, and Aerojet Rocketdyne. It is led by a 13-member board of directors, including chair and CEO Chris Kubasik.\n\nIntegrated Mission Systems\nHeadquartered in Palm Bay, Florida, Integrated Missions Systems specializes in intelligence, surveillance, and reconnaissance (ISR) and signals intelligence systems; electrical and electronic systems for maritime use; electro-optical systems including infrared, laser imaging, and targeting systems; defense aviation systems including weapons systems and UAVs; and commercial aviation services including the L3Harris Airline Academy. It comprises divisions, including some of those formerly in the Aviation Systems segment and Wescam, that had a combined revenue of $7.0 billion in 2021.\nIn November 2023, L3Harris announced that it would sell its Commercial Aviation Solutions business to The Jordan Company for up to $800 million.\n\nSpace & Airborne Systems\nHeadquartered in Palm Bay, Florida, Space & Airborne Systems specializes in space mission, payloads, and sensors for satellite navigation, ISR, weather, and missile defense; ground systems for space command and control and tracking; optical and wireless networking for situational awareness and air traffic management; defense avionics; and electronic warfare countermeasures. It comprises divisions, including some of those formerly in the Aviation Systems segment, that had a combined revenue of $6.0 billion in 2021.\n\nOcean & Maritime Systems\nManufactured in Panama City, Florida, Ocean & Maritime Systems specializes in maritime mission, Marine engineering, integrated Maritime solutions, and sensors. Services and equipment help support surveillance and reconnaissance with autonomous surface vehicle, monitering, signal & control systems. L3Harris was chosen to develop an autonomous swarm prototype for the Defense Innovation Unit (DIU) in order to create a command-and-control system capable of operating several autonomous assets at the same time. The initiative and prototype combine commercial technology to provide the United States military with collaborative autonomy when operating swarms of unmanned aircraft, ground vehicles, and marine seacraft.\n\nCommunications Systems\nHeadquartered in Rochester, New York, Communications Systems specializes in tactical communications, broadband communications, night vision (inherited from L3 Technologies, unrelated to night vision developed by Harris, ITT, or Exelis), and public safety. It comprises divisions that had a combined revenue of $4.3 billion in 2021.\n\nAerojet Rocketdyne\nHeadquartered in Palm Bay, Florida, Aerojet Rocketdyne consists of two sectors: \"Missile Solutions\" and \"Space Propulsion and Power Systems\". Aerojet Rocketdyne had $2.2 billion in revenue in 2022, prior to its 2023 purchase by L3Harris.\n\nProducts\nAVCATT, a mobile aviation training simulator\nStingRay and Hailstorm phone trackers\nOpenSky wireless communication system\nTCAS, FDR & CVR products of the Aviation Communication & Surveillance Systems product line, serviced and managed by OEMServices\nhC2 L3Harris Command and Control Battle Management Suite—former \"Harris Command and Control\" \nIntegrated Core Processor, main computer in F-35 Lightning II and in C-130J Super Hercules\nGPNVG-18, a night vision device that utilises four night vision tubes to give the user a wider field of view\nAN/PVS-31A BNVD and 1531 BNVD. Binocular articulating night vision devices. Standard issue goggle for US SOCOM.\nAzimuth, technology enabling access to data from locked mobile phones. L3Harris acquired Azimuth in 2018 through an acquisition of an Australian company, Azimuth Security.\n\nScandals\nL3Harris has faced several allegations and settlements related to financial misconduct and employment practices. These include allegations of violating the False Claims Act through double billing on Department of Defense contracts and overcharging for parts. Additionally, the company has been involved in ERISA lawsuits related to excessive 401(k) fees. There have also been claims of discriminatory practices, including allegations of wrongful termination due to PTSD. Furthermore, L3Harris has settled export violation charges with the Department of State.\n\nFinancial Misconduct\nFalse Claims Act Violations\nL3Harris has been accused of violating the False Claims Act by double-billing the Department of Defense for parts and materials. For example, they allegedly billed the DOD for nuts and bolts both as part of a material additive factor and as individual parts, resulting in overcharging.\n\nSettlements\nL3Harris has paid significant sums to settle these allegations. They agreed to pay $62 million to settle allegations related to false statements and violations of the Truth In Negotiations Act. They also settled for $21.8 million regarding the double-billing allegations.\n\nERISA Lawsuits\nA class action lawsuit was filed against L3Harris for allegedly charging excessive record keeping and administrative fees in their 401(k) plan, as well as failing to monitor investment options. The company settled this lawsuit for $650,000.\n\nEmployment Practices\nDiscriminatory Termination\nA former employee successfully sued L3Harris, alleging that he was wrongfully terminated due to his PTSD. The Ninth Circuit Court of Appeals reinstated the lawsuit, stating a reasonable jury could find that his PTSD was a factor in the termination.\n\nRetaliation Claims\nAnother employee is pursuing claims that he was terminated for reporting potential misconduct by another employee, potentially violating the National Defense Authorization Act and the False Claims Act.\n\nOther Issues\nExport Violations\nL3Harris settled charges with the Department of State for export violations, agreeing to pay $13 million.\n\nSpyware Controversy\nL3Harris has been involved in the development of surveillance technology, specifically the \"Stingray\" device, which has raised privacy concerns and been criticized for its use by law enforcement.\n\nLayoffs\nL3Harris Technologies has recently been engaged in a series of layoffs, primarily as part of a cost-cutting measure and restructuring effort known as LHX NeXt. This initiative aims to streamline operations and achieve $1 billion in cost savings over the next three years.\nIn April 2024, L3Harris announced a 5% reduction in its global workforce, impacting employees across various locations and departments. This workforce reduction is expected to affect hundreds of jobs in Palm Bay and other locations where the company operates. Additionally, in February 2025, L3Harris announced layoffs affecting 179 employees at its Rockwall facility in Texas, primarily due to the conclusion of the JAVA MAN program, an aerial intelligence, surveillance, and reconnaissance program. The company noted that the majority of these affected employees resided out of state and worked remotely overseas. \nWhile L3Harris has not publicly disclosed the exact number of individuals impacted by these layoffs, it's evident that these workforce reductions are part of a broader trend of operational adjustments in the defense and technology sectors, driven by economic pressures and the need for agility and financial stability. L3Harris is also addressing challenges in its satellite supply chain, which has faced issues with late deliveries from a key supplier. The company has responded by shifting to a new supplier to ensure timely deliveries.\n\nReferences\nExternal links\nOfficial website\nBusiness data for L3Harris:",
  "clean_text": "L3Harris Technologies, Inc. is an American technology company, defense contractor, and information technology services provider that produces products for command and control systems, wireless equipment, tactical radios, avionics and electronic systems, night vision equipment, intelligence, surveillance and reconnaissance (C3ISR) systems and products, ocean systems, instrumentation, navigation products, training devices and services, and both terrestrial/spaceborne antennas for use in the government, defense, and commercial sectors. The company was formed from the merger of L3 Technologies and Harris Corporation on June 29, 2019, which made it the sixth-largest defense contractor in the United States. History The \"Harris Automatic Press Company\" was founded by Alfred S. Harris in Niles, Ohio, in 1895. The company spent the next 60 years developing lithographic processes and printing presses before acquiring typesetting company Intertype Corporation. In 1967, they merged with Radiation, Inc. of Melbourne, Florida, a developer of antenna, integrated circuit, and modem technology used in the space race. The company headquarters was moved from Cleveland to Melbourne in 1978. In May 2015, Harris finalized the purchase of competitor Exelis Inc., almost doubling the size of the original company. L-3 Communications was formed in 1997 to acquire certain business units from Lockheed Martin that had previously been part of Loral Corporation. These units had belonged to Lockheed Corporation and Martin Marietta, which had merged three years before in 1993. The company was founded by, and named for, Frank Lanza and Robert LaPenta in partnership with Lehman Brothers. Lanza and LaPenta had both served as executives at Loral and Lockheed. The company continued to expand through mergers and acquisitions to become one of the top ten U.S. government contractors. At the end of 2016, the company changed its name from L-3 Communications Holdings, Inc. to L3 Technologies, Inc. to better reflect the company's wider focus since its founding in 1997. Between 1999 and August 2021, L3Harris and predecessors spent $131.9 million lobbying for ICE radio procurement ($20,000), the Intelligence Authorization Act ($​1,510,000), DHS fund appropriations for unmanned vehicles ($430,000), and night vision systems research ($20,000). In 2008, 72 Iraqi civilians sued L3 Services and CACI for human rights violations including \"torture; cruel, inhuman, or degrading treatment; war crimes; assault and battery; sexual assault and battery; intentional infliction of emotional distress; negligent hiring and supervision; and negligent infliction of emotional distress.\" A settlement was reached on October 10, 2012, which was the \"first positive resolution to a U.S. civil case challenging detainee treatment outside the United States in the larger 'war on terror' context\". In 2012, L3 subsidiary KDI Precision Products participated in the sale of 11,500 JDAM bomb fuzes to Israel, part of a $647 million contract deal. These were among the weapons used by the IDF in the 2014 Gaza War; after the use of weapons in densely populated civilian areas, the U.N. High Commissioner for Human Rights highlighted the IDF's weapons usages as constituting potential war crimes. In October 2018, Harris and L3 announced an all-stock \"merger of equals\". As part of that deal, Harris was required to sell its night vision division. The reasoning was that a merger of Harris and L3's night vision departments would create an effective monopoly on the night vision industry. The merger was completed in June 2019. The new company, L3Harris Technologies, Inc., is based in Melbourne, Florida, where Harris was headquartered. The new company was led by former Harris CEO William M. Brown as the Chairman and CEO, with former L3 CEO as the President and COO. In June 2021, Brown turned over the role of CEO to Chris Kubasik, retaining the title of Executive Chair, and Kubasik adding the title of Vice Chair. Between 2006 and July 2021, L3Harris was awarded 136 U.S. Customs and Border Protection and Immigration and Customs Enforcement contracts totalling $308.2 million, \"as well as six blanket purchase orders potentially worth up to $6 billion\". In 2018, L3Harris acquired two Australian zero-day exploit development companies, Azimuth Security and Linchpin Labs, which were merged as Trenchant. The two companies are reportedly suppliers of zero-day exploits for the Five Eyes and the Federal Bureau of Investigation. In 2019, L3Harris paid $13 million to settle allegations that Harris, before the merger, violated Arms Export Control Act and International Traffic in Arms Regulations regulations. According to a proposed charging letter Harris Corporation violated AECA (22U.S.C.2751 et seq.) and ITAR (22 CFR parts 120–131) for a total of 131 separate violations. In January 2022, L3Harris reorganized its business structure, eliminating the Aviation Systems business segment and distributing its divisions between the remaining three Integrated Mission Systems, Space & Airborne Systems, and Communications Systems segments. In June 2022, Chris Kubasik succeeded as the Chair following Bill Brown's retirement. In June 2022, it was reported to have held talks to purchase the Israeli company NSO, which builds Pegasus spyware. White House officials heard of the talks and voiced opposition, resulting in L3Harris discontinuing its plans. In December 2022, L3Harris agreed to buy Aerojet Rocketdyne Holdings for $4.7 billion in cash. The acquisition was completed on 28 July 2023. In October 2025, Israel entered into a memorandum of understanding with the US defense contractor L3Harris to facilitate the acquisition of new light attack aircraft intended for border defense, aimed at developing the Israeli Sky Warden variant. Business organization As of 2023, L3Harris is organized under four business segments: Integrated Mission Systems, Space & Airborne Systems, Communication Systems, and Aerojet Rocketdyne. It is led by a 13-member board of directors, including chair and CEO Chris Kubasik. Integrated Mission Systems Headquartered in Palm Bay, Florida, Integrated Missions Systems specializes in intelligence, surveillance, and reconnaissance (ISR) and signals intelligence systems; electrical and electronic systems for maritime use; electro-optical systems including infrared, laser imaging, and targeting systems; defense aviation systems including weapons systems and UAVs; and commercial aviation services including the L3Harris Airline Academy. It comprises divisions, including some of those formerly in the Aviation Systems segment and Wescam, that had a combined revenue of $7.0 billion in 2021. In November 2023, L3Harris announced that it would sell its Commercial Aviation Solutions business to The Jordan Company for up to $800 million. Space & Airborne Systems Headquartered in Palm Bay, Florida, Space & Airborne Systems specializes in space mission, payloads, and sensors for satellite navigation, ISR, weather, and missile defense; ground systems for space command and control and tracking; optical and wireless networking for situational awareness and air traffic management; defense avionics; and electronic warfare countermeasures. It comprises divisions, including some of those formerly in the Aviation Systems segment, that had a combined revenue of $6.0 billion in 2021. Ocean & Maritime Systems Manufactured in Panama City, Florida, Ocean & Maritime Systems specializes in maritime mission, Marine engineering, integrated Maritime solutions, and sensors. Services and equipment help support surveillance and reconnaissance with autonomous surface vehicle, monitering, signal & control systems. L3Harris was chosen to develop an autonomous swarm prototype for the Defense Innovation Unit (DIU) in order to create a command-and-control system capable of operating several autonomous assets at the same time. The initiative and prototype combine commercial technology to provide the United States military with collaborative autonomy when operating swarms of unmanned aircraft, ground vehicles, and marine seacraft. Communications Systems Headquartered in Rochester, New York, Communications Systems specializes in tactical communications, broadband communications, night vision (inherited from L3 Technologies, unrelated to night vision developed by Harris, ITT, or Exelis), and public safety. It comprises divisions that had a combined revenue of $4.3 billion in 2021. Aerojet Rocketdyne Headquartered in Palm Bay, Florida, Aerojet Rocketdyne consists of two sectors: \"Missile Solutions\" and \"Space Propulsion and Power Systems\". Aerojet Rocketdyne had $2.2 billion in revenue in 2022, prior to its 2023 purchase by L3Harris. Products AVCATT, a mobile aviation training simulator StingRay and Hailstorm phone trackers OpenSky wireless communication system TCAS, FDR & CVR products of the Aviation Communication & Surveillance Systems product line, serviced and managed by OEMServices hC2 L3Harris Command and Control Battle Management Suite—former \"Harris Command and Control\" Integrated Core Processor, main computer in F-35 Lightning II and in C-130J Super Hercules GPNVG-18, a night vision device that utilises four night vision tubes to give the user a wider field of view AN/PVS-31A BNVD and 1531 BNVD. Binocular articulating night vision devices. Standard issue goggle for US SOCOM. Azimuth, technology enabling access to data from locked mobile phones. L3Harris acquired Azimuth in 2018 through an acquisition of an Australian company, Azimuth Security. Scandals L3Harris has faced several allegations and settlements related to financial misconduct and employment practices. These include allegations of violating the False Claims Act through double billing on Department of Defense contracts and overcharging for parts. Additionally, the company has been involved in ERISA lawsuits related to excessive 401(k) fees. There have also been claims of discriminatory practices, including allegations of wrongful termination due to PTSD. Furthermore, L3Harris has settled export violation charges with the Department of State. Financial Misconduct False Claims Act Violations L3Harris has been accused of violating the False Claims Act by double-billing the Department of Defense for parts and materials. For example, they allegedly billed the DOD for nuts and bolts both as part of a material additive factor and as individual parts, resulting in overcharging. Settlements L3Harris has paid significant sums to settle these allegations. They agreed to pay $62 million to settle allegations related to false statements and violations of the Truth In Negotiations Act. They also settled for $21.8 million regarding the double-billing allegations. ERISA Lawsuits A class action lawsuit was filed against L3Harris for allegedly charging excessive record keeping and administrative fees in their 401(k) plan, as well as failing to monitor investment options. The company settled this lawsuit for $650,000. Employment Practices Discriminatory Termination A former employee successfully sued L3Harris, alleging that he was wrongfully terminated due to his PTSD. The Ninth Circuit Court of Appeals reinstated the lawsuit, stating a reasonable jury could find that his PTSD was a factor in the termination. Retaliation Claims Another employee is pursuing claims that he was terminated for reporting potential misconduct by another employee, potentially violating the National Defense Authorization Act and the False Claims Act. Other Issues Export Violations L3Harris settled charges with the Department of State for export violations, agreeing to pay $13 million. Spyware Controversy L3Harris has been involved in the development of surveillance technology, specifically the \"Stingray\" device, which has raised privacy concerns and been criticized for its use by law enforcement. Layoffs L3Harris Technologies has recently been engaged in a series of layoffs, primarily as part of a cost-cutting measure and restructuring effort known as LHX NeXt. This initiative aims to streamline operations and achieve $1 billion in cost savings over the next three years. In April 2024, L3Harris announced a 5% reduction in its global workforce, impacting employees across various locations and departments. This workforce reduction is expected to affect hundreds of jobs in Palm Bay and other locations where the company operates. Additionally, in February 2025, L3Harris announced layoffs affecting 179 employees at its Rockwall facility in Texas, primarily due to the conclusion of the JAVA MAN program, an aerial intelligence, surveillance, and reconnaissance program. The company noted that the majority of these affected employees resided out of state and worked remotely overseas. While L3Harris has not publicly disclosed the exact number of individuals impacted by these layoffs, it's evident that these workforce reductions are part of a broader trend of operational adjustments in the defense and technology sectors, driven by economic pressures and the need for agility and financial stability. L3Harris is also addressing challenges in its satellite supply chain, which has faced issues with late deliveries from a key supplier. The company has responded by shifting to a new supplier to ensure timely deliveries."
}