{
  "ticker": "LII",
  "cik": "0001069202",
  "company_name": "Lennox International",
  "corrected_name": "Lennox International",
  "wiki_title_used": "Lennox International",
  "exists": true,
  "raw_text": "Lennox International Inc. is an American provider of climate control products for the heating, ventilation, and air conditioning (HVAC) and refrigeration markets. Based in Richardson, Texas, the company is 9.8% owned by John W. Norris, III, a descendant of DW Norris, who acquired the company in 1904. The company's largest production facilities are in Saltillo, Mexico, Marshalltown, Iowa, and Orangeburg, South Carolina.\n\nHistory\nThe company was founded in 1895, in Marshalltown, Iowa, by Dave Lennox, the owner of a machine repair business for railroads. Inventors Ezra William Smith and Ernest Bryant brought their idea for a riveted steel coal-fired furnace to his machine shop to build parts for a prototype. In lieu of payment, Lennox accepted their patent, obtaining rights to the idea and founded the Lennox Furnace Co.\nIn 1904, DW Norris acquired the company. He managed the company until his death in 1949.\nFrom 1964 to 1965, Lennox produced a small crawler tractor and mower called the Lennox Kitty Track 600. It featured a 6 hp (4.5 kW) Briggs & Stratton engine and a 32\" mower deck.\nIn 1999, the company became a public company via an initial public offering.\nA 2018 tornado destroyed the plant in Marshalltown, but the company would rebuild it. As of 2024, there were over 750 workers employed at that location.\n\nAcquisitions and divestitures\nIn 1971, the company sold its low pressure gas cylinder business to Worthington Industries.\nIn 1973, Lennox acquired Heatcraft, including the Larkin, Bohn, Chandler, and Climate Control brands.\nIn 1998, the company acquired Pyro Industries, a manufacturer of pellet stoves.\nIn December 2010, the company acquired Kysor/Warren from The Manitowoc Company for $138 million.\nIn September 2023, the company sold its European commercial HVAC and refrigeration businesses to funds managed by Syntagma Capital.\nIn October 2023, the company acquired AES.\n\nBrands\nThe company operates the following brands:\n\nHome Comfort Solutions\nLennox\nDave Lennox Signature Collection\nArmstrong Air\nDucane\nAirEase\nConcord\nMagicPak\nADP Advanced Distributor Products\nAllied\nElite Series\nLennox Merit Series air conditioner\nComfort Sync\nHealthy Climate\nHealthy Climate Solutions\niComfort\nComfortSense\nLennox Stores\n\nBuilding Climate Solutions\nLennox\nModel L\nCORE\nEnlight\nXion\nEnergence\nProdigy\nStrategos\nRaider\nLennox VRF\nLennox National Account Services\nAllied Commercial\nElite\nAES Industries\nAES Mechanical\nES Reclaim\nHeatcraft Worldwide Refrigeration\nBohn\nMAGNA\nLarkin\nClimate Control\nChandler Refrigeration\nFrigua-Bohn\nIntelliGen\nInterlink\n\nLegal issues\nIn 1998, the company paid $6.2 million to settle an age discrimination lawsuit brought by 11 former employees and the Equal Employment Opportunity Commission, after the employees, who were 41 to 58 years old, were fired or demoted.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Lennox International Inc.:",
  "clean_text": "Lennox International Inc. is an American provider of climate control products for the heating, ventilation, and air conditioning (HVAC) and refrigeration markets. Based in Richardson, Texas, the company is 9.8% owned by John W. Norris, III, a descendant of DW Norris, who acquired the company in 1904. The company's largest production facilities are in Saltillo, Mexico, Marshalltown, Iowa, and Orangeburg, South Carolina. History The company was founded in 1895, in Marshalltown, Iowa, by Dave Lennox, the owner of a machine repair business for railroads. Inventors Ezra William Smith and Ernest Bryant brought their idea for a riveted steel coal-fired furnace to his machine shop to build parts for a prototype. In lieu of payment, Lennox accepted their patent, obtaining rights to the idea and founded the Lennox Furnace Co. In 1904, DW Norris acquired the company. He managed the company until his death in 1949. From 1964 to 1965, Lennox produced a small crawler tractor and mower called the Lennox Kitty Track 600. It featured a 6 hp (4.5 kW) Briggs & Stratton engine and a 32\" mower deck. In 1999, the company became a public company via an initial public offering. A 2018 tornado destroyed the plant in Marshalltown, but the company would rebuild it. As of 2024, there were over 750 workers employed at that location. Acquisitions and divestitures In 1971, the company sold its low pressure gas cylinder business to Worthington Industries. In 1973, Lennox acquired Heatcraft, including the Larkin, Bohn, Chandler, and Climate Control brands. In 1998, the company acquired Pyro Industries, a manufacturer of pellet stoves. In December 2010, the company acquired Kysor/Warren from The Manitowoc Company for $138 million. In September 2023, the company sold its European commercial HVAC and refrigeration businesses to funds managed by Syntagma Capital. In October 2023, the company acquired AES. Brands The company operates the following brands: Home Comfort Solutions Lennox Dave Lennox Signature Collection Armstrong Air Ducane AirEase Concord MagicPak ADP Advanced Distributor Products Allied Elite Series Lennox Merit Series air conditioner Comfort Sync Healthy Climate Healthy Climate Solutions iComfort ComfortSense Lennox Stores Building Climate Solutions Lennox Model L CORE Enlight Xion Energence Prodigy Strategos Raider Lennox VRF Lennox National Account Services Allied Commercial Elite AES Industries AES Mechanical ES Reclaim Heatcraft Worldwide Refrigeration Bohn MAGNA Larkin Climate Control Chandler Refrigeration Frigua-Bohn IntelliGen Interlink Legal issues In 1998, the company paid $6.2 million to settle an age discrimination lawsuit brought by 11 former employees and the Equal Employment Opportunity Commission, after the employees, who were 41 to 58 years old, were fired or demoted."
}