{
  "ticker": "LIN",
  "cik": "0001707925",
  "company_name": "Linde plc",
  "corrected_name": "Linde plc",
  "wiki_title_used": "Linde plc",
  "exists": true,
  "raw_text": "Linde is a global multinational chemical company and the world's largest industrial gas supplier by market share and revenue. Founded by German scientist and engineer Carl von Linde in 1879 in Wiesbaden, Germany, the company is now headquartered in Woking, United Kingdom, and registered in Ireland as Linde plc. Linde plc was formed in 2018 through the merger of Linde AG and Praxair, which was founded in 1907 in the United States as Linde Air Products Company.\nThe company's primary business is the manufacturing and distribution of atmospheric gases, including oxygen, nitrogen, argon, rare gases, and process gases, including carbon dioxide, helium, hydrogen, ammonia, electronic gases, specialty gases, and acetylene. Linde's products are used in the healthcare, petroleum refining, manufacturing, food, beverage carbonation, fiber-optics, steel making, aerospace, material handling equipment (MHE), chemicals, electronics and water treatment industries. \nLinde is ranked 463rd on the Fortune Global 500 and 187th on the Forbes Global 2000.\n\nOperations\nThe company has two principal business areas: gas (industrial gases and medical gases), and engineering, procurement, and construction.\n\nGases\nIn the industrial gas area, the company uses the brand names Linde, AGA, BOC, TIG, Mox-Linde Gases, Afrox, Sigas and PanGas. HiQ is used as an identifier for high purity and premium specialty gases across all of these business brand names.\nIn the medical gas area, the company uses the brand names Linde Gas Therapeutics, AGA Medical, INO Therapeutics, Linde Homecare, and Farmadomo.\nLinde Gas supplies industrial gases, medical gases, specialty gases, refrigerants and other chemicals. Depending on the gas and the quantity required, these may be supplied in portable high-pressure gas cylinders, in liquefied form by road tanker, from on-site gas generators or in gaseous form via pipeline to large customers. This division has four operating segments, Western Europe, the Americas, Asia & Eastern Europe, and South Pacific & Africa. These segments are subdivided into eight Regional Business Units (RBUs). The Gases Division also includes the two Global Business Units (GBUs) – Healthcare (medical gases) and Tonnage (on-site) – and the two Business Areas (BAs) – Merchant & Packaged Gases (liquefied and cylinder gases) and Electronics (electronic gases).\nThe product range includes hydrogen, acetylene, carbon monoxide, carbon dioxide, shielding gases for welding applications, noble gases and specialty gases, oxygen, nitrogen, and argon, all of which are manufactured in Linde's air separation plants.\nLinde Healthcare provides pharmaceutical and medical gas products and services for the healthcare industry such as oxygen therapy, aerosol therapy, anaesthesia, and gas for chronic obstructive pulmonary disease, asthma, sleep apnoea and pain.\n\nLinde Engineering\nLinde Engineering designs and builds large-scale chemical plants for the production of industrial gases including oxygen, nitrogen, argon, hydrogen and carbon monoxide, as well as large plants associated with the processing of natural gas, LNG, Liquefied petroleum gas and the manufacture of olefins. The Engineering Division develops process plants in the engineering, procurement and construction (EPC) business worldwide.\nThe group has more than 1,000 process engineering patents and 4,000 completed plant projects.\n\nThe product range includes:\n\nAir separation plants\nEthylene Cracker Units\nLiquefied natural gas and Natural-gas processing plants\nHydrogen and synthesis gas plants\nChemical plants\nAdsorption and membrane plants\nCryogenics plants\nCarbon capture and storage and carbon dioxide plants\nFurnaces, Incineration and heaters\nPlant components\nLinde is also a member of the Hydrogen Council, a group of companies investing in hydrogen vehicles. The company expects hydrogen vehicles to compete with electric vehicles and has invested in wind powered plants that convert water to hydrogen.\n\nHistory\nOn 21 June 1879, Carl von Linde founded the Gesellschaft für Linde's Eismaschinen Aktiengesellschaft to develop further his work in developing mechanical refrigeration systems for the brewing and food industries. Following success in this market, he moved on to developing lower temperature systems resulting in 1895 in a patent covering the liquefaction of air. Out of this work his company developed equipment for the separation of air and other gases. Linde's process was patented in 1902 and immediately exploited by the first large-scale air separation plant installed in Linde's works in Höllriegelskreuth, near Munich in 1903.\nIn 1906, Carl Von Linde decided to expand his oxygen extraction company overseas, targeting America, where no other companies had attempted industrial scale oxygen extraction. Along with Cecil Lightfoot, in 1907, he opened the Linde Air Products Factory, his first plant in America at Buffalo, New York.\nIn addition to plants for air separation, in 1906, Linde engineers started working with others on processes to separate the constituents of water gas. This work lead to the 1909 invention of the Linde–Frank–Caro process to produce hydrogen and carbon monoxide, which were further key feedstocks for the emerging chemicals industry.\nIn addition to his interests in refrigeration, Carl von Linde had also partnered with Hugo Güldner and Georg Krauß and others in 1904 to form the Güldner Motoren-Gesellschaft mbH in Munich, which was moved to Aschaffenburg in 1906. Linde took full ownership of the company in 1929, and from this origin developed a business manufacturing first engines and tractors, and then from the 1950s onwards, a range of mechanical handling equipment such as fork lift trucks. Linde also acquired the Aktiengesellschaft für Industriegasverwertung (English: Corporation for Industry Gas Utilization), commonly referred to as the Heylandt Works.\nFollowing World War I, Linde's U.S. assets were confiscated.  They were incorporated into the Union Carbide Corporation (UCC) as the Linde Air Products division in 1917. Eventually, in 1992, this part of Union Carbide was spun off as Union Carbide Industrial Gases Inc., and renamed Praxair. In 2018 this became part of Linde when Linde merged with Praxair.\nIn the years of Nazi Germany, Linde AG benefited from the country's attempt to become self-sufficient by refraining from imports of synthetic fuel and rubber. In 1935, general manager Friedrich Linde received the title of Wehrwirtschaftsführer, which underlined the national importance of Linde AG and allowed the company to further benefit from the German rearmament.\nBefore and during World War II, all departments of Linde AG were in some way involved in the armaments production: The Heylandt-Gesellschaft für Apparatebau supplied the German rocket program, other branches produced welding equipment and engines for the armaments industry. In 1941, Linde manufactured oxygen and helium installations for IG Farben at the Auschwitz concentration camp. Three further planned installations were not installed due to the course of war. According to estimates of the company for mid-1944, between 400 and 500 people were used as forced labourers in production plants. The company claimed that 75% of its production facilities were destroyed during the war.\nIn 1958, the company tested a hydraulic drive system in the \"Hydrocar\".\nIn 1989, the company acquired Lansing Bagnall, a British forklift manufacturer.\nIn 1996, the company acquired the rights to the Linde name from Praxair.\nIn 2000, the company completed the acquisition of AGA AB of Sweden for $3.71 billion.\nIn the early 2000, Brazilian auction was invented as a new type of auctions to trade gas by electronic auctions for Linde plc in Brazil.\nIn 2004, the company sold its refrigeration division to Carrier Corporation for €325 million.\nIn September 2006, Linde acquired BOC for €11.7 billion in cash.\nLinde's forklift business was rebranded as KION Group and sold to KKR and Goldman Sachs for €4bn in January 2007.\nIn March 2007, the BOC Edwards semiconductor equipment business was sold to private equity firm CCMP Capital for €685m. Also in March 2007, eight air separation units and related bulk gas business, with about 300 employees, were sold to Airgas for $495 million in cash.\nIn April 2007, the company sold the industrial gas business of BOC Gazy to Air Products & Chemicals for €370 million  or about $503 million.\nIn 2008, the head office of Linde AG was relocated from its historic headquarters in Wiesbaden to the Angerhof building in downtown Munich.\nIn 2010, the company acquired over 95% of the shares of Sri Lanka–based Ceylon Oxygen Ltd.\nIn June 2011, PT Linde Indonesia, a subsidiary of Linde, announced its plan to build an air separation plant worth Rp.1 trillion ($117.33 million) in Cilegon, Banten to supply industrial gas to PT Krakatau Steel's steel plant.\nIn May 2012, the company acquired the Belgium, France, Germany, Portugal and Spain homecare business of Air Products & Chemicals for €590 million.\nIn August 2012, the company acquired Lincare Holdings, a healthcare gas provider in the US for US$4.6 billion to become the largest home care gas supplier in North America.\nIn December 2012, the company acquired homecare company Calea France SAS.\nIn February 2016, Lincare Holdings acquired American HomePatient, Inc.\nIn December 2016, Linde Korea completed the acquisition of Air Liquide Korea's industrial merchant & electronics and liquid bulk air gases divisions, based in South Korea.\nIn early June 2017, after almost a year of on-and-off negotiations, Linde and Praxair, the successor to UCC's Linde Air Products division, agreed to merge.\nIn July 2018, the company agreed to sell certain business in North and South American assets to Messer Group and CVC Capital Partners for $3.3 billion to gain regulator approval for the Praxair merger.\nOn 31 October 2018, the merger was completed except finalising divestitures required by the respective antitrust authorities. On 1 March 2019 the company completed divestitures required by US antitrust authorities.\nOn 28 February 2019, Matheson acquired Linde HyCO, divested to comply with the regulatory terms of the Praxair merger.\nOn 9 August 2019 Linde partnered with CarbonCure Technologies.\nOn 29 August 2019, the company acquired a 10% stake in Hydrospider, a Swiss producer and supplier of hydrogen derived from renewable energy sources.\nIn October 2019, the company invested £28 million in ITM Power, a British manufacturer of polymer electrolyte membrane electrolyzers for hydrogen production via electro-chemical splitting of water into hydrogen and oxygen.\nIn January 2020, the company sold its LifeGas division.\nIn April 2020, Gasum acquired the company's LNG and biogas business in Sweden and Norway.\nIn 2021 Linde and the Turkish construction company Renaissance Heavy Industries were awarded a contract to build a Liquified Natural Gas terminal at Ust-Luga in Russia. Following the 2022 Russian invasion of Ukraine, sanctions were introduced which restricted Linde completing the contract. Russia accordingly froze assets of Linde in Russia, who has an exposure of €1 billion in the country.\nIn September 2022, Linde sold Gist Limited to Marks & Spencer for £145 million. Gist, headquartered at Chineham Business Park, Basingstoke, offers supply chain services including end-to-end management and customer fulfilment through transport and warehousing. Gist was acquired by Linde as part of its 2006 acquisition of BOC.\n\nFinancial data\nReferences\nExternal links\n\nOfficial website\nBusiness data for Linde plc: \nDocuments and clippings about Linde plc in the 20th Century Press Archives of the ZBW",
  "clean_text": "Linde is a global multinational chemical company and the world's largest industrial gas supplier by market share and revenue. Founded by German scientist and engineer Carl von Linde in 1879 in Wiesbaden, Germany, the company is now headquartered in Woking, United Kingdom, and registered in Ireland as Linde plc. Linde plc was formed in 2018 through the merger of Linde AG and Praxair, which was founded in 1907 in the United States as Linde Air Products Company. The company's primary business is the manufacturing and distribution of atmospheric gases, including oxygen, nitrogen, argon, rare gases, and process gases, including carbon dioxide, helium, hydrogen, ammonia, electronic gases, specialty gases, and acetylene. Linde's products are used in the healthcare, petroleum refining, manufacturing, food, beverage carbonation, fiber-optics, steel making, aerospace, material handling equipment (MHE), chemicals, electronics and water treatment industries. Linde is ranked 463rd on the Fortune Global 500 and 187th on the Forbes Global 2000. Operations The company has two principal business areas: gas (industrial gases and medical gases), and engineering, procurement, and construction. Gases In the industrial gas area, the company uses the brand names Linde, AGA, BOC, TIG, Mox-Linde Gases, Afrox, Sigas and PanGas. HiQ is used as an identifier for high purity and premium specialty gases across all of these business brand names. In the medical gas area, the company uses the brand names Linde Gas Therapeutics, AGA Medical, INO Therapeutics, Linde Homecare, and Farmadomo. Linde Gas supplies industrial gases, medical gases, specialty gases, refrigerants and other chemicals. Depending on the gas and the quantity required, these may be supplied in portable high-pressure gas cylinders, in liquefied form by road tanker, from on-site gas generators or in gaseous form via pipeline to large customers. This division has four operating segments, Western Europe, the Americas, Asia & Eastern Europe, and South Pacific & Africa. These segments are subdivided into eight Regional Business Units (RBUs). The Gases Division also includes the two Global Business Units (GBUs) – Healthcare (medical gases) and Tonnage (on-site) – and the two Business Areas (BAs) – Merchant & Packaged Gases (liquefied and cylinder gases) and Electronics (electronic gases). The product range includes hydrogen, acetylene, carbon monoxide, carbon dioxide, shielding gases for welding applications, noble gases and specialty gases, oxygen, nitrogen, and argon, all of which are manufactured in Linde's air separation plants. Linde Healthcare provides pharmaceutical and medical gas products and services for the healthcare industry such as oxygen therapy, aerosol therapy, anaesthesia, and gas for chronic obstructive pulmonary disease, asthma, sleep apnoea and pain. Linde Engineering Linde Engineering designs and builds large-scale chemical plants for the production of industrial gases including oxygen, nitrogen, argon, hydrogen and carbon monoxide, as well as large plants associated with the processing of natural gas, LNG, Liquefied petroleum gas and the manufacture of olefins. The Engineering Division develops process plants in the engineering, procurement and construction (EPC) business worldwide. The group has more than 1,000 process engineering patents and 4,000 completed plant projects. The product range includes: Air separation plants Ethylene Cracker Units Liquefied natural gas and Natural-gas processing plants Hydrogen and synthesis gas plants Chemical plants Adsorption and membrane plants Cryogenics plants Carbon capture and storage and carbon dioxide plants Furnaces, Incineration and heaters Plant components Linde is also a member of the Hydrogen Council, a group of companies investing in hydrogen vehicles. The company expects hydrogen vehicles to compete with electric vehicles and has invested in wind powered plants that convert water to hydrogen. History On 21 June 1879, Carl von Linde founded the Gesellschaft für Linde's Eismaschinen Aktiengesellschaft to develop further his work in developing mechanical refrigeration systems for the brewing and food industries. Following success in this market, he moved on to developing lower temperature systems resulting in 1895 in a patent covering the liquefaction of air. Out of this work his company developed equipment for the separation of air and other gases. Linde's process was patented in 1902 and immediately exploited by the first large-scale air separation plant installed in Linde's works in Höllriegelskreuth, near Munich in 1903. In 1906, Carl Von Linde decided to expand his oxygen extraction company overseas, targeting America, where no other companies had attempted industrial scale oxygen extraction. Along with Cecil Lightfoot, in 1907, he opened the Linde Air Products Factory, his first plant in America at Buffalo, New York. In addition to plants for air separation, in 1906, Linde engineers started working with others on processes to separate the constituents of water gas. This work lead to the 1909 invention of the Linde–Frank–Caro process to produce hydrogen and carbon monoxide, which were further key feedstocks for the emerging chemicals industry. In addition to his interests in refrigeration, Carl von Linde had also partnered with Hugo Güldner and Georg Krauß and others in 1904 to form the Güldner Motoren-Gesellschaft mbH in Munich, which was moved to Aschaffenburg in 1906. Linde took full ownership of the company in 1929, and from this origin developed a business manufacturing first engines and tractors, and then from the 1950s onwards, a range of mechanical handling equipment such as fork lift trucks. Linde also acquired the Aktiengesellschaft für Industriegasverwertung (English: Corporation for Industry Gas Utilization), commonly referred to as the Heylandt Works. Following World War I, Linde's U.S. assets were confiscated. They were incorporated into the Union Carbide Corporation (UCC) as the Linde Air Products division in 1917. Eventually, in 1992, this part of Union Carbide was spun off as Union Carbide Industrial Gases Inc., and renamed Praxair. In 2018 this became part of Linde when Linde merged with Praxair. In the years of Nazi Germany, Linde AG benefited from the country's attempt to become self-sufficient by refraining from imports of synthetic fuel and rubber. In 1935, general manager Friedrich Linde received the title of Wehrwirtschaftsführer, which underlined the national importance of Linde AG and allowed the company to further benefit from the German rearmament. Before and during World War II, all departments of Linde AG were in some way involved in the armaments production: The Heylandt-Gesellschaft für Apparatebau supplied the German rocket program, other branches produced welding equipment and engines for the armaments industry. In 1941, Linde manufactured oxygen and helium installations for IG Farben at the Auschwitz concentration camp. Three further planned installations were not installed due to the course of war. According to estimates of the company for mid-1944, between 400 and 500 people were used as forced labourers in production plants. The company claimed that 75% of its production facilities were destroyed during the war. In 1958, the company tested a hydraulic drive system in the \"Hydrocar\". In 1989, the company acquired Lansing Bagnall, a British forklift manufacturer. In 1996, the company acquired the rights to the Linde name from Praxair. In 2000, the company completed the acquisition of AGA AB of Sweden for $3.71 billion. In the early 2000, Brazilian auction was invented as a new type of auctions to trade gas by electronic auctions for Linde plc in Brazil. In 2004, the company sold its refrigeration division to Carrier Corporation for €325 million. In September 2006, Linde acquired BOC for €11.7 billion in cash. Linde's forklift business was rebranded as KION Group and sold to KKR and Goldman Sachs for €4bn in January 2007. In March 2007, the BOC Edwards semiconductor equipment business was sold to private equity firm CCMP Capital for €685m. Also in March 2007, eight air separation units and related bulk gas business, with about 300 employees, were sold to Airgas for $495 million in cash. In April 2007, the company sold the industrial gas business of BOC Gazy to Air Products & Chemicals for €370 million or about $503 million. In 2008, the head office of Linde AG was relocated from its historic headquarters in Wiesbaden to the Angerhof building in downtown Munich. In 2010, the company acquired over 95% of the shares of Sri Lanka–based Ceylon Oxygen Ltd. In June 2011, PT Linde Indonesia, a subsidiary of Linde, announced its plan to build an air separation plant worth Rp.1 trillion ($117.33 million) in Cilegon, Banten to supply industrial gas to PT Krakatau Steel's steel plant. In May 2012, the company acquired the Belgium, France, Germany, Portugal and Spain homecare business of Air Products & Chemicals for €590 million. In August 2012, the company acquired Lincare Holdings, a healthcare gas provider in the US for US$4.6 billion to become the largest home care gas supplier in North America. In December 2012, the company acquired homecare company Calea France SAS. In February 2016, Lincare Holdings acquired American HomePatient, Inc. In December 2016, Linde Korea completed the acquisition of Air Liquide Korea's industrial merchant & electronics and liquid bulk air gases divisions, based in South Korea. In early June 2017, after almost a year of on-and-off negotiations, Linde and Praxair, the successor to UCC's Linde Air Products division, agreed to merge. In July 2018, the company agreed to sell certain business in North and South American assets to Messer Group and CVC Capital Partners for $3.3 billion to gain regulator approval for the Praxair merger. On 31 October 2018, the merger was completed except finalising divestitures required by the respective antitrust authorities. On 1 March 2019 the company completed divestitures required by US antitrust authorities. On 28 February 2019, Matheson acquired Linde HyCO, divested to comply with the regulatory terms of the Praxair merger. On 9 August 2019 Linde partnered with CarbonCure Technologies. On 29 August 2019, the company acquired a 10% stake in Hydrospider, a Swiss producer and supplier of hydrogen derived from renewable energy sources. In October 2019, the company invested £28 million in ITM Power, a British manufacturer of polymer electrolyte membrane electrolyzers for hydrogen production via electro-chemical splitting of water into hydrogen and oxygen. In January 2020, the company sold its LifeGas division. In April 2020, Gasum acquired the company's LNG and biogas business in Sweden and Norway. In 2021 Linde and the Turkish construction company Renaissance Heavy Industries were awarded a contract to build a Liquified Natural Gas terminal at Ust-Luga in Russia. Following the 2022 Russian invasion of Ukraine, sanctions were introduced which restricted Linde completing the contract. Russia accordingly froze assets of Linde in Russia, who has an exposure of €1 billion in the country. In September 2022, Linde sold Gist Limited to Marks & Spencer for £145 million. Gist, headquartered at Chineham Business Park, Basingstoke, offers supply chain services including end-to-end management and customer fulfilment through transport and warehousing. Gist was acquired by Linde as part of its 2006 acquisition of BOC. Financial data"
}