{
  "ticker": "LKQ",
  "cik": "0001065696",
  "company_name": "LKQ Corporation",
  "corrected_name": "LKQ Corporation",
  "wiki_title_used": "LKQ Corporation",
  "exists": true,
  "raw_text": "LKQ Corporation (“Like, Kind and Quality”) is an American provider of alternative and speciality parts to repair and accessorize automobiles and other vehicles. LKQ has operations in North America, Europe and Taiwan. LKQ sells replacement systems, components, equipment and parts to repair and accessorize automobiles, trucks, and recreational and performance vehicles. \nIn December 2018, it was #300 on the list Fortune 500. In March 2017, Dominick P. Zarcone was selected to become the new President and Chief Executive Officer.\nIn June 2024 Justin Jude was selected to become the new President and Chief Executive Officer.\n\nHistory\nLKQ Corporation was founded by Donald Flynn in February 1998, with the purchase of Triplett Automotive Recycling in Akron, Ohio. Flynn remained chairman of the corporation until his death in October 2011. Since inception, it has greatly expanded, primarily through over 200 acquisitions of used and refurbished auto parts suppliers and manufacturers. Some major acquisitions made by LKQ are Stahlgruber, Rhiag, Euro Car Parts, Fource ADL and others.\nIn January 2017, LKQ Corporation announced they would be moving their headquarters of North America to Antioch, a suburb of Nashville, Tennessee. They planned to move roughly four hundred employees to the new Antioch headquarters from Illinois and California. The new headquarters officially opened in December 2018.\n\nPresence\nThe company is represented at a total of 1,684 locations in countries in Europe and North America.\n\nReferences\nExternal links\nBusiness data for LKQ Corporation:",
  "clean_text": "LKQ Corporation (“Like, Kind and Quality”) is an American provider of alternative and speciality parts to repair and accessorize automobiles and other vehicles. LKQ has operations in North America, Europe and Taiwan. LKQ sells replacement systems, components, equipment and parts to repair and accessorize automobiles, trucks, and recreational and performance vehicles. In December 2018, it was #300 on the list Fortune 500. In March 2017, Dominick P. Zarcone was selected to become the new President and Chief Executive Officer. In June 2024 Justin Jude was selected to become the new President and Chief Executive Officer. History LKQ Corporation was founded by Donald Flynn in February 1998, with the purchase of Triplett Automotive Recycling in Akron, Ohio. Flynn remained chairman of the corporation until his death in October 2011. Since inception, it has greatly expanded, primarily through over 200 acquisitions of used and refurbished auto parts suppliers and manufacturers. Some major acquisitions made by LKQ are Stahlgruber, Rhiag, Euro Car Parts, Fource ADL and others. In January 2017, LKQ Corporation announced they would be moving their headquarters of North America to Antioch, a suburb of Nashville, Tennessee. They planned to move roughly four hundred employees to the new Antioch headquarters from Illinois and California. The new headquarters officially opened in December 2018. Presence The company is represented at a total of 1,684 locations in countries in Europe and North America."
}