{
  "ticker": "LLY",
  "cik": "0000059478",
  "company_name": "Lilly (Eli)",
  "corrected_name": "Eli Lilly and Company",
  "wiki_title_used": "Eli Lilly and Company",
  "exists": true,
  "raw_text": "Eli Lilly and Company, doing business as Lilly, is an American multinational pharmaceutical company headquartered in Indianapolis, Indiana, with offices in 18 countries. Its products are sold in approximately 125 countries. The company was founded in 1876 by Eli Lilly, a pharmaceutical chemist and Union army veteran during the American Civil War for whom the company was later named.\nThe company is ranked 11th on the list of largest biomedical companies by revenue and is the most valuable pharmaceutical company worldwide. It is ranked 100th on the Fortune 500 and 138th on the Forbes Global 2000. In November 2025, the company reached a $1 trillion market capitalization, the first health-care company in the world to do so. \nThe company's primary products are tirzepatide (Mounjaro and Zepbound) for treatment of type 2 diabetes, weight loss, and obstructive sleep apnea (37% of 2024 revenues); abemaciclib (Verzenio) for the treatment of advanced or metastatic breast cancers (12% of 2024 revenues); dulaglutide (Trulicity) for the treatment of type 2 diabetes (12% of 2024 revenues); ixekizumab (Taltz) for the treatment of autoimmune diseases (7% of 2024 revenues); empagliflozin (Jardiance) for the treatment of type 2 diabetes (7% of 2024 revenues); Insulin lispro (Humalog), a modified type of medical insulin (5% of 2024 revenues); ramucirumab (Cyramza), a fully human monoclonal antibody used for the treatment of cancer (2% of 2024 revenues); baricitinib (Olumiant), an immunomodulatory medication used for the treatment of rheumatoid arthritis, alopecia areata, and COVID-19 (2% of 2024 revenues); insulin (Humulin) to treat high blood glucose (2% of 2024 revenues); and galcanezumab (Emgality), a humanized monoclonal antibody used for the prevention of migraines (2% of 2024 revenues). In 2024, 67% of the company's revenues came from the United States.\nLilly was the first company to mass-produce both the polio vaccine, developed in 1955 by Jonas Salk, and insulin. It was one of the first pharmaceutical companies to produce human insulin using recombinant DNA, including Humulin (insulin medication), Humalog (insulin lispro), and the first approved biosimilar insulin product in the U.S., Basaglar (insulin glargine). It achieved commercial success with major depressive disorder drugs Prozac (fluoxetine) (1986), Cymbalta (duloxetine) (2004), and its antipsychotic medication Zyprexa (olanzapine) (1996), all of which are now off patent and are manufactured by others as generic drugs. In 2005, Lilly brought exenatide to market—the first of the GLP-1 receptor agonists—followed by the GIP and GLP-1 receptor agonist drugs Mounjaro and Zepbound (tirzepatide).\nThe Lilly Endowment, a charitable foundation organized in 1937 by the founding family, owns 10% of the company.\n\nHistory\nFounding\nThe company was founded by Colonel Eli Lilly, a pharmaceutical chemist and Union army veteran of the American Civil War. Lilly served as the company president until his death in 1898.\nIn 1869, after working for drugstores in Indiana, Lilly became a partner in a Paris, Illinois-based drugstore with James W. Binford. Four years later, in 1873, Lilly left the partnership with Binford, and returned to Indianapolis. In 1874, Lilly partnered with John F. Johnston, and opened a drug manufacturing operation called Johnston and Lilly.\nIn 1876, Lilly dissolved the partnership, and used his share of the assets to open his own pharmaceutical manufacturing business, Eli Lilly and Company, in Indianapolis. The sign outside, above the shop's door, read: \"Eli Lilly, Chemist.\"\nIn 1886, Ernest G. Eberhardt, a chemist, joined the company as its first full-time research scientist.\nLilly began his manufacturing venture with three employees, including his son, Josiah (J. K.). One of the first medicines that Lilly produced was quinine, a drug used to treat malaria, a mosquito-borne disease. By the end of 1876, sales reached $4,470.\nAround 1890, Col. Lilly turned over operation of the family business to his son, Josiah, who ran the company for the next several decades. Col. Lilly remained active in civic affairs and assisted a number of local organizations, including the Commercial Club of Indianapolis, which later became the Indianapolis Chamber of Commerce, and the Charity Organization Society, a forerunner to the Family Services Association of Central Indiana, an organization supported by United Way of America. Josiah's sons, Eli and Joe, were also philanthropists who supported numerous cultural and educational organizations.\n\n19th century\nIn 1878, Lilly hired his brother, James, as his first full-time salesman, and the subsequent sales team marketed the company's drugs nationally. By 1879, the company had grown to $48,000 in sales.\nThe company moved its Indianapolis headquarters from Pearl Street to larger quarters at 36 South Meridian Street. In 1881, the company moved to its current headquarters in Indianapolis's south-side industrial area, and the company later purchased additional facilities for research and production. The same year, Lilly incorporated the business as Eli Lilly and Company, elected a board of directors, and issued stock to family members and close associates.\nLilly's first innovative product was gelatin-coating for pills and capsules. The company's other early innovations included fruit flavorings and sugarcoated pills, which made the medicines easier to swallow.\nIn 1882, Colonel Lilly's only son, Josiah K. Lilly Sr. (J. K.), a pharmaceutical chemist, graduated from the Philadelphia College of Pharmacy in Philadelphia, and returned to Indianapolis to join the family business as a superintendent of its laboratory.\nIn 1883, the company contracted to mix and sell Succus Alteran, its first widely successful product and one its best sellers. The product was marketed as a \"blood purifier\" and as a treatment for syphilis, some types of rheumatism, and skin diseases such as eczema and psoriasis.\nBy the late 1880s, Colonel Lilly was one of the Indianapolis area's leading businessmen, whose company had over 100 employees and $200,000 in annual sales.\nIn 1890, Colonel Lilly fully turned over the day-to-day management of the business to J. K., who ran the company for 34 years. The 1890s were a tumultuous decade economically, but the company flourished. In 1894, Lilly purchased a manufacturing plant to be used solely for creating capsules. The company also made several technological advances in the manufacturing process, including automating its capsule production. Over the next few years the company annually created tens of millions of capsules and pills.\nIn 1898, Lilly's son, J. K. Lilly, inherited the company and became its president following Colonel Lilly's death. At the time of Colonel Lilly's death, the company had a product line of 2,005 items and annual sales of more than $300,000. Colonel Lilly was a pioneer in the modern pharmaceutical industry, with many of his early innovations later becoming standard practice. His ethical reforms in a trade that was marked by outlandish claims of miracle medicines began a period of rapid advancement in the development of medicinal drugs. J. K. Lilly continued to advocate for federal regulation on medicines.\nAs the Lilly company grew, other businesses set up operations near the plant on Indianapolis's near south side. The area developed into one of the city's major business and industrial hubs. Lilly's production, manufacturing, research, and administrative operations in Indianapolis eventually occupied a complex of more than two dozen buildings, which covered 15-block area, in addition to its production plants along Kentucky Avenue.\nIn addition to Colonel Lilly, his brother, James, and son, Josiah (J. K.), the company employed other Lilly family. Colonel Lilly's cousin, Evan Lilly, was hired as a bookkeeper. Lilly's grandsons, Eli and Josiah Jr. (Joe) joined the company from a young age. Under J. K.'s leadership, the company introduced scientific management concepts, organized the company's research department, increased its sales force, and began international distribution of its products. For the rest of the late 19th century, Lilly operated in Indianapolis and the surrounding area as many other pharmaceutical businesses did, manufacturing and selling \"sugar-coated pills, fluid extracts, elixirs, and syrups\". The company used plants for its raw materials and produced its products by hand. One historian noted, \"Although the Indianapolis firm was more careful in making and promoting drugs than the patent medicine men of the era, the company remained ambivalent about scientific research.\"\n\n1900s\nIn 1905, J. K. Lilly oversaw a large expansion of the company, and it reached annual sales of $1 million.\nFollowing the 1906 San Francisco earthquake, the company sent much needed medicine to support recovery efforts.\nBefore and after World War I, the company experienced rapid growth, including expanded manufacturing facilities at its McCarty Street plant, which improved production capacity with a new Science Building (Building 14), opened in 1911, and a new capsule plant (Building 15) in 1913. In 1913, the company began construction of Lilly Biological Laboratories, a research and manufacturing plant on 150 acres near Greenfield, Indiana.\nAfter World War I, the company's expanded production facilities and introduction of new management methods set the stage for Lilly's next crucial phase—its \"aggressive entry into scientific research and development.\" The first big step came in 1919 when Josiah Lilly hired biochemist George Henry Alexander Clowes as director of biochemical research. Clowes had extensive medical research expertise and links to the scientific research community, which led to the company's collaborations with researchers in the U.S. and elsewhere. Clowes's first major collaboration with researchers who developed insulin at the University of Toronto significantly impacted the company's future. Lilly's success with insulin production secured the company's position as a leading research-based pharmaceutical manufacturer, allowing it to attract and hire more research scientists and to collaborate with other universities in additional medical research.\nIn addition to development of new medicines, the company achieved several technological advances, including automation of its production facilities. Lilly was also an innovator in pill capsule manufacturing. It was among the first manufacturers to insert medications into empty gelatin capsules, which provided a more exact dosage. Lilly manufactured capsules for its own needs and sold its excess capacity to others.\nIn 1917, Scientific American described Lilly as \"the largest capsule factory in the world\" and reported that the company was \"capable of producing 2.5 million capsules a day\". One of Lilly's early innovations was fruit flavoring for medicines and sugar-coated pills to make their medicines easier to swallow. Over the next few years, the company created tens of millions of capsules and pills annually.\nOther advances improved plant efficiency and eliminated production errors. In 1909, Eli Lilly, grandson of the company's founder, introduced a method for blueprinting manufacturing tickets, which created multiples copies of a drug formula and helped eliminate manufacturing and transcription errors.\nIn 1919, Josiah hired biochemist George Henry Alexander Clowes as director of biochemical research.\nIn the 1920s, Eli introduced the new concept of straight-line production to the pharmaceutical industry, where raw materials entered at one end of the facility and the finished product came out the other end, in the company's manufacturing process. Under Eli's supervision, the design for Building 22, a new five-floor plant that opened in Indianapolis in 1926, implemented the straight-line concept to improve production efficiency and lower production costs. One historian noted, \"It was probably the most sophisticated production system in the American pharmaceutical industry.\" This more efficient manufacturing process also allowed the company to hire a regular workforce. Instead of recalling workers at peak times and laying them off when production demand fell, Lilly's regular workforce produced less-costly medicines in off-peak times using the same manufacturing facilities.\nDuring the 1920s, the introduction of new products brought the company financial success. In 1921, three University of Toronto scientists, John Macleod, Frederick Banting, and Charles Best, were working on the development of insulin for treatment of diabetes. Clowes proposed a collaboration with the researchers in December 1921, and then again March and May 1922. The researchers were hesitant to work with a commercial drug firm, particularly since they had the Connaught Laboratories' non-commercial facilities at hand. But as limits were reached at the scale to which Connaught could produce insulin, Clowes and Eli Lilly met with the researchers in 1922 to negotiate an agreement with the University of Toronto scientists to mass-produce insulin. The collaboration greatly accelerated the large-scale production of the extract.\nIn 1923, the company began selling Iletin, the company's tradename for the first commercially available insulin product in the U.S. for the treatment of diabetes. Numerous objections were registered by the Insulin Committee of the University of Toronto in regard to Lilly's use of the term \"Iletin\", although production continued under this name and the objection was later dropped \"as a concession\".\nAlso in 1923, Banting and Macleod were awarded the Nobel Prize for their research, which they subsequently shared with co-discoverers Charles Best and James Collip. Insulin, \"the most important drug\" in the company's history, did \"more than any other\" to make Lilly \"one of the major pharmaceutical manufacturers in the world.\" Eli Lilly and Company enjoyed an effective monopoly on the sale of insulin in the U.S. for almost two years, until the first of the new American licensees, Frederick Stearns & Co., entered the market in June 1924.\nThe success of insulin enabled the company to attract scientists and, with them, make more medical advances. By the company's 50th anniversary in 1926, its sales had reached $9 million and it was producing over 2,800 products.\nIn 1928, Lilly introduced Liver Extract 343 for the treatment of pernicious anemia, a blood disorder, in a joint venture with two Harvard University scientists, George Minot and William P. Murphy. In 1930, Lilly introduced Liver Extract No. 55 in collaboration with George Whipple, a University of Rochester scientist. Four years later, in 1934, Minot, Murphy, and Whipple were awarded the Nobel Prize in Physiology or Medicine for their research.\nIn the 1930s, the company also continued expansion overseas. In 1934, Eli Lilly and Company Limited, the company's first overseas subsidiary was established in London, and a manufacturing plant was opened in Basingstoke. In 1932, despite the economic challenges of the Great Depression, Lilly's sales rose to $13 million. The same year, Eli Lilly, eldest grandson of Col. Lilly who had joined the company in 1909, was named as the company's president, succeeding his father, who remained as chairman of the board until 1948. In his early years at the company, Eli was especially interested in improving production efficiency and introduced a number of labor-saving devices. He also introduced scientific management principles, implemented cost-savings measures that modernized the company, and expanded the company's research efforts and collaborations with university researchers.\nLaunched in 1930, Lilly developed the vaccine preservative thiomersal (also called merthiolate and thimerosal). Thiomersal is effective by causing susceptible bacteria to autolyze. Merthiolate was a mercury-based antiseptic and germicide that \"had been formulated at the University of Maryland with support of a Lilly research fellowship.\" In November 2002, congressional Republicans inserted a provision into a domestic security bill that President George W. Bush signed into a law, protecting Eli Lilly from all suits in the federal courts, alleging that the drug, Thiomersal caused autism and other neurological disorders in children, such that all such matters be heard by a special master appointed for the purpose, rather than regular federal courts. Its toxicology was that it metabolized into ethylmercury (C2H5Hg+) and thiosalicylate, in the body. However, since the mid-2000s it has mostly fallen out of use.\nIn 1934, the firm opened two new facilities in Indianapolis on the McCarty Street complex: a replica of Lilly's 1876 laboratory and the new Lilly Research Laboratories, \"one of the most fully equipped facilities in the world.\" As part of its research and product development process Lilly also conducted clinical studies at Indianapolis City Hospital. Lilly continues to conduct clinical studies to test medications before their introduction to the market.\nPatented by Lilly in 1934, secobarbital, is a barbiturate derivative with anesthetic, anticonvulsant, sedative and hypnotic properties. Lilly marketed Secobarbital under the brand name Seconal. Secobarbital is indicated for the treatment of epilepsy, temporary insomnia and as a pre-operative medication to produce anesthesia and anxiolysis in short surgical, diagnostic, or therapeutic procedures which are minimally painful. With the onset of new therapies for the treatment of these conditions, Secobarbital has been less utilized, and Lilly ceased manufacturing it in 1999. Secobarbital gained considerable attention during the 1970s, when it gained wide popularity for recreational drug use. In September 1970, rock music guitarist legend Jimi Hendrix died from a secobarbital overdose. In June 1969, secobarbital overdose was the cause of death of actress Judy Garland. The drug was a central part of the plot of the hugely popular novel Valley of the Dolls (1966) by Jacqueline Susann in which three highly successful Hollywood women each fall victim, in various ways, to the drug. The novel was later released as a film by the same name.\nThe company provided relief after the 1936 Johnstown Flood.\nDuring World War II, the company expanded production to a new high, manufacturing merthiolate, an organomercury compound, and penicillin, a beta-lactam antibiotic. Lilly also cooperated with the American Red Cross to process blood plasma. By the end of World War II, the company had dried over two million pints of blood, \"about 20 percent of the United States' total\". Merthiolate, first introduced in 1930, was an \"antiseptic and germicide\" that became a U.S. Army standard issue during World War II. During World War II, Lilly manufactured products for military use, including aviator survival kits and seasickness medications for the D-Day invasion as well as penicillin. During World War II, Lilly produced penicillin and other antibiotics, \"antimalarials,\" blood plasma, encephalitis vaccine, typhus and influenza vaccine, gas gangrene antitoxin, Merthiolate, and Iletin (Insulin, Lilly).\nInternational operations expanded even further during World War II. In 1943, Eli Lilly International Corp. was formed as a subsidiary to encourage business trade abroad. By 1948, Lilly employees worked in 35 countries, most of them as sales representatives in Latin America, Asia, and Africa.\nAfter three generations of Lilly family leadership under company founder, Col. Eli Lilly, his son, Josiah K. Lilly Sr., and two grandsons, Eli Lilly Jr. and Josiah K. Lilly Jr., the company announced a reorganization in 1944 that prepared the way for future expansion and the eventual separation of company management from its ownership.\nIn 1945, Lilly began a major expansion effort that included two manufacturing operations in Indianapolis. The company purchased the massive Curtiss-Wright propeller plant on Kentucky Avenue, west of the company's McCarty Street operation. When renovation was completed in mid-1947, the Kentucky Avenue location manufactured antibiotics and capsules and housed the company's shipping department. By 1948, Lilly employed nearly 7,000 people.\nIn 1947, Lilly became the first distributor of methadone in the United States, an analgesic used frequently in the treatment of heroin, opium and other opioid and narcotic drug addictions. It was marketed under the trade name \"Dolophine\"/ Eli Lilly was able to acquire the right to produce the drug commercially for just $1 because the patent rights of the original patent holders, IG Farben and Farbwerke Hoechst, were not protected after the Allies of World War II seized all German patents, research records and trade names.\nIn 1948, Eli Lilly, who served as the company's president since 1932, retired from active management, became chairman of the board, and relinquished the presidency to his brother, Josiah K. Lilly Jr. (Joe). During Eli's 16-year presidency, sales rose from $13 million in 1932 to $117 million in 1948. Joe joined the company in 1914 and concentrated on the company's personnel and marketing efforts. He served as company president from 1948 to 1953, then became chairman of the board, and remained in that capacity until his death in 1966.\nThroughout the mid-20th century, Lilly continued to expand its production facilities outside of Indianapolis. In 1950, Lilly launched Tippecanoe Laboratories in Lafayette, Indiana, and increased antibiotic production with its patent on erythromycin.\nIn 1949, Eli Lilly went into partnership with the United States Army Reserve, setting up a local Strategic Intelligence Research and Analysis (SIRA) Unit to allow employees to research company data for the scientific logistics and Eurasian fields of study.\nIn the 1950s, Lilly introduced two new antibiotics, vancomycin, a glycopeptide antibiotic, and erythromycin. In the 1950s and 1960s, as generic drugs began flooding the marketplace after the expiration of patents, Lilly diversified into other areas, including agricultural chemicals, veterinary medicine products, cosmetics, and medical instruments.\nIn 1952, the company offered its first public shares of stock, which are traded on the New York Stock Exchange.\nIn 1953, Eugene N. Beesley was named the first non-family member to become the company's president, beginning the transition to non-family management.\nIn 1954, Lilly formed Elanco, named after its parent company, for the production of veterinary medicine.\nAlso in 1954, the National Foundation for Infantile Paralysis, now the March of Dimes, contracted with five pharmaceutical companies, Lilly, Cutter Laboratories, Parke-Davis, Pitman-Moore Company, and Wyeth to produce Salk's polio vaccine for clinical trials. Lilly's selection to produce the vaccine was, in part, due to its previous experience in collaborations with university researchers. In 1955, Lilly manufactured 60% of Salk's polio vaccine.\nIn 1962, the company acquired The Distillers Company and established a major factory in Liverpool, England. In 1968, Lilly built its first research facility outside the United States, the Lilly Research Centre, in Surrey, England. In 1969, the company opened a new plant in Clinton, Indiana.\nDuring the 1970s and 1980s, Eli Lilly and Company underwent a flurry of drug production, including Keflex, an antibiotic, in 1971, Dobutrex, a cardiogenic shock heart drug in 1977, Ceclore, which ultimately became the world's top selling oral antibiotic, in 1979, Eldisine, a leukemia drug, Oraflex, an arthritis drug, and Darvon, an opioid drug used in pain management.\nIn 1971, to further diversify its product line, Lilly acquired Elizabeth Arden, Inc. for $38 million. Although Arden continued to lose money for five years after Lilly acquired it, by 1982, Arden's sales were up 90 percent from 1978, with profits doubling to nearly $30 million. In 1987, Lilly sold Arden to Fabergé for $657 million.\nIn 1972, Richard Donald Wood became Lilly's president and CEO after the retirement of Burton E. Beck.\nIn 1977, Lilly acquired IVAC Corporation, which manufactures vital signs and intravenous fluid infusion monitoring systems. The same year, Lilly acquired Cardiac Pacemakers, Inc., a manufacturer of pacemakers for $127 million. In 1980, Lilly acquired Physio-Control, a pioneering company in defibrillation. Advance Cardiovascular Systems was acquired in 1984 for $85 million in stock.\nLilly acquired Hybritech in 1986 for $350 million; it was sold to Beckman Coulter in 1995. In 1988, it acquired Devices for Vascular Intervention for $50 million, with the potential for up to another $150 million in contingent payments. Lilly acquired Pacific Biotech in 1990; it was sold to QuidelOrtho in 1995 for $3.95 million. In 1992, Lilly acquired Origin Medsystems, which was developing several devices for use in laparoscopy. Heart Rhythm Technologies was acquired in 1992.\nFluoxetine (Prozac), introduced in 1988, quickly became the company's best-selling product for treatment of depression, but Lilly lost its U.S. patent protection for the product in 2001. Prozac was one of the first therapies in its class to treat clinical depression by blocking the uptake of serotonin within the human brain.\nIn 1989, a joint agrochemical venture between Elanco and Dow Chemical created DowElanco. In 1997, Lilly sold its 40% share in the company to Dow Chemical for $1.2 billion and the name was changed to Dow AgroSciences.\nIn 1991, Vaughn Bryson became president and CEO and Wood became board chairman. During Bryson's 20-month tenure as Lilly's president and CEO, the company reported its first quarterly loss as a publicly traded company.\nIn 1993, Randall L. Tobias, vice chairman of AT&T Corporation and a Lilly board member, was named Lilly's chairman, president, and CEO, the first president and CEO recruited from outside of the company.\nIn 1994, Lilly separated its medical device division.\nIn 1994, Lilly acquired PCS Systems, the largest drug benefits health maintenance organization at the time, for $4 billion.\nReleased in 1996, Zyprexa (Olanzapine) (for schizophrenia and bipolar disorder, as well as off-label uses) (see Illegal marketing of Zyprexa) was the company's best selling drug through 2010, when the patent expired.\nIn May 1996, the Food and Drug Administration approved gemcitabine (Gemzar) for the treatment of pancreatic cancer. Gemzar is commonly used in the treatment of pancreatic cancer, usually in coordination with 5-FU chemotherapy and radiation therapy. Gemzar also is routinely used in the treatment of non-small cell lung cancer.\nIn 1998, the company dedicated new laboratories for clinical research at the Indiana University Medical Center in Indianapolis.\nSidney Taurel, former chief operating officer of Lilly, was named CEO in July 1998 to replace Tobias, who retired. Taurel became chairman of the board in January 1999. Taurel retired as CEO in March 2008, but remained as chairman of the board until 31 December 2008. John C. Lechleiter was elected as Lilly's CEO and president, effective 1 April 2008. Lechleiter had served as Lilly's president and chief operating officer since October 2005.\nIn October 1998, Lilly formed a 50-50 joint venture with Icos, a Bothell, Washington-based biotechnology company, to develop and commercialize Tadalafil (Cialis), for the treatment of erectile dysfunction. Lilly agreed to pay Icos an upfront fee of $75 million.\n\n2000-present\nIn September 2002, Lilly partnered with Amylin Pharmaceuticals to develop and commercialize Amylin's new drug based on exendin-4, a novel substance isolated from the venom of the Gila monster. Exenatide, the first of the GLP-1 receptor agonists, was approved by the U.S. Food and Drug Administration in April 2005.\nIn 2003, Lilly introduced Cialis (tadalafil), a competitor to Viagra for erectile dysfunction developed in a partnership with Icos. Cialis maintains an active period of 36 hours, causing it sometimes to be dubbed the \"weekend pill\". It was advertised during the 2004 Super Bowl XXXVIII and 2005 Super Bowl XXXIX halftime shows.\nIn 2004, Lilly introduced duloxetine (Cymbalta), a serotonin-norepinephrine reuptake inhibitor used predominantly in the treatment of major depressive disorders and generalized anxiety disorder. It ranks with Prozac as one of the most financially successful pharmaceuticals in industry history. It is also used in the treatment of fibromyalgia, neuropathy, chronic pain and osteoarthritis.\nIn January 2007, Lilly acquired Icos for $2.1 billion, after raising its offer and facing opposition from Institutional Shareholder Services. Lilly subsequently closed Icos' manufacturing operations, terminated nearly 500 Icos employees, leaving 127 employees working at the biologics facility. In December 2007, CMC Biopharmaceuticals A/S (CMC), a Copenhagen-based provider of contract biomanufacturing services, bought the Bothell, Washington-based biologics facility from Lilly and retained the existing 127 employees.\nIn 2008, InnoMed PredTox, a collaboration with pharmaceutical companies, research organizations, and the European Commission to improve the safety of drugs, which included Lilly S.A. in Switzerland, secured an €8 million budget for a 40-month project that was coordinated by the European Federation of Pharmaceutical Industries and Associations (EFPIA), an organization who represents the research-based pharmaceutical industry and biotech companies operating in Europe. In 2008, Lilly's activities included research projects within the framework of the Innovative Medicines Initiative, a public-private research initiative in Europe that is a joint effort of the EFPIA and the European Commission.\nIn January 2009, the largest criminal fine in U.S. history, totaling $1.415 billion, was imposed on Lilly for illegal marketing of its best-selling product, the atypical antipsychotic medication, Zyprexa.\nIn January 2011, Boehringer Ingelheim and Lilly announced a global agreement to jointly develop and market new APIs for diabetes therapy. Lilly could receive more than $1 billion for their work on the project, while Boehringer Ingelheim could receive more than $800 million from development of the new drugs. Boehringer Ingelheim's oral anti-diabetic Linagliptin, BI 1077, and two of Lilly's insulin analogs, LY2605541 and LY2963016, were in phase II and III of clinical development at that time.\nIn April 2014, Lilly acquired Switzerland-based Novartis AG's animal health business for $5.4 billion in cash to strengthen and diversify its Elanco unit. To gain regulatory approval, the milbemycin oxime/lufenuron heartworm treatment was divested to Virbac.\nIn March 2015, the company announced it would join Hanmi Pharmaceutical in developing and commercializing Hanmi's phase I Bruton's tyrosine kinase inhibitor HM71224 in a deal that could yield $690 million. A day later, however, the company announced another deal with China's Innovent Biologics to co-develop and commercialize at least three of Innovent's treatments over the next decade, in a deal which could generate up to $456 million; the collaboration was subsequently expanded in 2022, according to Innovent. As part of the deal, the company contributed its c-Met monoclonal antibody, and Innovent contributed a monoclonal antibody, which targets CD-20. The second compound from Innovent is a preclinical immunooncology molecule. The following week, the company announced it would restart its collaboration with Pfizer surrounding the Phase III trial of Tanezumab. Pfizer is expected to receive an upfront sum of $200 million from the company.\nIn April 2015, Lilly engaged CBRE Group to sell its biomanufacturing facility in Vacaville, California, a 52 acres (0.21 km2) campus and facility that is one of the largest biopharmaceutical manufacturing centers in the U.S.\nIn July 2016, Lechleiter retired and was succeeded by David Ricks.\nIn January 2017, Elanco, then a subsidiary of the company, acquired Boehringer Ingelheim Vetmedica, a subsidiary of Boehringer Ingelheim's U.S. feline, canine, and rabies vaccines portfolio for $885 million.\nIn March 2017, Lilly acquired CoLucid Pharmaceuticals for $960 million, obtaining the late clinical-stage migraine therapy candidate, lasmiditan.\nIn August 2017, Lilly and Shionogi jointly licensed their product varespladib to Ophirex for Ophirex's novel snakebite treatment program.\nIn May 2018, Lilly acquired Armo Biosciences for $1.6 billion. Days later, the company announced it would acquire Aurora kinase A inhibitor developer AurKa Pharma, and control over the lead compound, AK-01, for up to $575 million.\nIn January 2019, Lilly announced it would acquire Loxo Oncology for $235 per share, valuing the business at around $8 billion, which significantly expanded the business's oncology offerings. The deal gave Lilly Loxo's oral TRK inhibitor, Vitrakvi (Larotrectinib), LOXO-292, an oral proto-oncogene receptor tyrosine kinase rearranged during transfection (RET) inhibitor, LOXO-305, an oral Bruton's tyrosine kinase (BTK) inhibitor, and LOXO-195, a follow-on TRK inhibitor.\nIn March 2019, the company completed the corporate spin-off of Elanco.\nIn August 2019, Elanco acquired the Bayer animal health business for $7.6 billion.\nIn January 2020, the company announced its acquisition of Dermira for $1.1 billion, gaining control of lebrikizumab, glycopyrronium cloth used in the treatment of hyperhidrosis, and other assets.\nIn June 2020, Lilly announced that, in collaboration with Vancouver-based AbCellera, it had begun the world's first study of a potential monoclonal antibody treatment for treatment of COVID-19, with a Phase 1 trial of LY-CoV555. By August 2020, the challenging aspects of running a clinical trial in a long-term care facility during a pandemic prompted Lilly to create the first of many customized recreational vehicles into mobile research units (MRU) to meet people where they were and support mobile labs and clinical trial material preparation. A trailer truck could escort the MRU with supplies to create an on-site infusion clinic. Lilly deployed the mobile research unit fleet in response to outbreaks of the virus at long-term care facilities across the U.S.\nIn September 2020, Amgen partnered with Lilly to manufacture COVID-19 antibody therapies.\nIn October 2020, Lilly announced that its cocktail was effective and that it had filed with the FDA for an emergency use authorization (EUA). The same day, Regeneron Pharmaceuticals also filed for an EUA for its own monoclonal antibody treatment. The same month, Lilly announced it would acquire Disarm Therapeutics and its experimental treatments for axonal degeneration, via SARM1 inhibitors, for $135 million plus up to another $1.225 billion based on regulatory and commercial milestones.\nAlso in October 2020, Lilly announced that the National Institutes of Health (NIH) ACTIV-3 clinical trial evaluating its monoclonal antibody, bamlanivimab (LYCoV555), found that bamlanivimab was not effective in treating people hospitalized with COVID-19, but data showed bamlanivimab might be effective in treating COVID-19 by reducing viral load, symptoms, and the risk of hospitalization in outpatients. Other studies, including the NIH ACTIV-2 trial and its own BLAZE-1 trial, continued to evaluate bamlanivimab. In November 2020, the FDA issued an emergency use authorization (EUA) for the investigational monoclonal antibody therapy bamlanivimab for the treatment of mild-to-moderate COVID-19 in adult and pediatric patients. In December 2020, Lilly announced it would acquire Prevail Therapeutics Inc. for $1 billion, boosting its pipeline in neurodegenerative disease gene therapies.\nIn April 2021, the FDA revoked the emergency use authorization (EUA) that allowed and signaled FDA agreement for the investigational monoclonal antibody therapy bamlanivimab, when administered alone, to be used for the treatment of mild-to-moderate COVID-19 in adults and certain pediatric patients. On 18 May 2021, the FDA accepted Lilly's application for Tyvyt (sintilimab), in combination with Lilly's own Alimta (pemetrexed) and platinum chemotherapy for newly diagnosed nonsquamous non-small cell lung cancer. In July 2021, the company announced it would acquire Protomer Technologies for more than $1 billion.\nIn January 2022, distribution of Lilly's COVID-19 antibody drug was paused due to lack of efficacy against the emerging omicron variant. A second COVID-19 monoclonal antibody therapy, bebtelovimab, developed with AbCellera, was granted Emergency Use Authorization in February 2022, with the U.S. government committing to a $720 million purchase of up to 600,000 doses.\nIn May 2022, the FDA approved Lilly's type 2 diabetes drug Mounjaro (tirzepatide). In August 2022, following the overturning of Roe v. Wade in the Dobbs decision, the state of Indiana passed a near total ban on abortion, and Lilly said the move would make it difficult to attract talent to the state and that it would be forced to look for \"more employment growth\" elsewhere.\nIn October 2022, Lilly acquired Akouos for $487 million in upfront and $123 million deferred payments.\nIn early 2020, Lilly introduced the Lilly Insulin Value Program, where people who have commercial insurance or no insurance can receive a savings card to fill their entire monthly prescription of any Lilly insulin for $35. In 2023, the Inflation Reduction Act extended a similar concept across all insulin suppliers by capping out-of-pocket costs for insulin at $35 per monthly prescription among Medicare Parts B and D enrollees.\nIn January 2023, Lilly and TRexBio announced a collaboration and license agreement for three assets to treat immune-mediated diseases. TRexBio received an upfront payment of $55 million as part of this deal. In June the company announced it would acquire startup Emergence Therapeutics for an undisclosed sum and Sigilon Therapeutics for $300 million. The company's 2023 research and development focus has been reported to be on drugs in the obesity, diabetes, Alzheimer's and autoimmune areas.\nIn March 2023, Eli Lilly announced a $35 cap on the price of monthly insulin to be put in place immediately in order to be in line with the Inflation Reduction Act.\nIn July 2023, Lilly announced it would acquire Versanis for $1.93 billion. In October 2023, Eli Lilly acquired Point Biopharma for $1.4 billion.\nIn November 2023, the FDA approved tirzepatide for the treatment of obesity under the brand name Zepbound.\nIn 2024, the FDA and the UK approved Donanemab, sold under the brand name Kisunla, a monoclonal antibody used for the treatment of Alzheimer's disease.\nIn March 2024, Lilly announced a deal with Amazon to offer home delivery of certain medications for diabetes, obesity, and migraines, on behalf of LillyDirect.\nIn August 2025, Eli Lilly signed a deal which was worth $1.3 billion with privately held Superluminal Medicines to invent and enhance small-molecule drugs through AI to treat obesity and other cardiometabolic diseases.\n\nAcquisition history\nContributions\nNotable organizations to which Eli Lilly and Company has provided funding include the Northern Ontario School of Medicine, Population Health Research Institute (PHRI) at McMaster University, University of Toronto, University of Washington, National Press Foundation, American Society of Hematology, Endocrine Society, European Society of Cardiology, HOPE Worldwide, AdvaMed, Centre for Addiction and Mental Health (CAMH), Hospital for Sick Children (SickKids), Princess Margaret Cancer Centre, Scarborough Health Network, Sinai Health System, Sunnybrook Health Sciences Centre, Arthritis Australia, Diabetes Canada, and Juvenile Diabetes Research Foundation.\nThe company spends $6–10 million per year on lobbying in the United States. Notable lobbying organizations to which the company has contributed include Foundation for the National Institutes of Health, Innovative Medicines Canada, International Federation of Pharmaceutical Manufacturers & Associations, National Health Council, and Pharmaceutical Research and Manufacturers of America.\n\nLegal issues\nBGH\nIn August 2008, Eli Lilly purchased the right to manufacture Bovine somatotropin (bovine growth hormone), used to increase milk production in dairy cattle, from Monsanto. Use of the supplement has become controversial due to the animal ethics and human health concerns.\n\n340B\nIn 2021, Eli Lilly filed a court motion against in response to an advisory opinion of the United States Department of Health and Human Services indicating that Eli Lilly and other drug manufacturers must continue to offer reduced pricing to covered outpatient drugs through pharmacies contracted to hospitals rather than only to the hospitals themselves.\n\nProzac\nIn September 1989, in the Standard Gravure shooting, Joseph T. Wesbecker killed eight people and injured twelve before committing suicide. His relatives and victims blamed his actions on the Prozac medication he had begun taking a month prior. The incident set off a chain of lawsuits and public outcries. Lawyers began using Prozac to justify the abnormal behaviors of their clients. Eli Lilly was accused of not doing enough to warn patients and doctors about the adverse effects, which it had described as \"activation\", years prior to the incident. The link between suicide and antidepressants remains a subject of public and academic dispute.\nIn October 2004, the FDA added a boxed warning to all antidepressant drugs regarding use in children. In 2006, the FDA included adults aged 25 or younger. In February 2018, the FDA ordered an update to the warnings based on statistical evidence from twenty-four trials in which the risk of such events increased from two percent to four percent relative to the placebo trials.\n\nIllegal marketing of Zyprexa\nIn 2009, Lilly pleaded guilty for illegally marketing Zyprexa and agreed to pay a $1.415 billion penalty that included a criminal fine of $515 million, the largest ever in a healthcare case and the largest criminal fine for an individual corporation ever imposed in a U.S. criminal prosecution of any kind at the time.\nEli Lilly has faced many lawsuits from people who claimed they developed diabetes or other diseases after taking olanzapine (branded Zyprexa), an antipsychotic medication, as well as by various governmental entities, insurance companies, and others. Internal documents provided to The New York Times revealed that Lilly had downplayed the risks of Zyprexa. According to the documents, 16 percent of people taking Zyprexa gained more than 66 pounds in their first year, a much larger figure than Eli Lilly had shared with doctors.\nIn 2006, Lilly paid $700 million to settle around 8,000 of these lawsuits, and in early 2007, Lilly settled around 18,000 suits for $500 million, which brought the total Lilly had paid to settle suits related to the drug to $1.2 billion.\nIn March 2008, Lilly settled a suit with the state of Alaska, and in October 2008, Lilly agreed to pay $62 million to 32 states and the District of Columbia to settle suits brought under state consumer protection laws. In 2009, four sales representatives for Eli Lilly filed separate qui tam lawsuits against the company for illegally marketing Zyprexa for uses not approved by the Food and Drug Administration.\nEli Lilly pleaded guilty to a US federal criminal misdemeanor charge of illegally marketing Zyprexa, actively promoting the drug for off-label uses, particularly for the treatment of dementia in the elderly. The $1.415 billion penalty included an $800 million civil settlement, a $515 million criminal fine, and forfeit assets of $100 million. The US Justice Department said the criminal fine of $515 million was the largest ever in a healthcare case and the largest criminal fine for an individual corporation ever imposed in a US criminal prosecution of any kind. \"That was a blemish for us,\" John C. Lechleiter, CEO of Lilly, said. \"We don't ever want that to happen again. We put measures in place to assure that not only do we have the right intentions in integrity and compliance, but we have systems in place to support that.\" In an internal email, Lechleiter had stated \"we must seize the opportunity to expand our work with Zyprexa in this same child-adolescent population\" for off-label use.\nIn January 2020, lawyer James Gottstein published a book titled The Zyprexa Papers summarizing the legal activities surrounding Zyprexa, and their impact on the political landscape of psychiatry and antipsychiatry in the US. The book details of how he obtained the Zyprexa papers, including how Will Hall and a small group of \"psychiatric survivors\" untraceably spread the Zyprexa Papers on the Internet and his battles on behalf of Bill Bigley, the psychiatric patient whose ordeal made possible the exposure of the Zyprexa Papers.\n\nDiscrimination\nIn March 2021, Eli Lilly and Company was accused of sex discrimination by a former lobbyist who claimed she was forced to work in a sexually hostile work environment. The parties involved settled for an undisclosed amount in June 2021.\nIn September 2021, Eli Lilly and Company was accused in a federal court lawsuit of discriminating against older applicants for sales positions based on their implementation of hiring quotas for millennials.\n\nCanada patent lawsuit\nIn September 2013, Eli Lilly sued Canada for violating its obligations to foreign investors under the North American Free Trade Agreement by allowing its courts to invalidate patents for Atomoxetine (Strattera) and Olanzapine (Zyprexa). Canadian courts found the seven-week long study of twenty-two patients for Atomoxetine (Strattera), too short and too narrow in scope to qualify for the patent. The Olanzapine (Zyprexa) patent was invalidated because it had not achieved its promised utility. The company sought damages in the amount of $500 million for lost profits. They ultimately lost the case in 2017.\n\nIllegal marketing of Evista\nIn December 2005, Eli Lilly and Company pleaded guilty and paid $36 million in connection with the illegal promotion of Raloxifene (Evista), a medication typically used to prevent and treat osteoporosis in postmenopausal women. Sales representatives were trained to promote Evista for breast cancer and cardiovascular disease, to prompt or bait questions from doctors, and to send them unsolicited letters promoting Evista for unapproved use. The company also distributed a videotape in which a sales representative declared that \"Evista truly is the best drug for the prevention of all these diseases.\" Some sales representatives had also been instructed to conceal the disclosure page which stated that the effectiveness of the drug in reducing breast cancer risks had not yet been established.\n\nInsulin pricing\nIn January 2019, lawmakers from the United States House of Representatives sent letters to Eli Lilly and other insulin manufacturers asking for explanations for rapidly raising insulin prices. The annual cost of insulin for people with type 1 diabetes in the US almost doubled from $2,900 to $5,700 over the period from 2012 to 2016.\nRenewed attention was brought to Eli Lilly's pricing of insulin in November 2022, after a verified Twitter account impersonating Eli Lilly posted on Twitter that insulin would now be free. The following year, the company announced that it would be reducing the out-of-pocket price of insulin to $35 a month. The company also stated that it would lower the price of Humalog from $275 a month to $66 and that it would offer insulin glargine at a 78% discount compared to rival company Sanofi. Despite this, the reduced costs will not apply to Eli Lilly's newer brands of insulin, and the company's pricing is still significantly higher than it was several decades prior.\n\nBribing providers for prescriptions\nIn August 2025, Texas sued Lilly for allegedly \"bribing\" providers to prescribe Mounjaro and Zepbound. Lilly allegedly offered illegal incentives to medical providers in Texas, including \"free nurses\" and reimbursement support services, while the costs of the drugs were covered by Medicaid.\n\nReferences\nAdditional references\nBodenhamer, David J; Barrows, Robert G, eds. (1994). The Encyclopedia of Indianapolis. Bloomington and Indianapolis: Indiana University Press. ISBN 978-0-253-31222-8.\nKahn, E. J. (1975). All In A Century: The First 100 Years of Eli Lilly and Company. West Cornwall, CT. OCLC 5288809.{{cite book}}:  CS1 maint: location missing publisher (link)\nPodczeck, Fridrun; Jones, Brian E. (2004). Pharmaceutical Capsules. Chicago: Pharmaceutical Press. ISBN 978-0-85369-568-4.\nPrice, Nelson (1997). Indiana Legends: Famous Hoosiers From Johnny Appleseed to David Letterman. Indianapolis: Guild Press of Indiana. ISBN 978-1-57860-006-9.\nTaylor Jr., Robert M.; Stevens, Errol Wayne; Ponder, Mary Ann; Brockman, Paul (1989). Indiana: A New Historical Guide. Indianapolis: Indiana Historical Society. p. 481. ISBN 978-0-87195-048-2.\nTobias, Randall; Tobias, Todd (2003). Put the Moose on the Table: Lessons in Leadership from a CEO's Journey through Business and Life. Indiana University Press. ISBN 978-0-253-11011-4.\nWeintraut, Linda; Nolan, Jane R. \"The Secret Life of Building 314\". Traces of Indiana and Midwestern History. 8 (3). Indianapolis: Indiana Historical Society: 16–27.\n\nExternal links\n\nOfficial website \nHand book of pharmacy and therapeutics, Science History Institute, c. 1919\nBusiness data for Eli Lilly and Company:",
  "clean_text": "Eli Lilly and Company, doing business as Lilly, is an American multinational pharmaceutical company headquartered in Indianapolis, Indiana, with offices in 18 countries. Its products are sold in approximately 125 countries. The company was founded in 1876 by Eli Lilly, a pharmaceutical chemist and Union army veteran during the American Civil War for whom the company was later named. The company is ranked 11th on the list of largest biomedical companies by revenue and is the most valuable pharmaceutical company worldwide. It is ranked 100th on the Fortune 500 and 138th on the Forbes Global 2000. In November 2025, the company reached a $1 trillion market capitalization, the first health-care company in the world to do so. The company's primary products are tirzepatide (Mounjaro and Zepbound) for treatment of type 2 diabetes, weight loss, and obstructive sleep apnea (37% of 2024 revenues); abemaciclib (Verzenio) for the treatment of advanced or metastatic breast cancers (12% of 2024 revenues); dulaglutide (Trulicity) for the treatment of type 2 diabetes (12% of 2024 revenues); ixekizumab (Taltz) for the treatment of autoimmune diseases (7% of 2024 revenues); empagliflozin (Jardiance) for the treatment of type 2 diabetes (7% of 2024 revenues); Insulin lispro (Humalog), a modified type of medical insulin (5% of 2024 revenues); ramucirumab (Cyramza), a fully human monoclonal antibody used for the treatment of cancer (2% of 2024 revenues); baricitinib (Olumiant), an immunomodulatory medication used for the treatment of rheumatoid arthritis, alopecia areata, and COVID-19 (2% of 2024 revenues); insulin (Humulin) to treat high blood glucose (2% of 2024 revenues); and galcanezumab (Emgality), a humanized monoclonal antibody used for the prevention of migraines (2% of 2024 revenues). In 2024, 67% of the company's revenues came from the United States. Lilly was the first company to mass-produce both the polio vaccine, developed in 1955 by Jonas Salk, and insulin. It was one of the first pharmaceutical companies to produce human insulin using recombinant DNA, including Humulin (insulin medication), Humalog (insulin lispro), and the first approved biosimilar insulin product in the U.S., Basaglar (insulin glargine). It achieved commercial success with major depressive disorder drugs Prozac (fluoxetine) (1986), Cymbalta (duloxetine) (2004), and its antipsychotic medication Zyprexa (olanzapine) (1996), all of which are now off patent and are manufactured by others as generic drugs. In 2005, Lilly brought exenatide to market—the first of the GLP-1 receptor agonists—followed by the GIP and GLP-1 receptor agonist drugs Mounjaro and Zepbound (tirzepatide). The Lilly Endowment, a charitable foundation organized in 1937 by the founding family, owns 10% of the company. History Founding The company was founded by Colonel Eli Lilly, a pharmaceutical chemist and Union army veteran of the American Civil War. Lilly served as the company president until his death in 1898. In 1869, after working for drugstores in Indiana, Lilly became a partner in a Paris, Illinois-based drugstore with James W. Binford. Four years later, in 1873, Lilly left the partnership with Binford, and returned to Indianapolis. In 1874, Lilly partnered with John F. Johnston, and opened a drug manufacturing operation called Johnston and Lilly. In 1876, Lilly dissolved the partnership, and used his share of the assets to open his own pharmaceutical manufacturing business, Eli Lilly and Company, in Indianapolis. The sign outside, above the shop's door, read: \"Eli Lilly, Chemist.\" In 1886, Ernest G. Eberhardt, a chemist, joined the company as its first full-time research scientist. Lilly began his manufacturing venture with three employees, including his son, Josiah (J. K.). One of the first medicines that Lilly produced was quinine, a drug used to treat malaria, a mosquito-borne disease. By the end of 1876, sales reached $4,470. Around 1890, Col. Lilly turned over operation of the family business to his son, Josiah, who ran the company for the next several decades. Col. Lilly remained active in civic affairs and assisted a number of local organizations, including the Commercial Club of Indianapolis, which later became the Indianapolis Chamber of Commerce, and the Charity Organization Society, a forerunner to the Family Services Association of Central Indiana, an organization supported by United Way of America. Josiah's sons, Eli and Joe, were also philanthropists who supported numerous cultural and educational organizations. 19th century In 1878, Lilly hired his brother, James, as his first full-time salesman, and the subsequent sales team marketed the company's drugs nationally. By 1879, the company had grown to $48,000 in sales. The company moved its Indianapolis headquarters from Pearl Street to larger quarters at 36 South Meridian Street. In 1881, the company moved to its current headquarters in Indianapolis's south-side industrial area, and the company later purchased additional facilities for research and production. The same year, Lilly incorporated the business as Eli Lilly and Company, elected a board of directors, and issued stock to family members and close associates. Lilly's first innovative product was gelatin-coating for pills and capsules. The company's other early innovations included fruit flavorings and sugarcoated pills, which made the medicines easier to swallow. In 1882, Colonel Lilly's only son, Josiah K. Lilly Sr. (J. K.), a pharmaceutical chemist, graduated from the Philadelphia College of Pharmacy in Philadelphia, and returned to Indianapolis to join the family business as a superintendent of its laboratory. In 1883, the company contracted to mix and sell Succus Alteran, its first widely successful product and one its best sellers. The product was marketed as a \"blood purifier\" and as a treatment for syphilis, some types of rheumatism, and skin diseases such as eczema and psoriasis. By the late 1880s, Colonel Lilly was one of the Indianapolis area's leading businessmen, whose company had over 100 employees and $200,000 in annual sales. In 1890, Colonel Lilly fully turned over the day-to-day management of the business to J. K., who ran the company for 34 years. The 1890s were a tumultuous decade economically, but the company flourished. In 1894, Lilly purchased a manufacturing plant to be used solely for creating capsules. The company also made several technological advances in the manufacturing process, including automating its capsule production. Over the next few years the company annually created tens of millions of capsules and pills. In 1898, Lilly's son, J. K. Lilly, inherited the company and became its president following Colonel Lilly's death. At the time of Colonel Lilly's death, the company had a product line of 2,005 items and annual sales of more than $300,000. Colonel Lilly was a pioneer in the modern pharmaceutical industry, with many of his early innovations later becoming standard practice. His ethical reforms in a trade that was marked by outlandish claims of miracle medicines began a period of rapid advancement in the development of medicinal drugs. J. K. Lilly continued to advocate for federal regulation on medicines. As the Lilly company grew, other businesses set up operations near the plant on Indianapolis's near south side. The area developed into one of the city's major business and industrial hubs. Lilly's production, manufacturing, research, and administrative operations in Indianapolis eventually occupied a complex of more than two dozen buildings, which covered 15-block area, in addition to its production plants along Kentucky Avenue. In addition to Colonel Lilly, his brother, James, and son, Josiah (J. K.), the company employed other Lilly family. Colonel Lilly's cousin, Evan Lilly, was hired as a bookkeeper. Lilly's grandsons, Eli and Josiah Jr. (Joe) joined the company from a young age. Under J. K.'s leadership, the company introduced scientific management concepts, organized the company's research department, increased its sales force, and began international distribution of its products. For the rest of the late 19th century, Lilly operated in Indianapolis and the surrounding area as many other pharmaceutical businesses did, manufacturing and selling \"sugar-coated pills, fluid extracts, elixirs, and syrups\". The company used plants for its raw materials and produced its products by hand. One historian noted, \"Although the Indianapolis firm was more careful in making and promoting drugs than the patent medicine men of the era, the company remained ambivalent about scientific research.\" 1900s In 1905, J. K. Lilly oversaw a large expansion of the company, and it reached annual sales of $1 million. Following the 1906 San Francisco earthquake, the company sent much needed medicine to support recovery efforts. Before and after World War I, the company experienced rapid growth, including expanded manufacturing facilities at its McCarty Street plant, which improved production capacity with a new Science Building (Building 14), opened in 1911, and a new capsule plant (Building 15) in 1913. In 1913, the company began construction of Lilly Biological Laboratories, a research and manufacturing plant on 150 acres near Greenfield, Indiana. After World War I, the company's expanded production facilities and introduction of new management methods set the stage for Lilly's next crucial phase—its \"aggressive entry into scientific research and development.\" The first big step came in 1919 when Josiah Lilly hired biochemist George Henry Alexander Clowes as director of biochemical research. Clowes had extensive medical research expertise and links to the scientific research community, which led to the company's collaborations with researchers in the U.S. and elsewhere. Clowes's first major collaboration with researchers who developed insulin at the University of Toronto significantly impacted the company's future. Lilly's success with insulin production secured the company's position as a leading research-based pharmaceutical manufacturer, allowing it to attract and hire more research scientists and to collaborate with other universities in additional medical research. In addition to development of new medicines, the company achieved several technological advances, including automation of its production facilities. Lilly was also an innovator in pill capsule manufacturing. It was among the first manufacturers to insert medications into empty gelatin capsules, which provided a more exact dosage. Lilly manufactured capsules for its own needs and sold its excess capacity to others. In 1917, Scientific American described Lilly as \"the largest capsule factory in the world\" and reported that the company was \"capable of producing 2.5 million capsules a day\". One of Lilly's early innovations was fruit flavoring for medicines and sugar-coated pills to make their medicines easier to swallow. Over the next few years, the company created tens of millions of capsules and pills annually. Other advances improved plant efficiency and eliminated production errors. In 1909, Eli Lilly, grandson of the company's founder, introduced a method for blueprinting manufacturing tickets, which created multiples copies of a drug formula and helped eliminate manufacturing and transcription errors. In 1919, Josiah hired biochemist George Henry Alexander Clowes as director of biochemical research. In the 1920s, Eli introduced the new concept of straight-line production to the pharmaceutical industry, where raw materials entered at one end of the facility and the finished product came out the other end, in the company's manufacturing process. Under Eli's supervision, the design for Building 22, a new five-floor plant that opened in Indianapolis in 1926, implemented the straight-line concept to improve production efficiency and lower production costs. One historian noted, \"It was probably the most sophisticated production system in the American pharmaceutical industry.\" This more efficient manufacturing process also allowed the company to hire a regular workforce. Instead of recalling workers at peak times and laying them off when production demand fell, Lilly's regular workforce produced less-costly medicines in off-peak times using the same manufacturing facilities. During the 1920s, the introduction of new products brought the company financial success. In 1921, three University of Toronto scientists, John Macleod, Frederick Banting, and Charles Best, were working on the development of insulin for treatment of diabetes. Clowes proposed a collaboration with the researchers in December 1921, and then again March and May 1922. The researchers were hesitant to work with a commercial drug firm, particularly since they had the Connaught Laboratories' non-commercial facilities at hand. But as limits were reached at the scale to which Connaught could produce insulin, Clowes and Eli Lilly met with the researchers in 1922 to negotiate an agreement with the University of Toronto scientists to mass-produce insulin. The collaboration greatly accelerated the large-scale production of the extract. In 1923, the company began selling Iletin, the company's tradename for the first commercially available insulin product in the U.S. for the treatment of diabetes. Numerous objections were registered by the Insulin Committee of the University of Toronto in regard to Lilly's use of the term \"Iletin\", although production continued under this name and the objection was later dropped \"as a concession\". Also in 1923, Banting and Macleod were awarded the Nobel Prize for their research, which they subsequently shared with co-discoverers Charles Best and James Collip. Insulin, \"the most important drug\" in the company's history, did \"more than any other\" to make Lilly \"one of the major pharmaceutical manufacturers in the world.\" Eli Lilly and Company enjoyed an effective monopoly on the sale of insulin in the U.S. for almost two years, until the first of the new American licensees, Frederick Stearns & Co., entered the market in June 1924. The success of insulin enabled the company to attract scientists and, with them, make more medical advances. By the company's 50th anniversary in 1926, its sales had reached $9 million and it was producing over 2,800 products. In 1928, Lilly introduced Liver Extract 343 for the treatment of pernicious anemia, a blood disorder, in a joint venture with two Harvard University scientists, George Minot and William P. Murphy. In 1930, Lilly introduced Liver Extract No. 55 in collaboration with George Whipple, a University of Rochester scientist. Four years later, in 1934, Minot, Murphy, and Whipple were awarded the Nobel Prize in Physiology or Medicine for their research. In the 1930s, the company also continued expansion overseas. In 1934, Eli Lilly and Company Limited, the company's first overseas subsidiary was established in London, and a manufacturing plant was opened in Basingstoke. In 1932, despite the economic challenges of the Great Depression, Lilly's sales rose to $13 million. The same year, Eli Lilly, eldest grandson of Col. Lilly who had joined the company in 1909, was named as the company's president, succeeding his father, who remained as chairman of the board until 1948. In his early years at the company, Eli was especially interested in improving production efficiency and introduced a number of labor-saving devices. He also introduced scientific management principles, implemented cost-savings measures that modernized the company, and expanded the company's research efforts and collaborations with university researchers. Launched in 1930, Lilly developed the vaccine preservative thiomersal (also called merthiolate and thimerosal). Thiomersal is effective by causing susceptible bacteria to autolyze. Merthiolate was a mercury-based antiseptic and germicide that \"had been formulated at the University of Maryland with support of a Lilly research fellowship.\" In November 2002, congressional Republicans inserted a provision into a domestic security bill that President George W. Bush signed into a law, protecting Eli Lilly from all suits in the federal courts, alleging that the drug, Thiomersal caused autism and other neurological disorders in children, such that all such matters be heard by a special master appointed for the purpose, rather than regular federal courts. Its toxicology was that it metabolized into ethylmercury (C2H5Hg+) and thiosalicylate, in the body. However, since the mid-2000s it has mostly fallen out of use. In 1934, the firm opened two new facilities in Indianapolis on the McCarty Street complex: a replica of Lilly's 1876 laboratory and the new Lilly Research Laboratories, \"one of the most fully equipped facilities in the world.\" As part of its research and product development process Lilly also conducted clinical studies at Indianapolis City Hospital. Lilly continues to conduct clinical studies to test medications before their introduction to the market. Patented by Lilly in 1934, secobarbital, is a barbiturate derivative with anesthetic, anticonvulsant, sedative and hypnotic properties. Lilly marketed Secobarbital under the brand name Seconal. Secobarbital is indicated for the treatment of epilepsy, temporary insomnia and as a pre-operative medication to produce anesthesia and anxiolysis in short surgical, diagnostic, or therapeutic procedures which are minimally painful. With the onset of new therapies for the treatment of these conditions, Secobarbital has been less utilized, and Lilly ceased manufacturing it in 1999. Secobarbital gained considerable attention during the 1970s, when it gained wide popularity for recreational drug use. In September 1970, rock music guitarist legend Jimi Hendrix died from a secobarbital overdose. In June 1969, secobarbital overdose was the cause of death of actress Judy Garland. The drug was a central part of the plot of the hugely popular novel Valley of the Dolls (1966) by Jacqueline Susann in which three highly successful Hollywood women each fall victim, in various ways, to the drug. The novel was later released as a film by the same name. The company provided relief after the 1936 Johnstown Flood. During World War II, the company expanded production to a new high, manufacturing merthiolate, an organomercury compound, and penicillin, a beta-lactam antibiotic. Lilly also cooperated with the American Red Cross to process blood plasma. By the end of World War II, the company had dried over two million pints of blood, \"about 20 percent of the United States' total\". Merthiolate, first introduced in 1930, was an \"antiseptic and germicide\" that became a U.S. Army standard issue during World War II. During World War II, Lilly manufactured products for military use, including aviator survival kits and seasickness medications for the D-Day invasion as well as penicillin. During World War II, Lilly produced penicillin and other antibiotics, \"antimalarials,\" blood plasma, encephalitis vaccine, typhus and influenza vaccine, gas gangrene antitoxin, Merthiolate, and Iletin (Insulin, Lilly). International operations expanded even further during World War II. In 1943, Eli Lilly International Corp. was formed as a subsidiary to encourage business trade abroad. By 1948, Lilly employees worked in 35 countries, most of them as sales representatives in Latin America, Asia, and Africa. After three generations of Lilly family leadership under company founder, Col. Eli Lilly, his son, Josiah K. Lilly Sr., and two grandsons, Eli Lilly Jr. and Josiah K. Lilly Jr., the company announced a reorganization in 1944 that prepared the way for future expansion and the eventual separation of company management from its ownership. In 1945, Lilly began a major expansion effort that included two manufacturing operations in Indianapolis. The company purchased the massive Curtiss-Wright propeller plant on Kentucky Avenue, west of the company's McCarty Street operation. When renovation was completed in mid-1947, the Kentucky Avenue location manufactured antibiotics and capsules and housed the company's shipping department. By 1948, Lilly employed nearly 7,000 people. In 1947, Lilly became the first distributor of methadone in the United States, an analgesic used frequently in the treatment of heroin, opium and other opioid and narcotic drug addictions. It was marketed under the trade name \"Dolophine\"/ Eli Lilly was able to acquire the right to produce the drug commercially for just $1 because the patent rights of the original patent holders, IG Farben and Farbwerke Hoechst, were not protected after the Allies of World War II seized all German patents, research records and trade names. In 1948, Eli Lilly, who served as the company's president since 1932, retired from active management, became chairman of the board, and relinquished the presidency to his brother, Josiah K. Lilly Jr. (Joe). During Eli's 16-year presidency, sales rose from $13 million in 1932 to $117 million in 1948. Joe joined the company in 1914 and concentrated on the company's personnel and marketing efforts. He served as company president from 1948 to 1953, then became chairman of the board, and remained in that capacity until his death in 1966. Throughout the mid-20th century, Lilly continued to expand its production facilities outside of Indianapolis. In 1950, Lilly launched Tippecanoe Laboratories in Lafayette, Indiana, and increased antibiotic production with its patent on erythromycin. In 1949, Eli Lilly went into partnership with the United States Army Reserve, setting up a local Strategic Intelligence Research and Analysis (SIRA) Unit to allow employees to research company data for the scientific logistics and Eurasian fields of study. In the 1950s, Lilly introduced two new antibiotics, vancomycin, a glycopeptide antibiotic, and erythromycin. In the 1950s and 1960s, as generic drugs began flooding the marketplace after the expiration of patents, Lilly diversified into other areas, including agricultural chemicals, veterinary medicine products, cosmetics, and medical instruments. In 1952, the company offered its first public shares of stock, which are traded on the New York Stock Exchange. In 1953, Eugene N. Beesley was named the first non-family member to become the company's president, beginning the transition to non-family management. In 1954, Lilly formed Elanco, named after its parent company, for the production of veterinary medicine. Also in 1954, the National Foundation for Infantile Paralysis, now the March of Dimes, contracted with five pharmaceutical companies, Lilly, Cutter Laboratories, Parke-Davis, Pitman-Moore Company, and Wyeth to produce Salk's polio vaccine for clinical trials. Lilly's selection to produce the vaccine was, in part, due to its previous experience in collaborations with university researchers. In 1955, Lilly manufactured 60% of Salk's polio vaccine. In 1962, the company acquired The Distillers Company and established a major factory in Liverpool, England. In 1968, Lilly built its first research facility outside the United States, the Lilly Research Centre, in Surrey, England. In 1969, the company opened a new plant in Clinton, Indiana. During the 1970s and 1980s, Eli Lilly and Company underwent a flurry of drug production, including Keflex, an antibiotic, in 1971, Dobutrex, a cardiogenic shock heart drug in 1977, Ceclore, which ultimately became the world's top selling oral antibiotic, in 1979, Eldisine, a leukemia drug, Oraflex, an arthritis drug, and Darvon, an opioid drug used in pain management. In 1971, to further diversify its product line, Lilly acquired Elizabeth Arden, Inc. for $38 million. Although Arden continued to lose money for five years after Lilly acquired it, by 1982, Arden's sales were up 90 percent from 1978, with profits doubling to nearly $30 million. In 1987, Lilly sold Arden to Fabergé for $657 million. In 1972, Richard Donald Wood became Lilly's president and CEO after the retirement of Burton E. Beck. In 1977, Lilly acquired IVAC Corporation, which manufactures vital signs and intravenous fluid infusion monitoring systems. The same year, Lilly acquired Cardiac Pacemakers, Inc., a manufacturer of pacemakers for $127 million. In 1980, Lilly acquired Physio-Control, a pioneering company in defibrillation. Advance Cardiovascular Systems was acquired in 1984 for $85 million in stock. Lilly acquired Hybritech in 1986 for $350 million; it was sold to Beckman Coulter in 1995. In 1988, it acquired Devices for Vascular Intervention for $50 million, with the potential for up to another $150 million in contingent payments. Lilly acquired Pacific Biotech in 1990; it was sold to QuidelOrtho in 1995 for $3.95 million. In 1992, Lilly acquired Origin Medsystems, which was developing several devices for use in laparoscopy. Heart Rhythm Technologies was acquired in 1992. Fluoxetine (Prozac), introduced in 1988, quickly became the company's best-selling product for treatment of depression, but Lilly lost its U.S. patent protection for the product in 2001. Prozac was one of the first therapies in its class to treat clinical depression by blocking the uptake of serotonin within the human brain. In 1989, a joint agrochemical venture between Elanco and Dow Chemical created DowElanco. In 1997, Lilly sold its 40% share in the company to Dow Chemical for $1.2 billion and the name was changed to Dow AgroSciences. In 1991, Vaughn Bryson became president and CEO and Wood became board chairman. During Bryson's 20-month tenure as Lilly's president and CEO, the company reported its first quarterly loss as a publicly traded company. In 1993, Randall L. Tobias, vice chairman of AT&T Corporation and a Lilly board member, was named Lilly's chairman, president, and CEO, the first president and CEO recruited from outside of the company. In 1994, Lilly separated its medical device division. In 1994, Lilly acquired PCS Systems, the largest drug benefits health maintenance organization at the time, for $4 billion. Released in 1996, Zyprexa (Olanzapine) (for schizophrenia and bipolar disorder, as well as off-label uses) (see Illegal marketing of Zyprexa) was the company's best selling drug through 2010, when the patent expired. In May 1996, the Food and Drug Administration approved gemcitabine (Gemzar) for the treatment of pancreatic cancer. Gemzar is commonly used in the treatment of pancreatic cancer, usually in coordination with 5-FU chemotherapy and radiation therapy. Gemzar also is routinely used in the treatment of non-small cell lung cancer. In 1998, the company dedicated new laboratories for clinical research at the Indiana University Medical Center in Indianapolis. Sidney Taurel, former chief operating officer of Lilly, was named CEO in July 1998 to replace Tobias, who retired. Taurel became chairman of the board in January 1999. Taurel retired as CEO in March 2008, but remained as chairman of the board until 31 December 2008. John C. Lechleiter was elected as Lilly's CEO and president, effective 1 April 2008. Lechleiter had served as Lilly's president and chief operating officer since October 2005. In October 1998, Lilly formed a 50-50 joint venture with Icos, a Bothell, Washington-based biotechnology company, to develop and commercialize Tadalafil (Cialis), for the treatment of erectile dysfunction. Lilly agreed to pay Icos an upfront fee of $75 million. 2000-present In September 2002, Lilly partnered with Amylin Pharmaceuticals to develop and commercialize Amylin's new drug based on exendin-4, a novel substance isolated from the venom of the Gila monster. Exenatide, the first of the GLP-1 receptor agonists, was approved by the U.S. Food and Drug Administration in April 2005. In 2003, Lilly introduced Cialis (tadalafil), a competitor to Viagra for erectile dysfunction developed in a partnership with Icos. Cialis maintains an active period of 36 hours, causing it sometimes to be dubbed the \"weekend pill\". It was advertised during the 2004 Super Bowl XXXVIII and 2005 Super Bowl XXXIX halftime shows. In 2004, Lilly introduced duloxetine (Cymbalta), a serotonin-norepinephrine reuptake inhibitor used predominantly in the treatment of major depressive disorders and generalized anxiety disorder. It ranks with Prozac as one of the most financially successful pharmaceuticals in industry history. It is also used in the treatment of fibromyalgia, neuropathy, chronic pain and osteoarthritis. In January 2007, Lilly acquired Icos for $2.1 billion, after raising its offer and facing opposition from Institutional Shareholder Services. Lilly subsequently closed Icos' manufacturing operations, terminated nearly 500 Icos employees, leaving 127 employees working at the biologics facility. In December 2007, CMC Biopharmaceuticals A/S (CMC), a Copenhagen-based provider of contract biomanufacturing services, bought the Bothell, Washington-based biologics facility from Lilly and retained the existing 127 employees. In 2008, InnoMed PredTox, a collaboration with pharmaceutical companies, research organizations, and the European Commission to improve the safety of drugs, which included Lilly S.A. in Switzerland, secured an €8 million budget for a 40-month project that was coordinated by the European Federation of Pharmaceutical Industries and Associations (EFPIA), an organization who represents the research-based pharmaceutical industry and biotech companies operating in Europe. In 2008, Lilly's activities included research projects within the framework of the Innovative Medicines Initiative, a public-private research initiative in Europe that is a joint effort of the EFPIA and the European Commission. In January 2009, the largest criminal fine in U.S. history, totaling $1.415 billion, was imposed on Lilly for illegal marketing of its best-selling product, the atypical antipsychotic medication, Zyprexa. In January 2011, Boehringer Ingelheim and Lilly announced a global agreement to jointly develop and market new APIs for diabetes therapy. Lilly could receive more than $1 billion for their work on the project, while Boehringer Ingelheim could receive more than $800 million from development of the new drugs. Boehringer Ingelheim's oral anti-diabetic Linagliptin, BI 1077, and two of Lilly's insulin analogs, LY2605541 and LY2963016, were in phase II and III of clinical development at that time. In April 2014, Lilly acquired Switzerland-based Novartis AG's animal health business for $5.4 billion in cash to strengthen and diversify its Elanco unit. To gain regulatory approval, the milbemycin oxime/lufenuron heartworm treatment was divested to Virbac. In March 2015, the company announced it would join Hanmi Pharmaceutical in developing and commercializing Hanmi's phase I Bruton's tyrosine kinase inhibitor HM71224 in a deal that could yield $690 million. A day later, however, the company announced another deal with China's Innovent Biologics to co-develop and commercialize at least three of Innovent's treatments over the next decade, in a deal which could generate up to $456 million; the collaboration was subsequently expanded in 2022, according to Innovent. As part of the deal, the company contributed its c-Met monoclonal antibody, and Innovent contributed a monoclonal antibody, which targets CD-20. The second compound from Innovent is a preclinical immunooncology molecule. The following week, the company announced it would restart its collaboration with Pfizer surrounding the Phase III trial of Tanezumab. Pfizer is expected to receive an upfront sum of $200 million from the company. In April 2015, Lilly engaged CBRE Group to sell its biomanufacturing facility in Vacaville, California, a 52 acres (0.21 km2) campus and facility that is one of the largest biopharmaceutical manufacturing centers in the U.S. In July 2016, Lechleiter retired and was succeeded by David Ricks. In January 2017, Elanco, then a subsidiary of the company, acquired Boehringer Ingelheim Vetmedica, a subsidiary of Boehringer Ingelheim's U.S. feline, canine, and rabies vaccines portfolio for $885 million. In March 2017, Lilly acquired CoLucid Pharmaceuticals for $960 million, obtaining the late clinical-stage migraine therapy candidate, lasmiditan. In August 2017, Lilly and Shionogi jointly licensed their product varespladib to Ophirex for Ophirex's novel snakebite treatment program. In May 2018, Lilly acquired Armo Biosciences for $1.6 billion. Days later, the company announced it would acquire Aurora kinase A inhibitor developer AurKa Pharma, and control over the lead compound, AK-01, for up to $575 million. In January 2019, Lilly announced it would acquire Loxo Oncology for $235 per share, valuing the business at around $8 billion, which significantly expanded the business's oncology offerings. The deal gave Lilly Loxo's oral TRK inhibitor, Vitrakvi (Larotrectinib), LOXO-292, an oral proto-oncogene receptor tyrosine kinase rearranged during transfection (RET) inhibitor, LOXO-305, an oral Bruton's tyrosine kinase (BTK) inhibitor, and LOXO-195, a follow-on TRK inhibitor. In March 2019, the company completed the corporate spin-off of Elanco. In August 2019, Elanco acquired the Bayer animal health business for $7.6 billion. In January 2020, the company announced its acquisition of Dermira for $1.1 billion, gaining control of lebrikizumab, glycopyrronium cloth used in the treatment of hyperhidrosis, and other assets. In June 2020, Lilly announced that, in collaboration with Vancouver-based AbCellera, it had begun the world's first study of a potential monoclonal antibody treatment for treatment of COVID-19, with a Phase 1 trial of LY-CoV555. By August 2020, the challenging aspects of running a clinical trial in a long-term care facility during a pandemic prompted Lilly to create the first of many customized recreational vehicles into mobile research units (MRU) to meet people where they were and support mobile labs and clinical trial material preparation. A trailer truck could escort the MRU with supplies to create an on-site infusion clinic. Lilly deployed the mobile research unit fleet in response to outbreaks of the virus at long-term care facilities across the U.S. In September 2020, Amgen partnered with Lilly to manufacture COVID-19 antibody therapies. In October 2020, Lilly announced that its cocktail was effective and that it had filed with the FDA for an emergency use authorization (EUA). The same day, Regeneron Pharmaceuticals also filed for an EUA for its own monoclonal antibody treatment. The same month, Lilly announced it would acquire Disarm Therapeutics and its experimental treatments for axonal degeneration, via SARM1 inhibitors, for $135 million plus up to another $1.225 billion based on regulatory and commercial milestones. Also in October 2020, Lilly announced that the National Institutes of Health (NIH) ACTIV-3 clinical trial evaluating its monoclonal antibody, bamlanivimab (LYCoV555), found that bamlanivimab was not effective in treating people hospitalized with COVID-19, but data showed bamlanivimab might be effective in treating COVID-19 by reducing viral load, symptoms, and the risk of hospitalization in outpatients. Other studies, including the NIH ACTIV-2 trial and its own BLAZE-1 trial, continued to evaluate bamlanivimab. In November 2020, the FDA issued an emergency use authorization (EUA) for the investigational monoclonal antibody therapy bamlanivimab for the treatment of mild-to-moderate COVID-19 in adult and pediatric patients. In December 2020, Lilly announced it would acquire Prevail Therapeutics Inc. for $1 billion, boosting its pipeline in neurodegenerative disease gene therapies. In April 2021, the FDA revoked the emergency use authorization (EUA) that allowed and signaled FDA agreement for the investigational monoclonal antibody therapy bamlanivimab, when administered alone, to be used for the treatment of mild-to-moderate COVID-19 in adults and certain pediatric patients. On 18 May 2021, the FDA accepted Lilly's application for Tyvyt (sintilimab), in combination with Lilly's own Alimta (pemetrexed) and platinum chemotherapy for newly diagnosed nonsquamous non-small cell lung cancer. In July 2021, the company announced it would acquire Protomer Technologies for more than $1 billion. In January 2022, distribution of Lilly's COVID-19 antibody drug was paused due to lack of efficacy against the emerging omicron variant. A second COVID-19 monoclonal antibody therapy, bebtelovimab, developed with AbCellera, was granted Emergency Use Authorization in February 2022, with the U.S. government committing to a $720 million purchase of up to 600,000 doses. In May 2022, the FDA approved Lilly's type 2 diabetes drug Mounjaro (tirzepatide). In August 2022, following the overturning of Roe v. Wade in the Dobbs decision, the state of Indiana passed a near total ban on abortion, and Lilly said the move would make it difficult to attract talent to the state and that it would be forced to look for \"more employment growth\" elsewhere. In October 2022, Lilly acquired Akouos for $487 million in upfront and $123 million deferred payments. In early 2020, Lilly introduced the Lilly Insulin Value Program, where people who have commercial insurance or no insurance can receive a savings card to fill their entire monthly prescription of any Lilly insulin for $35. In 2023, the Inflation Reduction Act extended a similar concept across all insulin suppliers by capping out-of-pocket costs for insulin at $35 per monthly prescription among Medicare Parts B and D enrollees. In January 2023, Lilly and TRexBio announced a collaboration and license agreement for three assets to treat immune-mediated diseases. TRexBio received an upfront payment of $55 million as part of this deal. In June the company announced it would acquire startup Emergence Therapeutics for an undisclosed sum and Sigilon Therapeutics for $300 million. The company's 2023 research and development focus has been reported to be on drugs in the obesity, diabetes, Alzheimer's and autoimmune areas. In March 2023, Eli Lilly announced a $35 cap on the price of monthly insulin to be put in place immediately in order to be in line with the Inflation Reduction Act. In July 2023, Lilly announced it would acquire Versanis for $1.93 billion. In October 2023, Eli Lilly acquired Point Biopharma for $1.4 billion. In November 2023, the FDA approved tirzepatide for the treatment of obesity under the brand name Zepbound. In 2024, the FDA and the UK approved Donanemab, sold under the brand name Kisunla, a monoclonal antibody used for the treatment of Alzheimer's disease. In March 2024, Lilly announced a deal with Amazon to offer home delivery of certain medications for diabetes, obesity, and migraines, on behalf of LillyDirect. In August 2025, Eli Lilly signed a deal which was worth $1.3 billion with privately held Superluminal Medicines to invent and enhance small-molecule drugs through AI to treat obesity and other cardiometabolic diseases. Acquisition history Contributions Notable organizations to which Eli Lilly and Company has provided funding include the Northern Ontario School of Medicine, Population Health Research Institute (PHRI) at McMaster University, University of Toronto, University of Washington, National Press Foundation, American Society of Hematology, Endocrine Society, European Society of Cardiology, HOPE Worldwide, AdvaMed, Centre for Addiction and Mental Health (CAMH), Hospital for Sick Children (SickKids), Princess Margaret Cancer Centre, Scarborough Health Network, Sinai Health System, Sunnybrook Health Sciences Centre, Arthritis Australia, Diabetes Canada, and Juvenile Diabetes Research Foundation. The company spends $6–10 million per year on lobbying in the United States. Notable lobbying organizations to which the company has contributed include Foundation for the National Institutes of Health, Innovative Medicines Canada, International Federation of Pharmaceutical Manufacturers & Associations, National Health Council, and Pharmaceutical Research and Manufacturers of America. Legal issues BGH In August 2008, Eli Lilly purchased the right to manufacture Bovine somatotropin (bovine growth hormone), used to increase milk production in dairy cattle, from Monsanto. Use of the supplement has become controversial due to the animal ethics and human health concerns. 340B In 2021, Eli Lilly filed a court motion against in response to an advisory opinion of the United States Department of Health and Human Services indicating that Eli Lilly and other drug manufacturers must continue to offer reduced pricing to covered outpatient drugs through pharmacies contracted to hospitals rather than only to the hospitals themselves. Prozac In September 1989, in the Standard Gravure shooting, Joseph T. Wesbecker killed eight people and injured twelve before committing suicide. His relatives and victims blamed his actions on the Prozac medication he had begun taking a month prior. The incident set off a chain of lawsuits and public outcries. Lawyers began using Prozac to justify the abnormal behaviors of their clients. Eli Lilly was accused of not doing enough to warn patients and doctors about the adverse effects, which it had described as \"activation\", years prior to the incident. The link between suicide and antidepressants remains a subject of public and academic dispute. In October 2004, the FDA added a boxed warning to all antidepressant drugs regarding use in children. In 2006, the FDA included adults aged 25 or younger. In February 2018, the FDA ordered an update to the warnings based on statistical evidence from twenty-four trials in which the risk of such events increased from two percent to four percent relative to the placebo trials. Illegal marketing of Zyprexa In 2009, Lilly pleaded guilty for illegally marketing Zyprexa and agreed to pay a $1.415 billion penalty that included a criminal fine of $515 million, the largest ever in a healthcare case and the largest criminal fine for an individual corporation ever imposed in a U.S. criminal prosecution of any kind at the time. Eli Lilly has faced many lawsuits from people who claimed they developed diabetes or other diseases after taking olanzapine (branded Zyprexa), an antipsychotic medication, as well as by various governmental entities, insurance companies, and others. Internal documents provided to The New York Times revealed that Lilly had downplayed the risks of Zyprexa. According to the documents, 16 percent of people taking Zyprexa gained more than 66 pounds in their first year, a much larger figure than Eli Lilly had shared with doctors. In 2006, Lilly paid $700 million to settle around 8,000 of these lawsuits, and in early 2007, Lilly settled around 18,000 suits for $500 million, which brought the total Lilly had paid to settle suits related to the drug to $1.2 billion. In March 2008, Lilly settled a suit with the state of Alaska, and in October 2008, Lilly agreed to pay $62 million to 32 states and the District of Columbia to settle suits brought under state consumer protection laws. In 2009, four sales representatives for Eli Lilly filed separate qui tam lawsuits against the company for illegally marketing Zyprexa for uses not approved by the Food and Drug Administration. Eli Lilly pleaded guilty to a US federal criminal misdemeanor charge of illegally marketing Zyprexa, actively promoting the drug for off-label uses, particularly for the treatment of dementia in the elderly. The $1.415 billion penalty included an $800 million civil settlement, a $515 million criminal fine, and forfeit assets of $100 million. The US Justice Department said the criminal fine of $515 million was the largest ever in a healthcare case and the largest criminal fine for an individual corporation ever imposed in a US criminal prosecution of any kind. \"That was a blemish for us,\" John C. Lechleiter, CEO of Lilly, said. \"We don't ever want that to happen again. We put measures in place to assure that not only do we have the right intentions in integrity and compliance, but we have systems in place to support that.\" In an internal email, Lechleiter had stated \"we must seize the opportunity to expand our work with Zyprexa in this same child-adolescent population\" for off-label use. In January 2020, lawyer James Gottstein published a book titled The Zyprexa Papers summarizing the legal activities surrounding Zyprexa, and their impact on the political landscape of psychiatry and antipsychiatry in the US. The book details of how he obtained the Zyprexa papers, including how Will Hall and a small group of \"psychiatric survivors\" untraceably spread the Zyprexa Papers on the Internet and his battles on behalf of Bill Bigley, the psychiatric patient whose ordeal made possible the exposure of the Zyprexa Papers. Discrimination In March 2021, Eli Lilly and Company was accused of sex discrimination by a former lobbyist who claimed she was forced to work in a sexually hostile work environment. The parties involved settled for an undisclosed amount in June 2021. In September 2021, Eli Lilly and Company was accused in a federal court lawsuit of discriminating against older applicants for sales positions based on their implementation of hiring quotas for millennials. Canada patent lawsuit In September 2013, Eli Lilly sued Canada for violating its obligations to foreign investors under the North American Free Trade Agreement by allowing its courts to invalidate patents for Atomoxetine (Strattera) and Olanzapine (Zyprexa). Canadian courts found the seven-week long study of twenty-two patients for Atomoxetine (Strattera), too short and too narrow in scope to qualify for the patent. The Olanzapine (Zyprexa) patent was invalidated because it had not achieved its promised utility. The company sought damages in the amount of $500 million for lost profits. They ultimately lost the case in 2017. Illegal marketing of Evista In December 2005, Eli Lilly and Company pleaded guilty and paid $36 million in connection with the illegal promotion of Raloxifene (Evista), a medication typically used to prevent and treat osteoporosis in postmenopausal women. Sales representatives were trained to promote Evista for breast cancer and cardiovascular disease, to prompt or bait questions from doctors, and to send them unsolicited letters promoting Evista for unapproved use. The company also distributed a videotape in which a sales representative declared that \"Evista truly is the best drug for the prevention of all these diseases.\" Some sales representatives had also been instructed to conceal the disclosure page which stated that the effectiveness of the drug in reducing breast cancer risks had not yet been established. Insulin pricing In January 2019, lawmakers from the United States House of Representatives sent letters to Eli Lilly and other insulin manufacturers asking for explanations for rapidly raising insulin prices. The annual cost of insulin for people with type 1 diabetes in the US almost doubled from $2,900 to $5,700 over the period from 2012 to 2016. Renewed attention was brought to Eli Lilly's pricing of insulin in November 2022, after a verified Twitter account impersonating Eli Lilly posted on Twitter that insulin would now be free. The following year, the company announced that it would be reducing the out-of-pocket price of insulin to $35 a month. The company also stated that it would lower the price of Humalog from $275 a month to $66 and that it would offer insulin glargine at a 78% discount compared to rival company Sanofi. Despite this, the reduced costs will not apply to Eli Lilly's newer brands of insulin, and the company's pricing is still significantly higher than it was several decades prior. Bribing providers for prescriptions In August 2025, Texas sued Lilly for allegedly \"bribing\" providers to prescribe Mounjaro and Zepbound. Lilly allegedly offered illegal incentives to medical providers in Texas, including \"free nurses\" and reimbursement support services, while the costs of the drugs were covered by Medicaid."
}