{
  "ticker": "LNT",
  "cik": "0000352541",
  "company_name": "Alliant Energy",
  "corrected_name": "Alliant Energy",
  "wiki_title_used": "Alliant Energy",
  "exists": true,
  "raw_text": "Alliant Energy Corporation is a public utility holding company headquartered in Madison, Wisconsin, providing power in Iowa and Wisconsin.\n\nHistory\nInterstate Power and Light Company (IPL) expanded greatly in the late 1920s to include operations in Iowa, Wisconsin, Minnesota, North and South Dakota, Nebraska, Oklahoma, and Manitoba (Canada). One of the largest purchases in the late 1920s was the purchase of what became its northern Minnesota territory from the Wilbur Foshay interests.\nIn the 1930s and 1940s, the effects of the Depression and passage of laws to regulate utility operations at the state and federal level had an effect on IPC as well as its neighbors. In Iowa, the legislature passed laws making it easier for cities to establish municipal utilities (and indeed, there are over 100 municipal utilities in Iowa today). By 1940, the state of Nebraska had passed laws that forced all investor-owned utilities in that state to sell their operations to one of several \"public power districts\" operating in that state.\nDuring the 1940s, IPC divested itself of all its operations that were not part of its main territory in southern MN / northern Iowa. The largest chunk of territory was that operating in northeast ND / northern MN / Emerson, Manitoba which was sold in summer 1943 and fall 1944. The SD properties (around Winner) were sold in 1946. It would not be until 1956 when the last isolated district — the area around Waconia, MN — was sold to Northern States Power.\nAs IPC sold its properties that were isolated from the main system, it picked up others that were adjacent to its system and more easily interconnected: the Eastern Iowa Power system, and the Iowa / Minnesota properties of the Central States Power and Light Corporation.\nThe Wisconsin operations were sold to Wisconsin Power and Light (now the eastern half of Alliant's operations).\nThe other part of IPL — IES Utilities — incorporated in Iowa in 1925 as the Iowa Railway and Light Corporation and was later known as Iowa Electric Light and Power Company. IES expanded across that part of Iowa south of IPC's territory, eventually acquiring the Iowa operations of the Union Electric Company of St. Louis, MO.\nIES and IPC merged in the mid-1990s to form IPL. Today, IPL provides electricity and gas to communities in Iowa, while WPL serves southern and central Wisconsin.\nIn late 2007, Alliant Energy received final approval to sell their utility services in Illinois to Jo-Carroll Energy.\nIn 2000, the utility purchased the naming rights to the campus of the Dane County Expo Center just southwest of downtown Madison, including the county-owned arena, which were all renamed the Alliant Energy Center.\nIn the 1970s IES constructed the Duane Arnold Energy Center, a 615 MW nuclear plant in Palo, Iowa.  In 2006, Alliant closed a deal with FPL Energy to sell their stake in the plant.\nAlliant Energy also provides several non-regulated services, including ground transportation and energy engineering (such as wind and geothermal energy).\nIn 2007 it acquired 200 MW Buffalo Creek Wind Farm at Hampton, Iowa from Wind Capital Group.\nAlliant Energy sold to ITC Holdings their transmission system (34.5 kV, 69 kV, 115 kV, 161 kV and 345 kV) in Iowa and Minnesota in 2007.\nIn 2015, the company finalized the sale of its Minnesota territory to a consortium of 12 electric cooperatives operating in that state.\nIn 2016, Alliant began offering a $500 rebate for its customers who purchase a home charging station for electric vehicles. To encourage the use of electric vehicles in Madison, Wisconsin, the company also offered free public charging at its Madison office.\nOn October 23, 2020, the city of Cedar Rapids, Iowa, which is serviced by Alliant, announced it had reached a 12-year agreement for naming rights to the downtown convention center complex formerly known as the U.S. Cellular Center. The facility was renamed Alliant Energy Power House.\n\nSubsidiaries\nInterstate Power and Light Company (IPL) is a public utility that generates and distributes electricity and distributes and transports natural gas in Iowa\nWisconsin Power and Light Company (WPL) provides similar services as IPL in southern and central Wisconsin\nTravero, Inc is logistics company providing services including brokerage, trucking, rail, transloading, and warehousing.\n\nPolitics\nThe former CEO of Alliant Energy, Patricia Kampling, wrote a guest editorial in The Gazette where she wrote that Alliant Energy and the American Wind Association presented Republican U.S. Senator Chuck Grassley of Iowa with AWEA's Wind Champion Award. Grassley is often referred to as the \"father\" of American wind energy because of his work on the federal renewable energy production tax credit, according to Kampling.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Alliant Energy Corporation:",
  "clean_text": "Alliant Energy Corporation is a public utility holding company headquartered in Madison, Wisconsin, providing power in Iowa and Wisconsin. History Interstate Power and Light Company (IPL) expanded greatly in the late 1920s to include operations in Iowa, Wisconsin, Minnesota, North and South Dakota, Nebraska, Oklahoma, and Manitoba (Canada). One of the largest purchases in the late 1920s was the purchase of what became its northern Minnesota territory from the Wilbur Foshay interests. In the 1930s and 1940s, the effects of the Depression and passage of laws to regulate utility operations at the state and federal level had an effect on IPC as well as its neighbors. In Iowa, the legislature passed laws making it easier for cities to establish municipal utilities (and indeed, there are over 100 municipal utilities in Iowa today). By 1940, the state of Nebraska had passed laws that forced all investor-owned utilities in that state to sell their operations to one of several \"public power districts\" operating in that state. During the 1940s, IPC divested itself of all its operations that were not part of its main territory in southern MN / northern Iowa. The largest chunk of territory was that operating in northeast ND / northern MN / Emerson, Manitoba which was sold in summer 1943 and fall 1944. The SD properties (around Winner) were sold in 1946. It would not be until 1956 when the last isolated district — the area around Waconia, MN — was sold to Northern States Power. As IPC sold its properties that were isolated from the main system, it picked up others that were adjacent to its system and more easily interconnected: the Eastern Iowa Power system, and the Iowa / Minnesota properties of the Central States Power and Light Corporation. The Wisconsin operations were sold to Wisconsin Power and Light (now the eastern half of Alliant's operations). The other part of IPL — IES Utilities — incorporated in Iowa in 1925 as the Iowa Railway and Light Corporation and was later known as Iowa Electric Light and Power Company. IES expanded across that part of Iowa south of IPC's territory, eventually acquiring the Iowa operations of the Union Electric Company of St. Louis, MO. IES and IPC merged in the mid-1990s to form IPL. Today, IPL provides electricity and gas to communities in Iowa, while WPL serves southern and central Wisconsin. In late 2007, Alliant Energy received final approval to sell their utility services in Illinois to Jo-Carroll Energy. In 2000, the utility purchased the naming rights to the campus of the Dane County Expo Center just southwest of downtown Madison, including the county-owned arena, which were all renamed the Alliant Energy Center. In the 1970s IES constructed the Duane Arnold Energy Center, a 615 MW nuclear plant in Palo, Iowa. In 2006, Alliant closed a deal with FPL Energy to sell their stake in the plant. Alliant Energy also provides several non-regulated services, including ground transportation and energy engineering (such as wind and geothermal energy). In 2007 it acquired 200 MW Buffalo Creek Wind Farm at Hampton, Iowa from Wind Capital Group. Alliant Energy sold to ITC Holdings their transmission system (34.5 kV, 69 kV, 115 kV, 161 kV and 345 kV) in Iowa and Minnesota in 2007. In 2015, the company finalized the sale of its Minnesota territory to a consortium of 12 electric cooperatives operating in that state. In 2016, Alliant began offering a $500 rebate for its customers who purchase a home charging station for electric vehicles. To encourage the use of electric vehicles in Madison, Wisconsin, the company also offered free public charging at its Madison office. On October 23, 2020, the city of Cedar Rapids, Iowa, which is serviced by Alliant, announced it had reached a 12-year agreement for naming rights to the downtown convention center complex formerly known as the U.S. Cellular Center. The facility was renamed Alliant Energy Power House. Subsidiaries Interstate Power and Light Company (IPL) is a public utility that generates and distributes electricity and distributes and transports natural gas in Iowa Wisconsin Power and Light Company (WPL) provides similar services as IPL in southern and central Wisconsin Travero, Inc is logistics company providing services including brokerage, trucking, rail, transloading, and warehousing. Politics The former CEO of Alliant Energy, Patricia Kampling, wrote a guest editorial in The Gazette where she wrote that Alliant Energy and the American Wind Association presented Republican U.S. Senator Chuck Grassley of Iowa with AWEA's Wind Champion Award. Grassley is often referred to as the \"father\" of American wind energy because of his work on the federal renewable energy production tax credit, according to Kampling."
}