{
  "ticker": "LOW",
  "cik": "0000060667",
  "company_name": "Lowe's",
  "corrected_name": "Lowe's",
  "wiki_title_used": "Lowe's",
  "exists": true,
  "raw_text": "Lowe's Companies, Inc. ( LOHZ) is an American retail company specializing in home improvement. Headquartered in Mooresville, North Carolina, the company operates a chain of retail stores in the United States. As of October 28, 2022, Lowe's and its related businesses operated 2,181 home improvement and hardware stores in North America.\nLowe's is the second-largest hardware chain in the United States (previously the largest in the U.S. until surpassed by Home Depot in 1989) behind rival the Home Depot and ahead of Menards. It is also the second-largest hardware chain in the world, also behind the Home Depot, but ahead of European retailers Leroy Merlin, B&Q, and OBI.\nThe company previously operated in Australia through the Masters Home Improvement joint venture until 2016, in Mexico until 2019, and in Canada until selling its operations (which will be consolidated under the Rona brand) to Sycamore Partners in 2023.\n\nHistory\nThe first Lowe's store, Mr. L.S. Lowe's North Wilkesboro Hardware, opened in North Wilkesboro, North Carolina, in 1921 by Lucius Smith Lowe. After Lowe died in 1940, the business was inherited by his daughter, Ruth Buchan, who sold the company to her brother, James Lowe, for $4,200, that same year. James took on his brother-in-law H. Carl Buchan as a partner in 1943.\nBuchan anticipated the dramatic increase in construction after World War II, and under his management, the store focused on hardware and building materials. Before then, the product mix had also included notions, dry goods, horse tack, snuff, produce, and groceries. Buchan and Lowe started the concept of procuring large quantities of products directly from manufacturers, which eliminated the wholesaler and allowed them to offer customers lower prices. The company opened its second store in Sparta, North Carolina, in 1949.\nIn 1952, Buchan became the sole owner of Lowe's, and the company was incorporated as Lowe's North Wilkesboro Hardware. In 1954, Jim Lowe started the Lowes Foods grocery store chain.\nIn 1960, Buchan died of a heart attack at age 44. His five-man executive team, which included Robert Strickland and Leonard Herring, took the company public in 1961 under the name Lowe's Companies Inc. By 1962, Lowe's operated 21 stores and reported annual revenues of $32 million. Lowe's began trading on the New York Stock Exchange in 1979. By 1970s, Lowe's revenue reached more than $150 million and, in 1980, to nearly $900 million.\nUnder the leadership of Robert L. Tillman, who served as CEO from 1996 to 2005, Lowe's expanded beyond its traditional Southern base into the Northeast, Midwest, and West, and completed the acquisition of Eagle Hardware & Garden to accelerate growth in the western United States. Lowe's grew nationally, as it was aided by the purchase of the Renton, Washington–based Eagle Hardware & Garden company in 1999.  The first store outside the United States was in Hamilton, Ontario, Canada. According to its website, Lowe's has operated/serviced more than 2,355 locations in the United States, Canada, and Mexico alone, although the Mexican stores were closed in the late 2010s.\nLowe's formerly operated in Mexico with 14 locations: 8 in Monterrey, Nuevo León, 1 in Saltillo, Coahuila, 1 in Hermosillo, Sonora, 1 in Chihuahua, Chihuahua, 1 in Culiacán, Sinaloa, 1 in Aguascalientes, Aguascalientes and 1 in León, Guanajuato. Lowe's Mexico closed all its stores on April 10, 2019.\nIn 2023, Lowe's sold its Canadian retail business, based in Boucherville, Quebec, to Sycamore Partners for $400 million in cash. They will all be consolidated into Rona stores.\nLowe's agreed to acquire Foundation Building Materials for $8.8 billion in cash in August 2025, purchasing the home improvement supplier with the intention of expanding into the business that serves contractors and builders.\n\nFinances\nIn 2020, for the May–July yearly quarter, the company reported sales of $27.3 billion; in 2019, for the same period, the firm had reported sales of $21 billion. The digital sales for the same period also were up to 135%. The sales surges were a result of consumers switching their buying habits as a result of the COVID-19 pandemic.\n\nSeventy five percent of the company's   revenue comes from do it yourself consumers.\n\nHistorical data\nFor the fiscal year 2019 (2/1/2019-1/31/2020), Lowe's reported earnings of US$4.281 billion, with an annual revenue of US$72.148 billion, an increase of 1.17% over the previous fiscal cycle. Lowe's shares traded at over $116 per share, and its market capitalization was valued at over US$90.32 billion in January 2020.  Lowe's ranked No. 42 on the 2019 Fortune 500 list.  Lowes announced a $10 billion stock buyback at the end of 2018 to begin in 2019, while trimming jobs.\nFor the fiscal year 2018, Lowe's reported earnings of US$2.314 billion, with an annual revenue of US$71.309 billion, an increase of 3.92% over the previous fiscal cycle. Lowe's shares traded at over $96 per share, and its market capitalization was valued at over US$75.8 billion in October 2018. Lowe's ranked No. 40 on the 2018 Fortune 500 list of the largest United States corporations by total revenue.\n\nHeadquarters\nIn 1998, Lowe's purchased the Wilkes Mall in Wilkesboro, North Carolina, to serve as the company's headquarters. In 2002, Lowe's acquired full control over the 440,000 square feet (41,000 m2) building after the 10 remaining mall tenants vacated the property. A year later, Lowe's constructed and relocated the corporate headquarters to a new, 350-acre campus in Mooresville, North Carolina. The new facility contains a five-story and two seven-story buildings. The building has a central atrium and two office wings; the atrium houses a food court, a five-story spiral staircase, and meeting and reception rooms. A 7-acre (2.8 ha) lake flows underneath the headquarters building.\nLowe's maintained its former headquarters in Wilkesboro, where it employed over 2,400 people until 2019. In 2011, Lowe's invested $10 million in improvements and renovations in the property, including a full-service food court, coffee shop, and health center, as well as gating the entire property with an addition of a guardhouse. All positions have since been relocated and the former Wilkes corporate office is vacant, although still owned by Lowe's.\nIn addition to Wilkesboro, Lowe's formerly operated a customer contact center in Albuquerque, New Mexico, both of which quietly closed in 2023. Currently, customer contact centers remain in Indianapolis, Indiana and India.\nOn June 27, 2019, Lowe's announced the construction of a $153 million, 23-story tower in Charlotte's fast-growing South End neighborhood, which will be completed by 2020 and eventually house 2000 employees, 400 of whom will move from the headquarters. The new tower will house a \"global technology hub\" for Lowe's. The state of North Carolina is providing $54 million in incentives provided Lowe's meets certain goals.\n\nEnvironmental record\nLowe's won eight consecutive Energy Star awards from 2003 to 2010, including four Energy Star Partner of the Year awards for educating consumers about the benefits of energy efficiency. On March 1, 2010, Lowe's also became the first winner of the Energy Star Sustained Excellence Award in Retail, to recognize its contribution to reducing greenhouse gas emissions by promoting energy-efficient products and educating consumers and employees on the value of the Energy Star program. In 2000, Lowe's released a policy promising that all wood products sold would not be sourced from rainforests. However, according to a 2006 report released by the Environmental Investigation Agency, wood used in flooring by Armstrong Flooring that Lowe's was selling had been coming from the forests of Indonesia's remote Papua Province, where some logging was estimated to be illegal. According to the Telepak report, which was the sole basis of the EIA allegations, Armstrong commissioned an independent audit of Kreasi's merbau supplies over the last 18 month which found documentation relating to the source of the company's merbau logs in Papua, and based on this, Armstrong decided to continue to trade in merbau supplied by Kreasi. The cited report dates to 2006 and Lowe's continues to claim its wood products come from known sources; is legally harvested and traded, and more.\nOn April 17, 2014, Lowe's paid a $500,000 penalty for violations of the federal Lead Renovation, Repair and Painting (RRP) Rule, which require renovation contractors, such as window and carpet installers to manage the risk of lead dust when renovating customer homes. As of 2022, this is the largest RRP violation to ever occur. In the words of the EPA, \"\"This settlement will ensure that not only children in southern Illinois, but children throughout the United States will be better protected from the known hazards associated with lead exposure\".\n\nOn March 6, 2020, Lowe's paid a $1,600,000 fine for violating California's air quality regulations. This includes violations in NOx emissions from ovens and asbestos from demolition/renovation activities.\n\nLabor relations\nIn April 2019, a National Labor Relations Board (NLRB) judge found that Lowe's had violated the National Labor Relations Act by illegally forbidding workers from discussing their pay.\nIn August 2022, Lowe's announced that it was awarding $55 million in bonus income to front-line workers, and that it was offering staff discounts on common household and cleaning items in light of recent inflationary pressures.\nIn October 2022, a group of 172 workers at a Lowe's store in New Orleans, Louisiana, organizing under the banner of Lowe's Workers United and led by a worker at the store named Felix Allen, filed for a union election with the NLRB. In June 2023, Felix Allen was fired, leading to multiple unfair labor practice charges being filed with the NLRB against Lowe's, accusing the company of multiple violations of labor law in response to the unionization drive at the New Orleans store, including surveillance, interrogation of employees, and retaliating against union organizers.\n\nAdvertising and sponsorships\nIn January 2019, Lowes became the official home improvement sponsor of the National Football League. In April 2024, Lowes launched a partnership with Major League Soccer's Inter Miami CF, Lionel Messi, and the 2024 Copa América.\n\nRacing sponsorships\nLowe's purchased naming rights to Charlotte Motor Speedway in Charlotte, North Carolina, in 1998, and the speedway changed names to Lowe's Motor Speedway. After the 10-year naming rights expired, Lowe's extended naming rights by one year. After the one-year extension expired, Lowe's discontinued naming rights, and as of the 2010 racing season, the racetrack returned to its original name.\n\nThe corporation was the primary sponsor for seven-time NASCAR Sprint Cup Series champion Jimmie Johnson in the No. 48 Chevrolet Camaro ZL1 and it was a part-time sponsor of the former No. 5 Nationwide Series car; both teams are owned by Hendrick Motorsports.  Prior to the current sponsorship deal with Hendrick Motorsports, Lowe's was the sponsor of the No. 31 Chevrolet for Richard Childress Racing driven by Mike Skinner and Robby Gordon from 1997 to 2001. Prior to the RCR deal, Lowe's was the primary sponsor of the No. 11 Ford driven by Brett Bodine for Junior Johnson & Associates and later his own team, Brett Bodine Racing (after Bodine bought the No. 11 from Johnson). One of the company's earliest forays into racing sponsorship was in 1979, when it sponsored the No. 2 Buick of the Rod Osterlund team in what was then known the Winston Cup Series, for the Talladega 500. The car was driven in that race by David Pearson, substituting for injured rookie Dale Earnhardt. Lowe's continued with sporadic car sponsorship throughout the next two decades until the aforementioned Bodine sponsorship in 1995. On March 14, 2018, Lowe's announced it would end sponsorship of the No. 48 car after the 2018 season, thereby ending all involvement in motorsports.\nLowe's also sponsored Fernandez Racing in the American Le Mans Series and previously sponsored the team in the Rolex Sports Car Series;  in that series, Lowe's sponsored the No. 99 Gainsco Stallings Racing Pontiac in events where Johnson was driving.\nIn 2006, Lowe's contracted designer Marianne Cusato to develop and offer affordable house plans for the hurricane-affected Gulf region. Lowe's is the exclusive retailer for both the plans and building materials for the Lowe's Katrina Cottage. They offer easy construction and affordability, as well as the possibility of expansion. Moreover, they meet all international building codes and exceed hurricane codes. Lowe's discontinued the Katrina Cottage line in 2011.\nLowe's has a wide variety of television and radio commercials. A significant number of different racing-inspired commercials can be seen and are often played outside of television race coverage. Before 2010, when he was replaced by Ben Yannette, Gene Hackman's voice could be heard on many commercial advertisements for Lowe's.\n\nAll-American Muslim advertising controversy\nLowe's withdrew its advertising from the TLC reality television show All-American Muslim in December 2011. A spokesperson for Lowe's said, \"we understand the program raised concerns, complaints, or issues from multiple sides of the viewer spectrum, which we found after doing research of news articles and blogs covering the show\".\nLowe's faced a backlash from several quarters, including Muslim-American and Arab-American organizations. The American-Arab Anti-Discrimination Committee called upon members to contact Lowe's to urge it to reverse its position. The Los Angeles chapter of the Council on American-Islamic Relations met to consider possible actions, including boycotts and protests. Several celebrities also called for a boycott. California State Senator Ted Lieu called Lowe's decision \"naked religious bigotry\" and said he would consider legislative action if Lowe's did not apologize to Muslim Americans and reinstate the ads. Abraham Foxman of the Anti-Defamation League expressed similar views. Keith Ellison, the first Muslim elected to the United States Congress, criticized Lowe's decision to \"uphold the beliefs of a fringe hate group and not the creed of the First Amendment\". Representative John Conyers of Michigan called on Lowe's to apologize. Michigan state representative Rashida Tlaib contacted the company's corporate headquarters, reporting that Lowe's declined to change its decision.\n\nAssociated brands\nKobalt tools\nallen+roth\n\nCanada\nLowe's opened its first three stores in Canada on December 10, 2007, in Hamilton, Brampton, and Brantford. On February 1, 2008, they opened three more stores in Toronto, East Gwillimbury, and a second store in Brampton, as well as a new location in Maple (Vaughan). Lowe's also expanded into western Canada, starting with three new stores in Calgary, Alberta. One of the three locations opened in late September 2010.  The other two opened in early 2011. \nIn February 2013, Lowe's Canada hired former Walmart Canada and Loblaw Companies executive Sylvain Prud'homme as CEO.\nOn May 11, 2015, Lowe's Canada announced that it would acquire the leases of 13 former Target Canada stores, as well as an Ontario distribution centre, for $151 million.\nIn 2012, Lowe's attempted to buy Rona, Inc., a Quebec-based hardware chain. However, the deal was met with objections from RONA shareholders (particularly the Caisse de dépôt et placement du Québec) and operators of its franchised locations over concerns that the company could centralize its supply operations in the United States, and was eventually called off. On February 3, 2016, Rona announced that it had accepted an offer to be acquired by Lowe's for CDN$3.2 billion, pending regulatory and shareholder approval. The division would remain under the leadership of Sylvain Prud'homme, but would be operated out of Rona's headquarters in Boucherville. Lowe's maintained Rona's retail banners, \"key\" executives, and the \"vast majority of its current employees\" after the acquisition.\nIn February 2020, Lowe's closed 34 low-performance stores, 26 that were under the Rona brand, six Lowe's stores, and two Réno-Dépôt stores.\nIn November 2022, Lowe's agreed to sell its Canadian operations to the private equity firm Sycamore Partners for $400 million. with the Lowe's stores expected to be rebranded under the Rona brand in the future. The sale was completed on February 3, 2023. In July 2023, Rona announced that it would begin to replace Lowe's with the new banner Rona+, beginning with 10 locations in Ontario.\n\nAustralia\nTrading as Masters Home Improvement, the first store opened in Braybrook, Victoria, to tradesmen on August 31, 2011, and later to the general public. Masters was a joint venture between Lowe's and Woolworths to compete against Bunnings, which operates in the large bigbox format similar to Lowe's and Home Depot.\nIn January 2016, Woolworths announced that it intended to either sell or wind up all its home improvement areas, including the Masters hardware chain. Chairman Gordon Cairns said that it would take years to become profitable and that the ongoing losses could not be sustained. The windup involved Woolworths buying back a 33.3 per cent interest in the venture, held by the Lowe's subsidiary WDR Delaware Corporation. The last stores closed in December 2016.\n\nLawsuits\nLowe's was involved in a small cluster of class action lawsuits that revolved around the employee payment system. The cases focused on a pay practice known as \"variable rate overtime\". Variable-rate overtime has the effect of paying a decreasing overtime rate the more hours a person works in a week. The suits alleged that salaried managers who worked 40 to 50 hours per week were improperly compensated for that time. The variable rate overtime ended in the first quarter of 2006.\nThe first case was filed in October 2002 by employees of the Lowe's store in Shawnee, Kansas. In September 2005, the cases were certified as a class action. Four similar briefs were filed in New York, Indiana, Pennsylvania, and Ohio. The lawsuits for New York, Indiana, and Kansas resulted in an out-of-court settlement on September 22, 2006. The lawsuit in Pennsylvania became a class-action lawsuit in June 2004, with 550 employees. The case in Ohio was filed by ten former Lowe's employees in August 2004.\nLowe's faced multiple lawsuits from its Loss Prevention Managers citing that they were classified as exempt employees and therefore denied overtime pay. The managers asserted that they were forced to work a minimum of 48 hours per week which saved Lowe's and its investors millions of dollars every year. Lawsuits have been settled for $2.95 million in California and $6.2 million in Texas.\nIn 2014, Lowe's faced a class-action lawsuit from former and current Human Resource Managers. Similarly to the lawsuit regarding its Loss Prevention Managers, the lawsuit stated that the HR Managers were improperly, and illegally, classified as exempt employees and were, therefore, denied overtime even though they were required to work 48-hour weeks.\n\nSee also\nUnited States portal\n Companies portal\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Lowe's:",
  "clean_text": "Lowe's Companies, Inc. ( LOHZ) is an American retail company specializing in home improvement. Headquartered in Mooresville, North Carolina, the company operates a chain of retail stores in the United States. As of October 28, 2022, Lowe's and its related businesses operated 2,181 home improvement and hardware stores in North America. Lowe's is the second-largest hardware chain in the United States (previously the largest in the U.S. until surpassed by Home Depot in 1989) behind rival the Home Depot and ahead of Menards. It is also the second-largest hardware chain in the world, also behind the Home Depot, but ahead of European retailers Leroy Merlin, B&Q, and OBI. The company previously operated in Australia through the Masters Home Improvement joint venture until 2016, in Mexico until 2019, and in Canada until selling its operations (which will be consolidated under the Rona brand) to Sycamore Partners in 2023. History The first Lowe's store, Mr. L.S. Lowe's North Wilkesboro Hardware, opened in North Wilkesboro, North Carolina, in 1921 by Lucius Smith Lowe. After Lowe died in 1940, the business was inherited by his daughter, Ruth Buchan, who sold the company to her brother, James Lowe, for $4,200, that same year. James took on his brother-in-law H. Carl Buchan as a partner in 1943. Buchan anticipated the dramatic increase in construction after World War II, and under his management, the store focused on hardware and building materials. Before then, the product mix had also included notions, dry goods, horse tack, snuff, produce, and groceries. Buchan and Lowe started the concept of procuring large quantities of products directly from manufacturers, which eliminated the wholesaler and allowed them to offer customers lower prices. The company opened its second store in Sparta, North Carolina, in 1949. In 1952, Buchan became the sole owner of Lowe's, and the company was incorporated as Lowe's North Wilkesboro Hardware. In 1954, Jim Lowe started the Lowes Foods grocery store chain. In 1960, Buchan died of a heart attack at age 44. His five-man executive team, which included Robert Strickland and Leonard Herring, took the company public in 1961 under the name Lowe's Companies Inc. By 1962, Lowe's operated 21 stores and reported annual revenues of $32 million. Lowe's began trading on the New York Stock Exchange in 1979. By 1970s, Lowe's revenue reached more than $150 million and, in 1980, to nearly $900 million. Under the leadership of Robert L. Tillman, who served as CEO from 1996 to 2005, Lowe's expanded beyond its traditional Southern base into the Northeast, Midwest, and West, and completed the acquisition of Eagle Hardware & Garden to accelerate growth in the western United States. Lowe's grew nationally, as it was aided by the purchase of the Renton, Washington–based Eagle Hardware & Garden company in 1999. The first store outside the United States was in Hamilton, Ontario, Canada. According to its website, Lowe's has operated/serviced more than 2,355 locations in the United States, Canada, and Mexico alone, although the Mexican stores were closed in the late 2010s. Lowe's formerly operated in Mexico with 14 locations: 8 in Monterrey, Nuevo León, 1 in Saltillo, Coahuila, 1 in Hermosillo, Sonora, 1 in Chihuahua, Chihuahua, 1 in Culiacán, Sinaloa, 1 in Aguascalientes, Aguascalientes and 1 in León, Guanajuato. Lowe's Mexico closed all its stores on April 10, 2019. In 2023, Lowe's sold its Canadian retail business, based in Boucherville, Quebec, to Sycamore Partners for $400 million in cash. They will all be consolidated into Rona stores. Lowe's agreed to acquire Foundation Building Materials for $8.8 billion in cash in August 2025, purchasing the home improvement supplier with the intention of expanding into the business that serves contractors and builders. Finances In 2020, for the May–July yearly quarter, the company reported sales of $27.3 billion; in 2019, for the same period, the firm had reported sales of $21 billion. The digital sales for the same period also were up to 135%. The sales surges were a result of consumers switching their buying habits as a result of the COVID-19 pandemic. Seventy five percent of the company's revenue comes from do it yourself consumers. Historical data For the fiscal year 2019 (2/1/2019-1/31/2020), Lowe's reported earnings of US$4.281 billion, with an annual revenue of US$72.148 billion, an increase of 1.17% over the previous fiscal cycle. Lowe's shares traded at over $116 per share, and its market capitalization was valued at over US$90.32 billion in January 2020. Lowe's ranked No. 42 on the 2019 Fortune 500 list. Lowes announced a $10 billion stock buyback at the end of 2018 to begin in 2019, while trimming jobs. For the fiscal year 2018, Lowe's reported earnings of US$2.314 billion, with an annual revenue of US$71.309 billion, an increase of 3.92% over the previous fiscal cycle. Lowe's shares traded at over $96 per share, and its market capitalization was valued at over US$75.8 billion in October 2018. Lowe's ranked No. 40 on the 2018 Fortune 500 list of the largest United States corporations by total revenue. Headquarters In 1998, Lowe's purchased the Wilkes Mall in Wilkesboro, North Carolina, to serve as the company's headquarters. In 2002, Lowe's acquired full control over the 440,000 square feet (41,000 m2) building after the 10 remaining mall tenants vacated the property. A year later, Lowe's constructed and relocated the corporate headquarters to a new, 350-acre campus in Mooresville, North Carolina. The new facility contains a five-story and two seven-story buildings. The building has a central atrium and two office wings; the atrium houses a food court, a five-story spiral staircase, and meeting and reception rooms. A 7-acre (2.8 ha) lake flows underneath the headquarters building. Lowe's maintained its former headquarters in Wilkesboro, where it employed over 2,400 people until 2019. In 2011, Lowe's invested $10 million in improvements and renovations in the property, including a full-service food court, coffee shop, and health center, as well as gating the entire property with an addition of a guardhouse. All positions have since been relocated and the former Wilkes corporate office is vacant, although still owned by Lowe's. In addition to Wilkesboro, Lowe's formerly operated a customer contact center in Albuquerque, New Mexico, both of which quietly closed in 2023. Currently, customer contact centers remain in Indianapolis, Indiana and India. On June 27, 2019, Lowe's announced the construction of a $153 million, 23-story tower in Charlotte's fast-growing South End neighborhood, which will be completed by 2020 and eventually house 2000 employees, 400 of whom will move from the headquarters. The new tower will house a \"global technology hub\" for Lowe's. The state of North Carolina is providing $54 million in incentives provided Lowe's meets certain goals. Environmental record Lowe's won eight consecutive Energy Star awards from 2003 to 2010, including four Energy Star Partner of the Year awards for educating consumers about the benefits of energy efficiency. On March 1, 2010, Lowe's also became the first winner of the Energy Star Sustained Excellence Award in Retail, to recognize its contribution to reducing greenhouse gas emissions by promoting energy-efficient products and educating consumers and employees on the value of the Energy Star program. In 2000, Lowe's released a policy promising that all wood products sold would not be sourced from rainforests. However, according to a 2006 report released by the Environmental Investigation Agency, wood used in flooring by Armstrong Flooring that Lowe's was selling had been coming from the forests of Indonesia's remote Papua Province, where some logging was estimated to be illegal. According to the Telepak report, which was the sole basis of the EIA allegations, Armstrong commissioned an independent audit of Kreasi's merbau supplies over the last 18 month which found documentation relating to the source of the company's merbau logs in Papua, and based on this, Armstrong decided to continue to trade in merbau supplied by Kreasi. The cited report dates to 2006 and Lowe's continues to claim its wood products come from known sources; is legally harvested and traded, and more. On April 17, 2014, Lowe's paid a $500,000 penalty for violations of the federal Lead Renovation, Repair and Painting (RRP) Rule, which require renovation contractors, such as window and carpet installers to manage the risk of lead dust when renovating customer homes. As of 2022, this is the largest RRP violation to ever occur. In the words of the EPA, \"\"This settlement will ensure that not only children in southern Illinois, but children throughout the United States will be better protected from the known hazards associated with lead exposure\". On March 6, 2020, Lowe's paid a $1,600,000 fine for violating California's air quality regulations. This includes violations in NOx emissions from ovens and asbestos from demolition/renovation activities. Labor relations In April 2019, a National Labor Relations Board (NLRB) judge found that Lowe's had violated the National Labor Relations Act by illegally forbidding workers from discussing their pay. In August 2022, Lowe's announced that it was awarding $55 million in bonus income to front-line workers, and that it was offering staff discounts on common household and cleaning items in light of recent inflationary pressures. In October 2022, a group of 172 workers at a Lowe's store in New Orleans, Louisiana, organizing under the banner of Lowe's Workers United and led by a worker at the store named Felix Allen, filed for a union election with the NLRB. In June 2023, Felix Allen was fired, leading to multiple unfair labor practice charges being filed with the NLRB against Lowe's, accusing the company of multiple violations of labor law in response to the unionization drive at the New Orleans store, including surveillance, interrogation of employees, and retaliating against union organizers. Advertising and sponsorships In January 2019, Lowes became the official home improvement sponsor of the National Football League. In April 2024, Lowes launched a partnership with Major League Soccer's Inter Miami CF, Lionel Messi, and the 2024 Copa América. Racing sponsorships Lowe's purchased naming rights to Charlotte Motor Speedway in Charlotte, North Carolina, in 1998, and the speedway changed names to Lowe's Motor Speedway. After the 10-year naming rights expired, Lowe's extended naming rights by one year. After the one-year extension expired, Lowe's discontinued naming rights, and as of the 2010 racing season, the racetrack returned to its original name. The corporation was the primary sponsor for seven-time NASCAR Sprint Cup Series champion Jimmie Johnson in the No. 48 Chevrolet Camaro ZL1 and it was a part-time sponsor of the former No. 5 Nationwide Series car; both teams are owned by Hendrick Motorsports. Prior to the current sponsorship deal with Hendrick Motorsports, Lowe's was the sponsor of the No. 31 Chevrolet for Richard Childress Racing driven by Mike Skinner and Robby Gordon from 1997 to 2001. Prior to the RCR deal, Lowe's was the primary sponsor of the No. 11 Ford driven by Brett Bodine for Junior Johnson & Associates and later his own team, Brett Bodine Racing (after Bodine bought the No. 11 from Johnson). One of the company's earliest forays into racing sponsorship was in 1979, when it sponsored the No. 2 Buick of the Rod Osterlund team in what was then known the Winston Cup Series, for the Talladega 500. The car was driven in that race by David Pearson, substituting for injured rookie Dale Earnhardt. Lowe's continued with sporadic car sponsorship throughout the next two decades until the aforementioned Bodine sponsorship in 1995. On March 14, 2018, Lowe's announced it would end sponsorship of the No. 48 car after the 2018 season, thereby ending all involvement in motorsports. Lowe's also sponsored Fernandez Racing in the American Le Mans Series and previously sponsored the team in the Rolex Sports Car Series; in that series, Lowe's sponsored the No. 99 Gainsco Stallings Racing Pontiac in events where Johnson was driving. In 2006, Lowe's contracted designer Marianne Cusato to develop and offer affordable house plans for the hurricane-affected Gulf region. Lowe's is the exclusive retailer for both the plans and building materials for the Lowe's Katrina Cottage. They offer easy construction and affordability, as well as the possibility of expansion. Moreover, they meet all international building codes and exceed hurricane codes. Lowe's discontinued the Katrina Cottage line in 2011. Lowe's has a wide variety of television and radio commercials. A significant number of different racing-inspired commercials can be seen and are often played outside of television race coverage. Before 2010, when he was replaced by Ben Yannette, Gene Hackman's voice could be heard on many commercial advertisements for Lowe's. All-American Muslim advertising controversy Lowe's withdrew its advertising from the TLC reality television show All-American Muslim in December 2011. A spokesperson for Lowe's said, \"we understand the program raised concerns, complaints, or issues from multiple sides of the viewer spectrum, which we found after doing research of news articles and blogs covering the show\". Lowe's faced a backlash from several quarters, including Muslim-American and Arab-American organizations. The American-Arab Anti-Discrimination Committee called upon members to contact Lowe's to urge it to reverse its position. The Los Angeles chapter of the Council on American-Islamic Relations met to consider possible actions, including boycotts and protests. Several celebrities also called for a boycott. California State Senator Ted Lieu called Lowe's decision \"naked religious bigotry\" and said he would consider legislative action if Lowe's did not apologize to Muslim Americans and reinstate the ads. Abraham Foxman of the Anti-Defamation League expressed similar views. Keith Ellison, the first Muslim elected to the United States Congress, criticized Lowe's decision to \"uphold the beliefs of a fringe hate group and not the creed of the First Amendment\". Representative John Conyers of Michigan called on Lowe's to apologize. Michigan state representative Rashida Tlaib contacted the company's corporate headquarters, reporting that Lowe's declined to change its decision. Associated brands Kobalt tools allen+roth Canada Lowe's opened its first three stores in Canada on December 10, 2007, in Hamilton, Brampton, and Brantford. On February 1, 2008, they opened three more stores in Toronto, East Gwillimbury, and a second store in Brampton, as well as a new location in Maple (Vaughan). Lowe's also expanded into western Canada, starting with three new stores in Calgary, Alberta. One of the three locations opened in late September 2010. The other two opened in early 2011. In February 2013, Lowe's Canada hired former Walmart Canada and Loblaw Companies executive Sylvain Prud'homme as CEO. On May 11, 2015, Lowe's Canada announced that it would acquire the leases of 13 former Target Canada stores, as well as an Ontario distribution centre, for $151 million. In 2012, Lowe's attempted to buy Rona, Inc., a Quebec-based hardware chain. However, the deal was met with objections from RONA shareholders (particularly the Caisse de dépôt et placement du Québec) and operators of its franchised locations over concerns that the company could centralize its supply operations in the United States, and was eventually called off. On February 3, 2016, Rona announced that it had accepted an offer to be acquired by Lowe's for CDN$3.2 billion, pending regulatory and shareholder approval. The division would remain under the leadership of Sylvain Prud'homme, but would be operated out of Rona's headquarters in Boucherville. Lowe's maintained Rona's retail banners, \"key\" executives, and the \"vast majority of its current employees\" after the acquisition. In February 2020, Lowe's closed 34 low-performance stores, 26 that were under the Rona brand, six Lowe's stores, and two Réno-Dépôt stores. In November 2022, Lowe's agreed to sell its Canadian operations to the private equity firm Sycamore Partners for $400 million. with the Lowe's stores expected to be rebranded under the Rona brand in the future. The sale was completed on February 3, 2023. In July 2023, Rona announced that it would begin to replace Lowe's with the new banner Rona+, beginning with 10 locations in Ontario. Australia Trading as Masters Home Improvement, the first store opened in Braybrook, Victoria, to tradesmen on August 31, 2011, and later to the general public. Masters was a joint venture between Lowe's and Woolworths to compete against Bunnings, which operates in the large bigbox format similar to Lowe's and Home Depot. In January 2016, Woolworths announced that it intended to either sell or wind up all its home improvement areas, including the Masters hardware chain. Chairman Gordon Cairns said that it would take years to become profitable and that the ongoing losses could not be sustained. The windup involved Woolworths buying back a 33.3 per cent interest in the venture, held by the Lowe's subsidiary WDR Delaware Corporation. The last stores closed in December 2016. Lawsuits Lowe's was involved in a small cluster of class action lawsuits that revolved around the employee payment system. The cases focused on a pay practice known as \"variable rate overtime\". Variable-rate overtime has the effect of paying a decreasing overtime rate the more hours a person works in a week. The suits alleged that salaried managers who worked 40 to 50 hours per week were improperly compensated for that time. The variable rate overtime ended in the first quarter of 2006. The first case was filed in October 2002 by employees of the Lowe's store in Shawnee, Kansas. In September 2005, the cases were certified as a class action. Four similar briefs were filed in New York, Indiana, Pennsylvania, and Ohio. The lawsuits for New York, Indiana, and Kansas resulted in an out-of-court settlement on September 22, 2006. The lawsuit in Pennsylvania became a class-action lawsuit in June 2004, with 550 employees. The case in Ohio was filed by ten former Lowe's employees in August 2004. Lowe's faced multiple lawsuits from its Loss Prevention Managers citing that they were classified as exempt employees and therefore denied overtime pay. The managers asserted that they were forced to work a minimum of 48 hours per week which saved Lowe's and its investors millions of dollars every year. Lawsuits have been settled for $2.95 million in California and $6.2 million in Texas. In 2014, Lowe's faced a class-action lawsuit from former and current Human Resource Managers. Similarly to the lawsuit regarding its Loss Prevention Managers, the lawsuit stated that the HR Managers were improperly, and illegally, classified as exempt employees and were, therefore, denied overtime even though they were required to work 48-hour weeks."
}