{
  "ticker": "LRCX",
  "cik": "0000707549",
  "company_name": "Lam Research",
  "corrected_name": "Lam Research",
  "wiki_title_used": "Lam Research",
  "exists": true,
  "raw_text": "Lam Research Corporation is an American supplier of wafer-fabrication equipment and related services to the semiconductor industry. Its products are used primarily in front-end wafer processing, which involves the steps that create the active components of semiconductor devices (transistors, capacitors) and their wiring (interconnects). The company also builds equipment for back-end wafer-level packaging (WLP) and for related manufacturing markets such as for microelectromechanical systems (MEMS).\nLam Research was founded in 1980 by David K. Lam and is headquartered in Fremont, California. As of 2023, it was the third largest manufacturer in the Bay Area, after Tesla and Intuitive Surgical.\n\nHistory\nLam Research was founded in 1980 by David K. Lam, a Chinese-born engineer who had previously worked at Xerox, Hewlett-Packard, and Texas Instruments. It was while he was at Hewlett Packard that he saw the need for better plasma etching equipment, to keep up with the rapid miniaturization of semiconductor wafers.  He credited Bob Noyce, founder of Intel, for assisting him in getting funding by ensuring his business plan made sense.\nIn 1981, the company introduced its first product, the AutoEtch 480, an automated polysilicon plasma etcher.  The name AutoEtch was chosen to convey that the etcher was automated, while the 80 in 480 came from 1980, the year the company was founded.  The first system was sold in January 1982. In 1982, Roger Emerick was appointed CEO.\nIn May 1984, the company issued an initial public offering and was listed on Nasdaq under the symbol LRCX. In 1985, David Lam left the company to join Link Technologies, which eventually was bought by Wyse and is now Dell Wyse. In the mid-1980s, Lam Research continued its global expansion, concentrating on Taiwan and also opening customer support centers throughout Europe, the United States and Japan.\nBy the early 1990s, the company had a presence in China, Korea, Singapore, and Taiwan. In March 1997, the company purchased OnTrak Systems Inc., a chip equipment manufacturer that specialized in chemical-mechanical planarization (CMP) cleaning, for $225 million. CMP cleaning is a hybrid process to smooth surfaces using both etching and mechanical polishing. In August 1997, the company named OnTrak's CEO Jim Bagley as its CEO. In 1998, Bagley was named chairman of the board.\nIn 2005, Steve Newberry was appointed as CEO. In 2006, Lam Research acquired Bullen Semiconductor, now Silfex, Inc. In 2008, Lam Research acquired SEZ AG, now Lam Research AG. In 2011, Lam Research agreed to buy San Jose, California chip equipment manufacturer Novellus Systems, for $3.3 billion.  The deal was completed in June 2012. In 2012, Martin Anstice was appointed as CEO. In October 2015, Lam Research announced plans to buy Milpitas, California–based wafer inspection equipment vendor KLA-Tencor for $10.6bn, in what was viewed as a semiconductor industry consolidation move. In June 2016, it was announced that Lam Research had joined the Fortune 500 for the first time. In October 2016, the company announced it had terminated its offer for KLA-Tencor amidst concerns that the deal would not meet regulatory approval from the U.S. Department of Justice over antitrust concerns.\nIn September 2017, the company announced the acquisition of Cary, North Carolina–based chip simulation firm Coventor.  The company's software reportedly would allow Lam to reduce the time to market for its customers' new chips. In November, the company launched Lam Research Capital (Lam Capital), a venture capital group chartered to invest in companies.\nIn January 2018, the company announced that COO Tim Archer was being promoted to president, and CEO Martin Anstice remained in the CEO role.\nIn December 2018, Martin Anstice resigned as CEO due to allegations of personal misconduct, and the Board of Directors of Lam Research named Tim Archer as president and chief executive officer. Archer was also appointed to the Board of Directors of Lam Research.\nIn August 2021, Lam opened a manufacturing facility in Batu Kawan, Malaysia to meet the growing demand for wafer fabrication equipment and to work more closely with key customers and supply chain partners.\nOn 15 September 2022, Lam Research established a new India Center for Engineering in Bengaluru. This center will be utilized for engineering, testing, and research and development of wafer manufacturing hardware and software, which are used to create memory components including DRAM, NAND, and logic technologies.This is Lam's second R&D lab and third Indian facility. It will assist the company's worldwide production operations with hardware and software. The new facility will lessen the Indian engineers' dependency on their US counterparts by enabling them to finish designs domestically and shift the bulk of Lam's international activities to India.\nIn November 2022, it was announced Lam had acquired the Salzburg-headquartered, wet processing semiconductor equipment provider, Semsysco GmbH. That same month, Lam also acquired the Texas-based plasma simulation company, Esgee Technologies, Inc.\n\nProducts\nLam Research designs and builds products for semiconductor manufacturing, including equipment for thin film deposition, plasma etch, photoresist strip, and wafer cleaning processes.  Throughout semiconductor manufacturing, these technologies help create transistors, interconnects, advanced memory, and packaging structures.  They are also used for applications in related markets like microelectromechanical systems (MEMS) and light-emitting diodes (LEDs).\n\nThin film deposition\nLam's thin film deposition systems lay down the sub-microscopic layers of conducting (metal) or insulating (dielectric) materials that make up an integrated circuit. The processes require uniformity at the nanoscale level.\nThe company employs electrochemical deposition (ECD) and chemical vapor deposition (CVD) technologies to form copper and other metal films for conducting structures. Atomic layer deposition (ALD) is also used for tungsten metal films in features like contacts and plugs, which are vertical connections between metal lines in multilevel interconnect chip designs.\nPlasma-enhanced (PE) CVD and ALD technologies create dielectric films for a wide range of insulating parts. For gapfill processes, which require depositing dielectric material into narrow spaces, Lam uses high-density plasma (HDP) CVD technology. PECVD and ALD are also used to form hardmasks, layers that can be removed to improve circuit patterning processes.\n\nPlasma etch\nLam Research uses proprietary technology in its equipment for plasma etch, the process of selectively removing materials from the surface of a wafer to create the semiconductor device's features and patterns. The equipment helps chip manufacturers carve small parts such as those needed for the latest multiple patterning sequences, transistors, and advanced memory structures, which involve increasingly complex film stacks and ever higher aspect ratio structures.\nThe company uses reactive ion etch (RIE) and atomic layer etching (ALE) to shape a variety of conductive and dielectric features. The company's deep RIE technologies help create structures for applications like MEMS and through-silicon vias (TSVs).\n\nPhotoresist strip\nLam's dry strip systems use plasma technology to selectively remove the photoresist mask following a range of front-end wafer processing and advanced packaging applications.\n\nWafer cleaning\nLam Research's wet spin clean and plasma-based bevel clean products remove particles, residues, and films from the wafer surface before or after adjacent processes.\nThe company's spin wet clean technology is used between chip-processing steps to remove yield-limiting residues and defects. Lam's bevel clean technology directs a plasma at the very edge of the wafer to clean unwanted particles, residues, and films. If not removed, these materials can impact yield if they flake off and re-deposit on the device area during subsequent manufacturing steps.\n\nSee also\nApplied Materials\n\nReferences\nExternal links\nOfficial website \nBusiness data for Lam Research:",
  "clean_text": "Lam Research Corporation is an American supplier of wafer-fabrication equipment and related services to the semiconductor industry. Its products are used primarily in front-end wafer processing, which involves the steps that create the active components of semiconductor devices (transistors, capacitors) and their wiring (interconnects). The company also builds equipment for back-end wafer-level packaging (WLP) and for related manufacturing markets such as for microelectromechanical systems (MEMS). Lam Research was founded in 1980 by David K. Lam and is headquartered in Fremont, California. As of 2023, it was the third largest manufacturer in the Bay Area, after Tesla and Intuitive Surgical. History Lam Research was founded in 1980 by David K. Lam, a Chinese-born engineer who had previously worked at Xerox, Hewlett-Packard, and Texas Instruments. It was while he was at Hewlett Packard that he saw the need for better plasma etching equipment, to keep up with the rapid miniaturization of semiconductor wafers. He credited Bob Noyce, founder of Intel, for assisting him in getting funding by ensuring his business plan made sense. In 1981, the company introduced its first product, the AutoEtch 480, an automated polysilicon plasma etcher. The name AutoEtch was chosen to convey that the etcher was automated, while the 80 in 480 came from 1980, the year the company was founded. The first system was sold in January 1982. In 1982, Roger Emerick was appointed CEO. In May 1984, the company issued an initial public offering and was listed on Nasdaq under the symbol LRCX. In 1985, David Lam left the company to join Link Technologies, which eventually was bought by Wyse and is now Dell Wyse. In the mid-1980s, Lam Research continued its global expansion, concentrating on Taiwan and also opening customer support centers throughout Europe, the United States and Japan. By the early 1990s, the company had a presence in China, Korea, Singapore, and Taiwan. In March 1997, the company purchased OnTrak Systems Inc., a chip equipment manufacturer that specialized in chemical-mechanical planarization (CMP) cleaning, for $225 million. CMP cleaning is a hybrid process to smooth surfaces using both etching and mechanical polishing. In August 1997, the company named OnTrak's CEO Jim Bagley as its CEO. In 1998, Bagley was named chairman of the board. In 2005, Steve Newberry was appointed as CEO. In 2006, Lam Research acquired Bullen Semiconductor, now Silfex, Inc. In 2008, Lam Research acquired SEZ AG, now Lam Research AG. In 2011, Lam Research agreed to buy San Jose, California chip equipment manufacturer Novellus Systems, for $3.3 billion. The deal was completed in June 2012. In 2012, Martin Anstice was appointed as CEO. In October 2015, Lam Research announced plans to buy Milpitas, California–based wafer inspection equipment vendor KLA-Tencor for $10.6bn, in what was viewed as a semiconductor industry consolidation move. In June 2016, it was announced that Lam Research had joined the Fortune 500 for the first time. In October 2016, the company announced it had terminated its offer for KLA-Tencor amidst concerns that the deal would not meet regulatory approval from the U.S. Department of Justice over antitrust concerns. In September 2017, the company announced the acquisition of Cary, North Carolina–based chip simulation firm Coventor. The company's software reportedly would allow Lam to reduce the time to market for its customers' new chips. In November, the company launched Lam Research Capital (Lam Capital), a venture capital group chartered to invest in companies. In January 2018, the company announced that COO Tim Archer was being promoted to president, and CEO Martin Anstice remained in the CEO role. In December 2018, Martin Anstice resigned as CEO due to allegations of personal misconduct, and the Board of Directors of Lam Research named Tim Archer as president and chief executive officer. Archer was also appointed to the Board of Directors of Lam Research. In August 2021, Lam opened a manufacturing facility in Batu Kawan, Malaysia to meet the growing demand for wafer fabrication equipment and to work more closely with key customers and supply chain partners. On 15 September 2022, Lam Research established a new India Center for Engineering in Bengaluru. This center will be utilized for engineering, testing, and research and development of wafer manufacturing hardware and software, which are used to create memory components including DRAM, NAND, and logic technologies.This is Lam's second R&D lab and third Indian facility. It will assist the company's worldwide production operations with hardware and software. The new facility will lessen the Indian engineers' dependency on their US counterparts by enabling them to finish designs domestically and shift the bulk of Lam's international activities to India. In November 2022, it was announced Lam had acquired the Salzburg-headquartered, wet processing semiconductor equipment provider, Semsysco GmbH. That same month, Lam also acquired the Texas-based plasma simulation company, Esgee Technologies, Inc. Products Lam Research designs and builds products for semiconductor manufacturing, including equipment for thin film deposition, plasma etch, photoresist strip, and wafer cleaning processes. Throughout semiconductor manufacturing, these technologies help create transistors, interconnects, advanced memory, and packaging structures. They are also used for applications in related markets like microelectromechanical systems (MEMS) and light-emitting diodes (LEDs). Thin film deposition Lam's thin film deposition systems lay down the sub-microscopic layers of conducting (metal) or insulating (dielectric) materials that make up an integrated circuit. The processes require uniformity at the nanoscale level. The company employs electrochemical deposition (ECD) and chemical vapor deposition (CVD) technologies to form copper and other metal films for conducting structures. Atomic layer deposition (ALD) is also used for tungsten metal films in features like contacts and plugs, which are vertical connections between metal lines in multilevel interconnect chip designs. Plasma-enhanced (PE) CVD and ALD technologies create dielectric films for a wide range of insulating parts. For gapfill processes, which require depositing dielectric material into narrow spaces, Lam uses high-density plasma (HDP) CVD technology. PECVD and ALD are also used to form hardmasks, layers that can be removed to improve circuit patterning processes. Plasma etch Lam Research uses proprietary technology in its equipment for plasma etch, the process of selectively removing materials from the surface of a wafer to create the semiconductor device's features and patterns. The equipment helps chip manufacturers carve small parts such as those needed for the latest multiple patterning sequences, transistors, and advanced memory structures, which involve increasingly complex film stacks and ever higher aspect ratio structures. The company uses reactive ion etch (RIE) and atomic layer etching (ALE) to shape a variety of conductive and dielectric features. The company's deep RIE technologies help create structures for applications like MEMS and through-silicon vias (TSVs). Photoresist strip Lam's dry strip systems use plasma technology to selectively remove the photoresist mask following a range of front-end wafer processing and advanced packaging applications. Wafer cleaning Lam Research's wet spin clean and plasma-based bevel clean products remove particles, residues, and films from the wafer surface before or after adjacent processes. The company's spin wet clean technology is used between chip-processing steps to remove yield-limiting residues and defects. Lam's bevel clean technology directs a plasma at the very edge of the wafer to clean unwanted particles, residues, and films. If not removed, these materials can impact yield if they flake off and re-deposit on the device area during subsequent manufacturing steps."
}