{
  "ticker": "LULU",
  "cik": "0001397187",
  "company_name": "Lululemon Athletica",
  "corrected_name": "Lululemon Athletica",
  "wiki_title_used": "Lululemon Athletica",
  "exists": true,
  "raw_text": "Lululemon, commonly styled as lululemon (  loo-loo-LEM-ən; all lowercase), is a Canadian multinational athletic apparel retailer headquartered in Vancouver, British Columbia, and incorporated in Delaware, United States, as Lululemon Athletica Inc. It was founded in 1998 as a retailer of yoga pants and other yoga wear, and has expanded to also sell athletic wear, lifestyle apparel, accessories, and personal care products. The company has 711 stores (as of January 2024) and also sells online.\n\nProducts\nLululemon sells athletic apparel, including sporting tops, jackets, hoodies, joggers, running shoes, underwear, leggings, and casual wear. The company also offers accessories such as gloves, mittens, hats, shoes, bags, yoga mats, and water bottles. Lululemon has developed and trademarked several fabrics designed for different functions, including moisture-wicking and compression.\nLululemon's research and development lab, Whitespace, is housed within its headquarters. Its employees include scientists and physiologists. In 2019, the company introduced a streetwear brand called Lab in select stores. That year, Lululemon also announced plans to expand its men's clothing business. In March 2022, Lululemon expanded into footwear. The initial launch focused on women's footwear, later expanding to include men's styles.\n\nMarketing\nOriginally known for women's yoga apparel, Lululemon has grown by acquiring more male customers and adapting its product and marketing strategies. The company is said to use \"holistic guerrilla marketing\" to make customers feel that they are part of a community. It uses social media including Facebook, Twitter and Instagram as a main method of marketing the company and its products.\nThe company promoted its branded resale program, Like New, at South by Southwest in 2025, having started the program nationwide in 2022. The program allows consumers to trade in their clothing for store credit, typically ranging from $5 - $25 per item, and the company then resells the used clothing online.\n\nHistory\nLululemon was founded in 1998 by Chip Wilson in Vancouver, British Columbia, with its first standalone store opening in November 2000. In 1997, Wilson had been doing yoga and had an idea to make yoga apparel for women using a proprietary skintight fabric he developed to enhance their appearance. Wilson deliberately chose a name with multiple 'L's (Japanese: ルルレモン, romanized: Rururemon) because he thought it was funny to use a letter that Japanese speakers often have difficulty pronouncing. He said the name otherwise \"means nothing\" but included three 'L's to make it sound \"Western\" and \"exotic\" to Japanese buyers. He later remarked,\n\nThe reason the Japanese liked [my former skateboard brand 'Homeless'] was because it had an L in it and a Japanese marketing firm wouldn't come up with a brand name with an L in it. L is not in their vocabulary. It's a tough pronunciation for them. So I thought, next time I have a company, I'll make a name with three Ls and see if I can get three times the money. It's kind of exotic for them. I was playing with Ls and I came up with Lululemon. It's funny to watch them try to say it.\n\nIPO and expansion\nThe company made its initial public offering in July 2007, raising $327.6 million by selling 18.2 million shares on the American Nasdaq. Christine Day, a former co-president of Starbucks, assumed her role as the company's chief executive officer in 2008. In December 2010, Lululemon recalled some of the store's reusable bags that were made from polypropylene, based on reports of high levels of lead. In 2012, Lululemon filed a lawsuit against Calvin Klein and supplier G-III Apparel Group for infringement of three of its design patents for yoga pants. The case was settled out of court the same year. In 2013, the company made its third consecutive appearance on Fortune's Fastest-Growing Companies list. In December 2013, founder Chip Wilson announced his resignation as chairman, and that the president of TOMS Shoes, Laurent Potdevin, would become CEO. In 2018, Calvin McDonald became CEO of Lululemon Athletica.\nIn 2014, Lululemon opened its first store in Europe, in Covent Garden, London. In February 2015, Wilson announced that he was resigning from the board, and Michael Casey, former lead director of the board, would replace him. In 2018, Laurent Potdevin resigned as CEO and from the company's board due to misconduct related to a relationship he was having with a then-employee and later contractor. In 2013, some customers complained that the clothing was of poor quality, with some items being \"too sheer\", having holes appear, and falling apart after a few uses. The same year, Lululemon recalled its black yoga pants that were unintentionally transparent and \"too thin\"; the recall, which amounted to approximately 17 percent of all women's pants sold in its stores, impacted its financial results. The resulting financial loss and damage to the brand led to the forced departure of the company's chief product officer, Sheree Waterson, and of its CEO, Christine Day.\nFrom its founding through 2015, Lululemon incorporated concepts from the Landmark Forum into its leadership and development training. According to a company source, seventy per cent of managers are hired internally. Store managers are responsible for their store's layout, colour coordination, and community involvement.\nLululemon Athletica became a Nasdaq-100 company on December 24, 2018. In 2019, Lululemon announced an investment in MIRROR, a home exercise startup that sells interactive fitness mirrors with a camera and speakers for at-home workouts. Capitalizing on a growing trend of people conducting virtual workouts at home instead of going to a gym due to the COVID-19 pandemic, MIRROR was formally acquired by Lululemon on June 29, 2020, for $500 million and was rebranded as lululemon Studio. The companies also planned to create new content for the device, starting with meditation classes. Following the acquisition, Lululemon recorded a post-tax impairment charge of $442.7 million related to the acquisition at the end of the 2022 fiscal year.\nIn 2024, Lululemon Athletica Inc. agreed to acquire the operations and retail locations of its franchise partner in Mexico for an undisclosed amount.\n\nControversies\nIn November 2007, The New York Times reported that Lululemon made false claims about its Vitasea clothing product; the firm had claimed that the clothing, made from seaweed, provided \"anti-inflammatory, antibacterial, hydrating and detoxifying benefits\" but laboratory tests failed to find significant differences in mineral levels between ordinary T-shirt cotton and Vitasea fabric. Lululemon was subsequently forced to remove all health claims from its seaweed-based products marketed in Canada, following a demand from a Canadian oversight agency, the Competition Bureau of Canada.\nLululemon's founder Chip Wilson has made numerous controversial statements throughout his career. In 2013, Wilson stated that the company did not make clothes for plus-size women because it was too costly. In an effort to explain away excessive pilling in the brand's clothing, he blamed some customers for wearing Lululemon's clothes improperly or for having body shapes inconsistent with the design of the clothing. In an interview for Bloomberg Television in 2013, he stated that some women's bodies were unsuitable for the brand's clothing. Time called the remarks \"fat shaming\". Comments such as these reportedly led to Wilson's resignation as chairman. In June 2016, Wilson published an open letter to shareholders stating that the company had \"lost its way\" and given up market share to Nike and Under Armour, after he was denied the opportunity to speak at the company's annual meetings. Since then, Wilson has used his website \"Elevate Lululemon\" to criticize the brand and business.\nIn 2021, an unnamed company director pushed employees to create an All Lives Matter campaign to be displayed on its website in response to the murder of George Floyd. Employees pushed back but were told to create a mock up with the All Lives Matter copy; however, they also created a Black Lives Matter mock up that was selected instead. The director apologized and subsequently left the company.\nIn May 2023, it was reported that a Lululemon store in Atlanta, Georgia, fired two employees for calling the police during a looting, but the company said that they were fired for physically confronting or following the looters. The two employees physically approached the looters, and one of them took a video recording of the looting with her smartphone. They then followed the looters out of the store towards the parking lot. The three looters were arrested within days and charged with felony robbery.\nIn 2025, the company filed a lawsuit alleging Costco infringed on its intellectual property.\n\nSee also\nLululemon murder\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Lululemon Athletica:",
  "clean_text": "Lululemon, commonly styled as lululemon ( loo-loo-LEM-ən; all lowercase), is a Canadian multinational athletic apparel retailer headquartered in Vancouver, British Columbia, and incorporated in Delaware, United States, as Lululemon Athletica Inc. It was founded in 1998 as a retailer of yoga pants and other yoga wear, and has expanded to also sell athletic wear, lifestyle apparel, accessories, and personal care products. The company has 711 stores (as of January 2024) and also sells online. Products Lululemon sells athletic apparel, including sporting tops, jackets, hoodies, joggers, running shoes, underwear, leggings, and casual wear. The company also offers accessories such as gloves, mittens, hats, shoes, bags, yoga mats, and water bottles. Lululemon has developed and trademarked several fabrics designed for different functions, including moisture-wicking and compression. Lululemon's research and development lab, Whitespace, is housed within its headquarters. Its employees include scientists and physiologists. In 2019, the company introduced a streetwear brand called Lab in select stores. That year, Lululemon also announced plans to expand its men's clothing business. In March 2022, Lululemon expanded into footwear. The initial launch focused on women's footwear, later expanding to include men's styles. Marketing Originally known for women's yoga apparel, Lululemon has grown by acquiring more male customers and adapting its product and marketing strategies. The company is said to use \"holistic guerrilla marketing\" to make customers feel that they are part of a community. It uses social media including Facebook, Twitter and Instagram as a main method of marketing the company and its products. The company promoted its branded resale program, Like New, at South by Southwest in 2025, having started the program nationwide in 2022. The program allows consumers to trade in their clothing for store credit, typically ranging from $5 - $25 per item, and the company then resells the used clothing online. History Lululemon was founded in 1998 by Chip Wilson in Vancouver, British Columbia, with its first standalone store opening in November 2000. In 1997, Wilson had been doing yoga and had an idea to make yoga apparel for women using a proprietary skintight fabric he developed to enhance their appearance. Wilson deliberately chose a name with multiple 'L's (Japanese: ルルレモン, romanized: Rururemon) because he thought it was funny to use a letter that Japanese speakers often have difficulty pronouncing. He said the name otherwise \"means nothing\" but included three 'L's to make it sound \"Western\" and \"exotic\" to Japanese buyers. He later remarked, The reason the Japanese liked [my former skateboard brand 'Homeless'] was because it had an L in it and a Japanese marketing firm wouldn't come up with a brand name with an L in it. L is not in their vocabulary. It's a tough pronunciation for them. So I thought, next time I have a company, I'll make a name with three Ls and see if I can get three times the money. It's kind of exotic for them. I was playing with Ls and I came up with Lululemon. It's funny to watch them try to say it. IPO and expansion The company made its initial public offering in July 2007, raising $327.6 million by selling 18.2 million shares on the American Nasdaq. Christine Day, a former co-president of Starbucks, assumed her role as the company's chief executive officer in 2008. In December 2010, Lululemon recalled some of the store's reusable bags that were made from polypropylene, based on reports of high levels of lead. In 2012, Lululemon filed a lawsuit against Calvin Klein and supplier G-III Apparel Group for infringement of three of its design patents for yoga pants. The case was settled out of court the same year. In 2013, the company made its third consecutive appearance on Fortune's Fastest-Growing Companies list. In December 2013, founder Chip Wilson announced his resignation as chairman, and that the president of TOMS Shoes, Laurent Potdevin, would become CEO. In 2018, Calvin McDonald became CEO of Lululemon Athletica. In 2014, Lululemon opened its first store in Europe, in Covent Garden, London. In February 2015, Wilson announced that he was resigning from the board, and Michael Casey, former lead director of the board, would replace him. In 2018, Laurent Potdevin resigned as CEO and from the company's board due to misconduct related to a relationship he was having with a then-employee and later contractor. In 2013, some customers complained that the clothing was of poor quality, with some items being \"too sheer\", having holes appear, and falling apart after a few uses. The same year, Lululemon recalled its black yoga pants that were unintentionally transparent and \"too thin\"; the recall, which amounted to approximately 17 percent of all women's pants sold in its stores, impacted its financial results. The resulting financial loss and damage to the brand led to the forced departure of the company's chief product officer, Sheree Waterson, and of its CEO, Christine Day. From its founding through 2015, Lululemon incorporated concepts from the Landmark Forum into its leadership and development training. According to a company source, seventy per cent of managers are hired internally. Store managers are responsible for their store's layout, colour coordination, and community involvement. Lululemon Athletica became a Nasdaq-100 company on December 24, 2018. In 2019, Lululemon announced an investment in MIRROR, a home exercise startup that sells interactive fitness mirrors with a camera and speakers for at-home workouts. Capitalizing on a growing trend of people conducting virtual workouts at home instead of going to a gym due to the COVID-19 pandemic, MIRROR was formally acquired by Lululemon on June 29, 2020, for $500 million and was rebranded as lululemon Studio. The companies also planned to create new content for the device, starting with meditation classes. Following the acquisition, Lululemon recorded a post-tax impairment charge of $442.7 million related to the acquisition at the end of the 2022 fiscal year. In 2024, Lululemon Athletica Inc. agreed to acquire the operations and retail locations of its franchise partner in Mexico for an undisclosed amount. Controversies In November 2007, The New York Times reported that Lululemon made false claims about its Vitasea clothing product; the firm had claimed that the clothing, made from seaweed, provided \"anti-inflammatory, antibacterial, hydrating and detoxifying benefits\" but laboratory tests failed to find significant differences in mineral levels between ordinary T-shirt cotton and Vitasea fabric. Lululemon was subsequently forced to remove all health claims from its seaweed-based products marketed in Canada, following a demand from a Canadian oversight agency, the Competition Bureau of Canada. Lululemon's founder Chip Wilson has made numerous controversial statements throughout his career. In 2013, Wilson stated that the company did not make clothes for plus-size women because it was too costly. In an effort to explain away excessive pilling in the brand's clothing, he blamed some customers for wearing Lululemon's clothes improperly or for having body shapes inconsistent with the design of the clothing. In an interview for Bloomberg Television in 2013, he stated that some women's bodies were unsuitable for the brand's clothing. Time called the remarks \"fat shaming\". Comments such as these reportedly led to Wilson's resignation as chairman. In June 2016, Wilson published an open letter to shareholders stating that the company had \"lost its way\" and given up market share to Nike and Under Armour, after he was denied the opportunity to speak at the company's annual meetings. Since then, Wilson has used his website \"Elevate Lululemon\" to criticize the brand and business. In 2021, an unnamed company director pushed employees to create an All Lives Matter campaign to be displayed on its website in response to the murder of George Floyd. Employees pushed back but were told to create a mock up with the All Lives Matter copy; however, they also created a Black Lives Matter mock up that was selected instead. The director apologized and subsequently left the company. In May 2023, it was reported that a Lululemon store in Atlanta, Georgia, fired two employees for calling the police during a looting, but the company said that they were fired for physically confronting or following the looters. The two employees physically approached the looters, and one of them took a video recording of the looting with her smartphone. They then followed the looters out of the store towards the parking lot. The three looters were arrested within days and charged with felony robbery. In 2025, the company filed a lawsuit alleging Costco infringed on its intellectual property."
}