{
  "ticker": "LUV",
  "cik": "0000092380",
  "company_name": "Southwest Airlines",
  "corrected_name": "Southwest Airlines",
  "wiki_title_used": "Southwest Airlines",
  "exists": true,
  "raw_text": "Southwest Airlines Co., or simply Southwest, is a major low cost airlines of the United States. It is headquartered in the Love Field neighborhood of Dallas, Texas. It is the fourth-largest airline in North America when measured by passengers carried, as of 2023. With its all-Boeing 737 fleet, Southwest serves over 100 destinations in 42 states, Washington, D.C., Puerto Rico, and ten other countries near the southern United States in the Gulf of Mexico and Caribbean Sea regions: Aruba, the Bahamas, Belize, the Cayman Islands, Costa Rica, Cuba, the Dominican Republic, Mexico, Jamaica, and Turks and Caicos.\nThe airline was established on March 9, 1967, by Herb Kelleher and Rollin King as Air Southwest Co. and adopted its current name, Southwest Airlines Co., in 1971, when it began operating as an intrastate airline wholly within the state of Texas, first flying between Dallas, Houston, and San Antonio. It began regional interstate service in 1979, expanding nationwide in the following decades.\n\nHistory\nNetwork\nSouthwest uses a point-to-point system combined with a rolling-hub model in its base cities, in contrast to the hub-and-spoke system of other major airlines. As of January 2024, Southwest Airlines flies to over 100 destinations in 42 states, Puerto Rico, Mexico, Central America, and the Caribbean. This system means that the airline has no real hubs, but rather some airports with more destinations than others.\n\nInterline agreements\nSouthwest currently has interline agreements with Icelandair , Taiwan's China Airlines , EVA Air. and Philippine Airlines.\n\nFleet\nPassenger experience\nSouthwest Airlines solely offers economy class seating and does not have business class or first class cabins on its aircraft.\nSouthwest offers free snacks and non-alcoholic beverages inflight and offers alcoholic beverages for sale for $7–9 per beverage. Free alcoholic drinks are offered to passengers on some holidays such as Valentine's Day and Halloween. Southwest has become known for colorful boarding announcements and crews who sometimes burst out in song.\n\nSouthwest currently has an open seating policy, scheduled to end on January 26, 2026, and uses a unique boarding process. Passengers are given a group letter (A, B or C) and a number (1 through 60). Passengers lineup in numerical order within each letter group and choose any open seat on the aircraft. A 2012 study on the television series MythBusters, found this to be the fastest method currently in use for passengers to board a plane; on average, it is 10 minutes faster than the standard method. \nSouthwest has a \"customer of size\" policy in which the cost of a second seat is refunded for any plus-sized travelers who take up more room than one seat.\nOn May 1, 2025, Southwest introduced the first aircraft with new extra-legroom seating as part of a phased update to its cabin layout. These seats will be installed in the first five rows and near exit doors on retrofitted Boeing 737-800 and MAX 8 aircraft. During the initial rollout, the seats will be available at no additional cost as the airline continues to operate under an open seating policy. The airline plans to complete these upgrades before operating flights with assigned seats on January 27, 2026.\n\nIn-flight entertainment\nAs of December 2024, Southwest offers free streaming of live television, movies, music, in-app messaging (iMessage and WhatsApp), and real-time flight tracking. Full Internet access is available for an $8 fee for most passengers but is free for Business Select and A-List Preferred passengers. As of March 9, 2023, Southwest began upgrading Wi-Fi hardware on its existing aircraft equipped with Anuvu Wi-Fi and began rolling out Viasat Wi-Fi on all new deliveries.\n\nRapid Rewards\nSouthwest first began to offer a frequent-flyer program on June 18, 1987, calling it The Company Club. The program credited for trips flown regardless of distance. Southwest Airlines renamed its frequent-flyer program Rapid Rewards on April 25, 1996.\nThe original Rapid Rewards program offered one credit per one-way flight from an origin to a destination, including any stops or connections on Southwest Airlines. When 16 credits were accumulated in a 24-month period, Southwest awarded one free round-trip ticket that was valid for 12 months.\nOn March 1, 2011, Rapid Rewards changed to a points system based on ticket cost. Members earn and redeem points based on a four-tier fare scale multiplier and the cost of the ticket. Changes also included no blackout dates, seat restrictions, or expiring credits. Since October 18, 2019, Rapid Rewards points do not expire as long as the member is alive. It also adds more options to use points.\n\nCorporate affairs\nBusiness trends\nThe key trends for Southwest Airlines are (as of the end of the calendar year):\n\nHeadquarters\nThe Southwest Airlines headquarters are located on the grounds of Dallas Love Field in Dallas. \nOn September 17, 2012, Southwest broke ground on a new Training and Operational Support building, across the street from its current headquarters building.\nOn June 2, 2016, Southwest broke ground on its new office and training facility known as Wings. The newest addition to the corporate campus is composed of a 420,000-square-foot, six-story office building, and a 380,000-square-foot adjoining structure called the Leadership Education and Aircrew Development (LEAD) Center that serves as the new pilot training facility. The LEAD Center has the capacity to house and support 18 flight simulators. It is designed to be expanded to accommodate up to 26 simulator bays. The building opened on April 3, 2018.\nOn August 16, 2019, Southwest announced an expansion of the LEAD Center to accommodate eight additional simulators for future operational and training demands. On January 2, 2020, it was announced that Southwest would be purchasing an additional 3 acres (1.2 ha) of land adjacent to its Wings and LEAD facilities. No additional details were disclosed.\n\nEmployment\nAs of January 30, 2025, Southwest Airlines had 72,450 active full-time equivalent employees. According to The Washington Post, it uses the hiring motto of seeking people that have a \"Servant's Heart, Warrior Spirit, Fun-LUVing Attitude\". It also uses the internal practice of ranking \"employees first, customers second\". Southwest Airlines pilots are represented by the Southwest Airlines Pilot Association union.\nBob Jordan became Southwest's sixth CEO on February 1, 2022, replacing Gary C. Kelly. Kelly continues as chairman of Southwest Airlines. Kelly replaced Jim Parker on July 15, 2004, and assumed the title of president on July 15, 2008, replacing former president Colleen Barrett.\nIn September 2024, in response to pressure from Elliott Investment Management, Kelly announced that he would not seek reelection as executive chairman in 2025. Jordan is expected to remain as CEO.On October 24, 2024, Kelly announced he will accelerate his retirement, which – along with the previously announced retirements of six other Southwest Directors – will go into effect on November 1, 2024. Rakesh Gangwal was announced as independent Chair of the Board of Directors three days later.  Gangwal stepped down as Chair on August 1, 2025, and Doug Brooks was announced as the new independent Chair of the Board.\nAbout 83% of Southwest employees are members of a union. The Southwest Airline Pilots' Association, a union not affiliated with the Air Line Pilots Association, represents the airline's pilots. The aircraft maintenance technicians are represented by the Aircraft Mechanics Fraternal Association. Customer service agents and reservation agents are represented by the International Association of Machinists and Aerospace Workers Union. Flight dispatchers, flight attendants, ramp agents, and operations agents are represented by the Transport Workers Union.\nThe company has appeared on various \"best places to work\" list, with its employee culture mentioned by Travel and Leisure, CNBC, and Forbes. The company has also been named to Fortune magazine's \"Most Admired Companies\" list, reaching number 14 in 2021.\nSouthwest has never furloughed an employee. As a result of the COVID-19 pandemic, the company launched voluntary separation and extended time-off programs in 2020, and around 16,900 employees volunteered to take an early retirement or long-term leave.  Roughly 24% were pilots and 33% were flight attendants. In late 2020, the airline issued some WARN Act notices and announced incipient pay cuts for many employees in response to pandemic impacts, but these measures were rescinded after the Consolidated Appropriations Act, 2021 was enacted on December 27, 2020, providing additional financial aid to US airlines.\nThe latest five year labor contract for Southwest Airlines pilots was approved in January 2024.\nFollowing a board takeover in February 2025  Southwest laid off 1750 of its non-contract staff, approximately 15% of its corporate workforce.\n\nImpact on carriers\nSouthwest and its business model have had an influence on other low-cost carriers (LCC's). The competitive strategy combines a high level of employee and aircraft productivity with low unit costs by reducing aircraft turnaround time, particularly at the gate. Europe's EasyJet and Ryanair are two of the best-known airlines to follow Southwest's business strategy in that continent. Other airlines with a business model based on Southwest's system include Canada's WestJet, Malaysia's AirAsia (the first and biggest LCC in Asia), India's IndiGo, Australia's Jetstar, a subsidiary of Qantas (although Jetstar now operates three aircraft types), Philippines' Cebu Pacific, Thailand's Nok Air, Mexico's Volaris, Indonesia's Lion Air and Turkey's Pegasus Airlines.\n\nLobbying against high-speed rail\nIn the early 1990s, Southwest Airlines actively opposed proposals to develop high-speed rail in Texas, viewing the project as a competitor to its short-haul flights. The proposed rail system would have connected Dallas, San Antonio, and Houston. Southwest lobbied both the United States Congress and the Texas Legislature, and filed multiple lawsuits aimed at halting the initiative. In a 1991 statement to Texas officials, the airline argued that high-speed rail would only be feasible if it displaced existing airline services and received substantial public subsidies. The project was cancelled in 1994 with many observers citing Southwest’s lobbying efforts as a significant factor in its failure.\n\nAdvertising\nThe company has always employed humor in its advertising. Former slogans include \"Love Is Still Our Field\", \"Just Plane Smart\", \"The Somebody Else Up There Who Loves You\", \"You're Now Free to Move About the Country\", \"THE Low Fare Airline\", \"Grab your bag, It's On!\", and \"Welcome Aboard\". The airline's slogan (as of 2022) is \"Low fares. Nothing to hide. That's TransFarency!\"\nIn March 1992, shortly after Southwest started using the \"Just Plane Smart\" motto, Stevens Aviation, which had been using \"Plane Smart\" for its motto, advised Southwest that it was infringing on its trademark.  Instead of a lawsuit, the CEOs for both companies staged an arm-wrestling match, dubbed as \"Malice in Dallas\". It was held at the now-demolished Dallas Sportatorium and set for two out of three rounds, the loser of each round was to pay $5,000 to the charity of his choice, with the winner gaining the use of the trademarked phrase. A promotional video was created showing the CEOs \"training\" for the bout (with CEO Herb Kelleher being helped up during a sit-up where a cigarette and glass of Wild Turkey 101 whiskey was waiting) and distributed among the employees and also as a video press release along with the video of the match itself. Herb Kelleher lost the match for Southwest, with Stevens Aviation winning the rights to the phrase. Kurt Herwald, CEO of Stevens Aviation, immediately granted the use of \"Just Plane Smart\" to Southwest Airlines. The net result was both companies having use of the trademark.\n\nAccidents and incidents\nSouthwest Airlines has been involved in 11 accidents, including three aircraft hull losses and four fatalities: one accidental passenger death in flight, two non-passenger deaths on the ground, and one passenger who died from injuries sustained after being restrained by others while attempting to enter the cockpit. No passenger has died as a result of a crash.\n\nMarch 5, 2000 – Flight 1455: A Boeing 737-300 (registration N668SW) overran the runway upon landing at Burbank Airport in California, injuring 44 people. The captain was later dismissed, and the aircraft was damaged beyond repair. Two people were seriously injured, and 42 had minor injuries.\nAugust 11, 2000 – Flight 1763: A Boeing 737-700 (registration N798SW) en route from Las Vegas, Nevada, to Salt Lake City, Utah, experienced an air rage incident in which a passenger attempted to storm the cockpit. He was restrained by other passengers but died of asphyxiation during the struggle. One other passenger sustained a minor injury.\nDecember 8, 2005 – Flight 1248: A Boeing 737-700 (registration N471WN) overran the runway during landing at Chicago Midway International Airport in Illinois during heavy snow, striking several cars on a nearby street and killing a six-year-old boy. Several passengers and people on the ground were injured. One person on the ground was killed, nine others were seriously injured, and three people on board sustained minor injuries.\nJuly 13, 2009 – Flight 2294: A Boeing 737-300 (registration N387SW) operating from Nashville International Airport to Baltimore/Washington International Airport diverted to Yeager Airport in Charleston, West Virginia, after a hole formed in the fuselage near the tail, causing cabin depressurization. The aircraft landed safely and was later repaired. No injuries were reported. Following the incident, Boeing issued a service bulletin recommending additional inspections to detect potential cracking in this area of the fuselage skin. The U.S. Federal Aviation Administration (FAA) subsequently issued an airworthiness directive mandating these inspections for all Boeing 737 Classic aircraft.\nApril 1, 2011 – Flight 812: A Boeing 737-300 (registration N632SW) diverted to Yuma International Airport after a hole appeared in the fuselage while en route from Phoenix Sky Harbor International Airport to Sacramento International Airport. The aircraft landed safely. Two passengers sustained minor injuries. The incident was similar to Flight 2294 and prompted the FAA to issue a second airworthiness directive requiring more frequent inspections.\nJuly 22, 2013 – Flight 345: A Boeing 737-700 (registration N753SW) suffered a hard landing at New York's LaGuardia Airport after a flight from Nashville International Airport. The nose gear collapsed and penetrated the electronics bay, causing the aircraft to slide off the runway. The captain was dismissed, and the aircraft was scrapped. Ten passengers sustained minor injuries.\nAugust 4, 2016 – Flight 149: A Boeing 737-300 (registration N368SW) suffered a nose gear collapse during pushback at Baltimore/Washington International Airport after a tug operator exceeded safe towing speed. The aircraft sustained severe damage and was written off. No one was injured.\nAugust 27, 2016 – Flight 3472: A Boeing 737-700 (registration N766SW) suffered an uncontained engine failure while en route from New Orleans to Orlando, damaging the engine nacelle and fuselage. The aircraft diverted safely to Pensacola International Airport. No one was injured.\nApril 17, 2018 – Southwest Airlines Flight 1380: A Boeing 737-700 (registration N772SW) suffered an uncontained engine failure while en route from New York–LaGuardia to Dallas, causing debris to shatter a window. Cabin depressurization partially ejected a passenger, who later died from her injuries. Eight other passengers sustained minor injuries.\n\nControversies and passenger incidents\nIn October 2019, a Southwest flight attendant filed a lawsuit against the airline, claiming that two pilots had livestreamed footage from a camera hidden in the plane's toilet to an iPad, and that one of the pilots said that such cameras were a \"top-secret security measure\" installed in all of the airline's 737-800 aircraft. Southwest and the pilot union stated that the film was a hoax and a \"poor attempt at humor\" by one of the pilots, who had previously recorded himself on a different aircraft, fully clothed.\nIn February 2020, a report conducted by the DOT inspector general found that Southwest was flying airplanes with safety concerns and that the Federal Aviation Administration was failing to properly oversee the airline.\nCiting four whistleblowers, federal investigators with the US Office of Special Counsel released a report on July 27, 2022, that follows up on the 2020 DOT inspector general's report. The 2022 report claims that Southwest stonewalled Federal Aviation Administration (FAA) investigations into maintenance and piloting safety lapses, and criticized the FAA for failing to adequately oversee the airline, stating that senior FAA staff \"mismanaged and interfered\" with investigations \"in the face of SWA's intimidation tactics\". The report accuses Southwest of misusing the FAA's Aviation Safety Action Program (ASAP) to hide pilot errors, while accusing the FAA of failing to adequately oversee Southwest's mechanics, and of failing to adequately vet maintenance records provided by the airline for forty-nine 737 aircraft purchased from foreign carriers whose documentation practices did not meet FAA standards.\n\nDecember 2022 holiday meltdown\nThe airline experienced severe delays and thousands of flight cancellations starting on December 21, 2022, and continuing through the Christmas holiday. While many cancellations were due to bad weather from the severe late December winter storm across much of the United States, industry experts and SWAPA also blamed inadequate staffing and the airline's \"outdated\" employee scheduling system, citing reports of pilots waiting on hold on the telephone for up to eight hours awaiting work assignments. On December 26, the airline initiated a massive system \"reset\", preemptively canceling thousands of flights and halting ticket sales over concerns that travelers might buy tickets for flights that were subsequently canceled. Federal officials criticized the airline and US Department of Transportation (USDOT) Secretary Pete Buttigieg announced a formal investigation. Some experts attributed the crisis to the lack of scheduling flexibility inherent in the airline's point-to-point operations model. Paul Krugman in The New York Times suggested the turmoil was not as much about corporate greed as some might expect and noted that despite an increasingly digitalized world, \"there's a lot of physical action, and real-world labor, going on behind the scenes.\" Another writer on the paper's opinion pages, Elizabeth Spiers, said this was an example of the airlines knowing they are offering passengers a poor deal but that many people have little choice given the alternatives. In December 2023, the airline reached a settlement and received a record-setting $140 million fine from the USDOT, the largest fine ever imposed by the agency by a factor of roughly 30, and has reported losses exceeding $1.1 billion stemming from the crisis.\n\nSee also\nAir transportation in the United States\nState Fair Classic, which Southwest Airlines formerly sponsored\nEffect of low-cost airlines on communities\nTransportation in the United States\nNuts!\n\nNotes\nReferences\nExternal links\nOfficial website\nSouthwest Airlines (iflyswa.com) at the Wayback Machine (archive index)\nCorporate media site\nSouthwest Airline Pilots' Association\nSouthwest Airlines Seating Charts on SeatGuru.com\nBusiness data for Southwest Airlines: \nSouthwest Airlines' Yahoo! Finance profile",
  "clean_text": "Southwest Airlines Co., or simply Southwest, is a major low cost airlines of the United States. It is headquartered in the Love Field neighborhood of Dallas, Texas. It is the fourth-largest airline in North America when measured by passengers carried, as of 2023. With its all-Boeing 737 fleet, Southwest serves over 100 destinations in 42 states, Washington, D.C., Puerto Rico, and ten other countries near the southern United States in the Gulf of Mexico and Caribbean Sea regions: Aruba, the Bahamas, Belize, the Cayman Islands, Costa Rica, Cuba, the Dominican Republic, Mexico, Jamaica, and Turks and Caicos. The airline was established on March 9, 1967, by Herb Kelleher and Rollin King as Air Southwest Co. and adopted its current name, Southwest Airlines Co., in 1971, when it began operating as an intrastate airline wholly within the state of Texas, first flying between Dallas, Houston, and San Antonio. It began regional interstate service in 1979, expanding nationwide in the following decades. History Network Southwest uses a point-to-point system combined with a rolling-hub model in its base cities, in contrast to the hub-and-spoke system of other major airlines. As of January 2024, Southwest Airlines flies to over 100 destinations in 42 states, Puerto Rico, Mexico, Central America, and the Caribbean. This system means that the airline has no real hubs, but rather some airports with more destinations than others. Interline agreements Southwest currently has interline agreements with Icelandair , Taiwan's China Airlines , EVA Air. and Philippine Airlines. Fleet Passenger experience Southwest Airlines solely offers economy class seating and does not have business class or first class cabins on its aircraft. Southwest offers free snacks and non-alcoholic beverages inflight and offers alcoholic beverages for sale for $7–9 per beverage. Free alcoholic drinks are offered to passengers on some holidays such as Valentine's Day and Halloween. Southwest has become known for colorful boarding announcements and crews who sometimes burst out in song. Southwest currently has an open seating policy, scheduled to end on January 26, 2026, and uses a unique boarding process. Passengers are given a group letter (A, B or C) and a number (1 through 60). Passengers lineup in numerical order within each letter group and choose any open seat on the aircraft. A 2012 study on the television series MythBusters, found this to be the fastest method currently in use for passengers to board a plane; on average, it is 10 minutes faster than the standard method. Southwest has a \"customer of size\" policy in which the cost of a second seat is refunded for any plus-sized travelers who take up more room than one seat. On May 1, 2025, Southwest introduced the first aircraft with new extra-legroom seating as part of a phased update to its cabin layout. These seats will be installed in the first five rows and near exit doors on retrofitted Boeing 737-800 and MAX 8 aircraft. During the initial rollout, the seats will be available at no additional cost as the airline continues to operate under an open seating policy. The airline plans to complete these upgrades before operating flights with assigned seats on January 27, 2026. In-flight entertainment As of December 2024, Southwest offers free streaming of live television, movies, music, in-app messaging (iMessage and WhatsApp), and real-time flight tracking. Full Internet access is available for an $8 fee for most passengers but is free for Business Select and A-List Preferred passengers. As of March 9, 2023, Southwest began upgrading Wi-Fi hardware on its existing aircraft equipped with Anuvu Wi-Fi and began rolling out Viasat Wi-Fi on all new deliveries. Rapid Rewards Southwest first began to offer a frequent-flyer program on June 18, 1987, calling it The Company Club. The program credited for trips flown regardless of distance. Southwest Airlines renamed its frequent-flyer program Rapid Rewards on April 25, 1996. The original Rapid Rewards program offered one credit per one-way flight from an origin to a destination, including any stops or connections on Southwest Airlines. When 16 credits were accumulated in a 24-month period, Southwest awarded one free round-trip ticket that was valid for 12 months. On March 1, 2011, Rapid Rewards changed to a points system based on ticket cost. Members earn and redeem points based on a four-tier fare scale multiplier and the cost of the ticket. Changes also included no blackout dates, seat restrictions, or expiring credits. Since October 18, 2019, Rapid Rewards points do not expire as long as the member is alive. It also adds more options to use points. Corporate affairs Business trends The key trends for Southwest Airlines are (as of the end of the calendar year): Headquarters The Southwest Airlines headquarters are located on the grounds of Dallas Love Field in Dallas. On September 17, 2012, Southwest broke ground on a new Training and Operational Support building, across the street from its current headquarters building. On June 2, 2016, Southwest broke ground on its new office and training facility known as Wings. The newest addition to the corporate campus is composed of a 420,000-square-foot, six-story office building, and a 380,000-square-foot adjoining structure called the Leadership Education and Aircrew Development (LEAD) Center that serves as the new pilot training facility. The LEAD Center has the capacity to house and support 18 flight simulators. It is designed to be expanded to accommodate up to 26 simulator bays. The building opened on April 3, 2018. On August 16, 2019, Southwest announced an expansion of the LEAD Center to accommodate eight additional simulators for future operational and training demands. On January 2, 2020, it was announced that Southwest would be purchasing an additional 3 acres (1.2 ha) of land adjacent to its Wings and LEAD facilities. No additional details were disclosed. Employment As of January 30, 2025, Southwest Airlines had 72,450 active full-time equivalent employees. According to The Washington Post, it uses the hiring motto of seeking people that have a \"Servant's Heart, Warrior Spirit, Fun-LUVing Attitude\". It also uses the internal practice of ranking \"employees first, customers second\". Southwest Airlines pilots are represented by the Southwest Airlines Pilot Association union. Bob Jordan became Southwest's sixth CEO on February 1, 2022, replacing Gary C. Kelly. Kelly continues as chairman of Southwest Airlines. Kelly replaced Jim Parker on July 15, 2004, and assumed the title of president on July 15, 2008, replacing former president Colleen Barrett. In September 2024, in response to pressure from Elliott Investment Management, Kelly announced that he would not seek reelection as executive chairman in 2025. Jordan is expected to remain as CEO.On October 24, 2024, Kelly announced he will accelerate his retirement, which – along with the previously announced retirements of six other Southwest Directors – will go into effect on November 1, 2024. Rakesh Gangwal was announced as independent Chair of the Board of Directors three days later. Gangwal stepped down as Chair on August 1, 2025, and Doug Brooks was announced as the new independent Chair of the Board. About 83% of Southwest employees are members of a union. The Southwest Airline Pilots' Association, a union not affiliated with the Air Line Pilots Association, represents the airline's pilots. The aircraft maintenance technicians are represented by the Aircraft Mechanics Fraternal Association. Customer service agents and reservation agents are represented by the International Association of Machinists and Aerospace Workers Union. Flight dispatchers, flight attendants, ramp agents, and operations agents are represented by the Transport Workers Union. The company has appeared on various \"best places to work\" list, with its employee culture mentioned by Travel and Leisure, CNBC, and Forbes. The company has also been named to Fortune magazine's \"Most Admired Companies\" list, reaching number 14 in 2021. Southwest has never furloughed an employee. As a result of the COVID-19 pandemic, the company launched voluntary separation and extended time-off programs in 2020, and around 16,900 employees volunteered to take an early retirement or long-term leave. Roughly 24% were pilots and 33% were flight attendants. In late 2020, the airline issued some WARN Act notices and announced incipient pay cuts for many employees in response to pandemic impacts, but these measures were rescinded after the Consolidated Appropriations Act, 2021 was enacted on December 27, 2020, providing additional financial aid to US airlines. The latest five year labor contract for Southwest Airlines pilots was approved in January 2024. Following a board takeover in February 2025 Southwest laid off 1750 of its non-contract staff, approximately 15% of its corporate workforce. Impact on carriers Southwest and its business model have had an influence on other low-cost carriers (LCC's). The competitive strategy combines a high level of employee and aircraft productivity with low unit costs by reducing aircraft turnaround time, particularly at the gate. Europe's EasyJet and Ryanair are two of the best-known airlines to follow Southwest's business strategy in that continent. Other airlines with a business model based on Southwest's system include Canada's WestJet, Malaysia's AirAsia (the first and biggest LCC in Asia), India's IndiGo, Australia's Jetstar, a subsidiary of Qantas (although Jetstar now operates three aircraft types), Philippines' Cebu Pacific, Thailand's Nok Air, Mexico's Volaris, Indonesia's Lion Air and Turkey's Pegasus Airlines. Lobbying against high-speed rail In the early 1990s, Southwest Airlines actively opposed proposals to develop high-speed rail in Texas, viewing the project as a competitor to its short-haul flights. The proposed rail system would have connected Dallas, San Antonio, and Houston. Southwest lobbied both the United States Congress and the Texas Legislature, and filed multiple lawsuits aimed at halting the initiative. In a 1991 statement to Texas officials, the airline argued that high-speed rail would only be feasible if it displaced existing airline services and received substantial public subsidies. The project was cancelled in 1994 with many observers citing Southwest’s lobbying efforts as a significant factor in its failure. Advertising The company has always employed humor in its advertising. Former slogans include \"Love Is Still Our Field\", \"Just Plane Smart\", \"The Somebody Else Up There Who Loves You\", \"You're Now Free to Move About the Country\", \"THE Low Fare Airline\", \"Grab your bag, It's On!\", and \"Welcome Aboard\". The airline's slogan (as of 2022) is \"Low fares. Nothing to hide. That's TransFarency!\" In March 1992, shortly after Southwest started using the \"Just Plane Smart\" motto, Stevens Aviation, which had been using \"Plane Smart\" for its motto, advised Southwest that it was infringing on its trademark. Instead of a lawsuit, the CEOs for both companies staged an arm-wrestling match, dubbed as \"Malice in Dallas\". It was held at the now-demolished Dallas Sportatorium and set for two out of three rounds, the loser of each round was to pay $5,000 to the charity of his choice, with the winner gaining the use of the trademarked phrase. A promotional video was created showing the CEOs \"training\" for the bout (with CEO Herb Kelleher being helped up during a sit-up where a cigarette and glass of Wild Turkey 101 whiskey was waiting) and distributed among the employees and also as a video press release along with the video of the match itself. Herb Kelleher lost the match for Southwest, with Stevens Aviation winning the rights to the phrase. Kurt Herwald, CEO of Stevens Aviation, immediately granted the use of \"Just Plane Smart\" to Southwest Airlines. The net result was both companies having use of the trademark. Accidents and incidents Southwest Airlines has been involved in 11 accidents, including three aircraft hull losses and four fatalities: one accidental passenger death in flight, two non-passenger deaths on the ground, and one passenger who died from injuries sustained after being restrained by others while attempting to enter the cockpit. No passenger has died as a result of a crash. March 5, 2000 – Flight 1455: A Boeing 737-300 (registration N668SW) overran the runway upon landing at Burbank Airport in California, injuring 44 people. The captain was later dismissed, and the aircraft was damaged beyond repair. Two people were seriously injured, and 42 had minor injuries. August 11, 2000 – Flight 1763: A Boeing 737-700 (registration N798SW) en route from Las Vegas, Nevada, to Salt Lake City, Utah, experienced an air rage incident in which a passenger attempted to storm the cockpit. He was restrained by other passengers but died of asphyxiation during the struggle. One other passenger sustained a minor injury. December 8, 2005 – Flight 1248: A Boeing 737-700 (registration N471WN) overran the runway during landing at Chicago Midway International Airport in Illinois during heavy snow, striking several cars on a nearby street and killing a six-year-old boy. Several passengers and people on the ground were injured. One person on the ground was killed, nine others were seriously injured, and three people on board sustained minor injuries. July 13, 2009 – Flight 2294: A Boeing 737-300 (registration N387SW) operating from Nashville International Airport to Baltimore/Washington International Airport diverted to Yeager Airport in Charleston, West Virginia, after a hole formed in the fuselage near the tail, causing cabin depressurization. The aircraft landed safely and was later repaired. No injuries were reported. Following the incident, Boeing issued a service bulletin recommending additional inspections to detect potential cracking in this area of the fuselage skin. The U.S. Federal Aviation Administration (FAA) subsequently issued an airworthiness directive mandating these inspections for all Boeing 737 Classic aircraft. April 1, 2011 – Flight 812: A Boeing 737-300 (registration N632SW) diverted to Yuma International Airport after a hole appeared in the fuselage while en route from Phoenix Sky Harbor International Airport to Sacramento International Airport. The aircraft landed safely. Two passengers sustained minor injuries. The incident was similar to Flight 2294 and prompted the FAA to issue a second airworthiness directive requiring more frequent inspections. July 22, 2013 – Flight 345: A Boeing 737-700 (registration N753SW) suffered a hard landing at New York's LaGuardia Airport after a flight from Nashville International Airport. The nose gear collapsed and penetrated the electronics bay, causing the aircraft to slide off the runway. The captain was dismissed, and the aircraft was scrapped. Ten passengers sustained minor injuries. August 4, 2016 – Flight 149: A Boeing 737-300 (registration N368SW) suffered a nose gear collapse during pushback at Baltimore/Washington International Airport after a tug operator exceeded safe towing speed. The aircraft sustained severe damage and was written off. No one was injured. August 27, 2016 – Flight 3472: A Boeing 737-700 (registration N766SW) suffered an uncontained engine failure while en route from New Orleans to Orlando, damaging the engine nacelle and fuselage. The aircraft diverted safely to Pensacola International Airport. No one was injured. April 17, 2018 – Southwest Airlines Flight 1380: A Boeing 737-700 (registration N772SW) suffered an uncontained engine failure while en route from New York–LaGuardia to Dallas, causing debris to shatter a window. Cabin depressurization partially ejected a passenger, who later died from her injuries. Eight other passengers sustained minor injuries. Controversies and passenger incidents In October 2019, a Southwest flight attendant filed a lawsuit against the airline, claiming that two pilots had livestreamed footage from a camera hidden in the plane's toilet to an iPad, and that one of the pilots said that such cameras were a \"top-secret security measure\" installed in all of the airline's 737-800 aircraft. Southwest and the pilot union stated that the film was a hoax and a \"poor attempt at humor\" by one of the pilots, who had previously recorded himself on a different aircraft, fully clothed. In February 2020, a report conducted by the DOT inspector general found that Southwest was flying airplanes with safety concerns and that the Federal Aviation Administration was failing to properly oversee the airline. Citing four whistleblowers, federal investigators with the US Office of Special Counsel released a report on July 27, 2022, that follows up on the 2020 DOT inspector general's report. The 2022 report claims that Southwest stonewalled Federal Aviation Administration (FAA) investigations into maintenance and piloting safety lapses, and criticized the FAA for failing to adequately oversee the airline, stating that senior FAA staff \"mismanaged and interfered\" with investigations \"in the face of SWA's intimidation tactics\". The report accuses Southwest of misusing the FAA's Aviation Safety Action Program (ASAP) to hide pilot errors, while accusing the FAA of failing to adequately oversee Southwest's mechanics, and of failing to adequately vet maintenance records provided by the airline for forty-nine 737 aircraft purchased from foreign carriers whose documentation practices did not meet FAA standards. December 2022 holiday meltdown The airline experienced severe delays and thousands of flight cancellations starting on December 21, 2022, and continuing through the Christmas holiday. While many cancellations were due to bad weather from the severe late December winter storm across much of the United States, industry experts and SWAPA also blamed inadequate staffing and the airline's \"outdated\" employee scheduling system, citing reports of pilots waiting on hold on the telephone for up to eight hours awaiting work assignments. On December 26, the airline initiated a massive system \"reset\", preemptively canceling thousands of flights and halting ticket sales over concerns that travelers might buy tickets for flights that were subsequently canceled. Federal officials criticized the airline and US Department of Transportation (USDOT) Secretary Pete Buttigieg announced a formal investigation. Some experts attributed the crisis to the lack of scheduling flexibility inherent in the airline's point-to-point operations model. Paul Krugman in The New York Times suggested the turmoil was not as much about corporate greed as some might expect and noted that despite an increasingly digitalized world, \"there's a lot of physical action, and real-world labor, going on behind the scenes.\" Another writer on the paper's opinion pages, Elizabeth Spiers, said this was an example of the airlines knowing they are offering passengers a poor deal but that many people have little choice given the alternatives. In December 2023, the airline reached a settlement and received a record-setting $140 million fine from the USDOT, the largest fine ever imposed by the agency by a factor of roughly 30, and has reported losses exceeding $1.1 billion stemming from the crisis."
}