{
  "ticker": "LVS",
  "cik": "0001300514",
  "company_name": "Las Vegas Sands",
  "corrected_name": "Las Vegas Sands",
  "wiki_title_used": "Las Vegas Sands",
  "exists": true,
  "raw_text": "Las Vegas Sands Corp. is an American casino and resort company with corporate headquarters in Las Vegas, Nevada. It was founded by Sheldon G. Adelson and his partners out of the Sands Hotel and Casino on the Las Vegas Strip. The Sands was demolished and redeveloped as The Venetian, opening in 1999. An adjacent resort, The Palazzo, opened in 2007. Both resorts were sold in 2022.\nThe company holds several resorts in Asia, including Marina Bay Sands in Singapore, which opened in 2010. Through its majority-owned subsidiary Sands China, the company owns several properties in Macau, including Sands Macao, The Londoner Macao, The Venetian Macao, and The Parisian Macao. As of 2020, it is the third-largest casino company worldwide by revenue.\n\nHistory\nDevelopment on the Las Vegas Strip\nEntrepreneur Sheldon G. Adelson and his partners Richard Katzeff, Irwin Chafetz, Ted Cutler, and Jordan Shapiro bought the Sands Hotel and Casino in 1989.  Adelson and his partners financed their venture with investments in personal computers and trade shows, founding the computer trade show COMDEX in 1979. They opened the 1.2 million square foot Sands Expo and Convention Center, then the largest privately owned convention facility in the world, across from the hotel in 1990.\nThe Sands Hotel was unable to compete with newer resorts on the Las Vegas Strip and was demolished to make room for The Venetian. Construction of the Venetian began in 1997, funded by Adelson's sale of COMDEX. Modeled on Venice, Italy, it joined the ranks of themed hotels such as Excalibur, New York-New York, and Paris Las Vegas on the Las Vegas Strip. In 2004, Las Vegas Sands, Inc. went public, and its name was changed to the Las Vegas Sands Corp.\nConstruction on The Palazzo began in 2005. The Palazzo and The Venetian make up the world's largest hotel under one roof, at 7,000 all-suite rooms and 17 million square feet. The 43-story unfinished condominium skyscraper St. Regis Residences at the Venetian Palazzo is on the same campus. Construction halted in 2008 due to company financial issues.\nThe 2008 financial crisis forced Adelson to invest $1 billion of his own capital to keep the Las Vegas Sands in business, much of which the company spent developing event spaces and high-end retail stores in their properties By 2011, the Las Vegas Sands Corp.'s main profits came from renting convention space.\n\nExpansion into Asia\nThe company soon recognized new commercial opportunities in Asia, specifically in Macau, the only Special Administrative Region of China where gambling is legal. Las Vegas Sands Corp., along with Wynn Resorts and Galaxy Entertainment Group, was one of the first to be granted a casino operating concession. Sands Macao resort, Macau's first American-operated casino, opened in 2004.\nLas Vegas Sands Corp.'s future Macau properties were largely in Cotai, a district of reclaimed land created through public works projects and designated for hotels and casinos. The Venetian Macao, the second-largest in the world at 550,000 square feet, opened in 2007.\nIn 2008, Las Vegas Sands opened a Four Seasons hotel adjacent to the Venetian Macao. It was followed by The Londoner Macao, originally branded Sands Cotai Central, and The Parisian Macao.\nDevelopment plans proceeded in 2010 for Marina Bay Sands resort in Singapore, at $5.6 billion the most expensive hotel and casino ever built.  The resort was designed by Israeli-Canadian architect Moshe Safdie and is composed of three 57-story towers connected at the top by a 3-acre SkyPark(R). The integrated resort was the second built in Singapore after Resorts World Sentosa. Eight months after opening, Marina Bay Sands set a record for posting a $600 million operating profit.\nIn September 2012, the Las Vegas Sands Corp. announced that Madrid had been chosen as destination for a casino resort project dubbed EuroVegas in an attempt to expand outside of Asia. In February 2013, the company named the town of Alcorcón, on the outskirts of Madrid, as the site for the EuroVegas project. Plans included six casinos, twelve hotels, a convention center, three golf courses, shopping centers, bars, and restaurants, and was expected to take 10 years to build. In December 2013 the EuroVegas project was officially canceled.\n\nRecent history\nIn 2015, the Las Vegas Sands Corp. and California-based co-developer California-based Majestic Realty Co. proposed a $1.2 billion 65,000-seat stadium located near The Strip for the Oakland Raiders football team. The proposal required $420 million from private investors and $780 million in public funding, primarily from tourism. Despite Las Vegas Sands withdrawing from the project, the Raiders eventually moved into the stadium after relocating from Oakland.\nThe company's 2018 annual report anticipated \"a significant and adverse effect\" from the \"proliferation of gaming venues, particularly in Southeast Asia.\"\nIn May 2019, the company sold Sands Bethlehem to the Poarch Band of Creek Indians for $1.3 billion, and it was renamed Wind Creek Bethlehem.\nLas Vegas Sands was one of multiple bidders trying to open a commercial casino in Downstate New York. Las Vegas Sands had proposed building Sands New York, an integrated resort at the Nassau Coliseum site in Uniondale, New York, but withdrew their bid in April of 2025 due to the threat of New York legalizing online gambling. In the event that the state of Texas legalizes casinos, Las Vegas Sands hopes to build an integrated resort in Irving at the former site of Texas Stadium. Following backlash towards the project, Sands withdrew the casino component of the project. Las Vegas Sands confirmed that they are interested in developing an integrated resort in Thailand following the withdrawal of the Entertainment Complex Bill but stated that Thailand needed a clear framework if they were to legalize gambling.\nIn July 2025, Las Vegas Sands broke ground on an expansion of the Marina Bay Sands in Singapore which will be completed by 2031. The expansion will include a separate fourth hotel tower, an arena and added convention space.\n\nFinances\nThe COVID-19 pandemic negatively impacted the company's finances with a 97.1% decrease in revenue and a second-quarter fiscal loss of $985 million. In March 2021, two months after Sheldon G. Adelson's death, the company announced the sale of its Las Vegas properties to Vici Properties and its operations to Apollo Global Management. The sale was finalized in February 2022.\nAs of 2021, the Las Vegas Sands Corp. is headed by CEO Robert Glen Goldstein, and reported a 2020 annual revenue of $3.61 billion.\n\nPolitical contributions\nAccording to OpenSecrets, Las Vegas Sands donated $52.9 million to Republican candidates as the largest single contributor to federal campaigns during the 2012 election cycle. By comparison, Adelson Drug Clinic was the second-largest solely Republican contributor during the 2012 election cycle with $42.1 million donated. Since 1992, Las Vegas Sands has contributed $70.5 million to federal campaigns; since 1999 the company has spent $5.4 million on lobbying.\nMiriam Adelson has been one of Donald Trump's top donors during all three of his presidential campaigns. Adelson has also provided financial support to the Zionist Organization of America, the Yad Vashem Holocaust museum and memorial in Jerusalem, and multiple U.S. groups that fundraise for the Israeli military.\nLas Vegas Sands has actively been lobbying in Texas to get the state to legalize commercial casinos.\n\nInitiatives\nLas Vegas Sands has their own sustainability initiative roadmap called Sands ECO360, centered on identifying eco-friendly processes surrounding building development, resort management, and events.\nOne of the company's initiatives encourages resort staff to report possible water- or energy-conservation concerns.\nTwo buildings in Singapore are LEED certified, and several in Macau have received awards for Energy Saving Activities.\n\nProperties\nLas Vegas Sands holds integrated resorts in Asia including Marina Bay Sands in Singapore and through its majority-owned subsidiary Sands China Ltd. (SCL) owns several integrated resorts in Macao including The Venetian Macao, Sands Macao, The Plaza Macao and Four Seasons Hotel, The Londoner Macao and The Parisian Macao.\n\nCurrent properties\nFormer properties\nOwnership and stock\nDecember 2004: Las Vegas Sands completed its initial public offering with the ticker LVS on the New York Stock Exchange at a price of $29 per share. 6.8% of the company was put on the market.  Adelson maintained 87.9% ownership of the company; management and directors owned the remaining 5.3%.\nOctober 2007: the company's market capitalization peaked at $52 billion at $144.56 a share.\nSeptember 2008: Las Vegas Sands' stock plummeted to $36.11, prompting Adelson and his wife, Dr. Miriam Adelson, to invest $475 million in the company through a 6.5% convertible note in 2013.\nNovember 2008: The Adelson family again invested $525 million in Las Vegas Sands, with the company raising an additional $1 billion in a secondary offering. The Adelsons also purchased 5.25 million shares of preferred stock as well as warrants to purchase 87.5 million shares of common stock at an exercise price of $6 each.\nMarch 2009: market capitalization sinks to approximately $1 billion at less than $2 a share due to general market declines and concern for the short-term financial health of the gambling industry.\nNovember 2009: Las Vegas Sands completed an initial public offering of its subsidiary Sands China Ltd., which owns and operates its Macau properties. The company raised a total of $3.3 billion in equity capital by selling a 29% interest in Sands China Ltd.\n2012: CEO Sheldon G. Adelson and his family owned approximately 53% of the company.\n\nAircraft\nLas Vegas Sands operates private aircraft used primarily for charter transportation of executive directors and VIP guests of its properties. The Las Vegas Sands fleet is leased for charter purposes by Tradenda Capital AG (Lichtenstein), whose portfolio of companies includes Sands Aviation LLC and Interface Aviation LLC, the latter of which handles the personal affairs of the Adelson family. All operational Las Vegas Sands aircraft are based in Las Vegas at Harry Reid International Airport. The fleet includes the following aircraft (as of May 2025):\n\nGallery\nAlleged anti-bribery violations\nIn March 2013, the New York Times reported that the Las Vegas Sands Corp. had informed the U.S. Securities and Exchange Commission that the company likely violated federal law against the bribery of foreign officials. The Company disputed these reports, stating in a press release:The company did not report any violations of the anti-bribery provisions of the FCPA, and it said news reports stating otherwise, such as the headline in today's New York Times which described the matter by saying 'Casino Says it Likely Cheated,' are both inflammatory and defamatory...in [the Company's] preliminary findings the company's Audit Committee had advised that there were 'likely violations' of the books and records and internal controls provisions (i.e. 'accounting provisions') of the FCPA. A potential violation of the accounting provisions could range anywhere from a single transaction recorded incorrectly to other errors in the accounting records. The company said it will vigorously defend itself against that type of uninformed and misleading reporting.\n\nLegal issues\nOn May 31, 2016, Sands reached a financial settlement with former Sands China president Steve Jacobs, who sued the company in 2010 for breach of contract and wrongful termination. Terms of the settlement were not disclosed, but the Wall Street Journal reported that the company paid Jacobs more than $75 million. Jacobs had claimed he was dismissed for \"blowing the whistle on improprieties\" in Macau, including Jacobs' allegations that Adelson had instructed him to investigate senior Macau officials' potentially damaging financial and business information to use as leverage in future regulatory discussions. Adelson denied these allegations, characterizing Jacobs as a disgruntled ex-employee.\nOn March 14, 2019, Sands reached a financial settlement with Hong Kong businessman Richard Suen for an undisclosed amount after having sued Las Vegas Sands for the third time, arguing he was owed $347 million by the Company, who countered with $3.76 million. Terms of the settlement were not disclosed, but Sands attorney Richard Sauber said the parties had reached an \"amicable settlement and resolution.\" Suen had successfully sued Sands twice in 2004 with the claim that he had been promised a $5 million success fee and 2% of Sands' profits from its operations in Macau in exchange for helping to obtain a Macau casino concession. The trials resulted in awards of $44 million and $70 million, respectively.\nIn June 2021, the Company was sued in a Macau court by Asian American Entertainment Corporation, who alleged entitlement to $70 million in Las Vegas Sands' profits in Macau as the company began operating there in 2002.\nPrior to the November 2022 elections, Las Vegas Sands conducted a petition drive in Florida, spending $49.5 million to amend the State's Constitution to expand casino gambling. The state of Florida is investigating evidence of potentially fraudulent signatures collected during this event.\n\nSee also\nList of integrated resorts\nList of casino hotels\n Nevada portal\n\nReferences\nExternal links\nOfficial website\nBusiness data for Las Vegas Sands Corp.:",
  "clean_text": "Las Vegas Sands Corp. is an American casino and resort company with corporate headquarters in Las Vegas, Nevada. It was founded by Sheldon G. Adelson and his partners out of the Sands Hotel and Casino on the Las Vegas Strip. The Sands was demolished and redeveloped as The Venetian, opening in 1999. An adjacent resort, The Palazzo, opened in 2007. Both resorts were sold in 2022. The company holds several resorts in Asia, including Marina Bay Sands in Singapore, which opened in 2010. Through its majority-owned subsidiary Sands China, the company owns several properties in Macau, including Sands Macao, The Londoner Macao, The Venetian Macao, and The Parisian Macao. As of 2020, it is the third-largest casino company worldwide by revenue. History Development on the Las Vegas Strip Entrepreneur Sheldon G. Adelson and his partners Richard Katzeff, Irwin Chafetz, Ted Cutler, and Jordan Shapiro bought the Sands Hotel and Casino in 1989. Adelson and his partners financed their venture with investments in personal computers and trade shows, founding the computer trade show COMDEX in 1979. They opened the 1.2 million square foot Sands Expo and Convention Center, then the largest privately owned convention facility in the world, across from the hotel in 1990. The Sands Hotel was unable to compete with newer resorts on the Las Vegas Strip and was demolished to make room for The Venetian. Construction of the Venetian began in 1997, funded by Adelson's sale of COMDEX. Modeled on Venice, Italy, it joined the ranks of themed hotels such as Excalibur, New York-New York, and Paris Las Vegas on the Las Vegas Strip. In 2004, Las Vegas Sands, Inc. went public, and its name was changed to the Las Vegas Sands Corp. Construction on The Palazzo began in 2005. The Palazzo and The Venetian make up the world's largest hotel under one roof, at 7,000 all-suite rooms and 17 million square feet. The 43-story unfinished condominium skyscraper St. Regis Residences at the Venetian Palazzo is on the same campus. Construction halted in 2008 due to company financial issues. The 2008 financial crisis forced Adelson to invest $1 billion of his own capital to keep the Las Vegas Sands in business, much of which the company spent developing event spaces and high-end retail stores in their properties By 2011, the Las Vegas Sands Corp.'s main profits came from renting convention space. Expansion into Asia The company soon recognized new commercial opportunities in Asia, specifically in Macau, the only Special Administrative Region of China where gambling is legal. Las Vegas Sands Corp., along with Wynn Resorts and Galaxy Entertainment Group, was one of the first to be granted a casino operating concession. Sands Macao resort, Macau's first American-operated casino, opened in 2004. Las Vegas Sands Corp.'s future Macau properties were largely in Cotai, a district of reclaimed land created through public works projects and designated for hotels and casinos. The Venetian Macao, the second-largest in the world at 550,000 square feet, opened in 2007. In 2008, Las Vegas Sands opened a Four Seasons hotel adjacent to the Venetian Macao. It was followed by The Londoner Macao, originally branded Sands Cotai Central, and The Parisian Macao. Development plans proceeded in 2010 for Marina Bay Sands resort in Singapore, at $5.6 billion the most expensive hotel and casino ever built. The resort was designed by Israeli-Canadian architect Moshe Safdie and is composed of three 57-story towers connected at the top by a 3-acre SkyPark(R). The integrated resort was the second built in Singapore after Resorts World Sentosa. Eight months after opening, Marina Bay Sands set a record for posting a $600 million operating profit. In September 2012, the Las Vegas Sands Corp. announced that Madrid had been chosen as destination for a casino resort project dubbed EuroVegas in an attempt to expand outside of Asia. In February 2013, the company named the town of Alcorcón, on the outskirts of Madrid, as the site for the EuroVegas project. Plans included six casinos, twelve hotels, a convention center, three golf courses, shopping centers, bars, and restaurants, and was expected to take 10 years to build. In December 2013 the EuroVegas project was officially canceled. Recent history In 2015, the Las Vegas Sands Corp. and California-based co-developer California-based Majestic Realty Co. proposed a $1.2 billion 65,000-seat stadium located near The Strip for the Oakland Raiders football team. The proposal required $420 million from private investors and $780 million in public funding, primarily from tourism. Despite Las Vegas Sands withdrawing from the project, the Raiders eventually moved into the stadium after relocating from Oakland. The company's 2018 annual report anticipated \"a significant and adverse effect\" from the \"proliferation of gaming venues, particularly in Southeast Asia.\" In May 2019, the company sold Sands Bethlehem to the Poarch Band of Creek Indians for $1.3 billion, and it was renamed Wind Creek Bethlehem. Las Vegas Sands was one of multiple bidders trying to open a commercial casino in Downstate New York. Las Vegas Sands had proposed building Sands New York, an integrated resort at the Nassau Coliseum site in Uniondale, New York, but withdrew their bid in April of 2025 due to the threat of New York legalizing online gambling. In the event that the state of Texas legalizes casinos, Las Vegas Sands hopes to build an integrated resort in Irving at the former site of Texas Stadium. Following backlash towards the project, Sands withdrew the casino component of the project. Las Vegas Sands confirmed that they are interested in developing an integrated resort in Thailand following the withdrawal of the Entertainment Complex Bill but stated that Thailand needed a clear framework if they were to legalize gambling. In July 2025, Las Vegas Sands broke ground on an expansion of the Marina Bay Sands in Singapore which will be completed by 2031. The expansion will include a separate fourth hotel tower, an arena and added convention space. Finances The COVID-19 pandemic negatively impacted the company's finances with a 97.1% decrease in revenue and a second-quarter fiscal loss of $985 million. In March 2021, two months after Sheldon G. Adelson's death, the company announced the sale of its Las Vegas properties to Vici Properties and its operations to Apollo Global Management. The sale was finalized in February 2022. As of 2021, the Las Vegas Sands Corp. is headed by CEO Robert Glen Goldstein, and reported a 2020 annual revenue of $3.61 billion. Political contributions According to OpenSecrets, Las Vegas Sands donated $52.9 million to Republican candidates as the largest single contributor to federal campaigns during the 2012 election cycle. By comparison, Adelson Drug Clinic was the second-largest solely Republican contributor during the 2012 election cycle with $42.1 million donated. Since 1992, Las Vegas Sands has contributed $70.5 million to federal campaigns; since 1999 the company has spent $5.4 million on lobbying. Miriam Adelson has been one of Donald Trump's top donors during all three of his presidential campaigns. Adelson has also provided financial support to the Zionist Organization of America, the Yad Vashem Holocaust museum and memorial in Jerusalem, and multiple U.S. groups that fundraise for the Israeli military. Las Vegas Sands has actively been lobbying in Texas to get the state to legalize commercial casinos. Initiatives Las Vegas Sands has their own sustainability initiative roadmap called Sands ECO360, centered on identifying eco-friendly processes surrounding building development, resort management, and events. One of the company's initiatives encourages resort staff to report possible water- or energy-conservation concerns. Two buildings in Singapore are LEED certified, and several in Macau have received awards for Energy Saving Activities. Properties Las Vegas Sands holds integrated resorts in Asia including Marina Bay Sands in Singapore and through its majority-owned subsidiary Sands China Ltd. (SCL) owns several integrated resorts in Macao including The Venetian Macao, Sands Macao, The Plaza Macao and Four Seasons Hotel, The Londoner Macao and The Parisian Macao. Current properties Former properties Ownership and stock December 2004: Las Vegas Sands completed its initial public offering with the ticker LVS on the New York Stock Exchange at a price of $29 per share. 6.8% of the company was put on the market. Adelson maintained 87.9% ownership of the company; management and directors owned the remaining 5.3%. October 2007: the company's market capitalization peaked at $52 billion at $144.56 a share. September 2008: Las Vegas Sands' stock plummeted to $36.11, prompting Adelson and his wife, Dr. Miriam Adelson, to invest $475 million in the company through a 6.5% convertible note in 2013. November 2008: The Adelson family again invested $525 million in Las Vegas Sands, with the company raising an additional $1 billion in a secondary offering. The Adelsons also purchased 5.25 million shares of preferred stock as well as warrants to purchase 87.5 million shares of common stock at an exercise price of $6 each. March 2009: market capitalization sinks to approximately $1 billion at less than $2 a share due to general market declines and concern for the short-term financial health of the gambling industry. November 2009: Las Vegas Sands completed an initial public offering of its subsidiary Sands China Ltd., which owns and operates its Macau properties. The company raised a total of $3.3 billion in equity capital by selling a 29% interest in Sands China Ltd. 2012: CEO Sheldon G. Adelson and his family owned approximately 53% of the company. Aircraft Las Vegas Sands operates private aircraft used primarily for charter transportation of executive directors and VIP guests of its properties. The Las Vegas Sands fleet is leased for charter purposes by Tradenda Capital AG (Lichtenstein), whose portfolio of companies includes Sands Aviation LLC and Interface Aviation LLC, the latter of which handles the personal affairs of the Adelson family. All operational Las Vegas Sands aircraft are based in Las Vegas at Harry Reid International Airport. The fleet includes the following aircraft (as of May 2025): Gallery Alleged anti-bribery violations In March 2013, the New York Times reported that the Las Vegas Sands Corp. had informed the U.S. Securities and Exchange Commission that the company likely violated federal law against the bribery of foreign officials. The Company disputed these reports, stating in a press release:The company did not report any violations of the anti-bribery provisions of the FCPA, and it said news reports stating otherwise, such as the headline in today's New York Times which described the matter by saying 'Casino Says it Likely Cheated,' are both inflammatory and defamatory...in [the Company's] preliminary findings the company's Audit Committee had advised that there were 'likely violations' of the books and records and internal controls provisions (i.e. 'accounting provisions') of the FCPA. A potential violation of the accounting provisions could range anywhere from a single transaction recorded incorrectly to other errors in the accounting records. The company said it will vigorously defend itself against that type of uninformed and misleading reporting. Legal issues On May 31, 2016, Sands reached a financial settlement with former Sands China president Steve Jacobs, who sued the company in 2010 for breach of contract and wrongful termination. Terms of the settlement were not disclosed, but the Wall Street Journal reported that the company paid Jacobs more than $75 million. Jacobs had claimed he was dismissed for \"blowing the whistle on improprieties\" in Macau, including Jacobs' allegations that Adelson had instructed him to investigate senior Macau officials' potentially damaging financial and business information to use as leverage in future regulatory discussions. Adelson denied these allegations, characterizing Jacobs as a disgruntled ex-employee. On March 14, 2019, Sands reached a financial settlement with Hong Kong businessman Richard Suen for an undisclosed amount after having sued Las Vegas Sands for the third time, arguing he was owed $347 million by the Company, who countered with $3.76 million. Terms of the settlement were not disclosed, but Sands attorney Richard Sauber said the parties had reached an \"amicable settlement and resolution.\" Suen had successfully sued Sands twice in 2004 with the claim that he had been promised a $5 million success fee and 2% of Sands' profits from its operations in Macau in exchange for helping to obtain a Macau casino concession. The trials resulted in awards of $44 million and $70 million, respectively. In June 2021, the Company was sued in a Macau court by Asian American Entertainment Corporation, who alleged entitlement to $70 million in Las Vegas Sands' profits in Macau as the company began operating there in 2002. Prior to the November 2022 elections, Las Vegas Sands conducted a petition drive in Florida, spending $49.5 million to amend the State's Constitution to expand casino gambling. The state of Florida is investigating evidence of potentially fraudulent signatures collected during this event."
}