{
  "ticker": "LW",
  "cik": "0001679273",
  "company_name": "Lamb Weston",
  "corrected_name": "Lamb Weston",
  "wiki_title_used": "Lamb Weston",
  "exists": true,
  "raw_text": "Lamb Weston Holdings, Inc. is an American food processing company that is one of the world's largest producers and processors of frozen french fries, waffle fries, and other frozen potato products.  It is headquartered in Eagle, Idaho, a suburb of Boise.\n\nHistory\nThe company was founded in 1950 by Gilbert Lamb in a former co-op plant in Weston, Oregon. In 1988, it was acquired by ConAgra Foods and moved corporate offices from Tigard, Oregon, to Kennewick, Washington. In November 2016, ConAgra spun off the company to its shareholders. In October 2019, Lamb Weston formed the joint venture, Lamb Weston Alimentos Modernos S.A., with Sociedad Comercial del Plata.\nIn September 2022, the Oregon Department of Environmental Quality (DEQ) fined Lamb Weston $127,000 for 90 violations of the company's wastewater discharge permit between 2015 and 2021, which included the company dumping more than 220 tons of excess nitrogen above an already contaminated aquifer. In 2024, Lamb Weston reached a settlement with the DEQ; the company would pay a $143,400 fine as well as evaluate ways to reduce wastewater, conduct soil sampling and monitor well water.\nIn September 2023, it was announced Lamb Weston had acquired the Campbellfield, Victoria-headquartered Australian food manufacturer, Crackerjack Foods. The company will join the Lamb Weston Oceania subsidiary.\nOn November 15, 2024, a class action lawsuit was filed against Lamb Weston along with multiple other companies alleging that they are colluding together to hike prices of potato products in a coordinated way.\n\nSubsidiaries\nLamb Weston Holdings has subsidiaries in Europe, Asia and South America.\n\nCompanies\nChina  - Lamb Weston - Shanghai, two processing plants\nChina -  TaiMei Potato Industry\nEurope - Lamb Weston / Meijer: the former joint venture is now fully owned by Lamb Weston. six processing plants in the Netherlands, United Kingdom and Austria\nUnited States -  Alexia Foods\nCanada  - Lamb Weston Canada ULC\nChile - Unisur Alimentos Ltda\nArgentina -  Lamb Weston Alimentos Modernos S.A.\n\nProcessing plants\nLamb Weston\nAmerican Falls (Idaho)\nBoardman East (Oregon)\nBoardman West (Oregon)\nConnell (Washington)\nDelhi (Louisiana)\nHallam (Australia)\nHermiston (Oregon)\nPasco (Washington)\nPaterson (Washington)\nLamb Weston RDO Frozen - Park Rapids (Minnesota)\nQuincy (Washington)\nRichland (Washington)\nShangdu (China)\nTaber (Canada)\nTwin Falls (Idaho)\nWarden (Washington)\nLamb Weston/Meijer (1994-2022)\nBergen op Zoom (the Netherlands)\nFrisch & Frost, Hollabrunn (Austria)\nKruiningen (the Netherlands)\nBroekhuizenvorst (the Netherlands)\nLipetsk (Russia)\nOosterbierum (the Netherlands)\nWisbech (the United Kingdom)\nIn 2022, Lamb Weston / Meijer sold its Russian plant to local shareholders and later Meijer Beheer B.V. sold his share of ownership to Lamb Weston Holdings Inc.\n\nLamb Weston Alimentos Modernos S.A.\nMunro (Argentina)\n\nReferences\nExternal links\nOfficial website\nBusiness data for Lamb Weston Holdings:",
  "clean_text": "Lamb Weston Holdings, Inc. is an American food processing company that is one of the world's largest producers and processors of frozen french fries, waffle fries, and other frozen potato products. It is headquartered in Eagle, Idaho, a suburb of Boise. History The company was founded in 1950 by Gilbert Lamb in a former co-op plant in Weston, Oregon. In 1988, it was acquired by ConAgra Foods and moved corporate offices from Tigard, Oregon, to Kennewick, Washington. In November 2016, ConAgra spun off the company to its shareholders. In October 2019, Lamb Weston formed the joint venture, Lamb Weston Alimentos Modernos S.A., with Sociedad Comercial del Plata. In September 2022, the Oregon Department of Environmental Quality (DEQ) fined Lamb Weston $127,000 for 90 violations of the company's wastewater discharge permit between 2015 and 2021, which included the company dumping more than 220 tons of excess nitrogen above an already contaminated aquifer. In 2024, Lamb Weston reached a settlement with the DEQ; the company would pay a $143,400 fine as well as evaluate ways to reduce wastewater, conduct soil sampling and monitor well water. In September 2023, it was announced Lamb Weston had acquired the Campbellfield, Victoria-headquartered Australian food manufacturer, Crackerjack Foods. The company will join the Lamb Weston Oceania subsidiary. On November 15, 2024, a class action lawsuit was filed against Lamb Weston along with multiple other companies alleging that they are colluding together to hike prices of potato products in a coordinated way. Subsidiaries Lamb Weston Holdings has subsidiaries in Europe, Asia and South America. Companies China - Lamb Weston - Shanghai, two processing plants China - TaiMei Potato Industry Europe - Lamb Weston / Meijer: the former joint venture is now fully owned by Lamb Weston. six processing plants in the Netherlands, United Kingdom and Austria United States - Alexia Foods Canada - Lamb Weston Canada ULC Chile - Unisur Alimentos Ltda Argentina - Lamb Weston Alimentos Modernos S.A. Processing plants Lamb Weston American Falls (Idaho) Boardman East (Oregon) Boardman West (Oregon) Connell (Washington) Delhi (Louisiana) Hallam (Australia) Hermiston (Oregon) Pasco (Washington) Paterson (Washington) Lamb Weston RDO Frozen - Park Rapids (Minnesota) Quincy (Washington) Richland (Washington) Shangdu (China) Taber (Canada) Twin Falls (Idaho) Warden (Washington) Lamb Weston/Meijer (1994-2022) Bergen op Zoom (the Netherlands) Frisch & Frost, Hollabrunn (Austria) Kruiningen (the Netherlands) Broekhuizenvorst (the Netherlands) Lipetsk (Russia) Oosterbierum (the Netherlands) Wisbech (the United Kingdom) In 2022, Lamb Weston / Meijer sold its Russian plant to local shareholders and later Meijer Beheer B.V. sold his share of ownership to Lamb Weston Holdings Inc. Lamb Weston Alimentos Modernos S.A. Munro (Argentina)"
}