{
  "ticker": "LYB",
  "cik": "0001489393",
  "company_name": "LyondellBasell",
  "corrected_name": "LyondellBasell",
  "wiki_title_used": "LyondellBasell",
  "exists": true,
  "raw_text": "LyondellBasell Industries N.V is an American multinational chemical company, incorporated in the Netherlands with U.S. operations headquartered in Houston, Texas and offices in London, UK.  The company is the largest licensor of polyethylene and polypropylene technologies. It also produces ethylene, propylene, polyolefins, and oxyfuels.\nLyondellBasell was formed in December 2007 by the acquisition of Lyondell Chemical Company by Basell Polyolefins for $12.7 billion. As of 2016, Lyondell was the third largest independent chemical manufacturer in the United States.\nLyondellBasell's global headquarters is located in Williams Tower in Houston, Texas.\n\nHistory\nEarly history\nSince its establishment in 1985 from facilities belonging to the Atlantic Richfield Company (ARCO), the company grew through stock swaps with Occidental Chemicals and Millennium Chemicals in 1997, which formed Equistar Chemicals of which each entity were partners. Lyondell purchased the outstanding shares from each of its partners to gain total control of Equistar which is a wholly owned subsidiary of Lyondell. Lyondell bought ARCO Chemical in 1998 for $5.6 billion including ARCO's entire 82.2% ownership stake.  In 2004, Lyondell purchased Millennium Chemicals in a stock-swap deal valued at $2.3 billion.  In August 2006, Lyondell acquired Citgo's interest in the Lyondell-Citgo Refinery for $2.1 billion, and renamed the facility Houston Refining. Chemical maker Basell Polyolefins purchased Lyondell in December 2007, creating the new company LyondellBasell Industries AF S.C.A., one of the largest chemical companies in the world at that time. It was owned by Access Industries, a privately held, U.S.-based industrial group. LyondellBasell is the third largest independent chemical manufacturer in the world and is headquartered in Houston and Rotterdam.\n\nExpansion\nLyondellBasell's United States operations filed for Chapter 11 bankruptcy protection in January 2009, and emerged from bankruptcy in April 2010. Its former parent company, LyondellBasell Industries AF S.C.A. was replaced by LyondellBasell Industries N.V. It was listed on the New York Stock Exchange on October 14, 2010.\nIn 2012, 1 Houston Center, the building housing LyondellBasell's Houston headquarters since 1986, was renamed LyondellBasell Tower. In 2014, LyondellBasell announced that it was installing two large cracking furnaces at its Channelview plant, and the following year the company announced it would double production capacity at the Bayport Underwood plant. LyondellBasell acquired the compounding assets of Zylog Plastalloys, an India-based company, in November 2015. The acquisition made LyondellBasell the third largest poly (propylene) materials producer in India.\nIn June 2016, LyondellBasell announced a factory in Northern China. It was the third facility for LyondellBasell to open in China, following Guangzhou and Suzhou.\nIn September 2016, LyondellBasell announced that it would build a $700 million polyethylene plant at the La Porte manufacturing complex on the Houston Ship Channel that would produce 1.1 billion pounds of polyethylene annually. The company started construction on a La Porte plant in May 2017.\nThe company completed an expansion of its Corpus Christi ethylene plant in January 2017. The plant's capacity was increased by 50 percent to produce 2.5 billion pounds annually. That same year, Hurricane Harvey hit the United States and affected the company's Texas Gulf Coast operations. The Houston Ship Channel was temporarily closed, which prevented crude tankers from reaching refineries. The La Porte facility was damaged but came back online in late October.\nIn December 2017, LyondellBasell partnered with Suez, a French water and waste management company, in the first joint venture between a major plastics and chemicals company and a resource management company.\nLyondellBasell and Odebrecht entered into exclusive talks for LYB to acquire control of Braskem in June 2018, but did not consummate the acquisition.\nDuring July 2018, LyondellBasell announced a partnership with Karlsruhe Institute of Technology (KIT) in Germany to advance chemical recycling of plastic materials and assist the global efforts towards the circular economy and plastic waste recycling needs. The focus of the venture is to develop a new catalyst and process technology to decompose post-consumer plastic waste, such as packaging, into monomers for reuse in polymerization processes.\nIn August 2018, LyondellBasell finalized their acquisition of A. Schulman Inc. in a $2.25 billion deal. That same month, it broke ground on the world's largest propylene oxide and tertiary butyl alcohol plant in Channelview, Texas. The plant is estimated to produce 1 billion pounds of propylene oxide and 2.2 billion pounds of tertiary butyl alcohol annually. LyondellBasell will export the majority of its products via the Houston Ship Channel.\nLyondellBasell also announced in September that it and its joint partner, Covestro, kicked-off a large investment project in Maasvlakte-Rotterdam, the Netherlands. The Circular Steam Project incorporates an innovative technology into the existing production plant, to convert its water-based waste into energy and is an important contribution to the Dutch government's CO2 reduction targets.\nIn December 2023, LyondellBasell sold its ethylene oxide and derivatives business to INEOS for $700 million.\n\nHouston refinery shutdown\nIn April 2022, LyondellBasell announced plans to shutter its Houston refinery by the end of 2023, following two failed attempts to sell it.  These plans were later pushed back to Q1 2025 due to a period of strong refining margins.\n\nPhilanthropy\nLyondellBasell holds an annual Global Care Day.  Company employees volunteer for community service projects in 20 countries.\n\nAwards and recognition\nThe American Chemistry Council recognized LyondellBasell with its Responsible Care Company of the Year award in 2014. In 2015, the American Heart Association recognized LyondellBasell's Cincinnati Technology Center with the Fit-Friendly Worksite Platinum Award. The Fit-Friendly program emphasizes employee health and company culture surrounding physical health.\nLyondellBasell was named #2 on the list of Top 25 Foreign-owned Chemical Producers by Chemical & Engineering News in both 2015 and 2016. In 2016, Houston Business Journal recognized LyondellBasell as the third largest Houston-based public company.\nIn 2018, LyondellBasell was named to Fortune Magazine's list of the World's Most Admired Companies. Additionally, Bob Patel received the 2018 ICIS Kavaler Award in September. The winner of the ICIS Kavaler Award is selected by his/her peers — the senior executives of the ICIS Top 40 Power Players listing, a global ranking of the leaders making the greatest positive impact on their companies and the chemical industry published in ICIS Chemical Business magazine.\n\nEnvironmental issues\nLyondellBasell's, among other petrochemical facilities at Berre-L'Étang, France, are regularly criticized in the French media and by local authorities for their large-scale flaring activities generating, among other nuisances, giant smoke plumes with lengths reaching dozens of miles. The concomitant atmospheric pollution includes organic chemical compounds such as carcinogenic benzene, butadiene and toluene. Not only the nearby cities of Vitrolles, Rognac and Marignane suffer from this pollution, but it is also held responsible for the deterioration of the air quality in the city center of Marseille, at an approximate distance of 20 km from LyondellBasell's facility.\nSimilar concerns were raised about flaring activities on other LyondellBasell sites, e.g. the Corpus Christi facility and the Lake Charles facility.\n\nManufacturing facilities\nNorth American manufacturing facilities\n\nSouth American manufacturing facilities\n\nEuropean manufacturing facilities\n\nAsian manufacturing facilities\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for LyondellBasell:",
  "clean_text": "LyondellBasell Industries N.V is an American multinational chemical company, incorporated in the Netherlands with U.S. operations headquartered in Houston, Texas and offices in London, UK. The company is the largest licensor of polyethylene and polypropylene technologies. It also produces ethylene, propylene, polyolefins, and oxyfuels. LyondellBasell was formed in December 2007 by the acquisition of Lyondell Chemical Company by Basell Polyolefins for $12.7 billion. As of 2016, Lyondell was the third largest independent chemical manufacturer in the United States. LyondellBasell's global headquarters is located in Williams Tower in Houston, Texas. History Early history Since its establishment in 1985 from facilities belonging to the Atlantic Richfield Company (ARCO), the company grew through stock swaps with Occidental Chemicals and Millennium Chemicals in 1997, which formed Equistar Chemicals of which each entity were partners. Lyondell purchased the outstanding shares from each of its partners to gain total control of Equistar which is a wholly owned subsidiary of Lyondell. Lyondell bought ARCO Chemical in 1998 for $5.6 billion including ARCO's entire 82.2% ownership stake. In 2004, Lyondell purchased Millennium Chemicals in a stock-swap deal valued at $2.3 billion. In August 2006, Lyondell acquired Citgo's interest in the Lyondell-Citgo Refinery for $2.1 billion, and renamed the facility Houston Refining. Chemical maker Basell Polyolefins purchased Lyondell in December 2007, creating the new company LyondellBasell Industries AF S.C.A., one of the largest chemical companies in the world at that time. It was owned by Access Industries, a privately held, U.S.-based industrial group. LyondellBasell is the third largest independent chemical manufacturer in the world and is headquartered in Houston and Rotterdam. Expansion LyondellBasell's United States operations filed for Chapter 11 bankruptcy protection in January 2009, and emerged from bankruptcy in April 2010. Its former parent company, LyondellBasell Industries AF S.C.A. was replaced by LyondellBasell Industries N.V. It was listed on the New York Stock Exchange on October 14, 2010. In 2012, 1 Houston Center, the building housing LyondellBasell's Houston headquarters since 1986, was renamed LyondellBasell Tower. In 2014, LyondellBasell announced that it was installing two large cracking furnaces at its Channelview plant, and the following year the company announced it would double production capacity at the Bayport Underwood plant. LyondellBasell acquired the compounding assets of Zylog Plastalloys, an India-based company, in November 2015. The acquisition made LyondellBasell the third largest poly (propylene) materials producer in India. In June 2016, LyondellBasell announced a factory in Northern China. It was the third facility for LyondellBasell to open in China, following Guangzhou and Suzhou. In September 2016, LyondellBasell announced that it would build a $700 million polyethylene plant at the La Porte manufacturing complex on the Houston Ship Channel that would produce 1.1 billion pounds of polyethylene annually. The company started construction on a La Porte plant in May 2017. The company completed an expansion of its Corpus Christi ethylene plant in January 2017. The plant's capacity was increased by 50 percent to produce 2.5 billion pounds annually. That same year, Hurricane Harvey hit the United States and affected the company's Texas Gulf Coast operations. The Houston Ship Channel was temporarily closed, which prevented crude tankers from reaching refineries. The La Porte facility was damaged but came back online in late October. In December 2017, LyondellBasell partnered with Suez, a French water and waste management company, in the first joint venture between a major plastics and chemicals company and a resource management company. LyondellBasell and Odebrecht entered into exclusive talks for LYB to acquire control of Braskem in June 2018, but did not consummate the acquisition. During July 2018, LyondellBasell announced a partnership with Karlsruhe Institute of Technology (KIT) in Germany to advance chemical recycling of plastic materials and assist the global efforts towards the circular economy and plastic waste recycling needs. The focus of the venture is to develop a new catalyst and process technology to decompose post-consumer plastic waste, such as packaging, into monomers for reuse in polymerization processes. In August 2018, LyondellBasell finalized their acquisition of A. Schulman Inc. in a $2.25 billion deal. That same month, it broke ground on the world's largest propylene oxide and tertiary butyl alcohol plant in Channelview, Texas. The plant is estimated to produce 1 billion pounds of propylene oxide and 2.2 billion pounds of tertiary butyl alcohol annually. LyondellBasell will export the majority of its products via the Houston Ship Channel. LyondellBasell also announced in September that it and its joint partner, Covestro, kicked-off a large investment project in Maasvlakte-Rotterdam, the Netherlands. The Circular Steam Project incorporates an innovative technology into the existing production plant, to convert its water-based waste into energy and is an important contribution to the Dutch government's CO2 reduction targets. In December 2023, LyondellBasell sold its ethylene oxide and derivatives business to INEOS for $700 million. Houston refinery shutdown In April 2022, LyondellBasell announced plans to shutter its Houston refinery by the end of 2023, following two failed attempts to sell it. These plans were later pushed back to Q1 2025 due to a period of strong refining margins. Philanthropy LyondellBasell holds an annual Global Care Day. Company employees volunteer for community service projects in 20 countries. Awards and recognition The American Chemistry Council recognized LyondellBasell with its Responsible Care Company of the Year award in 2014. In 2015, the American Heart Association recognized LyondellBasell's Cincinnati Technology Center with the Fit-Friendly Worksite Platinum Award. The Fit-Friendly program emphasizes employee health and company culture surrounding physical health. LyondellBasell was named #2 on the list of Top 25 Foreign-owned Chemical Producers by Chemical & Engineering News in both 2015 and 2016. In 2016, Houston Business Journal recognized LyondellBasell as the third largest Houston-based public company. In 2018, LyondellBasell was named to Fortune Magazine's list of the World's Most Admired Companies. Additionally, Bob Patel received the 2018 ICIS Kavaler Award in September. The winner of the ICIS Kavaler Award is selected by his/her peers — the senior executives of the ICIS Top 40 Power Players listing, a global ranking of the leaders making the greatest positive impact on their companies and the chemical industry published in ICIS Chemical Business magazine. Environmental issues LyondellBasell's, among other petrochemical facilities at Berre-L'Étang, France, are regularly criticized in the French media and by local authorities for their large-scale flaring activities generating, among other nuisances, giant smoke plumes with lengths reaching dozens of miles. The concomitant atmospheric pollution includes organic chemical compounds such as carcinogenic benzene, butadiene and toluene. Not only the nearby cities of Vitrolles, Rognac and Marignane suffer from this pollution, but it is also held responsible for the deterioration of the air quality in the city center of Marseille, at an approximate distance of 20 km from LyondellBasell's facility. Similar concerns were raised about flaring activities on other LyondellBasell sites, e.g. the Corpus Christi facility and the Lake Charles facility. Manufacturing facilities North American manufacturing facilities South American manufacturing facilities European manufacturing facilities Asian manufacturing facilities"
}