{
  "ticker": "LYV",
  "cik": "0001335258",
  "company_name": "Live Nation Entertainment",
  "corrected_name": "Live Nation Entertainment",
  "wiki_title_used": "Live Nation Entertainment",
  "exists": true,
  "raw_text": "Live Nation Entertainment, Inc. is an American multinational entertainment company that was founded in 2010 following the merger of Live Nation and Ticketmaster. It continues to operate both brands as subsidiary companies, promoting and managing ticket sales for live entertainment internationally. It also owns and operates entertainment venues and manages the careers of music artists.\nThe company has faced widespread criticism over its central role in the consolidation of the live events industry, allegations that it proactively engages in anti-competitive practices, poor handling of the ticket sale process for highly popular events, and injuries and deaths that have occurred at many of its events.\nAs of early 2023, Live Nation's annual shareholders report says the company has controlling interests in 338 venues globally and believes itself to be \"the largest live entertainment company in the world,\" \"the largest producer of live music concerts in the world,\" \"the world’s leading live entertainment ticketing sales and marketing company,\" and \"one of\" the world's biggest artist management companies and music advertising networks for corporate brands.\nIn May 2024, the Justice Department and a coalition of states sued to break up Live Nation over antitrust violations.\n\nHistory\nIn 2009, Live Nation and Ticketmaster, a concert promotion firm and ticketing company, reached an agreement to merge. The new company received regulatory approval and was named Live Nation Entertainment. Michael Rapino, then CEO of Live Nation, became the new company's CEO, while Ticketmaster CEO Irving Azoff was named executive chairman.\nThe merger was approved first in Norway and Turkey in 2009. The United Kingdom's Competition Commission provisionally ruled against the merger, but reversed its decision on December 22, 2009.\nThe merger was opposed in the U.S. by some regulators, artists, fans, and competing firms, who argued it would reduce competition in the industry and increase ticket costs. Rock musician Bruce Springsteen was a vocal opponent of the merger at the time.\nOn January 25, 2010, the U.S. Justice Department approved the merger pending certain conditions. Ticketmaster had to sell ownership of its self-ticketing company, Paciolan, and license its software to Anschutz Entertainment Group (AEG), which would allow it to compete \"head-to-head\" with Ticketmaster for business. AEG was given the option after five years to buy the software, replace it with something else, or partner with another ticketing company. Additionally, Live Nation Entertainment was placed under a 10-year court order prohibiting it from retaliating against venues that choose to accept competing ticket contracts.\n\nInvestments and growth\nIn 2017, Live Nation Entertainment reported revenue of $10.3 billion.\nIn April 2018, the United States Department of Justice launched an investigation following allegations by AEG that Live Nation pressured them into using Ticketmaster and intentionally avoided booking acts for AEG venues. Live Nation stated that decisions in selecting venues were not punitive, and were instead based on size and management.\nIn 2020, Live Nation was hit particularly hard by the COVID-19 pandemic, with essentially all concerts and sporting events around the world on hold. The company has been sued as it has been reluctant to offer full refunds to customers, though it has since amended its refund rules to address those complaints. On February 25, 2021, Live Nation released its full-year 2020 financial results, of which the company saw revenues fall by 84%.\n\nNortheastern United States\nIn 2016, Live Nation acquired Founders Entertainment, the New York City-based parent company of the Governors Ball Music Festival. In 2017, Live Nation announced New York City-based promotion company Mercury East in partnership with Michael Swier, a founder of The Bowery Presents, since acquired by AEG. The deal brought former \"indie\" clubs Mercury Lounge and Bowery Ballroom under the Live Nation umbrella, along with other Live Nation-owned venues including Irving Plaza, Gramercy Theatre, and the Ford Amphitheater at Coney Island.\nIn 2021, Live Nation announced a joint venture with Duke Concept, a concert promoter specialising in African artists, in which Duke Concept handles production and logistics with Live Nation providing support and a network of venues, for touring Afrobeat artists.\n\nWestern United States\nIn 2013, Live Nation announced a joint venture with Insomniac Events, a promoter focused on electronic dance music. The company continued to invest in music festivals and promoters in 2017, purchasing a controlling interest in BottleRock Napa Valley Music Festival, Salt Lake City-based concert promoter United Concerts, and CT Touring.\nIn 2021, Live Nation acquired a majority stake in streaming entertainment company Veeps.\n\nSouthern United States\nIn 2013, the company acquired the New Orleans Voodoo Music + Arts Experience. Live Nation later acquired C3 Presents in Austin, Texas (2014), Bonnaroo Music and Arts Festival in Tennessee (2015), Knoxville-based AC Entertainment (2016), Red Mountain Entertainment (2018), and Emporium Presents. \nIn October 2019, Live Nation acquired a majority stake in David Grutman's Groot Hospitality, which includes several nightclubs and restaurants in the Miami metropolitan area, including the Fontainebleau Miami Beach hotel's LIV nightclub.\n\nMidwestern United States\nIn 2018, the company acquired majority stakes in Wisconsin-based Frank Productions.\n\nInternational\nEurope\nIn August 2015, Live Nation announced it would form Live Nation Germany, in partnership with German promoter Marek Lieberberg. Live Nation Germany would also have oversight over Live Nation events in Austria and Switzerland. In 2017,  the company purchased a controlling stake in the United Kingdom-based Cuffe & Taylor. The company expanded into Portugal in 2024, acquiring the MEO Arena in Lisbon.\n\nAsia\nIn 2017, Live Nation purchased a controlling interest in Israeli promoter Blue Stone Entertainment.\nIn April 2020, it was disclosed that Saudi Arabia's Public Investment Fund (PIF) recently acquired a 5.7% stake in Live Nation, as of April 28, 2020, the investment was  valued at just shy of $500 million. The transaction, performed on the open market, made the PIF Live Nation's third-largest shareholder.\nOn April 25, 2022, Live Nation acquired Philippines-based promoter Music Management International (MMI) to create its local branch. Filipina businesswoman Rhiza Pascua, who founded MMI in 1996, became managing director of Live Nation Philippines following the acquisition.\n\nAmericas\nIn February 2016, Live Nation acquired Canada's largest independent concert promoter, Union Events.  \nIn May 2018, Live Nation Entertainment also acquired a majority stake in Brazil's Rock in Rio festival, including from previous stakeholder SFX Entertainment, which was involved in a failed attempt at a U.S. version of the event in Las Vegas, with its founder Roberto Medina continuing to manage the festival's operations, and providing consulting to Live Nation.\n\nAfrica\nIn March 2016, Live Nation acquired Big Concerts International, South Africa's leading concert promoter.\n\nOperating divisions\nLive Nation Entertainment's business segments are concerts, ticketing, and sponsorship and advertising. The company promotes and operates live music events and manages artists under its concerts division Live Nation Concerts. Live Nation Entertainment's artist management arm, called Artist Nation, is included within its concerts division and also includes Front Line Management and Roc Nation. Live Nation Entertainment owns and operates hundreds of venues globally. The company sells tickets to live events through Ticketmaster.\n\nLegal issues\nThe company has faced various lawsuits alleging ticket price fixing, hidden fees and anti-competitive practices.\nDestiny's Child manager Mathew Knowles unsuccessfully sued Live Nation in 2011, asserting that the company had spread false information about his business dealings with Beyoncé.\nIn May 2022, Representative for New Jersey's 9th congressional district Bill Pascrell stated that he had issued letters to the Federal Trade Commission and U.S. Department of Justice calling for Live Nation to be unwound and broken up, citing its safety record and other factors. These calls were repeated in November 2022 after the Taylor Swift (The Eras Tour) Ticketmaster controversy.\nOn August 2, 2023, Dynamic Ticket Systems, LLC. sued Ticketmaster and Live Nation for patent infringement.\nIn May 2024, the company confirmed rumours of a 1.3 TB data leak, at subsidiary Ticketmaster, whose potential impact may extend to over 500 million of their customers, making it one of the world's biggest digital security breaches. The leak was attributed to the malicious efforts of ShinyHunters, a hacker group who allegedly targeted the company's Snowflake (cloud-based) infrastructure. The incident led to a class action lawsuit.\nIn August of 2024, Ireland’s consumer watchdog ruled out an investigation into ticket pricing \"after some tickets jumped in price by over 400 per cent on Ticketmaster within minutes\" and failures of their website during sales of upcoming concerts for the band Oasis to be performed in August 2025. \nIn September 2025, the Federal Trade Commission in the United States and seven US states sued Ticketmaster and Live Nation, alleging the company engaged in illegal resale tactics that cost consumers billions of dollars. The lawsuit claims the companies colluded with brokers to collect tickets and then sell them at higher prices, and that advertised limits on broker sales on the Ticketmaster platform were not enforced.\n\nDepartment of Justice lawsuit\nOn May 23, 2024, the U.S. Department of Justice announced it was suing Live Nation Entertainment over what it alleges are anti-competitive practices. The DOJ was joined in the lawsuit by 29 states and the District of Columbia.\n\nInjuries and deaths\nLive Nation has been linked to at least 200 deaths and 750 injuries at its events in seven countries since 2006. From 2016 to 2019, they had also been cited for at least ten OSHA violations, fined for several more serious incidents, and sued civilly at least once for a concert incident.\nIn June 2013, Live Nation was charged with violating Ontario health and safety laws following a 2012 stage collapse at a Radiohead concert that killed one crew member. A 2019 inquest returned a verdict of accidental death. A British inquest later that year found that inadequate technical advice and construction techniques had caused the death.\nOn October 1, 2017, the Route 91 Harvest Festival shooting left 58 people dead and hundreds more injured. It is the deadliest mass shooting in US history. The shooter fired at attendees from the 32nd floor of Mandalay Bay. The victims settled for $800 million and received their settlements four years after the shooting.\nIn November 2021, a crowd crushing incident occurred at Astroworld Festival—a Live Nation-promoted concert in Houston organized and headlined by rapper Travis Scott—which resulted in 10 fatalities and nearly 5,000 injuries. Live Nation, Scott, and other parties involved have been named in over 387 lawsuits related to the incident, which in January 2022 were combined down into a single case. In December 2021, the United States Congress House Oversight Committee announced a bipartisan investigation into Live Nation's role in the incident.\nIn February 2022, the family of Drakeo the Ruler filed a wrongful death lawsuit against Live Nation in the Los Angeles County Superior Court, after the rapper was killed in a homicide that occurred backstage at the Once Upon a Time in LA music festival at BMO Stadium. The suit claimed that Live Nation had negligently failed to employ proper and effective security measures at the event. Live Nation sought a motion to dismiss the suit, arguing that the incident was rare and \"unforeseen\". In January 2023, judge Yolanda Orozc rejected the motion and allowed the suit to continue, ruling that \"the fact that defendants knew security would be needed for the event, supports the finding that the performing artists’ safety was a concern for defendants and foreseeable to defendants.\"\n\nBellwether Arbitration and New Era ADR\nAn antitrust class action lawsuit filed by four customers of Ticketmaster in 2023 alleged that two years earlier, when Live Nation was about to be faced with large amounts of demands for arbitration, that the company changed its arbitration provider and rules from JAMS to a startup, New Era ADR, who had rules and procedures much friendlier to Live Nation. In Skot Heckman et al v. Live Nation, an antitrust case based on Live Nation's inflated ticket prices, the initial filings described New Era's rules and procedures as abusive and \"Kafkaesque\", and Live Nation's switch from JAMS to New Era as unfair since they made the decision to switch arbitration providers unilaterally and without sufficient notice. A prior filing also alleged that Live Nation had a hand in writing New Era's rules. Live Nation's switch to New Era and its rules were primarily based on its friendlier terms to Live Nation and its requirement that in instances where multiple related cases were filed into a \"bellwether\" arbitration system, where three cases would be decided in an expedited fashion and if settlements could not be reached after the three cases were decided, that the result of the three cases would apply to the rest of the cases automatically. New Era's rules further included limiting filings to ten pages, briefs to five pages, prohibitions on Discovery, and a maximum of 10 documents as evidence, which the plaintiffs described as “absurd” and which would severely hinder the probability impossible for bellwether claimants to meet antitrust pleading standards in their individual cases – let alone to protect the interests of all of the other claimants, current and future, whom would be bound by rulings from the bellwether proceedings.\nLive Nation counter argued that New Era's rules were valid and that a simple rule change should not prohibit the arbitration clause from being enforced, and that the bellwether procedures should be used in order so that claims get decided quickly; Live Nation's attorneys further alleged that plaintiffs only sued over the arbitration rules in order to gain “outsized settlement leverage” with Live Nation, citing the large fees that would have been charged to Live Nation if JAMS were to stay as arbitrator.\nUltimately, federal judge George H. Wu, who was overseeing the proposed class action, ruled that the changing of arbitrators unilaterally made the entire arbitration agreement unconscionable, and kept in place the ability for class action status to be certified. Wu found in August 2023 that Live Nation's rule changes to potentially be \"fundamentally unfair\", and that New Era had \"unchecked power\" to group cases together as part of the bellwether arbitration process, and that New Era's limits could not reasonably allow plaintiffs to prove their case. Furthermore, Wu found that Live Nation offerings were often the only places in certain regions to find events, and that patrons were effectively forced into either accepting Live Nation's terms or forgoing attending live events altogether. On appeal to the Ninth Circuit, the court concurred with Wu, with judges calling New Era's rules \"cockamamie\" and \"just nuts\".\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Live Nation Entertainment:",
  "clean_text": "Live Nation Entertainment, Inc. is an American multinational entertainment company that was founded in 2010 following the merger of Live Nation and Ticketmaster. It continues to operate both brands as subsidiary companies, promoting and managing ticket sales for live entertainment internationally. It also owns and operates entertainment venues and manages the careers of music artists. The company has faced widespread criticism over its central role in the consolidation of the live events industry, allegations that it proactively engages in anti-competitive practices, poor handling of the ticket sale process for highly popular events, and injuries and deaths that have occurred at many of its events. As of early 2023, Live Nation's annual shareholders report says the company has controlling interests in 338 venues globally and believes itself to be \"the largest live entertainment company in the world,\" \"the largest producer of live music concerts in the world,\" \"the world’s leading live entertainment ticketing sales and marketing company,\" and \"one of\" the world's biggest artist management companies and music advertising networks for corporate brands. In May 2024, the Justice Department and a coalition of states sued to break up Live Nation over antitrust violations. History In 2009, Live Nation and Ticketmaster, a concert promotion firm and ticketing company, reached an agreement to merge. The new company received regulatory approval and was named Live Nation Entertainment. Michael Rapino, then CEO of Live Nation, became the new company's CEO, while Ticketmaster CEO Irving Azoff was named executive chairman. The merger was approved first in Norway and Turkey in 2009. The United Kingdom's Competition Commission provisionally ruled against the merger, but reversed its decision on December 22, 2009. The merger was opposed in the U.S. by some regulators, artists, fans, and competing firms, who argued it would reduce competition in the industry and increase ticket costs. Rock musician Bruce Springsteen was a vocal opponent of the merger at the time. On January 25, 2010, the U.S. Justice Department approved the merger pending certain conditions. Ticketmaster had to sell ownership of its self-ticketing company, Paciolan, and license its software to Anschutz Entertainment Group (AEG), which would allow it to compete \"head-to-head\" with Ticketmaster for business. AEG was given the option after five years to buy the software, replace it with something else, or partner with another ticketing company. Additionally, Live Nation Entertainment was placed under a 10-year court order prohibiting it from retaliating against venues that choose to accept competing ticket contracts. Investments and growth In 2017, Live Nation Entertainment reported revenue of $10.3 billion. In April 2018, the United States Department of Justice launched an investigation following allegations by AEG that Live Nation pressured them into using Ticketmaster and intentionally avoided booking acts for AEG venues. Live Nation stated that decisions in selecting venues were not punitive, and were instead based on size and management. In 2020, Live Nation was hit particularly hard by the COVID-19 pandemic, with essentially all concerts and sporting events around the world on hold. The company has been sued as it has been reluctant to offer full refunds to customers, though it has since amended its refund rules to address those complaints. On February 25, 2021, Live Nation released its full-year 2020 financial results, of which the company saw revenues fall by 84%. Northeastern United States In 2016, Live Nation acquired Founders Entertainment, the New York City-based parent company of the Governors Ball Music Festival. In 2017, Live Nation announced New York City-based promotion company Mercury East in partnership with Michael Swier, a founder of The Bowery Presents, since acquired by AEG. The deal brought former \"indie\" clubs Mercury Lounge and Bowery Ballroom under the Live Nation umbrella, along with other Live Nation-owned venues including Irving Plaza, Gramercy Theatre, and the Ford Amphitheater at Coney Island. In 2021, Live Nation announced a joint venture with Duke Concept, a concert promoter specialising in African artists, in which Duke Concept handles production and logistics with Live Nation providing support and a network of venues, for touring Afrobeat artists. Western United States In 2013, Live Nation announced a joint venture with Insomniac Events, a promoter focused on electronic dance music. The company continued to invest in music festivals and promoters in 2017, purchasing a controlling interest in BottleRock Napa Valley Music Festival, Salt Lake City-based concert promoter United Concerts, and CT Touring. In 2021, Live Nation acquired a majority stake in streaming entertainment company Veeps. Southern United States In 2013, the company acquired the New Orleans Voodoo Music + Arts Experience. Live Nation later acquired C3 Presents in Austin, Texas (2014), Bonnaroo Music and Arts Festival in Tennessee (2015), Knoxville-based AC Entertainment (2016), Red Mountain Entertainment (2018), and Emporium Presents. In October 2019, Live Nation acquired a majority stake in David Grutman's Groot Hospitality, which includes several nightclubs and restaurants in the Miami metropolitan area, including the Fontainebleau Miami Beach hotel's LIV nightclub. Midwestern United States In 2018, the company acquired majority stakes in Wisconsin-based Frank Productions. International Europe In August 2015, Live Nation announced it would form Live Nation Germany, in partnership with German promoter Marek Lieberberg. Live Nation Germany would also have oversight over Live Nation events in Austria and Switzerland. In 2017, the company purchased a controlling stake in the United Kingdom-based Cuffe & Taylor. The company expanded into Portugal in 2024, acquiring the MEO Arena in Lisbon. Asia In 2017, Live Nation purchased a controlling interest in Israeli promoter Blue Stone Entertainment. In April 2020, it was disclosed that Saudi Arabia's Public Investment Fund (PIF) recently acquired a 5.7% stake in Live Nation, as of April 28, 2020, the investment was valued at just shy of $500 million. The transaction, performed on the open market, made the PIF Live Nation's third-largest shareholder. On April 25, 2022, Live Nation acquired Philippines-based promoter Music Management International (MMI) to create its local branch. Filipina businesswoman Rhiza Pascua, who founded MMI in 1996, became managing director of Live Nation Philippines following the acquisition. Americas In February 2016, Live Nation acquired Canada's largest independent concert promoter, Union Events. In May 2018, Live Nation Entertainment also acquired a majority stake in Brazil's Rock in Rio festival, including from previous stakeholder SFX Entertainment, which was involved in a failed attempt at a U.S. version of the event in Las Vegas, with its founder Roberto Medina continuing to manage the festival's operations, and providing consulting to Live Nation. Africa In March 2016, Live Nation acquired Big Concerts International, South Africa's leading concert promoter. Operating divisions Live Nation Entertainment's business segments are concerts, ticketing, and sponsorship and advertising. The company promotes and operates live music events and manages artists under its concerts division Live Nation Concerts. Live Nation Entertainment's artist management arm, called Artist Nation, is included within its concerts division and also includes Front Line Management and Roc Nation. Live Nation Entertainment owns and operates hundreds of venues globally. The company sells tickets to live events through Ticketmaster. Legal issues The company has faced various lawsuits alleging ticket price fixing, hidden fees and anti-competitive practices. Destiny's Child manager Mathew Knowles unsuccessfully sued Live Nation in 2011, asserting that the company had spread false information about his business dealings with Beyoncé. In May 2022, Representative for New Jersey's 9th congressional district Bill Pascrell stated that he had issued letters to the Federal Trade Commission and U.S. Department of Justice calling for Live Nation to be unwound and broken up, citing its safety record and other factors. These calls were repeated in November 2022 after the Taylor Swift (The Eras Tour) Ticketmaster controversy. On August 2, 2023, Dynamic Ticket Systems, LLC. sued Ticketmaster and Live Nation for patent infringement. In May 2024, the company confirmed rumours of a 1.3 TB data leak, at subsidiary Ticketmaster, whose potential impact may extend to over 500 million of their customers, making it one of the world's biggest digital security breaches. The leak was attributed to the malicious efforts of ShinyHunters, a hacker group who allegedly targeted the company's Snowflake (cloud-based) infrastructure. The incident led to a class action lawsuit. In August of 2024, Ireland’s consumer watchdog ruled out an investigation into ticket pricing \"after some tickets jumped in price by over 400 per cent on Ticketmaster within minutes\" and failures of their website during sales of upcoming concerts for the band Oasis to be performed in August 2025. In September 2025, the Federal Trade Commission in the United States and seven US states sued Ticketmaster and Live Nation, alleging the company engaged in illegal resale tactics that cost consumers billions of dollars. The lawsuit claims the companies colluded with brokers to collect tickets and then sell them at higher prices, and that advertised limits on broker sales on the Ticketmaster platform were not enforced. Department of Justice lawsuit On May 23, 2024, the U.S. Department of Justice announced it was suing Live Nation Entertainment over what it alleges are anti-competitive practices. The DOJ was joined in the lawsuit by 29 states and the District of Columbia. Injuries and deaths Live Nation has been linked to at least 200 deaths and 750 injuries at its events in seven countries since 2006. From 2016 to 2019, they had also been cited for at least ten OSHA violations, fined for several more serious incidents, and sued civilly at least once for a concert incident. In June 2013, Live Nation was charged with violating Ontario health and safety laws following a 2012 stage collapse at a Radiohead concert that killed one crew member. A 2019 inquest returned a verdict of accidental death. A British inquest later that year found that inadequate technical advice and construction techniques had caused the death. On October 1, 2017, the Route 91 Harvest Festival shooting left 58 people dead and hundreds more injured. It is the deadliest mass shooting in US history. The shooter fired at attendees from the 32nd floor of Mandalay Bay. The victims settled for $800 million and received their settlements four years after the shooting. In November 2021, a crowd crushing incident occurred at Astroworld Festival—a Live Nation-promoted concert in Houston organized and headlined by rapper Travis Scott—which resulted in 10 fatalities and nearly 5,000 injuries. Live Nation, Scott, and other parties involved have been named in over 387 lawsuits related to the incident, which in January 2022 were combined down into a single case. In December 2021, the United States Congress House Oversight Committee announced a bipartisan investigation into Live Nation's role in the incident. In February 2022, the family of Drakeo the Ruler filed a wrongful death lawsuit against Live Nation in the Los Angeles County Superior Court, after the rapper was killed in a homicide that occurred backstage at the Once Upon a Time in LA music festival at BMO Stadium. The suit claimed that Live Nation had negligently failed to employ proper and effective security measures at the event. Live Nation sought a motion to dismiss the suit, arguing that the incident was rare and \"unforeseen\". In January 2023, judge Yolanda Orozc rejected the motion and allowed the suit to continue, ruling that \"the fact that defendants knew security would be needed for the event, supports the finding that the performing artists’ safety was a concern for defendants and foreseeable to defendants.\" Bellwether Arbitration and New Era ADR An antitrust class action lawsuit filed by four customers of Ticketmaster in 2023 alleged that two years earlier, when Live Nation was about to be faced with large amounts of demands for arbitration, that the company changed its arbitration provider and rules from JAMS to a startup, New Era ADR, who had rules and procedures much friendlier to Live Nation. In Skot Heckman et al v. Live Nation, an antitrust case based on Live Nation's inflated ticket prices, the initial filings described New Era's rules and procedures as abusive and \"Kafkaesque\", and Live Nation's switch from JAMS to New Era as unfair since they made the decision to switch arbitration providers unilaterally and without sufficient notice. A prior filing also alleged that Live Nation had a hand in writing New Era's rules. Live Nation's switch to New Era and its rules were primarily based on its friendlier terms to Live Nation and its requirement that in instances where multiple related cases were filed into a \"bellwether\" arbitration system, where three cases would be decided in an expedited fashion and if settlements could not be reached after the three cases were decided, that the result of the three cases would apply to the rest of the cases automatically. New Era's rules further included limiting filings to ten pages, briefs to five pages, prohibitions on Discovery, and a maximum of 10 documents as evidence, which the plaintiffs described as “absurd” and which would severely hinder the probability impossible for bellwether claimants to meet antitrust pleading standards in their individual cases – let alone to protect the interests of all of the other claimants, current and future, whom would be bound by rulings from the bellwether proceedings. Live Nation counter argued that New Era's rules were valid and that a simple rule change should not prohibit the arbitration clause from being enforced, and that the bellwether procedures should be used in order so that claims get decided quickly; Live Nation's attorneys further alleged that plaintiffs only sued over the arbitration rules in order to gain “outsized settlement leverage” with Live Nation, citing the large fees that would have been charged to Live Nation if JAMS were to stay as arbitrator. Ultimately, federal judge George H. Wu, who was overseeing the proposed class action, ruled that the changing of arbitrators unilaterally made the entire arbitration agreement unconscionable, and kept in place the ability for class action status to be certified. Wu found in August 2023 that Live Nation's rule changes to potentially be \"fundamentally unfair\", and that New Era had \"unchecked power\" to group cases together as part of the bellwether arbitration process, and that New Era's limits could not reasonably allow plaintiffs to prove their case. Furthermore, Wu found that Live Nation offerings were often the only places in certain regions to find events, and that patrons were effectively forced into either accepting Live Nation's terms or forgoing attending live events altogether. On appeal to the Ninth Circuit, the court concurred with Wu, with judges calling New Era's rules \"cockamamie\" and \"just nuts\"."
}