{
  "ticker": "MAA",
  "cik": "0000912595",
  "company_name": "Mid-America Apartment Communities",
  "corrected_name": "Mid-America Apartment Communities",
  "wiki_title_used": "Mid-America Apartment Communities",
  "exists": true,
  "raw_text": "Mid-America Apartment Communities, Inc. (MAA) is a publicly traded real estate investment trust based in Memphis, Tennessee that invests in apartments in the Southeastern United States and the Southwestern United States.\nAs of December 31, 2020, the company owned 300 apartment communities containing 100,490 apartment units. It is the largest owner of apartments in the United States and the 11th largest apartment property manager in the United States.\n\nHistory\nThe company was founded in 1977 by George E. Cates.\nIn 1993, the company was organized as a real estate investment trust.\nIn February 1994, the company acquired The Cates Company from George E. Cates and became a public company via an initial public offering.\nIn March 2009, founder George E. Cates retired.\nIn October 2013, the company acquired Colonial Properties.\nIn December 2016, the company acquired Post Properties and was added to the S&P 500 Index.\nIn 2017, the company was ranked 142nd on the \"Growth Champions\" list published by Forbes.\nIn November 2018, the company paid $11.3 million to settle a complaint that Post Properties violated the design and construction requirements under the Fair Housing Act and the Americans with Disabilities Act at 50 properties.\nIn January 2023, the company was named a defendant in a class-action lawsuit over its use of RealPage software to control rent pricing.\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Mid-America Apartment Communities:",
  "clean_text": "Mid-America Apartment Communities, Inc. (MAA) is a publicly traded real estate investment trust based in Memphis, Tennessee that invests in apartments in the Southeastern United States and the Southwestern United States. As of December 31, 2020, the company owned 300 apartment communities containing 100,490 apartment units. It is the largest owner of apartments in the United States and the 11th largest apartment property manager in the United States. History The company was founded in 1977 by George E. Cates. In 1993, the company was organized as a real estate investment trust. In February 1994, the company acquired The Cates Company from George E. Cates and became a public company via an initial public offering. In March 2009, founder George E. Cates retired. In October 2013, the company acquired Colonial Properties. In December 2016, the company acquired Post Properties and was added to the S&P 500 Index. In 2017, the company was ranked 142nd on the \"Growth Champions\" list published by Forbes. In November 2018, the company paid $11.3 million to settle a complaint that Post Properties violated the design and construction requirements under the Fair Housing Act and the Americans with Disabilities Act at 50 properties. In January 2023, the company was named a defendant in a class-action lawsuit over its use of RealPage software to control rent pricing."
}