{
  "ticker": "MAS",
  "cik": "0000062996",
  "company_name": "Masco",
  "corrected_name": "Masco",
  "wiki_title_used": "Masco",
  "exists": true,
  "raw_text": "Masco Corporation is an American manufacturer of products for the home improvement and new home construction markets. Comprising more than 20 companies, the Masco conglomerate operates nearly 60 manufacturing facilities in the United States and over 20 in other parts of the world. Since 1969 it trades on the NYSE. Under the leadership of Richard Manoogian, the company grew exponentially and subsequently joined the Fortune 500 list of largest U.S. corporations.\nAs of 2007, Masco employed approximately 32,500 employees and has approximately 6,000 shareholders. The company is currently ranked at 373 on the Fortune 500.  As of December 31, 2007, Masco had a little over ten billion dollars in assets, and the company's total revenue was $11.77 billion. Total sales for the company in 2009 were 7.8 billion. In 2010, the company had worldwide sales of $7.6 billion and approximately 90 manufacturing facilities. As of August 2014, the CEO is Keith J. Allman.\n\nHistory\nFounding and early history\nInitially organized in 1929 as Masco Screw Products Company by Alex Manoogian in Detroit, Michigan. The company went public on the Detroit Stock Exchange in 1936.\nMasco Screw Products Company produced machined automotive parts for the Detroit automotive companies. The company's first contract came in 1930 with the Hudson Motor Company valued at $7,000.00. In 1935, the company's sales reached $100,000. The following year Masco became a publicly traded company traded on the Detroit Stock Exchange. In 1942, Masco's sales exceeded $1,000,000.\nMasco Screw Products grew into the Masco Corporation, a large corporate holding company for numerous acquisitions. Small, family-run businesses were bought out by Masco Corporation with cash and stock in the parent corporation. Between 1997 and 2002, Richard Manoogian, who succeeded his father as chief executive, acquired 42 companies valued at a total of $10 billion.\n\nMasco in the 1950s, 1960s and 1970s\nIn 1952, Manoogian began redesigning the single-handle washerless faucet. The faucet he created was one of the first single-handle hot/cold faucets; it is now known as Delta. Delta's television advertisements were a first for any faucet, and made the product a successful seller. Masco went on to capture the mass market as sales moved from plumbing wholesalers to retail stores. These steps of production and marketing of the Delta faucet began in 1954, and four years later Delta Faucet's annual sales exceeded a million dollars. This was the last year that the company would be referred to as Masco Screw Products Company.\nAlex Manoogian, founder, acted as president and chief operating officer (COO) from 1929 until 1967. In 1958 his son Richard joined the company. Richard, having spent nine years with the company, succeeded his father one year after the company moved to Taylor, Michigan. Alex died on July 10, 1996, the same year that his son Richard passed on his COO role to Ray Kennedy, allowing him to assume the position of chief executive officer. In response to Kennedy's death, Alan Barry was appointed as Masco's president and COO on April 8, 2003.\nIn 1961, Masco Screw Products Company changed its name to Masco Corporation. In 1967, the company moved its corporate headquarters to Taylor, Michigan. For the first time, in 1969, Masco was listed on the New York Stock Exchange. In 1975, Masco first appeared on the Fortune 500, and Masco's annual sales exceeded one billion dollars for the first time in 1984. One year later, Masco began manufacturing cabinets.\n\nReorganizing in the 1980s and 1990s\nIn 1982 Masco's earnings did not grow for the first time in 26 years. The next year however, “In 1983, earnings climbed again for this maker of faucets and diverse product mix of builders’ hardware, because of increased housing starts and a strong do-it-yourself market.”\nIn 1985, Masco purchased the remaining outstanding stock of Flint & Walling, Inc (after purchasing 30% in 1971 and controlling interest in 1978).\nIn 1986, Masco started a home furnishings division by buying Henredon for $298 million and Drexel Heritage for $356 million. Other companies added to the division were Lexington Home Brands, Hickorycraft, Marge Carson, La Barge and Marbro in 1987, and fabric company Robert Allen/Ametex in 1988. In 1989, Universal Furniture, BenchCraft and Cal-Style were added in a $480 million deal, as well as Sunbury Textiles. The division added Berkline in 1994 and sold Marge Carson and Cal-Style in 1995.\nMasco reorganized its numerous companies; in 1988, the specialty products divisions of Masco Industries and Masco Corporation combined to form TriMas Corporation. Three years after this merger, TriMas was listed on the New York Stock Exchange (NYSE).  The remainder of Masco Industries became Masco Tech Inc. and in 1993 was listed on the NYSE. At that point in time three different Masco Companies existed: Masco Corp., Masco Tech., and TriMas Corp.\nTwo years later, Masco entered the services business. TriMas and Masco Tech merged to form one company offering a wide array of products. Masco announced a 2 for 1 stock split, which was the ninth time the company had split its shares since 1960 and was the 40th year in a row that its dividends were increased. This merger left two companies, Masco Tech. and Masco Corp.\nIn 1996, Masco sold most of its Home Furnishings Division to investors for $1.1 billion, creating a new company called LifeStyle Furnishings International.\nIn 1999, Masco involved itself in the architectural coatings business by purchasing Behr, and the company's annual sales topped five billion dollars for the first time.\n\n1999–present\nIn 1999, Masco Corp acquired Arrow Fastener Co., Inc., a hand tool company expanding its business in the hardware category.\nIn 2000, Heartland Industrial Partners, a private equity firm, purchased Masco Tech and changed its name to Metaldyne. Metaldyne is headquartered in Plymouth, Michigan. Masco also divested Flint & Walling, Inc in 2000 to Zoeller Company.\nIn 2001, Masco Corp., or simply Masco, entered the windows business and had operating profits beyond a billion dollars. Late in the year, Masco announced it would write down the value of its stake in LifeStyle Furnishings International by $460 million, since its equity share was only 15 percent, with the rest being debt. LifeStyle, the third largest furniture maker in the United States with $2 billion in sales, had sold Universal Furniture to Lacquer Craft. Then Masco announced Furniture Brands International would buy Drexel Heritage, Henredon and Maitland-Smith for $275 million, with management of Berkline, BenchCraft and Sunbury taking over those companies. LifeStyle continued to own Lexington, Robert Allen/Ametex and the Beacon Hill showrooms.\nIn 2003, Masco's annual sales topped ten billion dollars and Masco increased its quarterly dividend for the 47th consecutive year. This ranked them in the top ten publicly owned companies achieving increased annual consecutive dividends.\nThroughout his time with the company, Richard Manoogian achieved a net worth of approximately $750 million. He was ranked as high as number five on the Forbes 400 list of richest manufacturers. The Manoogian family is no longer involved in the management of the company.\nIn 2015, the company announced it would relocate its headquarters from its facility in Taylor, Michigan to Livonia due to downsizing after spinning-off some divisions. Company president Keith Allman opened the new site on July 31, 2017.\nIn December 2017, Masco acquired Mercury Plastics of Middlefield, Ohio for an undisclosed amount and in January 2018, it acquired Kichler Lighting of Independence, Ohio for $550 million.\n\nMasco segments and businesses\nPlumbing products\nAxor\nBrassCraft Manufacturing Company\nBrasstech, Inc.\nNewport Brass\nGinger\nBristan\nDelta Faucet Company\nPeerless (economy)\nDelta Faucet (mainstream)\nBrizo (luxury)\nKraus (sinks)\nHansgrohe SE\nHeritage Bathrooms\nHüppe\nMasco Canada Ltd.\nMirolin Industries Corporation\nWatkins Manufacturing Company\nHot Spring Spas\nCaldera Spas\nEndless Pools\n\nDecorative architectural products\nBehr Paint Company\nKILZ\nLiberty Hardware\nKichler Lighting\n\nOther specialty products\nDuraflex\nMilgard Windows & Doors – SOLD to MI Windows and Doors 2019 \nVaporTech\nAmerican Dryer (1952-1985)\n\nReferences\nSources\nSchoenberger, C. R. (2004, September). Un-Building Masco; [Electronic version]. Forbes, 174(5), 142–144.  Retrieved October 17, 2008, from ABI/INFORM Global database. (Document ID: 691965051).\nThe Wall Street Journal. October 27, 2008. Retrieved October 27, 2008\nWotapka, D., Dunham, K. J. (2007, December 19). Masco Suffers Squeeze Once Put on Contractors; Builders Cut Spending, Press for Lower Prices; Surviving the Downturn. The Wall Street Journal (Eastern Edition), p. B6. Retrieved October 17, 2008, from ABI/INFORM Global database. (Document ID: 1400804081).\n\nExternal links\nMasco Corporation (company website)\nBusiness data for Masco:",
  "clean_text": "Masco Corporation is an American manufacturer of products for the home improvement and new home construction markets. Comprising more than 20 companies, the Masco conglomerate operates nearly 60 manufacturing facilities in the United States and over 20 in other parts of the world. Since 1969 it trades on the NYSE. Under the leadership of Richard Manoogian, the company grew exponentially and subsequently joined the Fortune 500 list of largest U.S. corporations. As of 2007, Masco employed approximately 32,500 employees and has approximately 6,000 shareholders. The company is currently ranked at 373 on the Fortune 500. As of December 31, 2007, Masco had a little over ten billion dollars in assets, and the company's total revenue was $11.77 billion. Total sales for the company in 2009 were 7.8 billion. In 2010, the company had worldwide sales of $7.6 billion and approximately 90 manufacturing facilities. As of August 2014, the CEO is Keith J. Allman. History Founding and early history Initially organized in 1929 as Masco Screw Products Company by Alex Manoogian in Detroit, Michigan. The company went public on the Detroit Stock Exchange in 1936. Masco Screw Products Company produced machined automotive parts for the Detroit automotive companies. The company's first contract came in 1930 with the Hudson Motor Company valued at $7,000.00. In 1935, the company's sales reached $100,000. The following year Masco became a publicly traded company traded on the Detroit Stock Exchange. In 1942, Masco's sales exceeded $1,000,000. Masco Screw Products grew into the Masco Corporation, a large corporate holding company for numerous acquisitions. Small, family-run businesses were bought out by Masco Corporation with cash and stock in the parent corporation. Between 1997 and 2002, Richard Manoogian, who succeeded his father as chief executive, acquired 42 companies valued at a total of $10 billion. Masco in the 1950s, 1960s and 1970s In 1952, Manoogian began redesigning the single-handle washerless faucet. The faucet he created was one of the first single-handle hot/cold faucets; it is now known as Delta. Delta's television advertisements were a first for any faucet, and made the product a successful seller. Masco went on to capture the mass market as sales moved from plumbing wholesalers to retail stores. These steps of production and marketing of the Delta faucet began in 1954, and four years later Delta Faucet's annual sales exceeded a million dollars. This was the last year that the company would be referred to as Masco Screw Products Company. Alex Manoogian, founder, acted as president and chief operating officer (COO) from 1929 until 1967. In 1958 his son Richard joined the company. Richard, having spent nine years with the company, succeeded his father one year after the company moved to Taylor, Michigan. Alex died on July 10, 1996, the same year that his son Richard passed on his COO role to Ray Kennedy, allowing him to assume the position of chief executive officer. In response to Kennedy's death, Alan Barry was appointed as Masco's president and COO on April 8, 2003. In 1961, Masco Screw Products Company changed its name to Masco Corporation. In 1967, the company moved its corporate headquarters to Taylor, Michigan. For the first time, in 1969, Masco was listed on the New York Stock Exchange. In 1975, Masco first appeared on the Fortune 500, and Masco's annual sales exceeded one billion dollars for the first time in 1984. One year later, Masco began manufacturing cabinets. Reorganizing in the 1980s and 1990s In 1982 Masco's earnings did not grow for the first time in 26 years. The next year however, “In 1983, earnings climbed again for this maker of faucets and diverse product mix of builders’ hardware, because of increased housing starts and a strong do-it-yourself market.” In 1985, Masco purchased the remaining outstanding stock of Flint & Walling, Inc (after purchasing 30% in 1971 and controlling interest in 1978). In 1986, Masco started a home furnishings division by buying Henredon for $298 million and Drexel Heritage for $356 million. Other companies added to the division were Lexington Home Brands, Hickorycraft, Marge Carson, La Barge and Marbro in 1987, and fabric company Robert Allen/Ametex in 1988. In 1989, Universal Furniture, BenchCraft and Cal-Style were added in a $480 million deal, as well as Sunbury Textiles. The division added Berkline in 1994 and sold Marge Carson and Cal-Style in 1995. Masco reorganized its numerous companies; in 1988, the specialty products divisions of Masco Industries and Masco Corporation combined to form TriMas Corporation. Three years after this merger, TriMas was listed on the New York Stock Exchange (NYSE). The remainder of Masco Industries became Masco Tech Inc. and in 1993 was listed on the NYSE. At that point in time three different Masco Companies existed: Masco Corp., Masco Tech., and TriMas Corp. Two years later, Masco entered the services business. TriMas and Masco Tech merged to form one company offering a wide array of products. Masco announced a 2 for 1 stock split, which was the ninth time the company had split its shares since 1960 and was the 40th year in a row that its dividends were increased. This merger left two companies, Masco Tech. and Masco Corp. In 1996, Masco sold most of its Home Furnishings Division to investors for $1.1 billion, creating a new company called LifeStyle Furnishings International. In 1999, Masco involved itself in the architectural coatings business by purchasing Behr, and the company's annual sales topped five billion dollars for the first time. 1999–present In 1999, Masco Corp acquired Arrow Fastener Co., Inc., a hand tool company expanding its business in the hardware category. In 2000, Heartland Industrial Partners, a private equity firm, purchased Masco Tech and changed its name to Metaldyne. Metaldyne is headquartered in Plymouth, Michigan. Masco also divested Flint & Walling, Inc in 2000 to Zoeller Company. In 2001, Masco Corp., or simply Masco, entered the windows business and had operating profits beyond a billion dollars. Late in the year, Masco announced it would write down the value of its stake in LifeStyle Furnishings International by $460 million, since its equity share was only 15 percent, with the rest being debt. LifeStyle, the third largest furniture maker in the United States with $2 billion in sales, had sold Universal Furniture to Lacquer Craft. Then Masco announced Furniture Brands International would buy Drexel Heritage, Henredon and Maitland-Smith for $275 million, with management of Berkline, BenchCraft and Sunbury taking over those companies. LifeStyle continued to own Lexington, Robert Allen/Ametex and the Beacon Hill showrooms. In 2003, Masco's annual sales topped ten billion dollars and Masco increased its quarterly dividend for the 47th consecutive year. This ranked them in the top ten publicly owned companies achieving increased annual consecutive dividends. Throughout his time with the company, Richard Manoogian achieved a net worth of approximately $750 million. He was ranked as high as number five on the Forbes 400 list of richest manufacturers. The Manoogian family is no longer involved in the management of the company. In 2015, the company announced it would relocate its headquarters from its facility in Taylor, Michigan to Livonia due to downsizing after spinning-off some divisions. Company president Keith Allman opened the new site on July 31, 2017. In December 2017, Masco acquired Mercury Plastics of Middlefield, Ohio for an undisclosed amount and in January 2018, it acquired Kichler Lighting of Independence, Ohio for $550 million. Masco segments and businesses Plumbing products Axor BrassCraft Manufacturing Company Brasstech, Inc. Newport Brass Ginger Bristan Delta Faucet Company Peerless (economy) Delta Faucet (mainstream) Brizo (luxury) Kraus (sinks) Hansgrohe SE Heritage Bathrooms Hüppe Masco Canada Ltd. Mirolin Industries Corporation Watkins Manufacturing Company Hot Spring Spas Caldera Spas Endless Pools Decorative architectural products Behr Paint Company KILZ Liberty Hardware Kichler Lighting Other specialty products Duraflex Milgard Windows & Doors – SOLD to MI Windows and Doors 2019 VaporTech American Dryer (1952-1985)"
}