{
  "ticker": "MCD",
  "cik": "0000063908",
  "company_name": "McDonald's",
  "corrected_name": "McDonald's",
  "wiki_title_used": "McDonald's",
  "exists": true,
  "raw_text": "McDonald's Corporation, doing business as McDonald's, is an American multinational fast food restaurant chain. As of 2024, it is the second-largest by number of locations in the world, behind the Chinese chain Mixue Ice Cream & Tea.\nBrothers Richard and Maurice McDonald founded McDonald's in San Bernardino, California, in 1940 as a hamburger stand. They soon franchised the company. The Golden Arches logo was introduced in 1953. In 1955, the businessman Ray Kroc joined McDonald's as a franchise agent; he bought the company in 1961. In the years since, it has expanded internationally. Today, McDonald's has more than 40,000 restaurant locations worldwide, with around one-quarter in the US.\nOther than food sales, McDonald's generates income through its ownership of 70% of restaurant buildings and 45% of the underlying land (which it leases to its franchisees). In 2018, McDonald's was the world's second-largest private employer after Walmart; most of its 1.7 million employees work in the restaurant's franchises.\nMcDonald's bestselling licensed items are their french fries and Big Mac hamburgers; other fare includes cheeseburgers, chicken, fish, fruit, and salads. McDonald's has been criticized for its foods' nutrition, animal welfare and low worker wages.\n\nHistory\nOrigin\nSiblings Richard and Maurice McDonald, with the goal of making $1 million before they turned 50, opened the first McDonald's at 1398 North E Street at West 14th Street in San Bernardino, California, on May 15, 1940.\n\nSpeedee Service System\nThe McDonald brothers introduced the \"Speedee Service System\" in 1948, putting into expanded use the principles of the modern fast-food restaurant that predecessor White Castle had put into practice more than two decades earlier. When the brothers made the Speedee Service System, they fired their 20 carhops, removed their silverware and plates for paper wrappings and cups so that they no longer needed a dishwasher, and simplified their menu to just nine items: hamburgers, cheeseburgers, three soft drink flavors in one 12-ounce size, milk, coffee, potato chips and pie. \"Our whole concept was based on speed, lower prices, and volume,\" Richard McDonald later said.\n\nMascots\nThe original mascot of McDonald's was a hamburger-headed chef who was referred to as \"Speedee\". In 1962, the Golden Arches replaced Speedee as the universal mascot. Clown mascot Ronald McDonald was introduced in 1963 to market the chain to children.\n\nRay Kroc\nThe present corporation credits its founding to franchised businessman Ray Kroc on April 15, 1955. This was the ninth opened McDonald's restaurant overall, although this location was destroyed in 1984 after the San Ysidro McDonald's massacre. Kroc was recorded as being an aggressive business partner, driving the McDonald brothers out of the industry.\nKroc and the McDonald brothers fought for control of the business, as documented in Kroc's autobiography. In 1961, he purchased the McDonald brothers' equity in the company and began the company's worldwide reach. The sale cost Kroc $2.7 million (worth almost $28,410,134 in the current day). The San Bernardino restaurant was eventually torn down in 1971, and the site was sold to the Juan Pollo chain in 1998. This area serves as headquarters for the Juan Pollo chain, and a McDonald's and Route 66 museum. With the expansion of McDonald's into many international markets, the company has become a symbol of globalization and the spread of the American way of life.\n\nChanges\nIn 1994, McDonald's banned smoking at the 1,400 locations it wholly owned.\nIn 2006, McDonald's introduced its \"Forever Young\" brand by redesigning all of its restaurants. The restaurants were turned into cafe-esque space, being mostly terracotta, grey, and olive. The redesigned restaurants were also primary furnished with wood furniture. One McDonald's franchise owner described the new look as, \"It’s personable. It’s friendly. It’s inviting.\"\nAs a result of the COVID-19 pandemic, McDonald's closed most seating and all play areas in its United States restaurants. It transitioned to drive-through and curbside orders at locations and online food ordering delivery services.\n\nProducts\nMenu\nMcDonald's predominantly sells hamburgers, cheeseburgers, various types of chicken, chicken sandwiches, french fries, soft drinks, shakes, breakfast items, and desserts. In most markets, McDonald's offers salads and vegetarian items, wraps and other localized fare. On a seasonal basis, McDonald's offers the McRib sandwich. During March of each year, McDonald's offers a Shamrock Shake to honor Saint Patrick's Day. The company often introduces items temporarily or brings them back after long absences.\nIn addition, the chain also sells some items within the United States on a regional basis; for example, the Hatch Green Chile Double Cheeseburger, which is topped with New Mexico green chile, is only available in the southwestern state of New Mexico.\nIn 2021, the company cut value meals and cheaper items from its menu as part of a focus on higher-priced items.\n\nMcValue Meal Deal\nThe McValue Meal, which has four items and was created in 2024. The meal deal is in the McValue menu and costs $5. It was created to be a budget friendly meal on the McValue menu.\n\nHealth improvements\nWhen Steve Easterbrook became CEO of the company in 2015, McDonald's streamlined the menu which in the United States contained nearly 200 items. The company looked to introduce healthier options and removed high-fructose corn syrup from hamburger buns. The company removed artificial preservatives from Chicken McNuggets, replacing chicken skin, safflower oil and citric acid found in Chicken McNuggets with pea starch, rice starch, and powdered lemon juice.\nIn September 2018, McDonald's USA announced that they no longer use artificial preservatives, flavors and colors entirely from seven classic burgers sold in the U.S., including the hamburger, cheeseburger, double cheeseburger, McDouble, Quarter Pounder with Cheese, double Quarter Pounder with Cheese and the Big Mac. Nevertheless, the pickles will still be made with an artificial preservative, although customers can choose to opt out of getting pickles with their burgers.\n\nMcPlant\nIn November 2020, McDonald's announced McPlant, a plant-based burger, along with plans to develop additional meat alternative menu items that extend to chicken substitutes and breakfast sandwiches. This announcement came after the successful testing of Beyond Meat plant based meat substitutes.\nIn late 2022, McDonald's announced the addition of the Double McPlant at all restaurants in the United Kingdom and Ireland starting January 4 due to the success of the McPlant. In 2024, select McDonald's in the UK were testing vegan ice cream called Choco Scoop and Strawberry Scoop and receiving positive reviews.\n\nInternational menu variations\nAsia\nMcDonald's Menu is customized to reflect consumer tastes in their respective countries. Restaurants in several countries, particularly in Asia, serve soup. This local deviation from the standard menu is a characteristic for which the chain is particularly known and one which is employed either to abide by regional food taboos (such as the religious prohibition of beef consumption in India) or to make available foods with which the regional market is more familiar (such as the sale of McRice in Indonesia, or Ebi (prawn) Burger in Singapore and Japan). McDonald's restaurants in China include fried buns and soybean milk on their breakfast menus.\nIn partnership with the Central Food Technological Research Institute in India, McDonald's has introduced millet-based buns on September 4, 2024. Three major (Pearl millet, Sorghum, and Finger millet) and two minor (Proso and Paspalum scrobiculatum) millets are used which makes up 22% of the bun. It provides more calcium, iron, and protein in addition to a small amount of complex carbs to aid in satiety more quickly.\n\nEurope and New Zealand\nIn France, McDonald's is called McDo. They sell macaroons, Croque McDos, croissants, pain au chocolat, and beer. In Germany and some other Western European countries, McDonald's also sells beer. In Greece, the signature hamburger, Big Mac, is changed by adding Tzatziki sauce and packaging in a pita.\nIn New Zealand, until 2020, McDonald's sold meat pies after local affiliate McDonald's New Zealand (known locally as \"Macca's\") partially relaunched the Georgie Pie fast food chain it bought out in 1996.\n\nNorth America\nIn the United States and Canada, after limited trials on a regional basis, McDonald's began offering in 2015 and 2017, respectively, a partial breakfast menu during all hours its restaurants were open. All-day breakfast was phased out from menus in the United States at the start of the COVID-19 pandemic in 2020. The all-day breakfast menu is still available in select locations across Canada.\n\nTypes of McDonald's locations and McDonald's subsidiaries\nIn the United States, most standalone McDonald's restaurants offer both counter service and drive-through service, with indoor and sometimes outdoor seating.\nIn 1994, McDonald's attempted Hearth Express, a prototype specializing in homestyle takeout meals. Among the fare offered were meatloaf, fried chicken, and baked ham. This experiment started with a single location in Darien, Illinois but closed after one year.\n\nMcDrive\nDrive-Thru, Auto-Mac, Pay and Drive, or \"McDrive\" as it is known in many countries, often has separate stations for placing, paying for, and picking up orders while the customer remains in their vehicle; it was first introduced in Sierra Vista, Arizona in 1975, following the lead of other fast-food chains. The first such restaurant in Britain opened at Fallowfield, Manchester, in 1986. In some countries, McDrive locations near highways offer no counter service or seating. In contrast, locations in high-density city neighborhoods often omit drive-through service. There are also a few locations, mostly in downtown districts, that offer a \"Walk-Thru\" service in place of Drive-Thru.\n\nMcCafé\nMcCafé is a café-style accompaniment to McDonald's restaurants. The concept was created by McDonald's Australia, starting with Melbourne in 1993. In China, McCafé has expanded through small-format retail concepts such as kiosks, walk-up stands, and mobile coffee trucks. These formats support high-density areas and office districts where full restaurant build-outs are impractical.\n\nMcDonald's Next\nMcDonald's Next uses open-concept design and offers \"Create Your Taste\" digital ordering. The concept store also offers free mobile device charging and table service after 6:00 pm. The first store opened in Hong Kong in December 2015. The buildings are not colorful, and instead use more natural colors, like from concrete and unpolished oak.\n\nPlayPlaces\nMcDonald's playgrounds used to be called Playlands and were outside. After concerns were raised that the playgrounds were dangerous, McDonald's moved them inside and began to make them out of softer materials, such as plastic instead of metal. They renamed them PlayPlaces in 1987.\n\nMcExpress and McStop\nSome locations are connected to gas stations and convenience stores, while others called McExpress have limited seating or menu or may be located in a shopping mall. Other McDonald's are located in Walmart stores. McStop is a location targeted at truckers and travelers who may have services found at truck stops.\n\nCosMc's\nIn July 2023, the company announced it was working toward a new fast-food brand called CosMc's, which would be tested at 10 sites. The first location was opened in December 2023 in Bolingbrook, Illinois. The outlet had a smaller real-estate footprint than regular McDonald's restaurants and focused on selling coffee and other drinks to afternoon customers.\nThe name for the new brand came from CosMc, a McDonaldland mascot that appeared in advertisements in the late 1980s and early 1990s.\nAlthough four additional locations were eventually opened in Texas, McDonald's announced in May 2025 that all locations would be shuttered and the associated app removed by the end of June of that year. Some CosMc's beverage flavors will be tested in other U.S. McDonald's locations.\n\nCorporate overview\nStatistics\nMcDonald's restaurants are in 120 countries and territories and serve 68 million customers daily. There are 41,800 McDonald's locations as of 2023, and 45,000 employees in the United States.\nThe McDonald's on-demand delivery concept, which began in 2017 with a partnership with Uber Eats and added DoorDash in 2019 (with select locations adding Grubhub in 2021), accounts for up to 3% of all business as of 2019.\nThe $100 billion in sales generated by McDonald's company-owned and franchise restaurants in 2019 accounts for almost 4% of the estimated $2.5 trillion global restaurant industry.\n\nStock holdings\nFocusing on its core brand, McDonald's began divesting itself of other chains it had acquired during the 1990s. The company owned a majority stake in Chipotle Mexican Grill until October 2006, when McDonald's fully divested from Chipotle through a stock exchange. Until December 2003, it owned Donatos Pizza, and it owned a small share of Aroma Café, from 1999 to 2001. On August 27, 2007, McDonald's sold Boston Market to Sun Capital Partners.\nMcDonald's has increased shareholder dividends for 25 consecutive years, making it one of the S&P 500 Dividend Aristocrats. The company is ranked 131st on the Fortune 500 of the largest United States corporations by revenue. In October 2012, its monthly sales fell for the first time in nine years. In 2014, its quarterly sales fell for the first time in seventeen years, when its sales dropped for the entirety of 1997.\n\nMonetary loss\nIn the United States, it is reported that drive-throughs account for 70 percent of sales. McDonald's closed down 184 restaurants in the United States in 2015, which was 59 more than what they planned to open. This move was the first time McDonald's had a net decrease in the number of locations in the United States since 1970.\nIn the first three months of 2025, as U.S. President Donald Trump's tariff plans began to be unveiled and implemented, McDonald's revenue in the US fell 3.6% compared to the previous year, the largest sales decline in the US since the peak of the COVID-19 pandemic.\n\nBusiness trends\nThe key trends for the McDonald's Corp. are (as of the financial year ending December 31)\n\nBusiness model\nOwnership\nMcDonald's owns the land on which many of its restaurants are situated, which is valued at an estimated $42 billion. The company earns a significant portion of its revenue from rental payments from franchisees. These rent payments rose 26 percent between 2010 and 2015, accounting for one-fifth of the company's total revenue at the end of the period. In recent times, there have been calls to spin off the company's U.S. holdings into a potential real estate investment trust, but the company announced at its investor conference on November 10, 2015, that this would not happen. CEO Steve Easterbrook discussed that pursuing the REIT option would pose too large a risk to the company's business model.\nMcDonald's trains its franchisees and management at one of the Hamburger Universities. As of 2015, the Hamburger Universities reside in Oak Brook, Tokyo, London, Sydney, Munich, São Paulo, Shanghai, and Moscow. In other countries, McDonald's restaurants are operated by joint ventures of McDonald's Corporation and other, local entities or governments.\nQSC&V (Quality, Service, Cleanliness & Value) is a corporate motto adopted by McDonald's to describe the company's philosophy for operating restaurants.  The motto is codified in the procedures McDonald's uses to evaluate its franchisees.\n\nWorkers\nAccording to Fast Food Nation by Eric Schlosser (2001), nearly one in eight workers in the U.S. have at some time been employed by McDonald's. Employees are encouraged by McDonald's Corp. to maintain their health by singing along to their favorite songs to relieve stress, attending church services to have a lower blood pressure, and taking two vacations annually to reduce the risk for myocardial infarction.\nFast Food Nation states that McDonald's is the largest private operator of playgrounds in the U.S., as well as the single largest purchaser of beef, pork, potatoes, and apples. The selection of meats McDonald's uses varies to some extent based on the host country's culture.\n\nHeadquarters\nOn June 13, 2016, McDonald's confirmed plans to move its global headquarters to Chicago's West Loop neighborhood in the Near West Side. The 608,000-square-foot structure opened on June 4, 2018, and was built on the former site of Harpo Productions.\nThe McDonald's former headquarters complex, McDonald's Plaza, is in Oak Brook, Illinois. It sits on the site of the former headquarters and stabling area of Paul Butler, the founder of Oak Brook. McDonald's moved into the Oak Brook facility from an office within the Chicago Loop in 1971.\n\nBoard of directors\nAs of December 2024, the board of directors had the following members:\n\nChris Kempczinski; chairman and CEO of McDonald's\nAnthony G. Capuano,  CEO of Marriott International\nKareem Daniel, former chairman of Disney Media and Entertainment Distribution\nLloyd H. Dean, president and CEO of Dignity Health\nCatherine M. Engelbert, commissioner of the Women's National Basketball Association\nMargo Georgiadis, former CEO of Ancestry.com\nMike Hsu, chairman and CEO of Kimberly-Clark\nJohn J. Mulligan, executive vice president and COO of Target Corporation\nJennifer L. Taubert, Executive Vice President and Worldwide Chairman, Innovative Medicine, Johnson & Johnson\nPaul S. Walsh, executive chairman of McLaren Group\nAmy E. Weaver, President and Chief Financial Officer of Salesforce\nMiles D. White, chairman and CEO of Abbott Laboratories\nSteve Easterbrook was CEO and president of McDonald's from 2015 to 2019, replacing the old CEO Don Thompson. McDonald's board of directors voted to remove Easterbrook as CEO since he had violated corporate policies on personal conduct by entering into a relationship with a company employee. He was replaced as CEO by Chris Kempczinski, who had been president of McDonald's USA.\nIn August 2022, McDonald's announced significant changes to its board. It said that existing director Sheila Penrose, chair of JLL Inc., would retire and that Anthony Capuano, CEO of Marriott International, executive vice president and worldwide chairman of pharmaceuticals Jennifer Taubert of Johnson & Johnson, and Amy Weaver president and CFO of Salesforce would join. The changes were unrelated to an effort by activist investor Carl Icahn.\n\nOwnership\nGlobal operations\nInternational influence\nMcDonald's has become emblematic of globalization, sometimes referred to as the \"McDonaldization\" of society. The Economist newspaper uses the \"Big Mac Index\": the comparison of the cost of a Big Mac in various world currencies can be used to informally judge these currencies' purchasing power parity. Switzerland has the most expensive Big Mac in the world as of July 2015, while the country with the least expensive Big Mac is India (albeit for a Maharaja Mac—the next cheapest Big Mac is Hong Kong). The northernmost McDonald's restaurant in the world is located in Rovaniemi, Finland (after the restaurant in Murmansk, Russia was closed in 2022), however from January 2024 this had changed again as McDonald's opened a new restaurant in Tromsø, Norway. And the southernmost in the world is located in Invercargill, New Zealand.\nThomas Friedman said that no country with a McDonald's had gone to war with another.\nMcDonald's suspended operations in its corporate-owned stores in Crimea after Russia annexed the region in 2014. On August 20, 2014, as tensions between the United States and Russia strained over the Russian annexation of Crimea, and the resultant U.S. sanctions, the Russian government temporarily shut down four McDonald's outlets in Moscow, citing sanitary concerns. The company has operated in Russia since 1990 and, in August 2014, had 438 stores across the country. On August 23, 2014, Russian Deputy Prime Minister Arkady Dvorkovich ruled out any government move to ban McDonald's and dismissed the notion that the temporary closures had anything to do with the sanctions.\nSome observers have suggested that the company should be given credit for increasing the service standard in markets it enters. A group of anthropologists in a study entitled Golden Arches East looked at McDonald's impact on East Asia and Hong Kong, particularly. When it opened in Hong Kong in 1975, McDonald's was the first restaurant to consistently offer clean restrooms, driving customers to demand the same of other restaurants and institutions. McDonald's has partnered with Sinopec, the second-largest oil company in the People's Republic of China, as it takes advantage of the country's growing use of personal vehicles by opening numerous drive-through restaurants.\n\nGlobal activities\nIn Beijing, China, McDonald's restaurants are state-owned enterprises operating according to franchise agreements. Beijing Capital Agricultural Group owns these franchises.\nMcDonald's has opened a McDonald's restaurant and McCafé on the underground premises of the French fine arts museum, The Louvre.\nThe company opened vegetarian-only restaurants in India. The first one opened in 2012 at Amritsar, India.\nOn January 9, 2017, 80% of the franchise rights in mainland China and Hong Kong were sold for US$2.08 billion to a consortium of CITIC Limited (for 32%). Private equity funds managed by CITIC Capital (for 20%) and Carlyle (for 20%), which CITIC Limited and CITIC Capital would form a joint venture to own the stake.\n\nOn the river Elbe in Hamburg, Germany, is the world's only \"McBoat\", a float-through service (similar to drive-through) for people on the river.\nIn Sweden, Happy Meal boxes can be used as goggles, with the game Slope Stars. In the Netherlands, McDonald's has introduced McTrax that doubles as a recording studio; it reacts to touch. They can create their own beats with a synth and tweak sounds with special effects.\nIn March 2022, McDonald's closed and sold their 850 locations in Russia due to the invasion of Ukraine. Approximately nine percent of global revenue and three percent of operating profit had come from Russia and the 100 locations in Ukraine. They sold the restaurants to a Russian buyer under the condition that the locations would not use the McDonald's branding. The new stores were rebranded as Vkusno i tochka, beginning to reopen in June. Later in 2022, the 25 McDonald's restaurants in Belarus rebranded as Vkusno i tochka and operations were suspended in Kazakhstan due to issues supplying minced meat from Russia. They rebranded the following year.\nDuring the Gaza war, McDonald's branches in Muslim countries were boycotted after McDonald's branches in Israel provided free meals to the Israel Defense Forces, who had been accused of committing war crimes. McDonald's in some countries distanced themselves from the actions of McDonald's Israel. As a result, McDonald's bought all 225 Israeli franchise-owned restaurants.\n\nMcDonald's employee relations\nUnited States\nTechnology uses\nSince the late 1990s, McDonald's has attempted to replace employees with electronic kiosks that would perform actions such as taking orders and accepting money. In 1999, McDonald's first tested \"E-Clerks\" in suburban Chicago, Illinois, and Wyoming, Michigan, with the devices being able to \"save money on live staffers\" and attracting larger purchase amounts than average employees.\nIn 2013, the University of Oxford estimated that in the succeeding decades, there was a 92% probability of food preparation and serving becoming automated in fast food establishments. By 2016, McDonald's \"Create Your Taste\" electronic kiosks were seen in some restaurants internationally where customers could custom order meals.\nIn 2017, McDonald's launched an app in the United States that allows customers to skip the ordering line inside or drive through and order online. Many McDonald's locations have special parking spaces for such orders.\nIn September 2019, McDonald's purchased an AI-based start-up, Apprente, to replace human servers with voice-based technology in its US drive-throughs.\nIn early 2023, McDonald's opened its first largely automated restaurant in Fort Worth, Texas. The restaurant in question would de-emphasize human contact when ordering, with employees available if there were problems but who would otherwise be absent from the ordering process (along with others working in the kitchen or other back-of-the-house roles). There was no seating in this restaurant.\n\nWorker complaints\nIn March 2015, McDonald's workers in 19 U.S. cities filed 28 health and safety complaints with the U.S. Occupational Safety and Health Administration, which allege that low staffing, lack of protective gear, poor training, and pressure to work fast resulted in injuries. The complaints allege that, because of a lack of first aid supplies, workers were told by management to treat burn injuries with condiments such as mayonnaise and mustard. The Fight for $15 labor organization aided the workers in filing the complaints.\nThe Roosevelt Institute, a liberal think tank, accuses some McDonald's restaurants of actually paying less than the minimum wage to entry positions due to \"rampant\" wage theft.\n\nFrance\nWorkers at the McDonald's franchise at Saint-Barthélémy, Marseille, occupied the restaurant in protest against its planned closure. Employing 77 people, the restaurant is the second-biggest private sector employer in Saint-Barthélémy, which has an unemployment rate of 30 percent. Lawyers for Kamel Guemari, a shop steward at the franchise, claimed an attempt was made to kill him when a car drove at him in the restaurant car park.\n\nSouth Korea\nIn South Korea, McDonald's pays part-time employees $5.50 an hour and is accused of paying less with arbitrary schedule adjustments and pay delays.\n\nUnited Kingdom\nAs of 2013, 90% of McDonald's UK workforce were on zero-hour contracts, making it potentially the largest such private sector employer in the country. In April 2017, after workers engaged in labor strke, all employees were given the option of fixed contracts.\nFrom 2007 to 2011, fast food workers in the U.S. drew an average of $7 billion of public assistance annually resulting from receiving low wages. The McResource website advised employees to break their food into smaller pieces to feel fuller, seek refunds for unopened holiday purchases, sell possessions online for quick cash, and \"quit complaining\" as \"stress hormone levels rise by 15 percent after ten minutes of complaining.\" In December 2013, McDonald's shut down the McResource website amidst negative publicity and criticism. McDonald's plans to continue an internal telephone help line through which its employees can obtain advice on work and life problems.\nIn September 2017, two British McDonald's stores agreed to a strike over zero-hours contracts for staff. Picket lines were formed around the two stores in Crayford and Cambridge. The strike was supported by then Leader of the Opposition Jeremy Corbyn.\n\nCriticism\nMcDonald's has been criticized for numerous aspects of its business, including its products' health effects, employees' treatment, and other business practices.\nIn 2001, Eric Schlosser's book Fast Food Nation criticised aspects of McDonald's business practices, particularly around its political lobbying and criticism of the business practices of McDonald's, particularly concerning its use of political influence and targeting advertisements to children.\n\nNutrition\nIn 1990, activists from a small group known as London Greenpeace (no connection to the international group Greenpeace) distributed leaflets entitled What's wrong with McDonald's?, criticizing its environmental, health, and labor record. The corporation wrote to the group demanding they desist and apologize, and, when two of the activists refused to back down, sued them for libel leading to the \"McLibel case\", one of the longest cases in English civil law. A documentary film of the McLibel Trial has been shown in several countries.\nMorgan Spurlock's 2004 documentary film Super Size Me claimed that McDonald's food was contributing to the increase of obesity in society and that the company was failing to provide nutritional information about its food for its customers. Six weeks after the film premiered, McDonald's announced that it was eliminating the super size option and was creating the adult Happy Meal.\nIn response to public pressure, McDonald's has sought to include more healthy choices in its menu, announcing in May 2008 that, in the United States and Canada, it has switched to using cooking oil that contains no trans fats for its french fries, and canola-based oil with corn and soy oils, for its baked items, pies, and cookies, by the end of 2018. The company introduced a new slogan to its recruitment posters: \"Not bad for a McJob.\"\n\nAnimal welfare\nMcDonald's has been criticized for using factory farmed fast growing chicken breeds in their supply chain. These breeds are more likely to suffer from welfare issues such as broken or fractured bones, leg deformities and heart failure.\nSince McDonald's purchases over 2 billion eggs per year, which accounts for about 4 percent of eggs produced in the United States, the switch to cage-free eggs is expected to have a major impact on the egg industry. It is part of a general trend toward cage-free eggs driven by consumer concern over the harsh living conditions of hens. In 2014, McDonald's pledged to stop using eggs from battery cage facilities in restaurants in Australia by 2017, which was met in 2018.\nMcDonald's has been the subject of animal rights activism. In 2021, Animal Rising blockaded four UK distribution centers using bamboo towers, leading to food shortages at restaurants. They cited \"suffering of animals\" in the McDonald's supply chain as a motivating factor.\n\nLegal cases\nMcDonald's has been involved in several lawsuits and other legal cases, most involving trademark disputes. The company has threatened many food businesses with legal action unless it drops the 'Mc' or 'Mac' from trading names.\n\nEuropean Union\nIn April 2017, Irish fast-food chain Supermac's submitted a request to the European Union Property Office to cancel McDonald's owned trademarks within the European Union, claiming that McDonald's engaged in \"trademark bullying; registering brand names... which are simply stored away in a war chest to use against future competitors\", after the trademarks had prevented Supermac's from expanding out of Ireland. The EUIPO ruled in Supermac's favor, finding that McDonald's \"has not proven genuine use\" of many trademarks, canceling McDonald's owned trademarks such as \"Big Mac\" and specific \"Mc\"-related trademarks within the European Union.\nBurger King responded by \"trolling\" McDonald's by giving their burgers names that included the words \"Big Mac\" that also mocked the original burger, which included \"Like a Big Mac But Juicier\", \"Like a Big Mac, But Actually Big\" and \"Big Mac-ish But Flame-Grilled of Course.\"\nIn 2023, the EUIPO Board of Appeal partially annulled their decision after McDonald's filed 700 pages of additional evidence despite objections. However, on further appeal to the European Court of Justice, the court ruled in 2024 that McDonald's had failed to prove the use of the Big Mac trademark in relation to chicken products or services associated with operating restaurants, meaning Supermac's and other businesses are now free to use the \"Mac\" in their business names and in names for poultry products in Europe. McDonald's retains the Big Mac trademark solely for its beef burgers.\nThe McDonald's group has had proceedings taken against it by the French Tax Authorities, with possible charges of criminal tax fraud. In July 2022, the group reached an agreement with the French judicial authorities to end criminal proceedings for tax fraud.\n\nMalaysia\nOn September 8, 2009, McDonald's Malaysian operations lost a lawsuit to prevent another restaurant from calling itself McCurry. McDonald's lost in an appeal to Malaysia's highest court, the Federal Court.\nOn December 29, 2016, McDonald's Malaysian issue a statement that said only certified halal cakes are allowed inside its restaurants nationwide.\n\nUnited Kingdom\nThe longest-running legal action of all time in the UK was the McLibel case against two defendants who criticized several aspects of the company. The trial lasted ten years and called 130 witnesses. The European Court of Human Rights deemed that the unequal resources of the litigants breached the defendants' rights to freedom of speech and biased the trial. The result was widely seen as a \"PR disaster\" for McDonald's.\nIn 2021, it emerged that at least 50 employees had filed charges against the chains regarding harassment in the workplace in five years, leading to the company instituting anti-harassment training. Some of the complainants also stated that they were verbally and physically harassed in retaliation for their complaints. In 2023, the BBC conducted an investigation, and reported that more than 100 current and recent UK workers at outlets of the fast-food chain allege there is a continuing toxic culture of sexual assault, harassment, racism and bullying.\nIn January 2025, it was reported that over 700 young workers had filed lawsuits against McDonald's UK, alleging widespread harassment and discrimination. The claims, handled by the law firm Leigh Day, involved current and former employees under the age of 20 and spanned more than 450 restaurants. Following a BBC investigation in July 2023, testimonies highlighted issues such as racism, homophobia, ableism, and harassment. McDonald's UK, dismissed 29 workers for sexual harassment in 2023 and established a specialist unit to investigate such allegations. However, unions argued that these measures did not resolve the issues. Employees shared accounts of inappropriate behavior, including homophobic remarks, sexual advances, and unwanted physical contact from managers. Similar allegations had been raised in 2019, with the Bakers, Food and Allied Workers Union reporting over 1,000 cases of harassment involving female employees. In March 2025, the Equality and Human Rights Commission wrote to all 1,400 McDonald's branches telling them they must comply with their legal duties, or risk enforcement action.\nIn June 2025, it was reported that McDonald's was attempting to block the expansion of the Irish chain Supermac's into the UK market and intended to proceed with IPO trademark court proceedings in the UK, despite having been unsuccessful in similar proceedings against Supermac's in the EU in 2024.\n\nUnited States\nThe 1994 court case Liebeck v. McDonald's Restaurants examined a McDonald's practice of serving coffee so hot that when spilled, it caused third degree burns requiring weeks of hospitalization and skin grafting surgery. The trial outcome was an award of $2.86 million (equivalent to $5.47 million in 2024) for the plaintiff, 81-year old Stella Liebeck. The amount was later reduced to $640,000 (equivalent to $1.2 million in 2024). In 2019, a McDonald's employee, Jenna Ries, sued the restaurant chain over allowing sexual harassment in the workplace and described the working environment as \"toxic\".\nIn 2023, an investigation by the United States Department of Labor found child labor violations at McDonald's franchises in the state of Kentucky, which involved over 300 children, two of them 10-year-olds. A total of $212,000 was levied against three franchises for the violations. Further investigations uncovered child labor violations involving 83 minors at 16 different locations in Louisiana and Texas, with imposed fines amounting to $77,572.\n\nMarketing and advertising\nMcDonald's has maintained an extensive advertising campaign for decades. In addition to the usual media (television, radio, and newspaper), the company makes use of billboards and signage. Also, it sponsors sporting events ranging from Little League to the FIFA World Cup and Olympic Games. Television has been central to the company's advertising strategy. To date, McDonald's has used 23 different slogans in United States advertising, as well as a few other slogans for select countries and regions.\n\nChildren's advertising\nMcDonald's uses playgrounds, games, and toys to make children want to go to McDonald's.\n\nCelebrity endorsements\nSports\nIn 1992, basketball player Michael Jordan became the first celebrity to have a McDonald's value meal named after him. The \"McJordan\" was available at Chicago franchises. The exclusivity of the meal lead to fans in other regions being envious, more notably leading to a man buying a gallon of the McJordan BBQ sauce for 10,000 dollars.\nLeBron James was a spokesman for McDonald's from 2003 to 2017, while co-endorsing Coca-Cola-Sprite since early in his career.\nIn January 2025, WNBA player Angel Reese became the first woman to partner with McDonald's, creating the Angel Reese Special. Ordering the meal as a double Quarter Pounder was promoted in reference to Reese's consistent double-doubles during games.\n\nMusic\nIn September 2020, McDonald's partnered with rapper Travis Scott to release the \"Travis Scott Meal\" nationwide. Scott designed new uniforms for McDonald's employees and released Cactus Jack merchandise using vintage visuals from the fast food chain's history. The company followed up with the \"J Balvin Meal\" in a partnership with reggaeton singer J Balvin.\nIn 2021, McDonald's partnered with Korean boy group BTS to release the \"BTS Meal\" in 50 countries around the world, starting on May 26 in select countries.\n\nSpace exploration\nMcDonald's and NASA explored an advertising agreement for a planned mission to the asteroid 449 Hamburga; however, the spacecraft was eventually canceled.\n\nSponsorship in NASCAR\nMcDonald's entered the NASCAR Cup Series in 1977, sponsoring Richard Childress for one race. Between 1977 and 1986, McDonald's only sponsored a handful of races in a season. In 1993, McDonald's became the full-time sponsor for the No. 27 Junior Johnson & Associates Ford, driven by Hut Stricklin. In 1994, Stricklin was replaced in the car by Jimmy Spencer, who went on to win twice that season. The following season McDonald's would move over to the No. 94 Bill Elliott Racing Ford, driven by team-owner Bill Elliott. McDonald's stayed with Elliott until the 2001 season when they moved again, this time to the No. 96 PPI Motorsports Ford, driven by rookie Andy Houston. However, when the team failed to field a car for the entire season, McDonald's became absent from NASCAR until 2004, when it joined Evernham Motorsports as a part-time sponsor for drivers Elliott, Kasey Kahne, Elliott Sadler, A. J. Allmendinger, and Reed Sorenson until 2010.\nDuring the 2010 season, McDonald's entered its longest partnership with a team at Chip Ganassi Racing, sponsoring the No. 1 Chevrolet driven by Jamie McMurray until his final race in the 2019 Daytona 500. McDonald's moved to CGR's No. 42 of Kyle Larson, whom the company sponsored until his suspension in 2020, and also had a one-race partnership with Richard Petty Motorsports' No. 43 Chevrolet driven by Bubba Wallace in 2019 and 2020. McDonald's continued working with the No. 42 under new driver Ross Chastain in 2021 and also joined Wallace's new team 23XI Racing as a \"founding partner\".\n\nCharity\nMcHappy Day is an annual event at McDonald's, during which a percentage of the day's sales go to charity. It is the signature fundraising event for Ronald McDonald House Charities (RMHC). According to the Australian McHappy Day website, McHappy Day raised $20.4 million in 2009. The goal for 2010 was $20.8 million.\nRonald McDonald House Charities is a global network of more than 260 Chapters that is made to help families access medical care for their children and family support services in more than 60 countries and regions throughout the world. In 2022, over $182 million were donated to Ronald McDonald House Charities from McDonald's, its franchisees, and its customers.\nIn 1995, St. Jude Children's Research Hospital received an anonymous letter postmarked in Dallas, Texas, containing a $1 million winning McDonald's Monopoly game piece. McDonald's officials came to the hospital, accompanied by a representative from the accounting firm Arthur Andersen, who examined the card under a jeweler's eyepiece, handled it with plastic gloves, and verified it as a winner.\n\nFuture plans\nMcDonald's has many plans to expand, digitize, and reduce carbon emissions in the near future.\nMcDonald's wants to add 900 McDonald's restaurants in the U.S. and 10,000 more worldwide (totaling 50,000 restaurants globally) by 2027.\nMcDonald's has committed to eliminating deforestation from its global supply chain by 2030 for beef and four other commodities. The company also has a 2050 net-zero carbon emissions commitment, to bring global carbon emissions down. Digitizing the Arches is a new initiative of McDonald's. From this, McDonald's announces a partnership with Google to automate restaurants using artificial intelligence, and Google Cloud technology. They also plan to expand the McDonald's loyalty program from 150 million to 250 million 90-day active users by 2027. McDonald's is also planning to expand its digital ordering system to 30% of deliveries originating from their app by 2027.\n\nSee also\nArcos Dorados Holdings\nThe Founder, a 2016 biopic of Ray Kroc and the business history of McDonald's\nInternational availability of McDonald's products\nList of countries with McDonald's restaurants\nList of hamburger restaurants\nList of largest employers\nList of fast food restaurant chains\nMaDonal, a restaurant in Iraq that copies many features of McDonald's\nVkusno i tochka A fast food chain in Russia that replaced McDonald's following Western sanctions on Russia during the Russo-Ukrainian war\nMaxime, McDuff & McDo, a 2002 documentary film about the unionizing of a McDonald's in Montreal\nMcMillions, a 2020 HBO documentary miniseries about the McDonald's Monopoly promotion scam that occurred between 1989 and 2001\n\"Sundae Bloody Sundae\", a public relations controversy in Portugal\nMcDonald's and unions\n\nNotes\nReferences\nFurther reading\nAshenfelter, Orley, and Štěpán Jurajda. \"Minimum Wages, Wages, and Price Pass-Through: The Case of McDonald's Restaurants.\" Journal of Labor Economics 40.S1 (2022): S179-S201. abstract\nBryman, Alan. \"McDonald's as a Disneyized institution: Global implications.\" American Behavioral Scientist 47.2 (2003): 154–167. online\nDerdak, Thomas and Jay P. Pederson, ed. (2004). \"McDonald's\". International directory of company histories (3rd ed.). St. James Press. pp. 108–9. ISBN 978-1-55862-512-9.\nEckhardt, Giana M., and Michael J. Houston. \"Cultural paradoxes reflected in brand meaning: McDonald's in Shanghai, China.\" Journal of International Marketing 10.2 (2002): 68–82 online Archived October 1, 2022, at the Wayback Machine.\nEvans, Stephen (April 20, 2004). \"McDonald's: The journey to health\". BBC News. Retrieved June 30, 2016.\nHorovitz, Bruce (May 8, 2014). \"McDonald's testing seasoned fries\". USA Today. Retrieved June 30, 2016.\nKincheloe, Joe. \"The complex politics of McDonald's and the new childhood: Colonizing kidworld.\" International Critical Childhood Policy Studies Journal 4.1 (2011): 1–46. online\nKincheloe, Joe L. The sign of the burger: McDonald's and the culture of power (Temple University Press, 2002).\nKottak, Conrad P. \"Rituals at McDonald's.\" Journal of American culture 1.2 (1978): 370–376 online.\nKroc, Ray. Grinding It Out: The Making of McDonald's, 1977 ISBN 0809282593 a primary source\nLangert, Bob. The battle to do good: Inside McDonald's sustainability journey (2019).\nLivesey, Sharon M. \"McDonald's and the Environmental Defense Fund: A case study of a green alliance.\" Journal of Business Communication (1973) 36.1 (1999): 5–39.\nLove, John F. McDonald's: Behind The Arches (1995). online\nNapoli, Lisa. Ray & Joan: The Man Who Made the McDonald's Fortune and the Woman Who Gave It All Away. 2016. ISBN 1101984953.\nRam, Uri. \"Glocommodification: How the global consumes the local--McDonald's in Israel.\" Current Sociology 52.1 (2004): 11–31. online\nRoyle, Tony. Working for McDonald's in Europe: the unequal struggle (Routledge, 2004).\nSchlosser, Eric. Fast Food Nation: The Dark Side of the All-American Meal by 2001 ISBN 0395977894.\nSmith, Andrew F. ed. Encyclopedia of Junk Food and Fast Food (2006)\nTien, Nguyen Hoang. \"Customization and Standardization of the Business Strategy of Foreign Enterprises in Vietnam–the McDonald's Case and the Fast Food Sector\" International journal of research in marketing management and sales 1.2 (2019): 44–50. online\nVignali, Claudio. \"McDonald's: 'Think global, act local'–the marketing mix.\" British food journal (2001) online.\nWatson, James L., ed. Golden Arches East: McDonald's in East Asia (Stanford University Press, 2006) excerpt\n\nExternal links\n\nOfficial website\nCorporate website\nBusiness data for McDonald's:",
  "clean_text": "McDonald's Corporation, doing business as McDonald's, is an American multinational fast food restaurant chain. As of 2024, it is the second-largest by number of locations in the world, behind the Chinese chain Mixue Ice Cream & Tea. Brothers Richard and Maurice McDonald founded McDonald's in San Bernardino, California, in 1940 as a hamburger stand. They soon franchised the company. The Golden Arches logo was introduced in 1953. In 1955, the businessman Ray Kroc joined McDonald's as a franchise agent; he bought the company in 1961. In the years since, it has expanded internationally. Today, McDonald's has more than 40,000 restaurant locations worldwide, with around one-quarter in the US. Other than food sales, McDonald's generates income through its ownership of 70% of restaurant buildings and 45% of the underlying land (which it leases to its franchisees). In 2018, McDonald's was the world's second-largest private employer after Walmart; most of its 1.7 million employees work in the restaurant's franchises. McDonald's bestselling licensed items are their french fries and Big Mac hamburgers; other fare includes cheeseburgers, chicken, fish, fruit, and salads. McDonald's has been criticized for its foods' nutrition, animal welfare and low worker wages. History Origin Siblings Richard and Maurice McDonald, with the goal of making $1 million before they turned 50, opened the first McDonald's at 1398 North E Street at West 14th Street in San Bernardino, California, on May 15, 1940. Speedee Service System The McDonald brothers introduced the \"Speedee Service System\" in 1948, putting into expanded use the principles of the modern fast-food restaurant that predecessor White Castle had put into practice more than two decades earlier. When the brothers made the Speedee Service System, they fired their 20 carhops, removed their silverware and plates for paper wrappings and cups so that they no longer needed a dishwasher, and simplified their menu to just nine items: hamburgers, cheeseburgers, three soft drink flavors in one 12-ounce size, milk, coffee, potato chips and pie. \"Our whole concept was based on speed, lower prices, and volume,\" Richard McDonald later said. Mascots The original mascot of McDonald's was a hamburger-headed chef who was referred to as \"Speedee\". In 1962, the Golden Arches replaced Speedee as the universal mascot. Clown mascot Ronald McDonald was introduced in 1963 to market the chain to children. Ray Kroc The present corporation credits its founding to franchised businessman Ray Kroc on April 15, 1955. This was the ninth opened McDonald's restaurant overall, although this location was destroyed in 1984 after the San Ysidro McDonald's massacre. Kroc was recorded as being an aggressive business partner, driving the McDonald brothers out of the industry. Kroc and the McDonald brothers fought for control of the business, as documented in Kroc's autobiography. In 1961, he purchased the McDonald brothers' equity in the company and began the company's worldwide reach. The sale cost Kroc $2.7 million (worth almost $28,410,134 in the current day). The San Bernardino restaurant was eventually torn down in 1971, and the site was sold to the Juan Pollo chain in 1998. This area serves as headquarters for the Juan Pollo chain, and a McDonald's and Route 66 museum. With the expansion of McDonald's into many international markets, the company has become a symbol of globalization and the spread of the American way of life. Changes In 1994, McDonald's banned smoking at the 1,400 locations it wholly owned. In 2006, McDonald's introduced its \"Forever Young\" brand by redesigning all of its restaurants. The restaurants were turned into cafe-esque space, being mostly terracotta, grey, and olive. The redesigned restaurants were also primary furnished with wood furniture. One McDonald's franchise owner described the new look as, \"It’s personable. It’s friendly. It’s inviting.\" As a result of the COVID-19 pandemic, McDonald's closed most seating and all play areas in its United States restaurants. It transitioned to drive-through and curbside orders at locations and online food ordering delivery services. Products Menu McDonald's predominantly sells hamburgers, cheeseburgers, various types of chicken, chicken sandwiches, french fries, soft drinks, shakes, breakfast items, and desserts. In most markets, McDonald's offers salads and vegetarian items, wraps and other localized fare. On a seasonal basis, McDonald's offers the McRib sandwich. During March of each year, McDonald's offers a Shamrock Shake to honor Saint Patrick's Day. The company often introduces items temporarily or brings them back after long absences. In addition, the chain also sells some items within the United States on a regional basis; for example, the Hatch Green Chile Double Cheeseburger, which is topped with New Mexico green chile, is only available in the southwestern state of New Mexico. In 2021, the company cut value meals and cheaper items from its menu as part of a focus on higher-priced items. McValue Meal Deal The McValue Meal, which has four items and was created in 2024. The meal deal is in the McValue menu and costs $5. It was created to be a budget friendly meal on the McValue menu. Health improvements When Steve Easterbrook became CEO of the company in 2015, McDonald's streamlined the menu which in the United States contained nearly 200 items. The company looked to introduce healthier options and removed high-fructose corn syrup from hamburger buns. The company removed artificial preservatives from Chicken McNuggets, replacing chicken skin, safflower oil and citric acid found in Chicken McNuggets with pea starch, rice starch, and powdered lemon juice. In September 2018, McDonald's USA announced that they no longer use artificial preservatives, flavors and colors entirely from seven classic burgers sold in the U.S., including the hamburger, cheeseburger, double cheeseburger, McDouble, Quarter Pounder with Cheese, double Quarter Pounder with Cheese and the Big Mac. Nevertheless, the pickles will still be made with an artificial preservative, although customers can choose to opt out of getting pickles with their burgers. McPlant In November 2020, McDonald's announced McPlant, a plant-based burger, along with plans to develop additional meat alternative menu items that extend to chicken substitutes and breakfast sandwiches. This announcement came after the successful testing of Beyond Meat plant based meat substitutes. In late 2022, McDonald's announced the addition of the Double McPlant at all restaurants in the United Kingdom and Ireland starting January 4 due to the success of the McPlant. In 2024, select McDonald's in the UK were testing vegan ice cream called Choco Scoop and Strawberry Scoop and receiving positive reviews. International menu variations Asia McDonald's Menu is customized to reflect consumer tastes in their respective countries. Restaurants in several countries, particularly in Asia, serve soup. This local deviation from the standard menu is a characteristic for which the chain is particularly known and one which is employed either to abide by regional food taboos (such as the religious prohibition of beef consumption in India) or to make available foods with which the regional market is more familiar (such as the sale of McRice in Indonesia, or Ebi (prawn) Burger in Singapore and Japan). McDonald's restaurants in China include fried buns and soybean milk on their breakfast menus. In partnership with the Central Food Technological Research Institute in India, McDonald's has introduced millet-based buns on September 4, 2024. Three major (Pearl millet, Sorghum, and Finger millet) and two minor (Proso and Paspalum scrobiculatum) millets are used which makes up 22% of the bun. It provides more calcium, iron, and protein in addition to a small amount of complex carbs to aid in satiety more quickly. Europe and New Zealand In France, McDonald's is called McDo. They sell macaroons, Croque McDos, croissants, pain au chocolat, and beer. In Germany and some other Western European countries, McDonald's also sells beer. In Greece, the signature hamburger, Big Mac, is changed by adding Tzatziki sauce and packaging in a pita. In New Zealand, until 2020, McDonald's sold meat pies after local affiliate McDonald's New Zealand (known locally as \"Macca's\") partially relaunched the Georgie Pie fast food chain it bought out in 1996. North America In the United States and Canada, after limited trials on a regional basis, McDonald's began offering in 2015 and 2017, respectively, a partial breakfast menu during all hours its restaurants were open. All-day breakfast was phased out from menus in the United States at the start of the COVID-19 pandemic in 2020. The all-day breakfast menu is still available in select locations across Canada. Types of McDonald's locations and McDonald's subsidiaries In the United States, most standalone McDonald's restaurants offer both counter service and drive-through service, with indoor and sometimes outdoor seating. In 1994, McDonald's attempted Hearth Express, a prototype specializing in homestyle takeout meals. Among the fare offered were meatloaf, fried chicken, and baked ham. This experiment started with a single location in Darien, Illinois but closed after one year. McDrive Drive-Thru, Auto-Mac, Pay and Drive, or \"McDrive\" as it is known in many countries, often has separate stations for placing, paying for, and picking up orders while the customer remains in their vehicle; it was first introduced in Sierra Vista, Arizona in 1975, following the lead of other fast-food chains. The first such restaurant in Britain opened at Fallowfield, Manchester, in 1986. In some countries, McDrive locations near highways offer no counter service or seating. In contrast, locations in high-density city neighborhoods often omit drive-through service. There are also a few locations, mostly in downtown districts, that offer a \"Walk-Thru\" service in place of Drive-Thru. McCafé McCafé is a café-style accompaniment to McDonald's restaurants. The concept was created by McDonald's Australia, starting with Melbourne in 1993. In China, McCafé has expanded through small-format retail concepts such as kiosks, walk-up stands, and mobile coffee trucks. These formats support high-density areas and office districts where full restaurant build-outs are impractical. McDonald's Next McDonald's Next uses open-concept design and offers \"Create Your Taste\" digital ordering. The concept store also offers free mobile device charging and table service after 6:00 pm. The first store opened in Hong Kong in December 2015. The buildings are not colorful, and instead use more natural colors, like from concrete and unpolished oak. PlayPlaces McDonald's playgrounds used to be called Playlands and were outside. After concerns were raised that the playgrounds were dangerous, McDonald's moved them inside and began to make them out of softer materials, such as plastic instead of metal. They renamed them PlayPlaces in 1987. McExpress and McStop Some locations are connected to gas stations and convenience stores, while others called McExpress have limited seating or menu or may be located in a shopping mall. Other McDonald's are located in Walmart stores. McStop is a location targeted at truckers and travelers who may have services found at truck stops. CosMc's In July 2023, the company announced it was working toward a new fast-food brand called CosMc's, which would be tested at 10 sites. The first location was opened in December 2023 in Bolingbrook, Illinois. The outlet had a smaller real-estate footprint than regular McDonald's restaurants and focused on selling coffee and other drinks to afternoon customers. The name for the new brand came from CosMc, a McDonaldland mascot that appeared in advertisements in the late 1980s and early 1990s. Although four additional locations were eventually opened in Texas, McDonald's announced in May 2025 that all locations would be shuttered and the associated app removed by the end of June of that year. Some CosMc's beverage flavors will be tested in other U.S. McDonald's locations. Corporate overview Statistics McDonald's restaurants are in 120 countries and territories and serve 68 million customers daily. There are 41,800 McDonald's locations as of 2023, and 45,000 employees in the United States. The McDonald's on-demand delivery concept, which began in 2017 with a partnership with Uber Eats and added DoorDash in 2019 (with select locations adding Grubhub in 2021), accounts for up to 3% of all business as of 2019. The $100 billion in sales generated by McDonald's company-owned and franchise restaurants in 2019 accounts for almost 4% of the estimated $2.5 trillion global restaurant industry. Stock holdings Focusing on its core brand, McDonald's began divesting itself of other chains it had acquired during the 1990s. The company owned a majority stake in Chipotle Mexican Grill until October 2006, when McDonald's fully divested from Chipotle through a stock exchange. Until December 2003, it owned Donatos Pizza, and it owned a small share of Aroma Café, from 1999 to 2001. On August 27, 2007, McDonald's sold Boston Market to Sun Capital Partners. McDonald's has increased shareholder dividends for 25 consecutive years, making it one of the S&P 500 Dividend Aristocrats. The company is ranked 131st on the Fortune 500 of the largest United States corporations by revenue. In October 2012, its monthly sales fell for the first time in nine years. In 2014, its quarterly sales fell for the first time in seventeen years, when its sales dropped for the entirety of 1997. Monetary loss In the United States, it is reported that drive-throughs account for 70 percent of sales. McDonald's closed down 184 restaurants in the United States in 2015, which was 59 more than what they planned to open. This move was the first time McDonald's had a net decrease in the number of locations in the United States since 1970. In the first three months of 2025, as U.S. President Donald Trump's tariff plans began to be unveiled and implemented, McDonald's revenue in the US fell 3.6% compared to the previous year, the largest sales decline in the US since the peak of the COVID-19 pandemic. Business trends The key trends for the McDonald's Corp. are (as of the financial year ending December 31) Business model Ownership McDonald's owns the land on which many of its restaurants are situated, which is valued at an estimated $42 billion. The company earns a significant portion of its revenue from rental payments from franchisees. These rent payments rose 26 percent between 2010 and 2015, accounting for one-fifth of the company's total revenue at the end of the period. In recent times, there have been calls to spin off the company's U.S. holdings into a potential real estate investment trust, but the company announced at its investor conference on November 10, 2015, that this would not happen. CEO Steve Easterbrook discussed that pursuing the REIT option would pose too large a risk to the company's business model. McDonald's trains its franchisees and management at one of the Hamburger Universities. As of 2015, the Hamburger Universities reside in Oak Brook, Tokyo, London, Sydney, Munich, São Paulo, Shanghai, and Moscow. In other countries, McDonald's restaurants are operated by joint ventures of McDonald's Corporation and other, local entities or governments. QSC&V (Quality, Service, Cleanliness & Value) is a corporate motto adopted by McDonald's to describe the company's philosophy for operating restaurants. The motto is codified in the procedures McDonald's uses to evaluate its franchisees. Workers According to Fast Food Nation by Eric Schlosser (2001), nearly one in eight workers in the U.S. have at some time been employed by McDonald's. Employees are encouraged by McDonald's Corp. to maintain their health by singing along to their favorite songs to relieve stress, attending church services to have a lower blood pressure, and taking two vacations annually to reduce the risk for myocardial infarction. Fast Food Nation states that McDonald's is the largest private operator of playgrounds in the U.S., as well as the single largest purchaser of beef, pork, potatoes, and apples. The selection of meats McDonald's uses varies to some extent based on the host country's culture. Headquarters On June 13, 2016, McDonald's confirmed plans to move its global headquarters to Chicago's West Loop neighborhood in the Near West Side. The 608,000-square-foot structure opened on June 4, 2018, and was built on the former site of Harpo Productions. The McDonald's former headquarters complex, McDonald's Plaza, is in Oak Brook, Illinois. It sits on the site of the former headquarters and stabling area of Paul Butler, the founder of Oak Brook. McDonald's moved into the Oak Brook facility from an office within the Chicago Loop in 1971. Board of directors As of December 2024, the board of directors had the following members: Chris Kempczinski; chairman and CEO of McDonald's Anthony G. Capuano, CEO of Marriott International Kareem Daniel, former chairman of Disney Media and Entertainment Distribution Lloyd H. Dean, president and CEO of Dignity Health Catherine M. Engelbert, commissioner of the Women's National Basketball Association Margo Georgiadis, former CEO of Ancestry.com Mike Hsu, chairman and CEO of Kimberly-Clark John J. Mulligan, executive vice president and COO of Target Corporation Jennifer L. Taubert, Executive Vice President and Worldwide Chairman, Innovative Medicine, Johnson & Johnson Paul S. Walsh, executive chairman of McLaren Group Amy E. Weaver, President and Chief Financial Officer of Salesforce Miles D. White, chairman and CEO of Abbott Laboratories Steve Easterbrook was CEO and president of McDonald's from 2015 to 2019, replacing the old CEO Don Thompson. McDonald's board of directors voted to remove Easterbrook as CEO since he had violated corporate policies on personal conduct by entering into a relationship with a company employee. He was replaced as CEO by Chris Kempczinski, who had been president of McDonald's USA. In August 2022, McDonald's announced significant changes to its board. It said that existing director Sheila Penrose, chair of JLL Inc., would retire and that Anthony Capuano, CEO of Marriott International, executive vice president and worldwide chairman of pharmaceuticals Jennifer Taubert of Johnson & Johnson, and Amy Weaver president and CFO of Salesforce would join. The changes were unrelated to an effort by activist investor Carl Icahn. Ownership Global operations International influence McDonald's has become emblematic of globalization, sometimes referred to as the \"McDonaldization\" of society. The Economist newspaper uses the \"Big Mac Index\": the comparison of the cost of a Big Mac in various world currencies can be used to informally judge these currencies' purchasing power parity. Switzerland has the most expensive Big Mac in the world as of July 2015, while the country with the least expensive Big Mac is India (albeit for a Maharaja Mac—the next cheapest Big Mac is Hong Kong). The northernmost McDonald's restaurant in the world is located in Rovaniemi, Finland (after the restaurant in Murmansk, Russia was closed in 2022), however from January 2024 this had changed again as McDonald's opened a new restaurant in Tromsø, Norway. And the southernmost in the world is located in Invercargill, New Zealand. Thomas Friedman said that no country with a McDonald's had gone to war with another. McDonald's suspended operations in its corporate-owned stores in Crimea after Russia annexed the region in 2014. On August 20, 2014, as tensions between the United States and Russia strained over the Russian annexation of Crimea, and the resultant U.S. sanctions, the Russian government temporarily shut down four McDonald's outlets in Moscow, citing sanitary concerns. The company has operated in Russia since 1990 and, in August 2014, had 438 stores across the country. On August 23, 2014, Russian Deputy Prime Minister Arkady Dvorkovich ruled out any government move to ban McDonald's and dismissed the notion that the temporary closures had anything to do with the sanctions. Some observers have suggested that the company should be given credit for increasing the service standard in markets it enters. A group of anthropologists in a study entitled Golden Arches East looked at McDonald's impact on East Asia and Hong Kong, particularly. When it opened in Hong Kong in 1975, McDonald's was the first restaurant to consistently offer clean restrooms, driving customers to demand the same of other restaurants and institutions. McDonald's has partnered with Sinopec, the second-largest oil company in the People's Republic of China, as it takes advantage of the country's growing use of personal vehicles by opening numerous drive-through restaurants. Global activities In Beijing, China, McDonald's restaurants are state-owned enterprises operating according to franchise agreements. Beijing Capital Agricultural Group owns these franchises. McDonald's has opened a McDonald's restaurant and McCafé on the underground premises of the French fine arts museum, The Louvre. The company opened vegetarian-only restaurants in India. The first one opened in 2012 at Amritsar, India. On January 9, 2017, 80% of the franchise rights in mainland China and Hong Kong were sold for US$2.08 billion to a consortium of CITIC Limited (for 32%). Private equity funds managed by CITIC Capital (for 20%) and Carlyle (for 20%), which CITIC Limited and CITIC Capital would form a joint venture to own the stake. On the river Elbe in Hamburg, Germany, is the world's only \"McBoat\", a float-through service (similar to drive-through) for people on the river. In Sweden, Happy Meal boxes can be used as goggles, with the game Slope Stars. In the Netherlands, McDonald's has introduced McTrax that doubles as a recording studio; it reacts to touch. They can create their own beats with a synth and tweak sounds with special effects. In March 2022, McDonald's closed and sold their 850 locations in Russia due to the invasion of Ukraine. Approximately nine percent of global revenue and three percent of operating profit had come from Russia and the 100 locations in Ukraine. They sold the restaurants to a Russian buyer under the condition that the locations would not use the McDonald's branding. The new stores were rebranded as Vkusno i tochka, beginning to reopen in June. Later in 2022, the 25 McDonald's restaurants in Belarus rebranded as Vkusno i tochka and operations were suspended in Kazakhstan due to issues supplying minced meat from Russia. They rebranded the following year. During the Gaza war, McDonald's branches in Muslim countries were boycotted after McDonald's branches in Israel provided free meals to the Israel Defense Forces, who had been accused of committing war crimes. McDonald's in some countries distanced themselves from the actions of McDonald's Israel. As a result, McDonald's bought all 225 Israeli franchise-owned restaurants. McDonald's employee relations United States Technology uses Since the late 1990s, McDonald's has attempted to replace employees with electronic kiosks that would perform actions such as taking orders and accepting money. In 1999, McDonald's first tested \"E-Clerks\" in suburban Chicago, Illinois, and Wyoming, Michigan, with the devices being able to \"save money on live staffers\" and attracting larger purchase amounts than average employees. In 2013, the University of Oxford estimated that in the succeeding decades, there was a 92% probability of food preparation and serving becoming automated in fast food establishments. By 2016, McDonald's \"Create Your Taste\" electronic kiosks were seen in some restaurants internationally where customers could custom order meals. In 2017, McDonald's launched an app in the United States that allows customers to skip the ordering line inside or drive through and order online. Many McDonald's locations have special parking spaces for such orders. In September 2019, McDonald's purchased an AI-based start-up, Apprente, to replace human servers with voice-based technology in its US drive-throughs. In early 2023, McDonald's opened its first largely automated restaurant in Fort Worth, Texas. The restaurant in question would de-emphasize human contact when ordering, with employees available if there were problems but who would otherwise be absent from the ordering process (along with others working in the kitchen or other back-of-the-house roles). There was no seating in this restaurant. Worker complaints In March 2015, McDonald's workers in 19 U.S. cities filed 28 health and safety complaints with the U.S. Occupational Safety and Health Administration, which allege that low staffing, lack of protective gear, poor training, and pressure to work fast resulted in injuries. The complaints allege that, because of a lack of first aid supplies, workers were told by management to treat burn injuries with condiments such as mayonnaise and mustard. The Fight for $15 labor organization aided the workers in filing the complaints. The Roosevelt Institute, a liberal think tank, accuses some McDonald's restaurants of actually paying less than the minimum wage to entry positions due to \"rampant\" wage theft. France Workers at the McDonald's franchise at Saint-Barthélémy, Marseille, occupied the restaurant in protest against its planned closure. Employing 77 people, the restaurant is the second-biggest private sector employer in Saint-Barthélémy, which has an unemployment rate of 30 percent. Lawyers for Kamel Guemari, a shop steward at the franchise, claimed an attempt was made to kill him when a car drove at him in the restaurant car park. South Korea In South Korea, McDonald's pays part-time employees $5.50 an hour and is accused of paying less with arbitrary schedule adjustments and pay delays. United Kingdom As of 2013, 90% of McDonald's UK workforce were on zero-hour contracts, making it potentially the largest such private sector employer in the country. In April 2017, after workers engaged in labor strke, all employees were given the option of fixed contracts. From 2007 to 2011, fast food workers in the U.S. drew an average of $7 billion of public assistance annually resulting from receiving low wages. The McResource website advised employees to break their food into smaller pieces to feel fuller, seek refunds for unopened holiday purchases, sell possessions online for quick cash, and \"quit complaining\" as \"stress hormone levels rise by 15 percent after ten minutes of complaining.\" In December 2013, McDonald's shut down the McResource website amidst negative publicity and criticism. McDonald's plans to continue an internal telephone help line through which its employees can obtain advice on work and life problems. In September 2017, two British McDonald's stores agreed to a strike over zero-hours contracts for staff. Picket lines were formed around the two stores in Crayford and Cambridge. The strike was supported by then Leader of the Opposition Jeremy Corbyn. Criticism McDonald's has been criticized for numerous aspects of its business, including its products' health effects, employees' treatment, and other business practices. In 2001, Eric Schlosser's book Fast Food Nation criticised aspects of McDonald's business practices, particularly around its political lobbying and criticism of the business practices of McDonald's, particularly concerning its use of political influence and targeting advertisements to children. Nutrition In 1990, activists from a small group known as London Greenpeace (no connection to the international group Greenpeace) distributed leaflets entitled What's wrong with McDonald's?, criticizing its environmental, health, and labor record. The corporation wrote to the group demanding they desist and apologize, and, when two of the activists refused to back down, sued them for libel leading to the \"McLibel case\", one of the longest cases in English civil law. A documentary film of the McLibel Trial has been shown in several countries. Morgan Spurlock's 2004 documentary film Super Size Me claimed that McDonald's food was contributing to the increase of obesity in society and that the company was failing to provide nutritional information about its food for its customers. Six weeks after the film premiered, McDonald's announced that it was eliminating the super size option and was creating the adult Happy Meal. In response to public pressure, McDonald's has sought to include more healthy choices in its menu, announcing in May 2008 that, in the United States and Canada, it has switched to using cooking oil that contains no trans fats for its french fries, and canola-based oil with corn and soy oils, for its baked items, pies, and cookies, by the end of 2018. The company introduced a new slogan to its recruitment posters: \"Not bad for a McJob.\" Animal welfare McDonald's has been criticized for using factory farmed fast growing chicken breeds in their supply chain. These breeds are more likely to suffer from welfare issues such as broken or fractured bones, leg deformities and heart failure. Since McDonald's purchases over 2 billion eggs per year, which accounts for about 4 percent of eggs produced in the United States, the switch to cage-free eggs is expected to have a major impact on the egg industry. It is part of a general trend toward cage-free eggs driven by consumer concern over the harsh living conditions of hens. In 2014, McDonald's pledged to stop using eggs from battery cage facilities in restaurants in Australia by 2017, which was met in 2018. McDonald's has been the subject of animal rights activism. In 2021, Animal Rising blockaded four UK distribution centers using bamboo towers, leading to food shortages at restaurants. They cited \"suffering of animals\" in the McDonald's supply chain as a motivating factor. Legal cases McDonald's has been involved in several lawsuits and other legal cases, most involving trademark disputes. The company has threatened many food businesses with legal action unless it drops the 'Mc' or 'Mac' from trading names. European Union In April 2017, Irish fast-food chain Supermac's submitted a request to the European Union Property Office to cancel McDonald's owned trademarks within the European Union, claiming that McDonald's engaged in \"trademark bullying; registering brand names... which are simply stored away in a war chest to use against future competitors\", after the trademarks had prevented Supermac's from expanding out of Ireland. The EUIPO ruled in Supermac's favor, finding that McDonald's \"has not proven genuine use\" of many trademarks, canceling McDonald's owned trademarks such as \"Big Mac\" and specific \"Mc\"-related trademarks within the European Union. Burger King responded by \"trolling\" McDonald's by giving their burgers names that included the words \"Big Mac\" that also mocked the original burger, which included \"Like a Big Mac But Juicier\", \"Like a Big Mac, But Actually Big\" and \"Big Mac-ish But Flame-Grilled of Course.\" In 2023, the EUIPO Board of Appeal partially annulled their decision after McDonald's filed 700 pages of additional evidence despite objections. However, on further appeal to the European Court of Justice, the court ruled in 2024 that McDonald's had failed to prove the use of the Big Mac trademark in relation to chicken products or services associated with operating restaurants, meaning Supermac's and other businesses are now free to use the \"Mac\" in their business names and in names for poultry products in Europe. McDonald's retains the Big Mac trademark solely for its beef burgers. The McDonald's group has had proceedings taken against it by the French Tax Authorities, with possible charges of criminal tax fraud. In July 2022, the group reached an agreement with the French judicial authorities to end criminal proceedings for tax fraud. Malaysia On September 8, 2009, McDonald's Malaysian operations lost a lawsuit to prevent another restaurant from calling itself McCurry. McDonald's lost in an appeal to Malaysia's highest court, the Federal Court. On December 29, 2016, McDonald's Malaysian issue a statement that said only certified halal cakes are allowed inside its restaurants nationwide. United Kingdom The longest-running legal action of all time in the UK was the McLibel case against two defendants who criticized several aspects of the company. The trial lasted ten years and called 130 witnesses. The European Court of Human Rights deemed that the unequal resources of the litigants breached the defendants' rights to freedom of speech and biased the trial. The result was widely seen as a \"PR disaster\" for McDonald's. In 2021, it emerged that at least 50 employees had filed charges against the chains regarding harassment in the workplace in five years, leading to the company instituting anti-harassment training. Some of the complainants also stated that they were verbally and physically harassed in retaliation for their complaints. In 2023, the BBC conducted an investigation, and reported that more than 100 current and recent UK workers at outlets of the fast-food chain allege there is a continuing toxic culture of sexual assault, harassment, racism and bullying. In January 2025, it was reported that over 700 young workers had filed lawsuits against McDonald's UK, alleging widespread harassment and discrimination. The claims, handled by the law firm Leigh Day, involved current and former employees under the age of 20 and spanned more than 450 restaurants. Following a BBC investigation in July 2023, testimonies highlighted issues such as racism, homophobia, ableism, and harassment. McDonald's UK, dismissed 29 workers for sexual harassment in 2023 and established a specialist unit to investigate such allegations. However, unions argued that these measures did not resolve the issues. Employees shared accounts of inappropriate behavior, including homophobic remarks, sexual advances, and unwanted physical contact from managers. Similar allegations had been raised in 2019, with the Bakers, Food and Allied Workers Union reporting over 1,000 cases of harassment involving female employees. In March 2025, the Equality and Human Rights Commission wrote to all 1,400 McDonald's branches telling them they must comply with their legal duties, or risk enforcement action. In June 2025, it was reported that McDonald's was attempting to block the expansion of the Irish chain Supermac's into the UK market and intended to proceed with IPO trademark court proceedings in the UK, despite having been unsuccessful in similar proceedings against Supermac's in the EU in 2024. United States The 1994 court case Liebeck v. McDonald's Restaurants examined a McDonald's practice of serving coffee so hot that when spilled, it caused third degree burns requiring weeks of hospitalization and skin grafting surgery. The trial outcome was an award of $2.86 million (equivalent to $5.47 million in 2024) for the plaintiff, 81-year old Stella Liebeck. The amount was later reduced to $640,000 (equivalent to $1.2 million in 2024). In 2019, a McDonald's employee, Jenna Ries, sued the restaurant chain over allowing sexual harassment in the workplace and described the working environment as \"toxic\". In 2023, an investigation by the United States Department of Labor found child labor violations at McDonald's franchises in the state of Kentucky, which involved over 300 children, two of them 10-year-olds. A total of $212,000 was levied against three franchises for the violations. Further investigations uncovered child labor violations involving 83 minors at 16 different locations in Louisiana and Texas, with imposed fines amounting to $77,572. Marketing and advertising McDonald's has maintained an extensive advertising campaign for decades. In addition to the usual media (television, radio, and newspaper), the company makes use of billboards and signage. Also, it sponsors sporting events ranging from Little League to the FIFA World Cup and Olympic Games. Television has been central to the company's advertising strategy. To date, McDonald's has used 23 different slogans in United States advertising, as well as a few other slogans for select countries and regions. Children's advertising McDonald's uses playgrounds, games, and toys to make children want to go to McDonald's. Celebrity endorsements Sports In 1992, basketball player Michael Jordan became the first celebrity to have a McDonald's value meal named after him. The \"McJordan\" was available at Chicago franchises. The exclusivity of the meal lead to fans in other regions being envious, more notably leading to a man buying a gallon of the McJordan BBQ sauce for 10,000 dollars. LeBron James was a spokesman for McDonald's from 2003 to 2017, while co-endorsing Coca-Cola-Sprite since early in his career. In January 2025, WNBA player Angel Reese became the first woman to partner with McDonald's, creating the Angel Reese Special. Ordering the meal as a double Quarter Pounder was promoted in reference to Reese's consistent double-doubles during games. Music In September 2020, McDonald's partnered with rapper Travis Scott to release the \"Travis Scott Meal\" nationwide. Scott designed new uniforms for McDonald's employees and released Cactus Jack merchandise using vintage visuals from the fast food chain's history. The company followed up with the \"J Balvin Meal\" in a partnership with reggaeton singer J Balvin. In 2021, McDonald's partnered with Korean boy group BTS to release the \"BTS Meal\" in 50 countries around the world, starting on May 26 in select countries. Space exploration McDonald's and NASA explored an advertising agreement for a planned mission to the asteroid 449 Hamburga; however, the spacecraft was eventually canceled. Sponsorship in NASCAR McDonald's entered the NASCAR Cup Series in 1977, sponsoring Richard Childress for one race. Between 1977 and 1986, McDonald's only sponsored a handful of races in a season. In 1993, McDonald's became the full-time sponsor for the No. 27 Junior Johnson & Associates Ford, driven by Hut Stricklin. In 1994, Stricklin was replaced in the car by Jimmy Spencer, who went on to win twice that season. The following season McDonald's would move over to the No. 94 Bill Elliott Racing Ford, driven by team-owner Bill Elliott. McDonald's stayed with Elliott until the 2001 season when they moved again, this time to the No. 96 PPI Motorsports Ford, driven by rookie Andy Houston. However, when the team failed to field a car for the entire season, McDonald's became absent from NASCAR until 2004, when it joined Evernham Motorsports as a part-time sponsor for drivers Elliott, Kasey Kahne, Elliott Sadler, A. J. Allmendinger, and Reed Sorenson until 2010. During the 2010 season, McDonald's entered its longest partnership with a team at Chip Ganassi Racing, sponsoring the No. 1 Chevrolet driven by Jamie McMurray until his final race in the 2019 Daytona 500. McDonald's moved to CGR's No. 42 of Kyle Larson, whom the company sponsored until his suspension in 2020, and also had a one-race partnership with Richard Petty Motorsports' No. 43 Chevrolet driven by Bubba Wallace in 2019 and 2020. McDonald's continued working with the No. 42 under new driver Ross Chastain in 2021 and also joined Wallace's new team 23XI Racing as a \"founding partner\". Charity McHappy Day is an annual event at McDonald's, during which a percentage of the day's sales go to charity. It is the signature fundraising event for Ronald McDonald House Charities (RMHC). According to the Australian McHappy Day website, McHappy Day raised $20.4 million in 2009. The goal for 2010 was $20.8 million. Ronald McDonald House Charities is a global network of more than 260 Chapters that is made to help families access medical care for their children and family support services in more than 60 countries and regions throughout the world. In 2022, over $182 million were donated to Ronald McDonald House Charities from McDonald's, its franchisees, and its customers. In 1995, St. Jude Children's Research Hospital received an anonymous letter postmarked in Dallas, Texas, containing a $1 million winning McDonald's Monopoly game piece. McDonald's officials came to the hospital, accompanied by a representative from the accounting firm Arthur Andersen, who examined the card under a jeweler's eyepiece, handled it with plastic gloves, and verified it as a winner. Future plans McDonald's has many plans to expand, digitize, and reduce carbon emissions in the near future. McDonald's wants to add 900 McDonald's restaurants in the U.S. and 10,000 more worldwide (totaling 50,000 restaurants globally) by 2027. McDonald's has committed to eliminating deforestation from its global supply chain by 2030 for beef and four other commodities. The company also has a 2050 net-zero carbon emissions commitment, to bring global carbon emissions down. Digitizing the Arches is a new initiative of McDonald's. From this, McDonald's announces a partnership with Google to automate restaurants using artificial intelligence, and Google Cloud technology. They also plan to expand the McDonald's loyalty program from 150 million to 250 million 90-day active users by 2027. McDonald's is also planning to expand its digital ordering system to 30% of deliveries originating from their app by 2027."
}