{
  "ticker": "MCHP",
  "cik": "0000827054",
  "company_name": "Microchip Technology",
  "corrected_name": "Microchip Technology",
  "wiki_title_used": "Microchip Technology",
  "exists": true,
  "raw_text": "Microchip Technology Incorporated is an American publicly traded semiconductor corporation that manufactures microcontroller, mixed-signal, analog, and Flash-IP integrated circuits.\nIts corporate headquarters is located in Chandler, Arizona. Its wafer fabs are located in Gresham, Oregon, and Colorado Springs, Colorado. The company's assembly/test facilities are in Chachoengsao, Thailand, and Calamba and Cabuyao, Philippines.\nMicrochip Technology offers support and resources to educators, researchers and students in an effort to increase awareness and knowledge of embedded applications.\n\nHistory\nOrigins\nMicrochip Technology was founded in 1987 when General Instrument spun off its microelectronics division as a wholly owned subsidiary. The newly formed company was a supplier of programmable non-volatile memory, microcontrollers, digital signal processors, card chip on board, and consumer integrated circuits. An initial public offering (IPO) later in the year was canceled because of the October 1987 stock market crash.\nMicrochip Technology became an independent company in 1989 when it was acquired by a group of venture capitalists led by Sequoia Capital. In the same year, Microchip Technology announced the release of small, inexpensive 8-bit reduced instruction set computing (RISC) microcontrollers for $2.40 apiece, whereas most RISC microcontrollers were 32-bit devices selling for hundreds of dollars.\n\n1990-2024\nIn 1990, 60% of Microchip Technology's sales were from the disc drive industry and the product portfolio relied heavily on commodity EEPROM products. The company was losing US$2.5 million per quarter, had less than 6 months of cash in reserve, had exhausted lines of credit, and was failing to control expenses. Early in the year, the venture capital investors accepted an offer to sell Microchip Technology to Winbond Electronics Corporation of Taiwan for $15M. Winbond Electronics backed out of the deal after the Taiwanese stock market decreased in May 1990. Vice President of Operations, Steve Sanghi, was named president and chief operating officer of Microchip Technology in 1990. After several quarters of losses, Sanghi oversaw Microchip Technology's transition from selling commodity-based products to specialized chips, such as the RISC technology.\nMicrochip Technology conducted an IPO in 1993, which Fortune magazine cited as the best performing IPO of the year with a stock appreciation of 500% and over $1bn in market capitalization. At the end of 2015, Microchip Technology posted its 100th consecutive quarter of profitability.\nIn March 2021, Sanghi was replaced as CEO by Ganesh Moorthy.\n\n2024-present\nIn March 2024, Microchip furloughed production staff and non-manufacturing employees were forced to take a pay-cut for two weeks. This was done again in June. In late November, Moorthy retired as CEO and Steve Sanghi was appointed interim CEO, and was subsequently announced he would continue as CEO and Chairman on a permanent basis on July 2, 2025.\nIn early December 2024, Sanghi announced the closure of Fab 2 in Tempe, Arizona and also announced that Microchip would suspend its application for CHIPS and Science Act funding. On February 10, 2025, Microchip announced that they would again furlough employees intermittently throughout the rest of the year.\n\nAcquisitions\nIn 1995, Microchip acquired KeeLoq technology from Nanoteq of South Africa for $10M in cash. Microchip Technology used the purchase to create the Secure Data Products Group.\nOn May 24, 2000, Microchip acquired a wafer fab in Puyallup, Washington that was formerly owned by Matsushita Electric Industrial Company. On October 19, 2007, due to the great recession, the facility, known as Fab 3, was sold for $30M from an unsolicited offer.\nOn October 27, 2000, Microchip purchased TelCom Semiconductor of Mountain View, California for $300M.\nIn 2002, Microchip acquired a wafer fab in Gresham, Oregon from Fujitsu for $183.5M. This fab became, and still is, Microchip's largest and is known as Fab 4.\nOn October 15, 2008, Microchip acquired Hampshire Company, a company that sold large-format universal touch screen controller electronics and related software.\nOn February 20, 2009, Microchip acquired Australia-based HI-TECH Software.\nOn January 11, 2010, Microchip acquired Thomas H. Lee's Sunnyvale, California-based ZeroG Wireless for an undisclosed amount after a year-long partnership. The deal allowed Microchip to provide a Wi-Fi product for their PIC microcontrollers.\nIn April 2010, Microchip completed the acquisition of Silicon Storage Technology (SST) from for about $292M. Microchip and Cerberus Capital Management both made offers for the company. Microchip sold several SST flash memory assets back to Bing Yeh, co-founder of SST, to another one his companies the next month.\nIn 2012, Microchip acquired German-based Ident Technology AG, California based Roving Networks, and Standard Microsystems Corporation.\nOn June 3, 2013, Microchip acquired Novocell Semiconductor, Inc. through its Silicon Storage Technology (SST) subsidiary.\nIn 2014, Microchip acquired Supertex, Inc and Belgian-based EqcoLogic on February 10, and Taiwan-based ISSC Technologies on May 22.\nOn August 3, 2015, Microchip acquired IC manufacturer Micrel for about $839M.\nIn January 2016, Microchip purchased San Jose, California-based Atmel for $3.56bn. JPMorgan Chase advised Microchip while Qatalyst Partners advised Atmel.\nIn May 2018, Microchip acquired Microsemi Corporation.\nIn October 2020, Microchip acquired New Zealand-based Tekron International Limited for an undisclosed amount.\nIn April 2024, Microchip acquired both South Korea-based VSI Co. Ltd. and Neuronix AI Labs.\n\nProducts\nMicrochip offers 8, 16, and 32-bit microcontrollers including PIC and AVR microcontrollers, microprocessors, analog power management and conversion, CAN and LIN serial communication interface devices, high-voltage MEMS and piezoelectric drivers, ultrasound multiplexers, digital signal controllers, embedded controllers, memory products (including serial EEPROM, serial SRAM, serial flash, serial NvSRAM, serial EERAM, parallel EEPROM, parallel one-time programmable flash, parallel flash and CryptoMemory devices.)\nMicrochip also offers custom programming, AI coding assistant, hardware and software development tools and reference designs. Available reference designs include complete systems, subsystems or functions which are purpose-built and include design files, software and support.\nMicrochip crypto element devices that provide authentication, data integrity, and confidentiality in a variety of applications, such as disposables, accessories and nodes; Timing, communication and real-time clock and calendar products; USB products; Power Management Integrated Circuits (PMICs); and networking products including Ethernet interface and wireless products.\n\nProduct milestones\nIn April 2009, Microchip Technology announced the nanoWatt XLP microcontrollers, claiming the world's lowest sleep current. Microchip Technology had sold more than 6 billion microcontrollers as of 2009. As of 2011, Microchip Technology ships over a billion processors every year. In September 2011, Microchip Technology shipped the 10 billionth PIC microcontroller.\n\nWafer Fabs\nSee also\nATtiny microcontroller comparison chart\nAVR microcontrollers\nKeeLoq\nMiWi\nMPLAB devices\nMPLAB\nPIC microcontrollers\nPICkit\nUNI/O\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Microchip Technology:",
  "clean_text": "Microchip Technology Incorporated is an American publicly traded semiconductor corporation that manufactures microcontroller, mixed-signal, analog, and Flash-IP integrated circuits. Its corporate headquarters is located in Chandler, Arizona. Its wafer fabs are located in Gresham, Oregon, and Colorado Springs, Colorado. The company's assembly/test facilities are in Chachoengsao, Thailand, and Calamba and Cabuyao, Philippines. Microchip Technology offers support and resources to educators, researchers and students in an effort to increase awareness and knowledge of embedded applications. History Origins Microchip Technology was founded in 1987 when General Instrument spun off its microelectronics division as a wholly owned subsidiary. The newly formed company was a supplier of programmable non-volatile memory, microcontrollers, digital signal processors, card chip on board, and consumer integrated circuits. An initial public offering (IPO) later in the year was canceled because of the October 1987 stock market crash. Microchip Technology became an independent company in 1989 when it was acquired by a group of venture capitalists led by Sequoia Capital. In the same year, Microchip Technology announced the release of small, inexpensive 8-bit reduced instruction set computing (RISC) microcontrollers for $2.40 apiece, whereas most RISC microcontrollers were 32-bit devices selling for hundreds of dollars. 1990-2024 In 1990, 60% of Microchip Technology's sales were from the disc drive industry and the product portfolio relied heavily on commodity EEPROM products. The company was losing US$2.5 million per quarter, had less than 6 months of cash in reserve, had exhausted lines of credit, and was failing to control expenses. Early in the year, the venture capital investors accepted an offer to sell Microchip Technology to Winbond Electronics Corporation of Taiwan for $15M. Winbond Electronics backed out of the deal after the Taiwanese stock market decreased in May 1990. Vice President of Operations, Steve Sanghi, was named president and chief operating officer of Microchip Technology in 1990. After several quarters of losses, Sanghi oversaw Microchip Technology's transition from selling commodity-based products to specialized chips, such as the RISC technology. Microchip Technology conducted an IPO in 1993, which Fortune magazine cited as the best performing IPO of the year with a stock appreciation of 500% and over $1bn in market capitalization. At the end of 2015, Microchip Technology posted its 100th consecutive quarter of profitability. In March 2021, Sanghi was replaced as CEO by Ganesh Moorthy. 2024-present In March 2024, Microchip furloughed production staff and non-manufacturing employees were forced to take a pay-cut for two weeks. This was done again in June. In late November, Moorthy retired as CEO and Steve Sanghi was appointed interim CEO, and was subsequently announced he would continue as CEO and Chairman on a permanent basis on July 2, 2025. In early December 2024, Sanghi announced the closure of Fab 2 in Tempe, Arizona and also announced that Microchip would suspend its application for CHIPS and Science Act funding. On February 10, 2025, Microchip announced that they would again furlough employees intermittently throughout the rest of the year. Acquisitions In 1995, Microchip acquired KeeLoq technology from Nanoteq of South Africa for $10M in cash. Microchip Technology used the purchase to create the Secure Data Products Group. On May 24, 2000, Microchip acquired a wafer fab in Puyallup, Washington that was formerly owned by Matsushita Electric Industrial Company. On October 19, 2007, due to the great recession, the facility, known as Fab 3, was sold for $30M from an unsolicited offer. On October 27, 2000, Microchip purchased TelCom Semiconductor of Mountain View, California for $300M. In 2002, Microchip acquired a wafer fab in Gresham, Oregon from Fujitsu for $183.5M. This fab became, and still is, Microchip's largest and is known as Fab 4. On October 15, 2008, Microchip acquired Hampshire Company, a company that sold large-format universal touch screen controller electronics and related software. On February 20, 2009, Microchip acquired Australia-based HI-TECH Software. On January 11, 2010, Microchip acquired Thomas H. Lee's Sunnyvale, California-based ZeroG Wireless for an undisclosed amount after a year-long partnership. The deal allowed Microchip to provide a Wi-Fi product for their PIC microcontrollers. In April 2010, Microchip completed the acquisition of Silicon Storage Technology (SST) from for about $292M. Microchip and Cerberus Capital Management both made offers for the company. Microchip sold several SST flash memory assets back to Bing Yeh, co-founder of SST, to another one his companies the next month. In 2012, Microchip acquired German-based Ident Technology AG, California based Roving Networks, and Standard Microsystems Corporation. On June 3, 2013, Microchip acquired Novocell Semiconductor, Inc. through its Silicon Storage Technology (SST) subsidiary. In 2014, Microchip acquired Supertex, Inc and Belgian-based EqcoLogic on February 10, and Taiwan-based ISSC Technologies on May 22. On August 3, 2015, Microchip acquired IC manufacturer Micrel for about $839M. In January 2016, Microchip purchased San Jose, California-based Atmel for $3.56bn. JPMorgan Chase advised Microchip while Qatalyst Partners advised Atmel. In May 2018, Microchip acquired Microsemi Corporation. In October 2020, Microchip acquired New Zealand-based Tekron International Limited for an undisclosed amount. In April 2024, Microchip acquired both South Korea-based VSI Co. Ltd. and Neuronix AI Labs. Products Microchip offers 8, 16, and 32-bit microcontrollers including PIC and AVR microcontrollers, microprocessors, analog power management and conversion, CAN and LIN serial communication interface devices, high-voltage MEMS and piezoelectric drivers, ultrasound multiplexers, digital signal controllers, embedded controllers, memory products (including serial EEPROM, serial SRAM, serial flash, serial NvSRAM, serial EERAM, parallel EEPROM, parallel one-time programmable flash, parallel flash and CryptoMemory devices.) Microchip also offers custom programming, AI coding assistant, hardware and software development tools and reference designs. Available reference designs include complete systems, subsystems or functions which are purpose-built and include design files, software and support. Microchip crypto element devices that provide authentication, data integrity, and confidentiality in a variety of applications, such as disposables, accessories and nodes; Timing, communication and real-time clock and calendar products; USB products; Power Management Integrated Circuits (PMICs); and networking products including Ethernet interface and wireless products. Product milestones In April 2009, Microchip Technology announced the nanoWatt XLP microcontrollers, claiming the world's lowest sleep current. Microchip Technology had sold more than 6 billion microcontrollers as of 2009. As of 2011, Microchip Technology ships over a billion processors every year. In September 2011, Microchip Technology shipped the 10 billionth PIC microcontroller. Wafer Fabs"
}