{
  "ticker": "MCK",
  "cik": "0000927653",
  "company_name": "McKesson Corporation",
  "corrected_name": "McKesson Corporation",
  "wiki_title_used": "McKesson Corporation",
  "exists": true,
  "raw_text": "McKesson Corporation is an American publicly traded company that distributes pharmaceuticals and provides health information technology, medical supplies, and health management tools. The company delivers a third of all pharmaceutical products used or consumed in North America and employs over 80,000 employees. With $308.9 billion in 2024 revenue, it is the ninth-largest company by revenue in the United States and the nation's largest health care company. The company is headquartered in Irving, Texas. It is a component of the S&P 500 and is listed on the New York Stock Exchange, where it is traded under the ticker symbol \"MCK\".\nMcKesson provides extensive network of infrastructure for the healthcare industry and was an early adopter of technologies, including barcode scanning for distribution, pharmacy robotics, and RFID tags. The company has been named in a federal lawsuit for profiting from the opioid epidemic in the United States.\nThroughout the COVID-19 pandemic, McKesson was a key vaccine distributor, serving as the United States of America Government's centralized distributor for hundreds of millions of COVID-19 vaccine doses and ancillary supply kits for over a billion doses across the United States.\n\nHistory\n19th century\nMcKesson was founded in 1828 in New York City as Charles M. Olcott by Charles M. Olcott. It was later renamed Olcott, McKesson & Co. and John McKesson in 1833, the business began as an importer and wholesaler of botanical drugs. A third partner, Daniel Robbins, who joined the enterprise as it grew, and who previously \"was an assistant to the original partners\", was the \"Robbins\" when the company was renamed McKesson & Robbins following Olcott's death in 1853.\n\n20th century\nThe company successfully emerged from the McKesson and Robbins scandal under CEO Phillip Musica, one of the most notorious business and accounting scandals of the 20th century, a watershed event that led to major changes in American auditing standards and securities regulations after being exposed in 1938.\nIn 1967, Foremost Dairies, a company founded by James Cash Penney, which was headquartered in San Francisco since 1954, acquired McKesson & Robbins in a hostile takeover to form Foremost-McKesson Inc. The Foremost dairy operations were sold in 1982 and the name changed to McKesson Corporation but headquarters remained in San Francisco.\nIn 1999, McKesson acquired medical information systems firm HBO & Company (HBOC). The combined firm operated as McKessonHBOC for two years. Accounting irregularities at HBOC reduced the company's share price by half and resulted in the dismissal and prosecution of many HBOC executives.\n\n21st century\nIn 2001, the company's name reverted to McKesson. In the early 21st century, McKesson increased its market in medical technology through acquisitions, including Per Se Technologies and RelayHealth in 2006 and Practice Partner in 2007.\nOn January 6, 2006, McKesson acquired NDCHealth Corporation.\nIn 2010, McKesson acquired the oncology and physician services company US Oncology, Inc. for $2.16 billion, which was integrated into the McKesson Specialty Health business.\nIn April 2012, McKesson agreed to pay the United States $190M to settle allegations that it had inflated prices and overbilled Medicaid. Three months later, in July 2012, McKesson agreed to pay California and 28 other states $151M to settle allegations that it had inflated prices and overbilled Medicaid.\nOn June 24, 2013, The Wall Street Journal reported that McKesson Chairman and CEO John Hammergren's pension benefits of $159 million had set a record for \"the largest pension on file for a current executive of a public company, and almost certainly the largest ever in corporate America\".\nIn 2013, PSS World Medical was acquired.\nIn 2014, McKesson acquired Celesio to become one of the world's largest healthcare companies, with over $179 billion in annual revenue.\nIn June 2016, McKesson announced plans to merge its IT business with Change Healthcare.\nIn 2017, McKesson was involved in many lawsuits against the state of Arkansas over the supply of vecuronium bromide. McKesson was under contract by Pfizer not to sell to any correctional facility that authorized and carried out capital punishment.\nIn November 2018, the company announced it would relocate its headquarters from San Francisco to Irving, Texas, effective April 1, 2019.\n Also in April 2019, Brian Tyler took over as CEO of the company.\nIn February 2020, McKesson Corp announced that it would part ways with Change Healthcare. McKesson gave up its ownership in the company and its three seats on the company's board of directors.\nIn February 2025, the McKesson Corporation signed a definitive agreement to acquire 80% interest in PRISM Vision Holdings.\n\nOpioid epidemic\nIn 2008, McKesson paid $13 million in fines for failing to report large orders of hydrocodone. In January 2017, McKesson agreed to pay a $150 million civil penalty for alleged similar violations of the Controlled Substances Act regarding the distribution of opioids.\nIn January 2017, McKesson agreed to pay $150M to settle allegations that it had not done enough to track and stop suspicious opioid sales. The agreement also obligated McKesson to suspend all sales of controlled substances from its distribution centers in Colorado, Florida, Ohio, and Michigan for multiple years.\nIn May 2020, Attorney General of Oklahoma Michael J. Hunter sued McKesson in Bryan County District Court, alleging that the company's actions helped fuel Oklahoma's opioid crisis. The suit was filed along with lawsuits against Cardinal Health and AmerisourceBergen, and the three lawsuits allege that the three companies provided \"enough opioids to Bryan County that every adult resident there could have had 144 hydrocodone tablets.\"\nIn January 2022, McKesson, AmerisourceBergen, Cardinal Health, and Johnson & Johnson agreed to pay $26 billion to settle with all but five of the states suing them. Had the states gone to court, the companies could have faced up to $95 billion in penalties.\n\nCOVID-19 pandemic\nIn August 2020, during the COVID-19 pandemic, the CDC and HHS selected McKesson as the U.S. government's centralized distributor for COVID-19 vaccine doses and ancillary supply kits under Operation Warp Speed. The company has played a key role in distributing the Moderna and Johnson & Johnson vaccines while also distributing ancillary supply kits for these as well as for the Pfizer–BioNTech vaccine across the U.S. (in addition to supporting the U.S. government in efforts to send doses and kits abroad).\n\nFinances\nFor the fiscal year 2023, McKesson reported earnings of US$3.56 billion on revenue of US$276.711 billion. As of 2023, McKesson was the nation's largest health care company and the ninth-largest company by total revenue on the Fortune 500.\n\nDivisions\nMcKesson Provider Technologies\nMcKesson Provider Technologies is the retail name for McKesson Technology Solutions; the software development division of McKesson. Their customer base in the United States includes 50% of all health systems, 20% of all physician practices, 25% of home care agencies, and 77% of health systems with more than 200 beds.\nOn June 20, 2005, McKesson Provider Technologies acquired Medcon, Ltd., an Israeli company which provides web-based cardiac image and information management solutions for heart centers, that includes: diagnostic digital image management, archiving, procedure reporting, and workflow management.\nIn October 2013, McKesson agreed to buy a 50% stake in Germany-based Celesio for $8.3 billion.\n\nMcKesson Medical Supplies and Equipment\nMcKesson Medical-Surgical (MMS) offers a large selection of national healthcare brands, along with McKesson's exclusive brand of medical products.\nTheir online medical supply ordering platform serves the needs of physician offices, surgery centers, home health agencies, DMEs, labs, and long-term-care facilities.\nIn 2015, McKesson Medical-Surgical opened its new headquarters in Richmond, Virginia.\n\nHealth Mart pharmacy franchise\nHealth Mart, a network of over 4,000 independently owned and operated pharmacies, is a wholly owned subsidiary of McKesson Corporation, which owns the name \"Health Mart\". McKesson acquired Health Mart owner FoxMeyer in October 1996.\n\nFormer divisions\nMosswood Wine Company\nMcKesson operated the Mosswood Wine Company from 1978 until 1987 when the division was sold to maintain its focus on pharmaceuticals. The division was founded and run by wine writer Gerald Asher.\n\nNDCHealth (Relay Health)\nNDC (from the initials of its former identity as National Data Corporation) became NDC-Health Corp in 2001 following the spin-off of its payments division, Global Payments, in 2000. NDCHealth was acquired by McKesson in 2007 through the purchase of Per-Se Technologies at which time it began doing business as RelayHealth in 2007.\n\nInternational\nMcKesson Canada\nIn 1991, McKesson Corporation acquired a 100 percent interest in Medis Health and Pharmaceutical Services from Provigo. In 2002, the McKesson Canada name was adopted. McKesson Canada is a wholly owned subsidiary of McKesson Corporation. It includes various business units: McKesson Pharmaceutical, McKesson Automation, McKesson Specialty, McKesson Health Solutions, and McKesson Information Solutions.\nIn 2012, McKesson agreed to purchase Canadian pharmacy chains IDA, Guardian Pharmacy, and The Medicine Shoppe from the Katz Group of Companies for $920 million.\nIn March 2016, McKesson agreed to purchase Canadian pharmacy chain Rexall from the Katz Group of Companies for $3 billion. The deal was finalized in December 2016 following approval received under the Investment Canada Act.\nOn April 12, 2017, it was announced that McKesson Canada reached a deal to acquire 330 Uniprix pharmacies.\nIn May 2018, McKesson Canada closed 40 Rexall locations in Ontario and Western Canada.\n\nUnited Kingdom\nIn the United Kingdom, McKesson, operating as McKesson Information Solutions UK Ltd, was a provider of information technology services to the healthcare industry. In addition to numerous clinical software systems and finance and procurement services, McKesson also was responsible for developing the Electronic Staff Record system for the National Health Service which provided an integrated payroll system for NHS's 1.3 million staff, making it the world's largest single payroll IT system. McKesson Shared Services also provided payroll services for over 20 NHS Trusts, paying over 100,000 NHS members.\nMcKesson's United Kingdom base was in Warwick with data centers in Newcastle upon Tyne and Brent Cross and offices in Sheffield, Bangor, Glasgow and Vauxhall, London. Across the United Kingdom, it employed over 500 people.\nIn 2014, McKesson sold most of their healthcare software business to the private equity firm Symphony Technology Group and indicated also that they would not be re-bidding for the Electronic Staff Record contract. This came after the company had posted significant year on year losses in revenue (16% in the 2012/13 financial year) after taking over a very successful British operation in 2011.\nIn April 2022, McKesson UK was acquired by the private equity company, Aurelius Group in a £477m deal. The companies acquired by Aurelius include LloydsPharmacy, and AAH Pharmaceuticals.\n\nAustralia and New Zealand\nIn 2010, McKesson Asia-Pacific was acquired by Medibank Private Ltd.\nMcKesson ANZ is a fully owned subsidiary of McKesson Corporation. McKesson expanded its footprint in Australia and New Zealand by acquiring Emendo in November 2012. McKesson ANZ develops and sells healthcare optimization services and software. The company has traditionally been focused on the public markets in Australia and New Zealand. The majority of the District Health Boards in NZ use one or more of McKesson's Capacity Management solutions.\nChristchurch in New Zealand, is one of McKesson's global Capacity Management R&D centers of excellence. All of McKesson's R&D for McKesson Capacity Planner is performed in New Zealand. The company employs approximately 40 team members across Australia and New Zealand, including general management, R&D, sales, services, and support employees.\nMcKesson Capacity Planne, formerly Emendo CapPlan, is used in more than 40 hospitals in Australia, New Zealand, Britain, Canada, and the U.S. to forecast future patient activity and help health systems to allocate resources efficiently and identify unnecessary costs.\n\nGermany\nOn November 2, 2020, Walgreens Boots Alliance (WBA) and McKesson announced the completion of their previously announced agreement to create a joint venture combining their respective pharmaceutical wholesale businesses in Germany, Alliance Healthcare Deutschland (AHD) and GEHE Pharma Handel (GEHE). WBA holds a 70 percent controlling equity interest in the joint venture and McKesson holds the remaining 30 percent interest.\n\nSee also\nFortune 500\nTop 100 Contractors of the U.S. federal government\n\nReferences\nExternal links\nOfficial website\nBusiness data for McKesson Corporation: \nMcKesson Corporation: Company Overview & History",
  "clean_text": "McKesson Corporation is an American publicly traded company that distributes pharmaceuticals and provides health information technology, medical supplies, and health management tools. The company delivers a third of all pharmaceutical products used or consumed in North America and employs over 80,000 employees. With $308.9 billion in 2024 revenue, it is the ninth-largest company by revenue in the United States and the nation's largest health care company. The company is headquartered in Irving, Texas. It is a component of the S&P 500 and is listed on the New York Stock Exchange, where it is traded under the ticker symbol \"MCK\". McKesson provides extensive network of infrastructure for the healthcare industry and was an early adopter of technologies, including barcode scanning for distribution, pharmacy robotics, and RFID tags. The company has been named in a federal lawsuit for profiting from the opioid epidemic in the United States. Throughout the COVID-19 pandemic, McKesson was a key vaccine distributor, serving as the United States of America Government's centralized distributor for hundreds of millions of COVID-19 vaccine doses and ancillary supply kits for over a billion doses across the United States. History 19th century McKesson was founded in 1828 in New York City as Charles M. Olcott by Charles M. Olcott. It was later renamed Olcott, McKesson & Co. and John McKesson in 1833, the business began as an importer and wholesaler of botanical drugs. A third partner, Daniel Robbins, who joined the enterprise as it grew, and who previously \"was an assistant to the original partners\", was the \"Robbins\" when the company was renamed McKesson & Robbins following Olcott's death in 1853. 20th century The company successfully emerged from the McKesson and Robbins scandal under CEO Phillip Musica, one of the most notorious business and accounting scandals of the 20th century, a watershed event that led to major changes in American auditing standards and securities regulations after being exposed in 1938. In 1967, Foremost Dairies, a company founded by James Cash Penney, which was headquartered in San Francisco since 1954, acquired McKesson & Robbins in a hostile takeover to form Foremost-McKesson Inc. The Foremost dairy operations were sold in 1982 and the name changed to McKesson Corporation but headquarters remained in San Francisco. In 1999, McKesson acquired medical information systems firm HBO & Company (HBOC). The combined firm operated as McKessonHBOC for two years. Accounting irregularities at HBOC reduced the company's share price by half and resulted in the dismissal and prosecution of many HBOC executives. 21st century In 2001, the company's name reverted to McKesson. In the early 21st century, McKesson increased its market in medical technology through acquisitions, including Per Se Technologies and RelayHealth in 2006 and Practice Partner in 2007. On January 6, 2006, McKesson acquired NDCHealth Corporation. In 2010, McKesson acquired the oncology and physician services company US Oncology, Inc. for $2.16 billion, which was integrated into the McKesson Specialty Health business. In April 2012, McKesson agreed to pay the United States $190M to settle allegations that it had inflated prices and overbilled Medicaid. Three months later, in July 2012, McKesson agreed to pay California and 28 other states $151M to settle allegations that it had inflated prices and overbilled Medicaid. On June 24, 2013, The Wall Street Journal reported that McKesson Chairman and CEO John Hammergren's pension benefits of $159 million had set a record for \"the largest pension on file for a current executive of a public company, and almost certainly the largest ever in corporate America\". In 2013, PSS World Medical was acquired. In 2014, McKesson acquired Celesio to become one of the world's largest healthcare companies, with over $179 billion in annual revenue. In June 2016, McKesson announced plans to merge its IT business with Change Healthcare. In 2017, McKesson was involved in many lawsuits against the state of Arkansas over the supply of vecuronium bromide. McKesson was under contract by Pfizer not to sell to any correctional facility that authorized and carried out capital punishment. In November 2018, the company announced it would relocate its headquarters from San Francisco to Irving, Texas, effective April 1, 2019. Also in April 2019, Brian Tyler took over as CEO of the company. In February 2020, McKesson Corp announced that it would part ways with Change Healthcare. McKesson gave up its ownership in the company and its three seats on the company's board of directors. In February 2025, the McKesson Corporation signed a definitive agreement to acquire 80% interest in PRISM Vision Holdings. Opioid epidemic In 2008, McKesson paid $13 million in fines for failing to report large orders of hydrocodone. In January 2017, McKesson agreed to pay a $150 million civil penalty for alleged similar violations of the Controlled Substances Act regarding the distribution of opioids. In January 2017, McKesson agreed to pay $150M to settle allegations that it had not done enough to track and stop suspicious opioid sales. The agreement also obligated McKesson to suspend all sales of controlled substances from its distribution centers in Colorado, Florida, Ohio, and Michigan for multiple years. In May 2020, Attorney General of Oklahoma Michael J. Hunter sued McKesson in Bryan County District Court, alleging that the company's actions helped fuel Oklahoma's opioid crisis. The suit was filed along with lawsuits against Cardinal Health and AmerisourceBergen, and the three lawsuits allege that the three companies provided \"enough opioids to Bryan County that every adult resident there could have had 144 hydrocodone tablets.\" In January 2022, McKesson, AmerisourceBergen, Cardinal Health, and Johnson & Johnson agreed to pay $26 billion to settle with all but five of the states suing them. Had the states gone to court, the companies could have faced up to $95 billion in penalties. COVID-19 pandemic In August 2020, during the COVID-19 pandemic, the CDC and HHS selected McKesson as the U.S. government's centralized distributor for COVID-19 vaccine doses and ancillary supply kits under Operation Warp Speed. The company has played a key role in distributing the Moderna and Johnson & Johnson vaccines while also distributing ancillary supply kits for these as well as for the Pfizer–BioNTech vaccine across the U.S. (in addition to supporting the U.S. government in efforts to send doses and kits abroad). Finances For the fiscal year 2023, McKesson reported earnings of US$3.56 billion on revenue of US$276.711 billion. As of 2023, McKesson was the nation's largest health care company and the ninth-largest company by total revenue on the Fortune 500. Divisions McKesson Provider Technologies McKesson Provider Technologies is the retail name for McKesson Technology Solutions; the software development division of McKesson. Their customer base in the United States includes 50% of all health systems, 20% of all physician practices, 25% of home care agencies, and 77% of health systems with more than 200 beds. On June 20, 2005, McKesson Provider Technologies acquired Medcon, Ltd., an Israeli company which provides web-based cardiac image and information management solutions for heart centers, that includes: diagnostic digital image management, archiving, procedure reporting, and workflow management. In October 2013, McKesson agreed to buy a 50% stake in Germany-based Celesio for $8.3 billion. McKesson Medical Supplies and Equipment McKesson Medical-Surgical (MMS) offers a large selection of national healthcare brands, along with McKesson's exclusive brand of medical products. Their online medical supply ordering platform serves the needs of physician offices, surgery centers, home health agencies, DMEs, labs, and long-term-care facilities. In 2015, McKesson Medical-Surgical opened its new headquarters in Richmond, Virginia. Health Mart pharmacy franchise Health Mart, a network of over 4,000 independently owned and operated pharmacies, is a wholly owned subsidiary of McKesson Corporation, which owns the name \"Health Mart\". McKesson acquired Health Mart owner FoxMeyer in October 1996. Former divisions Mosswood Wine Company McKesson operated the Mosswood Wine Company from 1978 until 1987 when the division was sold to maintain its focus on pharmaceuticals. The division was founded and run by wine writer Gerald Asher. NDCHealth (Relay Health) NDC (from the initials of its former identity as National Data Corporation) became NDC-Health Corp in 2001 following the spin-off of its payments division, Global Payments, in 2000. NDCHealth was acquired by McKesson in 2007 through the purchase of Per-Se Technologies at which time it began doing business as RelayHealth in 2007. International McKesson Canada In 1991, McKesson Corporation acquired a 100 percent interest in Medis Health and Pharmaceutical Services from Provigo. In 2002, the McKesson Canada name was adopted. McKesson Canada is a wholly owned subsidiary of McKesson Corporation. It includes various business units: McKesson Pharmaceutical, McKesson Automation, McKesson Specialty, McKesson Health Solutions, and McKesson Information Solutions. In 2012, McKesson agreed to purchase Canadian pharmacy chains IDA, Guardian Pharmacy, and The Medicine Shoppe from the Katz Group of Companies for $920 million. In March 2016, McKesson agreed to purchase Canadian pharmacy chain Rexall from the Katz Group of Companies for $3 billion. The deal was finalized in December 2016 following approval received under the Investment Canada Act. On April 12, 2017, it was announced that McKesson Canada reached a deal to acquire 330 Uniprix pharmacies. In May 2018, McKesson Canada closed 40 Rexall locations in Ontario and Western Canada. United Kingdom In the United Kingdom, McKesson, operating as McKesson Information Solutions UK Ltd, was a provider of information technology services to the healthcare industry. In addition to numerous clinical software systems and finance and procurement services, McKesson also was responsible for developing the Electronic Staff Record system for the National Health Service which provided an integrated payroll system for NHS's 1.3 million staff, making it the world's largest single payroll IT system. McKesson Shared Services also provided payroll services for over 20 NHS Trusts, paying over 100,000 NHS members. McKesson's United Kingdom base was in Warwick with data centers in Newcastle upon Tyne and Brent Cross and offices in Sheffield, Bangor, Glasgow and Vauxhall, London. Across the United Kingdom, it employed over 500 people. In 2014, McKesson sold most of their healthcare software business to the private equity firm Symphony Technology Group and indicated also that they would not be re-bidding for the Electronic Staff Record contract. This came after the company had posted significant year on year losses in revenue (16% in the 2012/13 financial year) after taking over a very successful British operation in 2011. In April 2022, McKesson UK was acquired by the private equity company, Aurelius Group in a £477m deal. The companies acquired by Aurelius include LloydsPharmacy, and AAH Pharmaceuticals. Australia and New Zealand In 2010, McKesson Asia-Pacific was acquired by Medibank Private Ltd. McKesson ANZ is a fully owned subsidiary of McKesson Corporation. McKesson expanded its footprint in Australia and New Zealand by acquiring Emendo in November 2012. McKesson ANZ develops and sells healthcare optimization services and software. The company has traditionally been focused on the public markets in Australia and New Zealand. The majority of the District Health Boards in NZ use one or more of McKesson's Capacity Management solutions. Christchurch in New Zealand, is one of McKesson's global Capacity Management R&D centers of excellence. All of McKesson's R&D for McKesson Capacity Planner is performed in New Zealand. The company employs approximately 40 team members across Australia and New Zealand, including general management, R&D, sales, services, and support employees. McKesson Capacity Planne, formerly Emendo CapPlan, is used in more than 40 hospitals in Australia, New Zealand, Britain, Canada, and the U.S. to forecast future patient activity and help health systems to allocate resources efficiently and identify unnecessary costs. Germany On November 2, 2020, Walgreens Boots Alliance (WBA) and McKesson announced the completion of their previously announced agreement to create a joint venture combining their respective pharmaceutical wholesale businesses in Germany, Alliance Healthcare Deutschland (AHD) and GEHE Pharma Handel (GEHE). WBA holds a 70 percent controlling equity interest in the joint venture and McKesson holds the remaining 30 percent interest."
}