{
  "ticker": "MCO",
  "cik": "0001059556",
  "company_name": "Moody's Corporation",
  "corrected_name": "Moody's Corporation",
  "wiki_title_used": "Moody's Corporation",
  "exists": true,
  "raw_text": "Moody's Corporation is an American business and financial services company. It is the holding company for Moody's Ratings (previously known as Moody's Investors Service), an American credit rating agency, and Moody's (previously known as Moody's Analytics), an American provider of financial analysis software and services.\nMoody's was founded by John Moody in 1909 to produce manuals of statistics related to stocks and bonds and bond ratings. Moody's was acquired by Dun & Bradstreet in 1962. In 2000, Dun & Bradstreet spun off Moody's Corporation as a separate company that was listed on the NYSE under MCO. In 2007, Moody's Corporation was split into two operating divisions: Moody's Investors Service, the rating agency, and Moody's Analytics, containing all of its other products. It was included in the Fortune 500 list for the first time in 2021.\n\nHistory\nMoody's Corporation traces its history back to two publishing companies established by John Moody, the inventor of modern bond credit ratings. It was first published in 1900 by John Moody, nine years before he founded Moody's Corporation. Initially called Moody's Manual of Industrial and Miscellaneous Securities, it was later superseded by Moody's Manual of Railroads and Corporation Securities, then by Moody's Analyses of Investments.\nIn 1900, Moody published his first market assessment, called Moody's Manual of Industrial and Miscellaneous Securities, and established John Moody & Company. The publication provided detailed statistics relating to stocks and bonds of financial institutions, government agencies, manufacturing, mining, utilities, and food companies. It experienced early success, selling out its first print run in its first two months.\nBy 1903, Moody's Manual was a nationally recognized publication. The 1907 financial crisis fueled several changes in the markets, including the creation of the Federal Reserve System. Meanwhile, Moody was forced to sell his business due to a shortage of capital. Moody returned in 1909 with a new publication focused solely on railroad bonds, Analysis of Railroad Investments, and a new company, Moody's Analyses Publishing Company.\nIn 1962, Moody's Investors Service was bought by Dun & Bradstreet, a firm engaged in the related field of credit reporting, although they continued to operate largely as independent companies. By the late 1990s, Moody's superior performance compared to its parent company brought investor pressure to separate the businesses. In 1998, Dun & Bradstreet sold the Moody's publishing business to Financial Communications (later renamed Mergent). In December 1999, Dun & Bradstreet announced it would spin off Moody's Investors Service into a separate publicly traded company. The spin-off was completed on September 30, 2000.\nIn December 2022, the company was added to the Dow Jones Sustainability World Index.\n\nMoody's Ratings\nMoody's Ratings, previously known as Moody's Investors Service, is the bond credit rating business of Moody's Corporation, representing the company's traditional line of business and its historical name. Moody's Ratings rates debt securities in several market segments related to public and commercial securities in the bond market. These include government, municipal and corporate bonds; managed investments such as money market funds, fixed-income funds and hedge funds; financial institutions including banks and non-bank finance companies; and asset classes in structured finance.\nMoody's Ratings' closest competitors are Standard & Poor's (S&P) and Fitch Group. Together, they are sometimes referred to as the Big Three credit rating agencies. Moody's Ratings and its close competitors play a key role in global capital markets as a supplementary credit analysis provider for banks and other financial institutions in assessing the credit risk of particular securities.\nAccording to Moody's, the purpose of its ratings is to \"provide investors with a simple system of gradation by which future relative creditworthiness of securities may be gauged\". To each of its ratings from Aaa through Caa, Moody's appends numerical modifiers 1, 2 and 3; the lower the number, the higher-end the rating. Aaa, Ca and C are not modified this way.\n\nMoody's\nMoody's, previously known as Moody's Analytics, is a subsidiary of Moody's Corporation established in 2007 to focus on non-rating activities. It performs economic research related to credit analysis, performance management, financial modeling, structured analysis and financial risk management. Moody's also offers software and consulting services, including proprietary economic models and software tools, as well as professional training for the financial services sector, particularly risk management accreditation.\nMoody's Analytics started in 1995 as a business unit providing quantitative analysis services, including credit risk assessment software and services, called Moody's Risk Management Service (MRMS), and grew through partnerships and acquisitions in the late 1990s and 2000s, expanding its client base and capabilities. Acquisitions included KMV, Economy.com, Wall Street Analytics, Fermat International, Enb Consulting Ltd., The Institute of Risk Standards and Qualifications (iRSQ), CSI Global Education Inc., and Bureau van Dijk.\n\nThe Moody's Foundation\nIn 2002, Moody's Corporation created a corporate philanthropy program, The Moody's Foundation, focused on educational initiatives in mathematics, economics and finance. The organization offers grants to 501(c)(3) non-profits and equivalent international organizations, accredited schools and some governmental organizations.\nSince 2006, its main program has been the annual Moody's Mega Math Challenge (M3 Challenge), a student academic challenge co-sponsored with the Society for Industrial and Applied Mathematics (SIAM), in which several hundred teams of high school students use quantitative analysis and modeling to solve problems related to real-life financial topics such as Social Security and the Economic Stimulus Act of 2008. The program has continued to expand since 2010.\n\nMoody's Research Labs\nMoody's Research Labs, Inc. was a business incubator focused on research and development specializing in financial risk modeling and analysis, developing such products for use by other divisions of Moody's Corporation. Its president was Roger Stein. In March 2011, Moody's Analytics announced the release of a software program developed by Moody's Research Labs, the Mortgage Portfolio Analyzer, to assist portfolio managers in managing credit risk. Moody's Research Labs was dissolved in February 2012.\n\nLawsuit settlements\nOctober 2011: Moody's reached a settlement resolving claims by the state of Connecticut that the credit rating company unfairly gave lower ratings to public bonds.\nJuly 2012: Moody's said it reached a settlement with stockholders in lawsuits filed over structured finance ratings.\nApril 2013: Moody's reached a settlement avoiding what would have been their first jury trial over crisis-era ratings. The fourteen plaintiffs were led by Abu Dhabi Commercial Bank and King County, Washington. They filed lawsuits in 2008 and 2009 alleging that Moody's misled them by inflating ratings on two structured investment vehicles they purchased.\nJanuary 2017: Moody's Corporation, Moody's Analytics, and Moody's Investors Service reached an $863 million settlement with the U.S. Department of Justice and the attorneys general of 21 states and the District of Columbia \"Arising From Conduct in the Lead up to the Financial Crisis.\" \"The settlement resolves allegations arising from Moody's role in providing credit ratings for Residential Mortgage-Backed Securities (RMBS) and Collateralized Debt Obligations (CDO), contributing to the worst financial crisis since the Great Depression.\" Then California Attorney General Kamala Harris and then Missouri Attorney General Josh Hawley were among the 21 state signatories.\nMarch 2021: Moody's reached a settlement with the European Union regarding conflicts of interest. Moody's was fined €3.7 million ($4.35 million).\n\nAcquisitions\nIn 2019, Moody's Corporation purchased the majority share in the California-based climate risk data firm, Four Twenty Seven (427), that \"measures the physical risks\" of \"climate change\". This acquisition is the \"latest indication that global warming can threaten the creditworthiness of governments and companies\" globally, according to a July 25, 2019 article in The New York Times. In 2021, Moody's acquired Risk Management Solutions (RMS) from Daily Mail and General Trust for $2 billion. RMS generates risk models for the insurance and reinsurance industries.\n\nReferences\nExternal links\n Media related to Moody's at Wikimedia Commons\nOfficial website\nBusiness data for Moody's Corporation: \nMoody's Research Labs\nThe Moody's Foundation",
  "clean_text": "Moody's Corporation is an American business and financial services company. It is the holding company for Moody's Ratings (previously known as Moody's Investors Service), an American credit rating agency, and Moody's (previously known as Moody's Analytics), an American provider of financial analysis software and services. Moody's was founded by John Moody in 1909 to produce manuals of statistics related to stocks and bonds and bond ratings. Moody's was acquired by Dun & Bradstreet in 1962. In 2000, Dun & Bradstreet spun off Moody's Corporation as a separate company that was listed on the NYSE under MCO. In 2007, Moody's Corporation was split into two operating divisions: Moody's Investors Service, the rating agency, and Moody's Analytics, containing all of its other products. It was included in the Fortune 500 list for the first time in 2021. History Moody's Corporation traces its history back to two publishing companies established by John Moody, the inventor of modern bond credit ratings. It was first published in 1900 by John Moody, nine years before he founded Moody's Corporation. Initially called Moody's Manual of Industrial and Miscellaneous Securities, it was later superseded by Moody's Manual of Railroads and Corporation Securities, then by Moody's Analyses of Investments. In 1900, Moody published his first market assessment, called Moody's Manual of Industrial and Miscellaneous Securities, and established John Moody & Company. The publication provided detailed statistics relating to stocks and bonds of financial institutions, government agencies, manufacturing, mining, utilities, and food companies. It experienced early success, selling out its first print run in its first two months. By 1903, Moody's Manual was a nationally recognized publication. The 1907 financial crisis fueled several changes in the markets, including the creation of the Federal Reserve System. Meanwhile, Moody was forced to sell his business due to a shortage of capital. Moody returned in 1909 with a new publication focused solely on railroad bonds, Analysis of Railroad Investments, and a new company, Moody's Analyses Publishing Company. In 1962, Moody's Investors Service was bought by Dun & Bradstreet, a firm engaged in the related field of credit reporting, although they continued to operate largely as independent companies. By the late 1990s, Moody's superior performance compared to its parent company brought investor pressure to separate the businesses. In 1998, Dun & Bradstreet sold the Moody's publishing business to Financial Communications (later renamed Mergent). In December 1999, Dun & Bradstreet announced it would spin off Moody's Investors Service into a separate publicly traded company. The spin-off was completed on September 30, 2000. In December 2022, the company was added to the Dow Jones Sustainability World Index. Moody's Ratings Moody's Ratings, previously known as Moody's Investors Service, is the bond credit rating business of Moody's Corporation, representing the company's traditional line of business and its historical name. Moody's Ratings rates debt securities in several market segments related to public and commercial securities in the bond market. These include government, municipal and corporate bonds; managed investments such as money market funds, fixed-income funds and hedge funds; financial institutions including banks and non-bank finance companies; and asset classes in structured finance. Moody's Ratings' closest competitors are Standard & Poor's (S&P) and Fitch Group. Together, they are sometimes referred to as the Big Three credit rating agencies. Moody's Ratings and its close competitors play a key role in global capital markets as a supplementary credit analysis provider for banks and other financial institutions in assessing the credit risk of particular securities. According to Moody's, the purpose of its ratings is to \"provide investors with a simple system of gradation by which future relative creditworthiness of securities may be gauged\". To each of its ratings from Aaa through Caa, Moody's appends numerical modifiers 1, 2 and 3; the lower the number, the higher-end the rating. Aaa, Ca and C are not modified this way. Moody's Moody's, previously known as Moody's Analytics, is a subsidiary of Moody's Corporation established in 2007 to focus on non-rating activities. It performs economic research related to credit analysis, performance management, financial modeling, structured analysis and financial risk management. Moody's also offers software and consulting services, including proprietary economic models and software tools, as well as professional training for the financial services sector, particularly risk management accreditation. Moody's Analytics started in 1995 as a business unit providing quantitative analysis services, including credit risk assessment software and services, called Moody's Risk Management Service (MRMS), and grew through partnerships and acquisitions in the late 1990s and 2000s, expanding its client base and capabilities. Acquisitions included KMV, Economy.com, Wall Street Analytics, Fermat International, Enb Consulting Ltd., The Institute of Risk Standards and Qualifications (iRSQ), CSI Global Education Inc., and Bureau van Dijk. The Moody's Foundation In 2002, Moody's Corporation created a corporate philanthropy program, The Moody's Foundation, focused on educational initiatives in mathematics, economics and finance. The organization offers grants to 501(c)(3) non-profits and equivalent international organizations, accredited schools and some governmental organizations. Since 2006, its main program has been the annual Moody's Mega Math Challenge (M3 Challenge), a student academic challenge co-sponsored with the Society for Industrial and Applied Mathematics (SIAM), in which several hundred teams of high school students use quantitative analysis and modeling to solve problems related to real-life financial topics such as Social Security and the Economic Stimulus Act of 2008. The program has continued to expand since 2010. Moody's Research Labs Moody's Research Labs, Inc. was a business incubator focused on research and development specializing in financial risk modeling and analysis, developing such products for use by other divisions of Moody's Corporation. Its president was Roger Stein. In March 2011, Moody's Analytics announced the release of a software program developed by Moody's Research Labs, the Mortgage Portfolio Analyzer, to assist portfolio managers in managing credit risk. Moody's Research Labs was dissolved in February 2012. Lawsuit settlements October 2011: Moody's reached a settlement resolving claims by the state of Connecticut that the credit rating company unfairly gave lower ratings to public bonds. July 2012: Moody's said it reached a settlement with stockholders in lawsuits filed over structured finance ratings. April 2013: Moody's reached a settlement avoiding what would have been their first jury trial over crisis-era ratings. The fourteen plaintiffs were led by Abu Dhabi Commercial Bank and King County, Washington. They filed lawsuits in 2008 and 2009 alleging that Moody's misled them by inflating ratings on two structured investment vehicles they purchased. January 2017: Moody's Corporation, Moody's Analytics, and Moody's Investors Service reached an $863 million settlement with the U.S. Department of Justice and the attorneys general of 21 states and the District of Columbia \"Arising From Conduct in the Lead up to the Financial Crisis.\" \"The settlement resolves allegations arising from Moody's role in providing credit ratings for Residential Mortgage-Backed Securities (RMBS) and Collateralized Debt Obligations (CDO), contributing to the worst financial crisis since the Great Depression.\" Then California Attorney General Kamala Harris and then Missouri Attorney General Josh Hawley were among the 21 state signatories. March 2021: Moody's reached a settlement with the European Union regarding conflicts of interest. Moody's was fined €3.7 million ($4.35 million). Acquisitions In 2019, Moody's Corporation purchased the majority share in the California-based climate risk data firm, Four Twenty Seven (427), that \"measures the physical risks\" of \"climate change\". This acquisition is the \"latest indication that global warming can threaten the creditworthiness of governments and companies\" globally, according to a July 25, 2019 article in The New York Times. In 2021, Moody's acquired Risk Management Solutions (RMS) from Daily Mail and General Trust for $2 billion. RMS generates risk models for the insurance and reinsurance industries."
}