{
  "ticker": "MDT",
  "cik": "0001613103",
  "company_name": "Medtronic",
  "corrected_name": "Medtronic",
  "wiki_title_used": "Medtronic",
  "exists": true,
  "raw_text": "Medtronic plc is an American-Irish medical device company. The company's legal and executive headquarters are in Ireland, while its operational headquarters are in Minneapolis, Minnesota. Medtronic rebased to Ireland following its acquisition of Irish-based Covidien in 2015. While it primarily operates in the United States, it operates in more than 150 countries and employs over 90,000 people. It develops and manufactures healthcare technologies and therapies. It is one of the biggest medical tech companies in the world and is currently the largest medical device company in the world by revenue.   \nThe company has developed several world-first technologies since its inception, including wearable and implantable pacemakers, the implantable cardioverter-defibrillator, and remote monitoring systems. They also created miniaturized devices like the world's smallest pacemaker and spinal cord stimulator.\n\nHistory\nFoundation and early years\nMedtronic was founded in 1949 in Minneapolis by Earl Bakken and his brother-in-law, Palmer Hermundslie, as a medical equipment repair shop. Bakken invented several medical technology devices that continue to be used around the world today.\nThrough his repair business, Bakken came to know C. Walton Lillehei, a doctor of heart surgery at the University of Minnesota Medical School. The deficiencies of artificial pacemakers at the time became evident during a power outage over Halloween in 1957, which affected large sections of Minnesota and western Wisconsin. A pacemaker-dependent paediatric patient of Lillehei died because of the blackout. The next day, Lillehei spoke with Bakken about developing some form of battery-powered pacemaker. Bakken modified the design for a transistorized metronome and created the first battery-powered external pacemaker. It fit in a four-inch-square box that could be taped to a patient's chest, transmitted electrical signals to the heart through wires that passed through the patient's chest, and could be removed without surgery.\n\nThe company expanded through the 1950s, both selling equipment built by other companies and developing custom-made devices. Bakken built a small pacemaker that could be strapped to the body and powered by batteries. Work in the new field later produced an implantable pacemaker in 1960. The company built its headquarters in the Minneapolis suburb of St. Anthony, Minnesota, in 1960, and moved to Fridley in the 1970s. Medtronic's main competitors in the cardiac rhythm field include Boston Scientific and St. Jude Medical.\n\nGrowth and expansion\nIn 1997, Medtronic opened a production site for implantable pacemakers and brain pacemakers in Tolochenaz, Switzerland. One in five pacemakers implanted globally today is made here. The site is also used as a European training centre for doctors. \nIn 1998, Medtronic acquired Physio-Control for $538 million.\nIn 2014, Integra LifeSciences announced it was acquiring instrumentation lines from Medtronic for $60 million. The deal included Medtronic's MicroFrance and Xomed manual ear, nose and throat and laparoscopic surgical instruments, as well as a manufacturing facility in France.\nIn February 2016, the company announced that it would acquire Bellco from private equity firm Charme Capital Partners. In June, the company announced its acquisition of HeartWare International Inc. for $1.1 billion. In December 2017, Medtronic acquired Crospon for €38 million (approximately $45 million). In September 2018, the company acquired Mazor Robotics for $1.64 billion ($58.50 per American Depository Share or $29.25 per ordinary share. In late November, Medtronic acquired Nutrino Health Ltd boosting the company's nutrition-related data services and analytics.\nIn May 2019, Medtronic announced it would acquire Titan Spine, a technology company focusing on titanium spine implants. Chief Executive Officer Omar Ishrak retired in April 2020 and stayed on as executive chairman and chairman of the board until December 2020. Ishrak was succeeded by senior executive Geoff Martha.\nIn January 2020, the company announced its intention to acquire Stimgenics, LLC and their primary therapy: differential target, multiplexed, spinal cord stimulation. In July, the company announced it would acquire Medicrea for €7.00 per share. In August, Medtronic announced it would acquire Companion Medical, who manufacture a smart insulin pen system, which connects to a diabetes management app. In September Medtronic acquired Avenu Medical for an undisclosed sum.\nIn February 2021, the company recalled its HeartWare Ventricular Assist Device. In June 2021, the controller ports were pulled from the market. On 3 June 2021, the FDA alerted physicians to stop new implants of the HVAD system due to \"an increased risk of neurological adverse events and mortality associated with the internal pump.\"\nIn January 2022, the business announced it would acquire Affera, Inc. In March, Medtronic announced a contract with Vizient, a healthcare performance improvement company, to add Medtronic's Touch Surgery Enterprise platform to Vizient's healthcare offerings. Touch Surgery works with laparoscopic and robotic scopes and is an AI-powered video management and analytics platform for the operating room. In May, Medtronic and DaVita Inc. announced plans to form a new, independent kidney care-focused medical device company. Medtronic's Renal Care Solutions business will be part of the new company.\nIn April 2022, the company announced a collaboration with GE Healthcare to support the needs and care demands at Ambulatory Surgery Centers. In July, Medtronic announced a strategic partnership with CathWorks, a coronary artery disease (CAD) technology developer. A separate agreement gave Medtronic the option to acquire CathWorks in the future.\nIn October 2022, the company announced its intention to pursue a separation of the company's combined Patient Monitoring and Respiratory Interventions businesses, which are part of the company's Medical Surgical Portfolio.\nIn February 2024, the company announced that it had reversed its decision to spin-off or sell the Patient Monitoring and Respiratory Interventions businesses, and would instead combine them into a new business unit called Acute Care & Monitoring. They also announced that they would discontinue the ventilator product line, citing its unprofitability.\n\nAcquisition history\nGlobal rankings\nIn May 2018, Medtronic was ranked as the world's largest medical device company by 2017 revenues (see table below).\nIn March 2017, Bloomberg's database of U.S. tax inversions listed Medtronic and Wright Medical Group (Medtronic's 2015 inversion to Ireland was over $100 billion, while Wright's 2015 inversion to the Netherlands was $3.3 billion), as the only U.S. tax inversions of a U.S. medical device company in history. In February 2018, the Wall Street Journal listed Medtronic's 2015 tax inversion to Ireland as the largest U.S. corporate tax inversion executed between 2013 and 2016. In May 2018, Medtronic was ranked as the largest corporate tax inversion in history.\n\nIn November 2021, the company was added to the Dow Jones Sustainability World Index.\n\nBusiness units and subsidiaries\nMedtronic has four main business units: the Minimally Invasive Therapies Group, the Diabetes Group, the Restorative Therapies Group, and the Cardiac and Vascular Group. Medtronic develops and manufactures devices and therapies to treat more than 30 chronic diseases, including heart failure, Parkinson disease, urinary incontinence, Down syndrome, obesity, chronic pain, spinal disorders and diabetes.\n\nAcute care and monitoring\nAcute care and monitoring (ACM) is based out of Lafayette, Colorado and produces non-invasive sensors and monitoring products, used for patient monitoring in the hospital and home settings.  It has absorbed the portfolios of acquired companies, including Covidien, Nellcor, Somanetics, Aspect Medical Systems, Oridion Medical and Zephyr Technology. This business unit produces pulse oximetry, capnography, and bispectral index sensors, patient monitors, remote patient monitoring software, and electronic medical record connectivity software.\n\nCardiac rhythm disease management\nCardiac rhythm disease management (CRDM) is the oldest and largest of Medtronic's business units. Its work in heart rhythm therapies dates back to 1957 when Bakken developed the first wearable heart pacemaker to treat abnormally slow heart rates. Since then, it has expanded its expertise in electrical stimulation to treat other cardiac rhythm diseases. It has also made an effort to address overall disease management by adding diagnostic and monitoring capabilities to many of its devices. An independently-operating Dutch pacemaker manufacturer, Vitatron, acquired by Medtronic in 1986, is now a European subsidiary of the unit. Medtronic and Vitatron pacemakers are interrogated and programmed by Medtronic Carelink Model 2090 Programmer for Medtronic and Vitatron Devices; they use separate interfaces.\nIn 2007, Medtronic recalled its Sprint Fidelis product, the flexible wires, or leads, which connect a defibrillator to the interior of the heart. The leads were found to be failing at an unacceptable rate, resulting in unnecessary shocks or no shocks when needed; either can be lethal. The scope of the problem continues to be a matter of research. Studies since the recall, disputed by Medtronic, suggest that the failure rate of already-implanted Sprint Fidelis leads is increasing exponentially. Medtronic's liability is limited by various court decisions.\n\nSpinal and biologics\nSpinal and biologics is Medtronic's second-largest business. Medtronic is the world leader in spinal and musculoskeletal therapies. In 2007, Medtronic purchased Kyphon, a manufacturer and seller of spinal implants that are necessary for procedures like kyphoplasty.\nIn May 2008, Medtronic Spine agreed to pay the US government $75 million to settle a qui tam lawsuit after a whistleblower alleged that Medtronic committed Medicare fraud. The company was charged with illegally convincing healthcare providers to offer kyphoplasty, a spinal fracture repair surgery, as an inpatient, not an outpatient, procedure to make thousands of dollars more in profits per surgery.\nA \"special report\" by writer Steven Brill in Time showed that according to Medtronic's quarterly SEC filing of October 2012, the company had, on average, a 75.1% profit margin on its spine products and therapies.\n\nCardiovascular\nMedtronic's cardiovascular therapies span the major specialties of interventional cardiology, cardiac surgery, and vascular surgery. The products are used to reduce the potentially debilitating effects of coronary, aortic, and structural heart disease. As of August 2024, cardiovascular portfolio included four product segments - cardiac rhythm products, heart failure products, structural heart and aortic products, coronary and peripheral products.\n\nNeuromodulation\nNeuromodulation is the second-oldest and third-largest department of Medtronic. Its products include neurostimulation systems and implantable drug delivery systems for chronic pain, common movement disorders, and urologic and gastrointestinal disorders. The department's revenues in 2014 amounted to $1.9 billion, or 11% of Medtronic's total revenues.\n\nDiabetes\nThe diabetes management manufacturing and sales division of Medtronic is based on the perimeter of the California State University, Northridge campus in Northridge, California. The original company, Minimed Technologies, was founded in 1983 by Alfred E. Mann and spun off from Pacesetter Systems to design and market an open loop insulin pump. The MiniMed 502 was one of the first lightweight insulin pumps on the market, and it helped bring insulin pump usage to the mainstream market.\nIn 1992, the MiniMed 506 was a major redesign to make it more appealing to consumers. The new design was met by boosted adoption rate, and sales increased by 357%. In 2001, Medtronic purchased Minimed, to form Medtronic Minimed.\nOn 11 May 2009, Medtronic announced it had chosen San Antonio, Texas, for the location of its new Diabetes Therapy Management and Education Center. The company announced that it expected 1400 new jobs would be created to staff the 150,000-square-foot (14,000 m2) facility.\nIn September 2016, the FDA approved a device, the MiniMed 670G which was launched in 2017. It was the world's first Hybrid Closed Loop system for people with type 1 diabetes. Featuring the company's advanced algorithm - SmartGuard technology and glucose sensor - Guardian™ Sensor 3, it was the first insulin pump approved by the Food and Drug Administration (FDA) that enabled personalized and automated* delivery of basal insulin, the background insulin needed to maintain stable blood sugar levels throughout the day and night. The advanced SmartGuard Auto Mode algorithm worked in conjunction with the company's glucose sensor - Guardian Sensor 3 - to self-adjust basal insulin delivery based on the glucose sensor.\n\nSurgical technologies\nThe surgical technologies business group designed and manufactured products for the diagnosis and treatment of ear, nose, and throat (ENT) diseases and cranial, spinal, and neurologic conditions. It also encompassed a surgical navigation division to design \"StealthStation\" systems, software, and instruments for computer assisted surgery (CAS) and a special intraoperative X-ray imaging system (3D fluoroscopy), known as the O-arm Imaging System. Many of the products are used for minimally-invasive surgical procedures. In 2016, the business unit was dissolved, and each site folded into new business groups.\n\nRenal care solutions\nThe renal care solutions business group designed and manufactured products for the diagnosis and treatment related to renal organs like kidney. In 2023 this business unit was spun off into an independent business called Mozarc Medical.\n\nTechnology safety\nIn 2011, an independent security researcher, Jay Radcliffe, revealed a security vulnerability in a Medtronic insulin pump at the computer security conference Black Hat Briefings, allowing an attacker to take control of the pump. Medtronic responded by assuring users of the full safety of its devices.\nIn 2008, a team of computer security researchers was able to take remote control of a Medtronic cardiac implant. The team, using an unused implant in a lab, was able to control the electrical shocks delivered by the defibrillator component and even glean patient data from the device.\nIn February 2020, Medtronic recalled around 322,000 MiniMed insulin pumps with faulty pump retainer rings, which had been correlated to death and around 2,000 injuries.\n\nPortable ventilators\nOn 30 March 2020, Medtronic shared its portable ventilator design specifications during the outbreak of COVID-19 pandemic, in order to accelerate global ventilator production.\n\nSubsidiaries\nVitatron\nVitatron is a Netherlands-based European subsidiary of Medtronic. It is focused on development and manufacturing of cardiac pacing technology. Once an independently operating Dutch medical company, it was acquired by Medtronic in 1986. Vitatron pacemakers are interrogated and programmed by Medtronic Carelink Model 2090 Programmer for Medtronic and Vitatron Devices, using a separate interface.\n\nHistory of Vitatron\n1956: Vitatron founded\n1962: First Implantable pacemakers\n1981: Microprocessor-driven, software-based pacemaker (DPG1)\n1982: Rate Responsive pacemaker (TX1)\n1984: Quintech DDD with automatic upper rate behavior (\"mode switch\")\n1988: Daily Learn algorithm (Rhythmyx)\n1997: First upgradeable pacemaker system with dedicated AF diagnostics, rate and rhythm control therapy.\n2003: Vitatron goes digital: 1st Vitatron C-Series, the world's first fully digital pacemaker.\n2004: 2nd Vitatron C-Series, digital, fast pacemaker.\n2004: Vitatron T-Series: The full picture, digital pacemaker system.\n2005: Vitatron C-Series, A3 models, a new top line range of digital pacemakers for bradycardic patients.\n\nPublic-private engagement\nActivism\nMedtronic is a corporate partner of Human Rights Campaign, a large LGBT advocacy organization.\n\nCriticism\nAnimal rights\nIn 2005, 2008, and 2010 PETA threatened to submit a shareholder resolution to improve animal welfare standards in the company. In 2005, PETA attempted to stop five specific animal experiments that it deemed \"crude and cruel\". In 2008, PETA protested the outsourcing of animal testing to countries with lax animal welfare laws, such as China. In 2010, PETA attempted to stop Medtronic's reported use of live animals in testing and training. In response, Medtronic conducted a feasibility study that found that banning the use of live animals was impractical. As of 2015 Medtronic continued to use live animals for testing and training but stated that it would look for alternatives in the future. In each case, PETA withdrew its shareholder resolution after talks with Medtronic's leadership.\n\nTax inversion to Ireland\nIn June 2014, Medtronic announced it would execute a tax inversion to Ireland by acquiring Irish-based Covidien (a previous U.S. tax inversion to Ireland in 2007), for $42.9 billion in cash and stock. The tax inversion enabled Medtronic to move its legal headquarters to Ireland, while maintaining its operational and executive headquarters in the U.S., thus enabling it to reduce taxation on over $14 billion held overseas, and take advantage of Ireland's low corporation tax regime. Medtronic's tax inversion is the largest tax inversion in history, and given the changes in the U.S. tax-code in 2016 to block the Pfizer-Allergan Irish tax inversion, is likely to remain the largest. Medtronic CEO Omar Ishrak defended the tax inversion in a 2015 interview to the Financial Times saying, \"We just followed the rules and the deal was done based on strategic merits\". Ireland is less than 0.1% of Medtronic (or Covidien) sales, and the majority of Medtronic's sales, and an even greater percentage of Medtronic profits (due to the higher margins on U.S. medical devices), are from the U.S. healthcare system. In 2016, the Star Tribune reported that Medtronic was still winning U.S. Federal contracts and attending U.S. trade-missions as a U.S. company.\nIn terms of scale, on 23 November 2018, Ireland's largest stockbrokers, Davy Stockbrokers reported that the total capitalization of the Irish stock market was €104 billion (this does not include Medtronic, which Davy do not consider an Irish company). In contrast, on the same day Medtronic's capitalization was listed on Bloomberg at just over $130 billion (or €115 billion).\nMedtronic's acquisition of Covidien made Medtronic the world's largest medical device company by revenues.\n\nResponse to 2022 Russian invasion of Ukraine\nDuring the 2022 Russian invasion of Ukraine, Medtronic refused to join the international community and withdraw from the Russian market. Research from Yale University updated on 28 April 2022, identifying how companies were reacting to Russia's invasion identified Medtronic in the worst category of \"Digging In\" (\"F\" rank), meaning Defying Demands for Exit: companies defying demands for exit/reduction of activities. As of June 2, 2025, Medtronic's standing has improved slightly, now identified in the \"Buying Time\" (\"D\" rank) category, meaning Holding Off New Investments/Development: companies postponing future planned investment/development/marketing while continuing substantive business.\n\nSee also\nCorporate tax inversions to Ireland\nIreland as a tax haven\nSteris, US medical device tax inversion to UK and Ireland\n\nReferences\nExternal links\nOfficial website \nBusiness data for Medtronic:",
  "clean_text": "Medtronic plc is an American-Irish medical device company. The company's legal and executive headquarters are in Ireland, while its operational headquarters are in Minneapolis, Minnesota. Medtronic rebased to Ireland following its acquisition of Irish-based Covidien in 2015. While it primarily operates in the United States, it operates in more than 150 countries and employs over 90,000 people. It develops and manufactures healthcare technologies and therapies. It is one of the biggest medical tech companies in the world and is currently the largest medical device company in the world by revenue. The company has developed several world-first technologies since its inception, including wearable and implantable pacemakers, the implantable cardioverter-defibrillator, and remote monitoring systems. They also created miniaturized devices like the world's smallest pacemaker and spinal cord stimulator. History Foundation and early years Medtronic was founded in 1949 in Minneapolis by Earl Bakken and his brother-in-law, Palmer Hermundslie, as a medical equipment repair shop. Bakken invented several medical technology devices that continue to be used around the world today. Through his repair business, Bakken came to know C. Walton Lillehei, a doctor of heart surgery at the University of Minnesota Medical School. The deficiencies of artificial pacemakers at the time became evident during a power outage over Halloween in 1957, which affected large sections of Minnesota and western Wisconsin. A pacemaker-dependent paediatric patient of Lillehei died because of the blackout. The next day, Lillehei spoke with Bakken about developing some form of battery-powered pacemaker. Bakken modified the design for a transistorized metronome and created the first battery-powered external pacemaker. It fit in a four-inch-square box that could be taped to a patient's chest, transmitted electrical signals to the heart through wires that passed through the patient's chest, and could be removed without surgery. The company expanded through the 1950s, both selling equipment built by other companies and developing custom-made devices. Bakken built a small pacemaker that could be strapped to the body and powered by batteries. Work in the new field later produced an implantable pacemaker in 1960. The company built its headquarters in the Minneapolis suburb of St. Anthony, Minnesota, in 1960, and moved to Fridley in the 1970s. Medtronic's main competitors in the cardiac rhythm field include Boston Scientific and St. Jude Medical. Growth and expansion In 1997, Medtronic opened a production site for implantable pacemakers and brain pacemakers in Tolochenaz, Switzerland. One in five pacemakers implanted globally today is made here. The site is also used as a European training centre for doctors. In 1998, Medtronic acquired Physio-Control for $538 million. In 2014, Integra LifeSciences announced it was acquiring instrumentation lines from Medtronic for $60 million. The deal included Medtronic's MicroFrance and Xomed manual ear, nose and throat and laparoscopic surgical instruments, as well as a manufacturing facility in France. In February 2016, the company announced that it would acquire Bellco from private equity firm Charme Capital Partners. In June, the company announced its acquisition of HeartWare International Inc. for $1.1 billion. In December 2017, Medtronic acquired Crospon for €38 million (approximately $45 million). In September 2018, the company acquired Mazor Robotics for $1.64 billion ($58.50 per American Depository Share or $29.25 per ordinary share. In late November, Medtronic acquired Nutrino Health Ltd boosting the company's nutrition-related data services and analytics. In May 2019, Medtronic announced it would acquire Titan Spine, a technology company focusing on titanium spine implants. Chief Executive Officer Omar Ishrak retired in April 2020 and stayed on as executive chairman and chairman of the board until December 2020. Ishrak was succeeded by senior executive Geoff Martha. In January 2020, the company announced its intention to acquire Stimgenics, LLC and their primary therapy: differential target, multiplexed, spinal cord stimulation. In July, the company announced it would acquire Medicrea for €7.00 per share. In August, Medtronic announced it would acquire Companion Medical, who manufacture a smart insulin pen system, which connects to a diabetes management app. In September Medtronic acquired Avenu Medical for an undisclosed sum. In February 2021, the company recalled its HeartWare Ventricular Assist Device. In June 2021, the controller ports were pulled from the market. On 3 June 2021, the FDA alerted physicians to stop new implants of the HVAD system due to \"an increased risk of neurological adverse events and mortality associated with the internal pump.\" In January 2022, the business announced it would acquire Affera, Inc. In March, Medtronic announced a contract with Vizient, a healthcare performance improvement company, to add Medtronic's Touch Surgery Enterprise platform to Vizient's healthcare offerings. Touch Surgery works with laparoscopic and robotic scopes and is an AI-powered video management and analytics platform for the operating room. In May, Medtronic and DaVita Inc. announced plans to form a new, independent kidney care-focused medical device company. Medtronic's Renal Care Solutions business will be part of the new company. In April 2022, the company announced a collaboration with GE Healthcare to support the needs and care demands at Ambulatory Surgery Centers. In July, Medtronic announced a strategic partnership with CathWorks, a coronary artery disease (CAD) technology developer. A separate agreement gave Medtronic the option to acquire CathWorks in the future. In October 2022, the company announced its intention to pursue a separation of the company's combined Patient Monitoring and Respiratory Interventions businesses, which are part of the company's Medical Surgical Portfolio. In February 2024, the company announced that it had reversed its decision to spin-off or sell the Patient Monitoring and Respiratory Interventions businesses, and would instead combine them into a new business unit called Acute Care & Monitoring. They also announced that they would discontinue the ventilator product line, citing its unprofitability. Acquisition history Global rankings In May 2018, Medtronic was ranked as the world's largest medical device company by 2017 revenues (see table below). In March 2017, Bloomberg's database of U.S. tax inversions listed Medtronic and Wright Medical Group (Medtronic's 2015 inversion to Ireland was over $100 billion, while Wright's 2015 inversion to the Netherlands was $3.3 billion), as the only U.S. tax inversions of a U.S. medical device company in history. In February 2018, the Wall Street Journal listed Medtronic's 2015 tax inversion to Ireland as the largest U.S. corporate tax inversion executed between 2013 and 2016. In May 2018, Medtronic was ranked as the largest corporate tax inversion in history. In November 2021, the company was added to the Dow Jones Sustainability World Index. Business units and subsidiaries Medtronic has four main business units: the Minimally Invasive Therapies Group, the Diabetes Group, the Restorative Therapies Group, and the Cardiac and Vascular Group. Medtronic develops and manufactures devices and therapies to treat more than 30 chronic diseases, including heart failure, Parkinson disease, urinary incontinence, Down syndrome, obesity, chronic pain, spinal disorders and diabetes. Acute care and monitoring Acute care and monitoring (ACM) is based out of Lafayette, Colorado and produces non-invasive sensors and monitoring products, used for patient monitoring in the hospital and home settings. It has absorbed the portfolios of acquired companies, including Covidien, Nellcor, Somanetics, Aspect Medical Systems, Oridion Medical and Zephyr Technology. This business unit produces pulse oximetry, capnography, and bispectral index sensors, patient monitors, remote patient monitoring software, and electronic medical record connectivity software. Cardiac rhythm disease management Cardiac rhythm disease management (CRDM) is the oldest and largest of Medtronic's business units. Its work in heart rhythm therapies dates back to 1957 when Bakken developed the first wearable heart pacemaker to treat abnormally slow heart rates. Since then, it has expanded its expertise in electrical stimulation to treat other cardiac rhythm diseases. It has also made an effort to address overall disease management by adding diagnostic and monitoring capabilities to many of its devices. An independently-operating Dutch pacemaker manufacturer, Vitatron, acquired by Medtronic in 1986, is now a European subsidiary of the unit. Medtronic and Vitatron pacemakers are interrogated and programmed by Medtronic Carelink Model 2090 Programmer for Medtronic and Vitatron Devices; they use separate interfaces. In 2007, Medtronic recalled its Sprint Fidelis product, the flexible wires, or leads, which connect a defibrillator to the interior of the heart. The leads were found to be failing at an unacceptable rate, resulting in unnecessary shocks or no shocks when needed; either can be lethal. The scope of the problem continues to be a matter of research. Studies since the recall, disputed by Medtronic, suggest that the failure rate of already-implanted Sprint Fidelis leads is increasing exponentially. Medtronic's liability is limited by various court decisions. Spinal and biologics Spinal and biologics is Medtronic's second-largest business. Medtronic is the world leader in spinal and musculoskeletal therapies. In 2007, Medtronic purchased Kyphon, a manufacturer and seller of spinal implants that are necessary for procedures like kyphoplasty. In May 2008, Medtronic Spine agreed to pay the US government $75 million to settle a qui tam lawsuit after a whistleblower alleged that Medtronic committed Medicare fraud. The company was charged with illegally convincing healthcare providers to offer kyphoplasty, a spinal fracture repair surgery, as an inpatient, not an outpatient, procedure to make thousands of dollars more in profits per surgery. A \"special report\" by writer Steven Brill in Time showed that according to Medtronic's quarterly SEC filing of October 2012, the company had, on average, a 75.1% profit margin on its spine products and therapies. Cardiovascular Medtronic's cardiovascular therapies span the major specialties of interventional cardiology, cardiac surgery, and vascular surgery. The products are used to reduce the potentially debilitating effects of coronary, aortic, and structural heart disease. As of August 2024, cardiovascular portfolio included four product segments - cardiac rhythm products, heart failure products, structural heart and aortic products, coronary and peripheral products. Neuromodulation Neuromodulation is the second-oldest and third-largest department of Medtronic. Its products include neurostimulation systems and implantable drug delivery systems for chronic pain, common movement disorders, and urologic and gastrointestinal disorders. The department's revenues in 2014 amounted to $1.9 billion, or 11% of Medtronic's total revenues. Diabetes The diabetes management manufacturing and sales division of Medtronic is based on the perimeter of the California State University, Northridge campus in Northridge, California. The original company, Minimed Technologies, was founded in 1983 by Alfred E. Mann and spun off from Pacesetter Systems to design and market an open loop insulin pump. The MiniMed 502 was one of the first lightweight insulin pumps on the market, and it helped bring insulin pump usage to the mainstream market. In 1992, the MiniMed 506 was a major redesign to make it more appealing to consumers. The new design was met by boosted adoption rate, and sales increased by 357%. In 2001, Medtronic purchased Minimed, to form Medtronic Minimed. On 11 May 2009, Medtronic announced it had chosen San Antonio, Texas, for the location of its new Diabetes Therapy Management and Education Center. The company announced that it expected 1400 new jobs would be created to staff the 150,000-square-foot (14,000 m2) facility. In September 2016, the FDA approved a device, the MiniMed 670G which was launched in 2017. It was the world's first Hybrid Closed Loop system for people with type 1 diabetes. Featuring the company's advanced algorithm - SmartGuard technology and glucose sensor - Guardian™ Sensor 3, it was the first insulin pump approved by the Food and Drug Administration (FDA) that enabled personalized and automated* delivery of basal insulin, the background insulin needed to maintain stable blood sugar levels throughout the day and night. The advanced SmartGuard Auto Mode algorithm worked in conjunction with the company's glucose sensor - Guardian Sensor 3 - to self-adjust basal insulin delivery based on the glucose sensor. Surgical technologies The surgical technologies business group designed and manufactured products for the diagnosis and treatment of ear, nose, and throat (ENT) diseases and cranial, spinal, and neurologic conditions. It also encompassed a surgical navigation division to design \"StealthStation\" systems, software, and instruments for computer assisted surgery (CAS) and a special intraoperative X-ray imaging system (3D fluoroscopy), known as the O-arm Imaging System. Many of the products are used for minimally-invasive surgical procedures. In 2016, the business unit was dissolved, and each site folded into new business groups. Renal care solutions The renal care solutions business group designed and manufactured products for the diagnosis and treatment related to renal organs like kidney. In 2023 this business unit was spun off into an independent business called Mozarc Medical. Technology safety In 2011, an independent security researcher, Jay Radcliffe, revealed a security vulnerability in a Medtronic insulin pump at the computer security conference Black Hat Briefings, allowing an attacker to take control of the pump. Medtronic responded by assuring users of the full safety of its devices. In 2008, a team of computer security researchers was able to take remote control of a Medtronic cardiac implant. The team, using an unused implant in a lab, was able to control the electrical shocks delivered by the defibrillator component and even glean patient data from the device. In February 2020, Medtronic recalled around 322,000 MiniMed insulin pumps with faulty pump retainer rings, which had been correlated to death and around 2,000 injuries. Portable ventilators On 30 March 2020, Medtronic shared its portable ventilator design specifications during the outbreak of COVID-19 pandemic, in order to accelerate global ventilator production. Subsidiaries Vitatron Vitatron is a Netherlands-based European subsidiary of Medtronic. It is focused on development and manufacturing of cardiac pacing technology. Once an independently operating Dutch medical company, it was acquired by Medtronic in 1986. Vitatron pacemakers are interrogated and programmed by Medtronic Carelink Model 2090 Programmer for Medtronic and Vitatron Devices, using a separate interface. History of Vitatron 1956: Vitatron founded 1962: First Implantable pacemakers 1981: Microprocessor-driven, software-based pacemaker (DPG1) 1982: Rate Responsive pacemaker (TX1) 1984: Quintech DDD with automatic upper rate behavior (\"mode switch\") 1988: Daily Learn algorithm (Rhythmyx) 1997: First upgradeable pacemaker system with dedicated AF diagnostics, rate and rhythm control therapy. 2003: Vitatron goes digital: 1st Vitatron C-Series, the world's first fully digital pacemaker. 2004: 2nd Vitatron C-Series, digital, fast pacemaker. 2004: Vitatron T-Series: The full picture, digital pacemaker system. 2005: Vitatron C-Series, A3 models, a new top line range of digital pacemakers for bradycardic patients. Public-private engagement Activism Medtronic is a corporate partner of Human Rights Campaign, a large LGBT advocacy organization. Criticism Animal rights In 2005, 2008, and 2010 PETA threatened to submit a shareholder resolution to improve animal welfare standards in the company. In 2005, PETA attempted to stop five specific animal experiments that it deemed \"crude and cruel\". In 2008, PETA protested the outsourcing of animal testing to countries with lax animal welfare laws, such as China. In 2010, PETA attempted to stop Medtronic's reported use of live animals in testing and training. In response, Medtronic conducted a feasibility study that found that banning the use of live animals was impractical. As of 2015 Medtronic continued to use live animals for testing and training but stated that it would look for alternatives in the future. In each case, PETA withdrew its shareholder resolution after talks with Medtronic's leadership. Tax inversion to Ireland In June 2014, Medtronic announced it would execute a tax inversion to Ireland by acquiring Irish-based Covidien (a previous U.S. tax inversion to Ireland in 2007), for $42.9 billion in cash and stock. The tax inversion enabled Medtronic to move its legal headquarters to Ireland, while maintaining its operational and executive headquarters in the U.S., thus enabling it to reduce taxation on over $14 billion held overseas, and take advantage of Ireland's low corporation tax regime. Medtronic's tax inversion is the largest tax inversion in history, and given the changes in the U.S. tax-code in 2016 to block the Pfizer-Allergan Irish tax inversion, is likely to remain the largest. Medtronic CEO Omar Ishrak defended the tax inversion in a 2015 interview to the Financial Times saying, \"We just followed the rules and the deal was done based on strategic merits\". Ireland is less than 0.1% of Medtronic (or Covidien) sales, and the majority of Medtronic's sales, and an even greater percentage of Medtronic profits (due to the higher margins on U.S. medical devices), are from the U.S. healthcare system. In 2016, the Star Tribune reported that Medtronic was still winning U.S. Federal contracts and attending U.S. trade-missions as a U.S. company. In terms of scale, on 23 November 2018, Ireland's largest stockbrokers, Davy Stockbrokers reported that the total capitalization of the Irish stock market was €104 billion (this does not include Medtronic, which Davy do not consider an Irish company). In contrast, on the same day Medtronic's capitalization was listed on Bloomberg at just over $130 billion (or €115 billion). Medtronic's acquisition of Covidien made Medtronic the world's largest medical device company by revenues. Response to 2022 Russian invasion of Ukraine During the 2022 Russian invasion of Ukraine, Medtronic refused to join the international community and withdraw from the Russian market. Research from Yale University updated on 28 April 2022, identifying how companies were reacting to Russia's invasion identified Medtronic in the worst category of \"Digging In\" (\"F\" rank), meaning Defying Demands for Exit: companies defying demands for exit/reduction of activities. As of June 2, 2025, Medtronic's standing has improved slightly, now identified in the \"Buying Time\" (\"D\" rank) category, meaning Holding Off New Investments/Development: companies postponing future planned investment/development/marketing while continuing substantive business."
}