{
  "ticker": "MET",
  "cik": "0001099219",
  "company_name": "MetLife",
  "corrected_name": "MetLife",
  "wiki_title_used": "MetLife",
  "exists": true,
  "raw_text": "MetLife, Inc. is the holding corporation for the Metropolitan Life Insurance Company (MLIC), better known as MetLife, and its affiliates. MetLife is among the largest global providers of insurance, annuities, and employee benefit programs, with around 90 million customers in over 60 countries. The firm was founded on March 24, 1868. MetLife ranked No. 43 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.\nOn January 6, 1915, MetLife completed the mutualization process, changing from a stock life insurance company owned by individuals to a mutual company operating without external shareholders and for the benefit of policyholders. After 85 years as a mutual company, MetLife demutualized into a publicly traded company with an initial public offering in 2000. Through its subsidiaries and affiliates, MetLife holds leading market positions in the United States, Japan, Latin America, Asia's Pacific region, Europe, and the Middle East. MetLife serves 90 of the largest Fortune 500 companies.\nMetLife's head offices and boardroom are located at the MetLife Building at 200 Park Avenue in Midtown Manhattan and New York City which MetLife owned from 1981 to 2005; despite the sale, MetLife increased its leased footprint in the building beginning in 2015.\nIn January 2016, MetLife announced that it would spin off its U.S. retail business, including individual life insurance and annuities for the retail market, in a separate company called Brighthouse Financial, which launched in March 2017. The continuing MetLife company kept naming rights to MetLife Stadium in East Rutherford, New Jersey.\n\nHistory\nEarly years\nThe predecessor company to MetLife began in 1863 when a group of New York City business leaders raised $100,000 (equivalent to $2,553,800 in 2024) to found the National Union Life and Limb Insurance Company headquartered on lower Broadway. The company insured Civil War sailors and soldiers against disabilities due to wartime wounds, accidents, and sickness. Millions of \"industrial\" or workingman's policies were sold, costing five to ten cents a week, which were collected at the policyholder's home. On March 24, 1868, it became known as Metropolitan Life Insurance Company and shifted its focus to the life insurance business.\n\nThe Chicago fire of 1871 that destroyed 2,000 acres and $200 million (equivalent to $5.25 billion in 2024) worth of property, severely affected the insurance companies, which were legally obligated but financially unable to cover losses. Then, severe business depression that began with the Panic of 1873 forced the company to contract, until it reached its lowest point in the late 1870s. After observing the insurance industry in Great Britain in 1879, MetLife President Joseph F. Knapp brought \"industrial\" or \"workingmen's\" insurance programs to the United States – insurance issued in small amounts on which premiums were collected weekly or monthly at the policyholder's home. By 1880, sales had exceeded a quarter million of such policies, resulting in nearly $1 million in revenue from premiums. In 1909, MetLife had become the nation's largest life insurer in the United States, as measured by life insurance in force (the total value of life insurance policies issued).\nIn 1890, the Metropolitan Life Insurance Company Building was commissioned to serve as MetLife's home office on 23rd Street in Manhattan. The building was completed in stages through 1905. A clock tower was commissioned adjacent to the home office in 1907, and when completed two years later, the building was the world's tallest until 1913. The home office complex, which came to include the later art deco Metropolitan Life North Building, remained the company's headquarters until 2005. For many years, an illustration of the Metropolitan Life Tower (with light emanating from the tip of its spire and the slogan, \"The Light That Never Fails\") featured prominently in MetLife's advertising.\nIn 1905, a predecessor company, New England Life, lost a legal case, Pavesich v. New England Life Insurance Company, where they attempted to use an image of another person for promotion but this was ruled a breach of privacy and libelous: this case became a standardly cited case on privacy in US law.\nBy 1930, MetLife insured one of five men, women, and children in the United States and Canada. During the 1930s, it also began to diversify its portfolio by reducing the percentage of individual mortgages in favor of public utility bonds, investments in government securities, and loans for commercial real estate. The company financed the Empire State Building's construction in 1929 as well as provided capital for Rockefeller Center's construction in 1931. During World War II, MetLife placed more than 51 percent of its total assets in war bonds and was the largest single private contributor to the Allied cause.\n\nPostwar\nDuring the post-war era, the company expanded its suburban presence, decentralized operations, and refocused its career agency system to serve all market segments. It also began to market group insurance products to employers and institutions. By 1979, operations were segmented into four primary businesses: group insurance, personal insurance, pensions, and investments. In 1981 MetLife purchased the Pan Am Building from a group that included Pan American World Airways for the price of $400 million. The building was subsequently renamed and the prominently displayed Pan Am logo was replaced with the MetLife logo.\n\nDe-mutualization and IPO\nIn 2000, MetLife converted from a mutual insurance company operated for the benefit of its policyholders to a for-profit public company. The de-mutualization process allowed MetLife to enter unrelated insurance businesses and increase executive compensation.\nPolicyholders received some stock in the new company in this process. MetLife was accused of breaching federal securities laws by misrepresenting and omitting information in materials given to policyholders during this process, resulting in years of litigation ending with a $50 million settlement in 2009.\n\nAcquisitions, sales, and major deals\n1992 – merged with United Mutual Life Insurance Company, the only African-American life insurer in New York, in 1992.\n1992 –  acquired Executive Life's single premium deferred annuity business, which was worth approximately $1.2 billion. MetLife also acquired the firm's life insurance business, valued at about $260 million.\n1995 – sold Century 21 to Cendant (known as Hospitality Franchise Systems at the time) while purchasing New England Mutual Life Insurance Company.\n1997 – acquired Security First Group in 1997 for $377 million.\n1999 – acquired Lincoln National Corporation's individual disability income unit.\n1999 – bought out reinsurance provider GenAmerica Corporation for $1.2 billion, as well as its subsidiaries, Reinsurance Group of America and Conning Corporation. That year, the company had grown to serve 7 million policyholders.\n2000 – de-mutualization and IPO. The initial public offering was valued at $6.5 billion, which was the largest IPO to that date in United States financial history. MetLife policyholders were asked to choose a cash or stock stake. This IPO made MetLife the most widely owned stock in the United States, and it raised MetLife's value to over $4 billion. By 2000, MetLife's reported number of policyholders had risen to 11 million, and that year it had become the United States' number one life insurer, surpassing Prudential, according to The New York Times.\n2000 – $470 million voice and data network management deal with AT&T Solutions.\n2001 – acquired Grand Bank of Kingston, New Jersey, which was renamed MetLife Bank.\n2001 – invested $1 billion in the United States stock market during 2001, immediately after the September 11 terrorist attacks.\n2005 – acquired Citigroup’s Travelers Life & Annuity and all of Citigroup's international insurance businesses for $11.8 billion. At the time of the deal, which was completed on July 1, 2005, the Travelers acquisition made MetLife the largest individual life insurer in North America based on sales.\n2006 – opened joint-venture insurance company in Shanghai, in May 2006.\n2006 – sold Peter Cooper Village, or Stuyvesant Town, the largest apartment complexes in New York City at the time, for $5.4 billion. MetLife had developed the apartment complexes between 1945 and 1947, to house veterans returning home from serving in World War II.\n2010 – bought American Life Insurance Company from AIG for US$15,500,000,000.\n2011 – sold MetLife bank to GE Capital, exiting banking business.\n2021 – Farmers Insurance Group acquired the MetLife Auto & Home business from MetLife, Inc.\n\nCurrent era\nFrom 2004 to 2011, MetLife continued to hold its position as the largest life insurer in the United States.  The company had $2.5 trillion in policies written, $350 billion in assets under management, over 12 million customers in the United States, 8 million customers outside the United States, and a net income in 2003 of $2.2 billion. That year, Barron's reported that 13 million American households owned at least one product from MetLife.\nMetLife named Robert H. Benmosche as chairman and CEO in July 1999. Benmosche occupied the position until 2006, when he was replaced by C. Robert Henrikson.\nThe company's sales grew 11.5% between 2008 and 2009, despite the national recession. In 2011, CEO Robert Henrikson was replaced by Steven A. Kandarian, who had overseen the company's \"US$450,000,000,000 investment portfolio\" as chief investment officer.  Henrikson remained the company's chairman to the end of 2011, at which point he reached the company's mandatory retirement age.\nIn 2015, MetLife was ranked as number one on Fortune magazine's list of World's Most Admired Companies in the Insurance: Life and Health category.\nIn the summer of 2017, MetLife plans to add a third office building of 255,000 square feet at its Cary, North Carolina Global Technology Campus, giving the company a total of 655,000 square feet at a location which has over 1,000 employees in such areas as engineering, software and technology. This plan was the result of North Carolina awarding the company $94 million in incentives in 2013 for creating over 2,600 jobs, half in Cary and half in Charlotte.\n\n\"Too big to fail\"\nIn 2012, MetLife failed the Federal Reserve's (the Fed's) Comprehensive Capital Analysis and Review stress test, intended to predict the potential failure of the company in a recession. The Fed stated that the minimum total risk-based capital ratio should be 8% and it estimated MetLife's ratio at 6%. The company had requested approval for a US$2,000,000,000 share repurchase to prop up the stock price, along with an increased dividend. Because MetLife owned MetLife Bank, it was subject to stricter financial regulation. To escape that level of regulation, MetLife announced the sale of its banking unit to GE Capital. On November 2, 2012, MetLife said it was selling its US$70,000,000,000 mortgage servicing business to JPMorgan Chase for an undisclosed amount. Both sales were part of its strategy to focus on the insurance side of its business.\nThe attempt to escape \"too big to fail\" regulation was not successful. In September 2014, the United States government observed the 2010 Dodd-Frank financial reform law by proposing the application of an official label to MetLife as \"systemically important\" to the American economy. If implemented, MetLife would be subject to different sets of rules and regulations, with increased oversight from the Federal Reserve. The company appealed this proposal in November 2014. In December 2014, federal regulators decided that MetLife required the special regulations reserved for financial companies and organizations deemed \"systemically important,\" or \"too big to fail\". MetLife announced in January 2015 that it would file a lawsuit with the U.S. District Court for the District of Columbia to overturn the federal regulators' decision, thus becoming the first nonbank to challenge such a decision.  Three other nonbank companies have been designated as \"systemically important\": AIG, General Electric and Prudential.   MetLife continued to litigate this issue as of 2015, with the US Department of Justice asking that their challenge be dismissed.\n\nFines\nOn August 7, 2012, it was announced that MetLife will pay $3.2 million in fines after the Federal Reserve charged it used unsafe and unsound practices in handling its mortgage servicing and foreclosure operations.\nIn 2014, MetLife paid $23 million to settle multiple lawsuits over junk fax operations used to generate leads for life insurance sales.\n\nIn 2015, MetLife Home Loans LLC paid $123.5 million to the United States Department of Justice to resolve allegations it knowingly made mortgages insured by the United States government that didn't meet federal underwriting requirements.\n\nProducts and services\nAs of 2010, MetLife had a \"diverse product mix\" which included insurance (home, car and life), variable life annuities and structured settlements, commercial mortgages and securities backed by commercial mortgages, and sovereign debt.\n\nLife insurance\nMetLife's individual life insurance products and services comprise term life insurance and several types of permanent life insurance, including whole life, universal life, and final expense whole life insurance. These services vary in regards to the duration and amount of coverage available and whether a medical exam is required for coverage. The company also offers group life insurance, provided through employers, which consists of term life, permanent life, and accidental death and dismemberment coverage. MetLife is the largest life insurer in the United States, based on life insurance in-force.\n\nDental\nMetLife offers group dental benefit plans for individuals, employees, retirees and their families and provides dental plan administration for over 20 million people. Plans include MetLife's Preferred Dentist Program (PPO) and the SafeGuard DHMO (available for both individuals and employees in CA, FL, TX, NJ and NY.). As of May 2010, MetLife's dental PPO network included over 135,000 participating dentist locations nationwide while the dental HMO network included more than 13,000 participating dentist locations in California, Florida and Texas. MetLife also administers dental continuing education program for dentists and allied health care professionals, which are recognized by the American Dental Association (ADA) and the Academy of General Dentistry (AGD).\n\nDisability\nMetLife provides disability products for individuals as well as employee and association groups who receive them through their employer. For individuals, the company's individual disability income insurance can replace a portion of lost income if an individual is unable to work due to sickness or injury. MetLife offers several individual disability income policies, including MetLife Income Guard, OMNI Advantage, OMNI Essential, Business Overhead Expense, and Buy-Sell. The policy options provided by the company vary in terms of eligibility and the provided coverage. For groups, MetLife offers short term disability insurance and long term disability insurance. Short term disability insurance is structured to replace a portion of an individual's income during the initial weeks of a disabling illness or accident. Long term disability Insurance serves to replace a portion of an individual's income during an extended period of a disabling illness or accident. The company also maintains an absence management product which allows employers to track and manage both planned and unplanned employee absences. The product, which MetLife calls MetLife Total Absence Management, is structured for businesses with 1,000 or more employees.\n\nAnnuities\nMetLife is among the largest providers of annuities in the world, recording $22.4 billion in sales during 2009. MetLife offers annuities which consist of fixed annuities, variable annuities, deferred annuities and immediate annuities. In 1921, MetLife was the first company to issue a group annuity contract. More recently in 2004, it was the first insurer to introduce a longevity insurance product. As of December 31, 2009, MetLife globally managed group annuity assets of $60 billion with $34 billion of transferred pension liabilities and provided benefit payments to over 600,000 annuitants per month.\n\nPet insurance\nIn 2019, MetLife acquired PetFirst Healthcare, renaming it to MetLife Pet Insurance Solutions. The Pet Innovation Award named it \"Pet Insurance of the Year\" in 2023.\n\nAuto & Home\nMetLife Auto & Home is the brand name for MetLife's nine affiliate personal lines insurance companies. Collectively these companies offer personal lines property and casualty insurance policies in all 50 states and the District of Columbia. The flagship company in the MetLife Auto & Home group, Metropolitan Property and Casualty Insurance Company, was founded in 1972. \nIt was the first national insurer in the United States to offer identity-theft resolution services at no extra premium and as of 2012 continues to do so today in most United States states.\n\nOther products\nMetLife's products also include critical illness insurance. Financial services include fee-based financial planning, retirement planning, wealth management, 529 Plans, banking, and commercial and residential mortgages. The company also provides retirement plans and other financial services to healthcare, education, and not-for-profit organizations. The MetLife Center for Special Needs Planning is a group of planners which serve families and individuals with special needs. In 2014, MetLife launched MetLife Defender, a digital identity theft protection product.\n\nCorporate structure\nAs of 2010, MetLife was \"organized into five segments: Insurance Products, Retirement Products,\" the US Business (including Auto & Home and Corporate Benefit Funding), and International.  The Insurance Products division was the largest unit, accounting for 53% of 2009 revenue.  By 2015, a division referred to as \"Americas\" had emerged.\n\nCorporate governance\nAs of May 2019, MetLife's chief executive officer was Michel A. Khalaf and its non-executive chairman of the board was Glenn Hubbard.\nMetLife has a compensation committee which establishes remuneration for the company's senior executives, and emphasizes variable performance-based compensation over fixed pay rates.\nAs of December 2023, the board of directors of MetLife included:\n\nGlenn Hubbard – Non-executive chairman\nMichel A. Khalaf – CEO, president and director\nJohn D. McCallion – CFO and EVP\nMark Alan Weinberger – Independent director\nBill Pappas – EVP, Global technology & operations\n\nSubsidiary and affiliate companies\nMetLife subsidiaries and affiliates have included MetLife Investors, MetLife Bank, MetLife Securities, Metropolitan Property and Casualty Insurance Company and its subsidiaries, General American, MetLife Legal Plans, MetLife Resources, New England Financial, Walnut Street Securities, Inc., Safeguard Health Enterprises, Inc., and Tower Square Securities, Inc., Cigna.\nThe subsidiary MetLife Insurance Company USA, as of 2015, headquartered in Charlotte, North Carolina, was formerly known as MetLife Insurance Company of Connecticut, and prior to this as Travelers Insurance Company.\nMetLife Bank was sold to GE Capital in 2013, and MetLife exited the banking business.\nMetlife in partnership with Tishman Realty & Construction co-owns the Walt Disney World Swan and Dolphin resort in Lake Buena Vista, Florida. The land on which the hotels are located on is owned by The Walt Disney Company and is leased to Metlife and Tishman (which owns the buildings) and operated by Marriott International as a Westin hotel.\n\nInternational presence\nOutside of the United States, MetLife operates in Latin America, Europe, Asia's Pacific region, and the Middle East, with leading market positions in Mexico, Japan, South Korea, Bangladesh and Chile.\nOn March 8, 2010, MetLife announced its intent to purchase the international leader life-insurance business, American Life Insurance Company (Alico), from American International Group (AIG). MetLife, which completed the deal on November 1, 2010, paid approximately $7.2 billion in cash and $9.0 billion in MetLife equity and other securities. The securities portion of the deal consisted of 78.2 million shares of MetLife common stock, 6.9 million shares of contingent convertible preferred stock and 40 million equity units. The values of the common and preferred stock were based on the closing price of MetLife's common stock on October 29.  Upon completion of the purchase, MetLife became a leading competitor in Japan, the world's second-largest life insurance market, and moved into a top 5 market position in many high growth emerging markets in Central and Eastern Europe, such as Romania, the Middle East and Latin America. The deal added 20 million customers to MetLife's 70 million and according to Barron's more than doubled the percentage of operating profits that MetLife gets abroad to 40%.\nIn India MetLife has an affiliate company India Insurance Company Limited (MetLife) which has operated in India since 2001.  This company has its headquarters in Bangalore and Gurgaon and was jointly owned by MetLife and a few local Indian financial companies.  In 2012 an agreement was made with local Indian bank, the Punjab National Bank to establish a strategic alliance and for it to take a 30% share in MetLife India.  The state owned bank would in return sell MetLife insurance products in its branches\nAs of 2015, Julio Garcia-Villalon leads the Middle East & Africa regional business, which is headquartered in the Dubai International Financial Centre and has operated in the region since the 1950s.\nMetLife has been operating in Bangladesh since 1952. It is currently the leading life insurer and has been since 1997. MetLife Bangladesh is headquartered at the Motijheel Commercial Area, the main CBD of Dhaka.\n\nMetLife Foundation\nMetLife Foundation is MetLife's independent charitable and grant-awarding foundation. It was founded in 1976 and had provided over $650 million in grants by January 2015. The foundation has partnered with and donated to a variety of organizations, including Habitat for Humanity since 2010 and the Martin Luther King, Jr. National Memorial Project Foundation since 2008. In 2013, the MetLife Foundation announced a new focus on financial inclusion, including educational programs on basic financial planning for disadvantaged children and financial services aimed at low-income communities. According to the OECD, MetLife Foundation's financing for 2019 development increased by 20% to US$14 million.\n\nRelationship with Peanuts\nMetLife's use of comic strip characters since the mid 1980s, according to chief marketing officer Esther Lee, was intended \"to make our company more friendly and approachable during a time when insurance companies were seen as cold and distant.\"\nMetLife licensed Snoopy and other Peanuts characters for promotional purposes from the Iconix Brand Group, which owns the promotional rights to the works of Charles M. Schulz. In 2010, Iconix formed a joint venture with Schulz's heirs (as Charles Schulz himself died in 2000), buying out E. W. Scripps Co. and United Features Syndicate for $175 million. MetLife was reported to pay $12 million per year to Iconix for licensing rights. Prior to the Iconix deal, MetLife had licensed the characters from other rights-holders.\nThe Peanuts-based campaign was developed by the advertising agency Young & Rubicam.  MetLife also has used Foote Cone & Belding to develop Peanuts-related promotions.\nMetLife announced the end of its 31-year relationship with Peanuts on October 20, 2016. This decision resulted from the company's sale of its life insurance business to concentrate on corporate clients. MetLife's new blue and green logo was criticized for being a knock-off of comparison website Diffen.\nMetLife brought Snoopy back in 2023, as mascot for the new MetLife Pet Insurance division.\n\nBlimp and sports sponsorship\nThe MetLife blimp program began in 1987 with the \"Snoopy 1\" airship and, in 1994, expanded to include the \"Snoopy 2\" airship. The program provided aerial coverage to over 80 major sporting events every year and became the official aerial coverage provider of the PGA Tour. \"Snoopy 1\" and \"Snoopy 2\" also provided overhead television coverage for the NFL, CBS College Football, the LPGA, the NBA Finals, Copa Chile, the Preakness Stakes, and the Kentucky Derby. When MetLife ended their ‘’Peanuts’’ branding, they also brought the blimp program to a close.\n On August 23, 2011, MetLife agreed to a 25-year sponsorship deal to rename New Meadowlands Stadium in East Rutherford, New Jersey, home of the NFL's New York Giants and New York Jets to MetLife Stadium.  On January 16, 2017, MetLife agreed to a five-year sponsorship to rename Seibu Dome in Tokorozawa, Saitama Prefecture in Japan as the MetLife Dome.\nFrom 2014 to 2017, MetLife was the title sponsor of the BWF Super Series badminton tournament.\n\nWeight and longevity data\nIn 1959, The Metropolitan Life Insurance Company (as it was known at the time) released tables of the best weight for each height for longevity, based on their collected insurance data. These tables showed what were characterized as “desirable weights”. In 1983, the company released tables showing the “ideal” weights for greatest longevity; this information was based on data collected in the Build Study of 1979 collected by the Society of Actuaries. This data followed patients for 18 years (1954–1972) and was collected from 25 life insurance companies in Canada and the United States, representing 4.2 million people. These “ideal” weights were higher than the prior “desirable” weights, this was attributed to an increase in muscle mass due to improved fitness levels among the population.\nThis study is still the largest available pool of data for this purpose. It was noticed that the average weights in the population are higher than the ideal weights for survival. The ‘’’Metropolitan Tables’’’ included ‘’small’’, ‘’medium’’ and ‘’large’’ frames, based on elbow-girth measured using calipers, as the elbows do not develop adipose tissue. They presented weight ranges for height, sex and body frame (again associated with the lowest mortality) The midpoint of the ideal weight for the medium frames for each height was selected as the “ideal” weight used for calculations of “excess weight” (initial weight minus ideal weight). This led to a formula to calculate the ideal weight used by bariatric surgeons, but it had lost considerable accuracy by 2007, again due to improvements in medical care and in public health.\n\nSee also\nList of United States insurance companies\nPark La Brea, Los Angeles, California\nPark Merced, San Francisco, California\nParkfairfax, Virginia\nParkchester, Bronx\nRiverton Houses\nStuyvesant Town–Peter Cooper Village\n\nReferences\nArchives and records\nNew England Mutual Life Insurance Company records at Baker Library Special Collections, Harvard Business School.\nBusiness data for MetLife:",
  "clean_text": "MetLife, Inc. is the holding corporation for the Metropolitan Life Insurance Company (MLIC), better known as MetLife, and its affiliates. MetLife is among the largest global providers of insurance, annuities, and employee benefit programs, with around 90 million customers in over 60 countries. The firm was founded on March 24, 1868. MetLife ranked No. 43 in the 2018 Fortune 500 list of the largest United States corporations by total revenue. On January 6, 1915, MetLife completed the mutualization process, changing from a stock life insurance company owned by individuals to a mutual company operating without external shareholders and for the benefit of policyholders. After 85 years as a mutual company, MetLife demutualized into a publicly traded company with an initial public offering in 2000. Through its subsidiaries and affiliates, MetLife holds leading market positions in the United States, Japan, Latin America, Asia's Pacific region, Europe, and the Middle East. MetLife serves 90 of the largest Fortune 500 companies. MetLife's head offices and boardroom are located at the MetLife Building at 200 Park Avenue in Midtown Manhattan and New York City which MetLife owned from 1981 to 2005; despite the sale, MetLife increased its leased footprint in the building beginning in 2015. In January 2016, MetLife announced that it would spin off its U.S. retail business, including individual life insurance and annuities for the retail market, in a separate company called Brighthouse Financial, which launched in March 2017. The continuing MetLife company kept naming rights to MetLife Stadium in East Rutherford, New Jersey. History Early years The predecessor company to MetLife began in 1863 when a group of New York City business leaders raised $100,000 (equivalent to $2,553,800 in 2024) to found the National Union Life and Limb Insurance Company headquartered on lower Broadway. The company insured Civil War sailors and soldiers against disabilities due to wartime wounds, accidents, and sickness. Millions of \"industrial\" or workingman's policies were sold, costing five to ten cents a week, which were collected at the policyholder's home. On March 24, 1868, it became known as Metropolitan Life Insurance Company and shifted its focus to the life insurance business. The Chicago fire of 1871 that destroyed 2,000 acres and $200 million (equivalent to $5.25 billion in 2024) worth of property, severely affected the insurance companies, which were legally obligated but financially unable to cover losses. Then, severe business depression that began with the Panic of 1873 forced the company to contract, until it reached its lowest point in the late 1870s. After observing the insurance industry in Great Britain in 1879, MetLife President Joseph F. Knapp brought \"industrial\" or \"workingmen's\" insurance programs to the United States – insurance issued in small amounts on which premiums were collected weekly or monthly at the policyholder's home. By 1880, sales had exceeded a quarter million of such policies, resulting in nearly $1 million in revenue from premiums. In 1909, MetLife had become the nation's largest life insurer in the United States, as measured by life insurance in force (the total value of life insurance policies issued). In 1890, the Metropolitan Life Insurance Company Building was commissioned to serve as MetLife's home office on 23rd Street in Manhattan. The building was completed in stages through 1905. A clock tower was commissioned adjacent to the home office in 1907, and when completed two years later, the building was the world's tallest until 1913. The home office complex, which came to include the later art deco Metropolitan Life North Building, remained the company's headquarters until 2005. For many years, an illustration of the Metropolitan Life Tower (with light emanating from the tip of its spire and the slogan, \"The Light That Never Fails\") featured prominently in MetLife's advertising. In 1905, a predecessor company, New England Life, lost a legal case, Pavesich v. New England Life Insurance Company, where they attempted to use an image of another person for promotion but this was ruled a breach of privacy and libelous: this case became a standardly cited case on privacy in US law. By 1930, MetLife insured one of five men, women, and children in the United States and Canada. During the 1930s, it also began to diversify its portfolio by reducing the percentage of individual mortgages in favor of public utility bonds, investments in government securities, and loans for commercial real estate. The company financed the Empire State Building's construction in 1929 as well as provided capital for Rockefeller Center's construction in 1931. During World War II, MetLife placed more than 51 percent of its total assets in war bonds and was the largest single private contributor to the Allied cause. Postwar During the post-war era, the company expanded its suburban presence, decentralized operations, and refocused its career agency system to serve all market segments. It also began to market group insurance products to employers and institutions. By 1979, operations were segmented into four primary businesses: group insurance, personal insurance, pensions, and investments. In 1981 MetLife purchased the Pan Am Building from a group that included Pan American World Airways for the price of $400 million. The building was subsequently renamed and the prominently displayed Pan Am logo was replaced with the MetLife logo. De-mutualization and IPO In 2000, MetLife converted from a mutual insurance company operated for the benefit of its policyholders to a for-profit public company. The de-mutualization process allowed MetLife to enter unrelated insurance businesses and increase executive compensation. Policyholders received some stock in the new company in this process. MetLife was accused of breaching federal securities laws by misrepresenting and omitting information in materials given to policyholders during this process, resulting in years of litigation ending with a $50 million settlement in 2009. Acquisitions, sales, and major deals 1992 – merged with United Mutual Life Insurance Company, the only African-American life insurer in New York, in 1992. 1992 – acquired Executive Life's single premium deferred annuity business, which was worth approximately $1.2 billion. MetLife also acquired the firm's life insurance business, valued at about $260 million. 1995 – sold Century 21 to Cendant (known as Hospitality Franchise Systems at the time) while purchasing New England Mutual Life Insurance Company. 1997 – acquired Security First Group in 1997 for $377 million. 1999 – acquired Lincoln National Corporation's individual disability income unit. 1999 – bought out reinsurance provider GenAmerica Corporation for $1.2 billion, as well as its subsidiaries, Reinsurance Group of America and Conning Corporation. That year, the company had grown to serve 7 million policyholders. 2000 – de-mutualization and IPO. The initial public offering was valued at $6.5 billion, which was the largest IPO to that date in United States financial history. MetLife policyholders were asked to choose a cash or stock stake. This IPO made MetLife the most widely owned stock in the United States, and it raised MetLife's value to over $4 billion. By 2000, MetLife's reported number of policyholders had risen to 11 million, and that year it had become the United States' number one life insurer, surpassing Prudential, according to The New York Times. 2000 – $470 million voice and data network management deal with AT&T Solutions. 2001 – acquired Grand Bank of Kingston, New Jersey, which was renamed MetLife Bank. 2001 – invested $1 billion in the United States stock market during 2001, immediately after the September 11 terrorist attacks. 2005 – acquired Citigroup’s Travelers Life & Annuity and all of Citigroup's international insurance businesses for $11.8 billion. At the time of the deal, which was completed on July 1, 2005, the Travelers acquisition made MetLife the largest individual life insurer in North America based on sales. 2006 – opened joint-venture insurance company in Shanghai, in May 2006. 2006 – sold Peter Cooper Village, or Stuyvesant Town, the largest apartment complexes in New York City at the time, for $5.4 billion. MetLife had developed the apartment complexes between 1945 and 1947, to house veterans returning home from serving in World War II. 2010 – bought American Life Insurance Company from AIG for US$15,500,000,000. 2011 – sold MetLife bank to GE Capital, exiting banking business. 2021 – Farmers Insurance Group acquired the MetLife Auto & Home business from MetLife, Inc. Current era From 2004 to 2011, MetLife continued to hold its position as the largest life insurer in the United States. The company had $2.5 trillion in policies written, $350 billion in assets under management, over 12 million customers in the United States, 8 million customers outside the United States, and a net income in 2003 of $2.2 billion. That year, Barron's reported that 13 million American households owned at least one product from MetLife. MetLife named Robert H. Benmosche as chairman and CEO in July 1999. Benmosche occupied the position until 2006, when he was replaced by C. Robert Henrikson. The company's sales grew 11.5% between 2008 and 2009, despite the national recession. In 2011, CEO Robert Henrikson was replaced by Steven A. Kandarian, who had overseen the company's \"US$450,000,000,000 investment portfolio\" as chief investment officer. Henrikson remained the company's chairman to the end of 2011, at which point he reached the company's mandatory retirement age. In 2015, MetLife was ranked as number one on Fortune magazine's list of World's Most Admired Companies in the Insurance: Life and Health category. In the summer of 2017, MetLife plans to add a third office building of 255,000 square feet at its Cary, North Carolina Global Technology Campus, giving the company a total of 655,000 square feet at a location which has over 1,000 employees in such areas as engineering, software and technology. This plan was the result of North Carolina awarding the company $94 million in incentives in 2013 for creating over 2,600 jobs, half in Cary and half in Charlotte. \"Too big to fail\" In 2012, MetLife failed the Federal Reserve's (the Fed's) Comprehensive Capital Analysis and Review stress test, intended to predict the potential failure of the company in a recession. The Fed stated that the minimum total risk-based capital ratio should be 8% and it estimated MetLife's ratio at 6%. The company had requested approval for a US$2,000,000,000 share repurchase to prop up the stock price, along with an increased dividend. Because MetLife owned MetLife Bank, it was subject to stricter financial regulation. To escape that level of regulation, MetLife announced the sale of its banking unit to GE Capital. On November 2, 2012, MetLife said it was selling its US$70,000,000,000 mortgage servicing business to JPMorgan Chase for an undisclosed amount. Both sales were part of its strategy to focus on the insurance side of its business. The attempt to escape \"too big to fail\" regulation was not successful. In September 2014, the United States government observed the 2010 Dodd-Frank financial reform law by proposing the application of an official label to MetLife as \"systemically important\" to the American economy. If implemented, MetLife would be subject to different sets of rules and regulations, with increased oversight from the Federal Reserve. The company appealed this proposal in November 2014. In December 2014, federal regulators decided that MetLife required the special regulations reserved for financial companies and organizations deemed \"systemically important,\" or \"too big to fail\". MetLife announced in January 2015 that it would file a lawsuit with the U.S. District Court for the District of Columbia to overturn the federal regulators' decision, thus becoming the first nonbank to challenge such a decision. Three other nonbank companies have been designated as \"systemically important\": AIG, General Electric and Prudential. MetLife continued to litigate this issue as of 2015, with the US Department of Justice asking that their challenge be dismissed. Fines On August 7, 2012, it was announced that MetLife will pay $3.2 million in fines after the Federal Reserve charged it used unsafe and unsound practices in handling its mortgage servicing and foreclosure operations. In 2014, MetLife paid $23 million to settle multiple lawsuits over junk fax operations used to generate leads for life insurance sales. In 2015, MetLife Home Loans LLC paid $123.5 million to the United States Department of Justice to resolve allegations it knowingly made mortgages insured by the United States government that didn't meet federal underwriting requirements. Products and services As of 2010, MetLife had a \"diverse product mix\" which included insurance (home, car and life), variable life annuities and structured settlements, commercial mortgages and securities backed by commercial mortgages, and sovereign debt. Life insurance MetLife's individual life insurance products and services comprise term life insurance and several types of permanent life insurance, including whole life, universal life, and final expense whole life insurance. These services vary in regards to the duration and amount of coverage available and whether a medical exam is required for coverage. The company also offers group life insurance, provided through employers, which consists of term life, permanent life, and accidental death and dismemberment coverage. MetLife is the largest life insurer in the United States, based on life insurance in-force. Dental MetLife offers group dental benefit plans for individuals, employees, retirees and their families and provides dental plan administration for over 20 million people. Plans include MetLife's Preferred Dentist Program (PPO) and the SafeGuard DHMO (available for both individuals and employees in CA, FL, TX, NJ and NY.). As of May 2010, MetLife's dental PPO network included over 135,000 participating dentist locations nationwide while the dental HMO network included more than 13,000 participating dentist locations in California, Florida and Texas. MetLife also administers dental continuing education program for dentists and allied health care professionals, which are recognized by the American Dental Association (ADA) and the Academy of General Dentistry (AGD). Disability MetLife provides disability products for individuals as well as employee and association groups who receive them through their employer. For individuals, the company's individual disability income insurance can replace a portion of lost income if an individual is unable to work due to sickness or injury. MetLife offers several individual disability income policies, including MetLife Income Guard, OMNI Advantage, OMNI Essential, Business Overhead Expense, and Buy-Sell. The policy options provided by the company vary in terms of eligibility and the provided coverage. For groups, MetLife offers short term disability insurance and long term disability insurance. Short term disability insurance is structured to replace a portion of an individual's income during the initial weeks of a disabling illness or accident. Long term disability Insurance serves to replace a portion of an individual's income during an extended period of a disabling illness or accident. The company also maintains an absence management product which allows employers to track and manage both planned and unplanned employee absences. The product, which MetLife calls MetLife Total Absence Management, is structured for businesses with 1,000 or more employees. Annuities MetLife is among the largest providers of annuities in the world, recording $22.4 billion in sales during 2009. MetLife offers annuities which consist of fixed annuities, variable annuities, deferred annuities and immediate annuities. In 1921, MetLife was the first company to issue a group annuity contract. More recently in 2004, it was the first insurer to introduce a longevity insurance product. As of December 31, 2009, MetLife globally managed group annuity assets of $60 billion with $34 billion of transferred pension liabilities and provided benefit payments to over 600,000 annuitants per month. Pet insurance In 2019, MetLife acquired PetFirst Healthcare, renaming it to MetLife Pet Insurance Solutions. The Pet Innovation Award named it \"Pet Insurance of the Year\" in 2023. Auto & Home MetLife Auto & Home is the brand name for MetLife's nine affiliate personal lines insurance companies. Collectively these companies offer personal lines property and casualty insurance policies in all 50 states and the District of Columbia. The flagship company in the MetLife Auto & Home group, Metropolitan Property and Casualty Insurance Company, was founded in 1972. It was the first national insurer in the United States to offer identity-theft resolution services at no extra premium and as of 2012 continues to do so today in most United States states. Other products MetLife's products also include critical illness insurance. Financial services include fee-based financial planning, retirement planning, wealth management, 529 Plans, banking, and commercial and residential mortgages. The company also provides retirement plans and other financial services to healthcare, education, and not-for-profit organizations. The MetLife Center for Special Needs Planning is a group of planners which serve families and individuals with special needs. In 2014, MetLife launched MetLife Defender, a digital identity theft protection product. Corporate structure As of 2010, MetLife was \"organized into five segments: Insurance Products, Retirement Products,\" the US Business (including Auto & Home and Corporate Benefit Funding), and International. The Insurance Products division was the largest unit, accounting for 53% of 2009 revenue. By 2015, a division referred to as \"Americas\" had emerged. Corporate governance As of May 2019, MetLife's chief executive officer was Michel A. Khalaf and its non-executive chairman of the board was Glenn Hubbard. MetLife has a compensation committee which establishes remuneration for the company's senior executives, and emphasizes variable performance-based compensation over fixed pay rates. As of December 2023, the board of directors of MetLife included: Glenn Hubbard – Non-executive chairman Michel A. Khalaf – CEO, president and director John D. McCallion – CFO and EVP Mark Alan Weinberger – Independent director Bill Pappas – EVP, Global technology & operations Subsidiary and affiliate companies MetLife subsidiaries and affiliates have included MetLife Investors, MetLife Bank, MetLife Securities, Metropolitan Property and Casualty Insurance Company and its subsidiaries, General American, MetLife Legal Plans, MetLife Resources, New England Financial, Walnut Street Securities, Inc., Safeguard Health Enterprises, Inc., and Tower Square Securities, Inc., Cigna. The subsidiary MetLife Insurance Company USA, as of 2015, headquartered in Charlotte, North Carolina, was formerly known as MetLife Insurance Company of Connecticut, and prior to this as Travelers Insurance Company. MetLife Bank was sold to GE Capital in 2013, and MetLife exited the banking business. Metlife in partnership with Tishman Realty & Construction co-owns the Walt Disney World Swan and Dolphin resort in Lake Buena Vista, Florida. The land on which the hotels are located on is owned by The Walt Disney Company and is leased to Metlife and Tishman (which owns the buildings) and operated by Marriott International as a Westin hotel. International presence Outside of the United States, MetLife operates in Latin America, Europe, Asia's Pacific region, and the Middle East, with leading market positions in Mexico, Japan, South Korea, Bangladesh and Chile. On March 8, 2010, MetLife announced its intent to purchase the international leader life-insurance business, American Life Insurance Company (Alico), from American International Group (AIG). MetLife, which completed the deal on November 1, 2010, paid approximately $7.2 billion in cash and $9.0 billion in MetLife equity and other securities. The securities portion of the deal consisted of 78.2 million shares of MetLife common stock, 6.9 million shares of contingent convertible preferred stock and 40 million equity units. The values of the common and preferred stock were based on the closing price of MetLife's common stock on October 29. Upon completion of the purchase, MetLife became a leading competitor in Japan, the world's second-largest life insurance market, and moved into a top 5 market position in many high growth emerging markets in Central and Eastern Europe, such as Romania, the Middle East and Latin America. The deal added 20 million customers to MetLife's 70 million and according to Barron's more than doubled the percentage of operating profits that MetLife gets abroad to 40%. In India MetLife has an affiliate company India Insurance Company Limited (MetLife) which has operated in India since 2001. This company has its headquarters in Bangalore and Gurgaon and was jointly owned by MetLife and a few local Indian financial companies. In 2012 an agreement was made with local Indian bank, the Punjab National Bank to establish a strategic alliance and for it to take a 30% share in MetLife India. The state owned bank would in return sell MetLife insurance products in its branches As of 2015, Julio Garcia-Villalon leads the Middle East & Africa regional business, which is headquartered in the Dubai International Financial Centre and has operated in the region since the 1950s. MetLife has been operating in Bangladesh since 1952. It is currently the leading life insurer and has been since 1997. MetLife Bangladesh is headquartered at the Motijheel Commercial Area, the main CBD of Dhaka. MetLife Foundation MetLife Foundation is MetLife's independent charitable and grant-awarding foundation. It was founded in 1976 and had provided over $650 million in grants by January 2015. The foundation has partnered with and donated to a variety of organizations, including Habitat for Humanity since 2010 and the Martin Luther King, Jr. National Memorial Project Foundation since 2008. In 2013, the MetLife Foundation announced a new focus on financial inclusion, including educational programs on basic financial planning for disadvantaged children and financial services aimed at low-income communities. According to the OECD, MetLife Foundation's financing for 2019 development increased by 20% to US$14 million. Relationship with Peanuts MetLife's use of comic strip characters since the mid 1980s, according to chief marketing officer Esther Lee, was intended \"to make our company more friendly and approachable during a time when insurance companies were seen as cold and distant.\" MetLife licensed Snoopy and other Peanuts characters for promotional purposes from the Iconix Brand Group, which owns the promotional rights to the works of Charles M. Schulz. In 2010, Iconix formed a joint venture with Schulz's heirs (as Charles Schulz himself died in 2000), buying out E. W. Scripps Co. and United Features Syndicate for $175 million. MetLife was reported to pay $12 million per year to Iconix for licensing rights. Prior to the Iconix deal, MetLife had licensed the characters from other rights-holders. The Peanuts-based campaign was developed by the advertising agency Young & Rubicam. MetLife also has used Foote Cone & Belding to develop Peanuts-related promotions. MetLife announced the end of its 31-year relationship with Peanuts on October 20, 2016. This decision resulted from the company's sale of its life insurance business to concentrate on corporate clients. MetLife's new blue and green logo was criticized for being a knock-off of comparison website Diffen. MetLife brought Snoopy back in 2023, as mascot for the new MetLife Pet Insurance division. Blimp and sports sponsorship The MetLife blimp program began in 1987 with the \"Snoopy 1\" airship and, in 1994, expanded to include the \"Snoopy 2\" airship. The program provided aerial coverage to over 80 major sporting events every year and became the official aerial coverage provider of the PGA Tour. \"Snoopy 1\" and \"Snoopy 2\" also provided overhead television coverage for the NFL, CBS College Football, the LPGA, the NBA Finals, Copa Chile, the Preakness Stakes, and the Kentucky Derby. When MetLife ended their ‘’Peanuts’’ branding, they also brought the blimp program to a close. On August 23, 2011, MetLife agreed to a 25-year sponsorship deal to rename New Meadowlands Stadium in East Rutherford, New Jersey, home of the NFL's New York Giants and New York Jets to MetLife Stadium. On January 16, 2017, MetLife agreed to a five-year sponsorship to rename Seibu Dome in Tokorozawa, Saitama Prefecture in Japan as the MetLife Dome. From 2014 to 2017, MetLife was the title sponsor of the BWF Super Series badminton tournament. Weight and longevity data In 1959, The Metropolitan Life Insurance Company (as it was known at the time) released tables of the best weight for each height for longevity, based on their collected insurance data. These tables showed what were characterized as “desirable weights”. In 1983, the company released tables showing the “ideal” weights for greatest longevity; this information was based on data collected in the Build Study of 1979 collected by the Society of Actuaries. This data followed patients for 18 years (1954–1972) and was collected from 25 life insurance companies in Canada and the United States, representing 4.2 million people. These “ideal” weights were higher than the prior “desirable” weights, this was attributed to an increase in muscle mass due to improved fitness levels among the population. This study is still the largest available pool of data for this purpose. It was noticed that the average weights in the population are higher than the ideal weights for survival. The ‘’’Metropolitan Tables’’’ included ‘’small’’, ‘’medium’’ and ‘’large’’ frames, based on elbow-girth measured using calipers, as the elbows do not develop adipose tissue. They presented weight ranges for height, sex and body frame (again associated with the lowest mortality) The midpoint of the ideal weight for the medium frames for each height was selected as the “ideal” weight used for calculations of “excess weight” (initial weight minus ideal weight). This led to a formula to calculate the ideal weight used by bariatric surgeons, but it had lost considerable accuracy by 2007, again due to improvements in medical care and in public health."
}