{
  "ticker": "MGM",
  "cik": "0000789570",
  "company_name": "MGM Resorts",
  "corrected_name": "MGM Resorts",
  "wiki_title_used": "MGM Resorts",
  "exists": true,
  "raw_text": "MGM Resorts International is an American  multinational hospitality, sports and entertainment company. It operates resorts in Las Vegas, Massachusetts, Michigan, Mississippi, Maryland, Ohio, New Jersey, Macau, Shanghai, Chengdu, Hangzhou and Sanya, including the Bellagio, Mandalay Bay, MGM Grand and Park MGM.\nThe company began operations in 1987 as MGM Grand, Inc. and became MGM Mirage in 2000, after acquiring Mirage Resorts. In the mid-2000s, growth of its non-gambling (lodging, food, retail) revenue began to outpace gambling receipts and demand for high-rise condominiums was surging, with median property prices in Las Vegas twice the national average. The company shifted its focus from owning and operating resorts and casinos to developing and building real estate in the leisure and gambling industry—launching the massive CityCenter mixed-use project, which was at the time of its construction the world's largest construction site and ranks as one of the most expensive real estate projects in history. City Center's development coincided with the 2008 financial crisis, causing more than $1 billion in write-offs in its valuation.\nBillionaire investor Kirk Kerkorian and his Tracinda Corporation were, until 2009, the majority shareholders of MGM Mirage;  Kerkorian was the former owner of the Metro-Goldwyn-Mayer (MGM) movie studio, from which MGM Grand derived its name. Following a $1 billion stock offering by MGM Mirage amidst the global credit crunch, Tracinda's shares were diluted from 53.8% to 39%. On June 15, 2010, shareholders voted for MGM Mirage to change its name to \"MGM Resorts International\".\nIn 2015, the company split into two forming MGM Growth Properties, a real estate company, while MGM Resorts shifted to operating properties. Today, MGM Resorts is the largest casino company in the world by revenue, making $13.13 billion USD in revenue in 2022.\n\nHistory\nBackground and early ventures (1969–1988)\nThe company's background can be traced to 1969, when airline and casino tycoon Kirk Kerkorian bought a controlling stake in the Metro-Goldwyn-Mayer (MGM) film studio. In 1970 and 1971, Kerkorian struggled with debt from his acquisitions of MGM and Western Airlines, and was forced to sell a majority of his casino company, International Leisure, to Hilton Hotels at a steep discount. When the Las Vegas Hilton, the casino he had built, subsequently became the most successful hotel in Las Vegas, Kerkorian was inspired to lead the studio into the gambling industry. It opened the original MGM Grand Hotel and Casino (now Horseshoe Las Vegas) in 1973. The MGM Grand Reno followed in 1978.\nBy 1979, the two hotel-casinos accounted for most of MGM's income, and the company announced a plan to split itself in two. The next year, the film studio was spun off as a new company, while the original company, renamed as MGM Grand Hotels Inc., retained the two hotel-casinos. Kerkorian held a 47 percent stake in both companies.\nIn 1985, Kerkorian began seeking a buyer for MGM Grand Hotels, to allow him to concentrate on running United Artists and on developing new properties under the MGM Grand name. A deal was reached for Bally Manufacturing to buy the company; the deal closed in April 1986, and the two casinos were renamed under the Bally's brand. The terms of the sale allowed Kerkorian to retain rights to the MGM Grand name, and plans were announced to offer the stockholders of MGM Grand Hotels shares in a new company that would hold the naming rights.\nThe company now known as MGM Resorts International was formed in 1986 as Grand Name Co. as a subsidiary of Kerkorian's Tracinda Corporation. It was renamed in 1987 as MGM Grand, Inc.\nThe company's first venture was MGM Grand Air, a luxury airline offering service between New York and Los Angeles, which launched in September 1987. The company also made an offer to take over financially struggling Pan American World Airways, but this offer was rejected by Pan Am's board in November 1987.\nIn August 1987, MGM Grand bid $152 million for the bankrupt Dunes Hotel in Las Vegas, but was beat out by Japanese billionaire Masao Nangaku. Instead, the company acquired the Desert Inn and Sands casinos in February 1988 from Summa Corporation for $167 million. The Sands was sold to Sheldon Adelson's Interface Group for $110 million in April 1989.\n\nFirst casino developments (1989–1999)\nIn September 1989, the company announced plans for a $700-million Hollywood-themed complex, including a 4,000-room hotel and a theme park. The Desert Inn site was initially considered as a location for the project, but within weeks the location was finalized as the Marina Hotel and Casino and the Tropicana Country Club, which MGM Grand acquired for $93 million plus $30 million in stock. The company put the Desert Inn up for sale to focus efforts on the new project, but found no outside bidders, and agreed to sell it to Tracinda for $130 million. Construction on the MGM Grand Las Vegas and the MGM Grand Adventures theme park began in October 1991, and the property opened in December 1993 at a final cost of $1 billion. The park permanently closed in 2002 due to a lack of interest.\nThe company moved its headquarters from Beverly Hills to Las Vegas in July 1992.\nDuring construction of the MGM Grand, the company acquired an option to buy an 18-acre site across the street from the project. Gary Primm of Primadonna Resorts approached MGM president Bob Maxey in 1994 with an idea for the site: a casino recreating the New York skyline. A joint venture was formed between the two companies, and construction began in March 1995. Completed at a cost of $460 million, the New York-New York Hotel and Casino opened in January 1997.\nWith New York-New York under development, MGM Grand made moves to expand in several other markets. An exploratory agreement to develop two casinos on the Chinese island of Hainan was announced in August 1994, but came to nothing. In Darwin, Australia, a lucrative market attracting high rollers from Pacific Rim countries, the company considered building a hotel, but instead bought the Diamond Beach Hotel and Casino, renaming it as the MGM Grand Darwin. MGM announced plans for an Atlantic City casino in July 1996. In Michigan, where voters approved casinos in November 1996, MGM made plans for a bid on one of the three available gambling licenses, which would eventually be approved and open in July 1999 as the MGM Grand Detroit.\nIn South Africa, with casino gambling newly authorized, MGM announced plans in August 1996 to develop 15 properties in conjunction with Tsogo Sun. The first, a temporary casino in Johannesburg's Sundome, opened in October 1998. Three more casinos followed before MGM agreed to sell out its interest in the properties to Tsogo Sun in November 2001.\nSince the initiation of New York-New York, analysts had speculated that MGM Grand or Primadonna would buy out the other's interest in the project. Instead of making such a cash-intensive purchase, however, MGM agreed to buy Primadonna outright for $276 million in stock plus $336 million in assumed debt. The merger closed in March 1999, giving MGM ownership of three casinos and two golf courses at the Nevada–California state line, in addition to full control of New York-New York.\n\nMirage Resorts merger (2000)\nIn February 2000, MGM Grand made an unsolicited offer of $17 a share to buy Mirage Resorts, which had floundered due to disappointing results at its new Beau Rivage and Bellagio resorts. Analysts expected a protracted battle, with Mirage founder Steve Wynn seen as unwilling to give up control but under pressure from institutional investors. Mirage rejected the offer, but Wynn met with Kerkorian the next day and named a price of $21 a share. The companies agreed on the higher price, for a total of $4.4 billion plus $2 billion in assumed debt. The merger closed in May 2000, giving MGM ownership of the Mirage, Treasure Island, Bellagio, Boardwalk, and Golden Nugget casinos in Las Vegas, the Golden Nugget in Laughlin, and the Beau Rivage in Mississippi, and a half share of the Monte Carlo. The company changed its name to MGM Mirage in August 2000. Mirage had also owned a half stake in the Borgata, a planned casino in Atlantic City, in a joint venture managed by Boyd Gaming. Work on the Borgata continued apace, and it would open in July 2003.\n\nStalled developments (2001–2004)\nIn 2001 and 2002, following the merger with Mirage, the company explored options for its next major development project, including in the Las Vegas, Atlantic City, Chicago, and Macau markets. The 55-acre site of the Boardwalk casino on the Las Vegas Strip was earmarked for a technologically advanced megaresort targeting a Generation X demographic. In Atlantic City, MGM shifted focus from its previously announced boardwalk site to a proposed billion-dollar hotel and casino on a 55-acre tract adjacent to the Borgata, where Wynn had planned to build the Le Jardin casino. In the Chicago market, MGM agreed to pay $600 million to buy the unfinished Emerald Casino in Rosemont, Illinois, whose investors had been accused of ties to organized crime. The deal was rejected, however, by state gambling regulators, and MGM then backed off its effort, saying that Illinois's casino tax was too high. In Macau, where Stanley Ho's 40-year government-granted monopoly on gambling was coming to an end, MGM submitted a bid for one of three available gambling concessions, but it was not selected, losing out to Ho, Las Vegas Sands, and Wynn Resorts.\nMGM made moves into the United Kingdom market after a 2001 government report called for loosening of the country's gambling regulations. It opened an online casino, playmgmmirage.com, licensed in the Isle of Man, a British dependency, and it applied for a license to run an online sports betting site in the U.K. It acquired a twenty-five percent stake in a company developing the small Triangle Casino in Bristol, which went on to open its doors in February 2004. It inked deals to build casinos at the Olympia Exhibition Centre in London, St James' Park in Newcastle, Meadowhall Shopping Centre in Sheffield, the National Exhibition Centre in Birmingham, Sportcity in Manchester, Glasgow Harbour, King's Waterfront in Liverpool, and at a proposed stadium in Salford. The company also signed a $490-million deal to acquire Wembley plc, owner of seven greyhound tracks in Britain and four in the United States.\nThe British expansion plans ultimately amounted to nothing. MGM closed its online casino after less than two years, citing uncertainty in American regulations and competition from established British brands. The Wembley acquisition turned into a bidding war, with MGM finally losing out to an investors group including Kerzner International. The Triangle Casino was sold off to Stanley Leisure in 2006. The company's other development plans were scuttled as the government scaled down, and eventually abandoned, the plan to allow large \"super-casinos\".\nIn 2004, the company disposed of some of its smaller properties, selling the two Golden Nugget casinos (Golden Nugget Las Vegas and Golden Nugget Laughlin) to Poster Financial Group for $215 million, and the MGM Grand Darwin to Skycity Entertainment for $140 million.\n\nMandalay merger (2004–2005)\nMGM entered into quiet merger talks with Mandalay Resort Group in early 2004. The potential acquisition would give MGM control of more than half the hotel rooms on the Las Vegas Strip. Mandalay assets attractive to MGM included low-end casinos like Excalibur and Circus Circus to broaden MGM's \"high roller\" appeal; the Mandalay Bay Convention Center, which would allow MGM to compete directly with the Sands Expo center in the convention market; and at least two prime developable sites on the Strip. The talks went public in June, when MGM announced an offer worth $7.65 billion. Mandalay rejected that offer because of a clause allowing MGM to back out if antitrust regulators demanded the sale of any properties. Analysts speculated that another bidder such as Harrah's or Boyd might enter, but none did, and MGM and Mandalay soon agreed on a $7.9 billion deal.\nMGM executives were confident that antitrust regulators would not require the sale of any of the two companies' properties. Michigan law, however, forbade one company from owning multiple casinos, requiring the sale of either the MGM Grand Detroit or Mandalay's 54 percent stake in the MotorCity Casino. After some vacillation about which property to sell, Mandalay accepted a $525-million offer for its interest in MotorCity from Marian Ilitch, the casino's second largest shareholder. Meanwhile, in Illinois, where MGM needed regulatory approval to take over Mandalay's 50 percent interest in the Grand Victoria Casino, a lack of quorum on the state Gaming Board threatened to delay the merger. MGM considered a sale to the casino's other owner, the Pritzker family, but ultimately gained approval for a plan to place the property under control of a trustee until completion of the licensing process. The FTC approved the merger as predicted, and MGM obtained a $7 billion line of credit to finance it. The sale closed on April 25, 2005 for a total of $7.9 billion, including $3 billion in assumed debt.\nThe Mandalay acquisition made MGM Mirage the largest gambling company in the world, but it was surpassed just two months later when Harrah's Entertainment acquired Caesars Entertainment in a deal that had been spurred on by news of the MGM-Mandalay merger.\n\nLater developments (2004–2006)\nDespite MGM's initial failure to win a gambling concession in Macau, the company had remained interested in the burgeoning gambling market. Rumors of a possible partnership with Stanley Ho were reported in 2003, but Nevada gambling regulators informally vetoed the idea because of the alleged involvement of organized crime triads in his casinos. Another possibility emerged when the government allowed the three gaming concessionaires to each sell a sub-concession. In June 2004, MGM formed a joint venture with Pansy Ho, Stanley's daughter, to develop a casino-hotel under a sub-concession from Stanley. Despite initial concerns about whether Pansy Ho was subject to her father's influence, the Nevada Gaming Commission eventually approved the partnership. Construction of the MGM Grand Macau began in June 2005. The property opened in December 2007, completed at a cost of $1.25 billion.\nIn 2004, MGM solidified its plans for the Boardwalk site on the Strip, announcing Project CityCenter, an $8-billion high-density project including hotels, condominiums, a casino, and a shopping mall. The Boardwalk was closed in January 2006 to make way for the redevelopment, and CityCenter construction began the following June.\nSingapore emerged in 2004 as the next major new Asian gambling market, calling for proposals to build two \"integrated resort\" casinos at Marina Bay and the island of Sentosa. MGM partnered with CapitaLand in an estimated $3 billion bid for the Marina Bay site. Their bid advanced to the final stage against three competitors, and was seen as the favorite to win. The government awarded the license, however, to Las Vegas Sands, citing its strength in the meetings and conventions sector.\nIn 2007, MGM Mirage disposed of some outlying properties in Southern Nevada. The two Laughlin casinos (the Colorado Belle and Edgewater) were sold for $200 million, the Primm Valley Resorts were sold for $400 million, and the Nevada Landing Hotel and Casino was closed.\n\nDubai World investment (2007–2009)\nOn April 19, 2007 the company announced that it planned to purchase a 7.6-acre (31,000 m2) site from Concord Wilshire Partners for $130 million and a 25.8-acre (104,000 m2) site from Gordon Gaming for $444 million.  The two parcels give the company complete control of the southwest corner of the Sahara and Las Vegas Boulevard intersection.  When combined with underused parts of the Circus Circus site, the company will have a 68-acre (280,000 m2) site for future development.  The Concord site had been the proposed location for the Maxim Casino.\nOn August 22, 2007, Dubai World said it would buy a 9.5 percent stake in MGM for about $2.4 billion. It would also invest about $2.7 billion to acquire a 50 percent stake in MGM's CityCenter project. Dubai World would pay MGM Mirage an additional $100 million if the project opened on time and on budget. The investment firm would buy 14.2 million shares from MGM Mirage. The firm would also issue a public tender for an additional 14.2 million shares at the same price.\n\nIn October 2008, MGM Mirage halted a $5 billion Atlantic City project on land next to the Borgata.\nAt about the same time, New Jersey gambling regulators were evaluating MGM Mirage's suitability to operate casinos in New Jersey, and were unconvinced that MGM Mirage's Macau partner, Pansy Ho, could operate independently from influence of her father, Stanley Ho.  The latter was often accused of ties with Chinese organized crime and letting the gangs operate in his casinos' VIP rooms. Faced with not complying with New Jersey gambling regulations, MGM Mirage decided to divest the highly profitable Borgata in order to continue pursuing the even more lucrative Chinese market.  MGM Mirage subsequently transferred its 50% share in the Borgata to a divestiture trust through which it received all benefit of the ownership.  The trust was responsible for selling MGM's interest within 30 months, although MGM had the right to direct the trustee during the first 18 months.\nIn December 2008, MGM Mirage announced the sale of its Las Vegas Treasure Island resort and casino to billionaire Phil Ruffin. The sale was completed on March 20, 2009 for $600 million in cash plus a $175 million promissory note.\nIn March 2009, Dubai World and Infinity World announced that they had filed a lawsuit in the Delaware Chancery Court seeking to be released from their CityCenter joint venture agreement with MGM Mirage after the company filed its annual report stating that \"there is substantial doubt about our ability to continue as a going concern,\" and \"it cannot provide assurance that its business would generate sufficient cash flow from operation.\"\nStarting in April 2009, news reports surfaced that MGM Mirage had hired investment firm Morgan Stanley to assist the company in finding possible buyers for the MGM Grand Detroit and the Beau Rivage.\n\nName change and recent years (2010–present)\nIn June 2010, MGM Mirage changed its name to \"MGM Resorts International\", to emphasize the brand's global scope and increased non-gambling strategy.\nIn May 2011, an initial public offering was held for the MGM Macau property through a new holding company, MGM China. MGM retained a 51 percent interest in the company, with Pansy Ho holding a 29 percent stake, and 20 percent sold to public investors for $1.5 billion. In January 2013, MGM China received government approval to build its second resort in Macau.\nIn 2013, MGM won state licenses to build a $1-billion resort in National Harbor, Maryland and a $950-million resort in downtown Springfield, Massachusetts.\nIn May 2014, the company broke ground on the $375-million T-Mobile Arena located behind New-New York Hotel and Casino, in partnership with AEG Live. The arena opened on April 6, 2016.\nMGM sold several properties in 2015, including the Railroad Pass Casino, the Gold Strike, and properties in Reno (Circus Circus Reno and a 50 percent stake in the Silver Legacy) were sold to Eldorado Resorts for $72.5 million.\nIn April 2016, MGM sold The Shops at Crystals, the high-end mall in CityCenter, to Invesco Real Estate and Simon Property Group for $1.1 billion.\nIn April 2016, MGM held an initial public offering for MGM Growth Properties (MGP), a new real estate investment trust (REIT) with ownership of ten of the company's casinos; the parent company would continue to operate the casinos under a lease agreement. The offering raised $1.05 billion, and left MGM Resorts with 76 percent ownership of the REIT. In June 2016, MGM announced a joint venture with Sydell Group to renovate and rebrand the Monte Carlo as the Park MGM, named after the adjacent dining and entertainment district, The Park, that opened in April 2016. In August 2016, MGM bought out Boyd Gaming's interest in the Borgata for $900 million, and then sold the property to MGP for $1.2 billion and leased it back for $100 million per year.\nIn 2017, MGM launched two online ventures under the PlayMGM brand: an online sportsbook in Nevada, and an online casino in New Jersey.\nIn October 2017, MGM purchased the San Antonio Stars of the Women's National Basketball Association. The team was moved to Mandalay Bay Events Center and began play as the Las Vegas Aces in 2018. In August 2018, MGM and Hyatt sold the Grand Victoria Casino to Eldorado Resorts for $328 million. In January 2019, MGM bought Yonkers Raceway and Empire City Casino in New York from the Rooney family for $850 million, and then immediately sold the land and buildings to MGP for $625 million, and leased them back for $50 million per year. MGM Resorts is bidding to secure a full casino license for their Empire City Casino which would allow for table games. If awarded a casino license, they will also expand the casino and add new amenities. The community advisory committee voted 5-0 in favor of the proposed development on September 25, 2025. This vote advances MGM’s bid to be considered for a full casino license in New York.\nIn 2019, MGM sold two resorts on the Las Vegas strip: Bellagio and Circus Circus. They sold their real estate assets of Bellagio to Blackstone Group while selling Circus Circus to Phil Ruffin. In 2020, they sold their real estate assets of MGM Grand and Mandalay Bay to a joint venture between Blackstone and MGP.\nIn 2021, MGM bought 50% of Dubai World's share of CityCenter and sold the real estate assets of Aria and Vdara to Blackstone and later purchased the operating assets of Cosmopolitan of Las Vegas and later sold the Mirage to Hard Rock International. Also in 2021, MGM would sell the Las Vegas Aces to Mark Davis, owner of the Las Vegas Raiders.\nMGM is looking to secure a casino license in the United Arab Emirates in order to operate a casino at their upcoming property in Dubai which is set to open in 2028. So far, only Wynn Resorts has secured a gambling license in the country.\n\nResponse to the COVID-19 pandemic\nIn August 2020, MGM cut 18,000 job positions as a result of the effects of the COVID-19 pandemic. The job cuts represent one fourth of its workforce, which before the start of the pandemic was 68,000.\n\nAttempts to block tribal casino developments\nMGM lobbied the Trump administration against giving federal approval for a casino operated by two native tribes in East Windsor, Connecticut. The casino would have provided competition to a MGM casino across the border in Massachusetts.\n\nMarriott partnership\nIn July 2023, MGM Resorts announced an agreement with Marriott International to bring its 17 properties within Marriott's global reservations system and its Bonvoy loyalty program, creating the MGM Collection With Marriott Bonvoy. The new partnership will see four of MGM's properties fully affiliated with Marriott brands beginning in late 2023. The Bellagio will join The Luxury Collection division of Marriott, the Park MGM will join Marriott's Tribute Portfolio, and the Aria will join Marriott's Autograph Collection, which The Cosmopolitan has been a member of since its opening.\n\nCybersecurity attack\nIn September 2023, MGM's hotel and casino operations were disrupted for several days during a cybersecurity attack by the hacking group Scattered Spider. The company refused to pay a ransom to the hackers, and stated that its losses of $100 million would be covered by cyber insurance. As a result of the cyberattack, multiple class action lawsuits were filed against MGM Resorts as well as Caesars Entertainment, which Scattered Spider had hacked into during the same month, with all stating that the failure for both of the casino operators to adequately secure their data constituted breach of contract.\n\nEscape Solar + Storage\nIn September 2024, the company contracted with Escape Solar for the  Escape Solar + Storage project, to be operated by Estuary Power. The $340 million solar facility will help power Las Vegas Strip casinos, with more than 60% of its battery energy storage planned for MGM Resorts International casinos.\n\nMGM Osaka\nIn April 2025, MGM Resorts broke ground on MGM Osaka, which will be the first integrated resort and casino in Japan. It is set to open in 2030.\n\nNGCB fine\nNevada Gaming Control Board (NGCB) unanimously voted, on April 24, 2025, to levy a fine of $8.5 million on the company for having allowed two illegal bookmakers to gamble at MGM Grand and The Cosmopolitan. The investigation implicated former MGM Grand president Scott Sibella, as facilitating the fraud, between 2017 and 2020. Sibella's gambling license was revoked by the Nevada Gaming Commission on December 19, 2024.\n\nMGM Hospitality\nIn 2007, MGM Hospitality was established to operate hotels, resorts and residences in key destinations around the globe using the brands of Bellagio, MGM Grand and Skylofts.\nIn 2009, the company formed Diaoyutai MGM Hospitality, a joint venture with Diaoyutai State Guesthouse of China (the Chinese Foreign Ministry's venue for VIPs) which develops and operates 5-star hotels and resorts in China.\nIn April 2013, Hakkasan Las Vegas at the MGM Grand opened its 80,000-square-foot venue on five levels. In 2014, MGM and Hakkasan Group announced the formation of a joint venture named MGM Hakkasan Hospitality, which would develop non-gambling hotels around the world. The partnership was terminated a year later.\n\nBetMGM\nFollowing the U.S. Supreme Court's May 2018 ruling that struck down the PASPA sports betting ban, in July 2018, MGM announced a 50/50 joint venture with UK gambling operator GVC Holdings (now known as Entain) to create a sports betting and online gambling platform targeting the U.S. market in states where such activities are legal. In January 2019, the joint venture was named Roar Digital.\nIn September 2019, the company announced a partnership with sports bar chain restaurant Buffalo Wild Wings. The partnership will involve Buffalo Wild Wings sports bars across the country showcasing custom sportsbook content on TV screens inside the bars, featuring live odds provided by BetMGM, as well as the establishment of three new Buffalo Wild Wings sports bars within MGM properties or in partnership with BetMGM as additional states come online. At the end of October 2019, the company established a betting partnership with Yahoo Sports to connect its sports betting online platform to the popular sports website.\nIn late 2018, BetMGM signed official partnerships with several North American professional sports leagues, including the National Basketball Association, the National Hockey League, and Major League Baseball. In July 2020, BetMGM announced a partnership with the Denver Broncos of the National Football League. BetMGM would follow this deal with multiple betting partnerships with other NFL teams, including the Detroit Lions, Las Vegas Raiders, Tennessee Titans, and Pittsburgh Steelers. In late 2020 through early 2021, BetMGM continued to develop its partnership library with other teams in other leagues, including the Detroit Red Wings of the NHL, Washington Nationals of MLB, and Philadelphia 76ers of the NBA, as well as with other business ventures like TopGolf to extend the company's brand image to new bettors in operating markets. In May 2021, BetMGM signed a deal with the Baltimore Ravens to become the official gaming partner of the NFL team.\nIn November 2021, BetMGM, along with 8 other sports gambling operators, were awarded sports betting licenses by the New York State Gaming Commission. New York will be the largest sports gambling market in the United States when operators launch their applications in 2022. Additionally, on the same day, BetMGM agreed to a multi-year marketing partnership with Madison Square Garden Sports and will become an official sports gambling sponsor for both the New York Knicks of the NBA and New York Rangers of the NHL.\nIn 2021, BetMGM became a sponsor for the NASCAR Cup Series team Richard Childress Racing, serving as the main sponsor for the No.8 car of Kyle Busch for select races. In 2024, BetMGM and RCR announced that they had renewed their agreement. Also in 2024, BetMGM became the title sponsor of the NASCAR Xfinity Series spring race at Charlotte Motor Speedway.\nIn September 2022, BetMGM entered into a naming rights agreement with NJ Transit to becoming the naming sponsor of the Meadowlands Rail Line for $3 million over the next 3 years. The rail line is a special event shuttle train that offers rail service to and from MetLife Stadium only during New York Giants and New York Jets home football games, as well as major concerts and other sporting events.\nIn January 2024, it was announced that BetMGM would become the new title sponsor of the PDC Premier League Darts for the 2024 season.\nIn January 2024, BetMGM became a partner for X (formerly Twitter), this partnership would bring gambling features to the platform.\nIn July 2024, BetMGM announced they were partnering with English Premier League football club Tottenham Hotspur to become the sponsor for their training kit starting with the 2024-25 season.\n\nMGM Resorts International properties\nAll U.S. properties (excluding golf courses and where otherwise indicated) are fully owned by Vici Properties and operated by MGM through a long-term triple net lease agreement.\n\nLas Vegas Strip\nBellagio (leased from The Blackstone Group)\nThe Cosmopolitan of Las Vegas (leased from Blackstone, Cherng Family Trust, and Stonepeak Partners)\nAria Campus (formerly CityCenter) (leased from Blackstone)\nAria Resort & Casino\nVdara\nPark MGM\nNoMad Las Vegas\nNew York-New York\nT-Mobile Arena (42.5% ownership of building; land is leased from Vici)\nMGM Grand Las Vegas\nMGM Grand Garden Arena\nSkylofts at MGM Grand\nThe Mansion at MGM Grand\nThe Signature at MGM Grand\nExcalibur\nLuxor\nMandalay Bay\nW Las Vegas\nMandalay Bay Convention Center\nMichelob Ultra Arena\n\nOther properties in the U.S.\nBeau Rivage – Biloxi, Mississippi\nBorgata – Atlantic City, New Jersey\nMGM Grand Detroit – Detroit, Michigan (98% ownership stake)\nMGM National Harbor – National Harbor, Maryland\nMGM Northfield Park – Northfield, Ohio\nMGM Springfield – Springfield, Massachusetts\nYonkers Raceway & Empire City Casino – Yonkers, New York\nFallen Oak Golf Course – Saucier, Mississippi\nShadow Creek Golf Course – Las Vegas, Nevada\n\nChina\nDiaoyutai MGM Hospitality – China (joint venture with Diaoyutai State Guesthouse)\nBellagio Shanghai – Shanghai\nMGM Grand Sanya – Sanya\nMGM Qingdao – Qingdao\nDiaoyutai Hotel Qingdao – Qingdao\nMhub by MGM Nanjing Jiangning – Nanjing\nMGM Shanghai West Bund – Shanghai\nMGM Shenzhen – Shenzhen\nMGM Reserve Zhuhai – Zhuhai\nMGM China  – Macau, China (56% ownership stake)\nMGM Cotai – Cotai\nMGM Macau – Sé\n\nJapan\nTokyo\nMGM Osaka\n\nUnited Arab Emirates\nMGM Dubai\nAria Dubai\nBellagio Dubai\n\nFormer properties\nBoardwalk Hotel and Casino – Las Vegas, Nevada\nCircus Circus Las Vegas\nAdventuredome\nSlots-A-Fun Casino\nCircus Circus, Reno, Nevada\nColorado Belle, Laughlin, Nevada\nDesert Inn\nEdgewater, Laughlin, Nevada\nGold Strike Tunica – Tunica Resorts, Mississippi\nGold Strike Hotel and Gambling Hall, Jean, Nevada\nGolden Nugget Las Vegas\nGolden Nugget Laughlin\nGrand Victoria Casino Elgin – Elgin, Illinois (50% joint venture with Hyatt)\nMandarin Oriental, Las Vegas\nMGM Grand Adventures Theme Park\nMGM Grand Air\nMGM Grand Darwin – Darwin, Northern Territory, Australia\nMGM Grand at Foxwoods\nMGM Grand Ho Tram Strip – Xuyen Moc, Vietnam\nThe Mirage\nNevada Landing Hotel and Casino – Jean, Nevada\nPrimm Valley Golf Club – Nipton, California\nPrimm Valley Resorts\nRailroad Pass, Henderson, Nevada\nSands Hotel and Casino\nSilver Legacy, Reno, Nevada (50% owner in partnership with Eldorado Resorts)\nThe Shops at Crystals\nTreasure Island Hotel and Casino – Las Vegas, Nevada\nLas Vegas Festival Grounds\nLas Vegas Village\n\nMGM International Aviation\nThe MGM Resorts International Aviation fleet comprises five aircraft (as of March 2020):\n\nStaff and management\nThe company's top executives include: James Murren, chairman and chief executive officer; Bill Hornbuckle, president of global casino marketing; Brian Sandoval, president of global gambling development; Corey I. Sanders, chief operating officer; and John McManus, executive vice president, general counsel and secretary.\nAs of 2015, according to the company, among the company's management ranks, more than 38 percent are minorities and nearly 43 percent are women. The company has received wide recognition for its diversity and inclusion initiatives, such as: 40 Best Companies for Diversity (Black Enterprise Magazine), Top 10 Companies for Latinos (DiversityInc Magazine), Best Places to Work for LGBT Equality (Human Rights Campaign Foundation), Top 10 Regional Companies(DiversityInc) and Top Corporation for Women's Business Enterprises (Women's Business Enterprise National Council). Fortune magazine named MGM Resorts one of the World's Most Admired Companies in 2017.\n\nControversy\nMGM Resorts International received criticism for filing a lawsuit on July 18, 2018, against survivors and relatives of victims slain in the October 1, 2017 Las Vegas shooting. MGM has claimed that, because it utilized the security services of Contemporary Services Corporation, a vendor certified by the Department of Homeland Security at the time of the October 1 shooting, any proceedings should be held in federal court where MGM is shielded from liability by the Support Anti-Terrorism by Fostering Effective Technologies Act, also known as the Safety Act. MGM said they are insured for $751 million towards the settlement of the lawsuit which MGM believes will be settled in May 2020. Robert Englet, an attorney to some of the survivors, describes the countersuit as an attempt to get a more favorable judge. Brian Claypool, another attorney of the survivors', called the lawsuits a \"public relations nightmare\". MGM's controversial action prompted a public outcry from survivors of the shooting, family members of the victims, lawmakers, and media members in New York State urging the New York State Gaming Commission to block MGM from completing its $850 million deal to purchase Empire City Casino and Yonkers Raceway in Yonkers, New York, which deal had been scheduled to close in January 2019. In October 2019, MGM agreed to pay victims and survivors up to $800 million.\n\nAwards and recognition\nThe company continues to receive wide recognition for its diversity and inclusion initiatives, such as: 40 Best Companies for Diversity (Black Enterprise Magazine) in 2012, Best Places to Work for LGBT Equality (Human Rights Campaign Foundation) in 2013, Top 10 Regional Companies (DiversityInc) in 2014, Top 10 Companies for Latinos (DiversityInc Magazine),  and top 100 Companies for MBA Students (Universum Global) in 2014. Fortune has named MGM Resorts one of the World's Most Admired Companies.\n\nSee also\nList of integrated resorts\nList of casino hotels\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for MGM Resorts International:",
  "clean_text": "MGM Resorts International is an American multinational hospitality, sports and entertainment company. It operates resorts in Las Vegas, Massachusetts, Michigan, Mississippi, Maryland, Ohio, New Jersey, Macau, Shanghai, Chengdu, Hangzhou and Sanya, including the Bellagio, Mandalay Bay, MGM Grand and Park MGM. The company began operations in 1987 as MGM Grand, Inc. and became MGM Mirage in 2000, after acquiring Mirage Resorts. In the mid-2000s, growth of its non-gambling (lodging, food, retail) revenue began to outpace gambling receipts and demand for high-rise condominiums was surging, with median property prices in Las Vegas twice the national average. The company shifted its focus from owning and operating resorts and casinos to developing and building real estate in the leisure and gambling industry—launching the massive CityCenter mixed-use project, which was at the time of its construction the world's largest construction site and ranks as one of the most expensive real estate projects in history. City Center's development coincided with the 2008 financial crisis, causing more than $1 billion in write-offs in its valuation. Billionaire investor Kirk Kerkorian and his Tracinda Corporation were, until 2009, the majority shareholders of MGM Mirage; Kerkorian was the former owner of the Metro-Goldwyn-Mayer (MGM) movie studio, from which MGM Grand derived its name. Following a $1 billion stock offering by MGM Mirage amidst the global credit crunch, Tracinda's shares were diluted from 53.8% to 39%. On June 15, 2010, shareholders voted for MGM Mirage to change its name to \"MGM Resorts International\". In 2015, the company split into two forming MGM Growth Properties, a real estate company, while MGM Resorts shifted to operating properties. Today, MGM Resorts is the largest casino company in the world by revenue, making $13.13 billion USD in revenue in 2022. History Background and early ventures (1969–1988) The company's background can be traced to 1969, when airline and casino tycoon Kirk Kerkorian bought a controlling stake in the Metro-Goldwyn-Mayer (MGM) film studio. In 1970 and 1971, Kerkorian struggled with debt from his acquisitions of MGM and Western Airlines, and was forced to sell a majority of his casino company, International Leisure, to Hilton Hotels at a steep discount. When the Las Vegas Hilton, the casino he had built, subsequently became the most successful hotel in Las Vegas, Kerkorian was inspired to lead the studio into the gambling industry. It opened the original MGM Grand Hotel and Casino (now Horseshoe Las Vegas) in 1973. The MGM Grand Reno followed in 1978. By 1979, the two hotel-casinos accounted for most of MGM's income, and the company announced a plan to split itself in two. The next year, the film studio was spun off as a new company, while the original company, renamed as MGM Grand Hotels Inc., retained the two hotel-casinos. Kerkorian held a 47 percent stake in both companies. In 1985, Kerkorian began seeking a buyer for MGM Grand Hotels, to allow him to concentrate on running United Artists and on developing new properties under the MGM Grand name. A deal was reached for Bally Manufacturing to buy the company; the deal closed in April 1986, and the two casinos were renamed under the Bally's brand. The terms of the sale allowed Kerkorian to retain rights to the MGM Grand name, and plans were announced to offer the stockholders of MGM Grand Hotels shares in a new company that would hold the naming rights. The company now known as MGM Resorts International was formed in 1986 as Grand Name Co. as a subsidiary of Kerkorian's Tracinda Corporation. It was renamed in 1987 as MGM Grand, Inc. The company's first venture was MGM Grand Air, a luxury airline offering service between New York and Los Angeles, which launched in September 1987. The company also made an offer to take over financially struggling Pan American World Airways, but this offer was rejected by Pan Am's board in November 1987. In August 1987, MGM Grand bid $152 million for the bankrupt Dunes Hotel in Las Vegas, but was beat out by Japanese billionaire Masao Nangaku. Instead, the company acquired the Desert Inn and Sands casinos in February 1988 from Summa Corporation for $167 million. The Sands was sold to Sheldon Adelson's Interface Group for $110 million in April 1989. First casino developments (1989–1999) In September 1989, the company announced plans for a $700-million Hollywood-themed complex, including a 4,000-room hotel and a theme park. The Desert Inn site was initially considered as a location for the project, but within weeks the location was finalized as the Marina Hotel and Casino and the Tropicana Country Club, which MGM Grand acquired for $93 million plus $30 million in stock. The company put the Desert Inn up for sale to focus efforts on the new project, but found no outside bidders, and agreed to sell it to Tracinda for $130 million. Construction on the MGM Grand Las Vegas and the MGM Grand Adventures theme park began in October 1991, and the property opened in December 1993 at a final cost of $1 billion. The park permanently closed in 2002 due to a lack of interest. The company moved its headquarters from Beverly Hills to Las Vegas in July 1992. During construction of the MGM Grand, the company acquired an option to buy an 18-acre site across the street from the project. Gary Primm of Primadonna Resorts approached MGM president Bob Maxey in 1994 with an idea for the site: a casino recreating the New York skyline. A joint venture was formed between the two companies, and construction began in March 1995. Completed at a cost of $460 million, the New York-New York Hotel and Casino opened in January 1997. With New York-New York under development, MGM Grand made moves to expand in several other markets. An exploratory agreement to develop two casinos on the Chinese island of Hainan was announced in August 1994, but came to nothing. In Darwin, Australia, a lucrative market attracting high rollers from Pacific Rim countries, the company considered building a hotel, but instead bought the Diamond Beach Hotel and Casino, renaming it as the MGM Grand Darwin. MGM announced plans for an Atlantic City casino in July 1996. In Michigan, where voters approved casinos in November 1996, MGM made plans for a bid on one of the three available gambling licenses, which would eventually be approved and open in July 1999 as the MGM Grand Detroit. In South Africa, with casino gambling newly authorized, MGM announced plans in August 1996 to develop 15 properties in conjunction with Tsogo Sun. The first, a temporary casino in Johannesburg's Sundome, opened in October 1998. Three more casinos followed before MGM agreed to sell out its interest in the properties to Tsogo Sun in November 2001. Since the initiation of New York-New York, analysts had speculated that MGM Grand or Primadonna would buy out the other's interest in the project. Instead of making such a cash-intensive purchase, however, MGM agreed to buy Primadonna outright for $276 million in stock plus $336 million in assumed debt. The merger closed in March 1999, giving MGM ownership of three casinos and two golf courses at the Nevada–California state line, in addition to full control of New York-New York. Mirage Resorts merger (2000) In February 2000, MGM Grand made an unsolicited offer of $17 a share to buy Mirage Resorts, which had floundered due to disappointing results at its new Beau Rivage and Bellagio resorts. Analysts expected a protracted battle, with Mirage founder Steve Wynn seen as unwilling to give up control but under pressure from institutional investors. Mirage rejected the offer, but Wynn met with Kerkorian the next day and named a price of $21 a share. The companies agreed on the higher price, for a total of $4.4 billion plus $2 billion in assumed debt. The merger closed in May 2000, giving MGM ownership of the Mirage, Treasure Island, Bellagio, Boardwalk, and Golden Nugget casinos in Las Vegas, the Golden Nugget in Laughlin, and the Beau Rivage in Mississippi, and a half share of the Monte Carlo. The company changed its name to MGM Mirage in August 2000. Mirage had also owned a half stake in the Borgata, a planned casino in Atlantic City, in a joint venture managed by Boyd Gaming. Work on the Borgata continued apace, and it would open in July 2003. Stalled developments (2001–2004) In 2001 and 2002, following the merger with Mirage, the company explored options for its next major development project, including in the Las Vegas, Atlantic City, Chicago, and Macau markets. The 55-acre site of the Boardwalk casino on the Las Vegas Strip was earmarked for a technologically advanced megaresort targeting a Generation X demographic. In Atlantic City, MGM shifted focus from its previously announced boardwalk site to a proposed billion-dollar hotel and casino on a 55-acre tract adjacent to the Borgata, where Wynn had planned to build the Le Jardin casino. In the Chicago market, MGM agreed to pay $600 million to buy the unfinished Emerald Casino in Rosemont, Illinois, whose investors had been accused of ties to organized crime. The deal was rejected, however, by state gambling regulators, and MGM then backed off its effort, saying that Illinois's casino tax was too high. In Macau, where Stanley Ho's 40-year government-granted monopoly on gambling was coming to an end, MGM submitted a bid for one of three available gambling concessions, but it was not selected, losing out to Ho, Las Vegas Sands, and Wynn Resorts. MGM made moves into the United Kingdom market after a 2001 government report called for loosening of the country's gambling regulations. It opened an online casino, playmgmmirage.com, licensed in the Isle of Man, a British dependency, and it applied for a license to run an online sports betting site in the U.K. It acquired a twenty-five percent stake in a company developing the small Triangle Casino in Bristol, which went on to open its doors in February 2004. It inked deals to build casinos at the Olympia Exhibition Centre in London, St James' Park in Newcastle, Meadowhall Shopping Centre in Sheffield, the National Exhibition Centre in Birmingham, Sportcity in Manchester, Glasgow Harbour, King's Waterfront in Liverpool, and at a proposed stadium in Salford. The company also signed a $490-million deal to acquire Wembley plc, owner of seven greyhound tracks in Britain and four in the United States. The British expansion plans ultimately amounted to nothing. MGM closed its online casino after less than two years, citing uncertainty in American regulations and competition from established British brands. The Wembley acquisition turned into a bidding war, with MGM finally losing out to an investors group including Kerzner International. The Triangle Casino was sold off to Stanley Leisure in 2006. The company's other development plans were scuttled as the government scaled down, and eventually abandoned, the plan to allow large \"super-casinos\". In 2004, the company disposed of some of its smaller properties, selling the two Golden Nugget casinos (Golden Nugget Las Vegas and Golden Nugget Laughlin) to Poster Financial Group for $215 million, and the MGM Grand Darwin to Skycity Entertainment for $140 million. Mandalay merger (2004–2005) MGM entered into quiet merger talks with Mandalay Resort Group in early 2004. The potential acquisition would give MGM control of more than half the hotel rooms on the Las Vegas Strip. Mandalay assets attractive to MGM included low-end casinos like Excalibur and Circus Circus to broaden MGM's \"high roller\" appeal; the Mandalay Bay Convention Center, which would allow MGM to compete directly with the Sands Expo center in the convention market; and at least two prime developable sites on the Strip. The talks went public in June, when MGM announced an offer worth $7.65 billion. Mandalay rejected that offer because of a clause allowing MGM to back out if antitrust regulators demanded the sale of any properties. Analysts speculated that another bidder such as Harrah's or Boyd might enter, but none did, and MGM and Mandalay soon agreed on a $7.9 billion deal. MGM executives were confident that antitrust regulators would not require the sale of any of the two companies' properties. Michigan law, however, forbade one company from owning multiple casinos, requiring the sale of either the MGM Grand Detroit or Mandalay's 54 percent stake in the MotorCity Casino. After some vacillation about which property to sell, Mandalay accepted a $525-million offer for its interest in MotorCity from Marian Ilitch, the casino's second largest shareholder. Meanwhile, in Illinois, where MGM needed regulatory approval to take over Mandalay's 50 percent interest in the Grand Victoria Casino, a lack of quorum on the state Gaming Board threatened to delay the merger. MGM considered a sale to the casino's other owner, the Pritzker family, but ultimately gained approval for a plan to place the property under control of a trustee until completion of the licensing process. The FTC approved the merger as predicted, and MGM obtained a $7 billion line of credit to finance it. The sale closed on April 25, 2005 for a total of $7.9 billion, including $3 billion in assumed debt. The Mandalay acquisition made MGM Mirage the largest gambling company in the world, but it was surpassed just two months later when Harrah's Entertainment acquired Caesars Entertainment in a deal that had been spurred on by news of the MGM-Mandalay merger. Later developments (2004–2006) Despite MGM's initial failure to win a gambling concession in Macau, the company had remained interested in the burgeoning gambling market. Rumors of a possible partnership with Stanley Ho were reported in 2003, but Nevada gambling regulators informally vetoed the idea because of the alleged involvement of organized crime triads in his casinos. Another possibility emerged when the government allowed the three gaming concessionaires to each sell a sub-concession. In June 2004, MGM formed a joint venture with Pansy Ho, Stanley's daughter, to develop a casino-hotel under a sub-concession from Stanley. Despite initial concerns about whether Pansy Ho was subject to her father's influence, the Nevada Gaming Commission eventually approved the partnership. Construction of the MGM Grand Macau began in June 2005. The property opened in December 2007, completed at a cost of $1.25 billion. In 2004, MGM solidified its plans for the Boardwalk site on the Strip, announcing Project CityCenter, an $8-billion high-density project including hotels, condominiums, a casino, and a shopping mall. The Boardwalk was closed in January 2006 to make way for the redevelopment, and CityCenter construction began the following June. Singapore emerged in 2004 as the next major new Asian gambling market, calling for proposals to build two \"integrated resort\" casinos at Marina Bay and the island of Sentosa. MGM partnered with CapitaLand in an estimated $3 billion bid for the Marina Bay site. Their bid advanced to the final stage against three competitors, and was seen as the favorite to win. The government awarded the license, however, to Las Vegas Sands, citing its strength in the meetings and conventions sector. In 2007, MGM Mirage disposed of some outlying properties in Southern Nevada. The two Laughlin casinos (the Colorado Belle and Edgewater) were sold for $200 million, the Primm Valley Resorts were sold for $400 million, and the Nevada Landing Hotel and Casino was closed. Dubai World investment (2007–2009) On April 19, 2007 the company announced that it planned to purchase a 7.6-acre (31,000 m2) site from Concord Wilshire Partners for $130 million and a 25.8-acre (104,000 m2) site from Gordon Gaming for $444 million. The two parcels give the company complete control of the southwest corner of the Sahara and Las Vegas Boulevard intersection. When combined with underused parts of the Circus Circus site, the company will have a 68-acre (280,000 m2) site for future development. The Concord site had been the proposed location for the Maxim Casino. On August 22, 2007, Dubai World said it would buy a 9.5 percent stake in MGM for about $2.4 billion. It would also invest about $2.7 billion to acquire a 50 percent stake in MGM's CityCenter project. Dubai World would pay MGM Mirage an additional $100 million if the project opened on time and on budget. The investment firm would buy 14.2 million shares from MGM Mirage. The firm would also issue a public tender for an additional 14.2 million shares at the same price. In October 2008, MGM Mirage halted a $5 billion Atlantic City project on land next to the Borgata. At about the same time, New Jersey gambling regulators were evaluating MGM Mirage's suitability to operate casinos in New Jersey, and were unconvinced that MGM Mirage's Macau partner, Pansy Ho, could operate independently from influence of her father, Stanley Ho. The latter was often accused of ties with Chinese organized crime and letting the gangs operate in his casinos' VIP rooms. Faced with not complying with New Jersey gambling regulations, MGM Mirage decided to divest the highly profitable Borgata in order to continue pursuing the even more lucrative Chinese market. MGM Mirage subsequently transferred its 50% share in the Borgata to a divestiture trust through which it received all benefit of the ownership. The trust was responsible for selling MGM's interest within 30 months, although MGM had the right to direct the trustee during the first 18 months. In December 2008, MGM Mirage announced the sale of its Las Vegas Treasure Island resort and casino to billionaire Phil Ruffin. The sale was completed on March 20, 2009 for $600 million in cash plus a $175 million promissory note. In March 2009, Dubai World and Infinity World announced that they had filed a lawsuit in the Delaware Chancery Court seeking to be released from their CityCenter joint venture agreement with MGM Mirage after the company filed its annual report stating that \"there is substantial doubt about our ability to continue as a going concern,\" and \"it cannot provide assurance that its business would generate sufficient cash flow from operation.\" Starting in April 2009, news reports surfaced that MGM Mirage had hired investment firm Morgan Stanley to assist the company in finding possible buyers for the MGM Grand Detroit and the Beau Rivage. Name change and recent years (2010–present) In June 2010, MGM Mirage changed its name to \"MGM Resorts International\", to emphasize the brand's global scope and increased non-gambling strategy. In May 2011, an initial public offering was held for the MGM Macau property through a new holding company, MGM China. MGM retained a 51 percent interest in the company, with Pansy Ho holding a 29 percent stake, and 20 percent sold to public investors for $1.5 billion. In January 2013, MGM China received government approval to build its second resort in Macau. In 2013, MGM won state licenses to build a $1-billion resort in National Harbor, Maryland and a $950-million resort in downtown Springfield, Massachusetts. In May 2014, the company broke ground on the $375-million T-Mobile Arena located behind New-New York Hotel and Casino, in partnership with AEG Live. The arena opened on April 6, 2016. MGM sold several properties in 2015, including the Railroad Pass Casino, the Gold Strike, and properties in Reno (Circus Circus Reno and a 50 percent stake in the Silver Legacy) were sold to Eldorado Resorts for $72.5 million. In April 2016, MGM sold The Shops at Crystals, the high-end mall in CityCenter, to Invesco Real Estate and Simon Property Group for $1.1 billion. In April 2016, MGM held an initial public offering for MGM Growth Properties (MGP), a new real estate investment trust (REIT) with ownership of ten of the company's casinos; the parent company would continue to operate the casinos under a lease agreement. The offering raised $1.05 billion, and left MGM Resorts with 76 percent ownership of the REIT. In June 2016, MGM announced a joint venture with Sydell Group to renovate and rebrand the Monte Carlo as the Park MGM, named after the adjacent dining and entertainment district, The Park, that opened in April 2016. In August 2016, MGM bought out Boyd Gaming's interest in the Borgata for $900 million, and then sold the property to MGP for $1.2 billion and leased it back for $100 million per year. In 2017, MGM launched two online ventures under the PlayMGM brand: an online sportsbook in Nevada, and an online casino in New Jersey. In October 2017, MGM purchased the San Antonio Stars of the Women's National Basketball Association. The team was moved to Mandalay Bay Events Center and began play as the Las Vegas Aces in 2018. In August 2018, MGM and Hyatt sold the Grand Victoria Casino to Eldorado Resorts for $328 million. In January 2019, MGM bought Yonkers Raceway and Empire City Casino in New York from the Rooney family for $850 million, and then immediately sold the land and buildings to MGP for $625 million, and leased them back for $50 million per year. MGM Resorts is bidding to secure a full casino license for their Empire City Casino which would allow for table games. If awarded a casino license, they will also expand the casino and add new amenities. The community advisory committee voted 5-0 in favor of the proposed development on September 25, 2025. This vote advances MGM’s bid to be considered for a full casino license in New York. In 2019, MGM sold two resorts on the Las Vegas strip: Bellagio and Circus Circus. They sold their real estate assets of Bellagio to Blackstone Group while selling Circus Circus to Phil Ruffin. In 2020, they sold their real estate assets of MGM Grand and Mandalay Bay to a joint venture between Blackstone and MGP. In 2021, MGM bought 50% of Dubai World's share of CityCenter and sold the real estate assets of Aria and Vdara to Blackstone and later purchased the operating assets of Cosmopolitan of Las Vegas and later sold the Mirage to Hard Rock International. Also in 2021, MGM would sell the Las Vegas Aces to Mark Davis, owner of the Las Vegas Raiders. MGM is looking to secure a casino license in the United Arab Emirates in order to operate a casino at their upcoming property in Dubai which is set to open in 2028. So far, only Wynn Resorts has secured a gambling license in the country. Response to the COVID-19 pandemic In August 2020, MGM cut 18,000 job positions as a result of the effects of the COVID-19 pandemic. The job cuts represent one fourth of its workforce, which before the start of the pandemic was 68,000. Attempts to block tribal casino developments MGM lobbied the Trump administration against giving federal approval for a casino operated by two native tribes in East Windsor, Connecticut. The casino would have provided competition to a MGM casino across the border in Massachusetts. Marriott partnership In July 2023, MGM Resorts announced an agreement with Marriott International to bring its 17 properties within Marriott's global reservations system and its Bonvoy loyalty program, creating the MGM Collection With Marriott Bonvoy. The new partnership will see four of MGM's properties fully affiliated with Marriott brands beginning in late 2023. The Bellagio will join The Luxury Collection division of Marriott, the Park MGM will join Marriott's Tribute Portfolio, and the Aria will join Marriott's Autograph Collection, which The Cosmopolitan has been a member of since its opening. Cybersecurity attack In September 2023, MGM's hotel and casino operations were disrupted for several days during a cybersecurity attack by the hacking group Scattered Spider. The company refused to pay a ransom to the hackers, and stated that its losses of $100 million would be covered by cyber insurance. As a result of the cyberattack, multiple class action lawsuits were filed against MGM Resorts as well as Caesars Entertainment, which Scattered Spider had hacked into during the same month, with all stating that the failure for both of the casino operators to adequately secure their data constituted breach of contract. Escape Solar + Storage In September 2024, the company contracted with Escape Solar for the Escape Solar + Storage project, to be operated by Estuary Power. The $340 million solar facility will help power Las Vegas Strip casinos, with more than 60% of its battery energy storage planned for MGM Resorts International casinos. MGM Osaka In April 2025, MGM Resorts broke ground on MGM Osaka, which will be the first integrated resort and casino in Japan. It is set to open in 2030. NGCB fine Nevada Gaming Control Board (NGCB) unanimously voted, on April 24, 2025, to levy a fine of $8.5 million on the company for having allowed two illegal bookmakers to gamble at MGM Grand and The Cosmopolitan. The investigation implicated former MGM Grand president Scott Sibella, as facilitating the fraud, between 2017 and 2020. Sibella's gambling license was revoked by the Nevada Gaming Commission on December 19, 2024. MGM Hospitality In 2007, MGM Hospitality was established to operate hotels, resorts and residences in key destinations around the globe using the brands of Bellagio, MGM Grand and Skylofts. In 2009, the company formed Diaoyutai MGM Hospitality, a joint venture with Diaoyutai State Guesthouse of China (the Chinese Foreign Ministry's venue for VIPs) which develops and operates 5-star hotels and resorts in China. In April 2013, Hakkasan Las Vegas at the MGM Grand opened its 80,000-square-foot venue on five levels. In 2014, MGM and Hakkasan Group announced the formation of a joint venture named MGM Hakkasan Hospitality, which would develop non-gambling hotels around the world. The partnership was terminated a year later. BetMGM Following the U.S. Supreme Court's May 2018 ruling that struck down the PASPA sports betting ban, in July 2018, MGM announced a 50/50 joint venture with UK gambling operator GVC Holdings (now known as Entain) to create a sports betting and online gambling platform targeting the U.S. market in states where such activities are legal. In January 2019, the joint venture was named Roar Digital. In September 2019, the company announced a partnership with sports bar chain restaurant Buffalo Wild Wings. The partnership will involve Buffalo Wild Wings sports bars across the country showcasing custom sportsbook content on TV screens inside the bars, featuring live odds provided by BetMGM, as well as the establishment of three new Buffalo Wild Wings sports bars within MGM properties or in partnership with BetMGM as additional states come online. At the end of October 2019, the company established a betting partnership with Yahoo Sports to connect its sports betting online platform to the popular sports website. In late 2018, BetMGM signed official partnerships with several North American professional sports leagues, including the National Basketball Association, the National Hockey League, and Major League Baseball. In July 2020, BetMGM announced a partnership with the Denver Broncos of the National Football League. BetMGM would follow this deal with multiple betting partnerships with other NFL teams, including the Detroit Lions, Las Vegas Raiders, Tennessee Titans, and Pittsburgh Steelers. In late 2020 through early 2021, BetMGM continued to develop its partnership library with other teams in other leagues, including the Detroit Red Wings of the NHL, Washington Nationals of MLB, and Philadelphia 76ers of the NBA, as well as with other business ventures like TopGolf to extend the company's brand image to new bettors in operating markets. In May 2021, BetMGM signed a deal with the Baltimore Ravens to become the official gaming partner of the NFL team. In November 2021, BetMGM, along with 8 other sports gambling operators, were awarded sports betting licenses by the New York State Gaming Commission. New York will be the largest sports gambling market in the United States when operators launch their applications in 2022. Additionally, on the same day, BetMGM agreed to a multi-year marketing partnership with Madison Square Garden Sports and will become an official sports gambling sponsor for both the New York Knicks of the NBA and New York Rangers of the NHL. In 2021, BetMGM became a sponsor for the NASCAR Cup Series team Richard Childress Racing, serving as the main sponsor for the No.8 car of Kyle Busch for select races. In 2024, BetMGM and RCR announced that they had renewed their agreement. Also in 2024, BetMGM became the title sponsor of the NASCAR Xfinity Series spring race at Charlotte Motor Speedway. In September 2022, BetMGM entered into a naming rights agreement with NJ Transit to becoming the naming sponsor of the Meadowlands Rail Line for $3 million over the next 3 years. The rail line is a special event shuttle train that offers rail service to and from MetLife Stadium only during New York Giants and New York Jets home football games, as well as major concerts and other sporting events. In January 2024, it was announced that BetMGM would become the new title sponsor of the PDC Premier League Darts for the 2024 season. In January 2024, BetMGM became a partner for X (formerly Twitter), this partnership would bring gambling features to the platform. In July 2024, BetMGM announced they were partnering with English Premier League football club Tottenham Hotspur to become the sponsor for their training kit starting with the 2024-25 season. MGM Resorts International properties All U.S. properties (excluding golf courses and where otherwise indicated) are fully owned by Vici Properties and operated by MGM through a long-term triple net lease agreement. Las Vegas Strip Bellagio (leased from The Blackstone Group) The Cosmopolitan of Las Vegas (leased from Blackstone, Cherng Family Trust, and Stonepeak Partners) Aria Campus (formerly CityCenter) (leased from Blackstone) Aria Resort & Casino Vdara Park MGM NoMad Las Vegas New York-New York T-Mobile Arena (42.5% ownership of building; land is leased from Vici) MGM Grand Las Vegas MGM Grand Garden Arena Skylofts at MGM Grand The Mansion at MGM Grand The Signature at MGM Grand Excalibur Luxor Mandalay Bay W Las Vegas Mandalay Bay Convention Center Michelob Ultra Arena Other properties in the U.S. Beau Rivage – Biloxi, Mississippi Borgata – Atlantic City, New Jersey MGM Grand Detroit – Detroit, Michigan (98% ownership stake) MGM National Harbor – National Harbor, Maryland MGM Northfield Park – Northfield, Ohio MGM Springfield – Springfield, Massachusetts Yonkers Raceway & Empire City Casino – Yonkers, New York Fallen Oak Golf Course – Saucier, Mississippi Shadow Creek Golf Course – Las Vegas, Nevada China Diaoyutai MGM Hospitality – China (joint venture with Diaoyutai State Guesthouse) Bellagio Shanghai – Shanghai MGM Grand Sanya – Sanya MGM Qingdao – Qingdao Diaoyutai Hotel Qingdao – Qingdao Mhub by MGM Nanjing Jiangning – Nanjing MGM Shanghai West Bund – Shanghai MGM Shenzhen – Shenzhen MGM Reserve Zhuhai – Zhuhai MGM China – Macau, China (56% ownership stake) MGM Cotai – Cotai MGM Macau – Sé Japan Tokyo MGM Osaka United Arab Emirates MGM Dubai Aria Dubai Bellagio Dubai Former properties Boardwalk Hotel and Casino – Las Vegas, Nevada Circus Circus Las Vegas Adventuredome Slots-A-Fun Casino Circus Circus, Reno, Nevada Colorado Belle, Laughlin, Nevada Desert Inn Edgewater, Laughlin, Nevada Gold Strike Tunica – Tunica Resorts, Mississippi Gold Strike Hotel and Gambling Hall, Jean, Nevada Golden Nugget Las Vegas Golden Nugget Laughlin Grand Victoria Casino Elgin – Elgin, Illinois (50% joint venture with Hyatt) Mandarin Oriental, Las Vegas MGM Grand Adventures Theme Park MGM Grand Air MGM Grand Darwin – Darwin, Northern Territory, Australia MGM Grand at Foxwoods MGM Grand Ho Tram Strip – Xuyen Moc, Vietnam The Mirage Nevada Landing Hotel and Casino – Jean, Nevada Primm Valley Golf Club – Nipton, California Primm Valley Resorts Railroad Pass, Henderson, Nevada Sands Hotel and Casino Silver Legacy, Reno, Nevada (50% owner in partnership with Eldorado Resorts) The Shops at Crystals Treasure Island Hotel and Casino – Las Vegas, Nevada Las Vegas Festival Grounds Las Vegas Village MGM International Aviation The MGM Resorts International Aviation fleet comprises five aircraft (as of March 2020): Staff and management The company's top executives include: James Murren, chairman and chief executive officer; Bill Hornbuckle, president of global casino marketing; Brian Sandoval, president of global gambling development; Corey I. Sanders, chief operating officer; and John McManus, executive vice president, general counsel and secretary. As of 2015, according to the company, among the company's management ranks, more than 38 percent are minorities and nearly 43 percent are women. The company has received wide recognition for its diversity and inclusion initiatives, such as: 40 Best Companies for Diversity (Black Enterprise Magazine), Top 10 Companies for Latinos (DiversityInc Magazine), Best Places to Work for LGBT Equality (Human Rights Campaign Foundation), Top 10 Regional Companies(DiversityInc) and Top Corporation for Women's Business Enterprises (Women's Business Enterprise National Council). Fortune magazine named MGM Resorts one of the World's Most Admired Companies in 2017. Controversy MGM Resorts International received criticism for filing a lawsuit on July 18, 2018, against survivors and relatives of victims slain in the October 1, 2017 Las Vegas shooting. MGM has claimed that, because it utilized the security services of Contemporary Services Corporation, a vendor certified by the Department of Homeland Security at the time of the October 1 shooting, any proceedings should be held in federal court where MGM is shielded from liability by the Support Anti-Terrorism by Fostering Effective Technologies Act, also known as the Safety Act. MGM said they are insured for $751 million towards the settlement of the lawsuit which MGM believes will be settled in May 2020. Robert Englet, an attorney to some of the survivors, describes the countersuit as an attempt to get a more favorable judge. Brian Claypool, another attorney of the survivors', called the lawsuits a \"public relations nightmare\". MGM's controversial action prompted a public outcry from survivors of the shooting, family members of the victims, lawmakers, and media members in New York State urging the New York State Gaming Commission to block MGM from completing its $850 million deal to purchase Empire City Casino and Yonkers Raceway in Yonkers, New York, which deal had been scheduled to close in January 2019. In October 2019, MGM agreed to pay victims and survivors up to $800 million. Awards and recognition The company continues to receive wide recognition for its diversity and inclusion initiatives, such as: 40 Best Companies for Diversity (Black Enterprise Magazine) in 2012, Best Places to Work for LGBT Equality (Human Rights Campaign Foundation) in 2013, Top 10 Regional Companies (DiversityInc) in 2014, Top 10 Companies for Latinos (DiversityInc Magazine), and top 100 Companies for MBA Students (Universum Global) in 2014. Fortune has named MGM Resorts one of the World's Most Admired Companies."
}