{
  "ticker": "MHK",
  "cik": "0000851968",
  "company_name": "Mohawk Industries",
  "corrected_name": "Mohawk Industries",
  "wiki_title_used": "Mohawk Industries",
  "exists": true,
  "raw_text": "Mohawk Industries is an American flooring manufacturer based in Calhoun, Georgia. Mohawk produces floor covering products for residential and commercial applications in North America and residential applications in Europe. The company manufacturing portfolio consists of soft flooring products (broadloom carpet, carpet tiles, carpet cushion and rugs), hard flooring products (ceramic and porcelain tile, natural stone and hardwood flooring), laminate flooring, sheet vinyl and luxury vinyl tile, natural stone and quartz countertops. In Europe, the company also produces and sells insulation, panels and mezzanine flooring. The company employs 43,000 people in operations in Australia, Brazil, Canada, Europe, Malaysia, Mexico, New Zealand, Russia and the United States. A Fortune 500 company, Mohawk is the world's largest flooring manufacturer.\n\nHistory\nWilliam Shuttleworth and his four sons arrived in the United States in 1875 and set up a carpet mill in the Hudson Valley upon arrival. After William Shuttleworth died, the four sons moved to Amsterdam, New York in 1878 and took over an empty factory there. The company incorporated as the Shuttleworth Brothers Company in 1902.\nThe company adopted the name Mohawk Carpet Mills (or Mohawk Mills, for short) in 1920, when it merged with McCleary, Wallin and Crouse, another mill in Amsterdam. It became the country's sole weaver to offer an entire line of domestic carpets, also creating the industry's first textured design and sculptured weave.\nIn 1956, Mohawk Carpet Mills merged with  Alexander Smith, Inc. to become Mohasco Corporation, a company large enough to appear on the first Fortune 500 rankings. Mohasco faced competition from new tufted carpet operations in Georgia, which used synthetic fibers such as nylon and polyester rather than the traditional wool used in woven carpets. To compete in a changing industry, Mohasco gradually moved manufacturing south into the Carolinas and eventually Georgia. In 1963, the company turned some of its attention to furniture manufacturing through acquisitions.\nCarpet manufacturing at the Amsterdam site ended by 1968 and the last corporate offices left by 1987. In 1988, Mohasco was purchased by MHS Holdings in a leveraged buyout, and the company's carpet business was spun off from Mohasco to form Mohawk Industries.\n\nIn 1992, Mohawk went public with its shares traded first on the NASDAQ Stock Exchange under the ticker symbol \"MWK\" and currently on the New York Stock Exchange under the ticker symbol \"MHK.\"\nMohasco's remaining assets were sold to other investors, and the company was later dissolved. Through 2016, Mohawk Industries has acquired 34 companies into its conglomerate, and now operates manufacturing facilities in 15 countries—the U.S., Mexico, Brazil, Ireland, the U.K., Belgium, France, the Netherlands, Luxembourg, Spain, Italy, the Czech Republic, Bulgaria, Russia and Malaysia. The company's present chairman and CEO is Jeffrey Lorberbaum.\nMohawk's open line brands include American Olean, Daltile, Decortiles, Durkan, Eliane, Feltex, Foss, Godfrey Hirst, Karastan, Kerama Marazzi, Marazzi, Moduleo, Mohawk, Mohawk Group, Mohawk Home, Pergo, Quick-Step, Ragno and Unilin.\n\nControversies\nBusiness Operations in Russia\nDespite international sanctions and corporate withdrawals following the Russian invasion of Ukraine in 2022, Mohawk Industries has continued its business operations in Russia. According to Leave Russia, a project tracking companies still engaged in the Russian market, Mohawk Industries has not exited the country. This has led to criticism from various advocacy groups urging companies to sever ties with Russia in response to the ongoing conflict.\n\nMohawk Industries, Inc. v. Carpenter\nIn 2009, it was involved in the Supreme Court case Mohawk Industries, Inc. v. Carpenter. The court found against Mohawk Industries, in a 9–0 decision.\n\nReferences\nExternal links\nBusiness data for Mohawk Industries:",
  "clean_text": "Mohawk Industries is an American flooring manufacturer based in Calhoun, Georgia. Mohawk produces floor covering products for residential and commercial applications in North America and residential applications in Europe. The company manufacturing portfolio consists of soft flooring products (broadloom carpet, carpet tiles, carpet cushion and rugs), hard flooring products (ceramic and porcelain tile, natural stone and hardwood flooring), laminate flooring, sheet vinyl and luxury vinyl tile, natural stone and quartz countertops. In Europe, the company also produces and sells insulation, panels and mezzanine flooring. The company employs 43,000 people in operations in Australia, Brazil, Canada, Europe, Malaysia, Mexico, New Zealand, Russia and the United States. A Fortune 500 company, Mohawk is the world's largest flooring manufacturer. History William Shuttleworth and his four sons arrived in the United States in 1875 and set up a carpet mill in the Hudson Valley upon arrival. After William Shuttleworth died, the four sons moved to Amsterdam, New York in 1878 and took over an empty factory there. The company incorporated as the Shuttleworth Brothers Company in 1902. The company adopted the name Mohawk Carpet Mills (or Mohawk Mills, for short) in 1920, when it merged with McCleary, Wallin and Crouse, another mill in Amsterdam. It became the country's sole weaver to offer an entire line of domestic carpets, also creating the industry's first textured design and sculptured weave. In 1956, Mohawk Carpet Mills merged with Alexander Smith, Inc. to become Mohasco Corporation, a company large enough to appear on the first Fortune 500 rankings. Mohasco faced competition from new tufted carpet operations in Georgia, which used synthetic fibers such as nylon and polyester rather than the traditional wool used in woven carpets. To compete in a changing industry, Mohasco gradually moved manufacturing south into the Carolinas and eventually Georgia. In 1963, the company turned some of its attention to furniture manufacturing through acquisitions. Carpet manufacturing at the Amsterdam site ended by 1968 and the last corporate offices left by 1987. In 1988, Mohasco was purchased by MHS Holdings in a leveraged buyout, and the company's carpet business was spun off from Mohasco to form Mohawk Industries. In 1992, Mohawk went public with its shares traded first on the NASDAQ Stock Exchange under the ticker symbol \"MWK\" and currently on the New York Stock Exchange under the ticker symbol \"MHK.\" Mohasco's remaining assets were sold to other investors, and the company was later dissolved. Through 2016, Mohawk Industries has acquired 34 companies into its conglomerate, and now operates manufacturing facilities in 15 countries—the U.S., Mexico, Brazil, Ireland, the U.K., Belgium, France, the Netherlands, Luxembourg, Spain, Italy, the Czech Republic, Bulgaria, Russia and Malaysia. The company's present chairman and CEO is Jeffrey Lorberbaum. Mohawk's open line brands include American Olean, Daltile, Decortiles, Durkan, Eliane, Feltex, Foss, Godfrey Hirst, Karastan, Kerama Marazzi, Marazzi, Moduleo, Mohawk, Mohawk Group, Mohawk Home, Pergo, Quick-Step, Ragno and Unilin. Controversies Business Operations in Russia Despite international sanctions and corporate withdrawals following the Russian invasion of Ukraine in 2022, Mohawk Industries has continued its business operations in Russia. According to Leave Russia, a project tracking companies still engaged in the Russian market, Mohawk Industries has not exited the country. This has led to criticism from various advocacy groups urging companies to sever ties with Russia in response to the ongoing conflict. Mohawk Industries, Inc. v. Carpenter In 2009, it was involved in the Supreme Court case Mohawk Industries, Inc. v. Carpenter. The court found against Mohawk Industries, in a 9–0 decision."
}