{
  "ticker": "MKC",
  "cik": "0000063754",
  "company_name": "McCormick & Company",
  "corrected_name": "McCormick & Company",
  "wiki_title_used": "McCormick & Company",
  "exists": true,
  "raw_text": "McCormick & Company, Incorporated is an American food company that manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavoring products to retail outlets, food manufacturers, and food service businesses.\nTheir products are available in many countries, and it is the largest producer of spices and related food products worldwide, based on revenue.\nA Fortune 500 company, McCormick has approximately 14,000 employees around the globe. The company headquarters moved from Sparks to Hunt Valley, Maryland, in the third quarter of 2018.\n\nHistory\nWilloughby M. McCormick (1864–1932) started the business in Baltimore at age 25 in 1889. From one room and a cellar, he sold his initial products door-to-door, which included root beer, flavoring extracts, fruit syrup, and juices. Seven years later, McCormick bought the F.G. Emmett Spice Company and entered the spice industry. In 1903, Willoughby and his brother Roberdeau incorporated the company in Maine; they reincorporated in Maryland in 1915. The Great Baltimore Fire of February 1904 destroyed most of the company's assets and records. However, they constructed a new five-story building on the same site within 10 months in 1905.\nThe United States Bureau of Chemistry investigated McCormick & Company in 1916 for adulteration in its black pepper product. The court case resulted in a fine and a requirement that the company label the adulterated product as \"ground black pepper containing from 10 percent to 28 percent added pepper shells\".\nWilloughby's nephew Charles P. McCormick (1896–1970), began working for the company in the summer of 1912, during his high school years at Baltimore City College. After graduating in 1915, he attended Johns Hopkins University, and was later elected to the company board of directors in 1925.\n\nWilloughby died on November 4, 1932, and Charles was elected president and chairman of the board at age 36. In 1941, the big \"Mc\" became a trademark for nearly all U.S. products.\nCharles P. (\"Buzz\")  McCormick, Jr. was elected president and chief executive officer in 1987 and re-elected CEO and chairman of the board in 1988.\nThe company celebrated its centennial in 1989 with events primarily for employees and those responsible for its success, and arranged for the musical group Up with People to give a series of performances across the U.S. for schools, churches, hospitals, and similar organizations. McCormick is a Fortune 500 company, having annual revenues of $5.6 billion in 2020.\n\nAcquisitions\nMcCormick acquired San Francisco-based coffee, spice, and extract house A. Schilling & Company in 1947, enabling McCormick to begin coast-to-coast distribution in the U.S. McCormick continued to use the Schilling name for its Western division until the 1990s, with the last product containers marked Schilling produced in 2002; since then, all of the company's products have been marketed under the McCormick name nationwide.\nIt acquired Ben-Hur Products, a similar California-based company, in 1953, and Canada's largest spice firm, Gorman Eckert & Co. Ltd. of London, Ontario, in 1959. Gilroy Foods of Gilroy, California, became a wholly owned subsidiary in 1961. Other acquisitions included Baker Extract Co. in 1962, Cake Mate cake decorating in 1967, Childers Foods (later part of Golden West Foods) in 1968, and Tubed Products, an Easthampton, Massachusetts contract food packer and producer of plastic tubes, also in 1968. Charles P. McCormick retired in 1969, was named chairman emeritus, and died of a heart attack the following year.\nMcCormick acquired Golden West Foods, a frozen foods manufacturer and distributor in Gilroy, California, in 1973 and entered that field under the Schilling brand label. The McCormick (east) and Schilling (west) retail units were consolidated to form a Grocery Products Division in 1975 with headquarters in Baltimore. Additional acquisitions included All Portions in 1975, TV Time Foods of Chicago in 1976, Astro Foods of San Rafael, California, in 1977, and Han-Dee Pak of Atlanta in 1979.\nIn October 1979, Swiss pharmaceutical firm Sandoz, Ltd. announced its intention to purchase the company. McCormick sued Sandoz in May 1980 and by September Sandoz agreed to relinquish its efforts to purchase McCormick and sold the shares that it acquired in its attempt to purchase the company.\nSetco, a plastic bottle producer in Culver City, California, and Stange, Chicago's specialty flavorings and colorings company, became subsidiaries in 1981. The company acquired Paterson Jenks, a publicly held United Kingdom corporation, in 1984, and Schwartz, the largest British spice line. Other acquisitions included Armanino Farms, the world's largest grower and processor of chives, from Armanino & Son, Inc., of San Francisco in 1986; and three California companies in 1987: Gentry Foods of Gilroy, Parsley Patch of Windsor, and The Herb Farm of Encinitas.\nIn 1990, McCormick purchased an interest in the Old Bay seasoning brand, famous in the Chesapeake Bay region for its use in preparing and steaming the local seafood delicacy of blue crabs. It then acquired Mojave Foods Corporation of Los Angeles in 1991, and the consumer products business of Golden Dipt Company in 1993. McCormick's 1994 acquisitions included Grupo Pesa of Mexico, Tuko Oy of Finland, Butto of Switzerland, and Minipack of Southampton, United Kingdom. Chairman Emeritus Charles P. McCormick Jr. was re-elected chairman in 1994. The company sold Golden West Foods in 1995 and Minipack of Southampton in 1996. Also sold in 1996 were Gilroy Foods, Gilroy Energy, and Giza National Dehydration of Cairo, Egypt. McCormick Canada acquired the French's dry seasoning line in 1997.\nThe company acquired Ducros of France in 2000, later renamed McCormick France. In 2003, McCormick was added to the Standard & Poor's 500 Index; acquired UniqSauces of the UK and Zatarain's of Louisiana; and sold its packaging businesses, Setco and Tubed Products, as well as its Jenks brokerage business assets. The company acquired C.M. van Sillevoldt B.V. of the Netherlands in 2004 and Epicurean International (renamed Simply Asia Foods) in 2006, with its Thai Kitchen and Simply Asia brands.\nIn 2007, the company started a new advertising campaign to encourage consumers to dispose of older packages of spices by pointing out that any of their packages that list their address as \"Baltimore, MD 21202\" are over 15 years old. In 2008, McCormick acquired Billy Bee Honey Products of Canada, and the Lawry's brand of seasonings and marinades in its largest acquisition in company history for the next ten years. To gain FTC approval for the purchase of Lawry's, McCormick agreed to sell its Season-All business to Morton Salt.\nIn 2011, the company acquired Kitchen Basics, an Ohio-based brand of shelf-stable liquid stock, for $38 million. During that year, it also acquired Kamis S.A., a privately held Polish company with leading brands in spices, seasonings, mustards and other flavor products in Poland for $291 million. It also bought an 85% stake in Kohinoor Speciality Foods India for $115 million, a joint venture with India-based Kohinoor Foods Limited to market and sell basmati and ready-to-eat food products in India.\nIn mid-2013, the company completed its acquisition of Wuhan Asia-Pacific Condiments Co. Ltd. (WAPC), a seasoning manufacturer in the central region of China with the Daqiao and ChuShiLe bouillon products.\nIn June 2015, McCormick purchased Stubb's marinades, BBQ Sauce and rubs for $100 million.\nIn December 2015, McCormick announced that Lawrence E. Kurzius, head of global operations, would become CEO effective February 2016. Kurzius was a leader at McCormick for 12 years before the announcement and previously held positions at Uncle Ben's, Mars Inc., and Quaker Oats Company.\nThe company dropped its bid to acquire Premier Foods in April 2016 after determining that Premier's asking price would not benefit shareholders.\nLate in 2016, the company acquired Enrico Giotti SpA, a private Italian flavorings company, in a $127 million deal.\nIn 2017, McCormick purchased Reckitt Benckiser's Food Division (\"RB Foods\"). At over four billion dollars, it topped Lawry's acquisition a decade earlier to become the largest acquisition in the company's history. The addition of French's and Frank's RedHot to McCormick's global portfolio represent the second and third largest brands, respectively, behind the McCormick brand.\nIn November 2020, McCormick agreed to buy Cholula Hot Sauce from L Catterton. In December 2020, McCormick acquired FONA, a leading North American manufacturer of flavors.\n\nResearch and development\nIn February 2019, McCormick announced that it worked with IBM to build an artificial intelligence (AI) system to analyze decades of data to develop new flavor combinations and seasoning mixes.  The company brought its first AI-developed line of seasoning mixes to market in 2019, which were called \"One\" for making one-dish meals.\n\nTV sponsorship\nIn December 2021, McCormick announced their sponsorship of Elinor Wonders Why on PBS Kids, and the PBS sponsorship group noted Let's Go Luna as another such series; this is the first PBS programming to be funded by McCormick.\n\nHeadquarters\nIn 1970, McCormick moved its manufacturing and corporate offices from Baltimore's Inner Harbor to Hunt Valley, Maryland. In 1991, McCormick corporate offices were moved to Sparks, Maryland. In 2018, the company's 1,100-employee global headquarters moved from Sparks back to Hunt Valley with a grand opening held on October 2, 2018.\nMcCormick's consumer segment has brands in approximately 170 countries and territories. The retail range includes spices and herbs, recipe mixes, extracts, condiments, marinades, stocks, broths, bouillons, sauces, toppings, homemade desserts, rice mixes, salad dressings and breadings.\nMcCormick makes flavorings, branded food service products, condiments, coating systems, and ingredients for food manufacturers, food service operators, and restaurants worldwide.\n\nBrands\nMcCormick & Company brands reach consumers in more than 170 countries and territories. Its brands include:\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for McCormick & Company, Incorporated:",
  "clean_text": "McCormick & Company, Incorporated is an American food company that manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavoring products to retail outlets, food manufacturers, and food service businesses. Their products are available in many countries, and it is the largest producer of spices and related food products worldwide, based on revenue. A Fortune 500 company, McCormick has approximately 14,000 employees around the globe. The company headquarters moved from Sparks to Hunt Valley, Maryland, in the third quarter of 2018. History Willoughby M. McCormick (1864–1932) started the business in Baltimore at age 25 in 1889. From one room and a cellar, he sold his initial products door-to-door, which included root beer, flavoring extracts, fruit syrup, and juices. Seven years later, McCormick bought the F.G. Emmett Spice Company and entered the spice industry. In 1903, Willoughby and his brother Roberdeau incorporated the company in Maine; they reincorporated in Maryland in 1915. The Great Baltimore Fire of February 1904 destroyed most of the company's assets and records. However, they constructed a new five-story building on the same site within 10 months in 1905. The United States Bureau of Chemistry investigated McCormick & Company in 1916 for adulteration in its black pepper product. The court case resulted in a fine and a requirement that the company label the adulterated product as \"ground black pepper containing from 10 percent to 28 percent added pepper shells\". Willoughby's nephew Charles P. McCormick (1896–1970), began working for the company in the summer of 1912, during his high school years at Baltimore City College. After graduating in 1915, he attended Johns Hopkins University, and was later elected to the company board of directors in 1925. Willoughby died on November 4, 1932, and Charles was elected president and chairman of the board at age 36. In 1941, the big \"Mc\" became a trademark for nearly all U.S. products. Charles P. (\"Buzz\") McCormick, Jr. was elected president and chief executive officer in 1987 and re-elected CEO and chairman of the board in 1988. The company celebrated its centennial in 1989 with events primarily for employees and those responsible for its success, and arranged for the musical group Up with People to give a series of performances across the U.S. for schools, churches, hospitals, and similar organizations. McCormick is a Fortune 500 company, having annual revenues of $5.6 billion in 2020. Acquisitions McCormick acquired San Francisco-based coffee, spice, and extract house A. Schilling & Company in 1947, enabling McCormick to begin coast-to-coast distribution in the U.S. McCormick continued to use the Schilling name for its Western division until the 1990s, with the last product containers marked Schilling produced in 2002; since then, all of the company's products have been marketed under the McCormick name nationwide. It acquired Ben-Hur Products, a similar California-based company, in 1953, and Canada's largest spice firm, Gorman Eckert & Co. Ltd. of London, Ontario, in 1959. Gilroy Foods of Gilroy, California, became a wholly owned subsidiary in 1961. Other acquisitions included Baker Extract Co. in 1962, Cake Mate cake decorating in 1967, Childers Foods (later part of Golden West Foods) in 1968, and Tubed Products, an Easthampton, Massachusetts contract food packer and producer of plastic tubes, also in 1968. Charles P. McCormick retired in 1969, was named chairman emeritus, and died of a heart attack the following year. McCormick acquired Golden West Foods, a frozen foods manufacturer and distributor in Gilroy, California, in 1973 and entered that field under the Schilling brand label. The McCormick (east) and Schilling (west) retail units were consolidated to form a Grocery Products Division in 1975 with headquarters in Baltimore. Additional acquisitions included All Portions in 1975, TV Time Foods of Chicago in 1976, Astro Foods of San Rafael, California, in 1977, and Han-Dee Pak of Atlanta in 1979. In October 1979, Swiss pharmaceutical firm Sandoz, Ltd. announced its intention to purchase the company. McCormick sued Sandoz in May 1980 and by September Sandoz agreed to relinquish its efforts to purchase McCormick and sold the shares that it acquired in its attempt to purchase the company. Setco, a plastic bottle producer in Culver City, California, and Stange, Chicago's specialty flavorings and colorings company, became subsidiaries in 1981. The company acquired Paterson Jenks, a publicly held United Kingdom corporation, in 1984, and Schwartz, the largest British spice line. Other acquisitions included Armanino Farms, the world's largest grower and processor of chives, from Armanino & Son, Inc., of San Francisco in 1986; and three California companies in 1987: Gentry Foods of Gilroy, Parsley Patch of Windsor, and The Herb Farm of Encinitas. In 1990, McCormick purchased an interest in the Old Bay seasoning brand, famous in the Chesapeake Bay region for its use in preparing and steaming the local seafood delicacy of blue crabs. It then acquired Mojave Foods Corporation of Los Angeles in 1991, and the consumer products business of Golden Dipt Company in 1993. McCormick's 1994 acquisitions included Grupo Pesa of Mexico, Tuko Oy of Finland, Butto of Switzerland, and Minipack of Southampton, United Kingdom. Chairman Emeritus Charles P. McCormick Jr. was re-elected chairman in 1994. The company sold Golden West Foods in 1995 and Minipack of Southampton in 1996. Also sold in 1996 were Gilroy Foods, Gilroy Energy, and Giza National Dehydration of Cairo, Egypt. McCormick Canada acquired the French's dry seasoning line in 1997. The company acquired Ducros of France in 2000, later renamed McCormick France. In 2003, McCormick was added to the Standard & Poor's 500 Index; acquired UniqSauces of the UK and Zatarain's of Louisiana; and sold its packaging businesses, Setco and Tubed Products, as well as its Jenks brokerage business assets. The company acquired C.M. van Sillevoldt B.V. of the Netherlands in 2004 and Epicurean International (renamed Simply Asia Foods) in 2006, with its Thai Kitchen and Simply Asia brands. In 2007, the company started a new advertising campaign to encourage consumers to dispose of older packages of spices by pointing out that any of their packages that list their address as \"Baltimore, MD 21202\" are over 15 years old. In 2008, McCormick acquired Billy Bee Honey Products of Canada, and the Lawry's brand of seasonings and marinades in its largest acquisition in company history for the next ten years. To gain FTC approval for the purchase of Lawry's, McCormick agreed to sell its Season-All business to Morton Salt. In 2011, the company acquired Kitchen Basics, an Ohio-based brand of shelf-stable liquid stock, for $38 million. During that year, it also acquired Kamis S.A., a privately held Polish company with leading brands in spices, seasonings, mustards and other flavor products in Poland for $291 million. It also bought an 85% stake in Kohinoor Speciality Foods India for $115 million, a joint venture with India-based Kohinoor Foods Limited to market and sell basmati and ready-to-eat food products in India. In mid-2013, the company completed its acquisition of Wuhan Asia-Pacific Condiments Co. Ltd. (WAPC), a seasoning manufacturer in the central region of China with the Daqiao and ChuShiLe bouillon products. In June 2015, McCormick purchased Stubb's marinades, BBQ Sauce and rubs for $100 million. In December 2015, McCormick announced that Lawrence E. Kurzius, head of global operations, would become CEO effective February 2016. Kurzius was a leader at McCormick for 12 years before the announcement and previously held positions at Uncle Ben's, Mars Inc., and Quaker Oats Company. The company dropped its bid to acquire Premier Foods in April 2016 after determining that Premier's asking price would not benefit shareholders. Late in 2016, the company acquired Enrico Giotti SpA, a private Italian flavorings company, in a $127 million deal. In 2017, McCormick purchased Reckitt Benckiser's Food Division (\"RB Foods\"). At over four billion dollars, it topped Lawry's acquisition a decade earlier to become the largest acquisition in the company's history. The addition of French's and Frank's RedHot to McCormick's global portfolio represent the second and third largest brands, respectively, behind the McCormick brand. In November 2020, McCormick agreed to buy Cholula Hot Sauce from L Catterton. In December 2020, McCormick acquired FONA, a leading North American manufacturer of flavors. Research and development In February 2019, McCormick announced that it worked with IBM to build an artificial intelligence (AI) system to analyze decades of data to develop new flavor combinations and seasoning mixes. The company brought its first AI-developed line of seasoning mixes to market in 2019, which were called \"One\" for making one-dish meals. TV sponsorship In December 2021, McCormick announced their sponsorship of Elinor Wonders Why on PBS Kids, and the PBS sponsorship group noted Let's Go Luna as another such series; this is the first PBS programming to be funded by McCormick. Headquarters In 1970, McCormick moved its manufacturing and corporate offices from Baltimore's Inner Harbor to Hunt Valley, Maryland. In 1991, McCormick corporate offices were moved to Sparks, Maryland. In 2018, the company's 1,100-employee global headquarters moved from Sparks back to Hunt Valley with a grand opening held on October 2, 2018. McCormick's consumer segment has brands in approximately 170 countries and territories. The retail range includes spices and herbs, recipe mixes, extracts, condiments, marinades, stocks, broths, bouillons, sauces, toppings, homemade desserts, rice mixes, salad dressings and breadings. McCormick makes flavorings, branded food service products, condiments, coating systems, and ingredients for food manufacturers, food service operators, and restaurants worldwide. Brands McCormick & Company brands reach consumers in more than 170 countries and territories. Its brands include:"
}