{
  "ticker": "MLM",
  "cik": "0000916076",
  "company_name": "Martin Marietta Materials",
  "corrected_name": "Martin Marietta Materials",
  "wiki_title_used": "Martin Marietta Materials",
  "exists": true,
  "raw_text": "Martin Marietta Materials, Inc. is an American company and a supplier of aggregates and heavy building materials, with operations spanning 26 states, Canada and the Caribbean. In particular, Martin Marietta Materials supplies resources for the construction of roads, sidewalks and foundations.\n\nHistory\nThe present-day materials business is distantly descended from Superior Stone, an aggregates company founded in 1939 by brothers Willam Trent Ragland and Edmond Ragland in Raleigh, North Carolina. In 1959, the company, led by William Trent Ragland as president, merged with the American-Marietta Corporation, which merged with the Glenn L. Martin Company a year later to form the Martin Marietta Corporation in 1961. In 1971, Martin Marietta acquired Harvey Aluminum, a company which made aluminum oxide, aluminum ingot and aircraft grade aluminum sheet. William Trent Ragland continued as CEO until 1977, after retiring and becoming Emeritus Senior Vice President. Martin Marietta merged with Lockheed Corporation in 1995, and a year later, Martin Marietta Materials was spun off as an independent company, with Lockheed Martin retaining various aerospace, defense, and other manufacturing lines of business.\nMartin Marietta's Magnesia Specialties business provides a full range of magnesium oxide, magnesium hydroxide and dolomitic lime products.\n\nReferences\nExternal links\nOfficial website\nMartin Marietta Magnesia Specialties\nBusiness data for Martin Marietta Materials:",
  "clean_text": "Martin Marietta Materials, Inc. is an American company and a supplier of aggregates and heavy building materials, with operations spanning 26 states, Canada and the Caribbean. In particular, Martin Marietta Materials supplies resources for the construction of roads, sidewalks and foundations. History The present-day materials business is distantly descended from Superior Stone, an aggregates company founded in 1939 by brothers Willam Trent Ragland and Edmond Ragland in Raleigh, North Carolina. In 1959, the company, led by William Trent Ragland as president, merged with the American-Marietta Corporation, which merged with the Glenn L. Martin Company a year later to form the Martin Marietta Corporation in 1961. In 1971, Martin Marietta acquired Harvey Aluminum, a company which made aluminum oxide, aluminum ingot and aircraft grade aluminum sheet. William Trent Ragland continued as CEO until 1977, after retiring and becoming Emeritus Senior Vice President. Martin Marietta merged with Lockheed Corporation in 1995, and a year later, Martin Marietta Materials was spun off as an independent company, with Lockheed Martin retaining various aerospace, defense, and other manufacturing lines of business. Martin Marietta's Magnesia Specialties business provides a full range of magnesium oxide, magnesium hydroxide and dolomitic lime products."
}