{
  "ticker": "MMC",
  "cik": "0000062709",
  "company_name": "Marsh McLennan",
  "corrected_name": "Marsh McLennan",
  "wiki_title_used": "Marsh McLennan",
  "exists": true,
  "raw_text": "Marsh & McLennan Companies, Inc., doing business as Marsh McLennan and Marsh, is a global professional services firm, headquartered in New York City with businesses in insurance brokerage, risk management, reinsurance services, talent management, investment advisory, and management consulting. Its four main operating companies are Marsh (53% of 2024 revenues), which offers risk management, insurance broking, insurance program management, risk consulting, analytical modeling and alternative risk financing services; Marsh Re (formerly Guy Carpenter; 10% of 2024 revenues), a reinsurance intermediary and advisor; Mercer (23% of 2024 revenues), which provides consulting to employers for health insurance, retirement plans, and pension plans; and  Oliver Wyman; 14% of 2024 revenues, including Lippincott and NERA Economic Consulting, which provides consulting services. In 2024, Risk and Insurance Services contributed a total of 63% of revenues and 71% of operating profit, while Consulting contributed 37% of revenues and 29% of operating profit.\nIt is the largest insurance broker worldwide.\nThe company is ranked 175th on the Fortune 500 and 267th on the Forbes Global 2000.\n\nHistory\n1900-1999\nBurroughs, Marsh & McLennan was formed by Henry W. Marsh and Donald R. McLennan in Chicago in 1905 by the merger of their two businesses. Marsh founded his business in 1871 after many insurers went out of business after the Great Chicago Fire. The combined company was renamed Marsh & McLennan in 1906. \nGuy Carpenter was acquired in 1923, a year after it was founded by Guy Carpenter.\nIn 1959, Marsh acquired Mercer, a human resources consulting firm.\nThe company became a public company via an initial public offering in 1962. In 1969, it reorganized under a holding company configuration, with the company offering clients its services under the banners of separately managed companies.\nIn 1970, the company acquired Putnam Investments, adding a mutual fund business to its portfolio. It was sold in 2007.\nIn 1987, Marsh & McLennan acquired the consultancy Temple, Barker & Sloane for $45 million. Founded in Lexington, Massachusetts in 1969, Temple, Barker & Sloane found quick success in the management consulting industry.\nIn 1989, Washington, DC–based international management consulting firm Strategic Planning Associates merged with Marsh & McLennan. Founded by former Boston Consulting Group associate Walker Lewis in 1981, Strategic Planning Associates applied concepts of computing to strategy consulting.\nIn 1986, two clients accounted for more than 40% of revenue. When one of these clients dropped the firm in 1987, Lewis became increasingly convinced that the firm was too small to succeed, admitting to The Washington Post that \"a meaningful-sized consulting company has to be 2,000 professionals or larger... it's simple math.\"\nIn 1990, Temple Barker & Sloan was merged with Strategic Planning Associates to form Mercer Management Consulting.\nIn 1997, the company significantly boosted its insurance brokerage business with a $1.8 billion acquisition of Johnson & Higgins, which, at the time, was one of MMC's biggest competitors in its brokerage business. The purchase occurred during a time of consolidation in the industry, and pushed Marsh & McLennan back above Aon as the world's largest insurance broker.\n\n2000-present\nIn 2000, Marsh & McLennan’s HR consulting unit, Mercer, acquired Delta Consulting Group for its organizational development and change management expertise.\nAt the time of the September 11 attacks, Marsh held offices on eight floors, 93 to 100, of the North Tower of the World Trade Center. When American Airlines Flight 11 crashed into the building, its offices spanned the entire impact zone, floors 93 to 99. Everyone present in the company's offices on the day of the attack died as all stairwells and elevators passing through the impact zone were destroyed or blocked by the plane crashing into the tower where the company was; the firm lost 295 employees and 63 contractors. A memorial to those lost on 9/11 is located in the plaza adjacent to Marsh McLennan's New York Headquarters at 1166 Avenue of the Americas.\nIn 2003, the company acquired Oliver Wyman, a management consultancy with a large financial services industry clientele.\nIn 2004, Marsh, the company's insurance brokerage unit, was embroiled in a bid rigging scandal that plagued much of the insurance industry, including brokerage rivals Aon and Willis Group, and insurer AIG. In a lawsuit, Eliot Spitzer, then Attorney General of New York, accused Marsh of not serving as an unbiased broker, leading to increased costs for clients and higher revenues for Marsh. In early 2005, Marsh agreed to pay $850 million to settle the lawsuit and compensate clients whose commercial insurance it arranged from 2001 to 2004. After the event, the company reorganized to focus on insurance services and consulting.\nIn January 2007, Marsh received the first license for a wholly owned foreign company to operate an insurance brokerage business in China.\nIn May 2007, the company combined three Mercer consulting units - Mercer Delta Consulting, Mercer Oliver Wyman and Mercer Management Consulting - into Oliver Wyman.\nIn August 2007, the company sold Putnam Investments to Power Financial for $3.9 billion to focus on risk and human capital businesses.\nIn January 2008, Brian Duperreault was hired as CEO.\nIn 2010, the company sold Kroll, its corporate intelligence and investigative unit, to Altegrity Inc. for $1.13 billion. Prior to this final deal and divestiture, Marsh & McLennan had been selling off smaller divisions within Kroll to further focus on its core risk and consulting businesses.\nJohn Doyle was president and CEO of Marsh from 2017–2022, before succeeding Dan Glaser as president and CEO of the parent company, MMC, as of January 1, 2023.\nIn April 2019, the company acquired Jardine Lloyd Thompson for £4.3 billion.\nIn April 2021, the company rebranded to Marsh McLennan.\nIn November 2024, the company acquired McGriff Insurance Services for $7.75 billion.\nIn 2025, the company rebranded its subsidiaries as Marsh.\n\nReferences\nExternal links\nBusiness data for Marsh & McLennan:",
  "clean_text": "Marsh & McLennan Companies, Inc., doing business as Marsh McLennan and Marsh, is a global professional services firm, headquartered in New York City with businesses in insurance brokerage, risk management, reinsurance services, talent management, investment advisory, and management consulting. Its four main operating companies are Marsh (53% of 2024 revenues), which offers risk management, insurance broking, insurance program management, risk consulting, analytical modeling and alternative risk financing services; Marsh Re (formerly Guy Carpenter; 10% of 2024 revenues), a reinsurance intermediary and advisor; Mercer (23% of 2024 revenues), which provides consulting to employers for health insurance, retirement plans, and pension plans; and Oliver Wyman; 14% of 2024 revenues, including Lippincott and NERA Economic Consulting, which provides consulting services. In 2024, Risk and Insurance Services contributed a total of 63% of revenues and 71% of operating profit, while Consulting contributed 37% of revenues and 29% of operating profit. It is the largest insurance broker worldwide. The company is ranked 175th on the Fortune 500 and 267th on the Forbes Global 2000. History 1900-1999 Burroughs, Marsh & McLennan was formed by Henry W. Marsh and Donald R. McLennan in Chicago in 1905 by the merger of their two businesses. Marsh founded his business in 1871 after many insurers went out of business after the Great Chicago Fire. The combined company was renamed Marsh & McLennan in 1906. Guy Carpenter was acquired in 1923, a year after it was founded by Guy Carpenter. In 1959, Marsh acquired Mercer, a human resources consulting firm. The company became a public company via an initial public offering in 1962. In 1969, it reorganized under a holding company configuration, with the company offering clients its services under the banners of separately managed companies. In 1970, the company acquired Putnam Investments, adding a mutual fund business to its portfolio. It was sold in 2007. In 1987, Marsh & McLennan acquired the consultancy Temple, Barker & Sloane for $45 million. Founded in Lexington, Massachusetts in 1969, Temple, Barker & Sloane found quick success in the management consulting industry. In 1989, Washington, DC–based international management consulting firm Strategic Planning Associates merged with Marsh & McLennan. Founded by former Boston Consulting Group associate Walker Lewis in 1981, Strategic Planning Associates applied concepts of computing to strategy consulting. In 1986, two clients accounted for more than 40% of revenue. When one of these clients dropped the firm in 1987, Lewis became increasingly convinced that the firm was too small to succeed, admitting to The Washington Post that \"a meaningful-sized consulting company has to be 2,000 professionals or larger... it's simple math.\" In 1990, Temple Barker & Sloan was merged with Strategic Planning Associates to form Mercer Management Consulting. In 1997, the company significantly boosted its insurance brokerage business with a $1.8 billion acquisition of Johnson & Higgins, which, at the time, was one of MMC's biggest competitors in its brokerage business. The purchase occurred during a time of consolidation in the industry, and pushed Marsh & McLennan back above Aon as the world's largest insurance broker. 2000-present In 2000, Marsh & McLennan’s HR consulting unit, Mercer, acquired Delta Consulting Group for its organizational development and change management expertise. At the time of the September 11 attacks, Marsh held offices on eight floors, 93 to 100, of the North Tower of the World Trade Center. When American Airlines Flight 11 crashed into the building, its offices spanned the entire impact zone, floors 93 to 99. Everyone present in the company's offices on the day of the attack died as all stairwells and elevators passing through the impact zone were destroyed or blocked by the plane crashing into the tower where the company was; the firm lost 295 employees and 63 contractors. A memorial to those lost on 9/11 is located in the plaza adjacent to Marsh McLennan's New York Headquarters at 1166 Avenue of the Americas. In 2003, the company acquired Oliver Wyman, a management consultancy with a large financial services industry clientele. In 2004, Marsh, the company's insurance brokerage unit, was embroiled in a bid rigging scandal that plagued much of the insurance industry, including brokerage rivals Aon and Willis Group, and insurer AIG. In a lawsuit, Eliot Spitzer, then Attorney General of New York, accused Marsh of not serving as an unbiased broker, leading to increased costs for clients and higher revenues for Marsh. In early 2005, Marsh agreed to pay $850 million to settle the lawsuit and compensate clients whose commercial insurance it arranged from 2001 to 2004. After the event, the company reorganized to focus on insurance services and consulting. In January 2007, Marsh received the first license for a wholly owned foreign company to operate an insurance brokerage business in China. In May 2007, the company combined three Mercer consulting units - Mercer Delta Consulting, Mercer Oliver Wyman and Mercer Management Consulting - into Oliver Wyman. In August 2007, the company sold Putnam Investments to Power Financial for $3.9 billion to focus on risk and human capital businesses. In January 2008, Brian Duperreault was hired as CEO. In 2010, the company sold Kroll, its corporate intelligence and investigative unit, to Altegrity Inc. for $1.13 billion. Prior to this final deal and divestiture, Marsh & McLennan had been selling off smaller divisions within Kroll to further focus on its core risk and consulting businesses. John Doyle was president and CEO of Marsh from 2017–2022, before succeeding Dan Glaser as president and CEO of the parent company, MMC, as of January 1, 2023. In April 2019, the company acquired Jardine Lloyd Thompson for £4.3 billion. In April 2021, the company rebranded to Marsh McLennan. In November 2024, the company acquired McGriff Insurance Services for $7.75 billion. In 2025, the company rebranded its subsidiaries as Marsh."
}