{
  "ticker": "MNST",
  "cik": "0000865752",
  "company_name": "Monster Beverage",
  "corrected_name": "Monster Beverage",
  "wiki_title_used": "Monster Beverage",
  "exists": true,
  "raw_text": "Monster Beverage Corporation is an American beverage company that manufactures energy drinks including Monster Energy, Relentless, Reign and Burn. The company was originally founded as Hansen's in 1935 in Southern California, originally selling juice products. The company renamed itself as Monster Beverage in 2012.\nAs of 2020, Monster held 39% of the $86 billion global energy drink market, the second highest share after Red Bull.\n\nHistory\nHansen's was founded in 1935. In the 1930s, Hubert Hansen and his three sons began selling juice to film studios and retailers in Southern California under the Hansen's name. In the 1970s, Tim Hansen (the grandson of Hubert) developed and marketed a variety of sodas and juices, also under the Hansen's label.\nThe company became Hansen's Juices, and later The Fresh Juice Company of California. The plant that was opened in Los Angeles in 1946 was used until operations were moved to a new plant in Azusa, California in 1993. The company filed for bankruptcy in 1988, and was acquired by the California CoPackers Corporation and renamed Hansen Natural Company. In 1990, Hansen's (original ticker symbol: HANS) went public with an initial public offering. In 1997, Hansen's launched their first energy drink, called Hansen's Energy. In 1998, the company moved from Anaheim, California to Corona, California. On January 5, 2012, after energy drinks had grown to the largest source of revenue, shareholders agreed to change the name of the company from Hansen's Natural to Monster Beverage Corporation, under the new ticker MNST. Shareholders also approved an increase in the number of authorized shares of common stock from 120,000,000 shares to 240,000,000 shares.\nIn April 2008, the U.S. Food and Drug Administration ruled products containing high-fructose corn syrup could not be labeled \"natural\". Shortly after, Hansen's Natural Corporation announced they had begun using cane sugar instead.\nIn September 2009, Hansen brand Monster Energy sent a cease and desist letter to Rock Art Brewery, demanding the microbrewery stop selling its new Vermonster beer, drop its pursuit of a federal trademark for the name, and pay Hansen's lawyer fees. This resulted in a boycott of all Hansen products by a few Vermont retailers.\nThe Coca-Cola Company bought a 16.7% stake for $2.15 billion in Monster Beverage Corp in 2015. This stake peaked at 19.3% due to share buybacks conducted by Monster Beverage Corp in 2018.\nIn January 2022, the company acquired CANarchy Craft Brewery Collective for US$330 million. In \nFebruary 2022, it was reported Monster and Constellation Brands were considering a merger which would have a combined market capitalization above $90 billion. In June 2023, Monster reached an agreement to acquire Vital Pharmaceuticals, the owner of Bang Energy.\n\nSponsorship\nNASCAR announced on December 1, 2016, a multi-year deal that will make Monster Energy only the third entitlement sponsor in its premier series history. However, this deal ended after the 2019 race season, and the series will be known as simply the \"NASCAR Cup Series\" from 2020 onward. The company is expected to continue sponsoring individual drivers, including Tyler Reddick, Ty Gibbs and Riley Herbst into the future. Monster remains a secondary sponsor.\nBrittany Force of the NHRA races with Monster Energy livery at several races in their season.\nProfessional Bull Riders Unleash the Beast Series carries a Monster Energy sponsorship.\nWorld of Outlaws features the NOS brand as its title sponsor.\nAMA Supercross features Monster Energy as its title sponsor.\n\nFinances\nFor the fiscal year 2017, Monster Beverage reported earnings of US$821 million, with an annual revenue of US$3.369 billion, an increase of 10.5% over the previous fiscal cycle. Monster Beverage's shares traded at over $25 per share, and its market capitalization was valued at US$29.9 billion in November 2018.\n\nProducts\nMonster Energy\nFull Throttle\nNOS\nBang Energy\nReign\nRelentless\nMother\nBurn\nPredator\nLive+\nTrue North\n\nPeace Iced Tea\nPeace Iced Tea (often labeled Peace Tea) is an American brand of assorted iced tea beverages produced by the Coca-Cola Company. It was originally produced by Monster Beverage. The product launched on December 21, 2007. It is served in 16 oz cans in the United States, and 695 mL cans in Canada. Peace Tea is also a competitor of Arizona brand iced teas in the ready-to-drink beverage category, as well as drinks from Snapple and Pepsi. The peace symbol is a universal symbol for peace, which was the inspiration behind the creation of Peace Tea. \"Peace Tea is whatever you want it to be,\" says the brand's official web site, which is festooned with peace signs. Peace Tea \"stands for social awareness while maintaining its soul. In the form of a mere liquid, it can be your own form of poetry.\"\nThe original Peace Tea can designs were created by Steve Jugan (Peace Tea brand manager) and artist John Malloy, aka FLuX, in homage to the different peace movements throughout history. Malloy is a mixed-media artist who began drawing at a young age. He later earned a background in old master's style painting and has since been self-taught in fine art, illustration, comics, and design. His illustrations have been featured in a variety of publications, including The Big Book of Contemporary Illustration and the 'Illusive 3' Book of Contemporary Illustration. His artwork led each Peace Tea packaging can to tell a story behind a significant peace movement throughout history. \nUpon Peace Tea's 2015 transfer to the Coca-Cola Company, they produced simpler can designs.\n\nFormer products\nNatural soda\nNatural Soda came in twelve flavors: Original Cola, Ginger Ale, Key Lime Twist, Cherry Vanilla Creme, Grapefruit, Kiwi Strawberry, Vanilla Cola, Mandarin Lime, Creamy Root Beer, Raspberry, Mango Orange, and Pomegranate. All Hansen's sodas are made with cane sugar.\n\nDiet soda\nTheir Diet Soda was available in ten flavors: Cola, Black Cherry, Peach, Kiwi Strawberry, Vanilla Cherry Crème, Tangerine, Lime, Ginger Ale, Root Beer, Grapefruit, and Pomegranate. Hansen's diet soda is sweetened with acesulfame potassium and sucralose. All diet sodas are OU Kosher certified.\n\nDrink mixers\nMonster Beverage sells three flavors of soda mixer: Tonic, Ginger Ale, and Club Soda.\n\nFruit juices\nThe company sells thirteen fruit juices in 64-ounce PET bottles, several of which are available in smaller bottles for kids. These include Apple, Grape, White Grape, Pineapple, Apple Grape, Apple Strawberry, Orange, Cranberry Apple, Ruby Red Grapefruit, Pomegranate, Organic Apple White Grape, Organic Apple Wild Berry and Organic Apple. These juices contain 120% of the United States Recommended Daily Allowances (USRDA) for Vitamin C (except Pomegranate, which contains 100%).\nIn 2009, Monster Beverage introduced Hansen's Natural Lo-Cal 64-ounce juice cocktails, in four flavors. They are sweetened with Truvia.\nHansen's fruit juice smoothies contain approximately 25% juice and provide 100% of the recommended daily adult intake of Vitamins A, C, and E. They are packaged in 11.5-ounce aluminum cans.\n\nJuicy Endeavors: A Kid's Drink Attempt\nHansen's Juice Blast line of children's juice drinks was launched in conjunction with Costco and sold in Costco stores. Hansen also has a Juice Slam line of children's juice drinks. Both lines are sold in 6.75-ounce boxes.\nIn May 2001, Hansen's acquired the Junior Juice beverage business. Hansen's Junior Juice is 100% juice, sold in 4.23-ounce cartons and targeted at toddlers and preschoolers. Certain flavors of Junior Juice have calcium added and all flavors contain 100% of the daily recommended allowance of Vitamin C. The brand was introduced in 1991 by McCain Foods, and sold to the Pasco Beverage Group in 2000 before being sold again, to Hansen's. Hansen's replaced the original four mascots, Uncle Froggy, Emily the Mouse, Ronald Rabbit, and Nick the Fox, with Clifford the Big Red Dog.\nIn July 2008, Hansen's introduced Hansen's Organic Junior Water, in 4.23-ounce packages aimed at children between two and six years old. The Hansen's Organic Junior Water line of flavored water contains 100% of the daily recommended allowance of Vitamin C and thirty calories per serving. Also in 2008, organic Junior Water was introduced. Hansen's later introduced Coconut Water Twist, containing coconut water, and Garden Twist, a combination of fruits and vegetables, which is the only Junior Juice variant to be sold in bottles.\n\nOther beverages\nSmoothies, Rumba Energy Juice, Energade, and Energy Formula, are minor products. Monster owns Blue Sky Beverage Company, which manufactures several soft drinks. Monster produces the Monster, Lost, and Rumba energy drinks, which were previously distributed in the United States by Anheuser Busch.\nIn August 2009, Hansen's introduced the SELF Beauty Elixir line, a low-calorie beverage containing vitamins, minerals, natural fruit & botanical extracts, antioxidants and 30% fruit juice. The beverage contains 35 calories and a low amount of sodium per 8-ounce aluminum can.\n\nSignature Soda\nHansen's Signature Soda line included Black Cherry, Vanilla Cream, Orange Cream, Ginger Beer, and Sarsaparilla flavors.\n\nNatural and diet tea sodas\nHansen's Natural and Diet Soda flavors included: Black Cherry, Tangerine, Tropical, Orange Mango, Peach Mango, Peach, Cherry, Cranberry, Clear Root Beer, Vanilla Coffee, Low Cal Wildberry, Low Cal Cola, and Low Cal Creamy Cola.\nIn 2006, Hansen's introduced a line of iced teas in 16-ounce PET bottles. Some varieties were sweetened with cane sugar and some were unsweetened. Flavors included Lemon Mint, Pomegranate, Ginger, and Tangerine. There were also three flavors of diet green tea soda: Lemon Mint, Ginger and Tangerine. Each bottle of tea contained 75 mg of Epigallocatechin gallate. Hansen's also made tea bags.\n\nControversies\nIn 2018, The Huffington Post published an article in which five women accused Monster Beverage of having an abusive and discriminatory culture. Manager Phillip Deitrich regularly humiliated and boycotted a female subordinate in public, and denied her increases in compensation. VP John Kenneally was accused of retaliation, bullying, and sexual harassment. According to three women, he subverted their reputations and forced them to abandon the company. One woman had responded to his advances but suffered nothing but abuse as a consequence of his jealous personality. She was ultimately forced out of the company by Kenneally after objecting to him calling her a \"whore\". Kenneally was fired two weeks after the article was released. In March 2018, a sixth woman came forward, accusing retired manager Ted Cook of sexual harassment, and claimed being fired for mercurial reasons.\n\nReferences\nExternal links\n\n Media related to Monster Beverage Corporation at Wikimedia Commons\nOfficial website\nBusiness data for Monster Beverage:",
  "clean_text": "Monster Beverage Corporation is an American beverage company that manufactures energy drinks including Monster Energy, Relentless, Reign and Burn. The company was originally founded as Hansen's in 1935 in Southern California, originally selling juice products. The company renamed itself as Monster Beverage in 2012. As of 2020, Monster held 39% of the $86 billion global energy drink market, the second highest share after Red Bull. History Hansen's was founded in 1935. In the 1930s, Hubert Hansen and his three sons began selling juice to film studios and retailers in Southern California under the Hansen's name. In the 1970s, Tim Hansen (the grandson of Hubert) developed and marketed a variety of sodas and juices, also under the Hansen's label. The company became Hansen's Juices, and later The Fresh Juice Company of California. The plant that was opened in Los Angeles in 1946 was used until operations were moved to a new plant in Azusa, California in 1993. The company filed for bankruptcy in 1988, and was acquired by the California CoPackers Corporation and renamed Hansen Natural Company. In 1990, Hansen's (original ticker symbol: HANS) went public with an initial public offering. In 1997, Hansen's launched their first energy drink, called Hansen's Energy. In 1998, the company moved from Anaheim, California to Corona, California. On January 5, 2012, after energy drinks had grown to the largest source of revenue, shareholders agreed to change the name of the company from Hansen's Natural to Monster Beverage Corporation, under the new ticker MNST. Shareholders also approved an increase in the number of authorized shares of common stock from 120,000,000 shares to 240,000,000 shares. In April 2008, the U.S. Food and Drug Administration ruled products containing high-fructose corn syrup could not be labeled \"natural\". Shortly after, Hansen's Natural Corporation announced they had begun using cane sugar instead. In September 2009, Hansen brand Monster Energy sent a cease and desist letter to Rock Art Brewery, demanding the microbrewery stop selling its new Vermonster beer, drop its pursuit of a federal trademark for the name, and pay Hansen's lawyer fees. This resulted in a boycott of all Hansen products by a few Vermont retailers. The Coca-Cola Company bought a 16.7% stake for $2.15 billion in Monster Beverage Corp in 2015. This stake peaked at 19.3% due to share buybacks conducted by Monster Beverage Corp in 2018. In January 2022, the company acquired CANarchy Craft Brewery Collective for US$330 million. In February 2022, it was reported Monster and Constellation Brands were considering a merger which would have a combined market capitalization above $90 billion. In June 2023, Monster reached an agreement to acquire Vital Pharmaceuticals, the owner of Bang Energy. Sponsorship NASCAR announced on December 1, 2016, a multi-year deal that will make Monster Energy only the third entitlement sponsor in its premier series history. However, this deal ended after the 2019 race season, and the series will be known as simply the \"NASCAR Cup Series\" from 2020 onward. The company is expected to continue sponsoring individual drivers, including Tyler Reddick, Ty Gibbs and Riley Herbst into the future. Monster remains a secondary sponsor. Brittany Force of the NHRA races with Monster Energy livery at several races in their season. Professional Bull Riders Unleash the Beast Series carries a Monster Energy sponsorship. World of Outlaws features the NOS brand as its title sponsor. AMA Supercross features Monster Energy as its title sponsor. Finances For the fiscal year 2017, Monster Beverage reported earnings of US$821 million, with an annual revenue of US$3.369 billion, an increase of 10.5% over the previous fiscal cycle. Monster Beverage's shares traded at over $25 per share, and its market capitalization was valued at US$29.9 billion in November 2018. Products Monster Energy Full Throttle NOS Bang Energy Reign Relentless Mother Burn Predator Live+ True North Peace Iced Tea Peace Iced Tea (often labeled Peace Tea) is an American brand of assorted iced tea beverages produced by the Coca-Cola Company. It was originally produced by Monster Beverage. The product launched on December 21, 2007. It is served in 16 oz cans in the United States, and 695 mL cans in Canada. Peace Tea is also a competitor of Arizona brand iced teas in the ready-to-drink beverage category, as well as drinks from Snapple and Pepsi. The peace symbol is a universal symbol for peace, which was the inspiration behind the creation of Peace Tea. \"Peace Tea is whatever you want it to be,\" says the brand's official web site, which is festooned with peace signs. Peace Tea \"stands for social awareness while maintaining its soul. In the form of a mere liquid, it can be your own form of poetry.\" The original Peace Tea can designs were created by Steve Jugan (Peace Tea brand manager) and artist John Malloy, aka FLuX, in homage to the different peace movements throughout history. Malloy is a mixed-media artist who began drawing at a young age. He later earned a background in old master's style painting and has since been self-taught in fine art, illustration, comics, and design. His illustrations have been featured in a variety of publications, including The Big Book of Contemporary Illustration and the 'Illusive 3' Book of Contemporary Illustration. His artwork led each Peace Tea packaging can to tell a story behind a significant peace movement throughout history. Upon Peace Tea's 2015 transfer to the Coca-Cola Company, they produced simpler can designs. Former products Natural soda Natural Soda came in twelve flavors: Original Cola, Ginger Ale, Key Lime Twist, Cherry Vanilla Creme, Grapefruit, Kiwi Strawberry, Vanilla Cola, Mandarin Lime, Creamy Root Beer, Raspberry, Mango Orange, and Pomegranate. All Hansen's sodas are made with cane sugar. Diet soda Their Diet Soda was available in ten flavors: Cola, Black Cherry, Peach, Kiwi Strawberry, Vanilla Cherry Crème, Tangerine, Lime, Ginger Ale, Root Beer, Grapefruit, and Pomegranate. Hansen's diet soda is sweetened with acesulfame potassium and sucralose. All diet sodas are OU Kosher certified. Drink mixers Monster Beverage sells three flavors of soda mixer: Tonic, Ginger Ale, and Club Soda. Fruit juices The company sells thirteen fruit juices in 64-ounce PET bottles, several of which are available in smaller bottles for kids. These include Apple, Grape, White Grape, Pineapple, Apple Grape, Apple Strawberry, Orange, Cranberry Apple, Ruby Red Grapefruit, Pomegranate, Organic Apple White Grape, Organic Apple Wild Berry and Organic Apple. These juices contain 120% of the United States Recommended Daily Allowances (USRDA) for Vitamin C (except Pomegranate, which contains 100%). In 2009, Monster Beverage introduced Hansen's Natural Lo-Cal 64-ounce juice cocktails, in four flavors. They are sweetened with Truvia. Hansen's fruit juice smoothies contain approximately 25% juice and provide 100% of the recommended daily adult intake of Vitamins A, C, and E. They are packaged in 11.5-ounce aluminum cans. Juicy Endeavors: A Kid's Drink Attempt Hansen's Juice Blast line of children's juice drinks was launched in conjunction with Costco and sold in Costco stores. Hansen also has a Juice Slam line of children's juice drinks. Both lines are sold in 6.75-ounce boxes. In May 2001, Hansen's acquired the Junior Juice beverage business. Hansen's Junior Juice is 100% juice, sold in 4.23-ounce cartons and targeted at toddlers and preschoolers. Certain flavors of Junior Juice have calcium added and all flavors contain 100% of the daily recommended allowance of Vitamin C. The brand was introduced in 1991 by McCain Foods, and sold to the Pasco Beverage Group in 2000 before being sold again, to Hansen's. Hansen's replaced the original four mascots, Uncle Froggy, Emily the Mouse, Ronald Rabbit, and Nick the Fox, with Clifford the Big Red Dog. In July 2008, Hansen's introduced Hansen's Organic Junior Water, in 4.23-ounce packages aimed at children between two and six years old. The Hansen's Organic Junior Water line of flavored water contains 100% of the daily recommended allowance of Vitamin C and thirty calories per serving. Also in 2008, organic Junior Water was introduced. Hansen's later introduced Coconut Water Twist, containing coconut water, and Garden Twist, a combination of fruits and vegetables, which is the only Junior Juice variant to be sold in bottles. Other beverages Smoothies, Rumba Energy Juice, Energade, and Energy Formula, are minor products. Monster owns Blue Sky Beverage Company, which manufactures several soft drinks. Monster produces the Monster, Lost, and Rumba energy drinks, which were previously distributed in the United States by Anheuser Busch. In August 2009, Hansen's introduced the SELF Beauty Elixir line, a low-calorie beverage containing vitamins, minerals, natural fruit & botanical extracts, antioxidants and 30% fruit juice. The beverage contains 35 calories and a low amount of sodium per 8-ounce aluminum can. Signature Soda Hansen's Signature Soda line included Black Cherry, Vanilla Cream, Orange Cream, Ginger Beer, and Sarsaparilla flavors. Natural and diet tea sodas Hansen's Natural and Diet Soda flavors included: Black Cherry, Tangerine, Tropical, Orange Mango, Peach Mango, Peach, Cherry, Cranberry, Clear Root Beer, Vanilla Coffee, Low Cal Wildberry, Low Cal Cola, and Low Cal Creamy Cola. In 2006, Hansen's introduced a line of iced teas in 16-ounce PET bottles. Some varieties were sweetened with cane sugar and some were unsweetened. Flavors included Lemon Mint, Pomegranate, Ginger, and Tangerine. There were also three flavors of diet green tea soda: Lemon Mint, Ginger and Tangerine. Each bottle of tea contained 75 mg of Epigallocatechin gallate. Hansen's also made tea bags. Controversies In 2018, The Huffington Post published an article in which five women accused Monster Beverage of having an abusive and discriminatory culture. Manager Phillip Deitrich regularly humiliated and boycotted a female subordinate in public, and denied her increases in compensation. VP John Kenneally was accused of retaliation, bullying, and sexual harassment. According to three women, he subverted their reputations and forced them to abandon the company. One woman had responded to his advances but suffered nothing but abuse as a consequence of his jealous personality. She was ultimately forced out of the company by Kenneally after objecting to him calling her a \"whore\". Kenneally was fired two weeks after the article was released. In March 2018, a sixth woman came forward, accusing retired manager Ted Cook of sexual harassment, and claimed being fired for mercurial reasons."
}