{
  "ticker": "MO",
  "cik": "0000764180",
  "company_name": "Altria",
  "corrected_name": "Altria",
  "wiki_title_used": "Altria",
  "exists": true,
  "raw_text": "Altria Group, Inc. (previously known as Philip Morris Companies, Inc. until 2003) is an American corporation and one of the world's largest producers and marketers of tobacco, cigarettes, and medical products in the treatment of illnesses caused by tobacco. It operates worldwide and is headquartered in the city of Richmond, Virginia.\nAltria is the parent company of Philip Morris USA, John Middleton, Inc., U.S. Smokeless Tobacco Company, Inc., Philip Morris Capital Corporation, and NJOY Holdings, Inc. Altria also maintains large minority stakes in Belgium-based brewer AB InBev and the Canadian cannabis company Cronos Group. It is a component of the S&P 500 and was a component of the Dow Jones Industrial Average from 1985 to 2008, dropping due to spin-offs of Kraft Foods Inc. in 2007 and Philip Morris International in 2008.\n\nHistory\nAltria emerged from Philip Morris USA. The onset of \"rebranding\" of Philip Morris Companies to Altria took place in 2003 (Philip Morris would later split, with Philip Morris USA remaining Altria's primary and only consistently held asset). According to Altria, it was created because Philip Morris wished to emphasize that its business portfolio had come to consist of more than Philip Morris USA and Philip Morris International; at the time, it owned an 84% stake in Kraft Foods, although that business has since been spun off. The name \"Altria\" is claimed to come from the Latin word for \"high\" and was part of a trend of companies rebranding to names that previously did not exist, Accenture (previously Andersen Consulting) and Verizon being notable examples, though linguist Steven Pinker suggests that in fact the name is an \"egregious example\" of phonesthesia—with the company attempting to \"switch its image from bad people who sell addictive carcinogens to a place or state marked by altruism and other lofty values\".\nThe company's branding consultants, the Wirthlin Group, said: \"The name change alternative offers the possibility of masking the negatives associated with the tobacco business\", thus enabling the company to improve its image and raise its profile without sacrificing tobacco profits. Philip Morris executives thought a name change would insulate the larger corporation and its other operating companies from the political pressures on tobacco.\nThe rebranding took place amidst social, legal, and financially troubled circumstances. In 2003 Altria was ranked Fortune number 11, and has steadily declined since. In 2010 Altria Group (MO) ranked at Fortune number 137, whereas its former asset, Philip Morris International, was ranked 94th.\nIn 2006, a United States court found that Philip Morris \"publicly ... disputed scientific findings linking smoking and disease knowing their assertions were false.\" In a 2006 ruling, a federal court found that Altria, along with R. J. Reynolds, Lorillard and Philip Morris were found guilty of misleading the public about the dangers of smoking. Within this ruling, it was noted that \"defendants altered the chemical form of nicotine delivered in mainstream cigarette smoke for the purpose of improving nicotine transfer efficiency and increasing the speed with which nicotine is absorbed by smokers.\" This was done by manipulating smoke pH with ammonia. Adding ammonia increases the smoke pH, in a process called \"freebasing\" which causes smokers to be \"exposed to higher internal nicotine doses and become more addicted to the product.\"\nOn March 30, 2007, Altria's 88.1% stake in Kraft Foods was spun off, through a distribution of the remaining stake of shares (88.1%) to Altria shareholders. That same year, Altria began selling all its shares of Philip Morris International to Altria stockholders, a spin-off that was completed on March 28, 2008. Again in 2007 the company began the acquisition of cigar manufacturer John Middleton Co. from Bradford Holdings, which was complete in 2008. After Philip Morris International spun off, the former international subsidiaries halted the purchase of tobacco from America, which was a major factor in the closing of a newly renovated plant in North Carolina, an approximately 50% reduction in manufacturing, large-scale layoffs, and induced early retirements.\nIn 2008, Altria officially moved its headquarters from New York City to Richmond, Virginia, after Philip Morris sold its downtown offices in New York City a decade earlier. With a few exceptions, all manufacturing, commercial, and executive employees had long been based in and around Richmond. The company is now headquartered in an unincorporated area within Henrico County, less than five miles (8.0 km) west of the city limits of Richmond and less than 10 miles (16 km) from its downtown Richmond campus.\nAside from the Philip Morris/Altria headquarters, some of their other buildings included the Altria Center for Research and Technology in downtown Richmond, their manufacturing center in South Richmond, and the adjacent operations center which began shutting down in 2007–2008, as a result of the loss of demand from Philip Morris International member companies. The layoffs beginning in 2007 affected thousands of Altria, Altria Client Services, Philip Morris USA, and contracted employees in Richmond and North Carolina.\nIn 2009, Altria finalized its purchase of UST Inc., whose products included smokeless tobacco (made by U.S. Smokeless Tobacco Company) and wine (made by Chateau Ste. Michelle). This ended a short era of competition between the new Marlboro smokeless tobacco products such as snus, and those produced by UST Inc.\nOn December 8, 2018, Altria announced its intent to acquire a 45% stake in Cronos Group for $1.8 billion.\nOn December 20, 2018, Altria finalized the acquisition of a 35% stake in JUUL Labs, an e-cigarette company based out of San Francisco, California, for $12.8 billion. On November 3, 2019, it was reported that Altria was taking a $4.5 billion writedown on its stake in Juul, 35% of its original value. On July 28, 2022, it was reported that Altria's investment in Juul is now worth only 5% of the original amount of $12.8 billion. Despite the losses, Altria has announced that it will continue to support Juul and avoid investing in competing products.\nAltria is taking a stake in the global business of Swiss tobacco company Burger Söhne (Helix Innovations with the On! brand) for $372 million in June 2019.\nAltria and Japan Tobacco announced a joint venture called Horizon Innovations LLC on October 27, 2022. Horizon, owned 75 percent by Altria and 25 percent by Japan Tobacco, intends to sell Ploom heated tobacco sticks in the United States. FDA approval was expected to take until 2025, with customers able to buy Ploom by 2027.\nAltria completed the acquisition of NJOY Holdings, Inc. on June 1, 2023.\n\nFinances\nAltria and its predecessors is one of the best-performing publicly traded companies of the 20th century.\nFor the fiscal year 2020, Altria reported earnings of US$4.45 billion, with an annual revenue of US$26.15 billion. Altria's shares traded at over $66 per share, and its market capitalization was valued at over US$118.5 billion in October 2018. As of 2018, the company ranked 154th on the Fortune 500 list of the largest United States corporations by revenue.\n\nCorporate governance\nBoard of directors\nMembers of the board of directors of Altria Group as of February 2013 were:\n\nElizabeth E. Bailey, professor emerita, the Wharton School, University of Pennsylvania\nGerald L. Baliles (2008–2019), director, Miller Center of Public Affairs at University of Virginia; former Virginia governor\nMartin Barrington, chairman and chief executive officer, Altria Group, Inc.\nJohn T. Casteen III (2010– ), president emeritus, University of Virginia\nDinyar S. Devitre (2008– ), special advisor, General Atlantic Partners, New York, NY; former SVP and CFO of Altria\nThomas F. Farrell II (2008–2021), chairman, president and CEO, Dominion Resources, Richmond, VA\nThomas W. Jones (2002– ), senior partner, TWJ Capital LLC, Stamford, CT; formerly with Citigroup, Travelers and TIAA-CREF\nDebra J. Kelly-Ennis (2013– ), former president and CEO of Diageo Canada, Inc.; also formerly with RJR Nabisco, Inc., Coca-Cola, General Motors and Grand Metropolitan\nW. Leo Kiely III (2011– ), retired CEO, MillerCoors LLC, Golden, CO; formerly with Frito-Lay\nKathryn B. McQuade (2012– ), retired EVP and CFO, Canadian Pacific Railway Limited; formerly with Norfolk Southern Corporation\nGeorge Muñoz (2004– ), principal, Muñoz Investment Banking Group, LLC, Washington, DC; Partner, Tobin & Muñoz, Chicago, IL; formerly Overseas Private Investment Corporation and assistant secretary of the United States Treasury Department\nNabil Y. Sakkab (2008– ), retired Senior Vice President, corporate research and development, Procter & Gamble, Cincinnati, OH\n\nHeadquarters\nPrior to being based in Virginia, Philip Morris had its headquarters in Midtown Manhattan, New York City. In 2003, Philip Morris announced that it would move its headquarters to Virginia. The company said that it planned to keep around 750 employees in its former headquarters. Brendan McCormick, a spokesperson for Philip Morris, said that the company estimated that the move would save the company over $60 million each year. The company now has its head offices in an unincorporated area of Henrico County, Virginia, near Richmond. In addition, the company has a 450,000-square-foot, $350 million Center for Research and Technology located in downtown Richmond at the Virginia BioTechnology Research Park that employs approximately 600 scientists, engineers and support staff.\n\nDiversification\nAltria, like other tobacco companies, has invested in science and medical companies which develop and produce medical products for conditions caused or aggravated by smoking. As of 2024, Altria's three medical subsidiaries included the following: Cronos group (maker of recreational cannabis), Lexaria Bioscience (Developer of proprietary drug delivery technology, DehydraTECH, to improve active pharmaceutical ingredients entrance into the bloodstream) and Micreos (biotech company focused on discovering and developing recombinant proteins for chronic dermatology and oncology conditions).\nIt has also designed and marketed electronic cigarettes. Altria launched the MarkTen and Green Smoke brands. Both of these were discontinued in December 2018. The company returned to this market through the acquisition of NJOY.\n\nPolitical influence\nAccording to the Center for Public Integrity, Altria spent around $101 million on lobbying the United States government between 1998 and 2004, the second-highest such figure for any organization in the nation.\nAltria also funded The Advancement of Sound Science Coalition which lobbied against the scientific consensus on anthropogenic climate change.\nDaniel Smith, representing Altria, sits on the Private Enterprise Board of the American Legislative Exchange Council.\nIn 2025, Altria was one of the donors funding the White House's East Wing demolition, and planned building of a ballroom.\n\nControversies\nIn August 2006, the Altria group was found guilty of civil fraud and racketeering. The lawsuit claimed that Altria's marketing of \"light\" and \"low tar\" cigarettes constituted fraudulent misrepresentations under the Maine Unfair Trade Practices Act (MUTPA) because it deceived smokers into thinking the products are safer than regular cigarettes.\n\nSee also\nTobacco industry\nTobacco Master Settlement Agreement\n\nReferences\nExternal links\n\nOfficial website \nAltria companies grouped at OpenCorporates\nAltria Group U.S. political contributions from Influence Explorer at the Sunlight Foundation\nBusiness data for Altria:",
  "clean_text": "Altria Group, Inc. (previously known as Philip Morris Companies, Inc. until 2003) is an American corporation and one of the world's largest producers and marketers of tobacco, cigarettes, and medical products in the treatment of illnesses caused by tobacco. It operates worldwide and is headquartered in the city of Richmond, Virginia. Altria is the parent company of Philip Morris USA, John Middleton, Inc., U.S. Smokeless Tobacco Company, Inc., Philip Morris Capital Corporation, and NJOY Holdings, Inc. Altria also maintains large minority stakes in Belgium-based brewer AB InBev and the Canadian cannabis company Cronos Group. It is a component of the S&P 500 and was a component of the Dow Jones Industrial Average from 1985 to 2008, dropping due to spin-offs of Kraft Foods Inc. in 2007 and Philip Morris International in 2008. History Altria emerged from Philip Morris USA. The onset of \"rebranding\" of Philip Morris Companies to Altria took place in 2003 (Philip Morris would later split, with Philip Morris USA remaining Altria's primary and only consistently held asset). According to Altria, it was created because Philip Morris wished to emphasize that its business portfolio had come to consist of more than Philip Morris USA and Philip Morris International; at the time, it owned an 84% stake in Kraft Foods, although that business has since been spun off. The name \"Altria\" is claimed to come from the Latin word for \"high\" and was part of a trend of companies rebranding to names that previously did not exist, Accenture (previously Andersen Consulting) and Verizon being notable examples, though linguist Steven Pinker suggests that in fact the name is an \"egregious example\" of phonesthesia—with the company attempting to \"switch its image from bad people who sell addictive carcinogens to a place or state marked by altruism and other lofty values\". The company's branding consultants, the Wirthlin Group, said: \"The name change alternative offers the possibility of masking the negatives associated with the tobacco business\", thus enabling the company to improve its image and raise its profile without sacrificing tobacco profits. Philip Morris executives thought a name change would insulate the larger corporation and its other operating companies from the political pressures on tobacco. The rebranding took place amidst social, legal, and financially troubled circumstances. In 2003 Altria was ranked Fortune number 11, and has steadily declined since. In 2010 Altria Group (MO) ranked at Fortune number 137, whereas its former asset, Philip Morris International, was ranked 94th. In 2006, a United States court found that Philip Morris \"publicly ... disputed scientific findings linking smoking and disease knowing their assertions were false.\" In a 2006 ruling, a federal court found that Altria, along with R. J. Reynolds, Lorillard and Philip Morris were found guilty of misleading the public about the dangers of smoking. Within this ruling, it was noted that \"defendants altered the chemical form of nicotine delivered in mainstream cigarette smoke for the purpose of improving nicotine transfer efficiency and increasing the speed with which nicotine is absorbed by smokers.\" This was done by manipulating smoke pH with ammonia. Adding ammonia increases the smoke pH, in a process called \"freebasing\" which causes smokers to be \"exposed to higher internal nicotine doses and become more addicted to the product.\" On March 30, 2007, Altria's 88.1% stake in Kraft Foods was spun off, through a distribution of the remaining stake of shares (88.1%) to Altria shareholders. That same year, Altria began selling all its shares of Philip Morris International to Altria stockholders, a spin-off that was completed on March 28, 2008. Again in 2007 the company began the acquisition of cigar manufacturer John Middleton Co. from Bradford Holdings, which was complete in 2008. After Philip Morris International spun off, the former international subsidiaries halted the purchase of tobacco from America, which was a major factor in the closing of a newly renovated plant in North Carolina, an approximately 50% reduction in manufacturing, large-scale layoffs, and induced early retirements. In 2008, Altria officially moved its headquarters from New York City to Richmond, Virginia, after Philip Morris sold its downtown offices in New York City a decade earlier. With a few exceptions, all manufacturing, commercial, and executive employees had long been based in and around Richmond. The company is now headquartered in an unincorporated area within Henrico County, less than five miles (8.0 km) west of the city limits of Richmond and less than 10 miles (16 km) from its downtown Richmond campus. Aside from the Philip Morris/Altria headquarters, some of their other buildings included the Altria Center for Research and Technology in downtown Richmond, their manufacturing center in South Richmond, and the adjacent operations center which began shutting down in 2007–2008, as a result of the loss of demand from Philip Morris International member companies. The layoffs beginning in 2007 affected thousands of Altria, Altria Client Services, Philip Morris USA, and contracted employees in Richmond and North Carolina. In 2009, Altria finalized its purchase of UST Inc., whose products included smokeless tobacco (made by U.S. Smokeless Tobacco Company) and wine (made by Chateau Ste. Michelle). This ended a short era of competition between the new Marlboro smokeless tobacco products such as snus, and those produced by UST Inc. On December 8, 2018, Altria announced its intent to acquire a 45% stake in Cronos Group for $1.8 billion. On December 20, 2018, Altria finalized the acquisition of a 35% stake in JUUL Labs, an e-cigarette company based out of San Francisco, California, for $12.8 billion. On November 3, 2019, it was reported that Altria was taking a $4.5 billion writedown on its stake in Juul, 35% of its original value. On July 28, 2022, it was reported that Altria's investment in Juul is now worth only 5% of the original amount of $12.8 billion. Despite the losses, Altria has announced that it will continue to support Juul and avoid investing in competing products. Altria is taking a stake in the global business of Swiss tobacco company Burger Söhne (Helix Innovations with the On! brand) for $372 million in June 2019. Altria and Japan Tobacco announced a joint venture called Horizon Innovations LLC on October 27, 2022. Horizon, owned 75 percent by Altria and 25 percent by Japan Tobacco, intends to sell Ploom heated tobacco sticks in the United States. FDA approval was expected to take until 2025, with customers able to buy Ploom by 2027. Altria completed the acquisition of NJOY Holdings, Inc. on June 1, 2023. Finances Altria and its predecessors is one of the best-performing publicly traded companies of the 20th century. For the fiscal year 2020, Altria reported earnings of US$4.45 billion, with an annual revenue of US$26.15 billion. Altria's shares traded at over $66 per share, and its market capitalization was valued at over US$118.5 billion in October 2018. As of 2018, the company ranked 154th on the Fortune 500 list of the largest United States corporations by revenue. Corporate governance Board of directors Members of the board of directors of Altria Group as of February 2013 were: Elizabeth E. Bailey, professor emerita, the Wharton School, University of Pennsylvania Gerald L. Baliles (2008–2019), director, Miller Center of Public Affairs at University of Virginia; former Virginia governor Martin Barrington, chairman and chief executive officer, Altria Group, Inc. John T. Casteen III (2010– ), president emeritus, University of Virginia Dinyar S. Devitre (2008– ), special advisor, General Atlantic Partners, New York, NY; former SVP and CFO of Altria Thomas F. Farrell II (2008–2021), chairman, president and CEO, Dominion Resources, Richmond, VA Thomas W. Jones (2002– ), senior partner, TWJ Capital LLC, Stamford, CT; formerly with Citigroup, Travelers and TIAA-CREF Debra J. Kelly-Ennis (2013– ), former president and CEO of Diageo Canada, Inc.; also formerly with RJR Nabisco, Inc., Coca-Cola, General Motors and Grand Metropolitan W. Leo Kiely III (2011– ), retired CEO, MillerCoors LLC, Golden, CO; formerly with Frito-Lay Kathryn B. McQuade (2012– ), retired EVP and CFO, Canadian Pacific Railway Limited; formerly with Norfolk Southern Corporation George Muñoz (2004– ), principal, Muñoz Investment Banking Group, LLC, Washington, DC; Partner, Tobin & Muñoz, Chicago, IL; formerly Overseas Private Investment Corporation and assistant secretary of the United States Treasury Department Nabil Y. Sakkab (2008– ), retired Senior Vice President, corporate research and development, Procter & Gamble, Cincinnati, OH Headquarters Prior to being based in Virginia, Philip Morris had its headquarters in Midtown Manhattan, New York City. In 2003, Philip Morris announced that it would move its headquarters to Virginia. The company said that it planned to keep around 750 employees in its former headquarters. Brendan McCormick, a spokesperson for Philip Morris, said that the company estimated that the move would save the company over $60 million each year. The company now has its head offices in an unincorporated area of Henrico County, Virginia, near Richmond. In addition, the company has a 450,000-square-foot, $350 million Center for Research and Technology located in downtown Richmond at the Virginia BioTechnology Research Park that employs approximately 600 scientists, engineers and support staff. Diversification Altria, like other tobacco companies, has invested in science and medical companies which develop and produce medical products for conditions caused or aggravated by smoking. As of 2024, Altria's three medical subsidiaries included the following: Cronos group (maker of recreational cannabis), Lexaria Bioscience (Developer of proprietary drug delivery technology, DehydraTECH, to improve active pharmaceutical ingredients entrance into the bloodstream) and Micreos (biotech company focused on discovering and developing recombinant proteins for chronic dermatology and oncology conditions). It has also designed and marketed electronic cigarettes. Altria launched the MarkTen and Green Smoke brands. Both of these were discontinued in December 2018. The company returned to this market through the acquisition of NJOY. Political influence According to the Center for Public Integrity, Altria spent around $101 million on lobbying the United States government between 1998 and 2004, the second-highest such figure for any organization in the nation. Altria also funded The Advancement of Sound Science Coalition which lobbied against the scientific consensus on anthropogenic climate change. Daniel Smith, representing Altria, sits on the Private Enterprise Board of the American Legislative Exchange Council. In 2025, Altria was one of the donors funding the White House's East Wing demolition, and planned building of a ballroom. Controversies In August 2006, the Altria group was found guilty of civil fraud and racketeering. The lawsuit claimed that Altria's marketing of \"light\" and \"low tar\" cigarettes constituted fraudulent misrepresentations under the Maine Unfair Trade Practices Act (MUTPA) because it deceived smokers into thinking the products are safer than regular cigarettes."
}