{
  "ticker": "MOH",
  "cik": "0001179929",
  "company_name": "Molina Healthcare",
  "corrected_name": "Molina Healthcare",
  "wiki_title_used": "Molina Healthcare",
  "exists": true,
  "raw_text": "Molina Healthcare, Inc. is a managed care company headquartered in Long Beach, California, United States. The company provides health insurance to individuals through government programs such as Medicaid and Medicare.\n\nHistory\nMolina Healthcare was founded in 1980 by C. David Molina, an emergency room physician in Long Beach, California. He had seen an influx of patients using the emergency room for common illnesses such as a sore throat or the flu because they were being turned away by doctors who would not accept Medi-Cal. Molina established his first primary care clinic with the goal of treating the lowest-income patients, regardless of their ability to pay. \nIn September 2020, Molina Healthcare entered into an arrangement to purchase approximately all the assets of the Affinity Health Plan for about $380 million.\n\nLeadership\nFor twenty years, the company was run by Dr. Molina's son, J. Mario Molina, MD, a physician. He was the president and CEO of the company. John Molina, Mario's younger brother, was the CFO of Molina Healthcare. The two took over Molina's operations after their father died in 1996 and continued to expand the company. In May 2017 J. Mario and John were removed from their positions by the Board of Directors, who cited poor financial performance as the reason for the change in leadership. In October 2017 the company announced Joseph Zubretsky, the former CFO of Aetna, as Molina Healthcare's president and CEO.\n\nClinics\nThe first Molina Medical clinic was opened in Wilmington, California in 1980. The company formerly operated clinics in Washington, New Mexico, Florida and Utah. The clinics were opened to provide health care to low-income families and individuals. In August 2017 Molina Healthcare announced it would close several clinics in Michigan, Florida, New Mexico, Wisconsin, and Utah.\n\nBecoming HMO\nMolina Healthcare has focused on government-paid healthcare programs such as SCHIP and Medicaid since it became a health maintenance organization in 1985. From 1985 to 1997, the company was based solely in California.\n\nExpansion of health plans\n1997: Molina Healthcare acquires Health Reach Family Health Care and enters the states of Utah and Michigan.\n2000: Molina Healthcare enters the state of Washington.\n2004: Molina Healthcare enters the state of New Mexico.\n2005: Molina Healthcare becomes a health plan in Ohio.\n2006: Molina Healthcare enters the state of Texas.\n2007: Molina Healthcare enters Missouri.\n2008: Molina Healthcare enters Florida.\n2010: Molina Healthcare enters Wisconsin.\n2012: Molina Healthcare enters Illinois.\n2013: Molina Healthcare enters South Carolina by acquiring assets from Community Health Solutions.\n2013: Molina Healthcare acquires New Mexico Lovelace Medicaid contract.\n2014: Molina Healthcare acquires Florida Medicaid assets from First Coast Advantage.\n2015: Molina Healthcare enters Chicago market, acquiring MyCare Chicago's Medicaid assets.\n2015: Molina Healthcare enters Puerto Rico.\n2015: Molina Healthcare of Washington is the first health care company in the state to cover \"Virtual Urgent Care\" services.\n2015: Molina Healthcare acquires Medicaid assets of Integral Health Plan, Inc. in Florida.\n2015: Molina Healthcare acquires Providence Human Services and Community Services from Providence Service Corporation and renames them Pathways.\n2015: Molina Healthcare adds online access to behavioral health.\n2015: Molina Healthcare acquires HealthPlus MIChild and Medicaid programs of Michigan.\n2015: Molina Healthcare acquires assets of Loyola Physician Partners' Medicaid Program of Illinois.\n2017: Molina Healthcare exits the individual Marketplace in Utah and Wisconsin.\n2018: Molina Healthcare loses Medicaid contract with the state of New Mexico.\n2018: Molina Healthcare sells Pathways to Altar Capital\n2019: Molina Healthcare loses Medicaid contract with the state of Texas.\n2020: Molina Healthcare acquires Passport Health Plan in Kentucky.\n2021: Molina Healthcare acquires Magellan Complete Care line of business from Magellan Health, Inc. With this acquisition, Molina enters Arizona, Massachusetts, and Virginia.\n2021: Molina Healthcare acquires Affinity Health Plan in New York.\n2021: Molina Healthcare acquires Cigna's Medicaid contracts in Texas.\n2023: Molina Healthcare enters Iowa.\n\nGoing public\nMolina Healthcare filed with the Securities and Exchange Commission for an initial stock offering in December 2002 and went public in July 2003 with a stock offering of $102 million. The shares were priced at $17.50, and Molina raised approximately $124 million in the initial public offering. In its stock market debut, Molina sold 6.6 million shares at $20.30, making the company the third-best first day gainer of 2003. Molina Healthcare was the first company from Inc. Magazine's \"Inner City 100\" list to go public.\n\nEntering the Medicare market\nMolina Healthcare entered the Medicare market in 2006. The company currently offers Medicare health plan options in: Arizona, California, Florida, Idaho, Illinois, Kentucky, Massachusetts, Michigan, Nevada, New Mexico, New York, Ohio, South Carolina, Texas, Utah, Virginia, Washington and Wisconsin.\n\nEntering MMIS market\nMolina Healthcare acquired Unisys' health information management business in December 2010 to create Molina Medicaid Solutions (MMS). MMS has Medicaid Management Information Systems (MMIS) contracts with Idaho, Louisiana, Maine, New Jersey, West Virginia and the U.S. Virgin Islands. In Autumn 2018, Molina Healthcare, Inc. sold its Medicaid management information systems business, Molina Medicaid Solutions (MMS), to DXC Technology. MMS was a wholly owned subsidiary of Molina Healthcare at the time of sale.\n\nEntering health insurance marketplace\nIn 2014, Molina Healthcare began offering Marketplace plans in nine states where it offered Medicaid health plans through State Facilitated Marketplaces and Federally Facilitated Marketplace. On November 16, 2016 the Seattle Times reported that about 11 million people currently get their coverage through the exchange. In August 2017 Molina announced it would stop offering plans on the health insurance marketplaces in Utah, Wisconsin, and Maine in 2018.\n\nDual eligible demonstration projects\nMolina was selected to participate in dual eligible demonstration projects in California, Ohio, Illinois, Michigan, South Carolina and Texas to serve patients who are eligible for both Medicare and Medicaid.\n\nCriticism and controversies\nA 2023 report investigating \"High Rates of Prior\nAuthorization Denials\" reported that Molina Healthcare's Medicaid plans for financially vulnerable people had some of the highest denial percentages in the country. It was reported, that Molina Healthcare operated plans that denied medical care under requests for prior authorization of services in more than 25% of cases in 2019. About 2.7 million people were enrolled in these plans at the time, while another 8.4 million people were enrolled in plans with denial rates higher than average at 15-25%. Some plans had even higher denial rates, as their Illinois plan 41% of requests.\n\nPhilanthropy\nIn May 2022, MolinaCares presented a $100,000 grant to support Compass Health's Broadway Campus Redevelopment Project. The grant will aid funding of construction of a 72,000 square-foot, state-of-the-art facility that will expand community-based behavioural health care services and its workforce in northwest Washington.\n\nAwards and recognition\nMolina Healthcare was awarded the 2011 Alfred P. Sloan Award for Business Excellence in Workplace Flexibility. The award ranked Molina Healthcare in the top 20 percent of employers nationally in terms of its programs, policies and culture for creating an effective and flexible workplace. In 2006, Molina Healthcare was named among the 100 best corporate citizens by Business Ethics magazine. In 2005, Time magazine recognized Dr. J. Mario Molina, then CEO of Molina Healthcare, as one of the 25 most influential Hispanics in America.\nThe company ranked 155th on the 2021 Fortune 500 list of the largest United States corporations by revenue. The company ranked 126th on the 2023 Fortune 500 list of the largest United States corporations by revenue.\n\nOther awards and recognition\n2014: Milwaukee Journal Sentinel Recognizes Molina Healthcare of Wisconsin with a Top Workplace Award 2014\n2014: Molina Healthcare of New Mexico voted Best Places to Work by Albuquerque Business First\n2014: Molina Healthcare was one of 26 companies to participate in President Obama's SupplierPay 2014\n2015: Molina Healthcare voted Top Ten Least Stressful Companies to Work for In America 2015\n2015: Molina Healthcare ranked 301 in top Fortune 500 2015\n2016: Molina Healthcare ranked 201 in top Fortune 500 2016\n2017: Molina Healthcare ranked 156 in Fortune 500 2017\n2023: Molina Healthcare of Kentucky awarded One of Kentucky's Best Places to Work\n2023: Molina Healthcare recognized as one of America's Best-in-State Employers by Forbes\n2023: Molina Healthcare recognized as one of Time's World's Best Companies of 2023\n2023: Molina Healthcare recognized as one of Newsweek's Greatest Workplaces for Parents and Families 2023\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Molina Healthcare:",
  "clean_text": "Molina Healthcare, Inc. is a managed care company headquartered in Long Beach, California, United States. The company provides health insurance to individuals through government programs such as Medicaid and Medicare. History Molina Healthcare was founded in 1980 by C. David Molina, an emergency room physician in Long Beach, California. He had seen an influx of patients using the emergency room for common illnesses such as a sore throat or the flu because they were being turned away by doctors who would not accept Medi-Cal. Molina established his first primary care clinic with the goal of treating the lowest-income patients, regardless of their ability to pay. In September 2020, Molina Healthcare entered into an arrangement to purchase approximately all the assets of the Affinity Health Plan for about $380 million. Leadership For twenty years, the company was run by Dr. Molina's son, J. Mario Molina, MD, a physician. He was the president and CEO of the company. John Molina, Mario's younger brother, was the CFO of Molina Healthcare. The two took over Molina's operations after their father died in 1996 and continued to expand the company. In May 2017 J. Mario and John were removed from their positions by the Board of Directors, who cited poor financial performance as the reason for the change in leadership. In October 2017 the company announced Joseph Zubretsky, the former CFO of Aetna, as Molina Healthcare's president and CEO. Clinics The first Molina Medical clinic was opened in Wilmington, California in 1980. The company formerly operated clinics in Washington, New Mexico, Florida and Utah. The clinics were opened to provide health care to low-income families and individuals. In August 2017 Molina Healthcare announced it would close several clinics in Michigan, Florida, New Mexico, Wisconsin, and Utah. Becoming HMO Molina Healthcare has focused on government-paid healthcare programs such as SCHIP and Medicaid since it became a health maintenance organization in 1985. From 1985 to 1997, the company was based solely in California. Expansion of health plans 1997: Molina Healthcare acquires Health Reach Family Health Care and enters the states of Utah and Michigan. 2000: Molina Healthcare enters the state of Washington. 2004: Molina Healthcare enters the state of New Mexico. 2005: Molina Healthcare becomes a health plan in Ohio. 2006: Molina Healthcare enters the state of Texas. 2007: Molina Healthcare enters Missouri. 2008: Molina Healthcare enters Florida. 2010: Molina Healthcare enters Wisconsin. 2012: Molina Healthcare enters Illinois. 2013: Molina Healthcare enters South Carolina by acquiring assets from Community Health Solutions. 2013: Molina Healthcare acquires New Mexico Lovelace Medicaid contract. 2014: Molina Healthcare acquires Florida Medicaid assets from First Coast Advantage. 2015: Molina Healthcare enters Chicago market, acquiring MyCare Chicago's Medicaid assets. 2015: Molina Healthcare enters Puerto Rico. 2015: Molina Healthcare of Washington is the first health care company in the state to cover \"Virtual Urgent Care\" services. 2015: Molina Healthcare acquires Medicaid assets of Integral Health Plan, Inc. in Florida. 2015: Molina Healthcare acquires Providence Human Services and Community Services from Providence Service Corporation and renames them Pathways. 2015: Molina Healthcare adds online access to behavioral health. 2015: Molina Healthcare acquires HealthPlus MIChild and Medicaid programs of Michigan. 2015: Molina Healthcare acquires assets of Loyola Physician Partners' Medicaid Program of Illinois. 2017: Molina Healthcare exits the individual Marketplace in Utah and Wisconsin. 2018: Molina Healthcare loses Medicaid contract with the state of New Mexico. 2018: Molina Healthcare sells Pathways to Altar Capital 2019: Molina Healthcare loses Medicaid contract with the state of Texas. 2020: Molina Healthcare acquires Passport Health Plan in Kentucky. 2021: Molina Healthcare acquires Magellan Complete Care line of business from Magellan Health, Inc. With this acquisition, Molina enters Arizona, Massachusetts, and Virginia. 2021: Molina Healthcare acquires Affinity Health Plan in New York. 2021: Molina Healthcare acquires Cigna's Medicaid contracts in Texas. 2023: Molina Healthcare enters Iowa. Going public Molina Healthcare filed with the Securities and Exchange Commission for an initial stock offering in December 2002 and went public in July 2003 with a stock offering of $102 million. The shares were priced at $17.50, and Molina raised approximately $124 million in the initial public offering. In its stock market debut, Molina sold 6.6 million shares at $20.30, making the company the third-best first day gainer of 2003. Molina Healthcare was the first company from Inc. Magazine's \"Inner City 100\" list to go public. Entering the Medicare market Molina Healthcare entered the Medicare market in 2006. The company currently offers Medicare health plan options in: Arizona, California, Florida, Idaho, Illinois, Kentucky, Massachusetts, Michigan, Nevada, New Mexico, New York, Ohio, South Carolina, Texas, Utah, Virginia, Washington and Wisconsin. Entering MMIS market Molina Healthcare acquired Unisys' health information management business in December 2010 to create Molina Medicaid Solutions (MMS). MMS has Medicaid Management Information Systems (MMIS) contracts with Idaho, Louisiana, Maine, New Jersey, West Virginia and the U.S. Virgin Islands. In Autumn 2018, Molina Healthcare, Inc. sold its Medicaid management information systems business, Molina Medicaid Solutions (MMS), to DXC Technology. MMS was a wholly owned subsidiary of Molina Healthcare at the time of sale. Entering health insurance marketplace In 2014, Molina Healthcare began offering Marketplace plans in nine states where it offered Medicaid health plans through State Facilitated Marketplaces and Federally Facilitated Marketplace. On November 16, 2016 the Seattle Times reported that about 11 million people currently get their coverage through the exchange. In August 2017 Molina announced it would stop offering plans on the health insurance marketplaces in Utah, Wisconsin, and Maine in 2018. Dual eligible demonstration projects Molina was selected to participate in dual eligible demonstration projects in California, Ohio, Illinois, Michigan, South Carolina and Texas to serve patients who are eligible for both Medicare and Medicaid. Criticism and controversies A 2023 report investigating \"High Rates of Prior Authorization Denials\" reported that Molina Healthcare's Medicaid plans for financially vulnerable people had some of the highest denial percentages in the country. It was reported, that Molina Healthcare operated plans that denied medical care under requests for prior authorization of services in more than 25% of cases in 2019. About 2.7 million people were enrolled in these plans at the time, while another 8.4 million people were enrolled in plans with denial rates higher than average at 15-25%. Some plans had even higher denial rates, as their Illinois plan 41% of requests. Philanthropy In May 2022, MolinaCares presented a $100,000 grant to support Compass Health's Broadway Campus Redevelopment Project. The grant will aid funding of construction of a 72,000 square-foot, state-of-the-art facility that will expand community-based behavioural health care services and its workforce in northwest Washington. Awards and recognition Molina Healthcare was awarded the 2011 Alfred P. Sloan Award for Business Excellence in Workplace Flexibility. The award ranked Molina Healthcare in the top 20 percent of employers nationally in terms of its programs, policies and culture for creating an effective and flexible workplace. In 2006, Molina Healthcare was named among the 100 best corporate citizens by Business Ethics magazine. In 2005, Time magazine recognized Dr. J. Mario Molina, then CEO of Molina Healthcare, as one of the 25 most influential Hispanics in America. The company ranked 155th on the 2021 Fortune 500 list of the largest United States corporations by revenue. The company ranked 126th on the 2023 Fortune 500 list of the largest United States corporations by revenue. Other awards and recognition 2014: Milwaukee Journal Sentinel Recognizes Molina Healthcare of Wisconsin with a Top Workplace Award 2014 2014: Molina Healthcare of New Mexico voted Best Places to Work by Albuquerque Business First 2014: Molina Healthcare was one of 26 companies to participate in President Obama's SupplierPay 2014 2015: Molina Healthcare voted Top Ten Least Stressful Companies to Work for In America 2015 2015: Molina Healthcare ranked 301 in top Fortune 500 2015 2016: Molina Healthcare ranked 201 in top Fortune 500 2016 2017: Molina Healthcare ranked 156 in Fortune 500 2017 2023: Molina Healthcare of Kentucky awarded One of Kentucky's Best Places to Work 2023: Molina Healthcare recognized as one of America's Best-in-State Employers by Forbes 2023: Molina Healthcare recognized as one of Time's World's Best Companies of 2023 2023: Molina Healthcare recognized as one of Newsweek's Greatest Workplaces for Parents and Families 2023"
}