{
  "ticker": "MOS",
  "cik": "0001285785",
  "company_name": "Mosaic Company (The)",
  "corrected_name": "The Mosaic Company",
  "wiki_title_used": "The Mosaic Company",
  "exists": true,
  "raw_text": "The Mosaic Company is an American chemical company based in Tampa, Florida, which mines phosphate, potash, and collects urea for fertilizer, through various international distribution networks, and Mosaic Fertilizantes. It is the largest U.S. producer of potash and phosphate fertilizer.\n\nOverview\nThe Mosaic Company was formed in October 2004 by a merger between IMC Global, a fertilizer company formed in 1909, and Cargill's crop nutrition division.\nIt is a combined producer and marketer of concentrated phosphate and potash with a customer base which includes wholesalers, retail dealers and individual growers worldwide. Its headquarters are in Tampa, Florida and it employs approximately 13,000 people in eight countries.\n\nProducts\nPotash\nMosaic has approximately 10.4 million tonnes of operational potash capacity. Mosaic currently owns potash mines or surface mills at; Belle Plaine, Colonsay, Esterhazy K1, Esterhazy K2, Esterhazy K3 and Carlsbad, with another potash mine recently purchased in Brazil during the Vale Fertilizantes acquisition. Colonsay mine and mill has been indefinitely idled and is currently in care and maintenance mode. Esterhazy K3, currently in development, consists of an underground mine and service/production shafts separate from the K1 and K2 underground mine that is beginning to supply the K1 and K2 surface facilities with ore. Esterhazy K3 does not have surface milling and storage facilities, instead it is intended to replace the ore currently mined from the K1 and K2 mine. This shift in production will decrease brine management costs of the K1 and K2 mine, which stood at $108.0 million for 2020.\nMosaic is a member of Canpotex, an export association of Canadian potash producers through which they sell their Canadian potash outside the U.S. and Canada.\nPotash mines are located in:\n\nCarlsbad, New Mexico (32.412°N 103.939°W﻿ / 32.412; -103.939)\nBelle Plaine, Saskatchewan (50.429°N 105.199°W﻿ / 50.429; -105.199)\nColonsay, Saskatchewan (51.928°N 105.766°W﻿ / 51.928; -105.766)\nEsterhazy, Saskatchewan K1 (50.729°N 101.929°W﻿ / 50.729; -101.929)\nEsterhazy, Saskatchewan K2 (50.660°N 101.846°W﻿ / 50.660; -101.846)\nEsterhazy, Saskatchewan K3 (50.644°N 101.993°W﻿ / 50.644; -101.993)\n\nPhosphate\nMosaic has approximately 16.8 million tonnes of operational capacity for finished concentrated phosphates.  Mosaic is the largest producer of finished phosphate products with an annual capacity greater than the next two largest producers combined. It has a global distribution network made up of plants, port facilities, warehouses and sales offices. In 2013 Mosaic produced 7.6 million tons of concentrated phosphate crop nutrients and over 15 million tons of phosphate rock production. In October, 2013, Mosaic reached an agreement to purchase the phosphate operations of CF Industries for 1.4 billion dollars, which eliminates the need for Mosaic to spend an additional billion dollars to build a new processing facility in Hardee County, Florida to process the rock from their mines in that area.\nPhosphate mines are located in the Bone Valley Formation of the Peace River watershed in Central Florida:\n\nFort Meade (27.648°N 81.757°W﻿ / 27.648; -81.757)\nSouth Pasture (27.586°N 81.942°W﻿ / 27.586; -81.942)\nFour Corners (27.715°N 82.141°W﻿ / 27.715; -82.141)\nWingate Creek (27.506°N 82.130°W﻿ / 27.506; -82.130)\nFort Lonesome (27.715°N 82.150°W﻿ / 27.715; -82.150)(Closed)\nMosaic owns a 25% stake of the Ma'aden Wa'ad Al Shamal Phosphate Company joint venture in Saudi Arabia.\nWith the completion of the Vale Fertilizantes acquisition in January, 2018, an additional 5 Brazilian phosphate rock mines, 4 chemical plants and an additional 40% economic interest in the Miski Mayo mine were purchased.\n\nCarbon footprint\nThe Mosaic Company reported Total CO2e emissions (Direct + Indirect) for 31 December 2020 at 4,920 Kt (+340/+7.4% y-o-y).\n\nTimeline\n2023\n\nAugust: Mosaic Board of Directors elects Bruce Bodine to succeed Joc O'Rourke as Mosaic's CEO effective January 1, 2024. Bruce will serve as Mosaic President and Member of the Board of Directors effective immediately.\n2018\n\nJanuary: Mosaic completes acquisition of Vale Fertilizantes.\n2015\n\nAugust: Joc O'Rourke succeeds Jim Prokopanko as Mosaic's president and CEO.\n2014\n\nDecember: Mosaic acquires Archer Daniels Midland Company's (ADM) fertilizer distribution business in Brazil and Paraguay.\nJuly: Cargill acquired Mosaic's Hersey, Michigan salt plant.\n2013\n\nNovember: Mosaic closed the potash operations at their Hersey, Michigan facility.\n2011\n\nMay: Mosaic and Cargill complete the transaction to split off and distribute Cargill's stake in Mosaic.\nJanuary: Mosaic and Cargill agree to split off and orderly distribute Cargill's stake in Mosaic.\n2007\n\nJanuary: Jim Prokopanko succeeds Fritz Corrigan as president and CEO of Mosaic.\n2006\n\nJuly: Jim Prokopanko named Mosaic Chief Operating Officer.\n2004\n\nOctober: The Mosaic Company (NYSE: MOS) begins trading on the New York Stock Exchange.\nJune: Mosaic announced as the chosen name for the newly formed company.\nJanuary: The crop nutrition business of Cargill, Inc. and IMC Global enter into a definitive agreement to form a new crop nutrition company.\n\nReferences\nExternal links\nOfficial website\nBusiness data for The Mosaic Company:",
  "clean_text": "The Mosaic Company is an American chemical company based in Tampa, Florida, which mines phosphate, potash, and collects urea for fertilizer, through various international distribution networks, and Mosaic Fertilizantes. It is the largest U.S. producer of potash and phosphate fertilizer. Overview The Mosaic Company was formed in October 2004 by a merger between IMC Global, a fertilizer company formed in 1909, and Cargill's crop nutrition division. It is a combined producer and marketer of concentrated phosphate and potash with a customer base which includes wholesalers, retail dealers and individual growers worldwide. Its headquarters are in Tampa, Florida and it employs approximately 13,000 people in eight countries. Products Potash Mosaic has approximately 10.4 million tonnes of operational potash capacity. Mosaic currently owns potash mines or surface mills at; Belle Plaine, Colonsay, Esterhazy K1, Esterhazy K2, Esterhazy K3 and Carlsbad, with another potash mine recently purchased in Brazil during the Vale Fertilizantes acquisition. Colonsay mine and mill has been indefinitely idled and is currently in care and maintenance mode. Esterhazy K3, currently in development, consists of an underground mine and service/production shafts separate from the K1 and K2 underground mine that is beginning to supply the K1 and K2 surface facilities with ore. Esterhazy K3 does not have surface milling and storage facilities, instead it is intended to replace the ore currently mined from the K1 and K2 mine. This shift in production will decrease brine management costs of the K1 and K2 mine, which stood at $108.0 million for 2020. Mosaic is a member of Canpotex, an export association of Canadian potash producers through which they sell their Canadian potash outside the U.S. and Canada. Potash mines are located in: Carlsbad, New Mexico (32.412°N 103.939°W﻿ / 32.412; -103.939) Belle Plaine, Saskatchewan (50.429°N 105.199°W﻿ / 50.429; -105.199) Colonsay, Saskatchewan (51.928°N 105.766°W﻿ / 51.928; -105.766) Esterhazy, Saskatchewan K1 (50.729°N 101.929°W﻿ / 50.729; -101.929) Esterhazy, Saskatchewan K2 (50.660°N 101.846°W﻿ / 50.660; -101.846) Esterhazy, Saskatchewan K3 (50.644°N 101.993°W﻿ / 50.644; -101.993) Phosphate Mosaic has approximately 16.8 million tonnes of operational capacity for finished concentrated phosphates. Mosaic is the largest producer of finished phosphate products with an annual capacity greater than the next two largest producers combined. It has a global distribution network made up of plants, port facilities, warehouses and sales offices. In 2013 Mosaic produced 7.6 million tons of concentrated phosphate crop nutrients and over 15 million tons of phosphate rock production. In October, 2013, Mosaic reached an agreement to purchase the phosphate operations of CF Industries for 1.4 billion dollars, which eliminates the need for Mosaic to spend an additional billion dollars to build a new processing facility in Hardee County, Florida to process the rock from their mines in that area. Phosphate mines are located in the Bone Valley Formation of the Peace River watershed in Central Florida: Fort Meade (27.648°N 81.757°W﻿ / 27.648; -81.757) South Pasture (27.586°N 81.942°W﻿ / 27.586; -81.942) Four Corners (27.715°N 82.141°W﻿ / 27.715; -82.141) Wingate Creek (27.506°N 82.130°W﻿ / 27.506; -82.130) Fort Lonesome (27.715°N 82.150°W﻿ / 27.715; -82.150)(Closed) Mosaic owns a 25% stake of the Ma'aden Wa'ad Al Shamal Phosphate Company joint venture in Saudi Arabia. With the completion of the Vale Fertilizantes acquisition in January, 2018, an additional 5 Brazilian phosphate rock mines, 4 chemical plants and an additional 40% economic interest in the Miski Mayo mine were purchased. Carbon footprint The Mosaic Company reported Total CO2e emissions (Direct + Indirect) for 31 December 2020 at 4,920 Kt (+340/+7.4% y-o-y). Timeline 2023 August: Mosaic Board of Directors elects Bruce Bodine to succeed Joc O'Rourke as Mosaic's CEO effective January 1, 2024. Bruce will serve as Mosaic President and Member of the Board of Directors effective immediately. 2018 January: Mosaic completes acquisition of Vale Fertilizantes. 2015 August: Joc O'Rourke succeeds Jim Prokopanko as Mosaic's president and CEO. 2014 December: Mosaic acquires Archer Daniels Midland Company's (ADM) fertilizer distribution business in Brazil and Paraguay. July: Cargill acquired Mosaic's Hersey, Michigan salt plant. 2013 November: Mosaic closed the potash operations at their Hersey, Michigan facility. 2011 May: Mosaic and Cargill complete the transaction to split off and distribute Cargill's stake in Mosaic. January: Mosaic and Cargill agree to split off and orderly distribute Cargill's stake in Mosaic. 2007 January: Jim Prokopanko succeeds Fritz Corrigan as president and CEO of Mosaic. 2006 July: Jim Prokopanko named Mosaic Chief Operating Officer. 2004 October: The Mosaic Company (NYSE: MOS) begins trading on the New York Stock Exchange. June: Mosaic announced as the chosen name for the newly formed company. January: The crop nutrition business of Cargill, Inc. and IMC Global enter into a definitive agreement to form a new crop nutrition company."
}