{
  "ticker": "MPC",
  "cik": "0001510295",
  "company_name": "Marathon Petroleum",
  "corrected_name": "Marathon Petroleum",
  "wiki_title_used": "Marathon Petroleum",
  "exists": true,
  "raw_text": "Marathon Petroleum Corporation is an American petroleum refining, marketing, and transportation company headquartered in Findlay, Ohio. The company was a wholly owned subsidiary of Marathon Oil until a corporate spin-off in 2011.\n\nMarathon Petroleum traces its origin from a number of small oil companies in Ohio that banded together in 1887. These formed The Ohio Oil Company established in Lima, Ohio. It became the largest oil producer in the state. By 1889, the company was acquired by the Standard Oil Trust and six years later its headquarters was moved to Findlay. In 1906, the company built its first oil pipeline, which connected its facilities in Martinsville, Illinois, and Preble, Indiana.\nAfter the United States Supreme Court ordered its parent company to break up as a result of the Sherman Anti-Trust Act in 1911, Ohio Oil again became independent. It expanded its operations by purchasing oil fields outside of Ohio. The company also started oil refining. In 1924, the company discovered oil in Texas. In the same year, it acquired Lincoln Oil Refining Company. This purchase included a refinery and 17 brand service stations in Indiana. Several years later, Ohio Oil acquired Transcontinental Oil, which included – in addition to refineries, storage facilities, and filling stations – the Marathon product name.\nFollowing its acquisition of Andeavor on October 1, 2018, Marathon Petroleum became the largest petroleum refinery operator in the United States, with 13 refineries and over 3 million barrels per calendar day of refining capacity. Marathon Petroleum ranked No. 41 on the 2018 Fortune 500 list of the largest United States corporations by total revenue. In the 2020 Forbes Global 2000, Marathon Petroleum was ranked as the 138th-largest public company in the world.\nMarathon Petroleum's marketing system includes branded locations across the United States, including Marathon and ARCO branded fuel stations. MPC also owns the general partner and majority limited partner interest in MPLX LP, a midstream company which owns and operates gathering, processing, and fractionation assets, as well as crude oil and light product transportation and logistics infrastructure.\n\nHistory\nMarathon Petroleum Corporation was formed on November 9, 2009, as a subsidiary of Marathon Oil.\n\nPredecessor company\nThe predecessor company of Marathon Petroleum Corporation, Marathon Petroleum Company LLC, formerly known as Marathon Ashland Petroleum LLC, was formed by the merger of the refining operations of Marathon Oil and Ashland Inc. in 1998. The merger brought together several descendants of the Standard Oil trust, as Ashland had acquired several smaller Standard spinoffs while Marathon itself was directly owned by Standard Oil. It also brought Marathon's Speedway and Ashland's SuperAmerica convenience store chains together and were subsequently merged as \"Speedway SuperAmerica\".\nAs longtime Marathon rivals Standard Oil of Ohio and Amoco were acquired by British company BP, Marathon Ashland adopted the marketing slogan \"An American Company Serving America\", with the slogan being adjourned to Marathon fuel pumps. In 2006, it adopted its current slogan, \"Fueling the American Spirit\" as the company shifts emphasis on work ethic and the contributions of its employees.\nIn 2005, Ashland sold its share of Marathon Ashland to Marathon and the company became Marathon Petroleum. The company became a 100% owned subsidiary of Marathon Oil, after Ashland sold off its downstream assets and exited the retail business. In 2006, Marathon began using STP-branded additives in its fuel.\nIn 2009, the company completed a $3.9 billion expansion of its refinery in Garyville, Louisiana, that increased the plant's capacity by 180,000 barrels per day.\nIn 2010, the company sold its 74,000 barrel-per-day refinery in St. Paul Park, Minnesota, along with associated terminals, pipelines, and inventory as well as 166 SuperAmerica convenience stores to Northern Tier Energy for $900 million.\n\nPost-corporate spin-off from Marathon Oil\nOn June 30, 2011, Marathon Oil distributed all of its shares in the company to its shareholders via a corporate spin-off.\nIn June 2012, Wheeling, West Virginia-based Tri-State Petroleum signed a contract to switch 50 stations in Ohio, Pennsylvania, and West Virginia to the Marathon brand. Most of Tri-State's stations before the deal were ExxonMobil-branded fuel stations, the majority Exxon as well as a few scattered Mobil stations in the immediate Wheeling area. Included in the deal were 18 Exxon stations in the Pittsburgh metropolitan area, significantly boosting Marathon's presence in the Pittsburgh market, where former parent company U.S. Steel is based. (Exxon would offset its Pittsburgh losses by taking over the retail contracts of several Shell stations in the area, leaving Shell with a significantly reduced presence, while the Mobil brand was withdrawn from the Northern Panhandle of West Virginia altogether.) Before the deal, Marathon had a much smaller presence in Western Pennsylvania, while having a somewhat larger presence in West Virginia and an almost ubiquitous presence in Southern Ohio.\nIn 2013, Marathon purchased numerous assets from BP including a 451,000 barrel per calendar day refinery in Texas City, Texas, four light product distribution terminals, and retail marketing contracts for 1,200 retail stations throughout the southeastern United States.\nIn 2014, Speedway LLC, a now-former subsidiary of the company, purchased the retail operations of Hess Corporation for $2.82 billion. The deal also introduced the Marathon brand name at stations for the first time in the Northeastern United States east of the Appalachian Mountains and north of Pennsylvania. Prior to the deal, Marathon's traditional marketing territory for decades had been the Midwestern and Southeastern United States, never going further east than the Pittsburgh metropolitan area.\n\nRefinery fires\nGalveston Bay, Texas\nIn 2016, a fire at the Galveston Bay refinery in Texas City, Texas, injured three contract workers, resulting in a lawsuit seeking $1 million in damages. Multiple lawsuits were filed resulting in Marathon paying $86 million to settle.\n\nGaryville, Louisiana\nOn August 25, 2023, a fire at the Garyville refinery, in Garyville, Louisiana, started at 8:04 am local time. After some time, residents and some local schools were evacuated due to the poorer air quality as precaution, but the response was not immediate.\n\n2018 acquisition of Andeavor, sale of Speedway LLC\nOn April 30, 2018, Marathon agreed to buy Andeavor, an independent refinery and oil company based in the Western United States, for $23 billion. Marathon will acquire all of Andeavor's outstanding shares. On October 1, 2018, the merger was completed. This merger brings the SuperAmerica convenience stores back to Speedway. On October 31, 2019, Marathon announced plans to spin off their Speedway convenience stores. Gary Heminger will also retire from his role as  Marathon Chairman and CEO. The deal also had the effect of introducing the Marathon brand name at fuel stations in the Western United States for the first time and making Marathon a national brand name for the first time, as well as giving Marathon ownership of the ARCO brand.\nOn August 2, 2020, Marathon announced that Seven & i Holdings Co., Ltd. would be acquiring Speedway for $21 billion. The deal was anticipated to close in early 2021 pending regulatory approval. The deal closed on May 14, 2021.\n\nOperations\nMarathon owns:\n\n13 refineries with a total crude oil throughput of 3,000,000 barrels per calendar day (bpcd)\n9 Renewable Fuels and Feed Facilities producing 485 million gallons per year\n2 Renewable Fuel Pretreatment Facilities and a Soy Processing Facility\n\nLeasehold or ownership interests in approximately 8,400 miles (13,500 km) of petroleum pipelines and 5,000 miles (8,050 km) of natural gas and natural gas liquids pipelines as well as related transportation and distribution assets such as railcars, barges, and processing terminals.\nA 20.4% interest, including a controlling 2% general partner interest, in MPLX, a public master limited partnership that owns pipelines and other midstream assets related to the transportation and storage of crude oil. NYSE: MPLX\n\nFormer\nFinances\nSee also\nPetroleum refining in the United States\nMarathon Center for Performing Arts\nTesoro Corporation\n\nReferences\nExternal links\n\nOfficial website \nwww.mcpa.org\nBusiness data for Marathon Petroleum Corporation:",
  "clean_text": "Marathon Petroleum Corporation is an American petroleum refining, marketing, and transportation company headquartered in Findlay, Ohio. The company was a wholly owned subsidiary of Marathon Oil until a corporate spin-off in 2011. Marathon Petroleum traces its origin from a number of small oil companies in Ohio that banded together in 1887. These formed The Ohio Oil Company established in Lima, Ohio. It became the largest oil producer in the state. By 1889, the company was acquired by the Standard Oil Trust and six years later its headquarters was moved to Findlay. In 1906, the company built its first oil pipeline, which connected its facilities in Martinsville, Illinois, and Preble, Indiana. After the United States Supreme Court ordered its parent company to break up as a result of the Sherman Anti-Trust Act in 1911, Ohio Oil again became independent. It expanded its operations by purchasing oil fields outside of Ohio. The company also started oil refining. In 1924, the company discovered oil in Texas. In the same year, it acquired Lincoln Oil Refining Company. This purchase included a refinery and 17 brand service stations in Indiana. Several years later, Ohio Oil acquired Transcontinental Oil, which included – in addition to refineries, storage facilities, and filling stations – the Marathon product name. Following its acquisition of Andeavor on October 1, 2018, Marathon Petroleum became the largest petroleum refinery operator in the United States, with 13 refineries and over 3 million barrels per calendar day of refining capacity. Marathon Petroleum ranked No. 41 on the 2018 Fortune 500 list of the largest United States corporations by total revenue. In the 2020 Forbes Global 2000, Marathon Petroleum was ranked as the 138th-largest public company in the world. Marathon Petroleum's marketing system includes branded locations across the United States, including Marathon and ARCO branded fuel stations. MPC also owns the general partner and majority limited partner interest in MPLX LP, a midstream company which owns and operates gathering, processing, and fractionation assets, as well as crude oil and light product transportation and logistics infrastructure. History Marathon Petroleum Corporation was formed on November 9, 2009, as a subsidiary of Marathon Oil. Predecessor company The predecessor company of Marathon Petroleum Corporation, Marathon Petroleum Company LLC, formerly known as Marathon Ashland Petroleum LLC, was formed by the merger of the refining operations of Marathon Oil and Ashland Inc. in 1998. The merger brought together several descendants of the Standard Oil trust, as Ashland had acquired several smaller Standard spinoffs while Marathon itself was directly owned by Standard Oil. It also brought Marathon's Speedway and Ashland's SuperAmerica convenience store chains together and were subsequently merged as \"Speedway SuperAmerica\". As longtime Marathon rivals Standard Oil of Ohio and Amoco were acquired by British company BP, Marathon Ashland adopted the marketing slogan \"An American Company Serving America\", with the slogan being adjourned to Marathon fuel pumps. In 2006, it adopted its current slogan, \"Fueling the American Spirit\" as the company shifts emphasis on work ethic and the contributions of its employees. In 2005, Ashland sold its share of Marathon Ashland to Marathon and the company became Marathon Petroleum. The company became a 100% owned subsidiary of Marathon Oil, after Ashland sold off its downstream assets and exited the retail business. In 2006, Marathon began using STP-branded additives in its fuel. In 2009, the company completed a $3.9 billion expansion of its refinery in Garyville, Louisiana, that increased the plant's capacity by 180,000 barrels per day. In 2010, the company sold its 74,000 barrel-per-day refinery in St. Paul Park, Minnesota, along with associated terminals, pipelines, and inventory as well as 166 SuperAmerica convenience stores to Northern Tier Energy for $900 million. Post-corporate spin-off from Marathon Oil On June 30, 2011, Marathon Oil distributed all of its shares in the company to its shareholders via a corporate spin-off. In June 2012, Wheeling, West Virginia-based Tri-State Petroleum signed a contract to switch 50 stations in Ohio, Pennsylvania, and West Virginia to the Marathon brand. Most of Tri-State's stations before the deal were ExxonMobil-branded fuel stations, the majority Exxon as well as a few scattered Mobil stations in the immediate Wheeling area. Included in the deal were 18 Exxon stations in the Pittsburgh metropolitan area, significantly boosting Marathon's presence in the Pittsburgh market, where former parent company U.S. Steel is based. (Exxon would offset its Pittsburgh losses by taking over the retail contracts of several Shell stations in the area, leaving Shell with a significantly reduced presence, while the Mobil brand was withdrawn from the Northern Panhandle of West Virginia altogether.) Before the deal, Marathon had a much smaller presence in Western Pennsylvania, while having a somewhat larger presence in West Virginia and an almost ubiquitous presence in Southern Ohio. In 2013, Marathon purchased numerous assets from BP including a 451,000 barrel per calendar day refinery in Texas City, Texas, four light product distribution terminals, and retail marketing contracts for 1,200 retail stations throughout the southeastern United States. In 2014, Speedway LLC, a now-former subsidiary of the company, purchased the retail operations of Hess Corporation for $2.82 billion. The deal also introduced the Marathon brand name at stations for the first time in the Northeastern United States east of the Appalachian Mountains and north of Pennsylvania. Prior to the deal, Marathon's traditional marketing territory for decades had been the Midwestern and Southeastern United States, never going further east than the Pittsburgh metropolitan area. Refinery fires Galveston Bay, Texas In 2016, a fire at the Galveston Bay refinery in Texas City, Texas, injured three contract workers, resulting in a lawsuit seeking $1 million in damages. Multiple lawsuits were filed resulting in Marathon paying $86 million to settle. Garyville, Louisiana On August 25, 2023, a fire at the Garyville refinery, in Garyville, Louisiana, started at 8:04 am local time. After some time, residents and some local schools were evacuated due to the poorer air quality as precaution, but the response was not immediate. 2018 acquisition of Andeavor, sale of Speedway LLC On April 30, 2018, Marathon agreed to buy Andeavor, an independent refinery and oil company based in the Western United States, for $23 billion. Marathon will acquire all of Andeavor's outstanding shares. On October 1, 2018, the merger was completed. This merger brings the SuperAmerica convenience stores back to Speedway. On October 31, 2019, Marathon announced plans to spin off their Speedway convenience stores. Gary Heminger will also retire from his role as Marathon Chairman and CEO. The deal also had the effect of introducing the Marathon brand name at fuel stations in the Western United States for the first time and making Marathon a national brand name for the first time, as well as giving Marathon ownership of the ARCO brand. On August 2, 2020, Marathon announced that Seven & i Holdings Co., Ltd. would be acquiring Speedway for $21 billion. The deal was anticipated to close in early 2021 pending regulatory approval. The deal closed on May 14, 2021. Operations Marathon owns: 13 refineries with a total crude oil throughput of 3,000,000 barrels per calendar day (bpcd) 9 Renewable Fuels and Feed Facilities producing 485 million gallons per year 2 Renewable Fuel Pretreatment Facilities and a Soy Processing Facility Leasehold or ownership interests in approximately 8,400 miles (13,500 km) of petroleum pipelines and 5,000 miles (8,050 km) of natural gas and natural gas liquids pipelines as well as related transportation and distribution assets such as railcars, barges, and processing terminals. A 20.4% interest, including a controlling 2% general partner interest, in MPLX, a public master limited partnership that owns pipelines and other midstream assets related to the transportation and storage of crude oil. NYSE: MPLX Former Finances"
}