{
  "ticker": "MPWR",
  "cik": "0001280452",
  "company_name": "Monolithic Power Systems",
  "corrected_name": "Monolithic Power Systems",
  "wiki_title_used": "Monolithic Power Systems",
  "exists": true,
  "raw_text": "Monolithic Power Systems, Inc. is an American, publicly traded company headquartered in Kirkland, Washington. It operates in more than 15 locations worldwide.\nMonolithic Power Systems (MPS) provides power circuits for systems found in cloud computing, telecom infrastructures, automotive, industrial applications and consumer applications.\n\nHistory\nMonolithic Power Systems, Inc. was founded in 1997 by Michael Hsing, who is the current CEO. Prior to the founding of the corporation, Hsing worked as a Senior Silicon Technology Developer at several analog integrated circuit companies.\nThe company then diversified into DC/DC products. In November 2004, Hsing took the company public with an IPO. Since then, the company has grown to incorporate 13 product lines with more than 4,000 products.\nIn February 2021, the company was added to the S&P 500. In 2023, the company made progress on its long-term ESG goals and diversity goals, including the addition of a second female director to its Board of Directors. The company also published its annual ESG report  and launched public commitments to reduce Scope 1 and 2 greenhouse gas emissions by 40% by 2030 and to be powered globally by 75% of Renewable Electricity by 2026.\n\nAbout\nMonolithic Power Systems is headquartered in Kirkland, Washington. The company designs, develops, and markets for communications, storage and computing, consumer electronics, industrial, and automotive markets, in addition to supporting the electrification of transportation. Monolithic Power Systems markets its products through third-party distributors and value-added resellers. It directly markets to original equipment manufacturers, original design manufacturers, and electronic manufacturing service providers in China, Taiwan, Europe, Korea, Southeast Asia, Japan, and the United States.\n\nProducts\nMonolithic Power Systems provides digital, analog, and mixed-signal integrated circuits. It offers energy-efficient DC to DC converter ICs that are used to convert and control voltages of various electronic systems, such as portable electronic devices, wireless LAN access points, computers, set top boxes, displays, automobiles, and medical equipment. The company also provides lighting control ICs for backlighting, which are used in systems that provide the light source for LCD panels in notebook computers, LCD monitors, car navigation systems, and LCD televisions. In addition, Monolithic Power Systems supports the electrification of transportation and manufactures class D Audio Amplifier products.\n\nLocations\nMonolithic Power Systems operates at 18 locations primarily in the US, Europe, and east Asia.\n\nReferences\nExternal links\nOfficial website \n\nBusiness data for Monolithic Power Systems:",
  "clean_text": "Monolithic Power Systems, Inc. is an American, publicly traded company headquartered in Kirkland, Washington. It operates in more than 15 locations worldwide. Monolithic Power Systems (MPS) provides power circuits for systems found in cloud computing, telecom infrastructures, automotive, industrial applications and consumer applications. History Monolithic Power Systems, Inc. was founded in 1997 by Michael Hsing, who is the current CEO. Prior to the founding of the corporation, Hsing worked as a Senior Silicon Technology Developer at several analog integrated circuit companies. The company then diversified into DC/DC products. In November 2004, Hsing took the company public with an IPO. Since then, the company has grown to incorporate 13 product lines with more than 4,000 products. In February 2021, the company was added to the S&P 500. In 2023, the company made progress on its long-term ESG goals and diversity goals, including the addition of a second female director to its Board of Directors. The company also published its annual ESG report and launched public commitments to reduce Scope 1 and 2 greenhouse gas emissions by 40% by 2030 and to be powered globally by 75% of Renewable Electricity by 2026. About Monolithic Power Systems is headquartered in Kirkland, Washington. The company designs, develops, and markets for communications, storage and computing, consumer electronics, industrial, and automotive markets, in addition to supporting the electrification of transportation. Monolithic Power Systems markets its products through third-party distributors and value-added resellers. It directly markets to original equipment manufacturers, original design manufacturers, and electronic manufacturing service providers in China, Taiwan, Europe, Korea, Southeast Asia, Japan, and the United States. Products Monolithic Power Systems provides digital, analog, and mixed-signal integrated circuits. It offers energy-efficient DC to DC converter ICs that are used to convert and control voltages of various electronic systems, such as portable electronic devices, wireless LAN access points, computers, set top boxes, displays, automobiles, and medical equipment. The company also provides lighting control ICs for backlighting, which are used in systems that provide the light source for LCD panels in notebook computers, LCD monitors, car navigation systems, and LCD televisions. In addition, Monolithic Power Systems supports the electrification of transportation and manufactures class D Audio Amplifier products. Locations Monolithic Power Systems operates at 18 locations primarily in the US, Europe, and east Asia."
}