{
  "ticker": "MRK",
  "cik": "0000310158",
  "company_name": "Merck & Co.",
  "corrected_name": "Merck & Co.",
  "wiki_title_used": "Merck & Co.",
  "exists": true,
  "raw_text": "Merck & Co., Inc. is an American multinational pharmaceutical company headquartered in Rahway, New Jersey. The company does business as Merck Sharp & Dohme or MSD outside the United States and Canada. The company is ranked fourth on the list of largest biomedical companies by revenue.\nThe company's revenues are primarily from cancer treatments, vaccines, and animal health products. In 2024, 46% of the company's revenue, or $29.5 billion, came from sales of Keytruda (pembrolizumab), a PD-1 inhibitor used to treat various types of cancers, and 13% of the company's revenue, or $8.6 billion, came from sales of Gardasil, an HPV vaccine. In addition, 9% of the company's revenue, or $5.8 billion, came from the sales of animal health products.\nThe company is ranked 65th on the Fortune 500 and 76th on the Forbes Global 2000.\nIn 1891, Merck & Co. was established as the American affiliate of Merck Group, founded by the Merck family, and the companies are still in trademark disputes in several countries over the right to use the name \"Merck\".\n\nHistory\nRoots and early history\nMerck & Co. traces its origins to its former German parent company Merck Group, which was established by the Merck family in 1668 when Friedrich Jacob Merck purchased a pharmacy in Darmstadt. In 1827, Merck Group evolved from a pharmacy to a drug manufacturer company with the commercial manufacture of morphine. Merck perfected the chemical process of deriving morphine from opium and later introduced cocaine, used to treat sinus problems and to add to beverages to boost energy levels.\nIn 1887 a German-born, long-time Merck employee, Theodore Weicker, went to the United States to represent Merck Group. In 1891, with $200,000 received from E. Merck, Weicker started Merck & Co., with headquarters in lower Manhattan. That year George Merck, the 23-year-old son of the then head of E. Merck (and grandson of the founder) joined Weicker in New York. Merck & Co. operated from 1891 to 1917 as the US subsidiary of the Merck Group.\n\nNationalization\nAfter the U.S. entered World War I, due to its German connections, Merck & Co. was the subject of expropriation under the Trading with the Enemy Act of 1917. The government seized 80 percent of the shares owned by the German parent company and sold it. In 1919, George F. Merck (head of the American branch of the Merck family), in partnership with Goldman Sachs and Lehman Brothers, bought the company back at a U.S. government auction for $3.5 million, but Merck & Co. remained a separate company from its former German parent. Merck & Co. holds the trademark rights to the \"Merck\" name in the United States and Canada, while its former parent company retains the rights in the rest of the world; the right to use the Merck name was the subject of litigation between the two companies in 2016.\nIn 1925, George W. Merck succeeded his father George F. Merck as president. In 1927, the corporation merged with the Powers-Weightman-Rosengarten Company, a Philadelphia quinine manufacturer. George Merck remained president and Frederic Rosengarten became chairman of the board. In 1929, H. K. Mulford Company merged with Sharp and Dohme, Inc. and brought vaccine technology, including immunization of cavalry horses in World War I and delivery of a diphtheria antitoxin to Merck & Co.\nIn 1943, streptomycin was discovered during a Merck-funded research program in Selman Waksman's laboratory at Rutgers University. It became the first effective treatment for tuberculosis. At the time of its discovery, sanatoriums for the isolation of tuberculosis-infected people were a ubiquitous feature of cities in developed countries, with 50% dying within 5 years of admission. Although Merck's agreement with Rutgers gave it exclusive rights to streptomycin, at Waksman's request the company renegotiated the agreement, returning the rights to the university in exchange for a royalty. The university then set up non-exclusive licenses with seven companies to ensure a reliable supply of the antibiotic.\n\n1950–2000\nIn the 1950s, thiazide diuretics were developed by Merck scientists Karl H. Beyer, James M. Sprague, John E. Baer, and Frederick C. Novello and led to the marketing of the first drug of this class, chlorothiazide, under the trade name Diuril in 1958. The research leading to the discovery of chlorothiazide, leading to \"the saving of untold thousands of lives and the alleviation of the suffering of millions of victims of hypertension\" was recognized by a special Public Health Award from the Lasker Foundation in 1975.\nIn 1953, Merck & Co. merged with Philadelphia-based Sharp & Dohme, Inc., becoming the largest U.S. drugmaker. Sharp and Dohme had acquired H. K. Mulford Company in 1929, adding smallpox vaccines to its portfolio. The combined company kept the trade name Merck in the United States and Canada, and as Merck Sharp & Dohme (MSD) outside North America.\nIn 1965, Merck & Co. acquired Charles Frosst Ltd. of Montreal (founded 1899), creating Merck-Frosst Canada, Inc., as its Canadian subsidiary and pharmaceutical research facility. Merck & Co. closed this facility in July 2010 but remerged in 2011 as Merck Canada.\nMaurice Hilleman, a scientist at Merck, developed the first mumps vaccine in 1967, the first rubella vaccine in 1969, and the first trivalent measles, mumps, rubella (MMR vaccine) in 1971. The incidence of rubella-associated birth defects fell from up to 10,000 per year in the U.S. to zero in the aftermath of the rubella vaccine's development. Hilleman also developed the first Hepatitis B vaccine and the first varicella vaccine, for chickenpox.\nThe company was incorporated in New Jersey in 1970. John J. Horan became CEO and Chairman in 1976, serving until 1985. Under his leadership, the company's investment in R&D grew threefold, and Merck became the largest pharmaceutical company in the world.\nIn 1979, Merck scientists developed lovastatin (Mevacor), the first drug of the statin class.\nMerck scientist William C. Campbell and Satoshi Ōmura developed ivermectin for veterinary use in 1981, and later put it to human use against onchocerciasis in 1987–1988 with the name Mectizan; today the compound is also used against lymphatic filariasis, scabies and other parasitic infections.\nIn 1982, the company formed a joint venture, KBI Inc., with AstraZeneca. During the late 1980s and 1990s, the company also established joint ventures with DuPont to access research and development expertise, and with Johnson & Johnson to sell over-the-counter consumer medications.\nIn 1985, Merck received approval for imipenem, the first member of the carbapenem class of antibiotics. Antibiotics of the carbapenem class play an important role in treatment guidelines for certain hospital-acquired and multi-drug resistant infections. P. Roy Vagelos became CEO and Chairman that year, succeeding Horan. Vagelos served until reaching the company's mandatory retirement age in 1994, succeeded by Raymond Gilmartin.\nIn 1991, Merck's Kelco subsidiary was responsible for volatile organic compound (VOC) emission pollution in the San Diego area. In 1996 Merck paid $1.8 million for polluting the air. New machines were installed to reduce smog emissions by 680,000 lb (310,000 kg) a year.\nIn November 1993, Merck & Co. acquired Medco Containment Services for $6 billion. Merck & Co. spun Medco off ten years later.\nMerck's supply chain reduction programme has been referred to as an example of successful change. Merck reduced its number of global suppliers from 40,000 to less than 10,000 during the period from 1992 to 1997.\n\n2001–2019\nIn May 2002, The Bill & Melinda Gates Foundation purchased stock in Merck.\nFrom 2002 through 2005, the Australian affiliate of Merck paid publishing house Elsevier an undisclosed amount to produce eight issues of a medical journal, the Australasian Journal of Bone and Joint Medicine. Although it gave the appearance of being an independent peer-reviewed journal, without any indication that Merck had paid for it, the journal actually reprinted articles that originally appeared in other publications and that were favorable to Merck. The misleading publication came to light in 2009 during a personal injury lawsuit filed over Vioxx; 9 of 29 articles in the journal's second issue referred positively to Vioxx. The CEO of Elsevier's Health Sciences Division, Michael Hansen, admitted that the practice was \"unacceptable\".\nIn 2005, Gilmartin retired as CEO following Merck's voluntary worldwide withdrawal of Vioxx. Gilmartin's tenure was criticized as abandoning Vagelos' commitment to corporate social responsibility. Former president of manufacturing Richard Clark was named CEO and company president.\nIn November 2009, Merck & Co. completed a merger with Schering-Plough in a US$41 billion deal. Although Merck & Co. was in reality acquiring Schering-Plough, the purchase was declared a \"reverse merger\", in which \"Old\" Merck & Co. was renamed Merck Sharp & Dohme, and Schering-Plough renamed as \"Merck & Co., Inc. The maneuver was an attempt avoid a \"change-of-control\" in order to preserve Schering-Plough's rights to market Remicade. A settlement with Johnson & Johnson was reached in 2011, in which Merck agreed to pay $500 million. Merck Sharp & Dohme remains a subsidiary of the Merck & Co. parent.\nRichard Clark retired as CEO and company president in October 2011 and Kenneth Frazier became CEO.\nIn October 2013, Merck announced it would cut 8,500 jobs in an attempt to cut $2.5 billion from its costs by 2015. Combined with 7,500 job cuts announced in 2011 and 2012, the layoffs amounted to 20% of its workforce.\nBy 2014, research performed at Merck has led to U.S. FDA approval of 63 new molecular entities.\nIn August 2014, Merck acquired Idenix Pharmaceuticals for $3.85 billion.\nIn September 2014, the US Food and Drug Administration (FDA) approved Pembrolizumab (MK-3475) as a breakthrough therapy for melanoma treatment. In clinical trials, pembrolizumab provided partial tumor regression in about one quarter of patients, many of whom have not seen further progression of their disease in over 6 months of follow-up.\nIn December 2014, the company acquired Swiss biotechnology company OncoEthix for up to $375 million.\nBetween 2010 and 2015, the company cut around 36,450 jobs. During that time, the company sold its consumer health business to Bayer and narrowed the company's focus to immunology, vaccines, diabetes, emerging markets and medicines used in hospitals, like certain antibiotics.\nIn January 2015, Merck acquired Cubist Pharmaceuticals for $102 per share in cash or about $9.5 billion in total.\nIn July 2015, Merck and Ablynx expanded their 18-month-old immuno-oncology collaboration by four years, generating a potential $4.4 billion in milestone payments for the Abylnx. The company also announced it would spend $95 million up front collaborating with cCAM Biotherapeutics and its early-stage treatment similar to Keytruda. Merck & Co. will bring in CM-24, an antibody designed to block the immune checkpoint CEACAM1.\nIn January 2016, Merck announced two new partnerships; the first with Quartet Medicine and its small molecule pain treatments, the second with Complix investigating intracellular cancer targets, with both collaborations potentially generating up to $595 million and $280 million respectively. Days later the company announced it would acquire IOmet Pharma, with IOmet becoming a wholly owned subsidiary of Merck & Co. The acquisition includes IOmets indoleamine-2,3-dioxygenase 1 (IDO), tryptophan 2,3-dioxygenase (TDO), and dual-acting inhibitors.\nIn July 2016, the company acquired Afferent Pharmaceuticals, developer of a candidate used to block P2RX3 receptors, for approximately $1 billion, plus up to $750 million in milestone payments.\nIn 2017, Merck bought the PARP inhibitor Lynparza from AstraZeneca.\nIn April 2017, Merck Animal Health acquired Vallée S.A., a Brazilian animal health product manufacturer.\nIn September 2017, the company announced it would acquire Rigontec, developer of a candidate to target the retinoic acid-inducible gene I pathway, for $554 million.\nIn October 2017, the company granted the inaugural Merck-AGITG Clinical Research Fellowship in Gastro-Intestinal (GI) Cancer to David Lau, a professional in Melbourne, Australia.\nIn June 2018, Merck acquired Viralytics, an Australian viral cancer drug company, for AUD$502 million.\nIn 2018, Merck began the submission process for a Biologics License Application to the Food and Drug Administration under the Breakthrough Therapy Designation for an investigational vaccine, called V920, to fight the Zaire strain of the Ebola virus.\nIn April 2019, the company acquired Immune Design for approximately $300 million, gaining access to its immunotherapy programs. It also acquired Antelliq Group for $2.4 billion, or $3.7 billion including debt.\nIn May 2019, Merck announced it would acquire Peloton Therapeutics, developer of a HIF-2alpha inhibitor for Von Hippel–Lindau disease-associated renal cell carcinoma, for up to $2.2 billion.\nIn June 2019, Merck announced it would acquire Tilos Therapeutics for up to $773 million.\nIn November 2019, the company acquired Calporta, which focused on Parkinsons and Alzheimers treatments.\nIn December 2019, Merck Animal Health acquired Vaki, an aquaculture company, from Pentair.\n\n2020–present\nIn January 2020, Merck acquired ArQule, developer of ARQ 531, an oral Bruton's tyrosine kinase (BTK) inhibitor, for $2.7 billion.\nIn March 2020, Merck was one of ten companies recognised at the inaugural Manufacturing Awards by New Jersey Business magazine and the New Jersey Business and Industry Association.\nIn June 2020, Merck acquired Themis Bioscience, a company focused on vaccines and immune-modulation therapies for infectious diseases including COVID-19 and cancer.\nAlso in June 2020, Merck Animal Health acquired Quantified Ag, a data and analytics company that monitors cattle body temperature and movement in order to detect illness early.\nIn August 2020, Merck Animal Health acquired IdentiGEN, engaged in DNA-based animal traceability.\nIn September 2020, Merck acquired $1 billion of Seattle Genetics common stock, and agreed to co-develop ladiratuzumab vedotin.\nIn November 2020, Merck announced it would acquire VelosBio for $2.75 billion, developer of VLS-101, an antibody-drug conjugate designed to target Tyrosine kinase-like orphan receptor 1 (ROR1) in both hematological and solid tumors. VLS-101 is currently Phase I and Phase II clinical trials. The company also announced it would acquire OncoImmune for $425 million and its phase 3 candidate, CD24Fc, used in the treatment of patients with severe and critical COVID-19.\nIn February 2021, Merck Animal Health acquired PrognostiX Poultry.\nIn April 2021, Merck acquired Pandion Therapeutics for $1.85 billion, expanding its offering in treating autoimmune diseases.\nIn June 2021, the U.S. government agreed to spend $1.2 billion to purchase 1.7 million doses of Molnupiravir, a Merck product, if it were to be approved by regulators to treat COVID-19. In October 2021, the company said that the drug reduces the risk of hospitalization or death by around 50% for patients with mild or moderate cases of COVID-19 and that it would seek Emergency Use Authorization for the drug.\nIn July 2021, Robert M. Davis became CEO, succeeding Kenneth Frazier, who became executive chairman.\nIn July 2021, Merck completed the corporate spin-off of Organon & Co.\nIn September 2021, Merck announced it would acquire Acceleron Pharma for $11.5 billion, gaining control over Sotatercept, used in the treatment of pulmonary hypertension, and luspatercept-aamt.\nIn September 2022, the company announced it would acquire Vence, a livestock management company for an undisclosed sum, incorporating it within Merck Animal Health.\nIn December 2022, the company announced a licensing deal with Kelun-Biotech of China whereby it would expand its early cancer pipeline with a set of antibody-drug conjugates; this follows an earlier agreement between the two companies to co-develop such drugs.\nIn April 2023, Merck announced it would acquire Prometheus Biosciences Inc for $10.8 billion.\nIn December 2023, Merck announced it had partnered with Owkin to develop artificial intelligence-powered digital pathology diagnostics that could be used to identify patients suitable for immunotherapies. The aim is to come up with tools that can pre-screen patients with four tumour types for the MSI-H biomarker, namely endometrial, gastric, small intestinal, and biliary cancers.\nIn January 2024, the company announced it would acquire Harpoon Therapeutics for $680 million. With this purchase, Merck expands its portfolio of oncological drugs. The main positions are HPN328, an activator of T-cells that is being researched to treat advanced cancer patients associated with DLL3 expression (delta-like ligand 3), an inherent small cell lung cancer (SCLC), neuroendocrine tumors, and several other species. Merck's portfolio will also be complemented by T-cell attractions using the patented Harpoon Tri-specific design for T cell activation (TriTAC). According to engineering protein technology, tumor cells are destroyed by the patient's own immune cells, and the ProTriTAC platform works with the TriTAC platform to develop a therapeutic agent that attracts T-cells, but is inactive until it reaches the tumor.\nIn April 2024, Merck completed the acquisition of Abceutics for $208 million.\nIn July 2024, Merck completed the acquisition of EyeBio for $3 billion.\nIn October 2024, Merck announced the acquisition of Modifi Biosciences for $1.3 billion.\n\nAcquisition history\nProducts\nDetails of Merck's major products are as follows:\n\nOncology\nKeytruda (pembrolizumab) ($29.5 billion in 2024 revenues) is an immune modulator for the treatment of cancer.\nLynparza (olaparib) ($1.3 billion in 2024 revenues) is a PARP inhibitor used to treat BRCA-mutated advanced ovarian cancer.\nLenvima (lenvatinib) ($1.0 billion in 2024 revenues) is used for the treatment of thyroid cancer.\nWelireg (Belzutifan) ($0.5 billion in 2024 revenues) is used for the treatment of von Hippel–Lindau disease-associated renal cell carcinoma.\nReblozyl (Luspatercept) ($0.4 billion in 2024 revenues) is used for the treatment of anemia in beta thalassemia and myelodysplastic syndromes.\n\nVaccines\nGardasil (HPV vaccine) ($8.5 billion in 2024 revenues) is a vaccine against multiple serotypes of human papillomavirus (HPV), which is responsible for most cases of cervical cancer worldwide.\nProQuad/M-M-R II/Varivax ($2.5 billion in 2024 revenues) is a combination MMRV vaccine against measles, mumps, rubella (German measles), and varicella (chickenpox).\nVaxneuvance ($0.8 billion in 2024 revenues) is a pneumococcal conjugate vaccine.\nRotaTeq ($0.7 billion in 2024 revenues) is a rotavirus vaccine.\nPneumovax 23 ($0.3 billion in 2024 revenues) is a pneumococcal polysaccharide vaccine.\n\nHospital acute care\nBridion (sugammadex) ($1.7 billion in 2024 revenues) is a medication for the reversal of neuromuscular blockade induced by rocuronium and vecuronium in general anaesthesia.\nPrevymis (letermovir) ($0.8 billion in 2024 revenues) is used for the treatment of cytomegalovirus infections.\nDificid (fidaxomicin) ($0.3 billion in 2024 revenues) is a tiacumicin.\nZerbaxa (ceftolozane/tazobactam ($0.3 billion in 2024 revenues) is an antibiotic used to treat urinary tract infections.\nNoxafil (posaconazole) ($0.2 billion in 2024 revenues) is a triazole antifungal.\n\nCardiology\nWinrevair (sotatercept) ($0.4 billion in 2024 revenues) is used for the treatment of pulmonary arterial hypertension.\nAdempas/Verquvo (riociguat / vericiguat) ($0.7 billion in 2024 revenues) is used for the treatment of pulmonary hypertension and to reduce the risk of cardiovascular death and hospitalization in certain patients with heart failure after a recent acute decompensation event.\n\nNeuroscience\nBelsomra (suvorexant) ($0.2 billion in 2024 revenues) is an orexin antagonist medication used in the treatment of insomnia.\n\nVirology\nLagevrio (molnupiravir) ($0.9 billion in 2024 revenues) is an antiviral pill to treat COVID-19.\nIsentress (raltegravir) ($0.4 billion in 2024 revenues) is a human immunodeficiency virus integrase inhibitor for the treatment of HIV infection. It is the first anti-HIV compound having this mechanism of action. It is part of one of several first line treatment regimens recommended by the United States Department of Health and Human Services.\nDelstrigo (doravirine/lamivudine/tenofovir) ($0.3 billion in 2024 revenues) is used for the treatment of HIV/AIDS.\n\nImmunology\nSimponi (golimumab) ($0.5 billion in 2024 revenues) is an immunosuppressive drug.\nRemicade (infliximab) ($0.1 billion in 2024 revenues) is a monoclonal antibody directed toward the cytokine TNF-alpha and used for the treatment of a wide range of autoimmune disorders, including rheumatoid arthritis, Crohn's disease, ankylosing spondylitis, plaque psoriasis, and others. Remicade and other TNF-alpha inhibitors exhibit additive therapeutic effects with methotrexate and improve quality of life. Adverse effects include increased risk of infection and certain cancers. Merck had rights to the drug in certain areas, while Janssen Biotech had rights in other areas; in 2017, Merck announced a biosimilar to Remicade, Renflexis.\n\nDiabetes\nJanuvia (sitagliptin) ($1.3 billion in 2024 revenues) is a dipeptidyl peptidase IV inhibitor for the treatment of type 2 diabetes. In 2013, Januvia was the second largest selling diabetes drug worldwide. It has been popular due in part because unlike many other diabetes drugs, it causes little or no weight gain and is not associated with hypoglycemic episodes. There has been some concern that treatment with Januvia and other DPP-IV inhibitors may be associated with a modestly increased risk of pancreatitis.\nJanumet ($1.0 billion in 2024 revenues) is a single pill combination drug containing both Januvia and metformin.\n\nAnimal health\nLivestock products ($3.4 billion in 2024 revenues) include various medications and vaccines for cattle and poultry.\nCompanion animal products ($2.4 billion in 2024 revenues) include various medications and vaccines for cats, dogs, and horses.\n\nPhilanthropy\nPhilanthropic initiatives by Merck include:\n\nMerck Foundation - founded in 1957, the foundation has donated over $1 billion to charitable causes to promote health equity. In 2012, the foundation ended its donations to the Boy Scouts of America citing its discrimination against gay people.\nPatient assistance programs to offer access to pharmaceuticals to those unable to afford its medications.\nProvides funding to Hilleman Laboratories, an India-based non-profit research organization dedicated to the development of low-cost vaccines for use in developing countries.\nMerck for Mothers prevents maternal mortality.\nMerck produces Mectizan (ivermectin), an anti-parasitic medicine traditionally used to treat onchocerciasis, solely for donation to people in Africa, Latin America, and Yemen. The donation program has significantly reduced the incidence of the disease.\n\nLawsuits and controversies\nHeart attacks after use of Vioxx\nIn 1999, the U.S. Food and Drug Administration (FDA) approved Vioxx (known generically as rofecoxib), a Merck product for treating arthritis. Vioxx was designed as a selective inhibitor of the enzyme cyclooxygenase-2. Such compounds were expected to cause less gastrointestinal bleeding than older anti-inflammatory drugs such as naproxen, which were associated with 20,000 hospitalizations and 2000 deaths each year. Vioxx became one of the most prescribed drugs in history.\nThereafter, studies by Merck and by others found an increased risk of heart attack associated with Vioxx use when compared with naproxen. Merck adjusted the labeling of Vioxx to reflect possible cardiovascular risks in 2002.\nOn September 23, 2004, Merck received information about results from a clinical trial it was conducting that included findings of increased risk of heart attacks among Vioxx users who had been using the medication for over eighteen months. On September 28, 2004, Merck notified the FDA that it was voluntarily withdrawing Vioxx from the market, and it publicly announced the withdrawal on September 30. An analysis for the period 1999–2004, based on U.S. Medical Expenditure Survey data, reported that Vioxx was associated with 46,783 heart attacks in the US, and along with the other popular COX-2 inhibitor Celebrex, an estimated 26,603 deaths from both.\nAbout 50,000 people sued Merck, claiming they or their family members had suffered medical problems such as heart attacks or strokes after taking Vioxx. In November 2007, Merck agreed to pay $4.85 billion to settle most of the pending Vioxx lawsuits. The settlement required that claimants provide medical and pharmacy records confirming the occurrence of a heart attack, ischemic stroke, or sudden cardiac death; the receipt of at least 30 Vioxx pills within 60 days prior to the injury or death; and confirmation of Vioxx being used within 14 days of the Vioxx-related event. The settlement was generally viewed by industry analysts and investors as a victory for Merck, considering that original estimates of Merck's liability reached between $10 billion and $25 billion. As of mid-2008, when the plaintiff class had reached the threshold percentage required by Merck to go through with the settlement, plaintiffs had prevailed in only three of the twenty cases that had reached juries, all with relatively small awards.\nMerck has refused to consider compensation for Vioxx victims and their families outside the US. This is particularly true in the UK where there are at least 400 victims and the legal protection afforded to the victims and their families is particularly weak.\nAccording to internal e-mail traffic released at a later lawsuit, Merck had a list of doctors critical of Vioxx to be \"neutralized\" or \"discredited\". \"We may need to seek them out and destroy them where they live,\" wrote an employee. A Stanford Medical School professor said that Merck was engaged in intimidation of researchers and infringement upon academic freedom.\nOn May 20, 2008, Merck settled for $58 million with 30 states alleging that Merck engaged in deceptive marketing tactics to promote Vioxx. All its new television pain-advertisements must be vetted by the Food and Drug Administration and changed or delayed upon request until 2018.\n\nOsteonecrosis of the jaw after use of Fosamax\nFosamax (alendronate) is a bisphosphonate used for the treatment of post-menopausal osteoporosis and for the prevention of skeletal problems in certain cancers. The American College of Clinical Endocrinology, the American College of Obstetricians and Gynecologists, the North American Menopause Society and the UK National Osteoporosis Guideline Group recommend alendronate and certain other bisphosphonates as first line treatments for post-menopausal osteopotosis. Long-term treatment with bisphosponates produces anti-fracture and bone mineral density effects that persist for 3–5 years after an initial 3–5 years of treatment. Alendronate reduces the risk of hip, vertebral, and wrist fractures by 35-39%.\nIn December 2013, Merck agreed to pay a total of $27.7 million to 1,200 plaintiffs in a class action lawsuit alleging that the company's osteoporosis drug had caused them to develop osteonecrosis of the jaw. Prior to the settlement, Merck had prevailed in 3 of 5 so-called bellwether trials. Approximately 4,000 cases still await adjudication or settlement as of August 2014.\nThere have also been thousands of lawsuits alleging that Fosamax increased the risk of thigh-bone fractures. In March 2022, Merck defeated approximately 500 lawsuits over Fosamax in New Jersey when U.S. District Judge Freda L. Wolfson ruled that the plaintiffs' lawsuit was preempted by federal law. On September 20, 2024, the United States Court of Appeals for the Third Circuit overturned that decision, holding that federal law did not block plaintiffs' state law claims against Merck over Fosamax. As of June 30, 2024, about 3,115 lawsuits over Fosamax were still pending against Merck in both federal and state courts in the United States.\n\nMedicaid overbilling\nA fraud investigation by the United States Department of Justice began in 2000 when allegations were brought in two separate lawsuits filed by whistleblowers under the False Claims Act. They alleged that Merck failed to pay proper rebates to Medicaid and other health care programs and paid illegal remuneration to health care providers. On February 7, 2008, Merck agreed to pay more than $650 million to settle charges that it routinely overbilled Medicaid for its most popular medicines. The settlement was one of the largest pharmaceutical settlements in history. The federal government received more than $360 million, plus 49 states and Washington, DC, received over $290 million. One whistleblower received a $68 million reward. Merck made the settlement without an admission of liability or wrongdoing.\n\n\"Merck\" name legal dispute\nIn 191 of 193 countries, the original Merck company, the Merck Group of Darmstadt, owns the rights to the \"Merck\" name. In the United States and Canada, the company trades under the name EMD (an abbreviation of Emanuel Merck, Darmstadt), its legal name here says Merck KGaA, Darmstadt, Germany, and instead of \"Merck Group\", the \"EMD Group\" name is used. In the United States and Canada, Merck & Co. holds the rights to the trademark \"Merck\", while in the rest of the world the company trades under the name MSD (an abbreviation of Merck, Sharp & Dohme) and its legal name says here Merck Sharp & Dohme LLC., a subsidiary of Merck & Co., Inc. Kenilworth, NJ, USA.\nIn 2015 the Merck Group adopted a new logo and said it will be \"much more aggressive\" about protecting the brand of \"the real Merck\". Merck of Darmstadt has initiated litigation against its former subsidiary, Merck & Co. (MSD) of Kenilworth, in several countries over infringing use of the Merck name. In 2016, the High Court of Justice in the United Kingdom ruled that MSD had breached an agreement with its former parent company and that only Merck of Darmstadt is entitled to use the Merck name in the United Kingdom. The judge also held that MSD's use of \"Merck\" as part of branding on its global websites were directed to the UK and infringed Merck's trade mark rights in the UK.\nIn response to the ruling, MSD initiated counter-litigation in the United States in January 2016 by filing a federal lawsuit which accused its former parent company of \"infringing on its trademark\" through actions that included the increased usage of \"Merck KGaA\" and \"MERCK\" in branding in the US as well as on its social media presence. Further Merck & Co. has also accused the Merck Group of federal trademark dilution, unfair competition, false advertising, deceptive trade practices, breach of contract, and cybersquatting. The case came to a head when a research scientist believed he was communicating with Merck & Co regarding a research grant in oncology, when in fact he was talking with the Merck Group. As a result, Merck & Co. asked the federal court to stop the Merck Group from using \"Merck\" on any products or marketing materials in the United States. As a direct result, Merck & Co is seeking \"all monetary gains, profits, and advantages\" made by the Merck Group and three-times the damage, plus additional punitive damages.\nIn April 2020, in the course of litigation of Merck against MSD in Switzerland, the Federal Supreme Court of Switzerland ruled that MSD's use of the \"Merck\" brand in its global websites could, absent geotargeting mechanisms, have \"commercial effect\" in Switzerland and could therefore violate Merck's rights (if any) to the \"Merck\" brand in Switzerland.\n\nTax implications of transaction accounting\nIn February 2007, Merck paid $2.3 billion to the Internal Revenue Service to settle a tax dispute over the accounting treatment of transactions between 1993 and 2001.\n\nSexual dysfunction and suicidal thoughts associated with Propecia\nIn 2021, an investigation by Reuters revealed that Merck's baldness drug Propecia caused persistent sexual dysfunction in men. The drug has been linked to over 700 incidences of suicidal thoughts and 110 deaths. Merck has been receiving reports since 1998, but never included the risks on the label. In 2015, Merck was sued by consumer-rights law firm Hagens Berman over a wrongful death linked to Propecia.\n\nUse of methylene chloride\nMerck & Co. once used methylene chloride, an animal carcinogen on the United States Environmental Protection Agency's list of pollutants, as a solvent in some of its manufacturing processes. Merck chemists and engineers subsequently replaced the compound with others having fewer negative environmental effects. Merck has also modified its equipment to protect the environment, installing a distributed control system that coordinates chemical reactions more efficiently and expedites manufacturing by 50 percent, eliminating the need for the disposal and storage of harmful waste. Biological oxygen demand has also been reduced. In 2011, Merck paid a $1.5 million civil penalty to settle alleged violations of federal environmental laws at its pharmaceutical manufacturing facilities in Riverside, Pennsylvania and West Point, Pennsylvania.\n\nPolitics\nThe company spends approximately $10 million per year on lobbying in the United States. Political contributions have mostly been to individuals and organizations associated with the Democratic Party. The company is a member of many industry advocacy groups and sponsors many industry events.\n\nNotable publications\nMerck & Co. publishes The Merck Manuals, a series of medical reference books for physicians, nurses, technicians, and veterinarians. These include the Merck Manual of Diagnosis and Therapy, the world's best-selling medical reference. The Merck Index, a compendium of chemical compounds, was published by Merck & Co. until it was acquired by the Royal Society of Chemistry in 2012.\n\nReferences\nExternal links\n\nOfficial website\nMerck & Co. on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nBusiness data for Merck & Co.:",
  "clean_text": "Merck & Co., Inc. is an American multinational pharmaceutical company headquartered in Rahway, New Jersey. The company does business as Merck Sharp & Dohme or MSD outside the United States and Canada. The company is ranked fourth on the list of largest biomedical companies by revenue. The company's revenues are primarily from cancer treatments, vaccines, and animal health products. In 2024, 46% of the company's revenue, or $29.5 billion, came from sales of Keytruda (pembrolizumab), a PD-1 inhibitor used to treat various types of cancers, and 13% of the company's revenue, or $8.6 billion, came from sales of Gardasil, an HPV vaccine. In addition, 9% of the company's revenue, or $5.8 billion, came from the sales of animal health products. The company is ranked 65th on the Fortune 500 and 76th on the Forbes Global 2000. In 1891, Merck & Co. was established as the American affiliate of Merck Group, founded by the Merck family, and the companies are still in trademark disputes in several countries over the right to use the name \"Merck\". History Roots and early history Merck & Co. traces its origins to its former German parent company Merck Group, which was established by the Merck family in 1668 when Friedrich Jacob Merck purchased a pharmacy in Darmstadt. In 1827, Merck Group evolved from a pharmacy to a drug manufacturer company with the commercial manufacture of morphine. Merck perfected the chemical process of deriving morphine from opium and later introduced cocaine, used to treat sinus problems and to add to beverages to boost energy levels. In 1887 a German-born, long-time Merck employee, Theodore Weicker, went to the United States to represent Merck Group. In 1891, with $200,000 received from E. Merck, Weicker started Merck & Co., with headquarters in lower Manhattan. That year George Merck, the 23-year-old son of the then head of E. Merck (and grandson of the founder) joined Weicker in New York. Merck & Co. operated from 1891 to 1917 as the US subsidiary of the Merck Group. Nationalization After the U.S. entered World War I, due to its German connections, Merck & Co. was the subject of expropriation under the Trading with the Enemy Act of 1917. The government seized 80 percent of the shares owned by the German parent company and sold it. In 1919, George F. Merck (head of the American branch of the Merck family), in partnership with Goldman Sachs and Lehman Brothers, bought the company back at a U.S. government auction for $3.5 million, but Merck & Co. remained a separate company from its former German parent. Merck & Co. holds the trademark rights to the \"Merck\" name in the United States and Canada, while its former parent company retains the rights in the rest of the world; the right to use the Merck name was the subject of litigation between the two companies in 2016. In 1925, George W. Merck succeeded his father George F. Merck as president. In 1927, the corporation merged with the Powers-Weightman-Rosengarten Company, a Philadelphia quinine manufacturer. George Merck remained president and Frederic Rosengarten became chairman of the board. In 1929, H. K. Mulford Company merged with Sharp and Dohme, Inc. and brought vaccine technology, including immunization of cavalry horses in World War I and delivery of a diphtheria antitoxin to Merck & Co. In 1943, streptomycin was discovered during a Merck-funded research program in Selman Waksman's laboratory at Rutgers University. It became the first effective treatment for tuberculosis. At the time of its discovery, sanatoriums for the isolation of tuberculosis-infected people were a ubiquitous feature of cities in developed countries, with 50% dying within 5 years of admission. Although Merck's agreement with Rutgers gave it exclusive rights to streptomycin, at Waksman's request the company renegotiated the agreement, returning the rights to the university in exchange for a royalty. The university then set up non-exclusive licenses with seven companies to ensure a reliable supply of the antibiotic. 1950–2000 In the 1950s, thiazide diuretics were developed by Merck scientists Karl H. Beyer, James M. Sprague, John E. Baer, and Frederick C. Novello and led to the marketing of the first drug of this class, chlorothiazide, under the trade name Diuril in 1958. The research leading to the discovery of chlorothiazide, leading to \"the saving of untold thousands of lives and the alleviation of the suffering of millions of victims of hypertension\" was recognized by a special Public Health Award from the Lasker Foundation in 1975. In 1953, Merck & Co. merged with Philadelphia-based Sharp & Dohme, Inc., becoming the largest U.S. drugmaker. Sharp and Dohme had acquired H. K. Mulford Company in 1929, adding smallpox vaccines to its portfolio. The combined company kept the trade name Merck in the United States and Canada, and as Merck Sharp & Dohme (MSD) outside North America. In 1965, Merck & Co. acquired Charles Frosst Ltd. of Montreal (founded 1899), creating Merck-Frosst Canada, Inc., as its Canadian subsidiary and pharmaceutical research facility. Merck & Co. closed this facility in July 2010 but remerged in 2011 as Merck Canada. Maurice Hilleman, a scientist at Merck, developed the first mumps vaccine in 1967, the first rubella vaccine in 1969, and the first trivalent measles, mumps, rubella (MMR vaccine) in 1971. The incidence of rubella-associated birth defects fell from up to 10,000 per year in the U.S. to zero in the aftermath of the rubella vaccine's development. Hilleman also developed the first Hepatitis B vaccine and the first varicella vaccine, for chickenpox. The company was incorporated in New Jersey in 1970. John J. Horan became CEO and Chairman in 1976, serving until 1985. Under his leadership, the company's investment in R&D grew threefold, and Merck became the largest pharmaceutical company in the world. In 1979, Merck scientists developed lovastatin (Mevacor), the first drug of the statin class. Merck scientist William C. Campbell and Satoshi Ōmura developed ivermectin for veterinary use in 1981, and later put it to human use against onchocerciasis in 1987–1988 with the name Mectizan; today the compound is also used against lymphatic filariasis, scabies and other parasitic infections. In 1982, the company formed a joint venture, KBI Inc., with AstraZeneca. During the late 1980s and 1990s, the company also established joint ventures with DuPont to access research and development expertise, and with Johnson & Johnson to sell over-the-counter consumer medications. In 1985, Merck received approval for imipenem, the first member of the carbapenem class of antibiotics. Antibiotics of the carbapenem class play an important role in treatment guidelines for certain hospital-acquired and multi-drug resistant infections. P. Roy Vagelos became CEO and Chairman that year, succeeding Horan. Vagelos served until reaching the company's mandatory retirement age in 1994, succeeded by Raymond Gilmartin. In 1991, Merck's Kelco subsidiary was responsible for volatile organic compound (VOC) emission pollution in the San Diego area. In 1996 Merck paid $1.8 million for polluting the air. New machines were installed to reduce smog emissions by 680,000 lb (310,000 kg) a year. In November 1993, Merck & Co. acquired Medco Containment Services for $6 billion. Merck & Co. spun Medco off ten years later. Merck's supply chain reduction programme has been referred to as an example of successful change. Merck reduced its number of global suppliers from 40,000 to less than 10,000 during the period from 1992 to 1997. 2001–2019 In May 2002, The Bill & Melinda Gates Foundation purchased stock in Merck. From 2002 through 2005, the Australian affiliate of Merck paid publishing house Elsevier an undisclosed amount to produce eight issues of a medical journal, the Australasian Journal of Bone and Joint Medicine. Although it gave the appearance of being an independent peer-reviewed journal, without any indication that Merck had paid for it, the journal actually reprinted articles that originally appeared in other publications and that were favorable to Merck. The misleading publication came to light in 2009 during a personal injury lawsuit filed over Vioxx; 9 of 29 articles in the journal's second issue referred positively to Vioxx. The CEO of Elsevier's Health Sciences Division, Michael Hansen, admitted that the practice was \"unacceptable\". In 2005, Gilmartin retired as CEO following Merck's voluntary worldwide withdrawal of Vioxx. Gilmartin's tenure was criticized as abandoning Vagelos' commitment to corporate social responsibility. Former president of manufacturing Richard Clark was named CEO and company president. In November 2009, Merck & Co. completed a merger with Schering-Plough in a US$41 billion deal. Although Merck & Co. was in reality acquiring Schering-Plough, the purchase was declared a \"reverse merger\", in which \"Old\" Merck & Co. was renamed Merck Sharp & Dohme, and Schering-Plough renamed as \"Merck & Co., Inc. The maneuver was an attempt avoid a \"change-of-control\" in order to preserve Schering-Plough's rights to market Remicade. A settlement with Johnson & Johnson was reached in 2011, in which Merck agreed to pay $500 million. Merck Sharp & Dohme remains a subsidiary of the Merck & Co. parent. Richard Clark retired as CEO and company president in October 2011 and Kenneth Frazier became CEO. In October 2013, Merck announced it would cut 8,500 jobs in an attempt to cut $2.5 billion from its costs by 2015. Combined with 7,500 job cuts announced in 2011 and 2012, the layoffs amounted to 20% of its workforce. By 2014, research performed at Merck has led to U.S. FDA approval of 63 new molecular entities. In August 2014, Merck acquired Idenix Pharmaceuticals for $3.85 billion. In September 2014, the US Food and Drug Administration (FDA) approved Pembrolizumab (MK-3475) as a breakthrough therapy for melanoma treatment. In clinical trials, pembrolizumab provided partial tumor regression in about one quarter of patients, many of whom have not seen further progression of their disease in over 6 months of follow-up. In December 2014, the company acquired Swiss biotechnology company OncoEthix for up to $375 million. Between 2010 and 2015, the company cut around 36,450 jobs. During that time, the company sold its consumer health business to Bayer and narrowed the company's focus to immunology, vaccines, diabetes, emerging markets and medicines used in hospitals, like certain antibiotics. In January 2015, Merck acquired Cubist Pharmaceuticals for $102 per share in cash or about $9.5 billion in total. In July 2015, Merck and Ablynx expanded their 18-month-old immuno-oncology collaboration by four years, generating a potential $4.4 billion in milestone payments for the Abylnx. The company also announced it would spend $95 million up front collaborating with cCAM Biotherapeutics and its early-stage treatment similar to Keytruda. Merck & Co. will bring in CM-24, an antibody designed to block the immune checkpoint CEACAM1. In January 2016, Merck announced two new partnerships; the first with Quartet Medicine and its small molecule pain treatments, the second with Complix investigating intracellular cancer targets, with both collaborations potentially generating up to $595 million and $280 million respectively. Days later the company announced it would acquire IOmet Pharma, with IOmet becoming a wholly owned subsidiary of Merck & Co. The acquisition includes IOmets indoleamine-2,3-dioxygenase 1 (IDO), tryptophan 2,3-dioxygenase (TDO), and dual-acting inhibitors. In July 2016, the company acquired Afferent Pharmaceuticals, developer of a candidate used to block P2RX3 receptors, for approximately $1 billion, plus up to $750 million in milestone payments. In 2017, Merck bought the PARP inhibitor Lynparza from AstraZeneca. In April 2017, Merck Animal Health acquired Vallée S.A., a Brazilian animal health product manufacturer. In September 2017, the company announced it would acquire Rigontec, developer of a candidate to target the retinoic acid-inducible gene I pathway, for $554 million. In October 2017, the company granted the inaugural Merck-AGITG Clinical Research Fellowship in Gastro-Intestinal (GI) Cancer to David Lau, a professional in Melbourne, Australia. In June 2018, Merck acquired Viralytics, an Australian viral cancer drug company, for AUD$502 million. In 2018, Merck began the submission process for a Biologics License Application to the Food and Drug Administration under the Breakthrough Therapy Designation for an investigational vaccine, called V920, to fight the Zaire strain of the Ebola virus. In April 2019, the company acquired Immune Design for approximately $300 million, gaining access to its immunotherapy programs. It also acquired Antelliq Group for $2.4 billion, or $3.7 billion including debt. In May 2019, Merck announced it would acquire Peloton Therapeutics, developer of a HIF-2alpha inhibitor for Von Hippel–Lindau disease-associated renal cell carcinoma, for up to $2.2 billion. In June 2019, Merck announced it would acquire Tilos Therapeutics for up to $773 million. In November 2019, the company acquired Calporta, which focused on Parkinsons and Alzheimers treatments. In December 2019, Merck Animal Health acquired Vaki, an aquaculture company, from Pentair. 2020–present In January 2020, Merck acquired ArQule, developer of ARQ 531, an oral Bruton's tyrosine kinase (BTK) inhibitor, for $2.7 billion. In March 2020, Merck was one of ten companies recognised at the inaugural Manufacturing Awards by New Jersey Business magazine and the New Jersey Business and Industry Association. In June 2020, Merck acquired Themis Bioscience, a company focused on vaccines and immune-modulation therapies for infectious diseases including COVID-19 and cancer. Also in June 2020, Merck Animal Health acquired Quantified Ag, a data and analytics company that monitors cattle body temperature and movement in order to detect illness early. In August 2020, Merck Animal Health acquired IdentiGEN, engaged in DNA-based animal traceability. In September 2020, Merck acquired $1 billion of Seattle Genetics common stock, and agreed to co-develop ladiratuzumab vedotin. In November 2020, Merck announced it would acquire VelosBio for $2.75 billion, developer of VLS-101, an antibody-drug conjugate designed to target Tyrosine kinase-like orphan receptor 1 (ROR1) in both hematological and solid tumors. VLS-101 is currently Phase I and Phase II clinical trials. The company also announced it would acquire OncoImmune for $425 million and its phase 3 candidate, CD24Fc, used in the treatment of patients with severe and critical COVID-19. In February 2021, Merck Animal Health acquired PrognostiX Poultry. In April 2021, Merck acquired Pandion Therapeutics for $1.85 billion, expanding its offering in treating autoimmune diseases. In June 2021, the U.S. government agreed to spend $1.2 billion to purchase 1.7 million doses of Molnupiravir, a Merck product, if it were to be approved by regulators to treat COVID-19. In October 2021, the company said that the drug reduces the risk of hospitalization or death by around 50% for patients with mild or moderate cases of COVID-19 and that it would seek Emergency Use Authorization for the drug. In July 2021, Robert M. Davis became CEO, succeeding Kenneth Frazier, who became executive chairman. In July 2021, Merck completed the corporate spin-off of Organon & Co. In September 2021, Merck announced it would acquire Acceleron Pharma for $11.5 billion, gaining control over Sotatercept, used in the treatment of pulmonary hypertension, and luspatercept-aamt. In September 2022, the company announced it would acquire Vence, a livestock management company for an undisclosed sum, incorporating it within Merck Animal Health. In December 2022, the company announced a licensing deal with Kelun-Biotech of China whereby it would expand its early cancer pipeline with a set of antibody-drug conjugates; this follows an earlier agreement between the two companies to co-develop such drugs. In April 2023, Merck announced it would acquire Prometheus Biosciences Inc for $10.8 billion. In December 2023, Merck announced it had partnered with Owkin to develop artificial intelligence-powered digital pathology diagnostics that could be used to identify patients suitable for immunotherapies. The aim is to come up with tools that can pre-screen patients with four tumour types for the MSI-H biomarker, namely endometrial, gastric, small intestinal, and biliary cancers. In January 2024, the company announced it would acquire Harpoon Therapeutics for $680 million. With this purchase, Merck expands its portfolio of oncological drugs. The main positions are HPN328, an activator of T-cells that is being researched to treat advanced cancer patients associated with DLL3 expression (delta-like ligand 3), an inherent small cell lung cancer (SCLC), neuroendocrine tumors, and several other species. Merck's portfolio will also be complemented by T-cell attractions using the patented Harpoon Tri-specific design for T cell activation (TriTAC). According to engineering protein technology, tumor cells are destroyed by the patient's own immune cells, and the ProTriTAC platform works with the TriTAC platform to develop a therapeutic agent that attracts T-cells, but is inactive until it reaches the tumor. In April 2024, Merck completed the acquisition of Abceutics for $208 million. In July 2024, Merck completed the acquisition of EyeBio for $3 billion. In October 2024, Merck announced the acquisition of Modifi Biosciences for $1.3 billion. Acquisition history Products Details of Merck's major products are as follows: Oncology Keytruda (pembrolizumab) ($29.5 billion in 2024 revenues) is an immune modulator for the treatment of cancer. Lynparza (olaparib) ($1.3 billion in 2024 revenues) is a PARP inhibitor used to treat BRCA-mutated advanced ovarian cancer. Lenvima (lenvatinib) ($1.0 billion in 2024 revenues) is used for the treatment of thyroid cancer. Welireg (Belzutifan) ($0.5 billion in 2024 revenues) is used for the treatment of von Hippel–Lindau disease-associated renal cell carcinoma. Reblozyl (Luspatercept) ($0.4 billion in 2024 revenues) is used for the treatment of anemia in beta thalassemia and myelodysplastic syndromes. Vaccines Gardasil (HPV vaccine) ($8.5 billion in 2024 revenues) is a vaccine against multiple serotypes of human papillomavirus (HPV), which is responsible for most cases of cervical cancer worldwide. ProQuad/M-M-R II/Varivax ($2.5 billion in 2024 revenues) is a combination MMRV vaccine against measles, mumps, rubella (German measles), and varicella (chickenpox). Vaxneuvance ($0.8 billion in 2024 revenues) is a pneumococcal conjugate vaccine. RotaTeq ($0.7 billion in 2024 revenues) is a rotavirus vaccine. Pneumovax 23 ($0.3 billion in 2024 revenues) is a pneumococcal polysaccharide vaccine. Hospital acute care Bridion (sugammadex) ($1.7 billion in 2024 revenues) is a medication for the reversal of neuromuscular blockade induced by rocuronium and vecuronium in general anaesthesia. Prevymis (letermovir) ($0.8 billion in 2024 revenues) is used for the treatment of cytomegalovirus infections. Dificid (fidaxomicin) ($0.3 billion in 2024 revenues) is a tiacumicin. Zerbaxa (ceftolozane/tazobactam ($0.3 billion in 2024 revenues) is an antibiotic used to treat urinary tract infections. Noxafil (posaconazole) ($0.2 billion in 2024 revenues) is a triazole antifungal. Cardiology Winrevair (sotatercept) ($0.4 billion in 2024 revenues) is used for the treatment of pulmonary arterial hypertension. Adempas/Verquvo (riociguat / vericiguat) ($0.7 billion in 2024 revenues) is used for the treatment of pulmonary hypertension and to reduce the risk of cardiovascular death and hospitalization in certain patients with heart failure after a recent acute decompensation event. Neuroscience Belsomra (suvorexant) ($0.2 billion in 2024 revenues) is an orexin antagonist medication used in the treatment of insomnia. Virology Lagevrio (molnupiravir) ($0.9 billion in 2024 revenues) is an antiviral pill to treat COVID-19. Isentress (raltegravir) ($0.4 billion in 2024 revenues) is a human immunodeficiency virus integrase inhibitor for the treatment of HIV infection. It is the first anti-HIV compound having this mechanism of action. It is part of one of several first line treatment regimens recommended by the United States Department of Health and Human Services. Delstrigo (doravirine/lamivudine/tenofovir) ($0.3 billion in 2024 revenues) is used for the treatment of HIV/AIDS. Immunology Simponi (golimumab) ($0.5 billion in 2024 revenues) is an immunosuppressive drug. Remicade (infliximab) ($0.1 billion in 2024 revenues) is a monoclonal antibody directed toward the cytokine TNF-alpha and used for the treatment of a wide range of autoimmune disorders, including rheumatoid arthritis, Crohn's disease, ankylosing spondylitis, plaque psoriasis, and others. Remicade and other TNF-alpha inhibitors exhibit additive therapeutic effects with methotrexate and improve quality of life. Adverse effects include increased risk of infection and certain cancers. Merck had rights to the drug in certain areas, while Janssen Biotech had rights in other areas; in 2017, Merck announced a biosimilar to Remicade, Renflexis. Diabetes Januvia (sitagliptin) ($1.3 billion in 2024 revenues) is a dipeptidyl peptidase IV inhibitor for the treatment of type 2 diabetes. In 2013, Januvia was the second largest selling diabetes drug worldwide. It has been popular due in part because unlike many other diabetes drugs, it causes little or no weight gain and is not associated with hypoglycemic episodes. There has been some concern that treatment with Januvia and other DPP-IV inhibitors may be associated with a modestly increased risk of pancreatitis. Janumet ($1.0 billion in 2024 revenues) is a single pill combination drug containing both Januvia and metformin. Animal health Livestock products ($3.4 billion in 2024 revenues) include various medications and vaccines for cattle and poultry. Companion animal products ($2.4 billion in 2024 revenues) include various medications and vaccines for cats, dogs, and horses. Philanthropy Philanthropic initiatives by Merck include: Merck Foundation - founded in 1957, the foundation has donated over $1 billion to charitable causes to promote health equity. In 2012, the foundation ended its donations to the Boy Scouts of America citing its discrimination against gay people. Patient assistance programs to offer access to pharmaceuticals to those unable to afford its medications. Provides funding to Hilleman Laboratories, an India-based non-profit research organization dedicated to the development of low-cost vaccines for use in developing countries. Merck for Mothers prevents maternal mortality. Merck produces Mectizan (ivermectin), an anti-parasitic medicine traditionally used to treat onchocerciasis, solely for donation to people in Africa, Latin America, and Yemen. The donation program has significantly reduced the incidence of the disease. Lawsuits and controversies Heart attacks after use of Vioxx In 1999, the U.S. Food and Drug Administration (FDA) approved Vioxx (known generically as rofecoxib), a Merck product for treating arthritis. Vioxx was designed as a selective inhibitor of the enzyme cyclooxygenase-2. Such compounds were expected to cause less gastrointestinal bleeding than older anti-inflammatory drugs such as naproxen, which were associated with 20,000 hospitalizations and 2000 deaths each year. Vioxx became one of the most prescribed drugs in history. Thereafter, studies by Merck and by others found an increased risk of heart attack associated with Vioxx use when compared with naproxen. Merck adjusted the labeling of Vioxx to reflect possible cardiovascular risks in 2002. On September 23, 2004, Merck received information about results from a clinical trial it was conducting that included findings of increased risk of heart attacks among Vioxx users who had been using the medication for over eighteen months. On September 28, 2004, Merck notified the FDA that it was voluntarily withdrawing Vioxx from the market, and it publicly announced the withdrawal on September 30. An analysis for the period 1999–2004, based on U.S. Medical Expenditure Survey data, reported that Vioxx was associated with 46,783 heart attacks in the US, and along with the other popular COX-2 inhibitor Celebrex, an estimated 26,603 deaths from both. About 50,000 people sued Merck, claiming they or their family members had suffered medical problems such as heart attacks or strokes after taking Vioxx. In November 2007, Merck agreed to pay $4.85 billion to settle most of the pending Vioxx lawsuits. The settlement required that claimants provide medical and pharmacy records confirming the occurrence of a heart attack, ischemic stroke, or sudden cardiac death; the receipt of at least 30 Vioxx pills within 60 days prior to the injury or death; and confirmation of Vioxx being used within 14 days of the Vioxx-related event. The settlement was generally viewed by industry analysts and investors as a victory for Merck, considering that original estimates of Merck's liability reached between $10 billion and $25 billion. As of mid-2008, when the plaintiff class had reached the threshold percentage required by Merck to go through with the settlement, plaintiffs had prevailed in only three of the twenty cases that had reached juries, all with relatively small awards. Merck has refused to consider compensation for Vioxx victims and their families outside the US. This is particularly true in the UK where there are at least 400 victims and the legal protection afforded to the victims and their families is particularly weak. According to internal e-mail traffic released at a later lawsuit, Merck had a list of doctors critical of Vioxx to be \"neutralized\" or \"discredited\". \"We may need to seek them out and destroy them where they live,\" wrote an employee. A Stanford Medical School professor said that Merck was engaged in intimidation of researchers and infringement upon academic freedom. On May 20, 2008, Merck settled for $58 million with 30 states alleging that Merck engaged in deceptive marketing tactics to promote Vioxx. All its new television pain-advertisements must be vetted by the Food and Drug Administration and changed or delayed upon request until 2018. Osteonecrosis of the jaw after use of Fosamax Fosamax (alendronate) is a bisphosphonate used for the treatment of post-menopausal osteoporosis and for the prevention of skeletal problems in certain cancers. The American College of Clinical Endocrinology, the American College of Obstetricians and Gynecologists, the North American Menopause Society and the UK National Osteoporosis Guideline Group recommend alendronate and certain other bisphosphonates as first line treatments for post-menopausal osteopotosis. Long-term treatment with bisphosponates produces anti-fracture and bone mineral density effects that persist for 3–5 years after an initial 3–5 years of treatment. Alendronate reduces the risk of hip, vertebral, and wrist fractures by 35-39%. In December 2013, Merck agreed to pay a total of $27.7 million to 1,200 plaintiffs in a class action lawsuit alleging that the company's osteoporosis drug had caused them to develop osteonecrosis of the jaw. Prior to the settlement, Merck had prevailed in 3 of 5 so-called bellwether trials. Approximately 4,000 cases still await adjudication or settlement as of August 2014. There have also been thousands of lawsuits alleging that Fosamax increased the risk of thigh-bone fractures. In March 2022, Merck defeated approximately 500 lawsuits over Fosamax in New Jersey when U.S. District Judge Freda L. Wolfson ruled that the plaintiffs' lawsuit was preempted by federal law. On September 20, 2024, the United States Court of Appeals for the Third Circuit overturned that decision, holding that federal law did not block plaintiffs' state law claims against Merck over Fosamax. As of June 30, 2024, about 3,115 lawsuits over Fosamax were still pending against Merck in both federal and state courts in the United States. Medicaid overbilling A fraud investigation by the United States Department of Justice began in 2000 when allegations were brought in two separate lawsuits filed by whistleblowers under the False Claims Act. They alleged that Merck failed to pay proper rebates to Medicaid and other health care programs and paid illegal remuneration to health care providers. On February 7, 2008, Merck agreed to pay more than $650 million to settle charges that it routinely overbilled Medicaid for its most popular medicines. The settlement was one of the largest pharmaceutical settlements in history. The federal government received more than $360 million, plus 49 states and Washington, DC, received over $290 million. One whistleblower received a $68 million reward. Merck made the settlement without an admission of liability or wrongdoing. \"Merck\" name legal dispute In 191 of 193 countries, the original Merck company, the Merck Group of Darmstadt, owns the rights to the \"Merck\" name. In the United States and Canada, the company trades under the name EMD (an abbreviation of Emanuel Merck, Darmstadt), its legal name here says Merck KGaA, Darmstadt, Germany, and instead of \"Merck Group\", the \"EMD Group\" name is used. In the United States and Canada, Merck & Co. holds the rights to the trademark \"Merck\", while in the rest of the world the company trades under the name MSD (an abbreviation of Merck, Sharp & Dohme) and its legal name says here Merck Sharp & Dohme LLC., a subsidiary of Merck & Co., Inc. Kenilworth, NJ, USA. In 2015 the Merck Group adopted a new logo and said it will be \"much more aggressive\" about protecting the brand of \"the real Merck\". Merck of Darmstadt has initiated litigation against its former subsidiary, Merck & Co. (MSD) of Kenilworth, in several countries over infringing use of the Merck name. In 2016, the High Court of Justice in the United Kingdom ruled that MSD had breached an agreement with its former parent company and that only Merck of Darmstadt is entitled to use the Merck name in the United Kingdom. The judge also held that MSD's use of \"Merck\" as part of branding on its global websites were directed to the UK and infringed Merck's trade mark rights in the UK. In response to the ruling, MSD initiated counter-litigation in the United States in January 2016 by filing a federal lawsuit which accused its former parent company of \"infringing on its trademark\" through actions that included the increased usage of \"Merck KGaA\" and \"MERCK\" in branding in the US as well as on its social media presence. Further Merck & Co. has also accused the Merck Group of federal trademark dilution, unfair competition, false advertising, deceptive trade practices, breach of contract, and cybersquatting. The case came to a head when a research scientist believed he was communicating with Merck & Co regarding a research grant in oncology, when in fact he was talking with the Merck Group. As a result, Merck & Co. asked the federal court to stop the Merck Group from using \"Merck\" on any products or marketing materials in the United States. As a direct result, Merck & Co is seeking \"all monetary gains, profits, and advantages\" made by the Merck Group and three-times the damage, plus additional punitive damages. In April 2020, in the course of litigation of Merck against MSD in Switzerland, the Federal Supreme Court of Switzerland ruled that MSD's use of the \"Merck\" brand in its global websites could, absent geotargeting mechanisms, have \"commercial effect\" in Switzerland and could therefore violate Merck's rights (if any) to the \"Merck\" brand in Switzerland. Tax implications of transaction accounting In February 2007, Merck paid $2.3 billion to the Internal Revenue Service to settle a tax dispute over the accounting treatment of transactions between 1993 and 2001. Sexual dysfunction and suicidal thoughts associated with Propecia In 2021, an investigation by Reuters revealed that Merck's baldness drug Propecia caused persistent sexual dysfunction in men. The drug has been linked to over 700 incidences of suicidal thoughts and 110 deaths. Merck has been receiving reports since 1998, but never included the risks on the label. In 2015, Merck was sued by consumer-rights law firm Hagens Berman over a wrongful death linked to Propecia. Use of methylene chloride Merck & Co. once used methylene chloride, an animal carcinogen on the United States Environmental Protection Agency's list of pollutants, as a solvent in some of its manufacturing processes. Merck chemists and engineers subsequently replaced the compound with others having fewer negative environmental effects. Merck has also modified its equipment to protect the environment, installing a distributed control system that coordinates chemical reactions more efficiently and expedites manufacturing by 50 percent, eliminating the need for the disposal and storage of harmful waste. Biological oxygen demand has also been reduced. In 2011, Merck paid a $1.5 million civil penalty to settle alleged violations of federal environmental laws at its pharmaceutical manufacturing facilities in Riverside, Pennsylvania and West Point, Pennsylvania. Politics The company spends approximately $10 million per year on lobbying in the United States. Political contributions have mostly been to individuals and organizations associated with the Democratic Party. The company is a member of many industry advocacy groups and sponsors many industry events. Notable publications Merck & Co. publishes The Merck Manuals, a series of medical reference books for physicians, nurses, technicians, and veterinarians. These include the Merck Manual of Diagnosis and Therapy, the world's best-selling medical reference. The Merck Index, a compendium of chemical compounds, was published by Merck & Co. until it was acquired by the Royal Society of Chemistry in 2012."
}