{
  "ticker": "MRNA",
  "cik": "0001682852",
  "company_name": "Moderna",
  "corrected_name": "Moderna",
  "wiki_title_used": "Moderna",
  "exists": true,
  "raw_text": "Moderna, Inc. ( mə-DUR-nə) is an American pharmaceutical and biotechnology company based in Cambridge, Massachusetts, that focuses on RNA therapeutics, primarily mRNA vaccines. These vaccines use a copy of a molecule called messenger RNA (mRNA) to carry instructions for proteins to produce an immune response. The company's name is derived from the  terms \"modified\", \"RNA\", and \"modern\".\nThe company's commercial products are the Moderna COVID-19 vaccine, marketed as Spikevax and a respiratory syncytial virus vaccine, marketed as Mresvia. The company has 44 treatment and vaccine candidates, of which 37 have entered clinical trials. Candidates include possible vaccines for influenza, HIV, Epstein–Barr virus, the Nipah virus, chikungunya, human metapneumovirus, varicella zoster virus, as well as a cytomegalovirus vaccine, a Zika virus vaccine funded by the Biomedical Advanced Research and Development Authority, and three cancer vaccines.\n\nHistory\nModerna was founded in 2010 by Derrick Rossi, Timothy A. Springer, Kenneth R. Chien, Robert S. Langer, and Noubar Afeyan. Stéphane Bancel, the current CEO, was appointed as CEO in 2011. Between 2011 and 2017, Moderna raised $2 billion in venture capital funding. In 2024, Bancel also led marketing for the company during a transition.\n\nProduct development\nIn 2013, the company formed a partnership with AstraZeneca to develop treatments for cardiovascular, metabolic, and renal diseases, as well as cancer. Moderna was also awarded a $25 million grant by DARPA through a program Autonomous Diagnostics to Enable Prevention and Therapeutics: Prophylactic Options to Environmental and Contagious Threats (ADEPT-PROTECT). Its stated goal was to develop an mRNA vaccine with the capability to suppress a global pandemic within 60 days. In January 2014, the company entered an agreement with Alexion Pharmaceuticals to develop treatments against ten diseases. In January 2014, Moderna created its first venture, Onkaido Therapeutics, to focus \"exclusively on developing mRNA-based oncology treatments.\" It launched its second venture, Valera, in January 2015, with a focus on \"viral, bacterial and parasitic infectious diseases.\" Employees of Valera and Moderna developed an mRNA vaccine candidate against Zika virus infection. Another venture, Elpidera, was announced in May 2015 to continue work on RNA therapies advancing Moderna's work with Alexion.\nIn 2015, the company formed a partnership with Merck & Co. to develop treatments for cancer, and in 2016 the company formed a partnership with Vertex Pharmaceuticals to develop treatments for cystic fibrosis. In January 2016, the Bill & Melinda Gates Foundation committed to provide at least $20 million in grant funding to the company. In 2017, Alexion terminated its partnership with Moderna after safety issues prevented their work from reaching human trials. \nIn July 2018, the company opened a 200,000 square foot facility in Norwood, Massachusetts for manufacturing, preclinical and clinical work. In December 2018, Moderna became a public company via the largest initial public offering of a biotechnology company in history, raising $621 million by selling 27 million shares at $23 per share.\nThe first mRNA vaccine developed by Moderna was for influenza in 2015, and its first antibody encoded by mRNA was in 2019. In 2023, Moderna acquired OriCiro Genomics, a Japanese manufacturer of genetic engineering tools, in its first acquisition.\nIn early 2023, the company in collaboration with Merck won breakthrough status from the FDA for its mRNA-4157/V940 drug candidate, a cancer vaccine.\nIn July 2023, the company entered into an agreement with the Chinese government to develop mRNA drugs for exclusive use in China.\nIn May 2024, Mresvia, a mRNA respiratory syncytial virus vaccine, was approved for medical use in the United States by the Food and Drug Administration (FDA) for the prevention of lower respiratory tract disease caused by respiratory syncytial virus in individuals 60 years of age and older, the third respiratory syncytial virus vaccine approved in the United States.\n\nCOVID-19 vaccine\nFrom 2020 to 2021, Moderna received $955 million from Operation Warp Speed to accelerate development of its COVID-19 vaccine, with $4.9 billion committed in total for producing 300 million vaccine doses.\nIn March 2020, the Food and Drug Administration approved clinical trials for the Moderna COVID‑19 vaccine candidate, and in December, the vaccine, mRNA-1273, was issued an emergency use authorization in the United States. In 2022, it gained FDA approval both for the monovalent vaccine, Spikevax, and a bivalent booster.\nIn April 2022, Moderna announced plans to build a $180 million vaccine factory in Montreal, forming a 10-year partnership with the Government of Canada, Quebec, and McGill University to produce 100 million Spikevax doses annually and expand vaccine research capabilities. The plant is scheduled to supply COVID-19 vaccines in the fall of 2025.\nIn February 2023, the company agreed to pay $400 million to the National Institutes of Health, Dartmouth College, and Scripps Research to settle a dispute over the rights to a chemical technique that was used in the vaccine.\n\nLegal disputes\nArbutus Biopharma filed a patent infringement lawsuit against Moderna in 2022, alleging that Arbutus developed lipid nanoparticles that enclose Modern'a vaccine's mRNA payload. In April 2023, a court affirmed a decision to cancel a patent by Arbutus Biopharma in connection with the dispute. In April 2024, however, the court issued an order that strengthened Arbutus's arguments by interpreting patents at issue in the manner Arbutus had urged.\nSeveral legal cases between Moderna and Pfizer and BioNTech in various countries, alleging that the Pfizer–BioNTech COVID-19 vaccine violates the patent on Moderna's mRNA vaccine technology, are ongoing.\nIn November 2024, British pharmaceutical company GSK plc filed a lawsuit against Moderna Inc. in a U.S. federal court in Delaware, seeking unspecified royalties alleging that the Moderna COVID-19 vaccine and RSV vaccine mResvia infringe on GSK's patents related to messenger RNA (mRNA) technology. According to the complaint, Moderna's use of lipid nanoparticles—crucial for delivering fragile mRNA into the human body—violates several GSK patents covering similar delivery innovations. This lawsuit follows a similar legal action GSK brought against Pfizer and BioNTech earlier in 2024, claiming patent infringement over their mRNA-based COVID-19 vaccine.\n\nFinancial data\nSee also\nDNA vaccine\nCureVac\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Moderna, Inc.:",
  "clean_text": "Moderna, Inc. ( mə-DUR-nə) is an American pharmaceutical and biotechnology company based in Cambridge, Massachusetts, that focuses on RNA therapeutics, primarily mRNA vaccines. These vaccines use a copy of a molecule called messenger RNA (mRNA) to carry instructions for proteins to produce an immune response. The company's name is derived from the terms \"modified\", \"RNA\", and \"modern\". The company's commercial products are the Moderna COVID-19 vaccine, marketed as Spikevax and a respiratory syncytial virus vaccine, marketed as Mresvia. The company has 44 treatment and vaccine candidates, of which 37 have entered clinical trials. Candidates include possible vaccines for influenza, HIV, Epstein–Barr virus, the Nipah virus, chikungunya, human metapneumovirus, varicella zoster virus, as well as a cytomegalovirus vaccine, a Zika virus vaccine funded by the Biomedical Advanced Research and Development Authority, and three cancer vaccines. History Moderna was founded in 2010 by Derrick Rossi, Timothy A. Springer, Kenneth R. Chien, Robert S. Langer, and Noubar Afeyan. Stéphane Bancel, the current CEO, was appointed as CEO in 2011. Between 2011 and 2017, Moderna raised $2 billion in venture capital funding. In 2024, Bancel also led marketing for the company during a transition. Product development In 2013, the company formed a partnership with AstraZeneca to develop treatments for cardiovascular, metabolic, and renal diseases, as well as cancer. Moderna was also awarded a $25 million grant by DARPA through a program Autonomous Diagnostics to Enable Prevention and Therapeutics: Prophylactic Options to Environmental and Contagious Threats (ADEPT-PROTECT). Its stated goal was to develop an mRNA vaccine with the capability to suppress a global pandemic within 60 days. In January 2014, the company entered an agreement with Alexion Pharmaceuticals to develop treatments against ten diseases. In January 2014, Moderna created its first venture, Onkaido Therapeutics, to focus \"exclusively on developing mRNA-based oncology treatments.\" It launched its second venture, Valera, in January 2015, with a focus on \"viral, bacterial and parasitic infectious diseases.\" Employees of Valera and Moderna developed an mRNA vaccine candidate against Zika virus infection. Another venture, Elpidera, was announced in May 2015 to continue work on RNA therapies advancing Moderna's work with Alexion. In 2015, the company formed a partnership with Merck & Co. to develop treatments for cancer, and in 2016 the company formed a partnership with Vertex Pharmaceuticals to develop treatments for cystic fibrosis. In January 2016, the Bill & Melinda Gates Foundation committed to provide at least $20 million in grant funding to the company. In 2017, Alexion terminated its partnership with Moderna after safety issues prevented their work from reaching human trials. In July 2018, the company opened a 200,000 square foot facility in Norwood, Massachusetts for manufacturing, preclinical and clinical work. In December 2018, Moderna became a public company via the largest initial public offering of a biotechnology company in history, raising $621 million by selling 27 million shares at $23 per share. The first mRNA vaccine developed by Moderna was for influenza in 2015, and its first antibody encoded by mRNA was in 2019. In 2023, Moderna acquired OriCiro Genomics, a Japanese manufacturer of genetic engineering tools, in its first acquisition. In early 2023, the company in collaboration with Merck won breakthrough status from the FDA for its mRNA-4157/V940 drug candidate, a cancer vaccine. In July 2023, the company entered into an agreement with the Chinese government to develop mRNA drugs for exclusive use in China. In May 2024, Mresvia, a mRNA respiratory syncytial virus vaccine, was approved for medical use in the United States by the Food and Drug Administration (FDA) for the prevention of lower respiratory tract disease caused by respiratory syncytial virus in individuals 60 years of age and older, the third respiratory syncytial virus vaccine approved in the United States. COVID-19 vaccine From 2020 to 2021, Moderna received $955 million from Operation Warp Speed to accelerate development of its COVID-19 vaccine, with $4.9 billion committed in total for producing 300 million vaccine doses. In March 2020, the Food and Drug Administration approved clinical trials for the Moderna COVID‑19 vaccine candidate, and in December, the vaccine, mRNA-1273, was issued an emergency use authorization in the United States. In 2022, it gained FDA approval both for the monovalent vaccine, Spikevax, and a bivalent booster. In April 2022, Moderna announced plans to build a $180 million vaccine factory in Montreal, forming a 10-year partnership with the Government of Canada, Quebec, and McGill University to produce 100 million Spikevax doses annually and expand vaccine research capabilities. The plant is scheduled to supply COVID-19 vaccines in the fall of 2025. In February 2023, the company agreed to pay $400 million to the National Institutes of Health, Dartmouth College, and Scripps Research to settle a dispute over the rights to a chemical technique that was used in the vaccine. Legal disputes Arbutus Biopharma filed a patent infringement lawsuit against Moderna in 2022, alleging that Arbutus developed lipid nanoparticles that enclose Modern'a vaccine's mRNA payload. In April 2023, a court affirmed a decision to cancel a patent by Arbutus Biopharma in connection with the dispute. In April 2024, however, the court issued an order that strengthened Arbutus's arguments by interpreting patents at issue in the manner Arbutus had urged. Several legal cases between Moderna and Pfizer and BioNTech in various countries, alleging that the Pfizer–BioNTech COVID-19 vaccine violates the patent on Moderna's mRNA vaccine technology, are ongoing. In November 2024, British pharmaceutical company GSK plc filed a lawsuit against Moderna Inc. in a U.S. federal court in Delaware, seeking unspecified royalties alleging that the Moderna COVID-19 vaccine and RSV vaccine mResvia infringe on GSK's patents related to messenger RNA (mRNA) technology. According to the complaint, Moderna's use of lipid nanoparticles—crucial for delivering fragile mRNA into the human body—violates several GSK patents covering similar delivery innovations. This lawsuit follows a similar legal action GSK brought against Pfizer and BioNTech earlier in 2024, claiming patent infringement over their mRNA-based COVID-19 vaccine. Financial data"
}