{
  "ticker": "MSCI",
  "cik": "0001408198",
  "company_name": "MSCI Inc.",
  "corrected_name": "MSCI Inc.",
  "wiki_title_used": "MSCI Inc.",
  "exists": true,
  "raw_text": "MSCI Inc. (formerly Morgan Stanley Capital International) is an American finance company headquartered in New York City. MSCI is a global provider of equity, fixed income, real estate indices, multi-asset portfolio analysis tools, ESG and climate finance products. It operates the MSCI World, MSCI Emerging Markets, and MSCI All Country World (ACWI) indices, among others.\nThe company is headquartered at 7 World Trade Center in Manhattan. Its business primarily consists of licensing its indices to index funds, such as exchange-traded funds (ETFs), which pay a fee of around 0.02 to 0.04 percent of the invested volume for the use of the index. As of 2025, funds worth over 16.5 trillion US$ were based on MSCI indices.\n\nHistory\nIn 1968, Capital International published indices covering the global stock market for non-U.S. markets. In 1986, Morgan Stanley licensed the rights to the indices from Capital International and branded the indices as the Morgan Stanley Capital International (MSCI) indices. By the 1980s, the MSCI indices were the primary benchmark indices outside of the U.S. before being joined by FTSE, Citibank, and Standard & Poor's. After Dow Jones started float weighting its index funds, MSCI followed. In 2004, MSCI acquired Barra, Inc., to form MSCI Barra. In mid-2007, parent company Morgan Stanley decided to divest MSCI. This was followed by an initial public offering of a minority of stock in November 2007. The divestment was completed in 2009. The company is headquartered in New York City.\nSome companies in MSCI's peer group include Glass Lewis, Factset, Sovereign Wealth Fund Institute, and S&P.\n\nAcquisitions\nIn 2010, MSCI acquired RiskMetrics Group, Inc. and Measurisk.\nIn 2012, MSCI acquired Investment Property Databank.\nIn 2013, MSCI acquired Investor Force from ICG Group (formerly Internet Capital Group).\nIn August 2014, MSCI acquired GMI Ratings.\nIn October 2019, MSCI acquired Carbon Delta, a Zurich-based climate change analytics company.\nIn September 2021, MSCI acquired Real Capital Analytics.\nIn August 2023, MSCI completed the acquisition of New Jersey–based private assets data provider, Burgiss Group for $697 million.\n\nCollaborations\nIn October 2021, MSCI and Cboe Global Markets signed a licensing agreement that would see MSCI grow its options product suite and allow them to work on other projects as well.\nIn April 2022, MSCI entered into a collaboration with MarketAxess to incorporate MSCI's environmental, social, and governance (ESG) data and MarketAxess' pricing and liquidity indicators into fixed income indices in order to construct portfolios based on this data.\n\nIndices\nThe MSCI global equity indices have been calculated since 1969 and include MSCI World and MSCI EAFE. Initially, the company used eight factors in developing its indices: momentum, volatility, value, size, growth, size nonlinearity, liquidity, and financial leverage.\n\nInclusion of Chinese A-shares\nIn 2018 MSCI began including Chinese A-shares in its MSCI Emerging Markets Index. Initially the domestic Chinese companies received a 5% weighting in the index. MSCI is the last major index provider to include the companies, but some investors have questioned the risk as many Chinese listed companies refuse to permit the Public Company Accounting Oversight Board to inspect their financial records. The action of including Chinese stocks into MSCI EM Index also received criticism and questions from Senator Marco Rubio and some others regarding the U.S. national security.\nIn February 2019, The Wall Street Journal reported the decision was the result of pressure from the Chinese government according to people familiar with the matter. The New York Times reported that \"The Chinese government long sought MSCI inclusion because it could help establish Shanghai and Shenzhen as global financial centers.\" MSCI chief executive and chairman Henry Fernandez stated there was \"zero politics\" behind the decision. In March 2019, CNBC reported that MSCI have a future plan of inclusion based on market capitalization of mainland Chinese shares in its global benchmarks, which will eventually lead to ca. 40% weights of its global emerging markets index.\nIn April 2020, it was reported that Donald Trump was considering an executive action to prohibit the Thrift Savings Plan from transferring $50 billion to mirror the MSCI All Country World Index fund. In December 2020, MSCI announced that it would strip its indices of seven Chinese companies in response to Executive Order 13959.\nAlthough the A share full inclusion plan was noted by investors years ago, full inclusion had not been realized as of 2021.\nIn November 2022, a study by Sheffield Hallam University and Hong Kong Watch identified three major stock indices provided by MSCI that include at least 13 companies allegedly involved in forced labor and mass surveillance of Uyghurs.\nIn August 2023, the United States House Select Committee on Strategic Competition between the United States and the Chinese Communist Party announced an investigation into MSCI's investments in China. The committee concluded that MSCI channeled $3.7 billion into blacklisted entities in 2023.\n\nSee also\nMSCI Hong Kong Index\nMSCI KLD 400 Social Index\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for MSCI Inc.:",
  "clean_text": "MSCI Inc. (formerly Morgan Stanley Capital International) is an American finance company headquartered in New York City. MSCI is a global provider of equity, fixed income, real estate indices, multi-asset portfolio analysis tools, ESG and climate finance products. It operates the MSCI World, MSCI Emerging Markets, and MSCI All Country World (ACWI) indices, among others. The company is headquartered at 7 World Trade Center in Manhattan. Its business primarily consists of licensing its indices to index funds, such as exchange-traded funds (ETFs), which pay a fee of around 0.02 to 0.04 percent of the invested volume for the use of the index. As of 2025, funds worth over 16.5 trillion US$ were based on MSCI indices. History In 1968, Capital International published indices covering the global stock market for non-U.S. markets. In 1986, Morgan Stanley licensed the rights to the indices from Capital International and branded the indices as the Morgan Stanley Capital International (MSCI) indices. By the 1980s, the MSCI indices were the primary benchmark indices outside of the U.S. before being joined by FTSE, Citibank, and Standard & Poor's. After Dow Jones started float weighting its index funds, MSCI followed. In 2004, MSCI acquired Barra, Inc., to form MSCI Barra. In mid-2007, parent company Morgan Stanley decided to divest MSCI. This was followed by an initial public offering of a minority of stock in November 2007. The divestment was completed in 2009. The company is headquartered in New York City. Some companies in MSCI's peer group include Glass Lewis, Factset, Sovereign Wealth Fund Institute, and S&P. Acquisitions In 2010, MSCI acquired RiskMetrics Group, Inc. and Measurisk. In 2012, MSCI acquired Investment Property Databank. In 2013, MSCI acquired Investor Force from ICG Group (formerly Internet Capital Group). In August 2014, MSCI acquired GMI Ratings. In October 2019, MSCI acquired Carbon Delta, a Zurich-based climate change analytics company. In September 2021, MSCI acquired Real Capital Analytics. In August 2023, MSCI completed the acquisition of New Jersey–based private assets data provider, Burgiss Group for $697 million. Collaborations In October 2021, MSCI and Cboe Global Markets signed a licensing agreement that would see MSCI grow its options product suite and allow them to work on other projects as well. In April 2022, MSCI entered into a collaboration with MarketAxess to incorporate MSCI's environmental, social, and governance (ESG) data and MarketAxess' pricing and liquidity indicators into fixed income indices in order to construct portfolios based on this data. Indices The MSCI global equity indices have been calculated since 1969 and include MSCI World and MSCI EAFE. Initially, the company used eight factors in developing its indices: momentum, volatility, value, size, growth, size nonlinearity, liquidity, and financial leverage. Inclusion of Chinese A-shares In 2018 MSCI began including Chinese A-shares in its MSCI Emerging Markets Index. Initially the domestic Chinese companies received a 5% weighting in the index. MSCI is the last major index provider to include the companies, but some investors have questioned the risk as many Chinese listed companies refuse to permit the Public Company Accounting Oversight Board to inspect their financial records. The action of including Chinese stocks into MSCI EM Index also received criticism and questions from Senator Marco Rubio and some others regarding the U.S. national security. In February 2019, The Wall Street Journal reported the decision was the result of pressure from the Chinese government according to people familiar with the matter. The New York Times reported that \"The Chinese government long sought MSCI inclusion because it could help establish Shanghai and Shenzhen as global financial centers.\" MSCI chief executive and chairman Henry Fernandez stated there was \"zero politics\" behind the decision. In March 2019, CNBC reported that MSCI have a future plan of inclusion based on market capitalization of mainland Chinese shares in its global benchmarks, which will eventually lead to ca. 40% weights of its global emerging markets index. In April 2020, it was reported that Donald Trump was considering an executive action to prohibit the Thrift Savings Plan from transferring $50 billion to mirror the MSCI All Country World Index fund. In December 2020, MSCI announced that it would strip its indices of seven Chinese companies in response to Executive Order 13959. Although the A share full inclusion plan was noted by investors years ago, full inclusion had not been realized as of 2021. In November 2022, a study by Sheffield Hallam University and Hong Kong Watch identified three major stock indices provided by MSCI that include at least 13 companies allegedly involved in forced labor and mass surveillance of Uyghurs. In August 2023, the United States House Select Committee on Strategic Competition between the United States and the Chinese Communist Party announced an investigation into MSCI's investments in China. The committee concluded that MSCI channeled $3.7 billion into blacklisted entities in 2023."
}