{
  "ticker": "MTB",
  "cik": "0000036270",
  "company_name": "M&T Bank",
  "corrected_name": "M&T Bank",
  "wiki_title_used": "M&T Bank",
  "exists": true,
  "raw_text": "M&T Bank Corporation (Manufacturers and Traders Trust Company) is an American bank holding company headquartered in Buffalo, New York. It operates 950+ branches in 12 states and Washington D.C. across the Eastern United States, from Maine to Virginia. Until May 1998, the bank's holding company was named First Empire State Corporation.\nM&T Bank has been profitable in every quarter since 1976. Other than Northern Trust, M&T was the only bank in the S&P 500 not to lower its dividend during the 2008 financial crisis.\nThe bank owns the Buffalo Savings Bank building in downtown Buffalo, Bridgeport Center in Bridgeport, Connecticut, and the M&T Tech Hub in the Seneca One Tower. It also sponsors M&T Bank Stadium, home of the Baltimore Ravens, as well as M&T Bank Auditorium and M&T Bank Atrium of the University at Buffalo. M&T Bank is the official bank of the Buffalo Bills in Western New York and of their home Highmark Stadium in Orchard Park. Wilmington Trust is a subsidiary of M&T Bank Corporation, offering global corporate and institutional services, private banking, investment management, and fiduciary services.\n\nHistory\n19th century\nIn the mid-19th century, few banking options existed for the growing number of manufacturers in the city of Buffalo. As a result, businessmen Pascal Pratt and Bronson Rumsey founded M&T Bank in 1856 as \"Manufacturers and Traders Trust Company\". Henry Martin, former president of the Attica and Buffalo Railroad, was appointed the first president and assigned a salary of $1,000 a year. The company opened its first office on August 29 of that year at 2 East Swan Street in Buffalo. In 1885, Martin retired as president, at the age of 83, and was succeeded by Pascal Pratt, who had served as Vice President since the bank was formed.\n\n20th century\nIn 1901, the bank built a new headquarters on a site purchased for $210,000 near the southwest corner of Main and Swan Streets in Buffalo. The granite neo-classical building was designed by architect E. B. Green of Green & Wicks. By 1914, Robert Livingston Fryer was the bank's President. In 1917, Harry T. Ramsdell, the bank's fourth president, served as a district chairman for a special subscription committee of the national Liberty Loan program.\nFollowing the 1925 merger with Fidelity Trust, the $100 million company was headed by Fidelity's President, 36-year-old Lewis G. Harriman. Harriman and a group of investors including A. H. Schoellkopf, from the founding family of the Niagara Mohawk power company, and James V. Forrestal, who would become the first U.S. Secretary of Defense, own enough shares to control both Fidelity and M&T.\nIn 1961, M&T acquired an entire block on Main Street between North Division and Eagle Streets in downtown Buffalo and began plans for a $12 million skyscraper to become the bank's new headquarters. In 1963, architect Minoru Yamasaki, who was featured on the cover of Time magazine that year as he was designing the World Trade Center in New York City, was retained by M&T to design its new building in Buffalo, which was completed in 1967. In 1964, Charles W. Millard succeeded Harriman as chairman of M&T.\nIn 1969, M&T's stockholders voted to create a multi-bank holding company known as First Empire State Corporation. In 1983, the bank which had assets of $2 billion and operated 60 offices, named Robert G. Wilmers as chairman and CEO, a position he held until his death in December 2017. In 1995, First Empire formed a national bank subsidiary, M&T Bank, N.A.\n\n21st century\nIn 2008, M&T received a $600 million investment by the United States Treasury as a result of the Troubled Asset Relief Program (TARP) and M&T assumed another $482 million in TARP obligations from its acquisitions. In 2012, the bank repaid $700 million of TARP funds.\nIn June 2014, a U.S. District Judge ordered M&T Bank to forfeit $560,000 that had been laundered through its Perry Hall, Maryland, branch; from 2011 to 2013, Deanna Bailey went to the branch and had head teller Sabrina Fitts convert cash amounts from $20,000 to $100,000 into larger bills. Fitts accepted a 1% transaction fee in exchange for not filing a currency transaction report. This violated the Bank Secrecy Act of 1970.\nOn December 16, 2017, non-executive chairman Robert T. Brady became acting chairman and CEO. On December 20, 2017, René F. Jones was appointed chairman and CEO.\nIn 2021, M&T Bank contributed $33.9 million to over 3,000 nonprofit organizations across eight states and the District of Columbia. The bank has donated more than $279.4 million to nonprofits over the past decade, and over $437.5 million to nonprofits over the past two decades.\nIn May 2022, M&T announced a $25 million initiative to support lower-income communities and underrepresented groups. The new Amplify Fund will be deployed over three years with most of the funds set to be distributed to Connecticut-based organizations and other north-eastern states where People’s United had operated. M&T announced that $9 to $11 million will be distributed by the end of 2022, with the rest of the funds to be distributed over the next two year and expects to fund approximately 60 to 70 organizations in the initiatives first phase.\nIn August 2022, M&T announced a partnership with Stefon Diggs; Diggs served as a brand ambassador for M&T’s “Football Brings Us Together” campaign.\nIn October 2022, M&T launched its Multicultural Banking Center in East Hartford, Connecticut; the bank has 118 multicultural locations.\nIn 2022, M&T was listed as one of the Best Places to Work for Disability Inclusion by the Disability Equality Index (DEI) for its fourth consecutive year.\n\nMergers and acquisitions\nBetween 1945 and 1966, M&T acquired 18 local banking institutions. Between 1987 and 2022, M&T Bank acquired 24 financial institutions, as follows:\n\n1920s\nDecember 1925: merged with Fidelity Trust Company under the name Manufacturers and Traders Trust Company\nMay 1927: acquired the People's Bank of Buffalo\n\n1940s\nJune 1945: acquired the First National Bank of Kenmore\nOctober 1945: acquired the Citizens National Bank of Lancaster\nDecember 1945: acquired the American Bank of Lackawanna\n\n1980s\nDecember 1987: acquired East New York Savings, which operated 15 branches in metropolitan New York City\n\n1990s\nJanuary 1990: acquired $486 million in deposits and 11 offices in Rochester from Monroe Savings Bank of Rochester, New York\nSeptember 1990: acquired $1.3 billion in deposits and 13 offices (9 in Buffalo and 4 in Rochester) of Empire of America Savings Bank of Buffalo\nMay 1991: acquired $2.1 billion in deposits and 14 branches of Goldome Bank of Buffalo\nJuly 1992: acquired $1.1 billion asset Central Trust of Rochester, New York, and the $300 million asset Endicott Trust of Binghamton, New York.\nDecember 1994: acquired $146 million in deposits from the Hudson Valley branches of Chemical Bank; and $470 million in assets and $339 million in deposits from Ithaca Bancorp of Ithaca, New York.\nJuly 1995: acquired Hudson Valley branches of Chase Manhattan\nJanuary 1997: acquired Green Point Bank branches of Westchester, New York\nJune 1999: acquired First National Bank of Rochester\nApril 1998: acquired OnBank of Syracuse, New York\nSeptember 1999: acquired 29 Chase Bank Branches in Buffalo, Jamestown, and Binghamton New York.\n\n2000s\nOctober 2000: acquired Keystone Financial of Central Pennsylvania\nFebruary 2001: acquired Premier Nation Bancorp of Newburgh\nApril 2003: acquired Allfirst Bank of Baltimore, a subsidiary of Allied Irish Banks of Ireland, in exchange for 26.7 million shares of M&T and $886 million in cash. At the direction of Irish government financial regulators, AIB sold its 22% ownership interest in M&T in 2010.\nJune 2006: acquired 21 Citibank branches in Buffalo and Rochester\nDecember 2007: acquired Partners Trust Financial Group, including 33 branches in upstate New York, for $555 million.\nDecember 2007: acquired 12 First Horizon National Corporation branches in the greater Washington, D.C., and Baltimore markets.\nMay 2009: acquired Provident Bank of Maryland in a stock transaction.\nAugust 2009: The Federal Deposit Insurance Corporation (FDIC) seized Bradford Bank and sold all its deposits and most assets to M&T. M&T and the FDIC agreed to share future losses on $338 million worth of Bradford's assets.\n\n2010s\nNovember 2010: acquired K Bank of Baltimore, Maryland\nMay 2011: acquired Wilmington Trust for $351 million in stock.\nAugust 2012: M&T announced the acquisition of Hudson City Bancorp for $3.7 billion. The bank had $25 billion in deposits and $28 billion in loans and 135 brick-and-mortar branch locations including 97 in New Jersey. The acquisition was delayed for 3 years due to a money laundering case involving an M&T branch and the acquisition closed on November 2, 2015.\n\n2020s\nApril 2022: acquired People's United Bank in an all-stock transaction valued at approximately $8.3 billion.  The acquisition was completed on April 2, 2022.\n\nReferences\nExternal links\nOfficial website\nBusiness data for M&T Bank:",
  "clean_text": "M&T Bank Corporation (Manufacturers and Traders Trust Company) is an American bank holding company headquartered in Buffalo, New York. It operates 950+ branches in 12 states and Washington D.C. across the Eastern United States, from Maine to Virginia. Until May 1998, the bank's holding company was named First Empire State Corporation. M&T Bank has been profitable in every quarter since 1976. Other than Northern Trust, M&T was the only bank in the S&P 500 not to lower its dividend during the 2008 financial crisis. The bank owns the Buffalo Savings Bank building in downtown Buffalo, Bridgeport Center in Bridgeport, Connecticut, and the M&T Tech Hub in the Seneca One Tower. It also sponsors M&T Bank Stadium, home of the Baltimore Ravens, as well as M&T Bank Auditorium and M&T Bank Atrium of the University at Buffalo. M&T Bank is the official bank of the Buffalo Bills in Western New York and of their home Highmark Stadium in Orchard Park. Wilmington Trust is a subsidiary of M&T Bank Corporation, offering global corporate and institutional services, private banking, investment management, and fiduciary services. History 19th century In the mid-19th century, few banking options existed for the growing number of manufacturers in the city of Buffalo. As a result, businessmen Pascal Pratt and Bronson Rumsey founded M&T Bank in 1856 as \"Manufacturers and Traders Trust Company\". Henry Martin, former president of the Attica and Buffalo Railroad, was appointed the first president and assigned a salary of $1,000 a year. The company opened its first office on August 29 of that year at 2 East Swan Street in Buffalo. In 1885, Martin retired as president, at the age of 83, and was succeeded by Pascal Pratt, who had served as Vice President since the bank was formed. 20th century In 1901, the bank built a new headquarters on a site purchased for $210,000 near the southwest corner of Main and Swan Streets in Buffalo. The granite neo-classical building was designed by architect E. B. Green of Green & Wicks. By 1914, Robert Livingston Fryer was the bank's President. In 1917, Harry T. Ramsdell, the bank's fourth president, served as a district chairman for a special subscription committee of the national Liberty Loan program. Following the 1925 merger with Fidelity Trust, the $100 million company was headed by Fidelity's President, 36-year-old Lewis G. Harriman. Harriman and a group of investors including A. H. Schoellkopf, from the founding family of the Niagara Mohawk power company, and James V. Forrestal, who would become the first U.S. Secretary of Defense, own enough shares to control both Fidelity and M&T. In 1961, M&T acquired an entire block on Main Street between North Division and Eagle Streets in downtown Buffalo and began plans for a $12 million skyscraper to become the bank's new headquarters. In 1963, architect Minoru Yamasaki, who was featured on the cover of Time magazine that year as he was designing the World Trade Center in New York City, was retained by M&T to design its new building in Buffalo, which was completed in 1967. In 1964, Charles W. Millard succeeded Harriman as chairman of M&T. In 1969, M&T's stockholders voted to create a multi-bank holding company known as First Empire State Corporation. In 1983, the bank which had assets of $2 billion and operated 60 offices, named Robert G. Wilmers as chairman and CEO, a position he held until his death in December 2017. In 1995, First Empire formed a national bank subsidiary, M&T Bank, N.A. 21st century In 2008, M&T received a $600 million investment by the United States Treasury as a result of the Troubled Asset Relief Program (TARP) and M&T assumed another $482 million in TARP obligations from its acquisitions. In 2012, the bank repaid $700 million of TARP funds. In June 2014, a U.S. District Judge ordered M&T Bank to forfeit $560,000 that had been laundered through its Perry Hall, Maryland, branch; from 2011 to 2013, Deanna Bailey went to the branch and had head teller Sabrina Fitts convert cash amounts from $20,000 to $100,000 into larger bills. Fitts accepted a 1% transaction fee in exchange for not filing a currency transaction report. This violated the Bank Secrecy Act of 1970. On December 16, 2017, non-executive chairman Robert T. Brady became acting chairman and CEO. On December 20, 2017, René F. Jones was appointed chairman and CEO. In 2021, M&T Bank contributed $33.9 million to over 3,000 nonprofit organizations across eight states and the District of Columbia. The bank has donated more than $279.4 million to nonprofits over the past decade, and over $437.5 million to nonprofits over the past two decades. In May 2022, M&T announced a $25 million initiative to support lower-income communities and underrepresented groups. The new Amplify Fund will be deployed over three years with most of the funds set to be distributed to Connecticut-based organizations and other north-eastern states where People’s United had operated. M&T announced that $9 to $11 million will be distributed by the end of 2022, with the rest of the funds to be distributed over the next two year and expects to fund approximately 60 to 70 organizations in the initiatives first phase. In August 2022, M&T announced a partnership with Stefon Diggs; Diggs served as a brand ambassador for M&T’s “Football Brings Us Together” campaign. In October 2022, M&T launched its Multicultural Banking Center in East Hartford, Connecticut; the bank has 118 multicultural locations. In 2022, M&T was listed as one of the Best Places to Work for Disability Inclusion by the Disability Equality Index (DEI) for its fourth consecutive year. Mergers and acquisitions Between 1945 and 1966, M&T acquired 18 local banking institutions. Between 1987 and 2022, M&T Bank acquired 24 financial institutions, as follows: 1920s December 1925: merged with Fidelity Trust Company under the name Manufacturers and Traders Trust Company May 1927: acquired the People's Bank of Buffalo 1940s June 1945: acquired the First National Bank of Kenmore October 1945: acquired the Citizens National Bank of Lancaster December 1945: acquired the American Bank of Lackawanna 1980s December 1987: acquired East New York Savings, which operated 15 branches in metropolitan New York City 1990s January 1990: acquired $486 million in deposits and 11 offices in Rochester from Monroe Savings Bank of Rochester, New York September 1990: acquired $1.3 billion in deposits and 13 offices (9 in Buffalo and 4 in Rochester) of Empire of America Savings Bank of Buffalo May 1991: acquired $2.1 billion in deposits and 14 branches of Goldome Bank of Buffalo July 1992: acquired $1.1 billion asset Central Trust of Rochester, New York, and the $300 million asset Endicott Trust of Binghamton, New York. December 1994: acquired $146 million in deposits from the Hudson Valley branches of Chemical Bank; and $470 million in assets and $339 million in deposits from Ithaca Bancorp of Ithaca, New York. July 1995: acquired Hudson Valley branches of Chase Manhattan January 1997: acquired Green Point Bank branches of Westchester, New York June 1999: acquired First National Bank of Rochester April 1998: acquired OnBank of Syracuse, New York September 1999: acquired 29 Chase Bank Branches in Buffalo, Jamestown, and Binghamton New York. 2000s October 2000: acquired Keystone Financial of Central Pennsylvania February 2001: acquired Premier Nation Bancorp of Newburgh April 2003: acquired Allfirst Bank of Baltimore, a subsidiary of Allied Irish Banks of Ireland, in exchange for 26.7 million shares of M&T and $886 million in cash. At the direction of Irish government financial regulators, AIB sold its 22% ownership interest in M&T in 2010. June 2006: acquired 21 Citibank branches in Buffalo and Rochester December 2007: acquired Partners Trust Financial Group, including 33 branches in upstate New York, for $555 million. December 2007: acquired 12 First Horizon National Corporation branches in the greater Washington, D.C., and Baltimore markets. May 2009: acquired Provident Bank of Maryland in a stock transaction. August 2009: The Federal Deposit Insurance Corporation (FDIC) seized Bradford Bank and sold all its deposits and most assets to M&T. M&T and the FDIC agreed to share future losses on $338 million worth of Bradford's assets. 2010s November 2010: acquired K Bank of Baltimore, Maryland May 2011: acquired Wilmington Trust for $351 million in stock. August 2012: M&T announced the acquisition of Hudson City Bancorp for $3.7 billion. The bank had $25 billion in deposits and $28 billion in loans and 135 brick-and-mortar branch locations including 97 in New Jersey. The acquisition was delayed for 3 years due to a money laundering case involving an M&T branch and the acquisition closed on November 2, 2015. 2020s April 2022: acquired People's United Bank in an all-stock transaction valued at approximately $8.3 billion. The acquisition was completed on April 2, 2022."
}