{
  "ticker": "MTCH",
  "cik": "0000891103",
  "company_name": "Match Group",
  "corrected_name": "Match Group",
  "wiki_title_used": "Match Group",
  "exists": true,
  "raw_text": "Match Group, Inc. is an American internet and technology company headquartered in Dallas, Texas. It owns and operates the largest global portfolio of popular online dating services including Tinder, Match.com, Meetic, OkCupid, Hinge, Plenty of Fish, OurTime, and other dating global brands. The company was owned by IAC until July 2020 when Match Group was spun off as a separate, public company. As of 2019, the company had 9.3 million subscribers, of which 4.6 million were in North America. Japan is the company's second largest market, after the United States.\n\nHistory\n2009–2018\nIn February 2009, IAC incorporated Match Group as a conglomerate of Match.com and other dating sites it owned. In July 2009, Match Group's Match.com acquired People Media from American Capital for $80 million in cash. People Media operated dating sites BlackPeopleMeet.com and OurTime, which became part of Match Group's portfolio, and powered AOL Personals.\nIn February 2010, Match.com acquired dating site Singlesnet. In February 2011, Match Group acquired OkCupid for $50 million. OkCupid was the first free, advertising-based product added to the Match Group portfolio.\nIn 2012, online dating application Tinder was founded within Hatch Labs, a startup incubator run by parent company IAC. The application allowed users to anonymously swipe to like or dislike other profiles based on their photos, common interests and a small bio. On November 19, 2015, the company became a public company via an initial public offering, with shares trading on Nasdaq under the symbol MTCH.\nIn 2017, Match Group launched Tinder Gold, which established Tinder as the highest grossing non-gaming app globally. In the summer of 2017, the company offered to acquire Bumble for $450 million.\nIn January 2018, Mandy Ginsberg, formerly the CEO of Match’s North American division, replaced Greg Blatt as the global CEO.\nIn June 2018, Match Group acquired 51% ownership in dating app Hinge, in a move intended to diversify Match’s portfolio and appeal to a wider array of singles. In February 2019, Match Group fully bought out the company.\nIn July 2018, Match Group launched a Safety Advisory Council comprising a group of experts focused on preventing sexual assault across its portfolio of products. The council included #MeToo movement founder Tarana Burke and worked with organizations like the Rape, Abuse & Incest National Network (RAINN) and the National Sexual Violence Resource Center.\n\n2018 legal action\nIn August 2018, Tinder co-founder Sean Rad filed a $2 billion lawsuit against Match Group, claiming that Match Group and its parent company IAC purposely undervalued Tinder to avoid paying out stock options to the company's original team. Rad and his co-plaintiffs also accused the former Tinder CEO, Greg Blatt, of sexual harassment. The company stated that the allegations were \"meritless.\" In October 2019, Blatt filed a defamation lawsuit against Rad and Tinder founding member Rosette Pambakian seeking at least $50 million in damages.\n\n2019–present\nIn January 2019, Match Group partnered with media brand Betches to launch a dating app, called Ship, which allowed users to help their friends pick out potential dates.\nIn August 2019, the company acquired Harmonica, an Egyptian online dating service.\nIn January 2020, Match Group announced an investment and partnership with safety platform Noonlight. The partnership incorporated new safety tools in Match Group's products, including emergency assistance, location tracking and photo verification.\nIn January 2020, Mandy Ginsberg stepped down as chief executive officer for personal reasons. Shar Dubey, then President of Match Group, became the CEO of the company effective March 1, 2020.\nIn March 2020, Match Group became the first tech company to support Earn It Act of 2020, a bipartisan bill with the support of President Trump to combat online child sexual exploitation but widely criticized for its predicted negative impact on privacy and computer security.\nIn July 2020, the company completed the separation from IAC. The separation was the largest ever for IAC, as Match Group then had a market capitalization of $30 billion. After the separation, four new members joined Match Group's board of directors: Stephen Baily, Melissa Brenner, Ryan Reynolds and Wendi Murdoch.\nIn August 2020, amidst the COVID-19 pandemic, Match Group reported growing profit and revenue and surpassed 10 million subscribers across its portfolio.\nIn September 2020, Match Group, Spotify, and Epic Games co-founded the Coalition for App Fairness, contesting Apple’s App Store and Google’s Play store policies. Chiefly, they contested what they characterized as anticompetitive policies, as well as high “app taxes” on sales of developers’ apps.\nIn February 2021, Match Group announced that it would be acquiring Korea-based social network company Hyperconnect for $1.73 billion in both cash and stock. This deal is reportedly Match Group's largest acquisition to date.\nAlso in February 2021, Match Group took legal action against dating app Muzmatch, the online Muslim dating app, calling the app a \"Tinder Clone\". The Match Group won the legal battle in London courts in April 2022.\nIn April 2022, Shar Dubey stepped down from her position as CEO while remaining on the board of directors. Bernard Kim, the former president of Zynga, became CEO effective from May 31, 2022. On February 4, 2025, the Match Group Board of Directors announced that Spencer Rascoff had been named CEO, effective immediately, with Bernard Kim stepping down as CEO and as a member of the Board.\nIn July 2022, Match Group acquired The League, a members-only dating app, for an undisclosed sum.\n\n2019 legal action\nIn 2019, the U.S. Federal Trade Commission (FTC) sued Match, alleging that Match had engaged in unfair and deceptive trade practices by allowing potentially fraudulent accounts to express interest in non-subscribers, who were enticed to subscribe. The FTC further alleged that Match offered false promises of guarantees, failed to provide support to customers who unsuccessfully disputed charges, and made it overly difficult for users to cancel their subscriptions.\nMatch Group disputed these claims, alleging that they were based upon cherry-picked evidence and that the FTC had misrepresented internal emails. In September 2020, Reuters reported that the Department of Justice had closed their probe into the complaint.\n\nResponse to 2022 Russian invasion of Ukraine\nIn response to the 2022 Russian invasion of Ukraine, in its 2023 yearly report, Match Group announced that it would fully exit the Russian market by the 30th of June. As of early May 2023, it was implementing measures to limit access to its services. The company said that such moves are part of its commitment to human rights protection.\n\nDating services owned\nAs of September 2025, Match Group owns the following dating services:\n\nArcher\nAsian People Meet\nBabyboomer People Meet\nBB People Meet\nBlack Christian People Meet\nBlack People Meet\nBlack Professional People Meet\nBLK\nCatholic People Meet\nChinese People Meet\nChispa\nDelightful\nDemocratic People Meet\nDivorced People Meet\nGenxpeoplemeet\nHinge\nIndiamatch\nInterracial People Meet\nItalian People Meet\nJ People Meet\nLatino People Meet\nLdsplanet\nLittle People Meet\nLoveandseek\nMarriage Minded People Meet\nMatch.com\nMatch Japan\nOkCupid\nOurtime\nPeople Meet\nPet People Meet\nPlenty of Fish\nRepublican People Meet\nSalams\nSeniorblack People Meet\nSingle People Meet\nStir\nThe League\nTinder\nUpward\nVeggiepeoplemeet\nYuzu\n\nReferences\nExternal links\nOfficial website\nBusiness data for Match Group, Inc.:",
  "clean_text": "Match Group, Inc. is an American internet and technology company headquartered in Dallas, Texas. It owns and operates the largest global portfolio of popular online dating services including Tinder, Match.com, Meetic, OkCupid, Hinge, Plenty of Fish, OurTime, and other dating global brands. The company was owned by IAC until July 2020 when Match Group was spun off as a separate, public company. As of 2019, the company had 9.3 million subscribers, of which 4.6 million were in North America. Japan is the company's second largest market, after the United States. History 2009–2018 In February 2009, IAC incorporated Match Group as a conglomerate of Match.com and other dating sites it owned. In July 2009, Match Group's Match.com acquired People Media from American Capital for $80 million in cash. People Media operated dating sites BlackPeopleMeet.com and OurTime, which became part of Match Group's portfolio, and powered AOL Personals. In February 2010, Match.com acquired dating site Singlesnet. In February 2011, Match Group acquired OkCupid for $50 million. OkCupid was the first free, advertising-based product added to the Match Group portfolio. In 2012, online dating application Tinder was founded within Hatch Labs, a startup incubator run by parent company IAC. The application allowed users to anonymously swipe to like or dislike other profiles based on their photos, common interests and a small bio. On November 19, 2015, the company became a public company via an initial public offering, with shares trading on Nasdaq under the symbol MTCH. In 2017, Match Group launched Tinder Gold, which established Tinder as the highest grossing non-gaming app globally. In the summer of 2017, the company offered to acquire Bumble for $450 million. In January 2018, Mandy Ginsberg, formerly the CEO of Match’s North American division, replaced Greg Blatt as the global CEO. In June 2018, Match Group acquired 51% ownership in dating app Hinge, in a move intended to diversify Match’s portfolio and appeal to a wider array of singles. In February 2019, Match Group fully bought out the company. In July 2018, Match Group launched a Safety Advisory Council comprising a group of experts focused on preventing sexual assault across its portfolio of products. The council included #MeToo movement founder Tarana Burke and worked with organizations like the Rape, Abuse & Incest National Network (RAINN) and the National Sexual Violence Resource Center. 2018 legal action In August 2018, Tinder co-founder Sean Rad filed a $2 billion lawsuit against Match Group, claiming that Match Group and its parent company IAC purposely undervalued Tinder to avoid paying out stock options to the company's original team. Rad and his co-plaintiffs also accused the former Tinder CEO, Greg Blatt, of sexual harassment. The company stated that the allegations were \"meritless.\" In October 2019, Blatt filed a defamation lawsuit against Rad and Tinder founding member Rosette Pambakian seeking at least $50 million in damages. 2019–present In January 2019, Match Group partnered with media brand Betches to launch a dating app, called Ship, which allowed users to help their friends pick out potential dates. In August 2019, the company acquired Harmonica, an Egyptian online dating service. In January 2020, Match Group announced an investment and partnership with safety platform Noonlight. The partnership incorporated new safety tools in Match Group's products, including emergency assistance, location tracking and photo verification. In January 2020, Mandy Ginsberg stepped down as chief executive officer for personal reasons. Shar Dubey, then President of Match Group, became the CEO of the company effective March 1, 2020. In March 2020, Match Group became the first tech company to support Earn It Act of 2020, a bipartisan bill with the support of President Trump to combat online child sexual exploitation but widely criticized for its predicted negative impact on privacy and computer security. In July 2020, the company completed the separation from IAC. The separation was the largest ever for IAC, as Match Group then had a market capitalization of $30 billion. After the separation, four new members joined Match Group's board of directors: Stephen Baily, Melissa Brenner, Ryan Reynolds and Wendi Murdoch. In August 2020, amidst the COVID-19 pandemic, Match Group reported growing profit and revenue and surpassed 10 million subscribers across its portfolio. In September 2020, Match Group, Spotify, and Epic Games co-founded the Coalition for App Fairness, contesting Apple’s App Store and Google’s Play store policies. Chiefly, they contested what they characterized as anticompetitive policies, as well as high “app taxes” on sales of developers’ apps. In February 2021, Match Group announced that it would be acquiring Korea-based social network company Hyperconnect for $1.73 billion in both cash and stock. This deal is reportedly Match Group's largest acquisition to date. Also in February 2021, Match Group took legal action against dating app Muzmatch, the online Muslim dating app, calling the app a \"Tinder Clone\". The Match Group won the legal battle in London courts in April 2022. In April 2022, Shar Dubey stepped down from her position as CEO while remaining on the board of directors. Bernard Kim, the former president of Zynga, became CEO effective from May 31, 2022. On February 4, 2025, the Match Group Board of Directors announced that Spencer Rascoff had been named CEO, effective immediately, with Bernard Kim stepping down as CEO and as a member of the Board. In July 2022, Match Group acquired The League, a members-only dating app, for an undisclosed sum. 2019 legal action In 2019, the U.S. Federal Trade Commission (FTC) sued Match, alleging that Match had engaged in unfair and deceptive trade practices by allowing potentially fraudulent accounts to express interest in non-subscribers, who were enticed to subscribe. The FTC further alleged that Match offered false promises of guarantees, failed to provide support to customers who unsuccessfully disputed charges, and made it overly difficult for users to cancel their subscriptions. Match Group disputed these claims, alleging that they were based upon cherry-picked evidence and that the FTC had misrepresented internal emails. In September 2020, Reuters reported that the Department of Justice had closed their probe into the complaint. Response to 2022 Russian invasion of Ukraine In response to the 2022 Russian invasion of Ukraine, in its 2023 yearly report, Match Group announced that it would fully exit the Russian market by the 30th of June. As of early May 2023, it was implementing measures to limit access to its services. The company said that such moves are part of its commitment to human rights protection. Dating services owned As of September 2025, Match Group owns the following dating services: Archer Asian People Meet Babyboomer People Meet BB People Meet Black Christian People Meet Black People Meet Black Professional People Meet BLK Catholic People Meet Chinese People Meet Chispa Delightful Democratic People Meet Divorced People Meet Genxpeoplemeet Hinge Indiamatch Interracial People Meet Italian People Meet J People Meet Latino People Meet Ldsplanet Little People Meet Loveandseek Marriage Minded People Meet Match.com Match Japan OkCupid Ourtime People Meet Pet People Meet Plenty of Fish Republican People Meet Salams Seniorblack People Meet Single People Meet Stir The League Tinder Upward Veggiepeoplemeet Yuzu"
}