{
  "ticker": "MTD",
  "cik": "0001037646",
  "company_name": "Mettler Toledo",
  "corrected_name": "Mettler Toledo",
  "wiki_title_used": "Mettler Toledo",
  "exists": true,
  "raw_text": "Mettler Toledo, stylized in all caps, is a multinational supplier of precision instruments and services. The company focuses on laboratory, industrial, product inspection, and food retailing applications. Its products are used in research, quality control, and manufacturing processes in life sciences, food, chemical, and many other industries. The company's business is geographically diversified, with sales in 2023 derived 41% from North and South America, 27% from Europe, and 32% from Asia and other countries. The company’s global workforce consists of 17,300 employees as of December 31, 2023.\n\nFormation and history\nToledo Scale Company\nAllen DeVilbiss, Jr. (1873-1911) was an inventor who lived in Toledo, Ohio, United States. He became interested in the concept of weighing machines, and conceived the idea of an automatic computing pendulum scale. He was able to prove his concept with a local butcher, who realized that customers appreciated the automatic computation which eliminated the risk of overcharging. While his invention gained in popularity, DeVilbiss was not interested in making it a viable business.\nIn 1900, Henry Theobald (1868-1924) was fired from his job at the National Cash Register Company. He decided to start his own business, and was convinced that selling the automatic computing scales could be a good venture. He solicited additional financial investors and purchased the company from DeVilbiss. On July 10, 1901, the Toledo Computing Scale and Cash Register Company was incorporated.\nBy May 1902, Theobald's company was selling more than 100 cash registers with scales per month. By that time, John H. Patterson, Theobald's boss from NCR, threatened to sue the new company for patent infringements. As an alternative, Patterson offered to purchase all cash register patents and property, along with the stipulation that Theobald would no longer engage in the cash register business. The investors, who worried about the costs of patent infringement litigation, agreed to the sale in June 1902. Since cash registers were no longer part of Theobald's business, he changed the name to Toledo Computing Scale Company. Theobald later coined the phrase \"No Springs, Honest Weight\" as a slogan for the new company.\nIn the years that followed, Theobald realized that the weighing scale was the most important part of the retail transaction between the merchant and the customer. He felt that many of his competitors who used spring scale technology, especially Dayton Scale Company, were allowing merchants to cheat their customers by incorrectly calculating the total price of a measured good. He campaigned for more government regulation of weights and measures to eliminate dishonest weighing systems. On October 1, 1907, Massachusetts adopted the first weights and measures laws in the United States.\nIn 1912, the company name changed once again, to Toledo Scale Company. Additionally, a new scale line featuring a double pendulum mechanism and a dial face was introduced and was most suited for industrial applications.\nIn 1957, Reliance Electric Co, merged with Toledo Scale Co. Reliance paid about $70 million in stock for the purchase.\n\nMettler Instruments AG\nIn 1945, Dr. Erhard Mettler Rook, a Swiss engineer, started a precision mechanics company in Küsnacht, Switzerland. He invented the substitution principle with a single-pan balance, capable of being produced in series. Analytical balances with a single weighing pan gradually replaced conventional two-pan balances in the laboratory.\n\nMettler diversified its product line in 1970 with the introduction of its automated titration systems, and the acquisition of balance manufacturer Microwa AG. Mettler acquired its 500-employee competitor August Sauter KG, of Albstadt-Ebingen, Germany, in 1971, for its specialized industrial and retail scales.\nIn 1980, Dr. Mettler sold his business to Ciba-Geigy AG. A third pillar - after laboratory and industrial - was created: the retail business. Technological progress had made it possible to advance retail scales to instruments for the management of perishable goods.\n\nMettler Toledo\nIn 1989, Reliance Electric sold the Toledo Scale division to Ciba-Geigy AG. The division was then merged with Mettler Instruments. The merger vastly increased the global scope of the company, which, as a result, operated in 18 countries. Mettler acquired another competitor, Ohaus Corp., in 1990. In 1992, the company was incorporated as Mettler Toledo, Inc.\nIn 1996–97, Mettler Toledo, Inc. was sold by Ciba-Geigy AG to the New York-based AEA Investors Inc., in preparation for a subsequent initial public offering. The initial public offering was completed and began trading on the New York Stock Exchange, under the ticker symbol NYSE: MTD.\nThe resulting company is currently headquartered in Greifensee, Switzerland, with offices for its many brands based around the world.\n\nOperational structure\nThe company has locations in approximately 40 countries, with manufacturing operations in China, Switzerland, the United States, Germany, Norway, the United Kingdom, and Mexico. Mettler Toledo has an extensive global sales, service, and marketing organization with approximately 9,000 employees.\n\nLaboratory Instruments Division\nMettler Toledo produces precision laboratory instruments used for sample preparation, synthesis, analytical bench top activities, material characterization, and in-line measurement. Their portfolio includes laboratory balances, Rainin laboratory pipettes, automated laboratory reactors with real-time analytics, titrators, pH meters, process analytics sensors, and analyzer technology.\n\nAdditionally, the Company offers physical value analyzers such as density and refractometry instruments, thermal analysis systems, and other analytical tools like UV/VIS spectrophotometers and moisture analyzers. These laboratory instruments feature embedded software, and Mettler Toledo also provides a proprietary laboratory software platform for managing and analyzing data from their instruments.\n\nIndustrial Instruments Division\nThe Company manufactures industrial weighing instruments and related terminals and offer software for the pharmaceutical, chemical, food, discrete manufacturing, and other industries. In addition, it also produces metal detection, X-ray, check weighing, and other end-of-line product inspection systems used in production and packaging. Mettler Toledo also offers heavy industrial scales and related software.\n\nRetail Weighing Solutions\nSales and Service\nAs of December 31, 2023, the sales and service group comprised approximately 9,000 employees in sales, marketing, customer service, and post-sales technical service, located in around 40 countries.\nThe Mettler Toledo service business provides uptime and calibration services as well as value-added services for various market needs, including regulatory compliance, performance enhancements, application expertise and training, and remote services. The company offers specialized services to pharmaceutical customers, ensuring compliance with U.S. Food and Drug Administration (FDA) and other international regulations.\nService constitutes a significant portion of the company’s net sales. Beyond revenue, the service business drives customer retention, enabling Mettler Toledo to maintain close relationships and frequent contact with a large customer base.\n\nReferences\nExternal links\n\nBusiness data for Mettler Toledo:",
  "clean_text": "Mettler Toledo, stylized in all caps, is a multinational supplier of precision instruments and services. The company focuses on laboratory, industrial, product inspection, and food retailing applications. Its products are used in research, quality control, and manufacturing processes in life sciences, food, chemical, and many other industries. The company's business is geographically diversified, with sales in 2023 derived 41% from North and South America, 27% from Europe, and 32% from Asia and other countries. The company’s global workforce consists of 17,300 employees as of December 31, 2023. Formation and history Toledo Scale Company Allen DeVilbiss, Jr. (1873-1911) was an inventor who lived in Toledo, Ohio, United States. He became interested in the concept of weighing machines, and conceived the idea of an automatic computing pendulum scale. He was able to prove his concept with a local butcher, who realized that customers appreciated the automatic computation which eliminated the risk of overcharging. While his invention gained in popularity, DeVilbiss was not interested in making it a viable business. In 1900, Henry Theobald (1868-1924) was fired from his job at the National Cash Register Company. He decided to start his own business, and was convinced that selling the automatic computing scales could be a good venture. He solicited additional financial investors and purchased the company from DeVilbiss. On July 10, 1901, the Toledo Computing Scale and Cash Register Company was incorporated. By May 1902, Theobald's company was selling more than 100 cash registers with scales per month. By that time, John H. Patterson, Theobald's boss from NCR, threatened to sue the new company for patent infringements. As an alternative, Patterson offered to purchase all cash register patents and property, along with the stipulation that Theobald would no longer engage in the cash register business. The investors, who worried about the costs of patent infringement litigation, agreed to the sale in June 1902. Since cash registers were no longer part of Theobald's business, he changed the name to Toledo Computing Scale Company. Theobald later coined the phrase \"No Springs, Honest Weight\" as a slogan for the new company. In the years that followed, Theobald realized that the weighing scale was the most important part of the retail transaction between the merchant and the customer. He felt that many of his competitors who used spring scale technology, especially Dayton Scale Company, were allowing merchants to cheat their customers by incorrectly calculating the total price of a measured good. He campaigned for more government regulation of weights and measures to eliminate dishonest weighing systems. On October 1, 1907, Massachusetts adopted the first weights and measures laws in the United States. In 1912, the company name changed once again, to Toledo Scale Company. Additionally, a new scale line featuring a double pendulum mechanism and a dial face was introduced and was most suited for industrial applications. In 1957, Reliance Electric Co, merged with Toledo Scale Co. Reliance paid about $70 million in stock for the purchase. Mettler Instruments AG In 1945, Dr. Erhard Mettler Rook, a Swiss engineer, started a precision mechanics company in Küsnacht, Switzerland. He invented the substitution principle with a single-pan balance, capable of being produced in series. Analytical balances with a single weighing pan gradually replaced conventional two-pan balances in the laboratory. Mettler diversified its product line in 1970 with the introduction of its automated titration systems, and the acquisition of balance manufacturer Microwa AG. Mettler acquired its 500-employee competitor August Sauter KG, of Albstadt-Ebingen, Germany, in 1971, for its specialized industrial and retail scales. In 1980, Dr. Mettler sold his business to Ciba-Geigy AG. A third pillar - after laboratory and industrial - was created: the retail business. Technological progress had made it possible to advance retail scales to instruments for the management of perishable goods. Mettler Toledo In 1989, Reliance Electric sold the Toledo Scale division to Ciba-Geigy AG. The division was then merged with Mettler Instruments. The merger vastly increased the global scope of the company, which, as a result, operated in 18 countries. Mettler acquired another competitor, Ohaus Corp., in 1990. In 1992, the company was incorporated as Mettler Toledo, Inc. In 1996–97, Mettler Toledo, Inc. was sold by Ciba-Geigy AG to the New York-based AEA Investors Inc., in preparation for a subsequent initial public offering. The initial public offering was completed and began trading on the New York Stock Exchange, under the ticker symbol NYSE: MTD. The resulting company is currently headquartered in Greifensee, Switzerland, with offices for its many brands based around the world. Operational structure The company has locations in approximately 40 countries, with manufacturing operations in China, Switzerland, the United States, Germany, Norway, the United Kingdom, and Mexico. Mettler Toledo has an extensive global sales, service, and marketing organization with approximately 9,000 employees. Laboratory Instruments Division Mettler Toledo produces precision laboratory instruments used for sample preparation, synthesis, analytical bench top activities, material characterization, and in-line measurement. Their portfolio includes laboratory balances, Rainin laboratory pipettes, automated laboratory reactors with real-time analytics, titrators, pH meters, process analytics sensors, and analyzer technology. Additionally, the Company offers physical value analyzers such as density and refractometry instruments, thermal analysis systems, and other analytical tools like UV/VIS spectrophotometers and moisture analyzers. These laboratory instruments feature embedded software, and Mettler Toledo also provides a proprietary laboratory software platform for managing and analyzing data from their instruments. Industrial Instruments Division The Company manufactures industrial weighing instruments and related terminals and offer software for the pharmaceutical, chemical, food, discrete manufacturing, and other industries. In addition, it also produces metal detection, X-ray, check weighing, and other end-of-line product inspection systems used in production and packaging. Mettler Toledo also offers heavy industrial scales and related software. Retail Weighing Solutions Sales and Service As of December 31, 2023, the sales and service group comprised approximately 9,000 employees in sales, marketing, customer service, and post-sales technical service, located in around 40 countries. The Mettler Toledo service business provides uptime and calibration services as well as value-added services for various market needs, including regulatory compliance, performance enhancements, application expertise and training, and remote services. The company offers specialized services to pharmaceutical customers, ensuring compliance with U.S. Food and Drug Administration (FDA) and other international regulations. Service constitutes a significant portion of the company’s net sales. Beyond revenue, the service business drives customer retention, enabling Mettler Toledo to maintain close relationships and frequent contact with a large customer base."
}