{
  "ticker": "MU",
  "cik": "0000723125",
  "company_name": "Micron Technology",
  "corrected_name": "Micron Technology",
  "wiki_title_used": "Micron Technology",
  "exists": true,
  "raw_text": "Micron Technology, Inc. is an American producer of computer memory and computer data storage including dynamic random-access memory, flash memory, and solid-state drives (SSDs). It is headquartered in Boise, Idaho. Micron's consumer products, including the Ballistix line of consumer and gaming memory modules, are marketed under the Crucial brand. Micron and Intel together created IM Flash Technologies, which produced NAND flash memory. It owned Lexar between 2006 and 2017. Micron is the only U.S.-based manufacturer of memory.\n\nHistory\n1978–1999\nMicron was founded in Boise, Idaho, in 1978 by Ward Parkinson, Joe Parkinson, Dennis Wilson, and Doug Pitman as a semiconductor design consulting company. Startup funding was provided by local Idaho businessmen Tom Nicholson, Allen Noble, Rudolph Nelson, and Ron Yanke. Later it received funding from Idaho billionaire J. R. Simplot, whose fortune was made in the potato business. In 1981, the company moved from consulting to manufacturing with the completion of its first wafer fabrication unit (\"Fab 1\"), producing 64K DRAM chips.\nIn 1984, the company had its initial public offering.\nMicron sought to enter the market for RISC processors in 1991 with a product known as FRISC, targeting embedded control and signal processing applications. Running at 80 MHz and described as \"a 64-bit processor with fast context-switching time and high floating-point performance\", the design supported various features for timely interrupt handling and featured an arithmetic unit capable of handling both integer and floating-point calculations with a claimed throughput of 80 MFLOPS for double-precision arithmetic. Micron aimed to provide a \"board-level demonstration supercomputer\" in configurations with 256 MB or 1 GB of RAM. Having set up a subsidiary and with the product being designed into graphics cards and accelerators, Micron concluded in 1992 that the effort would not deliver the \"best bang for the buck\", reassigning engineers to other projects and discontinuing the endeavour.\nIn 1994, founder Joe Parkinson retired as CEO and Steve Appleton took over as Chairman, President, and CEO.\nA 1996 3-way merger among ZEOS International, Micron Computer, and Micron Custom Manufacturing Services (MCMS) increased the size and scope of the company; this was followed rapidly with the 1997 acquisition of NetFrame Systems, in a bid to enter the mid-range server industry. Between 1998 and 2000, the company was the main sponsor of the MicronPC Bowl, or MicronPC.com Bowl.\n\nSince 2000\nIn 2000, Gurtej Singh Sandhu and Trung T. Doan at Micron initiated the development of atomic layer deposition high-k films for DRAM memory devices. This helped drive cost-effective implementation of semiconductor memory, starting with 90 nm node DRAM. Pitch double-patterning was also pioneered by Gurtej Singh Sandhu at Micron during the 2000s, leading to the development of 30-nm class NAND flash memory, and it has since been widely adopted by NAND flash and RAM manufacturers worldwide.\nIn 2002, Micron spun off its personal computer business as MPC Corporation and put it up for sale. The company found the business difficult as the number 12 American computer maker with only 1.3 percent of the market.\nMicron and Intel created a joint venture in 2005, based in IM Flash Technologies in Lehi, Utah. The two companies formed another joint venture in 2011, IM Flash Singapore, in Singapore. In 2012 Micron became sole owner of this second joint venture. In 2006 Micron acquired Lexar, an American manufacturer of digital media products.\nThe company again changed leadership in June 2007 with COO Mark Durcan becoming president. In 2008 Micron converted the Avezzano chip fab, formerly a Texas Instruments DRAM fab, into a production facility for CMOS image sensors sold by Aptina Imaging.\nIn 2008, Micron spun off Aptina Imaging, which was acquired by ON Semiconductor in 2014. Micron retained a stake in the spinoff. However, the core company suffered setbacks and had to layoff 15 percent of its workforce in October 2008, during which period the company also announced the purchase of Qimonda's 35.6 percent stake in Inotera Memories for $400 million. The trend of layoffs and acquisitions continued in 2009 with the termination of an additional 2,000 employees, and the acquisition of the FLCOS microdisplay company Displaytech. Micron agreed to buy flash-chip maker Numonyx for $1.27 billion in stock in February 2010.\nOn 3 February 2012, CEO Appleton died in a plane crash shortly after takeoff from the Boise Airport. He was the pilot and sole occupant of the Lancair IV aircraft. Mark Durcan replaced Appleton as the CEO shortly thereafter, eliminating his former title of President.\nIn 2013, the Avezzano chip fab was sold to LFoundry. In the 2012 to 2014 period, Micron again went through an acquisition-layoff cycle, becoming the majority shareholder of Inotera Memories, purchasing Elpida Memory for $2 billion and the remaining shares in Rexchip, a PC memory chip manufacturing venture between Powerchip and Elpida Memory for $334 million, while announcing plans to lay off approximately 3,000 workers. Through the Elpida acquisition, Micron became a major supplier to Apple Inc. for the iPhone and iPad. In December 2016 Micron finished acquiring the remaining 67 percent of Inotera, making it a 100 percent subsidiary of Micron.\nIn April 2017, Micron announced Sanjay Mehrotra as the new president and CEO to replace Mark Durcan. In June 2017 Micron announced it was discontinuing the Lexar retail removable media storage business and putting some or all it up for sale. In August of that year the Lexar brand was acquired by Longsys, a flash memory company based in Shenzhen, China.\nIn May 2018, Micron Technology and Intel launched QLC NAND memory to increase storage density. The company ranked 150th on the Fortune 500 list of largest United States corporations by revenue.\nIn February 2019, the first microSD card with a storage capacity of 1 terabyte (TB) was announced by Micron. As of March 2020 3.84TB Micron 5210 Ion is the cheapest large-capacity SSD in the world. In September 2020 the company introduced the world's fastest discrete graphics memory solution. Working with computing technology leader Nvidia, Micron debuted GDDR6X in the Nvidia GeForce RTX 3090 and GeForce RTX 3080 graphics processing units (GPUs). In November 2020, the company unveiled a new 176-layer 3D NAND module. It offers improved read and write latency and is slated to be used in the production of a new generation of solid-state drives.\nOn 22 October 2021, Micron closed the sale of IM Flash's Lehi, Utah fab to Texas Instruments for a sale price of US$900 million. With the passage of the CHIPS and Science Act, Micron announced its pledge to invest billions in new manufacturing within the US. In September 2022, Micron announced they would invest $15 billion in a new facility in Boise, Idaho. In October 2022 Micron announced a $100 billion expansion in Clay, New York.\nMicron Technology owed Netlist $445 million in damages for infringing Netlist's patents related to memory-module technology for high-performance computing. The jury found that Micron's semiconductor-memory products violated two of Netlist's patents willfully, potentially allowing the judge to triple the damages. Netlist had sued Micron in 2022, accusing three of its memory-module lines of patent infringement, which Micron denied, also arguing the patents' invalidity. The U.S. Patent and Trademark Office invalidated one patent in April 2024.\n\nLawsuits\nFujian Jinhua\nOn 5 December 2017 Micron sued rivals United Microelectronics Corporation and Fujian Jinhua Integrated Circuit Co. (JHICC) in the United States District Court for the Northern District of California, alleging infringement on its DRAM patents and intellectual property rights. The U.S. Justice Department in 2018 announced an indictment against Fujian Jinhua, and authorities added the Chinese firm to the Entity List the same year. Fujian Jinhua vehemently denied the claims, saying it had not stolen any technology, and that \"Micron regards the development of Fujian Jinhua as a threat and adopts various means to hamper and destroy the development of Fujian Jinhua,\"\nIn May 2023, the Cyberspace Administration of China barred major Chinese information infrastructure firms from purchasing Micron products, citing significant national security risks. The move was seen as retaliation against US sanctions on China's semiconductor industry and related export controls. In November 2023 Chinese chipmaker Yangtze Memory Technologies Corp (YMTC) filed a lawsuit against Micron alleging infringement of eight of its patents.\nOn February 27, 2024, Judge Maxine Chesney of the U.S. Federal District Court in San Francisco acquitted Fujian Jinhua Integrated Circuit, whom Micron had sued for IP theft, of the charge in a non-jury verdict, believing that there was insufficient evidence to support the charge.\n\nProducts\nMicron’s leading products include the following:\n\nHBM3E (high-bandwidth memory) in graphics processing units (GPUs) for data flow into generative AI models.  \nMicron 9400 NVMe™ SSDs for increased capacity in PCIe® Gen4 storage. \nUniversal Flash Storage (UFS) fo storage in smartphones and in automotive and computing systems.\nLPDDR5X (low-power double-data rate) for mobile phones and thin laptops.\nLPCAMM2 memory for notebooks with longer battery life and modularity.\nGDDR7 ultra-bandwidth memory for an increased input/output (I/O) rate in data-hungry workloads.\nMemory expansion modules using CXL to balance the compute and memory scaling gap.\nHigh-capacity DIMMs with single-die packaging with less power consumption.\nNAND flash memory floating-gate transistor\nJEDEC-compliant ASIL-D ISO 26262 certified memory products for automotive.\n\nCorporate affairs\nExecutive leadership\nThe executive leadership team includes.\n\nSanjay Mehrotra (President and Chief Executive Officer)\nApril Arnzen (Executive Vice President and Chief People Officer)\nManish Bhatia (Executive Vice President, Global Operations)\nScott J. DeBoer (Executive Vice President, Technology and Products)\nMark Murphy (Executive Vice President and Chief Financial Officer)\nSumit Sadana (Executive Vice President and Chief Business Officer)\nMike Cordano (Senior Vice President, Worldwide Sales)\nMichael Ray (Senior Vice President, Chief Legal Officer and Corporate Secretary)\n\nSubsidiaries\nMicron owns multiple entities around the globe.\n\nMicron Europe Limited\nMicron Japan, Ltd.\nMicron Semiconductor Asia Pte. Ltd.\nMicron Semiconductor (Deutschland) GmbH\nMicron Semiconductor France, SAS\nMicron Semiconductor Korea Co., Ltd.\nMicron Semiconductor Products, Inc.\nMicron Semiconductor (Xiamen) Co., Ltd.\nMicron Technology Services, Inc.\nMicron Technology Asia Pacific, Inc.\nMicron Technology Italia S.r.l.\nMicron Technology Puerto Rico, Inc.\nMicron Technology Services, Inc.\nMicron Technology Texas, LLC\n\nFinancial\nAs of September 2025, Micron had a market cap of $175 billion, making it one of the 100 most valuable companies in the world.\n\nOwnership\nMicron is mainly owned by institutional investors, who hold around 80% of all shares. The 5 largest shareholders in mid-2025 were:\n\nVanguard Group Inc (9.28%)\nBlackrock Inc. (8.23%)\nCapital World Investors (6.33%)\nState Street Corporation (4.59%)\nFidelity Investments (3.73%)\n\nLobbying and political influence\nIn 2025, Micron Technology was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom.\n\nSee also\nList of companies based in Idaho\nList of semiconductor fabrication plants\n\nReferences\nExternal links\n\nOfficial website \nCrucial Micron\nBusiness data for Micron Technology:",
  "clean_text": "Micron Technology, Inc. is an American producer of computer memory and computer data storage including dynamic random-access memory, flash memory, and solid-state drives (SSDs). It is headquartered in Boise, Idaho. Micron's consumer products, including the Ballistix line of consumer and gaming memory modules, are marketed under the Crucial brand. Micron and Intel together created IM Flash Technologies, which produced NAND flash memory. It owned Lexar between 2006 and 2017. Micron is the only U.S.-based manufacturer of memory. History 1978–1999 Micron was founded in Boise, Idaho, in 1978 by Ward Parkinson, Joe Parkinson, Dennis Wilson, and Doug Pitman as a semiconductor design consulting company. Startup funding was provided by local Idaho businessmen Tom Nicholson, Allen Noble, Rudolph Nelson, and Ron Yanke. Later it received funding from Idaho billionaire J. R. Simplot, whose fortune was made in the potato business. In 1981, the company moved from consulting to manufacturing with the completion of its first wafer fabrication unit (\"Fab 1\"), producing 64K DRAM chips. In 1984, the company had its initial public offering. Micron sought to enter the market for RISC processors in 1991 with a product known as FRISC, targeting embedded control and signal processing applications. Running at 80 MHz and described as \"a 64-bit processor with fast context-switching time and high floating-point performance\", the design supported various features for timely interrupt handling and featured an arithmetic unit capable of handling both integer and floating-point calculations with a claimed throughput of 80 MFLOPS for double-precision arithmetic. Micron aimed to provide a \"board-level demonstration supercomputer\" in configurations with 256 MB or 1 GB of RAM. Having set up a subsidiary and with the product being designed into graphics cards and accelerators, Micron concluded in 1992 that the effort would not deliver the \"best bang for the buck\", reassigning engineers to other projects and discontinuing the endeavour. In 1994, founder Joe Parkinson retired as CEO and Steve Appleton took over as Chairman, President, and CEO. A 1996 3-way merger among ZEOS International, Micron Computer, and Micron Custom Manufacturing Services (MCMS) increased the size and scope of the company; this was followed rapidly with the 1997 acquisition of NetFrame Systems, in a bid to enter the mid-range server industry. Between 1998 and 2000, the company was the main sponsor of the MicronPC Bowl, or MicronPC.com Bowl. Since 2000 In 2000, Gurtej Singh Sandhu and Trung T. Doan at Micron initiated the development of atomic layer deposition high-k films for DRAM memory devices. This helped drive cost-effective implementation of semiconductor memory, starting with 90 nm node DRAM. Pitch double-patterning was also pioneered by Gurtej Singh Sandhu at Micron during the 2000s, leading to the development of 30-nm class NAND flash memory, and it has since been widely adopted by NAND flash and RAM manufacturers worldwide. In 2002, Micron spun off its personal computer business as MPC Corporation and put it up for sale. The company found the business difficult as the number 12 American computer maker with only 1.3 percent of the market. Micron and Intel created a joint venture in 2005, based in IM Flash Technologies in Lehi, Utah. The two companies formed another joint venture in 2011, IM Flash Singapore, in Singapore. In 2012 Micron became sole owner of this second joint venture. In 2006 Micron acquired Lexar, an American manufacturer of digital media products. The company again changed leadership in June 2007 with COO Mark Durcan becoming president. In 2008 Micron converted the Avezzano chip fab, formerly a Texas Instruments DRAM fab, into a production facility for CMOS image sensors sold by Aptina Imaging. In 2008, Micron spun off Aptina Imaging, which was acquired by ON Semiconductor in 2014. Micron retained a stake in the spinoff. However, the core company suffered setbacks and had to layoff 15 percent of its workforce in October 2008, during which period the company also announced the purchase of Qimonda's 35.6 percent stake in Inotera Memories for $400 million. The trend of layoffs and acquisitions continued in 2009 with the termination of an additional 2,000 employees, and the acquisition of the FLCOS microdisplay company Displaytech. Micron agreed to buy flash-chip maker Numonyx for $1.27 billion in stock in February 2010. On 3 February 2012, CEO Appleton died in a plane crash shortly after takeoff from the Boise Airport. He was the pilot and sole occupant of the Lancair IV aircraft. Mark Durcan replaced Appleton as the CEO shortly thereafter, eliminating his former title of President. In 2013, the Avezzano chip fab was sold to LFoundry. In the 2012 to 2014 period, Micron again went through an acquisition-layoff cycle, becoming the majority shareholder of Inotera Memories, purchasing Elpida Memory for $2 billion and the remaining shares in Rexchip, a PC memory chip manufacturing venture between Powerchip and Elpida Memory for $334 million, while announcing plans to lay off approximately 3,000 workers. Through the Elpida acquisition, Micron became a major supplier to Apple Inc. for the iPhone and iPad. In December 2016 Micron finished acquiring the remaining 67 percent of Inotera, making it a 100 percent subsidiary of Micron. In April 2017, Micron announced Sanjay Mehrotra as the new president and CEO to replace Mark Durcan. In June 2017 Micron announced it was discontinuing the Lexar retail removable media storage business and putting some or all it up for sale. In August of that year the Lexar brand was acquired by Longsys, a flash memory company based in Shenzhen, China. In May 2018, Micron Technology and Intel launched QLC NAND memory to increase storage density. The company ranked 150th on the Fortune 500 list of largest United States corporations by revenue. In February 2019, the first microSD card with a storage capacity of 1 terabyte (TB) was announced by Micron. As of March 2020 3.84TB Micron 5210 Ion is the cheapest large-capacity SSD in the world. In September 2020 the company introduced the world's fastest discrete graphics memory solution. Working with computing technology leader Nvidia, Micron debuted GDDR6X in the Nvidia GeForce RTX 3090 and GeForce RTX 3080 graphics processing units (GPUs). In November 2020, the company unveiled a new 176-layer 3D NAND module. It offers improved read and write latency and is slated to be used in the production of a new generation of solid-state drives. On 22 October 2021, Micron closed the sale of IM Flash's Lehi, Utah fab to Texas Instruments for a sale price of US$900 million. With the passage of the CHIPS and Science Act, Micron announced its pledge to invest billions in new manufacturing within the US. In September 2022, Micron announced they would invest $15 billion in a new facility in Boise, Idaho. In October 2022 Micron announced a $100 billion expansion in Clay, New York. Micron Technology owed Netlist $445 million in damages for infringing Netlist's patents related to memory-module technology for high-performance computing. The jury found that Micron's semiconductor-memory products violated two of Netlist's patents willfully, potentially allowing the judge to triple the damages. Netlist had sued Micron in 2022, accusing three of its memory-module lines of patent infringement, which Micron denied, also arguing the patents' invalidity. The U.S. Patent and Trademark Office invalidated one patent in April 2024. Lawsuits Fujian Jinhua On 5 December 2017 Micron sued rivals United Microelectronics Corporation and Fujian Jinhua Integrated Circuit Co. (JHICC) in the United States District Court for the Northern District of California, alleging infringement on its DRAM patents and intellectual property rights. The U.S. Justice Department in 2018 announced an indictment against Fujian Jinhua, and authorities added the Chinese firm to the Entity List the same year. Fujian Jinhua vehemently denied the claims, saying it had not stolen any technology, and that \"Micron regards the development of Fujian Jinhua as a threat and adopts various means to hamper and destroy the development of Fujian Jinhua,\" In May 2023, the Cyberspace Administration of China barred major Chinese information infrastructure firms from purchasing Micron products, citing significant national security risks. The move was seen as retaliation against US sanctions on China's semiconductor industry and related export controls. In November 2023 Chinese chipmaker Yangtze Memory Technologies Corp (YMTC) filed a lawsuit against Micron alleging infringement of eight of its patents. On February 27, 2024, Judge Maxine Chesney of the U.S. Federal District Court in San Francisco acquitted Fujian Jinhua Integrated Circuit, whom Micron had sued for IP theft, of the charge in a non-jury verdict, believing that there was insufficient evidence to support the charge. Products Micron’s leading products include the following: HBM3E (high-bandwidth memory) in graphics processing units (GPUs) for data flow into generative AI models. Micron 9400 NVMe™ SSDs for increased capacity in PCIe® Gen4 storage. Universal Flash Storage (UFS) fo storage in smartphones and in automotive and computing systems. LPDDR5X (low-power double-data rate) for mobile phones and thin laptops. LPCAMM2 memory for notebooks with longer battery life and modularity. GDDR7 ultra-bandwidth memory for an increased input/output (I/O) rate in data-hungry workloads. Memory expansion modules using CXL to balance the compute and memory scaling gap. High-capacity DIMMs with single-die packaging with less power consumption. NAND flash memory floating-gate transistor JEDEC-compliant ASIL-D ISO 26262 certified memory products for automotive. Corporate affairs Executive leadership The executive leadership team includes. Sanjay Mehrotra (President and Chief Executive Officer) April Arnzen (Executive Vice President and Chief People Officer) Manish Bhatia (Executive Vice President, Global Operations) Scott J. DeBoer (Executive Vice President, Technology and Products) Mark Murphy (Executive Vice President and Chief Financial Officer) Sumit Sadana (Executive Vice President and Chief Business Officer) Mike Cordano (Senior Vice President, Worldwide Sales) Michael Ray (Senior Vice President, Chief Legal Officer and Corporate Secretary) Subsidiaries Micron owns multiple entities around the globe. Micron Europe Limited Micron Japan, Ltd. Micron Semiconductor Asia Pte. Ltd. Micron Semiconductor (Deutschland) GmbH Micron Semiconductor France, SAS Micron Semiconductor Korea Co., Ltd. Micron Semiconductor Products, Inc. Micron Semiconductor (Xiamen) Co., Ltd. Micron Technology Services, Inc. Micron Technology Asia Pacific, Inc. Micron Technology Italia S.r.l. Micron Technology Puerto Rico, Inc. Micron Technology Services, Inc. Micron Technology Texas, LLC Financial As of September 2025, Micron had a market cap of $175 billion, making it one of the 100 most valuable companies in the world. Ownership Micron is mainly owned by institutional investors, who hold around 80% of all shares. The 5 largest shareholders in mid-2025 were: Vanguard Group Inc (9.28%) Blackrock Inc. (8.23%) Capital World Investors (6.33%) State Street Corporation (4.59%) Fidelity Investments (3.73%) Lobbying and political influence In 2025, Micron Technology was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom."
}