{
  "ticker": "NCLH",
  "cik": "0001513761",
  "company_name": "Norwegian Cruise Line Holdings",
  "corrected_name": "Norwegian Cruise Line Holdings",
  "wiki_title_used": "Norwegian Cruise Line Holdings",
  "exists": true,
  "raw_text": "Norwegian Cruise Line Holdings (NCLH) is a holding company that is based in the United States and domiciled in Bermuda . It operates three cruise lines as wholly owned subsidiaries: Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises. With its subsidiaries combined, it is the third-largest cruise operator in the world. It is a publicly traded company listed on the New York Stock Exchange.\n\nHistory\nNCLH was incorporated on February 21, 2011, as a Bermuda exempted company in anticipation of a planned initial public offering (IPO). At the time, Norwegian Cruise Line was owned by a consortium of Genting Hong Kong, Apollo Management and TPG Capital. Following the completion of the IPO in January 2013 and its debut on the Nasdaq, Norwegian Cruise Line and NCLH underwent a corporate reorganisation that gave NCLH full ownership of Norwegian Cruise Line, while Norwegian Cruise Line's previous owners exchanged their stakes for shares in NCLH.\nImmediately after the initial public offering, public shareholders controlled 13.3% of NCLH, while Genting Hong Kong owned a 43.4% stake, Apollo 32.5%, and TPG 10.8%. In the following years, those three sponsors progressively reduced their stakes through a series of secondary public offerings. By the end of 2014, nearly half of NCLH's shares were publicly owned, with Genting, Apollo and TPG controlling 25%, 24% and 7%, respectively. One year later, combined ownership among the three firms had been cut nearly in half, with Apollo now holding the largest individual stake (15.8%), followed by Genting (11.1%) and TPG (2.4%). Eventually, on 3 December 2018, Apollo and Genting sold off their remaining stakes in the company, marking the end of a relationship that lasted more than a decade.\nIn September 2014, NCLH announced that it had purchased Prestige Cruise Holdings, the parent company of Oceania Cruises and Regent Seven Seas Cruises in cash and stock for a total transaction consideration of $3.025 billion, including the assumption of debt.\nOn 9 January 2015, Kevin Sheehan, President and CEO, was succeeded by Frank Del Rio, co-founder of Oceania Cruises.\nOn 14 December 2015, NCLH was added to the Nasdaq-100 index. However, it later switched its listing from NASDAQ to the New York Stock Exchange on 19 December 2017, and it was removed from the index.\nIn June 2018, NCLH's Chairman Walter Revell stepped down, and was replaced by Miami Beach developer Russell Galbut.\nAs of 2018, it is the third-largest cruise operator in the world, collectively controlling 9.5% of the cruise market by passengers and 12.6% by revenue across its three subsidiaries.\n\n2019–2020 Covid-19 pandemic\nOn March 14, 2020, the U.S. Centers for Disease Control and Prevention issued a No Sail Order for cruise ships.  Concurrently Norwegian Cruise Line Holdings implemented a suspension of all cruise voyages across its three brands, with all 28 ships in port or at anchor and all passengers disembarked by March 28, 2020.  This suspension had subsequently been extended through June 30, 2020.\nOn May 5, 2020, in a filing with the U.S. Securities and Exchange Commission, Norwegian Cruise Line Holdings said there is “substantial doubt” about its ability to continue as a “going concern” as it faces a liquidity crunch over the next twelve months.\nRemarkably, by the next day, NCLH was able to secure over $2.2 billion of additional liquidity in oversubscribed capital markets transactions, but at a price: (1) $400 million in common stock at $11 per share; (2) $675 million in senior secured notes due 2024 at a 12.25% interest rate; (3) $750 million in exchangeable notes due 2024 at 6% interest rate, and exchangeable at any time into common shares at $13.75; and (4) $400 million private investment from a global private equity firm.  On May 7, 2020, NCLH CEO declared that the company has secured enough liquidity to get through potentially 18 months of zero revenues and may resume cruising later in 2020.\nAlthough revenue plummeted 99% year to date, and with a net loss of $715 million in the second quarter, not to mention cruises canceled until at least November, CEO Frank Del Rio commented that he expects relaunch to take 6+ months once cruising fully begins again.\nThe \"no-sail\" order from the CDC was extended through December 31, 2020.\n\nSubsidiaries\nNCLH fully owns three subsidiary cruise lines or brands:\n\nNorwegian Cruise Line\nOceania Cruises\nRegent Seven Seas Cruises\n\nReferences\nExternal links\nOfficial website\nWebsite for NCLH investor information\nBusiness data for Norwegian Cruise Line Holdings Ltd.:",
  "clean_text": "Norwegian Cruise Line Holdings (NCLH) is a holding company that is based in the United States and domiciled in Bermuda . It operates three cruise lines as wholly owned subsidiaries: Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises. With its subsidiaries combined, it is the third-largest cruise operator in the world. It is a publicly traded company listed on the New York Stock Exchange. History NCLH was incorporated on February 21, 2011, as a Bermuda exempted company in anticipation of a planned initial public offering (IPO). At the time, Norwegian Cruise Line was owned by a consortium of Genting Hong Kong, Apollo Management and TPG Capital. Following the completion of the IPO in January 2013 and its debut on the Nasdaq, Norwegian Cruise Line and NCLH underwent a corporate reorganisation that gave NCLH full ownership of Norwegian Cruise Line, while Norwegian Cruise Line's previous owners exchanged their stakes for shares in NCLH. Immediately after the initial public offering, public shareholders controlled 13.3% of NCLH, while Genting Hong Kong owned a 43.4% stake, Apollo 32.5%, and TPG 10.8%. In the following years, those three sponsors progressively reduced their stakes through a series of secondary public offerings. By the end of 2014, nearly half of NCLH's shares were publicly owned, with Genting, Apollo and TPG controlling 25%, 24% and 7%, respectively. One year later, combined ownership among the three firms had been cut nearly in half, with Apollo now holding the largest individual stake (15.8%), followed by Genting (11.1%) and TPG (2.4%). Eventually, on 3 December 2018, Apollo and Genting sold off their remaining stakes in the company, marking the end of a relationship that lasted more than a decade. In September 2014, NCLH announced that it had purchased Prestige Cruise Holdings, the parent company of Oceania Cruises and Regent Seven Seas Cruises in cash and stock for a total transaction consideration of $3.025 billion, including the assumption of debt. On 9 January 2015, Kevin Sheehan, President and CEO, was succeeded by Frank Del Rio, co-founder of Oceania Cruises. On 14 December 2015, NCLH was added to the Nasdaq-100 index. However, it later switched its listing from NASDAQ to the New York Stock Exchange on 19 December 2017, and it was removed from the index. In June 2018, NCLH's Chairman Walter Revell stepped down, and was replaced by Miami Beach developer Russell Galbut. As of 2018, it is the third-largest cruise operator in the world, collectively controlling 9.5% of the cruise market by passengers and 12.6% by revenue across its three subsidiaries. 2019–2020 Covid-19 pandemic On March 14, 2020, the U.S. Centers for Disease Control and Prevention issued a No Sail Order for cruise ships. Concurrently Norwegian Cruise Line Holdings implemented a suspension of all cruise voyages across its three brands, with all 28 ships in port or at anchor and all passengers disembarked by March 28, 2020. This suspension had subsequently been extended through June 30, 2020. On May 5, 2020, in a filing with the U.S. Securities and Exchange Commission, Norwegian Cruise Line Holdings said there is “substantial doubt” about its ability to continue as a “going concern” as it faces a liquidity crunch over the next twelve months. Remarkably, by the next day, NCLH was able to secure over $2.2 billion of additional liquidity in oversubscribed capital markets transactions, but at a price: (1) $400 million in common stock at $11 per share; (2) $675 million in senior secured notes due 2024 at a 12.25% interest rate; (3) $750 million in exchangeable notes due 2024 at 6% interest rate, and exchangeable at any time into common shares at $13.75; and (4) $400 million private investment from a global private equity firm. On May 7, 2020, NCLH CEO declared that the company has secured enough liquidity to get through potentially 18 months of zero revenues and may resume cruising later in 2020. Although revenue plummeted 99% year to date, and with a net loss of $715 million in the second quarter, not to mention cruises canceled until at least November, CEO Frank Del Rio commented that he expects relaunch to take 6+ months once cruising fully begins again. The \"no-sail\" order from the CDC was extended through December 31, 2020. Subsidiaries NCLH fully owns three subsidiary cruise lines or brands: Norwegian Cruise Line Oceania Cruises Regent Seven Seas Cruises"
}