{
  "ticker": "NDSN",
  "cik": "0000072331",
  "company_name": "Nordson Corporation",
  "corrected_name": "Nordson Corporation",
  "wiki_title_used": "Nordson Corporation",
  "exists": true,
  "raw_text": "Nordson Corporation is an American multinational corporation that designs and manufactures dispensing equipment for consumer and industrial adhesives, sealants and coatings. The company also manufactures equipment used in the testing and inspection of electronic components, technology-based systems \nfor curing and surface treatment processes as well as medical devices and component technologies. The company is headquartered in Westlake, Ohio, and has direct operations and sales-support offices in approximately 30 countries.\n\nAcquisitions\nIn November 2022, it was announced Nordson Corporation had completed the acquisition of the Minneapolis, Minnesota-headquartered developer and manufacturer of high-precision 3D optical sensing technology, CyberOptics Corporation.\nIn August 2023, Nordson completed the acquisition of ARAG Group of Italy for €960 million in an all-cash deal.\n\nCorporate structure and company culture\nNordson Corporation is headquartered in Westlake, Ohio, U.S., with its Global Headquarters located at 28601 Clemens Road, Westlake, Ohio 44145-4551. The company operates globally and comprises nine distinct divisions, each serving unique industry sectors:\n\nNordson Adhesive Dispensing Systems\nNordson EFD (Engineered Fluid Dispensing)\nNordson Electronics Solutions\nNordson Industrial Coating Solutions\nNordson Measurement & Control\nNordson Medical\nNordson Polymer Processing Systems\nNordson Precision Agriculture\nNordson Test & Inspection\nThere are facilities and sales-support offices in approximately 30 countries.\n\nFinance\nKey financial trends for Nordson Corporation are based on fiscal years ending October 31:\n\nReferences\nExternal links\nBusiness data for Nordson Corporation:",
  "clean_text": "Nordson Corporation is an American multinational corporation that designs and manufactures dispensing equipment for consumer and industrial adhesives, sealants and coatings. The company also manufactures equipment used in the testing and inspection of electronic components, technology-based systems for curing and surface treatment processes as well as medical devices and component technologies. The company is headquartered in Westlake, Ohio, and has direct operations and sales-support offices in approximately 30 countries. Acquisitions In November 2022, it was announced Nordson Corporation had completed the acquisition of the Minneapolis, Minnesota-headquartered developer and manufacturer of high-precision 3D optical sensing technology, CyberOptics Corporation. In August 2023, Nordson completed the acquisition of ARAG Group of Italy for €960 million in an all-cash deal. Corporate structure and company culture Nordson Corporation is headquartered in Westlake, Ohio, U.S., with its Global Headquarters located at 28601 Clemens Road, Westlake, Ohio 44145-4551. The company operates globally and comprises nine distinct divisions, each serving unique industry sectors: Nordson Adhesive Dispensing Systems Nordson EFD (Engineered Fluid Dispensing) Nordson Electronics Solutions Nordson Industrial Coating Solutions Nordson Measurement & Control Nordson Medical Nordson Polymer Processing Systems Nordson Precision Agriculture Nordson Test & Inspection There are facilities and sales-support offices in approximately 30 countries. Finance Key financial trends for Nordson Corporation are based on fiscal years ending October 31:"
}