{
  "ticker": "NEE",
  "cik": "0000753308",
  "company_name": "NextEra Energy",
  "corrected_name": "NextEra Energy",
  "wiki_title_used": "NextEra Energy",
  "exists": true,
  "raw_text": "NextEra Energy, Inc. is an American energy company that is the world's largest electric utility holding company by market capitalization, with a valuation of over $170 billion as of Oct 2024. NextEra Energy had revenues of $24.8 billion and 16,700 employees throughout the US and Canada in 2024. It has a current generating capacity of 73 gigawatts. Its subsidiaries include Florida Power & Light (FPL), NextEra Energy Resources (NEER), XPLR Energy Partners, and NextEra Energy Services.\nFPL, the largest of its subsidiaries, is the third largest electric utility company in the United States. NEER, together with its affiliated entities, is the world's largest generator of renewable energy from wind and solar. In addition to wind and solar, NextEra Energy Resources owns and operates generating plants powered by natural gas, nuclear energy, and oil. As of March 2025, approximately 36% of NextEra Energy's generating capacity was from fossil fuels and non-renewables, down from 41% in 2020.\n\nCorporate history\nNextEra Energy traces its origins to 1925 with the formation of Florida Power & Light and the formation of FPL Group in 1984.\nThe company purchased Colonial Penn in 1985 and sold it in 1991. In 1998, FPL Group created FPL Energy, a subsidiary to manage FPL Group efforts outside of FPL's service area. The same year, the company moved to acquire 37 power stations in Maine, Massachusetts, and New Jersey. After a federal ruling would have limited the company's access to the New England power grid, FPL Group attempted to break off its purchase agreement in Maine, but ultimately completed the purchase in March 1999.\nThrough the early 2000s, FPL Group was the subject of multiple merger discussions, including with Iberdrola, Entergy, and Constellation Energy.\nIn 2005, FPL Group acquired Gexa Energy.  \nIn 2007, Florida's Public Service Commission rejected a plan by NextEra Energy to build a coal-burning power plant on 5,000 acres (20 km2) in Moore Haven, Florida, near the Everglades National Park. The National Park Service raised concerns that the coal plant would contaminate Lake Okeechobee with mercury and harm the Everglades.\nIn 2008 the Environmental Protection Agency recognized FPL Group for achieving its goal to reduce its emissions by 21 percent per kilowatt hour. The FPL Group Foundation, the company's philanthropic arm, donated $1 million to the Salvation Army in 2009 to help customers pay their power bills. The following year, FPL Group rebranded as NextEra Energy. At the time, it provided electricity in 28 U.S. states and Canada.\nThe 2010s saw additional merger and acquisition attempts by NEE, including with Hawaiian Electric Industries, Oncor Electric Delivery, SCANA, Santee Cooper, and Gulf Power Company. Of these, only the Gulf Power acquisition was successful. The acquisition was completed in January 2019 and NEE merged Gulf Power with FPL in January 2022. As part of the deal, NEE also acquired Plant Oleander and a 65 percent stake in the Stanton Energy Center natural gas power plants.\nIn July 2013, NextEra Energy partnered with Spectra Energy in a $3 billion investment for the construction of a natural gas pipeline in Florida. \nNextEra Energy subsidiary New Hampshire Transmission (NHT) reached a $6.8 million settlement with the Federal Energy Regulatory Commission (FERC) in 2016 after charging customers for the development of an electric power transmission project that was not approved. During the 2016 Republican Party presidential primaries, NextEra Energy donated $1 million to a super PAC supporting Jeb Bush's candidacy.\nIn August 2016, NextEra Energy sold $1.5 billion in equity to Mizuho Securities, Credit Suisse and Goldman Sachs.\nIn 2018, NextEra Energy and Entergy left the Nuclear Energy Institute. In February of that year, it filed a lawsuit against the Institute alleging that the trade group had inappropriately cut off its access to a database of nuclear power workers. The lawsuit stated NEE disagreed with the Institute's priorities and that the trade group was advocating for policies that would be damaging to NextEra Energy's business; it also alleged the group was extorting NextEra Energy for $860,000 to regain access to the database. The Institute called the allegations \"baseless\". A judge in Florida rejected NEE's claims in September 2018.\nIn June 2018, the United States Court of Appeals for the Eleventh Circuit rejected NextEra Energy's claim for a $97 million tax deduction for $200 million paid in contract fees to the federal government toward the Nuclear Waste Fund. NextEra Energy sought to deduct payments made between 2003 and 2010 for \"the disposal of radioactive waste produced by nuclear power plants\".\nIn August 2018, NextEra Energy received a cease and desist order by Oklahoma state officials concerning the construction of wind turbines violating a state law intended to protect open air space. The law requires that developers obtain appropriate permitting from the Federal Aviation Administration or the United States Department of Defense. NextEra Energy had filed obstruction evaluation cases for the construction of wind turbines in Oklahoma with the FAA in March 2018, but the FAA had yet to issue determinations at the time that the cease and desist order was issued. The construction of the wind farm was cancelled in May 2019.\nIn 2022, NextEra paid $8 million for the deaths of over 150 eagles at wind farms missing eagle permits.\nIn June 2024 the company sold $2 billion in equity to BofA Securities and Wells Fargo Securities.\n\nLobbying and political influence\nIn 2025, NextEra was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom.\n\nCriticism\nAvangrid transmission line project\nIn 2021, NextEra lobbied heavily against a transmission line project proposed by Avangrid, Inc. The 145-mile line, to be known as New England Clean Energy Connect, would have delivered hydroelectric power from Quebec to utilities in Massachusetts and Maine. The hydropower would have provided competition to NextEra's oil-fired power plant in Yarmouth. “In doing so,” Avangrid wrote, “NextEra is purposely trying to thwart the goals of Maine and Massachusetts to obtain more renewable power.” According to Daily Energy Insider, Avangrid had obtained every regulatory approval required at the state and federal levels, and the project was supported by Maine Gov. Janet Mills, Massachusetts Gov. Charlie Baker, U.S. Energy Secretary Jennifer Granholm, and the stateʻs major newspapers. In November 2021, the voters of Maine approved a ballot initiative to prohibit construction of the $1 billion transmission line project, which had been represented as a choice between clean energy and the protection of pristine woodlands.\n\nSolar power ballot initiatives\nNextEra Energy has backed failed ballot amendment campaigns to impose fees and barriers to installations of rooftop solar panels. In 2016, Florida Power & Light, which is a subsidiary of NextEra Energy, partnered with Devon Energy, and Tampa Electric Company. Together, they spent $20 million promoting a failed ballot initiative in Florida that would have restricted rooftop solar installations. “Over the last several years, NextEra has been very aggressive against customer-owned solar,” says Alissa Schafer, a researcher with the Energy and Policy Institute, a clean energy advocacy group.\nIn 2021, investigative reporting by the Miami Herald revealed that NextEra Energy had lobbied Florida legislators to undermine rooftop solar by preventing homeowners and businesses to engage in net metering (selling excess power back to FPL). NextEra Energy made a $10,000 donation to Women Building the Future, drafted a bill, had their lobbyist deliver the bill to Florida legislator Jennifer Bradley, and subsequently donated $10,000 to her re-election campaign. “This is a tired tactic that utilities have used to maintain their monopoly grip on electricity markets,” said Will Giese, southeast regional director for the Solar Energy Industries Association. Opponents of the legislation claimed that if such bills pass, the fast-growing green power industry would quickly start to collapse.\n\nFlorida legislature candidates\nIn 2021, investigative reporting by the Orlando Sun Sentinel revealed that FPL gave more than $3 million to political consultants to promote \"ghost\" spoiler candidates in key Florida legislature races. The spoiler candidates were on the ballot as a no-party option and were intended to confuse voters and dilute support for the Democratic candidate in each race. An accomplice named \"Rodriguez\" ran as a sham candidate and siphoned away votes from the Democratic candidate, also named Rodriguez. The mailing campaign employed the language of the Democratic candidate and had the accomplice focusing on fixing health care, and fighting climate change, all paid for by new, out-of-state political committees. The Democrats lost by a mere thirty-two votes. Former senator Frank Artiles and his accomplice were each charged with three third-degree felony charges related to violating campaign finance law, conspiracy to make campaign contributions in excess of legal limits, also making these excess contributions, and false swearing in connection to an election.\nArtiles has for years associated with Florida utilities, including NextEra and its subsidiary FPL. Artiles obtained over $30,000 in political contributions from Florida utilities throughout his time in office, which included a direct contribution of $6,000 from NextEra. Veterans for Conservative Principles, his political committee, accepted close to $13,000 from NextEra. Prior to his resignation from the Florida Senate in April 2017, Artiles fast-tracked pro-utility bills as former chairman of the Florida Senate’s Communications, Energy and Public Utilities Committee, including a bill that would have permitted NextEra to charge its fracking costs to Florida ratepayers.\nIn 2018, Senator Keith Perry won re-election against Democrat Kayser Enneking by around 2,000 votes, due to independent Charles Goston pulling votes away from Enneking. According to the Sentinel, FPL donated $14.15 million to a political ad nonprofit whose consultants were connected to one of the groups that paid for Goston's ads. FPL has also donated $20,000 to Perry’s political committee, Building a Prosperous Florida. The year before, Perry voted in support of NextEra’s exploratory fracking legislation while serving on the committee chaired by Artiles. Perry has accepted $13,500 in direct political donations from Florida utilities, including $1,000 from NextEra, according to campaign finance filings.\n\nReferences\nExternal links\nOfficial website\nBusiness data for NextEra Energy, Inc.:",
  "clean_text": "NextEra Energy, Inc. is an American energy company that is the world's largest electric utility holding company by market capitalization, with a valuation of over $170 billion as of Oct 2024. NextEra Energy had revenues of $24.8 billion and 16,700 employees throughout the US and Canada in 2024. It has a current generating capacity of 73 gigawatts. Its subsidiaries include Florida Power & Light (FPL), NextEra Energy Resources (NEER), XPLR Energy Partners, and NextEra Energy Services. FPL, the largest of its subsidiaries, is the third largest electric utility company in the United States. NEER, together with its affiliated entities, is the world's largest generator of renewable energy from wind and solar. In addition to wind and solar, NextEra Energy Resources owns and operates generating plants powered by natural gas, nuclear energy, and oil. As of March 2025, approximately 36% of NextEra Energy's generating capacity was from fossil fuels and non-renewables, down from 41% in 2020. Corporate history NextEra Energy traces its origins to 1925 with the formation of Florida Power & Light and the formation of FPL Group in 1984. The company purchased Colonial Penn in 1985 and sold it in 1991. In 1998, FPL Group created FPL Energy, a subsidiary to manage FPL Group efforts outside of FPL's service area. The same year, the company moved to acquire 37 power stations in Maine, Massachusetts, and New Jersey. After a federal ruling would have limited the company's access to the New England power grid, FPL Group attempted to break off its purchase agreement in Maine, but ultimately completed the purchase in March 1999. Through the early 2000s, FPL Group was the subject of multiple merger discussions, including with Iberdrola, Entergy, and Constellation Energy. In 2005, FPL Group acquired Gexa Energy. In 2007, Florida's Public Service Commission rejected a plan by NextEra Energy to build a coal-burning power plant on 5,000 acres (20 km2) in Moore Haven, Florida, near the Everglades National Park. The National Park Service raised concerns that the coal plant would contaminate Lake Okeechobee with mercury and harm the Everglades. In 2008 the Environmental Protection Agency recognized FPL Group for achieving its goal to reduce its emissions by 21 percent per kilowatt hour. The FPL Group Foundation, the company's philanthropic arm, donated $1 million to the Salvation Army in 2009 to help customers pay their power bills. The following year, FPL Group rebranded as NextEra Energy. At the time, it provided electricity in 28 U.S. states and Canada. The 2010s saw additional merger and acquisition attempts by NEE, including with Hawaiian Electric Industries, Oncor Electric Delivery, SCANA, Santee Cooper, and Gulf Power Company. Of these, only the Gulf Power acquisition was successful. The acquisition was completed in January 2019 and NEE merged Gulf Power with FPL in January 2022. As part of the deal, NEE also acquired Plant Oleander and a 65 percent stake in the Stanton Energy Center natural gas power plants. In July 2013, NextEra Energy partnered with Spectra Energy in a $3 billion investment for the construction of a natural gas pipeline in Florida. NextEra Energy subsidiary New Hampshire Transmission (NHT) reached a $6.8 million settlement with the Federal Energy Regulatory Commission (FERC) in 2016 after charging customers for the development of an electric power transmission project that was not approved. During the 2016 Republican Party presidential primaries, NextEra Energy donated $1 million to a super PAC supporting Jeb Bush's candidacy. In August 2016, NextEra Energy sold $1.5 billion in equity to Mizuho Securities, Credit Suisse and Goldman Sachs. In 2018, NextEra Energy and Entergy left the Nuclear Energy Institute. In February of that year, it filed a lawsuit against the Institute alleging that the trade group had inappropriately cut off its access to a database of nuclear power workers. The lawsuit stated NEE disagreed with the Institute's priorities and that the trade group was advocating for policies that would be damaging to NextEra Energy's business; it also alleged the group was extorting NextEra Energy for $860,000 to regain access to the database. The Institute called the allegations \"baseless\". A judge in Florida rejected NEE's claims in September 2018. In June 2018, the United States Court of Appeals for the Eleventh Circuit rejected NextEra Energy's claim for a $97 million tax deduction for $200 million paid in contract fees to the federal government toward the Nuclear Waste Fund. NextEra Energy sought to deduct payments made between 2003 and 2010 for \"the disposal of radioactive waste produced by nuclear power plants\". In August 2018, NextEra Energy received a cease and desist order by Oklahoma state officials concerning the construction of wind turbines violating a state law intended to protect open air space. The law requires that developers obtain appropriate permitting from the Federal Aviation Administration or the United States Department of Defense. NextEra Energy had filed obstruction evaluation cases for the construction of wind turbines in Oklahoma with the FAA in March 2018, but the FAA had yet to issue determinations at the time that the cease and desist order was issued. The construction of the wind farm was cancelled in May 2019. In 2022, NextEra paid $8 million for the deaths of over 150 eagles at wind farms missing eagle permits. In June 2024 the company sold $2 billion in equity to BofA Securities and Wells Fargo Securities. Lobbying and political influence In 2025, NextEra was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom. Criticism Avangrid transmission line project In 2021, NextEra lobbied heavily against a transmission line project proposed by Avangrid, Inc. The 145-mile line, to be known as New England Clean Energy Connect, would have delivered hydroelectric power from Quebec to utilities in Massachusetts and Maine. The hydropower would have provided competition to NextEra's oil-fired power plant in Yarmouth. “In doing so,” Avangrid wrote, “NextEra is purposely trying to thwart the goals of Maine and Massachusetts to obtain more renewable power.” According to Daily Energy Insider, Avangrid had obtained every regulatory approval required at the state and federal levels, and the project was supported by Maine Gov. Janet Mills, Massachusetts Gov. Charlie Baker, U.S. Energy Secretary Jennifer Granholm, and the stateʻs major newspapers. In November 2021, the voters of Maine approved a ballot initiative to prohibit construction of the $1 billion transmission line project, which had been represented as a choice between clean energy and the protection of pristine woodlands. Solar power ballot initiatives NextEra Energy has backed failed ballot amendment campaigns to impose fees and barriers to installations of rooftop solar panels. In 2016, Florida Power & Light, which is a subsidiary of NextEra Energy, partnered with Devon Energy, and Tampa Electric Company. Together, they spent $20 million promoting a failed ballot initiative in Florida that would have restricted rooftop solar installations. “Over the last several years, NextEra has been very aggressive against customer-owned solar,” says Alissa Schafer, a researcher with the Energy and Policy Institute, a clean energy advocacy group. In 2021, investigative reporting by the Miami Herald revealed that NextEra Energy had lobbied Florida legislators to undermine rooftop solar by preventing homeowners and businesses to engage in net metering (selling excess power back to FPL). NextEra Energy made a $10,000 donation to Women Building the Future, drafted a bill, had their lobbyist deliver the bill to Florida legislator Jennifer Bradley, and subsequently donated $10,000 to her re-election campaign. “This is a tired tactic that utilities have used to maintain their monopoly grip on electricity markets,” said Will Giese, southeast regional director for the Solar Energy Industries Association. Opponents of the legislation claimed that if such bills pass, the fast-growing green power industry would quickly start to collapse. Florida legislature candidates In 2021, investigative reporting by the Orlando Sun Sentinel revealed that FPL gave more than $3 million to political consultants to promote \"ghost\" spoiler candidates in key Florida legislature races. The spoiler candidates were on the ballot as a no-party option and were intended to confuse voters and dilute support for the Democratic candidate in each race. An accomplice named \"Rodriguez\" ran as a sham candidate and siphoned away votes from the Democratic candidate, also named Rodriguez. The mailing campaign employed the language of the Democratic candidate and had the accomplice focusing on fixing health care, and fighting climate change, all paid for by new, out-of-state political committees. The Democrats lost by a mere thirty-two votes. Former senator Frank Artiles and his accomplice were each charged with three third-degree felony charges related to violating campaign finance law, conspiracy to make campaign contributions in excess of legal limits, also making these excess contributions, and false swearing in connection to an election. Artiles has for years associated with Florida utilities, including NextEra and its subsidiary FPL. Artiles obtained over $30,000 in political contributions from Florida utilities throughout his time in office, which included a direct contribution of $6,000 from NextEra. Veterans for Conservative Principles, his political committee, accepted close to $13,000 from NextEra. Prior to his resignation from the Florida Senate in April 2017, Artiles fast-tracked pro-utility bills as former chairman of the Florida Senate’s Communications, Energy and Public Utilities Committee, including a bill that would have permitted NextEra to charge its fracking costs to Florida ratepayers. In 2018, Senator Keith Perry won re-election against Democrat Kayser Enneking by around 2,000 votes, due to independent Charles Goston pulling votes away from Enneking. According to the Sentinel, FPL donated $14.15 million to a political ad nonprofit whose consultants were connected to one of the groups that paid for Goston's ads. FPL has also donated $20,000 to Perry’s political committee, Building a Prosperous Florida. The year before, Perry voted in support of NextEra’s exploratory fracking legislation while serving on the committee chaired by Artiles. Perry has accepted $13,500 in direct political donations from Florida utilities, including $1,000 from NextEra, according to campaign finance filings."
}