{
  "ticker": "NEM",
  "cik": "0001164727",
  "company_name": "Newmont",
  "corrected_name": "Newmont",
  "wiki_title_used": "Newmont",
  "exists": true,
  "raw_text": "Newmont Corporation is an American gold mining company based in Denver, Colorado. \nIt is the world's largest gold mining corporation. Incorporated in 1921, it holds ownership of gold mines in the United States Canada, Mexico, the Dominican Republic, Australia, Ghana, Argentina, Peru, and Suriname.  Newmont is also a partial owner of Nevada Gold Mines in Nevada with Barrick Mining being the majority owner and operator. In addition to gold, Newmont mines copper, silver, zinc and lead.\nThe Newmont Corporation bought Canadian mining company Goldcorp in 2019 for USD $10 billion. In 2023, Newmont acquired Newcrest mining for USD $16.8 billion.\nNewmont is the only gold mining company listed in the S&P 500, and has approximately 31,600 employees globally (this number does not reflect the approximately 5,000 global employees laid of from August through November 2025).\n\nHistory\nEarly years\nThe Newmont Company was founded in 1916 in New York by Colonel William Boyce Thompson as a holding company to invest in Worldwide mineral, oil, and related companies. According to company lore, the name \"Newmont\" is a portmanteau \"New York\" and \"Montana\", reflecting where Thompson made his fortune and where he grew up. Newmont made its first major gold investment in 1917, with a founding 25 percent in the Anglo American Corporation of South Africa. Four years later, in 1921, the Newmont Company reincorporated as the Newmont Corporation.\nIn 1929, Newmont became a mining company with its first gold product by acquiring California's Empire Star Mine. By 1939, Newmont was operating 12 gold mines in North America.\nThe company acquired interests overseas. For decades around the middle of the 20th century, Newmont had a controlling interest in the Tsumeb mine in Namibia and in the O'Okiep Copper Company in Namaqualand, South Africa.\nBeginning in 1925, Newmont acquired interests in a Texas oil field. Eventually, Newmont's oil interests included more than 70 blocks in the Louisiana, Gulf of Mexico area and oil and gas production in the North Sea.\nFred Searls became president in 1947, after serving as the company's exploration geologist.  Searls retired in 1954, and Plato Malozemoff took over as president.\n\nNewmont began mining at Carlin, Nevada, in 1965. The \"Carlin Trend\" or \"Carlin Unconformity\" is the largest gold discovery in North America during the 20th century. In 1971 Newmont began heap leaching low grade ores there.\nIn 1971, the South-West African (now Namibia) Tsumeb & Kombat mines managed by Newmont, had its operations stopped during the 1971–72 Namibian contract workers strike over the contract labor system and apartheid.\n\nMajor growth\nIn the 1980s, Newmont thwarted five takeover bids – from Consolidated Gold Fields (ConsGold), T. Boone Pickens, Minorco, Hanson Industries and James Goldsmith – who sought to break Newmont apart and sell its assets in an attempt to increase shareholder value.\nIn 1987, defending against a $6.3 billion bid by T. Boone Pickens, the company paid a US$33 per share special dividend to all shareholders, US$2.2 billion in cash, of which US$1.75 billion was borrowed. To reduce this debt the company undertook a divestment program involving all of its copper, oil, gas, and coal interests.\nAs a further step in the restructuring, the company moved its headquarters from New York City to Denver in 1988. A decade later, Newmont Mining Corporation and Newmont Gold Company combined assets to form a unified worldwide gold company. Shareholders of both companies had identical interests in the reserves, production and earnings of Newmont Gold's operations.\nNewmont then merged with Santa Fe Railroad (a former Atchison, Topeka & Santa Fe Railway subsidiary, sold in preparation for the merger that produced the BNSF) to form North America's largest gold producer.\nOn June 21, 2000, Newmont announced a merger with Battle Mountain Gold. The merger was completed in January 2001.\nIn February 2002, Newmont completed the acquisition of Normandy Mining and Franco-Nevada. Newmont faced competition in its bid for Normandy from AngloGold. By eventually outbidding the South African company, Newmont became the world's largest gold producer, with an annual production in excess of 8 million ounces.\nIn 2007, the company eliminated its 1.5 million ounce legacy hedge book to make Newmont the world's largest unhedged gold producer. The following year, Newmont acquired Miramar Mining Corporation and its Hope Bay deposit in the Canadian Arctic.\nIn 2009, Newmont purchased the remaining one-third interest in Boddington Gold Mine from AngloGold Ashanti, bringing its ownership to 100 percent.\nIn April 2011, the company acquired Canada's Fronteer Gold Inc. for CA$2.3 billion. This made the company the world's second-largest gold producer.\nIn 2017, Newmont produced 5.65 million ounces of gold at all-in sustaining costs of US$924 per ounce. The company reported adjusted net income of $780 million for the year, and further reduced net debt down to US$0.8 billion.\nIn 2019, it acquired Canada's Goldcorp for $10 billion. In May 2023, Newmont agreed terms to purchase Newcrest. The Deal was completed in November 2023. \nIn September 2025, it was announced that Natascha Viljoen would succeed Tom Palmer as CEO of Newmont, effective January 2026, when Palmer retires.\n\nControversies\nBuyat Bay, Sulawesi, Indonesia\nIn August 2004, the Indonesian Ministry of Environment filed a civil lawsuit against Newmont, claiming tailings from the company's Minahasa Raya mine polluted Buyat Bay. The company was cleared by an Indonesian court, with the judge ruling the pollution charges could not be proven.\n\nGhana\nIn 2009, Newmont earned the ironic Public Eye on Davos award (a criticism for \"purely profit-oriented globalization\") for its Akyem project in Ghana. Newmont said the award was issued based on several paragraphs of text which “clearly were intended to distort the facts”.\nIn 2010, Newmont was fined $4.9 million by the Ghanaian Environmental Protection Agency for not preventing, reporting and investigating a cyanide spill at Ahafo mine in an \"appropriate and timely manner\".\n\nAustralia\nIn May 2025, Newmont Corporation was fined $350,000 by the New South Wales Environment Protection Authority for envioronmental violations discovered at the company's Cadia gold mine. The ventilation site exceeded the limits for airborne solid dust particles on five occasions between 2021 and 2023. In addition to the fine, Newmont was ordered to pay NSW's Department of Climate Change, Energy, the Environment and Water $61,500 to fund a new dust monitoring system.\n\nOperations\nFormer operations\nNewmont has purchased and sold a number of operations in recent years:\n\nRed Lake Mine: Newmont completed sale of Red Lake mine for $375 million on March 31, 2020.\nContinental Gold: Newmont sold its 19.9 percent equity stake and convertible bond in Continental Gold Inc. for $260 million on March 5, 2020.\nSuper Pit gold mine: Newmont sold its 50 percent stake in Kalgoorlie Consolidated Gold Mines to Northern Star Resources for $800 million in January 2020.\nGolden Grove Mine: Owned by Normandy Mining since 1991, Golden Grove was acquired by Newmont Australia Ltd in February 2002 when Newmont took over Normandy. Newmont sold the mine to Oxiana Limited in June 2005 for A$265 million.\nPajingo: Pajingo (100% owned) is an underground mine located approximately 93 miles (150 kilometers) southwest of Townsville, Queensland, and 45 miles (72 kilometers) south of the local township of Charters Towers. Newmont sold the mine in late 2007; it is now owned by Conquest Mining.\nBronzewing Gold Mine: View Resources purchased the mine in July 2004 from Newmont for A$9.0 million, a package that also included the Mount McClure mining operation, 8 km west of Bronzewing.\nWiluna Gold Mine: Also part of the Normandy acquisition, in December 2003 Newmont sold Wiluna to a local management buyout team for shares and A$3.65 million in cash. The mine was onsold 3 years later for A$29.5 million.\nZarafshan: Newmont was part of a joint venture gold project in Uzbekistan, the first major Western investment in the region since the breakup of the Soviet Union. A difficult place to operate, Uzbekistan expropriated the company's assets in 2006.\nKori Kollo:  The Kori Kollo open pit mine is on a high plain in northwestern Bolivia near Oruro, on government mining concessions issued to a Bolivian corporation, Empresa Minera Inti Raymi S.A. (“Inti Raymi”), in which Newmont had an 88% interest. The remaining  12% was owned by Mrs. Beatriz Rocabado. Inti Raymi owned and operated the mine. On July 23, 2009, Newmont announced the transfer of its interest in Empresa Minera Inti Raymi S.A., which owned the Kori Kollo gold mine and Kori Chaca gold mine, to Compania Procesadora de Minerales S.A. (\"CPM\"), a company controlled by Newmont's long-time Bolivian partner Jose Mercado.\nMinahasa:  Newmont owns 80% of Minahasa and the remaining 20% interest is a carried interest held by P.T. Tanjung Serapung, an unrelated Indonesian company. Minahasa is located on the island of Sulawesi, approximately 1,500 miles (2,414 kilometers) northeast of Jakarta. Mining was completed in late 2001 and gold production was completed in 2004.\nGolden Giant:  Newmont's Canadian operations previously included two underground mines. Golden Giant (100% owned) was located approximately 25 miles (40 kilometers) east of Marathon, Ontario, Canada, and had been in production since 1985. Mining operations at Golden Giant were completed in December 2005 with remnant mining and milling production continuing throughout most of 2006.\nHolloway:  Holloway was located approximately 35 miles (56 kilometers) east of Matheson, Ontario, and about 400 miles (644 kilometers) northeast of Golden Giant. It was in production since 1996. On November 6, 2006, Newmont completed the sale of the Holloway mine to St. Andrews Goldfields Ltd. resulting in a $13 pre-tax gain.\nMartha Mine: Newmont completed the sale of its Waihi assets in New Zealand in October 2015.\nBatu Hijau mine: Newmont completed the sale of Batu Hijau to PT Amman Mineral Internasional in 2016.\n\nReferences\nFurther reading\nMorris, Jack H. (2010). Going for Gold. The History of Newmont Mining Corporation. University of Alabama Press. ISBN 978-0-8173-1677-8.\n\nExternal links\nOfficial website\nBusiness data for Newmont Corporation:",
  "clean_text": "Newmont Corporation is an American gold mining company based in Denver, Colorado. It is the world's largest gold mining corporation. Incorporated in 1921, it holds ownership of gold mines in the United States Canada, Mexico, the Dominican Republic, Australia, Ghana, Argentina, Peru, and Suriname. Newmont is also a partial owner of Nevada Gold Mines in Nevada with Barrick Mining being the majority owner and operator. In addition to gold, Newmont mines copper, silver, zinc and lead. The Newmont Corporation bought Canadian mining company Goldcorp in 2019 for USD $10 billion. In 2023, Newmont acquired Newcrest mining for USD $16.8 billion. Newmont is the only gold mining company listed in the S&P 500, and has approximately 31,600 employees globally (this number does not reflect the approximately 5,000 global employees laid of from August through November 2025). History Early years The Newmont Company was founded in 1916 in New York by Colonel William Boyce Thompson as a holding company to invest in Worldwide mineral, oil, and related companies. According to company lore, the name \"Newmont\" is a portmanteau \"New York\" and \"Montana\", reflecting where Thompson made his fortune and where he grew up. Newmont made its first major gold investment in 1917, with a founding 25 percent in the Anglo American Corporation of South Africa. Four years later, in 1921, the Newmont Company reincorporated as the Newmont Corporation. In 1929, Newmont became a mining company with its first gold product by acquiring California's Empire Star Mine. By 1939, Newmont was operating 12 gold mines in North America. The company acquired interests overseas. For decades around the middle of the 20th century, Newmont had a controlling interest in the Tsumeb mine in Namibia and in the O'Okiep Copper Company in Namaqualand, South Africa. Beginning in 1925, Newmont acquired interests in a Texas oil field. Eventually, Newmont's oil interests included more than 70 blocks in the Louisiana, Gulf of Mexico area and oil and gas production in the North Sea. Fred Searls became president in 1947, after serving as the company's exploration geologist. Searls retired in 1954, and Plato Malozemoff took over as president. Newmont began mining at Carlin, Nevada, in 1965. The \"Carlin Trend\" or \"Carlin Unconformity\" is the largest gold discovery in North America during the 20th century. In 1971 Newmont began heap leaching low grade ores there. In 1971, the South-West African (now Namibia) Tsumeb & Kombat mines managed by Newmont, had its operations stopped during the 1971–72 Namibian contract workers strike over the contract labor system and apartheid. Major growth In the 1980s, Newmont thwarted five takeover bids – from Consolidated Gold Fields (ConsGold), T. Boone Pickens, Minorco, Hanson Industries and James Goldsmith – who sought to break Newmont apart and sell its assets in an attempt to increase shareholder value. In 1987, defending against a $6.3 billion bid by T. Boone Pickens, the company paid a US$33 per share special dividend to all shareholders, US$2.2 billion in cash, of which US$1.75 billion was borrowed. To reduce this debt the company undertook a divestment program involving all of its copper, oil, gas, and coal interests. As a further step in the restructuring, the company moved its headquarters from New York City to Denver in 1988. A decade later, Newmont Mining Corporation and Newmont Gold Company combined assets to form a unified worldwide gold company. Shareholders of both companies had identical interests in the reserves, production and earnings of Newmont Gold's operations. Newmont then merged with Santa Fe Railroad (a former Atchison, Topeka & Santa Fe Railway subsidiary, sold in preparation for the merger that produced the BNSF) to form North America's largest gold producer. On June 21, 2000, Newmont announced a merger with Battle Mountain Gold. The merger was completed in January 2001. In February 2002, Newmont completed the acquisition of Normandy Mining and Franco-Nevada. Newmont faced competition in its bid for Normandy from AngloGold. By eventually outbidding the South African company, Newmont became the world's largest gold producer, with an annual production in excess of 8 million ounces. In 2007, the company eliminated its 1.5 million ounce legacy hedge book to make Newmont the world's largest unhedged gold producer. The following year, Newmont acquired Miramar Mining Corporation and its Hope Bay deposit in the Canadian Arctic. In 2009, Newmont purchased the remaining one-third interest in Boddington Gold Mine from AngloGold Ashanti, bringing its ownership to 100 percent. In April 2011, the company acquired Canada's Fronteer Gold Inc. for CA$2.3 billion. This made the company the world's second-largest gold producer. In 2017, Newmont produced 5.65 million ounces of gold at all-in sustaining costs of US$924 per ounce. The company reported adjusted net income of $780 million for the year, and further reduced net debt down to US$0.8 billion. In 2019, it acquired Canada's Goldcorp for $10 billion. In May 2023, Newmont agreed terms to purchase Newcrest. The Deal was completed in November 2023. In September 2025, it was announced that Natascha Viljoen would succeed Tom Palmer as CEO of Newmont, effective January 2026, when Palmer retires. Controversies Buyat Bay, Sulawesi, Indonesia In August 2004, the Indonesian Ministry of Environment filed a civil lawsuit against Newmont, claiming tailings from the company's Minahasa Raya mine polluted Buyat Bay. The company was cleared by an Indonesian court, with the judge ruling the pollution charges could not be proven. Ghana In 2009, Newmont earned the ironic Public Eye on Davos award (a criticism for \"purely profit-oriented globalization\") for its Akyem project in Ghana. Newmont said the award was issued based on several paragraphs of text which “clearly were intended to distort the facts”. In 2010, Newmont was fined $4.9 million by the Ghanaian Environmental Protection Agency for not preventing, reporting and investigating a cyanide spill at Ahafo mine in an \"appropriate and timely manner\". Australia In May 2025, Newmont Corporation was fined $350,000 by the New South Wales Environment Protection Authority for envioronmental violations discovered at the company's Cadia gold mine. The ventilation site exceeded the limits for airborne solid dust particles on five occasions between 2021 and 2023. In addition to the fine, Newmont was ordered to pay NSW's Department of Climate Change, Energy, the Environment and Water $61,500 to fund a new dust monitoring system. Operations Former operations Newmont has purchased and sold a number of operations in recent years: Red Lake Mine: Newmont completed sale of Red Lake mine for $375 million on March 31, 2020. Continental Gold: Newmont sold its 19.9 percent equity stake and convertible bond in Continental Gold Inc. for $260 million on March 5, 2020. Super Pit gold mine: Newmont sold its 50 percent stake in Kalgoorlie Consolidated Gold Mines to Northern Star Resources for $800 million in January 2020. Golden Grove Mine: Owned by Normandy Mining since 1991, Golden Grove was acquired by Newmont Australia Ltd in February 2002 when Newmont took over Normandy. Newmont sold the mine to Oxiana Limited in June 2005 for A$265 million. Pajingo: Pajingo (100% owned) is an underground mine located approximately 93 miles (150 kilometers) southwest of Townsville, Queensland, and 45 miles (72 kilometers) south of the local township of Charters Towers. Newmont sold the mine in late 2007; it is now owned by Conquest Mining. Bronzewing Gold Mine: View Resources purchased the mine in July 2004 from Newmont for A$9.0 million, a package that also included the Mount McClure mining operation, 8 km west of Bronzewing. Wiluna Gold Mine: Also part of the Normandy acquisition, in December 2003 Newmont sold Wiluna to a local management buyout team for shares and A$3.65 million in cash. The mine was onsold 3 years later for A$29.5 million. Zarafshan: Newmont was part of a joint venture gold project in Uzbekistan, the first major Western investment in the region since the breakup of the Soviet Union. A difficult place to operate, Uzbekistan expropriated the company's assets in 2006. Kori Kollo: The Kori Kollo open pit mine is on a high plain in northwestern Bolivia near Oruro, on government mining concessions issued to a Bolivian corporation, Empresa Minera Inti Raymi S.A. (“Inti Raymi”), in which Newmont had an 88% interest. The remaining 12% was owned by Mrs. Beatriz Rocabado. Inti Raymi owned and operated the mine. On July 23, 2009, Newmont announced the transfer of its interest in Empresa Minera Inti Raymi S.A., which owned the Kori Kollo gold mine and Kori Chaca gold mine, to Compania Procesadora de Minerales S.A. (\"CPM\"), a company controlled by Newmont's long-time Bolivian partner Jose Mercado. Minahasa: Newmont owns 80% of Minahasa and the remaining 20% interest is a carried interest held by P.T. Tanjung Serapung, an unrelated Indonesian company. Minahasa is located on the island of Sulawesi, approximately 1,500 miles (2,414 kilometers) northeast of Jakarta. Mining was completed in late 2001 and gold production was completed in 2004. Golden Giant: Newmont's Canadian operations previously included two underground mines. Golden Giant (100% owned) was located approximately 25 miles (40 kilometers) east of Marathon, Ontario, Canada, and had been in production since 1985. Mining operations at Golden Giant were completed in December 2005 with remnant mining and milling production continuing throughout most of 2006. Holloway: Holloway was located approximately 35 miles (56 kilometers) east of Matheson, Ontario, and about 400 miles (644 kilometers) northeast of Golden Giant. It was in production since 1996. On November 6, 2006, Newmont completed the sale of the Holloway mine to St. Andrews Goldfields Ltd. resulting in a $13 pre-tax gain. Martha Mine: Newmont completed the sale of its Waihi assets in New Zealand in October 2015. Batu Hijau mine: Newmont completed the sale of Batu Hijau to PT Amman Mineral Internasional in 2016."
}