{
  "ticker": "NI",
  "cik": "0001111711",
  "company_name": "NiSource",
  "corrected_name": "NiSource",
  "wiki_title_used": "NiSource",
  "exists": true,
  "raw_text": "NiSource Inc. is one of the largest fully regulated utility companies in the United States, serving approximately 3.5 million natural gas customers and 500,000 electric customers across six states through its local Columbia Gas and NIPSCO brands. The company, based in Merrillville, Indiana, has more than 8,000 employees. As of 2018, NiSource is the sole Indiana-based utility company.\n\nHistory\nNiSource was founded in 1912 as the Northern Indiana Public Service Company, which merged with several other companies to become the Columbia Gas and Electric Corporation. Under the Public Utility Holding Company Act of 1935, Columbia was forced to reorganize its subsidiaries and eventually spun off its electric utilities, becoming the Columbia Gas System. In 2000, NiSource merged with Columbia Energy Group, but in 2015, NiSource was spun off from Columbia Pipeline Group. The next year, Columbia Pipeline Group was acquired by TransCanada Corporation, while the Columbia Gas distribution companies remained with NiSource.\n\nCompany operations\nNiSource's natural gas utilities provide domestically produced supplies of natural gas to residential, commercial and industrial customers via nearly 60,000 miles of pipeline and related facilities in six states: Indiana, Kentucky, Maryland, Ohio, Pennsylvania and Virginia.\nNiSource provides electric energy to nearly 500,000 customers, all located in northern Indiana. NiSource's electric operations include power generation, transmission and local distribution, as well as wholesale and electric transmission transactions. NiSource uses both traditional and renewable generation sources, including natural gas, hydroelectric, wind, and coal generated supplies, providing a total system operating net capability of more than 3,000 megawatts.\nNiSource has had a climate change policy in place since 2009.\nIn 2015, NiSource was named to the Dow Jones Sustainability—North America Index for the second year in a row and for the ninth time since 1999.\n\nInternal organization\nNiSource operates six local utilities in its service region:\n\nNorthern Indiana Public Service Co. (NIPSCO)\nColumbia Gas of Ohio\nColumbia Gas of Kentucky\nColumbia Gas of Pennsylvania\nColumbia Gas of Maryland\nColumbia Gas of Virginia\n\nRecent corporate actions\nOn July 1, 2015, NiSource separated Columbia Pipeline Group (NYSE: CPGX) into a stand-alone publicly traded company. Each NiSource shareholder at the time of the separation received one share of Columbia Pipeline Group for each share of NiSource. The separation of Columbia Pipeline Group included Columbia Gas Transmission, Columbia Gulf Transmission, Columbia Midstream Group, its ownership in Columbia Pipeline Partners (NYSE: CPPL), and other natural gas pipeline, storage and midstream holdings.\nIn January 2019, the company announced that it would accelerate retirement of its five coal-fired units, and focus on \"renewable energy resources, such as solar and wind energy, along with battery storage technology,\" as part of an initiative titled  \"Your Energy, Your Future\", with a goal of \"reducing carbon emissions by more than 90 percent by 2028.\"\n\nCriticism\nIn December 2011, the progressive activist group Public Campaign criticized NiSource for spending $1.83 million on lobbying and not paying any taxes during 2008–2010, instead getting $227 million in tax rebates, despite making a profit of $1.4 billion across those three years. Public Campaign's data is aggregated for all years and does not show annual data. Public Campaign further lambasted NiSource for increasing executive pay by 33% to $11.2 million in 2010 for its top five executives. One rule NiSource, among other companies, benefited from was a bonus depreciation rule that lowered the federal tax expense. \nNiSource responded by stating: \"This law, enacted by Congress, encouraged companies like NiSource to accelerate capital investments to spur economic recovery by permitting portions of these investments to be deducted at an accelerated rate. Only the timing of the deductions was changed, and not the amount that could be deducted.  This means our income tax expense will likely be higher in the future.\"\n\nMassachusetts gas line explosions and exit from Massachusetts\nOn September 13, 2018, 80 homes in Andover, Massachusetts, Lawrence, Massachusetts, and North Andover, Massachusetts, simultaneously exploded and caught fire due to issues with gas lines owned by Columbia Gas of Massachusetts, a subsidiary of NiSource. \nAt least 25 people were injured, and one was killed; residents from parts of three towns had to be evacuated for a few days and electricity service turned off until the area was inspected for gas. Gas service to 8,600 customers was disrupted, in some cases for months. Columbia Gas admitted that maintenance workers mishandled sensors that monitored gas line pressure and pled guilty to violating the federal Pipeline Safety Act. The company paid a fine of $53 million, in addition to a $143 million settlement with residents and businesses, $83 million paid to municipalities, undisclosed amounts paid for injuries and one death, and direct spending on replacing damaged pipelines and appliances. NiSource agreed to sell its Massachusetts gas business to competitor Eversource, at a loss compared to what it paid to acquire Columbia Gas.\n\nReferences\nExternal links\nNiSource homepage\nBusiness data for NiSource:",
  "clean_text": "NiSource Inc. is one of the largest fully regulated utility companies in the United States, serving approximately 3.5 million natural gas customers and 500,000 electric customers across six states through its local Columbia Gas and NIPSCO brands. The company, based in Merrillville, Indiana, has more than 8,000 employees. As of 2018, NiSource is the sole Indiana-based utility company. History NiSource was founded in 1912 as the Northern Indiana Public Service Company, which merged with several other companies to become the Columbia Gas and Electric Corporation. Under the Public Utility Holding Company Act of 1935, Columbia was forced to reorganize its subsidiaries and eventually spun off its electric utilities, becoming the Columbia Gas System. In 2000, NiSource merged with Columbia Energy Group, but in 2015, NiSource was spun off from Columbia Pipeline Group. The next year, Columbia Pipeline Group was acquired by TransCanada Corporation, while the Columbia Gas distribution companies remained with NiSource. Company operations NiSource's natural gas utilities provide domestically produced supplies of natural gas to residential, commercial and industrial customers via nearly 60,000 miles of pipeline and related facilities in six states: Indiana, Kentucky, Maryland, Ohio, Pennsylvania and Virginia. NiSource provides electric energy to nearly 500,000 customers, all located in northern Indiana. NiSource's electric operations include power generation, transmission and local distribution, as well as wholesale and electric transmission transactions. NiSource uses both traditional and renewable generation sources, including natural gas, hydroelectric, wind, and coal generated supplies, providing a total system operating net capability of more than 3,000 megawatts. NiSource has had a climate change policy in place since 2009. In 2015, NiSource was named to the Dow Jones Sustainability—North America Index for the second year in a row and for the ninth time since 1999. Internal organization NiSource operates six local utilities in its service region: Northern Indiana Public Service Co. (NIPSCO) Columbia Gas of Ohio Columbia Gas of Kentucky Columbia Gas of Pennsylvania Columbia Gas of Maryland Columbia Gas of Virginia Recent corporate actions On July 1, 2015, NiSource separated Columbia Pipeline Group (NYSE: CPGX) into a stand-alone publicly traded company. Each NiSource shareholder at the time of the separation received one share of Columbia Pipeline Group for each share of NiSource. The separation of Columbia Pipeline Group included Columbia Gas Transmission, Columbia Gulf Transmission, Columbia Midstream Group, its ownership in Columbia Pipeline Partners (NYSE: CPPL), and other natural gas pipeline, storage and midstream holdings. In January 2019, the company announced that it would accelerate retirement of its five coal-fired units, and focus on \"renewable energy resources, such as solar and wind energy, along with battery storage technology,\" as part of an initiative titled \"Your Energy, Your Future\", with a goal of \"reducing carbon emissions by more than 90 percent by 2028.\" Criticism In December 2011, the progressive activist group Public Campaign criticized NiSource for spending $1.83 million on lobbying and not paying any taxes during 2008–2010, instead getting $227 million in tax rebates, despite making a profit of $1.4 billion across those three years. Public Campaign's data is aggregated for all years and does not show annual data. Public Campaign further lambasted NiSource for increasing executive pay by 33% to $11.2 million in 2010 for its top five executives. One rule NiSource, among other companies, benefited from was a bonus depreciation rule that lowered the federal tax expense. NiSource responded by stating: \"This law, enacted by Congress, encouraged companies like NiSource to accelerate capital investments to spur economic recovery by permitting portions of these investments to be deducted at an accelerated rate. Only the timing of the deductions was changed, and not the amount that could be deducted. This means our income tax expense will likely be higher in the future.\" Massachusetts gas line explosions and exit from Massachusetts On September 13, 2018, 80 homes in Andover, Massachusetts, Lawrence, Massachusetts, and North Andover, Massachusetts, simultaneously exploded and caught fire due to issues with gas lines owned by Columbia Gas of Massachusetts, a subsidiary of NiSource. At least 25 people were injured, and one was killed; residents from parts of three towns had to be evacuated for a few days and electricity service turned off until the area was inspected for gas. Gas service to 8,600 customers was disrupted, in some cases for months. Columbia Gas admitted that maintenance workers mishandled sensors that monitored gas line pressure and pled guilty to violating the federal Pipeline Safety Act. The company paid a fine of $53 million, in addition to a $143 million settlement with residents and businesses, $83 million paid to municipalities, undisclosed amounts paid for injuries and one death, and direct spending on replacing damaged pipelines and appliances. NiSource agreed to sell its Massachusetts gas business to competitor Eversource, at a loss compared to what it paid to acquire Columbia Gas."
}