{
  "ticker": "NKE",
  "cik": "0000320187",
  "company_name": "Nike, Inc.",
  "corrected_name": "Nike, Inc.",
  "wiki_title_used": "Nike, Inc.",
  "exists": true,
  "raw_text": "Nike, Inc. (stylized as NIKE) is an American athletic footwear and apparel corporation headquartered near Beaverton, Oregon. It is the world's largest supplier of athletic shoes and apparel and a major manufacturer of sports equipment, with revenue in excess of US$46 billion in its fiscal year 2022.\nThe company was founded on January 25, 1964, as \"Blue Ribbon Sports\", by Bill Bowerman and Phil Knight, and officially became Nike, Inc. on May 30, 1971. The company takes its name from Nike, the Greek goddess of victory. Nike markets its products under its own brand, as well as Nike Golf, Nike Pro, Nike+, Nike Blazers, Air Force 1, Nike Dunk, Air Max, Foamposite, Nike Skateboarding and Nike CR7. The company also sells products under its Air Jordan brand and its Converse subsidiary. Nike also owned Bauer Hockey from 1995 to 2008, and previously owned Cole Haan, Umbro, and Hurley International. In addition to manufacturing sportswear and equipment, the company operates retail stores under the Niketown name. Nike sponsors many high-profile athletes and sports teams around the world, with the highly recognized trademarks of \"Just Do It\" and the Swoosh logo.\nAs of 2024, it employed 83,700 people worldwide. In 2020, the brand alone was valued in excess of $32 billion, making it the most valuable brand among sports businesses. Previously, in 2017, the Nike brand was valued at $29.6 billion. Nike ranked 89th in the 2018 Fortune 500 list of the largest United States corporations by total revenue. The company ranked 239th in the Forbes Global 2000 companies in 2024.\n\nHistory\nNike, originally known as Blue Ribbon Sports (BRS), was founded by University of Oregon track athlete Phil Knight and his coach, Bill Bowerman, on January 25, 1964. The company initially operated in Eugene, Oregon as a distributor for Japanese shoemaker Onitsuka Tiger, making most sales at track meets out of Knight's automobile.\nAccording to Otis Davis, a University of Oregon student-athlete coached by Bowerman and Olympic gold medalist at the 1960 Summer Olympics, his coach made the first pair of Nike shoes for him, contradicting a claim that they were made for Phil Knight. According to Davis, \"I told Tom Brokaw that I was the first. I don't care what all the billionaires say. Bill Bowerman made the first pair of shoes for me. People don't believe me. In fact, I didn't like the way they felt on my feet. There was no support and they were too tight. But I saw Bowerman made them from the waffle iron, and they were mine\".\nIn its first year in business, BRS sold 1,300 pairs of Japanese running shoes, grossing $8,000. By 1965, sales had reached $20,000. In 1966, BRS opened its first retail store at 3107 Pico Boulevard in Santa Monica, California. In 1967, due to increasing sales, BRS expanded retail and distribution operations on the East Coast, in Wellesley, Massachusetts.\nIn 1971, Bowerman used his wife's waffle iron to experiment on rubber to create a new sole for track shoes that would grip but be lightweight and increase the runner's speed. Oregon's Hayward Field was transitioning to an artificial surface, and Bowerman wanted a sole which could grip to grass or bark dust without the use of spikes. Bowerman was talking to his wife about this puzzle over breakfast, when the waffle iron idea came into play.\nBowerman's design led to the introduction of the \"Moon Shoe\" in 1972, so named because the waffle tread was said to resemble the footprints left by astronauts on the Moon. Further refinement resulted in the \"Waffle Trainer\" in 1974, which helped fuel the explosive growth of Blue Ribbon Sports/Nike.\nTension between BRS and Onitsuka Tiger increased in 1971 as the latter attempted a takeover of BRS by extending an ultimatum proposal that would give the Japanese company 51 percent of BRS. In 1972, the relationship between BRS and Onitsuka Tiger came to an end. BRS prepared to launch its own line of footwear. The previous year, it was already able to place from two Japanese shoe manufacturers the company's first independent order for 20,000, which included 6,000 that had the Nike logo. Runner Jeff Johnson was brought in to help market the new brand and was credited for coining the name “Nike”. It would bear the Swoosh newly designed by Carolyn Davidson. The Swoosh was first used by Nike on June 18, 1971, and was registered with the US Patent and Trademark Office on January 22, 1974.\nIn 1976, the company hired John Brown and Partners, based in Seattle, as its first advertising agency. The following year, the agency created the first \"brand ad\" for Nike, called \"There is no finish line\", in which no Nike product was shown. By 1980, Nike had attained a 50% market share in the US athletic shoe market, and the company went public in December of that year.\nWieden+Kennedy, Nike's primary ad agency, has worked with Nike to create many print and television advertisements, and Wieden+Kennedy remains Nike's primary ad agency. It was agency co-founder Dan Wieden who coined the now-famous slogan \"Just Do It\" for a 1988 Nike ad campaign, which was chosen by Advertising Age as one of the top five ad slogans of the 20th century and enshrined in the Smithsonian Institution. Walt Stack was featured in Nike's first \"Just Do It\" advertisement, which debuted on July 1, 1988. Wieden credits the inspiration for the slogan to \"Let's do it\", the last words spoken by Gary Gilmore before he was executed.\nNike manufactured its first uniforms for a professional sports team in 1979, when its jersey for the Portland Timbers of the North American Soccer League debuted. Throughout the 1980s, Nike expanded its product line to encompass many sports and regions throughout the world. In 1990, Nike moved into its eight-building World Headquarters campus in Beaverton, Oregon. The first Nike retail store, dubbed Niketown, opened in downtown Portland in November of that year.\nPhil Knight announced in mid-2015 that he would step down as chairman of Nike in 2016. He officially stepped down from all duties with the company on June 30, 2016.\nIn a company public announcement on March 15, 2018, Nike CEO Mark Parker said Trevor Edwards, a top Nike executive who was seen as a potential successor to the chief executive, was relinquishing his position as Nike's brand president and would retire in August.\nIn October 2019, John Donahoe was announced as the next CEO, and succeeded Parker on January 13, 2020. In November 2019, the company stopped selling directly through Amazon, focusing more on direct relationships with customers.\n\nAcquisitions\nNike has acquired and sold several apparel and footwear companies over the course of its history. Its first acquisition was the upscale footwear company Cole Haan in 1988, followed by the purchase of Bauer Hockey in 1994. In 2002, Nike bought surf apparel company Hurley International from founder Bob Hurley. In 2003, Nike paid US$309 million to acquire sneaker company Converse. The company acquired Starter in 2004 and soccer uniform maker Umbro in 2007.\nIn order to refocus its business lines, Nike began divesting itself of some of its subsidiaries in the 2000s. It sold Starter in 2007 and Bauer Hockey in 2008. The company sold Umbro in 2012 and Cole Haan in 2013. As of 2020, Nike owns only one subsidiary: Converse Inc.\nNike acquired Zodiac, a consumer data analytics company, in March 2018. In August 2019, the company acquired Celect, a Boston-based predictive analytics company. In December 2021, Nike purchased RTFKT Studios, a virtual shoe company that makes NFTs.\nIn February 2021, Nike acquired Datalogue, a New York-based company focused on digital sales and machine learning technology.\n\nFinance\nNike was made a member of the Dow Jones Industrial Average in 2013, when it replaced Alcoa.\nOn December 19, 2013, Nike's quarterly profit rose due to a 13 percent increase in global orders for merchandise since April of that year. Future orders of shoes or clothes for delivery between December and April, rose to $10.4 billion. Nike shares (NKE) rose 0.6 percent to $78.75 in extended trading.\nIn November 2015, Nike announced it would initiate a $12 billion share buyback, as well as a two-for-one stock split, with shares to begin trading at the decreased price on December 24. The split will be the seventh in company history.\nIn June 2018, Nike announced it would initiate a $15 billion share buyback over four years, to begin in 2019 upon completion of the previous buyback program.\nFor the fiscal year 2018, Nike reported earnings of US$1.933 billion, with annual revenue of US$36.397 billion, an increase of 6.0% over the previous fiscal cycle. Nike's shares traded at over $72 per share, and its market capitalization was valued at over US$114.5 billion in October 2018.\n\nIn February 2020, the company said that roughly 75% of Nike stores in Greater China had closed due to the COVID-19 outbreak. In March 2020, Nike reported a 5% drop in Chinese sales associated with stores' closure. It was the first decrease in six years. At the same time, the company's online sales grew by 36% during Q1 of 2020. Also, the sales of personal training apps grew by 80% in China.\nIn June 2025, Nike warned that President Trump’s new tariffs on key trading partners could add around $1 billion to its costs this year, causing the company to shift some production out of China to reduce its exposure. Despite weaker quarterly revenue, Nike’s shares rose over 10% after a better-than-expected earnings forecast, while the US and China also reached a deal to ease trade tensions.\nThe key trends of Nike are (as at the financial year ending May 31):\n\nLogo evolution\nNotes\n\nProducts\nNike produces a wide range of sports equipment and apparel.\n\nSports apparel\nNike's first apparel products were track running shoes. Nike Air Max is a line of shoes first released by Nike, Inc. in 1987. Additional product lines were introduced later, such as Air Huarache, which debuted in 1992. The most recent additions to their line are the Nike 6.0, Nike NYX, and Nike SB shoes, designed for skateboarding. Nike has recently introduced cricket shoes called Air Zoom Yorker, designed to be 30% lighter than their competitors'. In 2008, Nike introduced the Air Jordan XX3, a high-performance basketball shoe designed with the environment in mind.\nNike's range of products include shoes, jerseys, shorts, cleats, baselayers, etc. for sports activities such as soccer, basketball, track and field, combat sports, tennis, American football, athletics, golf, ice hockey, and cross training for men, women, and children. Nike also sells shoes for activities such as skateboarding, baseball, cycling, volleyball, wrestling, cheerleading, lacrosse, cricket, aquatic activities, auto racing, and other athletic and recreational uses. Nike partnered with Apple Inc. to produce the Nike+ product that monitors a runner's performance via a radio device in the shoe that links to the iPod nano. While the product generates useful statistics, it has been criticized by researchers who were able to identify users' RFID devices from 60 feet (18 m) away using small, concealable intelligence motes in a wireless sensor network.\nIn 2004, Nike launched the SPARQ Training Program/Division. Some of Nike's newest shoes contain Flywire and Lunarlite Foam to reduce weight. The Air Zoom Vomero running shoe, introduced in 2006 and currently in its 11th generation, featured a combination of groundbreaking innovations including a full-length air cushioned sole, an external heel counter, a crashpad in the heel for shock absorption, and Fit Frame technology for a stable fit.\nIn 2023, Nike told ESPN that it would cease using kangaroo skins in its products by the end of that year and debut \"a new Nike-only, proprietary synthetic upper, [with] a new material that is a better performance solution and replaces the use of kangaroo leather.\"\n\nNike Vaporfly\nThe Nike Vaporfly first came out in 2017 and their popularity, along with its performance, prompted a new series of running shoes. The Vaporfly series has a new technological composition that has revolutionized long-distance running since studies have shown that these shoes can improve marathon race time up to 4.2%. The composition of the sole contains a foamy material, Pebax, that Nike has altered and now calls it ZoomX (which can be found in other Nike products as well). Pebax foam can also be found in airplane insulation and is \"squishier, bouncier, and lighter\" than foams in typical running shoes. In the middle of the ZoomX foam there is a full-length carbon fiber plate \"designed to generate extra spring in every step\". At the time of this writing Nike had just released its newest product from the Vaporfly line, the Nike ZoomX Vaporfly NEXT%, which was marketed as \"the fastest shoe we’ve ever made\" using Nike's \"two most innovative technologies, Nike ZoomX foam and VaporWeave material\".\n\nStreet fashions\nThe Nike brand, with its distinctive \"Swoosh\" logo, quickly became regarded as a status symbol in modern urban fashion and hip-hop fashion due to its association with success in sport. Beginning in the 1980s, various items of Nike clothing became staples of mainstream American youth fashion, especially tracksuits, shell suits, baseball caps, Air Jordans, Air Force 1's, and Air Max running shoes with thick, air cushioned rubber soles and contrasting blue, yellow, green, white, or red trim. Limited edition sneakers and prototypes with a regional early release were known as Quickstrikes, and became highly desirable items for teenage members of the sneakerhead subculture.\nBy the 1990s and 2000s, American and European teenagers associated with the preppy or popular clique began combining these sneakers, leggings, sweatpants, crop tops, and tracksuits with regular casual chic street clothes such as jeans, skirts, leg warmers, slouch socks, and bomber jackets. Particularly popular were the unisex spandex Nike Tempo compression shorts worn for cycling and running, which had a mesh lining, waterproofing, and, later in the 2000s, a zip pocket for a Walkman or MP3 player.\nFrom the late 2000s into the 2010s, Nike Elite basketball socks began to be worn as everyday clothes by hip-hop fans and young children. \nOriginally plain white or black, these socks had special shock absorbing cushioning in the sole plus a moisture wicking upper weave. Later, Nike Elite socks became available in bright colors inspired by throwback basketball uniforms, often with contrasting bold abstract designs, images of celebrities, and freehand digital print to capitalize upon the emerging nostalgia for 1990s fashion.\nIn 2015, a new self-lacing shoe was introduced. Called the Nike Mag, which are replicas of the shoes featured in Back to the Future Part II, it had a preliminary limited release, only available by auction with all proceeds going to the Michael J. Fox Foundation. This was done again in 2016.\nNike have introduced a premium line, focused more on streetwear than sports wear called NikeLab.\nIn March 2017, Nike announced its launch of a plus-size clothing line, which will feature new sizes 1X through 3X on more than 200 products. Another significant development at this time was the Chuck Taylor All-Star Modern, an update of the classic basketball sneaker that incorporated the circular knit upper and cushioned foam sole of Nike's Air Jordans.\n\nCollectibles\nOn July 23, 2019, a pair of Nike Inc. running shoes sold for $437,500 at a Sotheby's auction. The so-called \"Moon Shoes\" were designed by Nike co-founder and track coach Bill Bowerman for runners participating in the 1972 Olympics trials. The buyer was Miles Nadal, a Canadian investor and car collector, who had just paid $850,000 for a group of 99 rare of limited collection pairs of sport shoes. The purchase price was the highest for one pair of sneakers, the previous record being $190,373 in 2017 for a pair of signed Converse shoes in California, said to have been worn by Michael Jordan during the 1984 basketball final of the Olympics that year.\n\nVirtual\nAfter acquiring RTFKT, Nike launched the Dunk Genesis Cryptokicks collection, which features over 20,000 NFTs. One design by Takashi Murakami was sold for $134,000 in April 2022.\n\nHeadquarters\nNike's world headquarters are surrounded by the city of Beaverton but are within unincorporated Washington County. The city attempted to forcibly annex Nike's headquarters, which led to a lawsuit by Nike, and lobbying by the company that ultimately ended in Oregon Senate Bill 887 of 2005. Under that bill's terms, Beaverton is specifically barred from forcibly annexing the land that Nike and Columbia Sportswear occupy in Washington County for 35 years, while Electro Scientific Industries and Tektronix receive the same protection for 30 years.\nNike is planning to build a 3.2 million square foot expansion to its World Headquarters in Beaverton. The design will target LEED Platinum certification and will be highlighted by natural daylight, and a gray water treatment center.\n\nOwnership\nNike is mainly owned by institutional investors, who hold around 68% of all shares. The 10 largest shareholders of Nike in early 2024 were:\n\nPhil Knight (17.4%)\nVanguard (7.23%)\nBlackRock (5.93%)\nState Street Global Advisors (3.71%)\nTravis Knight (3.14%)\nKnight Foundation (1.95%)\nCapital Research and Management Company (1.94%)\nGeode Capital Management (1.57%)\nWellington Management Company (1.48%)\nAllianceBernstein (1.32%)\n\nControversies\nNike has contracted with more than 700 shops around the world and has offices located in 45 countries outside the United States. Most of the factories are located in Asia, including Indonesia, China, Taiwan, India, Thailand, Vietnam, Pakistan, Philippines, and Malaysia. Nike is hesitant to disclose information about the contract companies it works with. However, due to harsh criticism from some organizations like CorpWatch, Nike has disclosed information about its contract factories in its Corporate Governance Report.\n\nSweatshops\nIn the 1990s, Nike received criticism for its use of sweatshops. Beginning in 1990, many protests occurred in big cities such as Los Angeles, Washington, DC and Boston in order to show public outcry for Nike's use of child labor and sweatshops. Nike has been criticized for contracting with factories (known as Nike sweatshops) in countries such as China, Vietnam, Indonesia and Mexico. Vietnam Labor Watch, an activist group, has documented that factories contracted by Nike have violated minimum wage and overtime laws in Vietnam as late as 1996, although Nike claims that this practice has been stopped.\nAs of July 2011, Nike stated that two-thirds of its factories producing Converse products still do not meet the company's standards for worker treatment. A July 2011 Associated Press article stated that employees at the company's plants in Indonesia reported constant abuse from supervisors.\n\nChild labor\nDuring the 1990s, Nike faced criticism for the use of child labor in Cambodia and Pakistan in factories it contracted to manufacture soccer balls. Although Nike took action to curb or at least reduce the practice, they continue to contract their production to companies that operate in areas where inadequate regulation and monitoring make it hard to ensure that child labor is not being used.\nIn 2001, a BBC documentary uncovered occurrences of child labor and poor working conditions in a Cambodian factory used by Nike. The documentary focused on six girls, who all worked seven days a week, often 16 hours a day.\n\nStrike in China factory\nIn April 2014, one of the biggest strikes in mainland China took place at the Yue Yuen Industrial Holdings Dongguan shoe factory, producing amongst others for Nike. Yue Yuen did underpay an employee by 250 yuan (40.82 US Dollars) per month. The average salary at Yue Yuen is 3000 yuan per month. The factory employs 70,000 people. This practice was in place for nearly 20 years.\n\nParadise Papers\nOn November 5, 2017, the Paradise Papers, a set of confidential electronic documents relating to offshore investment, revealed that Nike is among the corporations that used offshore companies to avoid taxes.\nAppleby documents detail how Nike boosted its after-tax profits by, among other maneuvers, transferring ownership of its Swoosh trademark to a Bermudan subsidiary, Nike International Ltd. This transfer allowed the subsidiary to charge royalties to its European headquarters in Hilversum, Netherlands, effectively converting taxable company profits to an account payable in tax-free Bermuda. Although the subsidiary was effectively run by executives at Nike's main offices in Beaverton, Oregon—to the point where a duplicate of the Bermudan company's seal was needed—for tax purposes the subsidiary was treated as Bermuda. Its profits were not declared in Europe and came to light only because of a mostly unrelated case in US Tax Court, where papers filed by Nike briefly mention royalties in 2010, 2011 and 2012 totaling $3.86 billion. Under an arrangement with Dutch authorities, the tax break was to expire in 2014, so another reorganization transferred the intellectual property from the Bermudan company to a Dutch commanditaire vennootschap or limited partnership, Nike Innovate CV. Dutch law treats income earned by a CV as if it had been earned by the principals, who owe no tax in the Netherlands if they do not reside there.\n\nColin Kaepernick\nIn September 2018, Nike announced it had signed former American football quarterback Colin Kaepernick, noted for his controversial decision to kneel during the playing of the US national anthem, to a long-term advertising campaign. According to Charles Robinson of Yahoo! Sports, Kaepernick and Nike agreed to a new contract despite the fact Kaepernick has been with the company since 2011 and said that \"interest from other shoe companies\" played a part in the new agreement. Robinson said the contract is a \"wide endorsement\" where Kaepernick will have his own branded line including shoes, shirts, jerseys and more. In response, some people set fire to their own Nike-branded clothes and shoes or cut the Nike swoosh logo out of their clothes, and the Fraternal Order of Police called the advertisement an \"insult\"; others, such as LeBron James, Serena Williams, and the National Black Police Association, praised Nike for its campaign. The College of the Ozarks removed Nike from all their athletic uniforms in response.\nDuring the following week, Nike's stock price fell 2.2%, even as online orders of Nike products rose 27% compared with the previous year. In the following three months, Nike reported a rise in sales.\nIn July 2019, Nike released a shoe featuring a Betsy Ross flag called the Air Max 1 Quick Strike Fourth of July trainers. The trainers were designed to celebrate Independence Day. The model was subsequently withdrawn after Colin Kaepernick told the brand he and others found the flag offensive because of its association with slavery.\nNike's decision to withdraw the product drew criticism from Arizona's Republican Governor, Doug Ducey, and Texas's Republican Senator Ted Cruz. Nike's decision was praised by others due to the use of the flag by white nationalists, but the Anti-Defamation League's Center on Extremism has declined to add the flag to its database of \"hate symbols.\"\n\nHong Kong protests\nUS Vice President Mike Pence criticized Nike for \"siding with the Chinese Communist Party and silencing free speech\". He claimed that after Houston Rockets general manager Daryl Morey was criticized by the Chinese government for his tweet supporting the 2019 Hong Kong protests, Nike removed Rockets merchandise from its stores in China. \nOn January 31, 2020, the World Athletics issued new guidelines concerning shoes to be used in the upcoming Tokyo 2020 Olympics. These updates came in response to criticisms concerning technology in the Nike Vaporfly running shoes, which had been submitted beginning around 2017–2018. These criticisms stated that the shoes provided athletes with an unfair advantage over their opponents and some critics considered it to be a form of technology doping. According to Nike funded research, the shoes can improve efficiency by up to 4.2% and runners who have tested the shoe are saying that it causes reduced soreness in the legs; sports technologist Bryce Dyer attributes this to the ZoomX and carbon fiber plate since it absorbs the energy and \"spring[s] runners forward\". Some athletes, scientists, and fans have compared this to the 2008 LAZR swimsuit controversy.\nSome of the major changes in the guidelines that have come about as a result of these criticisms include that the \"sole must be no thicker than 40mm\" and that \"the shoe must not contain more than one rigid embedded plate or blade (of any material) that runs either the full length or only part of the length of the shoe. The plate may be in more than one part but those parts must be located sequentially in one plane (not stacked or in parallel) and must not overlap\". The components of the shoes are not the only thing that had major changes; starting April 30, 2020, \"any shoe must have been available for purchase by any athlete on the open retail market (online or in store) for a period of four months before it can be used in competition\". Prior to these new guidelines World Athletics reviewed the Vaporfly shoes and \"concluded that there is independent research that indicates that the new technology incorporated in the soles of road and spiked shoes may provide a performance advantage\" and that it recommends further research to \"establish the true impact of [the Vaporfly] technology.\"\n\nForced Uyghur labor allegations\nIn December 2021, the European Center for Constitutional and Human Rights filed a criminal complaint in a Dutch court against Nike and other brands, alleging that they benefited from the use of forced Uyghur labor in Xinjiang. In July 2023, the Canadian Ombudsperson for Responsible Enterprise opened an investigation into Nike to probe allegations of forced Uyghur labor in its supply chain. Research of the social democratic party in the European Parliament, the Sheffield Hallam University and further groups accused Nike in 2023 of using forced labor camps exploiting Muslim Uyghurs in China provided by the Anhui Huamao Group Co., Ltd. for production.\n\nWelfare of animals used in sourcing\nFollowing criticism from animal rights groups, Nike declared its intent in 2023 to phase out the use of wool sourced from lambs that had been subjected to mulesing, a controversial practice involving the removal of skin from live lambs. \nAlso in 2023, Nike pledged to eliminate the use of kangaroo leather in favor of a synthetic alternative, in response to animal activists' charge that the killing of kangaroos was unethical.\n\nEnvironmental record\nIn 2007, New England–based environmental organization Clean Air-Cool Planet ranked Nike among the top three companies (out of 56) in a survey of climate-friendly companies.\n\nRecycling\nNike has also been praised for its Nike Grind program, which closes the product lifecycle, by groups such as Climate Counts.\nSince 1993, Nike has worked on its Reuse-A-Shoe program. This program is Nike's longest-running program that benefits both the environment and the community by collecting old athletic shoes of any type in order to process and recycle them. The material that is produced is then used to help create sports surfaces such as basketball courts, running tracks, and playgrounds. Nike France made their Reuse-A-Shoe program available online so that they could make it easier for consumers to send in their old shoes. In 2017, it was estimated that 28,000,000 shoes were collected since its start in 1993. Nike limited the mail-in option of the program because they are aware that the emissions from shipping would offset the good, they are trying to do. They work with the National Recycling Coalition to help limit transportation of recycled shoes. During transportation most of the vehicles that are used are using diesel or fuel oil. Diesel oil emits 22.44 pounds of Carbon Dioxide per gallon.\nA campaign that Nike began for Earth Day 2008 was a commercial that featured basketball star Steve Nash wearing Nike's Trash Talk Shoe, which had been constructed in February 2008 from pieces of leather and synthetic leather waste from factory floors. The Trash Talk Shoe also featured a sole composed of ground-up rubber from a shoe recycling program. Nike claims this is the first performance basketball shoe that has been created from manufacturing waste, but it only produced 5,000 pairs for sale.\n\nSulfur hexafluoride\nSulfur hexafluoride is an extremely potent and persistent greenhouse gas that was used to fill the cushion bags in all \"Air\"-branded shoes from 1992 to 2006. 277 tons was used during the peak in 1997.\n\nToxic chemicals\nIn 2008, a project through the University of North Carolina at Chapel Hill found workers were exposed to toxic isocyanates and other chemicals in footwear factories in Thailand. In addition to inhalation, dermal exposure was the biggest problem found. This could result in allergic reactions including asthmatic reactions.\n\nWater pollution\nIn July 2011, environmental group Greenpeace published a report regarding water pollution impacting the Yangtze River emitted from a major textile factory operated by Nike supplier Youngor Group. Following the report, Nike, as well as Adidas, Puma, and a number of other brands included in the report announced an agreement to stop discharging hazardous chemicals by 2020. However, in July 2016 Greenpeace released a follow-up report which found that Nike \"does not take individual responsibility\" for eliminating hazardous chemicals, stating that Nike had not made an explicit commitment to riding itself of perfluorinated compounds, and that \"Nike does not ensure its suppliers report their hazardous chemical discharge data and has not made a commitment to do so\".\nBack in 2016, Nike started to use water free dyeing materials so that they can help reduce their water use in their Southeast Asian factories.\n\nCarbon footprint\nNike reported Total CO2e emissions (Direct + Indirect) for the twelve months ending June 30, 2020 at 317 Kt (+12/+4% y-o-y) and plans to reduce emissions 65% by 2030 from a 2015 base year. This science-based target is aligned with Paris Agreement to limit global warming to 1.5 °C above pre-industrial levels. According to a study done in 2017, Nike contributed 3,002,529 metric tons of Carbon Dioxide in 2017 combined from different sectors in the company like retail, manufacturing, management, and more.\n\nWhile emissions of Nike's two corporate jets represent less than 0.1% of its total emissions, they have increased by 20% from 2015 to 2023.\nPartnership with Newlight\nIn 2021, Nike announced they were working with Newlight Technologies to find more eco-friendly materials for their sneakers. They specifically mentioned Newlight's AirCarbon product which is a bioplastic that can be used to make shoes. The bioplastic is used as a replacement to leather, plastic, and other materials that are like that. Newlight was reported saying that the goal is to reduce Nike's carbon footprint.\n\nSustainability\nNike has taken steps to reduce its environmental impact. It has worked to reduce carbon emissions nearly 3% across its value chain from its FY11 baseline, and sourced from fewer, higher-performing contract factories.\nIn 2019, Nike began a program called \"Move to Zero\" in an effort to achieve zero waste and zero carbon in the organization's supply chain and product lifetime. The men's and women's sections of the collection contain at least 60% organic and recycled materials, including sustainably sourced cotton.\n\nMarketing strategy\nNike promotes its products through sponsorship agreements with celebrity athletes, professional teams and college athletic teams. Nike has endorsement deals with many top sports players such as LeBron James, Kevin Durant, and Serena Williams.\n\nAdvertising\nIn 1982, Nike aired its first three national television ads, created by newly formed ad agency Wieden+Kennedy (W+K), during the broadcast of the New York Marathon. The Cannes Advertising Festival has named Nike its Advertiser of the Year in 1994 and 2003, making it the first company to receive that honor twice.\nNike also has earned the Emmy Award for best commercial in 2000 and 2002. The first was for \"The Morning After,\" a satirical look at what a runner might face on the morning of January 1, 2000, if every dire prediction about the Y2K problem came to fruition. The second was for a 2002 spot called \"Move,\" which featured a series of famous and everyday athletes in a variety of athletic pursuits.\n\nBeatles song\nNike was criticized for its use of the Beatles song \"Revolution\" in a 1987 commercial against the wishes of Apple Records, the Beatles' recording company. Nike paid US$250,000 to Capitol Records Inc., which held the North American licensing rights to the recordings, for the right to use the Beatles' rendition for a year.\nThat same year, Apple Records sued Nike Inc., Capitol Records Inc., EMI Records Inc. and Wieden+Kennedy for $15 million. Capitol-EMI countered by saying the lawsuit was \"groundless\" because Capitol had licensed the use of \"Revolution\" with the \"active support and encouragement of Yoko Ono, a shareholder and director of Apple Records.\"\nNike discontinued airing ads featuring \"Revolution\" in March 1988. Yoko Ono later gave permission to Nike to use John Lennon's \"Instant Karma\" in another advertisement.\n\nNew media marketing\nNike was an early adopter of internet marketing, email management technologies, and using broadcast and narrowcast communication technologies to create multimedia marketing campaigns.\n\nMinor Threat advertisement\nIn late June 2005, Nike received criticism from Ian MacKaye, owner of Dischord Records, guitarist/vocalist for Fugazi and The Evens, and front man of the defunct punk band Minor Threat, for appropriating imagery and text from Minor Threat's 1981 self-titled album's cover art in a flyer promoting Nike Skateboarding's 2005 East Coast demo tour. \nOn June 27, Nike Skateboarding's website issued an apology to Dischord, Minor Threat, and fans of both and announced that they have tried to remove and dispose of all flyers. They stated that the people who designed it were skateboarders and Minor Threat fans themselves who created the advertisement out of respect and appreciation for the band. The dispute was eventually settled out of court between Nike and Minor Threat.\n\nNike 6.0\nAs part of the 6.0 campaign, Nike introduced a new line of T-shirts that include phrases such as \"Dope\", \"Get High\" and \"Ride Pipe\" – sports lingo that is also a double entendre for drug use. Boston Mayor Thomas Menino expressed his objection to the shirts after seeing them in a window display at the city's Niketown and asked the store to remove the display. \"What we don't need is a major corporation like Nike, which tries to appeal to the younger generation, out there giving credence to the drug issue,\" Menino told The Boston Herald. A company official stated the shirts were meant to pay homage to extreme sports, and that Nike does not condone the illegal use of drugs. Nike was forced to replace the shirt line.\n\nNBA uniform deal\nIn June 2015, Nike signed an 8-year deal with the NBA to become the official uniform supplier for the league, beginning with the 2017–18 season. The brand took over for Adidas, who provided the uniforms for the league since 2006. Unlike previous deals, Nike's logo appear on NBA jerseys – a first for the league. Initially, the Charlotte Hornets, owned by longtime Nike endorser Michael Jordan, were the only team not to sport the Nike swoosh, instead wearing the Jumpman logo associated with Jordan-related merchandise. However, beginning with the 2020–21 season, the Jumpman replaced the swoosh on the NBA's alternate \"Statement\" uniforms. In October 2024, Nike announced a 12-year global extension of the partnership, retaining exclusive rights to design and manufacture uniforms for the NBA, WNBA and NBA G League through 2037.\n\nSponsorship\nNike sponsors top athletes in many sports to use their products and promote and advertise their technology and design. Nike's first professional athlete endorser was Romanian tennis player Ilie Năstase. The first track endorser was distance runner Steve Prefontaine. Prefontaine was the prized pupil of the company's co-founder, Bill Bowerman, while he coached at the University of Oregon. Today, the Steve Prefontaine Building is named in his honor at Nike's corporate headquarters. Nike has only made one statue of its sponsored athletes and it is of Steve Prefontaine.\nNike has also sponsored many other successful track and field athletes over the years, such as Sebastian Coe, Carl Lewis, Jackie Joyner-Kersee, Michael Johnson and Allyson Felix. The signing of basketball player Michael Jordan in 1984, with his subsequent promotion of Nike over the course of his career, with Spike Lee as Mars Blackmon, proved to be one of the biggest boosts to Nike's publicity and sales.\n\nNike is a major sponsor of the athletic programs at Penn State University and named its first child care facility after Joe Paterno when it opened in 1990 at the company's headquarters. Nike originally announced it would not remove Paterno's name from the building in the wake of the Penn State sex abuse scandal. After the Freeh Report was released on July 12, 2012, Nike CEO Mark Parker announced the name Joe Paterno would be removed immediately from the child development center. A new name has yet to be announced.\n\nIn the early 1990s, Nike made a strong push into the soccer business making endorsement deals with famous and charismatic players such as Romário, Eric Cantona or Edgar Davids. They continued the growth in the sport by signing more top players including: Ronaldo, Ronaldinho, Francesco Totti, Thierry Henry, Didier Drogba, Andrés Iniesta, Wayne Rooney and still have many of the sport's biggest stars under their name, with Cristiano Ronaldo, Zlatan Ibrahimović, Neymar, Harry Kane, Eden Hazard and Kylian Mbappé among others. A Barcelona prodigy, Lionel Messi had been signed with Nike since age 14, but transferred to Adidas after they successfully challenged their rival's claim to his image rights in court.\n\nNike has been the official ball supplier for the Premier League since the 2000–01 season. In 2012, Nike carried a commercial partnership with the Asian Football Confederation. \nIn August 2014, Nike announced that they will not renew their kit supply deal with Manchester United after the 2014–15 season, citing rising costs. Since the start of the 2015–16 season, Adidas has manufactured Manchester United's kit as part of a world-record 10-year deal worth a minimum of £750 million.\n\nNike still has many of the top teams playing in their uniforms, including: FC Barcelona, Paris Saint-Germain and Liverpool (the latter from the 2020–21 season), and the national teams of Brazil, France, England, Uruguay and the Netherlands among many others.\nNike has been the sponsor for many top ranked tennis players. Brand's commercial success in the sport went hand in hand with the endorsement deals signed with the biggest and the world's most charismatic stars and number one ranked players of the subsequent eras, including John McEnroe in the 1980s, Andre Agassi and Pete Sampras in the 1990s and Roger Federer, Rafael Nadal, Serena Williams and Maria Sharapova with the start of the 21st century.\n\nNike sponsored Tiger Woods until 2024, and remained on his side amid the controversies that shaped the golfer's career. In January 2013, Nike signed Rory McIlroy, the then No 1 golfer in the world to a 10-year sponsorship deal worth $250 million. Nike has also gone on to sign top players in golf including Scottie Scheffler, Brooks Koepka, Nelly Korda, Tommy Fleetwood, Tony Finau and Cam Davis. Nike’s 2016 decision to exit the golf equipment business–such as club manufacturing–due to an 8.2% decline sales in one year meant sponsored athletes exclusively wore Nike apparel.\nNike was the official kit sponsor for the Indian cricket team from 2005 to 2020. On February 21, 2013, Nike announced it suspended its contract with South African limbless athlete Oscar Pistorius, due to him being charged with premeditated murder.\nNike consolidated its position in basketball in 2015 when it was announced that the company would sign an 8-year deal with the NBA, taking over from the league's previous uniform sponsor, Adidas. The deal required all franchise team members to wear jerseys and shorts with the Swoosh logo, beginning with the 2017/18 season. After the success of partnership with Jordan, which resulted in the creation of the unique Air Jordan brand, Nike has continued to build partnership with the biggest names in basketball. LeBron James was given the Slogan \"We are All Witnesses\" when he signed with Nike. Similar to \"Air Jordan\", James' brand became massively popular. Some have had signature shoes designed for them, including Kobe Bryant, Jason Kidd, Vince Carter and more recently, James and Kevin Durant, Giannis Antetokounmpo, Jayson Tatum, Paul George and Luka Dončić, among others.\nNike recently made signature shoes for WNBA stars as well, as the leagues popularity takes off. Although a dozen women have received signature sneakers in the WNBA's 27-year history, it had been over a decade since a woman had received a signature sneaker. Nike's first signature shoe in the WNBA was with Sheryl Swoops, and since then they have made signature silhouettes for Lisa Leslie, Dawn Staley, Cynthia Cooper, and most recently for Sabrina Ionescu. Caitlin Clark will also receive a signature shoe deal as part of her eight-year, 28 million dollar deal.\nA news report originating from CNN reported that Nike spent $11.5 billion, nearly a third of its sales, on marketing and endorsement contracts in the year 2018. Nike and its Jordan brand sponsored 85 men's and women's basketball teams in the NCAA tournament.\n\nTies with the University of Oregon\nNike maintains strong ties, both directly and through partnerships with Phil Knight, with the University of Oregon. Nike designs the University of Oregon football program's team attire. New unique combinations are issued before every game day. Tinker Hatfield, who also redesigned the university's logo, leads this effort.\nMore recently, the corporation donated $13.5 million towards the renovation and expansion of Hayward Field.\nPhil Knight has invested substantial personal funds towards developing and maintaining the university's athletic apparatus. His university projects often involve input from Nike designers and executives, such as Tinker Hatfield.\n\nCauses\nIn 2012, Nike is listed as a partner of the (PRODUCT)RED campaign together with other brands such as Girl, American Express, and Converse. The campaign's mission is to prevent the transmission of HIV from mother to child. The campaign's byline is \"Fighting For An AIDS Free Generation\". The company's goal is to raise and send funds, for education and medical assistance to those who live in areas heavily affected by AIDS. In 2023, Nike became the presenting sponsor of Reviving Baseball in Inner Cities, which encourages youth in underserved communities to participate in baseball and softball.\n\nProgram\nThe Nike Community Ambassador Program, allows Nike employees from around the world to go out and give to their community. Over 3,900 employees from various Nike stores have participated in teaching children to be active and healthy.\n\nResearch\nIn 2016, a study done by RTG Consulting Group reflected that Nike was the 3rd most relevant brand for Gen-Z in China.\nRoth MKM's 2023 Millennial survey reported in March that millennials with health and wellness concerns in the aftermath of the pandemic ranked brands like Nike, Adidas and Lululemon as their preferred brands for purchases.\nIn January 2023, a study by Rakuten concluded that Nike was the most popular sportswear brand in the US, followed by Lululemon and Adidas.\nIn July 2023, a study by Kantar found that Americans consider Nike as the Most Inclusive Brands (alongside other top brands like Amazon, and Disney).\n\nSee also\nBruce Brenn\nDick Donahue\nNike timeline\nBreaking2 – A project by Nike to break the 2 hour marathon barrier.\nList of companies based in Oregon\n\nNotes\nReferences\nFurther reading\nEgan, Timothy (September 13, 1998). \"The Swoon of the Swoosh\". The New York Times.\n\nExternal links\n\nOfficial website \nBusiness data for Nike, Inc.:",
  "clean_text": "Nike, Inc. (stylized as NIKE) is an American athletic footwear and apparel corporation headquartered near Beaverton, Oregon. It is the world's largest supplier of athletic shoes and apparel and a major manufacturer of sports equipment, with revenue in excess of US$46 billion in its fiscal year 2022. The company was founded on January 25, 1964, as \"Blue Ribbon Sports\", by Bill Bowerman and Phil Knight, and officially became Nike, Inc. on May 30, 1971. The company takes its name from Nike, the Greek goddess of victory. Nike markets its products under its own brand, as well as Nike Golf, Nike Pro, Nike+, Nike Blazers, Air Force 1, Nike Dunk, Air Max, Foamposite, Nike Skateboarding and Nike CR7. The company also sells products under its Air Jordan brand and its Converse subsidiary. Nike also owned Bauer Hockey from 1995 to 2008, and previously owned Cole Haan, Umbro, and Hurley International. In addition to manufacturing sportswear and equipment, the company operates retail stores under the Niketown name. Nike sponsors many high-profile athletes and sports teams around the world, with the highly recognized trademarks of \"Just Do It\" and the Swoosh logo. As of 2024, it employed 83,700 people worldwide. In 2020, the brand alone was valued in excess of $32 billion, making it the most valuable brand among sports businesses. Previously, in 2017, the Nike brand was valued at $29.6 billion. Nike ranked 89th in the 2018 Fortune 500 list of the largest United States corporations by total revenue. The company ranked 239th in the Forbes Global 2000 companies in 2024. History Nike, originally known as Blue Ribbon Sports (BRS), was founded by University of Oregon track athlete Phil Knight and his coach, Bill Bowerman, on January 25, 1964. The company initially operated in Eugene, Oregon as a distributor for Japanese shoemaker Onitsuka Tiger, making most sales at track meets out of Knight's automobile. According to Otis Davis, a University of Oregon student-athlete coached by Bowerman and Olympic gold medalist at the 1960 Summer Olympics, his coach made the first pair of Nike shoes for him, contradicting a claim that they were made for Phil Knight. According to Davis, \"I told Tom Brokaw that I was the first. I don't care what all the billionaires say. Bill Bowerman made the first pair of shoes for me. People don't believe me. In fact, I didn't like the way they felt on my feet. There was no support and they were too tight. But I saw Bowerman made them from the waffle iron, and they were mine\". In its first year in business, BRS sold 1,300 pairs of Japanese running shoes, grossing $8,000. By 1965, sales had reached $20,000. In 1966, BRS opened its first retail store at 3107 Pico Boulevard in Santa Monica, California. In 1967, due to increasing sales, BRS expanded retail and distribution operations on the East Coast, in Wellesley, Massachusetts. In 1971, Bowerman used his wife's waffle iron to experiment on rubber to create a new sole for track shoes that would grip but be lightweight and increase the runner's speed. Oregon's Hayward Field was transitioning to an artificial surface, and Bowerman wanted a sole which could grip to grass or bark dust without the use of spikes. Bowerman was talking to his wife about this puzzle over breakfast, when the waffle iron idea came into play. Bowerman's design led to the introduction of the \"Moon Shoe\" in 1972, so named because the waffle tread was said to resemble the footprints left by astronauts on the Moon. Further refinement resulted in the \"Waffle Trainer\" in 1974, which helped fuel the explosive growth of Blue Ribbon Sports/Nike. Tension between BRS and Onitsuka Tiger increased in 1971 as the latter attempted a takeover of BRS by extending an ultimatum proposal that would give the Japanese company 51 percent of BRS. In 1972, the relationship between BRS and Onitsuka Tiger came to an end. BRS prepared to launch its own line of footwear. The previous year, it was already able to place from two Japanese shoe manufacturers the company's first independent order for 20,000, which included 6,000 that had the Nike logo. Runner Jeff Johnson was brought in to help market the new brand and was credited for coining the name “Nike”. It would bear the Swoosh newly designed by Carolyn Davidson. The Swoosh was first used by Nike on June 18, 1971, and was registered with the US Patent and Trademark Office on January 22, 1974. In 1976, the company hired John Brown and Partners, based in Seattle, as its first advertising agency. The following year, the agency created the first \"brand ad\" for Nike, called \"There is no finish line\", in which no Nike product was shown. By 1980, Nike had attained a 50% market share in the US athletic shoe market, and the company went public in December of that year. Wieden+Kennedy, Nike's primary ad agency, has worked with Nike to create many print and television advertisements, and Wieden+Kennedy remains Nike's primary ad agency. It was agency co-founder Dan Wieden who coined the now-famous slogan \"Just Do It\" for a 1988 Nike ad campaign, which was chosen by Advertising Age as one of the top five ad slogans of the 20th century and enshrined in the Smithsonian Institution. Walt Stack was featured in Nike's first \"Just Do It\" advertisement, which debuted on July 1, 1988. Wieden credits the inspiration for the slogan to \"Let's do it\", the last words spoken by Gary Gilmore before he was executed. Nike manufactured its first uniforms for a professional sports team in 1979, when its jersey for the Portland Timbers of the North American Soccer League debuted. Throughout the 1980s, Nike expanded its product line to encompass many sports and regions throughout the world. In 1990, Nike moved into its eight-building World Headquarters campus in Beaverton, Oregon. The first Nike retail store, dubbed Niketown, opened in downtown Portland in November of that year. Phil Knight announced in mid-2015 that he would step down as chairman of Nike in 2016. He officially stepped down from all duties with the company on June 30, 2016. In a company public announcement on March 15, 2018, Nike CEO Mark Parker said Trevor Edwards, a top Nike executive who was seen as a potential successor to the chief executive, was relinquishing his position as Nike's brand president and would retire in August. In October 2019, John Donahoe was announced as the next CEO, and succeeded Parker on January 13, 2020. In November 2019, the company stopped selling directly through Amazon, focusing more on direct relationships with customers. Acquisitions Nike has acquired and sold several apparel and footwear companies over the course of its history. Its first acquisition was the upscale footwear company Cole Haan in 1988, followed by the purchase of Bauer Hockey in 1994. In 2002, Nike bought surf apparel company Hurley International from founder Bob Hurley. In 2003, Nike paid US$309 million to acquire sneaker company Converse. The company acquired Starter in 2004 and soccer uniform maker Umbro in 2007. In order to refocus its business lines, Nike began divesting itself of some of its subsidiaries in the 2000s. It sold Starter in 2007 and Bauer Hockey in 2008. The company sold Umbro in 2012 and Cole Haan in 2013. As of 2020, Nike owns only one subsidiary: Converse Inc. Nike acquired Zodiac, a consumer data analytics company, in March 2018. In August 2019, the company acquired Celect, a Boston-based predictive analytics company. In December 2021, Nike purchased RTFKT Studios, a virtual shoe company that makes NFTs. In February 2021, Nike acquired Datalogue, a New York-based company focused on digital sales and machine learning technology. Finance Nike was made a member of the Dow Jones Industrial Average in 2013, when it replaced Alcoa. On December 19, 2013, Nike's quarterly profit rose due to a 13 percent increase in global orders for merchandise since April of that year. Future orders of shoes or clothes for delivery between December and April, rose to $10.4 billion. Nike shares (NKE) rose 0.6 percent to $78.75 in extended trading. In November 2015, Nike announced it would initiate a $12 billion share buyback, as well as a two-for-one stock split, with shares to begin trading at the decreased price on December 24. The split will be the seventh in company history. In June 2018, Nike announced it would initiate a $15 billion share buyback over four years, to begin in 2019 upon completion of the previous buyback program. For the fiscal year 2018, Nike reported earnings of US$1.933 billion, with annual revenue of US$36.397 billion, an increase of 6.0% over the previous fiscal cycle. Nike's shares traded at over $72 per share, and its market capitalization was valued at over US$114.5 billion in October 2018. In February 2020, the company said that roughly 75% of Nike stores in Greater China had closed due to the COVID-19 outbreak. In March 2020, Nike reported a 5% drop in Chinese sales associated with stores' closure. It was the first decrease in six years. At the same time, the company's online sales grew by 36% during Q1 of 2020. Also, the sales of personal training apps grew by 80% in China. In June 2025, Nike warned that President Trump’s new tariffs on key trading partners could add around $1 billion to its costs this year, causing the company to shift some production out of China to reduce its exposure. Despite weaker quarterly revenue, Nike’s shares rose over 10% after a better-than-expected earnings forecast, while the US and China also reached a deal to ease trade tensions. The key trends of Nike are (as at the financial year ending May 31): Logo evolution Notes Products Nike produces a wide range of sports equipment and apparel. Sports apparel Nike's first apparel products were track running shoes. Nike Air Max is a line of shoes first released by Nike, Inc. in 1987. Additional product lines were introduced later, such as Air Huarache, which debuted in 1992. The most recent additions to their line are the Nike 6.0, Nike NYX, and Nike SB shoes, designed for skateboarding. Nike has recently introduced cricket shoes called Air Zoom Yorker, designed to be 30% lighter than their competitors'. In 2008, Nike introduced the Air Jordan XX3, a high-performance basketball shoe designed with the environment in mind. Nike's range of products include shoes, jerseys, shorts, cleats, baselayers, etc. for sports activities such as soccer, basketball, track and field, combat sports, tennis, American football, athletics, golf, ice hockey, and cross training for men, women, and children. Nike also sells shoes for activities such as skateboarding, baseball, cycling, volleyball, wrestling, cheerleading, lacrosse, cricket, aquatic activities, auto racing, and other athletic and recreational uses. Nike partnered with Apple Inc. to produce the Nike+ product that monitors a runner's performance via a radio device in the shoe that links to the iPod nano. While the product generates useful statistics, it has been criticized by researchers who were able to identify users' RFID devices from 60 feet (18 m) away using small, concealable intelligence motes in a wireless sensor network. In 2004, Nike launched the SPARQ Training Program/Division. Some of Nike's newest shoes contain Flywire and Lunarlite Foam to reduce weight. The Air Zoom Vomero running shoe, introduced in 2006 and currently in its 11th generation, featured a combination of groundbreaking innovations including a full-length air cushioned sole, an external heel counter, a crashpad in the heel for shock absorption, and Fit Frame technology for a stable fit. In 2023, Nike told ESPN that it would cease using kangaroo skins in its products by the end of that year and debut \"a new Nike-only, proprietary synthetic upper, [with] a new material that is a better performance solution and replaces the use of kangaroo leather.\" Nike Vaporfly The Nike Vaporfly first came out in 2017 and their popularity, along with its performance, prompted a new series of running shoes. The Vaporfly series has a new technological composition that has revolutionized long-distance running since studies have shown that these shoes can improve marathon race time up to 4.2%. The composition of the sole contains a foamy material, Pebax, that Nike has altered and now calls it ZoomX (which can be found in other Nike products as well). Pebax foam can also be found in airplane insulation and is \"squishier, bouncier, and lighter\" than foams in typical running shoes. In the middle of the ZoomX foam there is a full-length carbon fiber plate \"designed to generate extra spring in every step\". At the time of this writing Nike had just released its newest product from the Vaporfly line, the Nike ZoomX Vaporfly NEXT%, which was marketed as \"the fastest shoe we’ve ever made\" using Nike's \"two most innovative technologies, Nike ZoomX foam and VaporWeave material\". Street fashions The Nike brand, with its distinctive \"Swoosh\" logo, quickly became regarded as a status symbol in modern urban fashion and hip-hop fashion due to its association with success in sport. Beginning in the 1980s, various items of Nike clothing became staples of mainstream American youth fashion, especially tracksuits, shell suits, baseball caps, Air Jordans, Air Force 1's, and Air Max running shoes with thick, air cushioned rubber soles and contrasting blue, yellow, green, white, or red trim. Limited edition sneakers and prototypes with a regional early release were known as Quickstrikes, and became highly desirable items for teenage members of the sneakerhead subculture. By the 1990s and 2000s, American and European teenagers associated with the preppy or popular clique began combining these sneakers, leggings, sweatpants, crop tops, and tracksuits with regular casual chic street clothes such as jeans, skirts, leg warmers, slouch socks, and bomber jackets. Particularly popular were the unisex spandex Nike Tempo compression shorts worn for cycling and running, which had a mesh lining, waterproofing, and, later in the 2000s, a zip pocket for a Walkman or MP3 player. From the late 2000s into the 2010s, Nike Elite basketball socks began to be worn as everyday clothes by hip-hop fans and young children. Originally plain white or black, these socks had special shock absorbing cushioning in the sole plus a moisture wicking upper weave. Later, Nike Elite socks became available in bright colors inspired by throwback basketball uniforms, often with contrasting bold abstract designs, images of celebrities, and freehand digital print to capitalize upon the emerging nostalgia for 1990s fashion. In 2015, a new self-lacing shoe was introduced. Called the Nike Mag, which are replicas of the shoes featured in Back to the Future Part II, it had a preliminary limited release, only available by auction with all proceeds going to the Michael J. Fox Foundation. This was done again in 2016. Nike have introduced a premium line, focused more on streetwear than sports wear called NikeLab. In March 2017, Nike announced its launch of a plus-size clothing line, which will feature new sizes 1X through 3X on more than 200 products. Another significant development at this time was the Chuck Taylor All-Star Modern, an update of the classic basketball sneaker that incorporated the circular knit upper and cushioned foam sole of Nike's Air Jordans. Collectibles On July 23, 2019, a pair of Nike Inc. running shoes sold for $437,500 at a Sotheby's auction. The so-called \"Moon Shoes\" were designed by Nike co-founder and track coach Bill Bowerman for runners participating in the 1972 Olympics trials. The buyer was Miles Nadal, a Canadian investor and car collector, who had just paid $850,000 for a group of 99 rare of limited collection pairs of sport shoes. The purchase price was the highest for one pair of sneakers, the previous record being $190,373 in 2017 for a pair of signed Converse shoes in California, said to have been worn by Michael Jordan during the 1984 basketball final of the Olympics that year. Virtual After acquiring RTFKT, Nike launched the Dunk Genesis Cryptokicks collection, which features over 20,000 NFTs. One design by Takashi Murakami was sold for $134,000 in April 2022. Headquarters Nike's world headquarters are surrounded by the city of Beaverton but are within unincorporated Washington County. The city attempted to forcibly annex Nike's headquarters, which led to a lawsuit by Nike, and lobbying by the company that ultimately ended in Oregon Senate Bill 887 of 2005. Under that bill's terms, Beaverton is specifically barred from forcibly annexing the land that Nike and Columbia Sportswear occupy in Washington County for 35 years, while Electro Scientific Industries and Tektronix receive the same protection for 30 years. Nike is planning to build a 3.2 million square foot expansion to its World Headquarters in Beaverton. The design will target LEED Platinum certification and will be highlighted by natural daylight, and a gray water treatment center. Ownership Nike is mainly owned by institutional investors, who hold around 68% of all shares. The 10 largest shareholders of Nike in early 2024 were: Phil Knight (17.4%) Vanguard (7.23%) BlackRock (5.93%) State Street Global Advisors (3.71%) Travis Knight (3.14%) Knight Foundation (1.95%) Capital Research and Management Company (1.94%) Geode Capital Management (1.57%) Wellington Management Company (1.48%) AllianceBernstein (1.32%) Controversies Nike has contracted with more than 700 shops around the world and has offices located in 45 countries outside the United States. Most of the factories are located in Asia, including Indonesia, China, Taiwan, India, Thailand, Vietnam, Pakistan, Philippines, and Malaysia. Nike is hesitant to disclose information about the contract companies it works with. However, due to harsh criticism from some organizations like CorpWatch, Nike has disclosed information about its contract factories in its Corporate Governance Report. Sweatshops In the 1990s, Nike received criticism for its use of sweatshops. Beginning in 1990, many protests occurred in big cities such as Los Angeles, Washington, DC and Boston in order to show public outcry for Nike's use of child labor and sweatshops. Nike has been criticized for contracting with factories (known as Nike sweatshops) in countries such as China, Vietnam, Indonesia and Mexico. Vietnam Labor Watch, an activist group, has documented that factories contracted by Nike have violated minimum wage and overtime laws in Vietnam as late as 1996, although Nike claims that this practice has been stopped. As of July 2011, Nike stated that two-thirds of its factories producing Converse products still do not meet the company's standards for worker treatment. A July 2011 Associated Press article stated that employees at the company's plants in Indonesia reported constant abuse from supervisors. Child labor During the 1990s, Nike faced criticism for the use of child labor in Cambodia and Pakistan in factories it contracted to manufacture soccer balls. Although Nike took action to curb or at least reduce the practice, they continue to contract their production to companies that operate in areas where inadequate regulation and monitoring make it hard to ensure that child labor is not being used. In 2001, a BBC documentary uncovered occurrences of child labor and poor working conditions in a Cambodian factory used by Nike. The documentary focused on six girls, who all worked seven days a week, often 16 hours a day. Strike in China factory In April 2014, one of the biggest strikes in mainland China took place at the Yue Yuen Industrial Holdings Dongguan shoe factory, producing amongst others for Nike. Yue Yuen did underpay an employee by 250 yuan (40.82 US Dollars) per month. The average salary at Yue Yuen is 3000 yuan per month. The factory employs 70,000 people. This practice was in place for nearly 20 years. Paradise Papers On November 5, 2017, the Paradise Papers, a set of confidential electronic documents relating to offshore investment, revealed that Nike is among the corporations that used offshore companies to avoid taxes. Appleby documents detail how Nike boosted its after-tax profits by, among other maneuvers, transferring ownership of its Swoosh trademark to a Bermudan subsidiary, Nike International Ltd. This transfer allowed the subsidiary to charge royalties to its European headquarters in Hilversum, Netherlands, effectively converting taxable company profits to an account payable in tax-free Bermuda. Although the subsidiary was effectively run by executives at Nike's main offices in Beaverton, Oregon—to the point where a duplicate of the Bermudan company's seal was needed—for tax purposes the subsidiary was treated as Bermuda. Its profits were not declared in Europe and came to light only because of a mostly unrelated case in US Tax Court, where papers filed by Nike briefly mention royalties in 2010, 2011 and 2012 totaling $3.86 billion. Under an arrangement with Dutch authorities, the tax break was to expire in 2014, so another reorganization transferred the intellectual property from the Bermudan company to a Dutch commanditaire vennootschap or limited partnership, Nike Innovate CV. Dutch law treats income earned by a CV as if it had been earned by the principals, who owe no tax in the Netherlands if they do not reside there. Colin Kaepernick In September 2018, Nike announced it had signed former American football quarterback Colin Kaepernick, noted for his controversial decision to kneel during the playing of the US national anthem, to a long-term advertising campaign. According to Charles Robinson of Yahoo! Sports, Kaepernick and Nike agreed to a new contract despite the fact Kaepernick has been with the company since 2011 and said that \"interest from other shoe companies\" played a part in the new agreement. Robinson said the contract is a \"wide endorsement\" where Kaepernick will have his own branded line including shoes, shirts, jerseys and more. In response, some people set fire to their own Nike-branded clothes and shoes or cut the Nike swoosh logo out of their clothes, and the Fraternal Order of Police called the advertisement an \"insult\"; others, such as LeBron James, Serena Williams, and the National Black Police Association, praised Nike for its campaign. The College of the Ozarks removed Nike from all their athletic uniforms in response. During the following week, Nike's stock price fell 2.2%, even as online orders of Nike products rose 27% compared with the previous year. In the following three months, Nike reported a rise in sales. In July 2019, Nike released a shoe featuring a Betsy Ross flag called the Air Max 1 Quick Strike Fourth of July trainers. The trainers were designed to celebrate Independence Day. The model was subsequently withdrawn after Colin Kaepernick told the brand he and others found the flag offensive because of its association with slavery. Nike's decision to withdraw the product drew criticism from Arizona's Republican Governor, Doug Ducey, and Texas's Republican Senator Ted Cruz. Nike's decision was praised by others due to the use of the flag by white nationalists, but the Anti-Defamation League's Center on Extremism has declined to add the flag to its database of \"hate symbols.\" Hong Kong protests US Vice President Mike Pence criticized Nike for \"siding with the Chinese Communist Party and silencing free speech\". He claimed that after Houston Rockets general manager Daryl Morey was criticized by the Chinese government for his tweet supporting the 2019 Hong Kong protests, Nike removed Rockets merchandise from its stores in China. On January 31, 2020, the World Athletics issued new guidelines concerning shoes to be used in the upcoming Tokyo 2020 Olympics. These updates came in response to criticisms concerning technology in the Nike Vaporfly running shoes, which had been submitted beginning around 2017–2018. These criticisms stated that the shoes provided athletes with an unfair advantage over their opponents and some critics considered it to be a form of technology doping. According to Nike funded research, the shoes can improve efficiency by up to 4.2% and runners who have tested the shoe are saying that it causes reduced soreness in the legs; sports technologist Bryce Dyer attributes this to the ZoomX and carbon fiber plate since it absorbs the energy and \"spring[s] runners forward\". Some athletes, scientists, and fans have compared this to the 2008 LAZR swimsuit controversy. Some of the major changes in the guidelines that have come about as a result of these criticisms include that the \"sole must be no thicker than 40mm\" and that \"the shoe must not contain more than one rigid embedded plate or blade (of any material) that runs either the full length or only part of the length of the shoe. The plate may be in more than one part but those parts must be located sequentially in one plane (not stacked or in parallel) and must not overlap\". The components of the shoes are not the only thing that had major changes; starting April 30, 2020, \"any shoe must have been available for purchase by any athlete on the open retail market (online or in store) for a period of four months before it can be used in competition\". Prior to these new guidelines World Athletics reviewed the Vaporfly shoes and \"concluded that there is independent research that indicates that the new technology incorporated in the soles of road and spiked shoes may provide a performance advantage\" and that it recommends further research to \"establish the true impact of [the Vaporfly] technology.\" Forced Uyghur labor allegations In December 2021, the European Center for Constitutional and Human Rights filed a criminal complaint in a Dutch court against Nike and other brands, alleging that they benefited from the use of forced Uyghur labor in Xinjiang. In July 2023, the Canadian Ombudsperson for Responsible Enterprise opened an investigation into Nike to probe allegations of forced Uyghur labor in its supply chain. Research of the social democratic party in the European Parliament, the Sheffield Hallam University and further groups accused Nike in 2023 of using forced labor camps exploiting Muslim Uyghurs in China provided by the Anhui Huamao Group Co., Ltd. for production. Welfare of animals used in sourcing Following criticism from animal rights groups, Nike declared its intent in 2023 to phase out the use of wool sourced from lambs that had been subjected to mulesing, a controversial practice involving the removal of skin from live lambs. Also in 2023, Nike pledged to eliminate the use of kangaroo leather in favor of a synthetic alternative, in response to animal activists' charge that the killing of kangaroos was unethical. Environmental record In 2007, New England–based environmental organization Clean Air-Cool Planet ranked Nike among the top three companies (out of 56) in a survey of climate-friendly companies. Recycling Nike has also been praised for its Nike Grind program, which closes the product lifecycle, by groups such as Climate Counts. Since 1993, Nike has worked on its Reuse-A-Shoe program. This program is Nike's longest-running program that benefits both the environment and the community by collecting old athletic shoes of any type in order to process and recycle them. The material that is produced is then used to help create sports surfaces such as basketball courts, running tracks, and playgrounds. Nike France made their Reuse-A-Shoe program available online so that they could make it easier for consumers to send in their old shoes. In 2017, it was estimated that 28,000,000 shoes were collected since its start in 1993. Nike limited the mail-in option of the program because they are aware that the emissions from shipping would offset the good, they are trying to do. They work with the National Recycling Coalition to help limit transportation of recycled shoes. During transportation most of the vehicles that are used are using diesel or fuel oil. Diesel oil emits 22.44 pounds of Carbon Dioxide per gallon. A campaign that Nike began for Earth Day 2008 was a commercial that featured basketball star Steve Nash wearing Nike's Trash Talk Shoe, which had been constructed in February 2008 from pieces of leather and synthetic leather waste from factory floors. The Trash Talk Shoe also featured a sole composed of ground-up rubber from a shoe recycling program. Nike claims this is the first performance basketball shoe that has been created from manufacturing waste, but it only produced 5,000 pairs for sale. Sulfur hexafluoride Sulfur hexafluoride is an extremely potent and persistent greenhouse gas that was used to fill the cushion bags in all \"Air\"-branded shoes from 1992 to 2006. 277 tons was used during the peak in 1997. Toxic chemicals In 2008, a project through the University of North Carolina at Chapel Hill found workers were exposed to toxic isocyanates and other chemicals in footwear factories in Thailand. In addition to inhalation, dermal exposure was the biggest problem found. This could result in allergic reactions including asthmatic reactions. Water pollution In July 2011, environmental group Greenpeace published a report regarding water pollution impacting the Yangtze River emitted from a major textile factory operated by Nike supplier Youngor Group. Following the report, Nike, as well as Adidas, Puma, and a number of other brands included in the report announced an agreement to stop discharging hazardous chemicals by 2020. However, in July 2016 Greenpeace released a follow-up report which found that Nike \"does not take individual responsibility\" for eliminating hazardous chemicals, stating that Nike had not made an explicit commitment to riding itself of perfluorinated compounds, and that \"Nike does not ensure its suppliers report their hazardous chemical discharge data and has not made a commitment to do so\". Back in 2016, Nike started to use water free dyeing materials so that they can help reduce their water use in their Southeast Asian factories. Carbon footprint Nike reported Total CO2e emissions (Direct + Indirect) for the twelve months ending June 30, 2020 at 317 Kt (+12/+4% y-o-y) and plans to reduce emissions 65% by 2030 from a 2015 base year. This science-based target is aligned with Paris Agreement to limit global warming to 1.5 °C above pre-industrial levels. According to a study done in 2017, Nike contributed 3,002,529 metric tons of Carbon Dioxide in 2017 combined from different sectors in the company like retail, manufacturing, management, and more. While emissions of Nike's two corporate jets represent less than 0.1% of its total emissions, they have increased by 20% from 2015 to 2023. Partnership with Newlight In 2021, Nike announced they were working with Newlight Technologies to find more eco-friendly materials for their sneakers. They specifically mentioned Newlight's AirCarbon product which is a bioplastic that can be used to make shoes. The bioplastic is used as a replacement to leather, plastic, and other materials that are like that. Newlight was reported saying that the goal is to reduce Nike's carbon footprint. Sustainability Nike has taken steps to reduce its environmental impact. It has worked to reduce carbon emissions nearly 3% across its value chain from its FY11 baseline, and sourced from fewer, higher-performing contract factories. In 2019, Nike began a program called \"Move to Zero\" in an effort to achieve zero waste and zero carbon in the organization's supply chain and product lifetime. The men's and women's sections of the collection contain at least 60% organic and recycled materials, including sustainably sourced cotton. Marketing strategy Nike promotes its products through sponsorship agreements with celebrity athletes, professional teams and college athletic teams. Nike has endorsement deals with many top sports players such as LeBron James, Kevin Durant, and Serena Williams. Advertising In 1982, Nike aired its first three national television ads, created by newly formed ad agency Wieden+Kennedy (W+K), during the broadcast of the New York Marathon. The Cannes Advertising Festival has named Nike its Advertiser of the Year in 1994 and 2003, making it the first company to receive that honor twice. Nike also has earned the Emmy Award for best commercial in 2000 and 2002. The first was for \"The Morning After,\" a satirical look at what a runner might face on the morning of January 1, 2000, if every dire prediction about the Y2K problem came to fruition. The second was for a 2002 spot called \"Move,\" which featured a series of famous and everyday athletes in a variety of athletic pursuits. Beatles song Nike was criticized for its use of the Beatles song \"Revolution\" in a 1987 commercial against the wishes of Apple Records, the Beatles' recording company. Nike paid US$250,000 to Capitol Records Inc., which held the North American licensing rights to the recordings, for the right to use the Beatles' rendition for a year. That same year, Apple Records sued Nike Inc., Capitol Records Inc., EMI Records Inc. and Wieden+Kennedy for $15 million. Capitol-EMI countered by saying the lawsuit was \"groundless\" because Capitol had licensed the use of \"Revolution\" with the \"active support and encouragement of Yoko Ono, a shareholder and director of Apple Records.\" Nike discontinued airing ads featuring \"Revolution\" in March 1988. Yoko Ono later gave permission to Nike to use John Lennon's \"Instant Karma\" in another advertisement. New media marketing Nike was an early adopter of internet marketing, email management technologies, and using broadcast and narrowcast communication technologies to create multimedia marketing campaigns. Minor Threat advertisement In late June 2005, Nike received criticism from Ian MacKaye, owner of Dischord Records, guitarist/vocalist for Fugazi and The Evens, and front man of the defunct punk band Minor Threat, for appropriating imagery and text from Minor Threat's 1981 self-titled album's cover art in a flyer promoting Nike Skateboarding's 2005 East Coast demo tour. On June 27, Nike Skateboarding's website issued an apology to Dischord, Minor Threat, and fans of both and announced that they have tried to remove and dispose of all flyers. They stated that the people who designed it were skateboarders and Minor Threat fans themselves who created the advertisement out of respect and appreciation for the band. The dispute was eventually settled out of court between Nike and Minor Threat. Nike 6.0 As part of the 6.0 campaign, Nike introduced a new line of T-shirts that include phrases such as \"Dope\", \"Get High\" and \"Ride Pipe\" – sports lingo that is also a double entendre for drug use. Boston Mayor Thomas Menino expressed his objection to the shirts after seeing them in a window display at the city's Niketown and asked the store to remove the display. \"What we don't need is a major corporation like Nike, which tries to appeal to the younger generation, out there giving credence to the drug issue,\" Menino told The Boston Herald. A company official stated the shirts were meant to pay homage to extreme sports, and that Nike does not condone the illegal use of drugs. Nike was forced to replace the shirt line. NBA uniform deal In June 2015, Nike signed an 8-year deal with the NBA to become the official uniform supplier for the league, beginning with the 2017–18 season. The brand took over for Adidas, who provided the uniforms for the league since 2006. Unlike previous deals, Nike's logo appear on NBA jerseys – a first for the league. Initially, the Charlotte Hornets, owned by longtime Nike endorser Michael Jordan, were the only team not to sport the Nike swoosh, instead wearing the Jumpman logo associated with Jordan-related merchandise. However, beginning with the 2020–21 season, the Jumpman replaced the swoosh on the NBA's alternate \"Statement\" uniforms. In October 2024, Nike announced a 12-year global extension of the partnership, retaining exclusive rights to design and manufacture uniforms for the NBA, WNBA and NBA G League through 2037. Sponsorship Nike sponsors top athletes in many sports to use their products and promote and advertise their technology and design. Nike's first professional athlete endorser was Romanian tennis player Ilie Năstase. The first track endorser was distance runner Steve Prefontaine. Prefontaine was the prized pupil of the company's co-founder, Bill Bowerman, while he coached at the University of Oregon. Today, the Steve Prefontaine Building is named in his honor at Nike's corporate headquarters. Nike has only made one statue of its sponsored athletes and it is of Steve Prefontaine. Nike has also sponsored many other successful track and field athletes over the years, such as Sebastian Coe, Carl Lewis, Jackie Joyner-Kersee, Michael Johnson and Allyson Felix. The signing of basketball player Michael Jordan in 1984, with his subsequent promotion of Nike over the course of his career, with Spike Lee as Mars Blackmon, proved to be one of the biggest boosts to Nike's publicity and sales. Nike is a major sponsor of the athletic programs at Penn State University and named its first child care facility after Joe Paterno when it opened in 1990 at the company's headquarters. Nike originally announced it would not remove Paterno's name from the building in the wake of the Penn State sex abuse scandal. After the Freeh Report was released on July 12, 2012, Nike CEO Mark Parker announced the name Joe Paterno would be removed immediately from the child development center. A new name has yet to be announced. In the early 1990s, Nike made a strong push into the soccer business making endorsement deals with famous and charismatic players such as Romário, Eric Cantona or Edgar Davids. They continued the growth in the sport by signing more top players including: Ronaldo, Ronaldinho, Francesco Totti, Thierry Henry, Didier Drogba, Andrés Iniesta, Wayne Rooney and still have many of the sport's biggest stars under their name, with Cristiano Ronaldo, Zlatan Ibrahimović, Neymar, Harry Kane, Eden Hazard and Kylian Mbappé among others. A Barcelona prodigy, Lionel Messi had been signed with Nike since age 14, but transferred to Adidas after they successfully challenged their rival's claim to his image rights in court. Nike has been the official ball supplier for the Premier League since the 2000–01 season. In 2012, Nike carried a commercial partnership with the Asian Football Confederation. In August 2014, Nike announced that they will not renew their kit supply deal with Manchester United after the 2014–15 season, citing rising costs. Since the start of the 2015–16 season, Adidas has manufactured Manchester United's kit as part of a world-record 10-year deal worth a minimum of £750 million. Nike still has many of the top teams playing in their uniforms, including: FC Barcelona, Paris Saint-Germain and Liverpool (the latter from the 2020–21 season), and the national teams of Brazil, France, England, Uruguay and the Netherlands among many others. Nike has been the sponsor for many top ranked tennis players. Brand's commercial success in the sport went hand in hand with the endorsement deals signed with the biggest and the world's most charismatic stars and number one ranked players of the subsequent eras, including John McEnroe in the 1980s, Andre Agassi and Pete Sampras in the 1990s and Roger Federer, Rafael Nadal, Serena Williams and Maria Sharapova with the start of the 21st century. Nike sponsored Tiger Woods until 2024, and remained on his side amid the controversies that shaped the golfer's career. In January 2013, Nike signed Rory McIlroy, the then No 1 golfer in the world to a 10-year sponsorship deal worth $250 million. Nike has also gone on to sign top players in golf including Scottie Scheffler, Brooks Koepka, Nelly Korda, Tommy Fleetwood, Tony Finau and Cam Davis. Nike’s 2016 decision to exit the golf equipment business–such as club manufacturing–due to an 8.2% decline sales in one year meant sponsored athletes exclusively wore Nike apparel. Nike was the official kit sponsor for the Indian cricket team from 2005 to 2020. On February 21, 2013, Nike announced it suspended its contract with South African limbless athlete Oscar Pistorius, due to him being charged with premeditated murder. Nike consolidated its position in basketball in 2015 when it was announced that the company would sign an 8-year deal with the NBA, taking over from the league's previous uniform sponsor, Adidas. The deal required all franchise team members to wear jerseys and shorts with the Swoosh logo, beginning with the 2017/18 season. After the success of partnership with Jordan, which resulted in the creation of the unique Air Jordan brand, Nike has continued to build partnership with the biggest names in basketball. LeBron James was given the Slogan \"We are All Witnesses\" when he signed with Nike. Similar to \"Air Jordan\", James' brand became massively popular. Some have had signature shoes designed for them, including Kobe Bryant, Jason Kidd, Vince Carter and more recently, James and Kevin Durant, Giannis Antetokounmpo, Jayson Tatum, Paul George and Luka Dončić, among others. Nike recently made signature shoes for WNBA stars as well, as the leagues popularity takes off. Although a dozen women have received signature sneakers in the WNBA's 27-year history, it had been over a decade since a woman had received a signature sneaker. Nike's first signature shoe in the WNBA was with Sheryl Swoops, and since then they have made signature silhouettes for Lisa Leslie, Dawn Staley, Cynthia Cooper, and most recently for Sabrina Ionescu. Caitlin Clark will also receive a signature shoe deal as part of her eight-year, 28 million dollar deal. A news report originating from CNN reported that Nike spent $11.5 billion, nearly a third of its sales, on marketing and endorsement contracts in the year 2018. Nike and its Jordan brand sponsored 85 men's and women's basketball teams in the NCAA tournament. Ties with the University of Oregon Nike maintains strong ties, both directly and through partnerships with Phil Knight, with the University of Oregon. Nike designs the University of Oregon football program's team attire. New unique combinations are issued before every game day. Tinker Hatfield, who also redesigned the university's logo, leads this effort. More recently, the corporation donated $13.5 million towards the renovation and expansion of Hayward Field. Phil Knight has invested substantial personal funds towards developing and maintaining the university's athletic apparatus. His university projects often involve input from Nike designers and executives, such as Tinker Hatfield. Causes In 2012, Nike is listed as a partner of the (PRODUCT)RED campaign together with other brands such as Girl, American Express, and Converse. The campaign's mission is to prevent the transmission of HIV from mother to child. The campaign's byline is \"Fighting For An AIDS Free Generation\". The company's goal is to raise and send funds, for education and medical assistance to those who live in areas heavily affected by AIDS. In 2023, Nike became the presenting sponsor of Reviving Baseball in Inner Cities, which encourages youth in underserved communities to participate in baseball and softball. Program The Nike Community Ambassador Program, allows Nike employees from around the world to go out and give to their community. Over 3,900 employees from various Nike stores have participated in teaching children to be active and healthy. Research In 2016, a study done by RTG Consulting Group reflected that Nike was the 3rd most relevant brand for Gen-Z in China. Roth MKM's 2023 Millennial survey reported in March that millennials with health and wellness concerns in the aftermath of the pandemic ranked brands like Nike, Adidas and Lululemon as their preferred brands for purchases. In January 2023, a study by Rakuten concluded that Nike was the most popular sportswear brand in the US, followed by Lululemon and Adidas. In July 2023, a study by Kantar found that Americans consider Nike as the Most Inclusive Brands (alongside other top brands like Amazon, and Disney)."
}