{
  "ticker": "NRG",
  "cik": "0001013871",
  "company_name": "NRG Energy",
  "corrected_name": "NRG Energy",
  "wiki_title_used": "NRG Energy",
  "exists": true,
  "raw_text": "NRG Energy, Inc. is an American energy company, headquartered in Houston, Texas. It was formerly the wholesale arm of Northern States Power Company (NSP), which became Xcel Energy, but became independent in 2000. NRG Energy is involved in energy generation and retail electricity. Their portfolio includes natural gas generation, coal generation, oil generation, nuclear generation, wind generation, utility-scale generation, and distributed solar generation. NRG serves over 7 million retail customers in 24 US states including Texas, Connecticut, Delaware, Illinois, Maryland, Massachusetts, New Jersey, New York, Pennsylvania, Ohio; the District of Columbia, and eight provinces in Canada.\nNRG Energy has acquired eleven other energy companies, both generation and retail, that include Reliant Energy, XOOM Energy, Green Mountain Energy, Stream Energy, GenOn Energy, Discount Power and Cirro Energy. As of 2018, they generate 23,000 MW of power from 40 power plants across the country. They incorporate a range of sales channels for retail customers, including call centers, direct sales, websites, brokers, and brick-and-mortar stores. Their wholesale generation services include plant operations, commercial operations, energy services, distributed generation services, and energy, procurement, and construction (EPC) services.\n\nHistory\n1980s–1990s\nNRG Energy was formed in 1989 as one of NSP's wholly owned subsidiaries. In 1997, NRG Energy, Inc. had 2,650 MW of generation and operational responsibility for a supplementary 5,374 MW. By 1998, the company began an aggressive acquisition campaign. It bought plants from Niagara Mohawk, San Diego Gas and Electric, Consolidated Edison, Montaup Electric, Rochester Gas and Electric, and Connecticut Light & Power. It continued to grow through acquisitions and in 2000, acquired Cajun Electric Power Cooperative's facilities.\n\n2000s\nIn 2001, NRG Energy had a net ownership of 24,357 MW of generation globally, with 19,077 MW in the United States. From 1996 to 2001, the operating revenue increased from $104 million to $3 billion, and the debt increased from $212 million to $8.3 billion. By 2002, the debt had reached $9.4 billion, and NRG Energy sold its power plants in Hungary and the Czech Republic. To avert default by NRG, Xcel sold $500 million in stock in July 2002. In 2003, Xcel Energy paid NRG Energy $752 million for the benefit of NRG Energy's creditors and took a $2 billion write-off.\nOn May 14, 2003, NRG Energy filed for chapter 11 bankruptcy. In the company's reorganization, Xcel Energy relinquished its ownership interest, and NRG Energy became an independent, public company after bankruptcy. David W. Crane joined NRG as the chief executive in December. The reorganized NRG Energy eliminated about $5.2 billion of corporate debt along with $1.2 billion of additional claims by giving equity and cash to unsecured creditors.\nBy 2005, NRG Energy expanded again and added 7,600 MW of domestic capacity to its portfolio. The company acquired Dynegy's 50% of 1,800 MW of generation in California. They also acquired Texas GenCo in 2006, Reliant Energy in 2009, and Green Mountain Energy in 2010. The company began to focus on domestic markets and retreated from international electricity markets.\n\n2010s\nBy 2011, NRG Energy's generation portfolio had 25,135 MW, with only 1,000 MW outside of the United States. In 2012, they added GenOn Energy for $1.7 billion and in 2013, they added Edison Mission for $2.6 billion. This gave the company 46,000 MW total of generation capacity. In 2013, they also added a demand response company: Energy Curtailment Specialists, Inc. The business later became NRG Curtailment Solutions, Inc.\nDuring December 2015, NRG Energy released David Crane of his duty and Mauricio Gutierrez, the Chief Operating Officer at the time, was brought on as Chief Executive and President of NRG Energy. That same month, NRG's shares rose by 63% and closed at $17.90 after it had fallen by 60% in 2015. For the first three months of 2016, the company posted a net income of $47 million in comparison to the net loss of $136 million the first quarter of 2015. Gutierrez stated that paying down debt was a top priority.\nNRG Energy announced in February 2018 the sale of the company's stake in NRG Yield, a tax-advantaged renewable energy investment pass-through vehicle, to Global Energy Infrastructure Partners (GIP) and the sale of its Louisiana assets to Cleco Corporate Holdings. This included the 1,300 MW Cottonwood natural gas plant (1.3 GW), the 1,500 MW Big Cajun II coal and gas-fired plant (1.5 GW), and three other gas-fired peaking plants. In August, NRG Yield changed its name to Clearway Energy and began trading under the new name and ticker symbol (CWEN and CWEN.A) in the New York Stock Exchange on September 17. These sales are estimated to reduce NRG Energy's debt by $7 billion and reduce their energy generation portfolio from 50,000 MW (50 GW) to 24,000 MW (24 GW). In March 2018, the company planned to hasten its transition from an independent power producer model (IPP) to a customer driven integrated power model that favored retail businesses. After GenOn's exit in 2018, the NRG fleet shrunk to 23 GW but retained 2.9 million retail customers. The new fleet has 11.5 GW of generation (46% natural gas generation, 31% coal generation, and 15% oil generation) in Texas, 9.7 GW of generation in the East, and 2.6 GW of generation in the West. In March 2018, NRG Energy acquired XOOM Energy, a retail electricity provider, for $210 million. XOOM Energy served 300,000 customers in the East, which was added to NRG Energy's retail profile.\nIn a partnership with Cypress Creek Renewables, NRG is offering a long-term, fixed price, consumer solar energy project in June 2018. The first customer of the project is Sysco, who has signed a 10-year renewable energy agreement. Cypress Creek Renewables will build, own, and operate three solar gardens in Texas that will have a combined power capacity of 25 MW. NRG Energy will buy the energy and schedule, distribute and manage the energy for Sysco. The solar project is expected to come online by the first quarter of 2019. The solar installations are expected to provide 10 percent of Sysco's electricity nationwide by generating 25 megawatts of power. NRG Energy is offering solar renewable program contracts for 7–10 years, with the ability to customize the program. The company also assumes the risk of wholesale pricing fluctuation.\nIn July 2018, NRG and GenOn consummated the NRG settlement resulting in NRG Energy paying GenOn Energy $125 million in a net payment during GenOn's chapter 11 bankruptcy agreement. The deal would help GenOn revamp its capital structure and reemerge with new debt instruments.\n\n2020s\nIn November 2023, Mauricio Gutierrez resigned from his role as CEO.  Larry Coben was named Interim President and CEO.\n\nAcquisitions\nWhen the state of Texas deregulated the electricity market, Houston Industries, the parent company of Houston Lighting & Power (HL&P), was broken up. In 2003, Houston Industries was split into three companies. The power plants went to Texas Genco, CenterPoint Energy took over the distribution system, and the retail and wholesale electricity business became Reliant Energy.\nIn 2006, NRG Energy bought Texas Genco from a group of private equity firms for roughly $5.9 billion. Afterwards, in May 2009, NRG Energy acquired the retail operations of Reliant Energy. With those two moves, NRG's holdings represented most of the former HL&P and today serve 1.6 million customers in Texas. The retail operations continue to operate under the Reliant Energy name, while old Reliant's wholesale operations became RRI Energy.\nFollowing the acquisition of Reliant, NRG extended its retail footprint with the acquisition of Green Mountain Energy in November 2010. In doing so, NRG also became the largest retailer of green power in the nation, providing all of its Green Mountain and many of its Reliant customers with energy derived from 100% renewable resources.\nNRG Energy completed its acquisition of GenOn Energy in December 2012 for $1.7 billion in stock and cash. The GenOn name was retired in the merger, but the combined company retained GenOn's Houston headquarters to coordinate operations. That company, in turn, had been formed out of the merger of RRI Energy and Mirant Corporation in 2010.\nIn August 2013, NRG acquired Energy Curtailment Specialists, a Buffalo, New York-based Demand response company. The terms of the deal were not disclosed.\n\nIn March 2014, NRG Energy acquired Roof Diagnostics Solar (RDS), a residential solar power installation company, for an undisclosed amount. RDS headquarters remained in Wall Township, New Jersey while they operated under NRG Residential Solar Solutions. That same month, NRG also acquired the retail power business of Dominion Resources Inc., which included Texas-based Cirro Energy and added 600,000 customer accounts to NRG Energy's retail business. Cirro Energy has continued to operate under the Cirro name. In September 2014, NRG acquired Goal Zero, a manufacturer of personal solar power products. The following month, NRG Energy acquired the residential solar company Pure Energies Group, which focused on web-based customer acquisition. This provided a simplified solar adoption process as well as a sales channel for Goal Zero.\nIn March 2018, NRG acquired XOOM Energy, a mainly residential-focused, retail energy supplier with 300,000 RCE customers. The sale price was $210 million, which includes working capital and $6 million in transaction costs. It was an all-cash transaction that was funded with $75 million from excess cash and $135 million in debt. NRG Energy stated that the acquisition would serve to balance NRG's generation portfolio in the east. In May 2019, NRG agreed to purchase Stream Energy for $300 million. The deal was finalized that August.\nIn July 2020, NRG Energy and Centrica entered an agreement under which NRG would acquire Direct Energy for $3.625 billion in an all-cash transaction. The deal was approved in January 2021, adding more than 3 million retail customers across 50 US states and 6 Canadian provinces.\nIn December 2022, NRG announced the acquisition of Vivint Smart Home for $2.8 billion in cash, adding home security and automation to its vast product offer, expected to close in the first quarter of 2023.\nIn May 2025, NRG announced the acquisition of the natural gas generation facilities and a commercial and industrial virtual power plant from LS_Power at a value of approximately $12 billion.\n\nNaming rights\nNRG Energy holds the naming rights to the NRG Park campus (formerly Reliant Park) in Houston, Texas, home to the NRG Astrodome, NRG Stadium, NRG Arena and NRG Center. NRG Energy also holds the naming rights for a NRG Station (formerly AT&T Station), a rapid transit station  in Philadelphia, Pennsylvania.\n\nProducts and Services\nNRG Energy has multiple products and services, including generation facilities, operations, management services (O&M), retail electricity, commercial industrial backup generators, and an internal data analytics engine called SpaceTag.\n\nOperations & Management (O&M) Services\nIn 2014, NRG Energy helped restart the Aspen Power plant, the first wood-based biomass plant in Texas. The plant is overseen by InventivEnergy LLC, but NRG operates and maintains the facility, including hiring the management team and operating staff. The plant consumes 525,000 tons of logging debris and municipal wood waste annually and can produce 50 MW of power. Aspen Power uses a stoker-type boiler that is made to reduce the air pollution from the plant.  NRG Energy took over the O&M for two more Texas plants in November 2016. The two facilities, Mustang and Antelope Elk Energy Center, are owned by Golden Spread Electric Cooperative Inc. Mustang is a natural gas turbine plant in Denver City that produces 958 MW of power. Antelope Elk Energy Center is also a natural gas facility located in Abernathy that creates 744 MW of power. In 2016, NRG Energy oversaw O&M for nine other generation facilities and had 9.2 GW portfolio. By 2018, NRG Energy maintained 2.4 GW of renewable power through their O&M operations in 17 different states. They sold the renewable O&M business, along with NRG Yield and NRG's renewable energy development and operations, to Global Infrastructure Partners (GIP) for $1.375 billion in cash.\n\nRetail electricity\nNRG's Retail Power services provide electricity services to more than 3 million customers, mostly in Texas and the Northeast.   \nIn March 2014, NRG Energy acquired Dominion Resources Inc. and Cirro Energy, growing their retail electric customer base by 30 percent. It adds about 600,000 accounts to its existing 2 million residential and commercial customers. Dominion's retail electricity customers were mainly in Connecticut, Illinois, Massachusetts, Maryland, New York, New Jersey, Ohio, and Pennsylvania; Cirro mainly served residential and business customers in Texas. NRG Energy operates Cirro Energy under Cirro's name. In 2014, NRG Energy had two other retail electricity services, Reliant Energy and Green Mountain.\nBy 2018, NRG Energy added Pennywise Power to its retail electricity portfolio. They picked up a number of customers from Pioneer Energy of Sugar Land and Stat Energy of Richardson, as well.\nIn July of that year, a heat wave caused the day-ahead pricing spike to $2,172 per MW hour, compared to $28 per MW hour the previous summer.\n\nCommercial Industrial Backup Generators\nNRG Energy partnered with Cummins in December 2017 to offer backup generators to run as part of an asset-backed demand response system. The Cummins natural-gas-fired genset would be used when the grid is down, and it could shave 10 to 15 percent off energy bills by running it as part of an aggregated fleet of an \"estimated hundreds of megawatts capacity\". The backup generators help gas stations, supermarkets, ATMs, and other everyday life necessities during power outages from hurricanes or other natural disasters.\n\nSpaceTag\nIn April 2017, NRG Energy publicly mentioned its in-house analytics platform SpaceTag. The analytics engine found the best combination of distributed resources for every building in a given territory and showed what it was worth to each customer. NRG tested SpaceTag to gather \"60 megawatts of flexible clean energy capacity for key parts of SCE's [Southern California Edison] Orange County and Los Angeles power grid\". The platform, developed by NRG's Station A research team in San Francisco, was originally intended to help with customer acquisition but has since evolved. SpaceTag used data about the physical attributes of a building, how it was used, and existing energy data to create an energy performance portfolio and then assessed its location in the power grid. It also used data from the distributed energy equipment, including its capital cost, associated costs of providing generation, the demand-reduction attributes over time, and the best mix of technology on the building and portfolio level. After SpaceTag is deployed, it can then monitor the operations and the performance of the building. NRG Energy mapped 24 different utility territories outside of SCE.\nBy 2018, NRG Energy no longer owned SpaceTag as Station A became a standalone company. NRG Energy owns a minority stake in the company and is a customer of Station A.\n\nWholesale generation\nAfter the GenOn merger in 2012, NRG had 47,000 MW of total generation capacity, enough to power approximately 40 million homes. Its nearly 100 power plants were located in 18 states in the Northeast, Chicago area, Gulf Coast, Southwest, Nevada, and California.  Generation facilities include mostly fossil fuel power plants powered by natural gas, oil, and coal; plus four wind farms (in Texas) and six solar farms (in California, Arizona, and New Mexico).  NRG also has a 44% ownership stake in the South Texas Nuclear Generating Station and a 37.5% stake in a coal power plant in Gladstone, Queensland, Australia.  Some facilities use cogeneration and the company also owns 28 MW of solar distributed generation.\nNRG Energy owns the Indian River Power Plant near Millsboro, Delaware. The plant is a 784 MW facility that produces electricity from the combustion of coal.\nDuring 2018, NRG Energy sold four of their wholesale generation platforms: NRG Yield, Operations & Management (O&M) business, development business, and NRG's South Central business. Global Infrastructure Partners (GIP) bought NRG Yield, the O&M business, and the development business for $1.375 billion in cash proceeds. NRG Yield had a diverse portfolio of energy generation including wind, solar, and natural gas, with a total operating capacity of 5,100 MW. The O&M platform managed 2,400 MW of renewable energy in 17 different states, and the development business had 6,400 MW of renewable generation opportunities in the project pipeline. GIP and NRG Yield purchased the Carlsbad Energy Center natural gas project (527 MW) and the Buckthorn Solar project (154 MW) from NRG Energy. Cleco Corporate Holdings purchased NRG's South Central business for $1 billion in price and cash proceeds. The South Central business had 3,500 MW generation capacity, including the natural gas facilities Bayou Cove plant (225 MW), Sterlington plant (176 MW), and the Cottonwood plant (1,263,000 MW). NRG Energy also sold 1,891 MW of coal-fired capacity to Cleco from their Big Cajun-I and Big Cajun-II plants. In July 2018, NRG Energy released GenOn and paid $125 million in net payment during GenOn's bankruptcy settlement. In 2018, NRG Energy reduced its generation capacity to 23,000 MW. They also reduced their power plants from 100 to 40, but they retained 2.9 million retail customers.\n\nGreen energy initiatives\nBeginning in 2009, NRG began an initiative to become a green energy producer in the United States and started investing money in clean energy projects. They include onshore and offshore wind power, solar thermal energy, photovoltaic, and distributed solar power facilities, and repowering of some of their traditional coal plants with biomass. In late 2010, NRG launched the EVgo network, the first completely private public car charging station network for electric power vehicles. In 2016, NRG sold the EVgo charging network to Vision Ridge Partners, a Colorado-based sustainable-energy investment firm, for an undisclosed amount. In December 2019, LS Power signed an agreement to acquire EVgo. In January 2021, EVgo announced its plans to go public via a SPAC merger, which was completed in July 2021 with the \"EVGO\" ticker on the Nasdaq.\nIn March 2021, EVgo announced plans to install chargers at midwest retail chain Meijer's superstores.\nGreen Mountain Energy, one of NRG Energy's retail subsidiaries, signed a two-year agreement beginning in January 2011 to provide 100% renewable energy for the Empire State Building.\nIn 2012, NRG Energy partnered with the DLR Group to design an open-air, solar system for Patriot Place in Massachusetts. The solar array produces an estimated 30% of the power for Patriot Place and provides renewable energy education for visitors at kiosks, electric vehicle charging stations, and off-grid solar “Helios” at the main entrance. The solar panel canopies also offer weather protection and reduce carbon emissions by an estimated 800 metric tons a year.\nIn 2013, NRG Energy helped the San Francisco 49ers Stadium gain LEED certification by installing three solar array-covered bridges, a solar canopy over the green roof on the suite tower, and solar panels over the 49ers training center. The solar arrays have a peak capacity of 400 kW and provide enough power during the year to offset the cost of power consumed at 49ers home games. NRG Energy provided sustainable energy for Super Bowl LI in 2017 at NRG Stadium. The stadium received power from 600 solar panels and used only LEDs to light up the field, using 60% less energy than previously. NRG Energy also agreed to provide renewable energy credits for any venue associated with the Super Bowl, such as the George R. Brown Convention Center and the hotels where the teams were staying. NRG Energy installed 11,000 solar panels and 14 wind turbines at the Eagles’ Lincoln Financial Field stadium. These renewable energy installations made the stadium the largest solar power plant in the NFL. The solar power plant produces 40% of the Eagles’ own energy and feed the energy back into the grid, which they buy back from NRG at a discounted rate. The Eagles and NRG Energy are in a multi-year corporate sponsorship agreement that helps the Eagles regulate their energy costs.\nNew York State Assemblywoman Aravella Simotas has been chair of a coalition to support the utility in their plan to replace its power plant in Astoria with a newer generator. The company stated its intention in 2012 to replace 31 older oil generators with new gas generators that will increase the megawatts of power while reducing emissions. As of 2018, of the 19 Astoria facilities listed in the 2018 NYISO Gold Book as being owned by NRG, 7 of the facilities are on the deactivated list (at a total of 140 MW of capacity rights), and 12 of the facilities (at a total of 558 MW in nameplate capacity) have each consistently produced less than 15 GWh a year since 2011. This is equivalent to running at full capacity for less than 4% of the year. These 12 units still collect annual revenues from the NYISO's capacity market for not producing energy. For example, at 6.40 ($/kW – Month), the 12 actively listed facilities would produce an annual capacity market revenue of $42.8 million for NRG. It is unclear if the 7 deactivated units still collect capacity market revenues. In July 2017, NRG filed a request with the New York State Public Service Commission to avoid Article 10 siting procedures for a proposed turbine replacement project which would represent a total proposed capacity of 579 MW. The turbine upgrades listed in the filing are new simple-cycle turbines. The filing states that since the proposed capacity is not 25 MW greater than the existing facility, Article 10 regulation is not required. As of November 2018, no ruling has been issued by the NYSPSC.\nJPMorgan Chase announced their plans in 2017 to power all their facilities in Texas through 100% renewable power by 2020. By the end of 2017, 75% of JPMorgan Chase's facilities ran on wind energy provided through NRG Energy's Buckthorn wind farm in Erath County. In 2018, NRG Energy was recognized for supporting the environment in the Hudson Valley through NRG Community Solar. The community solar company builds solar farms with industrial grade solar panels that produces and delivers clean energy directly to the power grid. This allows residents who cannot purchase rooftop solar to invest in solar energy generation and receive solar credits on their utility bills. The solar farms are maintained year-round, creating local jobs in the Hudson Valley. In January 2019, NRG Community Solar became Clearway Community Solar under the parent company Clearway Energy Group.\n\nSee also\nGreenStreet (NRG Tower)\nNew York energy law\nNRG Stadium\n\nReferences\nExternal links\nOfficial website \nBusiness data for NRG Energy: \nEVgo Website",
  "clean_text": "NRG Energy, Inc. is an American energy company, headquartered in Houston, Texas. It was formerly the wholesale arm of Northern States Power Company (NSP), which became Xcel Energy, but became independent in 2000. NRG Energy is involved in energy generation and retail electricity. Their portfolio includes natural gas generation, coal generation, oil generation, nuclear generation, wind generation, utility-scale generation, and distributed solar generation. NRG serves over 7 million retail customers in 24 US states including Texas, Connecticut, Delaware, Illinois, Maryland, Massachusetts, New Jersey, New York, Pennsylvania, Ohio; the District of Columbia, and eight provinces in Canada. NRG Energy has acquired eleven other energy companies, both generation and retail, that include Reliant Energy, XOOM Energy, Green Mountain Energy, Stream Energy, GenOn Energy, Discount Power and Cirro Energy. As of 2018, they generate 23,000 MW of power from 40 power plants across the country. They incorporate a range of sales channels for retail customers, including call centers, direct sales, websites, brokers, and brick-and-mortar stores. Their wholesale generation services include plant operations, commercial operations, energy services, distributed generation services, and energy, procurement, and construction (EPC) services. History 1980s–1990s NRG Energy was formed in 1989 as one of NSP's wholly owned subsidiaries. In 1997, NRG Energy, Inc. had 2,650 MW of generation and operational responsibility for a supplementary 5,374 MW. By 1998, the company began an aggressive acquisition campaign. It bought plants from Niagara Mohawk, San Diego Gas and Electric, Consolidated Edison, Montaup Electric, Rochester Gas and Electric, and Connecticut Light & Power. It continued to grow through acquisitions and in 2000, acquired Cajun Electric Power Cooperative's facilities. 2000s In 2001, NRG Energy had a net ownership of 24,357 MW of generation globally, with 19,077 MW in the United States. From 1996 to 2001, the operating revenue increased from $104 million to $3 billion, and the debt increased from $212 million to $8.3 billion. By 2002, the debt had reached $9.4 billion, and NRG Energy sold its power plants in Hungary and the Czech Republic. To avert default by NRG, Xcel sold $500 million in stock in July 2002. In 2003, Xcel Energy paid NRG Energy $752 million for the benefit of NRG Energy's creditors and took a $2 billion write-off. On May 14, 2003, NRG Energy filed for chapter 11 bankruptcy. In the company's reorganization, Xcel Energy relinquished its ownership interest, and NRG Energy became an independent, public company after bankruptcy. David W. Crane joined NRG as the chief executive in December. The reorganized NRG Energy eliminated about $5.2 billion of corporate debt along with $1.2 billion of additional claims by giving equity and cash to unsecured creditors. By 2005, NRG Energy expanded again and added 7,600 MW of domestic capacity to its portfolio. The company acquired Dynegy's 50% of 1,800 MW of generation in California. They also acquired Texas GenCo in 2006, Reliant Energy in 2009, and Green Mountain Energy in 2010. The company began to focus on domestic markets and retreated from international electricity markets. 2010s By 2011, NRG Energy's generation portfolio had 25,135 MW, with only 1,000 MW outside of the United States. In 2012, they added GenOn Energy for $1.7 billion and in 2013, they added Edison Mission for $2.6 billion. This gave the company 46,000 MW total of generation capacity. In 2013, they also added a demand response company: Energy Curtailment Specialists, Inc. The business later became NRG Curtailment Solutions, Inc. During December 2015, NRG Energy released David Crane of his duty and Mauricio Gutierrez, the Chief Operating Officer at the time, was brought on as Chief Executive and President of NRG Energy. That same month, NRG's shares rose by 63% and closed at $17.90 after it had fallen by 60% in 2015. For the first three months of 2016, the company posted a net income of $47 million in comparison to the net loss of $136 million the first quarter of 2015. Gutierrez stated that paying down debt was a top priority. NRG Energy announced in February 2018 the sale of the company's stake in NRG Yield, a tax-advantaged renewable energy investment pass-through vehicle, to Global Energy Infrastructure Partners (GIP) and the sale of its Louisiana assets to Cleco Corporate Holdings. This included the 1,300 MW Cottonwood natural gas plant (1.3 GW), the 1,500 MW Big Cajun II coal and gas-fired plant (1.5 GW), and three other gas-fired peaking plants. In August, NRG Yield changed its name to Clearway Energy and began trading under the new name and ticker symbol (CWEN and CWEN.A) in the New York Stock Exchange on September 17. These sales are estimated to reduce NRG Energy's debt by $7 billion and reduce their energy generation portfolio from 50,000 MW (50 GW) to 24,000 MW (24 GW). In March 2018, the company planned to hasten its transition from an independent power producer model (IPP) to a customer driven integrated power model that favored retail businesses. After GenOn's exit in 2018, the NRG fleet shrunk to 23 GW but retained 2.9 million retail customers. The new fleet has 11.5 GW of generation (46% natural gas generation, 31% coal generation, and 15% oil generation) in Texas, 9.7 GW of generation in the East, and 2.6 GW of generation in the West. In March 2018, NRG Energy acquired XOOM Energy, a retail electricity provider, for $210 million. XOOM Energy served 300,000 customers in the East, which was added to NRG Energy's retail profile. In a partnership with Cypress Creek Renewables, NRG is offering a long-term, fixed price, consumer solar energy project in June 2018. The first customer of the project is Sysco, who has signed a 10-year renewable energy agreement. Cypress Creek Renewables will build, own, and operate three solar gardens in Texas that will have a combined power capacity of 25 MW. NRG Energy will buy the energy and schedule, distribute and manage the energy for Sysco. The solar project is expected to come online by the first quarter of 2019. The solar installations are expected to provide 10 percent of Sysco's electricity nationwide by generating 25 megawatts of power. NRG Energy is offering solar renewable program contracts for 7–10 years, with the ability to customize the program. The company also assumes the risk of wholesale pricing fluctuation. In July 2018, NRG and GenOn consummated the NRG settlement resulting in NRG Energy paying GenOn Energy $125 million in a net payment during GenOn's chapter 11 bankruptcy agreement. The deal would help GenOn revamp its capital structure and reemerge with new debt instruments. 2020s In November 2023, Mauricio Gutierrez resigned from his role as CEO. Larry Coben was named Interim President and CEO. Acquisitions When the state of Texas deregulated the electricity market, Houston Industries, the parent company of Houston Lighting & Power (HL&P), was broken up. In 2003, Houston Industries was split into three companies. The power plants went to Texas Genco, CenterPoint Energy took over the distribution system, and the retail and wholesale electricity business became Reliant Energy. In 2006, NRG Energy bought Texas Genco from a group of private equity firms for roughly $5.9 billion. Afterwards, in May 2009, NRG Energy acquired the retail operations of Reliant Energy. With those two moves, NRG's holdings represented most of the former HL&P and today serve 1.6 million customers in Texas. The retail operations continue to operate under the Reliant Energy name, while old Reliant's wholesale operations became RRI Energy. Following the acquisition of Reliant, NRG extended its retail footprint with the acquisition of Green Mountain Energy in November 2010. In doing so, NRG also became the largest retailer of green power in the nation, providing all of its Green Mountain and many of its Reliant customers with energy derived from 100% renewable resources. NRG Energy completed its acquisition of GenOn Energy in December 2012 for $1.7 billion in stock and cash. The GenOn name was retired in the merger, but the combined company retained GenOn's Houston headquarters to coordinate operations. That company, in turn, had been formed out of the merger of RRI Energy and Mirant Corporation in 2010. In August 2013, NRG acquired Energy Curtailment Specialists, a Buffalo, New York-based Demand response company. The terms of the deal were not disclosed. In March 2014, NRG Energy acquired Roof Diagnostics Solar (RDS), a residential solar power installation company, for an undisclosed amount. RDS headquarters remained in Wall Township, New Jersey while they operated under NRG Residential Solar Solutions. That same month, NRG also acquired the retail power business of Dominion Resources Inc., which included Texas-based Cirro Energy and added 600,000 customer accounts to NRG Energy's retail business. Cirro Energy has continued to operate under the Cirro name. In September 2014, NRG acquired Goal Zero, a manufacturer of personal solar power products. The following month, NRG Energy acquired the residential solar company Pure Energies Group, which focused on web-based customer acquisition. This provided a simplified solar adoption process as well as a sales channel for Goal Zero. In March 2018, NRG acquired XOOM Energy, a mainly residential-focused, retail energy supplier with 300,000 RCE customers. The sale price was $210 million, which includes working capital and $6 million in transaction costs. It was an all-cash transaction that was funded with $75 million from excess cash and $135 million in debt. NRG Energy stated that the acquisition would serve to balance NRG's generation portfolio in the east. In May 2019, NRG agreed to purchase Stream Energy for $300 million. The deal was finalized that August. In July 2020, NRG Energy and Centrica entered an agreement under which NRG would acquire Direct Energy for $3.625 billion in an all-cash transaction. The deal was approved in January 2021, adding more than 3 million retail customers across 50 US states and 6 Canadian provinces. In December 2022, NRG announced the acquisition of Vivint Smart Home for $2.8 billion in cash, adding home security and automation to its vast product offer, expected to close in the first quarter of 2023. In May 2025, NRG announced the acquisition of the natural gas generation facilities and a commercial and industrial virtual power plant from LS_Power at a value of approximately $12 billion. Naming rights NRG Energy holds the naming rights to the NRG Park campus (formerly Reliant Park) in Houston, Texas, home to the NRG Astrodome, NRG Stadium, NRG Arena and NRG Center. NRG Energy also holds the naming rights for a NRG Station (formerly AT&T Station), a rapid transit station in Philadelphia, Pennsylvania. Products and Services NRG Energy has multiple products and services, including generation facilities, operations, management services (O&M), retail electricity, commercial industrial backup generators, and an internal data analytics engine called SpaceTag. Operations & Management (O&M) Services In 2014, NRG Energy helped restart the Aspen Power plant, the first wood-based biomass plant in Texas. The plant is overseen by InventivEnergy LLC, but NRG operates and maintains the facility, including hiring the management team and operating staff. The plant consumes 525,000 tons of logging debris and municipal wood waste annually and can produce 50 MW of power. Aspen Power uses a stoker-type boiler that is made to reduce the air pollution from the plant. NRG Energy took over the O&M for two more Texas plants in November 2016. The two facilities, Mustang and Antelope Elk Energy Center, are owned by Golden Spread Electric Cooperative Inc. Mustang is a natural gas turbine plant in Denver City that produces 958 MW of power. Antelope Elk Energy Center is also a natural gas facility located in Abernathy that creates 744 MW of power. In 2016, NRG Energy oversaw O&M for nine other generation facilities and had 9.2 GW portfolio. By 2018, NRG Energy maintained 2.4 GW of renewable power through their O&M operations in 17 different states. They sold the renewable O&M business, along with NRG Yield and NRG's renewable energy development and operations, to Global Infrastructure Partners (GIP) for $1.375 billion in cash. Retail electricity NRG's Retail Power services provide electricity services to more than 3 million customers, mostly in Texas and the Northeast. In March 2014, NRG Energy acquired Dominion Resources Inc. and Cirro Energy, growing their retail electric customer base by 30 percent. It adds about 600,000 accounts to its existing 2 million residential and commercial customers. Dominion's retail electricity customers were mainly in Connecticut, Illinois, Massachusetts, Maryland, New York, New Jersey, Ohio, and Pennsylvania; Cirro mainly served residential and business customers in Texas. NRG Energy operates Cirro Energy under Cirro's name. In 2014, NRG Energy had two other retail electricity services, Reliant Energy and Green Mountain. By 2018, NRG Energy added Pennywise Power to its retail electricity portfolio. They picked up a number of customers from Pioneer Energy of Sugar Land and Stat Energy of Richardson, as well. In July of that year, a heat wave caused the day-ahead pricing spike to $2,172 per MW hour, compared to $28 per MW hour the previous summer. Commercial Industrial Backup Generators NRG Energy partnered with Cummins in December 2017 to offer backup generators to run as part of an asset-backed demand response system. The Cummins natural-gas-fired genset would be used when the grid is down, and it could shave 10 to 15 percent off energy bills by running it as part of an aggregated fleet of an \"estimated hundreds of megawatts capacity\". The backup generators help gas stations, supermarkets, ATMs, and other everyday life necessities during power outages from hurricanes or other natural disasters. SpaceTag In April 2017, NRG Energy publicly mentioned its in-house analytics platform SpaceTag. The analytics engine found the best combination of distributed resources for every building in a given territory and showed what it was worth to each customer. NRG tested SpaceTag to gather \"60 megawatts of flexible clean energy capacity for key parts of SCE's [Southern California Edison] Orange County and Los Angeles power grid\". The platform, developed by NRG's Station A research team in San Francisco, was originally intended to help with customer acquisition but has since evolved. SpaceTag used data about the physical attributes of a building, how it was used, and existing energy data to create an energy performance portfolio and then assessed its location in the power grid. It also used data from the distributed energy equipment, including its capital cost, associated costs of providing generation, the demand-reduction attributes over time, and the best mix of technology on the building and portfolio level. After SpaceTag is deployed, it can then monitor the operations and the performance of the building. NRG Energy mapped 24 different utility territories outside of SCE. By 2018, NRG Energy no longer owned SpaceTag as Station A became a standalone company. NRG Energy owns a minority stake in the company and is a customer of Station A. Wholesale generation After the GenOn merger in 2012, NRG had 47,000 MW of total generation capacity, enough to power approximately 40 million homes. Its nearly 100 power plants were located in 18 states in the Northeast, Chicago area, Gulf Coast, Southwest, Nevada, and California. Generation facilities include mostly fossil fuel power plants powered by natural gas, oil, and coal; plus four wind farms (in Texas) and six solar farms (in California, Arizona, and New Mexico). NRG also has a 44% ownership stake in the South Texas Nuclear Generating Station and a 37.5% stake in a coal power plant in Gladstone, Queensland, Australia. Some facilities use cogeneration and the company also owns 28 MW of solar distributed generation. NRG Energy owns the Indian River Power Plant near Millsboro, Delaware. The plant is a 784 MW facility that produces electricity from the combustion of coal. During 2018, NRG Energy sold four of their wholesale generation platforms: NRG Yield, Operations & Management (O&M) business, development business, and NRG's South Central business. Global Infrastructure Partners (GIP) bought NRG Yield, the O&M business, and the development business for $1.375 billion in cash proceeds. NRG Yield had a diverse portfolio of energy generation including wind, solar, and natural gas, with a total operating capacity of 5,100 MW. The O&M platform managed 2,400 MW of renewable energy in 17 different states, and the development business had 6,400 MW of renewable generation opportunities in the project pipeline. GIP and NRG Yield purchased the Carlsbad Energy Center natural gas project (527 MW) and the Buckthorn Solar project (154 MW) from NRG Energy. Cleco Corporate Holdings purchased NRG's South Central business for $1 billion in price and cash proceeds. The South Central business had 3,500 MW generation capacity, including the natural gas facilities Bayou Cove plant (225 MW), Sterlington plant (176 MW), and the Cottonwood plant (1,263,000 MW). NRG Energy also sold 1,891 MW of coal-fired capacity to Cleco from their Big Cajun-I and Big Cajun-II plants. In July 2018, NRG Energy released GenOn and paid $125 million in net payment during GenOn's bankruptcy settlement. In 2018, NRG Energy reduced its generation capacity to 23,000 MW. They also reduced their power plants from 100 to 40, but they retained 2.9 million retail customers. Green energy initiatives Beginning in 2009, NRG began an initiative to become a green energy producer in the United States and started investing money in clean energy projects. They include onshore and offshore wind power, solar thermal energy, photovoltaic, and distributed solar power facilities, and repowering of some of their traditional coal plants with biomass. In late 2010, NRG launched the EVgo network, the first completely private public car charging station network for electric power vehicles. In 2016, NRG sold the EVgo charging network to Vision Ridge Partners, a Colorado-based sustainable-energy investment firm, for an undisclosed amount. In December 2019, LS Power signed an agreement to acquire EVgo. In January 2021, EVgo announced its plans to go public via a SPAC merger, which was completed in July 2021 with the \"EVGO\" ticker on the Nasdaq. In March 2021, EVgo announced plans to install chargers at midwest retail chain Meijer's superstores. Green Mountain Energy, one of NRG Energy's retail subsidiaries, signed a two-year agreement beginning in January 2011 to provide 100% renewable energy for the Empire State Building. In 2012, NRG Energy partnered with the DLR Group to design an open-air, solar system for Patriot Place in Massachusetts. The solar array produces an estimated 30% of the power for Patriot Place and provides renewable energy education for visitors at kiosks, electric vehicle charging stations, and off-grid solar “Helios” at the main entrance. The solar panel canopies also offer weather protection and reduce carbon emissions by an estimated 800 metric tons a year. In 2013, NRG Energy helped the San Francisco 49ers Stadium gain LEED certification by installing three solar array-covered bridges, a solar canopy over the green roof on the suite tower, and solar panels over the 49ers training center. The solar arrays have a peak capacity of 400 kW and provide enough power during the year to offset the cost of power consumed at 49ers home games. NRG Energy provided sustainable energy for Super Bowl LI in 2017 at NRG Stadium. The stadium received power from 600 solar panels and used only LEDs to light up the field, using 60% less energy than previously. NRG Energy also agreed to provide renewable energy credits for any venue associated with the Super Bowl, such as the George R. Brown Convention Center and the hotels where the teams were staying. NRG Energy installed 11,000 solar panels and 14 wind turbines at the Eagles’ Lincoln Financial Field stadium. These renewable energy installations made the stadium the largest solar power plant in the NFL. The solar power plant produces 40% of the Eagles’ own energy and feed the energy back into the grid, which they buy back from NRG at a discounted rate. The Eagles and NRG Energy are in a multi-year corporate sponsorship agreement that helps the Eagles regulate their energy costs. New York State Assemblywoman Aravella Simotas has been chair of a coalition to support the utility in their plan to replace its power plant in Astoria with a newer generator. The company stated its intention in 2012 to replace 31 older oil generators with new gas generators that will increase the megawatts of power while reducing emissions. As of 2018, of the 19 Astoria facilities listed in the 2018 NYISO Gold Book as being owned by NRG, 7 of the facilities are on the deactivated list (at a total of 140 MW of capacity rights), and 12 of the facilities (at a total of 558 MW in nameplate capacity) have each consistently produced less than 15 GWh a year since 2011. This is equivalent to running at full capacity for less than 4% of the year. These 12 units still collect annual revenues from the NYISO's capacity market for not producing energy. For example, at 6.40 ($/kW – Month), the 12 actively listed facilities would produce an annual capacity market revenue of $42.8 million for NRG. It is unclear if the 7 deactivated units still collect capacity market revenues. In July 2017, NRG filed a request with the New York State Public Service Commission to avoid Article 10 siting procedures for a proposed turbine replacement project which would represent a total proposed capacity of 579 MW. The turbine upgrades listed in the filing are new simple-cycle turbines. The filing states that since the proposed capacity is not 25 MW greater than the existing facility, Article 10 regulation is not required. As of November 2018, no ruling has been issued by the NYSPSC. JPMorgan Chase announced their plans in 2017 to power all their facilities in Texas through 100% renewable power by 2020. By the end of 2017, 75% of JPMorgan Chase's facilities ran on wind energy provided through NRG Energy's Buckthorn wind farm in Erath County. In 2018, NRG Energy was recognized for supporting the environment in the Hudson Valley through NRG Community Solar. The community solar company builds solar farms with industrial grade solar panels that produces and delivers clean energy directly to the power grid. This allows residents who cannot purchase rooftop solar to invest in solar energy generation and receive solar credits on their utility bills. The solar farms are maintained year-round, creating local jobs in the Hudson Valley. In January 2019, NRG Community Solar became Clearway Community Solar under the parent company Clearway Energy Group."
}