{
  "ticker": "NSC",
  "cik": "0000702165",
  "company_name": "Norfolk Southern",
  "corrected_name": "Norfolk Southern",
  "wiki_title_used": "Norfolk Southern",
  "exists": true,
  "raw_text": "The Norfolk Southern Railway (reporting mark NS) is a Class I freight railroad operating in the Eastern United States. Headquartered in Atlanta, the company was formed in 1982 with the merger of the Norfolk and Western Railway and Southern Railway. The company operates 19,420 route miles (31,250 km) in 22 eastern states and the District of Columbia, and has rights in Canada over the Albany to Montreal route of the Canadian Pacific Kansas City. Norfolk Southern Railway is the leading subsidiary of the Norfolk Southern Corporation.\nNorfolk Southern maintains 28,300 miles of track, with the rest managed by other parties through trackage rights. Intermodal containers and trailers are the most common commodity type carried by NS, which have grown as the coal business has declined throughout the 21st century; coal was formerly the largest traffic source. The railway offers the largest intermodal rail network in eastern North America. NS was also the pioneer of Roadrailer service. Norfolk Southern and its chief competitor, CSX Transportation, have a duopoly on the transcontinental freight rail lines in the Eastern United States.\nNorfolk Southern is the namesake and leading subsidiary of the Norfolk Southern Corporation, based in Atlanta, Georgia; it was headquartered in Norfolk, Virginia, until 2021. Norfolk Southern Corporation was incorporated in Virginia on July 23, 1980, and is publicly traded on the New York Stock Exchange (NYSE) under the symbol NSC. The primary business function of Norfolk Southern Corporation is the rail transportation of raw materials, intermediate products, and finished goods across the Southeast, East, and Midwest United States. The corporation further facilitates transport to the remainder of the United States through interchange with other rail carriers while also serving overseas transport needs by serving several Atlantic and Gulf Coast ports. The Union Pacific Railroad has announced plans to acquire Norfolk Southern in a deal worth $85 billion. If approved by regulators, it would create the first transcontinental railroad network in the United States.\n\nHistory\nNorfolk Southern is one of the five biggest railroad operators in North America by its revenue. It operates in 22 states and in Washington, D.C. The company's market capitalization stood at nearly $58 billion in February 2024.\n\nCorporate history\nPredecessors\nNorfolk Southern's predecessor railroads date to the early 19th century.\nThe South Carolina Canal & Rail Road was the SOU's earliest predecessor line. Chartered in 1827, the South Carolina Canal & Rail Road Company became the first to offer regularly scheduled passenger train service with the inaugural run of the Best Friend of Charleston in 1830. Another early predecessor, the Richmond & Danville Railroad (R&D), was formed in 1847 and expanded into a large system after the American Civil War under Algernon S. Buford. The R&D ultimately fell on hard times, and in 1894, it became a major portion of the new Southern Railway (SOU). Financier J. P. Morgan selected veteran railroader Samuel Spencer as president. Profitable and innovative, Southern became, in 1953, the first major US railroad to completely switch to diesel-electric locomotives from steam.\nThe City Point Railroad, established in 1838, was a 9-mile (14 km) railroad in Virginia that started south of Richmond—specifically, City Point on the navigable portion of the James River, now part of the independent city of Hopewell—and ran to Petersburg. It was acquired by the South Side Railroad in 1854. After the Civil War, it became part of the Atlantic, Mississippi & Ohio Railroad (AM&O), a trunk line across Virginia's southern tier formed by mergers in 1870 by William Mahone, who had built the Norfolk & Petersburg Railroad in the 1850s. The AM&O was the oldest portion of the Norfolk & Western (N&W) when it was formed in 1881, under E. W. Clark & Co., ownership with a keen interest and financial investments in the coal fields of Western Virginia and West Virginia. In the second half of the 20th century, the N&W acquired the Virginian Railway (1959), the Wabash Railway, and the Nickel Plate Road, among others.\n\nFormation\nIn January 1979, major eastern United States railroad holding companies Chessie System and Seaboard System Railroad applied to the Interstate Commerce Commission for approval to merge and create CSX Corporation. In response, the Southern Railway (SOU, formed in 1894) and Norfolk & Western Railway (N&W, formed in 1881) quickly decided a merger of their own would be advantageous. The two companies announced their merger plans in April 1979; the CSX merger went ahead in 1980. In 1982, SOU and N&W concluded their own merger, creating Norfolk Southern Corporation. In 1990, Norfolk Southern Corporation transferred all the common stock of N&W to Southern, and Southern's name was changed to Norfolk Southern Railway Company. In 1998, Norfolk and Western was merged into Norfolk Southern Railway, forming one, united, railroad. Headquarters for the new NS were established in Norfolk, Virginia. The company suffered a slight embarrassment when the marble headpiece at the building's entrance was unveiled, which read \"Norfork Southern Railway\". A new headpiece replaced the erroneous one several weeks later.\n\nConrail purchase\nThe system grew with the acquisition of over half of Conrail. The Consolidated Rail Corporation (Conrail) was an 11,000-mile (18,000 km) system formed in 1976 from the Penn Central Railroad (1968–1976), and five other ailing northeastern railroads that were conveyed into it, forming a government-financed corporation. Conrail was perhaps the most controversial conglomerate in corporate history. Penn Central itself was created by merging three venerable rivals—the Pennsylvania Railroad (PRR, 1846), the New York Central Railroad (NYC, 1831), and the New York, New Haven & Hartford Railroad (NYNH&H, 1872)—as well as some smaller competitors. In 1980, Conrail became profitable after the Staggers Act largely deregulated the US railroad industry.\nWhen the US government offered up Conrail for sale in 1983, Norfolk Southern was one of the 18 bidders to make offers. The government decided the NS offer was the best choice, and by 1985 had begun planning to sell Conrail to NS. Extensive opposition from competitors, particularly CSX, persuaded the government that selling Conrail to one railroad would create too powerful of a company. As an alternative, Conrail leader (and former Southern Railway CEO) L. Stanley Crane proposed an initial public offering to privatize the company, which was ultimately carried out in 1987 instead of a sale to one operator.\nNS again expressed interest in a Conrail purchase in 1994, but this time Conrail publicly stated it had no interest in selling to another company. The company began to reconsider this stance after several expansion initiatives failed. After confidential discussions, Conrail and CSX made a surprise announcement in October 1996 that CSX would acquire the company. Norfolk Southern was unwilling to let a CSX purchase go through, beginning a bidding war between the two competitors that was only resolved in January 1997 when an agreement was reached to split Conrail.\nNS and CSX applied to the Surface Transportation Board (STB) for authority to purchase, divide, and operate the assets of Conrail in June 1997. On June 8, 1998, the STB approved the NS-CSX application, effective August 22, 1998. NS acquired 58% of Conrail assets, including about 7,200 miles (11,600 km) of track, most of which was part of the former Pennsylvania Railroad. CSX got the remaining 42%. NS began operating its trains on its portion of the former Conrail network on June 1, 1999, closing out the 1990s merger era.\n\nPennsylvania Lines LLC\nPennsylvania Lines LLC was a limited liability company was formed in 1998 to own Conrail lines assigned to Norfolk Southern in the split of Conrail; operations were switched over on June 1, 1999. The company is named after the old Pennsylvania Railroad, whose old main line was a line of the new company. In November, 2003, the Surface Transportation Board approved a plan allowing Norfolk Southern to fully absorb Pennsylvania Lines LLC, which was done on August 27, 2004.\n\n21st century\nIn 2016, a proposed merger that had been months in the pipeline with Canadian Pacific was abandoned abruptly.\nAccording to NS's 2022 Annual Report to Investors, at the end of 2022, NS had 19,300 employees, 3,190 locomotives, and 40,470 freight cars. At the end of 2022, the transport of coal made up 14% of the total operating revenue of NS, general merchandise (automotive, chemicals, metals, construction materials, agriculture commodities, consumer products, paper, clay, forest products, and more) made up 57%, and intermodal made up 29% of the total.\nOn December 12, 2018, Norfolk Southern announced that it would be leaving its hometown of Norfolk, Virginia after 38 years and relocating its headquarters to Atlanta, Georgia. The new Atlanta headquarters building opened on November 10, 2021.\nIn June 2023, Norfolk Southern became the first major North American railroad to offer sick time to all union workers.\nIn July 2023, Norfolk Southern announced plans to purchase the Cincinnati Southern Railway for $1.6 billion. Cincinnati voters approved the sale in the November 2023 election. Norfolk Southern will pay the city $1.6 billion and Cincinnati will establish a trust fund with the money, with earned interest going back to Cincinnati to maintain infrastructure.\nIn 2024, the company nominated a slate of new board members. In a letter to shareholders, NS asked them to vote for its slate of 13 nominees at its May shareholder meeting. The company defended its choice of board members, citing the board's work to improve long-term shareholder value, hold management accountable, and improve safety and operational performance. Among the 13 nominees, two of them are for new independent directors—Richard H. Anderson, former CEO of Amtrak and Delta Air Lines, and Heidi Heitkamp, a former US Senator. In 2023, retired Navy Admiral Philip Davidson, and Francesca DeBiase, former executive at McDonald's Corporation, were appointed to the board.\n\nProposed merger\nOn July 29, 2025, the Union Pacific Railroad announced plans to acquire Norfolk Southern in a deal worth $85 billion. If approved by regulators, it would create the first transcontinental railroad network in the United States, and would span some 50,000 miles across 43 states. However, the merger would put around two-fifths of rail freight in the hands of one company, raising concerns that it would reduce competition in a critical industry.\nUnion Pacific says more than 100 customers, Hub Group, and Nebraska's two US senators support the merger for its promised cost savings, improved service, and reduced congestion, while the Intermodal Association of North America has taken a neutral stance focused on efficiency and customer service. However, seven shipper groups, major industry associations, rail labor unions, and several US senators including Chuck Schumer, Tammy Baldwin, and Roger Marshall have opposed or criticized the merger, citing risks of higher costs, reduced service and competition, safety concerns, job losses, and excessive consolidation of rail power.\nThe proposal is under review by the Surface Transportation Board. Shareholders overwhelmingly voted to approve the merger on November 14, 2025.\n\nEnvironmental history\nIn early spring of 2008, the state program manager for air quality planning in Georgia, Jimmy Johnston, had been talking to NS about voluntary upgrades to reduce the company's environmental impact. NS is upgrading 3,800 of its locomotives with new technology that is 73 percent more efficient than previous models. The new technology being put into the locomotives makes the ride more fuel efficient and reduces idle time.\nIn 2009, the company introduced an experimental battery-electric switcher locomotive, NS 999. This prototype locomotive was developed by Norfolk Southern in collaboration with the United States Department of Energy, the Federal Railroad Administration and the Pennsylvania State University.\nNorfolk Southern reduced core greenhouse gasses by 13.5% between 2019 and 2021. For its efforts, the company achieved recognition from USA Today's America's Climate Leaders 2023 and Forbes' Net Zero Leaders 2023.\nIn November 2022, Norfolk Southern contributed $750,000 to the Georgia Tech sustainability program for the next three years.\nTo align itself with climate-change goals set by the Paris Agreement, NS aimed in 2022 to cut its Scope 1 and 2 greenhouse gas emissions by 42% by 2034. NS began efforts to lower emissions, such as modernizing more than 100 locomotives each year and equipping 93% of its active locomotive fleet, or 1,550 locomotives, with energy-management technology.\nThe company has made efforts to improve environmental sustainability, according to Progressive Railroading magazine. In 2007, the company established the rail industry's first chief sustainability officer and published its first sustainability report in 2008. In 2021, Norfolk Southern set a target to reduce greenhouse gas emissions intensity by 42% by 2034 and had already achieved a 6% reduction. The company is also upgrading 1,000 locomotives to increase fuel efficiency and incorporate biofuels and renewable energy into its operations.\n\nLabor history\nA labor dispute between Norfolk Southern Railway and railway workers began in 2019. In September 2022, the union and companies involved tentatively agreed to a deal, but it was rejected by a majority of the union's members. In late 2022, Congress intervened to prevent a strike by passing the tentative deal into law.\nNorfolk Southern was the first railroad to offer paid sick leave to all employees. In May 2023, Norfolk Southern agreed to provide up to seven paid sick days per year to employees, meeting one of the workforce demands that nearly led to a nation-wide rail strike in December 2022. On December 6, 2022, Norfolk Southern announced a new service-and-growth plan to maintain its train crew levels during downturns.\nIn 2024, an investor group led an effort to remove Alan Shaw as CEO and replaced seven directors on the company's board. Labor was divided on the issue, which led to a proxy battle ahead of an annual shareholder meeting. Unions criticized investors' plans to replace Shaw and implement an industry operating model known as Precision Scheduled Railroading, saying such a model is \"unrealistic.\" In the end, shareholders voted to keep Shaw as CEO, but voted in three new directors.\n\nNorfolk Southern Railway Police\nNorfolk Southern Railway maintains the Norfolk Southern Police Department, a private railroad police force, to enforce laws and investigate incidents involving the company's property. Based in Atlanta, it operates in 22 states with special agents to protect employees, the public, company property, and freight. Officers receive state-mandated training to maintain certification, along with annual training provided by the department. The department's Police Communications Center, also in Atlanta, coordinates responses to potential threats or incidents across the railroad's 20,000 miles of track. The department runs a program, \"Protect the Line,\" that encourages citizens and employees to report suspicious activity.\nCritics have raised concerns about conflicts of interest, as these officers are employed by the railroad and may prioritize protecting corporate interests over public safety. In 2023, an accident involving a Norfolk Southern train in Georgia severely injured Charlotte Cleary, a 14-year-old girl. This case became central to growing calls for reform and increased independent oversight of railroad policing practices.\nIn November 2024, shots were fired at Norfolk Southern Railway police officers as they investigated a burglary in Chicago. The officers were unharmed, and the suspects fled.\n\nNotable accidents\nOn September 15, 2002, a Norfolk Southern train derailed in Farragut, Tennessee. The derailment resulted in the release of oleum or fuming sulfuric acid. Roughly 2,600 residents were evacuated from nearby homes for three days until hazardous materials crews were able to mitigate the scene. No fatalities or major injuries were reported as a result of the derailment, but property damage and losses were calculated at $1.02 million. Seventeen people were injured.\n\nOn January 6, 2005, a derailment in Graniteville, South Carolina, resulted in a large amount of chlorine and diesel fuel being released into nearby waterways. In addition, a toxic cloud covered the city resulting in the town being evacuated. Local wildlife was killed, many of the local crops and vegetation were contaminated or killed, nine human deaths were reported, and thousands were injured. The company was taken to court and fined for violating the Clean Water Act and the Federal Superfund law. NS spent a total of $26 million for the cleanup.On February 3, 2023, a freight train carrying toxic chemicals derailed along NS's Fort Wayne Line in East Palestine, Ohio, United States. Emergency crews conducted a controlled burn of the spill which released hydrogen chloride and phosgene into the air. The National Transportation Safety Board found that NS mishandled its response to the derailment, and NTSB chair Jennifer Homendy accused NS of threatening the board and obstructing the investigation. Following the derailment, NS announced compensation plans for homeowners whose homes may have lost value near the 2023 derailment, and NS added more trackside detectors to help spot mechanical problems like wheel-bearing temperatures following the Ohio derailment. The US Department of Justice and the Environmental Protection Agency (EPA) reached a settlement with NS in May 2024, and East Palestine and NS reached a settlement in January 2025. NS faces additional lawsuits from local business owners. NS had successfully lobbied for the repeal of rules requiring electronically controlled pneumatic brakes on trains carrying hazardous materials, which would have reduced the severity of the incident. As of July 2025, Norfolk Southern has committed over $115 million to East Palestine, including $25 million for renovating East Palestine City Park and more than $5 million to fund the long-term protection of area drinking water.\n\nSafety\nNorfolk Southern has introduced safety programs to protect employees and local communities. In 2015, Norfolk Southern introduced the Operation Awareness & Response program, which trains around 5,000 first responders annually, equipping them with the knowledge to handle rail-related emergencies effectively. In early 2023, Norfolk Southern rolled out a safety plan which included installing approximately 200 additional hot bearing detectors across its rail network. To address the safety of transporting hazardous materials, in May 2023, Norfolk Southern enlisted the help of Atkins Nuclear Secured (ANS). NS has also been adding  Digital Train Inspection Portals to capture detailed images of passing trains.\nIn 2023, Norfolk Southern began a series of rehabilitation projects following a city inspection in Binghamton, New York. The Murray Street bridge, owned by Norfolk Southern, is the fourth repair project and began in July 2025.\nIn 2024, it joined the federal Confidential Close Call Reporting System (C3RS), which allows employees to anonymously report near-miss incidents, and it implemented a policy requiring employees to inspect each railcar in under a minute. In July 2024, Norfolk Southern agreed to implement a series of safety recommendations, including improving rail defect detection systems, modernizing nationwide tank car fleets, and getting real-time rail safety information to emergency responders.\n\nFRA safety assessment\nIn August 2023, the Federal Railroad Administration (FRA) published a report on Norfolk Southern's safety culture, which it rated at an \"involving\" level of maturity—level 3 of 5 on the Fleming Safety Culture Maturity Model. The report said that NS generally aimed to comply with legal requirements rather than make further efforts to increase safety, and that NS was slow to fix problems identified in previous safety audits. The report identified several deficiencies in the company's safety practices, particularly in training, communication, and compliance, while noting NS's work to assess and improve its safety culture.\n\nLeaders\nJohn P. Fishwick Sr.\nCEO and President of Norfolk Western Railroad: 1970–1980\nCEO and President of Norfolk Southern Railroad: 1980–1981\nRobert B. Claytor\nCEO: 1982–1987\nArnold B. McKinnon\nCEO and President: 1987–1992\nDavid R. Goode:\nCEO: 1992–2005\nPresident: 1991–2004\nCharles \"Wick\" Moorman:\nCEO: 2005–2015\nPresident: 2004–2013\nJames A. Squires:\nPresident: June 1, 2013 – December 2021\nCEO: June 1, 2015 – May 1, 2022\nAlan H. Shaw\nPresident: December 2021 – September 11, 2024\nCEO: May 1, 2022 – September 11, 2024\nMark R. George\nPresident and CEO: September 11, 2024 – present\n\n2024 executive hires\nNorfolk Southern made several key executive appointments announced in August 2024. John Orr, the chief operating officer, named Tim Livingston as senior vice president of transportation and network operations. Livingston brings Rodney Moore, vice president of transportation for the northern region, and Dewayne Swindall, vice president of transportation for the southern region. Moore has been with Norfolk Southern for 20 years, while Swindall previously served as head of the Indiana Rail Road.\nAdditionally, Anil Bhatt was appointed as executive vice president and chief information and digital officer. Bhatt, who previously served as chief information officer at Elevance Health, will focus on advancing Norfolk Southern's technological capabilities and operational efficiency. He will work with chief marketing officer Ed Elkins and chief operating officer John Orr to implement technology solutions in the areas of safety, productivity, and customer service.\n\nCurrent trackage\nRegional divisions\nOn March 15, 2016, Norfolk Southern consolidated its three operating regions into two: northern and southern regions. The northern region includes Harrisburg, Pittsburgh, Dearborn, Lake, and Illinois divisions. The southern region includes Piedmont, Alabama, Georgia, Central, and Pocahontas divisions.\nThe two merged regions will support about 1,000 daily crew starts for long-haul train operations. The consolidation was part of Norfolk Southern's five-year strategic plan to increase operating efficiencies while reducing costs.\n\nPremier Corridor\nThe Premier Corridor is Norfolk Southern's principal east–west line from the East Coast to the Midwest. An average day sees 100 trains of all types. The corridor's main (New York to Chicago) segment consists of the Lehigh Line, Reading Line, Harrisburg Line, Pittsburgh Line, Fort Wayne Line, Cleveland Line, and Chicago Line.\n\nChicago Bypass\nMeridian Speedway\nPan Am Southern/Patriot Corridor\nOn May 15, 2008, NS announced that it would join with Pan Am Railways to create the \"Patriot Corridor\", an improved rail route between Albany, New York, and the greater Boston, Massachusetts, area. On March 12, 2009, STB approved the deal. Each of the two companies now owns 50% of a new company known as Pan Am Southern (PAS). PAR's trackage between Ayer, Massachusetts, and Mechanicville, New York, was transferred to PAS and continues to be operated and maintained by PAR's Springfield Terminal Railway Company subsidiary. NS transferred to PAS cash and property valued at $140 million. The railroad operates 22K and 23K from Mechanicville, New York to Ayer, Massachusetts. Due to the unique ACSES PTC system used on Keolis-operated trackage, which the 22K and 23K runs on between Wachusett and Ayer, only specific SD60E locomotives equipped with ACSES can lead trains.\nIn 2021, CSX announced its intention to purchase Pan Am Railways. Norfolk Southern protested, arguing that CSX, which would own 50% of Pan Am Southern, would be able to block Norfolk Southern out of the northeast. As part of the Surface Transportation Board merger requirements, CSX will give NS limited trackage rights to run intermodal trains, and Pan Am Southern will be operated by the Pittsburg and Shawmut Railroad, under the name Berkshire and Eastern Railroad.\n\nYards and facilities\nNorfolk Southern operates 35,600 miles (57,300 kilometers) of track primarily in the eastern United States, covering 22 states. It maintains three major hubs in Harrisburg, Pennsylvania, Chicago, and Atlanta, along with various facilities like classification yards and intermodal yards. The company also holds trackage rights that allow it to run its trains on other railroads' tracks, extending its operations to places like Dallas, Texas, Waterville, Maine, and Miami, Florida, while also participating in locomotive leasing and sharing with other Class I railroads.\n\nGeneral freight classification yards\nIntermodal classification yards\nLocomotive shops\nNS also shares interest with CSX in the Oak Island Yard, managed by Conrail Shared Assets Operations in Newark, New Jersey.\n\nSteam excursion programs\nAfter the 1982 merger, NS President Robert Claytor retained the Southern Railway's steam excursion program begun in the 1960s by his brother, SOU president W. Graham Claytor. NS initially used former Chesapeake and Ohio 2716, which had been modified and decorated as a Southern locomotive for the steam program; however, the engine developed mechanical problems in its firebox after less than a year in excursion service and was replaced by Nickel Plate Road 765.\nMerging with the Norfolk & Western Railway prompted the steam program to acquire and overhaul Norfolk & Western 611 in 1982, and Norfolk & Western 1218 in 1987. These two locomotives and 765 joined the steam program veterans – Southern Railway 4501, Savannah and Atlanta Railway 750, Nickel Plate 587, Louisville & Nashville 152, Atlanta and West Point 290, Tennessee Valley Railroad 610, and Frisco 1522 – for an extensive series of excursions throughout the late 1980s and early 1990s. Norfolk Southern's management under David R. Goode was forced to end the program in late 1994, citing safety concerns, rising insurance costs, the expense of maintaining the steam locomotives and decreasing rail network availability due to a surge in freight traffic.\nIn June 2010, Norfolk Southern CEO Wick Moorman announced that NS would run excursions with Southern Railway 4501, Southern Railway 630, and US Army 610 with their new 21st Century Steam program.\nThe program began in 2011 with excursions in the south powered by 630 and in the north by 765. On February 22, 2013, the Virginia Museum of Transportation (611's owner) formed a campaign called \"Fire Up 611!\" to conduct a feasibility study with the goal of returning the 611 to active service and have it join the program. The locomotive was removed from her static display from the Virginia Museum of Transportation to the North Carolina Transportation Museum in 2014 to be overhauled. That same year, TVRM completed their restoration of Southern Railway 4501 – joining the 21st Century Steam program for the 2015 season and pulling excursions in Tennessee, Virginia, and Georgia. The restoration of 611 was completed in May 2015 and celebrated with a run to Roanoke, Virginia, where it was originally built. The 611 pulled several excursions in Virginia and was featured in special events at the North Carolina Transportation Museum. In December 2015, Norfolk Southern had concluded their program; however, the 611 continued to run various excursions, hosted by the Virginia Museum of Transportation and the North Carolina Transportation Museum instead of Norfolk Southern across the NS system in Virginia and North Carolina until 2018. Norfolk Southern currently limits the steam locomotives up to 40 mph (64 km/h) on their system.\n\nRolling stock\n2018 NS rolling stock\n\nReporting marks\nAlthough it has been widely known as simply \"Norfolk Southern\" since 1982, the corporate structure and reporting marks are more complicated. In 1999, when most of Conrail's former PRR trackage was sold to the Norfolk Southern Railway, the Pennsylvania Railway Lines was created and PRR reporting marks used on the former Conrail motive power and rolling stock.\n\nSee also\nHistory of railroads in Michigan\nList of Norfolk Southern predecessor railroads\nSouthern Railway Spencer Shops (now a museum in Salisbury, North Carolina)\nThoroughbred Shortline Program\n\nImprovement projects\nCrescent Corridor – Louisiana to New Jersey\nHeartland Corridor – Midwest to Norfolk\n\nReferences\nBibliography\nBorkowski, Richard (2008). Norfolk Southern Railway. MBI Railroad Color History (1st ed.). Voyageur Press. ISBN 978-0-7603-3249-8.\nPlant, Jeremy F.; Plant, Brian D. (2013). Norfolk Southern Heritage in Color (1st ed.). Morning Sun Books. ISBN 978-1582484044.\nSolomon, Brian (2005). CSX. Saint Paul, MN: MBI Publishing Co. ISBN 978-0-7603-1796-9. OCLC 57641636.\nWrinn, Jim (2000). Steam's Camelot: Southern and Norfolk Southern Excursions in Color (1st ed.). TLC Publishing. ISBN 1-883089-56-5.\nSurface Transportation Board, Docket FD_33388_0, CSX Corporation and CSX Transportation, Inc., Norfolk Southern Corporation and Norfolk Southern Railway Company—control and operating leases/agreements—Conrail Inc. and Consolidated Rail Corporation, July 23, 1998\n\nExternal links\n\nOfficial website \nNorfolk Southern system map Archived 2018-09-26 at the Wayback Machine\nBusiness data for Norfolk Southern Corporation:",
  "clean_text": "The Norfolk Southern Railway (reporting mark NS) is a Class I freight railroad operating in the Eastern United States. Headquartered in Atlanta, the company was formed in 1982 with the merger of the Norfolk and Western Railway and Southern Railway. The company operates 19,420 route miles (31,250 km) in 22 eastern states and the District of Columbia, and has rights in Canada over the Albany to Montreal route of the Canadian Pacific Kansas City. Norfolk Southern Railway is the leading subsidiary of the Norfolk Southern Corporation. Norfolk Southern maintains 28,300 miles of track, with the rest managed by other parties through trackage rights. Intermodal containers and trailers are the most common commodity type carried by NS, which have grown as the coal business has declined throughout the 21st century; coal was formerly the largest traffic source. The railway offers the largest intermodal rail network in eastern North America. NS was also the pioneer of Roadrailer service. Norfolk Southern and its chief competitor, CSX Transportation, have a duopoly on the transcontinental freight rail lines in the Eastern United States. Norfolk Southern is the namesake and leading subsidiary of the Norfolk Southern Corporation, based in Atlanta, Georgia; it was headquartered in Norfolk, Virginia, until 2021. Norfolk Southern Corporation was incorporated in Virginia on July 23, 1980, and is publicly traded on the New York Stock Exchange (NYSE) under the symbol NSC. The primary business function of Norfolk Southern Corporation is the rail transportation of raw materials, intermediate products, and finished goods across the Southeast, East, and Midwest United States. The corporation further facilitates transport to the remainder of the United States through interchange with other rail carriers while also serving overseas transport needs by serving several Atlantic and Gulf Coast ports. The Union Pacific Railroad has announced plans to acquire Norfolk Southern in a deal worth $85 billion. If approved by regulators, it would create the first transcontinental railroad network in the United States. History Norfolk Southern is one of the five biggest railroad operators in North America by its revenue. It operates in 22 states and in Washington, D.C. The company's market capitalization stood at nearly $58 billion in February 2024. Corporate history Predecessors Norfolk Southern's predecessor railroads date to the early 19th century. The South Carolina Canal & Rail Road was the SOU's earliest predecessor line. Chartered in 1827, the South Carolina Canal & Rail Road Company became the first to offer regularly scheduled passenger train service with the inaugural run of the Best Friend of Charleston in 1830. Another early predecessor, the Richmond & Danville Railroad (R&D), was formed in 1847 and expanded into a large system after the American Civil War under Algernon S. Buford. The R&D ultimately fell on hard times, and in 1894, it became a major portion of the new Southern Railway (SOU). Financier J. P. Morgan selected veteran railroader Samuel Spencer as president. Profitable and innovative, Southern became, in 1953, the first major US railroad to completely switch to diesel-electric locomotives from steam. The City Point Railroad, established in 1838, was a 9-mile (14 km) railroad in Virginia that started south of Richmond—specifically, City Point on the navigable portion of the James River, now part of the independent city of Hopewell—and ran to Petersburg. It was acquired by the South Side Railroad in 1854. After the Civil War, it became part of the Atlantic, Mississippi & Ohio Railroad (AM&O), a trunk line across Virginia's southern tier formed by mergers in 1870 by William Mahone, who had built the Norfolk & Petersburg Railroad in the 1850s. The AM&O was the oldest portion of the Norfolk & Western (N&W) when it was formed in 1881, under E. W. Clark & Co., ownership with a keen interest and financial investments in the coal fields of Western Virginia and West Virginia. In the second half of the 20th century, the N&W acquired the Virginian Railway (1959), the Wabash Railway, and the Nickel Plate Road, among others. Formation In January 1979, major eastern United States railroad holding companies Chessie System and Seaboard System Railroad applied to the Interstate Commerce Commission for approval to merge and create CSX Corporation. In response, the Southern Railway (SOU, formed in 1894) and Norfolk & Western Railway (N&W, formed in 1881) quickly decided a merger of their own would be advantageous. The two companies announced their merger plans in April 1979; the CSX merger went ahead in 1980. In 1982, SOU and N&W concluded their own merger, creating Norfolk Southern Corporation. In 1990, Norfolk Southern Corporation transferred all the common stock of N&W to Southern, and Southern's name was changed to Norfolk Southern Railway Company. In 1998, Norfolk and Western was merged into Norfolk Southern Railway, forming one, united, railroad. Headquarters for the new NS were established in Norfolk, Virginia. The company suffered a slight embarrassment when the marble headpiece at the building's entrance was unveiled, which read \"Norfork Southern Railway\". A new headpiece replaced the erroneous one several weeks later. Conrail purchase The system grew with the acquisition of over half of Conrail. The Consolidated Rail Corporation (Conrail) was an 11,000-mile (18,000 km) system formed in 1976 from the Penn Central Railroad (1968–1976), and five other ailing northeastern railroads that were conveyed into it, forming a government-financed corporation. Conrail was perhaps the most controversial conglomerate in corporate history. Penn Central itself was created by merging three venerable rivals—the Pennsylvania Railroad (PRR, 1846), the New York Central Railroad (NYC, 1831), and the New York, New Haven & Hartford Railroad (NYNH&H, 1872)—as well as some smaller competitors. In 1980, Conrail became profitable after the Staggers Act largely deregulated the US railroad industry. When the US government offered up Conrail for sale in 1983, Norfolk Southern was one of the 18 bidders to make offers. The government decided the NS offer was the best choice, and by 1985 had begun planning to sell Conrail to NS. Extensive opposition from competitors, particularly CSX, persuaded the government that selling Conrail to one railroad would create too powerful of a company. As an alternative, Conrail leader (and former Southern Railway CEO) L. Stanley Crane proposed an initial public offering to privatize the company, which was ultimately carried out in 1987 instead of a sale to one operator. NS again expressed interest in a Conrail purchase in 1994, but this time Conrail publicly stated it had no interest in selling to another company. The company began to reconsider this stance after several expansion initiatives failed. After confidential discussions, Conrail and CSX made a surprise announcement in October 1996 that CSX would acquire the company. Norfolk Southern was unwilling to let a CSX purchase go through, beginning a bidding war between the two competitors that was only resolved in January 1997 when an agreement was reached to split Conrail. NS and CSX applied to the Surface Transportation Board (STB) for authority to purchase, divide, and operate the assets of Conrail in June 1997. On June 8, 1998, the STB approved the NS-CSX application, effective August 22, 1998. NS acquired 58% of Conrail assets, including about 7,200 miles (11,600 km) of track, most of which was part of the former Pennsylvania Railroad. CSX got the remaining 42%. NS began operating its trains on its portion of the former Conrail network on June 1, 1999, closing out the 1990s merger era. Pennsylvania Lines LLC Pennsylvania Lines LLC was a limited liability company was formed in 1998 to own Conrail lines assigned to Norfolk Southern in the split of Conrail; operations were switched over on June 1, 1999. The company is named after the old Pennsylvania Railroad, whose old main line was a line of the new company. In November, 2003, the Surface Transportation Board approved a plan allowing Norfolk Southern to fully absorb Pennsylvania Lines LLC, which was done on August 27, 2004. 21st century In 2016, a proposed merger that had been months in the pipeline with Canadian Pacific was abandoned abruptly. According to NS's 2022 Annual Report to Investors, at the end of 2022, NS had 19,300 employees, 3,190 locomotives, and 40,470 freight cars. At the end of 2022, the transport of coal made up 14% of the total operating revenue of NS, general merchandise (automotive, chemicals, metals, construction materials, agriculture commodities, consumer products, paper, clay, forest products, and more) made up 57%, and intermodal made up 29% of the total. On December 12, 2018, Norfolk Southern announced that it would be leaving its hometown of Norfolk, Virginia after 38 years and relocating its headquarters to Atlanta, Georgia. The new Atlanta headquarters building opened on November 10, 2021. In June 2023, Norfolk Southern became the first major North American railroad to offer sick time to all union workers. In July 2023, Norfolk Southern announced plans to purchase the Cincinnati Southern Railway for $1.6 billion. Cincinnati voters approved the sale in the November 2023 election. Norfolk Southern will pay the city $1.6 billion and Cincinnati will establish a trust fund with the money, with earned interest going back to Cincinnati to maintain infrastructure. In 2024, the company nominated a slate of new board members. In a letter to shareholders, NS asked them to vote for its slate of 13 nominees at its May shareholder meeting. The company defended its choice of board members, citing the board's work to improve long-term shareholder value, hold management accountable, and improve safety and operational performance. Among the 13 nominees, two of them are for new independent directors—Richard H. Anderson, former CEO of Amtrak and Delta Air Lines, and Heidi Heitkamp, a former US Senator. In 2023, retired Navy Admiral Philip Davidson, and Francesca DeBiase, former executive at McDonald's Corporation, were appointed to the board. Proposed merger On July 29, 2025, the Union Pacific Railroad announced plans to acquire Norfolk Southern in a deal worth $85 billion. If approved by regulators, it would create the first transcontinental railroad network in the United States, and would span some 50,000 miles across 43 states. However, the merger would put around two-fifths of rail freight in the hands of one company, raising concerns that it would reduce competition in a critical industry. Union Pacific says more than 100 customers, Hub Group, and Nebraska's two US senators support the merger for its promised cost savings, improved service, and reduced congestion, while the Intermodal Association of North America has taken a neutral stance focused on efficiency and customer service. However, seven shipper groups, major industry associations, rail labor unions, and several US senators including Chuck Schumer, Tammy Baldwin, and Roger Marshall have opposed or criticized the merger, citing risks of higher costs, reduced service and competition, safety concerns, job losses, and excessive consolidation of rail power. The proposal is under review by the Surface Transportation Board. Shareholders overwhelmingly voted to approve the merger on November 14, 2025. Environmental history In early spring of 2008, the state program manager for air quality planning in Georgia, Jimmy Johnston, had been talking to NS about voluntary upgrades to reduce the company's environmental impact. NS is upgrading 3,800 of its locomotives with new technology that is 73 percent more efficient than previous models. The new technology being put into the locomotives makes the ride more fuel efficient and reduces idle time. In 2009, the company introduced an experimental battery-electric switcher locomotive, NS 999. This prototype locomotive was developed by Norfolk Southern in collaboration with the United States Department of Energy, the Federal Railroad Administration and the Pennsylvania State University. Norfolk Southern reduced core greenhouse gasses by 13.5% between 2019 and 2021. For its efforts, the company achieved recognition from USA Today's America's Climate Leaders 2023 and Forbes' Net Zero Leaders 2023. In November 2022, Norfolk Southern contributed $750,000 to the Georgia Tech sustainability program for the next three years. To align itself with climate-change goals set by the Paris Agreement, NS aimed in 2022 to cut its Scope 1 and 2 greenhouse gas emissions by 42% by 2034. NS began efforts to lower emissions, such as modernizing more than 100 locomotives each year and equipping 93% of its active locomotive fleet, or 1,550 locomotives, with energy-management technology. The company has made efforts to improve environmental sustainability, according to Progressive Railroading magazine. In 2007, the company established the rail industry's first chief sustainability officer and published its first sustainability report in 2008. In 2021, Norfolk Southern set a target to reduce greenhouse gas emissions intensity by 42% by 2034 and had already achieved a 6% reduction. The company is also upgrading 1,000 locomotives to increase fuel efficiency and incorporate biofuels and renewable energy into its operations. Labor history A labor dispute between Norfolk Southern Railway and railway workers began in 2019. In September 2022, the union and companies involved tentatively agreed to a deal, but it was rejected by a majority of the union's members. In late 2022, Congress intervened to prevent a strike by passing the tentative deal into law. Norfolk Southern was the first railroad to offer paid sick leave to all employees. In May 2023, Norfolk Southern agreed to provide up to seven paid sick days per year to employees, meeting one of the workforce demands that nearly led to a nation-wide rail strike in December 2022. On December 6, 2022, Norfolk Southern announced a new service-and-growth plan to maintain its train crew levels during downturns. In 2024, an investor group led an effort to remove Alan Shaw as CEO and replaced seven directors on the company's board. Labor was divided on the issue, which led to a proxy battle ahead of an annual shareholder meeting. Unions criticized investors' plans to replace Shaw and implement an industry operating model known as Precision Scheduled Railroading, saying such a model is \"unrealistic.\" In the end, shareholders voted to keep Shaw as CEO, but voted in three new directors. Norfolk Southern Railway Police Norfolk Southern Railway maintains the Norfolk Southern Police Department, a private railroad police force, to enforce laws and investigate incidents involving the company's property. Based in Atlanta, it operates in 22 states with special agents to protect employees, the public, company property, and freight. Officers receive state-mandated training to maintain certification, along with annual training provided by the department. The department's Police Communications Center, also in Atlanta, coordinates responses to potential threats or incidents across the railroad's 20,000 miles of track. The department runs a program, \"Protect the Line,\" that encourages citizens and employees to report suspicious activity. Critics have raised concerns about conflicts of interest, as these officers are employed by the railroad and may prioritize protecting corporate interests over public safety. In 2023, an accident involving a Norfolk Southern train in Georgia severely injured Charlotte Cleary, a 14-year-old girl. This case became central to growing calls for reform and increased independent oversight of railroad policing practices. In November 2024, shots were fired at Norfolk Southern Railway police officers as they investigated a burglary in Chicago. The officers were unharmed, and the suspects fled. Notable accidents On September 15, 2002, a Norfolk Southern train derailed in Farragut, Tennessee. The derailment resulted in the release of oleum or fuming sulfuric acid. Roughly 2,600 residents were evacuated from nearby homes for three days until hazardous materials crews were able to mitigate the scene. No fatalities or major injuries were reported as a result of the derailment, but property damage and losses were calculated at $1.02 million. Seventeen people were injured. On January 6, 2005, a derailment in Graniteville, South Carolina, resulted in a large amount of chlorine and diesel fuel being released into nearby waterways. In addition, a toxic cloud covered the city resulting in the town being evacuated. Local wildlife was killed, many of the local crops and vegetation were contaminated or killed, nine human deaths were reported, and thousands were injured. The company was taken to court and fined for violating the Clean Water Act and the Federal Superfund law. NS spent a total of $26 million for the cleanup.On February 3, 2023, a freight train carrying toxic chemicals derailed along NS's Fort Wayne Line in East Palestine, Ohio, United States. Emergency crews conducted a controlled burn of the spill which released hydrogen chloride and phosgene into the air. The National Transportation Safety Board found that NS mishandled its response to the derailment, and NTSB chair Jennifer Homendy accused NS of threatening the board and obstructing the investigation. Following the derailment, NS announced compensation plans for homeowners whose homes may have lost value near the 2023 derailment, and NS added more trackside detectors to help spot mechanical problems like wheel-bearing temperatures following the Ohio derailment. The US Department of Justice and the Environmental Protection Agency (EPA) reached a settlement with NS in May 2024, and East Palestine and NS reached a settlement in January 2025. NS faces additional lawsuits from local business owners. NS had successfully lobbied for the repeal of rules requiring electronically controlled pneumatic brakes on trains carrying hazardous materials, which would have reduced the severity of the incident. As of July 2025, Norfolk Southern has committed over $115 million to East Palestine, including $25 million for renovating East Palestine City Park and more than $5 million to fund the long-term protection of area drinking water. Safety Norfolk Southern has introduced safety programs to protect employees and local communities. In 2015, Norfolk Southern introduced the Operation Awareness & Response program, which trains around 5,000 first responders annually, equipping them with the knowledge to handle rail-related emergencies effectively. In early 2023, Norfolk Southern rolled out a safety plan which included installing approximately 200 additional hot bearing detectors across its rail network. To address the safety of transporting hazardous materials, in May 2023, Norfolk Southern enlisted the help of Atkins Nuclear Secured (ANS). NS has also been adding Digital Train Inspection Portals to capture detailed images of passing trains. In 2023, Norfolk Southern began a series of rehabilitation projects following a city inspection in Binghamton, New York. The Murray Street bridge, owned by Norfolk Southern, is the fourth repair project and began in July 2025. In 2024, it joined the federal Confidential Close Call Reporting System (C3RS), which allows employees to anonymously report near-miss incidents, and it implemented a policy requiring employees to inspect each railcar in under a minute. In July 2024, Norfolk Southern agreed to implement a series of safety recommendations, including improving rail defect detection systems, modernizing nationwide tank car fleets, and getting real-time rail safety information to emergency responders. FRA safety assessment In August 2023, the Federal Railroad Administration (FRA) published a report on Norfolk Southern's safety culture, which it rated at an \"involving\" level of maturity—level 3 of 5 on the Fleming Safety Culture Maturity Model. The report said that NS generally aimed to comply with legal requirements rather than make further efforts to increase safety, and that NS was slow to fix problems identified in previous safety audits. The report identified several deficiencies in the company's safety practices, particularly in training, communication, and compliance, while noting NS's work to assess and improve its safety culture. Leaders John P. Fishwick Sr. CEO and President of Norfolk Western Railroad: 1970–1980 CEO and President of Norfolk Southern Railroad: 1980–1981 Robert B. Claytor CEO: 1982–1987 Arnold B. McKinnon CEO and President: 1987–1992 David R. Goode: CEO: 1992–2005 President: 1991–2004 Charles \"Wick\" Moorman: CEO: 2005–2015 President: 2004–2013 James A. Squires: President: June 1, 2013 – December 2021 CEO: June 1, 2015 – May 1, 2022 Alan H. Shaw President: December 2021 – September 11, 2024 CEO: May 1, 2022 – September 11, 2024 Mark R. George President and CEO: September 11, 2024 – present 2024 executive hires Norfolk Southern made several key executive appointments announced in August 2024. John Orr, the chief operating officer, named Tim Livingston as senior vice president of transportation and network operations. Livingston brings Rodney Moore, vice president of transportation for the northern region, and Dewayne Swindall, vice president of transportation for the southern region. Moore has been with Norfolk Southern for 20 years, while Swindall previously served as head of the Indiana Rail Road. Additionally, Anil Bhatt was appointed as executive vice president and chief information and digital officer. Bhatt, who previously served as chief information officer at Elevance Health, will focus on advancing Norfolk Southern's technological capabilities and operational efficiency. He will work with chief marketing officer Ed Elkins and chief operating officer John Orr to implement technology solutions in the areas of safety, productivity, and customer service. Current trackage Regional divisions On March 15, 2016, Norfolk Southern consolidated its three operating regions into two: northern and southern regions. The northern region includes Harrisburg, Pittsburgh, Dearborn, Lake, and Illinois divisions. The southern region includes Piedmont, Alabama, Georgia, Central, and Pocahontas divisions. The two merged regions will support about 1,000 daily crew starts for long-haul train operations. The consolidation was part of Norfolk Southern's five-year strategic plan to increase operating efficiencies while reducing costs. Premier Corridor The Premier Corridor is Norfolk Southern's principal east–west line from the East Coast to the Midwest. An average day sees 100 trains of all types. The corridor's main (New York to Chicago) segment consists of the Lehigh Line, Reading Line, Harrisburg Line, Pittsburgh Line, Fort Wayne Line, Cleveland Line, and Chicago Line. Chicago Bypass Meridian Speedway Pan Am Southern/Patriot Corridor On May 15, 2008, NS announced that it would join with Pan Am Railways to create the \"Patriot Corridor\", an improved rail route between Albany, New York, and the greater Boston, Massachusetts, area. On March 12, 2009, STB approved the deal. Each of the two companies now owns 50% of a new company known as Pan Am Southern (PAS). PAR's trackage between Ayer, Massachusetts, and Mechanicville, New York, was transferred to PAS and continues to be operated and maintained by PAR's Springfield Terminal Railway Company subsidiary. NS transferred to PAS cash and property valued at $140 million. The railroad operates 22K and 23K from Mechanicville, New York to Ayer, Massachusetts. Due to the unique ACSES PTC system used on Keolis-operated trackage, which the 22K and 23K runs on between Wachusett and Ayer, only specific SD60E locomotives equipped with ACSES can lead trains. In 2021, CSX announced its intention to purchase Pan Am Railways. Norfolk Southern protested, arguing that CSX, which would own 50% of Pan Am Southern, would be able to block Norfolk Southern out of the northeast. As part of the Surface Transportation Board merger requirements, CSX will give NS limited trackage rights to run intermodal trains, and Pan Am Southern will be operated by the Pittsburg and Shawmut Railroad, under the name Berkshire and Eastern Railroad. Yards and facilities Norfolk Southern operates 35,600 miles (57,300 kilometers) of track primarily in the eastern United States, covering 22 states. It maintains three major hubs in Harrisburg, Pennsylvania, Chicago, and Atlanta, along with various facilities like classification yards and intermodal yards. The company also holds trackage rights that allow it to run its trains on other railroads' tracks, extending its operations to places like Dallas, Texas, Waterville, Maine, and Miami, Florida, while also participating in locomotive leasing and sharing with other Class I railroads. General freight classification yards Intermodal classification yards Locomotive shops NS also shares interest with CSX in the Oak Island Yard, managed by Conrail Shared Assets Operations in Newark, New Jersey. Steam excursion programs After the 1982 merger, NS President Robert Claytor retained the Southern Railway's steam excursion program begun in the 1960s by his brother, SOU president W. Graham Claytor. NS initially used former Chesapeake and Ohio 2716, which had been modified and decorated as a Southern locomotive for the steam program; however, the engine developed mechanical problems in its firebox after less than a year in excursion service and was replaced by Nickel Plate Road 765. Merging with the Norfolk & Western Railway prompted the steam program to acquire and overhaul Norfolk & Western 611 in 1982, and Norfolk & Western 1218 in 1987. These two locomotives and 765 joined the steam program veterans – Southern Railway 4501, Savannah and Atlanta Railway 750, Nickel Plate 587, Louisville & Nashville 152, Atlanta and West Point 290, Tennessee Valley Railroad 610, and Frisco 1522 – for an extensive series of excursions throughout the late 1980s and early 1990s. Norfolk Southern's management under David R. Goode was forced to end the program in late 1994, citing safety concerns, rising insurance costs, the expense of maintaining the steam locomotives and decreasing rail network availability due to a surge in freight traffic. In June 2010, Norfolk Southern CEO Wick Moorman announced that NS would run excursions with Southern Railway 4501, Southern Railway 630, and US Army 610 with their new 21st Century Steam program. The program began in 2011 with excursions in the south powered by 630 and in the north by 765. On February 22, 2013, the Virginia Museum of Transportation (611's owner) formed a campaign called \"Fire Up 611!\" to conduct a feasibility study with the goal of returning the 611 to active service and have it join the program. The locomotive was removed from her static display from the Virginia Museum of Transportation to the North Carolina Transportation Museum in 2014 to be overhauled. That same year, TVRM completed their restoration of Southern Railway 4501 – joining the 21st Century Steam program for the 2015 season and pulling excursions in Tennessee, Virginia, and Georgia. The restoration of 611 was completed in May 2015 and celebrated with a run to Roanoke, Virginia, where it was originally built. The 611 pulled several excursions in Virginia and was featured in special events at the North Carolina Transportation Museum. In December 2015, Norfolk Southern had concluded their program; however, the 611 continued to run various excursions, hosted by the Virginia Museum of Transportation and the North Carolina Transportation Museum instead of Norfolk Southern across the NS system in Virginia and North Carolina until 2018. Norfolk Southern currently limits the steam locomotives up to 40 mph (64 km/h) on their system. Rolling stock 2018 NS rolling stock Reporting marks Although it has been widely known as simply \"Norfolk Southern\" since 1982, the corporate structure and reporting marks are more complicated. In 1999, when most of Conrail's former PRR trackage was sold to the Norfolk Southern Railway, the Pennsylvania Railway Lines was created and PRR reporting marks used on the former Conrail motive power and rolling stock."
}