{
  "ticker": "NTRS",
  "cik": "0000073124",
  "company_name": "Northern Trust",
  "corrected_name": "Northern Trust",
  "wiki_title_used": "Northern Trust",
  "exists": true,
  "raw_text": "Northern Trust Corporation is an American financial services company headquartered in Chicago, Illinois, that caters to corporations, institutional investors, and ultra high net worth individuals. Northern Trust is one of the largest banking institutions in the United States and one of the oldest banks in continuous operation. As of June 30, 2022, it had $1.7 trillion in assets under management and $17 trillion in assets under custody. Northern Trust Corporation is incorporated in Delaware.\nThe company has offices in 20 US states and locations across 23 countries in Canada, Europe, the Middle East, and the Asia-Pacific region. It is ranked 486th on the Fortune 1000 as of February 2019.\n\nCurrent operations\nAsset servicing\nAsset Servicing is a global provider of custodian bank, fund administration, investment operations outsourcing, investment management, investment risk and analytical services, employee benefits services, securities lending, foreign exchange market, treasury management, brokerage firm services, transition management services, banking, and cash management services to corporate and public pension funds, foundations, financial endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors. At the end of May 2020, Northern Trust Corporation entered into a strategic alliance with BlackRock. This alliance entails working with BlackRock on its platform called Aladdin with mutual clients.\n\nWealth management\nOver 20% of the wealthiest families in the United States are clients of the company's wealth management division. It provides personal trust, investment management, custodian bank, and philanthropic services, financial consulting, guardianship and estate administration, qualified retirement plans and private and business banking. Wealth Management focuses on high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately held businesses in its target markets with assets typically exceeding $75 million. Wealth management services are delivered through a network of 85 offices in 18 U.S. states as well as offices in London, Guernsey, and Abu Dhabi.\n\nNorthern Trust Asset Management (NTAM)\nNorthern Trust Asset Management provides investment management services. It offers both active management and passive management strategies for equity and fixed income investing, as well as alternative asset classes such as private equity and hedge funds and multi-manager products and services.\n\nHistory\nNorthern Trust was founded in 1889 by Byron Laflin Smith in a one-room office in the Rookery Building in The Loop, Chicago, with a focus on providing trust and banking services for the city's prosperous citizens. It opened on August 12, 1889, with 7 accounts and $137,981.25 in deposits. Smith provided 40% of the bank's original capitalization of $1 million, and the original 27 shareholders included Marshall Field, Martin A. Ryerson, and Philip D. Armour.\nThe company's headquarters building at 50 South LaSalle Street in the Financial District of Chicago dates from 1905 and was designed by Frost and Granger.  The structure opened with five stories, but is designed to accommodate additional floors.  However, when the bank needed additional space in 1965, it opted to construct a new 14-story building in the international style to the west and selected Cesar Pelli as its architect.\nIn March 1914, Byron Laflin Smith died and his son, Solomon Albert Smith, took over the bank.\nThe company's conservative policies served it well during the 1920s and the company's assets actually grew during the Great Depression, while many other banks suffered from bank failure.\nBy 1941, nearly half of all the bank's commercial accounts were drawn from outside the Chicago metropolitan area. During World War II, the company took part in the government's war bond drives and provided loans for manufacturing war materials under special government programs. The war created more opportunities for the bank; all sectors of its business expanded.\nDuring the 1950s, Northern Trust spent heavily to develop automated banking services, including the first fully automated financial statements for trust clients.\nIn 1963, Solomon A. Smith died. Solomon Byron Smith became chairman of the executive committee and his brother, Edward Byron Smith, became chairman.\nIn 1986, the bank acquired First Lake Forest Corporation for $61 million in cash.\nEdward Byron Smith retired as chief executive officer in 1979. He was succeeded by E. Norman \"Bud\" Staub. A few years later, Philip W. K. Sweet took over but he resigned in 1984.\nIn 1984, Weston Christopherson, former CEO of Jewel, took the helm. He is credited with guiding the bank through a difficult period when sour loans to Latin American countries were hurting profits. When oil prices dropped suddenly in the early 1980s, many South American nations realized they could not repay their enormous bank loans. The bank suffered uncharacteristically high losses. Aggressive management, loan reserves, and write-offs enabled the bank to restore its asset quality. During Christopherson's six years at Northern Trust, profits rose from $34 million to $113 million. At the time of his retirement in 1990, the company was the 11th most profitable of the 100 largest banks in the United States.\nIn 1990, company veteran David W. Fox became the seventh CEO of the company.\nWilliam A. Osborn was named president and chief operating officer in 1993 and became chairman and chief executive officer, in addition to president, in 1995.\nIn 2005, Northern Trust and Enron reached a $365 million settlement with 20,000 employees of Enron after the energy company's collapse (see Enron scandal). Northern Trust had managed the 401k plan for Enron's employeees, who alleged mismanagement and breach of fiduciary duty. The initial settlement was reduced a year later to $32.5 million in an agreement approved by federal judge Melinda Harmon, with Northern Trust neither admitting nor denying wrongdoing.\nOsborn stepped down as president in 2006 and as CEO on January 1, 2008. Frederick H. \"Rick\" Waddell then became chairman and CEO.\nDuring his tenure, Waddell was able to guide the bank through the 2008 financial crisis. In 2009 Northern Trust was one of 3 banks able to gain large profits. Other than M&T Bank, Northern Trust was the only bank in the S&P 500 Index not to lower its dividend during the 2008 financial crisis.\nIn November 2008, the United States Department of the Treasury invested $1.5 billion in the company as part of the Troubled Asset Relief Program and in June 2009, the company repurchased the investment from the Treasury. The company had been criticized for heavy spending on parties during a 2009 golf tournament that it sponsored, after receiving government funds.\nThe company strives to give approximately 1.5% of its pre-tax profits to charities every year. In the 10 years preceding 2014, the company gave over $120 million in support of non-profit organizations.\nIn 2017, Northern Trust acquired UBS Asset Management's fund administration servicing units in Switzerland and Luxembourg.\nIn 2018, Michael O'Grady became chief executive officer of the company. He also assumed the chairmanship on January 23, 2019.\n\nReferences\nExternal links\nBusiness data for Northern Trust:",
  "clean_text": "Northern Trust Corporation is an American financial services company headquartered in Chicago, Illinois, that caters to corporations, institutional investors, and ultra high net worth individuals. Northern Trust is one of the largest banking institutions in the United States and one of the oldest banks in continuous operation. As of June 30, 2022, it had $1.7 trillion in assets under management and $17 trillion in assets under custody. Northern Trust Corporation is incorporated in Delaware. The company has offices in 20 US states and locations across 23 countries in Canada, Europe, the Middle East, and the Asia-Pacific region. It is ranked 486th on the Fortune 1000 as of February 2019. Current operations Asset servicing Asset Servicing is a global provider of custodian bank, fund administration, investment operations outsourcing, investment management, investment risk and analytical services, employee benefits services, securities lending, foreign exchange market, treasury management, brokerage firm services, transition management services, banking, and cash management services to corporate and public pension funds, foundations, financial endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors. At the end of May 2020, Northern Trust Corporation entered into a strategic alliance with BlackRock. This alliance entails working with BlackRock on its platform called Aladdin with mutual clients. Wealth management Over 20% of the wealthiest families in the United States are clients of the company's wealth management division. It provides personal trust, investment management, custodian bank, and philanthropic services, financial consulting, guardianship and estate administration, qualified retirement plans and private and business banking. Wealth Management focuses on high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately held businesses in its target markets with assets typically exceeding $75 million. Wealth management services are delivered through a network of 85 offices in 18 U.S. states as well as offices in London, Guernsey, and Abu Dhabi. Northern Trust Asset Management (NTAM) Northern Trust Asset Management provides investment management services. It offers both active management and passive management strategies for equity and fixed income investing, as well as alternative asset classes such as private equity and hedge funds and multi-manager products and services. History Northern Trust was founded in 1889 by Byron Laflin Smith in a one-room office in the Rookery Building in The Loop, Chicago, with a focus on providing trust and banking services for the city's prosperous citizens. It opened on August 12, 1889, with 7 accounts and $137,981.25 in deposits. Smith provided 40% of the bank's original capitalization of $1 million, and the original 27 shareholders included Marshall Field, Martin A. Ryerson, and Philip D. Armour. The company's headquarters building at 50 South LaSalle Street in the Financial District of Chicago dates from 1905 and was designed by Frost and Granger. The structure opened with five stories, but is designed to accommodate additional floors. However, when the bank needed additional space in 1965, it opted to construct a new 14-story building in the international style to the west and selected Cesar Pelli as its architect. In March 1914, Byron Laflin Smith died and his son, Solomon Albert Smith, took over the bank. The company's conservative policies served it well during the 1920s and the company's assets actually grew during the Great Depression, while many other banks suffered from bank failure. By 1941, nearly half of all the bank's commercial accounts were drawn from outside the Chicago metropolitan area. During World War II, the company took part in the government's war bond drives and provided loans for manufacturing war materials under special government programs. The war created more opportunities for the bank; all sectors of its business expanded. During the 1950s, Northern Trust spent heavily to develop automated banking services, including the first fully automated financial statements for trust clients. In 1963, Solomon A. Smith died. Solomon Byron Smith became chairman of the executive committee and his brother, Edward Byron Smith, became chairman. In 1986, the bank acquired First Lake Forest Corporation for $61 million in cash. Edward Byron Smith retired as chief executive officer in 1979. He was succeeded by E. Norman \"Bud\" Staub. A few years later, Philip W. K. Sweet took over but he resigned in 1984. In 1984, Weston Christopherson, former CEO of Jewel, took the helm. He is credited with guiding the bank through a difficult period when sour loans to Latin American countries were hurting profits. When oil prices dropped suddenly in the early 1980s, many South American nations realized they could not repay their enormous bank loans. The bank suffered uncharacteristically high losses. Aggressive management, loan reserves, and write-offs enabled the bank to restore its asset quality. During Christopherson's six years at Northern Trust, profits rose from $34 million to $113 million. At the time of his retirement in 1990, the company was the 11th most profitable of the 100 largest banks in the United States. In 1990, company veteran David W. Fox became the seventh CEO of the company. William A. Osborn was named president and chief operating officer in 1993 and became chairman and chief executive officer, in addition to president, in 1995. In 2005, Northern Trust and Enron reached a $365 million settlement with 20,000 employees of Enron after the energy company's collapse (see Enron scandal). Northern Trust had managed the 401k plan for Enron's employeees, who alleged mismanagement and breach of fiduciary duty. The initial settlement was reduced a year later to $32.5 million in an agreement approved by federal judge Melinda Harmon, with Northern Trust neither admitting nor denying wrongdoing. Osborn stepped down as president in 2006 and as CEO on January 1, 2008. Frederick H. \"Rick\" Waddell then became chairman and CEO. During his tenure, Waddell was able to guide the bank through the 2008 financial crisis. In 2009 Northern Trust was one of 3 banks able to gain large profits. Other than M&T Bank, Northern Trust was the only bank in the S&P 500 Index not to lower its dividend during the 2008 financial crisis. In November 2008, the United States Department of the Treasury invested $1.5 billion in the company as part of the Troubled Asset Relief Program and in June 2009, the company repurchased the investment from the Treasury. The company had been criticized for heavy spending on parties during a 2009 golf tournament that it sponsored, after receiving government funds. The company strives to give approximately 1.5% of its pre-tax profits to charities every year. In the 10 years preceding 2014, the company gave over $120 million in support of non-profit organizations. In 2017, Northern Trust acquired UBS Asset Management's fund administration servicing units in Switzerland and Luxembourg. In 2018, Michael O'Grady became chief executive officer of the company. He also assumed the chairmanship on January 23, 2019."
}