{
  "ticker": "NUE",
  "cik": "0000073309",
  "company_name": "Nucor",
  "corrected_name": "Nucor",
  "wiki_title_used": "Nucor",
  "exists": true,
  "raw_text": "Nucor Corporation is an American company based in Charlotte, North Carolina, that produces steel and related products. It is the largest steel producer in the United States and the largest recycler of scrap in North America.  Nucor is the 16th-largest steel producer in the world. Along with Commercial Metals Company, it is one of two primary suppliers of rebar used to reinforce concrete in buildings, bridges, roads, and infrastructure in the U.S.\n\nCurrent operations\nTo supply its mills, Nucor uses electric arc furnaces and continuous casting to melt scrap steel as opposed to blast furnaces to melt iron. In 2024, the company produced and sold approximately 18.5 million tons of steel and recycled 18 million tons of scrap.\nNone of Nucor's mills are unionized and the corporate culture is opposed to trade unions.\n\nHistory\nAfter REO Motor Car Company, founded by Ransom E. Olds, sold its operations and initiated liquidation proceedings, a group of dissident activist shareholders, noticing the existence of a usable tax loss, successfully challenged the liquidation in a proxy fight in September 1955 and forced REO to take over a tiny nuclear services company called Nuclear Consultants, Inc. in a reverse takeover. \nThe company was renamed \"Nuclear Corporation of America Inc.\" and relocated to offices in the Empire State Building in New York City. The organization's attempt to recast itself as a nuclear industry services company was unsuccessful, and it followed the example of other companies in the 1950s and 60s by attempting to become a conglomerate, moving its headquarters to Phoenix, Arizona. It made several acquisitions, including the Vulcraft Corporation, a steel joist manufacturer located in Florence, South Carolina. Vulcraft was founded by Sanborn Chase, who died at an early age, leaving the company to his widow. Nuclear purchased Vulcraft from Chase's widow in 1962 and hired F. Kenneth Iverson as general manager. In March 1965, the company again filed for bankruptcy. Iverson, head of the only profitable division, took over as head of the company due to lack of interest in the job from others.\nIverson reorganized Nucor around its only profitable business, the steel fabricator Vulcraft. All other businesses were either sold or liquidated.\nIn 1966, the company moved its headquarters to Charlotte, North Carolina to be closer to its main Vulcraft plant in South Carolina.\nIn 1968, unable to get favorable steel prices from American manufacturers and unhappy with the imported steel available at the time, Iverson, a metallurgist by training, extended Nucor vertically into steelmaking by building its first steel bar mill in Darlington, South Carolina.\nThe company purchased an electric arc furnace, which was far cheaper than the traditional steel blast furnace, with a $6 million loan secured by all of the company's assets. Production delays and staffing problems resulted in losses, but earnings soared in 1971 and 1972.\nIn 1972, the company, recognizing that it was now misnamed, adopted its current title, Nucor Corporation. That year, it became a public company via an initial public offering.\nIn 1988, the company opened its building products division.\nIn 1989, Nucor opened a facility in Crawfordsville, Indiana, the first mini mill in the world to produce flat rolled steel using thin-slab technology.\nIn March 2000, a joint venture, owned 47.5% by Nucor, 47.5% by BlueScope, and 5% by IHI Corporation was formed to license Castrip technology. This technology allowed for continuous casting of sheet steel directly from molten steel without the need for heavy, expensive, and energy-consuming rollers.\n\nAcquisitions and divestitures\nClosures and new investments\nList of CEOs\nF. Kenneth Iverson (1965–1996)\nJohn Correnti (1996–1999)\nH. David Aycock (1999–2000)\nDan DiMicco (2000–2012)\nJohn J. Ferriola (2013–2019).\nLeon J. Topalian (2019–present)\n\nEnvironmental issues\nIn 2000, Nucor agreed to spend $98 million, including $85 million for new air pollution control equipment, $4 million to monitor and reduce pollution in communities near its plants, and a $9 million civil fine to resolve allegations by the United States Department of Justice and the United States Environmental Protection Agency (EPA) that it had not adequately controlled the emission of toxic chemicals into the air, water, and soil in Alabama, Arkansas, Indiana, Nebraska, South Carolina, Texas, and Utah. The settlement was \"the largest and most comprehensive environmental settlement ever with a steel manufacturer.\"\nIn 2016, the company unsuccessfully filed a lawsuit to block the EPA from adopting a plan to control visible pollution in Arkansas.\nIn 2023, the company signed an agreement with ExxonMobil for carbon capture and storage of up to 800,000 metric tons from its direct reduced iron plant in Convent, Louisiana. The plant had been criticized for its emissions.\n\nFurther reading\nPreston, Richard (1992). American Steel. Quill. ISBN 0-380-71822-7. Story of Nucor's first big mill, discusses the history of Nucor.\n\nSee also\nList of steel producers\n\nReferences\nExternal links\nBusiness data for Nucor:",
  "clean_text": "Nucor Corporation is an American company based in Charlotte, North Carolina, that produces steel and related products. It is the largest steel producer in the United States and the largest recycler of scrap in North America. Nucor is the 16th-largest steel producer in the world. Along with Commercial Metals Company, it is one of two primary suppliers of rebar used to reinforce concrete in buildings, bridges, roads, and infrastructure in the U.S. Current operations To supply its mills, Nucor uses electric arc furnaces and continuous casting to melt scrap steel as opposed to blast furnaces to melt iron. In 2024, the company produced and sold approximately 18.5 million tons of steel and recycled 18 million tons of scrap. None of Nucor's mills are unionized and the corporate culture is opposed to trade unions. History After REO Motor Car Company, founded by Ransom E. Olds, sold its operations and initiated liquidation proceedings, a group of dissident activist shareholders, noticing the existence of a usable tax loss, successfully challenged the liquidation in a proxy fight in September 1955 and forced REO to take over a tiny nuclear services company called Nuclear Consultants, Inc. in a reverse takeover. The company was renamed \"Nuclear Corporation of America Inc.\" and relocated to offices in the Empire State Building in New York City. The organization's attempt to recast itself as a nuclear industry services company was unsuccessful, and it followed the example of other companies in the 1950s and 60s by attempting to become a conglomerate, moving its headquarters to Phoenix, Arizona. It made several acquisitions, including the Vulcraft Corporation, a steel joist manufacturer located in Florence, South Carolina. Vulcraft was founded by Sanborn Chase, who died at an early age, leaving the company to his widow. Nuclear purchased Vulcraft from Chase's widow in 1962 and hired F. Kenneth Iverson as general manager. In March 1965, the company again filed for bankruptcy. Iverson, head of the only profitable division, took over as head of the company due to lack of interest in the job from others. Iverson reorganized Nucor around its only profitable business, the steel fabricator Vulcraft. All other businesses were either sold or liquidated. In 1966, the company moved its headquarters to Charlotte, North Carolina to be closer to its main Vulcraft plant in South Carolina. In 1968, unable to get favorable steel prices from American manufacturers and unhappy with the imported steel available at the time, Iverson, a metallurgist by training, extended Nucor vertically into steelmaking by building its first steel bar mill in Darlington, South Carolina. The company purchased an electric arc furnace, which was far cheaper than the traditional steel blast furnace, with a $6 million loan secured by all of the company's assets. Production delays and staffing problems resulted in losses, but earnings soared in 1971 and 1972. In 1972, the company, recognizing that it was now misnamed, adopted its current title, Nucor Corporation. That year, it became a public company via an initial public offering. In 1988, the company opened its building products division. In 1989, Nucor opened a facility in Crawfordsville, Indiana, the first mini mill in the world to produce flat rolled steel using thin-slab technology. In March 2000, a joint venture, owned 47.5% by Nucor, 47.5% by BlueScope, and 5% by IHI Corporation was formed to license Castrip technology. This technology allowed for continuous casting of sheet steel directly from molten steel without the need for heavy, expensive, and energy-consuming rollers. Acquisitions and divestitures Closures and new investments List of CEOs F. Kenneth Iverson (1965–1996) John Correnti (1996–1999) H. David Aycock (1999–2000) Dan DiMicco (2000–2012) John J. Ferriola (2013–2019). Leon J. Topalian (2019–present) Environmental issues In 2000, Nucor agreed to spend $98 million, including $85 million for new air pollution control equipment, $4 million to monitor and reduce pollution in communities near its plants, and a $9 million civil fine to resolve allegations by the United States Department of Justice and the United States Environmental Protection Agency (EPA) that it had not adequately controlled the emission of toxic chemicals into the air, water, and soil in Alabama, Arkansas, Indiana, Nebraska, South Carolina, Texas, and Utah. The settlement was \"the largest and most comprehensive environmental settlement ever with a steel manufacturer.\" In 2016, the company unsuccessfully filed a lawsuit to block the EPA from adopting a plan to control visible pollution in Arkansas. In 2023, the company signed an agreement with ExxonMobil for carbon capture and storage of up to 800,000 metric tons from its direct reduced iron plant in Convent, Louisiana. The plant had been criticized for its emissions. Further reading Preston, Richard (1992). American Steel. Quill. ISBN 0-380-71822-7. Story of Nucor's first big mill, discusses the history of Nucor."
}