{
  "ticker": "NVR",
  "cik": "0000906163",
  "company_name": "NVR, Inc.",
  "corrected_name": "NVR, Inc.",
  "wiki_title_used": "NVR, Inc.",
  "exists": true,
  "raw_text": "NVR, Inc. is an American company engaged in home construction headquartered in Reston, Virginia. It also operates a mortgage banking and title services business. The company primarily operates on the East Coast of the United States, but its operations encompass 14 states as well as Washington, D.C. In 2021, 22% of the company's revenue was from the Washington metropolitan area.\nNVR operates under the Ryan Homes, NVHomes, and Heartland Homes brands. The company typically does not engage in land development; it acquires finished land lots that are ready for building, which the company believes mitigates risk. As of 2023, the company is the 4th largest home construction company in the United States based on the number of homes closed. It is ranked 389th on the 2022 Fortune 500.\nThe company's stock price is the second most expensive on U.S. exchanges, behind only Berkshire Hathaway's Class A shares.\n\nHistory\nThe company was formed in 1980 as NVHomes, Inc. (formerly North Virginia Homes Inc.) by Dwight Schar.\nIn 1986, the company acquired Ryan Homes, founded in 1948 in Pittsburgh, Pennsylvania, to provide housing in the expanding post-war economy.\nIn April 1992, as a result of the early 1990s recession, the company filed bankruptcy.\nIn September 1993, the company emerged from bankruptcy protection and once again became a public company.\nIn December 2012, the company acquired Heartland Homes.\nIn September 2019, the company was added to the S&P 500 stock market index.\n\nControversies\nIn February 2010, then Attorney General of Delaware, Beau Biden, sued the company for fraud, seeking damages of $10,000 for each of 39 homeowners, alleging that the company did not provide promised amenities, primarily a clubhouse with restaurant and fitness center, for homeowners of a development built by the company in Townsend, Delaware. The lawsuit was settled in April 2010, with the company agreeing to complete development of the promised amenities and reimburse homeowners for the period when they have been paying for promised amenities that they did not receive.\n\nReferences\nExternal links\nOfficial website\nBusiness data for NVR, Inc.:",
  "clean_text": "NVR, Inc. is an American company engaged in home construction headquartered in Reston, Virginia. It also operates a mortgage banking and title services business. The company primarily operates on the East Coast of the United States, but its operations encompass 14 states as well as Washington, D.C. In 2021, 22% of the company's revenue was from the Washington metropolitan area. NVR operates under the Ryan Homes, NVHomes, and Heartland Homes brands. The company typically does not engage in land development; it acquires finished land lots that are ready for building, which the company believes mitigates risk. As of 2023, the company is the 4th largest home construction company in the United States based on the number of homes closed. It is ranked 389th on the 2022 Fortune 500. The company's stock price is the second most expensive on U.S. exchanges, behind only Berkshire Hathaway's Class A shares. History The company was formed in 1980 as NVHomes, Inc. (formerly North Virginia Homes Inc.) by Dwight Schar. In 1986, the company acquired Ryan Homes, founded in 1948 in Pittsburgh, Pennsylvania, to provide housing in the expanding post-war economy. In April 1992, as a result of the early 1990s recession, the company filed bankruptcy. In September 1993, the company emerged from bankruptcy protection and once again became a public company. In December 2012, the company acquired Heartland Homes. In September 2019, the company was added to the S&P 500 stock market index. Controversies In February 2010, then Attorney General of Delaware, Beau Biden, sued the company for fraud, seeking damages of $10,000 for each of 39 homeowners, alleging that the company did not provide promised amenities, primarily a clubhouse with restaurant and fitness center, for homeowners of a development built by the company in Townsend, Delaware. The lawsuit was settled in April 2010, with the company agreeing to complete development of the promised amenities and reimburse homeowners for the period when they have been paying for promised amenities that they did not receive."
}