{
  "ticker": "NXPI",
  "cik": "0001413447",
  "company_name": "NXP Semiconductors",
  "corrected_name": "NXP Semiconductors",
  "wiki_title_used": "NXP Semiconductors",
  "exists": true,
  "raw_text": "NXP Semiconductors N.V. is a Dutch semiconductor manufacturing and design company with headquarters in Eindhoven, Netherlands. It is the third largest European semiconductor company by market capitalization as of 2024. The company employs approximately 34,000 people in more than 30 countries and it reported revenues of $13.3 billion in 2023. The company's origins date back to the 1950s as part of Philips and it became one of the world's largest semiconductor companies by the end of the 20th century. Philips spun off the company in 2006 and it has since operated independently.\nThe company's name is an abbreviation of Next eXPerience.\n\nOverview\nOriginally spun off from Philips in 2006, NXP completed its initial public offering, on August 6, 2010, with shares trading on Nasdaq under the ticker symbol \"NXPI\". On December 23, 2013, NXP Semiconductors was added to the Nasdaq-100 index. In 2021, it was added to the S&P 500 stock index. \n\nNXP is the co-inventor of near field communication (NFC) technology along with Sony and Inside Secure and supplies NFC chip sets that enable mobile phones to be used to pay for goods, and store and exchange data securely. NXP manufactures chips for eGovernment applications such as electronic passports; RFID tags and labels; and transport and access management, with the chip set and contactless card for MIFARE used by many major public transit systems worldwide. In order to protect against potential hackers, NXP offers gateways to automotive manufacturers that prevent communication with every network within a car independently. NXP customers include Apple, Dell, Ericsson and Samsung.\n\nHistory\nWithin Philips\nIn 1953 Philips started a small scale production facility in the center of the Dutch city Nijmegen as part of its main industry group \"Icoma\" (Industrial Components and Materials), followed by the opening of a new factory in 1955. In 1965 Icoma became part of a new Philips main industry group \"Elcoma\" (Electronic Components and Materials). \nIn 1975 Silicon Valley–based Signetics was acquired by Philips. Signetics claimed to be the \"first company in the world established expressly to make and sell integrated circuits\" and inventor of the 555 timer IC. At the time, it was claimed that with the Signetics acquisition, Philips was now number two in the league table of semiconductor manufacturers in the world.\nIn 1987, Philips was ranked Europe's largest semiconductor maker. The year after, all Philips semiconductor subsidiaries, including Signetics, Faselec (in Switzerland) and Mullard (in the UK), were merged in the newly formed product division Components. The semiconductor activities were split off from Components in 1991 under the name Philips Semiconductors.\nIn June 1999, Philips acquired VLSI Technology, at the time making Philips the world's sixth largest semiconductor company.\n\nIndependent company\n2000s\nIn December 2005, Philips announced its intention to divest Philips Semiconductors into an independent legal entity. In September 2006, Philips completed the sale of an 80.1% stake in Philips Semiconductors to a consortium of private equity investors consisting of KKR, Bain Capital, Silver Lake Partners, Apax Partners and AlpInvest Partners. The new company name NXP (from Next eXPerience) was announced on August 31, 2006, and the company was officially launched during the Internationale Funkausstellung (IFA) consumer electronics show in Berlin. The newly independent NXP was ranked as one of the world's top 10 semiconductor companies.\nIn February 2007, NXP announced that it would acquire Silicon Laboratories’ AeroFONE single-chip phone and power amplifier product lines to strengthen its Mobile and Personal business. The next year, NXP announced that it would transform its Mobile and Personal business unit into a joint venture with STMicroelectronics, which in 2009 became ST-Ericsson, a 50/50 joint venture of Ericsson Mobile Platforms and STMicroelectronics, after ST purchased NXP's 20% stake. In April 2008, NXP announced it would acquire the set-top box business of Conexant to complement its existing Home business unit. In September 2008, NXP announced that it would restructure its manufacturing, R&D and back office operations, resulting in 4,500 job cuts worldwide. In October 2009, NXP announced that it would sell its Home business unit to Trident Microsystems.\n\n2010s and 2020s\nBefore the divestiture of Nexperia in June 2016, NXP was a volume supplier of discrete and standard logic devices, celebrating its 50 years in logic (via its history as both Signetics and Philips Semiconductors) in March 2012.\n\nNXP's first CEO was Frans van Houten; he was succeeded by Richard L. Clemmer on January 1, 2009. Since May 2020, Kurt Sievers serves as president and CEO.\nIn March 2015, a merger agreement was announced through which NXP would merge with competitor Freescale Semiconductor. As part of the merger, NXP's RF Power activities were sold to JAC Capital for US$1.8 billion and rebranded as Ampleon, in a transaction closed in November 2015.\nBoth NXP and Freescale had deep roots stretching back to when they were part of Philips (NXP), and Motorola (Freescale) respectively. Both had similar revenue; US$4.8 billion and US$4.2 billion in 2013 for NXP and Freescale, respectively with NXP primarily focusing on near field communication (NFC) and high-performance mixed signal (HPMS) hardware, and Freescale focusing on its microprocessor and microcontroller businesses, and both companies possessing roughly equal patent portfolios. On December 7, 2015, NXP completed the merger with Freescale Semiconductor; the merged company continued its operation as NXP Semiconductors N.V.\nOn October 27, 2016, it was announced that Qualcomm would try to buy NXP for $44 billion, which at that time would have been the biggest semiconductor takeover globally. However, Qualcomm cancelled the deal due in part to trade issues in China. The merger was effectively cancelled on July 26, 2018.\n\nWorldwide sites\nNXP Semiconductors is headquartered in Eindhoven, Netherlands, and has numerous international locations.\n\nWafer fabs\nChandler, Arizona, United States\nAustin, Texas, United States\nNijmegen, Netherlands\nSingapore (SSMC)\n\nR&D and Design\nEindhoven (HQ)\nSan Jose, California\nAustin, Texas\nChandler, Arizona\nSan Diego\nNovi, Michigan\nKanata, Ontario\nGratkorn\nMilan\nCatania\nLeuven\nDelft\nBrno\nRožnov pod Radhoštěm\nBucharest\nCaen\nMougins\nToulouse\nGrenoble\nSophia Antipolis\nDresden\nHamburg\nMunich\nSouthampton\nGlasgow\nYokneam Illit\n\nTest and assembly\nBangkok, Thailand\nKaohsiung, Taiwan\nPetaling Jaya, Malaysia\nTianjin, China\n\nSales\nSan Jose, California\nSan Diego\nNovi, Michigan\nIrvine, California\nWoburn, Massachusetts\nGuadalajara\nKanata, Ontario\nBeijing\nHong Kong\nTokyo\nSingapore\nSeoul\nParis\nSindelfingen\n\nJoint ventures\nVSMC\nEuropean Semiconductor Manufacturing Company (ESMC)\nSystems on Silicon Manufacturing Company (SSMC) Pte. Ltd. (61%)\nDatang NXP Semiconductors Co., Ltd. (49%)\nAdvanced Semiconductor Manufacturing Co. Ltd. (27%)\nCohda Wireless Pty Ltd. (23%)\n\nNotable events\nOn July 26, 2010, NXP announced that it had acquired Jennic, based in Sheffield, UK, which now operates as part of its smart home and energy product line, using Zigbee and JenNet-IP.\nOn August 6, 2010, NXP announced its initial public offering at Nasdaq, with 34 million shares, pricing each $14.\nIn December 2010, NXP announced that it would sell its Sound Solutions business to Knowles Electronics, part of Dover Corporation, for $855 million in cash. The acquisition was completed as of July 5, 2011.\nIn April 2012, NXP announced its intent to acquire electronic design consultancy Catena to work on automotive applications.\nIn July 2012, NXP sold its high-speed data converter assets to Integrated Device Technology.\nIn 2012, revenue for NXP's Identification business unit was $986 million, up 41% from 2011, in part due to growing sales of NFC chips and secure elements.\nOn January 4, 2013, NXP and Cisco announced their investment in Cohda Wireless, an Australian company focused on car-to-car and car-to-infrastructure communications.\nIn January 2013, NXP announced 700-900 redundancies worldwide in an effort to cut costs related to \"support services\".\nIn May 2013, NXP announced that it acquired Code Red Technologies, a provider of embedded software development such as the LPCXpresso IDE and Red Suite.\nIn July 2014, NXP was reported to have terminated the employment of union organizers.  A campaign was started for their reinstatement.\nIn August 2015, a joint-venture with the Beijing JianGuang Asset Management Co. Ltd. was registered in Shanghai, China under the name WeEn Semiconductors.\nOn June 14, 2016, it was announced that Nexperia would be divested from NXP to a consortium of financial investors consisting of Beijing Jianguang Asset Management Co., Ltd (“JAC Capital”) and Wise Road Capital LTD (“Wise Road Capital”). WeEn Semiconductors started delivery of bipolar and SiC power semiconductors, TRIACs, IGBT modules, etc.\nIn April 2017, Qualcomm received approval from U.S. antitrust regulators for the acquisition of NXP for $47 billion. However, the acquisition has not received approval from Chinese authorities and Qualcomm has refiled an antitrust application and request to purchase with the PRC Ministry of Commerce.\nThe i.MX 8 was announced Q1 2017, based around 3 products. Two variants include four Cortex-A53. All versions includes one or two Cortex-A72 CPU cores and all versions includes two Cortex-M4F CPU cores.\nThe i.MX 8M series were announced on January 4 at CES 2017.\n\nIn September 2018, NXP announced that it acquired OmniPHY, a provider of automotive Ethernet subsystem technology.\nOn December 6, 2019, NXP announced the completion of the acquisition of the wireless connectivity assets from Marvell.\nOn June 18, 2020, NXP announced HoverGames Challenge 2: Help Drones Help Others.\nOn July 21, 2020, NXP delivered secure and scalable edge-connected platforms based on its i.MX RT crossover processors and Wi-Fi/Bluetooth solutions.\nOn January 5, 2023, NXP introduced industry-first 28 nm RFCMOS radar one-chip for safety-critical ADAS applications, with  DENSO leveraging it to build advanced ADAS platforms.\nNXP and Foxconn opened a joint laboratory in December 2023 in the Foxconn Nankan Facility in Taiwan, marking a new milestone in the companies’ strategic collaboration for software-defined electric vehicle development.\n\nControversies\nIn March 2013, NXP locked out workers at its plant in Bangkok, Thailand. The reason was stalled negotiations over a new work schedule with their trade union, which was affiliated with the Confederation of Thai Electrical Appliances, Electronic Automobile & Metalworkers (TEAM). Management then called in small groups of workers, asked them if they agreed with the union's demands, and told them to leave if they did. They were not able to enter the factory the next day. In response, TEAM staged protests outside the factory and on March 13 outside the Dutch embassy and also filed a complaint with the National Human Right Commission. On April 29, mediation by the Ministry of Labour led to the signing of a memorandum that passed the decision over the work schedule to the Labour Relations Committee. The committee decided on June 20 that the new work schedule did not violate Thai labour law; however, the National Human Rights Committee decided otherwise and recommended the factory should revert to the old schedule. NXP continues to demand regular 12-hour shifts.\nIn May 2014, the company fired 24 workers at its plant in the special economic zone  in Cabuyao, The Philippines. The workers were all officials of a trade union affiliated with the Metal Workers Alliance of the Philippines (MWAP). Reports said they were fired due to their union functions in negotiations for a new collective bargaining agreement. Factory owners claimed the workers were fired after refusing to work on April 9, while workers said they had not been paid for two months. IndustriALL and its affiliated unions in the Philippines condemned the dismissals. In September, MWAP and NXP reached an agreement by which 12 of the fired workers were reinstated and the other 12 received separation packages. NXP also committed itself to a long-term wage increase. In the summer of 2015, a member of the Dutch parliament questioned trade minister Lilianne Ploumen regarding NXP's behaviour.\n\nSee also\nNXP MIFARE contactless smart cards and proximity cards\nNXP LPC microcontrollers\nNXP QorIQ microprocessors\nNXP GreenChip\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for NXP Semiconductors:",
  "clean_text": "NXP Semiconductors N.V. is a Dutch semiconductor manufacturing and design company with headquarters in Eindhoven, Netherlands. It is the third largest European semiconductor company by market capitalization as of 2024. The company employs approximately 34,000 people in more than 30 countries and it reported revenues of $13.3 billion in 2023. The company's origins date back to the 1950s as part of Philips and it became one of the world's largest semiconductor companies by the end of the 20th century. Philips spun off the company in 2006 and it has since operated independently. The company's name is an abbreviation of Next eXPerience. Overview Originally spun off from Philips in 2006, NXP completed its initial public offering, on August 6, 2010, with shares trading on Nasdaq under the ticker symbol \"NXPI\". On December 23, 2013, NXP Semiconductors was added to the Nasdaq-100 index. In 2021, it was added to the S&P 500 stock index. NXP is the co-inventor of near field communication (NFC) technology along with Sony and Inside Secure and supplies NFC chip sets that enable mobile phones to be used to pay for goods, and store and exchange data securely. NXP manufactures chips for eGovernment applications such as electronic passports; RFID tags and labels; and transport and access management, with the chip set and contactless card for MIFARE used by many major public transit systems worldwide. In order to protect against potential hackers, NXP offers gateways to automotive manufacturers that prevent communication with every network within a car independently. NXP customers include Apple, Dell, Ericsson and Samsung. History Within Philips In 1953 Philips started a small scale production facility in the center of the Dutch city Nijmegen as part of its main industry group \"Icoma\" (Industrial Components and Materials), followed by the opening of a new factory in 1955. In 1965 Icoma became part of a new Philips main industry group \"Elcoma\" (Electronic Components and Materials). In 1975 Silicon Valley–based Signetics was acquired by Philips. Signetics claimed to be the \"first company in the world established expressly to make and sell integrated circuits\" and inventor of the 555 timer IC. At the time, it was claimed that with the Signetics acquisition, Philips was now number two in the league table of semiconductor manufacturers in the world. In 1987, Philips was ranked Europe's largest semiconductor maker. The year after, all Philips semiconductor subsidiaries, including Signetics, Faselec (in Switzerland) and Mullard (in the UK), were merged in the newly formed product division Components. The semiconductor activities were split off from Components in 1991 under the name Philips Semiconductors. In June 1999, Philips acquired VLSI Technology, at the time making Philips the world's sixth largest semiconductor company. Independent company 2000s In December 2005, Philips announced its intention to divest Philips Semiconductors into an independent legal entity. In September 2006, Philips completed the sale of an 80.1% stake in Philips Semiconductors to a consortium of private equity investors consisting of KKR, Bain Capital, Silver Lake Partners, Apax Partners and AlpInvest Partners. The new company name NXP (from Next eXPerience) was announced on August 31, 2006, and the company was officially launched during the Internationale Funkausstellung (IFA) consumer electronics show in Berlin. The newly independent NXP was ranked as one of the world's top 10 semiconductor companies. In February 2007, NXP announced that it would acquire Silicon Laboratories’ AeroFONE single-chip phone and power amplifier product lines to strengthen its Mobile and Personal business. The next year, NXP announced that it would transform its Mobile and Personal business unit into a joint venture with STMicroelectronics, which in 2009 became ST-Ericsson, a 50/50 joint venture of Ericsson Mobile Platforms and STMicroelectronics, after ST purchased NXP's 20% stake. In April 2008, NXP announced it would acquire the set-top box business of Conexant to complement its existing Home business unit. In September 2008, NXP announced that it would restructure its manufacturing, R&D and back office operations, resulting in 4,500 job cuts worldwide. In October 2009, NXP announced that it would sell its Home business unit to Trident Microsystems. 2010s and 2020s Before the divestiture of Nexperia in June 2016, NXP was a volume supplier of discrete and standard logic devices, celebrating its 50 years in logic (via its history as both Signetics and Philips Semiconductors) in March 2012. NXP's first CEO was Frans van Houten; he was succeeded by Richard L. Clemmer on January 1, 2009. Since May 2020, Kurt Sievers serves as president and CEO. In March 2015, a merger agreement was announced through which NXP would merge with competitor Freescale Semiconductor. As part of the merger, NXP's RF Power activities were sold to JAC Capital for US$1.8 billion and rebranded as Ampleon, in a transaction closed in November 2015. Both NXP and Freescale had deep roots stretching back to when they were part of Philips (NXP), and Motorola (Freescale) respectively. Both had similar revenue; US$4.8 billion and US$4.2 billion in 2013 for NXP and Freescale, respectively with NXP primarily focusing on near field communication (NFC) and high-performance mixed signal (HPMS) hardware, and Freescale focusing on its microprocessor and microcontroller businesses, and both companies possessing roughly equal patent portfolios. On December 7, 2015, NXP completed the merger with Freescale Semiconductor; the merged company continued its operation as NXP Semiconductors N.V. On October 27, 2016, it was announced that Qualcomm would try to buy NXP for $44 billion, which at that time would have been the biggest semiconductor takeover globally. However, Qualcomm cancelled the deal due in part to trade issues in China. The merger was effectively cancelled on July 26, 2018. Worldwide sites NXP Semiconductors is headquartered in Eindhoven, Netherlands, and has numerous international locations. Wafer fabs Chandler, Arizona, United States Austin, Texas, United States Nijmegen, Netherlands Singapore (SSMC) R&D and Design Eindhoven (HQ) San Jose, California Austin, Texas Chandler, Arizona San Diego Novi, Michigan Kanata, Ontario Gratkorn Milan Catania Leuven Delft Brno Rožnov pod Radhoštěm Bucharest Caen Mougins Toulouse Grenoble Sophia Antipolis Dresden Hamburg Munich Southampton Glasgow Yokneam Illit Test and assembly Bangkok, Thailand Kaohsiung, Taiwan Petaling Jaya, Malaysia Tianjin, China Sales San Jose, California San Diego Novi, Michigan Irvine, California Woburn, Massachusetts Guadalajara Kanata, Ontario Beijing Hong Kong Tokyo Singapore Seoul Paris Sindelfingen Joint ventures VSMC European Semiconductor Manufacturing Company (ESMC) Systems on Silicon Manufacturing Company (SSMC) Pte. Ltd. (61%) Datang NXP Semiconductors Co., Ltd. (49%) Advanced Semiconductor Manufacturing Co. Ltd. (27%) Cohda Wireless Pty Ltd. (23%) Notable events On July 26, 2010, NXP announced that it had acquired Jennic, based in Sheffield, UK, which now operates as part of its smart home and energy product line, using Zigbee and JenNet-IP. On August 6, 2010, NXP announced its initial public offering at Nasdaq, with 34 million shares, pricing each $14. In December 2010, NXP announced that it would sell its Sound Solutions business to Knowles Electronics, part of Dover Corporation, for $855 million in cash. The acquisition was completed as of July 5, 2011. In April 2012, NXP announced its intent to acquire electronic design consultancy Catena to work on automotive applications. In July 2012, NXP sold its high-speed data converter assets to Integrated Device Technology. In 2012, revenue for NXP's Identification business unit was $986 million, up 41% from 2011, in part due to growing sales of NFC chips and secure elements. On January 4, 2013, NXP and Cisco announced their investment in Cohda Wireless, an Australian company focused on car-to-car and car-to-infrastructure communications. In January 2013, NXP announced 700-900 redundancies worldwide in an effort to cut costs related to \"support services\". In May 2013, NXP announced that it acquired Code Red Technologies, a provider of embedded software development such as the LPCXpresso IDE and Red Suite. In July 2014, NXP was reported to have terminated the employment of union organizers. A campaign was started for their reinstatement. In August 2015, a joint-venture with the Beijing JianGuang Asset Management Co. Ltd. was registered in Shanghai, China under the name WeEn Semiconductors. On June 14, 2016, it was announced that Nexperia would be divested from NXP to a consortium of financial investors consisting of Beijing Jianguang Asset Management Co., Ltd (“JAC Capital”) and Wise Road Capital LTD (“Wise Road Capital”). WeEn Semiconductors started delivery of bipolar and SiC power semiconductors, TRIACs, IGBT modules, etc. In April 2017, Qualcomm received approval from U.S. antitrust regulators for the acquisition of NXP for $47 billion. However, the acquisition has not received approval from Chinese authorities and Qualcomm has refiled an antitrust application and request to purchase with the PRC Ministry of Commerce. The i.MX 8 was announced Q1 2017, based around 3 products. Two variants include four Cortex-A53. All versions includes one or two Cortex-A72 CPU cores and all versions includes two Cortex-M4F CPU cores. The i.MX 8M series were announced on January 4 at CES 2017. In September 2018, NXP announced that it acquired OmniPHY, a provider of automotive Ethernet subsystem technology. On December 6, 2019, NXP announced the completion of the acquisition of the wireless connectivity assets from Marvell. On June 18, 2020, NXP announced HoverGames Challenge 2: Help Drones Help Others. On July 21, 2020, NXP delivered secure and scalable edge-connected platforms based on its i.MX RT crossover processors and Wi-Fi/Bluetooth solutions. On January 5, 2023, NXP introduced industry-first 28 nm RFCMOS radar one-chip for safety-critical ADAS applications, with DENSO leveraging it to build advanced ADAS platforms. NXP and Foxconn opened a joint laboratory in December 2023 in the Foxconn Nankan Facility in Taiwan, marking a new milestone in the companies’ strategic collaboration for software-defined electric vehicle development. Controversies In March 2013, NXP locked out workers at its plant in Bangkok, Thailand. The reason was stalled negotiations over a new work schedule with their trade union, which was affiliated with the Confederation of Thai Electrical Appliances, Electronic Automobile & Metalworkers (TEAM). Management then called in small groups of workers, asked them if they agreed with the union's demands, and told them to leave if they did. They were not able to enter the factory the next day. In response, TEAM staged protests outside the factory and on March 13 outside the Dutch embassy and also filed a complaint with the National Human Right Commission. On April 29, mediation by the Ministry of Labour led to the signing of a memorandum that passed the decision over the work schedule to the Labour Relations Committee. The committee decided on June 20 that the new work schedule did not violate Thai labour law; however, the National Human Rights Committee decided otherwise and recommended the factory should revert to the old schedule. NXP continues to demand regular 12-hour shifts. In May 2014, the company fired 24 workers at its plant in the special economic zone in Cabuyao, The Philippines. The workers were all officials of a trade union affiliated with the Metal Workers Alliance of the Philippines (MWAP). Reports said they were fired due to their union functions in negotiations for a new collective bargaining agreement. Factory owners claimed the workers were fired after refusing to work on April 9, while workers said they had not been paid for two months. IndustriALL and its affiliated unions in the Philippines condemned the dismissals. In September, MWAP and NXP reached an agreement by which 12 of the fired workers were reinstated and the other 12 received separation packages. NXP also committed itself to a long-term wage increase. In the summer of 2015, a member of the Dutch parliament questioned trade minister Lilianne Ploumen regarding NXP's behaviour."
}