{
  "ticker": "O",
  "cik": "0000726728",
  "company_name": "Realty Income",
  "corrected_name": "Realty Income",
  "wiki_title_used": "Realty Income",
  "exists": true,
  "raw_text": "Realty Income Corporation is a real estate investment trust that invests in free-standing, single-tenant commercial properties in the United States, the United Kingdom, and six other countries in Europe. These properties are subject to NNN Leases. The company is organized in Maryland with its headquarters in San Diego, California.\nThe company is one of a few real estate investment trusts that pays dividends monthly, rather than quarterly, and has registered a trademark for the phrase \"The Monthly Dividend Company\".\n\nInvestments\nAs of June 30, 2024, the company owned 15,450 properties totaling approximately 335.3 million leasable square feet.\nThe company's largest tenants are as follows:\n\nHistory\nRealty Income Corporation was founded in 1969 by William E. Clark and Evelyn J. Clark. Its first acquisition was a Taco Bell restaurant in early 1970.\nThe company used cash to purchase land needed for stores that required real estate to run, and then leased the property to the stores long term.\nIn 1994, the company became a public company via an initial public offering.\nIn 1997, William E. Clark, Jr., retired as CEO and was succeeded by Thomas A. Lewis. In 2013, John P. Case succeeded Mr. Lewis as CEO of the company.\nIn 2009, Clark retired as chairman.\nIn 2013, the company acquired American Realty Capital Trust, founded by Nicholas Schorsch, in a $2.95 billion transaction.\nIn 2015, the company was added to the S&P 500 and the S&P High Yield Dividend Aristocrats index.\nIn 2018, Sumit Roy became the company's CEO.\nIn 2019, the company completed a sale-leaseback transaction for 12 properties of the United Kingdom supermarket chain Sainsbury's.  This was the company's first purchase of property outside the United States.\nOn November 1, 2021, the company acquired VEREIT.\nOn December 1, 2022, the company completed a $1.7 billion sale-leaseback of Encore Boston Harbor. \nOn August 2, 2023, the company announced a $950 million investment in Bellagio Las Vegas. \nOn January 23, 2024, the company completed the $9.3 billion acquisition of Spirit Realty Capital.\nIn November 2025, it was announced the company had acquired The Lexicon shopping centre in Bracknell, UK for approximately £150m.\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Realty Income Corporation:",
  "clean_text": "Realty Income Corporation is a real estate investment trust that invests in free-standing, single-tenant commercial properties in the United States, the United Kingdom, and six other countries in Europe. These properties are subject to NNN Leases. The company is organized in Maryland with its headquarters in San Diego, California. The company is one of a few real estate investment trusts that pays dividends monthly, rather than quarterly, and has registered a trademark for the phrase \"The Monthly Dividend Company\". Investments As of June 30, 2024, the company owned 15,450 properties totaling approximately 335.3 million leasable square feet. The company's largest tenants are as follows: History Realty Income Corporation was founded in 1969 by William E. Clark and Evelyn J. Clark. Its first acquisition was a Taco Bell restaurant in early 1970. The company used cash to purchase land needed for stores that required real estate to run, and then leased the property to the stores long term. In 1994, the company became a public company via an initial public offering. In 1997, William E. Clark, Jr., retired as CEO and was succeeded by Thomas A. Lewis. In 2013, John P. Case succeeded Mr. Lewis as CEO of the company. In 2009, Clark retired as chairman. In 2013, the company acquired American Realty Capital Trust, founded by Nicholas Schorsch, in a $2.95 billion transaction. In 2015, the company was added to the S&P 500 and the S&P High Yield Dividend Aristocrats index. In 2018, Sumit Roy became the company's CEO. In 2019, the company completed a sale-leaseback transaction for 12 properties of the United Kingdom supermarket chain Sainsbury's. This was the company's first purchase of property outside the United States. On November 1, 2021, the company acquired VEREIT. On December 1, 2022, the company completed a $1.7 billion sale-leaseback of Encore Boston Harbor. On August 2, 2023, the company announced a $950 million investment in Bellagio Las Vegas. On January 23, 2024, the company completed the $9.3 billion acquisition of Spirit Realty Capital. In November 2025, it was announced the company had acquired The Lexicon shopping centre in Bracknell, UK for approximately £150m."
}