{
  "ticker": "ODFL",
  "cik": "0000878927",
  "company_name": "Old Dominion",
  "corrected_name": "Old Dominion",
  "wiki_title_used": "Old Dominion",
  "exists": true,
  "raw_text": "Old Dominion most commonly refers to:\n\nThe Old Dominion, a nickname for the U.S. Commonwealth of Virginia\nColony of Virginia\nOld Dominion University, a public university in Norfolk, Virginia\nOld Dominion Monarchs, the athletic teams representing Old Dominion University\nOld Dominion, Virginia, an unincorporated community in Albemarle County, Virginia\nOld Dominion may also refer to:\n\nMusic\nOld Dominion (band), an American country-rock band\nOld Dominion (EP)\nOld Dominion (album)\nOld Dominion, an album by Hotel of the Laughing Tree\n\"Old Dominion\", a 2000 song by Avail from One Wrench\n\"Old Dominion\", a 2002 song by Enon from lavrage\n\nOther uses\nOld Dominion (train), a former Amtrak passenger train in the United States\nOld Dominion Athletic Conference, an NCAA Division III athletic conference\nOld Dominion Brewing Company\nOld Dominion Electric Cooperative\nOld Dominion Foundation, a predecessor of the Andrew W. Mellon Foundation\nOld Dominion Freight Line\nOld Dominion (magazine), a magazine from 1870 to 1873",
  "clean_text": "Old Dominion most commonly refers to: The Old Dominion, a nickname for the U.S. Commonwealth of Virginia Colony of Virginia Old Dominion University, a public university in Norfolk, Virginia Old Dominion Monarchs, the athletic teams representing Old Dominion University Old Dominion, Virginia, an unincorporated community in Albemarle County, Virginia Old Dominion may also refer to: Music Old Dominion (band), an American country-rock band Old Dominion (EP) Old Dominion (album) Old Dominion, an album by Hotel of the Laughing Tree \"Old Dominion\", a 2000 song by Avail from One Wrench \"Old Dominion\", a 2002 song by Enon from lavrage Other uses Old Dominion (train), a former Amtrak passenger train in the United States Old Dominion Athletic Conference, an NCAA Division III athletic conference Old Dominion Brewing Company Old Dominion Electric Cooperative Old Dominion Foundation, a predecessor of the Andrew W. Mellon Foundation Old Dominion Freight Line Old Dominion (magazine), a magazine from 1870 to 1873"
}