{
  "ticker": "OKE",
  "cik": "0001039684",
  "company_name": "Oneok",
  "corrected_name": "Oneok",
  "wiki_title_used": "Oneok",
  "exists": true,
  "raw_text": "Oneok, Inc. () ONE-oak, stylized as ONEOK, is an American oil and gas midstream operator headquartered in Tulsa, Oklahoma. It provides the oil and gas industry with gathering, processing, fractionation, transportation, and storage services. The company is part of the Fortune 500 and S&P 500. Oneok was founded as Oklahoma Natural Gas Company in 1906, but it changed its corporate name to Oneok in 1980.\n\nHistory\nOklahoma Natural Gas Company was founded on October 12, 1906 by businessmen Dennis T. Flynn and Charles B. Ames. During the spring and fall of 1907, the company built a gas pipeline from Osage County to Sapulpa and Oklahoma City. On December 28, 1907 (shortly after Oklahoma officially became a state in November), the $1.7 million project was completed. In 1910, the company built the first compressor station in the state of Oklahoma. By 1919, the Oklahoma Natural Gas Company supplied gas to thirty-seven communities in Oklahoma across more than one thousand miles of line. The company had grown to 600 employees and maintained 6,600 miles of pipeline by 1956.\nIn December 1980 Oklahoma Natural Gas Company's board of directors changed the company's name to Oneok Inc. Also at that time the gas service part of the company was made into a separate division, retaining the name of Oklahoma Natural Gas.\nIn 1996, Oneok acquired Western Resources' natural gas pipeline and plants for $660 million in stock. From the acquisition, Oneok acquired roughly 1,575 Western Resources employees as well as the 624,000 customers in Kansas and 36,000 customers in northeast Oklahoma.\nIn 1999, Oneok agreed to acquire Southwest Gas, a Las Vegas based natural gas company, for $1.8 billion. In January 2000, Oneok terminated the pending merger of the two companies, and Southwest Gas filed a lawsuit against Oneok. Judge Roslyn O. Silver dismissed two of the cases against Oneok in June 2001, and Oneok agreed to pay Southern Union $3 million to settle the remaining case.\nIn October 2002, Oneok acquired the Texas division and assets of Southern Union Gas for $420 million. Oneok renamed the company to Texas Gas Service when the acquisition was completed.\nIn September 2004, Oneok acquired Northern Plains Natural Gas Co. for $175 million. The deal also gave Oneok a controlling interest in Northern Border Partners, which had a master limited partnership on 6,600 miles of pipeline, five natural gas processing plants, and two fractional plants.\nIn July 2013, Oneok spun off its natural gas distribution businesses, including Oklahoma Natural Gas Co., Kansas Gas Service, and Texas Gas Service, into a separate company named One Gas.\nIn November 2021, Oneok resumed construction of its natural gas processing facility Demicks Lake III plant in McKenzie County, North Dakota which was originally delayed due to the COVID-19 pandemic. The Demicks Lake III plant was later completed and began operations in February 2023.\nIn July 2022, a Oneok gas plant in Medford, Oklahoma exploded, causing no injuries but temporarily expelling roughly 1,000 residents from their homes. In January 2023, Oneok reached an insurance settlement payment of $930 million and the company announced plans to transition gas fractionation operations away from the Medford plant.\nIn September 2023, Oneok acquired Magellan Midstream Partners for $18.8 billion. Included in the acquisition for Oneok was the Magellan-owned East Houston terminal and crude oil trading hub, facilities in Galena Park, Texas and Seabrook, Texas, and a terminal in Pasadena, Texas. \nIn May 2024, Oneok agreed to acquire Gulf Coast NGL Pipelines from Easton Energy for $280 million. The deal included 450 miles of pipelines located in Texas and the Louisiana Gulf Coast. In November, Oneok agreed to divest three of its pipelines—Guardian Pipeline, Midwestern Gas Transmission and Viking Gas Transmission—to DT Midstream for $1.2 billion.\nThe company expanded its operations in the Permian Basin through two acquisitions in late 2024. ONEOK acquired Medallion Midstream, a crude oil gathering and transportation company and a controlling stake in EnLink Midstream, an oil and natural gas infrastructure company. In February 2025, the company completed acquisition of the remaining shares in EnLink Midstream.\nThe company continued expansion into the Permian Basin in May 2025, when it gained full ownership of the Delaware Basin JV, which it previously operated as a joint venture with NGP XI Midstream Holdings. Through the acquisition Oneok gained operational control of infrastructure used to collect and process natural gas in the Delaware Basin that has a processing capacity of around 700 million cubic feet per day.\n\nOperations\nOneok has four business segments: natural gas liquids, natural gas gathering and processing, natural gas pipelines, and refined products and crude oil. \nSome of the pipelines Oneok operates include the Northern Border Pipeline, the Roadrunner Gas Transmission Pipeline, the Arbuckle Pipeline, and the Elk Creek Pipeline.\nMagellan Midstream Partners operates as a subsidiary of Oneok and owns approximately 2,200 miles of crude pipelines, and the 450-mile Longhorn pipeline, which transports roughly 275,000 barrels per day of crude oil from the Permian Basin to storage and refining facilities in Houston.\n\nSee also\nGuardian Pipeline\nOklahoma Natural Gas Company Building\nOne Gas\n\nReferences\nExternal links\nOfficial Website\nBusiness data for Oneok:",
  "clean_text": "Oneok, Inc. () ONE-oak, stylized as ONEOK, is an American oil and gas midstream operator headquartered in Tulsa, Oklahoma. It provides the oil and gas industry with gathering, processing, fractionation, transportation, and storage services. The company is part of the Fortune 500 and S&P 500. Oneok was founded as Oklahoma Natural Gas Company in 1906, but it changed its corporate name to Oneok in 1980. History Oklahoma Natural Gas Company was founded on October 12, 1906 by businessmen Dennis T. Flynn and Charles B. Ames. During the spring and fall of 1907, the company built a gas pipeline from Osage County to Sapulpa and Oklahoma City. On December 28, 1907 (shortly after Oklahoma officially became a state in November), the $1.7 million project was completed. In 1910, the company built the first compressor station in the state of Oklahoma. By 1919, the Oklahoma Natural Gas Company supplied gas to thirty-seven communities in Oklahoma across more than one thousand miles of line. The company had grown to 600 employees and maintained 6,600 miles of pipeline by 1956. In December 1980 Oklahoma Natural Gas Company's board of directors changed the company's name to Oneok Inc. Also at that time the gas service part of the company was made into a separate division, retaining the name of Oklahoma Natural Gas. In 1996, Oneok acquired Western Resources' natural gas pipeline and plants for $660 million in stock. From the acquisition, Oneok acquired roughly 1,575 Western Resources employees as well as the 624,000 customers in Kansas and 36,000 customers in northeast Oklahoma. In 1999, Oneok agreed to acquire Southwest Gas, a Las Vegas based natural gas company, for $1.8 billion. In January 2000, Oneok terminated the pending merger of the two companies, and Southwest Gas filed a lawsuit against Oneok. Judge Roslyn O. Silver dismissed two of the cases against Oneok in June 2001, and Oneok agreed to pay Southern Union $3 million to settle the remaining case. In October 2002, Oneok acquired the Texas division and assets of Southern Union Gas for $420 million. Oneok renamed the company to Texas Gas Service when the acquisition was completed. In September 2004, Oneok acquired Northern Plains Natural Gas Co. for $175 million. The deal also gave Oneok a controlling interest in Northern Border Partners, which had a master limited partnership on 6,600 miles of pipeline, five natural gas processing plants, and two fractional plants. In July 2013, Oneok spun off its natural gas distribution businesses, including Oklahoma Natural Gas Co., Kansas Gas Service, and Texas Gas Service, into a separate company named One Gas. In November 2021, Oneok resumed construction of its natural gas processing facility Demicks Lake III plant in McKenzie County, North Dakota which was originally delayed due to the COVID-19 pandemic. The Demicks Lake III plant was later completed and began operations in February 2023. In July 2022, a Oneok gas plant in Medford, Oklahoma exploded, causing no injuries but temporarily expelling roughly 1,000 residents from their homes. In January 2023, Oneok reached an insurance settlement payment of $930 million and the company announced plans to transition gas fractionation operations away from the Medford plant. In September 2023, Oneok acquired Magellan Midstream Partners for $18.8 billion. Included in the acquisition for Oneok was the Magellan-owned East Houston terminal and crude oil trading hub, facilities in Galena Park, Texas and Seabrook, Texas, and a terminal in Pasadena, Texas. In May 2024, Oneok agreed to acquire Gulf Coast NGL Pipelines from Easton Energy for $280 million. The deal included 450 miles of pipelines located in Texas and the Louisiana Gulf Coast. In November, Oneok agreed to divest three of its pipelines—Guardian Pipeline, Midwestern Gas Transmission and Viking Gas Transmission—to DT Midstream for $1.2 billion. The company expanded its operations in the Permian Basin through two acquisitions in late 2024. ONEOK acquired Medallion Midstream, a crude oil gathering and transportation company and a controlling stake in EnLink Midstream, an oil and natural gas infrastructure company. In February 2025, the company completed acquisition of the remaining shares in EnLink Midstream. The company continued expansion into the Permian Basin in May 2025, when it gained full ownership of the Delaware Basin JV, which it previously operated as a joint venture with NGP XI Midstream Holdings. Through the acquisition Oneok gained operational control of infrastructure used to collect and process natural gas in the Delaware Basin that has a processing capacity of around 700 million cubic feet per day. Operations Oneok has four business segments: natural gas liquids, natural gas gathering and processing, natural gas pipelines, and refined products and crude oil. Some of the pipelines Oneok operates include the Northern Border Pipeline, the Roadrunner Gas Transmission Pipeline, the Arbuckle Pipeline, and the Elk Creek Pipeline. Magellan Midstream Partners operates as a subsidiary of Oneok and owns approximately 2,200 miles of crude pipelines, and the 450-mile Longhorn pipeline, which transports roughly 275,000 barrels per day of crude oil from the Permian Basin to storage and refining facilities in Houston."
}