{
  "ticker": "OMC",
  "cik": "0000029989",
  "company_name": "Omnicom Group",
  "corrected_name": "Omnicom Group",
  "wiki_title_used": "Omnicom Group",
  "exists": true,
  "raw_text": "Omnicom Group Inc. is an American global media, marketing, and corporate communications holding company, headquartered in New York City.\nOmnicom's branded networks and specialty firms provide services in four disciplines: advertising, customer relationship management (CRM), public relations, and specialty services. The services included in these disciplines are media planning and buying, digital and interactive marketing, sports and events marketing, field marketing, and brand consultancy. \nOmnicom Group serves as the parent company of Omnicom Media Group, comprising three agencies, OMD, PHD, and Hearts & Science, as well as three global advertising agency networks: BBDO, DDB, and TBWA. Omnicom Group also manages Flywheel, DAS Group of Companies (comprising the Health Group, the Precision Marketing Group, the Commerce Group, and the Advertising Collective), and the Communications Consultancy Network.\nIn 2014, Omnicom was considered the second largest advertising holding company by The Wall Street Journal. As of 2024, the company employs around 74,900 employees globally.\n\nHistory\nIn 1986, Allen Rosenshine, Keith Reinhard, and John Bernbach (son of William Bernbach) co-created Omnicom in a three-way merger of BBDO Worldwide, Doyle Dane Bernbach, and Needham Harper Worldwide. In 1989, Rosenshine stepped down as chairman of Omnicom to return to his role running BBDO Worldwide, and Bruce Crawford (who had preceded Rosenshine as CEO of BBDO before leaving to run the Metropolitan Opera in 1985)\nwas named chairman of Omnicom. In 1997, John Wren, the number two executive at Omnicom, became the company's chief executive officer, while Crawford remained as chairman.\nIn July 2013, it was announced that Publicis Groupe and Omnicom Group would merge to form Publicis Omnicom Group. However, in May 2014, it was announced that the deal had fallen through and the Publicis-Omnicom merger would not happen.\nBy 2014, Omnicom was the second-largest agency holding company and had revenue of over $15 billion. Omnicom launched Omniwomen in April 2014 with the goal of  increasing the number and influence of female leaders within the organization. Omniwomen has more than 10 branches in the US, UK, Canada, France, Germany, China, and the UAE.\nIn July 2017, Omnicom announced that Gracia Martore, former President and CEO of TEGNA Inc., had joined its Board as an independent director. Her appointment brought the total to 13 directors, 11 of which were independent. In February 2018, Ronnie S. Hawkins was appointed to the company's board as an independent director, bringing the total to 14 members, 12 of which were independent. In May 2018, Omnicom Group brought its language strategy agency, maslansky + partners, to Australia.\nIn November 2021, Daryl Simm was promoted to president and COO. The next month, Florian Adamski was announced as the next CEO of Omnicom Media Group, after previously working as CEO at OMD Worldwide.\nIn October 2023, Omnicom acquired E-Commerce company, Flywheel Digital for $835 million. Flywheel was previously a subsidiary of U.K.-based Ascential.\nIn December 2024, Omnicom Group and Interpublic Group (IPG) announced advanced merger discussions. On the New York Stock Exchange, the new firm would keep the Omnicom name and trade as \"OMC,\" with John Wren as chairman and CEO of Omnicom and Phil Angelastro as chief financial officer and executive vice president. In June 2025, the FTC approved Omnicom's acquisition of Interpublic for $13.5 billion, however, the agencies had to agree not to prevent political-based ads. The merger was completed on November 26, 2025.\n\nOperations\nOmnicom is composed of five major agency networks that oversee 1500+ agencies as parent companies. The networks are BBDO Worldwide, Diversified Agency Services (DAS), DDB Worldwide, Omnicom Media Group (OMG), and TBWA Worldwide.\nBBDO Worldwide, one of the companies present from the initial merger, is a creative agency which has been recognized as one of the most creative networks in the world. Founded in 2000, Proximity Worldwide is BBDO's digitally focused marketing arm. In January 2016, BBDO Worldwide acquired a majority stake in Wednesday Agency Group. At the 2017 Cannes Lions International Festival of Creativity, BBDO Worldwide was awarded Network of the Year for the sixth time. Clemenger BBDO Melbourne was named Agency of the Year. BBDO was the top agency network featured in the 2018 WARC 100, an annual ranking of advertising and media effectiveness. In 2018, several of the BBDO agencies were ranked in the top 10 awarded individual agencies in the world by The Gunn Report.\nThe DAS Group of Companies comprises more than 200 companies focused on public relations, CRM, healthcare, events, promotional marketing, vehicle testing, branding and research. In 2016 and 2017, Omnicom formed two separate holding groups for healthcare and PR agencies: Omnicom Health Group and Omnicom Precision Marketing Group. Later in 2016, Omnicom Health Group acquired majority stakes in Biopharm Communications and Rabin Martin. In 2018, Omnicom Health Group acquired Snow Companies a patient engagement communications agency. Also in 2018, Omnicom Precision Marketing Group acquired a majority stake in Credera.\nDDB Worldwide, one of the three initial companies, is a global advertising network. In November 2015, DDB Worldwide acquired Grupo ABC, the largest advertising group in Brazil. In June 2016, DDB Health was launched as a combination of healthcare-focused advertising agencies, which added medical and healthcare brand services to DDB's profile. Some of the businesses included in the DDB Worldwide unit are Tribal Worldwide, TracyLocke, adam&eveDDB, Roberts + Langer, Spike DDB, Rodgers Townsend, ONC Worldwide, Alma and Uproar!@DDB.\nOmnicom Media Group is the media division of the Omnicom Group Inc. In 2017, three Omnicom Media Group agency networks competed at the Cannes Lions International Festival of Creativity, including OMD Worldwide, which was named Media Network of the Year.\nTBWA is a global agency network, normally billed as 'The Disruption Company'. It was purchased in 1993 and then merged with the Chiat Day firm in 1995. In the United States, some of the company's offices still retain the TBWA\\Chiat\\Day name. Companies operating under the TBWA network include, Media Arts Lab, Digital Arts Network (DAN), Lucky Generals, Designory, NEBOKO, and other TBWA branded regional agencies.\n\nSee also\nHistory of advertising\n\nReferences\nFurther reading\n\"Omnicom Group, Inc.\". International Directory of Company Histories. Vol. 1. St. James Press. 1988. pp. 28–32. ISBN 0-912289-10-4.\n\nExternal links\nOfficial website\nBusiness data for Omnicom Group:",
  "clean_text": "Omnicom Group Inc. is an American global media, marketing, and corporate communications holding company, headquartered in New York City. Omnicom's branded networks and specialty firms provide services in four disciplines: advertising, customer relationship management (CRM), public relations, and specialty services. The services included in these disciplines are media planning and buying, digital and interactive marketing, sports and events marketing, field marketing, and brand consultancy. Omnicom Group serves as the parent company of Omnicom Media Group, comprising three agencies, OMD, PHD, and Hearts & Science, as well as three global advertising agency networks: BBDO, DDB, and TBWA. Omnicom Group also manages Flywheel, DAS Group of Companies (comprising the Health Group, the Precision Marketing Group, the Commerce Group, and the Advertising Collective), and the Communications Consultancy Network. In 2014, Omnicom was considered the second largest advertising holding company by The Wall Street Journal. As of 2024, the company employs around 74,900 employees globally. History In 1986, Allen Rosenshine, Keith Reinhard, and John Bernbach (son of William Bernbach) co-created Omnicom in a three-way merger of BBDO Worldwide, Doyle Dane Bernbach, and Needham Harper Worldwide. In 1989, Rosenshine stepped down as chairman of Omnicom to return to his role running BBDO Worldwide, and Bruce Crawford (who had preceded Rosenshine as CEO of BBDO before leaving to run the Metropolitan Opera in 1985) was named chairman of Omnicom. In 1997, John Wren, the number two executive at Omnicom, became the company's chief executive officer, while Crawford remained as chairman. In July 2013, it was announced that Publicis Groupe and Omnicom Group would merge to form Publicis Omnicom Group. However, in May 2014, it was announced that the deal had fallen through and the Publicis-Omnicom merger would not happen. By 2014, Omnicom was the second-largest agency holding company and had revenue of over $15 billion. Omnicom launched Omniwomen in April 2014 with the goal of increasing the number and influence of female leaders within the organization. Omniwomen has more than 10 branches in the US, UK, Canada, France, Germany, China, and the UAE. In July 2017, Omnicom announced that Gracia Martore, former President and CEO of TEGNA Inc., had joined its Board as an independent director. Her appointment brought the total to 13 directors, 11 of which were independent. In February 2018, Ronnie S. Hawkins was appointed to the company's board as an independent director, bringing the total to 14 members, 12 of which were independent. In May 2018, Omnicom Group brought its language strategy agency, maslansky + partners, to Australia. In November 2021, Daryl Simm was promoted to president and COO. The next month, Florian Adamski was announced as the next CEO of Omnicom Media Group, after previously working as CEO at OMD Worldwide. In October 2023, Omnicom acquired E-Commerce company, Flywheel Digital for $835 million. Flywheel was previously a subsidiary of U.K.-based Ascential. In December 2024, Omnicom Group and Interpublic Group (IPG) announced advanced merger discussions. On the New York Stock Exchange, the new firm would keep the Omnicom name and trade as \"OMC,\" with John Wren as chairman and CEO of Omnicom and Phil Angelastro as chief financial officer and executive vice president. In June 2025, the FTC approved Omnicom's acquisition of Interpublic for $13.5 billion, however, the agencies had to agree not to prevent political-based ads. The merger was completed on November 26, 2025. Operations Omnicom is composed of five major agency networks that oversee 1500+ agencies as parent companies. The networks are BBDO Worldwide, Diversified Agency Services (DAS), DDB Worldwide, Omnicom Media Group (OMG), and TBWA Worldwide. BBDO Worldwide, one of the companies present from the initial merger, is a creative agency which has been recognized as one of the most creative networks in the world. Founded in 2000, Proximity Worldwide is BBDO's digitally focused marketing arm. In January 2016, BBDO Worldwide acquired a majority stake in Wednesday Agency Group. At the 2017 Cannes Lions International Festival of Creativity, BBDO Worldwide was awarded Network of the Year for the sixth time. Clemenger BBDO Melbourne was named Agency of the Year. BBDO was the top agency network featured in the 2018 WARC 100, an annual ranking of advertising and media effectiveness. In 2018, several of the BBDO agencies were ranked in the top 10 awarded individual agencies in the world by The Gunn Report. The DAS Group of Companies comprises more than 200 companies focused on public relations, CRM, healthcare, events, promotional marketing, vehicle testing, branding and research. In 2016 and 2017, Omnicom formed two separate holding groups for healthcare and PR agencies: Omnicom Health Group and Omnicom Precision Marketing Group. Later in 2016, Omnicom Health Group acquired majority stakes in Biopharm Communications and Rabin Martin. In 2018, Omnicom Health Group acquired Snow Companies a patient engagement communications agency. Also in 2018, Omnicom Precision Marketing Group acquired a majority stake in Credera. DDB Worldwide, one of the three initial companies, is a global advertising network. In November 2015, DDB Worldwide acquired Grupo ABC, the largest advertising group in Brazil. In June 2016, DDB Health was launched as a combination of healthcare-focused advertising agencies, which added medical and healthcare brand services to DDB's profile. Some of the businesses included in the DDB Worldwide unit are Tribal Worldwide, TracyLocke, adam&eveDDB, Roberts + Langer, Spike DDB, Rodgers Townsend, ONC Worldwide, Alma and Uproar!@DDB. Omnicom Media Group is the media division of the Omnicom Group Inc. In 2017, three Omnicom Media Group agency networks competed at the Cannes Lions International Festival of Creativity, including OMD Worldwide, which was named Media Network of the Year. TBWA is a global agency network, normally billed as 'The Disruption Company'. It was purchased in 1993 and then merged with the Chiat Day firm in 1995. In the United States, some of the company's offices still retain the TBWA\\Chiat\\Day name. Companies operating under the TBWA network include, Media Arts Lab, Digital Arts Network (DAN), Lucky Generals, Designory, NEBOKO, and other TBWA branded regional agencies."
}