{
  "ticker": "ON",
  "cik": "0001097864",
  "company_name": "ON Semiconductor",
  "corrected_name": "ON Semiconductor",
  "wiki_title_used": "ON Semiconductor",
  "exists": true,
  "raw_text": "ON Semiconductor Corporation (stylized and doing business as onsemi) is an American semiconductor supplier company, based in Scottsdale, Arizona. Products include power and signal management, logic, discrete, and custom devices for automotive, communications, computing, consumer, industrial, LED lighting, medical, military/aerospace and power applications. onsemi runs a network of manufacturing facilities, sales offices and design centers in North America, Europe, and the Asia Pacific regions. Based on its 2016 revenues of $3.907 billion, onsemi ranked among the worldwide top 20 semiconductor sales leaders, and was ranked No. 483 on the 2022 Fortune 500 based on its 2021 sales.\n\nHistory\nThe company was founded in 1999. It was originally a spinoff of Motorola's Semiconductor Components Group headquartered in Phoenix, Arizona. It continues to manufacture Motorola's discrete, standard analog, and standard logic devices. On April 28, 2000, Onsemi launched its initial public offering (IPO).\nSteve Hanson was the first president and chief executive officer of the company until 2002. Keith Jackson from Fairchild Semiconductor replaced Hanson as the second leader for the next 20 years.\nMajor acquisitions added SANYO Semiconductor in 2011 and Fairchild Semiconductor in 2016, with total workforce over 30,000 and expanded its product portfolio.\nIn April 2019, the company signed the UN Global Compact.\nIn September 2020, chief executive officer Keith Jackson announced his retirement from the company. In December 2020, Hassane El-Khoury, previously the president and chief executive officer of Cypress Semiconductor, succeeded Jackson.\nIn August 2021, to better reflect its broad technology portfolio, differentiated product lines, and market leadership, ON Semiconductor rebranded itself as onsemi.\nIn February 2022, it was announced that BelGaN Group BV had completed the acquisition of all shares of ON Semiconductor Belgium BV from the onsemi group.\nAs of March 1, 2023, onsemi's headquarters was located in Scottsdale, Arizona.\n\nAcquisitions\n2000s\nIn April 2000, onsemi completed the acquisition of Cherry Semiconductor Corp. (CSC) for $250 million.  CSC was founded in 1972 as Micro Components Corporation (MCC). CSC was headquartered in East Greenwich, Rhode Island, USA.\nIn 2003, onsemi acquired TESLA SEZAM (manufacturer of semiconductor chips) and TEROSIL (production of silicon) in the Czech Republic. Both of these companies were the successors of the former state-owned company TESLA.\nIn May 2006, onsemi completed the acquisition of LSI Logic Gresham, Oregon Design & Manufacturing Facility.\nIn January 2008, onsemi completed the acquisition of the CPU Voltage and PC Thermal Monitoring Business from Analog Devices, Inc., for $184 million.\nIn December 2008, onsemi completed the acquisition of AMI Semiconductor (previously known as American Microsystems) for $915 million.\nOn July 17, 2008, onsemi and Catalyst Semiconductor, Inc. announced the acquisition of Catalyst Semiconductor, Inc. by onsemi for $115 million. On October 9, 2008, Catalyst Semiconductor, Inc. announced the approval of the acquisition. On October 10, 2008, onsemi announced the completion of the acquisition.\nIn November 2009, onsemi completed the acquisition of PulseCore Semiconductor for $17 million.\nIn December 2009, onsemi announced the acquisition of California Micro Devices.\n\n2010s\nIn June 2010, onsemi completed the acquisition of Sound Design Technologies, Ltd., for $22 million.\nIn January 2011, onsemi completed the acquisition of SANYO Semiconductor.\nIn February 2011, onsemi completed the acquisition of the CMOS Image Sensor Business Unit from Cypress Semiconductor, for $31.4 million.\nIn May 2014, onsemi completed the acquisition of Truesense Imaging, Inc.\nIn June 2014, onsemi announced a $400 million deal to acquire California-based Aptina Imaging Corp.\nIn July 2014, onsemi and Fujitsu Semiconductor announced Strategic Partnership (including foundry services agreement and the definitive agreement pursuant to which onsemi will become a 10% shareholder of Fujitsu's 8-inch wafer fab in Aizuwakamatsu, Japan)\nIn July 2015, onsemi completed the acquisition of Axsem AG.\nIn November 2015, onsemi announced the acquisition of Fairchild Semiconductor for $2.4 billion.\nIn August 2016, onsemi has entered into a definitive agreement with respect to the divestiture of the ignition IGBT business to Littelfuse and has also entered into a separate definitive agreement with Littelfuse to sell its transient voltage suppression diode and switching thyristor product lines, for a combined $104 million in cash.\nIn September 2016, onsemi completed the acquisition of Fairchild Semiconductor.\nIn March 2017, onsemi announced that it would acquire and license mmWave technology for automotive radar applications developed by IBM's Haifa, Israel, research team. It included staff, equipment, research facilities and intellectual property.\nIn May 2018, onsemi acquired Ireland-based company, SensL Technologies Ltd.\nIn June 2019, onsemi acquired Quantenna Communications, a fabless semiconductor company which was headquartered in Fremont, California with offices in India, Europe, America and Taipei, for about $1 billion. In October 2021, Bloomberg News reported that onsemi was looking to sell off Quantenna's assets. After failing to find a buyer, onsemi shut down the division in 2022.\nIn April 2019, onsemi agreed to acquire GlobalFoundries 300mm wafer fabrication facility in East Fishkill, New York. In February 2023, it was announced the acquisition had been completed.\n\n2020s\nIn August 2021 onsemi agreed to acquire GT Advanced Technologies.\nIn July 2024 onsemi completed the acquisition of SWIR Vision Systems.\nIn December 2024 onsemi announced to acquire Qorvo's Silicon Carbide JFET Business, including United Silicon Carbide Subsidiary \nIn October 2025 onsemi announced it has completed the acquisition of rights to Vcore power technologies, including associated intellectual property (IP) licenses,  from Aura Semiconductor.\n\nProducts\nonsemi manufactures products in the following areas:\n\nCustom: ASICs; Custom Foundry Services; Custom ULP Memory; Custom CMOS Image Sensors; Integrated passive devices\nDiscrete: Bipolar Transistors; Diodes & Rectifiers; IGBTs & FETs; Thyristors; Silicon Carbide (SiC)\nPower Management: AC/DC Controllers & Regulators; DC/DC Controllers, Converters, & Regulators; Drivers; Thermal Management; Voltage & Current Management\nLogic: Clock Generation; Clock & Data Distribution; Memory; Microcontrollers; Standard Logic\nSignal Management: Amplifiers & Comparators; Analog Switches; Audio/Video ASSP; Digital Potentiometers; EMI/RFI Filters; Interfaces; Optical, Image, & Touch Sensors\nIn 2013, the company introduced the industry's highest resolution optical image stabilization (OIS) integrated circuit (IC) for smartphone camera modules.\n\nCorporate responsibility\nOnsemi plans to achieve net-zero emissions by 2040. The industrial and automotive sectors, which are among the company's most important end markets, are responsible for more than 65% of global greenhouse gas emissions. This highlights the need for climate initiatives.\nIn May 2024, the company's ESG risk rating was at 20.8%.\n\nOperations\nThe company has three segments:\n\nAnalog and Mixed-Signal Group (AMG)\nIntelligent Sensing Group (ISG)\nPower Solutions Group (PSG)\n\nFacilities\nThere are several Solution Engineering Centers (SEC) and Design Centers around the world. The company established the \"onsemi Silicon Carbide Crystal Center\" at the Penn State's Materials Research Institute in 2023.\nSolution Engineering Centers are in the United States, Germany, South Korea, China, Taiwan, Japan, Slovakia, and Sweden.\nDesign centers are located in the United States, Canada, Belgium, Czech Republic, Germany, Ireland, Romania, Slovakia, Sweden, Switzerland, India, Israel, Italy, Japan, South Korea, and Taiwan.\nThe company has manufacturing facilities in Canada, the United States, the Czech Republic, China, Japan, Malaysia, South Korea, the Philippines, and Vietnam.\n\nAwards\nIn 2000, onsemi won the Forbes Advertising Excellence best in category Industrial Machinery/Electrical Components.\nonsemi won the Hot 100 Electronic products of 2009 and 2012 by EDN magazine.\nIn 2012, onsemi won the IR Magazine U.S. Awards in three fields, Best IR by a CEO or chairman for mid cap; No. 56 best company in the U.S. in terms of Investor Relations; No. 3 in Best Investor Relations in technology sector for mid/small cap companies.\nIn 2012 the company won the \"Large Company of the Year Award\" from the IEEE.\nIn 2016, 2017, 2018, 2019, 2020, 2021 and 2022, onsemi was named in World's Most Ethical Companies by Ethisphere Institute.\nThe company's subsidiary AMI Semiconductor (AMIS) has also won many awards, such as President's Award and Preferred Supplier from Rockwell Collins, Strategic Supplier Award from Emerson Rosemount, Inc., Outstanding Technical Support in New Product Development from Alliant Techsystems.\n\nSee also\nFreescale Semiconductor, another Motorola semiconductor spinoff\nList of semiconductor fabrication plants\n\nReferences\nExternal links\nOfficial website \nBusiness data for ON Semiconductor Corporation:",
  "clean_text": "ON Semiconductor Corporation (stylized and doing business as onsemi) is an American semiconductor supplier company, based in Scottsdale, Arizona. Products include power and signal management, logic, discrete, and custom devices for automotive, communications, computing, consumer, industrial, LED lighting, medical, military/aerospace and power applications. onsemi runs a network of manufacturing facilities, sales offices and design centers in North America, Europe, and the Asia Pacific regions. Based on its 2016 revenues of $3.907 billion, onsemi ranked among the worldwide top 20 semiconductor sales leaders, and was ranked No. 483 on the 2022 Fortune 500 based on its 2021 sales. History The company was founded in 1999. It was originally a spinoff of Motorola's Semiconductor Components Group headquartered in Phoenix, Arizona. It continues to manufacture Motorola's discrete, standard analog, and standard logic devices. On April 28, 2000, Onsemi launched its initial public offering (IPO). Steve Hanson was the first president and chief executive officer of the company until 2002. Keith Jackson from Fairchild Semiconductor replaced Hanson as the second leader for the next 20 years. Major acquisitions added SANYO Semiconductor in 2011 and Fairchild Semiconductor in 2016, with total workforce over 30,000 and expanded its product portfolio. In April 2019, the company signed the UN Global Compact. In September 2020, chief executive officer Keith Jackson announced his retirement from the company. In December 2020, Hassane El-Khoury, previously the president and chief executive officer of Cypress Semiconductor, succeeded Jackson. In August 2021, to better reflect its broad technology portfolio, differentiated product lines, and market leadership, ON Semiconductor rebranded itself as onsemi. In February 2022, it was announced that BelGaN Group BV had completed the acquisition of all shares of ON Semiconductor Belgium BV from the onsemi group. As of March 1, 2023, onsemi's headquarters was located in Scottsdale, Arizona. Acquisitions 2000s In April 2000, onsemi completed the acquisition of Cherry Semiconductor Corp. (CSC) for $250 million. CSC was founded in 1972 as Micro Components Corporation (MCC). CSC was headquartered in East Greenwich, Rhode Island, USA. In 2003, onsemi acquired TESLA SEZAM (manufacturer of semiconductor chips) and TEROSIL (production of silicon) in the Czech Republic. Both of these companies were the successors of the former state-owned company TESLA. In May 2006, onsemi completed the acquisition of LSI Logic Gresham, Oregon Design & Manufacturing Facility. In January 2008, onsemi completed the acquisition of the CPU Voltage and PC Thermal Monitoring Business from Analog Devices, Inc., for $184 million. In December 2008, onsemi completed the acquisition of AMI Semiconductor (previously known as American Microsystems) for $915 million. On July 17, 2008, onsemi and Catalyst Semiconductor, Inc. announced the acquisition of Catalyst Semiconductor, Inc. by onsemi for $115 million. On October 9, 2008, Catalyst Semiconductor, Inc. announced the approval of the acquisition. On October 10, 2008, onsemi announced the completion of the acquisition. In November 2009, onsemi completed the acquisition of PulseCore Semiconductor for $17 million. In December 2009, onsemi announced the acquisition of California Micro Devices. 2010s In June 2010, onsemi completed the acquisition of Sound Design Technologies, Ltd., for $22 million. In January 2011, onsemi completed the acquisition of SANYO Semiconductor. In February 2011, onsemi completed the acquisition of the CMOS Image Sensor Business Unit from Cypress Semiconductor, for $31.4 million. In May 2014, onsemi completed the acquisition of Truesense Imaging, Inc. In June 2014, onsemi announced a $400 million deal to acquire California-based Aptina Imaging Corp. In July 2014, onsemi and Fujitsu Semiconductor announced Strategic Partnership (including foundry services agreement and the definitive agreement pursuant to which onsemi will become a 10% shareholder of Fujitsu's 8-inch wafer fab in Aizuwakamatsu, Japan) In July 2015, onsemi completed the acquisition of Axsem AG. In November 2015, onsemi announced the acquisition of Fairchild Semiconductor for $2.4 billion. In August 2016, onsemi has entered into a definitive agreement with respect to the divestiture of the ignition IGBT business to Littelfuse and has also entered into a separate definitive agreement with Littelfuse to sell its transient voltage suppression diode and switching thyristor product lines, for a combined $104 million in cash. In September 2016, onsemi completed the acquisition of Fairchild Semiconductor. In March 2017, onsemi announced that it would acquire and license mmWave technology for automotive radar applications developed by IBM's Haifa, Israel, research team. It included staff, equipment, research facilities and intellectual property. In May 2018, onsemi acquired Ireland-based company, SensL Technologies Ltd. In June 2019, onsemi acquired Quantenna Communications, a fabless semiconductor company which was headquartered in Fremont, California with offices in India, Europe, America and Taipei, for about $1 billion. In October 2021, Bloomberg News reported that onsemi was looking to sell off Quantenna's assets. After failing to find a buyer, onsemi shut down the division in 2022. In April 2019, onsemi agreed to acquire GlobalFoundries 300mm wafer fabrication facility in East Fishkill, New York. In February 2023, it was announced the acquisition had been completed. 2020s In August 2021 onsemi agreed to acquire GT Advanced Technologies. In July 2024 onsemi completed the acquisition of SWIR Vision Systems. In December 2024 onsemi announced to acquire Qorvo's Silicon Carbide JFET Business, including United Silicon Carbide Subsidiary In October 2025 onsemi announced it has completed the acquisition of rights to Vcore power technologies, including associated intellectual property (IP) licenses, from Aura Semiconductor. Products onsemi manufactures products in the following areas: Custom: ASICs; Custom Foundry Services; Custom ULP Memory; Custom CMOS Image Sensors; Integrated passive devices Discrete: Bipolar Transistors; Diodes & Rectifiers; IGBTs & FETs; Thyristors; Silicon Carbide (SiC) Power Management: AC/DC Controllers & Regulators; DC/DC Controllers, Converters, & Regulators; Drivers; Thermal Management; Voltage & Current Management Logic: Clock Generation; Clock & Data Distribution; Memory; Microcontrollers; Standard Logic Signal Management: Amplifiers & Comparators; Analog Switches; Audio/Video ASSP; Digital Potentiometers; EMI/RFI Filters; Interfaces; Optical, Image, & Touch Sensors In 2013, the company introduced the industry's highest resolution optical image stabilization (OIS) integrated circuit (IC) for smartphone camera modules. Corporate responsibility Onsemi plans to achieve net-zero emissions by 2040. The industrial and automotive sectors, which are among the company's most important end markets, are responsible for more than 65% of global greenhouse gas emissions. This highlights the need for climate initiatives. In May 2024, the company's ESG risk rating was at 20.8%. Operations The company has three segments: Analog and Mixed-Signal Group (AMG) Intelligent Sensing Group (ISG) Power Solutions Group (PSG) Facilities There are several Solution Engineering Centers (SEC) and Design Centers around the world. The company established the \"onsemi Silicon Carbide Crystal Center\" at the Penn State's Materials Research Institute in 2023. Solution Engineering Centers are in the United States, Germany, South Korea, China, Taiwan, Japan, Slovakia, and Sweden. Design centers are located in the United States, Canada, Belgium, Czech Republic, Germany, Ireland, Romania, Slovakia, Sweden, Switzerland, India, Israel, Italy, Japan, South Korea, and Taiwan. The company has manufacturing facilities in Canada, the United States, the Czech Republic, China, Japan, Malaysia, South Korea, the Philippines, and Vietnam. Awards In 2000, onsemi won the Forbes Advertising Excellence best in category Industrial Machinery/Electrical Components. onsemi won the Hot 100 Electronic products of 2009 and 2012 by EDN magazine. In 2012, onsemi won the IR Magazine U.S. Awards in three fields, Best IR by a CEO or chairman for mid cap; No. 56 best company in the U.S. in terms of Investor Relations; No. 3 in Best Investor Relations in technology sector for mid/small cap companies. In 2012 the company won the \"Large Company of the Year Award\" from the IEEE. In 2016, 2017, 2018, 2019, 2020, 2021 and 2022, onsemi was named in World's Most Ethical Companies by Ethisphere Institute. The company's subsidiary AMI Semiconductor (AMIS) has also won many awards, such as President's Award and Preferred Supplier from Rockwell Collins, Strategic Supplier Award from Emerson Rosemount, Inc., Outstanding Technical Support in New Product Development from Alliant Techsystems."
}