{
  "ticker": "ORLY",
  "cik": "0000898173",
  "company_name": "O’Reilly Automotive",
  "corrected_name": "O'Reilly Auto Parts",
  "wiki_title_used": "O'Reilly Auto Parts",
  "exists": true,
  "raw_text": "O'Reilly Automotive, Inc., doing business as O'Reilly Auto Parts, is an American automotive part retailer that provides automotive parts, tools, supplies, equipment, and accessories to professional service providers and do-it-yourself customers. Founded in 1957 by the O’Reilly family, O'Reilly Auto Parts operates more than 6,400 stores in 48 states, Puerto Rico, Mexico, and Canada.\n\nCompany history\nMichael Byrne O’Reilly immigrated from Ireland to America in 1849. Settling in St. Louis, he worked his way through school to earn a law degree, and then pursued a career as a title examiner. His son, Charles Francis O’Reilly, attended college in St. Louis and went to work in 1914 as a traveling salesman for Fred Campbell Auto Supply in St. Louis. By 1924, Charles had become familiar with the Springfield area, having traveled by train to sell auto parts throughout the territory. By 1932, he had become manager of Link Motor Supply in Springfield, and one of his sons, Charles H. (Chub) O’Reilly, joined the company. Together they helped make Link Motor Supply the predominant auto parts store in the area. \nIn 1957, Link planned a reorganization, which included the retirement of 72-year-old Charles F. O’Reilly, and the transfer of Chub O’Reilly to Kansas City.  The two made the decision to form their own company, O’Reilly Automotive, Inc. They opened for business in Springfield, Missouri on December 2, 1957, with one store and 13 employees. Their sales totaled $700,000 in 1958, their first full year of business. By 1961, O'Reilly's volume had reached $1.3 million in combined sales volume of O’Reilly Automotive and their Ozark Automotive Distributors, a division formed to serve independent automotive jobbers in the area. In March 1975, annual sales volume rose to $7 million, and a 52,000 square-foot facility was built for the O’Reilly/Ozark warehouse operation. By that time, O'Reilly Auto Parts had nine stores, all located in southwestern Missouri. \nOn April 23, 1993, O'Reilly Auto Parts completed an initial public stock offering, with shares trading on the NASDAQ market under the symbol ORLY. O'Reilly offers a stock purchase plan to employees in order to enable as many full-time team members as possible stock ownership in O'Reilly automotive. On January 30, 1998, O'Reilly Auto Parts merged with Hi/LO Auto Supply, adding 182 auto parts stores in Texas and Louisiana, as well as a distribution center in Houston. The Hi/LO acquisition made O’Reilly one of the top 10 auto parts chains in the country. \nOn April 25, 2000, the firm announced the purchase of KarPro Auto Parts, which included a 66,000 square-foot distribution center in Little Rock, Arkansas, and 14 KarPro stores. On October 1, 2001, O'Reilly Auto Parts purchased Mid-State Automotive Distributors, Inc., adding 82 additional auto parts stores in seven states, as well as two distribution centers. The acquisition made the firm one of the top five auto parts chains in the country. It added its twelfth distribution center in Atlanta, Georgia in March 2005. \nOn May 31, 2005, O'Reilly Auto Parts purchased Midwest Automotive Distributors, Inc., adding 72 retail locations in Minnesota, Montana, North Dakota, South Dakota, Wisconsin, and Wyoming, as well as two distribution centers located in Minnesota and Montana. On July 11, 2008, O'Reilly Auto Parts completed the largest acquisition in its history with the purchase of CSK Auto, adding 1,273 stores in 12 states. This, combined with past acquisitions, made O’Reilly Auto Parts the third largest auto parts chain in the country after Advance Auto Parts and AutoZone. \nIn December 2012, O'Reilly Auto Parts announced it was purchasing the auto parts business of VIP Parts, Tires and Service, a Lewiston, Maine-based chain of 56 auto parts stores and service centers with locations in Maine, New Hampshire, and Massachusetts, and one distribution center in Maine. The purchase marked the firm's expansion into New England. In August 2016, O'Reilly Auto Parts entered the Pittsburgh market with the acquisition of the five-store Frank's Auto Supermarket chain. On October 26, 2016, O'Reilly Auto Parts announced that it was acquiring Bond Auto Parts, a 51-store chain headquartered in Vermont with locations in New Hampshire, Massachusetts, and New York as well. On November 13, 2018, O'Reilly Auto Parts announced that it was acquiring Florida-based Bennett Auto Supply, a 33-store chain headquartered in Pompano Beach. \nOn August 20, 2019, O'Reilly Auto Parts announced it would acquire Mexico's Mayasa Auto Parts. This marked O' Reilly's first venture into international markets. Mayasa had five distribution centers, 20 company stores, and more than 2000 independent jobber locations throughout Mexico. In December 2023, O'Reilly Auto Parts rebranded its stores in Mexico to O'Reilly Autopartes. In May 2023, O’Reilly Auto Parts expanded into Puerto Rico, opening its first distribution center and two retail stores in Hatillo and Bayamón. In July 2023, O'Reilly Auto Parts opened its first new distribution center in Guadalajara, Mexico. O'Reilly Auto Parts had been operating in Mexico since the end of 2019, when it completed the acquisition of Mexico-based Mayasa Auto Parts and its 21 ORMA-branded parts stores. Then, in December 2023, O'Reilly Auto Parts rebranded all of its more than 60 stores in Mexico to O'Reilly Autopartes. \nOn December 18, 2023, O'Reilly Auto Parts announced it was acquiring Groupe Del Vasto, which does business as Vast-Auto and is headquartered in Montreal, Canada. This marked O'Reilly's entrance into the Canadian market. Vast-Auto operated two distribution centers and six satellite warehouses that supported a network of 23 company-owned stores, hundreds of strategic independent partners, as well as a widespread service reach that extended to thousands of other independent jobber and professional customers across Eastern Canada.\n\nCorporate affairs\nAs of March 2025, O'Reilly Auto Parts operates more than 6,400 stores in 48 U.S. states, Mexico, Puerto Rico and Canada.\n\nJingle\nO'Reilly is known for its catchy jingle. The jingle was made by John Dillon, a founding member of The Ozark Mountain Daredevils, a rock band based in Springfield, MO.\n\nHeadquarters\nSince 2010, O'Reilly Auto Parts has been headquartered in a 117,000 square feet (10,900 m2) building in Springfield, Missouri. Construction began on this building in 2009 to accommodate the increase in corporate staff from the purchase of CSK Auto Corp.\n\nNASCAR sponsorship\nO'Reilly will sponsor the NASCAR Xfinity Series, replacing company Xfinity. They previously sponsored the NASCAR Cup Series' O'Reilly Auto Parts 500 (from 2017–2020), the Xfinity Series' O'Reilly Auto Parts 300 (from 2002–2020 with various name changes with O'Reilly), and the NASCAR Craftsman Truck Series O'Reilly 400 (from 1999–2004) at Texas Motor Speedway and the Cup Series' O'Reilly Auto Parts 253, the Xfinity Series' Super Start Batteries 188, and the Truck Series BrakeBest Select 159 at the Daytona International Speedway Road Course, all held from 2020–2021.\n\nSee also\nCarquest\nNational Automotive Parts Association (NAPA)\nAutoZone\nAdvance Auto Parts\n\nReferences\nBibliography\nNaples, Gary, J. (2000). Beyond the Numbers: Managing the Assets of An Automobile Parts Business. SAE International. pp. 39–40. ISBN 0-7680-0122-6.{{cite book}}:  CS1 maint: multiple names: authors list (link)\nPlunkett, Jack W. (2005). Plunkett's Retail Industry Almanac 2006: The Only Complete Reference To The Retail Industry. Plunkett Research. p. 10. ISBN 1-59392-055-5.\n\nExternal links\nOfficial website\nBusiness data for O'Reilly Auto Parts:",
  "clean_text": "O'Reilly Automotive, Inc., doing business as O'Reilly Auto Parts, is an American automotive part retailer that provides automotive parts, tools, supplies, equipment, and accessories to professional service providers and do-it-yourself customers. Founded in 1957 by the O’Reilly family, O'Reilly Auto Parts operates more than 6,400 stores in 48 states, Puerto Rico, Mexico, and Canada. Company history Michael Byrne O’Reilly immigrated from Ireland to America in 1849. Settling in St. Louis, he worked his way through school to earn a law degree, and then pursued a career as a title examiner. His son, Charles Francis O’Reilly, attended college in St. Louis and went to work in 1914 as a traveling salesman for Fred Campbell Auto Supply in St. Louis. By 1924, Charles had become familiar with the Springfield area, having traveled by train to sell auto parts throughout the territory. By 1932, he had become manager of Link Motor Supply in Springfield, and one of his sons, Charles H. (Chub) O’Reilly, joined the company. Together they helped make Link Motor Supply the predominant auto parts store in the area. In 1957, Link planned a reorganization, which included the retirement of 72-year-old Charles F. O’Reilly, and the transfer of Chub O’Reilly to Kansas City. The two made the decision to form their own company, O’Reilly Automotive, Inc. They opened for business in Springfield, Missouri on December 2, 1957, with one store and 13 employees. Their sales totaled $700,000 in 1958, their first full year of business. By 1961, O'Reilly's volume had reached $1.3 million in combined sales volume of O’Reilly Automotive and their Ozark Automotive Distributors, a division formed to serve independent automotive jobbers in the area. In March 1975, annual sales volume rose to $7 million, and a 52,000 square-foot facility was built for the O’Reilly/Ozark warehouse operation. By that time, O'Reilly Auto Parts had nine stores, all located in southwestern Missouri. On April 23, 1993, O'Reilly Auto Parts completed an initial public stock offering, with shares trading on the NASDAQ market under the symbol ORLY. O'Reilly offers a stock purchase plan to employees in order to enable as many full-time team members as possible stock ownership in O'Reilly automotive. On January 30, 1998, O'Reilly Auto Parts merged with Hi/LO Auto Supply, adding 182 auto parts stores in Texas and Louisiana, as well as a distribution center in Houston. The Hi/LO acquisition made O’Reilly one of the top 10 auto parts chains in the country. On April 25, 2000, the firm announced the purchase of KarPro Auto Parts, which included a 66,000 square-foot distribution center in Little Rock, Arkansas, and 14 KarPro stores. On October 1, 2001, O'Reilly Auto Parts purchased Mid-State Automotive Distributors, Inc., adding 82 additional auto parts stores in seven states, as well as two distribution centers. The acquisition made the firm one of the top five auto parts chains in the country. It added its twelfth distribution center in Atlanta, Georgia in March 2005. On May 31, 2005, O'Reilly Auto Parts purchased Midwest Automotive Distributors, Inc., adding 72 retail locations in Minnesota, Montana, North Dakota, South Dakota, Wisconsin, and Wyoming, as well as two distribution centers located in Minnesota and Montana. On July 11, 2008, O'Reilly Auto Parts completed the largest acquisition in its history with the purchase of CSK Auto, adding 1,273 stores in 12 states. This, combined with past acquisitions, made O’Reilly Auto Parts the third largest auto parts chain in the country after Advance Auto Parts and AutoZone. In December 2012, O'Reilly Auto Parts announced it was purchasing the auto parts business of VIP Parts, Tires and Service, a Lewiston, Maine-based chain of 56 auto parts stores and service centers with locations in Maine, New Hampshire, and Massachusetts, and one distribution center in Maine. The purchase marked the firm's expansion into New England. In August 2016, O'Reilly Auto Parts entered the Pittsburgh market with the acquisition of the five-store Frank's Auto Supermarket chain. On October 26, 2016, O'Reilly Auto Parts announced that it was acquiring Bond Auto Parts, a 51-store chain headquartered in Vermont with locations in New Hampshire, Massachusetts, and New York as well. On November 13, 2018, O'Reilly Auto Parts announced that it was acquiring Florida-based Bennett Auto Supply, a 33-store chain headquartered in Pompano Beach. On August 20, 2019, O'Reilly Auto Parts announced it would acquire Mexico's Mayasa Auto Parts. This marked O' Reilly's first venture into international markets. Mayasa had five distribution centers, 20 company stores, and more than 2000 independent jobber locations throughout Mexico. In December 2023, O'Reilly Auto Parts rebranded its stores in Mexico to O'Reilly Autopartes. In May 2023, O’Reilly Auto Parts expanded into Puerto Rico, opening its first distribution center and two retail stores in Hatillo and Bayamón. In July 2023, O'Reilly Auto Parts opened its first new distribution center in Guadalajara, Mexico. O'Reilly Auto Parts had been operating in Mexico since the end of 2019, when it completed the acquisition of Mexico-based Mayasa Auto Parts and its 21 ORMA-branded parts stores. Then, in December 2023, O'Reilly Auto Parts rebranded all of its more than 60 stores in Mexico to O'Reilly Autopartes. On December 18, 2023, O'Reilly Auto Parts announced it was acquiring Groupe Del Vasto, which does business as Vast-Auto and is headquartered in Montreal, Canada. This marked O'Reilly's entrance into the Canadian market. Vast-Auto operated two distribution centers and six satellite warehouses that supported a network of 23 company-owned stores, hundreds of strategic independent partners, as well as a widespread service reach that extended to thousands of other independent jobber and professional customers across Eastern Canada. Corporate affairs As of March 2025, O'Reilly Auto Parts operates more than 6,400 stores in 48 U.S. states, Mexico, Puerto Rico and Canada. Jingle O'Reilly is known for its catchy jingle. The jingle was made by John Dillon, a founding member of The Ozark Mountain Daredevils, a rock band based in Springfield, MO. Headquarters Since 2010, O'Reilly Auto Parts has been headquartered in a 117,000 square feet (10,900 m2) building in Springfield, Missouri. Construction began on this building in 2009 to accommodate the increase in corporate staff from the purchase of CSK Auto Corp. NASCAR sponsorship O'Reilly will sponsor the NASCAR Xfinity Series, replacing company Xfinity. They previously sponsored the NASCAR Cup Series' O'Reilly Auto Parts 500 (from 2017–2020), the Xfinity Series' O'Reilly Auto Parts 300 (from 2002–2020 with various name changes with O'Reilly), and the NASCAR Craftsman Truck Series O'Reilly 400 (from 1999–2004) at Texas Motor Speedway and the Cup Series' O'Reilly Auto Parts 253, the Xfinity Series' Super Start Batteries 188, and the Truck Series BrakeBest Select 159 at the Daytona International Speedway Road Course, all held from 2020–2021."
}