{
  "ticker": "OXY",
  "cik": "0000797468",
  "company_name": "Occidental Petroleum",
  "corrected_name": "Occidental Petroleum",
  "wiki_title_used": "Occidental Petroleum",
  "exists": true,
  "raw_text": "Occidental Petroleum Corporation (often abbreviated Oxy in reference to its ticker symbol and logo) is an American company engaged in hydrocarbon exploration in the United States and the Middle East as well as petrochemical manufacturing in the United States, Canada, and Chile. It is incorporated under the Delaware General Corporation Law and headquartered in Houston. The company ranked 183rd on the 2021 Fortune 500 based on its 2020 revenues and 670th on the 2021 Forbes Global 2000.\n\nHistory\nOccidental Petroleum was founded in Los Angeles, CA in 1920. In 1957, Armand Hammer became the company's president and CEO after acquiring a controlling stake. The 1960s marked a period of expansion as Occidental established operations in Peru, Venezuela, Bolivia, Trinidad, and the United Kingdom. In 1961, the company discovered the Lathrop Gas Field in Lathrop, California.\nIn 1965, Occidental won exploration rights in Libya, where it operated until 1986 when United States economic sanctions led to the suspension of activities. The company diversified in 1968 by entering the chemical business with the acquisition of Hooker Chemical Company, following the Love Canal contamination incident.\nIn 1971, Occidental received approval to build an oil refinery in Canvey Island in Essex, England, but construction ceased in 1975 due to the 1970s energy crisis. The site remained derelict; the tanks and the chimney were subsequently demolished. Only some concrete foundations and the river jetty remain extant.\nIn 1973, Occidental negotiated a phosphate-for-natural-gas deal with the Soviet Union, in which the Hammer-controlled firms Occidental Petroleum and Tower International would export to the Soviet Union phosphate, which Occidental mined in northern Florida, in return for the Soviet Union exporting from Odessa and Ventspils through Hammer's firms natural gas that would be converted into ammonia, potash, and urea. The total value of this trade was estimated at $20 billion. The construction of Soviet port facilities, designed by Hammer's firms, was partially financed by the Export-Import Bank as endorsed by Nixon.\nIn August 1973, Libya nationalized 51% of Occidental's assets in the country. In February 1974, the company announced a 35-year oil exploration agreement with Libya. 81% of the oil extracted by Occidental Petroleum was to go to the Libyan government, with 19% retained by Occidental Petroleum. In 1986, the company suspended operation in the country due to economic sanctions imposed by the United States. In 2005, Occidental and its partner, Liwa, won 8 out of 15 exploration spots on the EPSA-4 auction, making both companies among the first to enter the Libyan market since the United States lifted its embargo on Libya.\nThe company was one of the first companies to research developing oil shale.\nIn 1983, Occidental and Ecopetrol, the Colombian state-owned oil company, discovered the giant Caño Limón oilfield in Arauca. In July 1996, the company sold its interest in 3 oilfields in the Congo to the Congolese government for $215 million. The following year, it paid $3.65 billion to acquire the Elk Hills Oil Field.\nIn 1986, the company formed a joint venture with Church & Dwight, which makes Arm & Hammer products, for a potassium carbonate plant at Muscle Shoals, Alabama.\nOn July 6, 1988, an explosion and subsequent inferno on the company's Piper Alpha platform in the Scottish North Sea, resulted in 167 fatalities in what remains the world's most deadly offshore disaster.\nIn 1990, Armand Hammer died and Ray R. Irani became chairman and chief executive officer of the company. In 1991, Occidental sold its  stake in IBP, Inc. In 1993, the company sold its remaining coal operations.\nIn 2006, the government of Ecuador seized the company's interest in block 15 of the Amazon rainforest, forcing the company to take a $306 million after-tax charge. In 2016, Ecuador agreed to pay $980 million in restitution to the company, down from the original award of $1.77 billion. The agreement was based on a 2012 arbitration award from the International Center for Settlement of Investment Disputes.\nIn 2007, Occidental's compensation policies came under scrutiny after it was announced that Irani received $460 million in compensation in 2006. In May 2011, Irani retired as CEO after CalSTRS and Relational Investors, two major shareholders, objected to the company's compensation policies for top executives. President Stephen I. Chazen was named CEO to replace Irani and in 2013, shareholders ousted Irani as chairman. Despite his outlandish compensation, during Irani's tenure, the company grew from a collection of unrelated businesses to one that focuses on oil and gas and the market capitalization of the company went from $5.5 billion to $80 billion.\nIn December 2010, Occidental acquired shale oil properties in the Williston Basin in North Dakota for $1.4 billion. These assets, as well as other assets acquired by Oxy in the Williston Basin, were sold in 2015 for $600 million. The company also sold its proven and probable reserves of 393 million barrels of oil equivalent (2.40×109 GJ) in Argentina to Sinopec, a subsidiary of China Petrochemical Corporation, and acquired properties in South Texas and North Dakota for $3.2 billion.\nIn January 2011, Occidental partnered with Abu Dhabi's state oil company in developing the Shah Field, one of the largest natural gas fields in the Middle East, through a joint venture known as Al Hosn Gas. Al Hosn Gas became operational in 2015.\nIn September 2014, Occidental moved its headquarters to Houston, Texas. In November, the company sold its 50% interest in BridgeTex Pipeline Company, owner of a 300,000 barrel-per-day crude oil pipeline system that extends from Colorado City, Texas to Texas City, Texas, for $1.075 billion. In December 2014, Occidental distributed 80.5% of its shares in California Resources Corporation, the largest producer of oil and natural gas on a gross-operated barrels of oil equivalent basis in California, to Occidental shareholders and distributed its remaining stake to shareholders in March 2016. In June 2017, the company sold land in the Permian Basin for $600 million and used the proceeds to acquire other assets in the area.\nIn October 2015, Occidental completed the first phase of a $500 million carbon dioxide flooding project in Hobbs, New Mexico. In March 2017, the company and its 50/50 joint venture partner Mexichem began operations of a 1.2-billion-pound per year capacity ethylene cracker at the OxyChem plant in Ingleside, Texas, along with pipelines and storage at Markham, Texas.\nIn May 2016, Vicki Hollub, who had worked at Occidental since 1981 and joined the board in 2015, became the chief executive officer of the company, the first female to serve as chief executive officer of a major U.S. oil and gas company.\nIn January 2018, Occidental was found to be partially responsible for the Bayou Corne sinkhole, along with Texas Brine Company and Vulcan Materials Company.\nIn October 2020, Occidental sold its onshore operations in Colombia to the Carlyle Group for $825 million. The deal included operations and working interests in the Llanos Norte, Middle Magdalena, and Putumayo Basins. Working interest on exploration offshore in Colombia remained under ownership of Oxy in partnership with Ecopetrol, with plans to drill the first well by 2024.\n\nAcquisitions\nIn 1981, Occidental acquired IBP, Inc., one of largest producers of beef and pork products in the United States. In 1988, the company acquired Cain Chemical for $2 billion.\nIn 2005, the company acquired Vintage Petroleum for $3.8 billion. In 2008, it acquired a 10% stake in Plains All American Pipeline. The company also acquired assets from Plains Exploration & Production for $1.3 billion. In October 2009, Occidental acquired Citigroup's controversial Phibro energy-trading business, for its net asset value of approximately $250 million. The unit was managed by Andrew J. Hall, who received compensation of approximately $100 million per year in 2007 and 2008. After the acquisition, the division reported its first losses since the 1990s. In 2016, Phibro was wound down and sold.\nIn August 2019, Occidental acquired Anadarko Petroleum for $57 billion, making the deal the world's fourth biggest oil and gas acquisition to date.\nIn August 2023, Occidental acquired all the outstanding equity of the direct air capture technology company, Carbon Engineering for $1.1 billion.  In December, the company acquired a Permian producer, CrownRock, for $12 billion. The acquisition was completed in August 2024.\n\nDivestitures\nIn October 2025, Occidental sold its subsidiary, OxyChem, to Berkshire Hathaway—which owns 28% of Occidental's stock—for $9.7 billion. Occidental said it would use $6.5 billion to lower debt. It also retained all legacy environmental liabilities for OxyChem.\n\nOperations\nOil and gas\nThe company's oil and gas operations are concentrated in two geographic areas: the United States and the Middle East, with some ventures in South America. As of December 31, 2020, Occidental had 2.911 billion barrels of oil equivalent (1.781×1010 GJ) of oil equivalent net proved reserves, of which 51% was petroleum, 19% was natural gas liquids, and 30% was natural gas. In 2020, the company had production of 1,350 thousand barrels of oil equivalent (8,300,000 GJ) per day.\n\nUnited States\nIn 2020, the company's United States operations produced 1,037 thousand barrels of oil equivalent (6,340,000 GJ) per day, representing 77% of the company's worldwide production, including 575 thousand barrels of oil equivalent (3,520,000 GJ) per day in Permian Basin, where Occidental is the largest operator and oil producer. The company produced 435 thousand barrels of oil equivalent (2,660,000 GJ) per day from unconventional oil directional drilling via Permian Resources and 140 thousand barrels of oil equivalent (860,000 GJ) per day using a technique called enhanced oil recovery, whereby carbon dioxide and water are injected into underground formations to extract the oil and gas. The company also produced 293 thousand barrels of oil equivalent (1,790,000 GJ) per day in the Denver Basin.\n\nMiddle East\nThe company's oil and gas operations in the Middle East are in Oman, Qatar, and the United Arab Emirates and are via production sharing agreements. The region produced 251 thousand barrels of oil equivalent (1,540,000 GJ) per day, representing approximately 19% of 2020 total production. The region also held 28% of the company's proved reserves in 2020.\nThe company is the largest independent oil producer in Oman. In Qatar, the company is the second-largest oil producer offshore and is a partial owner in the Dolphin Gas Project, which delivers gas to Oman and the United Arab Emirates.\n\nSouth America\nIn Colombia, Anadarko Colombia, a subsidiary of Oxy, and Ecopetrol entered into a joint exploration agreement in May 2022 for offshore exploration in deep waters of the Caribbean, with plans to drill the world's deepest offshore oil well by 2024.\nIn Peru, Anadarko Peru, a subsidiary of Oxy, completed the initial phase of a 3D marine seismic acquisition project in northern Peruvian waters in 2024.\n\nChemical\nA deal was struck in October 2025 to sell OxyChem to Berkshire Hathaway\nOxyChem, a wholly-owned subsidiary, manufactures polyvinyl chloride (PVC) resins, chlorine, and sodium hydroxide (caustic soda) used in plastics, pharmaceuticals, and water treatment chemicals. Other products manufactured by the company include caustic potash, chlorinated organics, sodium silicates, chlorinated cyanuric acid (isocyanurate), and calcium chloride. OxyChem has manufacturing facilities in the United States, Canada, and Chile. In a joint venture with Church & Dwight, OxyChem owns Armand Products Company, which sells potassium carbonate and potassium bicarbonate.\n\nDecarbonization projects\nIn June 2024, Occidental Petroleum signed a memorandum of understanding with TAE Technologies to explore commercial opportunities for using TAE's nuclear fusion technology to provide clean electricity and heat for Occidental's direct air capture (DAC) projects. DAC is an energy-intensive process that involves removing CO2 from the atmosphere, and the partnership aims to address the energy needs of DAC with low-carbon power solutions. TAE Technologies, known for its advanced nuclear fusion research, plans to have a demonstration project by 2025 and a commercial facility in the 2030s.\n\nControversies\nLobbying to do business in Libya\nThe company began operations in Libya in 1965 and operated there until economic sanctions were imposed in 1986 by the United States. The company was one of the first American companies to resume negotiations in Libya after the sanctions were lifted in 2004. In 2008, the company, along with 5 other oil companies, was criticized for hiring Hogan Lovells to lobby to exempt Libya from a law written by U.S. Senator Frank Lautenberg (D-NJ) to assist American terror victims in seizing assets of countries found culpable in terror attacks, such as the Libyan bombing of Pan Am Flight 103 over Lockerbie in 1988. and to remove a provision in the Dodd–Frank Wall Street Reform and Consumer Protection Act that requires disclosure of payments to foreign governments. In early 2011, the company ceased exploration activities and production operations in Libya due to the growing civil unrest in the country and U.S. sanctions. In June 2011, the U.S. Securities and Exchange Commission and United Kingdom prosecutors requested information from the company, ExxonMobil and ConocoPhillips related to the Libyan Investment Authority (LIA), an investment firm controlled by Libyan leader Muammar Gaddafi, to determine if there were any violations of international bribery laws. The Libyan Investment Authority's investments were frozen by the U.S. government in early 2011 following the Gaddafi regime's attacks on Libyan civilians. In 2016, the company ceased operations in Libya.\n\nEnvironmental record\nIn 2017, the company was ranked 55th on the Carbon Majors Report, a list of the Top 100 producers and their cumulative greenhouse gas emissions from 1988-2015.\nThe company has stated that its use of enhanced oil recovery for a portion of its production is one way it helps mitigate its high emissions.\n\nCleanup of the Copper Basin\nIn 1982, the company acquired land in the Copper Basin in Tennessee, formerly the site of the Burra Burra Mine, where copper and sulfur had been mined in the 1800s. In 2016, Occidental agreed to spend $50 million to clean up the Copper Basin and restore the water quality of its creeks.\n\nLove Canal\nSince the 1920s, several companies and the United States Armed Forces used the Love Canal as a chemical disposal site. In 1942, Occidental predecessor Hooker Chemical Company began disposing of chemical waste at the site and, in 1947, it became the sole owner and user of the land. In 1952, the site was filled to capacity and closed off. The company leased the land to the local school board in 1953. Later in the 1950s, the school board requested that the company sell the land, and threatened to use eminent domain. The school board intended to build a school on an unused area of the dump.\nA school was built on the site, and later a middle-class residential district was built on land adjacent to the site. The construction broke through the 4-foot (1.2 m) clay seal containing the waste. In 1968, Hooker Chemical was purchased by Occidental. In 1978, residents became concerned about unusual health issues in the region, including high rates of cancer and birth defects. This subsequently became a national news story, and in 1980, president Jimmy Carter declared a federal emergency in the area. Residents were eventually relocated, and the company paid $129 million in restitution.\n\nOleum spill\nOn Saturday, October 11, 2008, oleum was accidentally spilled at a facility in Petrolia, Pennsylvania which belonged to Indspec, an affiliate of Occidental Chemical Corporation. Oleum is a chemical mixture of sulfuric acid and sulfur trioxide. The accident contaminated the ventilation system and caused a cloud of toxic gas. Over 2,000 residents had to be evacuated for the day. The spill was caused by an auxiliary pump power supply which lacked safety interlocks to prevent tank overfilling.\n\nBangladesh\nOn 14 June 1997, an explosion at the Magurchhaqra gas field in Kamalganj Upazila, Moulvibazar District of Bangladesh destroyed large areas of Lawachara National Park and nearby areas. Occidental was drilling at the gas field which was later abandoned. The explosion damaged 28 tea gardens in the area. It was estimated to have caused 90 to 140 billion BDT in damages. The government of Bangladesh claimed compensation from Occidental but it left the country handing over the well to Unocal which later sold the interests to Chevron.\n\nColombia\nFrom 1992 to 2001, the company tried to drill for oil in the territory of the U'wa people, in northeast Colombia. The locals resisted, concerned about environmental degradation and fears that development would bring strangers and be a target for guerrilla warfare. There also were tribal beliefs that oil is the \"blood of the earth\" and should not be removed. In 2002, after years of shareholder resolutions, legal battles, protests, and a failed test well, the company abandoned the project. Repsol took over the project.\n\nCaño Limón\nOn December 13, 1998, 17 civilians, including 7 children, were killed when the Colombian Air Force (CAF) dropped a cluster bomb in the hamlet of Santo Domingo, Colombia, after AirScan, Occidental's security contractor, misidentified it as a hostile guerrilla target. Groups such as FARC and the National Liberation Army were active in the area. Three employees of AirScan were flying the Skymaster plane from which they provided the Colombian military with the coordinates to drop the bombs. The operation had been planned by the CAF and AirScan at Occidental's complex in Caño Limón. In April 2003, Luis Alberto Galvis Mujica, a witness and survivor of the accident, sued Occidental. The courts ruled that Occidental was not liable for the incident.\n\nMaynas Carijano v. Occidental Petroleum\nOn May 10, 2007, a group of 25 Achuar Peruvians, a group of Indigenous peoples, filed suit against the company, demanding environmental remediation and reparations for environmental degradation allegedly caused by the company between 1971 and 2000, when it drilled in Block 1-AB in Peru. The plaintiffs claimed that the company violated technical standards and environmental law when it dumped a total of 9 billion barrels (1.4×10^9 m3) of toxic oil by-products, such as cadmium, lead, and arsenic, in drainage basins used by the Achuar people to fish, drink, and bathe. This environmental damage was alleged to have caused premature deaths and birth defects. A 2006 study by the Ministry of Health of Peru, found that all but 2 of the 199 people tested had levels of cadmium in their blood above safe levels.\nThe Achuar were represented by EarthRights International and the law firm Schonbrun DeSimone Seplow Harris & Hoffman LLP.\nOn March 3, 2010, EarthRights International argued to the United States Court of Appeals for the Ninth Circuit that the case should be litigated in Los Angeles, where the company was headquartered. The court agreed with a trial in the United States, overturning the decision of the lower courts, and, in 2013, the United States Supreme Court refused to hear the company's appeal. In March 2015, the company made a settlement for an undisclosed amount, with the funds to be used for health, education, and nutrition projects in five Achuar communities in the Corrientes River basin.\n\nAnadarko Petroleum\nIn 2019, Occidental Petroleum acquired Anadarko Petroleum, inheriting a significant legacy of environmental infractions including the largest environmental contamination settlement in American history, involvement with the Deepwater Horizon BP disaster and fines under the Clean Water Act.\nThe deal was clinched as investor and Berkshire Hathaway CEO Warren Buffett pledged $10 billion to finance the deal in exchange for 100,000 shares of cumulative perpetual preferred stock with a value of $100,000 per share. Buffett and Berkshire also received a warrant to purchase up to 80 million more shares at an exercise price of $62.50 a share.\n\nPolitical record\nContributions\nOccidental has disclosed its contributions to political action committees, lobbyists, and trade associations on its website.\nIn 2005, the company was among 53 entities which contributed the maximum of $250,000 to the Second inauguration of George W. Bush.\nThe company also donated between $10,000 and $25,000 to the Clinton Foundation.\n\nGore family\nFormer CEO Armand Hammer was a long time friend of former U.S. Senator Albert Gore, Sr. and Gore was a member of the board of directors of the company. In September 1972, after he lost an election for the United States Senate in 1970, Gore became the head of Island Creek Coal Company, an Occidental subsidiary. Much of the company's coal and phosphate production was in Tennessee, the state Gore represented in the Senate, and Gore owned shares in the company. The company liquidated its coal assets in 1993 after Hammer died.\nFormer Vice President of the United States Al Gore was criticized by environmentalists when he inherited shares in the company after the death of his father in 1998; however, the shares were immediately sold.\nIn 1998, the U.S. government sold the Elk Hills Oil Field to Occidental for $3.65 billion after an auction process that involved selling the field in segments and offering it to multiple bidders. However, critics cited the Gore family's involvement with the company as evidence of graft.\n\nSafety record\nIn 1999, OxyChem achieved Star Status under OSHA's Voluntary Protection Programs as being among the safest work sites in the U.S.\n\nPiper Alpha\nOn July 6, 1988, the company's Piper Alpha offshore production platform in the North Sea was destroyed when an out of service gas condensate pump was started with its pressure safety valve removed. The subsequent gas leak, explosion and fire resulted in the deaths of 167 workers in what remains the world's deadliest offshore disaster. The subsequent inquiry blamed the accident on inadequate maintenance and safety procedures by Occidental, though no charges were brought.\n\nGreenmail\nIn 1984, billionaire David H. Murdock owned about 5% of the company and was a member of its board of directors, after the company acquired IBP, Inc., of which Murdock owned 19%. After disagreements between Murdock and then CEO Armand Hammer, the company paid greenmail to buy Murdock's shares at $40.09 each, while the market price was $28.75.\n\nPrice-fixing lawsuit\nIn January 2024, a class action lawsuit was filed by drivers in three US states accusing Occidental, along with seven other oil and gas producers, of an illegal price-fixing scheme to constrain production of shale oil that led to American drivers paying more for gasoline than they would have in a competitive market.\n\nSee also\nList of oil exploration and production companies\n\nReferences\nBooks\nEpstein, Edward Jay. Dossier: The Secret History of Armand Hammer. New York: Random House (1996). ISBN 978-0679448020. 418 pages.\n\nExternal links\nOfficial website\nBusiness data for Occidental Petroleum:",
  "clean_text": "Occidental Petroleum Corporation (often abbreviated Oxy in reference to its ticker symbol and logo) is an American company engaged in hydrocarbon exploration in the United States and the Middle East as well as petrochemical manufacturing in the United States, Canada, and Chile. It is incorporated under the Delaware General Corporation Law and headquartered in Houston. The company ranked 183rd on the 2021 Fortune 500 based on its 2020 revenues and 670th on the 2021 Forbes Global 2000. History Occidental Petroleum was founded in Los Angeles, CA in 1920. In 1957, Armand Hammer became the company's president and CEO after acquiring a controlling stake. The 1960s marked a period of expansion as Occidental established operations in Peru, Venezuela, Bolivia, Trinidad, and the United Kingdom. In 1961, the company discovered the Lathrop Gas Field in Lathrop, California. In 1965, Occidental won exploration rights in Libya, where it operated until 1986 when United States economic sanctions led to the suspension of activities. The company diversified in 1968 by entering the chemical business with the acquisition of Hooker Chemical Company, following the Love Canal contamination incident. In 1971, Occidental received approval to build an oil refinery in Canvey Island in Essex, England, but construction ceased in 1975 due to the 1970s energy crisis. The site remained derelict; the tanks and the chimney were subsequently demolished. Only some concrete foundations and the river jetty remain extant. In 1973, Occidental negotiated a phosphate-for-natural-gas deal with the Soviet Union, in which the Hammer-controlled firms Occidental Petroleum and Tower International would export to the Soviet Union phosphate, which Occidental mined in northern Florida, in return for the Soviet Union exporting from Odessa and Ventspils through Hammer's firms natural gas that would be converted into ammonia, potash, and urea. The total value of this trade was estimated at $20 billion. The construction of Soviet port facilities, designed by Hammer's firms, was partially financed by the Export-Import Bank as endorsed by Nixon. In August 1973, Libya nationalized 51% of Occidental's assets in the country. In February 1974, the company announced a 35-year oil exploration agreement with Libya. 81% of the oil extracted by Occidental Petroleum was to go to the Libyan government, with 19% retained by Occidental Petroleum. In 1986, the company suspended operation in the country due to economic sanctions imposed by the United States. In 2005, Occidental and its partner, Liwa, won 8 out of 15 exploration spots on the EPSA-4 auction, making both companies among the first to enter the Libyan market since the United States lifted its embargo on Libya. The company was one of the first companies to research developing oil shale. In 1983, Occidental and Ecopetrol, the Colombian state-owned oil company, discovered the giant Caño Limón oilfield in Arauca. In July 1996, the company sold its interest in 3 oilfields in the Congo to the Congolese government for $215 million. The following year, it paid $3.65 billion to acquire the Elk Hills Oil Field. In 1986, the company formed a joint venture with Church & Dwight, which makes Arm & Hammer products, for a potassium carbonate plant at Muscle Shoals, Alabama. On July 6, 1988, an explosion and subsequent inferno on the company's Piper Alpha platform in the Scottish North Sea, resulted in 167 fatalities in what remains the world's most deadly offshore disaster. In 1990, Armand Hammer died and Ray R. Irani became chairman and chief executive officer of the company. In 1991, Occidental sold its stake in IBP, Inc. In 1993, the company sold its remaining coal operations. In 2006, the government of Ecuador seized the company's interest in block 15 of the Amazon rainforest, forcing the company to take a $306 million after-tax charge. In 2016, Ecuador agreed to pay $980 million in restitution to the company, down from the original award of $1.77 billion. The agreement was based on a 2012 arbitration award from the International Center for Settlement of Investment Disputes. In 2007, Occidental's compensation policies came under scrutiny after it was announced that Irani received $460 million in compensation in 2006. In May 2011, Irani retired as CEO after CalSTRS and Relational Investors, two major shareholders, objected to the company's compensation policies for top executives. President Stephen I. Chazen was named CEO to replace Irani and in 2013, shareholders ousted Irani as chairman. Despite his outlandish compensation, during Irani's tenure, the company grew from a collection of unrelated businesses to one that focuses on oil and gas and the market capitalization of the company went from $5.5 billion to $80 billion. In December 2010, Occidental acquired shale oil properties in the Williston Basin in North Dakota for $1.4 billion. These assets, as well as other assets acquired by Oxy in the Williston Basin, were sold in 2015 for $600 million. The company also sold its proven and probable reserves of 393 million barrels of oil equivalent (2.40×109 GJ) in Argentina to Sinopec, a subsidiary of China Petrochemical Corporation, and acquired properties in South Texas and North Dakota for $3.2 billion. In January 2011, Occidental partnered with Abu Dhabi's state oil company in developing the Shah Field, one of the largest natural gas fields in the Middle East, through a joint venture known as Al Hosn Gas. Al Hosn Gas became operational in 2015. In September 2014, Occidental moved its headquarters to Houston, Texas. In November, the company sold its 50% interest in BridgeTex Pipeline Company, owner of a 300,000 barrel-per-day crude oil pipeline system that extends from Colorado City, Texas to Texas City, Texas, for $1.075 billion. In December 2014, Occidental distributed 80.5% of its shares in California Resources Corporation, the largest producer of oil and natural gas on a gross-operated barrels of oil equivalent basis in California, to Occidental shareholders and distributed its remaining stake to shareholders in March 2016. In June 2017, the company sold land in the Permian Basin for $600 million and used the proceeds to acquire other assets in the area. In October 2015, Occidental completed the first phase of a $500 million carbon dioxide flooding project in Hobbs, New Mexico. In March 2017, the company and its 50/50 joint venture partner Mexichem began operations of a 1.2-billion-pound per year capacity ethylene cracker at the OxyChem plant in Ingleside, Texas, along with pipelines and storage at Markham, Texas. In May 2016, Vicki Hollub, who had worked at Occidental since 1981 and joined the board in 2015, became the chief executive officer of the company, the first female to serve as chief executive officer of a major U.S. oil and gas company. In January 2018, Occidental was found to be partially responsible for the Bayou Corne sinkhole, along with Texas Brine Company and Vulcan Materials Company. In October 2020, Occidental sold its onshore operations in Colombia to the Carlyle Group for $825 million. The deal included operations and working interests in the Llanos Norte, Middle Magdalena, and Putumayo Basins. Working interest on exploration offshore in Colombia remained under ownership of Oxy in partnership with Ecopetrol, with plans to drill the first well by 2024. Acquisitions In 1981, Occidental acquired IBP, Inc., one of largest producers of beef and pork products in the United States. In 1988, the company acquired Cain Chemical for $2 billion. In 2005, the company acquired Vintage Petroleum for $3.8 billion. In 2008, it acquired a 10% stake in Plains All American Pipeline. The company also acquired assets from Plains Exploration & Production for $1.3 billion. In October 2009, Occidental acquired Citigroup's controversial Phibro energy-trading business, for its net asset value of approximately $250 million. The unit was managed by Andrew J. Hall, who received compensation of approximately $100 million per year in 2007 and 2008. After the acquisition, the division reported its first losses since the 1990s. In 2016, Phibro was wound down and sold. In August 2019, Occidental acquired Anadarko Petroleum for $57 billion, making the deal the world's fourth biggest oil and gas acquisition to date. In August 2023, Occidental acquired all the outstanding equity of the direct air capture technology company, Carbon Engineering for $1.1 billion. In December, the company acquired a Permian producer, CrownRock, for $12 billion. The acquisition was completed in August 2024. Divestitures In October 2025, Occidental sold its subsidiary, OxyChem, to Berkshire Hathaway—which owns 28% of Occidental's stock—for $9.7 billion. Occidental said it would use $6.5 billion to lower debt. It also retained all legacy environmental liabilities for OxyChem. Operations Oil and gas The company's oil and gas operations are concentrated in two geographic areas: the United States and the Middle East, with some ventures in South America. As of December 31, 2020, Occidental had 2.911 billion barrels of oil equivalent (1.781×1010 GJ) of oil equivalent net proved reserves, of which 51% was petroleum, 19% was natural gas liquids, and 30% was natural gas. In 2020, the company had production of 1,350 thousand barrels of oil equivalent (8,300,000 GJ) per day. United States In 2020, the company's United States operations produced 1,037 thousand barrels of oil equivalent (6,340,000 GJ) per day, representing 77% of the company's worldwide production, including 575 thousand barrels of oil equivalent (3,520,000 GJ) per day in Permian Basin, where Occidental is the largest operator and oil producer. The company produced 435 thousand barrels of oil equivalent (2,660,000 GJ) per day from unconventional oil directional drilling via Permian Resources and 140 thousand barrels of oil equivalent (860,000 GJ) per day using a technique called enhanced oil recovery, whereby carbon dioxide and water are injected into underground formations to extract the oil and gas. The company also produced 293 thousand barrels of oil equivalent (1,790,000 GJ) per day in the Denver Basin. Middle East The company's oil and gas operations in the Middle East are in Oman, Qatar, and the United Arab Emirates and are via production sharing agreements. The region produced 251 thousand barrels of oil equivalent (1,540,000 GJ) per day, representing approximately 19% of 2020 total production. The region also held 28% of the company's proved reserves in 2020. The company is the largest independent oil producer in Oman. In Qatar, the company is the second-largest oil producer offshore and is a partial owner in the Dolphin Gas Project, which delivers gas to Oman and the United Arab Emirates. South America In Colombia, Anadarko Colombia, a subsidiary of Oxy, and Ecopetrol entered into a joint exploration agreement in May 2022 for offshore exploration in deep waters of the Caribbean, with plans to drill the world's deepest offshore oil well by 2024. In Peru, Anadarko Peru, a subsidiary of Oxy, completed the initial phase of a 3D marine seismic acquisition project in northern Peruvian waters in 2024. Chemical A deal was struck in October 2025 to sell OxyChem to Berkshire Hathaway OxyChem, a wholly-owned subsidiary, manufactures polyvinyl chloride (PVC) resins, chlorine, and sodium hydroxide (caustic soda) used in plastics, pharmaceuticals, and water treatment chemicals. Other products manufactured by the company include caustic potash, chlorinated organics, sodium silicates, chlorinated cyanuric acid (isocyanurate), and calcium chloride. OxyChem has manufacturing facilities in the United States, Canada, and Chile. In a joint venture with Church & Dwight, OxyChem owns Armand Products Company, which sells potassium carbonate and potassium bicarbonate. Decarbonization projects In June 2024, Occidental Petroleum signed a memorandum of understanding with TAE Technologies to explore commercial opportunities for using TAE's nuclear fusion technology to provide clean electricity and heat for Occidental's direct air capture (DAC) projects. DAC is an energy-intensive process that involves removing CO2 from the atmosphere, and the partnership aims to address the energy needs of DAC with low-carbon power solutions. TAE Technologies, known for its advanced nuclear fusion research, plans to have a demonstration project by 2025 and a commercial facility in the 2030s. Controversies Lobbying to do business in Libya The company began operations in Libya in 1965 and operated there until economic sanctions were imposed in 1986 by the United States. The company was one of the first American companies to resume negotiations in Libya after the sanctions were lifted in 2004. In 2008, the company, along with 5 other oil companies, was criticized for hiring Hogan Lovells to lobby to exempt Libya from a law written by U.S. Senator Frank Lautenberg (D-NJ) to assist American terror victims in seizing assets of countries found culpable in terror attacks, such as the Libyan bombing of Pan Am Flight 103 over Lockerbie in 1988. and to remove a provision in the Dodd–Frank Wall Street Reform and Consumer Protection Act that requires disclosure of payments to foreign governments. In early 2011, the company ceased exploration activities and production operations in Libya due to the growing civil unrest in the country and U.S. sanctions. In June 2011, the U.S. Securities and Exchange Commission and United Kingdom prosecutors requested information from the company, ExxonMobil and ConocoPhillips related to the Libyan Investment Authority (LIA), an investment firm controlled by Libyan leader Muammar Gaddafi, to determine if there were any violations of international bribery laws. The Libyan Investment Authority's investments were frozen by the U.S. government in early 2011 following the Gaddafi regime's attacks on Libyan civilians. In 2016, the company ceased operations in Libya. Environmental record In 2017, the company was ranked 55th on the Carbon Majors Report, a list of the Top 100 producers and their cumulative greenhouse gas emissions from 1988-2015. The company has stated that its use of enhanced oil recovery for a portion of its production is one way it helps mitigate its high emissions. Cleanup of the Copper Basin In 1982, the company acquired land in the Copper Basin in Tennessee, formerly the site of the Burra Burra Mine, where copper and sulfur had been mined in the 1800s. In 2016, Occidental agreed to spend $50 million to clean up the Copper Basin and restore the water quality of its creeks. Love Canal Since the 1920s, several companies and the United States Armed Forces used the Love Canal as a chemical disposal site. In 1942, Occidental predecessor Hooker Chemical Company began disposing of chemical waste at the site and, in 1947, it became the sole owner and user of the land. In 1952, the site was filled to capacity and closed off. The company leased the land to the local school board in 1953. Later in the 1950s, the school board requested that the company sell the land, and threatened to use eminent domain. The school board intended to build a school on an unused area of the dump. A school was built on the site, and later a middle-class residential district was built on land adjacent to the site. The construction broke through the 4-foot (1.2 m) clay seal containing the waste. In 1968, Hooker Chemical was purchased by Occidental. In 1978, residents became concerned about unusual health issues in the region, including high rates of cancer and birth defects. This subsequently became a national news story, and in 1980, president Jimmy Carter declared a federal emergency in the area. Residents were eventually relocated, and the company paid $129 million in restitution. Oleum spill On Saturday, October 11, 2008, oleum was accidentally spilled at a facility in Petrolia, Pennsylvania which belonged to Indspec, an affiliate of Occidental Chemical Corporation. Oleum is a chemical mixture of sulfuric acid and sulfur trioxide. The accident contaminated the ventilation system and caused a cloud of toxic gas. Over 2,000 residents had to be evacuated for the day. The spill was caused by an auxiliary pump power supply which lacked safety interlocks to prevent tank overfilling. Bangladesh On 14 June 1997, an explosion at the Magurchhaqra gas field in Kamalganj Upazila, Moulvibazar District of Bangladesh destroyed large areas of Lawachara National Park and nearby areas. Occidental was drilling at the gas field which was later abandoned. The explosion damaged 28 tea gardens in the area. It was estimated to have caused 90 to 140 billion BDT in damages. The government of Bangladesh claimed compensation from Occidental but it left the country handing over the well to Unocal which later sold the interests to Chevron. Colombia From 1992 to 2001, the company tried to drill for oil in the territory of the U'wa people, in northeast Colombia. The locals resisted, concerned about environmental degradation and fears that development would bring strangers and be a target for guerrilla warfare. There also were tribal beliefs that oil is the \"blood of the earth\" and should not be removed. In 2002, after years of shareholder resolutions, legal battles, protests, and a failed test well, the company abandoned the project. Repsol took over the project. Caño Limón On December 13, 1998, 17 civilians, including 7 children, were killed when the Colombian Air Force (CAF) dropped a cluster bomb in the hamlet of Santo Domingo, Colombia, after AirScan, Occidental's security contractor, misidentified it as a hostile guerrilla target. Groups such as FARC and the National Liberation Army were active in the area. Three employees of AirScan were flying the Skymaster plane from which they provided the Colombian military with the coordinates to drop the bombs. The operation had been planned by the CAF and AirScan at Occidental's complex in Caño Limón. In April 2003, Luis Alberto Galvis Mujica, a witness and survivor of the accident, sued Occidental. The courts ruled that Occidental was not liable for the incident. Maynas Carijano v. Occidental Petroleum On May 10, 2007, a group of 25 Achuar Peruvians, a group of Indigenous peoples, filed suit against the company, demanding environmental remediation and reparations for environmental degradation allegedly caused by the company between 1971 and 2000, when it drilled in Block 1-AB in Peru. The plaintiffs claimed that the company violated technical standards and environmental law when it dumped a total of 9 billion barrels (1.4×10^9 m3) of toxic oil by-products, such as cadmium, lead, and arsenic, in drainage basins used by the Achuar people to fish, drink, and bathe. This environmental damage was alleged to have caused premature deaths and birth defects. A 2006 study by the Ministry of Health of Peru, found that all but 2 of the 199 people tested had levels of cadmium in their blood above safe levels. The Achuar were represented by EarthRights International and the law firm Schonbrun DeSimone Seplow Harris & Hoffman LLP. On March 3, 2010, EarthRights International argued to the United States Court of Appeals for the Ninth Circuit that the case should be litigated in Los Angeles, where the company was headquartered. The court agreed with a trial in the United States, overturning the decision of the lower courts, and, in 2013, the United States Supreme Court refused to hear the company's appeal. In March 2015, the company made a settlement for an undisclosed amount, with the funds to be used for health, education, and nutrition projects in five Achuar communities in the Corrientes River basin. Anadarko Petroleum In 2019, Occidental Petroleum acquired Anadarko Petroleum, inheriting a significant legacy of environmental infractions including the largest environmental contamination settlement in American history, involvement with the Deepwater Horizon BP disaster and fines under the Clean Water Act. The deal was clinched as investor and Berkshire Hathaway CEO Warren Buffett pledged $10 billion to finance the deal in exchange for 100,000 shares of cumulative perpetual preferred stock with a value of $100,000 per share. Buffett and Berkshire also received a warrant to purchase up to 80 million more shares at an exercise price of $62.50 a share. Political record Contributions Occidental has disclosed its contributions to political action committees, lobbyists, and trade associations on its website. In 2005, the company was among 53 entities which contributed the maximum of $250,000 to the Second inauguration of George W. Bush. The company also donated between $10,000 and $25,000 to the Clinton Foundation. Gore family Former CEO Armand Hammer was a long time friend of former U.S. Senator Albert Gore, Sr. and Gore was a member of the board of directors of the company. In September 1972, after he lost an election for the United States Senate in 1970, Gore became the head of Island Creek Coal Company, an Occidental subsidiary. Much of the company's coal and phosphate production was in Tennessee, the state Gore represented in the Senate, and Gore owned shares in the company. The company liquidated its coal assets in 1993 after Hammer died. Former Vice President of the United States Al Gore was criticized by environmentalists when he inherited shares in the company after the death of his father in 1998; however, the shares were immediately sold. In 1998, the U.S. government sold the Elk Hills Oil Field to Occidental for $3.65 billion after an auction process that involved selling the field in segments and offering it to multiple bidders. However, critics cited the Gore family's involvement with the company as evidence of graft. Safety record In 1999, OxyChem achieved Star Status under OSHA's Voluntary Protection Programs as being among the safest work sites in the U.S. Piper Alpha On July 6, 1988, the company's Piper Alpha offshore production platform in the North Sea was destroyed when an out of service gas condensate pump was started with its pressure safety valve removed. The subsequent gas leak, explosion and fire resulted in the deaths of 167 workers in what remains the world's deadliest offshore disaster. The subsequent inquiry blamed the accident on inadequate maintenance and safety procedures by Occidental, though no charges were brought. Greenmail In 1984, billionaire David H. Murdock owned about 5% of the company and was a member of its board of directors, after the company acquired IBP, Inc., of which Murdock owned 19%. After disagreements between Murdock and then CEO Armand Hammer, the company paid greenmail to buy Murdock's shares at $40.09 each, while the market price was $28.75. Price-fixing lawsuit In January 2024, a class action lawsuit was filed by drivers in three US states accusing Occidental, along with seven other oil and gas producers, of an illegal price-fixing scheme to constrain production of shale oil that led to American drivers paying more for gasoline than they would have in a competitive market."
}