{
  "ticker": "PAYC",
  "cik": "0001590955",
  "company_name": "Paycom",
  "corrected_name": "Paycom",
  "wiki_title_used": "Paycom",
  "exists": true,
  "raw_text": "Paycom Software, Inc., known simply as Paycom, is an online payroll and human resource software provider based in Oklahoma City, Oklahoma with offices throughout the United States. It is attributed with being one of the first fully online payroll providers. Founded in 1998, it reported annual revenue of $1.883 billion for 2024, up from $1.694 billion for 2023.\n\nHistory\nPaycom was founded in 1998 by Chad Richison, who previously worked in the payroll processing industry. It began as an online payroll service provider for businesses, and expanded to offer additional services including human resource management in 2001. On April 15, 2014, Paycom opened for trade on the New York Stock Exchange under the ticker symbol PAYC.\nIn 2011, it released additional services including E-Verify, onboarding, expense management, and document storage. In 2014, Paycom built a 90,000-square-foot addition to its headquarters—effectively doubling the size of its offices. The company completed construction on its third and fourth buildings (in 2016 and 2018, respectively). In 2024, it opened its fifth building, bringing the total square-footage of its corporate campus to 815,000. In May 2022, Paycom held a grand opening ceremony for a new 150,000 square-foot operations center in Grapevine, Texas.\nCEO Chad Richison was the highest paid executive in the United States in 2020, earning $211.13 million from Paycom as part of a 10-year performance contract. The compensation consists mostly of stock shares that only vest if the company reaches specific stock price benchmarks by 2026 and 2030.\nIn 2021, Paycom announced the release of Beti®, an enhancement to its payroll system allowing employees to complete their own payroll. Later that year, they bought the naming rights to the Paycom Center, home of the Oklahoma City Thunder.\nIn April 2023, Paycom launched Global HCM™, a human capital management software available in over 190 countries and 15 languages and dialects.\nIn December 2023, Paycom announced its next step in HR automation, GONE®, an enhancement to existing Time-Off Request software.\nIn July 2025, Paycom launched IWant™, a command-driven AI engine allowing users to seek information about employee data without having to navigate through the software.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Paycom Software, Inc.:",
  "clean_text": "Paycom Software, Inc., known simply as Paycom, is an online payroll and human resource software provider based in Oklahoma City, Oklahoma with offices throughout the United States. It is attributed with being one of the first fully online payroll providers. Founded in 1998, it reported annual revenue of $1.883 billion for 2024, up from $1.694 billion for 2023. History Paycom was founded in 1998 by Chad Richison, who previously worked in the payroll processing industry. It began as an online payroll service provider for businesses, and expanded to offer additional services including human resource management in 2001. On April 15, 2014, Paycom opened for trade on the New York Stock Exchange under the ticker symbol PAYC. In 2011, it released additional services including E-Verify, onboarding, expense management, and document storage. In 2014, Paycom built a 90,000-square-foot addition to its headquarters—effectively doubling the size of its offices. The company completed construction on its third and fourth buildings (in 2016 and 2018, respectively). In 2024, it opened its fifth building, bringing the total square-footage of its corporate campus to 815,000. In May 2022, Paycom held a grand opening ceremony for a new 150,000 square-foot operations center in Grapevine, Texas. CEO Chad Richison was the highest paid executive in the United States in 2020, earning $211.13 million from Paycom as part of a 10-year performance contract. The compensation consists mostly of stock shares that only vest if the company reaches specific stock price benchmarks by 2026 and 2030. In 2021, Paycom announced the release of Beti®, an enhancement to its payroll system allowing employees to complete their own payroll. Later that year, they bought the naming rights to the Paycom Center, home of the Oklahoma City Thunder. In April 2023, Paycom launched Global HCM™, a human capital management software available in over 190 countries and 15 languages and dialects. In December 2023, Paycom announced its next step in HR automation, GONE®, an enhancement to existing Time-Off Request software. In July 2025, Paycom launched IWant™, a command-driven AI engine allowing users to seek information about employee data without having to navigate through the software."
}