{
  "ticker": "PAYX",
  "cik": "0000723531",
  "company_name": "Paychex",
  "corrected_name": "Paychex",
  "wiki_title_used": "Paychex",
  "exists": true,
  "raw_text": "Paychex, Inc. is an American company that provides human resources, payroll, and employee benefits outsourcing services for small- to medium-sized businesses. Founded in 1971 and headquartered in Rochester, New York, the company has more than 100 offices serving approximately 800,000 payroll clients in the U.S. and Europe. Paychex is ranked 681st on the Fortune 500 list of largest corporations by revenue.\n\nHistory\nPaychex was founded in 1971 by Tom Golisano, who started the company with only $3,000.\nThe operation grew to include 18 franchises and partnerships, which were eventually consolidated into one private company in 1979. In 1983, the company (ticker symbol: PAYX) became a public company via an initial public offering.\nPaychex acquired Pay-Fone in 1995. In 1996, the company acquired Olsen Computer Systems and National Business Systems.\nBetween 2002 and 2003, it acquired Advantage Payroll Services, Interpay, and Time in a Box, followed by Time in a Box's parent Stromberg in 2004.\nThe company purchased Hawthorne Benefit Technologies in 2007, SurePayroll, Inc. in 2010, and ePlan Services in 2011. It Icon Time Systems and ExpenseWire in 2012 for an undisclosed amount. Between 2013 and 2017, it purchased myStaffingPro NETtime solutions Advance Partners, and Human Resources Outsourcing, Inc.\nRochester Democrat and Chronicle named Paychex one of the Best Places to Work in Rochester in 2016.\nIt acquired Lessor Group 2018. That year it also acquired Oasis for a reported $1.2 billion.\nIn 2019, Paychex was named to the Fortune list of Future 50 companies.\nJohn Gibson has been CEO of Paychex since October 2022.\nThe company generated $5.2 billion in revenue and $13 billion in assets in 2024.\nIn 2025, it acquired Paycor for $4.1 billion\nIn May 2025, Paychex acquired SixFifty, the legal tech unit of U.S. law firm Wilson Sonsini Goodrich & Rosati, in an all-cash deal worth between $70 million and $85 million.\n\nSmall Business Employment Watch\nPaychex and IHS Markit launched a Small Business Jobs Index in 2014 that measures the  health of businesses employing 50 people or less. The IHS Markit Small Business Employment Watch shares small business jobs data beginning 2005 and wage data from 2011. The Employment Watch is frequently used by financial experts, analysts, and journalists assessing the economic outlook.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Paychex, Inc.: \nWolfram Alpha Fundamentals & Financials",
  "clean_text": "Paychex, Inc. is an American company that provides human resources, payroll, and employee benefits outsourcing services for small- to medium-sized businesses. Founded in 1971 and headquartered in Rochester, New York, the company has more than 100 offices serving approximately 800,000 payroll clients in the U.S. and Europe. Paychex is ranked 681st on the Fortune 500 list of largest corporations by revenue. History Paychex was founded in 1971 by Tom Golisano, who started the company with only $3,000. The operation grew to include 18 franchises and partnerships, which were eventually consolidated into one private company in 1979. In 1983, the company (ticker symbol: PAYX) became a public company via an initial public offering. Paychex acquired Pay-Fone in 1995. In 1996, the company acquired Olsen Computer Systems and National Business Systems. Between 2002 and 2003, it acquired Advantage Payroll Services, Interpay, and Time in a Box, followed by Time in a Box's parent Stromberg in 2004. The company purchased Hawthorne Benefit Technologies in 2007, SurePayroll, Inc. in 2010, and ePlan Services in 2011. It Icon Time Systems and ExpenseWire in 2012 for an undisclosed amount. Between 2013 and 2017, it purchased myStaffingPro NETtime solutions Advance Partners, and Human Resources Outsourcing, Inc. Rochester Democrat and Chronicle named Paychex one of the Best Places to Work in Rochester in 2016. It acquired Lessor Group 2018. That year it also acquired Oasis for a reported $1.2 billion. In 2019, Paychex was named to the Fortune list of Future 50 companies. John Gibson has been CEO of Paychex since October 2022. The company generated $5.2 billion in revenue and $13 billion in assets in 2024. In 2025, it acquired Paycor for $4.1 billion In May 2025, Paychex acquired SixFifty, the legal tech unit of U.S. law firm Wilson Sonsini Goodrich & Rosati, in an all-cash deal worth between $70 million and $85 million. Small Business Employment Watch Paychex and IHS Markit launched a Small Business Jobs Index in 2014 that measures the health of businesses employing 50 people or less. The IHS Markit Small Business Employment Watch shares small business jobs data beginning 2005 and wage data from 2011. The Employment Watch is frequently used by financial experts, analysts, and journalists assessing the economic outlook."
}