{
  "ticker": "PCAR",
  "cik": "0000075362",
  "company_name": "Paccar",
  "corrected_name": "Paccar",
  "wiki_title_used": "Paccar",
  "exists": true,
  "raw_text": "Paccar Inc. (stylized as PACCAR) is an American company primarily focused on the design and manufacturing of large commercial trucks through its subsidiaries DAF, Kenworth and Peterbilt sold across markets worldwide. The company is headquartered in Bellevue, Washington, in the Seattle metropolitan area, and was founded in 1971 as the successor to the Pacific Car and Foundry Company, from which it draws its name. The company traces its predecessors to the Seattle Car Manufacturing Company formed in 1905. In addition to its principal business, the company also has a parts division, a financial services segment, and manufactures and markets industrial winches. The company's stock is a component of the Nasdaq-100 and S&P 500 stock market indices.\n\nHistory\nThe company was founded by William Pigott Sr. as Seattle Car Manufacturing Company in 1905, with a capitalization of $10,000.  Its original business was the production of railway and logging equipment. The company built a new factory in Renton in 1909 after its Duwamish facility was destroyed in fire as well as to fulfill large number of orders. In 1917 it merged with a Portland firm, Twohy Brothers, which was its only competitor on the west coast at the time and company was renamed as Pacific Car and Foundry Company. The company manufactured horse or oxen-drawn logging trucks built specifically to address the dense, hilly forests in which the Northwest logging industry operated to transport massive logs. The following years the company specialized in designing air brakes, open cars, refrigerated boxcars for shipment of perishable items and the universal trailer which could be pulled by a truck. The company also manufactured structural steel that was finished by hand that was used to create columns and girders that went into many Seattle-area buildings. In 1924, the founder, William Pigott sold a controlling interest in the company to American Car and Foundry Company. However, his son, Paul Pigott reacquired a significant interest in the company from American Car and Foundry Company in 1934.\nDuring the Great Depression in 1930 despite the stock market crash, the company's earnings rose; but as the Great Depression deepened, Pacific Car and Foundry became one of the most depressed businesses in the Northwest. During the late 1930s, Pacific Car and Foundry received government contracts for steel fabrication for construction of Lacey V. Murrow Memorial Bridge as well as orders from other companies.\n\nDuring World War II\nDuring World War II, Pacific Car and Foundry's sales grew due to an increased demand for steel used in airplanes, airports, bridges, naval ships, highways and other equipment that helped build America's infrastructure to support the war effort. Pacific Car also sub-contracted for Boeing, building aluminum wing spars for B-17 bombers. During 1942 and 1943 the company also built M4A1 Sherman tanks for the U.S. Army. The company was able to cast almost all the parts for the tanks at its own foundry. Other notable vehicles that were built included the M25 tank transporter, known as the \"Dragon Wagon,\" and the T28 super-heavy tank. Everett-Pacific Shipbuilding & Dry Dock Company was established in 1942 that built ships and other marine products for the US Navy in Port Gardner Bay in Everett. It was bought by Pacific Car and Foundry in 1944.\n\nPost-war\nAfter World War II ended, Pacific Car was a part of the federal government's Mobilization Planning Program, which meant that it promised to devote 100 percent of its facilities to military production in the event of a national emergency. The company was a prime contractor during the Korean War for producing tanks. Pacific Car chose to subcontract many of the necessary parts, boosting smaller businesses in the state. In 1945 Pacific Car purchased the Kenworth Motor Truck Corporation. Named after founding stockholders Harry Kent and Edgar Worthington, Kenworth had been producing trucks in Seattle since it was incorporated in 1923. During World War II, Kenworth produced trucks, airplane assemblies and sub-assemblies for the United States military. As the war drew to an end Kenworth shifted attention to production of commercial trucks for the postwar market. In 1956 Kenworth lost independent status and became a division directly under Pacific Car and Foundry.\nIn 1954, Pacific Car acquired the Dart Truck Company of Kansas City, Missouri, and the Peterbilt Motors Company, of Oakland, California. Dart built primarily heavy off-highway dump trucks and specialty vehicles. Peterbilt had been a major competitor with Kenworth, producing many kinds of trucks and buses. Peterbilt operated as a wholly owned subsidiary of Pacific Car until 1960, following which it was dissolved and made a division of the company. Pacific Car's structural steel division made the steel used to build the 50-story Seattle-First National Bank headquarters and to build Seattle's Space Needle in 1961. The firm provided 5,668 steel panels, weighing 58,000 tons, which formed a major part of the load bearing walls for New York City's World Trade Center twin towers. The World Trade Center, like the Sea-First building, bore the building's load on the exterior walls rather than on an interior structural skeleton. The steel panels were shipped by rail from Seattle to New York City on more than 1,600 railcars. Pacific Car was the largest contractor of the 13 steel fabricators that provided steel for the World Trade Center towers.\n\nThe 1970s to 1990s\nIn 1970 PACCAR created an overseas manufacturing facility at Bayswater, Melbourne, Australia, producing Kenworth Trucks to serve the growing developing local and Southeast Asian Markets, which still trade strongly today. The first completed locally built truck rolled off the production line in March 1971, and Australian made vehicle exports commenced in 1975. Despite a serious slowdown due to recessions during 1974, PACCAR continued to generate increasing sales throughout the 1970s. PACCAR purchased Wagner Mining Company in 1975, which built underground Mining Vehicles, International Car Company in 1975 and Foden Trucks a British truck manufacturer in 1980. Fodens sold trucks in Europe and Africa. Paccar International was formed in 1972 that promoted exports worldwide. Paccar Technical Center was established in 1980 in Mount Vernon, Washington, as a research and testing facility. The facility included test tracks, engine test cells, materials test laboratories and structural laboratories. The tech center conducts an Open House event every April that coincides with the Skagit Valley Tulip Festival. In 1983 the International Car Co Division in Kenton Ohio, which had been acquired on December 1, 1975, was disbanded. In 1983 the Paccar Rail Leasing Inc subsidiary in Renton WA and the RAILEASE Inc subsidiary in Bellevue WA were disbanded. In 1986 the Pacific Car and Foundry subsidiary in Renton WA was renamed to Paccar Defense Systems Division. In 1984 PACCAR posted record sales in its history of $2.25 billion.\nIn the mid-1980s, PACCAR share of Class 8 trucks dropped to about 18% owing to aggressive competition from Freightliner Trucks, which is a subsidiary of Daimler AG and the merged operations of Volvo White and General. This competition forced PACCAR to close its Kenworth assembly plant in Kansas City in April, 1986 and its Peterbilt plant in Newark, California, the following October. PACCAR acquired Trico Industries in 1986 which was a manufacturer of oil exploration equipment based in Gardena, California, for $65 million in order to reduce its dependence on the Class 8 Truck market. During the mid-80's PACCAR was negotiating with the Rover Group, for acquiring its British Leyland truck division. However, Rover management decided to sell the truck division to DAF Trucks which was a Dutch automotive concern. Its Dart Truck Company and Wagner Mining Equipment Company were sold in 1984 and 1989 in order to remain profitable. In 1987, PACCAR entered the automotive parts & accessories retail market by acquiring Al's Auto Supply and Grand Auto Incorporated.\n\nThe 1990s and beyond\nPaccar Parts was created in 1992 in Renton, Washington. The building it was housed in occupied part of the company's historic Pacific Car and Foundry site. In the same year, PACCAR purchased a 21 percent stake in Wood Group ESP which added to its oil field equipment manufacturing. In 1993, PACCAR acquired a line of winches from heavy equipment manufacturer Caterpillar. The same year it brought a new plant in Washington on line to help meet the increased demand for trucks. In 1994 the company began selling in New Zealand for the first time and entered new countries in Asia and Central and South America. The company made its Mexican joint venture VILPAC, S.A., a wholly owned subsidiary in 1995. PACCAR's Winch division was one of the world's largest manufacturer of industrial winches by 1994.\nPaccar International marketed trucks to more than 40 countries, and was one of the largest exporters of capital goods in North America by 1995. Kenworth truck factory in Renton, Washington, was opened on June 4, 1993. In 1997 Mark Pigott assumed PACCAR's presidency as Charles Pigott retired in 1997. In 1996, the company spent $543 million to acquire DAF Trucks N.V. based in the Netherlands, an acquisition it first pursued back in the mid-1980s. The acquisition was funded in part by the sale of Trico Industries to EVI in 1997. Financial and leasing subsidiaries also performed well in the late 1990s. In 1998, PACCAR acquired UK-based Leyland Trucks, a manufacturer known for its light and medium truck (6 to 44 metric tons) design and manufacture capability. With its Peterbilt, Kenworth, and DAF nameplates, PACCAR ranks second in production numbers in the United States and third in production numbers globally in \"big rig\" truck production; behind Daimler Truck in the US market. Other major heavy-truck competitors include International Motors and Volvo.\n\nLeadership\nWilliam Pigott (1905–1937)\nPaul Pigott (1937–1961)\nRobert O'Brien (1961–1965)\nCharles Pigott (1965–1997)\nMark Pigott (1997–2013)\nRon Armstrong (2013–2019)\nPreston Feight (2019–present)\n\nSubsidiaries\nPeterbilt\nKenworth\nDAF Trucks\nLeyland Trucks\nPacLease\nPaccar Parts\nPaccar Financial Corp\nPaccar Global Sales\nPaccar ITD (Information Technology Division)\nDynacraft\nPaccar Technical Center\n\nFormer subsidiaries\nPacific Car and Foundry: Railroad freight cars and cabooses, and military vehicles manufactured at 1400 N 4th Street, Renton Washington.\nInternational Car Co Division: Railroad cabooses and freight cars manufactured at 31 Bales Road, Kenton Ohio.\nPACCAR Winch\n\nCriticism\nIn December 2011, the organization Public Campaign criticized PACCAR for spending $760,000 on lobbying and not paying any taxes during the severe economic recession of 2008–2010, instead getting $112 million in tax rebates, despite making a profit of $465 million.\n\nReferences\nSources\nDavid Wilma, Pacific Car and Foundry Co. becomes Paccar Inc on January 25, 1972, HistoryLink, April 11, 2001.\nPaccar – The Pursuit of Quality, Alex Groner and Barry Provorse; Documentary Media, Seattle, Washington, 2005 – 4th Edition\n\nExternal links\n\nOfficial website\nPaccar Inc, Paccar Official History Page Archived 2017-04-22 at the Wayback Machine\nBusiness data for Paccar: \nHistorical Annual Reports for Pacific Car and Foundry\nHistorical Annual Reports for PACCAR",
  "clean_text": "Paccar Inc. (stylized as PACCAR) is an American company primarily focused on the design and manufacturing of large commercial trucks through its subsidiaries DAF, Kenworth and Peterbilt sold across markets worldwide. The company is headquartered in Bellevue, Washington, in the Seattle metropolitan area, and was founded in 1971 as the successor to the Pacific Car and Foundry Company, from which it draws its name. The company traces its predecessors to the Seattle Car Manufacturing Company formed in 1905. In addition to its principal business, the company also has a parts division, a financial services segment, and manufactures and markets industrial winches. The company's stock is a component of the Nasdaq-100 and S&P 500 stock market indices. History The company was founded by William Pigott Sr. as Seattle Car Manufacturing Company in 1905, with a capitalization of $10,000. Its original business was the production of railway and logging equipment. The company built a new factory in Renton in 1909 after its Duwamish facility was destroyed in fire as well as to fulfill large number of orders. In 1917 it merged with a Portland firm, Twohy Brothers, which was its only competitor on the west coast at the time and company was renamed as Pacific Car and Foundry Company. The company manufactured horse or oxen-drawn logging trucks built specifically to address the dense, hilly forests in which the Northwest logging industry operated to transport massive logs. The following years the company specialized in designing air brakes, open cars, refrigerated boxcars for shipment of perishable items and the universal trailer which could be pulled by a truck. The company also manufactured structural steel that was finished by hand that was used to create columns and girders that went into many Seattle-area buildings. In 1924, the founder, William Pigott sold a controlling interest in the company to American Car and Foundry Company. However, his son, Paul Pigott reacquired a significant interest in the company from American Car and Foundry Company in 1934. During the Great Depression in 1930 despite the stock market crash, the company's earnings rose; but as the Great Depression deepened, Pacific Car and Foundry became one of the most depressed businesses in the Northwest. During the late 1930s, Pacific Car and Foundry received government contracts for steel fabrication for construction of Lacey V. Murrow Memorial Bridge as well as orders from other companies. During World War II During World War II, Pacific Car and Foundry's sales grew due to an increased demand for steel used in airplanes, airports, bridges, naval ships, highways and other equipment that helped build America's infrastructure to support the war effort. Pacific Car also sub-contracted for Boeing, building aluminum wing spars for B-17 bombers. During 1942 and 1943 the company also built M4A1 Sherman tanks for the U.S. Army. The company was able to cast almost all the parts for the tanks at its own foundry. Other notable vehicles that were built included the M25 tank transporter, known as the \"Dragon Wagon,\" and the T28 super-heavy tank. Everett-Pacific Shipbuilding & Dry Dock Company was established in 1942 that built ships and other marine products for the US Navy in Port Gardner Bay in Everett. It was bought by Pacific Car and Foundry in 1944. Post-war After World War II ended, Pacific Car was a part of the federal government's Mobilization Planning Program, which meant that it promised to devote 100 percent of its facilities to military production in the event of a national emergency. The company was a prime contractor during the Korean War for producing tanks. Pacific Car chose to subcontract many of the necessary parts, boosting smaller businesses in the state. In 1945 Pacific Car purchased the Kenworth Motor Truck Corporation. Named after founding stockholders Harry Kent and Edgar Worthington, Kenworth had been producing trucks in Seattle since it was incorporated in 1923. During World War II, Kenworth produced trucks, airplane assemblies and sub-assemblies for the United States military. As the war drew to an end Kenworth shifted attention to production of commercial trucks for the postwar market. In 1956 Kenworth lost independent status and became a division directly under Pacific Car and Foundry. In 1954, Pacific Car acquired the Dart Truck Company of Kansas City, Missouri, and the Peterbilt Motors Company, of Oakland, California. Dart built primarily heavy off-highway dump trucks and specialty vehicles. Peterbilt had been a major competitor with Kenworth, producing many kinds of trucks and buses. Peterbilt operated as a wholly owned subsidiary of Pacific Car until 1960, following which it was dissolved and made a division of the company. Pacific Car's structural steel division made the steel used to build the 50-story Seattle-First National Bank headquarters and to build Seattle's Space Needle in 1961. The firm provided 5,668 steel panels, weighing 58,000 tons, which formed a major part of the load bearing walls for New York City's World Trade Center twin towers. The World Trade Center, like the Sea-First building, bore the building's load on the exterior walls rather than on an interior structural skeleton. The steel panels were shipped by rail from Seattle to New York City on more than 1,600 railcars. Pacific Car was the largest contractor of the 13 steel fabricators that provided steel for the World Trade Center towers. The 1970s to 1990s In 1970 PACCAR created an overseas manufacturing facility at Bayswater, Melbourne, Australia, producing Kenworth Trucks to serve the growing developing local and Southeast Asian Markets, which still trade strongly today. The first completed locally built truck rolled off the production line in March 1971, and Australian made vehicle exports commenced in 1975. Despite a serious slowdown due to recessions during 1974, PACCAR continued to generate increasing sales throughout the 1970s. PACCAR purchased Wagner Mining Company in 1975, which built underground Mining Vehicles, International Car Company in 1975 and Foden Trucks a British truck manufacturer in 1980. Fodens sold trucks in Europe and Africa. Paccar International was formed in 1972 that promoted exports worldwide. Paccar Technical Center was established in 1980 in Mount Vernon, Washington, as a research and testing facility. The facility included test tracks, engine test cells, materials test laboratories and structural laboratories. The tech center conducts an Open House event every April that coincides with the Skagit Valley Tulip Festival. In 1983 the International Car Co Division in Kenton Ohio, which had been acquired on December 1, 1975, was disbanded. In 1983 the Paccar Rail Leasing Inc subsidiary in Renton WA and the RAILEASE Inc subsidiary in Bellevue WA were disbanded. In 1986 the Pacific Car and Foundry subsidiary in Renton WA was renamed to Paccar Defense Systems Division. In 1984 PACCAR posted record sales in its history of $2.25 billion. In the mid-1980s, PACCAR share of Class 8 trucks dropped to about 18% owing to aggressive competition from Freightliner Trucks, which is a subsidiary of Daimler AG and the merged operations of Volvo White and General. This competition forced PACCAR to close its Kenworth assembly plant in Kansas City in April, 1986 and its Peterbilt plant in Newark, California, the following October. PACCAR acquired Trico Industries in 1986 which was a manufacturer of oil exploration equipment based in Gardena, California, for $65 million in order to reduce its dependence on the Class 8 Truck market. During the mid-80's PACCAR was negotiating with the Rover Group, for acquiring its British Leyland truck division. However, Rover management decided to sell the truck division to DAF Trucks which was a Dutch automotive concern. Its Dart Truck Company and Wagner Mining Equipment Company were sold in 1984 and 1989 in order to remain profitable. In 1987, PACCAR entered the automotive parts & accessories retail market by acquiring Al's Auto Supply and Grand Auto Incorporated. The 1990s and beyond Paccar Parts was created in 1992 in Renton, Washington. The building it was housed in occupied part of the company's historic Pacific Car and Foundry site. In the same year, PACCAR purchased a 21 percent stake in Wood Group ESP which added to its oil field equipment manufacturing. In 1993, PACCAR acquired a line of winches from heavy equipment manufacturer Caterpillar. The same year it brought a new plant in Washington on line to help meet the increased demand for trucks. In 1994 the company began selling in New Zealand for the first time and entered new countries in Asia and Central and South America. The company made its Mexican joint venture VILPAC, S.A., a wholly owned subsidiary in 1995. PACCAR's Winch division was one of the world's largest manufacturer of industrial winches by 1994. Paccar International marketed trucks to more than 40 countries, and was one of the largest exporters of capital goods in North America by 1995. Kenworth truck factory in Renton, Washington, was opened on June 4, 1993. In 1997 Mark Pigott assumed PACCAR's presidency as Charles Pigott retired in 1997. In 1996, the company spent $543 million to acquire DAF Trucks N.V. based in the Netherlands, an acquisition it first pursued back in the mid-1980s. The acquisition was funded in part by the sale of Trico Industries to EVI in 1997. Financial and leasing subsidiaries also performed well in the late 1990s. In 1998, PACCAR acquired UK-based Leyland Trucks, a manufacturer known for its light and medium truck (6 to 44 metric tons) design and manufacture capability. With its Peterbilt, Kenworth, and DAF nameplates, PACCAR ranks second in production numbers in the United States and third in production numbers globally in \"big rig\" truck production; behind Daimler Truck in the US market. Other major heavy-truck competitors include International Motors and Volvo. Leadership William Pigott (1905–1937) Paul Pigott (1937–1961) Robert O'Brien (1961–1965) Charles Pigott (1965–1997) Mark Pigott (1997–2013) Ron Armstrong (2013–2019) Preston Feight (2019–present) Subsidiaries Peterbilt Kenworth DAF Trucks Leyland Trucks PacLease Paccar Parts Paccar Financial Corp Paccar Global Sales Paccar ITD (Information Technology Division) Dynacraft Paccar Technical Center Former subsidiaries Pacific Car and Foundry: Railroad freight cars and cabooses, and military vehicles manufactured at 1400 N 4th Street, Renton Washington. International Car Co Division: Railroad cabooses and freight cars manufactured at 31 Bales Road, Kenton Ohio. PACCAR Winch Criticism In December 2011, the organization Public Campaign criticized PACCAR for spending $760,000 on lobbying and not paying any taxes during the severe economic recession of 2008–2010, instead getting $112 million in tax rebates, despite making a profit of $465 million."
}