{
  "ticker": "PCG",
  "cik": "0001004980",
  "company_name": "PG&E Corporation",
  "corrected_name": "PG&E Corporation",
  "wiki_title_used": "PG&E Corporation",
  "exists": true,
  "raw_text": "Pacific Gas and Electric Company (PG&E) is an American investor-owned utility (IOU). The company is headquartered at Kaiser Center, in Oakland, California. PG&E provides natural gas and electricity to 5.2 million households in the northern two-thirds of California, from Bakersfield and northern Santa Barbara County, almost to the Oregon and Nevada state lines.\nOverseen by the California Public Utilities Commission, PG&E is the leading subsidiary of the holding company PG&E Corporation, which has a market capitalization of $34.9 billion as of March 10, 2025. PG&E was established on October 10, 1905, from the merger and consolidation of predecessor utility companies, and by 1984 was the United States' \"largest electric utility business\". PG&E is one of six regulated, investor-owned electric utilities (IOUs) in California; the other five are PacifiCorp, Southern California Edison, San Diego Gas & Electric, Bear Valley Electric, and Liberty Utilities.\nIn 2018 and 2019, the company received widespread media notoriety when investigations by the California Department of Forestry and Fire Protection (Cal Fire) found the company's infrastructure primarily responsible for causing two separate devastating wildfires in California, including the 2018 Camp Fire, the deadliest wildfire in California history. Because California holds utilities financially responsible for any fires caused by their equipment, even if maintenance was properly done, the potential of $30B of liability from these fires led the company to declare Chapter 11 bankruptcy in 2019. The company hoped to come out of bankruptcy by June 2020, and was successful, when U.S. Bankruptcy Judge Dennis Montali issued the final approval of the plan for PG&E to exit bankruptcy.\n\nHistory\nEarly history\nSan Francisco Gas\nIn the 1850s, manufactured gas was introduced to the United States for lighting. Larger American cities in the east built gasworks, but the west had no gas industry. San Francisco had \nstreet lights only on Merchant Street, in the form of oil lamps.\nThree brothers—Peter, James, and Michael Donahue—ran the foundry that became the Union Iron Works, the largest shipbuilding operation on the West Coast, and became interested in manufacturing gas Joseph G. Eastland, an engineer and clerk at the foundry, joined them in gathering information. In July 1852, James applied for and received from the Common Council of the City of San Francisco a franchise to erect a gasworks, lay pipes in the streets and install street lamps to light the city with \"brilliant gas\". The council specified that gas should be supplied to households \"at such rates as will make it to their interest to use it in preference to any other material\". Eastland and the Donahue brothers incorporated the San Francisco Gas Company on August 31, 1852, with $150,000 of authorized capital. It became the first gas utility in the West. Its official seal bore the inscription \"Fiat Lux\"—let there be light—the same slogan later adopted by the University of California. There were 11 original stockholders, and the three Donahue brothers subscribed for 610 of the 1,500 shares.\nThe original location for the gas works was bounded by First, Fremont, Howard and Natoma streets south of Market, on what was then  the shore of the San Francisco Bay. Work on the plant started in November 1852, and finished a few months later. On the night of February 11, 1854, the streets of San Francisco were for the first time lighted by gas. To celebrate the event, the company held a gala banquet at the Oriental Hotel. Gas lighting quickly gained public favor. In the first year of operation, the company had  237 customers. That number more than doubled the next year, to 563. By the end of 1855, the company had laid more than 6 ½ miles of pipe and 154 street lamps were in operation.\nThe growing popularity of gas light led to competing gas companies, including the Aubin Patent Gas Company and Citizens Gas Company. The San Francisco Gas Company quickly acquired these smaller rivals. However, one rival did provide serious competition. The Bank of California founded the City Gas Company in April 1870 to compete with the gas monopoly held by the Donahue brothers' operation. City Gas began operation in 1872 and initiated a price war with the San Francisco Gas Company. In 1873, the two companies negotiated a consolidation as a compromise and the Bank of California gained part ownership of \"the most lucrative gas monopoly in the West\". On April 1, 1873, the San Francisco Gas Light Company was formed, representing a merger of the San Francisco Gas Company, the City Gas Company, and the Metropolitan Gas Company.\n\nSan Francisco Gas and Electric\nGas utilities, including San Francisco Gas Light, faced new competition with the introduction of electric lighting to California. According to a 2012 PG&E publication and their 1952 commissioned history, in 1879, San Francisco was the first city in the U.S. to have a central generating station for electric customers. To stay competitive, the San Francisco Gas Light Company introduced the Argand lamp that same year. The lamp increased the light capacity of gas street lamps, but proved to be an expensive improvement and was not generally adopted. Meanwhile, the demand for electric light in the stores and factories of downtown San Francisco continued to grow. The first electric street light was erected in 1888 in front of City Hall, and the electrical grid supporting it was gradually extended. A second generating station was constructed in 1888 by the California Electric Light Company to increase production capacity.\nNew competition also emerged in the 1880s in the form of water gas, an improved illuminant patented by Thaddeus Lowe. The United Gas Improvement Company, a water gas manufacturer organized after purchasing the Lowe gas patents, acquired a lease and then an interest in San Francisco's Central Gas Light Company on November 1, 1883. United was acquired by the Pacific Gas Improvement Company in 1884. Under the management of president Albert Miller, Pacific Gas Improvement developed into a formidable competitor to San Francisco Gas Light. His sons, Horace A. Miller and C. O. G. Miller (Christian Otto Gerberding Miller), acting as Secretary and President, respectively, eventually owned and controlled not only the Pacific Gas Improvement Company but also the Pacific Gas Lighting Company (Pacific Lighting Company).\nIn 1888, San Francisco Gas Light built its own water gas plant at the Potrero gas works. The manufacturing of water gas proved successful due to the increased availability of inexpensive petroleum. The company decided to construct a modern gas works with both updated water gas manufacturing technology and a modern coal-gas plant as a hedge against shortages in the supply of oil. In 1891, the North Beach Gas Works was completed under the direction of San Francisco Gas Light president and engineer Joseph B. Crockett. The facility was the largest gas holder in the U.S. west of Chicago.\nIn 1896, the Edison Light and Power Company merged with the San Francisco Gas Light Company to form the new San Francisco Gas and Electric Company.Consolidation of gas and electric companies solved problems for both utilities by eliminating competition and producing economic savings through joint operation. Other companies that began operation as active competitors but eventually merged into the San Francisco Gas and Electric Company included the Equitable Gas Light Company, the Independent Electric Light and Power Company, and the Independent Gas and Power Company. In 1903, the company purchased its main competitor for gas lighting, the Pacific Gas Improvement Company.\n\nPacific Gas and Electric Company\nJohn Martin and Eugene J. de Sabla, started out as gold miners along the Yuba River, harnessing hydroelectric power, building hydro plants in Nevada City (1895), and Northern California.\nIn the early 1890s, Martin, de Sabla, Alfonso Tregidgo, and later, Romulus Riggs Colgate, began developing a hydroelectric powerhouse on the South Fork of the Yuba River.\nIn 1899, Martin and de Sabla formed Yuba Power Company. In 1900, Martin and de Sabla created the Bay Counties Power Company, constructing a 140-mile transmission line for an electric railway in Oakland. In 1903, John Martin and Eugene de Sabla started the California Gas & Electric Company to acquire and merge gas and electric power businesses, and bought many utilities like Oakland Gas Light & Heat Company, United Gas & Electric Company, and, in 1905, San Francisco Gas & Electric Company.\nIn 1905, Martin and de Sabla formed Pacific Gas and Electric Company.\nAccording to PG&E's 2012 history timeline on their webpage, the San Francisco Gas and Electric Company and the California Gas and Electric Corporation merged to form the Pacific Gas and Electric Company (PG&E) on October 10, 1905. The consolidation gave the California Gas and Electric Corporation access to the large San Francisco market and a base for further financing. The San Francisco Gas and Electric Company, in turn, was able to reinforce its electric system, which until then had been powered entirely by steam-operated generating plants, which could not compete with lower cost hydroelectric power. After the merger, engineers and management from each organization made plans to coordinate and unify the two systems. However, the two firms maintained separate corporate identities until 1911.\nPG&E began delivering natural gas to San Francisco and northern California in 1930. The longest pipeline in the world connected the Texas gas fields to northern California, with compressor stations that included cooling towers every 300 miles (480 km), at Topock, Arizona, on the state line, and near the town of Hinkley, California. With the introduction of natural gas, the company began retiring its polluting gas manufacturing facilities, although it did keep some plants on standby. Today a network of eight compressor stations linked by \"40,000 miles of distribution pipelines and over 6,000 miles of transportation pipelines\" serves \"4.2 million customers from Bakersfield to the Oregon border\".\nIn the 1950s and 1960s, at both the Topock and Hinkley compressor stations, a hexavalent chromium additive was used to prevent rust in the cooling towers, which later was the cause of the Hinkley groundwater contamination. It disposed of the water from the cooling towers \"adjacent to the compressor stations\".\n\nThe 1906 San Francisco earthquake\nPG&E was significantly affected by the 1906 San Francisco earthquake. The company's assorted central offices were damaged by the quake and destroyed by the subsequent fire. Its San Francisco Gas and Electric Company subsidiary in particular suffered significant infrastructure loss, as its distribution systems—miles of gas mains and electric wires—were dissevered. Only two gas and two electric plants, all located far from the city, survived the destruction. These functioning facilities—including the new 4,000,000-foot crude oil gas works at Potrero Generating Station—played critical roles in San Francisco's rebuilding efforts. Many of PG&E's utility competitors ceased operation following the Great Earthquake. The company's substantial capital allowed it to survive, rebuild, and expand.\n\nSacramento Electric, Gas and Railway Company\nIn 1906, PG&E purchased the Sacramento Electric, Gas and Railway Company and took control of its railway operations in and around Sacramento. The Sacramento City Street Railway began operating under the Pacific Gas & Electric name in 1915, and its track and services subsequently expanded. By 1931 the Sacramento Street Railway Division operated 75 streetcars on 47 miles (76 km) of track. PG&E's streetcars were powered by the company's hydroelectric plant in Folsom. In 1943, PG&E sold the rail service to Pacific City Lines, which was later acquired by National City Lines. Several streetcar lines were soon converted to bus service, and the track was abandoned entirely in 1947.\nDuring this same period, Pacific City Lines and its successor, National City Lines, with funding from General Motors, Firestone Tire, Standard Oil of California (through a subsidiary, Federal Engineering), Phillips Petroleum, and Mack Trucks, were buying streetcar lines and rapidly converting most of them to bus service. This consortium was convicted in 1949 of federal charges involving conspiracy to monopolize interstate commerce in the sale of buses and supplies to National City Lines and its subsidiaries. The actions became known as the Great American Streetcar Scandal or the General Motors Streetcar Conspiracy.\n\nFurther consolidation and expansion\nWithin a few years of its incorporation, PG&E made significant inroads into Northern California's hydroelectric industry through purchase of existing water storage and conveyance facilities. These included many reservoirs, dams, ditches and flumes built by mining interests in the Sierras that were no longer commercially viable. By 1914, PG&E was the largest integrated utility system on the Pacific Coast. The company handled 26 percent of the electric and gas business in California. Its operations spanned 37,000 square miles across 30 counties.\nThe company expanded in the 1920s through strategic consolidation. Important acquisitions during this period included the California Telephone and Light Company, the Western States Gas and Electric Company and the Sierra and San Francisco Power Company, which provided hydropower to San Francisco's streetcars. These three companies added valuable properties and power and water sources. By the end of 1927, PG&E had nearly one million customers and provided electricity to 300 Northern Californian communities.\nIn 1930, PG&E purchased majority stock holdings in two major Californian utility systems—Great Western Power and San Joaquin Light and Power—from The North American Company, a New York investment firm. In return, North American received shares of PG&E's common stock worth $114 million. PG&E also gained control of two smaller utilities, Midland Counties Public Service and the Fresno Water Company, which was later sold. The acquisition of these utilities did not result in an immediate merger of property and personnel. The Great Western Power Company and the San Joaquin Company remained separate corporate entities for several more years. But through this final major consolidation, PG&E soon served nearly all of Northern and Central California through one integrated system.\n\nNatural gas\nThe gas industry market structure was dramatically altered by the discovery of massive natural gas fields throughout the American Southwest beginning in 1918. The fuel was cleaner than manufactured gas and less expensive to produce. While natural gas sources were abundant in Southern California, no economical sources were available in Northern California. In 1929, PG&E constructed a 300-mile pipeline from the Kettleman oil field to bring natural gas to San Francisco. The city became the first major urban area to switch from manufactured gas to natural gas. The transition required the adjustment of burners and airflow valves on 1.75 million appliances. In 1936, PG&E expanded distribution with an additional 45-mile pipeline from Milpitas. PG&E gradually retired its gas manufacturing facilities, although some plants were kept on standby.\nDefense activities boosted natural gas sales in California during World War II, but cut deeply into the state's natural reserves. In 1947, PG&E entered into a contract with the Southern California Gas Company and the Southern Counties Gas Company to purchase natural gas through a new 1,000-mile pipeline running from Texas and New Mexico to Los Angeles. Another agreement was reached with the El Paso Natural Gas Company of Texas for gas delivery to the California-Arizona border. In 1951, PG&E completed a 502-mile main that connected with the El Paso network at the state line.\nDuring this period of expansion PG&E was involved in legal proceedings with the Securities and Exchange Commission regarding the company's status as a subsidiary of the North American Company. As outlined by the Public Utility Holding Company Act of 1935, a utility subsidiary was defined as a utility company with more than 10% of their stock held by a public utility holding company. Though 17% of PG&E stock was held by the North American Company at this time, PG&E filed with the SEC to be exempted from subsidiary status on the grounds that 17% ownership did not give the North American Company control and because the North American Company occupied only two board member spots. The North American Company backed PG&E's request by stating that they were involved in business operations in a limited capacity. The request remained unresolved until 1945 when the North American Company sold off stocks that brought its ownership to below 10%. The SEC then ruled that PG&E was not a subsidiary of the North American Company. In 1948, the North American Company sold its remaining stock in PG&E.\n\nNuclear plants and gas pipelines\nIn 1957, the company brought online Vallecitos Nuclear Center, the first privately owned and operated nuclear reactor in the United States, in Pleasanton, California. The reactor initially produced 5,000 kilowatts of power, enough to power a town of 12,000.\nIn addition to nuclear power, PG&E continued to develop natural gas supplies as well. In 1959, the company began working to obtain approval for the import of a large quantity of natural gas from Alberta, Canada to California, via a pipeline constructed by Westcoast Transmission Co. and the Alberta and Southern Gas Company on the Canadian side, and by Pacific Gas Transmission Company, a subsidiary of PG&E, on the U.S. side. Construction of the pipeline lasted 14 months. Testing began in 1961, and the completed 1,400-mile pipeline was dedicated in early 1962.\nPG&E began construction on another nuclear facility, the Diablo Canyon Power Plant, in 1968. Originally slated to come online in 1979, the plant's opening was delayed for several years due to environmental protests and concerns over the safety of the plant's construction. Testing of the plant began in 1984, and energy production was brought up to full power in 1985.\nDuring the construction of the Diablo Canyon plant, PG&E continued its efforts to bring natural gas supplies from the North to their service area in California. In 1972, the company began exploring possibilities for a 3,000-mile pipeline from Alaska, which would travel through the Mackenzie River Valley and on to join with the previously constructed pipeline originating in Alberta.\nIn 1977 the Mackenzie Valley Pipeline project received approval from the U.S. Federal Power Commission and support from the Carter Administration. The pipeline still required approval from Canada. Plans for the pipeline were placed on hold in 1977 by a Canadian judge. Justice Thomas R. Berger of British Columbia shelved the project for at least 10 years, citing concerns from First Nations groups, whose land the pipeline would have traversed, as well as potential environmental impacts.\nIn 1984 the great-grandson of PG&E's founder George H. Roe—David Roe published his book entitled Dynamos and Virgins during the time when there was a growing antinuclear-power movement. David Roe, who was an environmentalist and the Environmental Defense Fund's West Coast general counsel, \"mounted an assault on the longstanding assumption that steady growth in coal- and nuclear-generating capacity was the only solution to the nation's energy needs\". He based his arguments on an economic analysis \"aimed at showing that a shift to energy conservation and alternative energy sources alone could slake the thirst for electricity\".\n\n1990s, deregulation, and decline\nAs of December 1992, PG&E operated 173 electric generating units and 85 generating stations, 18,450 miles (29,690 km) of transmission lines and 101,400 miles (163,200 km) of distribution system.\nIn 1997, PG&E reorganized as a holding company, PG&E Corporation. It consisted of two subsidiaries—PG&E, the regulated utility, and a non-regulated energy business.\nIn the later 1990s, under electricity market deregulation this utility sold off most of its natural gas power plants. The utility retained all of its hydroelectric plants, the Diablo Canyon Power Plant and a few natural gas plants, but the large natural gas plants it sold made up a large portion of its generating capacity. This had the effect of requiring the utility to buy power from the energy generators at fluctuating prices, while being forced to sell the power to consumers at a fixed cost. The market for electricity was dominated by the Enron Corporation, which, with help from other corporations, artificially pushed prices for electricity ever higher. This led to the California electricity crisis that began in 2000 on Path 15, a transmission corridor PG&E built.\nWith a critical power shortage, rolling blackouts began on January 17, 2001.\n\n1990s fires\nIn 1994, PG&E caused the Trauner Fire in Nevada County, California through criminal negligence. The fire burned many acres of land and destroyed a schoolhouse and twelve homes near the town of Rough and Ready, California. PG&E was found guilty of causing the fire and of 739 counts of criminal negligence.\nIn 1996, one of PG&E's substations in the Mission District of San Francisco caught fire. PG&E was eventually found legally culpable for the fire due to criminal negligence, according to an investigation in 2003.\nThe 1999 Pendola Fire in the Plumas and Tahoe National Forests burned nearly 12,000 acres and was found to have been caused by poor vegetation management by PG&E.\n\n2001 bankruptcy\nIn 1998, a change in the regulation of California's public utilities, including PG&E, began. The California Public Utility Commission (CPUC) set the rates that PG&E could charge customers and required them to provide as much power as the customers wanted at rates set by the CPUC.\nIn the summer of 2001 a drought in the northwest states and in California reduced the amount of hydroelectric power available. Usually PG&E could buy \"cheap\" hydroelectric power under long-term contracts with the Bonneville Dam and other sources. Drought and delays in approval of new power plants and market manipulation decreased available electric power generation capacity that could be generated in state or bought under long-term contracts out of state. Hot weather brought on higher usage, rolling blackouts, and other problems.\nWith little excess generating capacity of its own, PG&E was forced to buy electricity out of state from suppliers without long-term contracts. Because PG&E had to buy additional electricity to meet demand, some suppliers took advantage of this requirement and manipulated the market by creating artificial shortages and charged very high electrical rates, as exemplified by the Enron scandal. The CPUC refused to adjust the allowable electric rates. Unable to change rates and sell electricity to consumers for what it cost them on the open market PG&E started hemorrhaging cash.\nPG&E Company (the utility, not the holding company) entered bankruptcy under Chapter 11 on April 6, 2001. The state of California tried to bail out the utility and provide power to PG&E's 5.1 million customers under the same rules that required the state to buy electricity at market rate high cost to meet demand and sell it at a lower fixed price, and as a result, the state also lost significant amounts of money. The crisis cost PG&E and the state somewhere between $40 and $45 billion.\nPG&E Company, the utility, emerged from bankruptcy in April 2004, after paying $10.2 billion to its hundreds of creditors. As part of the reorganization, PG&E's 5.1 million electricity customers will have to pay above-market prices for several years to cancel the debt.\n\nSouth San Joaquin Irrigation District (SSJID)\nIn 2009 the California Public Utilities Commission (CPUC) unanimously approved a resolution that would allow the South San Joaquin Irrigation District to purchase PG&E's electric facilities in Manteca, Ripon and Escalon. In March 2016, San Joaquin County Superior Court Judge Carter Holly has rejected PG&E claims that South San Joaquin Irrigation District lacks sufficient revenues to provide electrical retail service to the cities of Manteca, Ripon, and Escalon and surrounding farms.\" The Municipal Service Review (MSR) found that SSJID's customer rates would be 15 percent lower than PG&E rates.\n\n2019 bankruptcy\nChronology\nFacing potential liabilities of $30 billion from multiple wildfires in the years 2015–2018, Pacific Gas and Electric Company (PG&E), on January 14, 2019, began the process of filing for bankruptcy with a 15-day notice of intention to file for bankruptcy protection. On January 29, 2019, PG&E Corporation, the parent corporation of PG&E, filed for bankruptcy protection. Because fire survivors are unsecured creditors with the same priority as bondholders, they would only be paid in proportion to their claim size if anything is left after secured and priority claims are paid; this nearly ensured that they will not get paid in full.  PG&E had a deadline of June 30, 2020 to exit bankruptcy in order to participate in the California state wildfire insurance fund established by AB 1054 that helps utilities pay for future wildfire claims.\nOn August 16, 2019, liability for the Tubbs Fire was potentially added when U.S. Bankruptcy Judge Dennis Montali ruled that a fast-track state jury trial could proceed to resolve who is at fault for the Tubbs Fire. Cal Fire determined that customer equipment was at fault, but lawyers representing wildfire victims claimed that PG&E equipment was at fault. This trial was scheduled to begin January 7, 2020 in San Francisco. The court case was superseded by the Restructuring Support Agreement (RSA) of December 9, 2019 and by the approved bankruptcy reorganization plan, wherein PG&E accepted liability for the Tubbs Fire.\nLiability for the Kincade Fire that started October 23, 2019 was potentially added, because initially it was unknown whether or not PG&E was at fault for the fire. On July 16, 2020, which was after PG&E exited bankruptcy, Cal Fire reported that the fire was caused by PG&E transmission lines. Damages would not be covered by the settlement for wildfire victims that was part of the PG&E bankruptcy.\nPG&E settled for $1 billion with state and local governments in June, 2019, and settled for $11 billion with insurance carriers and hedge funds in September, 2019. Representatives for wildfire victims say PG&E owes $54 billion or more, and PG&E was offering $8.4 billion for fire damages, Cal Fire, and FEMA. If more than 500 homes were completely destroyed by the Kincade Fire, and PG&E was found to be at fault, then the parties agreeing to the settlements may have the option to back out of the agreements. Later PG&E offered a $13.5 billion fund to cover claims of the wildfire victims. FEMA originally requested PG&E for $3.9 billion from the wildfire victims fund, threatening to take the money from individual wildfire victims if PG&E did not pay, and Cal OES had an overlapping $2.3 billion request, but they later settled for $1 billion after all wildfire victims are paid.\nClaims for wildfire victims consist of wrongful death, personal injuries, property loss, business losses, and other legal damages. U.S. District Judge James Donato was assigned to the estimation process for the claims of wildfire victims, including whether or not personal injury and wrongful death claims can include damages due to emotional distress. Judge Donato was scheduled to begin hearings February 18, 2020 to determine how to do the estimation and how much PG&E needs to put in a trust fund for wildfire victims. Bankruptcy judge Montali said that the costs to government agencies will not be subject to the estimation process because those costs can be calculated \"down to the penny.\" The court case was superseded by the Restructuring Support Agreement (RSA) of December 9, 2019 and by the approved bankruptcy reorganization plan.\nOn October 9, 2019, Judge Montali allowed the proposed reorganization plan of the senior bondholders to be considered along with PG&E's proposed plan. The proposal of the senior bondholders had the support of the committee of wildfire victims, who said their claims may be worth $13.5 billion. The proposal of the senior bondholders would give them control of the company with PG&E shareholders losing out, and PG&E called the proposal an \"unjustified windfall\". Later PG&E reached an agreement with the bondholders and the committee of wildfire victims so that PG&E's proposed plan would be the only plan under consideration and the bondholders would not take control of the company.\n\nOn November 12, 2019, PG&E in its proposed reorganization plan provided an additional $6.6 billion for the claims of wildfire victims and other claimants, increasing the amount to $13.5 billion, similar to the amount in the rival reorganization proposal of the senior bondholders. In a filing with the Securities and Exchange Commission (SEC), this puts the total amount for fire claims at $25.5 billion. This consists of $11 billion to insurance companies and investment funds, $1 billion to state and local governments, and $13.5 billion for other claims. The $11 billion settlement to insurance companies and investment funds was opposed by the state of California Governor Gavin Newsom and by the committee of wildfire victims. Later Governor Newsom and the wildfire victims approved the bankruptcy reorganization plan.\nOn December 6, 2019, PG&E proposed to settle the wildfire victim claims for a total of $13.5 billion, which would cover liability for its responsibility originating from the Camp Fire, Tubbs Fire, Butte Fire, Ghost Ship warehouse fire, and also a series of wildfires beginning on October 8, 2017, collectively called the 2017 North Bay Fires. The offer was tendered as part of PG&E's plan to exit bankruptcy. Wildfire victims will get half of their $13.5 billion settlement as stock shares in the reorganized company, adding to the uncertainty as to when and how much they will be paid. On June 12, 2020, because of uncertainties in the value of the liquidated stock, in part because of the financial market impact of the COVID-19 pandemic, PG&E agreed to increase the amount of stock. Wildfire victims will be paid in cash, funded partly from the cash portion of the settlement, and partly from stock that will be liquidated into cash on a schedule and at a price that is not yet determined.\nOn December 17, 2019, regarding the Ghost Ship warehouse fire, which was not a wildfire, Judge Dennis Montali allowed the plaintiffs' case claiming that the fire was caused by an electrical malfunction to continue against PG&E. This case, if successful, would receive money from PG&E's $900 million insurance money, but would not be eligible to be part of the $13.5 billion allotted for the claims arising from the wildfires. On August 18, 2020, PG&E settled the civil lawsuit for 32 of the victims, out of the 36 who perished in the fire. The amount of the settlement was undisclosed, but it was limited to the amount available under PG&E's insurance coverage for the year 2016.\nOn June 16, 2020, PG&E pleaded guilty to 84 counts of involuntary manslaughter for those that died in the Camp Fire, for which it will pay the maximum fine of $3.5 million and end all further criminal charges against PG&E. This action does not alleviate PG&E of any future civil claims by victims of the Camp Fire which would fall outside the bankruptcy proceedings, as well as how existing litigation against PG&E may be handled.\nOn Saturday, June 20, 2020, U.S. Bankruptcy Judge Dennis Montali issued the final approval of the plan for the reorganized PG&E to exit bankruptcy, meeting the June 30, 2020 deadline for PG&E to qualify for the California state wildfire insurance fund for utilities. On July 1, PG&E funded the Fire Victim Trust (FVT) with $5.4 billion cash and 22.19% of stock in the reorganized PG&E, which covers most of the obligations of its settlement for the wildfire victims. PG&E has two more payments totaling $1.35 billion cash, scheduled to be paid in January 2021 and January 2022, to complete its obligations to the wildfire victims.\n\nLoan from US Department of Energy\nIn December 2024, the U.S. Department of Energy's Loan Programs Office announced it would extend a $15 billion (US) low-interest loan to support the modernization of PG&E’s hydroelectric power structure. This investment also will enhance transmission lines critical for renewable energy integration, data center operations, and the growing fleet of electric vehicles. Initially requested as a $30 billion (US) loan, the amount was reduced due to concerns over the company’s repayment capacity. As the largest loan ever sanctioned by the DOE Energy Loans Program, this represents key funding for PG&E, particularly as it navigates the aftermath of its complex bankruptcy proceedings and legal challenges related to California's wildfires.\n\nOther information\nOn January 14, 2019, following the departure of CEO Geisha Williams, who had led the corporation since 2017; PG&E corporation announced that it was filing for Chapter 11 bankruptcy in response to the financial challenges associated with catastrophic wildfires that had occurred in Northern California, in 2017 and 2018.\nOn January 15, 2019, PG&E stated it did not intend to make the semiannual interest payment of $21.6 million on its outstanding 5.40 percent Senior Notes, due January 15, 2040, which has a total capital value of $800 million. Under the indenture, the company had a 30-day grace period (expired on February 14, 2019) to make the interest payment, before triggering a default event.\nPG&E Corporation filed for bankruptcy on January 29, 2019.  The company's disclosure statement was approved on March 17, 2020.\nAccording to Cbonds, the company has 32 bond issues, and their outstanding amount is approximately equal to $17.5 billion. PG&E expects procedures to take two years. In April, as the bondholders crafted a plan to bring the company out of bankruptcy, Governor Gavin Newsom expressed his concern that new board members would have little knowledge of California and lack expertise in how to run a utility safely.\nIn April 2019, PG&E announced a new CEO and management team, led by former head of Progress Energy Inc and the Tennessee Valley Authority Bill Johnson, that would assume charge of the company, as it went through bankruptcy.\nOn November 1, 2019, Governor Newsom issued a statement calling upon PG&E to reach a \"consensual resolution\" to the bankruptcy case, intending to convene a meeting of PG&E Corporation's executives and stockholders, as well as wildfire victims. If an agreement could not be reached, the State of California \"will not hesitate to step in and restructure the utility\". A week prior, Newsom had declared PG&E's \"greed and mismanagement\", along with the utility's lack of focus on hardening its grid and under-grounding its transmission lines in vulnerable areas, as reasons for its inability to deliver electricity and the shutdowns. \"They simply did not do their job,\" said Newsom.\nA proposal to turn PG&E into a customer owned cooperative, initiated by San Jose Mayor Sam Liccardo, has received backing from more than 110 elected officials that represent majority of PG&E customers and include 21 other mayors. The City of San Francisco offered to buy PG&E's electrical infrastructure within the city for $2.5 billion in September 2019 (while PG&E was in bankruptcy), but the offer was rejected by PG&E.\nIn March 2020, PG&E asked a federal court to approve $454 million in bonuses just days after asking another federal judge (William Alsup, who was overseeing PG&E's criminal probation related to the 2010 San Bruno pipeline explosion) not to force the utility to hire more tree trimmers.\nAs part of its emergence from bankruptcy, it will pay wildfire victims $13.5 billion; half of that amount will be paid in company stock, resulting in 70,000 fire victims owning 22% of the company.\nThis bankruptcy of PG&E Company was the largest utility bankruptcy in U.S. history, and was one of the most complex bankruptcies in U.S. history.\nIn November 2020, it was announced that Patti Poppe would be leaving CMS Energy on December 1, 2020, to become CEO of PG&E Corporation on January 4, 2021. In April 2022, it was reported that PG&E Corporation CEO Patti Poppe received over $50 million in total direct compensation for her work in 2021, with $40 million of that being in company stock.\nIn June 2020, PG&E announced that it planned to move its headquarters to 300 Lakeside Drive in Oakland. The move will happen in phases, starting in 2022 and completing by 2026.\nIn December 2024, the Department of Energy offered PG&E a $15 billion loan, to \"expand hydropower generation and battery storage, upgrade transmission capacity through reconductoring and grid enhancing technologies, and enable virtual power plants throughout PG&E’s service area.\"\n\nGeneration portfolio\nPG&E's utility-owned generation portfolio consists of an extensive hydroelectric system, one operating nuclear power plant, one operating natural gas-fired power plant, and another gas-fired plant under construction. Two other plants owned by the company have been permanently removed from commercial operation: Humboldt Bay Unit 3 (nuclear) and Hunters Point (natural gas).\n\nHydroelectric\nPG&E is the largest private owner of hydroelectric facilities in the United States including 174 dams. According to the company's Form 10-K filing for 2011, \"The Utility's hydroelectric system consists of 110 generating units at 68 powerhouses, including the Helms pumped storage facility, with a total generating capacity of 3,896 MW ... The system includes 99 reservoirs, 56 diversions, 174 dams, 172 miles of canals, 43 miles of flumes, 130 miles of tunnels, 54 miles of pipe (penstocks, siphons and low head pipes), and 5 miles of natural waterways.\"\nThe single largest component is the Helms Pumped Storage Plant, located at 37°02′13.78″N 118°57′53.63″W near Sawmill Flat in Fresno County, California. Helms consists of three units, each rated at 404 MW, for a total output of 1,212 MW. The facility operates between Courtright and Wishon reservoirs, alternately draining water from Courtright to produce electricity when demand is high, and pumping it back into Courtright from Wishon when demand is low. The Haas Powerhouse is situated more than 1,000 feet (300 m) inside a granite mountain.\n\nNuclear\nThe Diablo Canyon Power Plant, located in Avila Beach, California, is the only operating nuclear asset owned by PG&E. The maximum output of this power plant is 2,240 MWe, provided by two equally sized units. As designed and licensed, it could be expanded to four units, at least doubling its generating capacity. Over a two-week period in 1981, 1,900 activists were arrested at Diablo Canyon Power Plant. It was the largest arrest in the history of the U.S. anti-nuclear movement.\nIn June 2016, PG&E announced plans to close Diablo Canyon in 2025. This would make California free of operating commercial nuclear power plants, but will mean the loss of 2256 MW of generation that produced over 18,000 GWh of electricity per year.\nThe company operated the Humboldt Bay Power Plant, Unit 3 in Eureka, California. It is the oldest commercial nuclear plant in California and its maximum output was 65 MWe. The plant operated for 13 years, until 1976 when it was shut down for seismic retrofitting. New regulations enacted after the Three Mile Island accident rendered the plant unprofitable and it was never restarted. Unit 3 is currently in decommissioning phase. Based on PG&E's schedule of planned decommissioning activities, which incorporates various assumptions, including approval of its proposed new scope, decommissioning of the Unit 3 site is expected to conclude in 2019.\nPacific Gas & Electric planned to build the first commercially viable nuclear power plant in the United States at Bodega Bay, a fishing village fifty miles north of San Francisco. The proposal was controversial and conflict with local citizens began in 1958. In 1963, there was a large demonstration at the site of the proposed Bodega Bay Nuclear Power Plant. The conflict ended in 1964, with the forced abandonment of plans for the power plant.\n\nCombustion\nBuilt in 1956, two natural gas/fuel oil units at Humboldt Bay Power Plant produced 105 MWe of combined output. These units, along with two 15 MWe Mobile Emergency Power Plants (MEPPs), were retired in the summer of 2010, and replaced by the Humboldt Bay Generating Station, built on the same site. It produces 163 MWe using natural gas for fuel and fuel oil for backup on Wärtsilä Diesel engines. The new facility is 33% more efficient and produces 85% fewer ozone-forming compounds,  and produces 34% fewer greenhouse gas emissions. It has a closed-loop cooling system, eliminating use of water from Humboldt Bay for cooling.\nAs part of a settlement with Mirant Services LLC for alleged market manipulations during the 2001 California energy crisis, PG&E took ownership of a partially constructed natural gas unit in Antioch, California. The 530 MW unit, known as the Gateway Generating Station, was completed by PG&E and placed into operation in 2009.\nOn May 15, 2006, after a long and bitter political battle, PG&E shut down its 48-year-old Hunters Point Power Plant in San Francisco.\nPG&E broke ground in 2008 on a 660 MW natural gas power plant located in Colusa County. It began operation in December 2010, and serves nearly half a million residences using the latest technology and environmental design. The plant will use dry cooling technology to dramatically reduce water usage, and cleaner-burning turbines to reduce CO2 emissions by 35 percent relative to older plants.\n\nSolar\nOn April 1, 2008, PG&E announced contracts to buy three new solar power plants in the Mojave Desert. With an output of 500 MW and options for another 400 MW, the three installations will initially generate enough electricity to power more than 375,000 residences.\nIn April 2009, PG&E's Next100 blog reported that PG&E was asking the California Public Utilities Commission to approve a project by the company Solaren to deliver 200 megawatts of power to California from space. This method of obtaining electricity from the sun eliminates (mostly) the darkness of night experienced from solar sites on the surface of the earth. According to PG&E spokesman Jonathan Marshall, energy purchase costs are expected to be similar to other renewable energy contracts.\n\nPG&E and the environment\nBeginning in the mid-1970s, regulatory and political developments began to push utilities in California away from a traditional business model. In 1976, the California State Legislature amended the 1974 Warren–Alquist Act, which created and gives legal authority to the California Energy Commission, to effectively prohibit the construction of new nuclear power plants. The Environmental Defense Fund (EDF) filed as an intervenor in PG&E's 1978 General Rate Case (GRC), claiming that the company's requests for rate increases were based on unrealistically high projections of load growth. Furthermore, EDF claimed that PG&E could more cost-effectively encourage industrial co-generation and energy efficiency than build more power plants. As a result of EDF's involvement in PG&E's rate cases, the company was eventually fined $50 million by the California Public Utilities Commission for failing to adequately implement energy efficiency programs.\nIn the early first decade of the 21st century, the CEO of PG&E Corporation, Peter Darbee, and then-CEO of Pacific Gas & Electric Company, Tom King, publicly announced their support for California Assembly Bill 32, a measure to cap statewide greenhouse gas emissions and a 25% reduction of emissions by 2020. The bill was signed into law by Governor Arnold Schwarzenegger on September 27, 2006.\nIn 2014, PG&E had a renewables mix of 28%. By 2016, 32.9% of PG&E's power sources were renewable.\nDuring 2017, PG&E announced that 80% of the company's delivered electricity comes from GHG-free sources, including renewables, nuclear, and hydropower. Around 33% comes from renewable sources, thus meeting California's goal of 33% of electricity coming from renewables by 2020, nearly three years in advance.\nIn February 2019, PG&E submitted its Wildfire Safety Plan to the California Public Utilities Commission outlining its efforts to prevent wildfires caused by electrical equipment. It has since increased its preventative efforts and engagement in discussions around climate adaptation as extreme weather conditions increase.\nIn June 2020, PG&E announced a 12-month R&D effort along with Socalgas and Twelve to convert raw biogas into carbon neutral methane. This technology would enable energy from renewable resources (such as wind and solar) to generate fuel from landfills, sewage, and dairy farms.\n\nGroundwater contamination in Hinkley, California\nFrom 1952 to 1966, PG&E dumped \"roughly 370 million gallons\" of chromium 6-tainted wastewater into unlined wastewater spreading ponds around the town of Hinkley, California. PG&E used chromium 6—\"one of the cheapest and most efficient commercially available corrosion inhibitors\"—at their compressor station plants in their cooling towers along the natural gas transmission pipelines.\nPG&E did not inform the local water board of the contamination until December 7, 1987, stalling action on a response to the contamination. The residents of Hinkley filed a successful lawsuit against PG&E in which the company paid $333 million— the largest settlement ever paid in a direct-action lawsuit in U.S. history. The legal case, dramatized in the 2000 film Erin Brockovich, became an international cause célèbre. In response, in 2001, at the request of the CalEPA, the Chromate Toxicity Review Committee was formed to investigate the toxicity of chromium-6 when ingested. In 2003, a Senate hearing revealed that the committee's members included expert witnesses from PG&E, who had influenced the final August 2001 report which found in PG&E's favor concluding that other reports were alarmist with \"spuriously high\" statistics and that further evaluation should be handled by academics in laboratory settings not by regulators. In July 2014, California became the first state to acknowledge that ingested chromium-6 is linked to cancer and as a result has established a chromium-6 maximum contaminant level (MCL) of 10 parts per billion (ppb). In setting the regulations, it was acknowledged that in \"recent scientific studies in laboratory animals, Hexavalent Chromium has also been linked to cancer when ingested\". Previously, when older chromium MCLs were set, \"at the time Total Chromium MCLs were established, ingested Hexavalent Chromium associated with consumption of drinking water was not considered to pose a cancer risk, as is now the case.\"\nBy 2013, PG&E had cleaned up 54 acres, but it is estimated the remediation process will take another 40 years. PG&E built a concrete wall barrier that is about a half-mile-long to contain the plume, pump ethanol into the ground to convert chromium-6 into chromium-3, and have planted acres of alfalfa. They created a chicken farm to use the alfalfa. PG&E uses irrigation to maintain these large circles of green in the otherwise desert area, and was asked to stop because of the ongoing danger of residents inhaling chromium 6.\nIn 2015, the California Regional Water Quality Control Board, Lahontan Region served PG&E with a new order \"to cleanup [sic] and abate the effects of the discharge of chromium waste or threatened pollution or nuisance\". By the time of the report, the plume had expanded to \"8 miles in length and approximately 2 miles in width, throughout the Hinkley Valley and into Harper Dry Lake Valley\", polluting new areas. In early 2016, the New York Times described Hinkley as having been slowly turned into a ghost town due to the contamination of the area with owners unable to sell their properties.\nEpidemiologist John Morgan produced a 2010 report for the California Cancer Registry in which he argued that there was no cancer cluster in Hinkley related to chromium 6. In one study, Morgan had claimed that cancer rates in Hinkley \"remained unremarkable from 1988 to 2008\" saying that \"the 196 cases of cancer reported during the most recent survey of 1996 through 2008 were less than what he would expect based on demographics and the regional rate of cancer.\" In 2013, the Center for Public Integrity found glaring weaknesses in Morgan's 2010 analysis that challenged the validity of his findings. \"In his first study, he dismisses what others see as a genuine cancer cluster in Hinkley. In his latest analysis, he excludes people who were exposed to the worst contamination.\"\n\nWildfires\nPG&E equipment has often been the cause of wildfires in California. PG&E has been found guilty of criminal negligence in many cases involving fires. These include the 1994 Trauner Fire, a substation fire in San Francisco in 1996, the 1999 Pendola Fire, a San Francisco substation fire in 2003, the Sims Fire and Fred's Fire in 2004, an explosion and electrical fire in San Francisco in 2005, the 2008 Rancho Cordova Gas Explosion, the 2010 San Bruno pipeline explosion, 2014 Carmel Gas Explosion, 2015 Butte Fire, 2018 Camp Fire, among others.\nApproximately forty of the 315 wildfires in PG&E's service area in 2017 and 2018 were allegedly caused by PG&E equipment.\nPG&E was on probation after being found criminally liable in the 2010 San Bruno fire. Following that fire, a federally appointed monitor initially focused on gas operations, but his scope expanded to include electricity distribution equipment following the fires in October 2017. A separate case involved allegations the utility falsified gas pipeline records between 2012 and 2017, and as of January 2019 was still being considered.\nPG&E, like two large Southern California utilities, is now required to submit an annual wildfire prevention plan. The California law judges who reviewed the plan submitted in February 2019 suggested more metrics and maintenance partnerships with local governments, but recommended approving the plan. They also recommended investigating whether disabling equipment that restarts power transmission could reduce the need for power shutoffs. PG&E has filed a motion which in May 2019 had not yet been ruled upon, to amend this plan to move some of the deadlines further out.\n\nLiability\nThe state's constitution enshrined a principle of \"inverse condemnation\" for wildfire liability, which means that utilities are held responsible for damages resulting from any fire caused by their equipment, even if their maintenance on equipment and surrounding vegetation was done to standards. California's interpretation of inverse condemnation is unique; the tenet is applied in other states, usually to government entities that damage private property when engaged in a public service, but California's courts have ruled the principle can be applied to utilities. This means that the utilities are held liable for damage, even if they comply with all of California's strict energy-related rules.\nThis policy resulted in $30B of liability for PG&E from the 2017 & 2018 fires and drove it to bankruptcy proceedings.\nIn July 2019, a new $21 billion wildfire trust fund was created to pay for damages from future wildfires, started with a 50-50 balance of utility and customer monies and also reduced the liability threshold for utilities to where customers must prove negligence before companies are held liable.\n\nUndergrounding\nAs of 2019, public utilities in the state of California have a total of 26,000 miles of high voltage transmission lines, and 240,000 miles of distribution lines.  Distribution lines bring electricity directly to consumers; two-thirds statewide are above ground.\nFor transmission lines, the cost of undergrounding is about $80 million per mile while for distribution lines, the cost of underground lines is about $3 million per mile, compared to overhead lines at about $800,000 per mile.\nThe state's largest utility, PG&E, has 107,000 miles of distribution lines, 81,000 miles of which are overhead.  The cost in 2019 to convert all of PG&E's overhead distribution lines to underground lines would cost a total of $240 billion, or $15,000 per PG&E customer. (This cost estimate is only for distribution lines, not the higher voltage transmission lines.)\nIn July 2021, PG&E announced that it plans to bury an additional 10,000 miles of its distribution lines over the next 10 years, (about 9% more; 25% are already underground) to reduce the risk of wildland fires.  It already has 27,000 miles of distribution lines underground, but these are generally not in high fire risk areas. (Nationwide, 18% of distribution lines are underground, partly because all new commercial and residential developments are built this way.)  This project has been estimated to cost about $4 million per mile, or $40 billion in total, though PG&E's CEO stated that she hopes that they can get costs down to a total of $15–20 billion. The costs are likely to be passed on to the utility's 5.5 million customers, who already have some of the highest electricity rates in the nation.\n\nPublic safety power shutoffs\nRecognizing that the \"2017 California wildfire season was the most destructive wildfire season on record,\" the CPUC issued Resolution ESRB-8 in July 2018. The resolution supported the use of de-energization as a means to mitigate wildfire risks and established notification, mitigation, and reporting requirements. The first of those Public Safety Power Shutoffs (PSPS) undertaken by PG&E occurred on October 14, 2018, and lasted until October 16th for the majority of customers. Since then there have been PSPS outages on June 8 and 9, 2019, and throughout the rest of the summer. In October 2019, PG&E began to shut off power to many regions, as a preemptive measure to help avoid wildfires caused by electric lines.\nThe shutdown of nearly 25,000 miles (40,000 km) of electric lines was expected to affect more than 2 million people, of PG&E's 16 million total served.  Power was projected to remain off for up to several days after the high winds subside as all of the shutdown lines must be inspected for wind damage. By two days into the preemptive blackout, winds began to subside, and PG&E restored power to some 500,000 customers of a total of approximately 800,000 who lost power.\nSince 2018, PG&E has increased its efforts to prevent and mitigate wildfires including a 24/7 threat-monitoring center, multiplying its vegetation regulations around utility poles from four to 15 feet and adding 100 weather stations in high-risk areas. The company's strategy also includes augmenting public service power shutdowns when needed.\nPower shutoffs in California continued in 2020 and 2021. In 2021, the company announced it had included a new technological strategy that uses machine learning models with more predictive capabilities. They can inject these predictions of fire spread directly into the PSPS decision-making process, so they can make more accurate PSPS implementations.\nIn 2021, California fined PG&E $106 million (US) for violating guidelines in 2019 PSPS executions by insufficient communication with the public.\n\nWildfires\n1997 Sierra blaze\nOn June 19, 1997, a Nevada County jury in Nevada City found PG&E guilty of \"a pattern of tree-trimming violations that sparked a devastating 1994 wildfire in the Sierra\". \"PG&E was convicted of 739 counts of criminal negligence for failing to trim trees near its power lines—the biggest criminal conviction ever against the state's largest utility.\"\n\n2015 Butte Fire\nIn September 2015, the deadly and destructive Butte Fire ignited in Amador and Calaveras counties. It killed two people and destroyed hundreds of structures. An investigation found PG&E responsible for the fire after a gray pine tree came in contact with one of their powerlines.\n\nOctober 2017 Northern California wildfires\nIn October 2017, PG&E was responsible for their own lines and poles starting thirteen separate fires of the 250 that devastated Northern California. These fires were caused by \"electric power and distribution lines, conductors and the failure of\npower poles\". Pending further investigation, the following fires have been confirmed by CAL FIRE investigators to have been started by PG&E equipment:\n\nRedwood Fire, Mendocino County\nSulphur Fire in Lake County\nCherokee Fire, Butte County\n37 Fire, Sonoma County\nBlue Fire, Humboldt County\nPocket Fire, Sonoma County,\nAtlas Fire, Napa County\nNorrbom, Adobe, Partrick, Pythian and Nuns fires of Sonoma and Napa County\nCascade Fire, Yuba County\n\n2017 Tubbs Fire\nThe Tubbs Fire was a wildfire in Northern California during October 2017. At the time, the Tubbs Fire was the most destructive wildfire in California history, burning parts of Napa, Sonoma, and Lake counties, inflicting its greatest losses in the city of Santa Rosa. Suspicion for the cause of the fire fell on PG&E, but the company seemed to be cleared of responsibility in this incident after Cal Fire released the results of its investigation on January 24, 2019, upon which news the company's stock price jumped dramatically.\nOn August 14, 2019, U.S. Bankruptcy Judge Dennis Montali, the federal judge for the 2019 PG&E bankruptcy proceedings, presided over a hearing for victims of the Tubbs Fire, and they presented their case for a fast-track state civil trial by jury to resolve if PG&E is at fault for the Tubbs Fire, rather than customer equipment causing the fire as determined by Cal Fire. On August 16, 2019, the judge ruled that the trial can proceed \"on a parallel track\" because \"it advances the goals of this bankruptcy.\" After the judge's ruling, the company's stock price sank by 25%.\nOn December 6, 2019, PG&E proposed to settle the wildfire victim claims for a total of $13.5 billion, which would cover liability for its responsibility originating from the Tubbs Fire, Camp Fire, Butte Fire, and also a series of wildfires beginning on October 8, 2017, collectively called the 2017 North Bay Wildfires. The offer was tendered as part of PG&E's plan to exit bankruptcy. The court case for the Tubbs Fire was superseded by the Restructuring Support Agreement (RSA) of December 9, 2019 and by the approved bankruptcy reorganization plan, wherein PG&E accepted liability for the Tubbs Fire.\n\n2018 Camp Fire\nIn November 2018, PG&E and its parent company were sued in the San Francisco County Superior Court by multiple victims of the Camp Fire – the deadliest and most destructive wildfire in California history. The Camp Fire destroyed more than 18,000 buildings, including 14,000 homes, being particularly devastating to poorer residents. Approximately 90% of the population of the town of Paradise, California as of June 2020 remains dispersed in other parts of the state and the country. The lawsuit accused PG&E of failure to properly maintain its infrastructure and equipment.\nThe cause of the fire, as indicated by PG&E's \"electric incident report\" submitted to the California Public Utilities Commission, was a power failure on a transmission line on November 8, just 15 minutes before the fire was first reported near the same location.  Later investigation revealed that a \"broken hook may have allowed a piece of electrically charged equipment to swing free and come close enough to the tower to arc, providing the spark that ignited the blaze.\"\nThe California Department of Forestry and Fire Protection and state utility regulators are investigating PG&E to determine if they complied with state laws.\nAs a result, both Pacific Gas and Electric Company and parent company PG&E Corporation together filed for Chapter 11 bankruptcy on January 29 following the California required 15-day bankruptcy waiting period. PG&E settled criminal proceedings with a fine, pleaded guilty to one felony count of illegally starting a fire, and 84 felony counts of involuntary manslaughter.\nCivil lawsuit proceedings continued, and were resolved by settlement. On July 1, 2020, PG&E funded the Fire Victim Trust (FVT) with $5.4 billion in cash and 22.19% of stock in the reorganized PG&E, which covers most of the obligations of its settlement for the wildfire victims. PG&E has two more payments totaling $1.35 billion in cash, scheduled to be paid in January 2021 and January 2022, to complete its obligations to the wildfire victims.\n\n2019 Kincade Fire\nThe Kincade Fire was a wildfire that burned in Sonoma County, California. The fire started northeast of Geyserville in The Geysers on 9:24 p.m. on October 23, 2019, and subsequently burned 77,758 acres (31,468 ha) until the fire was fully contained on November 6, 2019. The fire threatened over 90,000 structures and caused widespread evacuations throughout Sonoma County, including the communities of Geyserville, Healdsburg, and Windsor. The majority of Sonoma County and parts of Lake County were under evacuation warnings. The fire was the largest of the 2019 California wildfire season.\nInitially, it was unknown whether or not PG&E was at fault for the fire. On July 16, 2020, which was after PG&E exited bankruptcy, Cal Fire reported that the fire was caused by PG&E transmission lines. Damages would not be covered by the settlement for wildfire victims that was part of the PG&E bankruptcy.\n\n2020 Zogg Fire\nThe Zogg Fire (named that because it started at Zogg Mine Road and Jenny Bird Lane) was a wildfire that burned 56,338 acres (22,799 ha) in southwestern Shasta County and northwestern Tehama County, which are both in California, in the United States, as part of the severe 2020 California wildfire season. The fire was first reported on September 27, 2020, and was not fully contained until October 13, 2020, by which time it had destroyed much of the communities of Igo and Ono, killing four people and destroying 204 buildings\nIn March 2021, investigations concluded the fire began when a grey pine tree fell on power lines belonging to the Pacific Gas and Electric Company (PG&E).The tree reportedly had been potentially identified for removal, but had not been removed after the Carr Fire in 2018.\n\n2021 Dixie Fire\nOn January 4, 2022, CalFire determined that \"the Dixie Fire was caused by a tree contacting electrical distribution lines owned and operated by Pacific Gas and Electric (PG&E) located west of Cresta Dam.\"  CalFire forwarded the investigative report to the Butte County District Attorney's office, the same office that prosecuted PG&E in 2018 following the Camp Fire.\n\nIncidents\n2013 Metcalf sniper attack\nOn April 16, 2013, a team of gunmen opened fire on the Metcalf transmission substation in Coyote, California. The attack damaged 17 high-voltage transformers, causing more than $15 million in damage. The team also cut a fiber-optic telecommunications cable owned by AT&T. PG&E and AT&T offered a $250,000 reward for anyone who had information leading to the arrest of the culprits, however, they were never found. The Federal Bureau of Investigation found that it was not domestic terrorism, and The Department of Homeland Security claimed they had evidence that it may have been an 'inside job'.\n\n2010 San Bruno, California explosion\nOn the evening of September 9, 2010, a suburb of San Francisco, San Bruno, California, was damaged when one of PG&E's natural-gas pipelines that was \"at least 54 years old, 30 inches (76.2 centimeters) in diameter and located under a street intersection in a residential area \"...exploded sending a \"28-foot section of pipe weighing 3,000 pounds flying through the air, fueled by blowing natural gas\". The blast created a crater at the epicenter and \"killed eight people and injured nearly five dozen more while destroying about 100 homes\". The USGS reported that the shock wave was similar to a 1.1 magnitude earthquake. Following the event, the company was heavily criticized for ignoring the warnings of a state inspector in 2009 and for failing to provide adequate safety procedures. The incident then came under investigation by the National Transportation Safety Board (NTSB). On August 30, 2011, the NTSB released its findings, which placed fault for the blast on PG&E. The report stated that the pipeline that exploded, installed in 1956, did not even meet standards of that time.\nPG&E was charged with \"twelve criminal felony counts alleging violations of the Natural Gas Pipeline Safety Act. PG&E pleaded not guilty to the \"criminal counts in both the initial and superseding indictments, opting to put the prosecutors to their proof\". On April 1, 2014, a United States grand jury in San Francisco charged PG&E with \"knowingly and willfully\" violating the Natural Gas Pipeline Safety Act.\nIn August 2015, the California Public Utilities Commission levied a $300 million fine against PG&E which they paid. PG&E also \"refunded $400 million to gas customers and agreed to pay $850 million for gas-system safety improvements. It also settled more than $500 million in claims involving victims of the disaster and their relatives.\"\nEven in the years following the disaster, PG&E failed to implement legally mandated safety procedures aimed at preventing similar disasters. A CPUC report was issued in December 2018 that concluded that between 2012 and 2017, PG&E failed to locate and mark gas pipelines in a timely manner because of staff shortages, and management counted, possibly, \"tens of thousands\" of late tickets as completed on time. Contractors rely on this process to know where they can safely dig. PG&E was fined $110 million for these legal violations.\n\n2016 Ghost Ship warehouse fire\nOn December 2, 2016, in Fruitvale, Oakland, California a fire broke out in a former warehouse that had been illegally converted into an artist collective with living spaces known as Ghost Ship. 80-100 people were at an event in the space and 36 were killed. The plaintiffs claim that the fire was caused by an electrical malfunction. A civil case was put forward against PG&E, alleging blame.\nIn August 2020, PG&E settled a civil lawsuit for 32 of the victims, out of the 36 who perished in the fire. The amount of the settlement was undisclosed, but it was limited to the amount available under PG&E's insurance coverage for the year 2016.\n\nCriticism\nRates\nThe PG&E and other investor owned utilities that are essentially granted monopoly status in California are guaranteed a negotiated fair rate of return on equity (ROE). PG&E's ROE rate was set at 10.4% and a return on rate base (ROR) was set at 8.06% by the CPUC in December 2012. PG&E electricity rates are among the highest in the United States. In his 2013 paper Jonathan Cook of the UC Davis Energy Efficiency Center, described the 'unique factors' that explain why PG&E's rates are higher than other utilities in California. According to Cook, PG&E procures 60% of its electricity supply from third party generators and 40% from nuclear, fossil fuel and hydroelectric power plants. Many of the dams that produce PG&E's hydroelectric power were built in the early 1900s and require high maintenance. The cost of hydroelectric power maintenance is estimated to rise from $28 million in 2012 to $48 million. PG&E \"current and near-term capital expenditures are dominated by Diablo Canyon and its hydroelectric system\". Operations and maintenance (O&M) expenses are expected to rise especially with new regulations in place after the Fukushima accident. PG&E uses less natural gas than its competitors and is expected \"to experience slower price growth rates\" particularly if there are high emission allowance prices.\nAs of 2021, PG&E electricity rates are 80% above the national average, mostly because of high fixed costs, which consume between 66 and 77% of system-wide expenses and do not change based on how much electricity is consumed. These fixed costs include maintenance, generation, transmission, distribution, and wildfire mitigation. According to a study by the nonprofit think tank Next 10 with the energy institute at UC Berkeley's Haas Business School, net-metering causes higher electricity rates, because many households with solar are not paying their share of the system's fixed costs, even though they rely on the system for much of their electricity.\n\nTax dodging and lobbying\nIn December 2011, the non-partisan organization Public Campaign criticized PG&E for spending $79 million on lobbying and not paying any taxes during 2008–2010, instead getting $1 billion in tax rebates, despite making a profit of $4.8 billion and increasing executive pay by 94% to $8.5 million in 2010 for its top five executives.\n\nControversies\n1970 Native American protest\nIn 1970, the Pit River Tribe began a boycott of PG&E. The tribe claimed that the land being used by PG&E was rightfully theirs and that they should receive the profits from it. People subsequently sent boycott checks to the tribe, including musician Buffy Sainte-Marie who sent a $150 check.\n\n2002 Restating of balance sheets\nOn February 28, 2002, after the collapse of Enron, which used dubious accounting and partnerships to hide its debt, PG&E announced to restate results dating back to 1999, to show leases related to power plant construction that had been previously kept off its balance sheet.\nOn June 27, 2003, PG&E National Energy Group, a unit of PG&E Corporation, revised its 2002 Form 10-K/A to reclassify certain offsetting revenues and expenses, which net to zero. PG&E revised its 2002 Form 10-K/A accordingly to reflect the change.\n\n2014 Community Pipeline Safety Initiative (CPSI)\nIn 2014, PG&E rolled out the \"Pipeline Pathways\" project, later rebranded \"Community Pipeline Safety Initiative\", a $500 million four-year effort to clear trees along the almost 7,000 miles of high pressure gas transmission pipeline in California. PG&E said that removing trees was necessary to 1) provide emergency access should an incident occur under a tree and 2) protect pipelines from tree roots. Many communities have protested the removal of private and public trees. According to local opposition groups, PG&E's safety claims for tree removal are incorrect and tree removal makes aerial monitoring of pipeline faster and cheaper. In 2017, several lawsuits have been filed in Contra Costa County Court by the non-profit organization Save Lafayette Trees stating that PG&E did not conduct the proper CEQA reviews or provide ample public notice before signing agreements for tree removal.\nPG&E's California-wide tree removal may have in fact caused widespread, increased stress corrosion cracking (SCC), according to PG&E's own dead tree root studies: \"Given the fact that the tree roots were shown to cause coating damage, one must conclude that they also will increase the likelihood of SCC. It also is possible that decaying tree roots could create or increase the potency of an SCC environment at the pipe surface by increasing the amount of CO2 in the soil.\" (Source: from \"Effects of Tree Roots on External Corrosion Control\", 3/25/15, Det Norske Veritas, section 3.3 Stress Corrosion Cracking, p. 165 of final TRIA report)\n\nProposition 16 (2010)\nIn 2010, PG&E was accused of attempting to stifle competition with Proposition 16, which mandated approval from two-thirds of voters to start or expand a local utility. Critics argued that this would make it harder for local governments to create their own power utilities, effectively giving PG&E a monopoly. The company was also rebuked for supplying $46 million to support the ballot measure when opponents raised $100,000 in the campaign. The proposition was voted down with 52.5% in opposition and 47.5% in favor.\n\n2014 Email scandal\nIn 2014, a California state government investigation revealed that some top executives of PG&E had been in regular communications with high-ranking officials at the state regulatory body California Public Utilities Commission for years. PG&E and also been allegedly \"judge shopping\" during this time. PG&E Vice President of Regulatory Affairs Brian Cherry, Senior Vice President of Regulatory Affairs Tom Bottorff, and Vice President of Regulatory Proceedings Trina Horner were all fired after the email scandal was revealed.\n\n2018 \"Locate and Mark\" Investigation\nThe California Public Utilities Commission (CPUC) launched an investigation in December 2018 into PG&E's \"locate and mark\" practices. CPUC had found that PG&E falsified tens of thousands of \"Call Before You Dig\" records. Additionally, the company violated state laws, endangered its own employees, and endangered California residents through various illicit company practices every year between 2012 and 2016. In January 2020, the company was fined US$110 million (equivalent to $131 million in 2024) by the State of California. This all occurred subsequent to the 2010 San Bruno pipeline explosion which PG&E caused due to similar malpractice.\nPG&E responded by instituting a \"Corrective Action Plan\", issuing a statement about safety being important, and firing several employees.  Nick Stavropoulos, its COO and president, announced a retirement at the time though the company did not say whether it was directly a result of CPUC's findings.\n\nSee also\nDiablo Canyon Power Plant\nErin Brockovich\nHinkley groundwater contamination\nGrid-tied electrical system\nList of articles associated with nuclear issues in California\nRaker Act\nSan Diego Gas & Electric\nSouthern California Edison\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for PG&E Corporation:",
  "clean_text": "Pacific Gas and Electric Company (PG&E) is an American investor-owned utility (IOU). The company is headquartered at Kaiser Center, in Oakland, California. PG&E provides natural gas and electricity to 5.2 million households in the northern two-thirds of California, from Bakersfield and northern Santa Barbara County, almost to the Oregon and Nevada state lines. Overseen by the California Public Utilities Commission, PG&E is the leading subsidiary of the holding company PG&E Corporation, which has a market capitalization of $34.9 billion as of March 10, 2025. PG&E was established on October 10, 1905, from the merger and consolidation of predecessor utility companies, and by 1984 was the United States' \"largest electric utility business\". PG&E is one of six regulated, investor-owned electric utilities (IOUs) in California; the other five are PacifiCorp, Southern California Edison, San Diego Gas & Electric, Bear Valley Electric, and Liberty Utilities. In 2018 and 2019, the company received widespread media notoriety when investigations by the California Department of Forestry and Fire Protection (Cal Fire) found the company's infrastructure primarily responsible for causing two separate devastating wildfires in California, including the 2018 Camp Fire, the deadliest wildfire in California history. Because California holds utilities financially responsible for any fires caused by their equipment, even if maintenance was properly done, the potential of $30B of liability from these fires led the company to declare Chapter 11 bankruptcy in 2019. The company hoped to come out of bankruptcy by June 2020, and was successful, when U.S. Bankruptcy Judge Dennis Montali issued the final approval of the plan for PG&E to exit bankruptcy. History Early history San Francisco Gas In the 1850s, manufactured gas was introduced to the United States for lighting. Larger American cities in the east built gasworks, but the west had no gas industry. San Francisco had street lights only on Merchant Street, in the form of oil lamps. Three brothers—Peter, James, and Michael Donahue—ran the foundry that became the Union Iron Works, the largest shipbuilding operation on the West Coast, and became interested in manufacturing gas Joseph G. Eastland, an engineer and clerk at the foundry, joined them in gathering information. In July 1852, James applied for and received from the Common Council of the City of San Francisco a franchise to erect a gasworks, lay pipes in the streets and install street lamps to light the city with \"brilliant gas\". The council specified that gas should be supplied to households \"at such rates as will make it to their interest to use it in preference to any other material\". Eastland and the Donahue brothers incorporated the San Francisco Gas Company on August 31, 1852, with $150,000 of authorized capital. It became the first gas utility in the West. Its official seal bore the inscription \"Fiat Lux\"—let there be light—the same slogan later adopted by the University of California. There were 11 original stockholders, and the three Donahue brothers subscribed for 610 of the 1,500 shares. The original location for the gas works was bounded by First, Fremont, Howard and Natoma streets south of Market, on what was then the shore of the San Francisco Bay. Work on the plant started in November 1852, and finished a few months later. On the night of February 11, 1854, the streets of San Francisco were for the first time lighted by gas. To celebrate the event, the company held a gala banquet at the Oriental Hotel. Gas lighting quickly gained public favor. In the first year of operation, the company had 237 customers. That number more than doubled the next year, to 563. By the end of 1855, the company had laid more than 6 ½ miles of pipe and 154 street lamps were in operation. The growing popularity of gas light led to competing gas companies, including the Aubin Patent Gas Company and Citizens Gas Company. The San Francisco Gas Company quickly acquired these smaller rivals. However, one rival did provide serious competition. The Bank of California founded the City Gas Company in April 1870 to compete with the gas monopoly held by the Donahue brothers' operation. City Gas began operation in 1872 and initiated a price war with the San Francisco Gas Company. In 1873, the two companies negotiated a consolidation as a compromise and the Bank of California gained part ownership of \"the most lucrative gas monopoly in the West\". On April 1, 1873, the San Francisco Gas Light Company was formed, representing a merger of the San Francisco Gas Company, the City Gas Company, and the Metropolitan Gas Company. San Francisco Gas and Electric Gas utilities, including San Francisco Gas Light, faced new competition with the introduction of electric lighting to California. According to a 2012 PG&E publication and their 1952 commissioned history, in 1879, San Francisco was the first city in the U.S. to have a central generating station for electric customers. To stay competitive, the San Francisco Gas Light Company introduced the Argand lamp that same year. The lamp increased the light capacity of gas street lamps, but proved to be an expensive improvement and was not generally adopted. Meanwhile, the demand for electric light in the stores and factories of downtown San Francisco continued to grow. The first electric street light was erected in 1888 in front of City Hall, and the electrical grid supporting it was gradually extended. A second generating station was constructed in 1888 by the California Electric Light Company to increase production capacity. New competition also emerged in the 1880s in the form of water gas, an improved illuminant patented by Thaddeus Lowe. The United Gas Improvement Company, a water gas manufacturer organized after purchasing the Lowe gas patents, acquired a lease and then an interest in San Francisco's Central Gas Light Company on November 1, 1883. United was acquired by the Pacific Gas Improvement Company in 1884. Under the management of president Albert Miller, Pacific Gas Improvement developed into a formidable competitor to San Francisco Gas Light. His sons, Horace A. Miller and C. O. G. Miller (Christian Otto Gerberding Miller), acting as Secretary and President, respectively, eventually owned and controlled not only the Pacific Gas Improvement Company but also the Pacific Gas Lighting Company (Pacific Lighting Company). In 1888, San Francisco Gas Light built its own water gas plant at the Potrero gas works. The manufacturing of water gas proved successful due to the increased availability of inexpensive petroleum. The company decided to construct a modern gas works with both updated water gas manufacturing technology and a modern coal-gas plant as a hedge against shortages in the supply of oil. In 1891, the North Beach Gas Works was completed under the direction of San Francisco Gas Light president and engineer Joseph B. Crockett. The facility was the largest gas holder in the U.S. west of Chicago. In 1896, the Edison Light and Power Company merged with the San Francisco Gas Light Company to form the new San Francisco Gas and Electric Company.Consolidation of gas and electric companies solved problems for both utilities by eliminating competition and producing economic savings through joint operation. Other companies that began operation as active competitors but eventually merged into the San Francisco Gas and Electric Company included the Equitable Gas Light Company, the Independent Electric Light and Power Company, and the Independent Gas and Power Company. In 1903, the company purchased its main competitor for gas lighting, the Pacific Gas Improvement Company. Pacific Gas and Electric Company John Martin and Eugene J. de Sabla, started out as gold miners along the Yuba River, harnessing hydroelectric power, building hydro plants in Nevada City (1895), and Northern California. In the early 1890s, Martin, de Sabla, Alfonso Tregidgo, and later, Romulus Riggs Colgate, began developing a hydroelectric powerhouse on the South Fork of the Yuba River. In 1899, Martin and de Sabla formed Yuba Power Company. In 1900, Martin and de Sabla created the Bay Counties Power Company, constructing a 140-mile transmission line for an electric railway in Oakland. In 1903, John Martin and Eugene de Sabla started the California Gas & Electric Company to acquire and merge gas and electric power businesses, and bought many utilities like Oakland Gas Light & Heat Company, United Gas & Electric Company, and, in 1905, San Francisco Gas & Electric Company. In 1905, Martin and de Sabla formed Pacific Gas and Electric Company. According to PG&E's 2012 history timeline on their webpage, the San Francisco Gas and Electric Company and the California Gas and Electric Corporation merged to form the Pacific Gas and Electric Company (PG&E) on October 10, 1905. The consolidation gave the California Gas and Electric Corporation access to the large San Francisco market and a base for further financing. The San Francisco Gas and Electric Company, in turn, was able to reinforce its electric system, which until then had been powered entirely by steam-operated generating plants, which could not compete with lower cost hydroelectric power. After the merger, engineers and management from each organization made plans to coordinate and unify the two systems. However, the two firms maintained separate corporate identities until 1911. PG&E began delivering natural gas to San Francisco and northern California in 1930. The longest pipeline in the world connected the Texas gas fields to northern California, with compressor stations that included cooling towers every 300 miles (480 km), at Topock, Arizona, on the state line, and near the town of Hinkley, California. With the introduction of natural gas, the company began retiring its polluting gas manufacturing facilities, although it did keep some plants on standby. Today a network of eight compressor stations linked by \"40,000 miles of distribution pipelines and over 6,000 miles of transportation pipelines\" serves \"4.2 million customers from Bakersfield to the Oregon border\". In the 1950s and 1960s, at both the Topock and Hinkley compressor stations, a hexavalent chromium additive was used to prevent rust in the cooling towers, which later was the cause of the Hinkley groundwater contamination. It disposed of the water from the cooling towers \"adjacent to the compressor stations\". The 1906 San Francisco earthquake PG&E was significantly affected by the 1906 San Francisco earthquake. The company's assorted central offices were damaged by the quake and destroyed by the subsequent fire. Its San Francisco Gas and Electric Company subsidiary in particular suffered significant infrastructure loss, as its distribution systems—miles of gas mains and electric wires—were dissevered. Only two gas and two electric plants, all located far from the city, survived the destruction. These functioning facilities—including the new 4,000,000-foot crude oil gas works at Potrero Generating Station—played critical roles in San Francisco's rebuilding efforts. Many of PG&E's utility competitors ceased operation following the Great Earthquake. The company's substantial capital allowed it to survive, rebuild, and expand. Sacramento Electric, Gas and Railway Company In 1906, PG&E purchased the Sacramento Electric, Gas and Railway Company and took control of its railway operations in and around Sacramento. The Sacramento City Street Railway began operating under the Pacific Gas & Electric name in 1915, and its track and services subsequently expanded. By 1931 the Sacramento Street Railway Division operated 75 streetcars on 47 miles (76 km) of track. PG&E's streetcars were powered by the company's hydroelectric plant in Folsom. In 1943, PG&E sold the rail service to Pacific City Lines, which was later acquired by National City Lines. Several streetcar lines were soon converted to bus service, and the track was abandoned entirely in 1947. During this same period, Pacific City Lines and its successor, National City Lines, with funding from General Motors, Firestone Tire, Standard Oil of California (through a subsidiary, Federal Engineering), Phillips Petroleum, and Mack Trucks, were buying streetcar lines and rapidly converting most of them to bus service. This consortium was convicted in 1949 of federal charges involving conspiracy to monopolize interstate commerce in the sale of buses and supplies to National City Lines and its subsidiaries. The actions became known as the Great American Streetcar Scandal or the General Motors Streetcar Conspiracy. Further consolidation and expansion Within a few years of its incorporation, PG&E made significant inroads into Northern California's hydroelectric industry through purchase of existing water storage and conveyance facilities. These included many reservoirs, dams, ditches and flumes built by mining interests in the Sierras that were no longer commercially viable. By 1914, PG&E was the largest integrated utility system on the Pacific Coast. The company handled 26 percent of the electric and gas business in California. Its operations spanned 37,000 square miles across 30 counties. The company expanded in the 1920s through strategic consolidation. Important acquisitions during this period included the California Telephone and Light Company, the Western States Gas and Electric Company and the Sierra and San Francisco Power Company, which provided hydropower to San Francisco's streetcars. These three companies added valuable properties and power and water sources. By the end of 1927, PG&E had nearly one million customers and provided electricity to 300 Northern Californian communities. In 1930, PG&E purchased majority stock holdings in two major Californian utility systems—Great Western Power and San Joaquin Light and Power—from The North American Company, a New York investment firm. In return, North American received shares of PG&E's common stock worth $114 million. PG&E also gained control of two smaller utilities, Midland Counties Public Service and the Fresno Water Company, which was later sold. The acquisition of these utilities did not result in an immediate merger of property and personnel. The Great Western Power Company and the San Joaquin Company remained separate corporate entities for several more years. But through this final major consolidation, PG&E soon served nearly all of Northern and Central California through one integrated system. Natural gas The gas industry market structure was dramatically altered by the discovery of massive natural gas fields throughout the American Southwest beginning in 1918. The fuel was cleaner than manufactured gas and less expensive to produce. While natural gas sources were abundant in Southern California, no economical sources were available in Northern California. In 1929, PG&E constructed a 300-mile pipeline from the Kettleman oil field to bring natural gas to San Francisco. The city became the first major urban area to switch from manufactured gas to natural gas. The transition required the adjustment of burners and airflow valves on 1.75 million appliances. In 1936, PG&E expanded distribution with an additional 45-mile pipeline from Milpitas. PG&E gradually retired its gas manufacturing facilities, although some plants were kept on standby. Defense activities boosted natural gas sales in California during World War II, but cut deeply into the state's natural reserves. In 1947, PG&E entered into a contract with the Southern California Gas Company and the Southern Counties Gas Company to purchase natural gas through a new 1,000-mile pipeline running from Texas and New Mexico to Los Angeles. Another agreement was reached with the El Paso Natural Gas Company of Texas for gas delivery to the California-Arizona border. In 1951, PG&E completed a 502-mile main that connected with the El Paso network at the state line. During this period of expansion PG&E was involved in legal proceedings with the Securities and Exchange Commission regarding the company's status as a subsidiary of the North American Company. As outlined by the Public Utility Holding Company Act of 1935, a utility subsidiary was defined as a utility company with more than 10% of their stock held by a public utility holding company. Though 17% of PG&E stock was held by the North American Company at this time, PG&E filed with the SEC to be exempted from subsidiary status on the grounds that 17% ownership did not give the North American Company control and because the North American Company occupied only two board member spots. The North American Company backed PG&E's request by stating that they were involved in business operations in a limited capacity. The request remained unresolved until 1945 when the North American Company sold off stocks that brought its ownership to below 10%. The SEC then ruled that PG&E was not a subsidiary of the North American Company. In 1948, the North American Company sold its remaining stock in PG&E. Nuclear plants and gas pipelines In 1957, the company brought online Vallecitos Nuclear Center, the first privately owned and operated nuclear reactor in the United States, in Pleasanton, California. The reactor initially produced 5,000 kilowatts of power, enough to power a town of 12,000. In addition to nuclear power, PG&E continued to develop natural gas supplies as well. In 1959, the company began working to obtain approval for the import of a large quantity of natural gas from Alberta, Canada to California, via a pipeline constructed by Westcoast Transmission Co. and the Alberta and Southern Gas Company on the Canadian side, and by Pacific Gas Transmission Company, a subsidiary of PG&E, on the U.S. side. Construction of the pipeline lasted 14 months. Testing began in 1961, and the completed 1,400-mile pipeline was dedicated in early 1962. PG&E began construction on another nuclear facility, the Diablo Canyon Power Plant, in 1968. Originally slated to come online in 1979, the plant's opening was delayed for several years due to environmental protests and concerns over the safety of the plant's construction. Testing of the plant began in 1984, and energy production was brought up to full power in 1985. During the construction of the Diablo Canyon plant, PG&E continued its efforts to bring natural gas supplies from the North to their service area in California. In 1972, the company began exploring possibilities for a 3,000-mile pipeline from Alaska, which would travel through the Mackenzie River Valley and on to join with the previously constructed pipeline originating in Alberta. In 1977 the Mackenzie Valley Pipeline project received approval from the U.S. Federal Power Commission and support from the Carter Administration. The pipeline still required approval from Canada. Plans for the pipeline were placed on hold in 1977 by a Canadian judge. Justice Thomas R. Berger of British Columbia shelved the project for at least 10 years, citing concerns from First Nations groups, whose land the pipeline would have traversed, as well as potential environmental impacts. In 1984 the great-grandson of PG&E's founder George H. Roe—David Roe published his book entitled Dynamos and Virgins during the time when there was a growing antinuclear-power movement. David Roe, who was an environmentalist and the Environmental Defense Fund's West Coast general counsel, \"mounted an assault on the longstanding assumption that steady growth in coal- and nuclear-generating capacity was the only solution to the nation's energy needs\". He based his arguments on an economic analysis \"aimed at showing that a shift to energy conservation and alternative energy sources alone could slake the thirst for electricity\". 1990s, deregulation, and decline As of December 1992, PG&E operated 173 electric generating units and 85 generating stations, 18,450 miles (29,690 km) of transmission lines and 101,400 miles (163,200 km) of distribution system. In 1997, PG&E reorganized as a holding company, PG&E Corporation. It consisted of two subsidiaries—PG&E, the regulated utility, and a non-regulated energy business. In the later 1990s, under electricity market deregulation this utility sold off most of its natural gas power plants. The utility retained all of its hydroelectric plants, the Diablo Canyon Power Plant and a few natural gas plants, but the large natural gas plants it sold made up a large portion of its generating capacity. This had the effect of requiring the utility to buy power from the energy generators at fluctuating prices, while being forced to sell the power to consumers at a fixed cost. The market for electricity was dominated by the Enron Corporation, which, with help from other corporations, artificially pushed prices for electricity ever higher. This led to the California electricity crisis that began in 2000 on Path 15, a transmission corridor PG&E built. With a critical power shortage, rolling blackouts began on January 17, 2001. 1990s fires In 1994, PG&E caused the Trauner Fire in Nevada County, California through criminal negligence. The fire burned many acres of land and destroyed a schoolhouse and twelve homes near the town of Rough and Ready, California. PG&E was found guilty of causing the fire and of 739 counts of criminal negligence. In 1996, one of PG&E's substations in the Mission District of San Francisco caught fire. PG&E was eventually found legally culpable for the fire due to criminal negligence, according to an investigation in 2003. The 1999 Pendola Fire in the Plumas and Tahoe National Forests burned nearly 12,000 acres and was found to have been caused by poor vegetation management by PG&E. 2001 bankruptcy In 1998, a change in the regulation of California's public utilities, including PG&E, began. The California Public Utility Commission (CPUC) set the rates that PG&E could charge customers and required them to provide as much power as the customers wanted at rates set by the CPUC. In the summer of 2001 a drought in the northwest states and in California reduced the amount of hydroelectric power available. Usually PG&E could buy \"cheap\" hydroelectric power under long-term contracts with the Bonneville Dam and other sources. Drought and delays in approval of new power plants and market manipulation decreased available electric power generation capacity that could be generated in state or bought under long-term contracts out of state. Hot weather brought on higher usage, rolling blackouts, and other problems. With little excess generating capacity of its own, PG&E was forced to buy electricity out of state from suppliers without long-term contracts. Because PG&E had to buy additional electricity to meet demand, some suppliers took advantage of this requirement and manipulated the market by creating artificial shortages and charged very high electrical rates, as exemplified by the Enron scandal. The CPUC refused to adjust the allowable electric rates. Unable to change rates and sell electricity to consumers for what it cost them on the open market PG&E started hemorrhaging cash. PG&E Company (the utility, not the holding company) entered bankruptcy under Chapter 11 on April 6, 2001. The state of California tried to bail out the utility and provide power to PG&E's 5.1 million customers under the same rules that required the state to buy electricity at market rate high cost to meet demand and sell it at a lower fixed price, and as a result, the state also lost significant amounts of money. The crisis cost PG&E and the state somewhere between $40 and $45 billion. PG&E Company, the utility, emerged from bankruptcy in April 2004, after paying $10.2 billion to its hundreds of creditors. As part of the reorganization, PG&E's 5.1 million electricity customers will have to pay above-market prices for several years to cancel the debt. South San Joaquin Irrigation District (SSJID) In 2009 the California Public Utilities Commission (CPUC) unanimously approved a resolution that would allow the South San Joaquin Irrigation District to purchase PG&E's electric facilities in Manteca, Ripon and Escalon. In March 2016, San Joaquin County Superior Court Judge Carter Holly has rejected PG&E claims that South San Joaquin Irrigation District lacks sufficient revenues to provide electrical retail service to the cities of Manteca, Ripon, and Escalon and surrounding farms.\" The Municipal Service Review (MSR) found that SSJID's customer rates would be 15 percent lower than PG&E rates. 2019 bankruptcy Chronology Facing potential liabilities of $30 billion from multiple wildfires in the years 2015–2018, Pacific Gas and Electric Company (PG&E), on January 14, 2019, began the process of filing for bankruptcy with a 15-day notice of intention to file for bankruptcy protection. On January 29, 2019, PG&E Corporation, the parent corporation of PG&E, filed for bankruptcy protection. Because fire survivors are unsecured creditors with the same priority as bondholders, they would only be paid in proportion to their claim size if anything is left after secured and priority claims are paid; this nearly ensured that they will not get paid in full. PG&E had a deadline of June 30, 2020 to exit bankruptcy in order to participate in the California state wildfire insurance fund established by AB 1054 that helps utilities pay for future wildfire claims. On August 16, 2019, liability for the Tubbs Fire was potentially added when U.S. Bankruptcy Judge Dennis Montali ruled that a fast-track state jury trial could proceed to resolve who is at fault for the Tubbs Fire. Cal Fire determined that customer equipment was at fault, but lawyers representing wildfire victims claimed that PG&E equipment was at fault. This trial was scheduled to begin January 7, 2020 in San Francisco. The court case was superseded by the Restructuring Support Agreement (RSA) of December 9, 2019 and by the approved bankruptcy reorganization plan, wherein PG&E accepted liability for the Tubbs Fire. Liability for the Kincade Fire that started October 23, 2019 was potentially added, because initially it was unknown whether or not PG&E was at fault for the fire. On July 16, 2020, which was after PG&E exited bankruptcy, Cal Fire reported that the fire was caused by PG&E transmission lines. Damages would not be covered by the settlement for wildfire victims that was part of the PG&E bankruptcy. PG&E settled for $1 billion with state and local governments in June, 2019, and settled for $11 billion with insurance carriers and hedge funds in September, 2019. Representatives for wildfire victims say PG&E owes $54 billion or more, and PG&E was offering $8.4 billion for fire damages, Cal Fire, and FEMA. If more than 500 homes were completely destroyed by the Kincade Fire, and PG&E was found to be at fault, then the parties agreeing to the settlements may have the option to back out of the agreements. Later PG&E offered a $13.5 billion fund to cover claims of the wildfire victims. FEMA originally requested PG&E for $3.9 billion from the wildfire victims fund, threatening to take the money from individual wildfire victims if PG&E did not pay, and Cal OES had an overlapping $2.3 billion request, but they later settled for $1 billion after all wildfire victims are paid. Claims for wildfire victims consist of wrongful death, personal injuries, property loss, business losses, and other legal damages. U.S. District Judge James Donato was assigned to the estimation process for the claims of wildfire victims, including whether or not personal injury and wrongful death claims can include damages due to emotional distress. Judge Donato was scheduled to begin hearings February 18, 2020 to determine how to do the estimation and how much PG&E needs to put in a trust fund for wildfire victims. Bankruptcy judge Montali said that the costs to government agencies will not be subject to the estimation process because those costs can be calculated \"down to the penny.\" The court case was superseded by the Restructuring Support Agreement (RSA) of December 9, 2019 and by the approved bankruptcy reorganization plan. On October 9, 2019, Judge Montali allowed the proposed reorganization plan of the senior bondholders to be considered along with PG&E's proposed plan. The proposal of the senior bondholders had the support of the committee of wildfire victims, who said their claims may be worth $13.5 billion. The proposal of the senior bondholders would give them control of the company with PG&E shareholders losing out, and PG&E called the proposal an \"unjustified windfall\". Later PG&E reached an agreement with the bondholders and the committee of wildfire victims so that PG&E's proposed plan would be the only plan under consideration and the bondholders would not take control of the company. On November 12, 2019, PG&E in its proposed reorganization plan provided an additional $6.6 billion for the claims of wildfire victims and other claimants, increasing the amount to $13.5 billion, similar to the amount in the rival reorganization proposal of the senior bondholders. In a filing with the Securities and Exchange Commission (SEC), this puts the total amount for fire claims at $25.5 billion. This consists of $11 billion to insurance companies and investment funds, $1 billion to state and local governments, and $13.5 billion for other claims. The $11 billion settlement to insurance companies and investment funds was opposed by the state of California Governor Gavin Newsom and by the committee of wildfire victims. Later Governor Newsom and the wildfire victims approved the bankruptcy reorganization plan. On December 6, 2019, PG&E proposed to settle the wildfire victim claims for a total of $13.5 billion, which would cover liability for its responsibility originating from the Camp Fire, Tubbs Fire, Butte Fire, Ghost Ship warehouse fire, and also a series of wildfires beginning on October 8, 2017, collectively called the 2017 North Bay Fires. The offer was tendered as part of PG&E's plan to exit bankruptcy. Wildfire victims will get half of their $13.5 billion settlement as stock shares in the reorganized company, adding to the uncertainty as to when and how much they will be paid. On June 12, 2020, because of uncertainties in the value of the liquidated stock, in part because of the financial market impact of the COVID-19 pandemic, PG&E agreed to increase the amount of stock. Wildfire victims will be paid in cash, funded partly from the cash portion of the settlement, and partly from stock that will be liquidated into cash on a schedule and at a price that is not yet determined. On December 17, 2019, regarding the Ghost Ship warehouse fire, which was not a wildfire, Judge Dennis Montali allowed the plaintiffs' case claiming that the fire was caused by an electrical malfunction to continue against PG&E. This case, if successful, would receive money from PG&E's $900 million insurance money, but would not be eligible to be part of the $13.5 billion allotted for the claims arising from the wildfires. On August 18, 2020, PG&E settled the civil lawsuit for 32 of the victims, out of the 36 who perished in the fire. The amount of the settlement was undisclosed, but it was limited to the amount available under PG&E's insurance coverage for the year 2016. On June 16, 2020, PG&E pleaded guilty to 84 counts of involuntary manslaughter for those that died in the Camp Fire, for which it will pay the maximum fine of $3.5 million and end all further criminal charges against PG&E. This action does not alleviate PG&E of any future civil claims by victims of the Camp Fire which would fall outside the bankruptcy proceedings, as well as how existing litigation against PG&E may be handled. On Saturday, June 20, 2020, U.S. Bankruptcy Judge Dennis Montali issued the final approval of the plan for the reorganized PG&E to exit bankruptcy, meeting the June 30, 2020 deadline for PG&E to qualify for the California state wildfire insurance fund for utilities. On July 1, PG&E funded the Fire Victim Trust (FVT) with $5.4 billion cash and 22.19% of stock in the reorganized PG&E, which covers most of the obligations of its settlement for the wildfire victims. PG&E has two more payments totaling $1.35 billion cash, scheduled to be paid in January 2021 and January 2022, to complete its obligations to the wildfire victims. Loan from US Department of Energy In December 2024, the U.S. Department of Energy's Loan Programs Office announced it would extend a $15 billion (US) low-interest loan to support the modernization of PG&E’s hydroelectric power structure. This investment also will enhance transmission lines critical for renewable energy integration, data center operations, and the growing fleet of electric vehicles. Initially requested as a $30 billion (US) loan, the amount was reduced due to concerns over the company’s repayment capacity. As the largest loan ever sanctioned by the DOE Energy Loans Program, this represents key funding for PG&E, particularly as it navigates the aftermath of its complex bankruptcy proceedings and legal challenges related to California's wildfires. Other information On January 14, 2019, following the departure of CEO Geisha Williams, who had led the corporation since 2017; PG&E corporation announced that it was filing for Chapter 11 bankruptcy in response to the financial challenges associated with catastrophic wildfires that had occurred in Northern California, in 2017 and 2018. On January 15, 2019, PG&E stated it did not intend to make the semiannual interest payment of $21.6 million on its outstanding 5.40 percent Senior Notes, due January 15, 2040, which has a total capital value of $800 million. Under the indenture, the company had a 30-day grace period (expired on February 14, 2019) to make the interest payment, before triggering a default event. PG&E Corporation filed for bankruptcy on January 29, 2019. The company's disclosure statement was approved on March 17, 2020. According to Cbonds, the company has 32 bond issues, and their outstanding amount is approximately equal to $17.5 billion. PG&E expects procedures to take two years. In April, as the bondholders crafted a plan to bring the company out of bankruptcy, Governor Gavin Newsom expressed his concern that new board members would have little knowledge of California and lack expertise in how to run a utility safely. In April 2019, PG&E announced a new CEO and management team, led by former head of Progress Energy Inc and the Tennessee Valley Authority Bill Johnson, that would assume charge of the company, as it went through bankruptcy. On November 1, 2019, Governor Newsom issued a statement calling upon PG&E to reach a \"consensual resolution\" to the bankruptcy case, intending to convene a meeting of PG&E Corporation's executives and stockholders, as well as wildfire victims. If an agreement could not be reached, the State of California \"will not hesitate to step in and restructure the utility\". A week prior, Newsom had declared PG&E's \"greed and mismanagement\", along with the utility's lack of focus on hardening its grid and under-grounding its transmission lines in vulnerable areas, as reasons for its inability to deliver electricity and the shutdowns. \"They simply did not do their job,\" said Newsom. A proposal to turn PG&E into a customer owned cooperative, initiated by San Jose Mayor Sam Liccardo, has received backing from more than 110 elected officials that represent majority of PG&E customers and include 21 other mayors. The City of San Francisco offered to buy PG&E's electrical infrastructure within the city for $2.5 billion in September 2019 (while PG&E was in bankruptcy), but the offer was rejected by PG&E. In March 2020, PG&E asked a federal court to approve $454 million in bonuses just days after asking another federal judge (William Alsup, who was overseeing PG&E's criminal probation related to the 2010 San Bruno pipeline explosion) not to force the utility to hire more tree trimmers. As part of its emergence from bankruptcy, it will pay wildfire victims $13.5 billion; half of that amount will be paid in company stock, resulting in 70,000 fire victims owning 22% of the company. This bankruptcy of PG&E Company was the largest utility bankruptcy in U.S. history, and was one of the most complex bankruptcies in U.S. history. In November 2020, it was announced that Patti Poppe would be leaving CMS Energy on December 1, 2020, to become CEO of PG&E Corporation on January 4, 2021. In April 2022, it was reported that PG&E Corporation CEO Patti Poppe received over $50 million in total direct compensation for her work in 2021, with $40 million of that being in company stock. In June 2020, PG&E announced that it planned to move its headquarters to 300 Lakeside Drive in Oakland. The move will happen in phases, starting in 2022 and completing by 2026. In December 2024, the Department of Energy offered PG&E a $15 billion loan, to \"expand hydropower generation and battery storage, upgrade transmission capacity through reconductoring and grid enhancing technologies, and enable virtual power plants throughout PG&E’s service area.\" Generation portfolio PG&E's utility-owned generation portfolio consists of an extensive hydroelectric system, one operating nuclear power plant, one operating natural gas-fired power plant, and another gas-fired plant under construction. Two other plants owned by the company have been permanently removed from commercial operation: Humboldt Bay Unit 3 (nuclear) and Hunters Point (natural gas). Hydroelectric PG&E is the largest private owner of hydroelectric facilities in the United States including 174 dams. According to the company's Form 10-K filing for 2011, \"The Utility's hydroelectric system consists of 110 generating units at 68 powerhouses, including the Helms pumped storage facility, with a total generating capacity of 3,896 MW ... The system includes 99 reservoirs, 56 diversions, 174 dams, 172 miles of canals, 43 miles of flumes, 130 miles of tunnels, 54 miles of pipe (penstocks, siphons and low head pipes), and 5 miles of natural waterways.\" The single largest component is the Helms Pumped Storage Plant, located at 37°02′13.78″N 118°57′53.63″W near Sawmill Flat in Fresno County, California. Helms consists of three units, each rated at 404 MW, for a total output of 1,212 MW. The facility operates between Courtright and Wishon reservoirs, alternately draining water from Courtright to produce electricity when demand is high, and pumping it back into Courtright from Wishon when demand is low. The Haas Powerhouse is situated more than 1,000 feet (300 m) inside a granite mountain. Nuclear The Diablo Canyon Power Plant, located in Avila Beach, California, is the only operating nuclear asset owned by PG&E. The maximum output of this power plant is 2,240 MWe, provided by two equally sized units. As designed and licensed, it could be expanded to four units, at least doubling its generating capacity. Over a two-week period in 1981, 1,900 activists were arrested at Diablo Canyon Power Plant. It was the largest arrest in the history of the U.S. anti-nuclear movement. In June 2016, PG&E announced plans to close Diablo Canyon in 2025. This would make California free of operating commercial nuclear power plants, but will mean the loss of 2256 MW of generation that produced over 18,000 GWh of electricity per year. The company operated the Humboldt Bay Power Plant, Unit 3 in Eureka, California. It is the oldest commercial nuclear plant in California and its maximum output was 65 MWe. The plant operated for 13 years, until 1976 when it was shut down for seismic retrofitting. New regulations enacted after the Three Mile Island accident rendered the plant unprofitable and it was never restarted. Unit 3 is currently in decommissioning phase. Based on PG&E's schedule of planned decommissioning activities, which incorporates various assumptions, including approval of its proposed new scope, decommissioning of the Unit 3 site is expected to conclude in 2019. Pacific Gas & Electric planned to build the first commercially viable nuclear power plant in the United States at Bodega Bay, a fishing village fifty miles north of San Francisco. The proposal was controversial and conflict with local citizens began in 1958. In 1963, there was a large demonstration at the site of the proposed Bodega Bay Nuclear Power Plant. The conflict ended in 1964, with the forced abandonment of plans for the power plant. Combustion Built in 1956, two natural gas/fuel oil units at Humboldt Bay Power Plant produced 105 MWe of combined output. These units, along with two 15 MWe Mobile Emergency Power Plants (MEPPs), were retired in the summer of 2010, and replaced by the Humboldt Bay Generating Station, built on the same site. It produces 163 MWe using natural gas for fuel and fuel oil for backup on Wärtsilä Diesel engines. The new facility is 33% more efficient and produces 85% fewer ozone-forming compounds, and produces 34% fewer greenhouse gas emissions. It has a closed-loop cooling system, eliminating use of water from Humboldt Bay for cooling. As part of a settlement with Mirant Services LLC for alleged market manipulations during the 2001 California energy crisis, PG&E took ownership of a partially constructed natural gas unit in Antioch, California. The 530 MW unit, known as the Gateway Generating Station, was completed by PG&E and placed into operation in 2009. On May 15, 2006, after a long and bitter political battle, PG&E shut down its 48-year-old Hunters Point Power Plant in San Francisco. PG&E broke ground in 2008 on a 660 MW natural gas power plant located in Colusa County. It began operation in December 2010, and serves nearly half a million residences using the latest technology and environmental design. The plant will use dry cooling technology to dramatically reduce water usage, and cleaner-burning turbines to reduce CO2 emissions by 35 percent relative to older plants. Solar On April 1, 2008, PG&E announced contracts to buy three new solar power plants in the Mojave Desert. With an output of 500 MW and options for another 400 MW, the three installations will initially generate enough electricity to power more than 375,000 residences. In April 2009, PG&E's Next100 blog reported that PG&E was asking the California Public Utilities Commission to approve a project by the company Solaren to deliver 200 megawatts of power to California from space. This method of obtaining electricity from the sun eliminates (mostly) the darkness of night experienced from solar sites on the surface of the earth. According to PG&E spokesman Jonathan Marshall, energy purchase costs are expected to be similar to other renewable energy contracts. PG&E and the environment Beginning in the mid-1970s, regulatory and political developments began to push utilities in California away from a traditional business model. In 1976, the California State Legislature amended the 1974 Warren–Alquist Act, which created and gives legal authority to the California Energy Commission, to effectively prohibit the construction of new nuclear power plants. The Environmental Defense Fund (EDF) filed as an intervenor in PG&E's 1978 General Rate Case (GRC), claiming that the company's requests for rate increases were based on unrealistically high projections of load growth. Furthermore, EDF claimed that PG&E could more cost-effectively encourage industrial co-generation and energy efficiency than build more power plants. As a result of EDF's involvement in PG&E's rate cases, the company was eventually fined $50 million by the California Public Utilities Commission for failing to adequately implement energy efficiency programs. In the early first decade of the 21st century, the CEO of PG&E Corporation, Peter Darbee, and then-CEO of Pacific Gas & Electric Company, Tom King, publicly announced their support for California Assembly Bill 32, a measure to cap statewide greenhouse gas emissions and a 25% reduction of emissions by 2020. The bill was signed into law by Governor Arnold Schwarzenegger on September 27, 2006. In 2014, PG&E had a renewables mix of 28%. By 2016, 32.9% of PG&E's power sources were renewable. During 2017, PG&E announced that 80% of the company's delivered electricity comes from GHG-free sources, including renewables, nuclear, and hydropower. Around 33% comes from renewable sources, thus meeting California's goal of 33% of electricity coming from renewables by 2020, nearly three years in advance. In February 2019, PG&E submitted its Wildfire Safety Plan to the California Public Utilities Commission outlining its efforts to prevent wildfires caused by electrical equipment. It has since increased its preventative efforts and engagement in discussions around climate adaptation as extreme weather conditions increase. In June 2020, PG&E announced a 12-month R&D effort along with Socalgas and Twelve to convert raw biogas into carbon neutral methane. This technology would enable energy from renewable resources (such as wind and solar) to generate fuel from landfills, sewage, and dairy farms. Groundwater contamination in Hinkley, California From 1952 to 1966, PG&E dumped \"roughly 370 million gallons\" of chromium 6-tainted wastewater into unlined wastewater spreading ponds around the town of Hinkley, California. PG&E used chromium 6—\"one of the cheapest and most efficient commercially available corrosion inhibitors\"—at their compressor station plants in their cooling towers along the natural gas transmission pipelines. PG&E did not inform the local water board of the contamination until December 7, 1987, stalling action on a response to the contamination. The residents of Hinkley filed a successful lawsuit against PG&E in which the company paid $333 million— the largest settlement ever paid in a direct-action lawsuit in U.S. history. The legal case, dramatized in the 2000 film Erin Brockovich, became an international cause célèbre. In response, in 2001, at the request of the CalEPA, the Chromate Toxicity Review Committee was formed to investigate the toxicity of chromium-6 when ingested. In 2003, a Senate hearing revealed that the committee's members included expert witnesses from PG&E, who had influenced the final August 2001 report which found in PG&E's favor concluding that other reports were alarmist with \"spuriously high\" statistics and that further evaluation should be handled by academics in laboratory settings not by regulators. In July 2014, California became the first state to acknowledge that ingested chromium-6 is linked to cancer and as a result has established a chromium-6 maximum contaminant level (MCL) of 10 parts per billion (ppb). In setting the regulations, it was acknowledged that in \"recent scientific studies in laboratory animals, Hexavalent Chromium has also been linked to cancer when ingested\". Previously, when older chromium MCLs were set, \"at the time Total Chromium MCLs were established, ingested Hexavalent Chromium associated with consumption of drinking water was not considered to pose a cancer risk, as is now the case.\" By 2013, PG&E had cleaned up 54 acres, but it is estimated the remediation process will take another 40 years. PG&E built a concrete wall barrier that is about a half-mile-long to contain the plume, pump ethanol into the ground to convert chromium-6 into chromium-3, and have planted acres of alfalfa. They created a chicken farm to use the alfalfa. PG&E uses irrigation to maintain these large circles of green in the otherwise desert area, and was asked to stop because of the ongoing danger of residents inhaling chromium 6. In 2015, the California Regional Water Quality Control Board, Lahontan Region served PG&E with a new order \"to cleanup [sic] and abate the effects of the discharge of chromium waste or threatened pollution or nuisance\". By the time of the report, the plume had expanded to \"8 miles in length and approximately 2 miles in width, throughout the Hinkley Valley and into Harper Dry Lake Valley\", polluting new areas. In early 2016, the New York Times described Hinkley as having been slowly turned into a ghost town due to the contamination of the area with owners unable to sell their properties. Epidemiologist John Morgan produced a 2010 report for the California Cancer Registry in which he argued that there was no cancer cluster in Hinkley related to chromium 6. In one study, Morgan had claimed that cancer rates in Hinkley \"remained unremarkable from 1988 to 2008\" saying that \"the 196 cases of cancer reported during the most recent survey of 1996 through 2008 were less than what he would expect based on demographics and the regional rate of cancer.\" In 2013, the Center for Public Integrity found glaring weaknesses in Morgan's 2010 analysis that challenged the validity of his findings. \"In his first study, he dismisses what others see as a genuine cancer cluster in Hinkley. In his latest analysis, he excludes people who were exposed to the worst contamination.\" Wildfires PG&E equipment has often been the cause of wildfires in California. PG&E has been found guilty of criminal negligence in many cases involving fires. These include the 1994 Trauner Fire, a substation fire in San Francisco in 1996, the 1999 Pendola Fire, a San Francisco substation fire in 2003, the Sims Fire and Fred's Fire in 2004, an explosion and electrical fire in San Francisco in 2005, the 2008 Rancho Cordova Gas Explosion, the 2010 San Bruno pipeline explosion, 2014 Carmel Gas Explosion, 2015 Butte Fire, 2018 Camp Fire, among others. Approximately forty of the 315 wildfires in PG&E's service area in 2017 and 2018 were allegedly caused by PG&E equipment. PG&E was on probation after being found criminally liable in the 2010 San Bruno fire. Following that fire, a federally appointed monitor initially focused on gas operations, but his scope expanded to include electricity distribution equipment following the fires in October 2017. A separate case involved allegations the utility falsified gas pipeline records between 2012 and 2017, and as of January 2019 was still being considered. PG&E, like two large Southern California utilities, is now required to submit an annual wildfire prevention plan. The California law judges who reviewed the plan submitted in February 2019 suggested more metrics and maintenance partnerships with local governments, but recommended approving the plan. They also recommended investigating whether disabling equipment that restarts power transmission could reduce the need for power shutoffs. PG&E has filed a motion which in May 2019 had not yet been ruled upon, to amend this plan to move some of the deadlines further out. Liability The state's constitution enshrined a principle of \"inverse condemnation\" for wildfire liability, which means that utilities are held responsible for damages resulting from any fire caused by their equipment, even if their maintenance on equipment and surrounding vegetation was done to standards. California's interpretation of inverse condemnation is unique; the tenet is applied in other states, usually to government entities that damage private property when engaged in a public service, but California's courts have ruled the principle can be applied to utilities. This means that the utilities are held liable for damage, even if they comply with all of California's strict energy-related rules. This policy resulted in $30B of liability for PG&E from the 2017 & 2018 fires and drove it to bankruptcy proceedings. In July 2019, a new $21 billion wildfire trust fund was created to pay for damages from future wildfires, started with a 50-50 balance of utility and customer monies and also reduced the liability threshold for utilities to where customers must prove negligence before companies are held liable. Undergrounding As of 2019, public utilities in the state of California have a total of 26,000 miles of high voltage transmission lines, and 240,000 miles of distribution lines. Distribution lines bring electricity directly to consumers; two-thirds statewide are above ground. For transmission lines, the cost of undergrounding is about $80 million per mile while for distribution lines, the cost of underground lines is about $3 million per mile, compared to overhead lines at about $800,000 per mile. The state's largest utility, PG&E, has 107,000 miles of distribution lines, 81,000 miles of which are overhead. The cost in 2019 to convert all of PG&E's overhead distribution lines to underground lines would cost a total of $240 billion, or $15,000 per PG&E customer. (This cost estimate is only for distribution lines, not the higher voltage transmission lines.) In July 2021, PG&E announced that it plans to bury an additional 10,000 miles of its distribution lines over the next 10 years, (about 9% more; 25% are already underground) to reduce the risk of wildland fires. It already has 27,000 miles of distribution lines underground, but these are generally not in high fire risk areas. (Nationwide, 18% of distribution lines are underground, partly because all new commercial and residential developments are built this way.) This project has been estimated to cost about $4 million per mile, or $40 billion in total, though PG&E's CEO stated that she hopes that they can get costs down to a total of $15–20 billion. The costs are likely to be passed on to the utility's 5.5 million customers, who already have some of the highest electricity rates in the nation. Public safety power shutoffs Recognizing that the \"2017 California wildfire season was the most destructive wildfire season on record,\" the CPUC issued Resolution ESRB-8 in July 2018. The resolution supported the use of de-energization as a means to mitigate wildfire risks and established notification, mitigation, and reporting requirements. The first of those Public Safety Power Shutoffs (PSPS) undertaken by PG&E occurred on October 14, 2018, and lasted until October 16th for the majority of customers. Since then there have been PSPS outages on June 8 and 9, 2019, and throughout the rest of the summer. In October 2019, PG&E began to shut off power to many regions, as a preemptive measure to help avoid wildfires caused by electric lines. The shutdown of nearly 25,000 miles (40,000 km) of electric lines was expected to affect more than 2 million people, of PG&E's 16 million total served. Power was projected to remain off for up to several days after the high winds subside as all of the shutdown lines must be inspected for wind damage. By two days into the preemptive blackout, winds began to subside, and PG&E restored power to some 500,000 customers of a total of approximately 800,000 who lost power. Since 2018, PG&E has increased its efforts to prevent and mitigate wildfires including a 24/7 threat-monitoring center, multiplying its vegetation regulations around utility poles from four to 15 feet and adding 100 weather stations in high-risk areas. The company's strategy also includes augmenting public service power shutdowns when needed. Power shutoffs in California continued in 2020 and 2021. In 2021, the company announced it had included a new technological strategy that uses machine learning models with more predictive capabilities. They can inject these predictions of fire spread directly into the PSPS decision-making process, so they can make more accurate PSPS implementations. In 2021, California fined PG&E $106 million (US) for violating guidelines in 2019 PSPS executions by insufficient communication with the public. Wildfires 1997 Sierra blaze On June 19, 1997, a Nevada County jury in Nevada City found PG&E guilty of \"a pattern of tree-trimming violations that sparked a devastating 1994 wildfire in the Sierra\". \"PG&E was convicted of 739 counts of criminal negligence for failing to trim trees near its power lines—the biggest criminal conviction ever against the state's largest utility.\" 2015 Butte Fire In September 2015, the deadly and destructive Butte Fire ignited in Amador and Calaveras counties. It killed two people and destroyed hundreds of structures. An investigation found PG&E responsible for the fire after a gray pine tree came in contact with one of their powerlines. October 2017 Northern California wildfires In October 2017, PG&E was responsible for their own lines and poles starting thirteen separate fires of the 250 that devastated Northern California. These fires were caused by \"electric power and distribution lines, conductors and the failure of power poles\". Pending further investigation, the following fires have been confirmed by CAL FIRE investigators to have been started by PG&E equipment: Redwood Fire, Mendocino County Sulphur Fire in Lake County Cherokee Fire, Butte County 37 Fire, Sonoma County Blue Fire, Humboldt County Pocket Fire, Sonoma County, Atlas Fire, Napa County Norrbom, Adobe, Partrick, Pythian and Nuns fires of Sonoma and Napa County Cascade Fire, Yuba County 2017 Tubbs Fire The Tubbs Fire was a wildfire in Northern California during October 2017. At the time, the Tubbs Fire was the most destructive wildfire in California history, burning parts of Napa, Sonoma, and Lake counties, inflicting its greatest losses in the city of Santa Rosa. Suspicion for the cause of the fire fell on PG&E, but the company seemed to be cleared of responsibility in this incident after Cal Fire released the results of its investigation on January 24, 2019, upon which news the company's stock price jumped dramatically. On August 14, 2019, U.S. Bankruptcy Judge Dennis Montali, the federal judge for the 2019 PG&E bankruptcy proceedings, presided over a hearing for victims of the Tubbs Fire, and they presented their case for a fast-track state civil trial by jury to resolve if PG&E is at fault for the Tubbs Fire, rather than customer equipment causing the fire as determined by Cal Fire. On August 16, 2019, the judge ruled that the trial can proceed \"on a parallel track\" because \"it advances the goals of this bankruptcy.\" After the judge's ruling, the company's stock price sank by 25%. On December 6, 2019, PG&E proposed to settle the wildfire victim claims for a total of $13.5 billion, which would cover liability for its responsibility originating from the Tubbs Fire, Camp Fire, Butte Fire, and also a series of wildfires beginning on October 8, 2017, collectively called the 2017 North Bay Wildfires. The offer was tendered as part of PG&E's plan to exit bankruptcy. The court case for the Tubbs Fire was superseded by the Restructuring Support Agreement (RSA) of December 9, 2019 and by the approved bankruptcy reorganization plan, wherein PG&E accepted liability for the Tubbs Fire. 2018 Camp Fire In November 2018, PG&E and its parent company were sued in the San Francisco County Superior Court by multiple victims of the Camp Fire – the deadliest and most destructive wildfire in California history. The Camp Fire destroyed more than 18,000 buildings, including 14,000 homes, being particularly devastating to poorer residents. Approximately 90% of the population of the town of Paradise, California as of June 2020 remains dispersed in other parts of the state and the country. The lawsuit accused PG&E of failure to properly maintain its infrastructure and equipment. The cause of the fire, as indicated by PG&E's \"electric incident report\" submitted to the California Public Utilities Commission, was a power failure on a transmission line on November 8, just 15 minutes before the fire was first reported near the same location. Later investigation revealed that a \"broken hook may have allowed a piece of electrically charged equipment to swing free and come close enough to the tower to arc, providing the spark that ignited the blaze.\" The California Department of Forestry and Fire Protection and state utility regulators are investigating PG&E to determine if they complied with state laws. As a result, both Pacific Gas and Electric Company and parent company PG&E Corporation together filed for Chapter 11 bankruptcy on January 29 following the California required 15-day bankruptcy waiting period. PG&E settled criminal proceedings with a fine, pleaded guilty to one felony count of illegally starting a fire, and 84 felony counts of involuntary manslaughter. Civil lawsuit proceedings continued, and were resolved by settlement. On July 1, 2020, PG&E funded the Fire Victim Trust (FVT) with $5.4 billion in cash and 22.19% of stock in the reorganized PG&E, which covers most of the obligations of its settlement for the wildfire victims. PG&E has two more payments totaling $1.35 billion in cash, scheduled to be paid in January 2021 and January 2022, to complete its obligations to the wildfire victims. 2019 Kincade Fire The Kincade Fire was a wildfire that burned in Sonoma County, California. The fire started northeast of Geyserville in The Geysers on 9:24 p.m. on October 23, 2019, and subsequently burned 77,758 acres (31,468 ha) until the fire was fully contained on November 6, 2019. The fire threatened over 90,000 structures and caused widespread evacuations throughout Sonoma County, including the communities of Geyserville, Healdsburg, and Windsor. The majority of Sonoma County and parts of Lake County were under evacuation warnings. The fire was the largest of the 2019 California wildfire season. Initially, it was unknown whether or not PG&E was at fault for the fire. On July 16, 2020, which was after PG&E exited bankruptcy, Cal Fire reported that the fire was caused by PG&E transmission lines. Damages would not be covered by the settlement for wildfire victims that was part of the PG&E bankruptcy. 2020 Zogg Fire The Zogg Fire (named that because it started at Zogg Mine Road and Jenny Bird Lane) was a wildfire that burned 56,338 acres (22,799 ha) in southwestern Shasta County and northwestern Tehama County, which are both in California, in the United States, as part of the severe 2020 California wildfire season. The fire was first reported on September 27, 2020, and was not fully contained until October 13, 2020, by which time it had destroyed much of the communities of Igo and Ono, killing four people and destroying 204 buildings In March 2021, investigations concluded the fire began when a grey pine tree fell on power lines belonging to the Pacific Gas and Electric Company (PG&E).The tree reportedly had been potentially identified for removal, but had not been removed after the Carr Fire in 2018. 2021 Dixie Fire On January 4, 2022, CalFire determined that \"the Dixie Fire was caused by a tree contacting electrical distribution lines owned and operated by Pacific Gas and Electric (PG&E) located west of Cresta Dam.\" CalFire forwarded the investigative report to the Butte County District Attorney's office, the same office that prosecuted PG&E in 2018 following the Camp Fire. Incidents 2013 Metcalf sniper attack On April 16, 2013, a team of gunmen opened fire on the Metcalf transmission substation in Coyote, California. The attack damaged 17 high-voltage transformers, causing more than $15 million in damage. The team also cut a fiber-optic telecommunications cable owned by AT&T. PG&E and AT&T offered a $250,000 reward for anyone who had information leading to the arrest of the culprits, however, they were never found. The Federal Bureau of Investigation found that it was not domestic terrorism, and The Department of Homeland Security claimed they had evidence that it may have been an 'inside job'. 2010 San Bruno, California explosion On the evening of September 9, 2010, a suburb of San Francisco, San Bruno, California, was damaged when one of PG&E's natural-gas pipelines that was \"at least 54 years old, 30 inches (76.2 centimeters) in diameter and located under a street intersection in a residential area \"...exploded sending a \"28-foot section of pipe weighing 3,000 pounds flying through the air, fueled by blowing natural gas\". The blast created a crater at the epicenter and \"killed eight people and injured nearly five dozen more while destroying about 100 homes\". The USGS reported that the shock wave was similar to a 1.1 magnitude earthquake. Following the event, the company was heavily criticized for ignoring the warnings of a state inspector in 2009 and for failing to provide adequate safety procedures. The incident then came under investigation by the National Transportation Safety Board (NTSB). On August 30, 2011, the NTSB released its findings, which placed fault for the blast on PG&E. The report stated that the pipeline that exploded, installed in 1956, did not even meet standards of that time. PG&E was charged with \"twelve criminal felony counts alleging violations of the Natural Gas Pipeline Safety Act. PG&E pleaded not guilty to the \"criminal counts in both the initial and superseding indictments, opting to put the prosecutors to their proof\". On April 1, 2014, a United States grand jury in San Francisco charged PG&E with \"knowingly and willfully\" violating the Natural Gas Pipeline Safety Act. In August 2015, the California Public Utilities Commission levied a $300 million fine against PG&E which they paid. PG&E also \"refunded $400 million to gas customers and agreed to pay $850 million for gas-system safety improvements. It also settled more than $500 million in claims involving victims of the disaster and their relatives.\" Even in the years following the disaster, PG&E failed to implement legally mandated safety procedures aimed at preventing similar disasters. A CPUC report was issued in December 2018 that concluded that between 2012 and 2017, PG&E failed to locate and mark gas pipelines in a timely manner because of staff shortages, and management counted, possibly, \"tens of thousands\" of late tickets as completed on time. Contractors rely on this process to know where they can safely dig. PG&E was fined $110 million for these legal violations. 2016 Ghost Ship warehouse fire On December 2, 2016, in Fruitvale, Oakland, California a fire broke out in a former warehouse that had been illegally converted into an artist collective with living spaces known as Ghost Ship. 80-100 people were at an event in the space and 36 were killed. The plaintiffs claim that the fire was caused by an electrical malfunction. A civil case was put forward against PG&E, alleging blame. In August 2020, PG&E settled a civil lawsuit for 32 of the victims, out of the 36 who perished in the fire. The amount of the settlement was undisclosed, but it was limited to the amount available under PG&E's insurance coverage for the year 2016. Criticism Rates The PG&E and other investor owned utilities that are essentially granted monopoly status in California are guaranteed a negotiated fair rate of return on equity (ROE). PG&E's ROE rate was set at 10.4% and a return on rate base (ROR) was set at 8.06% by the CPUC in December 2012. PG&E electricity rates are among the highest in the United States. In his 2013 paper Jonathan Cook of the UC Davis Energy Efficiency Center, described the 'unique factors' that explain why PG&E's rates are higher than other utilities in California. According to Cook, PG&E procures 60% of its electricity supply from third party generators and 40% from nuclear, fossil fuel and hydroelectric power plants. Many of the dams that produce PG&E's hydroelectric power were built in the early 1900s and require high maintenance. The cost of hydroelectric power maintenance is estimated to rise from $28 million in 2012 to $48 million. PG&E \"current and near-term capital expenditures are dominated by Diablo Canyon and its hydroelectric system\". Operations and maintenance (O&M) expenses are expected to rise especially with new regulations in place after the Fukushima accident. PG&E uses less natural gas than its competitors and is expected \"to experience slower price growth rates\" particularly if there are high emission allowance prices. As of 2021, PG&E electricity rates are 80% above the national average, mostly because of high fixed costs, which consume between 66 and 77% of system-wide expenses and do not change based on how much electricity is consumed. These fixed costs include maintenance, generation, transmission, distribution, and wildfire mitigation. According to a study by the nonprofit think tank Next 10 with the energy institute at UC Berkeley's Haas Business School, net-metering causes higher electricity rates, because many households with solar are not paying their share of the system's fixed costs, even though they rely on the system for much of their electricity. Tax dodging and lobbying In December 2011, the non-partisan organization Public Campaign criticized PG&E for spending $79 million on lobbying and not paying any taxes during 2008–2010, instead getting $1 billion in tax rebates, despite making a profit of $4.8 billion and increasing executive pay by 94% to $8.5 million in 2010 for its top five executives. Controversies 1970 Native American protest In 1970, the Pit River Tribe began a boycott of PG&E. The tribe claimed that the land being used by PG&E was rightfully theirs and that they should receive the profits from it. People subsequently sent boycott checks to the tribe, including musician Buffy Sainte-Marie who sent a $150 check. 2002 Restating of balance sheets On February 28, 2002, after the collapse of Enron, which used dubious accounting and partnerships to hide its debt, PG&E announced to restate results dating back to 1999, to show leases related to power plant construction that had been previously kept off its balance sheet. On June 27, 2003, PG&E National Energy Group, a unit of PG&E Corporation, revised its 2002 Form 10-K/A to reclassify certain offsetting revenues and expenses, which net to zero. PG&E revised its 2002 Form 10-K/A accordingly to reflect the change. 2014 Community Pipeline Safety Initiative (CPSI) In 2014, PG&E rolled out the \"Pipeline Pathways\" project, later rebranded \"Community Pipeline Safety Initiative\", a $500 million four-year effort to clear trees along the almost 7,000 miles of high pressure gas transmission pipeline in California. PG&E said that removing trees was necessary to 1) provide emergency access should an incident occur under a tree and 2) protect pipelines from tree roots. Many communities have protested the removal of private and public trees. According to local opposition groups, PG&E's safety claims for tree removal are incorrect and tree removal makes aerial monitoring of pipeline faster and cheaper. In 2017, several lawsuits have been filed in Contra Costa County Court by the non-profit organization Save Lafayette Trees stating that PG&E did not conduct the proper CEQA reviews or provide ample public notice before signing agreements for tree removal. PG&E's California-wide tree removal may have in fact caused widespread, increased stress corrosion cracking (SCC), according to PG&E's own dead tree root studies: \"Given the fact that the tree roots were shown to cause coating damage, one must conclude that they also will increase the likelihood of SCC. It also is possible that decaying tree roots could create or increase the potency of an SCC environment at the pipe surface by increasing the amount of CO2 in the soil.\" (Source: from \"Effects of Tree Roots on External Corrosion Control\", 3/25/15, Det Norske Veritas, section 3.3 Stress Corrosion Cracking, p. 165 of final TRIA report) Proposition 16 (2010) In 2010, PG&E was accused of attempting to stifle competition with Proposition 16, which mandated approval from two-thirds of voters to start or expand a local utility. Critics argued that this would make it harder for local governments to create their own power utilities, effectively giving PG&E a monopoly. The company was also rebuked for supplying $46 million to support the ballot measure when opponents raised $100,000 in the campaign. The proposition was voted down with 52.5% in opposition and 47.5% in favor. 2014 Email scandal In 2014, a California state government investigation revealed that some top executives of PG&E had been in regular communications with high-ranking officials at the state regulatory body California Public Utilities Commission for years. PG&E and also been allegedly \"judge shopping\" during this time. PG&E Vice President of Regulatory Affairs Brian Cherry, Senior Vice President of Regulatory Affairs Tom Bottorff, and Vice President of Regulatory Proceedings Trina Horner were all fired after the email scandal was revealed. 2018 \"Locate and Mark\" Investigation The California Public Utilities Commission (CPUC) launched an investigation in December 2018 into PG&E's \"locate and mark\" practices. CPUC had found that PG&E falsified tens of thousands of \"Call Before You Dig\" records. Additionally, the company violated state laws, endangered its own employees, and endangered California residents through various illicit company practices every year between 2012 and 2016. In January 2020, the company was fined US$110 million (equivalent to $131 million in 2024) by the State of California. This all occurred subsequent to the 2010 San Bruno pipeline explosion which PG&E caused due to similar malpractice. PG&E responded by instituting a \"Corrective Action Plan\", issuing a statement about safety being important, and firing several employees. Nick Stavropoulos, its COO and president, announced a retirement at the time though the company did not say whether it was directly a result of CPUC's findings."
}