{
  "ticker": "PEG",
  "cik": "0000788784",
  "company_name": "Public Service Enterprise Group",
  "corrected_name": "Public Service Enterprise Group",
  "wiki_title_used": "Public Service Enterprise Group",
  "exists": true,
  "raw_text": "The Public Service Enterprise Group, Inc. (PSEG) is a publicly traded energy company based in Newark, New Jersey, where it has been based since its founding. It was founded in 1985, with its roots tracing back to 1903.\nIts largest subsidiary is Public Service Electric and Gas Company (PSE&G), a regulated utility that supplies electricity and natural gas throughout New Jersey. Established in 1928, PSE&G is the state’s oldest and largest investor owned utility. It was originally part of the New Jersey-based Public Service Corporation.\n\nHistory\nPSE&G/PSEG origins date back to 1903 with the defunct Public Service Corporation.\n\nPublic Service Electric and Gas Company\nThe Public Service Electric and Gas Company, commonly referred to as PSE&G, is the primary subsidiary of the Public Service Enterprise Group (PSEG) and was established in 1928.\nThe Public Service Corporation was formed in 1903 by combining more than 400 gas, electric and transportation companies in New Jersey. In 1928, the corporation merged its electric and gas utilities into a single company, PSE&G. Also in 1928, Public Service Coordinated Transport was formed as an umbrella for the transit businesses. The parent Public Service Corporation was dissolved in 1948 and PSE&G became an independent company, with Public Service Coordinated Transport as a subsidiary.\nPSCT was renamed Transport of New Jersey in 1971, and sold to New Jersey Transit in 1980, leaving PSE&G exclusively in the utility business.\n\nPublic Service Enterprise Group\nThe Public Service Enterprise Group (PSEG) was formed in 1985 to oversee the operations of Public Service Electric and Gas Company (PSE&G).\nIn 1989, the company created Enterprise Diversified Holdings Inc. (now PSEG Energy Holdings) to consolidate its unregulated businesses. In 2000, PSEG separated PSE&G’s unregulated national power generation assets into a new entity, PSEG Power. PSE&G continued to operate in New Jersey as a regulated utility company.\nIn 2005, the Federal Energy Regulatory Commission approved a proposed merger between PSEG and Exelon, a utility company based in Chicago and Philadelphia. However, the deal was not completed after it failed to gain approval from the New Jersey Board of Public Utilities.\nIn 2009, PSEG launched the Solar 4 All project, installing solar panels on 200,000 utility poles at a cost of $773 million. At the time, it was the largest project of its kind globally and was completed in 2013. The company also developed solar farms in Edison, Hamilton, Linden, and Trenton.\nIn August 2020, Hurricane Isaias left approximately 400,000 customers on Long Island and 490,000 customers in New Jersey without power. Some customers saw service restored within hours, while others waited several days. As of August 10, about 42,000 customers on Long Island and 20,000 in New Jersey remained without electricity. The storm response drew criticism from state and local officials. New York Governor Andrew Cuomo threatened to revoke operating licenses for PSEG and ConEdison, and other officials called for customer reimbursements.\n\nOperations\nPublic Service Enterprise Group has three operating subsidiaries: Public Service Electric and Gas (PSE&G), PSEG Long Island, and PSEG Power.\n\nPublic Service Electric and Gas\nPSE&G serves the population in an area consisting of a 2,600-square-mile (6,700 km2) diagonal corridor across the state from Bergen to Gloucester Counties. PSE&G is the largest provider of gas and electric service, servicing 1.8 million gas customers and 2.2 million electric customers in more than 300 urban, suburban and rural communities, including New Jersey's six largest cities.\nPSE&G's transmission line voltages are 500 kilovolts (kV), 345 kV, 230 kV and 138 kV with interconnections to utilities in Pennsylvania, Delaware, and New York. The company's subtransmission voltages are 69 kV and 26 kV. PSEG's distribution voltages are 13.2 kV and 4.16 kV.\n\nPSEG Power\nPSEG Power has four main subsidiaries: PSEG Nuclear, PSEG Fossil, PSEG Energy Resources & Trade, and PSEG Power Ventures.\nPSEG Nuclear operates three nuclear reactors at two sites in Lower Alloways Creek Township, New Jersey. It owns and operates the Hope Creek Nuclear Generating Station and holds a 57 percent stake in the Salem Nuclear Power Plant, which it operates in partnership with Exelon Corporation. The three reactors receive $300 million annually in subsidies. PSEG also shares ownership of the Peach Bottom Nuclear Generating Station in Pennsylvania with Exelon in a 50/50 joint venture; Exelon operates that facility.\nIn October 2024, the New Jersey Board of Public Utilities approved a settlement that raised the average residential customer’s combined electric and gas bill by 7%, or approximately $15 per month. PSEG stated this was its first base rate increase since 2018 and noted that the adjustment was below the overall rate of inflation during that period. The increase was part of a rate case required by a previous settlement, aiming to recover costs from infrastructure investments and rising operational expenses, including wages and benefits.\n\nPSEG Long Island\nPSEG Long Island supplies electricity to approximately 1.1 million customers in Nassau and Suffolk counties, as well as the Rockaway Peninsula in Queens, New York City. The company operates under an agreement with the Long Island Power Authority (LIPA), a state agency that owns the electric grid. This arrangement began on January 1, 2014. PSEG was selected to manage the system more directly following criticism of LIPA’s performance during Hurricane Sandy. Under the new agreement, PSEG assumed most operational responsibilities and rebranded the service under its own name.\nIn 2020, the Long Island Power Authority (LIPA) filed a lawsuit in New York court against PSEG Long Island, seeking $70 million in damages. The suit alleged the company failed to adequately respond to Tropical Storm Isaias, citing corporate mismanagement, misfeasance, and indifference. LIPA CEO Tom Falcone stated that PSEG Long Island had collected nearly $500 million from local customers over seven years without fulfilling basic service obligations.\n\nRate increases and financial concerns\nIn 2024, PSEG Long Island customers faced frequent rate changes, with seven power supply charge increases occurring in a single year. One such increase added about $10 per month to the average bill. The utility attributed these changes to fluctuations in natural gas prices used for electricity generation and stated that it did not profit from the power supply charge. Nonetheless, the increases led to significant public dissatisfaction.\nLong Island residential electricity customers, who already pay some of the highest utility rates in the United States, were charged $4.4 million by PSEG to cover the utility’s expenses in pursuing a proposed rate increase. According to the AARP and the Public Utility Law Project, this amount included costs related to lobbying the Long Island Power Authority for a nearly 12% electric rate hike over three years. The practice drew criticism, with consumer advocates describing it as an added financial burden for customers who already pay 62% more than the national average for electricity.\n\nCall center performance issues\nIn early 2024, the LIPA board raised concerns about declining customer service at PSEG Long Island’s call center. LIPA chairwoman Tracey Edwards described service levels as “horrible,” citing data showing that only 15% of calls were answered within 30 seconds in February 2024, down from 41.8% for all of 2023. The average call handling time was reported at 473 seconds, or nearly eight minutes. In a previous instance, customers waited an average of 22 minutes in September 2022.\nPSEG attributed the decline in performance to increased call volume and staffing shortages. However, LIPA board members disputed this explanation. Edwards stated that call volumes were not unusual and emphasized the importance of improving service. The issue is considered especially pressing as PSEG prepares to transition 1.1 million customers to a new time-of-use rate plan, which is expected to increase the volume of customer inquiries.\n\nNegligence and ignored claims\nPSEG Long Island has faced criticism for operational issues beyond storm response, including routine maintenance and safety concerns. A federal judge filed a lawsuit against the utility, alleging that its negligence caused a fire that destroyed his Suffolk County home. The suit seeks $515,000 for uninsured rebuilding costs. The judge stated that a utility worker had informed him that a nearby transformer, which was later destroyed in the fire, was outdated and inadequate for its intended function.\nCustomer claims related to property damage are often difficult to resolve. Of the approximately 2,400 claims filed with PSEG Long Island each year, only about 15% are approved.\n\n2025 LIPA contract\nIn early 2025, LIPA completed a competitive bidding process to determine the future operator of Long Island’s electric grid after the expiration of its current contract with PSEG Long Island at the end of the year. The final candidates were PSEG Long Island and Quanta Services, a Texas-based utility firm.\nAfter a year-long internal review, a special committee of senior officials at the Long Island Power Authority (LIPA) unanimously recommended awarding a contract to Quanta, describing its proposal as offering the “best value to the LIPA customers.” However, the LIPA board voted 6–1 to reject the recommendation, which led to a vote of no confidence in LIPA’s leadership.\nDespite the committee’s recommendation, LIPA’s Board of Trustees voted 6–1 to retain PSEG Long Island, with two members abstaining. The selection process was marked by controversy, including reports of information leaks, lobbying efforts, and alleged intimidation.\nA Quanta executive stated that the company had initially been assured there would be “no preferential treatment” for PSEG Long Island, the incumbent grid operator for the past decade. Following the board’s decision, some observers described the outcome as a return to “a legacy of uncertainty” for LIPA. The committee’s 150-page evaluation report, which reportedly rated Quanta higher than PSEG, has not been publicly released. According to board documents, Quanta’s proposed contract terms were considered “materially better for customers” than those offered by PSEG or in the existing contract. \nIn May 2025, the New York State Inspector General opened an investigation into LIPA and PSEG Long Island. The inquiry is focused on potential undue influence by lobbyists or political figures on decisions related to the management of the electric grid.\n\nRegulatory and legal issues\nIn 2023, PSE&G agreed to a $6.6 million settlement following allegations that it submitted inaccurate information to PJM Interconnection concerning a $546 million transmission project. The Federal Energy Regulatory Commission (FERC) determined that PSE&G had violated regulations requiring transmission project sponsors to provide accurate data during the Regional Transmission Expansion Plan process. \nThe settlement involved a 2017 PSE&G proposal to replace a transmission line in the Roseland–Pleasant Valley corridor in New Jersey. The case highlighted concerns among ratepayer advocates about the limited regulatory oversight of local transmission projects, referred to as “supplemental projects” within the PJM system. After the settlement, the consumer advocacy group Public Citizen filed a protest with the Federal Energy Regulatory Commission (FERC), contesting the project’s cost allocation. The group argued that the settlement indicated imprudent spending and that requiring ratepayers to cover the costs would be unjust and unreasonable. The protest also criticized PJM and its board for a lack of independent oversight.\n\nEnvironmental record\nIn 2001, NOAA presented PSEG with The Walter B. Jones Memorial and NOAA Excellence Awards in Coastal and Ocean Resource Management in the category of Excellence in Business Leadership for its Estuary Enhancement Program.\nAccording to Violation Tracker, Public Service Electric and Gas Company (PSE&G) has been cited for multiple regulatory violations. These include a $10 million utility service violation in 2020, a $6.6 million energy market violation in 2024, and a $344.4 million air pollution penalty levied against its subsidiary, PSEG Fossil LLC, in 2002. The company’s environmental violations total more than $364 million across 33 cases. These infractions cover various categories, including environmental, competition, consumer protection, and safety-related offenses.\n\nSee also\nAtlantic Nuclear Power Plant\nNewark Public Service Terminal\n\nReferences\nExternal links\n\nOfficial website\n\"Long Islanders Outraged Over 7th Utility Rate Increase This Year\". NBC 4 New York. December 2, 2014.\nBusiness data for Public Service Enterprise Group:",
  "clean_text": "The Public Service Enterprise Group, Inc. (PSEG) is a publicly traded energy company based in Newark, New Jersey, where it has been based since its founding. It was founded in 1985, with its roots tracing back to 1903. Its largest subsidiary is Public Service Electric and Gas Company (PSE&G), a regulated utility that supplies electricity and natural gas throughout New Jersey. Established in 1928, PSE&G is the state’s oldest and largest investor owned utility. It was originally part of the New Jersey-based Public Service Corporation. History PSE&G/PSEG origins date back to 1903 with the defunct Public Service Corporation. Public Service Electric and Gas Company The Public Service Electric and Gas Company, commonly referred to as PSE&G, is the primary subsidiary of the Public Service Enterprise Group (PSEG) and was established in 1928. The Public Service Corporation was formed in 1903 by combining more than 400 gas, electric and transportation companies in New Jersey. In 1928, the corporation merged its electric and gas utilities into a single company, PSE&G. Also in 1928, Public Service Coordinated Transport was formed as an umbrella for the transit businesses. The parent Public Service Corporation was dissolved in 1948 and PSE&G became an independent company, with Public Service Coordinated Transport as a subsidiary. PSCT was renamed Transport of New Jersey in 1971, and sold to New Jersey Transit in 1980, leaving PSE&G exclusively in the utility business. Public Service Enterprise Group The Public Service Enterprise Group (PSEG) was formed in 1985 to oversee the operations of Public Service Electric and Gas Company (PSE&G). In 1989, the company created Enterprise Diversified Holdings Inc. (now PSEG Energy Holdings) to consolidate its unregulated businesses. In 2000, PSEG separated PSE&G’s unregulated national power generation assets into a new entity, PSEG Power. PSE&G continued to operate in New Jersey as a regulated utility company. In 2005, the Federal Energy Regulatory Commission approved a proposed merger between PSEG and Exelon, a utility company based in Chicago and Philadelphia. However, the deal was not completed after it failed to gain approval from the New Jersey Board of Public Utilities. In 2009, PSEG launched the Solar 4 All project, installing solar panels on 200,000 utility poles at a cost of $773 million. At the time, it was the largest project of its kind globally and was completed in 2013. The company also developed solar farms in Edison, Hamilton, Linden, and Trenton. In August 2020, Hurricane Isaias left approximately 400,000 customers on Long Island and 490,000 customers in New Jersey without power. Some customers saw service restored within hours, while others waited several days. As of August 10, about 42,000 customers on Long Island and 20,000 in New Jersey remained without electricity. The storm response drew criticism from state and local officials. New York Governor Andrew Cuomo threatened to revoke operating licenses for PSEG and ConEdison, and other officials called for customer reimbursements. Operations Public Service Enterprise Group has three operating subsidiaries: Public Service Electric and Gas (PSE&G), PSEG Long Island, and PSEG Power. Public Service Electric and Gas PSE&G serves the population in an area consisting of a 2,600-square-mile (6,700 km2) diagonal corridor across the state from Bergen to Gloucester Counties. PSE&G is the largest provider of gas and electric service, servicing 1.8 million gas customers and 2.2 million electric customers in more than 300 urban, suburban and rural communities, including New Jersey's six largest cities. PSE&G's transmission line voltages are 500 kilovolts (kV), 345 kV, 230 kV and 138 kV with interconnections to utilities in Pennsylvania, Delaware, and New York. The company's subtransmission voltages are 69 kV and 26 kV. PSEG's distribution voltages are 13.2 kV and 4.16 kV. PSEG Power PSEG Power has four main subsidiaries: PSEG Nuclear, PSEG Fossil, PSEG Energy Resources & Trade, and PSEG Power Ventures. PSEG Nuclear operates three nuclear reactors at two sites in Lower Alloways Creek Township, New Jersey. It owns and operates the Hope Creek Nuclear Generating Station and holds a 57 percent stake in the Salem Nuclear Power Plant, which it operates in partnership with Exelon Corporation. The three reactors receive $300 million annually in subsidies. PSEG also shares ownership of the Peach Bottom Nuclear Generating Station in Pennsylvania with Exelon in a 50/50 joint venture; Exelon operates that facility. In October 2024, the New Jersey Board of Public Utilities approved a settlement that raised the average residential customer’s combined electric and gas bill by 7%, or approximately $15 per month. PSEG stated this was its first base rate increase since 2018 and noted that the adjustment was below the overall rate of inflation during that period. The increase was part of a rate case required by a previous settlement, aiming to recover costs from infrastructure investments and rising operational expenses, including wages and benefits. PSEG Long Island PSEG Long Island supplies electricity to approximately 1.1 million customers in Nassau and Suffolk counties, as well as the Rockaway Peninsula in Queens, New York City. The company operates under an agreement with the Long Island Power Authority (LIPA), a state agency that owns the electric grid. This arrangement began on January 1, 2014. PSEG was selected to manage the system more directly following criticism of LIPA’s performance during Hurricane Sandy. Under the new agreement, PSEG assumed most operational responsibilities and rebranded the service under its own name. In 2020, the Long Island Power Authority (LIPA) filed a lawsuit in New York court against PSEG Long Island, seeking $70 million in damages. The suit alleged the company failed to adequately respond to Tropical Storm Isaias, citing corporate mismanagement, misfeasance, and indifference. LIPA CEO Tom Falcone stated that PSEG Long Island had collected nearly $500 million from local customers over seven years without fulfilling basic service obligations. Rate increases and financial concerns In 2024, PSEG Long Island customers faced frequent rate changes, with seven power supply charge increases occurring in a single year. One such increase added about $10 per month to the average bill. The utility attributed these changes to fluctuations in natural gas prices used for electricity generation and stated that it did not profit from the power supply charge. Nonetheless, the increases led to significant public dissatisfaction. Long Island residential electricity customers, who already pay some of the highest utility rates in the United States, were charged $4.4 million by PSEG to cover the utility’s expenses in pursuing a proposed rate increase. According to the AARP and the Public Utility Law Project, this amount included costs related to lobbying the Long Island Power Authority for a nearly 12% electric rate hike over three years. The practice drew criticism, with consumer advocates describing it as an added financial burden for customers who already pay 62% more than the national average for electricity. Call center performance issues In early 2024, the LIPA board raised concerns about declining customer service at PSEG Long Island’s call center. LIPA chairwoman Tracey Edwards described service levels as “horrible,” citing data showing that only 15% of calls were answered within 30 seconds in February 2024, down from 41.8% for all of 2023. The average call handling time was reported at 473 seconds, or nearly eight minutes. In a previous instance, customers waited an average of 22 minutes in September 2022. PSEG attributed the decline in performance to increased call volume and staffing shortages. However, LIPA board members disputed this explanation. Edwards stated that call volumes were not unusual and emphasized the importance of improving service. The issue is considered especially pressing as PSEG prepares to transition 1.1 million customers to a new time-of-use rate plan, which is expected to increase the volume of customer inquiries. Negligence and ignored claims PSEG Long Island has faced criticism for operational issues beyond storm response, including routine maintenance and safety concerns. A federal judge filed a lawsuit against the utility, alleging that its negligence caused a fire that destroyed his Suffolk County home. The suit seeks $515,000 for uninsured rebuilding costs. The judge stated that a utility worker had informed him that a nearby transformer, which was later destroyed in the fire, was outdated and inadequate for its intended function. Customer claims related to property damage are often difficult to resolve. Of the approximately 2,400 claims filed with PSEG Long Island each year, only about 15% are approved. 2025 LIPA contract In early 2025, LIPA completed a competitive bidding process to determine the future operator of Long Island’s electric grid after the expiration of its current contract with PSEG Long Island at the end of the year. The final candidates were PSEG Long Island and Quanta Services, a Texas-based utility firm. After a year-long internal review, a special committee of senior officials at the Long Island Power Authority (LIPA) unanimously recommended awarding a contract to Quanta, describing its proposal as offering the “best value to the LIPA customers.” However, the LIPA board voted 6–1 to reject the recommendation, which led to a vote of no confidence in LIPA’s leadership. Despite the committee’s recommendation, LIPA’s Board of Trustees voted 6–1 to retain PSEG Long Island, with two members abstaining. The selection process was marked by controversy, including reports of information leaks, lobbying efforts, and alleged intimidation. A Quanta executive stated that the company had initially been assured there would be “no preferential treatment” for PSEG Long Island, the incumbent grid operator for the past decade. Following the board’s decision, some observers described the outcome as a return to “a legacy of uncertainty” for LIPA. The committee’s 150-page evaluation report, which reportedly rated Quanta higher than PSEG, has not been publicly released. According to board documents, Quanta’s proposed contract terms were considered “materially better for customers” than those offered by PSEG or in the existing contract. In May 2025, the New York State Inspector General opened an investigation into LIPA and PSEG Long Island. The inquiry is focused on potential undue influence by lobbyists or political figures on decisions related to the management of the electric grid. Regulatory and legal issues In 2023, PSE&G agreed to a $6.6 million settlement following allegations that it submitted inaccurate information to PJM Interconnection concerning a $546 million transmission project. The Federal Energy Regulatory Commission (FERC) determined that PSE&G had violated regulations requiring transmission project sponsors to provide accurate data during the Regional Transmission Expansion Plan process. The settlement involved a 2017 PSE&G proposal to replace a transmission line in the Roseland–Pleasant Valley corridor in New Jersey. The case highlighted concerns among ratepayer advocates about the limited regulatory oversight of local transmission projects, referred to as “supplemental projects” within the PJM system. After the settlement, the consumer advocacy group Public Citizen filed a protest with the Federal Energy Regulatory Commission (FERC), contesting the project’s cost allocation. The group argued that the settlement indicated imprudent spending and that requiring ratepayers to cover the costs would be unjust and unreasonable. The protest also criticized PJM and its board for a lack of independent oversight. Environmental record In 2001, NOAA presented PSEG with The Walter B. Jones Memorial and NOAA Excellence Awards in Coastal and Ocean Resource Management in the category of Excellence in Business Leadership for its Estuary Enhancement Program. According to Violation Tracker, Public Service Electric and Gas Company (PSE&G) has been cited for multiple regulatory violations. These include a $10 million utility service violation in 2020, a $6.6 million energy market violation in 2024, and a $344.4 million air pollution penalty levied against its subsidiary, PSEG Fossil LLC, in 2002. The company’s environmental violations total more than $364 million across 33 cases. These infractions cover various categories, including environmental, competition, consumer protection, and safety-related offenses."
}