{
  "ticker": "PFG",
  "cik": "0001126328",
  "company_name": "Principal Financial Group",
  "corrected_name": "Principal Financial Group",
  "wiki_title_used": "Principal Financial Group",
  "exists": true,
  "raw_text": "Principal Financial Group, Inc. (PFG) is an American global financial investment management and insurance company headquartered in Des Moines, Iowa, United States.\n\nHistory\nPFG was first founded under the name Bankers Life Insurance Company. Bankers Life Insurance Company was founded by wealthy Des Moines bankers, including Edward Temple, Simon Casady, and Phineas M. Casady. The bank was founded in 1879 with Temple as president and Phineas Casady as vice president.\nIn 2019, Principal purchased Wells Fargo's institutional retirement and trust business (including 401k, pension, executive deferred compensation, employee stock ownership plans and asset advice business) for $1.2 billion. The deal was financed with cash and senior debt financing.\nIn 2021, activist investor firm Elliott Investment Management took a stake in Principal, saying it will push for changes at the company. Talks with Elliott resulted in the February 2021 announcement of two new independent directors to its board of directors.\nIn 2024, Principal agreed to acquire the employee stock-option plan (ESOP) business from Ascensus. The transaction was expected to add 800 plans and over 165,000 participants to Principal's book of business.\n\nBusiness operations\nFour segments comprise the company: Retirement and Income Solutions, Principal Global Investors, Principal International, and Benefits & Protection.\nAs of December 2021, Principal employed 18,600 employees worldwide, with 7,100 of those based outside the U.S. The company employs roughly 9,000 people in Des Moines, Iowa, and owns and operates several buildings in the downtown area. The tallest, known as 801 Grand, is 45 stories tall (192m/630 ft), and houses many other companies in addition to Principal. Its Global Delivery center, Principal Global Services, in Pune, Maharashtra, India.\nPrincipal also has a lobbyist registered in the Iowa Legislature since December 2016. He is designated to lobby the Executive Branch of the Government of Iowa.\n\nEddie\nEddie was the lead and central character in the marketing campaign of the Principal Financial Group from 2005 to 2015. Eddie's television and print ads often depicted him facing challenges and using the Principal Edge logo to solve his financial, business, and everyday life problems. Eddie retired in 2015 in preparation for the company's new logo that debuted in 2016.\n\nNaming rights\nPrincipal owns the naming rights to Principal Riverwalk, Principal Park and The Principal Charity Classic in Des Moines.\n\nManagement\nOn August 20, 2020, the company announced that Ken McCullum would become the new chief risk officer, following the retirement of Julia Lawler.\nIn January 2025, Deanna Strable succeeded Dan Houston as the firm's President and CEO. Previously Strable had served as President and Chief Operating Officer. As part of the transition, Houston was named Executive Chair of the Board of Directors.\n\nSee also\nList of United States insurance companies\n\nReferences\nExternal links\nThe Principal Financial Group Official Website\nBusiness data for Principal Financial Group:",
  "clean_text": "Principal Financial Group, Inc. (PFG) is an American global financial investment management and insurance company headquartered in Des Moines, Iowa, United States. History PFG was first founded under the name Bankers Life Insurance Company. Bankers Life Insurance Company was founded by wealthy Des Moines bankers, including Edward Temple, Simon Casady, and Phineas M. Casady. The bank was founded in 1879 with Temple as president and Phineas Casady as vice president. In 2019, Principal purchased Wells Fargo's institutional retirement and trust business (including 401k, pension, executive deferred compensation, employee stock ownership plans and asset advice business) for $1.2 billion. The deal was financed with cash and senior debt financing. In 2021, activist investor firm Elliott Investment Management took a stake in Principal, saying it will push for changes at the company. Talks with Elliott resulted in the February 2021 announcement of two new independent directors to its board of directors. In 2024, Principal agreed to acquire the employee stock-option plan (ESOP) business from Ascensus. The transaction was expected to add 800 plans and over 165,000 participants to Principal's book of business. Business operations Four segments comprise the company: Retirement and Income Solutions, Principal Global Investors, Principal International, and Benefits & Protection. As of December 2021, Principal employed 18,600 employees worldwide, with 7,100 of those based outside the U.S. The company employs roughly 9,000 people in Des Moines, Iowa, and owns and operates several buildings in the downtown area. The tallest, known as 801 Grand, is 45 stories tall (192m/630 ft), and houses many other companies in addition to Principal. Its Global Delivery center, Principal Global Services, in Pune, Maharashtra, India. Principal also has a lobbyist registered in the Iowa Legislature since December 2016. He is designated to lobby the Executive Branch of the Government of Iowa. Eddie Eddie was the lead and central character in the marketing campaign of the Principal Financial Group from 2005 to 2015. Eddie's television and print ads often depicted him facing challenges and using the Principal Edge logo to solve his financial, business, and everyday life problems. Eddie retired in 2015 in preparation for the company's new logo that debuted in 2016. Naming rights Principal owns the naming rights to Principal Riverwalk, Principal Park and The Principal Charity Classic in Des Moines. Management On August 20, 2020, the company announced that Ken McCullum would become the new chief risk officer, following the retirement of Julia Lawler. In January 2025, Deanna Strable succeeded Dan Houston as the firm's President and CEO. Previously Strable had served as President and Chief Operating Officer. As part of the transition, Houston was named Executive Chair of the Board of Directors."
}