{
  "ticker": "PG",
  "cik": "0000080424",
  "company_name": "Procter & Gamble",
  "corrected_name": "Procter & Gamble",
  "wiki_title_used": "Procter & Gamble",
  "exists": true,
  "raw_text": "The Procter & Gamble Company (P&G) is an American multinational consumer goods corporation headquartered in Cincinnati, Ohio, and incorporated in Ohio.\nThe company operates five divisions: Beauty (18% of 2024 revenues), which includes Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, Secret, SK-II, and Native; Grooming (8% of 2024 revenues), which includes Braun, Gillette, and Venus; Health Care (14% of 2024 revenues), which includes Crest, Oral-B, Metamucil, Neurobion, Pepto-Bismol, and Vicks; Fabric & Home Care (36% of 2024 revenues), which includes Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer; and Baby, Feminine & Family Care (24% of 2024 revenues), which includes Luvs, Pampers, Always, Tampax, Bounty, Charmin, and Puffs. The company owns brands that are in many cases the global brand leader in their category.  Many of the brands have a market share greater than 25%.\nThe company generates 48% of its sales in the United States and 52% of its sales in other countries. The company manufactures 90% of its merchandise in the United States.\nThe company is ranked 51st on the Fortune 500 and 60th on the Forbes Global 2000.\nThe company was founded in 1837 by William Procter and James Gamble.\n\nHistory\nOrigins\nCandlemaker William Procter, born in England, and soap maker James Gamble, born in Ireland, both emigrated to the US from the United Kingdom. They initially settled in Cincinnati, Ohio, and met when they married sisters Olivia and Elizabeth Norris. Alexander Norris, their father-in-law, persuaded them to become business partners, and in 1837, Procter & Gamble was created.\nFrom 1858 to 1859, sales reached $1 million. By that point, about 80 employees worked for Procter & Gamble. During the American Civil War, the company won contracts to supply the Union Army with soap and candles. In addition to the increased profits experienced during the war, the military contracts introduced soldiers from all over the country to Procter & Gamble's products.\nIn the 1880s, Procter & Gamble began to market a new product, an inexpensive soap that floated in water. The company called the soap Ivory. William Arnett Procter, William Procter's grandson, began a profit-sharing program for the company's workforce in 1887. By giving the workers a stake in the company, he correctly assumed that they would be less likely to go on strike.\nThe company began to build factories in other locations in the United States because the demand for products had outgrown the capacity of the Cincinnati facilities. The company's leaders began to diversify its products as well, and in 1911 the company began producing Crisco, a shortening made of vegetable oils rather than animal fats.\nBeginning in the 1880s, P&G advertised its wares in full-page advertisements in many general-interest magazines. By 1921, it had become a major international corporation with a diversified line of soaps, toiletries, and food products; in that year, its annual advertising budget reached $1 million. In the 1920s, P&G advertised its products on the new medium of radio and, from 1932 forward, was one of the biggest sponsors of daytime serials, which soon became known as soap operas. In the television era, P&G sponsored and produced some twenty soap operas across six decades; the division went on a hiatus after the end of As the World Turns in 2010 before The Gates launched on CBS in 2025 as a co-production with P&G.\n\nInternational expansion\nThe company moved into other countries, both in terms of manufacturing and product sales, becoming an international corporation with its 1930 acquisition of the Thomas Hedley Co., based in Newcastle upon Tyne, England. After this acquisition, Procter & Gamble had their UK Headquarters at Hedley House in Newcastle upon Tyne, until quite recently, when they moved to The Heights, Brooklands. Numerous new products and brand names were introduced over time, and Procter & Gamble began branching out into new areas. The company introduced Tide laundry detergent in 1946, Prell shampoo in 1947 and Joy, the first liquid synthetic detergent in 1949.\nIn 1955, Procter & Gamble began selling the first toothpaste to contain fluoride, known as Crest. Branching out once again in 1957, the company purchased paper mills from Charmin and began manufacturing toilet paper and other tissue paper products. Once again focusing on laundry, Procter & Gamble began making Downy-branded fabric softener in 1960 and Bounce fabric softener sheets in 1972. From 1957 to 1968, Procter & Gamble owned Clorox, the leading American manufacturer of liquid bleach; however, the Federal Trade Commission challenged the acquisition, and the U.S. Supreme Court decided against P&G in April 1967.\nOne of the most revolutionary products to come out on the market was the company's disposable Pampers diaper, first test-marketed in 1961, the same year Procter & Gamble came out with Head & Shoulders. Prior to this point, disposable diapers were not popular, although Johnson & Johnson had developed a product called Chux. Babies always wore cloth diapers, which were leaky and labor-intensive to wash. Pampers provided a convenient alternative, albeit at the environmental cost of more waste requiring landfilling. Amid the recent concerns parents have voiced on the ingredients in diapers, Pampers launched Pampers Pure collection in 2018, which is a \"natural\" diaper alternative.\n\nFurther developments\nProcter & Gamble acquired a number of other companies that diversified its product line and significantly increased profits. These acquisitions included Folgers Coffee, Norwich Eaton Pharmaceuticals (the makers of Pepto-Bismol), Richardson-Vicks, Noxell (Noxzema), Shulton's Old Spice, Max Factor, the Iams Company, and Pantene, among others. In 1994, the company made headlines for big losses resulting from leveraged positions in interest rate derivatives, and subsequently sued Bankers Trust for fraud; this placed their management in the unusual position of testifying in court that they had entered into transactions that they were not capable of understanding. In 1996, P&G again made headlines when the Food and Drug Administration approved a new product developed by the company, Olestra. Also known by its brand name 'Olean', Olestra is a lower-calorie substitute for fat in cooking potato chips and other snacks.\nIn January 2005, P&G announced the acquisition of Gillette, forming the largest consumer goods company and placing Unilever into second place. This added brands such as Gillette razors, Duracell, Braun, and Oral-B to their stable. The acquisition was approved by the European Union and the Federal Trade Commission, with conditions to a spinoff of certain overlapping brands. P&G agreed to sell its SpinBrush battery-operated electric toothbrush business to Church & Dwight, and Gillette's Rembrandt toothpaste line to Johnson & Johnson. The deodorant brands Right Guard, Soft and Dri, and Dry Idea were sold to Dial Corporation. In 2001, Liquid Paper and Gillette's stationery division, Paper Mate, were sold to Newell Rubbermaid. The companies officially merged on October 1, 2005. In 2008, P&G branched into the record business with its sponsorship of Tag Records, as an endorsement for TAG Body Spray.\nP&G's dominance in many categories of consumer products makes its brand management decisions worthy of study. For example, P&G's corporate strategists must account for the likelihood of one of their products cannibalizing the sales of another.\nIn August 2009, Warner Chilcott acquired P&G's prescription-drug business for $3.1 billion.\nP&G exited the food business in 2012 when it sold its Pringles snack food business to Kellogg's for $2.75 billion after the $2.35 billion deal with former suitor Diamond Foods fell short. The company had previously sold Jif peanut butter, Crisco shortening and oils, and Folgers coffee in separate transactions to fellow Ohio-based company Smucker's.\nIn April 2014, the company sold its Iams pet food business in all markets excluding Europe to Mars, Inc. for $2.9 billion. It sold the European Iams business to Spectrum Brands in December 2014.\n\nRestructuring\nOn August 1, 2014, P&G announced it was streamlining the company, dropping and selling off around 100 brands from its product portfolio in order to focus on the remaining 65 brands, which produced 95% of the company's profits. A.G. Lafley, the company's chairman and CEO until October 2015, said the future P&G would be \"a much simpler, much less complex company of leading brands that's easier to manage and operate\".\nIn March 2015, the company divested its Vicks VapoSteam U.S. liquid inhalant business to Helen of Troy, part of a brand-restructuring operation. This deal was the first health-related divestiture under the brand-restructuring operation. The deal included a fully paid-up license to the Vicks VapoSteam trademarks and the U.S. license of P&G's Vicks VapoPad trademarks for scent pads. Most Vicks VapoSteam and VapoPads are used in Vicks humidifiers, vaporizers and other health care devices already marketed by Helen of Troy.\nLater that same year in July, the company announced the sale of 43 of its beauty brands to Coty, a beauty-product manufacturer, in a US$13 billion deal. It cited sluggish growth of its beauty division as the reason for the divestiture. The sale was completed on October 3, 2016.\nIn February 2016, P&G completed the transfer of Duracell to Berkshire Hathaway through an exchange of shares.\nIn December 2018, Procter & Gamble completed the acquisition of the consumer health division of Merck Group (known as EMD Serono in North America) for €3.4 billion ($4.2 billion) and renamed it as Procter & Gamble Health Limited in May 2019.\nIn November 2018, P&G unveiled a simpler corporate structure with six business units that will be effective from July 2019.\nIn 2023, the company began optimizing its product offering. As part of this strategy, it plans to eliminate the bottom 25% of SKUs, which contribute very little to absolute retail sales. According to other comparable companies, a similar share of SKUs represents between 2% and 2.5% of its turnover at a global level.\nIn June 2025, the company announced 7,000 layoffs over the following 2 years due to uncertainty regarding Tariffs in the second Trump administration.\n\nFinances\nFor the fiscal year 2018, Procter & Gamble reported earnings of US$9.750 billion, with an annual revenue of US$66.832 billion, an increase of 2.7% over the previous fiscal cycle. The company's shares traded at over $86 per share in 2017, and its market capitalization was valued at over US$221.5 billion in October 2018. The company ranked No. 42 on the 2018 Fortune 500 list of the largest United States corporations by total revenue.\n\nManagement\nBoard of directors\nAs of February 2025 the board of directors of Procter & Gamble has 14 members:\n\nPrevious members of the board include:\n\nW. James McNerney, Jr.\nNelson Peltz\nScott Cook\nAngela Braly\nFrank Blake\nMeg Whitman\nIn March 2011, Rajat Gupta resigned from the board after an SEC accusation of Galleon Group insider trading.\nIn May 2011, the company was noted for having 11 female directors that were all on the Most Powerful Women list by Fortune.\nIn May 2013, Robert A. McDonald announced his retirement and was replaced by A.G. Lafley, who returned as chairman, president, and CEO.\nJon R. Moeller succeeded Lafley as CEO in 2021. In July 2025, Procter & Gamble announced Shailesh G. Jejurikar would succeed Jon R. Moeller as CEO in 2026.\nProcter & Gamble is a member of the U.S. Global Leadership Coalition, a Washington, DC–based coalition of over 400 major companies and NGOs that advocates for a larger international affairs budget, which funds American diplomatic and development efforts abroad.\n\nAwards and recognition\nProcter & Gamble ranked 2nd in the world in the 2024 review of WIPO's annual World Intellectual Property Indicators, with 525 designs in industrial design registrations being published under the Hague System during 2023.\nFortune magazine awarded P&G a top spot on its list of \"Global Top Companies for Leaders\", and ranked the company at 15th place of the \"World's Most Admired Companies\" list. Chief Executive magazine named P&G the best overall company for leadership development in its list of the \"40 Best Companies for Leaders\".\nIn October 2008, P&G was named one of \"Canada's Top 100 Employers\" by Mediacorp Canada Inc. and was featured in Maclean's newsmagazine. Later that month, P&G was also named one of Greater Toronto's Top Employers, which was announced by the Toronto Star newspaper.\nIn October 2013, the company was named the fourth-most in-demand employer in the world according to analytic data sourced by LinkedIn.\nIn August 2013, P&G was named the 14th-hardest company to interview for by Glassdoor. In November 2013, Glassdoor also named them as a top 25 company for career opportunities. In February 2014, Glassdoor placed P&G 34th on their annual Best Places to Work list.\nIn November 2015, P&G was named the Careers in Africa Employer of Choice 2015 following a survey of over 13,000 African professionals from across the globe. P&G was also recognized as the most desirable FMCG business to work for in Africa.\nP&G was recognized as one of Forbes World's Most Reputable Companies in 2016, 2017, and 2023.\n\nBrands\nAs of 2015, 21 of P&G's brands have more than a billion dollars in net annual sales. Most of these brands – including Bounty, Crest, Always, and Tide – are global products available on several continents. In 2005, Procter & Gamble made a $57 billion deal to buy Gillette, which combined some of the world's top brands including, signature razors, Duracell batteries, Braun, and Oral-B brands. P&G's products are available in North America, Latin America, Europe, the Middle East, Africa, Asia, Australia, and New Zealand.\nIn 2018, P&G's fabric and home care division accounted for 32% of the company's total net sales, the highest of all its divisions. The division includes Downy, Gain, Tide, Febreze, and Dawn.\nAccording to Advertising Age, Procter & Gamble spent $4.3 billion advertising various brands in the United States in 2015, making it the top advertiser in the country.\nManufacturing operations are based in these countries:\n\nRadio and television production\nProcter & Gamble produced and sponsored the first radio serial dramas in the 1930s. As the company was known for Ivory soap, the serials became known as \"soap operas\". With the rise of television in the 1950s and 1960s, most of the new serials were sponsored,  produced and owned (20 series) by the company (including The Guiding Light, which had begun as a radio serial, and made the transition to television lasting 72 years). The end of As the World Turns in 2010 resulted in the company's absence from the soap opera genre for almost fifteen years, which lasted until Beyond the Gates (a co-production with CBS Studios and the NAACP) premiered on CBS in 2025. The Young and the Restless, produced by Sony Pictures Television and also broadcast on CBS, is also partially sponsored by Procter & Gamble.\nThese past serials were produced by Procter & Gamble:\n\nProcter & Gamble also was the first company to produce and sponsor a prime-time serial, a 1965 spin-off of As the World Turns called Our Private World. In 1979, PGP produced Shirley, a prime-time NBC series starring Shirley Jones, which lasted 13 episodes. They also produced TBS' first original comedy series, Down to Earth, which ran from 1984 to 1987 (110 episodes were produced). They also distributed the syndicated comedy series Throb. In 1985, they produced a game-show pilot called The Buck Stops Here with Taft Entertainment Television in 1985, hosted by Jim Peck; it was not picked up. Procter & Gamble Productions originally co-produced Dawson's Creek with Columbia TriStar Television but withdrew before the series premiere due to early press reviews. They also produced the 1991 TV movie A Triumph of the Heart: The Ricky Bell Story, which was co-produced by The Landsburg Company, and they continued to produce the People's Choice Awards until the show was sold to E! channel in April 2017. In 2007, PGP teamed up with the now-defunct Cookie Jar Group to produce the Flash-animated children's series Will and Dewitt, which featured the character Dewitt, the mascot for the Pampers baby product line's former sub-brand, Kandoo.\nWith Walmart, PGP sponsored Family Movie Night on broadcast networks in 2010–2011 and Walden Family Theater on the Hallmark Channel in 2013.\nIn 2013, PGP rebranded itself as Procter & Gamble Entertainment (PGE) with a new logo and an emphasis on multiple-platform entertainment production.\nP&G funded a six-episode series, Activate, on National Geographic in 2019 focusing on extreme poverty, inequality and sustainability in conjunction with not-for-profit Global Citizen and production company Radical Media. The company agreed to a longform series deal with Stone Village Television in January 2020. In February 2020, P&G joined Imagine Documentaries' five project slate including Mars 2080, the project closest to production.\n\nSponsorships\nIn addition to its self-produced items through PGE, Procter & Gamble also supports many Spanish-language novellas through advertising on all networks: Azteca América, Estrella TV, Galavisión, Telemundo, UniMás and Univisión. P&G was one of the first mainstream advertisers on Spanish-language TV during the mid-1980s. By the late 1990s, P&G was established as the largest advertiser on Spanish-language media.\nIn 2008, P&G expanded into music sponsorship when it joined Island Def Jam to create Tag Records, named after a body spray that P&G acquired from Gillette. In 2010, after the cancellation of As the World Turns, PGP announced they were phasing out soap opera production and expanding into more family-appropriate programming.\nProcter & Gamble also gave a $100,000 contract to the winners of Cycles 1 through 3 of Canada's Next Top Model, wherein Andrea Muizelaar, Rebecca Hardy, and Meaghan Waller won the prize.\nProcter & Gamble has been a major sponsor of the Summer Olympics since 2012. It sponsored 150 athletes at the London games that year. They have also sponsored the Winter Olympics since 2014, continuing the \"Thanks Mom\" program started in 2010 with figure skater Kristi Yamaguchi and expanding it not only to American athletes such as sky racer Lindsey Vonn but also Russian ice hockey players Alexander Ovechkin and Evgeni Malkin, German long track speed skater Sven Kramer and Japanese figure skaters Daisuke Takahashi and Yuzuru Hanyu. It will do so at the 2028 Summer Olympics in Los Angeles, CA, USA besides the 2026 Winter Olympics in Cortina d'Ampezzo/Milan, Italy. The company's sponsorship includes television ads in which Olympic athletes are portrayed as children to convey the sense that the mothers of these athletes still remember them as infants; other ads stress how Olympic mothers stood by their children through years of training all the way through to Olympic success. 2016's ad for the Rio Games notes upheavals as youths by an American gymnast, Chinese swimmer, Brazilian volleyballer, and German distance runner. The ads all make prominent use of the Ludovico Einaudi orchestral track \"Divenire\" and related such instrumentals.\nThe company has actively developed or sponsored numerous online communities, e.g. BeingGirl.com (launched in 2000) and Women.com. As of 2000, the company had 72 \"highly stylized destination sites\".\n\nControversies\nToxic shock syndrome and tampons\nToxic shock syndrome (TSS) is a disease caused by strains of the bacteria Staphylococcus aureus. Most people have these bacteria living in their bodies as harmless commensals in places such as the nose, skin, and vagina. The disease can strike anyone, not only women, but the disease is often associated with tampons. In 1980, 814 menstrual-related TSS cases were reported; 38 deaths resulted from the disease. The majority of women in these cases were documented as using super-absorbent synthetic tampons, particularly the Rely tampon created by Procter & Gamble. Unlike other tampons made of cotton and rayon, Rely used carboxymethylcellulose and compressed beads of polyester for absorption.\nIn the summer of 1980, the Centers for Disease Control released a report explaining how these bacterial mechanisms were leading to TSS. They also stated that the Rely tampon was associated with TSS more than any other brand of tampon. In September 1980, Procter & Gamble voluntarily recalled its Rely brand of tampons from the market. Since the 1980s, reported cases of TSS have dramatically decreased.\n\nOther products\nIn 2002, P&G was sued for its ads falsely suggesting to the consumers that the drug Prilosec could cure heartburn in a day. In December 2005, the Pharmaceutical division of P&G was involved in a dispute over research involving its osteoporosis drug Actonel. The case was discussed in the media.\n\nAnimal testing\nProcter & Gamble has received criticism from animal advocacy group PETA for the practice of testing on animals.\nOn June 30, 1999, Procter & Gamble announced that it would limit its animal testing practices to its food and drug products which represented less than 20% of its product portfolio. The company invested more than $275 million in the development of alternative testing methods.\n\nPrice fixing\nIn April 2011, P&G was fined €211.2 million by the European Commission for establishing a price-fixing cartel for washing powder in Europe along with Unilever, which was fined €104 million, and Henkel. Though the fine was set higher at first, it was discounted by 10% after P&G and Unilever admitted running the cartel. As the provider of the tip-off leading to investigations, Henkel was not fined.\n\nChild labor and forced labor\nAccording to a 2016 report by Amnesty International, palm oil provider Wilmar International, the world's biggest palm oil grower in 2016 and supplier of raw materials to Procter & Gamble, profited from 8 to 14-year-old child labor and forced labor. Some workers were extorted, threatened, or not paid for work. Some workers also suffered severe injuries from toxic banned chemicals.\n\nLogo myth and Satanism accusations\nP&G's former logo originated in 1851 as a crude cross that barge workers on the Ohio River painted on cases of P&G star candles to identify them. P&G later changed this symbol into a trademark that showed a man in the Moon overlooking 13 stars, said to commemorate the original Thirteen Colonies.\nThe company received unwanted media publicity in the 1980s due to rumors, spread largely by Amway distributors, that the Moon-and-stars logo was a satanic symbol. The accusation was based on a passage in the Bible, Revelation 12:1, which states: \"And there appeared a great wonder in heaven; a woman clothed with the sun, the moon under her feet and upon her head a crown of 12 stars.\" Until 1985, P&G's logo consisted of a man's face on the Moon surrounded by 13 stars. Some claimed that the logo was a mockery of the heavenly symbol alluded to in the aforementioned verse, thus construing the logo to be satanic. Where the flowing beard meets the surrounding circle, three abstracted curls were said to be a mirror image of the number 666, or the number of the beast. At the top and bottom, the hair curls in on itself and was said to be the horns like those of a ram. In 1991, details of the logo were simplified, and the moon-and-stars logo was completely replaced by a text-only logo in 1995 in a failed attempt to quash the conspiracy theory, though in 2013 it unveiled a new logo with a hint of a crescent moon behind the text.\nThese interpretations have been denied by company officials and no evidence linking the company to the Church of Satan or any occult organization has ever been presented. The company unsuccessfully sued Amway from 1995 to 2003 over rumors forwarded through a company voice-mail system in 1995. In 2007, the company successfully sued individual Amway distributors for reviving and propagating the false rumors. The Church of Satan denies being supported by Procter & Gamble.\n\nReverse domain name hijacking\nIn March 2013, P&G was found by a World Intellectual Property Organization panel to have engaged in reverse domain hijacking in an attempt to obtain the domain name \"swash.com\" from Marchex in a Uniform Domain-Name Dispute-Resolution Policy proceeding. P&G originally stated it had generated more than $40 million in sales of its Swash laundry products over four years, a figure it later revised to $60,000. After losing the case P&G purchased the domain name from Marchex. In 2013 attorney John Berryhill suggested that P&G did not intend to use the swash.com domain to market its existing range, as it had said, but rather a new product described in a 2011 trademark application as \"An appliance for domestic use in the nature of a garment steamer for the purpose of removing wrinkles and odors from clothing and linen\". Berryhill's theory was shown to be accurate after swash.com went live in June 2014.\n\n\"The Talk\"\nIn 2017, as part of the \"My Black is Beautiful\" platform, P&G released an advertisement called \"The Talk\". It showed African American mothers throughout the decades giving their children \"the talk\" about racism. The advertisement garnered controversy for several different reasons. Some criticized it for not showing any fathers giving \"the talk\", while others accused it of being anti-white. One scene depicted a mother warning her daughter about being pulled over by the police. The daughter responds by saying that she is a good driver so her mother doesn't need to worry about her getting a ticket. The mother then implies that she might experience police brutality by being racially profiled and killed. Several police officers and groups accused that part of the advertisement of being anti-cop.\n\"The Talk\" was accused by Michelle Malkin of National Review of being \"liberal advertising\". Malkin also called the ad \"Black Lives Matter propaganda\" and accused it of pandering and using identity politics. Despite the criticism, the advertisement also received a lot of positive reception and praise with some calling it \"powerful\" and \"thought-provoking\". The advertisement has also won several awards including the 2018 Cannes Lions International Festival of Creativity Grand Prix and the 2018 Primetime Emmy Award for Outstanding Commercial during the 70th Primetime Creative Arts Emmy Awards.\n\n\"Woke\" social stances\nThe company has been criticized for its social stances, some of which were criticized for being \"woke\".\nIn November 2014, P&G came out publicly in support of same-sex marriage.\nIn January 2019, CEO David Taylor said in Switzerland: \"The world would be a better place if my board of directors on down is represented by 50% of the women. We sell our products to more than 50% of the women.\" Also in January 2019, The Wall Street Journal noted the company's board of directors had more than twice as many men as it does women. As of mid-2020, the board of P&G consisted of an equal number of men and women.\nIn 2025, the company continued its policies of diversity, equity, and inclusion despite government scrutiny during the second presidency of Donald Trump.\n\nGillette advertisement\nOn January 14, 2019, P&G subsidiary Gillette released a controversial advertisement, \"The Best Men Can Be\", ostensibly to address negative behavior among men, including bullying, sexism, sexual misconduct, and toxic masculinity. The ad was the subject of controversy and was received negatively by various online commentators, becoming one of the most disliked videos on YouTube.\nThe ad led to calls for boycott of Gillette and Procter & Gamble. Later in the year, its Gillette shaving business took an $8 billion write-down in value, although the company and analysts pointed to accumulated currency fluctuations, the entrance of strong rivals and decline in the demand for shaving products since the division's previous valuation in 2005, rather than fallout from the ad.\n\nTrade in Russia amid Ukraine war\nThe Ukrainian National Agency for Prevention of Corruption (NACP) placed P&G on the list of International Sponsors of War for the 2022 Russian invasion of Ukraine. P&G has two factories operating in Russia (the Gillette razor manufacturing plant in Saint Petersburg and a toiletries manufacturing plant in Tula Oblast), thus contributing to the Russian federal budget and financing Russian war crimes according to the NACP. It was placed on the list alongside Bacardi and Unilever. In 2022, the company's revenue amounted to 108 billion rubles.\n\nReferences\nFurther reading\nKominicki, John, \"James Gamble's Candles and Soap Lit Up Profit: Do It Right: He Helped Put P&G on an Ethical Path to Top\", Los Angeles: Investor's Business Daily, March 6, 2015, p. A3.\nMcGuigan, Lee, \"Procter & Gamble, Mass Media, and the Making of American Life\", Media, Culture, and Society 37 (September 2015), pp. 887–903. doi:10.1177/0163443715584100.\nDavey, KS & Sanders, TJ, \"Serial Strategic Innovation and Sustainable Competitive Advantage: A Longitudinal Case Study of Proctor and Gamble\", Journal of Case Research in Business and Economics 4 (July 2012), pp. 1–20.\n\nExternal links\n\nOfficial website \nProcter & Gamble on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying \nBusiness data for Procter & Gamble:",
  "clean_text": "The Procter & Gamble Company (P&G) is an American multinational consumer goods corporation headquartered in Cincinnati, Ohio, and incorporated in Ohio. The company operates five divisions: Beauty (18% of 2024 revenues), which includes Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, Secret, SK-II, and Native; Grooming (8% of 2024 revenues), which includes Braun, Gillette, and Venus; Health Care (14% of 2024 revenues), which includes Crest, Oral-B, Metamucil, Neurobion, Pepto-Bismol, and Vicks; Fabric & Home Care (36% of 2024 revenues), which includes Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer; and Baby, Feminine & Family Care (24% of 2024 revenues), which includes Luvs, Pampers, Always, Tampax, Bounty, Charmin, and Puffs. The company owns brands that are in many cases the global brand leader in their category. Many of the brands have a market share greater than 25%. The company generates 48% of its sales in the United States and 52% of its sales in other countries. The company manufactures 90% of its merchandise in the United States. The company is ranked 51st on the Fortune 500 and 60th on the Forbes Global 2000. The company was founded in 1837 by William Procter and James Gamble. History Origins Candlemaker William Procter, born in England, and soap maker James Gamble, born in Ireland, both emigrated to the US from the United Kingdom. They initially settled in Cincinnati, Ohio, and met when they married sisters Olivia and Elizabeth Norris. Alexander Norris, their father-in-law, persuaded them to become business partners, and in 1837, Procter & Gamble was created. From 1858 to 1859, sales reached $1 million. By that point, about 80 employees worked for Procter & Gamble. During the American Civil War, the company won contracts to supply the Union Army with soap and candles. In addition to the increased profits experienced during the war, the military contracts introduced soldiers from all over the country to Procter & Gamble's products. In the 1880s, Procter & Gamble began to market a new product, an inexpensive soap that floated in water. The company called the soap Ivory. William Arnett Procter, William Procter's grandson, began a profit-sharing program for the company's workforce in 1887. By giving the workers a stake in the company, he correctly assumed that they would be less likely to go on strike. The company began to build factories in other locations in the United States because the demand for products had outgrown the capacity of the Cincinnati facilities. The company's leaders began to diversify its products as well, and in 1911 the company began producing Crisco, a shortening made of vegetable oils rather than animal fats. Beginning in the 1880s, P&G advertised its wares in full-page advertisements in many general-interest magazines. By 1921, it had become a major international corporation with a diversified line of soaps, toiletries, and food products; in that year, its annual advertising budget reached $1 million. In the 1920s, P&G advertised its products on the new medium of radio and, from 1932 forward, was one of the biggest sponsors of daytime serials, which soon became known as soap operas. In the television era, P&G sponsored and produced some twenty soap operas across six decades; the division went on a hiatus after the end of As the World Turns in 2010 before The Gates launched on CBS in 2025 as a co-production with P&G. International expansion The company moved into other countries, both in terms of manufacturing and product sales, becoming an international corporation with its 1930 acquisition of the Thomas Hedley Co., based in Newcastle upon Tyne, England. After this acquisition, Procter & Gamble had their UK Headquarters at Hedley House in Newcastle upon Tyne, until quite recently, when they moved to The Heights, Brooklands. Numerous new products and brand names were introduced over time, and Procter & Gamble began branching out into new areas. The company introduced Tide laundry detergent in 1946, Prell shampoo in 1947 and Joy, the first liquid synthetic detergent in 1949. In 1955, Procter & Gamble began selling the first toothpaste to contain fluoride, known as Crest. Branching out once again in 1957, the company purchased paper mills from Charmin and began manufacturing toilet paper and other tissue paper products. Once again focusing on laundry, Procter & Gamble began making Downy-branded fabric softener in 1960 and Bounce fabric softener sheets in 1972. From 1957 to 1968, Procter & Gamble owned Clorox, the leading American manufacturer of liquid bleach; however, the Federal Trade Commission challenged the acquisition, and the U.S. Supreme Court decided against P&G in April 1967. One of the most revolutionary products to come out on the market was the company's disposable Pampers diaper, first test-marketed in 1961, the same year Procter & Gamble came out with Head & Shoulders. Prior to this point, disposable diapers were not popular, although Johnson & Johnson had developed a product called Chux. Babies always wore cloth diapers, which were leaky and labor-intensive to wash. Pampers provided a convenient alternative, albeit at the environmental cost of more waste requiring landfilling. Amid the recent concerns parents have voiced on the ingredients in diapers, Pampers launched Pampers Pure collection in 2018, which is a \"natural\" diaper alternative. Further developments Procter & Gamble acquired a number of other companies that diversified its product line and significantly increased profits. These acquisitions included Folgers Coffee, Norwich Eaton Pharmaceuticals (the makers of Pepto-Bismol), Richardson-Vicks, Noxell (Noxzema), Shulton's Old Spice, Max Factor, the Iams Company, and Pantene, among others. In 1994, the company made headlines for big losses resulting from leveraged positions in interest rate derivatives, and subsequently sued Bankers Trust for fraud; this placed their management in the unusual position of testifying in court that they had entered into transactions that they were not capable of understanding. In 1996, P&G again made headlines when the Food and Drug Administration approved a new product developed by the company, Olestra. Also known by its brand name 'Olean', Olestra is a lower-calorie substitute for fat in cooking potato chips and other snacks. In January 2005, P&G announced the acquisition of Gillette, forming the largest consumer goods company and placing Unilever into second place. This added brands such as Gillette razors, Duracell, Braun, and Oral-B to their stable. The acquisition was approved by the European Union and the Federal Trade Commission, with conditions to a spinoff of certain overlapping brands. P&G agreed to sell its SpinBrush battery-operated electric toothbrush business to Church & Dwight, and Gillette's Rembrandt toothpaste line to Johnson & Johnson. The deodorant brands Right Guard, Soft and Dri, and Dry Idea were sold to Dial Corporation. In 2001, Liquid Paper and Gillette's stationery division, Paper Mate, were sold to Newell Rubbermaid. The companies officially merged on October 1, 2005. In 2008, P&G branched into the record business with its sponsorship of Tag Records, as an endorsement for TAG Body Spray. P&G's dominance in many categories of consumer products makes its brand management decisions worthy of study. For example, P&G's corporate strategists must account for the likelihood of one of their products cannibalizing the sales of another. In August 2009, Warner Chilcott acquired P&G's prescription-drug business for $3.1 billion. P&G exited the food business in 2012 when it sold its Pringles snack food business to Kellogg's for $2.75 billion after the $2.35 billion deal with former suitor Diamond Foods fell short. The company had previously sold Jif peanut butter, Crisco shortening and oils, and Folgers coffee in separate transactions to fellow Ohio-based company Smucker's. In April 2014, the company sold its Iams pet food business in all markets excluding Europe to Mars, Inc. for $2.9 billion. It sold the European Iams business to Spectrum Brands in December 2014. Restructuring On August 1, 2014, P&G announced it was streamlining the company, dropping and selling off around 100 brands from its product portfolio in order to focus on the remaining 65 brands, which produced 95% of the company's profits. A.G. Lafley, the company's chairman and CEO until October 2015, said the future P&G would be \"a much simpler, much less complex company of leading brands that's easier to manage and operate\". In March 2015, the company divested its Vicks VapoSteam U.S. liquid inhalant business to Helen of Troy, part of a brand-restructuring operation. This deal was the first health-related divestiture under the brand-restructuring operation. The deal included a fully paid-up license to the Vicks VapoSteam trademarks and the U.S. license of P&G's Vicks VapoPad trademarks for scent pads. Most Vicks VapoSteam and VapoPads are used in Vicks humidifiers, vaporizers and other health care devices already marketed by Helen of Troy. Later that same year in July, the company announced the sale of 43 of its beauty brands to Coty, a beauty-product manufacturer, in a US$13 billion deal. It cited sluggish growth of its beauty division as the reason for the divestiture. The sale was completed on October 3, 2016. In February 2016, P&G completed the transfer of Duracell to Berkshire Hathaway through an exchange of shares. In December 2018, Procter & Gamble completed the acquisition of the consumer health division of Merck Group (known as EMD Serono in North America) for €3.4 billion ($4.2 billion) and renamed it as Procter & Gamble Health Limited in May 2019. In November 2018, P&G unveiled a simpler corporate structure with six business units that will be effective from July 2019. In 2023, the company began optimizing its product offering. As part of this strategy, it plans to eliminate the bottom 25% of SKUs, which contribute very little to absolute retail sales. According to other comparable companies, a similar share of SKUs represents between 2% and 2.5% of its turnover at a global level. In June 2025, the company announced 7,000 layoffs over the following 2 years due to uncertainty regarding Tariffs in the second Trump administration. Finances For the fiscal year 2018, Procter & Gamble reported earnings of US$9.750 billion, with an annual revenue of US$66.832 billion, an increase of 2.7% over the previous fiscal cycle. The company's shares traded at over $86 per share in 2017, and its market capitalization was valued at over US$221.5 billion in October 2018. The company ranked No. 42 on the 2018 Fortune 500 list of the largest United States corporations by total revenue. Management Board of directors As of February 2025 the board of directors of Procter & Gamble has 14 members: Previous members of the board include: W. James McNerney, Jr. Nelson Peltz Scott Cook Angela Braly Frank Blake Meg Whitman In March 2011, Rajat Gupta resigned from the board after an SEC accusation of Galleon Group insider trading. In May 2011, the company was noted for having 11 female directors that were all on the Most Powerful Women list by Fortune. In May 2013, Robert A. McDonald announced his retirement and was replaced by A.G. Lafley, who returned as chairman, president, and CEO. Jon R. Moeller succeeded Lafley as CEO in 2021. In July 2025, Procter & Gamble announced Shailesh G. Jejurikar would succeed Jon R. Moeller as CEO in 2026. Procter & Gamble is a member of the U.S. Global Leadership Coalition, a Washington, DC–based coalition of over 400 major companies and NGOs that advocates for a larger international affairs budget, which funds American diplomatic and development efforts abroad. Awards and recognition Procter & Gamble ranked 2nd in the world in the 2024 review of WIPO's annual World Intellectual Property Indicators, with 525 designs in industrial design registrations being published under the Hague System during 2023. Fortune magazine awarded P&G a top spot on its list of \"Global Top Companies for Leaders\", and ranked the company at 15th place of the \"World's Most Admired Companies\" list. Chief Executive magazine named P&G the best overall company for leadership development in its list of the \"40 Best Companies for Leaders\". In October 2008, P&G was named one of \"Canada's Top 100 Employers\" by Mediacorp Canada Inc. and was featured in Maclean's newsmagazine. Later that month, P&G was also named one of Greater Toronto's Top Employers, which was announced by the Toronto Star newspaper. In October 2013, the company was named the fourth-most in-demand employer in the world according to analytic data sourced by LinkedIn. In August 2013, P&G was named the 14th-hardest company to interview for by Glassdoor. In November 2013, Glassdoor also named them as a top 25 company for career opportunities. In February 2014, Glassdoor placed P&G 34th on their annual Best Places to Work list. In November 2015, P&G was named the Careers in Africa Employer of Choice 2015 following a survey of over 13,000 African professionals from across the globe. P&G was also recognized as the most desirable FMCG business to work for in Africa. P&G was recognized as one of Forbes World's Most Reputable Companies in 2016, 2017, and 2023. Brands As of 2015, 21 of P&G's brands have more than a billion dollars in net annual sales. Most of these brands – including Bounty, Crest, Always, and Tide – are global products available on several continents. In 2005, Procter & Gamble made a $57 billion deal to buy Gillette, which combined some of the world's top brands including, signature razors, Duracell batteries, Braun, and Oral-B brands. P&G's products are available in North America, Latin America, Europe, the Middle East, Africa, Asia, Australia, and New Zealand. In 2018, P&G's fabric and home care division accounted for 32% of the company's total net sales, the highest of all its divisions. The division includes Downy, Gain, Tide, Febreze, and Dawn. According to Advertising Age, Procter & Gamble spent $4.3 billion advertising various brands in the United States in 2015, making it the top advertiser in the country. Manufacturing operations are based in these countries: Radio and television production Procter & Gamble produced and sponsored the first radio serial dramas in the 1930s. As the company was known for Ivory soap, the serials became known as \"soap operas\". With the rise of television in the 1950s and 1960s, most of the new serials were sponsored, produced and owned (20 series) by the company (including The Guiding Light, which had begun as a radio serial, and made the transition to television lasting 72 years). The end of As the World Turns in 2010 resulted in the company's absence from the soap opera genre for almost fifteen years, which lasted until Beyond the Gates (a co-production with CBS Studios and the NAACP) premiered on CBS in 2025. The Young and the Restless, produced by Sony Pictures Television and also broadcast on CBS, is also partially sponsored by Procter & Gamble. These past serials were produced by Procter & Gamble: Procter & Gamble also was the first company to produce and sponsor a prime-time serial, a 1965 spin-off of As the World Turns called Our Private World. In 1979, PGP produced Shirley, a prime-time NBC series starring Shirley Jones, which lasted 13 episodes. They also produced TBS' first original comedy series, Down to Earth, which ran from 1984 to 1987 (110 episodes were produced). They also distributed the syndicated comedy series Throb. In 1985, they produced a game-show pilot called The Buck Stops Here with Taft Entertainment Television in 1985, hosted by Jim Peck; it was not picked up. Procter & Gamble Productions originally co-produced Dawson's Creek with Columbia TriStar Television but withdrew before the series premiere due to early press reviews. They also produced the 1991 TV movie A Triumph of the Heart: The Ricky Bell Story, which was co-produced by The Landsburg Company, and they continued to produce the People's Choice Awards until the show was sold to E! channel in April 2017. In 2007, PGP teamed up with the now-defunct Cookie Jar Group to produce the Flash-animated children's series Will and Dewitt, which featured the character Dewitt, the mascot for the Pampers baby product line's former sub-brand, Kandoo. With Walmart, PGP sponsored Family Movie Night on broadcast networks in 2010–2011 and Walden Family Theater on the Hallmark Channel in 2013. In 2013, PGP rebranded itself as Procter & Gamble Entertainment (PGE) with a new logo and an emphasis on multiple-platform entertainment production. P&G funded a six-episode series, Activate, on National Geographic in 2019 focusing on extreme poverty, inequality and sustainability in conjunction with not-for-profit Global Citizen and production company Radical Media. The company agreed to a longform series deal with Stone Village Television in January 2020. In February 2020, P&G joined Imagine Documentaries' five project slate including Mars 2080, the project closest to production. Sponsorships In addition to its self-produced items through PGE, Procter & Gamble also supports many Spanish-language novellas through advertising on all networks: Azteca América, Estrella TV, Galavisión, Telemundo, UniMás and Univisión. P&G was one of the first mainstream advertisers on Spanish-language TV during the mid-1980s. By the late 1990s, P&G was established as the largest advertiser on Spanish-language media. In 2008, P&G expanded into music sponsorship when it joined Island Def Jam to create Tag Records, named after a body spray that P&G acquired from Gillette. In 2010, after the cancellation of As the World Turns, PGP announced they were phasing out soap opera production and expanding into more family-appropriate programming. Procter & Gamble also gave a $100,000 contract to the winners of Cycles 1 through 3 of Canada's Next Top Model, wherein Andrea Muizelaar, Rebecca Hardy, and Meaghan Waller won the prize. Procter & Gamble has been a major sponsor of the Summer Olympics since 2012. It sponsored 150 athletes at the London games that year. They have also sponsored the Winter Olympics since 2014, continuing the \"Thanks Mom\" program started in 2010 with figure skater Kristi Yamaguchi and expanding it not only to American athletes such as sky racer Lindsey Vonn but also Russian ice hockey players Alexander Ovechkin and Evgeni Malkin, German long track speed skater Sven Kramer and Japanese figure skaters Daisuke Takahashi and Yuzuru Hanyu. It will do so at the 2028 Summer Olympics in Los Angeles, CA, USA besides the 2026 Winter Olympics in Cortina d'Ampezzo/Milan, Italy. The company's sponsorship includes television ads in which Olympic athletes are portrayed as children to convey the sense that the mothers of these athletes still remember them as infants; other ads stress how Olympic mothers stood by their children through years of training all the way through to Olympic success. 2016's ad for the Rio Games notes upheavals as youths by an American gymnast, Chinese swimmer, Brazilian volleyballer, and German distance runner. The ads all make prominent use of the Ludovico Einaudi orchestral track \"Divenire\" and related such instrumentals. The company has actively developed or sponsored numerous online communities, e.g. BeingGirl.com (launched in 2000) and Women.com. As of 2000, the company had 72 \"highly stylized destination sites\". Controversies Toxic shock syndrome and tampons Toxic shock syndrome (TSS) is a disease caused by strains of the bacteria Staphylococcus aureus. Most people have these bacteria living in their bodies as harmless commensals in places such as the nose, skin, and vagina. The disease can strike anyone, not only women, but the disease is often associated with tampons. In 1980, 814 menstrual-related TSS cases were reported; 38 deaths resulted from the disease. The majority of women in these cases were documented as using super-absorbent synthetic tampons, particularly the Rely tampon created by Procter & Gamble. Unlike other tampons made of cotton and rayon, Rely used carboxymethylcellulose and compressed beads of polyester for absorption. In the summer of 1980, the Centers for Disease Control released a report explaining how these bacterial mechanisms were leading to TSS. They also stated that the Rely tampon was associated with TSS more than any other brand of tampon. In September 1980, Procter & Gamble voluntarily recalled its Rely brand of tampons from the market. Since the 1980s, reported cases of TSS have dramatically decreased. Other products In 2002, P&G was sued for its ads falsely suggesting to the consumers that the drug Prilosec could cure heartburn in a day. In December 2005, the Pharmaceutical division of P&G was involved in a dispute over research involving its osteoporosis drug Actonel. The case was discussed in the media. Animal testing Procter & Gamble has received criticism from animal advocacy group PETA for the practice of testing on animals. On June 30, 1999, Procter & Gamble announced that it would limit its animal testing practices to its food and drug products which represented less than 20% of its product portfolio. The company invested more than $275 million in the development of alternative testing methods. Price fixing In April 2011, P&G was fined €211.2 million by the European Commission for establishing a price-fixing cartel for washing powder in Europe along with Unilever, which was fined €104 million, and Henkel. Though the fine was set higher at first, it was discounted by 10% after P&G and Unilever admitted running the cartel. As the provider of the tip-off leading to investigations, Henkel was not fined. Child labor and forced labor According to a 2016 report by Amnesty International, palm oil provider Wilmar International, the world's biggest palm oil grower in 2016 and supplier of raw materials to Procter & Gamble, profited from 8 to 14-year-old child labor and forced labor. Some workers were extorted, threatened, or not paid for work. Some workers also suffered severe injuries from toxic banned chemicals. Logo myth and Satanism accusations P&G's former logo originated in 1851 as a crude cross that barge workers on the Ohio River painted on cases of P&G star candles to identify them. P&G later changed this symbol into a trademark that showed a man in the Moon overlooking 13 stars, said to commemorate the original Thirteen Colonies. The company received unwanted media publicity in the 1980s due to rumors, spread largely by Amway distributors, that the Moon-and-stars logo was a satanic symbol. The accusation was based on a passage in the Bible, Revelation 12:1, which states: \"And there appeared a great wonder in heaven; a woman clothed with the sun, the moon under her feet and upon her head a crown of 12 stars.\" Until 1985, P&G's logo consisted of a man's face on the Moon surrounded by 13 stars. Some claimed that the logo was a mockery of the heavenly symbol alluded to in the aforementioned verse, thus construing the logo to be satanic. Where the flowing beard meets the surrounding circle, three abstracted curls were said to be a mirror image of the number 666, or the number of the beast. At the top and bottom, the hair curls in on itself and was said to be the horns like those of a ram. In 1991, details of the logo were simplified, and the moon-and-stars logo was completely replaced by a text-only logo in 1995 in a failed attempt to quash the conspiracy theory, though in 2013 it unveiled a new logo with a hint of a crescent moon behind the text. These interpretations have been denied by company officials and no evidence linking the company to the Church of Satan or any occult organization has ever been presented. The company unsuccessfully sued Amway from 1995 to 2003 over rumors forwarded through a company voice-mail system in 1995. In 2007, the company successfully sued individual Amway distributors for reviving and propagating the false rumors. The Church of Satan denies being supported by Procter & Gamble. Reverse domain name hijacking In March 2013, P&G was found by a World Intellectual Property Organization panel to have engaged in reverse domain hijacking in an attempt to obtain the domain name \"swash.com\" from Marchex in a Uniform Domain-Name Dispute-Resolution Policy proceeding. P&G originally stated it had generated more than $40 million in sales of its Swash laundry products over four years, a figure it later revised to $60,000. After losing the case P&G purchased the domain name from Marchex. In 2013 attorney John Berryhill suggested that P&G did not intend to use the swash.com domain to market its existing range, as it had said, but rather a new product described in a 2011 trademark application as \"An appliance for domestic use in the nature of a garment steamer for the purpose of removing wrinkles and odors from clothing and linen\". Berryhill's theory was shown to be accurate after swash.com went live in June 2014. \"The Talk\" In 2017, as part of the \"My Black is Beautiful\" platform, P&G released an advertisement called \"The Talk\". It showed African American mothers throughout the decades giving their children \"the talk\" about racism. The advertisement garnered controversy for several different reasons. Some criticized it for not showing any fathers giving \"the talk\", while others accused it of being anti-white. One scene depicted a mother warning her daughter about being pulled over by the police. The daughter responds by saying that she is a good driver so her mother doesn't need to worry about her getting a ticket. The mother then implies that she might experience police brutality by being racially profiled and killed. Several police officers and groups accused that part of the advertisement of being anti-cop. \"The Talk\" was accused by Michelle Malkin of National Review of being \"liberal advertising\". Malkin also called the ad \"Black Lives Matter propaganda\" and accused it of pandering and using identity politics. Despite the criticism, the advertisement also received a lot of positive reception and praise with some calling it \"powerful\" and \"thought-provoking\". The advertisement has also won several awards including the 2018 Cannes Lions International Festival of Creativity Grand Prix and the 2018 Primetime Emmy Award for Outstanding Commercial during the 70th Primetime Creative Arts Emmy Awards. \"Woke\" social stances The company has been criticized for its social stances, some of which were criticized for being \"woke\". In November 2014, P&G came out publicly in support of same-sex marriage. In January 2019, CEO David Taylor said in Switzerland: \"The world would be a better place if my board of directors on down is represented by 50% of the women. We sell our products to more than 50% of the women.\" Also in January 2019, The Wall Street Journal noted the company's board of directors had more than twice as many men as it does women. As of mid-2020, the board of P&G consisted of an equal number of men and women. In 2025, the company continued its policies of diversity, equity, and inclusion despite government scrutiny during the second presidency of Donald Trump. Gillette advertisement On January 14, 2019, P&G subsidiary Gillette released a controversial advertisement, \"The Best Men Can Be\", ostensibly to address negative behavior among men, including bullying, sexism, sexual misconduct, and toxic masculinity. The ad was the subject of controversy and was received negatively by various online commentators, becoming one of the most disliked videos on YouTube. The ad led to calls for boycott of Gillette and Procter & Gamble. Later in the year, its Gillette shaving business took an $8 billion write-down in value, although the company and analysts pointed to accumulated currency fluctuations, the entrance of strong rivals and decline in the demand for shaving products since the division's previous valuation in 2005, rather than fallout from the ad. Trade in Russia amid Ukraine war The Ukrainian National Agency for Prevention of Corruption (NACP) placed P&G on the list of International Sponsors of War for the 2022 Russian invasion of Ukraine. P&G has two factories operating in Russia (the Gillette razor manufacturing plant in Saint Petersburg and a toiletries manufacturing plant in Tula Oblast), thus contributing to the Russian federal budget and financing Russian war crimes according to the NACP. It was placed on the list alongside Bacardi and Unilever. In 2022, the company's revenue amounted to 108 billion rubles."
}