{
  "ticker": "PGR",
  "cik": "0000080661",
  "company_name": "Progressive Corporation",
  "corrected_name": "Progressive Corporation",
  "wiki_title_used": "Progressive Corporation",
  "exists": true,
  "raw_text": "The Progressive Corporation is an American insurance company. Progressive is currently the #2 auto insurer in the United States behind State Farm. The company was co-founded in 1937 by Jack Green and Joseph M. Lewis, and is headquartered in Mayfield, Ohio. The company insures passenger vehicles, motorcycles, recreational vehicles (RVs), trailers, boats, personal water craft (PWC), and commercial vehicles. Progressive also provides home, life, pet, and other types of insurance through select companies.\nThe company ranked #62 on the 2024 Fortune 500 list of the top American corporations.\n\nHistory\nProgressive was formed in 1937 by Joseph Lewis and Jack Green as Progressive Mutual Insurance Company. In 1956, the company found a niche by insuring more risky drivers. In 1965, Peter B. Lewis, son of Joseph Lewis, and his mother borrowed $2.5 million, pledging their majority stake as collateral, and completed a leveraged buyout of Progressive. In 1971, Progressive conducted an initial public offering (IPO) and became a publicly-traded company. In 1987, the sum of the company's written premiums surpassed $1 billion, and by 2016 that number reached $20 billion. Progressive also claims being the first auto insurance company to allow customers to purchase insurance policies over the phone in 1993, and to have a website in 1995, and have policies available for purchase online in 1997. Later, Progressive enabled customers to use mobile browsers and smartphone apps for rating and managing policies. It also reports to be the first to offer 24/7 claims reporting.   \nOn December 13, 2006, the company said earnings rose 58 percent in November as the company retained more of the premiums it collected because of comparisons to a month affected by Hurricane Katrina claims.\n\nSegments\nThe company operates in three segments: personal lines, commercial auto, and other indemnity.\n\nThe personal lines segment writes insurance for private passenger automobiles, motorcycles, boats, and recreational vehicles through both an independent agency channel and a direct channel.\nThe commercial auto segment writes primary liability and physical damage insurance for automobiles and trucks owned by businesses primarily through an independent agency channel.\nThe other-indemnity segment provides professional liability insurance to community banks, principally directors, and officers liability insurance. It also provides insurance-related services, primarily providing policy issuance and claims adjusting services in 25 states for Commercial Auto Insurance Procedures/Plans.\n\nIndustry information\nProgressive is the second-largest auto insurer in the United States as of the 2023 fiscal year, with 15.2% of the market, behind State Farm's share of 18.3%. Progressive primarily offers its services through the internet, by telephone or through independent insurance agents. Progressive’s agency business sells insurance through more than 30,000 independent insurance agents and progressiveagent.com where customers can quote their own policies and then contact an agent to complete the sale.\nIn December 2009, Progressive announced it was selling car insurance in Australia. Initially called Progressive Direct, it rebranded as Progressive in 2011, and later rebranded as PD Insurance in 2019.\n\nCrash response\nIn September 2007, Progressive began to offer pet injury coverage, which provides coverage for dogs and cats that are injured in a crash and is included at no additional cost with collision coverage. Immediate response vehicles used by Progressive are specially modified Ford Explorers and Ford Escapes.\n\nAdvertising\nProgressive's marketing campaign is known for offering quotes of its competitors along with its own quote.\nSince 2008, many of Progressive's television advertisements have featured a character named Flo, played by actress Stephanie Courtney, who explains the benefits of Progressive Insurance. In December 2010, the company introduced the \"Messenger\", as a complementary campaign. He was played by John Jenkinson. The Flo universe also includes Jamie (Jim Cashman), an awkward fellow Progressive employee; and Bill and Tom, rival insurance salesmen from the figurative straw man \"A. Nother Insurance Company.\" Bill and Tom were largely discontinued after Allstate filed a claim with the Better Business Bureau alleging that Progressive was making a false claim that they offered discounts that Allstate and other insurance providers did not.\nIn 2012, Progressive introduced another character, a personified box, voiced by Chris Parnell, representing the company's products. It is portrayed as having an entourage (including a personal trainer). Progressive later added more characters like Flobot, Mara (Natalie Palamides), Dr. Rick, and Motaur to its advertising series. In 2019, Progressive began the At Home with Baker Mayfield ad campaign during the National Football League season. The campaign featured the Cleveland Browns quarterback living with his wife in FirstEnergy Stadium. After he was traded to the Carolina Panthers in the 2022 offseason, Mayfield stated that the advertisements will end, calling it a \"missed opportunity.\"\nIn 2022, Jon Hamm appeared in several TV commercials, as himself, unsuccessfully pursuing a romantic relationship with spokesperson Flo.\n\nProducts\nAccording to a February 2011 Wall Street Journal article, Progressive has a leg up on its rivals in Pay As You Drive insurance, a form of vehicle insurance also generically known as usage-based insurance. Progressive has seven U.S. patents covering usage-based insurance methods and systems, with more patents pending. Progressive began working on the concept in the mid-1990s and continues to refine the concept and bring it to the mass market.\nSnapshot is Progressive's Pay As You Drive, or usage-based insurance program. Snapshot is a voluntary discount program where drivers can save money on their car insurance by sharing their driving habits with Progressive. According to Progressive, Snapshot is best for people who drive less, in safer ways and during safer times of day. Snapshot customers can make changes to their driving habits that will lead to bigger discounts by checking their driving data and projected discount on progressive.com over the course of their initial policy period.\nDrivers plug a device the size of a garage door opener into the on-board diagnostic (OBD) port of their car. The device records and sends the driving data to Progressive, and Progressive uses that information to calculate the rate. After 30 days, customers find out if they're eligible for a discount based on that 30-day \"snapshot\" of their driving habits. At the end of a six-month policy period, Progressive calculates the customer's renewal discount and customers return the device to Progressive. The company doesn't take into account how fast the car goes although it does take into account how fast and frequently the vehicle operator brakes. Snapshot is voluntary and customers can opt out at any time. The customer is charged up to $50.00 if they do not return the snapshot device to Progressive should they decide not to engage in the program after receiving it.\nSnapshot is currently available in 45 states plus the District of Columbia. Because insurance is regulated at the state level, Snapshot is currently not available in Alaska, California, Hawaii, and North Carolina.\n\nCorporate sponsorship\nNaming rights\nIn 1999, Progressive Auto Insurance was the title sponsor of the Super Bowl XXXIII halftime show.\nIn January 2008, Jacobs Field in Cleveland, Ohio, home of the Cleveland Guardians, was renamed Progressive Field. Progressive signed a 16-year contract for the naming rights, as well as sponsorship rights to become the Official Auto Insurer of the Cleveland Guardians. The agreement costs around $3.6 million per year. (Mayfield Village, Ohio, where the company is based, is a suburb of Cleveland.) Naming rights for Progressive were extended on April 3, 2024 for an additional 12 years until at least 2036, with an option to extend by 5 years to 2041 if the current lease on the ballpark was extended.\nIn March 2008, Progressive announced its title sponsorship of the Progressive Insurance Automotive X PRIZE and their funding of the $10 million prize purse. The Progressive Automotive X PRIZE is an international competition designed to inspire a new generation of viable, super fuel-efficient vehicles. The competition is open to teams from around the world that can design, build, and bring to market 100 MPGe (miles per gallon energy equivalent) vehicles.\nOn December 14, 2010, the Gator Bowl Association announced that Progressive Insurance would become the title sponsor for the 2011 Gator Bowl college football bowl game.\nOn September 24, 2019, Progressive became the official sponsor of Friday Night SmackDown broadcast on Fox. it will later serve as presenting sponsor for NXT on The CW.\nStarting in 2021, Progressive sponsored Sesame Street on PBS Kids replacing Blue Lizard Australian Sunscreen.\nIn 2025, Progressive sponsored the ‘’Rocket League Championship Series’’ to hold the naming rights for the RLCS 2025 season events, such as the Birmingham Major, Raleigh Major and the World Championship in Lyon-Decines.\n\nNASCAR\nIn 2020, Progressive sponsored Roush Fenway Racing's No. 6 car for Ryan Newman at races at Atlanta and Pocono. In 2025, Progressive signed a deal to sponsor Joe Gibbs Racing's No. 11 car for Denny Hamlin for 18 races, replacing FedEx.\n\nMotorcycle\nProgressive has been the Title Sponsor of the International Motorcycle Shows (IMS) since 2010.\nProgressive has been the Title Sponsor of Sturgis Motorcycle Rally in Sturgis, SD since 2017.\nBikes, Blues and BBQ: Title Sponsor, 2015 – Current\nThe Handbuilt Bike Show: Presenting Sponsor, 2018 – Current\nLaconia Motorcycle Week: Title Sponsor, 2012 – Current\nLeesburg Bikefest: Presenting Sponsor, 2014 – Current\nMotoblot: Presenting Sponsor, 2015 – Current\nOhio Bike Week: Title Sponsor, 2016–Present\n\nBoat\nProgressive has been the Title Sponsor of the National Marine Manufacturers Association (NMMA) boat shows since 2012, and will maintain title sponsorship through at least 2022.\n\nFred Hall Shows: Title Sponsor, 2016–Present\nLEMTA (Lake Erie Marine Trades Association): Title Sponsor, 2016–Present\n\nOutdoors\nHay Days: Official Insurance Sponsor, 2018 – Current\nQuartzsite Sports, Vacation and RV Show: Official Insurance Sponsor, 2014 – Current\n\nControversies\nIn 2002, the company settled with the State of Georgia in a class action lawsuit over diminished value claims brought by policyholders. Five years later, the company apologized after it was revealed they hired private investigators to infiltrate a church group and pose as congregation members to collect information on litigants seeking redress from the company. Another lawsuit was filed by the litigants over the affair against the company for invasion of privacy and fraud.\nIn 2009, Progressive was sued for allegedly deceiving policyholders by employing illegally operated, unlicensed body shops to make repairs on vehicles for their clients in order to save money. The court ruled in the company's favor on two of the counts and the other four were dropped, pending appeal.\nIn 2012, the company was widely criticized online for how it handled the claims filed by the family of Kaitlynn Fisher. The 24-year-old died when the car she was driving was hit by another that had run a red light in Baltimore. Progressive fought to avoid paying out the claim to Fisher's estate. Fisher's insurance policy with Progressive included coverage in the event of an accident with an underinsured driver. The underinsured driver was found to be negligent in a jury trial brought by the Fisher family, in which the Fisher family contended that Progressive provided legal assistance to the defense. In two followup statements, Progressive explained that they did not \"serve as the attorney for the defendant in this case\" and then clarified that \"[a]s a defendant in this case, Progressive participated in the trial procedures on our own behalf.\" The company's position was that fault for the accident had not been clearly established, since three witnesses (the driver of the other car, that car's passenger, and Ms. Fisher's passenger) believed that Fisher had run a red light, and filed a motion to intervene to assert that she had been at fault, and therefore was not liable to pay the underinsured motorist claim. The lawyer for the Fisher family countered by noting that two of the three witnesses were not independent, saying \"I have an issue with how they examined the evidence to abandon their insured\" and introduced the idea the state insurance commissioner could find Progressive had acted in bad faith. As noted, Progressive lost the case and was ordered to pay the underinsured motorist claim in addition to a separate settlement with the Fisher family \"to avoid a hearing before the state insurance commissioner.\"\n\nIndex memberships\nS&P 500\nS&P 1500 Super Comp\n\nSee also\nList of United States insurance companies\n\nReferences\nExternal links\nBusiness data for Progressive Corporation:",
  "clean_text": "The Progressive Corporation is an American insurance company. Progressive is currently the #2 auto insurer in the United States behind State Farm. The company was co-founded in 1937 by Jack Green and Joseph M. Lewis, and is headquartered in Mayfield, Ohio. The company insures passenger vehicles, motorcycles, recreational vehicles (RVs), trailers, boats, personal water craft (PWC), and commercial vehicles. Progressive also provides home, life, pet, and other types of insurance through select companies. The company ranked #62 on the 2024 Fortune 500 list of the top American corporations. History Progressive was formed in 1937 by Joseph Lewis and Jack Green as Progressive Mutual Insurance Company. In 1956, the company found a niche by insuring more risky drivers. In 1965, Peter B. Lewis, son of Joseph Lewis, and his mother borrowed $2.5 million, pledging their majority stake as collateral, and completed a leveraged buyout of Progressive. In 1971, Progressive conducted an initial public offering (IPO) and became a publicly-traded company. In 1987, the sum of the company's written premiums surpassed $1 billion, and by 2016 that number reached $20 billion. Progressive also claims being the first auto insurance company to allow customers to purchase insurance policies over the phone in 1993, and to have a website in 1995, and have policies available for purchase online in 1997. Later, Progressive enabled customers to use mobile browsers and smartphone apps for rating and managing policies. It also reports to be the first to offer 24/7 claims reporting. On December 13, 2006, the company said earnings rose 58 percent in November as the company retained more of the premiums it collected because of comparisons to a month affected by Hurricane Katrina claims. Segments The company operates in three segments: personal lines, commercial auto, and other indemnity. The personal lines segment writes insurance for private passenger automobiles, motorcycles, boats, and recreational vehicles through both an independent agency channel and a direct channel. The commercial auto segment writes primary liability and physical damage insurance for automobiles and trucks owned by businesses primarily through an independent agency channel. The other-indemnity segment provides professional liability insurance to community banks, principally directors, and officers liability insurance. It also provides insurance-related services, primarily providing policy issuance and claims adjusting services in 25 states for Commercial Auto Insurance Procedures/Plans. Industry information Progressive is the second-largest auto insurer in the United States as of the 2023 fiscal year, with 15.2% of the market, behind State Farm's share of 18.3%. Progressive primarily offers its services through the internet, by telephone or through independent insurance agents. Progressive’s agency business sells insurance through more than 30,000 independent insurance agents and progressiveagent.com where customers can quote their own policies and then contact an agent to complete the sale. In December 2009, Progressive announced it was selling car insurance in Australia. Initially called Progressive Direct, it rebranded as Progressive in 2011, and later rebranded as PD Insurance in 2019. Crash response In September 2007, Progressive began to offer pet injury coverage, which provides coverage for dogs and cats that are injured in a crash and is included at no additional cost with collision coverage. Immediate response vehicles used by Progressive are specially modified Ford Explorers and Ford Escapes. Advertising Progressive's marketing campaign is known for offering quotes of its competitors along with its own quote. Since 2008, many of Progressive's television advertisements have featured a character named Flo, played by actress Stephanie Courtney, who explains the benefits of Progressive Insurance. In December 2010, the company introduced the \"Messenger\", as a complementary campaign. He was played by John Jenkinson. The Flo universe also includes Jamie (Jim Cashman), an awkward fellow Progressive employee; and Bill and Tom, rival insurance salesmen from the figurative straw man \"A. Nother Insurance Company.\" Bill and Tom were largely discontinued after Allstate filed a claim with the Better Business Bureau alleging that Progressive was making a false claim that they offered discounts that Allstate and other insurance providers did not. In 2012, Progressive introduced another character, a personified box, voiced by Chris Parnell, representing the company's products. It is portrayed as having an entourage (including a personal trainer). Progressive later added more characters like Flobot, Mara (Natalie Palamides), Dr. Rick, and Motaur to its advertising series. In 2019, Progressive began the At Home with Baker Mayfield ad campaign during the National Football League season. The campaign featured the Cleveland Browns quarterback living with his wife in FirstEnergy Stadium. After he was traded to the Carolina Panthers in the 2022 offseason, Mayfield stated that the advertisements will end, calling it a \"missed opportunity.\" In 2022, Jon Hamm appeared in several TV commercials, as himself, unsuccessfully pursuing a romantic relationship with spokesperson Flo. Products According to a February 2011 Wall Street Journal article, Progressive has a leg up on its rivals in Pay As You Drive insurance, a form of vehicle insurance also generically known as usage-based insurance. Progressive has seven U.S. patents covering usage-based insurance methods and systems, with more patents pending. Progressive began working on the concept in the mid-1990s and continues to refine the concept and bring it to the mass market. Snapshot is Progressive's Pay As You Drive, or usage-based insurance program. Snapshot is a voluntary discount program where drivers can save money on their car insurance by sharing their driving habits with Progressive. According to Progressive, Snapshot is best for people who drive less, in safer ways and during safer times of day. Snapshot customers can make changes to their driving habits that will lead to bigger discounts by checking their driving data and projected discount on progressive.com over the course of their initial policy period. Drivers plug a device the size of a garage door opener into the on-board diagnostic (OBD) port of their car. The device records and sends the driving data to Progressive, and Progressive uses that information to calculate the rate. After 30 days, customers find out if they're eligible for a discount based on that 30-day \"snapshot\" of their driving habits. At the end of a six-month policy period, Progressive calculates the customer's renewal discount and customers return the device to Progressive. The company doesn't take into account how fast the car goes although it does take into account how fast and frequently the vehicle operator brakes. Snapshot is voluntary and customers can opt out at any time. The customer is charged up to $50.00 if they do not return the snapshot device to Progressive should they decide not to engage in the program after receiving it. Snapshot is currently available in 45 states plus the District of Columbia. Because insurance is regulated at the state level, Snapshot is currently not available in Alaska, California, Hawaii, and North Carolina. Corporate sponsorship Naming rights In 1999, Progressive Auto Insurance was the title sponsor of the Super Bowl XXXIII halftime show. In January 2008, Jacobs Field in Cleveland, Ohio, home of the Cleveland Guardians, was renamed Progressive Field. Progressive signed a 16-year contract for the naming rights, as well as sponsorship rights to become the Official Auto Insurer of the Cleveland Guardians. The agreement costs around $3.6 million per year. (Mayfield Village, Ohio, where the company is based, is a suburb of Cleveland.) Naming rights for Progressive were extended on April 3, 2024 for an additional 12 years until at least 2036, with an option to extend by 5 years to 2041 if the current lease on the ballpark was extended. In March 2008, Progressive announced its title sponsorship of the Progressive Insurance Automotive X PRIZE and their funding of the $10 million prize purse. The Progressive Automotive X PRIZE is an international competition designed to inspire a new generation of viable, super fuel-efficient vehicles. The competition is open to teams from around the world that can design, build, and bring to market 100 MPGe (miles per gallon energy equivalent) vehicles. On December 14, 2010, the Gator Bowl Association announced that Progressive Insurance would become the title sponsor for the 2011 Gator Bowl college football bowl game. On September 24, 2019, Progressive became the official sponsor of Friday Night SmackDown broadcast on Fox. it will later serve as presenting sponsor for NXT on The CW. Starting in 2021, Progressive sponsored Sesame Street on PBS Kids replacing Blue Lizard Australian Sunscreen. In 2025, Progressive sponsored the ‘’Rocket League Championship Series’’ to hold the naming rights for the RLCS 2025 season events, such as the Birmingham Major, Raleigh Major and the World Championship in Lyon-Decines. NASCAR In 2020, Progressive sponsored Roush Fenway Racing's No. 6 car for Ryan Newman at races at Atlanta and Pocono. In 2025, Progressive signed a deal to sponsor Joe Gibbs Racing's No. 11 car for Denny Hamlin for 18 races, replacing FedEx. Motorcycle Progressive has been the Title Sponsor of the International Motorcycle Shows (IMS) since 2010. Progressive has been the Title Sponsor of Sturgis Motorcycle Rally in Sturgis, SD since 2017. Bikes, Blues and BBQ: Title Sponsor, 2015 – Current The Handbuilt Bike Show: Presenting Sponsor, 2018 – Current Laconia Motorcycle Week: Title Sponsor, 2012 – Current Leesburg Bikefest: Presenting Sponsor, 2014 – Current Motoblot: Presenting Sponsor, 2015 – Current Ohio Bike Week: Title Sponsor, 2016–Present Boat Progressive has been the Title Sponsor of the National Marine Manufacturers Association (NMMA) boat shows since 2012, and will maintain title sponsorship through at least 2022. Fred Hall Shows: Title Sponsor, 2016–Present LEMTA (Lake Erie Marine Trades Association): Title Sponsor, 2016–Present Outdoors Hay Days: Official Insurance Sponsor, 2018 – Current Quartzsite Sports, Vacation and RV Show: Official Insurance Sponsor, 2014 – Current Controversies In 2002, the company settled with the State of Georgia in a class action lawsuit over diminished value claims brought by policyholders. Five years later, the company apologized after it was revealed they hired private investigators to infiltrate a church group and pose as congregation members to collect information on litigants seeking redress from the company. Another lawsuit was filed by the litigants over the affair against the company for invasion of privacy and fraud. In 2009, Progressive was sued for allegedly deceiving policyholders by employing illegally operated, unlicensed body shops to make repairs on vehicles for their clients in order to save money. The court ruled in the company's favor on two of the counts and the other four were dropped, pending appeal. In 2012, the company was widely criticized online for how it handled the claims filed by the family of Kaitlynn Fisher. The 24-year-old died when the car she was driving was hit by another that had run a red light in Baltimore. Progressive fought to avoid paying out the claim to Fisher's estate. Fisher's insurance policy with Progressive included coverage in the event of an accident with an underinsured driver. The underinsured driver was found to be negligent in a jury trial brought by the Fisher family, in which the Fisher family contended that Progressive provided legal assistance to the defense. In two followup statements, Progressive explained that they did not \"serve as the attorney for the defendant in this case\" and then clarified that \"[a]s a defendant in this case, Progressive participated in the trial procedures on our own behalf.\" The company's position was that fault for the accident had not been clearly established, since three witnesses (the driver of the other car, that car's passenger, and Ms. Fisher's passenger) believed that Fisher had run a red light, and filed a motion to intervene to assert that she had been at fault, and therefore was not liable to pay the underinsured motorist claim. The lawyer for the Fisher family countered by noting that two of the three witnesses were not independent, saying \"I have an issue with how they examined the evidence to abandon their insured\" and introduced the idea the state insurance commissioner could find Progressive had acted in bad faith. As noted, Progressive lost the case and was ordered to pay the underinsured motorist claim in addition to a separate settlement with the Fisher family \"to avoid a hearing before the state insurance commissioner.\" Index memberships S&P 500 S&P 1500 Super Comp"
}