{
  "ticker": "PH",
  "cik": "0000076334",
  "company_name": "Parker Hannifin",
  "corrected_name": "Parker Hannifin",
  "wiki_title_used": "Parker Hannifin",
  "exists": true,
  "raw_text": "Parker-Hannifin Corporation, originally Parker Appliance Company, usually referred to as just Parker, is an American corporation specializing in motion and control technologies. Its corporate headquarters are in Mayfield Heights, Ohio, in Greater Cleveland (with a Cleveland mailing address).\nThe company was founded in 1917 and has been publicly traded on the New York Stock Exchange since December 9, 1964. The firm is one of the largest companies in the world in motion control technologies, including aerospace, climate control, electromechanical, filtration, fluid and gas handling, hydraulics, pneumatics, process control, and sealing and shielding. Parker employs about 61,000 people globally.\nIn 2024, the company was ranked 216 in the Fortune 500.\n\nHistory\n1917–1950\nArthur L. Parker founded the firm as the Parker Appliance Company in Ohio around 1917 or 1918. In its early years, it built pneumatic brake systems for buses, trucks and trains. In 1919, Parker's truck slid over a cliff, causing the company to lose its entire inventory and forcing the founder to return to his previous job. Nonetheless, he restarted Parker Appliance Company in 1924.\n\nBy 1927, the firm had expanded into airplanes. For his flight across the Atlantic Ocean, Charles Lindbergh requested Parker parts be used in the construction of his aircraft the Spirit of St. Louis. The firm contributed the system that linked the aircraft's 16 fuel tanks.\nDuring World War II, Parker experienced a boom in business as the U.S. Air Force's primary supplier of valves and fluid connectors. By 1943, the firm employed 5,000 Cleveland, Ohio, residents. After Arthur Parker's death in 1945 and the end of the war, the company neared bankruptcy due to the sudden drop in demand. Arthur Parker's wife, Helen Parker, assumed control of the company and prevented its liquidation. She hired new management staff and directed the company's focus back to civilian manufacturing.\n\n1950s–1960s\nIn the early 1950s, the firm's executives set a goal to make Parker, as The New York Times put it, \"the General Electric of fluid power\", a goal it generally achieved in the coming decades. In 1957, the company purchased Hannifin, founded by Arthur Hannifin in 1917, a producer of valve and cylinder products, and changed its name to Parker Hannifin. Many more acquisitions followed, with the company reaching 40 acquisitions by the year 1979.\nIn 1953, Arthur Parker's son Patrick S. Parker began working full-time at the company. He rose to become its president in 1968, and served as CEO from 1971 to 1983 and as chairman from 1977 to 1999. During and after his tenure, the firm grew dramatically, with revenues rising from $197 million in 1968 to over $7 billion in 2005.\nThe company debuted on the New York Stock Exchange in 1964, under the ticker symbol PH. In 1966, the company joined the Fortune 500. The company designed parts for the craft used in NASA's first crewed Moon landing in 1969.\n\n1970s–1990s\nAn economic downturn in 1970 forced the company to expand beyond its focus on hydraulic systems. In the following years it began to expand into the automotive aftermarket, considered a more stable industry. The company also directed itself toward growth in aerospace, acquiring companies that created flight controls and wheel brake equipment for airplanes. By 1979, Parker Hannifin employed 20,000 people in 100 plants, selling 90,000 items for machinery, airplanes, cars and construction equipment to 60,000 customers. The company made some of the equipment inside the mechanical shark in the 1975 movie Jaws.\nIn 1982, Paul G. Schloemer replaced Patrick Parker as the company's president (although Patrick Parker remained chairman and CEO). That same year, the firm entered the Mexican market. By 2008, Parker Hannifin Mexico would come to operate 11 plants in the country, seven of which made parts exclusively for the U.S. market. In 1988, the company reached $2 billion in sales.\nThe firm opened its first retail \"ParkerStore\" in Cleveland in 1993. Within 10 years, the network of stores expanded to 200 locations in the U.S. and more than 400 worldwide. ParkerStores offer a variety of Parker products, including hydraulics, automation, and hose and fitting components, at locations close to industrial product buyers. Parker Hannifin systems helped control the massive replica of the Titanic in the 1997 film of the same name. In 1997, the firm moved its headquarters from Cleveland to a new building in Mayfield Heights, a suburb of Cleveland. In 1999, the company's sales reached approximately $5 billion.\n\n2000s–present\nParker Hannifin acquired Commercial Intertech Corporation, a maker of hydraulic systems, in 2000.Commercial Intertech had previously acquired Oildyne Inc., a well known hydraulic manufacturer. Parker has an Oildyne division today. With a cost of $366 million, this was at the time Parker Hannifin's biggest acquisition.\nIn 2001, CEO Don Washkewicz introduced lean startup methods to company operations and has said that over the decade this reduced the time to obtain price quotes by 60% and cut product development lead times by 25%.\nIn 2002 the company appointed Craig Maxwell as head of engineering; Maxwell brought a focus on innovation as well as rigor; he argued for and was given a $20M annual budget to fund blue sky inventions made by engineers and has given engineers time to pursue them; at the same time his team developed software that allows tracking each of the company's 1700 ongoing R&D projects graded by risk and potential reward, and closely managing their progress. In 2011 he hired Ryan Farris out of Vanderbilt University and licensed patents covering a powered exoskeleton that Farris had worked on at Vanderbilt.  In 2015 the company opened an internal business incubator that Maxwell had proposed when he was first hired.\nThe company won $2 billion in contracts to build fuel and hydraulic systems for Airbus A350 airliners in 2008 Two years later, its products were used in repairing the Deepwater Horizon oil rig.\nThomas Williams took over the CEO role from Washkewicz in 2015. In 2016, the company completed its largest acquisition to date, buying Clarcor, a filtration systems manufacturer, for $4.3 billion. In 2019, Parker bought Lord Corporation for $3.7 billion and Kent, WA based Exotic Metals Forming Company for $1.7 billion.\nIn August 2021, the company agreed to buy British aerospace and defense company Meggitt for £6.3 billion. In July 2022, after making commitments to the UK government including increasing research and development spending in Britain, the Secretary of State for Business, Energy and Industrial Strategy approved the takeover without being referred for a full Competition and Markets Authority investigation. The acquisition completed in September 2022.\nIn May 2022, it was announced Parker Hannifin has sold its aircraft wheel and brake division to the Bloomfield-headquartered aerospace company, Kaman Corporation for US$440 million.\nIn November 2025, Parker Hannifin announced a deal to buy Filtration Group—a privately held filtration-technologies manufacturer—for $9.25 billion. The deal is expected to create one of the largest industrial filtration businesses in the world.\n\nAerospace\nParker Hannifin's aerospace group designs and manufactures aerospace hydraulic equipment, flight controls, fuel system components, high-temperature bleed air valves, and other components. Headquartered in Irvine, California, Parker Aerospace operates facilities around the world. The company has had contracts to contribute parts and maintenance for machinery produced by Airbus, Rolls-Royce, Commercial Aircraft Corporation of China as well as other manufacturers.\nIn 1993, the Federal Aviation Administration contracted Parker Aerospace to develop a new monitoring device, the Multi-Sensor Enroute Flight Inspection System, for flight inspection aircraft.\nNotable acquisitions by the division include the Kalamazoo, Michigan-based Abex/NWL division of Pneumo Abex in 1996, and Naples, Florida-based Shaw Aero Devices, in 2007. In 2012, the company partnered with General Electric to form a 50–50 joint venture, Advanced Atomization Technologies, for producing fuel nozzles for commercial aircraft engines.\n\nBoeing 737 accidents and incidents\nIn 1995, it was discovered that failures in a servo unit supplied by Parker Hannifin to Boeing for use in their 737 aircraft may have contributed to several accidents and incidents, including the crashes of United Airlines Flight 585 and USAir Flight 427.\nIn 2004, a Los Angeles jury ordered Parker Hannifin to pay US$43 million to the plaintiff families of the 1997 SilkAir Flight 185 crash in Indonesia. Parker Hannifin subsequently appealed the verdict, which resulted in an out-of-court settlement for an undisclosed amount. The Indonesian National Transportation Safety Committee (NTSC) could not determine the cause of the crash due to the near total lack of physical evidence because of the complete destruction; The US National Transportation Safety Board (NTSB), however disagreed,  and concluded that the crash was caused, possibly intentionally, by the pilot.\nThe FAA ordered an upgrade of all Boeing 737 rudder control systems by November 12, 2002.  The firm argued that the components they supplied were not at fault, citing that the product has one of the safest records in its class, but the FAA directive went through regardless. In 2016, former NTSB investigator John Cox stated that time has proven the NTSB correct in its findings that the valve was faulty, because no additional rudder-reversal incidents have occurred since Boeing's redesign.\n\nF-35 fueldraulic line failure\nOn January 18, 2013, the F-35B variant of the Lockheed Martin F-35 Lightning II was grounded after the failure of a fueldraulic line in the aircraft's propulsion system that controls the exhaust vectoring system.  This followed an incident two days earlier on January 16, in which the propulsion system experienced a fueldraulic failure prior to a conventional takeoff. The failure was found to be a manufacturing defect by Parker Hannifin's Stratoflex division.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Parker-Hannifin Corporation:",
  "clean_text": "Parker-Hannifin Corporation, originally Parker Appliance Company, usually referred to as just Parker, is an American corporation specializing in motion and control technologies. Its corporate headquarters are in Mayfield Heights, Ohio, in Greater Cleveland (with a Cleveland mailing address). The company was founded in 1917 and has been publicly traded on the New York Stock Exchange since December 9, 1964. The firm is one of the largest companies in the world in motion control technologies, including aerospace, climate control, electromechanical, filtration, fluid and gas handling, hydraulics, pneumatics, process control, and sealing and shielding. Parker employs about 61,000 people globally. In 2024, the company was ranked 216 in the Fortune 500. History 1917–1950 Arthur L. Parker founded the firm as the Parker Appliance Company in Ohio around 1917 or 1918. In its early years, it built pneumatic brake systems for buses, trucks and trains. In 1919, Parker's truck slid over a cliff, causing the company to lose its entire inventory and forcing the founder to return to his previous job. Nonetheless, he restarted Parker Appliance Company in 1924. By 1927, the firm had expanded into airplanes. For his flight across the Atlantic Ocean, Charles Lindbergh requested Parker parts be used in the construction of his aircraft the Spirit of St. Louis. The firm contributed the system that linked the aircraft's 16 fuel tanks. During World War II, Parker experienced a boom in business as the U.S. Air Force's primary supplier of valves and fluid connectors. By 1943, the firm employed 5,000 Cleveland, Ohio, residents. After Arthur Parker's death in 1945 and the end of the war, the company neared bankruptcy due to the sudden drop in demand. Arthur Parker's wife, Helen Parker, assumed control of the company and prevented its liquidation. She hired new management staff and directed the company's focus back to civilian manufacturing. 1950s–1960s In the early 1950s, the firm's executives set a goal to make Parker, as The New York Times put it, \"the General Electric of fluid power\", a goal it generally achieved in the coming decades. In 1957, the company purchased Hannifin, founded by Arthur Hannifin in 1917, a producer of valve and cylinder products, and changed its name to Parker Hannifin. Many more acquisitions followed, with the company reaching 40 acquisitions by the year 1979. In 1953, Arthur Parker's son Patrick S. Parker began working full-time at the company. He rose to become its president in 1968, and served as CEO from 1971 to 1983 and as chairman from 1977 to 1999. During and after his tenure, the firm grew dramatically, with revenues rising from $197 million in 1968 to over $7 billion in 2005. The company debuted on the New York Stock Exchange in 1964, under the ticker symbol PH. In 1966, the company joined the Fortune 500. The company designed parts for the craft used in NASA's first crewed Moon landing in 1969. 1970s–1990s An economic downturn in 1970 forced the company to expand beyond its focus on hydraulic systems. In the following years it began to expand into the automotive aftermarket, considered a more stable industry. The company also directed itself toward growth in aerospace, acquiring companies that created flight controls and wheel brake equipment for airplanes. By 1979, Parker Hannifin employed 20,000 people in 100 plants, selling 90,000 items for machinery, airplanes, cars and construction equipment to 60,000 customers. The company made some of the equipment inside the mechanical shark in the 1975 movie Jaws. In 1982, Paul G. Schloemer replaced Patrick Parker as the company's president (although Patrick Parker remained chairman and CEO). That same year, the firm entered the Mexican market. By 2008, Parker Hannifin Mexico would come to operate 11 plants in the country, seven of which made parts exclusively for the U.S. market. In 1988, the company reached $2 billion in sales. The firm opened its first retail \"ParkerStore\" in Cleveland in 1993. Within 10 years, the network of stores expanded to 200 locations in the U.S. and more than 400 worldwide. ParkerStores offer a variety of Parker products, including hydraulics, automation, and hose and fitting components, at locations close to industrial product buyers. Parker Hannifin systems helped control the massive replica of the Titanic in the 1997 film of the same name. In 1997, the firm moved its headquarters from Cleveland to a new building in Mayfield Heights, a suburb of Cleveland. In 1999, the company's sales reached approximately $5 billion. 2000s–present Parker Hannifin acquired Commercial Intertech Corporation, a maker of hydraulic systems, in 2000.Commercial Intertech had previously acquired Oildyne Inc., a well known hydraulic manufacturer. Parker has an Oildyne division today. With a cost of $366 million, this was at the time Parker Hannifin's biggest acquisition. In 2001, CEO Don Washkewicz introduced lean startup methods to company operations and has said that over the decade this reduced the time to obtain price quotes by 60% and cut product development lead times by 25%. In 2002 the company appointed Craig Maxwell as head of engineering; Maxwell brought a focus on innovation as well as rigor; he argued for and was given a $20M annual budget to fund blue sky inventions made by engineers and has given engineers time to pursue them; at the same time his team developed software that allows tracking each of the company's 1700 ongoing R&D projects graded by risk and potential reward, and closely managing their progress. In 2011 he hired Ryan Farris out of Vanderbilt University and licensed patents covering a powered exoskeleton that Farris had worked on at Vanderbilt. In 2015 the company opened an internal business incubator that Maxwell had proposed when he was first hired. The company won $2 billion in contracts to build fuel and hydraulic systems for Airbus A350 airliners in 2008 Two years later, its products were used in repairing the Deepwater Horizon oil rig. Thomas Williams took over the CEO role from Washkewicz in 2015. In 2016, the company completed its largest acquisition to date, buying Clarcor, a filtration systems manufacturer, for $4.3 billion. In 2019, Parker bought Lord Corporation for $3.7 billion and Kent, WA based Exotic Metals Forming Company for $1.7 billion. In August 2021, the company agreed to buy British aerospace and defense company Meggitt for £6.3 billion. In July 2022, after making commitments to the UK government including increasing research and development spending in Britain, the Secretary of State for Business, Energy and Industrial Strategy approved the takeover without being referred for a full Competition and Markets Authority investigation. The acquisition completed in September 2022. In May 2022, it was announced Parker Hannifin has sold its aircraft wheel and brake division to the Bloomfield-headquartered aerospace company, Kaman Corporation for US$440 million. In November 2025, Parker Hannifin announced a deal to buy Filtration Group—a privately held filtration-technologies manufacturer—for $9.25 billion. The deal is expected to create one of the largest industrial filtration businesses in the world. Aerospace Parker Hannifin's aerospace group designs and manufactures aerospace hydraulic equipment, flight controls, fuel system components, high-temperature bleed air valves, and other components. Headquartered in Irvine, California, Parker Aerospace operates facilities around the world. The company has had contracts to contribute parts and maintenance for machinery produced by Airbus, Rolls-Royce, Commercial Aircraft Corporation of China as well as other manufacturers. In 1993, the Federal Aviation Administration contracted Parker Aerospace to develop a new monitoring device, the Multi-Sensor Enroute Flight Inspection System, for flight inspection aircraft. Notable acquisitions by the division include the Kalamazoo, Michigan-based Abex/NWL division of Pneumo Abex in 1996, and Naples, Florida-based Shaw Aero Devices, in 2007. In 2012, the company partnered with General Electric to form a 50–50 joint venture, Advanced Atomization Technologies, for producing fuel nozzles for commercial aircraft engines. Boeing 737 accidents and incidents In 1995, it was discovered that failures in a servo unit supplied by Parker Hannifin to Boeing for use in their 737 aircraft may have contributed to several accidents and incidents, including the crashes of United Airlines Flight 585 and USAir Flight 427. In 2004, a Los Angeles jury ordered Parker Hannifin to pay US$43 million to the plaintiff families of the 1997 SilkAir Flight 185 crash in Indonesia. Parker Hannifin subsequently appealed the verdict, which resulted in an out-of-court settlement for an undisclosed amount. The Indonesian National Transportation Safety Committee (NTSC) could not determine the cause of the crash due to the near total lack of physical evidence because of the complete destruction; The US National Transportation Safety Board (NTSB), however disagreed, and concluded that the crash was caused, possibly intentionally, by the pilot. The FAA ordered an upgrade of all Boeing 737 rudder control systems by November 12, 2002. The firm argued that the components they supplied were not at fault, citing that the product has one of the safest records in its class, but the FAA directive went through regardless. In 2016, former NTSB investigator John Cox stated that time has proven the NTSB correct in its findings that the valve was faulty, because no additional rudder-reversal incidents have occurred since Boeing's redesign. F-35 fueldraulic line failure On January 18, 2013, the F-35B variant of the Lockheed Martin F-35 Lightning II was grounded after the failure of a fueldraulic line in the aircraft's propulsion system that controls the exhaust vectoring system. This followed an incident two days earlier on January 16, in which the propulsion system experienced a fueldraulic failure prior to a conventional takeoff. The failure was found to be a manufacturing defect by Parker Hannifin's Stratoflex division."
}