{
  "ticker": "PHM",
  "cik": "0000822416",
  "company_name": "PulteGroup",
  "corrected_name": "PulteGroup",
  "wiki_title_used": "PulteGroup",
  "exists": true,
  "raw_text": "PulteGroup, Inc. is an American residential home-construction company based in Atlanta, Georgia, United States. As of 2023, the company is the third-largest home-construction company in the United States based on the number of homes closed. In total, the company has built over 775,000 homes.\nThe company operates in 45 markets in 23 states. In 2021, it ranked 284th on the Fortune 500. The company was founded by William J. Pulte in Michigan, and moved its headquarters to Atlanta in 2014. Since 2016, Ryan Marshall has been the president and CEO of the company.\n\nHistory\nEarly history\nIn 1950, at the age of 18 years, William J. Pulte, began building and selling houses. In 1956, he formed the company, Pulte Homes, Inc which was based in Bloomfield Hills, Michigan. In 1972, the company became a public company via an initial public offering. In 1998, the company acquired Divosta for an estimated $150 million, and it also acquired Radnor Homes for an undisclosed amount.\n\nSince 2000\nIn 2001, Pulte Homes, Inc acquired Del E. Webb Construction Company, founded by Del Webb, for $1.8 billion. In 2003, the company acquired Sivage-Thomas Homes. In 2009, the company acquired Centex for $1.3 billion in stock. In August 2014, the company acquired the real-estate assets of Dominion Homes for $82 million.\nThe company changed its name from Pulte Homes, Inc. to PulteGroup, Inc. in March 2010. In 2013, PulteGroup launched Built to Honor program, which provides homes to veterans with disabilities from the Army, Marine Corps, Navy, Air Force, and Coast Guard, as well as Gold Star families in 18 U.S. states. \nIn 2016, the company acquired some homebuilding assets of John Wieland Homes and Neighborhoods, a premier builder of luxury homes. In April 2019, the company acquired the homebuilding operations of American West Homes for $150 million.\n\nSince 2020\nIn 2025, PulteGroup expanded its Del Webb brand to introduce Del Webb Explore in California and Florida. The company has also partnered with Fastbrick Robotics to build homes in Florida using a robotic construction technology.\nIn February 2025, PulteGroup expanded its Build Your Future SkillPointe Scholarship program, with a $100,000 investment to support individuals from diverse backgrounds who are pursuing careers in residential homebuilding and technologies. In May 2025, the organization’s Built to Honor Program completed its 100th home.\n\nFinancials\nLegal affairs\nStucco defects in Florida homes\nIn 2019, after an investigation by Florida Attorney General Ashley Moody, Pulte agreed to pay $4.7 million in restitution and make repairs to houses it sold in Florida that had cracks in stucco applied to a wood frame, stucco delamination, and improper installation of weep screed.\n\nDismissed lawsuit regarding propping up sale prices\nIn October 2009, a class-action lawsuit was filed by Steve Berman accusing the company of artificially propping up house sales prices and contributing to the United States housing bubble. The lawsuit was dismissed by the court.\n\n2009 allegations of systematic construction defects\nOn March 26, 2009, Building Justice, a project of the International Union of Painters and the Sheet Metal Workers International Association, with support from the AFL-CIO, released the report of a survey of 872 Pulte and Del Webb home owners in Arizona, Nevada, and California, in which 63% of respondents reported construction defects in their homes. The report \"Poorly Built by Pulte, No Different at Del Webb: Homeowner Dissatisfaction in Arizona, Nevada, and California\" was published on the project's website.\n\nReferences\nExternal links\nOfficial website\nBusiness data for PulteGroup, Inc.:",
  "clean_text": "PulteGroup, Inc. is an American residential home-construction company based in Atlanta, Georgia, United States. As of 2023, the company is the third-largest home-construction company in the United States based on the number of homes closed. In total, the company has built over 775,000 homes. The company operates in 45 markets in 23 states. In 2021, it ranked 284th on the Fortune 500. The company was founded by William J. Pulte in Michigan, and moved its headquarters to Atlanta in 2014. Since 2016, Ryan Marshall has been the president and CEO of the company. History Early history In 1950, at the age of 18 years, William J. Pulte, began building and selling houses. In 1956, he formed the company, Pulte Homes, Inc which was based in Bloomfield Hills, Michigan. In 1972, the company became a public company via an initial public offering. In 1998, the company acquired Divosta for an estimated $150 million, and it also acquired Radnor Homes for an undisclosed amount. Since 2000 In 2001, Pulte Homes, Inc acquired Del E. Webb Construction Company, founded by Del Webb, for $1.8 billion. In 2003, the company acquired Sivage-Thomas Homes. In 2009, the company acquired Centex for $1.3 billion in stock. In August 2014, the company acquired the real-estate assets of Dominion Homes for $82 million. The company changed its name from Pulte Homes, Inc. to PulteGroup, Inc. in March 2010. In 2013, PulteGroup launched Built to Honor program, which provides homes to veterans with disabilities from the Army, Marine Corps, Navy, Air Force, and Coast Guard, as well as Gold Star families in 18 U.S. states. In 2016, the company acquired some homebuilding assets of John Wieland Homes and Neighborhoods, a premier builder of luxury homes. In April 2019, the company acquired the homebuilding operations of American West Homes for $150 million. Since 2020 In 2025, PulteGroup expanded its Del Webb brand to introduce Del Webb Explore in California and Florida. The company has also partnered with Fastbrick Robotics to build homes in Florida using a robotic construction technology. In February 2025, PulteGroup expanded its Build Your Future SkillPointe Scholarship program, with a $100,000 investment to support individuals from diverse backgrounds who are pursuing careers in residential homebuilding and technologies. In May 2025, the organization’s Built to Honor Program completed its 100th home. Financials Legal affairs Stucco defects in Florida homes In 2019, after an investigation by Florida Attorney General Ashley Moody, Pulte agreed to pay $4.7 million in restitution and make repairs to houses it sold in Florida that had cracks in stucco applied to a wood frame, stucco delamination, and improper installation of weep screed. Dismissed lawsuit regarding propping up sale prices In October 2009, a class-action lawsuit was filed by Steve Berman accusing the company of artificially propping up house sales prices and contributing to the United States housing bubble. The lawsuit was dismissed by the court. 2009 allegations of systematic construction defects On March 26, 2009, Building Justice, a project of the International Union of Painters and the Sheet Metal Workers International Association, with support from the AFL-CIO, released the report of a survey of 872 Pulte and Del Webb home owners in Arizona, Nevada, and California, in which 63% of respondents reported construction defects in their homes. The report \"Poorly Built by Pulte, No Different at Del Webb: Homeowner Dissatisfaction in Arizona, Nevada, and California\" was published on the project's website."
}