{
  "ticker": "PKG",
  "cik": "0000075677",
  "company_name": "Packaging Corporation of America",
  "corrected_name": "Packaging Corporation of America",
  "wiki_title_used": "Packaging Corporation of America",
  "exists": true,
  "raw_text": "Packaging Corporation of America is an American manufacturing company based in Lake Forest, Illinois. The company has about 15,500 employees, with operations primarily in the United States. The CEO is Mark W. Kowlzan.\n\nHistory and operations\nThe company was founded in 1959 by the consolidation of three companies and was eventually acquired by Tenneco in 1965. In November 1995, the company's name was changed to Tenneco Packaging Inc.; in 1999, a new entity re-established the name Packaging Corporation of America\nIn 2009, the company opened a new design center and project-management facility in Hong Kong, operating under the name Packaging Corporation of Asia Limited.\nThe company has acquired many companies, including Boise Inc. in 2013, TimBar Corporation and Columbus Container, Inc. in 2016, Sacramento Container Corporation in 2017, and Englander Container and Display in 2018.\nThe company's network consists of 6 containerboard mills, 2 white paper mills, 95 converting facilities, 10 creative design centers, 3 fulfillment centers, 8 packaging and supply centers, 2 training and resource centers, and 1 technical center.\n\nSee also\nList of Illinois companies\n\nReferences\nExternal links\nOfficial website\nBusiness data for Packaging Corporation of America:",
  "clean_text": "Packaging Corporation of America is an American manufacturing company based in Lake Forest, Illinois. The company has about 15,500 employees, with operations primarily in the United States. The CEO is Mark W. Kowlzan. History and operations The company was founded in 1959 by the consolidation of three companies and was eventually acquired by Tenneco in 1965. In November 1995, the company's name was changed to Tenneco Packaging Inc.; in 1999, a new entity re-established the name Packaging Corporation of America In 2009, the company opened a new design center and project-management facility in Hong Kong, operating under the name Packaging Corporation of Asia Limited. The company has acquired many companies, including Boise Inc. in 2013, TimBar Corporation and Columbus Container, Inc. in 2016, Sacramento Container Corporation in 2017, and Englander Container and Display in 2018. The company's network consists of 6 containerboard mills, 2 white paper mills, 95 converting facilities, 10 creative design centers, 3 fulfillment centers, 8 packaging and supply centers, 2 training and resource centers, and 1 technical center."
}