{
  "ticker": "PLD",
  "cik": "0001045609",
  "company_name": "Prologis",
  "corrected_name": "Prologis",
  "wiki_title_used": "Prologis",
  "exists": true,
  "raw_text": "Prologis, Inc. is a real estate investment trust headquartered in San Francisco, California that invests in logistics facilities. The company was formed through the merger of AMB Property Corporation and Prologis in June 2011, which made Prologis the largest industrial real estate company in the world. As of 2025, the company operates more than 15,000 land acres and over 6,000 buildings comprising about 1.3 billion square feet in 20 countries across North America, Latin America, Europe, and Asia. According to The Economist, its business strategy is focused on warehouses that are located close to huge urban areas where land is scarce. It serves about 6,600 tenants. Prologis began to expand its non-real estate business, Essentials, in 2018, offering customers solar power, racking systems, forklifts, generators, EV charging infrastructure, and other logistics tech equipment for purchase.\n\nHistory\nAMB, the earliest predecessor of Prologis, was formed in 1984. In its present form, Prologis was created in 2011 through the merger of AMB and ProLogis, both multinational real estate companies based in the United States.\n\n1983 founding and early history\nIn 1983, Hamid Moghadam and Doug Abbey founded Abbey, Moghadam and Company, an investment manager serving institutions. T. Robert Burke joined the company in 1984, establishing AMB Property Corporation, investors in office, industrial and community shopping centers on behalf of large institutional investors. During the savings and loan crisis, the company avoided significant financial repercussions by investing in industrial parks and shopping centers, and began to exit the office market in 1987. AMB launched its first private equity fund in 1989, which focused on industrial and retail properties.\nIn late 1997, AMB became a public company via an initial public offering, with more than US$2.8 billion under management. In 1999, the company sold its retail portfolio to focus solely on the industrial sector, then made its first overseas investment in 2002, developing a facility for Procter & Gamble. That year, AMB initiated an international expansion program focused on buying and developing distribution facilities near global trade hubs, particularly in growth markets such as Latin America, Asia, and Europe. AMB added an internal development division in 2004 and, by 2011, was expanding its operations in China and Brazil.\n\nCreation of Prologis legacy company SCI and international expansion\nReal Estate entrepreneur William Sanders formed Security Capital Industrial Trust (SCI), a legacy company of Prologis, in 1991, and it became a public company via an IPO in 1994.\nProLogis, Inc. (then with a capitalized L) was incorporated on November 24, 1997 under the leadership of K. Dane Brooksher, a former KPMG senior executive.\nSCI officially changed its name to ProLogis Trust in July 1998, then active in 84 markets in 12 countries, with a market capitalization of nearly $5 billion. In November 1998, ProLogis Trust acquired Meridian Industrial Trust for $862.5 million in stock, and was the largest owner of industrial and warehouse properties in the U.S. ProLogis Trust formed its first property funds in 1999 and entered the Japanese market in 2001, the same year it shortened its name to ProLogis. In 2003, ProLogis was added to the S&P 500 Index and entered the Chinese market, forming its first joint venture in China with Suzhou Logistics Center Co. Ltd. In 2004, the company acquired Keystone Industrial Trust for $1.6 billion. Brooksher retired as chairman and CEO on December 31, 2004.\nIn 2005, Prologis was headquartered in Aurora, Colorado, and acquired Catellus Development Corporation for $3.6 billion, later selling a portfolio of those assets with rights to the Catellus name to TPG Capital, in 2011, for $505 million.\nIn 2006, ProLogis became a Fortune 1000 company and the ProLogis European Properties Fund became a public company. Following aggressive expansion and heavy borrowing, ProLogis' CEO Jeffrey Schwartz was replaced by Walter Rakowich in 2008, who implemented cost-cutting efforts, raising capital and selling assets. In December 2008, ProLogis sold a  portfolio of assets to the Government of Singapore Investment Corporation, with which it formed Global Logistic Properties.\nThe company sold its China operations and some of its Japanese interests to GIC Private Limited for $1.3 billion in 2009. That August, ProLogis secured financing from Deutsche Pfandbriefbank and an unidentified German bank for two of its funds. The Blackstone Group acquired a portfolio of assets from the company in late 2010 for $1 billion.\n\n2011 merger to present\nIn March 2011, before the merger with ProLogis, AMB Property formed a €470 million joint venture with Allianz Real Estate. Agreed to in January 2011, AMB Property Corporation contracted to buy the larger ProLogis for $8.7 billion, with the new entity named Prologis. Prologis would then be based in San Francisco, AMB's hometown, and maintain an office in Denver, Colorado, where ProLogis was based.\nCompleted in June 2011, the merger  was one of the biggest real estate deals since the Great Recession, and created the largest industrial real estate company in the world. With a total market value estimated at $24 billion, the new Prologis had around $46 billion in assets under management and logistics and distribution facilities in North America, Europe, Asia and South America. AMB CEO Hamid R. Moghadam and ProLogis CEO Walter Rakowich were appointed as the new company's co-chiefs, with Moghadam becoming the sole CEO in 2013.\nIn February 2012, the company sold a 3.5 million square foot portfolio in the United Kingdom to The Blackstone Group for $335 million.\nOn February 14, 2013, Nippon Prologis REIT, Inc. (NPR), a Japanese real estate investment trust formed by Prologis, completed an IPO on the Tokyo Stock Exchange. In March 2013, Prologis formed the Prologis European Logistics Partners Sarl joint venture with Norges Bank Investment Management for US$3.1 billion. In August 2013, in partnership with The Blackstone Group the company acquired a 17 million square foot portfolio for $960 million from Lehman Brothers. In 2013, Prologis announced plans for further expansion in Japan, its second largest market, after the United States.\nIn 2014, the company completed the spin-off of FIBRA Prologis, its Mexican affiliate (also known as Prologis Property Mexico SA), raising about 7 billion pesos (US$541 million) and sold a 59-property portfolio to TPG for $375 million.\nPrologis had reduced its number of managed funds from 23 to 11 by the spring of 2015, and was managing $29 billion in real-estate assets. That quarter, the company sold a Silicon Valley industrial park to Facebook, Inc. With corporate headquarters remaining in San Francisco, that April, Prologis announced a plan to move offices from east Denver, Colorado, to a new building in downtown Denver in 2017. That June, Prologis partnered with Norges Bank Investment Management to buy KTR Capital Partners for $5.9 billion, expanding its real estate portfolio in the U.S. through the Prologis U.S. Logistics Venture. In October 2015, it acquired Morris Realty Associates' portfolio of logistics and retail properties in the U.S. for $820 million, selling off the retail assets to an affiliate of The Blackstone Group for $374 million.\nPrologis formed Prologis Ventures, its venture capital arm, in March 2016, making 20 investments by late 2019. and invested over $250 million in about 50 early- and growth-stage companies by 2024.\nBy late 2016, Prologis had built large multistory warehouses in Japan, Singapore and China. The company began construction on a three-floor warehouse in Seattle, Washington, in November 2016, which was the first multi-story warehouse in the country. The following month, Prologis also outlined plans to build a three-story warehouse in San Francisco. That December, Prologis received two 2016 Eurobuild CEE Awards.\nAcquisitions include DCT Industrial Trust for $8.5 billion in August 2018, Liberty Property Trust for $13 billion in January 2020, and, the following month, Industrial Property Trust for $4 billion. In April 2021, the company acquired Hilltop Mall in Richmond, California for $117 million, then, in June 2022, the land below California's Great America in Santa Clara, California from Cedar Fair, which leased the land back with plans to close the amusement park by 2033. Prologis acquired competitor Duke Realty in October 2022, for $23 billion, completing the largest commercial real estate transaction in the U.S. since the onset of the COVID-19 pandemic. The following June, it acquired a further 14 million square feet of industrial property from The Blackstone Group for $3.1 billion.\nPrologis had become the first logistics REIT with an approved science-based carbon-emissions target in 2018; in June 2022, the Science Based Targets initiative validated a commitment by Prologis to reach net-zero emissions by 2040. In 2020, Prologis completed construction of the world's first industrial building to receive Zero Carbon Certification from the International Living Future Institute (ILFI) in Eindhoven, Netherlands. In  2024, Prologis built North America’s largest heavy-duty truck charging hub, powered by a microgrid. The Denker Avenue hub is located in Torrance, California. That November, Prologis was ranked second in the nation for on-site solar generation by the Solar Energy Industries Association (SEIA) Solar Means Business Report.\nIn 2024, Prologis ranked 39th among the Drucker Institute and The Wall Street Journal's annual Management Top 250 companies for employee engagement and development. That year, the company also gained recognition from the Corporate Knights Global 100, Fast Company and Time. aIt is listed as #465 among the Fortune 500.\n\nMarket research\nSince 2016, the company has published white papers and its own market research, including the quarterly Industrial Business Indicator and the annual Prologis Logistics Rent Index.\nIn partnership with Oxford Economic Papers, the company determined that, in 2022, $2.7 trillion of goods either produced or sold worldwide passed through Prologis facilities, representing 2.8% of the global GDP with an economic impact of $300 billion.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Prologis, Inc.:",
  "clean_text": "Prologis, Inc. is a real estate investment trust headquartered in San Francisco, California that invests in logistics facilities. The company was formed through the merger of AMB Property Corporation and Prologis in June 2011, which made Prologis the largest industrial real estate company in the world. As of 2025, the company operates more than 15,000 land acres and over 6,000 buildings comprising about 1.3 billion square feet in 20 countries across North America, Latin America, Europe, and Asia. According to The Economist, its business strategy is focused on warehouses that are located close to huge urban areas where land is scarce. It serves about 6,600 tenants. Prologis began to expand its non-real estate business, Essentials, in 2018, offering customers solar power, racking systems, forklifts, generators, EV charging infrastructure, and other logistics tech equipment for purchase. History AMB, the earliest predecessor of Prologis, was formed in 1984. In its present form, Prologis was created in 2011 through the merger of AMB and ProLogis, both multinational real estate companies based in the United States. 1983 founding and early history In 1983, Hamid Moghadam and Doug Abbey founded Abbey, Moghadam and Company, an investment manager serving institutions. T. Robert Burke joined the company in 1984, establishing AMB Property Corporation, investors in office, industrial and community shopping centers on behalf of large institutional investors. During the savings and loan crisis, the company avoided significant financial repercussions by investing in industrial parks and shopping centers, and began to exit the office market in 1987. AMB launched its first private equity fund in 1989, which focused on industrial and retail properties. In late 1997, AMB became a public company via an initial public offering, with more than US$2.8 billion under management. In 1999, the company sold its retail portfolio to focus solely on the industrial sector, then made its first overseas investment in 2002, developing a facility for Procter & Gamble. That year, AMB initiated an international expansion program focused on buying and developing distribution facilities near global trade hubs, particularly in growth markets such as Latin America, Asia, and Europe. AMB added an internal development division in 2004 and, by 2011, was expanding its operations in China and Brazil. Creation of Prologis legacy company SCI and international expansion Real Estate entrepreneur William Sanders formed Security Capital Industrial Trust (SCI), a legacy company of Prologis, in 1991, and it became a public company via an IPO in 1994. ProLogis, Inc. (then with a capitalized L) was incorporated on November 24, 1997 under the leadership of K. Dane Brooksher, a former KPMG senior executive. SCI officially changed its name to ProLogis Trust in July 1998, then active in 84 markets in 12 countries, with a market capitalization of nearly $5 billion. In November 1998, ProLogis Trust acquired Meridian Industrial Trust for $862.5 million in stock, and was the largest owner of industrial and warehouse properties in the U.S. ProLogis Trust formed its first property funds in 1999 and entered the Japanese market in 2001, the same year it shortened its name to ProLogis. In 2003, ProLogis was added to the S&P 500 Index and entered the Chinese market, forming its first joint venture in China with Suzhou Logistics Center Co. Ltd. In 2004, the company acquired Keystone Industrial Trust for $1.6 billion. Brooksher retired as chairman and CEO on December 31, 2004. In 2005, Prologis was headquartered in Aurora, Colorado, and acquired Catellus Development Corporation for $3.6 billion, later selling a portfolio of those assets with rights to the Catellus name to TPG Capital, in 2011, for $505 million. In 2006, ProLogis became a Fortune 1000 company and the ProLogis European Properties Fund became a public company. Following aggressive expansion and heavy borrowing, ProLogis' CEO Jeffrey Schwartz was replaced by Walter Rakowich in 2008, who implemented cost-cutting efforts, raising capital and selling assets. In December 2008, ProLogis sold a portfolio of assets to the Government of Singapore Investment Corporation, with which it formed Global Logistic Properties. The company sold its China operations and some of its Japanese interests to GIC Private Limited for $1.3 billion in 2009. That August, ProLogis secured financing from Deutsche Pfandbriefbank and an unidentified German bank for two of its funds. The Blackstone Group acquired a portfolio of assets from the company in late 2010 for $1 billion. 2011 merger to present In March 2011, before the merger with ProLogis, AMB Property formed a €470 million joint venture with Allianz Real Estate. Agreed to in January 2011, AMB Property Corporation contracted to buy the larger ProLogis for $8.7 billion, with the new entity named Prologis. Prologis would then be based in San Francisco, AMB's hometown, and maintain an office in Denver, Colorado, where ProLogis was based. Completed in June 2011, the merger was one of the biggest real estate deals since the Great Recession, and created the largest industrial real estate company in the world. With a total market value estimated at $24 billion, the new Prologis had around $46 billion in assets under management and logistics and distribution facilities in North America, Europe, Asia and South America. AMB CEO Hamid R. Moghadam and ProLogis CEO Walter Rakowich were appointed as the new company's co-chiefs, with Moghadam becoming the sole CEO in 2013. In February 2012, the company sold a 3.5 million square foot portfolio in the United Kingdom to The Blackstone Group for $335 million. On February 14, 2013, Nippon Prologis REIT, Inc. (NPR), a Japanese real estate investment trust formed by Prologis, completed an IPO on the Tokyo Stock Exchange. In March 2013, Prologis formed the Prologis European Logistics Partners Sarl joint venture with Norges Bank Investment Management for US$3.1 billion. In August 2013, in partnership with The Blackstone Group the company acquired a 17 million square foot portfolio for $960 million from Lehman Brothers. In 2013, Prologis announced plans for further expansion in Japan, its second largest market, after the United States. In 2014, the company completed the spin-off of FIBRA Prologis, its Mexican affiliate (also known as Prologis Property Mexico SA), raising about 7 billion pesos (US$541 million) and sold a 59-property portfolio to TPG for $375 million. Prologis had reduced its number of managed funds from 23 to 11 by the spring of 2015, and was managing $29 billion in real-estate assets. That quarter, the company sold a Silicon Valley industrial park to Facebook, Inc. With corporate headquarters remaining in San Francisco, that April, Prologis announced a plan to move offices from east Denver, Colorado, to a new building in downtown Denver in 2017. That June, Prologis partnered with Norges Bank Investment Management to buy KTR Capital Partners for $5.9 billion, expanding its real estate portfolio in the U.S. through the Prologis U.S. Logistics Venture. In October 2015, it acquired Morris Realty Associates' portfolio of logistics and retail properties in the U.S. for $820 million, selling off the retail assets to an affiliate of The Blackstone Group for $374 million. Prologis formed Prologis Ventures, its venture capital arm, in March 2016, making 20 investments by late 2019. and invested over $250 million in about 50 early- and growth-stage companies by 2024. By late 2016, Prologis had built large multistory warehouses in Japan, Singapore and China. The company began construction on a three-floor warehouse in Seattle, Washington, in November 2016, which was the first multi-story warehouse in the country. The following month, Prologis also outlined plans to build a three-story warehouse in San Francisco. That December, Prologis received two 2016 Eurobuild CEE Awards. Acquisitions include DCT Industrial Trust for $8.5 billion in August 2018, Liberty Property Trust for $13 billion in January 2020, and, the following month, Industrial Property Trust for $4 billion. In April 2021, the company acquired Hilltop Mall in Richmond, California for $117 million, then, in June 2022, the land below California's Great America in Santa Clara, California from Cedar Fair, which leased the land back with plans to close the amusement park by 2033. Prologis acquired competitor Duke Realty in October 2022, for $23 billion, completing the largest commercial real estate transaction in the U.S. since the onset of the COVID-19 pandemic. The following June, it acquired a further 14 million square feet of industrial property from The Blackstone Group for $3.1 billion. Prologis had become the first logistics REIT with an approved science-based carbon-emissions target in 2018; in June 2022, the Science Based Targets initiative validated a commitment by Prologis to reach net-zero emissions by 2040. In 2020, Prologis completed construction of the world's first industrial building to receive Zero Carbon Certification from the International Living Future Institute (ILFI) in Eindhoven, Netherlands. In 2024, Prologis built North America’s largest heavy-duty truck charging hub, powered by a microgrid. The Denker Avenue hub is located in Torrance, California. That November, Prologis was ranked second in the nation for on-site solar generation by the Solar Energy Industries Association (SEIA) Solar Means Business Report. In 2024, Prologis ranked 39th among the Drucker Institute and The Wall Street Journal's annual Management Top 250 companies for employee engagement and development. That year, the company also gained recognition from the Corporate Knights Global 100, Fast Company and Time. aIt is listed as #465 among the Fortune 500. Market research Since 2016, the company has published white papers and its own market research, including the quarterly Industrial Business Indicator and the annual Prologis Logistics Rent Index. In partnership with Oxford Economic Papers, the company determined that, in 2022, $2.7 trillion of goods either produced or sold worldwide passed through Prologis facilities, representing 2.8% of the global GDP with an economic impact of $300 billion."
}