{
  "ticker": "PM",
  "cik": "0001413329",
  "company_name": "Philip Morris International",
  "corrected_name": "Philip Morris International",
  "wiki_title_used": "Philip Morris International",
  "exists": true,
  "raw_text": "Philip Morris International Inc. (PMI) is a tobacco company, with products sold in over 180 countries. Marlboro is PMI’s most recognized brand, but in the last quarter of 2023, Iqos  generated the greatest revenue. Philip Morris International is often referred to as one of the companies comprising Big Tobacco. The company ranked No. 121 in the 2025 Fortune 500 list of the largest US corporations by total revenue.\nThe company originated in 1847 in London, but Philip Morris International itself was established in 1987 as an operating company of Philip Morris Companies Inc. In 2003, Philip Morris Companies changed its name to Altria Group. In March 2008, PMI was spun off from Altria and has been an entirely separate entity since then. Philip Morris USA, a subsidiary of PMI's former parent, keeps ownership of the Philip Morris brands for the US market.\nThe company's legal seat is in Stamford, Connecticut. PMI's operational headquarters are in Lausanne, Switzerland.\nWith tobacco being addictive and a leading cause of preventable death globally, the company has faced litigation and regulatory measures from governments and has been the subject of scrutiny by the World Health Organization. The company knowingly maintained the claim that smoking cigarettes is harmless, despite overwhelming external and internal evidence that smoking is addictive and dangerous. In response, the company has diversified in the 21st century into smoke-free products such as the Iqos brand of heated tobacco products, Zyn brand of nicotine pouches, and Veev brand of electronic cigarettes.\n\nHistory\nEarly years\nThe company history began in 1847 with the opening of a single shop on London's Bond Street by a local tobacconist, Philip Morris. The shop gained popularity after the Crimean War, where Turkish tobacco became popular among returning soldiers who started preferring cigarettes over pipe tobacco and cigars. Morris hired more employees to hand-roll them. After Morris died in 1873, his widow Margaret and brother Leopold ran the business. Leopold became the sole owner in 1880 and formed a partnership with Joseph Grunebaum, leading to the incorporation of Philip Morris & Company and Grunebaum, Ltd. in 1881. The company became Philip Morris & Co., Ltd. in 1885 when the partnership dissolved. Highly indebted, it was bought by one of its creditors, William Curtis Thomson, in 1894.\nIn 1902, King Edward, a long-time customer of the shop, appointed Philip Morris as royal tobacconist, boosting business. That same year, the company was incorporated in the United States by Gustav Eckmeyer, who had been its sole importer and distributor in the New World since 1872. Ownership was shared between Eckmeyer and the parent company, and the venture began selling its first domestic brands along with its traditional luxury imports, including Marlborough, named after one of the London manufactories located on Marlborough street.\nIn 1919, the American subsidiary was bought by investor Georges Whelan and incorporated in Virginia under the name of Philip Morris & Co., Ltd. Inc. Marlborough dropped three letters in 1924 and was relaunched as a premium cigarette for the growing US female market. With Turkish tobacco falling out of fashion and its brands sitting firmly in the luxury and premium segments, total sales account for as little as 0.5% of the total cigarette market in 1925.\nIn the early 1950's, growing concerns about the health effects of cigarettes led most manufacturers to add filters: by the end of 1954, filtered brands accounted for more than 10 percent of sales volumes. To enter this market, Philip Morris' executives first decided to purchase Benson & Hedges in 1954, which had pioneered the market with its Parliament brand. However, the brand lost nearly 10% of its market share under the new management. The company then decided a brand repositioning for Marlboro, a premium yet stagnant brand from its portfolio. George Weissman, the new vice-president for marketing and new products, signed up Leo Burnett to the task. The agency's challenge was to appeal to male smokers concerned enough about their health to consider switching to filter cigarettes. The logo and packaging were redesigned and the marketing was supported by a series of Marlboro Men. The campaign was a success: within a year of its national roll-out, volumes increased 3,000%, swiftly becoming the fourth best-selling cigarette brand.\n\nBecoming an international giant\nIncreasing sales fueled the company's expansion: in 1954, Philip Morris Australia became the first international affiliate of the company. Then, in 1957, the Swiss Fabriques de Tabac Réunies in Neuchatel became the first to acquire foreign licensing rights to produce the booming Marlboro, marking the company's first move into Europe since leaving Britain. The Swiss company was eventually purchased in 1963. The overseas division was renamed Philip Morris International in 1961, alongside Philip Morris Domestic and Philip Morris Industrial.\nThe company underwent rapid expansion abroad in the 1960s. By 1965, Philip Morris products were available in 140 countries and territories. Domestically, Marlboro became the leading brand in the United States by 1972.  During the mid-60s the company began to form a horizontal conglomerate, gradually purchasing various entities such as Miller brewing (1968), Seven-Up (1978), Kraft Foods (1988) and many others. The company also pursued a series of international partnerships with local monopolies, allowing its products to reach consumers in more than 170 countries and territories by 1980.\nIn 1987, Philip Morris International (PMI) was incorporated in Virginia as an operating company of Philip Morris, Inc. The fall of the USSR  in the early 1990s provided another expansion opportunity, and Philip Morris International was among the first US companies to operate in the former Communist bloc. In 1990, two years before actually opening an office in the country, PMI accepted an oil-for-cigarettes deal with the failing Soviet state to help deal with cigarette shortages. In 1994, Philip Morris International established the Philip Morris Ukraine subsidiary and acquired a 51% stake in a tobacco manufacturing facility in Kharkiv which was soon upgraded. PMI was also one of the first US entrants in the Vietnamese market, opening a manufacturing plant a few months before the two countries normalized their relations. Later, in 2005, PMI also acquired Coltabaco in Colombia and Sampoerna in Indonesia.\n\nPMI as an independent entity\nOn January 27, 2003, Philip Morris Companies Inc. changed its name to Altria. The conglomerate then gradually changed its strategy, selling off large portions of its non-tobacco consumer products holdings. Kraft Foods Inc. was spun off in March 2007, with the company's 88.1% stake being distributed to Altria shareholders. That same year, Altria began the process of spinning off Philip Morris International to allow it to pursue growth opportunities abroad without the legal uncertainties stemming from its US arm. PMI's spinoff from Altria took effect in March 2008. Altria shareholders were given shares in PMI, which was listed on the New York Stock Exchange and other stock exchanges. Louis Camilleri, who had been Altria's CEO, became PMI's new Chief Executive.\n\nAlthough PMI remains incorporated in the US (relocated from New York City to Stamford, Connecticut in 2022), it has never sold combustible cigarettes there. Its operational center has been in Lausanne, Switzerland, since 2002. In 2009, Philip Morris International opened its research and development center (called \"The Cube\") in Neuchatel, Switzerland. The opening of this R&D center marked a significant milestone for Philip Morris International in the development of new smoke-free products. The company launched Iqos in 2014, a heated tobacco product with reduced emissions. In 2023, Iqos and other smoke-free products made up nearly 40% of PMI's global sales, with Iqos alone surpassing the net revenue generated by Marlboro.\nIn 2022, PMI also agreed to a $16 billion deal to acquire Swedish Match, boosting its position in cigarette alternatives with the Zyn nicotine pouch brand.\n\nProducts\nBrands\nPhilip Morris International has several multibillion-dollar brands. The top five brands of combustible products accounted for 80% of the total cigarette shipments volume in 2024. According to its 2024 annual report, the company had sold almost 617 million cigarettes, along with 140 million heated tobacco units and 1 billion cans of oral tobacco (nicotine pouches, snus, moist snuff):\n\nMarlboro was launched in 1924 and is the world’s best-selling cigarette brand, ranking first among the most valuable tobacco brands.\nIqos heated tobacco products were launched in 2014. Iqos is PMI’s flagship smoke-free product and surpassed Marlboro net revenue at the end of 2023.\nL&M was launched by Liggett & Myers in 1953. In 1999, the L&M trademark was acquired by Philip Morris Companies Inc, but the rights have been split per country by Philip Morris USA (Altria) and PMI since the spin-off in 2008.\nChesterfield was first launched in 1873 by the Drummond Tobacco company of Saint Louis, Missouri, and became the first major brand to enter the king-size (85mm) market in 1952.\nParliament was launched in 1931 and was the first major brand to introduce a filter mouthpiece.\nPhilip Morris's eponymous brand gave fame to bellhop Johnny Roventini and his \"Call for Philip Morris\".\nZyn, launched in 2016, is the leading brand of nicotine pouches, accounting for more than 60% of the US market in 2022.\nThe company also distributes a number of local or historical brands, such as Apollo–Soyuz, Muratti, Virginia Slims, etc..\n\nResearch\nPhilip Morris International's research center is located in Neuchatel, Switzerland and houses Philip Morris International's product research and development program. Between 2009 and 2023, the company indicated spending 12.5 billion dollars on R&D, 99% of which on smoke-free products.\n\nCorporate affairs\nBoard of directors\nAs of June 2025:\n\nFinancials\nFor the fiscal year 2024, Philip Morris reported earnings of US$7.057 billion with a net annual revenue (excluding excise taxes) of US$37.878 billion. As of June 2025, Philip Morris International had a market cap of $285.27 billion, making it the largest privately owned company in the sector.\n\nOther investments\nPM Equity Partner is Philip Morris International venture capital arm and invests in early stage and growth-stage companies operating in one of the four investment corridors defined by the company: life sciences, industrial technologies, consumer engagement and product technologies.\nIn 2021, Philip Morris International acquired Vectura for £1 billion, Fertin Pharma for DKK 5.1 billion, and Otitopic for an undisclosed sum. These companies were consolidated to form Vectura Fertin Pharma in early 2022, which was operationally separate from other businesses owned by PMI before being resold to Molex in 2025.\n\nControversies\nFoundation for a Smoke-free World\nIn September 2017, Philip Morris International announced the establishment of the Foundation for a Smoke-Free World, stating that it would support it with almost US$1 billion of funding over the next 12 years. The declared objective of the Foundation was to \"evaluate the impact that smoke-free alternatives can have on smokers and public health, assess the effect of reduced cigarette consumption on the industry value chain, and measure overall progress towards a smoke-free world.\" However, the Foundation, which claimed to be independent, was surrounded with controversy since its inception. Its claims to independence have been challenged.\nThe World Health Organization issued a statement in which it pointed out the \"conflicts of interest involved with a tobacco company funding a purported health foundation\", indicating that it would not partner with the Foundation and inviting governments and the public health community to follow its lead. More than one hundred public health organizations have taken a strong stance in rejecting collaboration with the foundation. In May 2024, anti-tobacco activist Cliff Douglas was hired as CEO of the Foundation. After negotiating a final payment of $140 million, the organisation split from PMI and rebranded as Global Action to End Smoking.\n\nAustralia\nThe Australian Government announced it would introduce \"Tobacco Plain Packaging Laws\" on 29 April 2010. Philip Morris International (PMI), arranged for its wholly owned Hong Kong subsidiary Philip Morris Asia (PMA) to \"takeover\" two Australian subsidiaries – Philip Morris Australia Limited and Philip Morris Limited on 23 February 2011. In June 2011, Philip Morris International announced that it was using ISDS provisions in the Australia-Hong Kong Bilateral Investment treaty (BIT) to demand compensation for Australia's plain cigarette packaging anti-smoking legislation. It was one of several tobacco companies to launch legal action against the Australian Government.\nIn response, British American Tobacco, Philip Morris, Imperial Tobacco and Japan Tobacco International took the Australian government to the High Court of Australia to try to stop the government of Australia from introducing plain packaging for tobacco products.\nTwo challenges to the tobacco plain packaging legislation were heard by the High Court of Australia between 17 and 19 April 2012: \"British American Tobacco Australasia Limited and Ors v. Commonwealth of Australia\" and \"J T International SA v. Commonwealth of Australia\".\nOn 15 August 2012, the High Court handed down orders for these matters, and found that the Tobacco Plain Packaging Act 2011 is not contrary to s 51(xxxi) of the Constitution. On 5 October 2012, the Court handed down its reasons for the decision. By a 6:1 majority (Heydon J in dissent) the Court held that there had been no acquisition of property that would have required provision of \"just terms\" under s51(xxxi) of the Constitution.\nOn 18 December 2015, the Tribunal instituted by the United Nations Commission on International Trade Law (UNCITRAL) issued a unanimous decision (3–0) agreeing with Australia's position that the Tribunal has no jurisdiction to hear PMA's claim. This was due to the fact that PMI used its wholly owned subsidiary PMA to takeover the Australian-based PM subsidiaries in order to specifically sue the Australian Government for bringing in plain packaging laws. PMI was unable to do this itself as the Australia–United States free-trade agreement signed in 2004 did not have any investor-state dispute settlement clauses included—by design.\nIn 2017, the Dispute Settlement Body of the World Trade Organization supported Australia's right to enforce plain packaging. In 2017, PMI was instructed to pay the Australia government's legal costs, an estimated 50 million dollars.\nIn March 2018, the tobacco giant announced that it will cut 150 jobs as part of a major restructure. Tammy Chan, the managing director in Australia, said more efficient ways to deal with retailers were introduced based on digital technology development.\n\nEuropean Union\nIn 2004, Philip Morris and the European Union reached an agreement according to which Philip Morris would pay $1.25bn until 2016 to end a lawsuit over smuggling charges.\n\nNorway\nPhilip Morris also sued Norway over the country's ban on displaying tobacco products in stores. It lost the case in 2012.\n\nPoland\nIn the 1990s, Philip Morris International acquired a controlling share of Poland’s state tobacco company, which owned a factory operating just beyond the boundaries of the notorious Nazi concentration camp.\n\nRussia\nThe market share of Philip Morris International brands in Russia amounted to 30.1% in 2019. According to National Agency on Corruption Prevention of Ukraine, the total amount of corporate income tax (not including excise) paid by PMI to the Russian budget in 2022 amounted to US$206 million. Following the Russian invasion of Ukraine, Philip Morris announced its intention to sell its Russian business and exit the market, but has not done so.  Because of its reluctance to leave the Russian market, the Ukrainian National Agency on Corruption Prevention included PMI in its International Sponsors of War list in 2023. PMI was removed from the list in July 2024. Its Russian subsidiary remains under sanctions of the National Security and Defense Council of Ukraine.\n\nUruguay\nIn 2010, the company lobbied against Uruguay's strong anti-smoking laws and filed a complaint against the country (Philip Morris v. Uruguay) under the Switzerland-Uruguay bilateral investment treaty. On 8 July 2016, the International Centre for Settlement of Investment Disputes ruled in favour of Uruguay.\n\nUnited Kingdom\nIn August 2014, the company foreshadowed legal action against the Government of the United Kingdom if it went ahead with plans to introduce plain packaging. In a submission to the government, Philip Morris International said it would seek compensation running into \"billions of pounds,\" if the proposed legislation went ahead.\nIn 2018, an advertising campaign was criticized as hypocritical for urging smokers to quit while promoting other products such as heated tobacco.\n\nIQOS\nIn 2017, according to two editors of the journal JAMA Internal Medicine, after publication of a research letter describing harmful chemicals in heat-not-burn tobacco products, people from Philip Morris International contacted the institutions where the researchers worked and questioned the methods used in the study; the editors described this as a form of \"pressure to suppress discourse that could harm commercial interests\".\nIn December 2017, Reuters published documents and testimonies of former employees detailing irregularities in the clinical trials conducted by Philip Morris International for the approval of the IQOS product by the U.S. Food and Drug Administration (FDA). Despite these allegations, Reuters found no evidence that the outcome of the experiments presented to the FDA had been manipulated or falsified. The FDA authorised the marketing of IQOS system as a modified risk tobacco product (MRTP) in July 2020. IQOS was the first electronic alternative to cigarettes to be granted marketing orders through the FDA's MRTP process.\n\nCigarette smuggling in Africa\nAccording to the Organized Crime and Corruption Reporting Project (OCCRP), PMI's sole distributor in Burkina Faso, Apollinaire Compaoré, has earned millions by participating in cigarette smuggling across West Africa. The report indicates that Compaoré worked with Nigerien narco-trafficker Chérif Ould Abidine, nicknamed Chérif Cocaine, to smuggle Marlboro cigarettes into Libya. This tobacco trafficking contributes to the financing of local conflicts and passes through six countries: Algeria, Libya, Burkina Faso, Mali, Niger and Côte d'Ivoire.\n\nOther\nFrom the 1970s to the late 1990s, Philip Morris along with British American Tobacco, was involved in campaigns to undermine bans against smoking in Muslim majority countries by branding Muslims who opposed smoking as a \"'fundamentalist’ who wishes to return to sharia law,\" and be \"a threat to existing government as” according to leaked documents. A 1985 report from Philip Morris squarely blamed the World Health Organization: “This ideological development has become a threat to our business because of the interference of the WHO [...] The WHO has not only joined forces with Muslim fundamentalists who view smoking as evil, but has gone yet further by encouraging religious leaders previously not active anti-smokers to take up the cause.\" Philip Morris has refused to comment on these findings.\nPhilip Morris International announced in 2011 an overhaul of its human rights protections of tobacco workers in Kazakhstan and 30 other tobacco-producing countries after critical reports.\nIn February 2015, John Oliver highlighted the company's many international legal cases on an episode of his television show Last Week Tonight. He also attempted to raise awareness for his campaign using the hashtag #JeffWeCan.\n\nSponsorship\nPhilip Morris is a long-term main sponsor of the Formula One team Scuderia Ferrari. The sponsorship is subliminal in the logo in recent times due to restrictions in tobacco advertising. Marlboro-branded Ferrari and McLaren cars won several world titles with famous drivers such as Alain Prost, James Hunt, Niki Lauda, Ayrton Senna and Michael Schumacher. Philip Morris also sponsored several title winners in MotoGP, road racing and Indy Cars. The Ferrari Formula One deal before direct advertisements were banned was estimated to be worth £45 million a year as well as paying the multi-million salary of Schumacher.\nDespite no longer being able to display the Marlboro logo on Ferrari cars, Philip Morris renewed its sponsorship deal with Ferrari in 2011, 2015, 2017, and 2018 up until 2021. The 2017 deal was reported to be worth $160 million a year.\nPhilip Morris's sponsorship of Ferrari was seen visually on the car again at the 2018 Japanese Grand Prix, with the cigarette company's \"Mission Winnow\" branding. This branding has been seen by authorities as an attempt to flout laws and rules banning tobacco advertising, and it was removed by Ferrari for the 2019 Australian Grand Prix after Australian authorities launched an investigation. Ferrari also decided to remove the branding for the 2019 Canadian Grand Prix and the 2019 French Grand Prix to avoid problems with bans on tobacco advertising. In 2022, Mission Winnow/Phillip Morris International and Ferrari decided to mutually end their title sponsorship and sponsorship agreement entirely. As of 2025, Phillip Morris International returned to sponsor Ferrari and can be seen on Ferrari's list of sponsors on their official website. \n\nIn motorcycle racing, Philip Morris International sponsored Ducati Corse and Yamaha MotoGP teams. In 1999, Yamaha was sponsored by Marlboro until 2002 season of MotoGP series. In 2003, Marlboro has been a title sponsor of the team despite the company logo does not appear or riders motorcycle due to the tobacco advertising ban in European Union countries that were already in effect at that time. similarly it had been removed from Scuderia Ferrari Formula One race cars earlier in 2019. Marlboro would stopped the sponsorship on Ducati in 2007. During the Marlboro sponsorship period, Yamaha won the constructor championship in 2000 season and Ducati won the constructor title in 2007 season with Casey Stoner as rider champion.\nIn 2019, similar to Scuderia Ferrari Formula One team, Philip Morris International returned as a sponsor for Ducati MotoGP team with the cigarette company's \"Mission Winnow\" branding. The sponsorship has raised controversy in some countries like Australia and Italy. The case has been brought to Italian court. However, a Philip Morris International spokesperson denied Mission Winnow being a tobacco advertising and \"instead is a company dedicated to developing and find ways to help smokers around the world to give up their tobacco addiction\". The Australian federal Minister for Health and Victoria state Department of Health and Human Services has also launched a probe against Philip Morris International. Mission Winnow was forced to drop its branding during the 2019 French motorcycle Grand Prix in Le Mans and 2019 Australian Motorcycle Grand Prix in Phillip Island, Victoria due to local government regulations. By 2020 season, Mission Winnow has been dropped as Ducati main sponsor and has been replaced with Lenovo to fill the main sponsorship void.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Philip Morris International Inc.: \nPhilip Morris International on OpenSecrets, a website that tracks and publishes data on campaign finance and lobbying",
  "clean_text": "Philip Morris International Inc. (PMI) is a tobacco company, with products sold in over 180 countries. Marlboro is PMI’s most recognized brand, but in the last quarter of 2023, Iqos generated the greatest revenue. Philip Morris International is often referred to as one of the companies comprising Big Tobacco. The company ranked No. 121 in the 2025 Fortune 500 list of the largest US corporations by total revenue. The company originated in 1847 in London, but Philip Morris International itself was established in 1987 as an operating company of Philip Morris Companies Inc. In 2003, Philip Morris Companies changed its name to Altria Group. In March 2008, PMI was spun off from Altria and has been an entirely separate entity since then. Philip Morris USA, a subsidiary of PMI's former parent, keeps ownership of the Philip Morris brands for the US market. The company's legal seat is in Stamford, Connecticut. PMI's operational headquarters are in Lausanne, Switzerland. With tobacco being addictive and a leading cause of preventable death globally, the company has faced litigation and regulatory measures from governments and has been the subject of scrutiny by the World Health Organization. The company knowingly maintained the claim that smoking cigarettes is harmless, despite overwhelming external and internal evidence that smoking is addictive and dangerous. In response, the company has diversified in the 21st century into smoke-free products such as the Iqos brand of heated tobacco products, Zyn brand of nicotine pouches, and Veev brand of electronic cigarettes. History Early years The company history began in 1847 with the opening of a single shop on London's Bond Street by a local tobacconist, Philip Morris. The shop gained popularity after the Crimean War, where Turkish tobacco became popular among returning soldiers who started preferring cigarettes over pipe tobacco and cigars. Morris hired more employees to hand-roll them. After Morris died in 1873, his widow Margaret and brother Leopold ran the business. Leopold became the sole owner in 1880 and formed a partnership with Joseph Grunebaum, leading to the incorporation of Philip Morris & Company and Grunebaum, Ltd. in 1881. The company became Philip Morris & Co., Ltd. in 1885 when the partnership dissolved. Highly indebted, it was bought by one of its creditors, William Curtis Thomson, in 1894. In 1902, King Edward, a long-time customer of the shop, appointed Philip Morris as royal tobacconist, boosting business. That same year, the company was incorporated in the United States by Gustav Eckmeyer, who had been its sole importer and distributor in the New World since 1872. Ownership was shared between Eckmeyer and the parent company, and the venture began selling its first domestic brands along with its traditional luxury imports, including Marlborough, named after one of the London manufactories located on Marlborough street. In 1919, the American subsidiary was bought by investor Georges Whelan and incorporated in Virginia under the name of Philip Morris & Co., Ltd. Inc. Marlborough dropped three letters in 1924 and was relaunched as a premium cigarette for the growing US female market. With Turkish tobacco falling out of fashion and its brands sitting firmly in the luxury and premium segments, total sales account for as little as 0.5% of the total cigarette market in 1925. In the early 1950's, growing concerns about the health effects of cigarettes led most manufacturers to add filters: by the end of 1954, filtered brands accounted for more than 10 percent of sales volumes. To enter this market, Philip Morris' executives first decided to purchase Benson & Hedges in 1954, which had pioneered the market with its Parliament brand. However, the brand lost nearly 10% of its market share under the new management. The company then decided a brand repositioning for Marlboro, a premium yet stagnant brand from its portfolio. George Weissman, the new vice-president for marketing and new products, signed up Leo Burnett to the task. The agency's challenge was to appeal to male smokers concerned enough about their health to consider switching to filter cigarettes. The logo and packaging were redesigned and the marketing was supported by a series of Marlboro Men. The campaign was a success: within a year of its national roll-out, volumes increased 3,000%, swiftly becoming the fourth best-selling cigarette brand. Becoming an international giant Increasing sales fueled the company's expansion: in 1954, Philip Morris Australia became the first international affiliate of the company. Then, in 1957, the Swiss Fabriques de Tabac Réunies in Neuchatel became the first to acquire foreign licensing rights to produce the booming Marlboro, marking the company's first move into Europe since leaving Britain. The Swiss company was eventually purchased in 1963. The overseas division was renamed Philip Morris International in 1961, alongside Philip Morris Domestic and Philip Morris Industrial. The company underwent rapid expansion abroad in the 1960s. By 1965, Philip Morris products were available in 140 countries and territories. Domestically, Marlboro became the leading brand in the United States by 1972. During the mid-60s the company began to form a horizontal conglomerate, gradually purchasing various entities such as Miller brewing (1968), Seven-Up (1978), Kraft Foods (1988) and many others. The company also pursued a series of international partnerships with local monopolies, allowing its products to reach consumers in more than 170 countries and territories by 1980. In 1987, Philip Morris International (PMI) was incorporated in Virginia as an operating company of Philip Morris, Inc. The fall of the USSR in the early 1990s provided another expansion opportunity, and Philip Morris International was among the first US companies to operate in the former Communist bloc. In 1990, two years before actually opening an office in the country, PMI accepted an oil-for-cigarettes deal with the failing Soviet state to help deal with cigarette shortages. In 1994, Philip Morris International established the Philip Morris Ukraine subsidiary and acquired a 51% stake in a tobacco manufacturing facility in Kharkiv which was soon upgraded. PMI was also one of the first US entrants in the Vietnamese market, opening a manufacturing plant a few months before the two countries normalized their relations. Later, in 2005, PMI also acquired Coltabaco in Colombia and Sampoerna in Indonesia. PMI as an independent entity On January 27, 2003, Philip Morris Companies Inc. changed its name to Altria. The conglomerate then gradually changed its strategy, selling off large portions of its non-tobacco consumer products holdings. Kraft Foods Inc. was spun off in March 2007, with the company's 88.1% stake being distributed to Altria shareholders. That same year, Altria began the process of spinning off Philip Morris International to allow it to pursue growth opportunities abroad without the legal uncertainties stemming from its US arm. PMI's spinoff from Altria took effect in March 2008. Altria shareholders were given shares in PMI, which was listed on the New York Stock Exchange and other stock exchanges. Louis Camilleri, who had been Altria's CEO, became PMI's new Chief Executive. Although PMI remains incorporated in the US (relocated from New York City to Stamford, Connecticut in 2022), it has never sold combustible cigarettes there. Its operational center has been in Lausanne, Switzerland, since 2002. In 2009, Philip Morris International opened its research and development center (called \"The Cube\") in Neuchatel, Switzerland. The opening of this R&D center marked a significant milestone for Philip Morris International in the development of new smoke-free products. The company launched Iqos in 2014, a heated tobacco product with reduced emissions. In 2023, Iqos and other smoke-free products made up nearly 40% of PMI's global sales, with Iqos alone surpassing the net revenue generated by Marlboro. In 2022, PMI also agreed to a $16 billion deal to acquire Swedish Match, boosting its position in cigarette alternatives with the Zyn nicotine pouch brand. Products Brands Philip Morris International has several multibillion-dollar brands. The top five brands of combustible products accounted for 80% of the total cigarette shipments volume in 2024. According to its 2024 annual report, the company had sold almost 617 million cigarettes, along with 140 million heated tobacco units and 1 billion cans of oral tobacco (nicotine pouches, snus, moist snuff): Marlboro was launched in 1924 and is the world’s best-selling cigarette brand, ranking first among the most valuable tobacco brands. Iqos heated tobacco products were launched in 2014. Iqos is PMI’s flagship smoke-free product and surpassed Marlboro net revenue at the end of 2023. L&M was launched by Liggett & Myers in 1953. In 1999, the L&M trademark was acquired by Philip Morris Companies Inc, but the rights have been split per country by Philip Morris USA (Altria) and PMI since the spin-off in 2008. Chesterfield was first launched in 1873 by the Drummond Tobacco company of Saint Louis, Missouri, and became the first major brand to enter the king-size (85mm) market in 1952. Parliament was launched in 1931 and was the first major brand to introduce a filter mouthpiece. Philip Morris's eponymous brand gave fame to bellhop Johnny Roventini and his \"Call for Philip Morris\". Zyn, launched in 2016, is the leading brand of nicotine pouches, accounting for more than 60% of the US market in 2022. The company also distributes a number of local or historical brands, such as Apollo–Soyuz, Muratti, Virginia Slims, etc.. Research Philip Morris International's research center is located in Neuchatel, Switzerland and houses Philip Morris International's product research and development program. Between 2009 and 2023, the company indicated spending 12.5 billion dollars on R&D, 99% of which on smoke-free products. Corporate affairs Board of directors As of June 2025: Financials For the fiscal year 2024, Philip Morris reported earnings of US$7.057 billion with a net annual revenue (excluding excise taxes) of US$37.878 billion. As of June 2025, Philip Morris International had a market cap of $285.27 billion, making it the largest privately owned company in the sector. Other investments PM Equity Partner is Philip Morris International venture capital arm and invests in early stage and growth-stage companies operating in one of the four investment corridors defined by the company: life sciences, industrial technologies, consumer engagement and product technologies. In 2021, Philip Morris International acquired Vectura for £1 billion, Fertin Pharma for DKK 5.1 billion, and Otitopic for an undisclosed sum. These companies were consolidated to form Vectura Fertin Pharma in early 2022, which was operationally separate from other businesses owned by PMI before being resold to Molex in 2025. Controversies Foundation for a Smoke-free World In September 2017, Philip Morris International announced the establishment of the Foundation for a Smoke-Free World, stating that it would support it with almost US$1 billion of funding over the next 12 years. The declared objective of the Foundation was to \"evaluate the impact that smoke-free alternatives can have on smokers and public health, assess the effect of reduced cigarette consumption on the industry value chain, and measure overall progress towards a smoke-free world.\" However, the Foundation, which claimed to be independent, was surrounded with controversy since its inception. Its claims to independence have been challenged. The World Health Organization issued a statement in which it pointed out the \"conflicts of interest involved with a tobacco company funding a purported health foundation\", indicating that it would not partner with the Foundation and inviting governments and the public health community to follow its lead. More than one hundred public health organizations have taken a strong stance in rejecting collaboration with the foundation. In May 2024, anti-tobacco activist Cliff Douglas was hired as CEO of the Foundation. After negotiating a final payment of $140 million, the organisation split from PMI and rebranded as Global Action to End Smoking. Australia The Australian Government announced it would introduce \"Tobacco Plain Packaging Laws\" on 29 April 2010. Philip Morris International (PMI), arranged for its wholly owned Hong Kong subsidiary Philip Morris Asia (PMA) to \"takeover\" two Australian subsidiaries – Philip Morris Australia Limited and Philip Morris Limited on 23 February 2011. In June 2011, Philip Morris International announced that it was using ISDS provisions in the Australia-Hong Kong Bilateral Investment treaty (BIT) to demand compensation for Australia's plain cigarette packaging anti-smoking legislation. It was one of several tobacco companies to launch legal action against the Australian Government. In response, British American Tobacco, Philip Morris, Imperial Tobacco and Japan Tobacco International took the Australian government to the High Court of Australia to try to stop the government of Australia from introducing plain packaging for tobacco products. Two challenges to the tobacco plain packaging legislation were heard by the High Court of Australia between 17 and 19 April 2012: \"British American Tobacco Australasia Limited and Ors v. Commonwealth of Australia\" and \"J T International SA v. Commonwealth of Australia\". On 15 August 2012, the High Court handed down orders for these matters, and found that the Tobacco Plain Packaging Act 2011 is not contrary to s 51(xxxi) of the Constitution. On 5 October 2012, the Court handed down its reasons for the decision. By a 6:1 majority (Heydon J in dissent) the Court held that there had been no acquisition of property that would have required provision of \"just terms\" under s51(xxxi) of the Constitution. On 18 December 2015, the Tribunal instituted by the United Nations Commission on International Trade Law (UNCITRAL) issued a unanimous decision (3–0) agreeing with Australia's position that the Tribunal has no jurisdiction to hear PMA's claim. This was due to the fact that PMI used its wholly owned subsidiary PMA to takeover the Australian-based PM subsidiaries in order to specifically sue the Australian Government for bringing in plain packaging laws. PMI was unable to do this itself as the Australia–United States free-trade agreement signed in 2004 did not have any investor-state dispute settlement clauses included—by design. In 2017, the Dispute Settlement Body of the World Trade Organization supported Australia's right to enforce plain packaging. In 2017, PMI was instructed to pay the Australia government's legal costs, an estimated 50 million dollars. In March 2018, the tobacco giant announced that it will cut 150 jobs as part of a major restructure. Tammy Chan, the managing director in Australia, said more efficient ways to deal with retailers were introduced based on digital technology development. European Union In 2004, Philip Morris and the European Union reached an agreement according to which Philip Morris would pay $1.25bn until 2016 to end a lawsuit over smuggling charges. Norway Philip Morris also sued Norway over the country's ban on displaying tobacco products in stores. It lost the case in 2012. Poland In the 1990s, Philip Morris International acquired a controlling share of Poland’s state tobacco company, which owned a factory operating just beyond the boundaries of the notorious Nazi concentration camp. Russia The market share of Philip Morris International brands in Russia amounted to 30.1% in 2019. According to National Agency on Corruption Prevention of Ukraine, the total amount of corporate income tax (not including excise) paid by PMI to the Russian budget in 2022 amounted to US$206 million. Following the Russian invasion of Ukraine, Philip Morris announced its intention to sell its Russian business and exit the market, but has not done so. Because of its reluctance to leave the Russian market, the Ukrainian National Agency on Corruption Prevention included PMI in its International Sponsors of War list in 2023. PMI was removed from the list in July 2024. Its Russian subsidiary remains under sanctions of the National Security and Defense Council of Ukraine. Uruguay In 2010, the company lobbied against Uruguay's strong anti-smoking laws and filed a complaint against the country (Philip Morris v. Uruguay) under the Switzerland-Uruguay bilateral investment treaty. On 8 July 2016, the International Centre for Settlement of Investment Disputes ruled in favour of Uruguay. United Kingdom In August 2014, the company foreshadowed legal action against the Government of the United Kingdom if it went ahead with plans to introduce plain packaging. In a submission to the government, Philip Morris International said it would seek compensation running into \"billions of pounds,\" if the proposed legislation went ahead. In 2018, an advertising campaign was criticized as hypocritical for urging smokers to quit while promoting other products such as heated tobacco. IQOS In 2017, according to two editors of the journal JAMA Internal Medicine, after publication of a research letter describing harmful chemicals in heat-not-burn tobacco products, people from Philip Morris International contacted the institutions where the researchers worked and questioned the methods used in the study; the editors described this as a form of \"pressure to suppress discourse that could harm commercial interests\". In December 2017, Reuters published documents and testimonies of former employees detailing irregularities in the clinical trials conducted by Philip Morris International for the approval of the IQOS product by the U.S. Food and Drug Administration (FDA). Despite these allegations, Reuters found no evidence that the outcome of the experiments presented to the FDA had been manipulated or falsified. The FDA authorised the marketing of IQOS system as a modified risk tobacco product (MRTP) in July 2020. IQOS was the first electronic alternative to cigarettes to be granted marketing orders through the FDA's MRTP process. Cigarette smuggling in Africa According to the Organized Crime and Corruption Reporting Project (OCCRP), PMI's sole distributor in Burkina Faso, Apollinaire Compaoré, has earned millions by participating in cigarette smuggling across West Africa. The report indicates that Compaoré worked with Nigerien narco-trafficker Chérif Ould Abidine, nicknamed Chérif Cocaine, to smuggle Marlboro cigarettes into Libya. This tobacco trafficking contributes to the financing of local conflicts and passes through six countries: Algeria, Libya, Burkina Faso, Mali, Niger and Côte d'Ivoire. Other From the 1970s to the late 1990s, Philip Morris along with British American Tobacco, was involved in campaigns to undermine bans against smoking in Muslim majority countries by branding Muslims who opposed smoking as a \"'fundamentalist’ who wishes to return to sharia law,\" and be \"a threat to existing government as” according to leaked documents. A 1985 report from Philip Morris squarely blamed the World Health Organization: “This ideological development has become a threat to our business because of the interference of the WHO [...] The WHO has not only joined forces with Muslim fundamentalists who view smoking as evil, but has gone yet further by encouraging religious leaders previously not active anti-smokers to take up the cause.\" Philip Morris has refused to comment on these findings. Philip Morris International announced in 2011 an overhaul of its human rights protections of tobacco workers in Kazakhstan and 30 other tobacco-producing countries after critical reports. In February 2015, John Oliver highlighted the company's many international legal cases on an episode of his television show Last Week Tonight. He also attempted to raise awareness for his campaign using the hashtag #JeffWeCan. Sponsorship Philip Morris is a long-term main sponsor of the Formula One team Scuderia Ferrari. The sponsorship is subliminal in the logo in recent times due to restrictions in tobacco advertising. Marlboro-branded Ferrari and McLaren cars won several world titles with famous drivers such as Alain Prost, James Hunt, Niki Lauda, Ayrton Senna and Michael Schumacher. Philip Morris also sponsored several title winners in MotoGP, road racing and Indy Cars. The Ferrari Formula One deal before direct advertisements were banned was estimated to be worth £45 million a year as well as paying the multi-million salary of Schumacher. Despite no longer being able to display the Marlboro logo on Ferrari cars, Philip Morris renewed its sponsorship deal with Ferrari in 2011, 2015, 2017, and 2018 up until 2021. The 2017 deal was reported to be worth $160 million a year. Philip Morris's sponsorship of Ferrari was seen visually on the car again at the 2018 Japanese Grand Prix, with the cigarette company's \"Mission Winnow\" branding. This branding has been seen by authorities as an attempt to flout laws and rules banning tobacco advertising, and it was removed by Ferrari for the 2019 Australian Grand Prix after Australian authorities launched an investigation. Ferrari also decided to remove the branding for the 2019 Canadian Grand Prix and the 2019 French Grand Prix to avoid problems with bans on tobacco advertising. In 2022, Mission Winnow/Phillip Morris International and Ferrari decided to mutually end their title sponsorship and sponsorship agreement entirely. As of 2025, Phillip Morris International returned to sponsor Ferrari and can be seen on Ferrari's list of sponsors on their official website. In motorcycle racing, Philip Morris International sponsored Ducati Corse and Yamaha MotoGP teams. In 1999, Yamaha was sponsored by Marlboro until 2002 season of MotoGP series. In 2003, Marlboro has been a title sponsor of the team despite the company logo does not appear or riders motorcycle due to the tobacco advertising ban in European Union countries that were already in effect at that time. similarly it had been removed from Scuderia Ferrari Formula One race cars earlier in 2019. Marlboro would stopped the sponsorship on Ducati in 2007. During the Marlboro sponsorship period, Yamaha won the constructor championship in 2000 season and Ducati won the constructor title in 2007 season with Casey Stoner as rider champion. In 2019, similar to Scuderia Ferrari Formula One team, Philip Morris International returned as a sponsor for Ducati MotoGP team with the cigarette company's \"Mission Winnow\" branding. The sponsorship has raised controversy in some countries like Australia and Italy. The case has been brought to Italian court. However, a Philip Morris International spokesperson denied Mission Winnow being a tobacco advertising and \"instead is a company dedicated to developing and find ways to help smokers around the world to give up their tobacco addiction\". The Australian federal Minister for Health and Victoria state Department of Health and Human Services has also launched a probe against Philip Morris International. Mission Winnow was forced to drop its branding during the 2019 French motorcycle Grand Prix in Le Mans and 2019 Australian Motorcycle Grand Prix in Phillip Island, Victoria due to local government regulations. By 2020 season, Mission Winnow has been dropped as Ducati main sponsor and has been replaced with Lenovo to fill the main sponsorship void."
}