{
  "ticker": "PNC",
  "cik": "0000713676",
  "company_name": "PNC Financial Services",
  "corrected_name": "PNC Financial Services",
  "wiki_title_used": "PNC Financial Services",
  "exists": true,
  "raw_text": "The PNC Financial Services Group, Inc. is an American bank holding company and financial services corporation based in Pittsburgh, Pennsylvania. Its banking  subsidiary, PNC Bank, operates in 27 states and the District of Columbia, with 2,629 branches and 9,523 ATMs. PNC Bank is one of the largest banks in the US by assets and is one of the largest banks by number of branches, deposits, and number of ATMs.\nThe company also provides financial services such as asset management, wealth management, estate planning, loan servicing, and information processing. PNC is one of the largest Small Business Administration lenders and one of the largest credit card issuers. It also provides asset-based lending to private equity firms and middle market companies. PNC operates one of the largest treasury management businesses and the second largest lead arranger of asset-based loan syndications in the United States. Harris Williams & Co., a subsidiary of the company, is one of the country's largest mergers and acquisitions advisory firms for middle-market companies. Midland Loan Services, a division of PNC Real Estate based in Overland Park, Kansas and founded in 1991, is ranked by Mortgage Bankers Association as the second largest master and primary servicer of commercial bank and savings institution loans.\n\nHistory\nPNC Financial Services traces its history to the Pittsburgh Trust and Savings Company which was founded in Pittsburgh, Pennsylvania, on April 10, 1845.\nDue to the long recovery from the Great Fire of Pittsburgh, Pittsburgh Trust and Savings was not fully operational until January 28, 1852. It originally opened offices at Liberty Avenue and 12th Street. The bank was renamed The Pittsburgh Trust Company in 1853. In 1858, the company relocated its corporate offices to the corner of Fifth Avenue and Wood Street in Pittsburgh, where they remain to this day. The bank changed its name to First National Bank of Pittsburgh in 1863 after it became the first bank in the country to apply for a national charter as part of that year's National Banking Act. It received the 48th charter on August 5, 1863, with other later banks receiving charters sooner due to paperwork problems and the fact that the bank was already in business.\nIn 1946, First National merged with Peoples-Pittsburgh Trust Company – with whom it had worked closely since the 1930s – to form Peoples First National Bank & Trust. In 1959, Peoples First merged with Fidelity Trust Company to form Pittsburgh National Bank. At this time, the bank adopted the first version of its present logo – a stylized triangle representing the city's Golden Triangle. \nAnother branch of the current bank, the Philadelphia-based Provident National Corporation, dates back to 1865.\nIn 1982, Pittsburgh National Corporation and Provident National Corporation, both with PNC as their abbreviations, merged into a new entity named PNC Financial Corporation. It was the largest bank merger in American history at the time and created a company with $10.3 billion in assets. Between 1991 and 1996, PNC purchased more than ten smaller banks and financial institutions, including the $30 billion dollar merger of Midlantic Bank of Edison New Jersey in 1996, that at the time, was one-third the size of PNC. That broadened its market base from Kentucky to the New York metropolitan area.\n\nSince 1984, PNC has compiled the Christmas Price Index, a humorous economic indicator which estimates the prices of the items found in the song \"The Twelve Days of Christmas\".\nIn 1998, PNC acquired Hilliard Lyons for $275 million in cash and stock. Hilliard Lyons was sold in 2008.\nIn 1998, PNC sold its credit card business to Metris (now HSBC Finance) and MBNA.\nIn 2000, the company adopted a new brand image and changed its name to PNC Financial Services Group.\nIn 2001, PNC sold the original PNC Mortgage to Washington Mutual due to volatility in the market.\nIn 2004, PNC acquired United National Bancorp based in Bridgewater, New Jersey, for $321 million in cash and 6.6 million shares of its common stock.\nIn 2005, PNC acquired Riggs National Corporation of Washington, D. C. Riggs had been fined after aiding Chilean dictator Augusto Pinochet in money laundering. PNC became one of the largest banks in the Washington metropolitan area.\nIn 2005, PNC began outsourcing mortgages to Wells Fargo.\nIn August 2006, PNC got back into the credit card business by marketing and issuing credit cards under the MasterCard brand in partnership with U.S. Bancorp (U.S. Bank) . After the National City merger (see below) in 2008, the U.S. Bancorp (U.S. Bank) products were converted to PNC Bank products.\nOn March 2, 2007, PNC acquired Maryland-based Mercantile Bankshares, making PNC the eighth largest bank in the United States by deposits. \nOn October 26, 2007, PNC acquired Yardville National Bancorp, a small commercial bank centered in central New Jersey and eastern Pennsylvania.\nOn September 15, 2007, PNC Bank acquired Citizens National Bank of Laurel, Maryland.\nOn April 4, 2008, PNC acquired Sterling Financial Corporation, a commercial and consumer bank with accounts and branches in central Pennsylvania, northeastern Maryland and Delaware.\nOn October 24, 2008, during the 2008 financial crisis, the National City acquisition by PNC for $5.2 billion in stock was completed. The acquisition was financed with preferred stock sold to the United States Treasury as part of the Troubled Asset Relief Program implemented as part of the Emergency Economic Stabilization Act of 2008. The stock issued to the U.S. Treasury was repurchased in 2010. PNC then became the 5th largest bank in the United States by deposit and fourth largest by branches.\nOn August 14, 2009, PNC took over Dwelling House Savings & Loan and its only branch location in Pittsburgh's Hill District after Dwelling House failed and was placed in receivership by the Federal Deposit Insurance Corporation (FDIC). Dwelling House had been known in Pittsburgh to provide loans to low-income African Americans that other banks would deny. The branch was closed and accounts were transferred to the existing PNC branch in the Hill District.\nIn July 2010, PNC sold its Global Investment Servicing (GIS) subsidiary to The Bank of New York Mellon to repay funds from the Troubled Asset Relief Program, which had been used for the National City acquisition (see above) in 2008. GIS, established in 1973 and with 4,700 employees, was the second-largest full-service mutual fund transfer agent in the U.S and the second-largest full-service accounting and administration provider to U.S. mutual funds. GIS serviced $1.9 trillion in total assets and 58 million shareholder accounts. It was known as PFPC until July 2008.\nIn January 2011, PNC acquired BankAtlantic's Tampa Bay Area branches.\nIn December 2011, PNC acquired 27 branches in the northern Atlanta suburbs with $240 million in deposits and $42 million in book value from Flagstar Bank.\nIn 2012, PNC acquired RBC Bank from Royal Bank of Canada for $3.45 billion. RBC Bank had a 426 branches in southern Virginia, North Carolina, South Carolina, Georgia, Alabama, and Florida. Prior to the acquisition, PNC had slipped (due to mergers and growth in other firms) from its ranking following the 2008 National acquisition; this 2012 acquisition made PNC the fifth largest bank by branches behind Wells Fargo, Bank of America, Chase, and U.S. Bank and the sixth largest by total assets behind the aforementioned four banks and Citibank.\nOn July 30, 2012, PNC announced plans to put ATMs in 138 Harris Teeter grocery stores in the Carolinas, plus 53 other stores.\nIn September 2014, PNC acquired Solebury Capital Group, a capital markets advisory firm, for $50 million.\nOn October 2, 2015, the bank opened Tower at PNC Plaza, its new headquarters on the corner of Fifth Avenue and Wood Street in downtown Pittsburgh. It was first announced in 2011. The LEED Platinum building, owned by PNC and designed by Gensler, won awards for its environmentally friendly features.\nIn April 2017, the company acquired the U.S. equipment finance business of ECN Capital for $1.3 billion.\nIn November 2017, the company acquired The Trout Group, an investor relations and strategic advisory firm servicing the healthcare industry.\nIn 2018, the company acquired Fortis Advisors, which provides post-merger shareholder services. The company ranked one hundred sixty fifth on the 2018 Fortune 500 list of the largest United States corporations by revenue.\nIn 2018, PNC began opening \"Solution Centers\", a hybrid between traditional bank branches and ATM-only services, mostly serving new markets. Through this method, PNC expanded its retail footprint into Boston, Denver, Kansas City, Nashville, and several markets in Texas including Austin, Dallas, Houston, and San Antonio. Two of PNC's \"Big Four\" competitors, Bank of America and Chase Bank, have both also been expanding into new markets through this method, including into PNC's home market of Pittsburgh.\nIn August 2019, PNC launched a Fintech incubator subsidiary called \"numo\" that functions as an internal startup. Its first development included indi, an instant payment and mobile banking company for gig workers.\nIn May 2020, the company sold its stake in BlackRock.\nOn June 1, 2021, PNC acquired BBVA USA for $11.6 billion in cash. The acquisition significantly boosted its presence in Colorado and Texas, complemented its presence in Alabama and Florida, and introduced the bank to the Arizona, California, and New Mexico markets.\nIn 2021, PNC originated nearly 95,000 mortgages worth $34.8 billion. This is a 23% increase vs prior year and stands as their highest origination volume to date.\nIn July 2024, PNC partnered with Coinbase to offer cryptocurrency trading services to its customers through Coinbase's institutional platform.\nIn September 2025, PNC announced the acquisition of FirstBank, a Colorado-based lender with $26 billion in assets, for $4.1 billion.\n\nLegal issues\nOvercharging of Black and Hispanic borrowers by National City\nIn December 2013, the US Department of Justice and the Consumer Financial Protection Bureau (CFPB) announced that they had reached an agreement with National City Bank to resolve allegations that the bank had charged Black and Hispanic borrowers higher prices for mortgages between 2002 and 2008, before the acquisition by PNC. Regulators claimed that National City had violated the Fair Housing Act and Equal Credit Opportunity Act by charging more than 75,000 borrowers higher loan rates based on their race or ethnicity rather than their risk level. National City's lack of pricing guidelines resulted in black borrowers being charged an average of $159 more in extra upfront fees or higher interest than white borrowers. Black borrowers also paid an average of $228 more annually over the life of the loan than white borrowers. Hispanics paid $125 more upfront and $154 more annually than white borrowers. Under the terms of the settlement, PNC was required to pay victims $35 million.\n\nRetailer breach forced PNC to reissue customer cards\nIn March 2006, PNC and other large banks were forced to reissue hundreds of debit cards to customers after card numbers were disclosed by a breach at an unspecified retailer.\n\nLawsuit from Military Channel\nAlso in March 2006, PNC Bank was sued by Paul Bariteau, an investor in the Military Channel. Bariteau claimed PNC let the chairman of the Military Channel make unauthorized withdrawals of millions of dollars from the company's account for personal use.\n\nSecurities fraud settlement\nIn June 2003, PNC Bank agreed to pay $115 million to settle federal securities fraud charges after one of its subsidiaries fraudulently transferred $762 million in bad loans and other venture capital investments to an AIG entity in order to conceal them from investors.\n\nOvertime claim by loan officers\nIn 2017, PNC agreed to pay $16 million to settle claims of overtime wages by loan officers under the Fair Labor Standards Act.\n\nNational Prearranged Services fraud\nAccording to a lawsuit, funds entrusted to National Prearranged Services (NPS), a St. Louis–based company that sold prepaid funerals, were diverted and embezzled. PNC Bank is the successor to Allegiant Bank, which served as a trustee for NPS from 1998 to 2004. In 2015, a jury ordered PNC to pay $391 million. In 2017, a federal judge overturned the decision and ordered a retrial. In 2021, a $106 million judgement was affirmed by the Eighth Circuit.\n\nMunicipal bonds disclosure violations\nIn 2015, PNC was one of 22 companies that violated disclosure requirements for municipal bonds by failing to divulge that the issuers had filed late financial reports. It was fined $500,000.\n\nControversies\nFunding of mountaintop removal mining\nBeginning in 2010, until it changed its policy in February 2015, PNC was the subject of protests by the Earth Quaker Action Team, led by George Lakey, and the Rainforest Action Network due to its funding of companies engaged in mountaintop removal mining in Appalachia. The protests included political demonstrations at branches and offices and the annual general meeting, fasting, and boycotts.\n\nCancelling MxM News Financial Accounts\nOn March 2, 2023, Donald Trump Jr., cofounder of news aggregator MxM News, tweeted that PNC had abruptly cancelled all financial services for MxM without explanation. Trump and cofounder Taylor Budowich alleged that PNC disapproved of Trump’s political leanings since no reason was given for the closure. PNC claimed it was a “good faith error” and reopened the account.\n\nNotable corporate buildings\nThe Tower at PNC Plaza in Pittsburgh, Pennsylvania (current corporate headquarters)\nOne PNC Plaza in Pittsburgh, Pennsylvania\nTwo PNC Plaza in Pittsburgh, Pennsylvania\nThree PNC Plaza in Pittsburgh, Pennsylvania\nU.S. Steel Tower in Pittsburgh, Pennsylvania (PNC is a major tenant)\nPNC Bank Building at 1600 Market Street, Philadelphia, Pennsylvania\nPNC Bank Building in Columbus, Ohio\nPNC Bank Building in Toledo, Ohio\nPNC Bank Building in Washington, D.C.\nPNC Center in Cincinnati, Ohio\nPNC Center in Cleveland, Ohio (former headquarters of National City Corp.)\nPNC Center and Hyatt Regency Indianapolis in Indianapolis, Indiana\nPNC Center in Troy, Michigan\nPNC Plaza in Louisville, Kentucky\nPNC Plaza in Raleigh, North Carolina\nPNC Tower in Cincinnati, Ohio\nPNC Tower in Louisville, Kentucky (PNC is a major tenant)\nOne Tampa City Center in Tampa, Florida (PNC holds the naming rights and is a major tenant)\nPNC Plaza in Dallas, Texas\n\nNaming rights and sponsorships\nPNC is a sponsor of the following:\n\nChief executives\nWilliam S. Demchak, since April 23, 2013\nJames E. Rohr CEO May 1, 2000 – April 23, 2013, Chairman May 2001 – April 2014\nThomas H. O'Brien CEO of PNC April 1, 1985 – May 1, 2000\nRobert C. Milsom CEO of Pittsburgh National 1985 – December 31, 1989\nMerle E. Gilliand November 1968 – April 1, 1985\n\nSee also\nCompanies portal\n Banks portal\nBBVA USA\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for PNC Financial Services:",
  "clean_text": "The PNC Financial Services Group, Inc. is an American bank holding company and financial services corporation based in Pittsburgh, Pennsylvania. Its banking subsidiary, PNC Bank, operates in 27 states and the District of Columbia, with 2,629 branches and 9,523 ATMs. PNC Bank is one of the largest banks in the US by assets and is one of the largest banks by number of branches, deposits, and number of ATMs. The company also provides financial services such as asset management, wealth management, estate planning, loan servicing, and information processing. PNC is one of the largest Small Business Administration lenders and one of the largest credit card issuers. It also provides asset-based lending to private equity firms and middle market companies. PNC operates one of the largest treasury management businesses and the second largest lead arranger of asset-based loan syndications in the United States. Harris Williams & Co., a subsidiary of the company, is one of the country's largest mergers and acquisitions advisory firms for middle-market companies. Midland Loan Services, a division of PNC Real Estate based in Overland Park, Kansas and founded in 1991, is ranked by Mortgage Bankers Association as the second largest master and primary servicer of commercial bank and savings institution loans. History PNC Financial Services traces its history to the Pittsburgh Trust and Savings Company which was founded in Pittsburgh, Pennsylvania, on April 10, 1845. Due to the long recovery from the Great Fire of Pittsburgh, Pittsburgh Trust and Savings was not fully operational until January 28, 1852. It originally opened offices at Liberty Avenue and 12th Street. The bank was renamed The Pittsburgh Trust Company in 1853. In 1858, the company relocated its corporate offices to the corner of Fifth Avenue and Wood Street in Pittsburgh, where they remain to this day. The bank changed its name to First National Bank of Pittsburgh in 1863 after it became the first bank in the country to apply for a national charter as part of that year's National Banking Act. It received the 48th charter on August 5, 1863, with other later banks receiving charters sooner due to paperwork problems and the fact that the bank was already in business. In 1946, First National merged with Peoples-Pittsburgh Trust Company – with whom it had worked closely since the 1930s – to form Peoples First National Bank & Trust. In 1959, Peoples First merged with Fidelity Trust Company to form Pittsburgh National Bank. At this time, the bank adopted the first version of its present logo – a stylized triangle representing the city's Golden Triangle. Another branch of the current bank, the Philadelphia-based Provident National Corporation, dates back to 1865. In 1982, Pittsburgh National Corporation and Provident National Corporation, both with PNC as their abbreviations, merged into a new entity named PNC Financial Corporation. It was the largest bank merger in American history at the time and created a company with $10.3 billion in assets. Between 1991 and 1996, PNC purchased more than ten smaller banks and financial institutions, including the $30 billion dollar merger of Midlantic Bank of Edison New Jersey in 1996, that at the time, was one-third the size of PNC. That broadened its market base from Kentucky to the New York metropolitan area. Since 1984, PNC has compiled the Christmas Price Index, a humorous economic indicator which estimates the prices of the items found in the song \"The Twelve Days of Christmas\". In 1998, PNC acquired Hilliard Lyons for $275 million in cash and stock. Hilliard Lyons was sold in 2008. In 1998, PNC sold its credit card business to Metris (now HSBC Finance) and MBNA. In 2000, the company adopted a new brand image and changed its name to PNC Financial Services Group. In 2001, PNC sold the original PNC Mortgage to Washington Mutual due to volatility in the market. In 2004, PNC acquired United National Bancorp based in Bridgewater, New Jersey, for $321 million in cash and 6.6 million shares of its common stock. In 2005, PNC acquired Riggs National Corporation of Washington, D. C. Riggs had been fined after aiding Chilean dictator Augusto Pinochet in money laundering. PNC became one of the largest banks in the Washington metropolitan area. In 2005, PNC began outsourcing mortgages to Wells Fargo. In August 2006, PNC got back into the credit card business by marketing and issuing credit cards under the MasterCard brand in partnership with U.S. Bancorp (U.S. Bank) . After the National City merger (see below) in 2008, the U.S. Bancorp (U.S. Bank) products were converted to PNC Bank products. On March 2, 2007, PNC acquired Maryland-based Mercantile Bankshares, making PNC the eighth largest bank in the United States by deposits. On October 26, 2007, PNC acquired Yardville National Bancorp, a small commercial bank centered in central New Jersey and eastern Pennsylvania. On September 15, 2007, PNC Bank acquired Citizens National Bank of Laurel, Maryland. On April 4, 2008, PNC acquired Sterling Financial Corporation, a commercial and consumer bank with accounts and branches in central Pennsylvania, northeastern Maryland and Delaware. On October 24, 2008, during the 2008 financial crisis, the National City acquisition by PNC for $5.2 billion in stock was completed. The acquisition was financed with preferred stock sold to the United States Treasury as part of the Troubled Asset Relief Program implemented as part of the Emergency Economic Stabilization Act of 2008. The stock issued to the U.S. Treasury was repurchased in 2010. PNC then became the 5th largest bank in the United States by deposit and fourth largest by branches. On August 14, 2009, PNC took over Dwelling House Savings & Loan and its only branch location in Pittsburgh's Hill District after Dwelling House failed and was placed in receivership by the Federal Deposit Insurance Corporation (FDIC). Dwelling House had been known in Pittsburgh to provide loans to low-income African Americans that other banks would deny. The branch was closed and accounts were transferred to the existing PNC branch in the Hill District. In July 2010, PNC sold its Global Investment Servicing (GIS) subsidiary to The Bank of New York Mellon to repay funds from the Troubled Asset Relief Program, which had been used for the National City acquisition (see above) in 2008. GIS, established in 1973 and with 4,700 employees, was the second-largest full-service mutual fund transfer agent in the U.S and the second-largest full-service accounting and administration provider to U.S. mutual funds. GIS serviced $1.9 trillion in total assets and 58 million shareholder accounts. It was known as PFPC until July 2008. In January 2011, PNC acquired BankAtlantic's Tampa Bay Area branches. In December 2011, PNC acquired 27 branches in the northern Atlanta suburbs with $240 million in deposits and $42 million in book value from Flagstar Bank. In 2012, PNC acquired RBC Bank from Royal Bank of Canada for $3.45 billion. RBC Bank had a 426 branches in southern Virginia, North Carolina, South Carolina, Georgia, Alabama, and Florida. Prior to the acquisition, PNC had slipped (due to mergers and growth in other firms) from its ranking following the 2008 National acquisition; this 2012 acquisition made PNC the fifth largest bank by branches behind Wells Fargo, Bank of America, Chase, and U.S. Bank and the sixth largest by total assets behind the aforementioned four banks and Citibank. On July 30, 2012, PNC announced plans to put ATMs in 138 Harris Teeter grocery stores in the Carolinas, plus 53 other stores. In September 2014, PNC acquired Solebury Capital Group, a capital markets advisory firm, for $50 million. On October 2, 2015, the bank opened Tower at PNC Plaza, its new headquarters on the corner of Fifth Avenue and Wood Street in downtown Pittsburgh. It was first announced in 2011. The LEED Platinum building, owned by PNC and designed by Gensler, won awards for its environmentally friendly features. In April 2017, the company acquired the U.S. equipment finance business of ECN Capital for $1.3 billion. In November 2017, the company acquired The Trout Group, an investor relations and strategic advisory firm servicing the healthcare industry. In 2018, the company acquired Fortis Advisors, which provides post-merger shareholder services. The company ranked one hundred sixty fifth on the 2018 Fortune 500 list of the largest United States corporations by revenue. In 2018, PNC began opening \"Solution Centers\", a hybrid between traditional bank branches and ATM-only services, mostly serving new markets. Through this method, PNC expanded its retail footprint into Boston, Denver, Kansas City, Nashville, and several markets in Texas including Austin, Dallas, Houston, and San Antonio. Two of PNC's \"Big Four\" competitors, Bank of America and Chase Bank, have both also been expanding into new markets through this method, including into PNC's home market of Pittsburgh. In August 2019, PNC launched a Fintech incubator subsidiary called \"numo\" that functions as an internal startup. Its first development included indi, an instant payment and mobile banking company for gig workers. In May 2020, the company sold its stake in BlackRock. On June 1, 2021, PNC acquired BBVA USA for $11.6 billion in cash. The acquisition significantly boosted its presence in Colorado and Texas, complemented its presence in Alabama and Florida, and introduced the bank to the Arizona, California, and New Mexico markets. In 2021, PNC originated nearly 95,000 mortgages worth $34.8 billion. This is a 23% increase vs prior year and stands as their highest origination volume to date. In July 2024, PNC partnered with Coinbase to offer cryptocurrency trading services to its customers through Coinbase's institutional platform. In September 2025, PNC announced the acquisition of FirstBank, a Colorado-based lender with $26 billion in assets, for $4.1 billion. Legal issues Overcharging of Black and Hispanic borrowers by National City In December 2013, the US Department of Justice and the Consumer Financial Protection Bureau (CFPB) announced that they had reached an agreement with National City Bank to resolve allegations that the bank had charged Black and Hispanic borrowers higher prices for mortgages between 2002 and 2008, before the acquisition by PNC. Regulators claimed that National City had violated the Fair Housing Act and Equal Credit Opportunity Act by charging more than 75,000 borrowers higher loan rates based on their race or ethnicity rather than their risk level. National City's lack of pricing guidelines resulted in black borrowers being charged an average of $159 more in extra upfront fees or higher interest than white borrowers. Black borrowers also paid an average of $228 more annually over the life of the loan than white borrowers. Hispanics paid $125 more upfront and $154 more annually than white borrowers. Under the terms of the settlement, PNC was required to pay victims $35 million. Retailer breach forced PNC to reissue customer cards In March 2006, PNC and other large banks were forced to reissue hundreds of debit cards to customers after card numbers were disclosed by a breach at an unspecified retailer. Lawsuit from Military Channel Also in March 2006, PNC Bank was sued by Paul Bariteau, an investor in the Military Channel. Bariteau claimed PNC let the chairman of the Military Channel make unauthorized withdrawals of millions of dollars from the company's account for personal use. Securities fraud settlement In June 2003, PNC Bank agreed to pay $115 million to settle federal securities fraud charges after one of its subsidiaries fraudulently transferred $762 million in bad loans and other venture capital investments to an AIG entity in order to conceal them from investors. Overtime claim by loan officers In 2017, PNC agreed to pay $16 million to settle claims of overtime wages by loan officers under the Fair Labor Standards Act. National Prearranged Services fraud According to a lawsuit, funds entrusted to National Prearranged Services (NPS), a St. Louis–based company that sold prepaid funerals, were diverted and embezzled. PNC Bank is the successor to Allegiant Bank, which served as a trustee for NPS from 1998 to 2004. In 2015, a jury ordered PNC to pay $391 million. In 2017, a federal judge overturned the decision and ordered a retrial. In 2021, a $106 million judgement was affirmed by the Eighth Circuit. Municipal bonds disclosure violations In 2015, PNC was one of 22 companies that violated disclosure requirements for municipal bonds by failing to divulge that the issuers had filed late financial reports. It was fined $500,000. Controversies Funding of mountaintop removal mining Beginning in 2010, until it changed its policy in February 2015, PNC was the subject of protests by the Earth Quaker Action Team, led by George Lakey, and the Rainforest Action Network due to its funding of companies engaged in mountaintop removal mining in Appalachia. The protests included political demonstrations at branches and offices and the annual general meeting, fasting, and boycotts. Cancelling MxM News Financial Accounts On March 2, 2023, Donald Trump Jr., cofounder of news aggregator MxM News, tweeted that PNC had abruptly cancelled all financial services for MxM without explanation. Trump and cofounder Taylor Budowich alleged that PNC disapproved of Trump’s political leanings since no reason was given for the closure. PNC claimed it was a “good faith error” and reopened the account. Notable corporate buildings The Tower at PNC Plaza in Pittsburgh, Pennsylvania (current corporate headquarters) One PNC Plaza in Pittsburgh, Pennsylvania Two PNC Plaza in Pittsburgh, Pennsylvania Three PNC Plaza in Pittsburgh, Pennsylvania U.S. Steel Tower in Pittsburgh, Pennsylvania (PNC is a major tenant) PNC Bank Building at 1600 Market Street, Philadelphia, Pennsylvania PNC Bank Building in Columbus, Ohio PNC Bank Building in Toledo, Ohio PNC Bank Building in Washington, D.C. PNC Center in Cincinnati, Ohio PNC Center in Cleveland, Ohio (former headquarters of National City Corp.) PNC Center and Hyatt Regency Indianapolis in Indianapolis, Indiana PNC Center in Troy, Michigan PNC Plaza in Louisville, Kentucky PNC Plaza in Raleigh, North Carolina PNC Tower in Cincinnati, Ohio PNC Tower in Louisville, Kentucky (PNC is a major tenant) One Tampa City Center in Tampa, Florida (PNC holds the naming rights and is a major tenant) PNC Plaza in Dallas, Texas Naming rights and sponsorships PNC is a sponsor of the following: Chief executives William S. Demchak, since April 23, 2013 James E. Rohr CEO May 1, 2000 – April 23, 2013, Chairman May 2001 – April 2014 Thomas H. O'Brien CEO of PNC April 1, 1985 – May 1, 2000 Robert C. Milsom CEO of Pittsburgh National 1985 – December 31, 1989 Merle E. Gilliand November 1968 – April 1, 1985"
}