{
  "ticker": "PNR",
  "cik": "0000077360",
  "company_name": "Pentair",
  "corrected_name": "Pentair",
  "wiki_title_used": "Pentair",
  "exists": true,
  "raw_text": "Pentair plc (PNR) is an American water treatment company incorporated in Ireland with tax residency in UK, with its main U.S. office in Golden Valley, Minnesota. Pentair was founded in the US, with 65% of company's revenue coming from the US and Canada as of 2017. PNR was reorganized in 2014, shifting the corporate domicile from Switzerland to Ireland.\nOn April 30, 2018, PNR announced that it had completed the separation of its Water and Electrical businesses. Now the company's primary focus is on residential, commercial, industrial, municipal and infrastructure and agriculture applications. Its fiscal year 2021 revenues were US$3.8 billion and it employs approximately 11,250 people worldwide.\n\nHistory\n1960s\nPentair was founded in August 1966 as Pentair Industries, Inc., with the name derived from the Greek root word \"penta-\" (alluding to the company's five founders) and \"air\" (alluding to the company's original product), and went public several months later. The 5 founders were all formerly employed by Litton Industries. Originally, they intended to manufacture high altitude research balloons, but they found sales to be less than expected. They acquired a local vacuum-forming business shortly thereafter and set about making canoes. This venture also met with less than expected sales. By 1968 the company was nearly bankrupt. Of the five original founders, one had died while three more had pulled out. The only remaining founder, Murray Harpole, brought in an outside investor, Ben Westby and they set about purchasing Peavey Paper Mills, Inc. The company was deeply in debt and badly managed, but the sale price was very inexpensive and Harpole believed that proper management would turn the company around in short order.\n\n1970s\nThe company continued to diversify but none of its other ventures proved as successful as the paper industry. It continued to expand in that area and acquired Niagara Paper in 1972. Miami Paper was purchased in 1974 and Flambeau Paper Corporation followed in 1978. The Peavey plant would be sold in 1976 because Pentair had outgrown it. While Westby departed in 1976, D. Eugene Nugent was brought in to expand the management team.\n\n1980s\nIn 1981, Pentair acquired Rockwell International's power hand tool factory from its Power Tool Division. Rockwell had purchased Porter-Cable in 1960 and merged it into the Power Tool Division but kept manufacturing in a separate facility. The Porter-Cable name had been retired in 1965 but Pentair had not licensed the Rockwell name, so the Porter-Cable name was revived. In 1984 Pentair purchased the remains of the Power Tool Division from Rockwell. This consisted chiefly of the Delta line of shop tools and marked Rockwell's exit from the tool business. In 1988, Pentair agreed to acquire FC Holdings Inc., the holding company for Federal Cartridge and Hoffman Engineering, for $175 million in cash and the assumption of debt. Pentair would not hold Federal Cartridge for a long time, but the purchase of Hoffman Engineering was the start of a prosperous era of enclosures manufacturing for Pentair.\n\n1990s\nPentair expanded its water product business, acquiring the Fleck Controls control valve business in November 1995. In August 1997, Pentair acquired the General Signal Pump Group.\nPentair sold off its papermaking business to Consolidated Papers Inc. in 1997. While paper had been the backbone of Pentair's business it only amounted to about 10% of their revenue at the time of the sale.\nIn August 1999, Pentair bought the DeVilbiss Air Power Company for $460 million in cash. DeVilbiss makes air compressors, pressure washers and generators, which complemented to Pentair's professional Pneumatics tools that were powered by air compressors such as DeWalt and Porter-Cable.\nIn 1999 under chairman, president, and chief executive officer, Winslow H. Buxton, Pentair made a series of acquisitions. In April 1999, PNR purchased Essef, the global leader in the manufacture of composite water tanks, pumps, filters, and other water equipment used in pools and spas, for the cash-equivalent price of approximately $312 million.\nLater that year, Pentair decided to consolidate its power tool business. The Porter-Cable and Delta Divisions had previously operated across four different cooperate, warehouse, and manufacturing facilities in three states. While the Delta manufacturing facility in Tupelo Mississippi would remain independent everything else would be consolidated into a new facility built next to the existing Porter-Cable plant in Jackson, Tennessee. The new facility came online in February 2000 and was an immediate disaster.\n\n2000s\nThe decade started extremely poorly for Pentair. The botched opening of its new corporate office and distribution center in Jackson caused an immediate drop in revenue as the shipping facility encountered numerous issues. Orders shipped late, with incorrect products, or not at all. Complaints rose, sales fell, and returns poured in. By the end of the year, the entire management team in Jackson would be fired. It took almost three years to sort out the mess and return the Delta and Porter-Cable lines to profitability. This caused Pentair to further review its holdings and look at ways to cut costs. It expanded its production in Taiwan and started to negotiate with the union of its Delta manufacturing facility to reduce payroll. In 2003 it was announced that negotiations had failed, and the Tupelo plant would close the following year.\nWhile operations were wound down in Tupelo, Pentair continued to expand its water products business.\nIn July 2004, Pentair bought WICOR Industries, the former water systems subsidiary of Wisconsin Energy, for $850 million. WICOR made water pumps, filters, and pool equipment components under the Sta-Rite, SHURflo, and Hypro brands. To help offset this purchase it sold its entire tool operation to Stanley Black & Decker that October. This marked Pentair's exit from the tool business.\nIn 2005, Pentair bought some of the assets of APW for $144 million, including McLean Thermal Management, Aspen Motion Technologies, and Electronic Solutions, all of which provide thermal management products and integration services to the telecom, medical, and security industries. This broadened Pentair's technical products line to include markets outside of the traditional electrical and electronics businesses.\nIn 2006, Pentair purchased Germany-based Jung Pumpen GmbH, which makes pumps and other products for wastewater processing. The deal was completed in early 2007 for $227 million.\nOther acquisitions in 2005 and 2006 included Acu-Trol, Inc., Delta Environmental Products, selected assets of Krystal Klear, and a 70% stake in Beijing Jieming Tiandi Environmental Equipment (which was later renamed to Beijing Pentair Water Jieming), which produces fiberglass-reinforced pressure tanks and filters.\nThe company has announced an agreement to acquire water filtration and separation firm Porous Media for approximately $225 million. It has said that it plans to continue an active course of acquisitions, especially to grow its business outside the American market.\n\n2010s\nIn 2012, Pentair Inc. (PNR) and Tyco International Ltd. (TYC)’s flow control business formally combined to create Pentair Ltd. The new company is described as a global manufacturer of “water and fluid solutions, valves and controls, equipment protection and thermal management products\". Tyco shareholders now own approximately 52.5% and former Pentair Inc. shareholders own approximately 47.5% of Pentair Ltd. Following this merger the new company was based in Schaffhausen, Switzerland, with 30,000 employees and 100 manufacturing plants in 30 countries. Currently the headquarters are in Worsley, United Kingdom.\nIn August 2016, Pentair announced that it has entered into an agreement to sell the Valves & Controls business to Emerson, an American diversified global industrial company based in St. Louis, Missouri.  The transaction was completed in April 2017.\nIn July 2022, Pentair announced that it had acquired Manitowoc Ice for $1.6 billion.\n\nDiscontinued operations\nPentair has discontinued its Century/Lincoln and Lincoln Industrial service equipment operations. It also exited the tools business with the sale of its power tools group (which had previously accounted for 40% of sales) in October 2004 to Black & Decker for nearly $800 million.\n\nSeparation of nVent\nIn May 2018, Pentair created a sequel company to take control of its electrical division named nVent. The electrical division of Pentair did more than $2.1 billion in revenue in 2016. Pentair 2 went public on the NYSE on May 1, 2018.\n\nReferences\nExternal links\nBusiness data for Pentair:",
  "clean_text": "Pentair plc (PNR) is an American water treatment company incorporated in Ireland with tax residency in UK, with its main U.S. office in Golden Valley, Minnesota. Pentair was founded in the US, with 65% of company's revenue coming from the US and Canada as of 2017. PNR was reorganized in 2014, shifting the corporate domicile from Switzerland to Ireland. On April 30, 2018, PNR announced that it had completed the separation of its Water and Electrical businesses. Now the company's primary focus is on residential, commercial, industrial, municipal and infrastructure and agriculture applications. Its fiscal year 2021 revenues were US$3.8 billion and it employs approximately 11,250 people worldwide. History 1960s Pentair was founded in August 1966 as Pentair Industries, Inc., with the name derived from the Greek root word \"penta-\" (alluding to the company's five founders) and \"air\" (alluding to the company's original product), and went public several months later. The 5 founders were all formerly employed by Litton Industries. Originally, they intended to manufacture high altitude research balloons, but they found sales to be less than expected. They acquired a local vacuum-forming business shortly thereafter and set about making canoes. This venture also met with less than expected sales. By 1968 the company was nearly bankrupt. Of the five original founders, one had died while three more had pulled out. The only remaining founder, Murray Harpole, brought in an outside investor, Ben Westby and they set about purchasing Peavey Paper Mills, Inc. The company was deeply in debt and badly managed, but the sale price was very inexpensive and Harpole believed that proper management would turn the company around in short order. 1970s The company continued to diversify but none of its other ventures proved as successful as the paper industry. It continued to expand in that area and acquired Niagara Paper in 1972. Miami Paper was purchased in 1974 and Flambeau Paper Corporation followed in 1978. The Peavey plant would be sold in 1976 because Pentair had outgrown it. While Westby departed in 1976, D. Eugene Nugent was brought in to expand the management team. 1980s In 1981, Pentair acquired Rockwell International's power hand tool factory from its Power Tool Division. Rockwell had purchased Porter-Cable in 1960 and merged it into the Power Tool Division but kept manufacturing in a separate facility. The Porter-Cable name had been retired in 1965 but Pentair had not licensed the Rockwell name, so the Porter-Cable name was revived. In 1984 Pentair purchased the remains of the Power Tool Division from Rockwell. This consisted chiefly of the Delta line of shop tools and marked Rockwell's exit from the tool business. In 1988, Pentair agreed to acquire FC Holdings Inc., the holding company for Federal Cartridge and Hoffman Engineering, for $175 million in cash and the assumption of debt. Pentair would not hold Federal Cartridge for a long time, but the purchase of Hoffman Engineering was the start of a prosperous era of enclosures manufacturing for Pentair. 1990s Pentair expanded its water product business, acquiring the Fleck Controls control valve business in November 1995. In August 1997, Pentair acquired the General Signal Pump Group. Pentair sold off its papermaking business to Consolidated Papers Inc. in 1997. While paper had been the backbone of Pentair's business it only amounted to about 10% of their revenue at the time of the sale. In August 1999, Pentair bought the DeVilbiss Air Power Company for $460 million in cash. DeVilbiss makes air compressors, pressure washers and generators, which complemented to Pentair's professional Pneumatics tools that were powered by air compressors such as DeWalt and Porter-Cable. In 1999 under chairman, president, and chief executive officer, Winslow H. Buxton, Pentair made a series of acquisitions. In April 1999, PNR purchased Essef, the global leader in the manufacture of composite water tanks, pumps, filters, and other water equipment used in pools and spas, for the cash-equivalent price of approximately $312 million. Later that year, Pentair decided to consolidate its power tool business. The Porter-Cable and Delta Divisions had previously operated across four different cooperate, warehouse, and manufacturing facilities in three states. While the Delta manufacturing facility in Tupelo Mississippi would remain independent everything else would be consolidated into a new facility built next to the existing Porter-Cable plant in Jackson, Tennessee. The new facility came online in February 2000 and was an immediate disaster. 2000s The decade started extremely poorly for Pentair. The botched opening of its new corporate office and distribution center in Jackson caused an immediate drop in revenue as the shipping facility encountered numerous issues. Orders shipped late, with incorrect products, or not at all. Complaints rose, sales fell, and returns poured in. By the end of the year, the entire management team in Jackson would be fired. It took almost three years to sort out the mess and return the Delta and Porter-Cable lines to profitability. This caused Pentair to further review its holdings and look at ways to cut costs. It expanded its production in Taiwan and started to negotiate with the union of its Delta manufacturing facility to reduce payroll. In 2003 it was announced that negotiations had failed, and the Tupelo plant would close the following year. While operations were wound down in Tupelo, Pentair continued to expand its water products business. In July 2004, Pentair bought WICOR Industries, the former water systems subsidiary of Wisconsin Energy, for $850 million. WICOR made water pumps, filters, and pool equipment components under the Sta-Rite, SHURflo, and Hypro brands. To help offset this purchase it sold its entire tool operation to Stanley Black & Decker that October. This marked Pentair's exit from the tool business. In 2005, Pentair bought some of the assets of APW for $144 million, including McLean Thermal Management, Aspen Motion Technologies, and Electronic Solutions, all of which provide thermal management products and integration services to the telecom, medical, and security industries. This broadened Pentair's technical products line to include markets outside of the traditional electrical and electronics businesses. In 2006, Pentair purchased Germany-based Jung Pumpen GmbH, which makes pumps and other products for wastewater processing. The deal was completed in early 2007 for $227 million. Other acquisitions in 2005 and 2006 included Acu-Trol, Inc., Delta Environmental Products, selected assets of Krystal Klear, and a 70% stake in Beijing Jieming Tiandi Environmental Equipment (which was later renamed to Beijing Pentair Water Jieming), which produces fiberglass-reinforced pressure tanks and filters. The company has announced an agreement to acquire water filtration and separation firm Porous Media for approximately $225 million. It has said that it plans to continue an active course of acquisitions, especially to grow its business outside the American market. 2010s In 2012, Pentair Inc. (PNR) and Tyco International Ltd. (TYC)’s flow control business formally combined to create Pentair Ltd. The new company is described as a global manufacturer of “water and fluid solutions, valves and controls, equipment protection and thermal management products\". Tyco shareholders now own approximately 52.5% and former Pentair Inc. shareholders own approximately 47.5% of Pentair Ltd. Following this merger the new company was based in Schaffhausen, Switzerland, with 30,000 employees and 100 manufacturing plants in 30 countries. Currently the headquarters are in Worsley, United Kingdom. In August 2016, Pentair announced that it has entered into an agreement to sell the Valves & Controls business to Emerson, an American diversified global industrial company based in St. Louis, Missouri. The transaction was completed in April 2017. In July 2022, Pentair announced that it had acquired Manitowoc Ice for $1.6 billion. Discontinued operations Pentair has discontinued its Century/Lincoln and Lincoln Industrial service equipment operations. It also exited the tools business with the sale of its power tools group (which had previously accounted for 40% of sales) in October 2004 to Black & Decker for nearly $800 million. Separation of nVent In May 2018, Pentair created a sequel company to take control of its electrical division named nVent. The electrical division of Pentair did more than $2.1 billion in revenue in 2016. Pentair 2 went public on the NYSE on May 1, 2018."
}