{
  "ticker": "PNW",
  "cik": "0000764622",
  "company_name": "Pinnacle West Capital",
  "corrected_name": "Pinnacle West Capital",
  "wiki_title_used": "Pinnacle West Capital",
  "exists": true,
  "raw_text": "Pinnacle West Capital Corporation is an American utility holding company that owns Arizona Public Service (APS). It is publicly traded on the New York Stock exchange and a component of the S&P 500 stock market index. APS is the largest utility company in Arizona and is regulated by the Arizona Corporation Commission (ACC).\n\nHistory\nIn 1884, the Phoenix Light and Fuel Company was formed to provide electricity and heat to the people of the three-year-old town of Phoenix. In 1901, it built two hydroelectric power stations to provide power to Phoenix.\nIt changed its name to Pacific Gas and Electric Company in 1906 and to Central Arizona Light and Power in 1920. The Childs-Irving Hydroelectric Facilities, began producing power in 1909 to support local mining operations. The company began paid an annual dividend from 1920 to 1989 without interruption.\nThe company became a subsidiary of the giant conglomerate American Power and Light in 1925, but became an independent company once again in 1945.  In 1949, it merged with Northern Arizona Power and Light.  In 1952, it merged with Arizona Edison and changed its name to Arizona Public Service.\nThe stock doubled in price through the long bear market of the 1970s, while paying a 10% dividend yield. By then it had become an electric and natural gas utility fueled 94.4% by coal plants, 5.2% by natural gas, and 0.4% by oil. The company traded its common stock on the New York Stock Exchange, and in 1976, the company issued a preferred stock (formerly NYSE: PR ARP PR) with a 10.5% dividend, callable in 1990.\nAPS also performed well through the early 1980s recession, reaching peak earnings of over US$255 million in 1983. However, by then the company had accumulated over US$2.1 billion in long-term debt.\nIn 1982, APS issued another preferred stock (formerly NYSE: PR O ARP PR O) with an 11.9% dividend, callable in 1987. And in 1983, it issued a third preferred stock (formerly NYSE: PR Q ARP PR Q) paying an adjustable rate between 6 and 12%, through 1986.\n1984 was a down year for both earnings and the stock price, which at its low that year had lost almost half its value from the 1983 peak.\nIn February 1985, Arizona Public Service Company reorganized as a holding company, AZP Group Inc., with APS as the leading subsidiary. It traded under the ticker symbol AZP. 1985 earnings reached a new record high at almost US$290 million, and by the end of the year the stock price had doubled from its 1984 low.\nIn 1987, AZP Group changed its name to Pinnacle West Capital Corporation, and began trading under the new ticker symbol PNW. The utility continued to operate as its principal subsidiary. By then Pinnacle's long-term debt had grown to almost US$2.4 billion. Earnings had declined to US$260 million in 1986, but were recovering by the end 1987. However, the stock price reached an all-time peak that year, which was not surpassed for the next decade, as the company ran into troubles through the early 1990s.  In 1986, Pinnacle acquired MeraBank, a savings and loan association.  It grew to become Arizona's largest thrift, with $6.5 billion in assets.  However, the thrift was seized by federal regulators in January 1990, due in part to the deterioration in prices in the Arizona real estate market.\nBy 1990, the company's earnings had fallen to under US$100 million, as it struggled through the 1990-1991 recession, as well as a series of failed attempts to diversify. By 1991, the company was facing a loss of almost US$190 million, and discontinued paying its dividend. APS and its predecessors had paid a dividend without interruption since 1920. The stock price plunged 85% from its 1987 peak, to its lowest level in over twenty years. Its long-term debt by then reached over US$2.5 billion.\nHowever, by 1992, the company returned to profitability, as earnings  recovered to over US$150 million. The stock price tripled from its 1991 low by the end of 1993. The company reinstated its dividend that year.\nThe company faced a variety of regulatory disputes due to its operation of Palo Verde and treatment of whistleblowers. It was ordered by the Department of Labor to pay a whistleblower $50,000 in compensation. In 1993, a similar incident resulted in additional compensation for another employee.\nBy 1995, Pinnacle West Capital had been added to the S&P MidCap 400 index. That year, earnings surpassed US$200 million again, and by early the next year the stock price began approaching its old 1987 high. Also in 1995, the utility subsidiary Arizona Public Services issued 30-year Monthly Income Debt Securities paying 10%.\nThe first solar plant in Arizona was opened by Pinnacle West in Flagstaff in 1997.\nIn the wake of the Enron scandal, Pinnacle West lost over $13 million dollars. This represents 25% of their expected earnings for that quarter. \nPrior to 2010, Pinnacle West developed real estate through its Suncor subsidiary.\n On September 8, 2011, there was a widespread power outage affecting a region spreading west from Yuma, Arizona, to San Diego, California, and affecting parts of Northern Mexico. The outage was the result of 23 events that occurred on five power grids in a span of 11 minutes including the APS North Gila Substation.\nFederal, regional and local officials are investigating what happened and why the outage cascaded the way it did.  \nMost of the areas affected were served by San Diego Gas & Electric, which saw its entire service area lose power.\nThe outage appears to have been caused by the actions of an APS employee in the North Gila substation, and it is unknown why safeguards did not keep the outage limited to the Yuma area.\nThe outage occurred days before the tenth anniversary of the September 11 attacks, and hours before the United States Department of Homeland Security warned of a potential terrorist attack leading up to the anniversary, but the Federal Bureau of Investigation and SDG&E early in their investigations ruled out terrorism.\nOn July 7, 2014, APS agreed to a $3.25 million settlement with NERC and FERC related to the September 2011 blackout.\nOn September 7, 2018, APS cut off the power to 72-year-old retiree Stephanie Pullman, due to a $51 overdue electric bill. The same day, the temperature in Phoenix hit 107 째F (42 째C). Within a week, Pullman had died from heat exposure. Her death sparked statewide media coverage and street protests over APS's disconnect policy. The incident led to Arizona regulators banning power shutoffs on hot summer days.\n\nService territory\nAPS serves about two-thirds of the Phoenix metropolitan area.  It primarily serves downtown and northern Phoenix, a large swath to the north and west of the city, and the downtown areas of Chandler, Gilbert, Glendale, Peoria, Scottsdale and Tempe. Outside of the Valley, it serves Flagstaff, Prescott, Yuma and Douglas.\n\nPower Plants\nPinnacle West owns and operates a number of power plants through its Arizona Public Service company which it wholly owns. Most of the power Pinnacle West supplies, as well as most of the power for the state of Arizona, is generated by these plants.\n\nCoal\nPinnacle West owns three coal plants Cholla Power Plant, Four Corners Generating Station, and Navajo Generating Station (operated by Salt River Project).  The coal is primarily supplied by long-term leases from landowners in the Navajo Nation. The Navajo generating plant ceased operations in 2019, with the site remediated and the land turned over to the Navajo Nation in March of 2024. Cholla ceased operations in March 2025. In 2023, Four corners began seasonally operating at half capacity and operating at full capacity during the summer which is the peak season for energy demand in the Arizona market. This has resulted in the Arizona energy market consuming hundreds of MWh less of coal produced energy.\n\nNuclear\nPinnacle West operates and partially owns the Palo Verde Nuclear Generating Station. Pinnacle West has been in lawsuits with the Department of Energy over the Yucca Mountain nuclear waste repository since 2003. In 2023, the Department of Energy approved its ninth settlement with Pinnacle West all these settlements have totaled $36 million in awarded damages for Pinnacle West. The plant has enough storage for spent fuel to store its waste through 2047.\n\nNatural Gas\nPinnacle West owns and operates six natural gas or oil based energy generators. In 2019, it completed modernizing Ocotillo, one of the gas based plants resulting in an increase from 290MW to 690MW.\n\nSolar\nPinnacle West owns and operates two utility scale solar systems as well as thirty small scale facilitates. AZ Sun received $675 million in Pinnacle West investment and provides up to 180MW. Red Rock solar plant produces 44MW which are sold for energy credits to institutional buyers. Small scale facilities are expanding to Pinnacle West owned systems government owned rooftops and residential programs.\nPinnacle West spent millions in lobbying dollars during 2012 election of ACC. This campaign was part of a larger effort to reduce net metering. In 2017, this resulted in the complete stoppage of net metering.\n\nPlanned\nPinnacle West plans to build 1200MW of energy storage. This would be nearly all of Arizona's energy storage capacity. Pinnacle West has plans to increase renewable energy production by 50% of its 2023 level by 2025.\n\nSee also\nPath 46, also called West of Colorado River, Arizona-California West-of-the-River Path (WOR)\nPalo Verde Nuclear Generating Station\nFour Corners Generating Station\n\nReferences\nExternal links\nOfficial website\nBusiness data for Pinnacle West Capital:",
  "clean_text": "Pinnacle West Capital Corporation is an American utility holding company that owns Arizona Public Service (APS). It is publicly traded on the New York Stock exchange and a component of the S&P 500 stock market index. APS is the largest utility company in Arizona and is regulated by the Arizona Corporation Commission (ACC). History In 1884, the Phoenix Light and Fuel Company was formed to provide electricity and heat to the people of the three-year-old town of Phoenix. In 1901, it built two hydroelectric power stations to provide power to Phoenix. It changed its name to Pacific Gas and Electric Company in 1906 and to Central Arizona Light and Power in 1920. The Childs-Irving Hydroelectric Facilities, began producing power in 1909 to support local mining operations. The company began paid an annual dividend from 1920 to 1989 without interruption. The company became a subsidiary of the giant conglomerate American Power and Light in 1925, but became an independent company once again in 1945. In 1949, it merged with Northern Arizona Power and Light. In 1952, it merged with Arizona Edison and changed its name to Arizona Public Service. The stock doubled in price through the long bear market of the 1970s, while paying a 10% dividend yield. By then it had become an electric and natural gas utility fueled 94.4% by coal plants, 5.2% by natural gas, and 0.4% by oil. The company traded its common stock on the New York Stock Exchange, and in 1976, the company issued a preferred stock (formerly NYSE: PR ARP PR) with a 10.5% dividend, callable in 1990. APS also performed well through the early 1980s recession, reaching peak earnings of over US$255 million in 1983. However, by then the company had accumulated over US$2.1 billion in long-term debt. In 1982, APS issued another preferred stock (formerly NYSE: PR O ARP PR O) with an 11.9% dividend, callable in 1987. And in 1983, it issued a third preferred stock (formerly NYSE: PR Q ARP PR Q) paying an adjustable rate between 6 and 12%, through 1986. 1984 was a down year for both earnings and the stock price, which at its low that year had lost almost half its value from the 1983 peak. In February 1985, Arizona Public Service Company reorganized as a holding company, AZP Group Inc., with APS as the leading subsidiary. It traded under the ticker symbol AZP. 1985 earnings reached a new record high at almost US$290 million, and by the end of the year the stock price had doubled from its 1984 low. In 1987, AZP Group changed its name to Pinnacle West Capital Corporation, and began trading under the new ticker symbol PNW. The utility continued to operate as its principal subsidiary. By then Pinnacle's long-term debt had grown to almost US$2.4 billion. Earnings had declined to US$260 million in 1986, but were recovering by the end 1987. However, the stock price reached an all-time peak that year, which was not surpassed for the next decade, as the company ran into troubles through the early 1990s. In 1986, Pinnacle acquired MeraBank, a savings and loan association. It grew to become Arizona's largest thrift, with $6.5 billion in assets. However, the thrift was seized by federal regulators in January 1990, due in part to the deterioration in prices in the Arizona real estate market. By 1990, the company's earnings had fallen to under US$100 million, as it struggled through the 1990-1991 recession, as well as a series of failed attempts to diversify. By 1991, the company was facing a loss of almost US$190 million, and discontinued paying its dividend. APS and its predecessors had paid a dividend without interruption since 1920. The stock price plunged 85% from its 1987 peak, to its lowest level in over twenty years. Its long-term debt by then reached over US$2.5 billion. However, by 1992, the company returned to profitability, as earnings recovered to over US$150 million. The stock price tripled from its 1991 low by the end of 1993. The company reinstated its dividend that year. The company faced a variety of regulatory disputes due to its operation of Palo Verde and treatment of whistleblowers. It was ordered by the Department of Labor to pay a whistleblower $50,000 in compensation. In 1993, a similar incident resulted in additional compensation for another employee. By 1995, Pinnacle West Capital had been added to the S&P MidCap 400 index. That year, earnings surpassed US$200 million again, and by early the next year the stock price began approaching its old 1987 high. Also in 1995, the utility subsidiary Arizona Public Services issued 30-year Monthly Income Debt Securities paying 10%. The first solar plant in Arizona was opened by Pinnacle West in Flagstaff in 1997. In the wake of the Enron scandal, Pinnacle West lost over $13 million dollars. This represents 25% of their expected earnings for that quarter. Prior to 2010, Pinnacle West developed real estate through its Suncor subsidiary. On September 8, 2011, there was a widespread power outage affecting a region spreading west from Yuma, Arizona, to San Diego, California, and affecting parts of Northern Mexico. The outage was the result of 23 events that occurred on five power grids in a span of 11 minutes including the APS North Gila Substation. Federal, regional and local officials are investigating what happened and why the outage cascaded the way it did. Most of the areas affected were served by San Diego Gas & Electric, which saw its entire service area lose power. The outage appears to have been caused by the actions of an APS employee in the North Gila substation, and it is unknown why safeguards did not keep the outage limited to the Yuma area. The outage occurred days before the tenth anniversary of the September 11 attacks, and hours before the United States Department of Homeland Security warned of a potential terrorist attack leading up to the anniversary, but the Federal Bureau of Investigation and SDG&E early in their investigations ruled out terrorism. On July 7, 2014, APS agreed to a $3.25 million settlement with NERC and FERC related to the September 2011 blackout. On September 7, 2018, APS cut off the power to 72-year-old retiree Stephanie Pullman, due to a $51 overdue electric bill. The same day, the temperature in Phoenix hit 107 째F (42 째C). Within a week, Pullman had died from heat exposure. Her death sparked statewide media coverage and street protests over APS's disconnect policy. The incident led to Arizona regulators banning power shutoffs on hot summer days. Service territory APS serves about two-thirds of the Phoenix metropolitan area. It primarily serves downtown and northern Phoenix, a large swath to the north and west of the city, and the downtown areas of Chandler, Gilbert, Glendale, Peoria, Scottsdale and Tempe. Outside of the Valley, it serves Flagstaff, Prescott, Yuma and Douglas. Power Plants Pinnacle West owns and operates a number of power plants through its Arizona Public Service company which it wholly owns. Most of the power Pinnacle West supplies, as well as most of the power for the state of Arizona, is generated by these plants. Coal Pinnacle West owns three coal plants Cholla Power Plant, Four Corners Generating Station, and Navajo Generating Station (operated by Salt River Project). The coal is primarily supplied by long-term leases from landowners in the Navajo Nation. The Navajo generating plant ceased operations in 2019, with the site remediated and the land turned over to the Navajo Nation in March of 2024. Cholla ceased operations in March 2025. In 2023, Four corners began seasonally operating at half capacity and operating at full capacity during the summer which is the peak season for energy demand in the Arizona market. This has resulted in the Arizona energy market consuming hundreds of MWh less of coal produced energy. Nuclear Pinnacle West operates and partially owns the Palo Verde Nuclear Generating Station. Pinnacle West has been in lawsuits with the Department of Energy over the Yucca Mountain nuclear waste repository since 2003. In 2023, the Department of Energy approved its ninth settlement with Pinnacle West all these settlements have totaled $36 million in awarded damages for Pinnacle West. The plant has enough storage for spent fuel to store its waste through 2047. Natural Gas Pinnacle West owns and operates six natural gas or oil based energy generators. In 2019, it completed modernizing Ocotillo, one of the gas based plants resulting in an increase from 290MW to 690MW. Solar Pinnacle West owns and operates two utility scale solar systems as well as thirty small scale facilitates. AZ Sun received $675 million in Pinnacle West investment and provides up to 180MW. Red Rock solar plant produces 44MW which are sold for energy credits to institutional buyers. Small scale facilities are expanding to Pinnacle West owned systems government owned rooftops and residential programs. Pinnacle West spent millions in lobbying dollars during 2012 election of ACC. This campaign was part of a larger effort to reduce net metering. In 2017, this resulted in the complete stoppage of net metering. Planned Pinnacle West plans to build 1200MW of energy storage. This would be nearly all of Arizona's energy storage capacity. Pinnacle West has plans to increase renewable energy production by 50% of its 2023 level by 2025."
}