{
  "ticker": "POOL",
  "cik": "0000945841",
  "company_name": "Pool Corporation",
  "corrected_name": "Pool Corporation",
  "wiki_title_used": "Pool Corporation",
  "exists": true,
  "raw_text": "Pool Corporation, doing business as POOLCORP, is the largest distributor of supplies, equipment, and machinery for swimming pools worldwide. The company is organized in Delaware and headquartered in Covington, Louisiana. It serves approximately 125,000 customers and operates 439 sales centers in North America, Europe and Australia. The company receives over half of its revenue from the California, Texas, Florida, and Arizona markets and has benefited from population shifts to warmer climates. In 2023, the company received 62% of its revenue from maintenance and minor repair products, 24% of its revenue from products used in pool renovations, and 14% of its revenue from products used in pool construction.\n\nHistory\nPool Corporation was founded in 1980 as South Central Pool Supply by Frank J. St. Romain.\nIn 1993, the company was purchased by Code Hennessey's & Simmons. In 1995, the company was renamed SCP Pool Corporation and became a public company via an initial public offering. The company was renamed Pool Corporation on May 16, 2006.\nIn 1999, the company acquired Benson Pump Company, Pratts Plastics Limited, certain assets of Garden Leisure Products, and Jean Albouy, S.A. for a total of $25.5 million.\nThe company's business improved significantly during the COVID-19 lockdowns due to an increase in pool construction. However, sales slowed when the lockdowns ended. \nIn 2021, the company acquired Porpoise Pool & Patio, the largest franchisor of pool and outdoor living stores in the U.S.\nOn October 28, 2025, POOLCORP rang the Opening Bell at Nasdaq MarketSite in Times Square, celebrating its 30th anniversary as a publicly traded company.\n\nControversies\nIn 2011, the company was accused by the Federal Trade Commission of antitrust practices by pressuring its suppliers to not conduct business with its competitors. In January 2012, the company settled with a consent order which prohibited the company from continuing the practice.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Pool Corporation:",
  "clean_text": "Pool Corporation, doing business as POOLCORP, is the largest distributor of supplies, equipment, and machinery for swimming pools worldwide. The company is organized in Delaware and headquartered in Covington, Louisiana. It serves approximately 125,000 customers and operates 439 sales centers in North America, Europe and Australia. The company receives over half of its revenue from the California, Texas, Florida, and Arizona markets and has benefited from population shifts to warmer climates. In 2023, the company received 62% of its revenue from maintenance and minor repair products, 24% of its revenue from products used in pool renovations, and 14% of its revenue from products used in pool construction. History Pool Corporation was founded in 1980 as South Central Pool Supply by Frank J. St. Romain. In 1993, the company was purchased by Code Hennessey's & Simmons. In 1995, the company was renamed SCP Pool Corporation and became a public company via an initial public offering. The company was renamed Pool Corporation on May 16, 2006. In 1999, the company acquired Benson Pump Company, Pratts Plastics Limited, certain assets of Garden Leisure Products, and Jean Albouy, S.A. for a total of $25.5 million. The company's business improved significantly during the COVID-19 lockdowns due to an increase in pool construction. However, sales slowed when the lockdowns ended. In 2021, the company acquired Porpoise Pool & Patio, the largest franchisor of pool and outdoor living stores in the U.S. On October 28, 2025, POOLCORP rang the Opening Bell at Nasdaq MarketSite in Times Square, celebrating its 30th anniversary as a publicly traded company. Controversies In 2011, the company was accused by the Federal Trade Commission of antitrust practices by pressuring its suppliers to not conduct business with its competitors. In January 2012, the company settled with a consent order which prohibited the company from continuing the practice."
}