{
  "ticker": "PPG",
  "cik": "0000079879",
  "company_name": "PPG Industries",
  "corrected_name": "PPG Industries",
  "wiki_title_used": "PPG Industries",
  "exists": true,
  "raw_text": "PPG Industries, Inc. is an American supplier of paints, coatings, and specialty materials based in Pittsburgh, Pennsylvania. It operates in more than 70 countries globally. A member of the Fortune 500, PPG is the second largest coatings company in the world by revenue, behind Sherwin-Williams. It is headquartered in PPG Place, an office and retail complex in downtown Pittsburgh, and is known for its glass facade designed by Postmodern architect Philip Johnson.\n\nHistory\n19th century\nPittsburgh Plate Glass Company was founded in 1883 by Captain John Baptiste Ford and John Pitcairn, Jr., at Creighton, Pennsylvania.\nPPG soon became the United States' first commercially successful producer of high-quality, thick flat glass using the plate process. PPG was also the world's first plate glass plant to power its furnaces with locally produced natural gas, an innovation which rapidly stimulated widespread industrial use of the cleaner-burning fuel.\nPPG expanded quickly. By 1900, known as the \"Glass Trust\", it included 10 plants, had a 65 percent share of the U.S. plate glass market, and had become the nation's second largest producer of paint. Today, known as PPG Industries, the company is a multibillion-dollar, Fortune 500 corporation with 150 manufacturing locations around the world. It now produces coatings, glass, fiberglass, and other chemicals.\nPitcairn served as a director of PPG from its start, its president from 1897 to 1905, and chairman of the board from 1894 until his death in 1916.\n\n20th century\nDitzler Color Company, established in 1902 in Detroit as an automotive color concern, was purchased by Pittsburgh Plate Glass Company (now PPG) in 1928. On December 19, 1968, the company changed its name to PPG Industries, Inc., to show its diverse offerings. In the mid-1980s, Cipisa, a Spanish paint company was acquired and renamed PPG Ibérica and its CEO, Pere Nadal Carres, became CEO of PPG Ibérica. In 1990 PPG founded Transitions Optical as a joint venture with Essilor.\nIn October 2000, PPG Industries announced it had agreed to buy Courtaulds Aerospace for $512.5 million. Based in Glendale, California, the aerospace business has annual sales of approximately $240 million, employs 1,200 people. It manufactures sealants in Glendale, California and Shildon, England; coatings and sealants in Mojave, California; glazing sealants at Gloucester City, New Jersey; and coatings at Gonfreville, France. The business also operates 14 application-support centers located in North America, Europe, Africa, Asia, and Australia.\n\n21st century\n2000s\nIn 2006, the company rolled out a two-tiered pay system which resulted in massive strikes at union locations across the country. The system, now in place company-wide for non-salaried employees, provides lower rates of pay and fewer benefits to those employed after the roll-out than those employed before the roll-out. In West Virginia, after a bitter five-month strike, the company still refused to eliminate the two-tiered system. In Lake Charles, Louisiana, the employment contracts of union employees had to be extended during a strike regarding the two-tiered system.\nIn 2007, the company was involved in a lawsuit on failing to disclose a purchase reduction of its two major auto glass customers.\nIn 2007, PPG in Australia acquired Barloworld, producer of the Taubmans, Bristol and White Knight brands of paint.\nOn January 2, 2008, PPG acquired the SigmaKalon Group of companies for $3.2 billion from private investment firm Bain Capital, strongly increasing its paint and specialty coatings business.\nIn 2008, PPG renamed their automotive glass division PGW (Pittsburgh Glass Works) and sold a majority of it to Kohlberg & Company. PPG retained 40% ownership of PGW until March 2016 when they sold their stake to automotive parts salvage company LKQ Corporation.\n\n2010s\nIn 2012, PPG acquired Dyrup A/S, founded in Denmark in 1928 as S. Dyrup & Co A/S by Sigurd Dyrup and Axel Monberg and Ejnar Thorsen of MT Højgaard, some of whose brands are Dyrup, GORI (outdoor woodcare paint), and Bondex.\nIn April 2013, PPG completed the acquisition of AkzoNobel North American architectural coatings business including Glidden, Liquid Nails, and Flood brands. 2013 revenue was US$15.1 billion, while assets were US$15.9 billion.\nOn April 1, 2014, PPG finalized the sale of Transitions Optical to its joint venture partner, Essilor International of France; however, PPG's technical center in Monroeville will continue to provide research and development services for Transitions. On November 5, 2014, PPG closed a deal, to purchase Mexican Consorcio Comex, S.A. de C.V. (\"Comex\") for $2.3 billion \nIn April 2015, PPG Industries completed the acquisition of REVOCOAT, a global supplier of sealants. Chuck Bunch remains Executive Chairman, while Michael McGarry serves as President & CEO.\nIn July 2016, PPG announced its sale of the flat glass business to Vitro, a glass manufacturer based in Mexico, for $750 million.\nIn October 2016, Pittsburgh Post-Gazette announced the acquisition of the naming rights to Consol Energy Center by PPG; the facility will be known as PPG Paints Arena.\nIn September 2017, PPG announced the sale of its remaining fiberglass operations to Nippon Electric Glass for $541 million. This was following PPG's 2016 sale of its European fiberglass operations to NEG, and divesting its ownership in two other Asian fiberglass joint ventures.\n\nAttempted acquisition of AkzoNobel\nIn March 2017, the company launched an unsolicited takeover bid of €20.9 billion, which was promptly rejected by AkzoNobel's management. Days later, the company launched an increased bid of €24.5 billion, which was again rejected by AkzoNobel's management. A number of shareholders urged AkzoNobel to explore the offer and subsequent negotiations. In April, activist investor Elliott Investors called for the removal of the Chairman of Akzo, Antony Burgmans, following Akzo's refusal to enter talks with PPG. Elliott, which has a 3.25% stake in the company, claimed it was one of a group of investors that met the Dutch legal threshold of 10% voting-share support, which is needed to call an extraordinary meeting to vote on a proposal to remove Burgmans. On April 13, Templeton Global Equity said it was among another group of investors calling for an extraordinary meeting of AkzoNobel shareholders to discuss Burgmans' continued tenure as chairman. Later in the same month Akzo outlined its plan to separate its chemicals division and pay shareholders €1.6 billion in extra dividends, in order to attempt to hold off PPG. The new Akzo strategy was dismissed by PPG, which claimed that their offer represented better value for shareholders, supported by activist Akzo shareholder Elliot Advisors. On April 24, a day before Akzo's annual meeting of shareholders, PPG increased its final offer by approximately 8% to $28.8 billion (€26.9 billion, €96.75 per share), with Akzo's share price rising 6% to a record of €82.95 per share. Akzo shareholder Columbia Threadneedle Investments urged the company to open dialogue with PPG, whilst PPG claimed that the deal would add to earning within its first year. Great Britain's largest pension scheme investors, Universities Superannuation Scheme (USS), urged Akzo to engage with PPG. On May 2, Reuters revealed that the supervisory board of Akzo was meeting to discuss how to deal with PPG's third offer, still maintaining it did not value the company highly enough. In early May, Akzo again rejected PPG's bid, citing the deal still undervalues the company, as well as potentially facing antitrust risks, and not addressing other concerns such as \"cultural differences\". Under Dutch company law, PPG must now decide to either make a formal bid or walk away. In early June PPG chose to abandon pursuit.\n\n2020s\nIn 2020, PPG won an Adhesives and Sealants Council (ASC) Innovation Award for \"High Strength, Highly Ductile Structural Adhesive PR 2930\". In May 2021, PPG completed the acquisition of Wörwag, a German coating manufacturer.\nOn October 17, 2024, PPG announced its intent to sell its architectural coatings business in the U.S. and Canada to American Industrial Partners (AIP) for $550 million. Brands included in the sale are Glidden, Dulux (in Canada), Liquid Nails, Homax, Pittsburgh Paints and Stains, Flood, Sico and Manor Hall. The sale also includes 750 company owned retail stores, 6,600 independent dealer stores, and shelf facings at 8,100 retail and home improvement store locations.\nThe sale to AIP was completed on December 2, 2024, and included the consolidation of GLIDDEN, OLYMPIC, PITTSBURGH PAINTS & STAINS, LIQUID NAILS, Manor Hall, HOMAX, TRUEFINISH, MULCO, FLOOD, DULUX (in Canada), and SICO under the title of The Pittsburgh Paints Company.\n\nFinancial record\nPPG reported a net profit for each fiscal year in the period 2013 to 2022.\n\nEnvironmental record\nIn November 2010, PPG agreed to remove 700,000 tons of toxic waste from Canal Crossing, a brownfield site in Jersey City, New Jersey where the company operated a chromium processing plant between 1954 and 1963. Stringent standards were agreed to in a federal court settlement.\nLime Lake Reclamation Project of PPG Industries in Barberton, Ohio, received special awards in the National Beneficial Use of Biosolids Program from Environmental Protection Agency's (EPA) region 5 in 1998.\nAccording to the book Strangers in Their Own Land by Arlie Russell Hochschild, Pittsburgh Plate Glass ordered employees to dump toxic tar in Bayou D'Inde in Lake Charles, Louisiana.\n\nIn sports\nPPG has been involved in sports for numerous years, including being the primary sponsor for the CART Indy car series from 1980 to 1997. The company has been a partner of Team Penske in CART, IndyCar Series and NASCAR Cup Series since 1984. Since the race's inception in 1994, PPG has sponsored the trophy for the Brickyard 400. PPG also partners with Formula 1 racing teams; they have had a partnership with Williams F1 Team since 2017. PPG is the prime sponsor of John Force Racing and makes all their cars' paints and decals before each NHRA race.\nOn October 4, 2016, it was announced that The Consol Energy Center in Pittsburgh would be giving up its naming rights, and transferred to PPG, making the arena named the PPG Paints Arena. PPG has been involved in snooker since 2024, starting with the title sponsorship agreement with WST for the Tour Championship. The title sponsorship deal was then extended to the Triple Crown's Masters event until 2027 with its Johnstone's Paint brand. GORI, one of its sub-brands in Scandinavian countries, also sponsors the German Masters from 2025.\n\nLeadership\nPresident\nEdward Ford, 1883–1898\nJohn Pitcairn Jr., 1898–1905\nWilliam Lewis Clause, 1905–1916\nC. W. Brown, 1916–1928\nHarry S. Wherrett, 1928–1941\nRobert Lewis Clause, 1941–1944\nHarry B. Higgins, 1944–1955\nDavid G. Gill, 1955–1966\nRobinson F. Barker, 1966–1967\nJoseph A. Neubauer, 1967–1976\nJ. Earl Burrell, 1976–1984\nEdward J. Slack, 1984–\n\nChairman of the Board\nJohn Pitcairn Jr., 1898–1916\nWilliam L. Clause, 1916–1931\nClarence M. Brown, 1931–1955\nHarry B. Higgins, 1955–1957\nE. T. Asplundh, 1957–1966\nDavid G. Hill, 1966–1967\nRobinson F. Barker, 1967–1979\nL. Stanton Williams, 1979–1985\nVincent A. Sarni, 1985–\n\nSee also\nColumbia-Southern Chemical Corporation\nDimetcote\nSelf-cleaning glass\nTransitions Lenses, a joint venture since 1990.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for PPG Industries: \nPPG Corporate website",
  "clean_text": "PPG Industries, Inc. is an American supplier of paints, coatings, and specialty materials based in Pittsburgh, Pennsylvania. It operates in more than 70 countries globally. A member of the Fortune 500, PPG is the second largest coatings company in the world by revenue, behind Sherwin-Williams. It is headquartered in PPG Place, an office and retail complex in downtown Pittsburgh, and is known for its glass facade designed by Postmodern architect Philip Johnson. History 19th century Pittsburgh Plate Glass Company was founded in 1883 by Captain John Baptiste Ford and John Pitcairn, Jr., at Creighton, Pennsylvania. PPG soon became the United States' first commercially successful producer of high-quality, thick flat glass using the plate process. PPG was also the world's first plate glass plant to power its furnaces with locally produced natural gas, an innovation which rapidly stimulated widespread industrial use of the cleaner-burning fuel. PPG expanded quickly. By 1900, known as the \"Glass Trust\", it included 10 plants, had a 65 percent share of the U.S. plate glass market, and had become the nation's second largest producer of paint. Today, known as PPG Industries, the company is a multibillion-dollar, Fortune 500 corporation with 150 manufacturing locations around the world. It now produces coatings, glass, fiberglass, and other chemicals. Pitcairn served as a director of PPG from its start, its president from 1897 to 1905, and chairman of the board from 1894 until his death in 1916. 20th century Ditzler Color Company, established in 1902 in Detroit as an automotive color concern, was purchased by Pittsburgh Plate Glass Company (now PPG) in 1928. On December 19, 1968, the company changed its name to PPG Industries, Inc., to show its diverse offerings. In the mid-1980s, Cipisa, a Spanish paint company was acquired and renamed PPG Ibérica and its CEO, Pere Nadal Carres, became CEO of PPG Ibérica. In 1990 PPG founded Transitions Optical as a joint venture with Essilor. In October 2000, PPG Industries announced it had agreed to buy Courtaulds Aerospace for $512.5 million. Based in Glendale, California, the aerospace business has annual sales of approximately $240 million, employs 1,200 people. It manufactures sealants in Glendale, California and Shildon, England; coatings and sealants in Mojave, California; glazing sealants at Gloucester City, New Jersey; and coatings at Gonfreville, France. The business also operates 14 application-support centers located in North America, Europe, Africa, Asia, and Australia. 21st century 2000s In 2006, the company rolled out a two-tiered pay system which resulted in massive strikes at union locations across the country. The system, now in place company-wide for non-salaried employees, provides lower rates of pay and fewer benefits to those employed after the roll-out than those employed before the roll-out. In West Virginia, after a bitter five-month strike, the company still refused to eliminate the two-tiered system. In Lake Charles, Louisiana, the employment contracts of union employees had to be extended during a strike regarding the two-tiered system. In 2007, the company was involved in a lawsuit on failing to disclose a purchase reduction of its two major auto glass customers. In 2007, PPG in Australia acquired Barloworld, producer of the Taubmans, Bristol and White Knight brands of paint. On January 2, 2008, PPG acquired the SigmaKalon Group of companies for $3.2 billion from private investment firm Bain Capital, strongly increasing its paint and specialty coatings business. In 2008, PPG renamed their automotive glass division PGW (Pittsburgh Glass Works) and sold a majority of it to Kohlberg & Company. PPG retained 40% ownership of PGW until March 2016 when they sold their stake to automotive parts salvage company LKQ Corporation. 2010s In 2012, PPG acquired Dyrup A/S, founded in Denmark in 1928 as S. Dyrup & Co A/S by Sigurd Dyrup and Axel Monberg and Ejnar Thorsen of MT Højgaard, some of whose brands are Dyrup, GORI (outdoor woodcare paint), and Bondex. In April 2013, PPG completed the acquisition of AkzoNobel North American architectural coatings business including Glidden, Liquid Nails, and Flood brands. 2013 revenue was US$15.1 billion, while assets were US$15.9 billion. On April 1, 2014, PPG finalized the sale of Transitions Optical to its joint venture partner, Essilor International of France; however, PPG's technical center in Monroeville will continue to provide research and development services for Transitions. On November 5, 2014, PPG closed a deal, to purchase Mexican Consorcio Comex, S.A. de C.V. (\"Comex\") for $2.3 billion In April 2015, PPG Industries completed the acquisition of REVOCOAT, a global supplier of sealants. Chuck Bunch remains Executive Chairman, while Michael McGarry serves as President & CEO. In July 2016, PPG announced its sale of the flat glass business to Vitro, a glass manufacturer based in Mexico, for $750 million. In October 2016, Pittsburgh Post-Gazette announced the acquisition of the naming rights to Consol Energy Center by PPG; the facility will be known as PPG Paints Arena. In September 2017, PPG announced the sale of its remaining fiberglass operations to Nippon Electric Glass for $541 million. This was following PPG's 2016 sale of its European fiberglass operations to NEG, and divesting its ownership in two other Asian fiberglass joint ventures. Attempted acquisition of AkzoNobel In March 2017, the company launched an unsolicited takeover bid of €20.9 billion, which was promptly rejected by AkzoNobel's management. Days later, the company launched an increased bid of €24.5 billion, which was again rejected by AkzoNobel's management. A number of shareholders urged AkzoNobel to explore the offer and subsequent negotiations. In April, activist investor Elliott Investors called for the removal of the Chairman of Akzo, Antony Burgmans, following Akzo's refusal to enter talks with PPG. Elliott, which has a 3.25% stake in the company, claimed it was one of a group of investors that met the Dutch legal threshold of 10% voting-share support, which is needed to call an extraordinary meeting to vote on a proposal to remove Burgmans. On April 13, Templeton Global Equity said it was among another group of investors calling for an extraordinary meeting of AkzoNobel shareholders to discuss Burgmans' continued tenure as chairman. Later in the same month Akzo outlined its plan to separate its chemicals division and pay shareholders €1.6 billion in extra dividends, in order to attempt to hold off PPG. The new Akzo strategy was dismissed by PPG, which claimed that their offer represented better value for shareholders, supported by activist Akzo shareholder Elliot Advisors. On April 24, a day before Akzo's annual meeting of shareholders, PPG increased its final offer by approximately 8% to $28.8 billion (€26.9 billion, €96.75 per share), with Akzo's share price rising 6% to a record of €82.95 per share. Akzo shareholder Columbia Threadneedle Investments urged the company to open dialogue with PPG, whilst PPG claimed that the deal would add to earning within its first year. Great Britain's largest pension scheme investors, Universities Superannuation Scheme (USS), urged Akzo to engage with PPG. On May 2, Reuters revealed that the supervisory board of Akzo was meeting to discuss how to deal with PPG's third offer, still maintaining it did not value the company highly enough. In early May, Akzo again rejected PPG's bid, citing the deal still undervalues the company, as well as potentially facing antitrust risks, and not addressing other concerns such as \"cultural differences\". Under Dutch company law, PPG must now decide to either make a formal bid or walk away. In early June PPG chose to abandon pursuit. 2020s In 2020, PPG won an Adhesives and Sealants Council (ASC) Innovation Award for \"High Strength, Highly Ductile Structural Adhesive PR 2930\". In May 2021, PPG completed the acquisition of Wörwag, a German coating manufacturer. On October 17, 2024, PPG announced its intent to sell its architectural coatings business in the U.S. and Canada to American Industrial Partners (AIP) for $550 million. Brands included in the sale are Glidden, Dulux (in Canada), Liquid Nails, Homax, Pittsburgh Paints and Stains, Flood, Sico and Manor Hall. The sale also includes 750 company owned retail stores, 6,600 independent dealer stores, and shelf facings at 8,100 retail and home improvement store locations. The sale to AIP was completed on December 2, 2024, and included the consolidation of GLIDDEN, OLYMPIC, PITTSBURGH PAINTS & STAINS, LIQUID NAILS, Manor Hall, HOMAX, TRUEFINISH, MULCO, FLOOD, DULUX (in Canada), and SICO under the title of The Pittsburgh Paints Company. Financial record PPG reported a net profit for each fiscal year in the period 2013 to 2022. Environmental record In November 2010, PPG agreed to remove 700,000 tons of toxic waste from Canal Crossing, a brownfield site in Jersey City, New Jersey where the company operated a chromium processing plant between 1954 and 1963. Stringent standards were agreed to in a federal court settlement. Lime Lake Reclamation Project of PPG Industries in Barberton, Ohio, received special awards in the National Beneficial Use of Biosolids Program from Environmental Protection Agency's (EPA) region 5 in 1998. According to the book Strangers in Their Own Land by Arlie Russell Hochschild, Pittsburgh Plate Glass ordered employees to dump toxic tar in Bayou D'Inde in Lake Charles, Louisiana. In sports PPG has been involved in sports for numerous years, including being the primary sponsor for the CART Indy car series from 1980 to 1997. The company has been a partner of Team Penske in CART, IndyCar Series and NASCAR Cup Series since 1984. Since the race's inception in 1994, PPG has sponsored the trophy for the Brickyard 400. PPG also partners with Formula 1 racing teams; they have had a partnership with Williams F1 Team since 2017. PPG is the prime sponsor of John Force Racing and makes all their cars' paints and decals before each NHRA race. On October 4, 2016, it was announced that The Consol Energy Center in Pittsburgh would be giving up its naming rights, and transferred to PPG, making the arena named the PPG Paints Arena. PPG has been involved in snooker since 2024, starting with the title sponsorship agreement with WST for the Tour Championship. The title sponsorship deal was then extended to the Triple Crown's Masters event until 2027 with its Johnstone's Paint brand. GORI, one of its sub-brands in Scandinavian countries, also sponsors the German Masters from 2025. Leadership President Edward Ford, 1883–1898 John Pitcairn Jr., 1898–1905 William Lewis Clause, 1905–1916 C. W. Brown, 1916–1928 Harry S. Wherrett, 1928–1941 Robert Lewis Clause, 1941–1944 Harry B. Higgins, 1944–1955 David G. Gill, 1955–1966 Robinson F. Barker, 1966–1967 Joseph A. Neubauer, 1967–1976 J. Earl Burrell, 1976–1984 Edward J. Slack, 1984– Chairman of the Board John Pitcairn Jr., 1898–1916 William L. Clause, 1916–1931 Clarence M. Brown, 1931–1955 Harry B. Higgins, 1955–1957 E. T. Asplundh, 1957–1966 David G. Hill, 1966–1967 Robinson F. Barker, 1967–1979 L. Stanton Williams, 1979–1985 Vincent A. Sarni, 1985–"
}