{
  "ticker": "PPL",
  "cik": "0000922224",
  "company_name": "PPL Corporation",
  "corrected_name": "PPL Corporation",
  "wiki_title_used": "PPL Corporation",
  "exists": true,
  "raw_text": "PPL Corporation is an energy company headquartered in Allentown, Pennsylvania in the Lehigh Valley region of eastern Pennsylvania. The company is publicly traded on the New York Stock Exchange as NYSE: PPL and is part of the S&P 500. As of 2022, the company had $7.9 billion in revenue, 6,500 employees, over $37 billion in assets, and serves 3.6 million customers.\n\nHistory\n20th century\nPPL Corporation was founded as Pennsylvania Power & Light in 1920, the product of a merger of eight smaller Pennsylvania-based utility companies. It gradually extended its service territory to a crescent-shaped region of central and Northeastern Pennsylvania, stretching from Lancaster in central Pennsylvania through the Lehigh Valley in eastern Pennsylvania, and Scranton, and Wilkes-Barre in Northeastern Pennsylvania.\nIn 1995, the company reorganized as a holding company. PP&L Resources was renamed PPL Corporation in 2000.\nThe company limited its operations to Pennsylvania until deregulation of electrical utilities in the 1990s encouraged PPL to purchase assets in other states. The largest of these acquisitions was PPL's 1998 purchase of 13 plants from Montana Power Company, which added over 2,500 megawatts in capacity, representing the largest expansion in the company's history.\n\n21st century\nIn 2010, PPL completed the acquisition of two regulated Kentucky-based utilities, Louisville Gas & Electric in Louisville and Kentucky Utilities in Lexington.\nIn February 2010, PPL Corporation purchased the naming rights to the venue originally known as PPL Park, the home stadium of Major League Soccer's Philadelphia Union, in Chester, Pennsylvania. As part of the $25 million, 11-year deal, PPL EnergyPlus provided sustainable energy to PPL Park derived from other sources in Pennsylvania.\nAfter PPL spun off its non-regulated generation business into the separate Talen Energy, the stadium naming rights were assumed by the spinoff company and the venue became known as Talen Energy Stadium. In February 2020, the park was named Subaru Park.\nIn 2011, PPL completed the acquisition of two regulated regional electricity distribution companies in the United Kingdom. Along with two previously acquired regional electricity distribution companies, the company operates as Western Power Distribution (WPD).\nIn 2014, the company's hydroelectric facilities were sold to NorthWestern.\nOn June 6, 2014, PPL announced it would divest its electrical generation facilities to a newly formed company, Talen Energy.  On June 1, 2015, the Talen spinoff was completed, allowing PPL to concentrate on the transmission and distribution aspects of the electric utility business.\nIn 2020, PPL initiated a formal process to sell WPD in order to position PPL as a purely U.S.-focused energy company and create additional shareowner value. This resulted in a March 18, 2021, announcement of agreements to sell WPD to National Grid plc for £7.8 billion and acquire National Grid's Rhode Island electric and gas utility, the Narragansett Electric Company, for $3.8 billion. The sale of WPD was completed on June 14, 2021.\nThe sale of the Narragansett Electric Company was completed on May 25, 2022, and Narragansett Electric was renamed Rhode Island Energy.\nIn November 2019, William Spence, PPL's former chairman and chief executive officer, said that the company is focusing on building more advanced cleaner energy technologies and is also increasing its effort on a strategy known as \"Energy Forward.\" The company has invested billions to improve infrastructure and technology in order to create a smarter, more reliable and resilient energy grid. In the third quarter of 2019, PPL completed a $470 million investment in replacing meters with \"advanced\" meters in Pennsylvania.\nPPL owns the naming rights to the PPL Center in Allentown, which hosts the Lehigh Valley Phantoms of the American Hockey League starting with the 2014 season. PPL paid an undisclosed sum over ten years.\nPPL's companies regularly rank high in customer satisfaction studies. PPL Electric Utilities, which serves 1.4 million customers in 29 counties in Pennsylvania, has received 30 J.D. Power and Associates awards for customer satisfaction.\nLouisville Gas and Electric and Kentucky Utilities, which serves 1.3 million customers in nearly 100 counties across Kentucky and Virginia, has won 28 J.D. Power awards for customer satisfaction.\n\nPPL Building\nFor a century, the company had been headquartered at the PPL Building, which is the tallest building in Allentown and greater Lehigh Valley metropolitan area as of 2023. The 24-story building is 322 feet (98 m) tall. It is located at the intersection of Hamilton and 9th streets in Center City Allentown.\nOn March 1, 2024, PPL Corporation announced that its subsidiary PPL Electric Utilities reached a tentative $9 million agreement to sell its 2 North Ninth St. Tower Building and office complex to Pennsylvania-based developer D&D Realty Group. The company's headquarters is now a few blocks away at 645 Hamilton St.\n\nSubsidiaries\nPPL Electric Utilities Corporation, commonly known as PPL Electric Utilities and formerly known as Pennsylvania Power & Light Company or Pennsylvania Power & Light\nLG&E and KU Energy\nLouisville Gas & Electric\nKentucky Utilities\nPPL Global\nRhode Island Energy, formerly a regional business of Narragansett Electric Company, formed in 2022 following its purchase from National Grid\n\nIn popular culture\nExterior shots of the PPL Building were used in the 1954 motion picture Executive Suite.\n\nReferences\nExternal links\nPPL Official Web Site\nBusiness data for PPL Corporation: \nPennsylvania Power & Light Company records (1883–1941) at Hagley Museum and Library",
  "clean_text": "PPL Corporation is an energy company headquartered in Allentown, Pennsylvania in the Lehigh Valley region of eastern Pennsylvania. The company is publicly traded on the New York Stock Exchange as NYSE: PPL and is part of the S&P 500. As of 2022, the company had $7.9 billion in revenue, 6,500 employees, over $37 billion in assets, and serves 3.6 million customers. History 20th century PPL Corporation was founded as Pennsylvania Power & Light in 1920, the product of a merger of eight smaller Pennsylvania-based utility companies. It gradually extended its service territory to a crescent-shaped region of central and Northeastern Pennsylvania, stretching from Lancaster in central Pennsylvania through the Lehigh Valley in eastern Pennsylvania, and Scranton, and Wilkes-Barre in Northeastern Pennsylvania. In 1995, the company reorganized as a holding company. PP&L Resources was renamed PPL Corporation in 2000. The company limited its operations to Pennsylvania until deregulation of electrical utilities in the 1990s encouraged PPL to purchase assets in other states. The largest of these acquisitions was PPL's 1998 purchase of 13 plants from Montana Power Company, which added over 2,500 megawatts in capacity, representing the largest expansion in the company's history. 21st century In 2010, PPL completed the acquisition of two regulated Kentucky-based utilities, Louisville Gas & Electric in Louisville and Kentucky Utilities in Lexington. In February 2010, PPL Corporation purchased the naming rights to the venue originally known as PPL Park, the home stadium of Major League Soccer's Philadelphia Union, in Chester, Pennsylvania. As part of the $25 million, 11-year deal, PPL EnergyPlus provided sustainable energy to PPL Park derived from other sources in Pennsylvania. After PPL spun off its non-regulated generation business into the separate Talen Energy, the stadium naming rights were assumed by the spinoff company and the venue became known as Talen Energy Stadium. In February 2020, the park was named Subaru Park. In 2011, PPL completed the acquisition of two regulated regional electricity distribution companies in the United Kingdom. Along with two previously acquired regional electricity distribution companies, the company operates as Western Power Distribution (WPD). In 2014, the company's hydroelectric facilities were sold to NorthWestern. On June 6, 2014, PPL announced it would divest its electrical generation facilities to a newly formed company, Talen Energy. On June 1, 2015, the Talen spinoff was completed, allowing PPL to concentrate on the transmission and distribution aspects of the electric utility business. In 2020, PPL initiated a formal process to sell WPD in order to position PPL as a purely U.S.-focused energy company and create additional shareowner value. This resulted in a March 18, 2021, announcement of agreements to sell WPD to National Grid plc for £7.8 billion and acquire National Grid's Rhode Island electric and gas utility, the Narragansett Electric Company, for $3.8 billion. The sale of WPD was completed on June 14, 2021. The sale of the Narragansett Electric Company was completed on May 25, 2022, and Narragansett Electric was renamed Rhode Island Energy. In November 2019, William Spence, PPL's former chairman and chief executive officer, said that the company is focusing on building more advanced cleaner energy technologies and is also increasing its effort on a strategy known as \"Energy Forward.\" The company has invested billions to improve infrastructure and technology in order to create a smarter, more reliable and resilient energy grid. In the third quarter of 2019, PPL completed a $470 million investment in replacing meters with \"advanced\" meters in Pennsylvania. PPL owns the naming rights to the PPL Center in Allentown, which hosts the Lehigh Valley Phantoms of the American Hockey League starting with the 2014 season. PPL paid an undisclosed sum over ten years. PPL's companies regularly rank high in customer satisfaction studies. PPL Electric Utilities, which serves 1.4 million customers in 29 counties in Pennsylvania, has received 30 J.D. Power and Associates awards for customer satisfaction. Louisville Gas and Electric and Kentucky Utilities, which serves 1.3 million customers in nearly 100 counties across Kentucky and Virginia, has won 28 J.D. Power awards for customer satisfaction. PPL Building For a century, the company had been headquartered at the PPL Building, which is the tallest building in Allentown and greater Lehigh Valley metropolitan area as of 2023. The 24-story building is 322 feet (98 m) tall. It is located at the intersection of Hamilton and 9th streets in Center City Allentown. On March 1, 2024, PPL Corporation announced that its subsidiary PPL Electric Utilities reached a tentative $9 million agreement to sell its 2 North Ninth St. Tower Building and office complex to Pennsylvania-based developer D&D Realty Group. The company's headquarters is now a few blocks away at 645 Hamilton St. Subsidiaries PPL Electric Utilities Corporation, commonly known as PPL Electric Utilities and formerly known as Pennsylvania Power & Light Company or Pennsylvania Power & Light LG&E and KU Energy Louisville Gas & Electric Kentucky Utilities PPL Global Rhode Island Energy, formerly a regional business of Narragansett Electric Company, formed in 2022 following its purchase from National Grid In popular culture Exterior shots of the PPL Building were used in the 1954 motion picture Executive Suite."
}