{
  "ticker": "PRU",
  "cik": "0001137774",
  "company_name": "Prudential Financial",
  "corrected_name": "Prudential Financial",
  "wiki_title_used": "Prudential Financial",
  "exists": true,
  "raw_text": "Prudential Financial, Inc. is an American financial services company whose subsidiaries provide insurance, retirement planning, investment management, and other products and services to both retail and institutional customers throughout the United States and in over 40 other countries. In 2019, Prudential was the largest insurance provider in the United States with $815.1 billion in total assets. The company is included in the  Fortune Global 500 and Fortune 500 rankings.\n\nLogo\nThe use of Prudential's symbol, the Rock of Gibraltar, began after an advertising agent passed Laurel Hill, a volcanic neck, in Secaucus, New Jersey, on a train in the 1890s.  The related slogans \"Get a Piece of the Rock\" and \"Strength of Gibraltar\" are also still quite widely associated with Prudential, though current advertising uses neither of these. Through the years, the symbol went through various versions, but in 1989, a simplified pictogram symbol of the Rock of Gibraltar was adopted and has been used ever since. The logotype was updated with a proprietary font in 1996. The font, Prudential Roman, was designed by Doyald Young and John March, based on the Century font family.\nIn fact, in Jacksonville a two-ton piece of the Rock of Gibraltar was presented to the city and placed in the lobby of the Prudential Insurance Building in 1955.\n\nHistory\nStarted in Newark, New Jersey, in 1875, Prudential was originally called The Widows and Orphans Friendly Society, then the Prudential Friendly Society. It was founded by John F. Dryden, who later became a U.S. Senator. In the beginning, the company sold only one product, burial insurance. Dryden was the president of Prudential until 1912. He was succeeded by his son Forrest F. Dryden, who was the president until 1922.\n\nA history of The Prudential Insurance Company of America up to about 1975 is the topic of the book Three Cents A Week, referring to the premium paid by early policyholders.\nAt the turn of the 20th century, Prudential and other large insurers reaped the bulk of their profits from industrial life insurance, or insurance sold by solicitors house-to-house in poor urban areas. For their insurance, industrial workers paid double what others paid for ordinary life insurance, and due to high lapse rates, as few as 1 in 12 policies reached maturity. Prominent lawyer and future U.S. Supreme Court Justice Louis Brandeis helped pass a 1907 Massachusetts law to protect workers by allowing savings banks to sell life insurance at lower rates.\nIn 1954, Prudential, along with Equitable Holdings, declared a policy stating they would not insure mortgages to white families in racially integrated neighborhoods. This came in the wake of blockbusting in East Palo Alto after a white family sold their home to a Black family. This decision facilitated white flight and realignment of East Palo Alto's demographics. Their policy was according to the position of U.S. government agencies like the Federal Housing Administration and the Veteran's Administration who not only refused insured mortgages to Black families, but white families in predominantly Black communities. \n\nPrudential has evolved from a mutual insurance company (owned by its policyholders) to a joint stock company (as it was prior to 1915). It is now traded on the New York Stock Exchange under the symbol PRU. The Prudential Stock was issued and started trading on the New York Stock Exchange on December 13, 2001.\nOn August 1, 2004, the U.S. Department of Homeland Security announced the discovery of terrorist threats against the Prudential Headquarters in Newark, New Jersey, prompting large-scale security measures that included concrete barriers outside the premises and internal X-ray machines. In the same year, a joint venture was formed between Prudential and China Everbright Limited.\nOn November 28, 2007, the Prudential board of directors elected a new CEO, John R. Strangfeld, to replace retiring Arthur F. Ryan.\n\nAcquisitions and divestitures\nIn 1981, the company acquired Bache & Co., a stock brokerage service that operated as a wholly owned subsidiary until 2003, when Wachovia and Prudential combined their retail brokerage operations into Wachovia Securities, with Prudential a minority stake holder. In 1999, Prudential sold its healthcare division, Prudential HealthCare, to Aetna for $1 billion.\nOn May 1, 2003, Prudential formalized the acquisition of American Skandia, the largest distributor of variable annuities through independent financial professionals in the United States. The CEO of American Skandia, Wade Dokken, partnered with Goldman Sachs and sold the division to Prudential for $1.2 billion.  The combination of American Skandia variable annuities and Prudential fixed annuities was part of Prudential's strategy to acquire complementary businesses that help meet retirement goals.\nIn April 2004, the company acquired the retirement business of CIGNA Corporation. In late 2009, Prudential sold its minority stake in Wachovia Securities Financial Holdings LLC to Wells Fargo & Co.  In 2011, Prudential sold Prudential Bache Commodities, LLC to Jefferies.\nIn February 2011, the company acquired AIG Edison and AIG Star both in Japan from American International Group, Inc (AIG) for a total of $4.8 billion.  This acquisition bolstered Prudential's operations in Asia while giving cash to AIG to pay back the federal government from its bailout in 2008.\nIn January 2013, the company acquired the individual life insurance business from The Hartford for $615 million in cash. The acquisition includes 700,000 in force life insurance policies with a face amount of approximately $135 billion. This move by Prudential brought over additional life insurance revenue.\nIn September 2019, the company agreed to acquire online startup Assurance IQ Inc. for $2.35 billion. Assurance has underperformed financial expectations, and industry commentators believe Prudential paid too much for the acquisition.\nIn February 2025, Prudential has considerations for listing its Indian joint venture, ICICI Prudential Asset Management. They would be potentially divesting part of its 49% stake and returning proceeds to the shareholders. This move has boosted Prudential’s shares by over 8%, while ICICI Bank which is holding 51%, reaffirmed its commitment to retaining a majority stake.\n\nControversies\nInvestor fraud\nDuring the 1980s and 1990s, Prudential Securities Incorporated (PSI), formerly a division of Prudential Financial, was investigated by the Securities and Exchange Commission (SEC) for suspected fraud. During the investigation, it was found that PSI had defrauded investors of close to $8 billion, the largest fraud found by the SEC in US history to that point. The SEC charged that Prudential allowed rogue executives to cheat customers on a large scale and blithely ignored a 1986 SEC order to overhaul its internal enforcement of securities laws. In all, some 400,000 individual investors lost money on the deals.\nIn 1993, Prudential Financial eventually settled with investors for $330 million. Prudential said it would repay customers across the U.S. who lost money on the company's limited partnerships in the 1980s. In addition, the firm was required to pay another $41 million in fines. The settlement also resolved investigations of the firm by the National Association of Securities Dealers and 49 states, including California, where 52,000 investors lost money in Prudential limited partnerships. Further investigation was conducted by the SEC into the executives of the company to determine the extent of the fraud.\n\nClass action lawsuit over sales practices\nIn 1997, Prudential settled a class action lawsuit by millions of its customers who had been sold unnecessary life insurance by Prudential agents over a 13-year period ending in 1995. The settlement called for Prudential to repay an estimated $2 billion to customers through direct refunds and enhancements to existing policies. The settlement had been the subject of extensive negotiations involving not only Prudential and its customers, but also insurance regulators in 30 states. Prudential had agreed in early 1997 to pay a fine of $35 million to settle state allegxzxzations of deceptive sales practices. Prudential acknowledged that for more than a decade its agents had improperly persuaded customers to cash in old policies and purchase new ones so that the agents could generate additional sales commissions.\n\nUS military life insurance lawsuit\nIn 2010, various media outlets noted allegations that the Prudential Life Insurance Company was manipulating the payout of life insurance benefits due to the families of American soldiers in order to gain extra profits. The company provided life insurance to people in the armed forces under a government contract. Rather than paying the full amount due to the families at once, the company would instead deposit the funds into a Prudential corporate account. These accounts are referred to as 'retained asset accounts' and are essentially an I.O.U. from the company to the payee (in many cases a fallen service members' family). While Prudential was making profits of up to 4.2% in its general account in early 2010, they paid out 0.5% interest in these non-FDIC insured \"Alliance\" accounts. In some cases, when families requested to be sent a full payout in the form of a check, the family was sent a checkbook, rather than the amount due.\nIt is not clear if the practice was in violation of law or the contract. In August 2010, the company was sued by a number of the bereaved families. The company's response included an open letter to the military community in which it addressed what it characterized as \"misinformation\" about the nature of the accounts. Military Times noted that prior lawsuits against insurance companies pertaining to the use of retained asset accounts have been dismissed in federal courts without action.\n\nRatings, awards and The Prudential Foundation``\nPrudential has received a 100% rating on the Corporate Equality Index released by the Human Rights Campaign every year since 2003, the second year of the report. In addition, the company is in the \"Hall of Fame\" of Working Mothers magazine among other companies that have made their \"100 Best Companies for Working Mothers\" list for 15 or more years. It is still achieving that list, as of 2013. According to Business Week's The Best Places to Launch a Career 2008, Prudential Insurance was ranked #59 out of 119 companies on the list. In 2007, The Prudential Foundation provided over $450,000 in Prudential CARES Volunteer Grants to 444 nonprofit organizations worldwide.  The Prudential CARES Volunteer Grants Program recognizes individual and team volunteers based on a minimum of 40 hours of volunteer service per individual. Grants range from $250 to $5,000 for each award winner's charitable organization. Prudential ranked #69 on the 2017 Forbes World’s Biggest Public Companies list, calling out their $45.6 billion market value. Prudential ranked No. 52 in the 2018 Fortune 500 list of the largest United States corporations by total revenue. As of 2019, Prudential is the largest insurance provider in the United States with $815.1 billion in total assets.\nSee also the article on the Prudential Spirit of Community Award.\n\nSee also\nList of United States insurance companies\nPrudential plc—an unrelated United Kingdom-based company.\nJackson National Life, the U.S. subsidiary of Prudential plc from 1986 to 2021\n\nReferences\nExternal links\n\nOfficial website\nYahoo! – Prudential Financial, Inc. Company Profile\nBusiness data for Prudential Financial:",
  "clean_text": "Prudential Financial, Inc. is an American financial services company whose subsidiaries provide insurance, retirement planning, investment management, and other products and services to both retail and institutional customers throughout the United States and in over 40 other countries. In 2019, Prudential was the largest insurance provider in the United States with $815.1 billion in total assets. The company is included in the Fortune Global 500 and Fortune 500 rankings. Logo The use of Prudential's symbol, the Rock of Gibraltar, began after an advertising agent passed Laurel Hill, a volcanic neck, in Secaucus, New Jersey, on a train in the 1890s. The related slogans \"Get a Piece of the Rock\" and \"Strength of Gibraltar\" are also still quite widely associated with Prudential, though current advertising uses neither of these. Through the years, the symbol went through various versions, but in 1989, a simplified pictogram symbol of the Rock of Gibraltar was adopted and has been used ever since. The logotype was updated with a proprietary font in 1996. The font, Prudential Roman, was designed by Doyald Young and John March, based on the Century font family. In fact, in Jacksonville a two-ton piece of the Rock of Gibraltar was presented to the city and placed in the lobby of the Prudential Insurance Building in 1955. History Started in Newark, New Jersey, in 1875, Prudential was originally called The Widows and Orphans Friendly Society, then the Prudential Friendly Society. It was founded by John F. Dryden, who later became a U.S. Senator. In the beginning, the company sold only one product, burial insurance. Dryden was the president of Prudential until 1912. He was succeeded by his son Forrest F. Dryden, who was the president until 1922. A history of The Prudential Insurance Company of America up to about 1975 is the topic of the book Three Cents A Week, referring to the premium paid by early policyholders. At the turn of the 20th century, Prudential and other large insurers reaped the bulk of their profits from industrial life insurance, or insurance sold by solicitors house-to-house in poor urban areas. For their insurance, industrial workers paid double what others paid for ordinary life insurance, and due to high lapse rates, as few as 1 in 12 policies reached maturity. Prominent lawyer and future U.S. Supreme Court Justice Louis Brandeis helped pass a 1907 Massachusetts law to protect workers by allowing savings banks to sell life insurance at lower rates. In 1954, Prudential, along with Equitable Holdings, declared a policy stating they would not insure mortgages to white families in racially integrated neighborhoods. This came in the wake of blockbusting in East Palo Alto after a white family sold their home to a Black family. This decision facilitated white flight and realignment of East Palo Alto's demographics. Their policy was according to the position of U.S. government agencies like the Federal Housing Administration and the Veteran's Administration who not only refused insured mortgages to Black families, but white families in predominantly Black communities. Prudential has evolved from a mutual insurance company (owned by its policyholders) to a joint stock company (as it was prior to 1915). It is now traded on the New York Stock Exchange under the symbol PRU. The Prudential Stock was issued and started trading on the New York Stock Exchange on December 13, 2001. On August 1, 2004, the U.S. Department of Homeland Security announced the discovery of terrorist threats against the Prudential Headquarters in Newark, New Jersey, prompting large-scale security measures that included concrete barriers outside the premises and internal X-ray machines. In the same year, a joint venture was formed between Prudential and China Everbright Limited. On November 28, 2007, the Prudential board of directors elected a new CEO, John R. Strangfeld, to replace retiring Arthur F. Ryan. Acquisitions and divestitures In 1981, the company acquired Bache & Co., a stock brokerage service that operated as a wholly owned subsidiary until 2003, when Wachovia and Prudential combined their retail brokerage operations into Wachovia Securities, with Prudential a minority stake holder. In 1999, Prudential sold its healthcare division, Prudential HealthCare, to Aetna for $1 billion. On May 1, 2003, Prudential formalized the acquisition of American Skandia, the largest distributor of variable annuities through independent financial professionals in the United States. The CEO of American Skandia, Wade Dokken, partnered with Goldman Sachs and sold the division to Prudential for $1.2 billion. The combination of American Skandia variable annuities and Prudential fixed annuities was part of Prudential's strategy to acquire complementary businesses that help meet retirement goals. In April 2004, the company acquired the retirement business of CIGNA Corporation. In late 2009, Prudential sold its minority stake in Wachovia Securities Financial Holdings LLC to Wells Fargo & Co. In 2011, Prudential sold Prudential Bache Commodities, LLC to Jefferies. In February 2011, the company acquired AIG Edison and AIG Star both in Japan from American International Group, Inc (AIG) for a total of $4.8 billion. This acquisition bolstered Prudential's operations in Asia while giving cash to AIG to pay back the federal government from its bailout in 2008. In January 2013, the company acquired the individual life insurance business from The Hartford for $615 million in cash. The acquisition includes 700,000 in force life insurance policies with a face amount of approximately $135 billion. This move by Prudential brought over additional life insurance revenue. In September 2019, the company agreed to acquire online startup Assurance IQ Inc. for $2.35 billion. Assurance has underperformed financial expectations, and industry commentators believe Prudential paid too much for the acquisition. In February 2025, Prudential has considerations for listing its Indian joint venture, ICICI Prudential Asset Management. They would be potentially divesting part of its 49% stake and returning proceeds to the shareholders. This move has boosted Prudential’s shares by over 8%, while ICICI Bank which is holding 51%, reaffirmed its commitment to retaining a majority stake. Controversies Investor fraud During the 1980s and 1990s, Prudential Securities Incorporated (PSI), formerly a division of Prudential Financial, was investigated by the Securities and Exchange Commission (SEC) for suspected fraud. During the investigation, it was found that PSI had defrauded investors of close to $8 billion, the largest fraud found by the SEC in US history to that point. The SEC charged that Prudential allowed rogue executives to cheat customers on a large scale and blithely ignored a 1986 SEC order to overhaul its internal enforcement of securities laws. In all, some 400,000 individual investors lost money on the deals. In 1993, Prudential Financial eventually settled with investors for $330 million. Prudential said it would repay customers across the U.S. who lost money on the company's limited partnerships in the 1980s. In addition, the firm was required to pay another $41 million in fines. The settlement also resolved investigations of the firm by the National Association of Securities Dealers and 49 states, including California, where 52,000 investors lost money in Prudential limited partnerships. Further investigation was conducted by the SEC into the executives of the company to determine the extent of the fraud. Class action lawsuit over sales practices In 1997, Prudential settled a class action lawsuit by millions of its customers who had been sold unnecessary life insurance by Prudential agents over a 13-year period ending in 1995. The settlement called for Prudential to repay an estimated $2 billion to customers through direct refunds and enhancements to existing policies. The settlement had been the subject of extensive negotiations involving not only Prudential and its customers, but also insurance regulators in 30 states. Prudential had agreed in early 1997 to pay a fine of $35 million to settle state allegxzxzations of deceptive sales practices. Prudential acknowledged that for more than a decade its agents had improperly persuaded customers to cash in old policies and purchase new ones so that the agents could generate additional sales commissions. US military life insurance lawsuit In 2010, various media outlets noted allegations that the Prudential Life Insurance Company was manipulating the payout of life insurance benefits due to the families of American soldiers in order to gain extra profits. The company provided life insurance to people in the armed forces under a government contract. Rather than paying the full amount due to the families at once, the company would instead deposit the funds into a Prudential corporate account. These accounts are referred to as 'retained asset accounts' and are essentially an I.O.U. from the company to the payee (in many cases a fallen service members' family). While Prudential was making profits of up to 4.2% in its general account in early 2010, they paid out 0.5% interest in these non-FDIC insured \"Alliance\" accounts. In some cases, when families requested to be sent a full payout in the form of a check, the family was sent a checkbook, rather than the amount due. It is not clear if the practice was in violation of law or the contract. In August 2010, the company was sued by a number of the bereaved families. The company's response included an open letter to the military community in which it addressed what it characterized as \"misinformation\" about the nature of the accounts. Military Times noted that prior lawsuits against insurance companies pertaining to the use of retained asset accounts have been dismissed in federal courts without action. Ratings, awards and The Prudential Foundation`` Prudential has received a 100% rating on the Corporate Equality Index released by the Human Rights Campaign every year since 2003, the second year of the report. In addition, the company is in the \"Hall of Fame\" of Working Mothers magazine among other companies that have made their \"100 Best Companies for Working Mothers\" list for 15 or more years. It is still achieving that list, as of 2013. According to Business Week's The Best Places to Launch a Career 2008, Prudential Insurance was ranked #59 out of 119 companies on the list. In 2007, The Prudential Foundation provided over $450,000 in Prudential CARES Volunteer Grants to 444 nonprofit organizations worldwide. The Prudential CARES Volunteer Grants Program recognizes individual and team volunteers based on a minimum of 40 hours of volunteer service per individual. Grants range from $250 to $5,000 for each award winner's charitable organization. Prudential ranked #69 on the 2017 Forbes World’s Biggest Public Companies list, calling out their $45.6 billion market value. Prudential ranked No. 52 in the 2018 Fortune 500 list of the largest United States corporations by total revenue. As of 2019, Prudential is the largest insurance provider in the United States with $815.1 billion in total assets. See also the article on the Prudential Spirit of Community Award."
}