{
  "ticker": "PSA",
  "cik": "0001393311",
  "company_name": "Public Storage",
  "corrected_name": "Public Storage",
  "wiki_title_used": "Public Storage",
  "exists": true,
  "raw_text": "Public Storage, headquartered in Glendale, California, is a real estate investment trust that invests in self storage. It is the largest brand of self-storage services in the US and owns approximately 9% of the self storage square footage in the U.S. As of December 31, 2024, the company operated 3,073 self-storage facilities containing an aggregate of 221 million net rentable square feet of space. The company also provides insurance services for tenants and manages 307 self storage facilities for other owners.\nPublic Storage Inc. was founded in 1972 by B. Wayne Hughes and Kenneth Volk Jr. It grew to 1,000 locations by 1989, using funding from investors in real estate limited partnerships (RELPs). The private company was re-structured as a publicly traded REIT in 1995, when Storage Equities merged with Public Storage and adopted its name. In 2006, it acquired Shurgard Storage Centers, an owner and operator of storage facilities in Europe, in a $5.5 billion transaction; the company was spun-out and Public Storage retains a 35% interest.\nSelf-storage locations tend to be in dense clusters in major cities, especially near freeways and intersections.\n\nHistory\nOrigins\nThe idea for Public Storage was conceived by Southern California real estate developer B. Wayne Hughes in the early 1970s. During a trip to Texas, he observed that local real estate developers were doing well creating mini-storage facilities outside of Dallas and Houston. He brought the self storage concept back with him to California. Hughes partnered with Kenneth Volk and the two founded Public Storage in August 1972 with a $50,000 initial investment, at first calling it \"Private Storage Spaces Inc.\"\nThe first warehouse was built in 1972 in El Cajon, California with $50,000 in capital. According to Hughes, \"Private Storage Spaces Inc.\" confused people into thinking it was private, so the name was changed to \"Public Storage\" to match the PS acronym. The founders initially planned to build storage warehouses as a temporary source of income until the land became more valuable and could be redeveloped for another use.\nWithin three months, the first location was breaking even with a 35% occupancy. The units were rented for a similar price per square foot as apartments or office space, but cost 35% to 40% less to build and maintain. A property management subsidiary called Public Storage Management Inc. was formed in 1973. By 1974, 20 locations had been built.\n\nReal Estate Limited Partnership financing\nHughes disliked debt, so he financed the purchase and development of new properties primarily through real estate limited partnerships (RELPs). At first, Public Storage built warehouses and sold them to independent RELPs for a development fee. The company's own RELP, called Public Storage Partners Ltd, was formed in 1975 and closed its first deal for $3 million in investments two years later. Public Storage paid cash to acquire property and build a self storage facility, then used the property's income to pay investors back and earn a portion as profit. Public Storage Inc. also earned revenues from a portion of each deal that was made.\nEarly investors earned three to four times their money back due to increasing property values in Southern California, high occupancy rates, and increasing storage rental prices. By the mid-1980s, Public Storage was raising $200 to $300 million in investments each year. The RELP format allowed the firm to continue building more locations in the 1970s and 1980s when most of the industry had halted growth because of higher interest rates on loans. In the mid-1980s, co-founder Volk retired and his interest in Public Storage was purchased by Hughes.Forbes estimated that by this time the company was worth $800 million.\nInvestment funding was used to build mini-storage warehouses beyond California, targeting the 39 largest US cities. The firm opened self-storage locations in close proximity to each other, so the sites could share a development office, and justify local television advertising. The firm's growth slowed in the mid-1980s as new competition increased the cost of property and slowed the increase in rental prices to consumers. Poor weather and difficult labor markets outside of California delayed development projects; the company also made poor investments in office parks. Interest in real estate investing also diminished.\nBy the late 1980s, the company opened its 1,000th Public Storage location and the company was three times larger than its nearest competitor in the US market. By 1989, $2.7 billion had been invested from 200,000 investors. Public Storage helped popularize the use of self-storage businesses as a real estate investment vehicle and became one of the longest-running RELP investment vehicles. By 1991, Public Storage had set up more than 150 RELPs and real estate investment trusts (REITs).\nIn 1984, PS Reinsurance was formed to sell insurance for a storage unit's contents.\n\nReal Estate Investment Trust (REIT)\nAccording to Financial World, by 1989 the real estate limited partnership (RELP) market that Public Storage relied on for funding \"all but vanished\". A book by Public Storage Inc. said the Tax Reform Act of 1986 reduced the tax benefits of RELPs and was followed by \"a tough time for real estate companies.\" In December 1990, five of its partnerships were converted to Real Estate Investment Trusts (REITs) in December. It also began consolidating its partnerships and acquiring many of the companies in which it held an interest.\nStorage Equities was founded by Public Storage in 1980 to purchase self-storage facilities. It was one of 17 self-storage REITs owned in part by Public Storage.\nIn 1995, PS Orangeco was created as a subsidiary, selling boxes, packaging, truck rentals, and other moving supplies.\nIn 1995, Public Storage and its subsidiaries were merged with its self-storage REIT, Storage Equities, in a $679 million transaction, and re-structured as a single REIT called Public Storage Inc.\nIn 1998, Public Storage acquired Storage Trust Realty in a $400 million transaction.\n\n2000-present\nIn 2006, the company acquired Shurgard Storage Centers in a $5.5 billion transaction, acquiring 624 locations, including 141 in Europe. Public Storage had attempted to acquire the company in 2000 and again in 2005, but its offers were rejected. \nIn March 2010, the company acquired 30 locations from A-American Self Storage for $189 million.\nIn December 2013, the company acquired a 44-property portfolio from Stor-All Storage for $430 million.\nIn December 2020, the company acquired 36 properties containing 3.6 million net rentable square feet from Beyond Self Storage for $528 million.\nIn April 2021, the company acquired the 48-property ezStorage portfolio, with properties in the Washington metropolitan area, for $1.8 billion.\nIn December 2021, the company acquired All Storage, owner of 56 self-storage properties containing 7.5 million net rentable square feet primarily in the Dallas-Fort Worth market, for $1.5 billion.\nIn February 2023, the company bid to acquire Life Storage but was outbid by Extra Space Storage.\nIn September 2023, the company acquired Simply Self Storage, with 127 properties comprising 9 million rentable square feet, from affiliates of The Blackstone Group, for $2.2 billion.\n\nControversies and legal issues\nAuctions of property after failure to pay rent\nThe contents of a storage unit are put up for auction if the rental fees are not paid for sixty days. Although the TV show Storage Wars created increased interest in the auctions, most units do not contain anything of substantial economic value. \nIn 2007, a customer's belongings were auctioned for non-payment while he was serving the US military in Iraq. After receiving negative publicity, Public Storage apologized and gave him $8,000 as compensation for his sold belongings.\n\nTheft, insurance and damages\nIn 2005, Public Storage said in a public filing that there had been \"an increasing number of claims and litigation against owners and managers of rental properties relating to moisture infiltration, which can result in mold or other property damage.\" The company's rental contract says it is not responsible for the storage unit's contents, even if damage is caused by defects in the unit, and The Wall Street Journal reported that there were \"surprisingly few remedies\" for theft or property damage at self-storage facilities.\n\nDenial of insurance claims after theft\nMany Public Storage customers have filed complaints regarding insurance policies sold by Public Storage representatives, after experiencing burglaries of their storage units and having their insurance claims denied. Investigative journalists from TV news stations in California, Kansas, and Washington have reported on difficulties consumers had when filing insurance claims for burglaries with Willis and The New Hampshire Insurance Company, which are affiliated with Public Storage. For example, claims have been denied because the storage unit had an intact lock; affiliated insurance companies cited insufficient evidence of forced entry, though burglars often replace the unit's lock in an attempt to conceal the burglary. Insurance commissioners in two states have criticized the practices of insurance companies affiliated with Public Storage. A class action lawsuit alleged Public Storage misleads consumers into thinking that insurance premiums are charged at cost, whereas a substantial amount of those premiums are retained as profits by Public Storage; the lawsuit was settled in 2016 for $5 million.\n\nEmployee compensation\nIn 2013, the company was criticized for offering most employees salaries of $9 to $10 per hour, despite record profits.\n\nPrice gouging\nIn 2019, the company was fined $140,000 for price gouging after it raised prices by over 10% after the October 2017 Northern California wildfires.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Public Storage:",
  "clean_text": "Public Storage, headquartered in Glendale, California, is a real estate investment trust that invests in self storage. It is the largest brand of self-storage services in the US and owns approximately 9% of the self storage square footage in the U.S. As of December 31, 2024, the company operated 3,073 self-storage facilities containing an aggregate of 221 million net rentable square feet of space. The company also provides insurance services for tenants and manages 307 self storage facilities for other owners. Public Storage Inc. was founded in 1972 by B. Wayne Hughes and Kenneth Volk Jr. It grew to 1,000 locations by 1989, using funding from investors in real estate limited partnerships (RELPs). The private company was re-structured as a publicly traded REIT in 1995, when Storage Equities merged with Public Storage and adopted its name. In 2006, it acquired Shurgard Storage Centers, an owner and operator of storage facilities in Europe, in a $5.5 billion transaction; the company was spun-out and Public Storage retains a 35% interest. Self-storage locations tend to be in dense clusters in major cities, especially near freeways and intersections. History Origins The idea for Public Storage was conceived by Southern California real estate developer B. Wayne Hughes in the early 1970s. During a trip to Texas, he observed that local real estate developers were doing well creating mini-storage facilities outside of Dallas and Houston. He brought the self storage concept back with him to California. Hughes partnered with Kenneth Volk and the two founded Public Storage in August 1972 with a $50,000 initial investment, at first calling it \"Private Storage Spaces Inc.\" The first warehouse was built in 1972 in El Cajon, California with $50,000 in capital. According to Hughes, \"Private Storage Spaces Inc.\" confused people into thinking it was private, so the name was changed to \"Public Storage\" to match the PS acronym. The founders initially planned to build storage warehouses as a temporary source of income until the land became more valuable and could be redeveloped for another use. Within three months, the first location was breaking even with a 35% occupancy. The units were rented for a similar price per square foot as apartments or office space, but cost 35% to 40% less to build and maintain. A property management subsidiary called Public Storage Management Inc. was formed in 1973. By 1974, 20 locations had been built. Real Estate Limited Partnership financing Hughes disliked debt, so he financed the purchase and development of new properties primarily through real estate limited partnerships (RELPs). At first, Public Storage built warehouses and sold them to independent RELPs for a development fee. The company's own RELP, called Public Storage Partners Ltd, was formed in 1975 and closed its first deal for $3 million in investments two years later. Public Storage paid cash to acquire property and build a self storage facility, then used the property's income to pay investors back and earn a portion as profit. Public Storage Inc. also earned revenues from a portion of each deal that was made. Early investors earned three to four times their money back due to increasing property values in Southern California, high occupancy rates, and increasing storage rental prices. By the mid-1980s, Public Storage was raising $200 to $300 million in investments each year. The RELP format allowed the firm to continue building more locations in the 1970s and 1980s when most of the industry had halted growth because of higher interest rates on loans. In the mid-1980s, co-founder Volk retired and his interest in Public Storage was purchased by Hughes.Forbes estimated that by this time the company was worth $800 million. Investment funding was used to build mini-storage warehouses beyond California, targeting the 39 largest US cities. The firm opened self-storage locations in close proximity to each other, so the sites could share a development office, and justify local television advertising. The firm's growth slowed in the mid-1980s as new competition increased the cost of property and slowed the increase in rental prices to consumers. Poor weather and difficult labor markets outside of California delayed development projects; the company also made poor investments in office parks. Interest in real estate investing also diminished. By the late 1980s, the company opened its 1,000th Public Storage location and the company was three times larger than its nearest competitor in the US market. By 1989, $2.7 billion had been invested from 200,000 investors. Public Storage helped popularize the use of self-storage businesses as a real estate investment vehicle and became one of the longest-running RELP investment vehicles. By 1991, Public Storage had set up more than 150 RELPs and real estate investment trusts (REITs). In 1984, PS Reinsurance was formed to sell insurance for a storage unit's contents. Real Estate Investment Trust (REIT) According to Financial World, by 1989 the real estate limited partnership (RELP) market that Public Storage relied on for funding \"all but vanished\". A book by Public Storage Inc. said the Tax Reform Act of 1986 reduced the tax benefits of RELPs and was followed by \"a tough time for real estate companies.\" In December 1990, five of its partnerships were converted to Real Estate Investment Trusts (REITs) in December. It also began consolidating its partnerships and acquiring many of the companies in which it held an interest. Storage Equities was founded by Public Storage in 1980 to purchase self-storage facilities. It was one of 17 self-storage REITs owned in part by Public Storage. In 1995, PS Orangeco was created as a subsidiary, selling boxes, packaging, truck rentals, and other moving supplies. In 1995, Public Storage and its subsidiaries were merged with its self-storage REIT, Storage Equities, in a $679 million transaction, and re-structured as a single REIT called Public Storage Inc. In 1998, Public Storage acquired Storage Trust Realty in a $400 million transaction. 2000-present In 2006, the company acquired Shurgard Storage Centers in a $5.5 billion transaction, acquiring 624 locations, including 141 in Europe. Public Storage had attempted to acquire the company in 2000 and again in 2005, but its offers were rejected. In March 2010, the company acquired 30 locations from A-American Self Storage for $189 million. In December 2013, the company acquired a 44-property portfolio from Stor-All Storage for $430 million. In December 2020, the company acquired 36 properties containing 3.6 million net rentable square feet from Beyond Self Storage for $528 million. In April 2021, the company acquired the 48-property ezStorage portfolio, with properties in the Washington metropolitan area, for $1.8 billion. In December 2021, the company acquired All Storage, owner of 56 self-storage properties containing 7.5 million net rentable square feet primarily in the Dallas-Fort Worth market, for $1.5 billion. In February 2023, the company bid to acquire Life Storage but was outbid by Extra Space Storage. In September 2023, the company acquired Simply Self Storage, with 127 properties comprising 9 million rentable square feet, from affiliates of The Blackstone Group, for $2.2 billion. Controversies and legal issues Auctions of property after failure to pay rent The contents of a storage unit are put up for auction if the rental fees are not paid for sixty days. Although the TV show Storage Wars created increased interest in the auctions, most units do not contain anything of substantial economic value. In 2007, a customer's belongings were auctioned for non-payment while he was serving the US military in Iraq. After receiving negative publicity, Public Storage apologized and gave him $8,000 as compensation for his sold belongings. Theft, insurance and damages In 2005, Public Storage said in a public filing that there had been \"an increasing number of claims and litigation against owners and managers of rental properties relating to moisture infiltration, which can result in mold or other property damage.\" The company's rental contract says it is not responsible for the storage unit's contents, even if damage is caused by defects in the unit, and The Wall Street Journal reported that there were \"surprisingly few remedies\" for theft or property damage at self-storage facilities. Denial of insurance claims after theft Many Public Storage customers have filed complaints regarding insurance policies sold by Public Storage representatives, after experiencing burglaries of their storage units and having their insurance claims denied. Investigative journalists from TV news stations in California, Kansas, and Washington have reported on difficulties consumers had when filing insurance claims for burglaries with Willis and The New Hampshire Insurance Company, which are affiliated with Public Storage. For example, claims have been denied because the storage unit had an intact lock; affiliated insurance companies cited insufficient evidence of forced entry, though burglars often replace the unit's lock in an attempt to conceal the burglary. Insurance commissioners in two states have criticized the practices of insurance companies affiliated with Public Storage. A class action lawsuit alleged Public Storage misleads consumers into thinking that insurance premiums are charged at cost, whereas a substantial amount of those premiums are retained as profits by Public Storage; the lawsuit was settled in 2016 for $5 million. Employee compensation In 2013, the company was criticized for offering most employees salaries of $9 to $10 per hour, despite record profits. Price gouging In 2019, the company was fined $140,000 for price gouging after it raised prices by over 10% after the October 2017 Northern California wildfires."
}