{
  "ticker": "PSKY",
  "cik": "0002041610",
  "company_name": "Paramount Skydance Corporation",
  "corrected_name": "Paramount Skydance Corporation",
  "wiki_title_used": "Paramount Skydance Corporation",
  "exists": true,
  "raw_text": "Paramount Skydance Corporation (doing business as Paramount) is an American multinational mass media and entertainment conglomerate. It is headquartered at the Paramount Pictures lot in the Hollywood neighborhood of Los Angeles, California, with offices at the previous Skydance Media headquarters in Santa Monica, California and the previous Paramount Global headquarters at One Astor Plaza in New York City. \nThe company was formed on August 7, 2025 by David Ellison, through the merger of Paramount Global and Skydance Media, after National Amusements was absorbed into the merged company. The company trades under the ticker symbol \"PSKY\" on the Nasdaq. \nParamount Skydance properties are divided into four divisions: The first division is Paramount Skydance Studios, which consists of the Paramount Motion Pictures Group, Paramount Television Group and Paramount Experiences. \nThe second division is Paramount Streaming, which includes the flagship Paramount+ streaming service, and PlutoTV. Paramount Streaming also includes Philo, which is a joint venture with A&E Global Media, AMC Networks, and Warner Bros. Discovery. And Paramount Streaming includes a 50% stake (together with Comcast) in the SkyShowtime streaming service.\nThe third division is Paramount Skydance TV Media, which consists of the company's domestic and international linear television networks, including CBS Entertainment Group, Paramount Media Networks (which itself consists of BET Media Group, Nickelodeon, MTV Entertainment, and Showtime), and Paramount International Networks (which owns the international networks).  \nThe fourth division is Paramount Sports Entertainment.\n\nBackground\nThrough an assortment of corporate mergers, splits, and partnerships, Paramount Pictures, CBS, Viacom, and Skydance Media shared a long history prior to the 2025 merger joining the entities as Paramount Skydance.\n\n1912–1986\nParamount Pictures was founded in 1912 as the Famous Players Film Company. CBS was founded in 1927, and Paramount Pictures held a 49% ownership stake in from 1929 to 1932.\nIn 1952, CBS formed CBS Television Film Sales, a division which handled broadcast syndication rights for CBS's library of network-owned television series. This division was renamed CBS Films in 1958 and again renamed CBS Enterprises Inc. on December 1, 1967. It was renamed Viacom (an acronym of Video and Audio Communications) in 1970. In 1971, this syndication division was spun off amid new FCC rules forbidding television networks from owning syndication companies (these rules were eventually abolished completely in 1993).\nMeanwhile, Paramount Pictures was acquired by Gulf and Western Industries in 1966, which then re-branded itself as Paramount Communications in 1989.\n\n1986–2005\nIn 1986, Viacom purchased MTV Networks and Showtime/The Movie Channel Inc. from Warner Communications and American Express. In 1987, a majority stake in Viacom was acquired by theater operator company National Amusements.\nViacom then purchased a 50.1% stake in Paramount Communications in February 1994 for $9.75 billion, following a five-month battle with shopping channel QVC. The merger was completed in July. In 1999, Viacom made its biggest acquisition to date by announcing plans to merge with its former parent CBS Corporation (the renamed Westinghouse Electric Corporation, which had merged with CBS in 1995). The merger was completed in 2000, resulting in CBS reuniting with its former syndication division.\n\n2005–2022\nOn December 31, 2005, Viacom was split into two companies: the second incarnation of CBS Corporation, the former's corporate successor, and the second incarnation of Viacom, which was formed as a spin-off.\nSkydance Media was founded in 2006 by David Ellison. In 2009, Skydance and Paramount Pictures signed a five-year co-financing, production and distribution agreement, with Paramount holding an additional option of distribution. That deal would later be extended twice in 2013 and 2017.\n\nHistory\nFormation\nIn 2023, after struggling with debt and striving to remain competitive in the entertainment industry, Paramount's parent company, National Amusements, explored potential merger and acquisition opportunities for Paramount Global. Numerous prominent companies, such as Sony Pictures, Warner Bros. Discovery, Apollo Global Management, Warner Music Group, Allen Media Group, and Skydance Media, had indicated their interest in exploring potential business partnerships or purchasing the company.\nAfter first coming to a merger deal with Skydance, Paramount and Skydance canceled the proposed merger on June 11 due to unsatisfactory conversations. Following a break in the talks, Skydance was able to reach a preliminary agreement on July 2, 2024, to perform a 3-way merger between it, National Amusements, and Paramount to establish what was then known as \"New Paramount\". After the merger closed, Skydance Media CEO David Ellison became the chairman and CEO of the combined company and Jeff Shell became the president.\nParamount said in February 2025, and May 2025, that it expected the transaction to close within the first half of the year, but it did not happen. With the deal not yet approved, the first automatic extension to July 7, 2025, went into effect on April 8, 2025, after which the second automatic extension to October 4, 2025 went into effect on July 7, 2025. The SEC and the European Commission (EC) approved the transaction in February 2025. On March 10, 2025, Skydance Media filed a letter with the Federal Trade Commission (FTC) about Project Rise Partners and concerning its bid for Paramount after the 45-day \"go shop\" period in the summer of 2024. In late March 2025, Federal Communications Commission (FCC) Chairman Brendan Carr announced that companies wishing to merge should eliminate policies aimed at promoting diversity, equity and inclusion (DEI).\nOn July 22, 2025, it was reported that Oracle Corporation was in talks with Skydance Media for a $100 million-per-year contract to provide cloud software once the latter's acquisition of Paramount Global is completed. On July 24, the FCC approved the merger between Paramount Global and Skydance Media with the merger set to be complete by August 7. Numerous public reports cited a potential quid pro quo whereby Paramount/CBS agreed to pay $16 million to end a lawsuit filed on behalf of President Donald Trump to ensure government approval of the merger. Similar public reports also indicated another potential quid pro quo whereby CBS would terminate The Late Show with Stephen Colbert, to ensure federal approval of the merger. CBS executives denied both publicly reported claims, and insisted the 2026 ending of the Late Show franchise was purely based on a financial decision.\n\nMerger restructuring\nOn August 4, 2025, Paramount Skydance announced some of its new leadership alongside Ellison and Shell, with Andy Gordon joining as COO and strategy officer; Cindy Holland leading streaming services Paramount+ and Pluto TV; Dana Goldberg and Josh Greenstein co-leading Paramount Pictures; and Paramount Global veteran George Cheeks leading television networks. It was also announced the same day that the company would comprise 3 major units: studios (consisting of Paramount Pictures, Skydance Pictures, Nickelodeon Movies and other divisions such as those for film, television and video games), direct-to-consumer (Paramount+ and Pluto TV) and television media (CBS, BET, MTV, Nickelodeon among others). It also announced the merger of Showtime/MTV Entertainment Studios and Skydance Television into a revival of Paramount Television Studios to be headed by Matt Thunell. Oversight of the television units would be split, with Thunell heading the studios division (focusing on the streaming services) and George Cheeks overseeing production for the television media division (focusing on the linear networks), as well as South Park, which renewed its standing with Paramount in a deal worth $1.5 billion. Three months later in October following Paramount Skydance's relaunch of Paramount Television Studios, it was announced that Nickelodeon Group's live-action studio Nickelodeon/Awesomeness Live-Action aka Nickelodeon Productions and Awesomeness' production studio including Nickelodeon's & Awesomeness' production states was folded into the relaunched studio Paramount Television Studios, with the relaunched studio taking over Nickelodeon's current production state alongside Awesomeness' current productions, and would produce their future production slates beginning with the upcoming Victorious spin-off series Hollywood Arts which was originally ordered at Nickelodeon had moved to Netflix as its first Nickelodeon-branded series produced by the revived studio.\nOn August 5, 2025, Paramount Skydance announced layoffs of around 1,000 employees and a slashing of $2 billion in operating costs, alongside interest in a merger of Paramount+ and Pluto TV with assist from Oracle Corporation. On August 7, Jeff Shell announced that Paramount Skydance was exploring a sale of the NAI cinemas. On August 8, Paramount announced that they would be based in the Paramount Pictures lot in Los Angeles, departing from One Astor Plaza for the first time since the first Viacom moved there in 1994. On August 11, Paramount announced a seven-year deal with TKO Group Holdings where Ultimate Fighting Championship (UFC) will be exclusively distributed in the United States. UFC's 13 marquee numbered events and 30 \"Fight Nights\" will air on its streaming platform, Paramount+, with select numbered events also set to simulcast on CBS starting in 2026.\nOn August 13, 2025, Paramount announced that Top Gun 3, Star Trek, and other projects were now priorities. Paramount executives are looking to release twenty films per year. Cindy Holland, chairperson of direct-to-consumer, said, \"We want to entertain all audiences around the world. On Paramount+ today, we have a really great foundation, which is the Taylor Sheridan universe. We also have incredible CBS next-day, live sports, a lot from the cable networks, franchises like Star Trek, so many series. We're seeking to expand that and make sure that we’re offering programming for everybody not just occasionally, not just for the one thing they came to watch but ultimately and hopefully a year round and a daily habit for all audiences.\" Streaming films will not be a priority per Ellison. Also that day, Shell announced $2 billion in cuts. \"We do not want to be a company that has layoffs every quarter. So, it is important for us to get done what we're doing in one big thing and then be done with it,\" Shell said. On August 19, Paramount announced a four-year deal with Matt and Ross Duffer, the creators of Stranger Things, for movies, television and streaming projects at Paramount+. The agreement will commence following the conclusion of their current deal with Netflix in April 2026.\nOn September 2, 2025, Paramount Pictures announced that they and Microsoft-owned Activision Blizzard had inked a deal that will see the studio develop, produce and distribute a live-action film based on the Call of Duty franchise, which Ellison, a long-time fan of the series, considered a \"dream come true\". On September 3, Paramount Pictures announced that they signed a first-look, multi-picture deal with Will Smith and his company Westbrook. The deal will include films like Sugar Bandits and Rabbit Hole. Westbrook will also relocate to the Paramount lot in Hollywood. On September 4, Paramount Pictures and Legendary Entertainment announced a three-year worldwide film distribution deal. Under the deal, Paramount will market and distribute Legendary-developed and -produced theatrical films globally, excluding China, where Legendary East handles all marketing and distribution activities. Warner Bros. Pictures will continue to globally distribute films from select Legendary franchises including Dune: Part Three and Godzilla x Kong: Supernova (outside of Japan, which will be handled by Toho). The first film under the Paramount deal will be the live-action adaptation of the Street Fighter video game series. Also on September 4, Paramount announced a return to office policy that requires all employees to be in the office five days a week. On September 5, it was announced that Piers Morgan Uncensored will move from YouTube to 5 where it will air as a 90-minute highlights show starting September 12.\nOn September 12, 2025, Paramount Skydance announced they would be launching a sports media division called Paramount Sports Entertainment, the division would produce scripted and unscripted programming for its own platforms as well as third-party media companies and streaming services, while also developing sports-focused interactive games and experiences while also housing Skydance Sports. The division is also expected to collaborate with CBS Sports, but it will not be directly involved in live sports broadcasts. The division would be led by Skydance Sports chairman Jesse Sisgold. On September 16, Paramount Skydance added AI executive Dennis K. Cinelli to its board as an independent director, effective immediately. The appointment expands the body to 11 directors.\nOn September 17, 2025, it was announced that Marc Weinstock would be stepping down from his role as President of Worldwide Marketing and Distribution at Paramount Pictures. His departure comes as Josh Goldstine, the former marketing chief at Warner Bros., is expected to take over the position, according to media reports. On September 23, A former top official in the Trump Administration, Makan Delrahim, is in advanced talks to join the newly merged Paramount Global in a major legal role, according to sources with direct knowledge. On September 26, Pam Kaufman exited her role as Paramount President and CEO of International Markets, Global Consumer Products and Experiences.\nOn October 6, 2025, it was announced that Paramount Skydance named Bari Weiss as editor-in-chief of CBS News after acquiring her outlet The Free Press, a deal valued at $150 million. On October 23, Paramount Skydance sold its Argentine television network Telefe alongside its regional stations in Santa Fe and Córdoba, its international channel Telefe Internacional and its production studios to holding company Grupo Televisión Litoral, a company of businessman Gustavo Scaglione and José Luis Manzano. On October 27, The Hollywood Reporter announced that Taylor Sheridan was leaving Paramount for NBCUniversal as Paramount did not offer Sheridan an offer to stay. Also on October 27, it was announced that John Dickerson would be leaving CBS News who has been employed with over 16 years. On October 29, Ellison said that redundancies that phasing out roles that are no longer aligned with its 'evolving priorities' were \"designed to strengthen our focus on growth\". Paramount announced anchors Dana Jacboson and Michelle Miller as well as producer Brian Applegate of CBS Saturday Morning would be a part of the 2,000 layoffs planned. The company announced the layoffs of motion picture divisions, including production, literary, marketing and music including executives Randy Spendlove, Bryan Oh, Geoff Stier, Andres Alvarez, Rachel Cadden, Christine Benitez, and Phil Cohen. Also TV Executives Teri Fleming, Pamela Soper, Amanda Palley, Rose Catherine Pinkney, Robi Reed, Wendy Plaut, Amanda Culkowski, Margaret Comeaux, Jeff Grossman, Patricia Kollappallil, Gregory Heller, Amy Campbell, and Andrea Ballas were a part of the layoffs.\nOn October 30, 2025, Matt Thunell announced the department heads in areas such as Creative, Production, Business Affairs & Legal, Finance & BA, with some functions, including Talent & Casting and Corporate were either staying, newly hired, or promoted to different departments. Those named are Head of Development Shelley Zimmerman, EVP of Current Series Carolyn Harris, President of Showtime/MTV Entertainment Studio Keith Cox, Head of Production Drew Brown, Head of Business Affairs Virginia Lazalde-McPherson, EVP, Legal Affairs Lance McPherson, and Head of Finance Mel Rauch. Matt Hengemuhle moved from SVP, Financial Planning & Analysis to Direct to Consumer. Tricia Wood, EVP Casting for Paramount Pictures will also cast for Paramount Television Studios. Those leaving are EVP and Head of Global Production for Showtime/MTVE Keri Flint, EVP, TV Business & Legal Affairs for Skydance Jeff Hegedus, CFO, Paramount Media Networks, Showtime/MTVE Studios Candice Brancazio, EVP, Head of Live-Action Series, Films & Talent, Nickelodeon and Awesomeness TV Shauna Phelan, and EVP, Head of Global Talent and Content Development for Showtime/MTVE Trevor Rose.\nOn November 10, 2025, Los Angeles Times reported that Paramount laid off 1,600 employees in South America in exchange of a reduction of 15% of its workforce and cost savings which are worth $3 billion. The next day, 600 employees chose the severance package and left their jobs instead of returning to the office. On November 14, Paramount announced its decision to sell Chilevisión to Vytal Group LTD. Also that day, U. S. House of Representatives Jamie Raskin and Frank Pallone, the top two Democrats on the House Energy & Commerce Committee, said Paramount had not fully cooperated with their investigation in the settlement agreement between Skydance, Paramount Global, and President Trump. In August, they had requested documents from Paramount, communications with the Trump administration, the Federal Communications Commission (FCC), and internal communications concerning the merger between Skydance and Paramount.\n\nProposed joint venture with Apollo Global Management for possible acquisition of Warner Bros. Discovery\nAccording to reports, Bob Bakish, the president and CEO of Paramount Global, and David Zaslav, the CEO of Warner Bros. Discovery (Warner previously also held several channels that are currently owned by Paramount such as MTV, Nickelodeon, The Movie Channel, VH1, Comedy Central and BET; Paramount and Warner both hold stakes at The CW), met on December 20, 2023, to examine the possibility of a merger. While representatives for the two businesses said that negotiations were in the early stages and would not guarantee a deal, it was revealed through insider sources that Zaslav was \"not in deal mode\". Warner Bros. Discovery ended the merger negotiations with Paramount on February 27, 2024.\nIn September 2025, The Wall Street Journal and others reported that Paramount Skydance was weighing a takeover of Warner Bros. Discovery, a deal that, unlike the Skydance–Paramount tie-up, was expected to sidestep Federal Communications Commission review because WBD holds no broadcast licenses. The idea drew immediate political scrutiny, with Senator Elizabeth Warren urging regulators to stop it, while price talk swung widely: early chatter reached about $70 billion, mid-month commentary pointed to the mid-$50 billions, and by September 19 reporting centered on scenarios \"north of\" $45 billion alongside a potential $22–$24 per-share offer structure that could be 70–80% cash, with support from Larry Ellison. By September 29, CNBC’s David Faber suggested a friendly agreement looked unlikely and that Paramount might need to take any bid directly to WBD shareholders.\nIndustry voices spent the month debating what such a combination would mean. UTA chief David Kramer called it a mixed prospect for Hollywood, and FX Networks chairman John Landgraf predicted that large-scale consolidation among legacy studios was essentially unavoidable. Strategically, observers noted the sheer scale on offer: Paramount Skydance's roughly 4,500-film, 200,000-episode library (including the pre-1973 programming libraries of NBC and ABC) alongside Warner Bros.' catalog of about 10,000 films (including the pre-April 1986 MGM, February 1952 – May 1986 United Artists and pre-May 1982 Orion Pictures libraries) and 120,000 episodes and Discovery's ~70,000 episodes. Much industry speculation centred around how this could change competition, and the line-up of streaming services such as Pluto TV.\nFinancially, late-month research cautioned that even post-deal, most earnings power would still come from traditional TV: Bernstein Research estimated roughly 70% of EBITDA would be tied to linear networks, even as KPMG highlighted US content spend surpassing $200 billion and continuing to rise.\nOn October 2, 2025, CNBC speculated that their parent company, NBCUniversal, could be the biggest wild card for the acquisition of Warner Bros. Discovery's assets. On October 13, 2025, Warner Bros. Discovery rejected a proposed first bid from Paramount Skydance, but Paramount Skydance is considering to raise their offer or go directly to Warner Bros. Discovery's shareholders. On October 21, the New York Post said that Warner Bros. Discovery had privately rejected a new $24-a-share bid by Paramount Skydance. On October 8, the New York Post reported that Paramount Skydance was in talks with major private equity firms, including Apollo Global Management (the company that owns Legendary Entertainment and Cox Media Group) to join its possible bid to buy Warner Bros. Discovery which could cost upwards of $60 billion.\nOn October 28, 2025, Paramount CEO David Ellison said that he plans to shut down HBO Max as a standalone streaming service, and merge it with Paramount+ if the merger goes through, following Bob Iger's plans to shut down Hulu and merge it with Disney+ in 2026 (Hulu has already replaced Star in international markets outside of the United States and Japan). Ellison also says that Paramount wanted to keep most of Warner Bros. Discovery intact.\n\nCompany units\nParamount Skydance comprises 4 major business segments:\n\nParamount Skydance Studios consists of the company's film and television production studios.\nParamount Motion Picture Group focuses on theatrical film production and distribution, including film releases under Paramount Pictures, the company's namesake division and flagship label as well as the Paramount Animation, Paramount Players and Nickelodeon Movies labels. Other assets include Skydance Animation (and its animation studio division, Skydance Animation Madrid), Republic Pictures, Miramax and a 50% stake in United International Pictures. Paramount Pictures also consists of Paramount Studio Group (physical studio and post-production), production facilities and lot, and archives for restoration/preservation for Paramount Home Entertainment and Music.\nParamount Television Studios focuses on its television production for broadcast television and streaming.\nParamount Experiences focuses on the retailing and licensing of merchandising for Paramount Consumer Products, and also consists of some theme parks, and the video game studios Skydance Interactive and Skydance New Media.\nParamount Skydance Direct-to-Consumer focuses on the global over-the-top streaming services, and encompasses Paramount+, Pluto TV, SkyShowtime (50% with Comcast through Sky Group), CBS News 24/7, CBS Sports HQ, and an undisclosed stake in FuboTV, which it acquired in 2020.\nParamount Skydance TV Media encompasses the company's domestic and international linear television channels. The division also oversees See It Now Studios and a 50% stake in South Park Digital Studios.\nCBS Entertainment oversees CBS, CBS Studios, CBS Media Ventures (including Big Ticket Television), CBS News and Stations, and CBS Sports. It has a 12.5% ownership stake in The CW along with the Warner Bros. Television Group unit of Warner Bros. Discovery.\nBET Media Group (including BET Studios), which owns channels with the BET name.\nParamount Media Networks encompasses the pay television channels owned by Paramount in the United States such as MTV, Nickelodeon (including its animation studio, Avatar Studios and Nick Jr.), Comedy Central, TV Land, Paramount Network, Logo, CMT, Pop TV, Showtime, The Movie Channel, Flix, VH1 and the Smithsonian Channel.\nParamount International Networks encompasses certain international versions of their cable channels split into three regional hubs: United Kingdom and Australia, Europe, Middle East, Africa and Asia (EMEAA), and the Americas, as well as region-specific free-to-air networks (including Channel 5 in the United Kingdom, Network 10 in Australia, and Chilevisión in Chile). It also co-owns channels that were previously under the CBS name across Europe with AMC Networks International.\nParamount Global Content Distribution serves as the international television distribution arm for Paramount's television networks and streaming services.\nParamount Sports Entertainment focuses on scripted and unscripted sports programming, as well as interactive sports games and experiences. The division also oversees Skydance Sports, a joint venture with the NFL.\nOther businesses that are now part of Paramount Skydance include the current subsidiaries of National Amusements such as Showcase Cinemas and the Brazilian business of UCI Cinemas.\n\nLeadership\nBoard of Directors\nSource:\n\nDavid Ellison\nBarbara M. Bryne\nGerry Cardinale\nSafra A. Catz\nDennis K. Cinelli\nAndy Gordon\nJustin G. Hamill\nSherry Lansing\nPaul Marinelli\nJohn L. Thornton\nJeff Shell\n\nExecutives\nDavid Ellison, Chairman and CEO\nJay Askinasi, Chief Revenue Officer\nGeorge Cheeks, Chairman of TV Media\nMakan Delrahim, Chief Legal Officer\nDane Glasgow, Chief Product Officer\nDana Goldberg, Co-Chair of Paramount Pictures and Chair of Paramount Television\nAndy Gordon, Chief Strategy Officer and Chief Operating Officer\nJosh Greenstein, Co-Chair of Paramount Pictures and Vice Chair of Platforms\nCindy Holland, Chair of Direct-to-consumer\nStephanie Kyoko McKinnon, General Counsel\nJeff Shell, President\nJim Sterner, Chief People Officer\nAndrew C. Warren, Executive Vice President, Interim Chief Financial Officer\nMelissa Zukerman, Chief Communications Officer\n\nReferences\nExternal links\nOfficial website\nBusiness data for Paramount Skydance (Class B):",
  "clean_text": "Paramount Skydance Corporation (doing business as Paramount) is an American multinational mass media and entertainment conglomerate. It is headquartered at the Paramount Pictures lot in the Hollywood neighborhood of Los Angeles, California, with offices at the previous Skydance Media headquarters in Santa Monica, California and the previous Paramount Global headquarters at One Astor Plaza in New York City. The company was formed on August 7, 2025 by David Ellison, through the merger of Paramount Global and Skydance Media, after National Amusements was absorbed into the merged company. The company trades under the ticker symbol \"PSKY\" on the Nasdaq. Paramount Skydance properties are divided into four divisions: The first division is Paramount Skydance Studios, which consists of the Paramount Motion Pictures Group, Paramount Television Group and Paramount Experiences. The second division is Paramount Streaming, which includes the flagship Paramount+ streaming service, and PlutoTV. Paramount Streaming also includes Philo, which is a joint venture with A&E Global Media, AMC Networks, and Warner Bros. Discovery. And Paramount Streaming includes a 50% stake (together with Comcast) in the SkyShowtime streaming service. The third division is Paramount Skydance TV Media, which consists of the company's domestic and international linear television networks, including CBS Entertainment Group, Paramount Media Networks (which itself consists of BET Media Group, Nickelodeon, MTV Entertainment, and Showtime), and Paramount International Networks (which owns the international networks). The fourth division is Paramount Sports Entertainment. Background Through an assortment of corporate mergers, splits, and partnerships, Paramount Pictures, CBS, Viacom, and Skydance Media shared a long history prior to the 2025 merger joining the entities as Paramount Skydance. 1912–1986 Paramount Pictures was founded in 1912 as the Famous Players Film Company. CBS was founded in 1927, and Paramount Pictures held a 49% ownership stake in from 1929 to 1932. In 1952, CBS formed CBS Television Film Sales, a division which handled broadcast syndication rights for CBS's library of network-owned television series. This division was renamed CBS Films in 1958 and again renamed CBS Enterprises Inc. on December 1, 1967. It was renamed Viacom (an acronym of Video and Audio Communications) in 1970. In 1971, this syndication division was spun off amid new FCC rules forbidding television networks from owning syndication companies (these rules were eventually abolished completely in 1993). Meanwhile, Paramount Pictures was acquired by Gulf and Western Industries in 1966, which then re-branded itself as Paramount Communications in 1989. 1986–2005 In 1986, Viacom purchased MTV Networks and Showtime/The Movie Channel Inc. from Warner Communications and American Express. In 1987, a majority stake in Viacom was acquired by theater operator company National Amusements. Viacom then purchased a 50.1% stake in Paramount Communications in February 1994 for $9.75 billion, following a five-month battle with shopping channel QVC. The merger was completed in July. In 1999, Viacom made its biggest acquisition to date by announcing plans to merge with its former parent CBS Corporation (the renamed Westinghouse Electric Corporation, which had merged with CBS in 1995). The merger was completed in 2000, resulting in CBS reuniting with its former syndication division. 2005–2022 On December 31, 2005, Viacom was split into two companies: the second incarnation of CBS Corporation, the former's corporate successor, and the second incarnation of Viacom, which was formed as a spin-off. Skydance Media was founded in 2006 by David Ellison. In 2009, Skydance and Paramount Pictures signed a five-year co-financing, production and distribution agreement, with Paramount holding an additional option of distribution. That deal would later be extended twice in 2013 and 2017. History Formation In 2023, after struggling with debt and striving to remain competitive in the entertainment industry, Paramount's parent company, National Amusements, explored potential merger and acquisition opportunities for Paramount Global. Numerous prominent companies, such as Sony Pictures, Warner Bros. Discovery, Apollo Global Management, Warner Music Group, Allen Media Group, and Skydance Media, had indicated their interest in exploring potential business partnerships or purchasing the company. After first coming to a merger deal with Skydance, Paramount and Skydance canceled the proposed merger on June 11 due to unsatisfactory conversations. Following a break in the talks, Skydance was able to reach a preliminary agreement on July 2, 2024, to perform a 3-way merger between it, National Amusements, and Paramount to establish what was then known as \"New Paramount\". After the merger closed, Skydance Media CEO David Ellison became the chairman and CEO of the combined company and Jeff Shell became the president. Paramount said in February 2025, and May 2025, that it expected the transaction to close within the first half of the year, but it did not happen. With the deal not yet approved, the first automatic extension to July 7, 2025, went into effect on April 8, 2025, after which the second automatic extension to October 4, 2025 went into effect on July 7, 2025. The SEC and the European Commission (EC) approved the transaction in February 2025. On March 10, 2025, Skydance Media filed a letter with the Federal Trade Commission (FTC) about Project Rise Partners and concerning its bid for Paramount after the 45-day \"go shop\" period in the summer of 2024. In late March 2025, Federal Communications Commission (FCC) Chairman Brendan Carr announced that companies wishing to merge should eliminate policies aimed at promoting diversity, equity and inclusion (DEI). On July 22, 2025, it was reported that Oracle Corporation was in talks with Skydance Media for a $100 million-per-year contract to provide cloud software once the latter's acquisition of Paramount Global is completed. On July 24, the FCC approved the merger between Paramount Global and Skydance Media with the merger set to be complete by August 7. Numerous public reports cited a potential quid pro quo whereby Paramount/CBS agreed to pay $16 million to end a lawsuit filed on behalf of President Donald Trump to ensure government approval of the merger. Similar public reports also indicated another potential quid pro quo whereby CBS would terminate The Late Show with Stephen Colbert, to ensure federal approval of the merger. CBS executives denied both publicly reported claims, and insisted the 2026 ending of the Late Show franchise was purely based on a financial decision. Merger restructuring On August 4, 2025, Paramount Skydance announced some of its new leadership alongside Ellison and Shell, with Andy Gordon joining as COO and strategy officer; Cindy Holland leading streaming services Paramount+ and Pluto TV; Dana Goldberg and Josh Greenstein co-leading Paramount Pictures; and Paramount Global veteran George Cheeks leading television networks. It was also announced the same day that the company would comprise 3 major units: studios (consisting of Paramount Pictures, Skydance Pictures, Nickelodeon Movies and other divisions such as those for film, television and video games), direct-to-consumer (Paramount+ and Pluto TV) and television media (CBS, BET, MTV, Nickelodeon among others). It also announced the merger of Showtime/MTV Entertainment Studios and Skydance Television into a revival of Paramount Television Studios to be headed by Matt Thunell. Oversight of the television units would be split, with Thunell heading the studios division (focusing on the streaming services) and George Cheeks overseeing production for the television media division (focusing on the linear networks), as well as South Park, which renewed its standing with Paramount in a deal worth $1.5 billion. Three months later in October following Paramount Skydance's relaunch of Paramount Television Studios, it was announced that Nickelodeon Group's live-action studio Nickelodeon/Awesomeness Live-Action aka Nickelodeon Productions and Awesomeness' production studio including Nickelodeon's & Awesomeness' production states was folded into the relaunched studio Paramount Television Studios, with the relaunched studio taking over Nickelodeon's current production state alongside Awesomeness' current productions, and would produce their future production slates beginning with the upcoming Victorious spin-off series Hollywood Arts which was originally ordered at Nickelodeon had moved to Netflix as its first Nickelodeon-branded series produced by the revived studio. On August 5, 2025, Paramount Skydance announced layoffs of around 1,000 employees and a slashing of $2 billion in operating costs, alongside interest in a merger of Paramount+ and Pluto TV with assist from Oracle Corporation. On August 7, Jeff Shell announced that Paramount Skydance was exploring a sale of the NAI cinemas. On August 8, Paramount announced that they would be based in the Paramount Pictures lot in Los Angeles, departing from One Astor Plaza for the first time since the first Viacom moved there in 1994. On August 11, Paramount announced a seven-year deal with TKO Group Holdings where Ultimate Fighting Championship (UFC) will be exclusively distributed in the United States. UFC's 13 marquee numbered events and 30 \"Fight Nights\" will air on its streaming platform, Paramount+, with select numbered events also set to simulcast on CBS starting in 2026. On August 13, 2025, Paramount announced that Top Gun 3, Star Trek, and other projects were now priorities. Paramount executives are looking to release twenty films per year. Cindy Holland, chairperson of direct-to-consumer, said, \"We want to entertain all audiences around the world. On Paramount+ today, we have a really great foundation, which is the Taylor Sheridan universe. We also have incredible CBS next-day, live sports, a lot from the cable networks, franchises like Star Trek, so many series. We're seeking to expand that and make sure that we’re offering programming for everybody not just occasionally, not just for the one thing they came to watch but ultimately and hopefully a year round and a daily habit for all audiences.\" Streaming films will not be a priority per Ellison. Also that day, Shell announced $2 billion in cuts. \"We do not want to be a company that has layoffs every quarter. So, it is important for us to get done what we're doing in one big thing and then be done with it,\" Shell said. On August 19, Paramount announced a four-year deal with Matt and Ross Duffer, the creators of Stranger Things, for movies, television and streaming projects at Paramount+. The agreement will commence following the conclusion of their current deal with Netflix in April 2026. On September 2, 2025, Paramount Pictures announced that they and Microsoft-owned Activision Blizzard had inked a deal that will see the studio develop, produce and distribute a live-action film based on the Call of Duty franchise, which Ellison, a long-time fan of the series, considered a \"dream come true\". On September 3, Paramount Pictures announced that they signed a first-look, multi-picture deal with Will Smith and his company Westbrook. The deal will include films like Sugar Bandits and Rabbit Hole. Westbrook will also relocate to the Paramount lot in Hollywood. On September 4, Paramount Pictures and Legendary Entertainment announced a three-year worldwide film distribution deal. Under the deal, Paramount will market and distribute Legendary-developed and -produced theatrical films globally, excluding China, where Legendary East handles all marketing and distribution activities. Warner Bros. Pictures will continue to globally distribute films from select Legendary franchises including Dune: Part Three and Godzilla x Kong: Supernova (outside of Japan, which will be handled by Toho). The first film under the Paramount deal will be the live-action adaptation of the Street Fighter video game series. Also on September 4, Paramount announced a return to office policy that requires all employees to be in the office five days a week. On September 5, it was announced that Piers Morgan Uncensored will move from YouTube to 5 where it will air as a 90-minute highlights show starting September 12. On September 12, 2025, Paramount Skydance announced they would be launching a sports media division called Paramount Sports Entertainment, the division would produce scripted and unscripted programming for its own platforms as well as third-party media companies and streaming services, while also developing sports-focused interactive games and experiences while also housing Skydance Sports. The division is also expected to collaborate with CBS Sports, but it will not be directly involved in live sports broadcasts. The division would be led by Skydance Sports chairman Jesse Sisgold. On September 16, Paramount Skydance added AI executive Dennis K. Cinelli to its board as an independent director, effective immediately. The appointment expands the body to 11 directors. On September 17, 2025, it was announced that Marc Weinstock would be stepping down from his role as President of Worldwide Marketing and Distribution at Paramount Pictures. His departure comes as Josh Goldstine, the former marketing chief at Warner Bros., is expected to take over the position, according to media reports. On September 23, A former top official in the Trump Administration, Makan Delrahim, is in advanced talks to join the newly merged Paramount Global in a major legal role, according to sources with direct knowledge. On September 26, Pam Kaufman exited her role as Paramount President and CEO of International Markets, Global Consumer Products and Experiences. On October 6, 2025, it was announced that Paramount Skydance named Bari Weiss as editor-in-chief of CBS News after acquiring her outlet The Free Press, a deal valued at $150 million. On October 23, Paramount Skydance sold its Argentine television network Telefe alongside its regional stations in Santa Fe and Córdoba, its international channel Telefe Internacional and its production studios to holding company Grupo Televisión Litoral, a company of businessman Gustavo Scaglione and José Luis Manzano. On October 27, The Hollywood Reporter announced that Taylor Sheridan was leaving Paramount for NBCUniversal as Paramount did not offer Sheridan an offer to stay. Also on October 27, it was announced that John Dickerson would be leaving CBS News who has been employed with over 16 years. On October 29, Ellison said that redundancies that phasing out roles that are no longer aligned with its 'evolving priorities' were \"designed to strengthen our focus on growth\". Paramount announced anchors Dana Jacboson and Michelle Miller as well as producer Brian Applegate of CBS Saturday Morning would be a part of the 2,000 layoffs planned. The company announced the layoffs of motion picture divisions, including production, literary, marketing and music including executives Randy Spendlove, Bryan Oh, Geoff Stier, Andres Alvarez, Rachel Cadden, Christine Benitez, and Phil Cohen. Also TV Executives Teri Fleming, Pamela Soper, Amanda Palley, Rose Catherine Pinkney, Robi Reed, Wendy Plaut, Amanda Culkowski, Margaret Comeaux, Jeff Grossman, Patricia Kollappallil, Gregory Heller, Amy Campbell, and Andrea Ballas were a part of the layoffs. On October 30, 2025, Matt Thunell announced the department heads in areas such as Creative, Production, Business Affairs & Legal, Finance & BA, with some functions, including Talent & Casting and Corporate were either staying, newly hired, or promoted to different departments. Those named are Head of Development Shelley Zimmerman, EVP of Current Series Carolyn Harris, President of Showtime/MTV Entertainment Studio Keith Cox, Head of Production Drew Brown, Head of Business Affairs Virginia Lazalde-McPherson, EVP, Legal Affairs Lance McPherson, and Head of Finance Mel Rauch. Matt Hengemuhle moved from SVP, Financial Planning & Analysis to Direct to Consumer. Tricia Wood, EVP Casting for Paramount Pictures will also cast for Paramount Television Studios. Those leaving are EVP and Head of Global Production for Showtime/MTVE Keri Flint, EVP, TV Business & Legal Affairs for Skydance Jeff Hegedus, CFO, Paramount Media Networks, Showtime/MTVE Studios Candice Brancazio, EVP, Head of Live-Action Series, Films & Talent, Nickelodeon and Awesomeness TV Shauna Phelan, and EVP, Head of Global Talent and Content Development for Showtime/MTVE Trevor Rose. On November 10, 2025, Los Angeles Times reported that Paramount laid off 1,600 employees in South America in exchange of a reduction of 15% of its workforce and cost savings which are worth $3 billion. The next day, 600 employees chose the severance package and left their jobs instead of returning to the office. On November 14, Paramount announced its decision to sell Chilevisión to Vytal Group LTD. Also that day, U. S. House of Representatives Jamie Raskin and Frank Pallone, the top two Democrats on the House Energy & Commerce Committee, said Paramount had not fully cooperated with their investigation in the settlement agreement between Skydance, Paramount Global, and President Trump. In August, they had requested documents from Paramount, communications with the Trump administration, the Federal Communications Commission (FCC), and internal communications concerning the merger between Skydance and Paramount. Proposed joint venture with Apollo Global Management for possible acquisition of Warner Bros. Discovery According to reports, Bob Bakish, the president and CEO of Paramount Global, and David Zaslav, the CEO of Warner Bros. Discovery (Warner previously also held several channels that are currently owned by Paramount such as MTV, Nickelodeon, The Movie Channel, VH1, Comedy Central and BET; Paramount and Warner both hold stakes at The CW), met on December 20, 2023, to examine the possibility of a merger. While representatives for the two businesses said that negotiations were in the early stages and would not guarantee a deal, it was revealed through insider sources that Zaslav was \"not in deal mode\". Warner Bros. Discovery ended the merger negotiations with Paramount on February 27, 2024. In September 2025, The Wall Street Journal and others reported that Paramount Skydance was weighing a takeover of Warner Bros. Discovery, a deal that, unlike the Skydance–Paramount tie-up, was expected to sidestep Federal Communications Commission review because WBD holds no broadcast licenses. The idea drew immediate political scrutiny, with Senator Elizabeth Warren urging regulators to stop it, while price talk swung widely: early chatter reached about $70 billion, mid-month commentary pointed to the mid-$50 billions, and by September 19 reporting centered on scenarios \"north of\" $45 billion alongside a potential $22–$24 per-share offer structure that could be 70–80% cash, with support from Larry Ellison. By September 29, CNBC’s David Faber suggested a friendly agreement looked unlikely and that Paramount might need to take any bid directly to WBD shareholders. Industry voices spent the month debating what such a combination would mean. UTA chief David Kramer called it a mixed prospect for Hollywood, and FX Networks chairman John Landgraf predicted that large-scale consolidation among legacy studios was essentially unavoidable. Strategically, observers noted the sheer scale on offer: Paramount Skydance's roughly 4,500-film, 200,000-episode library (including the pre-1973 programming libraries of NBC and ABC) alongside Warner Bros.' catalog of about 10,000 films (including the pre-April 1986 MGM, February 1952 – May 1986 United Artists and pre-May 1982 Orion Pictures libraries) and 120,000 episodes and Discovery's ~70,000 episodes. Much industry speculation centred around how this could change competition, and the line-up of streaming services such as Pluto TV. Financially, late-month research cautioned that even post-deal, most earnings power would still come from traditional TV: Bernstein Research estimated roughly 70% of EBITDA would be tied to linear networks, even as KPMG highlighted US content spend surpassing $200 billion and continuing to rise. On October 2, 2025, CNBC speculated that their parent company, NBCUniversal, could be the biggest wild card for the acquisition of Warner Bros. Discovery's assets. On October 13, 2025, Warner Bros. Discovery rejected a proposed first bid from Paramount Skydance, but Paramount Skydance is considering to raise their offer or go directly to Warner Bros. Discovery's shareholders. On October 21, the New York Post said that Warner Bros. Discovery had privately rejected a new $24-a-share bid by Paramount Skydance. On October 8, the New York Post reported that Paramount Skydance was in talks with major private equity firms, including Apollo Global Management (the company that owns Legendary Entertainment and Cox Media Group) to join its possible bid to buy Warner Bros. Discovery which could cost upwards of $60 billion. On October 28, 2025, Paramount CEO David Ellison said that he plans to shut down HBO Max as a standalone streaming service, and merge it with Paramount+ if the merger goes through, following Bob Iger's plans to shut down Hulu and merge it with Disney+ in 2026 (Hulu has already replaced Star in international markets outside of the United States and Japan). Ellison also says that Paramount wanted to keep most of Warner Bros. Discovery intact. Company units Paramount Skydance comprises 4 major business segments: Paramount Skydance Studios consists of the company's film and television production studios. Paramount Motion Picture Group focuses on theatrical film production and distribution, including film releases under Paramount Pictures, the company's namesake division and flagship label as well as the Paramount Animation, Paramount Players and Nickelodeon Movies labels. Other assets include Skydance Animation (and its animation studio division, Skydance Animation Madrid), Republic Pictures, Miramax and a 50% stake in United International Pictures. Paramount Pictures also consists of Paramount Studio Group (physical studio and post-production), production facilities and lot, and archives for restoration/preservation for Paramount Home Entertainment and Music. Paramount Television Studios focuses on its television production for broadcast television and streaming. Paramount Experiences focuses on the retailing and licensing of merchandising for Paramount Consumer Products, and also consists of some theme parks, and the video game studios Skydance Interactive and Skydance New Media. Paramount Skydance Direct-to-Consumer focuses on the global over-the-top streaming services, and encompasses Paramount+, Pluto TV, SkyShowtime (50% with Comcast through Sky Group), CBS News 24/7, CBS Sports HQ, and an undisclosed stake in FuboTV, which it acquired in 2020. Paramount Skydance TV Media encompasses the company's domestic and international linear television channels. The division also oversees See It Now Studios and a 50% stake in South Park Digital Studios. CBS Entertainment oversees CBS, CBS Studios, CBS Media Ventures (including Big Ticket Television), CBS News and Stations, and CBS Sports. It has a 12.5% ownership stake in The CW along with the Warner Bros. Television Group unit of Warner Bros. Discovery. BET Media Group (including BET Studios), which owns channels with the BET name. Paramount Media Networks encompasses the pay television channels owned by Paramount in the United States such as MTV, Nickelodeon (including its animation studio, Avatar Studios and Nick Jr.), Comedy Central, TV Land, Paramount Network, Logo, CMT, Pop TV, Showtime, The Movie Channel, Flix, VH1 and the Smithsonian Channel. Paramount International Networks encompasses certain international versions of their cable channels split into three regional hubs: United Kingdom and Australia, Europe, Middle East, Africa and Asia (EMEAA), and the Americas, as well as region-specific free-to-air networks (including Channel 5 in the United Kingdom, Network 10 in Australia, and Chilevisión in Chile). It also co-owns channels that were previously under the CBS name across Europe with AMC Networks International. Paramount Global Content Distribution serves as the international television distribution arm for Paramount's television networks and streaming services. Paramount Sports Entertainment focuses on scripted and unscripted sports programming, as well as interactive sports games and experiences. The division also oversees Skydance Sports, a joint venture with the NFL. Other businesses that are now part of Paramount Skydance include the current subsidiaries of National Amusements such as Showcase Cinemas and the Brazilian business of UCI Cinemas. Leadership Board of Directors Source: David Ellison Barbara M. Bryne Gerry Cardinale Safra A. Catz Dennis K. Cinelli Andy Gordon Justin G. Hamill Sherry Lansing Paul Marinelli John L. Thornton Jeff Shell Executives David Ellison, Chairman and CEO Jay Askinasi, Chief Revenue Officer George Cheeks, Chairman of TV Media Makan Delrahim, Chief Legal Officer Dane Glasgow, Chief Product Officer Dana Goldberg, Co-Chair of Paramount Pictures and Chair of Paramount Television Andy Gordon, Chief Strategy Officer and Chief Operating Officer Josh Greenstein, Co-Chair of Paramount Pictures and Vice Chair of Platforms Cindy Holland, Chair of Direct-to-consumer Stephanie Kyoko McKinnon, General Counsel Jeff Shell, President Jim Sterner, Chief People Officer Andrew C. Warren, Executive Vice President, Interim Chief Financial Officer Melissa Zukerman, Chief Communications Officer"
}