{
  "ticker": "PSX",
  "cik": "0001534701",
  "company_name": "Phillips 66",
  "corrected_name": "Phillips 66",
  "wiki_title_used": "Phillips 66",
  "exists": true,
  "raw_text": "The Phillips 66 Company is an American multinational energy company headquartered in Westchase, Houston, Texas. Its name, dating back to 1927 as a trademark of the Phillips Petroleum Company, assisted in establishing the newly reconfigured Phillips 66. The company today was formed ten years after Phillips merged with Conoco to form ConocoPhillips. The merged company spun off its refining, chemical, and retail assets – known in the oil industry as downstream operations – into a new company bearing the Phillips 66 name. It began trading on the New York Stock Exchange on May 1, 2012, under the ticker PSX.\nThe company is engaged in refining, transporting, and marketing natural gas liquids (NGL) petrochemicals. It is also active in the research and development of emerging energy sources and partners with Chevron on chemicals through a joint venture known as Chevron Phillips Chemical.\nPhillips 66 is ranked No. 29 on the Fortune 500 list and No. 74 on the Fortune Global 500 list as of 2022, with revenues of over $115 billion USD. Phillips 66 has approximately 14,000 employees worldwide and is active in the United States, United Kingdom, Germany, Austria, and Switzerland, and owns and licenses service station brands across the country, such as 76 and Conoco within the United States, and JET in Europe.\n\nHistory\nBeginning (1917–1927)\nThe Phillips Petroleum Company was founded by Lee Eldas \"L.E.\" Phillips and Frank Phillips of Bartlesville, Oklahoma, and incorporated on June 13, 1917. The new company had assets of $3 million, 27 employees and land throughout Oklahoma and Kansas. After discovery of Texas's huge Panhandle gas field in 1918 and the Hugoton Field to its north in Kansas, Phillips became increasingly involved in the rapidly developing natural gas industry. In particular, the company specialized in extracting liquids from natural gas and, by 1925, was the nation's largest producer of natural gas liquids. According to the Phillips Petroleum Company Museum in Bartlesville, the \"Phillips 66\" name for the gasoline came about by a combination of events. The specific gravity of the gasoline was close to 66; the car testing the fuel did 66 miles per hour; and, the test took place on US Route 66.  So, the naming committee unanimously voted for “Phillips 66.”\n\nFirst service station (1927–1954)\nThe first Phillips 66 service station opened on November 19, 1927, at 805 E. Central Avenue in Wichita, Kansas. This station still stands, preserved by the local historical society. The first Phillips 66 service station built in Texas opened on July 27, 1928, on the corner of 5th and Main streets in Turkey, Texas. In 1932, the 76 brand, long familiar in the western U.S., was created by Union Oil Company of California (later Unocal). In 1946, Phillips purchased the Utah-based Wasatch Oil Co., bringing the Phillips 66 brand to the northern Rocky Mountain states and the far eastern portions of Oregon and Washington.\n\nMotor oil (1954–2000)\nPhillips was among the first oil companies to introduce a multi-grade motor oil, \"TropArtic,\" in 1954. Such motor oils were designed to be used year-round in automobile engines, as opposed to single grades for which different grades of motor oils were recommended to meet weather variances. Phillips 66 sells motor oil under the Kendall brand.\nPhillips also had gasoline stations in Canada's western provinces of Alberta, British Columbia, Manitoba, and Saskatchewan under the name Pacific 66 until the late 1970s.\nIn 1966, Phillips entered the West Coast market by purchasing Tidewater Oil Co.'s refining and marketing properties in that region and rebranding all Flying A distributorships and service stations to Phillips 66.\n\nIn 1967, Phillips became the nation's second oil company, after Texaco, to sell and market gasoline in all 50 states, by opening a Phillips 66 station in Anchorage, Alaska. However, Phillips' experiment in 50-state marketing was short-lived.\nThe company withdrew from gasoline marketing in the northeastern U.S. in 1972, and sold the former Tidewater properties on the West Coast to The Oil & Shale Corporation (Tosco) in 1976. Today, Phillips 66 primarily operates in the Midwest and Southwest. In recent years, the 76, Phillips 66 and Conoco brand-names have begun to reappear in Eastern markets, including the New York City metro region, via a licensing deal with Motiva Enterprises.\n\nMergers (2000–2012)\nPhillips Petroleum created a joint venture with Chevron Corporation's chemicals and plastics division in 2000 and also acquired ARCO Alaska from BP. It purchased Tosco, which included Circle K convenience stores and Union 76 gasoline, in 2001. In 1983, Phillips Petroleum purchased the General American Oil Company from owners Algur H. Meadows, Henry W. Peters, and Ralph G. Trippett.\nIn 2002, Phillips Petroleum merged with Conoco to form ConocoPhillips. The merged company continued marketing gasoline and other products under the Phillips 66, Conoco, and 76 brands. However, Phillips 66 Company licenses the Phillips 66 brand to Suncor Energy for its Phillips 66-branded stations in Colorado.\n\nSpin-off from ConocoPhillips (2012–present)\nIn 2012, Phillips 66 was spun off from ConocoPhillips, creating a company about as big as Valero Energy, the largest refiner at the time.\nIn October 2013, two workers were injured in an accident at the company's Humber refinery, which resulted in Phillips 66 being fined more than £1.2 million by the Health and Safety Executive in May 2020.\nOn December 30, 2013, it was announced that Berkshire Hathaway would trade more than 19 million of its 27.2 million shares in Phillips 66 to acquire a business that makes additives that help crude oil flow through pipelines.  The final number of shares was determined when the deal closed.\nOn February 17, 2015, Phillips 66 sold two natural gas pipeline systems to its affiliate, Phillips 66 Partners, for $1.01 billion in cash and stock. In 2025, Phillips 66 bought the NGL companies EPIC Y-Grade GP LLC and EPIC Y-Grade LP for $2.2 billion, which own NGL pipelines, as well as fractionation and distribution systems and several subsidiaries. The purchase Phillips 66 connected operations in the Permian basin with Gulf Coast refineries and export sites.\nIn December 2017, Phillips 66 made a bid to acquire Propel Fuels and both companies began working together with Propel disclosing proprietary data and strategies. In August 2018, Phillips 66 terminated the acquisition deal. In February 2022, Propel filed a lawsuit against Phillips 66’s California business, after Phillips 66 started to develop a renewable fuel business. In October 2024, a jury ordered Phillips 66 to pay $604.9 million in damages to Propel for violating the California Uniform Trade Secrets Act.\nIn January 2023, Phillips 66 acquired all of the publicly traded stocks of DCP Midsteam's pipeline operations for $3.8 billion. Through this acquisition the total amount of Phillips 66’s stake in DCP doubled to 86.8%.\n\nMarketing\nFrom the late 1930s until the 1960s, Phillips employed registered nurses as spokespersons for their company, calling them \"Highway Hostesses\". They made random visits to Phillips 66 stations within their districts. The nurses inspected station restroom facilities to ensure they were clean and stocked with supplies. They also served as concierges, spreading goodwill for the company by helping motorists identify suitable dining and lodging facilities. (Union 76 employed similar hostesses, called the \"Sparkle Corps\".)\nIn 1973, Phillips began billing itself as \"The Performance Company,\" promoting innovations with asphaltic materials, fertilizers, and other non-automotive products as well as its traditional automotive products. Other slogans have included: \"Go first-class.... Go Phillips 66\"; \"The gasoline that won the West\"; \"Good things for cars and the people who drive them\"; \"Hard working gas\"; and \"At Phillips 66, it's performance that counts.\" Their slogan as of July 2015 is \"Proud To Be Here\". Phillips 66's newest slogan as of 2017 is “Live To The Full”.\nPhillips 66 has long been a supporter of basketball in the Midwest and Southwest, particularly at the collegiate and senior amateur level. The men's and women's conference basketball tournaments of the Big Eight Conference, which featured multiple universities in Phillips 66's footprint, was officially sponsored by the firm since the 1980s: the sponsorship would move to its successor, the Big 12 Conference, in 1997, and Phillips remains the tournament's presenting sponsor to this day. Company employees founded the Phillips 66ers team in 1919, initially playing against other Bartlesville and Tulsa-area company teams or athletic clubs. Chairman Frank Phillips would later expand the team to play a high-quality, nationwide schedule against other amateur teams while marketing Phillips 66 products. Before the foundation of the NBA after World War II, many top collegiate players would continue to play organized ball on these \"industrial\" teams while earning a living as corporate employees and keeping their amateur status to play in the Olympics. The most notable 66er was Bob Kurland, who won two NCAA titles at nearby Oklahoma A&M and was considered one of American basketball's first great \"big men\". The 7-footer passed up the opportunity to play pro for a marketing job at Phillips, winning three AAU titles and two Olympic gold medals while eventually rising to the executive level and helping to develop self-serve gas stations. Rising pro salaries and the resulting loss of national media coverage spelled doom for senior AAU ball, though, and the 66ers would close up shop after losing in the 1968 AAU quarterfinals.\nPhillips 66 sponsored PBS programming during the 1980s. It funded A.M. Weather; The Search for Solutions; and Onstage with Judith Somogi.\n\nLogo\nThe Phillips 66 shield logo, linking it to U.S. Route 66, was introduced in 1930. After a series of changes to the color scheme including the popular dark green with orange and blue trim, the company settled on black and orange color scheme that would last nearly thirty years. In 1959, Phillips replaced these colors with red, white and black, the one still deployed. The first design had the second 6 lower than the first; the current design does not.\n\nOperations\nIn the United States, the company operates Conoco, Phillips 66 and 76 stations.  In Europe, Phillips 66 operates Jet filling stations in Austria, Denmark, Germany, Sweden and the United Kingdom.  It sold its Jet stations in Belgium, the Czech Republic, Finland, Hungary, Poland and Slovakia to its Russian affiliate, Lukoil. It uses the Coop identity in Switzerland. The company is the fourth largest finished lubricants supplier in the United States. Phillips 66 has stations in 44 U.S. states, just behind Shell Oil Company and ExxonMobil, lacking a presence in Alaska, Delaware, Maine, New Hampshire, Vermont, and West Virginia.\nPhillips 66 owns 13 refineries with a net crude oil capacity of 2.2 million barrels per day (350×10^3 m3/d), 10,000 branded marketing outlets, and 15,000 miles (24,000 km) of pipelines.  It has 50 percent stake in DCP Midstream, LLC, a natural gas gatherers and processors with 7.2 billion cubic feet per day (200×10^6 m3/d) of processing capacity. It also owns 50 percent stake in Chevron Phillips Chemical Co.\nPhillips 66 also owns a one-quarter share in the controversial Dakota Access Pipeline.\n\nRefineries\n* Denotes joint ventures.\nSources (Mar 31, 2011)\nIn 2015, the Los Angeles refinery was processing 21,512 barrels per day of Amazonian oil. Phillips 66's Los Angeles (CA), Lake Charles (LA), San Francisco (CA), and Sweeney (TX) refineries were receiving and processing crude oil from the Amazon River Basin of South America. The San Francisco Refinery converted from fossil fuels to renewable diesel fuel. Closure of the Los Angeles Refinery was announced in 2024.\n\nCorporate affairs\nIn 2012, after Phillips 66 split from ConocoPhillips, it moved its operations from the ConocoPhillips headquarters to the Pinnacle Westchase building, a nine-story Class A office building located on 8.4 acres (3.4 ha) of land in Westchase, Houston. This was a temporary headquarters location.\nIn July 2016, Phillips 66 completed its move to a new permanent headquarters on a 14-acre (5.7 ha) plot of land in Westchase. The new headquarters is between Westheimer Road and Briar Forest, in close proximity to the Sam Houston Tollway. Phillips 66 purchased the land from a subsidiary of Thomas Properties Group. The architect of record is HOK. The official groundbreaking was in November 2013, and the opening was completed on schedule. The 1.1 million square foot headquarters includes conference spaces, medical facilities, food service facilities, outdoor recreational space, a gymnasium with full-size basketball court, and training facilities. Irrigation of the outdoor landscaping is via a reclaimed water system. The new campus houses 2,200 workers who were spread among six different Houston locations, including the ConocoPhillips headquarters, where several hundred Phillips 66 workers had remained post spin-off.\nOn 4 August 2015 it was announced that the company had formed a \"long-term partnership\" with English non-league association football club Leamington F.C. The deal involved, amongst other things, the renaming of the club's ground from \"The New Windmill Ground\" to \"The Phillips 66 Community Stadium.\"\n\nEnvironmental Impact\nPollution of the Calcasieu Estuary Bayou Verdine\nIn 2003, the U.S. Environmental Protection Agency completed a remedial investigation for the Calcasieu Estuary. EPAs investigation found that contamination in Bayou Verdine did not pose a threat to people but was harmful to plants and animals.\nIn 2010, Phillips 66 and Sasol signed a consent decree agreeing to clean up the Bayou Verdine.\nIn December 2011, EPA approved the removal action work plan.\nCleanup work began in September 2012.\nBayou Verdine is located in a heavily industrialized area; over 30 major companies are active nearby. The two companies responsible for cleaning up the bayou, Phillips 66 and Sasol North America (the cleanup parties), operate a petroleum refinery and a petrochemical complex. Both of these facilities have operated for decades, during which time their operations contaminated bayou sediments with polycyclic aromatic hydrocarbons (PAHs) and heavy metals. Cleanup work began in September 2012.  The cleanup parties first prepared a settling basin to receive sediments to be dredged from the bayou. Two pre-existing ponds on the refinery property had been created decades ago to provide fill for construction of nearby Interstate 10. One of these ponds (the east pond) was converted into the settling basin. It was emptied by pumping the water into the bayou. The bottom sediments were solidified by mixing in fly ash and a drainage system was placed at the bottom of the basin. Finally, the cleanup parties installed a flexible membrane liner on the bottom of the settling basin as an extra precaution.  Bayou dredging followed. The cleanup parties used hydraulic dredging and mechanical excavation techniques to remove the top 1 to 2 feet of sediments from about 7,000 feet of the bayou on the Phillips 66 refinery property and downstream. The dredged sediment and water mixture (slurry) was then pumped through a pipeline to the settling basin, where the sediment was allowed to separate from the water by gravity settling. The water was tested and then released into the bayou in accordance with a discharge permit from the state. About 30,000 cubic yards of bayou sediments were placed in the containment cell. Dredging was completed in February 2014.  During the cleanup process, EPA provided updates to the Calcasieu Estuary Task Force (a group of local leaders). EPA and the cleanup parties also provided fact sheets to the task force and others to keep the community informed during the cleanup.\n\nViolation on the Clean Water Act\nOn November 21, 2024, Phillips 66 was indicted in U.S. federal court on six counts of violation the Clean Water Act.\n\nCarbon footprint\nPhillips 66 reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 30,050 Kt (-4,690 /-13.5% y-o-y).\n\nNotes\nReferences\nExternal links\n\nOfficial website \nBusiness data for Phillips 66: \nInvestor Update with Phillips 66 Business Prospects April, 2012\nIndependent Business Analysis of Phillips 66",
  "clean_text": "The Phillips 66 Company is an American multinational energy company headquartered in Westchase, Houston, Texas. Its name, dating back to 1927 as a trademark of the Phillips Petroleum Company, assisted in establishing the newly reconfigured Phillips 66. The company today was formed ten years after Phillips merged with Conoco to form ConocoPhillips. The merged company spun off its refining, chemical, and retail assets – known in the oil industry as downstream operations – into a new company bearing the Phillips 66 name. It began trading on the New York Stock Exchange on May 1, 2012, under the ticker PSX. The company is engaged in refining, transporting, and marketing natural gas liquids (NGL) petrochemicals. It is also active in the research and development of emerging energy sources and partners with Chevron on chemicals through a joint venture known as Chevron Phillips Chemical. Phillips 66 is ranked No. 29 on the Fortune 500 list and No. 74 on the Fortune Global 500 list as of 2022, with revenues of over $115 billion USD. Phillips 66 has approximately 14,000 employees worldwide and is active in the United States, United Kingdom, Germany, Austria, and Switzerland, and owns and licenses service station brands across the country, such as 76 and Conoco within the United States, and JET in Europe. History Beginning (1917–1927) The Phillips Petroleum Company was founded by Lee Eldas \"L.E.\" Phillips and Frank Phillips of Bartlesville, Oklahoma, and incorporated on June 13, 1917. The new company had assets of $3 million, 27 employees and land throughout Oklahoma and Kansas. After discovery of Texas's huge Panhandle gas field in 1918 and the Hugoton Field to its north in Kansas, Phillips became increasingly involved in the rapidly developing natural gas industry. In particular, the company specialized in extracting liquids from natural gas and, by 1925, was the nation's largest producer of natural gas liquids. According to the Phillips Petroleum Company Museum in Bartlesville, the \"Phillips 66\" name for the gasoline came about by a combination of events. The specific gravity of the gasoline was close to 66; the car testing the fuel did 66 miles per hour; and, the test took place on US Route 66. So, the naming committee unanimously voted for “Phillips 66.” First service station (1927–1954) The first Phillips 66 service station opened on November 19, 1927, at 805 E. Central Avenue in Wichita, Kansas. This station still stands, preserved by the local historical society. The first Phillips 66 service station built in Texas opened on July 27, 1928, on the corner of 5th and Main streets in Turkey, Texas. In 1932, the 76 brand, long familiar in the western U.S., was created by Union Oil Company of California (later Unocal). In 1946, Phillips purchased the Utah-based Wasatch Oil Co., bringing the Phillips 66 brand to the northern Rocky Mountain states and the far eastern portions of Oregon and Washington. Motor oil (1954–2000) Phillips was among the first oil companies to introduce a multi-grade motor oil, \"TropArtic,\" in 1954. Such motor oils were designed to be used year-round in automobile engines, as opposed to single grades for which different grades of motor oils were recommended to meet weather variances. Phillips 66 sells motor oil under the Kendall brand. Phillips also had gasoline stations in Canada's western provinces of Alberta, British Columbia, Manitoba, and Saskatchewan under the name Pacific 66 until the late 1970s. In 1966, Phillips entered the West Coast market by purchasing Tidewater Oil Co.'s refining and marketing properties in that region and rebranding all Flying A distributorships and service stations to Phillips 66. In 1967, Phillips became the nation's second oil company, after Texaco, to sell and market gasoline in all 50 states, by opening a Phillips 66 station in Anchorage, Alaska. However, Phillips' experiment in 50-state marketing was short-lived. The company withdrew from gasoline marketing in the northeastern U.S. in 1972, and sold the former Tidewater properties on the West Coast to The Oil & Shale Corporation (Tosco) in 1976. Today, Phillips 66 primarily operates in the Midwest and Southwest. In recent years, the 76, Phillips 66 and Conoco brand-names have begun to reappear in Eastern markets, including the New York City metro region, via a licensing deal with Motiva Enterprises. Mergers (2000–2012) Phillips Petroleum created a joint venture with Chevron Corporation's chemicals and plastics division in 2000 and also acquired ARCO Alaska from BP. It purchased Tosco, which included Circle K convenience stores and Union 76 gasoline, in 2001. In 1983, Phillips Petroleum purchased the General American Oil Company from owners Algur H. Meadows, Henry W. Peters, and Ralph G. Trippett. In 2002, Phillips Petroleum merged with Conoco to form ConocoPhillips. The merged company continued marketing gasoline and other products under the Phillips 66, Conoco, and 76 brands. However, Phillips 66 Company licenses the Phillips 66 brand to Suncor Energy for its Phillips 66-branded stations in Colorado. Spin-off from ConocoPhillips (2012–present) In 2012, Phillips 66 was spun off from ConocoPhillips, creating a company about as big as Valero Energy, the largest refiner at the time. In October 2013, two workers were injured in an accident at the company's Humber refinery, which resulted in Phillips 66 being fined more than £1.2 million by the Health and Safety Executive in May 2020. On December 30, 2013, it was announced that Berkshire Hathaway would trade more than 19 million of its 27.2 million shares in Phillips 66 to acquire a business that makes additives that help crude oil flow through pipelines. The final number of shares was determined when the deal closed. On February 17, 2015, Phillips 66 sold two natural gas pipeline systems to its affiliate, Phillips 66 Partners, for $1.01 billion in cash and stock. In 2025, Phillips 66 bought the NGL companies EPIC Y-Grade GP LLC and EPIC Y-Grade LP for $2.2 billion, which own NGL pipelines, as well as fractionation and distribution systems and several subsidiaries. The purchase Phillips 66 connected operations in the Permian basin with Gulf Coast refineries and export sites. In December 2017, Phillips 66 made a bid to acquire Propel Fuels and both companies began working together with Propel disclosing proprietary data and strategies. In August 2018, Phillips 66 terminated the acquisition deal. In February 2022, Propel filed a lawsuit against Phillips 66’s California business, after Phillips 66 started to develop a renewable fuel business. In October 2024, a jury ordered Phillips 66 to pay $604.9 million in damages to Propel for violating the California Uniform Trade Secrets Act. In January 2023, Phillips 66 acquired all of the publicly traded stocks of DCP Midsteam's pipeline operations for $3.8 billion. Through this acquisition the total amount of Phillips 66’s stake in DCP doubled to 86.8%. Marketing From the late 1930s until the 1960s, Phillips employed registered nurses as spokespersons for their company, calling them \"Highway Hostesses\". They made random visits to Phillips 66 stations within their districts. The nurses inspected station restroom facilities to ensure they were clean and stocked with supplies. They also served as concierges, spreading goodwill for the company by helping motorists identify suitable dining and lodging facilities. (Union 76 employed similar hostesses, called the \"Sparkle Corps\".) In 1973, Phillips began billing itself as \"The Performance Company,\" promoting innovations with asphaltic materials, fertilizers, and other non-automotive products as well as its traditional automotive products. Other slogans have included: \"Go first-class.... Go Phillips 66\"; \"The gasoline that won the West\"; \"Good things for cars and the people who drive them\"; \"Hard working gas\"; and \"At Phillips 66, it's performance that counts.\" Their slogan as of July 2015 is \"Proud To Be Here\". Phillips 66's newest slogan as of 2017 is “Live To The Full”. Phillips 66 has long been a supporter of basketball in the Midwest and Southwest, particularly at the collegiate and senior amateur level. The men's and women's conference basketball tournaments of the Big Eight Conference, which featured multiple universities in Phillips 66's footprint, was officially sponsored by the firm since the 1980s: the sponsorship would move to its successor, the Big 12 Conference, in 1997, and Phillips remains the tournament's presenting sponsor to this day. Company employees founded the Phillips 66ers team in 1919, initially playing against other Bartlesville and Tulsa-area company teams or athletic clubs. Chairman Frank Phillips would later expand the team to play a high-quality, nationwide schedule against other amateur teams while marketing Phillips 66 products. Before the foundation of the NBA after World War II, many top collegiate players would continue to play organized ball on these \"industrial\" teams while earning a living as corporate employees and keeping their amateur status to play in the Olympics. The most notable 66er was Bob Kurland, who won two NCAA titles at nearby Oklahoma A&M and was considered one of American basketball's first great \"big men\". The 7-footer passed up the opportunity to play pro for a marketing job at Phillips, winning three AAU titles and two Olympic gold medals while eventually rising to the executive level and helping to develop self-serve gas stations. Rising pro salaries and the resulting loss of national media coverage spelled doom for senior AAU ball, though, and the 66ers would close up shop after losing in the 1968 AAU quarterfinals. Phillips 66 sponsored PBS programming during the 1980s. It funded A.M. Weather; The Search for Solutions; and Onstage with Judith Somogi. Logo The Phillips 66 shield logo, linking it to U.S. Route 66, was introduced in 1930. After a series of changes to the color scheme including the popular dark green with orange and blue trim, the company settled on black and orange color scheme that would last nearly thirty years. In 1959, Phillips replaced these colors with red, white and black, the one still deployed. The first design had the second 6 lower than the first; the current design does not. Operations In the United States, the company operates Conoco, Phillips 66 and 76 stations. In Europe, Phillips 66 operates Jet filling stations in Austria, Denmark, Germany, Sweden and the United Kingdom. It sold its Jet stations in Belgium, the Czech Republic, Finland, Hungary, Poland and Slovakia to its Russian affiliate, Lukoil. It uses the Coop identity in Switzerland. The company is the fourth largest finished lubricants supplier in the United States. Phillips 66 has stations in 44 U.S. states, just behind Shell Oil Company and ExxonMobil, lacking a presence in Alaska, Delaware, Maine, New Hampshire, Vermont, and West Virginia. Phillips 66 owns 13 refineries with a net crude oil capacity of 2.2 million barrels per day (350×10^3 m3/d), 10,000 branded marketing outlets, and 15,000 miles (24,000 km) of pipelines. It has 50 percent stake in DCP Midstream, LLC, a natural gas gatherers and processors with 7.2 billion cubic feet per day (200×10^6 m3/d) of processing capacity. It also owns 50 percent stake in Chevron Phillips Chemical Co. Phillips 66 also owns a one-quarter share in the controversial Dakota Access Pipeline. Refineries * Denotes joint ventures. Sources (Mar 31, 2011) In 2015, the Los Angeles refinery was processing 21,512 barrels per day of Amazonian oil. Phillips 66's Los Angeles (CA), Lake Charles (LA), San Francisco (CA), and Sweeney (TX) refineries were receiving and processing crude oil from the Amazon River Basin of South America. The San Francisco Refinery converted from fossil fuels to renewable diesel fuel. Closure of the Los Angeles Refinery was announced in 2024. Corporate affairs In 2012, after Phillips 66 split from ConocoPhillips, it moved its operations from the ConocoPhillips headquarters to the Pinnacle Westchase building, a nine-story Class A office building located on 8.4 acres (3.4 ha) of land in Westchase, Houston. This was a temporary headquarters location. In July 2016, Phillips 66 completed its move to a new permanent headquarters on a 14-acre (5.7 ha) plot of land in Westchase. The new headquarters is between Westheimer Road and Briar Forest, in close proximity to the Sam Houston Tollway. Phillips 66 purchased the land from a subsidiary of Thomas Properties Group. The architect of record is HOK. The official groundbreaking was in November 2013, and the opening was completed on schedule. The 1.1 million square foot headquarters includes conference spaces, medical facilities, food service facilities, outdoor recreational space, a gymnasium with full-size basketball court, and training facilities. Irrigation of the outdoor landscaping is via a reclaimed water system. The new campus houses 2,200 workers who were spread among six different Houston locations, including the ConocoPhillips headquarters, where several hundred Phillips 66 workers had remained post spin-off. On 4 August 2015 it was announced that the company had formed a \"long-term partnership\" with English non-league association football club Leamington F.C. The deal involved, amongst other things, the renaming of the club's ground from \"The New Windmill Ground\" to \"The Phillips 66 Community Stadium.\" Environmental Impact Pollution of the Calcasieu Estuary Bayou Verdine In 2003, the U.S. Environmental Protection Agency completed a remedial investigation for the Calcasieu Estuary. EPAs investigation found that contamination in Bayou Verdine did not pose a threat to people but was harmful to plants and animals. In 2010, Phillips 66 and Sasol signed a consent decree agreeing to clean up the Bayou Verdine. In December 2011, EPA approved the removal action work plan. Cleanup work began in September 2012. Bayou Verdine is located in a heavily industrialized area; over 30 major companies are active nearby. The two companies responsible for cleaning up the bayou, Phillips 66 and Sasol North America (the cleanup parties), operate a petroleum refinery and a petrochemical complex. Both of these facilities have operated for decades, during which time their operations contaminated bayou sediments with polycyclic aromatic hydrocarbons (PAHs) and heavy metals. Cleanup work began in September 2012. The cleanup parties first prepared a settling basin to receive sediments to be dredged from the bayou. Two pre-existing ponds on the refinery property had been created decades ago to provide fill for construction of nearby Interstate 10. One of these ponds (the east pond) was converted into the settling basin. It was emptied by pumping the water into the bayou. The bottom sediments were solidified by mixing in fly ash and a drainage system was placed at the bottom of the basin. Finally, the cleanup parties installed a flexible membrane liner on the bottom of the settling basin as an extra precaution. Bayou dredging followed. The cleanup parties used hydraulic dredging and mechanical excavation techniques to remove the top 1 to 2 feet of sediments from about 7,000 feet of the bayou on the Phillips 66 refinery property and downstream. The dredged sediment and water mixture (slurry) was then pumped through a pipeline to the settling basin, where the sediment was allowed to separate from the water by gravity settling. The water was tested and then released into the bayou in accordance with a discharge permit from the state. About 30,000 cubic yards of bayou sediments were placed in the containment cell. Dredging was completed in February 2014. During the cleanup process, EPA provided updates to the Calcasieu Estuary Task Force (a group of local leaders). EPA and the cleanup parties also provided fact sheets to the task force and others to keep the community informed during the cleanup. Violation on the Clean Water Act On November 21, 2024, Phillips 66 was indicted in U.S. federal court on six counts of violation the Clean Water Act. Carbon footprint Phillips 66 reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 30,050 Kt (-4,690 /-13.5% y-o-y). Notes"
}