{
  "ticker": "PTC",
  "cik": "0000857005",
  "company_name": "PTC Inc.",
  "corrected_name": "PTC Inc.",
  "wiki_title_used": "PTC Inc.",
  "exists": true,
  "raw_text": "PTC Inc. (formerly Parametric Technology Corporation) is an American computer software and services company founded in 1985 and headquartered in Boston, Massachusetts. The company was a pioneer in parametric, associative feature-based, solid computer-aided design (CAD) modeling software in 1988, including an Internet-based product for Product Lifecycle Management (PLM) in 1998. PTC (NASDAQ: PTC) markets products and services and an Internet of Things (IoT) and augmented reality (AR) platform for partners and developers.\n\nProducts\nPTC has eight core product families: Creo, Windchill, Mathcad, Integrity, Servigistics, ThingWorx, ServiceMax, Arbortext Editor. The company's technology is primarily used by discrete manufacturers to design, operate and maintain complex products. PTC's technology is also used to connect products to the Internet for the purposes of capturing and analyzing information from them.\n\nPTC Creo\nThe PTC CAD product provides a set of Computer Aided Design capabilities. PTC CAD is a suite of 2D and 3D product design software used to create, analyze and view product designs. PTC Creo software was released in June 2011 to replace and supersede PTC's products formerly known as Pro/ENGINEER, CoCreate, and ProductView.\n\nPTC Windchill\nWeb-based database software that provides access to product information like MCAD and ECAD data files, process documents, and software engineering information. The PTC Windchill product provides a set of PLM Product Lifecycle Management capabilities and consists of multiple products.\n\nPTC Integrity\nPTC Integrity provides a set of Application Lifecycle Management (ALM) and Systems Engineering capabilities.\n\nPTC Servigistics\nService lifecycle management SLM software that is used by manufacturers to understand how service planning, customer service, and analysis of returned product data can improve service value over a product's life.\n\nThingWorx\nA platform for the rapid development of applications designed for smart, connected sensors, devices, and products – or the Internet of Things.\n\nVuforia\nVuforia is an Augmented Reality Software Development Kit (SDK) for mobile devices that enables the creation of augmented reality applications.\n\nHistory\n1985 - Company founded by Samuel Geisberg, and Mike Payne formerly from Prime Computer, Computervision, and Applicon.\n1988 - Steve Walske named CEO.  Company shipped Pro/ENGINEER and was considered first to market with parametric modeling design software.  This positions PTC as a leader in the CAD industry until the mid-1990s when a new generation of low-cost competitors arrive in the market.\n1989 - Initial public offering at the NASDAQ exchange. \n1992 - Caterpillar Inc. becomes PTC's largest customer. \n1996 - PTC acquires Reflex project modeling and management software technology sold the following year to the Beck Group.\n1998 - Company ships Windchill and is considered first to market with internet-based solutions for Product Lifecycle Management (PLM). \n1999 - PTC announces it has 25,000 customers. Major industries include aerospace, retail/footwear/apparel, automotive, industrial equipment, consumer products, electronics, and high tech. \n1999 - Acquired Division Group (Division Ltd, Bristol Uk, Division Inc) Virtual reality - dVision Head Mounted Display & Software\n2002 - The company releases Pro/ENGINEER Wildfire.   This is the first CAD system to support web-based services.\n2005 - Acquired Arbortext for technical publishing technology.   Acquired Aptavis for retail, footwear and apparel technology. \n2006 - Acquired Mathsoft for its engineering calculation software.   Acquired ITEDO for its 3D technical illustration software. \n2007 - Acquired CoCreate for its direct modeling technology. \n2008 - Acquired Synapsis for its performance analytics technology to improve environmental performance of products. \n2009 - Acquired Relex Software for its reliability engineering software. \n2010 - James E. Heppelmann announced as CEO effective October 1, 2010. Company renames Pro/ENGINEER to PTC Creo and promises the market product design software that is scalable, open, and easy-to-use. \n2011 - Acquired 4CS  for its warranty, service, support and service parts technology.   Acquired MKS for its application lifecycle management technology for all software development processes.  \n2012 - Acquired Servigistics for its suite of service lifecycle management software. \n2013 - Acquired NetIDEAS hosting vendor for more technology deployment options.  Acquired Enigma for its ability to deliver technical content to aftermarket service environments. Acquired Internet of Things platform developer ThingWorx for their software applications that connect and track network-enabled products.\n2014 - Acquired Axeda Corporation\n2014 - Acquired ATEGO Software, a leader in MBSE (model-based systems engineering) tool used in aerospace, transportation, and automotive industries (such as Alstom Transport and Rolls-Royce Defence) \n2016 - Paid $28 million to resolve probes by the U.S. Department of Justice and the Securities and Exchange Commission, alleging PTC subsidiaries paid over $1.5 million in bribes to Chinese government officials between 2006 and 2011.\n\nCompanies acquired by PTC\nPrime Computer in 1992.\nCDRS and 3DPaint from Evans & Sutherland on April 12, 1995, for $33,507,000.\nRasna Corp., developers of MECHANICA design optimization and simulation software, in May 1995 for $180 million.\nPTC acquires Reflex project modeling and management software technology in July 1996, for $30m.\nComputervision, developers of CADDS, MEDUSA and the MPDS Plant Design System in 1998 \nDivision Group (Division Ltd, Division Inc) dVisor Virtual Reality HMD\nPolyplan, Technologies acquired 2005 for Manufacturing Process Management\nArbortext in 2005, for $190 million \nDENC AG and Cadtrain Inc. in late 2005 for an aggregate of $10 million. DENC adds a German consulting practice with expertise integrating PTC applications with enterprise-resource-planning software. Irvine, Calif.-based Cadtrain provides online training modules for PTC software.\nAptavis Technology Corp, Windchill-based technology and expertise for retail, footwear and apparel, in June 2005\nMathsoft, developers of Mathcad, in April 2006 for $63 million.\nITEDO Software GmbH in October 2006 for $17 million.  ITEDO developed technical illustration software and had 34 employees mainly in Germany and the United States.\nNC Graphics in May 2007 for an undisclosed sum.\nNetRegulus, Inc, an Enterprise Study and Quality management software for Medical Devices, in November 2007\nCoCreate in December 2007 for $250 million.\nSynapsis Technology in December 2008 for an undisclosed sum.\nRelex Software in June 2009 for $25 Million.\nPlanet Metrics in January 2010 for an undisclosed sum.\nMKS Software makers of MKS Integrity - May, 2011\n4CS Software Solutions Inc, a developer of warranty management and service lifecycle management software for an undisclosed sum \nServigistics in August 2012\nEnigma in July 2013\nNetIDEAS in September 2013\nThingWorx in January 2014 \nAtego (company), a developer of model-based systems and software engineering applications based in Cheltenham, UK for approximately $50 million in cash in July 2014 \nAxeda Corporation - a leader in the M2M / IoT space connecting things with people and other things, based in Foxborough, MA for approximately $170 million in cash in August 2014\nColdlight in 2015\nVuforia in 2015\nKepware in 2015 for approximately $100 million, plus up to an additional $18 million based on achievement of certain strategic initiatives and financial results.\nOnshape in October 2019.\nintland (Product CodeBeamer) in May 2022.\nIncQuery Group in April 2025.\n\nSupport of STEM Education\nIn 1999, PTC created a Global Academic Program designed to support educational initiatives in science, technology, engineering, and math (STEM) skills.  The program aims to partner schools and universities with companies to assist students in developing real-world skills needed for careers in manufacturing, technology, and other STEM jobs.   The program also has a direct recruitment program intended to place students in jobs with PTC's commercial customers.\nPTC has also been a corporate sponsor of FIRST (For Inspiration and Recognition of Science and Technology) since 2008, providing participating students with access to PTC software for use in the FIRST Tech Challenge, FIRST Robotics Competition, FIRST Lego League, and FIRST World Championship.\n\nAwards and accolades\n4th Annual Postscapes Internet of Things (IoT) Awards:\n\nReferences\nExternal links\nOfficial website",
  "clean_text": "PTC Inc. (formerly Parametric Technology Corporation) is an American computer software and services company founded in 1985 and headquartered in Boston, Massachusetts. The company was a pioneer in parametric, associative feature-based, solid computer-aided design (CAD) modeling software in 1988, including an Internet-based product for Product Lifecycle Management (PLM) in 1998. PTC (NASDAQ: PTC) markets products and services and an Internet of Things (IoT) and augmented reality (AR) platform for partners and developers. Products PTC has eight core product families: Creo, Windchill, Mathcad, Integrity, Servigistics, ThingWorx, ServiceMax, Arbortext Editor. The company's technology is primarily used by discrete manufacturers to design, operate and maintain complex products. PTC's technology is also used to connect products to the Internet for the purposes of capturing and analyzing information from them. PTC Creo The PTC CAD product provides a set of Computer Aided Design capabilities. PTC CAD is a suite of 2D and 3D product design software used to create, analyze and view product designs. PTC Creo software was released in June 2011 to replace and supersede PTC's products formerly known as Pro/ENGINEER, CoCreate, and ProductView. PTC Windchill Web-based database software that provides access to product information like MCAD and ECAD data files, process documents, and software engineering information. The PTC Windchill product provides a set of PLM Product Lifecycle Management capabilities and consists of multiple products. PTC Integrity PTC Integrity provides a set of Application Lifecycle Management (ALM) and Systems Engineering capabilities. PTC Servigistics Service lifecycle management SLM software that is used by manufacturers to understand how service planning, customer service, and analysis of returned product data can improve service value over a product's life. ThingWorx A platform for the rapid development of applications designed for smart, connected sensors, devices, and products – or the Internet of Things. Vuforia Vuforia is an Augmented Reality Software Development Kit (SDK) for mobile devices that enables the creation of augmented reality applications. History 1985 - Company founded by Samuel Geisberg, and Mike Payne formerly from Prime Computer, Computervision, and Applicon. 1988 - Steve Walske named CEO. Company shipped Pro/ENGINEER and was considered first to market with parametric modeling design software. This positions PTC as a leader in the CAD industry until the mid-1990s when a new generation of low-cost competitors arrive in the market. 1989 - Initial public offering at the NASDAQ exchange. 1992 - Caterpillar Inc. becomes PTC's largest customer. 1996 - PTC acquires Reflex project modeling and management software technology sold the following year to the Beck Group. 1998 - Company ships Windchill and is considered first to market with internet-based solutions for Product Lifecycle Management (PLM). 1999 - PTC announces it has 25,000 customers. Major industries include aerospace, retail/footwear/apparel, automotive, industrial equipment, consumer products, electronics, and high tech. 1999 - Acquired Division Group (Division Ltd, Bristol Uk, Division Inc) Virtual reality - dVision Head Mounted Display & Software 2002 - The company releases Pro/ENGINEER Wildfire. This is the first CAD system to support web-based services. 2005 - Acquired Arbortext for technical publishing technology. Acquired Aptavis for retail, footwear and apparel technology. 2006 - Acquired Mathsoft for its engineering calculation software. Acquired ITEDO for its 3D technical illustration software. 2007 - Acquired CoCreate for its direct modeling technology. 2008 - Acquired Synapsis for its performance analytics technology to improve environmental performance of products. 2009 - Acquired Relex Software for its reliability engineering software. 2010 - James E. Heppelmann announced as CEO effective October 1, 2010. Company renames Pro/ENGINEER to PTC Creo and promises the market product design software that is scalable, open, and easy-to-use. 2011 - Acquired 4CS for its warranty, service, support and service parts technology. Acquired MKS for its application lifecycle management technology for all software development processes. 2012 - Acquired Servigistics for its suite of service lifecycle management software. 2013 - Acquired NetIDEAS hosting vendor for more technology deployment options. Acquired Enigma for its ability to deliver technical content to aftermarket service environments. Acquired Internet of Things platform developer ThingWorx for their software applications that connect and track network-enabled products. 2014 - Acquired Axeda Corporation 2014 - Acquired ATEGO Software, a leader in MBSE (model-based systems engineering) tool used in aerospace, transportation, and automotive industries (such as Alstom Transport and Rolls-Royce Defence) 2016 - Paid $28 million to resolve probes by the U.S. Department of Justice and the Securities and Exchange Commission, alleging PTC subsidiaries paid over $1.5 million in bribes to Chinese government officials between 2006 and 2011. Companies acquired by PTC Prime Computer in 1992. CDRS and 3DPaint from Evans & Sutherland on April 12, 1995, for $33,507,000. Rasna Corp., developers of MECHANICA design optimization and simulation software, in May 1995 for $180 million. PTC acquires Reflex project modeling and management software technology in July 1996, for $30m. Computervision, developers of CADDS, MEDUSA and the MPDS Plant Design System in 1998 Division Group (Division Ltd, Division Inc) dVisor Virtual Reality HMD Polyplan, Technologies acquired 2005 for Manufacturing Process Management Arbortext in 2005, for $190 million DENC AG and Cadtrain Inc. in late 2005 for an aggregate of $10 million. DENC adds a German consulting practice with expertise integrating PTC applications with enterprise-resource-planning software. Irvine, Calif.-based Cadtrain provides online training modules for PTC software. Aptavis Technology Corp, Windchill-based technology and expertise for retail, footwear and apparel, in June 2005 Mathsoft, developers of Mathcad, in April 2006 for $63 million. ITEDO Software GmbH in October 2006 for $17 million. ITEDO developed technical illustration software and had 34 employees mainly in Germany and the United States. NC Graphics in May 2007 for an undisclosed sum. NetRegulus, Inc, an Enterprise Study and Quality management software for Medical Devices, in November 2007 CoCreate in December 2007 for $250 million. Synapsis Technology in December 2008 for an undisclosed sum. Relex Software in June 2009 for $25 Million. Planet Metrics in January 2010 for an undisclosed sum. MKS Software makers of MKS Integrity - May, 2011 4CS Software Solutions Inc, a developer of warranty management and service lifecycle management software for an undisclosed sum Servigistics in August 2012 Enigma in July 2013 NetIDEAS in September 2013 ThingWorx in January 2014 Atego (company), a developer of model-based systems and software engineering applications based in Cheltenham, UK for approximately $50 million in cash in July 2014 Axeda Corporation - a leader in the M2M / IoT space connecting things with people and other things, based in Foxborough, MA for approximately $170 million in cash in August 2014 Coldlight in 2015 Vuforia in 2015 Kepware in 2015 for approximately $100 million, plus up to an additional $18 million based on achievement of certain strategic initiatives and financial results. Onshape in October 2019. intland (Product CodeBeamer) in May 2022. IncQuery Group in April 2025. Support of STEM Education In 1999, PTC created a Global Academic Program designed to support educational initiatives in science, technology, engineering, and math (STEM) skills. The program aims to partner schools and universities with companies to assist students in developing real-world skills needed for careers in manufacturing, technology, and other STEM jobs. The program also has a direct recruitment program intended to place students in jobs with PTC's commercial customers. PTC has also been a corporate sponsor of FIRST (For Inspiration and Recognition of Science and Technology) since 2008, providing participating students with access to PTC software for use in the FIRST Tech Challenge, FIRST Robotics Competition, FIRST Lego League, and FIRST World Championship. Awards and accolades 4th Annual Postscapes Internet of Things (IoT) Awards:"
}