{
  "ticker": "PWR",
  "cik": "0001050915",
  "company_name": "Quanta Services",
  "corrected_name": "Quanta Services",
  "wiki_title_used": "Quanta Services",
  "exists": true,
  "raw_text": "Quanta Services is a U.S. corporation that provides infrastructure services for the electric power, pipeline, industrial and communications industries. Its capabilities include planning, design, installation, program management, maintenance and repair of most types of network infrastructure. The company has grown organically since its founding, but it has also acquired over 150 companies in the electrical contracting industry. It has provided its services and expertise to many major electrical transmission construction  projects,\nQuanta Services employs about 40,000. Measured as part of the S&P 500, its operating companies achieved combined revenues of about $24.9 billion (US) in 2024. It is headquartered in Houston, Texas. In 1998, Quanta went public on the New York Stock Exchange under the ticker symbol PWR.\n\nHistory\nFormation and early leadership\nJohn R. Colson, founder and former executive chairman of Quanta Services, influenced the consolidation of the U.S. electrical contracting industry in the late 20th century. After earning a degree from the University of Missouri–Kansas City, Colson served in the U.S. Army. Upon his discharge in 1971, he began his civilian career at PAR Electrical Contractors in Kansas City, Missouri, a firm specializing in high-voltage transmission lines, distribution lines, substations, and other electric utility infrastructure services. Colson's career thrived; in three years, he was promoted to manager of engineering services; then became vice president of operations. By the early 1980s, Colson was executive vice president and general manager. In the late1980s, he acquired ownership of PAR, becoming its president in 1991.\nDuring this period, the U.S. electrical contracting sector was highly fragmented, comprising approximately 50,000 predominantly small, owner-operated enterprises. Recognizing the potential for greater efficiency and competitiveness through consolidation, Colson initiated a strategic merger. In 1997, he successfully combined PAR with three other regional contractors—Union Power Construction Co., Trans Tech Electric Inc., and Potelco Inc.—to form Quanta Services, headquartered in Houston, Texas.\n\nInitial public offering and financial growth\nIn February 1998, with BT Alex Brown Incorporated as underwriters, Quanta completed its initial public offering (IPO), raising $45 million. In July 2000, using Morgan Stanley Dean Witter, the company offered an additional 2.72 million shares for sale. According to the company's website, initially acquired telecom companies included Manuel Brothers, Smith Contracting, Telecom Network Specialists, North Pacific Construction Company, NorAm Telecommunications, Spalj Construction Company and Golden State Utility Company. Acquired electric contractors included Harker & Harker, Sumter Builders and Environmental Professional Associates. Hybrid acquisitions included Wilson Roadbores and Underground Construction Company.\nIn 2009 the company replaced Ingersoll Rand on the S&P 500 Index.\n\nUtiliCorp takeover bid\nIn 2001, Quanta became the target of a takeover attempt by UtiliCorp United Inc. (later Aquila, Inc.), an energy company with which Quanta had maintained a longstanding business relationship since the 1950s. \nAt the time, UtiliCorp held a 38.5% equity stake in Quanta—an investment initially a part of a strategic alliance under which UtiliCorp outsourced all of its utility maintenance operations to Quanta. Quanta's leadership resisted the attempted acquisition. In October 2001, the two companies entered into a standstill agreement, effectively halting further acquisition efforts. The following month, Quanta adopted a shareholder rights plan—a \"poison pill\"—to prevent UtiliCorp from increasing its ownership stake beyond 39%. Tensions escalated into a proxy contest in 2002, as Quanta alleged that UtiliCorp, facing mounting financial difficulties, sought to assume control in order to consolidate Quanta's earnings into its own financial statements. The dispute was resolved in May 2002, when UtiliCorp withdrew its takeover bid and all associated litigation. As part of the settlement, both parties agreed to a revised corporate governance structure, including changes to the composition of Quanta's board of directors.\n\nSale of telecommunication and fiber-optic licensing divisions\nOn November 20, 2012, Quanta sold its telecommunications subsidiaries for $275 million in cash to Dycom. On August 4, 2015, the firm sold its fiber optic licensing operations (Sunesys) to Crown Castle International Corp. (NYSE: CCI) for approximately $1 billion(US) in cash.\n\nAcquisitions\nAccording to its website, Quanta employs a decentralized acquisition strategy that allows its acquisitions to retain their management, brand and customers. They have over 180 acquired companies employing 35,000 workers.  Acquisitions began shortly after the original company was formed. In 1999, the organization acquired 11 companies with total revenues of $150 million(US). In 2000, the firm bought the Utilities Construction Company, TVS Systems, Southeast Pipeline Construction, MC Underground, the Croce Electric Company, and the Eastern Communications Corporation. \nIn 2007, Quanta bought Infrasource Services for $1.26 billion(US) in an all-stock transaction. In 2009, it purchased Price Gregory, specializing in the building of large-diameter transmission pipelines, for $350 million(US) in a cash and stock deal.  In 2019, Quanta purchased Hallen Construction, a gas utility contractor serving the northeast, contractors R.R. Cassidy and Florida's Marathon Construction Services for $328 million(US) in cash and $2 million(US) in stock.\n In 2021 the firm purchased the Blattner Company, a Minnesota-based renewable contracting company, for $2.7 billion(US) in stock and cash, a move that will assist Quanta in growing in the rapidly expanding renewable energy resources category.\n Also in 2021, Quanta acquired William E. Groves Construction of Madisonville, Kentucky.\n\nIn 2023, the company added RP Construction Services, a solar power contractor, to its family of companies. The same year, Quanta purchased Pennsylvania Transformer Technology, designer and builder of transformers, substation units and other electrical power components, for $300 million(US) in a cash and stock transaction.\n In 2024, the firm bought California-based Cupertino Electric for $1.5 billion(US) in a mostly cash transaction providing Quanta with Cupertino's skilled workers and help the company take a position as an all-purpose power transmission and distribution resource. Cupertino, founded in 1954, was the US’ sixth largest electrical contractor and has installed electrical power in over 20 million sq. ft. of data centers, now experiencing exponential growth with the onset of artificial intelligence.\n Also in 2024, the firm acquired the electric power components manufacturer Sherman and Reilly, founded in Chattanooga in 1927. Quanta acquired its first steel mill, Hybar LLC, whose Arkansas plant will be manufacturing steel rebar, used in large energy power projects. The cost was undisclosed.\n\nLeadership\nOn March 14, 2016, Earl C. “Duke” Austin succeeded former chief executive officer Jim O’Neil. Austin is currently president, chief executive officer and chief operating officer. He is a graduate of Sam Houston State University in Huntsville, Texas, and  the former president of Quanta's Operating Unit: North Houston Pole Line.\nOther senior officers include Chief Financial Officer Jayshree Desai.  B.J. Ducey serves as President of Strategic Operations. Scot Fluharty is President, Underground Utilitiesand the President, Electric Power is Karl Studer.\n\nMajor projects\nSunZia Transmission and Wind Project\nIn 2023, the Pattern Energy Group chose Quanta to build the SunZia Transmission and Wind Project, a 550-mile, 525 kV high voltage transmission project that will relay power from a New Mexico wind farm across the US Southwest. Blattner, a Quanta company, will supply equipment for the wind farm and switchyard. Quanta will also design and construct the 3.5 G W wind power farm that will provide the power for transmitting. Construction is planned to be finished in 2025. Plans for the project were initially submitted in 2006 but full approval took 17 years. The Pattern Energy Group closed $11 billion (US) in non-recourse financing for construction of the tandem projects, which were called by Pattern to be “…the largest clean energy infrastructure project in U.S. history.”\n\nColorado Power Pathway\nAlso in 2023, Xcel Energy awarded Quanta a contract to manage the construction of the Colorado Power Pathway, 610 miles of 345 kV transmission wires, towers and substations through 12 counties in eastern Colorado. The project will increase Colorado's power grid reliability and provide accessibility for future renewable energy projects. The utility is investing $1.7 billion (US) in the Pathway project that will provide renewable electric power from Colorado's Eastern Plains to the Front Range. This project also offers support for Xcel's Clean Energy Plan which is projected to lessen carbon emissions by 85% by 2030 as well as the utility's 2050 carbon vision whereby they plan to provide 100% carbon-free electric power.\n\nFort McMurray Transmission Project\nIn 2019, the Alberta (Canada) Utilities Commission approved a $1.6 billion (Can) electric power transmission project that runs from Edmonton to the Fort McMurray area. The project included building a 500 km single-circuit transmission line, three optical repeater locations and expansion of an existing substation. The project was awarded to the Alberta PowerLine team – Canada Utilities, Atco and Quanta to “develop, finance, design, build, own, operate and maintain” the line. Funding came through the largest (at the time) public-private-partnership in Canada's history and was also the longest 500 kV transmission line in the country. The Ft. McMurray project was completed on budget, three months before it was scheduled.\n\nLower Rio Grande Valley Energized Reconductor Project\nOn June 13, 2016, American Electric Power (AEP) received the 89th annual Edison Electric Institute's (EEI's) 2016 Edison Award, an electric power industry honor, for its Energized Reconductor Project in the Lower Rio Grande Valley (LRGV) of Texas. The 240-mile project was possible because of Quanta Energized Services planning capabilities and North Houston Pole Line's construction expertise.\n\nReferences\nExternal links\nBusiness data for Quanta Services:",
  "clean_text": "Quanta Services is a U.S. corporation that provides infrastructure services for the electric power, pipeline, industrial and communications industries. Its capabilities include planning, design, installation, program management, maintenance and repair of most types of network infrastructure. The company has grown organically since its founding, but it has also acquired over 150 companies in the electrical contracting industry. It has provided its services and expertise to many major electrical transmission construction projects, Quanta Services employs about 40,000. Measured as part of the S&P 500, its operating companies achieved combined revenues of about $24.9 billion (US) in 2024. It is headquartered in Houston, Texas. In 1998, Quanta went public on the New York Stock Exchange under the ticker symbol PWR. History Formation and early leadership John R. Colson, founder and former executive chairman of Quanta Services, influenced the consolidation of the U.S. electrical contracting industry in the late 20th century. After earning a degree from the University of Missouri–Kansas City, Colson served in the U.S. Army. Upon his discharge in 1971, he began his civilian career at PAR Electrical Contractors in Kansas City, Missouri, a firm specializing in high-voltage transmission lines, distribution lines, substations, and other electric utility infrastructure services. Colson's career thrived; in three years, he was promoted to manager of engineering services; then became vice president of operations. By the early 1980s, Colson was executive vice president and general manager. In the late1980s, he acquired ownership of PAR, becoming its president in 1991. During this period, the U.S. electrical contracting sector was highly fragmented, comprising approximately 50,000 predominantly small, owner-operated enterprises. Recognizing the potential for greater efficiency and competitiveness through consolidation, Colson initiated a strategic merger. In 1997, he successfully combined PAR with three other regional contractors—Union Power Construction Co., Trans Tech Electric Inc., and Potelco Inc.—to form Quanta Services, headquartered in Houston, Texas. Initial public offering and financial growth In February 1998, with BT Alex Brown Incorporated as underwriters, Quanta completed its initial public offering (IPO), raising $45 million. In July 2000, using Morgan Stanley Dean Witter, the company offered an additional 2.72 million shares for sale. According to the company's website, initially acquired telecom companies included Manuel Brothers, Smith Contracting, Telecom Network Specialists, North Pacific Construction Company, NorAm Telecommunications, Spalj Construction Company and Golden State Utility Company. Acquired electric contractors included Harker & Harker, Sumter Builders and Environmental Professional Associates. Hybrid acquisitions included Wilson Roadbores and Underground Construction Company. In 2009 the company replaced Ingersoll Rand on the S&P 500 Index. UtiliCorp takeover bid In 2001, Quanta became the target of a takeover attempt by UtiliCorp United Inc. (later Aquila, Inc.), an energy company with which Quanta had maintained a longstanding business relationship since the 1950s. At the time, UtiliCorp held a 38.5% equity stake in Quanta—an investment initially a part of a strategic alliance under which UtiliCorp outsourced all of its utility maintenance operations to Quanta. Quanta's leadership resisted the attempted acquisition. In October 2001, the two companies entered into a standstill agreement, effectively halting further acquisition efforts. The following month, Quanta adopted a shareholder rights plan—a \"poison pill\"—to prevent UtiliCorp from increasing its ownership stake beyond 39%. Tensions escalated into a proxy contest in 2002, as Quanta alleged that UtiliCorp, facing mounting financial difficulties, sought to assume control in order to consolidate Quanta's earnings into its own financial statements. The dispute was resolved in May 2002, when UtiliCorp withdrew its takeover bid and all associated litigation. As part of the settlement, both parties agreed to a revised corporate governance structure, including changes to the composition of Quanta's board of directors. Sale of telecommunication and fiber-optic licensing divisions On November 20, 2012, Quanta sold its telecommunications subsidiaries for $275 million in cash to Dycom. On August 4, 2015, the firm sold its fiber optic licensing operations (Sunesys) to Crown Castle International Corp. (NYSE: CCI) for approximately $1 billion(US) in cash. Acquisitions According to its website, Quanta employs a decentralized acquisition strategy that allows its acquisitions to retain their management, brand and customers. They have over 180 acquired companies employing 35,000 workers. Acquisitions began shortly after the original company was formed. In 1999, the organization acquired 11 companies with total revenues of $150 million(US). In 2000, the firm bought the Utilities Construction Company, TVS Systems, Southeast Pipeline Construction, MC Underground, the Croce Electric Company, and the Eastern Communications Corporation. In 2007, Quanta bought Infrasource Services for $1.26 billion(US) in an all-stock transaction. In 2009, it purchased Price Gregory, specializing in the building of large-diameter transmission pipelines, for $350 million(US) in a cash and stock deal. In 2019, Quanta purchased Hallen Construction, a gas utility contractor serving the northeast, contractors R.R. Cassidy and Florida's Marathon Construction Services for $328 million(US) in cash and $2 million(US) in stock. In 2021 the firm purchased the Blattner Company, a Minnesota-based renewable contracting company, for $2.7 billion(US) in stock and cash, a move that will assist Quanta in growing in the rapidly expanding renewable energy resources category. Also in 2021, Quanta acquired William E. Groves Construction of Madisonville, Kentucky. In 2023, the company added RP Construction Services, a solar power contractor, to its family of companies. The same year, Quanta purchased Pennsylvania Transformer Technology, designer and builder of transformers, substation units and other electrical power components, for $300 million(US) in a cash and stock transaction. In 2024, the firm bought California-based Cupertino Electric for $1.5 billion(US) in a mostly cash transaction providing Quanta with Cupertino's skilled workers and help the company take a position as an all-purpose power transmission and distribution resource. Cupertino, founded in 1954, was the US’ sixth largest electrical contractor and has installed electrical power in over 20 million sq. ft. of data centers, now experiencing exponential growth with the onset of artificial intelligence. Also in 2024, the firm acquired the electric power components manufacturer Sherman and Reilly, founded in Chattanooga in 1927. Quanta acquired its first steel mill, Hybar LLC, whose Arkansas plant will be manufacturing steel rebar, used in large energy power projects. The cost was undisclosed. Leadership On March 14, 2016, Earl C. “Duke” Austin succeeded former chief executive officer Jim O’Neil. Austin is currently president, chief executive officer and chief operating officer. He is a graduate of Sam Houston State University in Huntsville, Texas, and the former president of Quanta's Operating Unit: North Houston Pole Line. Other senior officers include Chief Financial Officer Jayshree Desai. B.J. Ducey serves as President of Strategic Operations. Scot Fluharty is President, Underground Utilitiesand the President, Electric Power is Karl Studer. Major projects SunZia Transmission and Wind Project In 2023, the Pattern Energy Group chose Quanta to build the SunZia Transmission and Wind Project, a 550-mile, 525 kV high voltage transmission project that will relay power from a New Mexico wind farm across the US Southwest. Blattner, a Quanta company, will supply equipment for the wind farm and switchyard. Quanta will also design and construct the 3.5 G W wind power farm that will provide the power for transmitting. Construction is planned to be finished in 2025. Plans for the project were initially submitted in 2006 but full approval took 17 years. The Pattern Energy Group closed $11 billion (US) in non-recourse financing for construction of the tandem projects, which were called by Pattern to be “…the largest clean energy infrastructure project in U.S. history.” Colorado Power Pathway Also in 2023, Xcel Energy awarded Quanta a contract to manage the construction of the Colorado Power Pathway, 610 miles of 345 kV transmission wires, towers and substations through 12 counties in eastern Colorado. The project will increase Colorado's power grid reliability and provide accessibility for future renewable energy projects. The utility is investing $1.7 billion (US) in the Pathway project that will provide renewable electric power from Colorado's Eastern Plains to the Front Range. This project also offers support for Xcel's Clean Energy Plan which is projected to lessen carbon emissions by 85% by 2030 as well as the utility's 2050 carbon vision whereby they plan to provide 100% carbon-free electric power. Fort McMurray Transmission Project In 2019, the Alberta (Canada) Utilities Commission approved a $1.6 billion (Can) electric power transmission project that runs from Edmonton to the Fort McMurray area. The project included building a 500 km single-circuit transmission line, three optical repeater locations and expansion of an existing substation. The project was awarded to the Alberta PowerLine team – Canada Utilities, Atco and Quanta to “develop, finance, design, build, own, operate and maintain” the line. Funding came through the largest (at the time) public-private-partnership in Canada's history and was also the longest 500 kV transmission line in the country. The Ft. McMurray project was completed on budget, three months before it was scheduled. Lower Rio Grande Valley Energized Reconductor Project On June 13, 2016, American Electric Power (AEP) received the 89th annual Edison Electric Institute's (EEI's) 2016 Edison Award, an electric power industry honor, for its Energized Reconductor Project in the Lower Rio Grande Valley (LRGV) of Texas. The 240-mile project was possible because of Quanta Energized Services planning capabilities and North Houston Pole Line's construction expertise."
}