{
  "ticker": "QCOM",
  "cik": "0000804328",
  "company_name": "Qualcomm",
  "corrected_name": "Qualcomm",
  "wiki_title_used": "Qualcomm",
  "exists": true,
  "raw_text": "Qualcomm Incorporated () is an American multinational corporation headquartered in San Diego, California, and incorporated in Delaware. It creates semiconductors, software and services related to wireless technology. It owns patents critical to the 5G, 4G, CDMA2000, TD-SCDMA and WCDMA mobile communications standards.\nQualcomm was established in 1985 by Irwin Jacobs and six others. Its early research into code-division multiple access (CDMA) wireless cell phone technology was funded by selling a two-way mobile digital satellite communications system known as Omnitracs. After a heated debate in the wireless industry, CDMA was adopted as a 2G standard in North America, with Qualcomm's patents incorporated. Afterwards, there was a series of legal disputes about pricing for licensing patents required by the standard.\nOver the years, Qualcomm has expanded into selling semiconductor products in a predominantly fabless manufacturing model.\n\nHistory\nEarly history\nQualcomm was created in July 1985 by seven former Linkabit employees led by Irwin Jacobs. Other co-founders included Andrew Viterbi, Franklin Antonio, Adelia Coffman, Andrew Cohen, Klein Gilhousen, and Harvey White. The company was named Qualcomm for \"Quality Communications\". It started as a contract research and development center largely for government and defense projects.\nQualcomm merged with Omninet in 1988 and raised $3.5 million in funding to produce the Omnitracs satellite communications system for trucking companies. Qualcomm grew from eight employees in 1986 to 620 employees in 1991, due to demand for Omnitracs. By 1989, Qualcomm had $32 million in revenue, 50 percent of which was from an Omnitracs contract with Schneider National. Omnitracs profits helped fund Qualcomm's research and development into code-division multiple access (CDMA) technologies for cell phone networks.\n\n1990–2015\nQualcomm was operating at a loss in the 1990s due to its investment in CDMA research. To obtain funding, the company filed an initial public offering in September 1991, raising $68 million. An additional $486 million was raised in 1995 through the sale of 11.5 million more shares. The second funding round was done to raise money for the mass manufacturing of CDMA-based phones, base-stations, and equipment, after most US-based cellular networks announced they would adopt the CDMA standard. The company had $383 million in annual revenue in 1995 and $814 million by 1996.\nIn 1998, Qualcomm was restructured, leading to a 700-employee layoff. Its base station and cell-phone manufacturing businesses were spun-off in order to focus on its higher-margin patents and chipset businesses. Since the base station division was losing $400M a year (having never sold another base station after making its 10th sale), profits skyrocketed in the following year, and Qualcomm was the fastest growing stock on the market with a 2,621 percent growth over one year. By 2000, Qualcomm had grown to 6,300 employees, $3.2 billion in revenues, and $670 million in profit. 39 percent of its sales were from CDMA technology, followed by licensing (22%), wireless (22%), and other products (17%). Around this time, Qualcomm established offices in Europe, Asia Pacific, and in the Americas. By 2001, 65 percent of Qualcomm's revenues originated from outside the United States with 35 percent coming from South Korea.\nIn 2005, Paul E. Jacobs, son of Qualcomm founder Irwin Jacobs, was appointed as Qualcomm's new CEO. Whereas Irwin Jacobs focused on CDMA patents, Paul Jacobs refocused much of Qualcomm's new research and development on projects related to the Internet of things. In the same year they acquired Flarion Technologies, a developer of wireless broadband Orthogonal Frequency Division Multiplex Access (OFDMA) technology.\nQualcomm announced Steven Mollenkopf would succeed Paul Jacobs as CEO in December 2013. Mollenkopf said he would expand Qualcomm's focus to wireless technology for cars, wearable devices, and other new markets.\n\n2015–2024: NXP, Broadcom and Nuvia\nQualcomm announced its intent to acquire NXP Semiconductors for $47 billion in October 2016. The deal was approved by U.S. antitrust regulators in April 2017 with some standard-essential patents excluded to get the deal approved.\nAs the NXP acquisition was ongoing, Broadcom made a $103 billion offer to acquire Qualcomm, and Qualcomm rejected the offer. Broadcom attempted a hostile takeover, and raised its offer, eventually to $121 billion. The potential Broadcom acquisition was investigated by the U.S. Committee on Foreign Investment and blocked by an executive order from U.S. President Donald Trump, citing national security concerns.\nQualcomm's NXP acquisition then became a part of the 2018 China–United States trade war. U.S. president Donald Trump blocked China-based ZTE Corporation from buying American-made components, such as those from Qualcomm. The ZTE restriction was lifted after the two countries reached an agreement, but then Trump raised tariffs against Chinese goods. Qualcomm extended a tender offer to NXP at least 29 times pending Chinese approval, before abandoning the deal in July 2018.\nOn January 6, 2021, Qualcomm appointed its president and chip division head Cristiano Amon as its new chief executive.\nOn January 13, 2021, Qualcomm announced it would acquire Nuvia, a server CPU startup founded in early 2019 by ex-Apple and ex-Google architects, for approximately $1.4 billion. The acquisition was completed in March 2021, and it was announced that its first products would be laptop CPUs, shipping in the second half of 2022.\nIn March 2022, Qualcomm acquired the advanced driver-assistance systems and autonomous driving software brand Arriver from the investment company SSW Partners.\nIn June 2022, Qualcomm acquired Israeli startup Cellwize through its investment arm Qualcomm Ventures.\nIn August 2022, Bloomberg News reported that Qualcomm was planning to return to server CPU market based on Nuvia's product. Later that month, Arm Ltd. announced that it sued Qualcomm and Nuvia for breaching license agreements and trademark violations. Arm cited that the chip designs using Arm licenses developed by Nuvia could not be transferred to its parent Qualcomm without permission. Qualcomm indicated that its licenses with Arm cover custom-designed processors.\nIn January 2023, the company announced a new partnership with Salesforce to develop a connected vehicle platform for automakers using the Snapdragon digital chassis.\nIn May 2023, Qualcomm announced their intent to purchase Israeli fabless chipmaking company Autotalks for a reported $350–400 million. The purchase is subject to review by the Competition and Markets Authority. In March 2024, it was announced by the Federal Trade Commission that Qualcomm's proposed acquisition of Autotalks has been terminated.\nIn September 2023, the company announced that it had signed a contract rumored to be worth $75 million per year for its Snapdragon brand to be the primary shirt sponsor for English football club Manchester United starting with the 2024–25 season, replacing German company TeamViewer.\nIn October 2023, Qualcomm introduced the Snapdragon X series, a computing platform for Windows PCs which includes a custom ARM-based Oryon CPU (from Nuvia acquisition), a GPU, and a dedicated neural processing unit.\nIn October 2024, Qualcomm announced that the Qualcomm-Microsoft exclusive protocol will be expired in December 25 2024, allows Windows on ARM devices can adapt ARM CPUs other than Qualcomm Snapdragon.\nIn October 2024, Arm Ltd. said it would cancel Qualcomm's chip design license in an escalation of the dispute over the acquisition of Nuvia. In December 2024, a U.S. federal jury ruled partially in Qualcomm's favor, finding that its designs were properly licensed under an agreement with Arm. However, the jury was deadlocked on one of three issues raised, resulting in a mistrial on that specific point. In February 2025, Arm withdrew its efforts to terminate Qualcomm's chip-licensing agreement.\n\n2025–present: Further acquisitions\nOn 2 April 2025, Qualcomm acquired Movian AI, the generative artificial intelligence unit of Vietnamese research company VinAI.\nQualcomm acquired Autotalks through its subsidiary, Qualcomm Technologies, Inc on the 5th of June 2025 for an undisclosed amount. Autotalks is an Israeli fabless semiconductor company founded in 2008, specializing in vehicle-to-everything (V2X) communications.\nQualcomm agreed to acquire British semiconductor maker of high-speed wired connectivity, Alphawave IP Group, for $2.4 billion on June 9th 2025, with the intention to expand into data centre and AI infrastructure markets.\nQualcomm acquired Arduino on 7 October 2025, an Italian company specialising in single-board microcontrollers and microcontroller kits for an undisclosed amount. At the same time, Arduino announced the Uno Q, which uses the Qualcomm QRB2210 system on a chip, intended for AI and graphical workloads.\n\nWireless CDMA\n2G\nEarly history\nIn mid-1985, Qualcomm was hired by Hughes Aircraft to provide research and testing for a satellite network proposal to the Federal Communications Commission (FCC). The following year, Qualcomm filed its first CDMA patent (No. 4,901,307). This patent established Qualcomm's overall approach to CDMA and later became one of the most frequently cited technical documents in history. The project with the FCC was scrapped in 1988, when the FCC told all twelve vendors that submitted proposals to form a joint venture to create a single proposal.\nQualcomm further developed the CDMA techniques for commercial use and submitted them to the Cellular Telephone Industries Association (CTIA) in 1989 as an alternative to the time-division multiple access (TDMA) standard for second-generation cell-phone networks. A few months later, CTIA officially rejected Qualcomm's CDMA standard in favor of the more established TDMA standard developed by Ericsson.\nAt the time, CDMA wasn't considered viable in high-volume commercial applications due to the near-far field effect, whereby phones closer to a cell tower with a stronger signal drown out callers that are further away and have a weaker signal. Qualcomm filed three additional patents in 1989. They were for: a power management system that adjusts the signal strength of each call to adjust for the near-far field effect; a \"soft handoff\" methodology for transferring callers from one cell-tower to the next; and a variable rate encoder, which reduces bandwidth usage when a caller isn't speaking.\n\nHoly wars of wireless\nAfter the FCC said carriers were allowed to implement standards not approved by the CTIA, Qualcomm began pitching its CDMA technology directly to carriers. This started what is often referred to as \"the Holy Wars of Wireless\", an often heated debate about whether TDMA or CDMA was better suited for 2G networks. Qualcomm-supported CDMA standards eventually unseated TDMA as the more popular 2G standard in North America, due to its network capacity.\nQualcomm conducted CDMA test demonstrations in 1989 in San Diego and in 1990 in New York City. In 1990, Nynex Mobile Communications and Ameritech Mobile Communications were the first carriers to implement CDMA networks instead of TDMA. Motorola, a prior TDMA advocate, conducted CDMA test implementations in Hong Kong and Los Angeles. This was followed by a $2 million trial network in San Diego for Airtouch Communications. In November 1991, 14 carriers and manufacturers conducted large-scale CDMA field tests.\nResults from the test implementations convinced CTIA to re-open discussions regarding CDMA and the 2G standard. CTIA changed its position and supported CDMA in 1993, adopting Qualcomm's CDMA as the IS-95A standard, also known as cdmaOne. This prompted widespread criticism in forums, trade press, and conventions from businesses that had already invested heavily in the TDMA standard and from TDMA's developer, Ericsson.\nThe first commercial-scale CDMA cellular network was created in Hong Kong in 1995. On July 21, 1995, Primeco, which represented a joint venture of Bell Atlantic, Nynex, US West and AirTouch Communications, announced it was going to implement CDMA-based services on networks in 15 states. By this time, 11 out of 14 of the world's largest networks supported CDMA. By 1997 CDMA had 57 percent of the US market, whereas 14 percent of the market was on TDMA.\n\nInternational\nIn 1991, Qualcomm and the Electronics and Telecommunications Research Institute (ETRI) agreed to jointly develop CDMA technologies for the Korean telecommunications infrastructure. A CDMA standard was adopted as the national wireless standard in Korea in May 1993 with commercial CDMA networks being launched in 1996. CDMA networks were also launched in Argentina, Brazil, Mexico, India, and Venezuela. Qualcomm entered the Russian and Latin American markets in 2005. By 2007, Qualcomm's technology was in cell phone networks in more than 105 countries. Qualcomm also formed licensing agreements with Nokia in Europe, Nortel in Canada, and with Matsushita and Mitsubishi in Japan.\nQualcomm entered the Chinese market through a partnership with China Unicom in 2000, which launched the first CDMA-based network in China in 2003. China became a major market for Qualcomm's semiconductor products, representing more than fifty percent of its revenues, but also the source of many legal disputes regarding Qualcomm's intellectual property. By 2007, $500 million of Qualcomm's annual revenues were coming from Korean manufacturers.\n\nManufacturing\nInitially, Qualcomm's manufacturing operations were limited to a small ASIC design and manufacturing team to support the Omnitracs system. Qualcomm was forced to expand into manufacturing in the 1990s in order to produce the hardware carriers needed to implement CDMA networks that used Qualcomm's intellectual property. Qualcomm's first large manufacturing project was in May 1993, in a deal to provide 36,000 CDMA phones to US West.\nFor a time, Qualcomm experienced delays and other manufacturing problems, because it was inexperienced with mass manufacturing. In 1994, Qualcomm partnered with Northern Telecom and formed a joint partnership with Sony, in order to leverage their manufacturing expertise. Nokia, Samsung and Motorola introduced their own CDMA phones in 1997. Qualcomm's manufacturing business was losing money due to large capital equipment costs and declining prices caused by competition. Also, in March 1997, after Qualcomm introduced its Q phone, Motorola initiated a lawsuit (settled out of court in 2000) for allegedly copying the design of its Startac phone.\nIn December 1999, Qualcomm sold its manufacturing interests to Kyocera Corporation, a Japanese CDMA manufacturer and Qualcomm licensee. Qualcomm's infrastructure division was sold to competitor Ericsson in 1999 as part of an out-of-court agreement for a CDMA patent dispute that started in 1996. The sale of the infrastructure division marked the beginning of an increase in Qualcomm's stock price and stronger financial performance, but many of the 1,200 employees involved were discontented working for a competitor and losing their stock options. This led to a protracted legal dispute regarding employee stock options, resulting in $74 million in settlements by 2005.\n\n3G\n3G standards were expected to force prior TDMA carriers onto CDMA, in order to meet 3G bandwidth goals. The two largest GSM manufacturers, Nokia and Ericsson, advocated for a greater role for GSM, in order to negotiate lower royalty prices from Qualcomm. In 1998, the European Telecommunications Standards Institute (ETSI) voted in support of the WCDMA standard, which relied less on Qualcomm's CDMA patents. Qualcomm responded by refusing to license its intellectual property for the standard.\nThe Telecommunications Industry Association (TIA) and the Third Generation Partnership Program 2 (3GPP2), advocated for a competing CDMA-2000 standard developed primarily by Qualcomm. American and European politicians advocated for the CDMA-2000 and WCDMA standards respectively. The ITU said it would exclude Qualcomm's CDMA technology from the 3G standards entirely if a patent dispute over the technology with Ericsson was not resolved. The two reached an agreement out-of-court in 1999, one month before a deadline set by the ITU. Both companies agreed to cross-license their technology to each other and to work together on 3G standards.\nA compromise was eventually reached whereby the ITU would initially endorse three standards: CDMA2000 1X, WCDMA and TD-SCDMA. Qualcomm agreed to license its CDMA patents for variants such as WCDMA. There were 240 million CDMA 3G subscribers by 2004 and 143 carriers in 67 countries by 2005. Qualcomm claimed to own 38 percent of WCDMA's essential patents, whereas European GSM interests sponsored a research paper alleging Qualcomm only owned 19 percent.\nQualcomm consolidated its interests in telecommunications carriers, such as Cricket Communications and Pegaso into a holding company, Leap Wireless, in 1998. Leap was spun-off later that year and sold to AT&T in 2014.\n\n4G\nQualcomm initially advocated for the CDMA-based Ultra Mobile Broadband (UMB) standard for fourth generation wireless networks. UMB wasn't backwards compatible with prior CDMA networks and didn't operate as well in narrow bandwidths as the LTE (long-term evolution) standard. No cellular networks adopted UMB. Qualcomm halted development of UMB in 2005 and decided to support the LTE standard, even though it didn't rely as heavily on Qualcomm patents. Then, Qualcomm purchased LTE-related patents through acquisitions. By 2012, Qualcomm held 81 seminal patents used in 4G LTE standards, or 12.46 percent.\nQualcomm also became more focused on using its intellectual property to manufacture semiconductors in a fabless manufacturing model. A VLSI Technology Organization division was founded in 2004, followed by a DFX group in 2006, which did more of the manufacturing design in-house. Qualcomm announced it was developing the Scorpion central processing unit (CPU) for mobile devices in November 2005. This was followed by the first shipments of the Snapdragon system-on-chip product, which includes a CPU, GPS, graphics processing unit, camera support and other software and semiconductors, in November 2007. The Gobi family of modems for portable devices was released in 2008. Gobi modems were embedded in many laptop brands and Snapdragon system on chips were embedded into most Android devices.\nQualcomm won a government auction in India in 2010 for $1 billion in spectrum and licenses from which to offer broadband services. It formed four joint ventures with Indian holding companies for this purpose. A 49 percent stake in the holding companies was acquired by Bharti in May 2012 and the remaining was acquired in October 2012 by AT&T.\n\n5G\nAccording to Fortune Magazine, Qualcomm has been developing technologies for future 5G standards in three areas: radios that would use bandwidth from any network it has access to, creating larger ranges of spectrum by combining smaller pieces, and a set of services for Internet of things applications. Qualcomm's first 5G modem chip was announced in October 2016 and a prototype was demonstrated in October 2017. Qualcomm's first 5G antennas were announced in July 2018. As of 2018, Qualcomm had partnerships with 19 mobile device manufacturers and 18 carriers to commercialize 5G technology. By late 2019, several phones were being sold with Qualcomm's 5G technology incorporated.\n\nSoftware and other technology\nEarly software\nQualcomm acquired an email application called Eudora in 1991. By 1996, Eudora was installed on 63 percent of PCs. Microsoft Outlook eclipsed Eudora, since it was provided for free by default on Windows-based machines. By 2003 Qualcomm's Eudora was the most popular alternative to Microsoft Outlook, but still had only a five percent share of the market. Software development for Eudora was retired in 2006.\nIn 2001, Qualcomm introduced Brew, a smartphone app development service with APIs to access contacts, billing, app-stores, or multimedia on the phone. South Korean carrier KTFreeTel was the first to adopt the Brew system in November 2001, followed by Verizon in March 2002 for its \"Get it Now\" program. There were 2.5 million Brew users by the end of 2002 and 73 million in 2003.\n\nOther technology\nIn 2004, Qualcomm created a MediaFLO subsidiary to bring its FLO (forward link only) specification to market. Qualcomm built an $800 million MediaFLO network of cell towers to supplement carrier networks with one that is designed for multimedia. In comparison to cellular towers that provide two-way communications with each cell phone individually, MediaFLO towers would broadcast multimedia content to mobile phones in a one-way broadcast. Qualcomm also sold FLO-based semiconductors and licenses.\nQualcomm created the FLO Forum standards group with 15 industry participants in July 2005. Verizon was the first carrier to partner with MediaFlo in December 2005 for its Verizon Wireless' V Cast TV, which was followed by the AT&T Mobile TV service a couple months later. The MediaFlo service was launched on Super Bowl Sunday in 2007. Despite the interest the service got among carriers, it was unpopular among consumers. The service required users to pay for a subscription and have phones that were equipped with special semiconductors. The service was discontinued in 2011 and its spectrum was sold to AT&T for $1.93 billion. Qualcomm rebooted the effort in 2013 with LTE Broadcast, which uses pre-existing cell towers to broadcast select content locally on a dedicated spectrum, such as during major sporting events.\nBased on technology acquired from Iridigm in 2004 for $170 million, Qualcomm began commercializing Mirasol displays in 2007, which was expanded into eight products in 2008. Mirasol uses natural light shining on a screen to provide lighting for the display, rather a backlight, in order to reduce power consumption. The amount of space between the surface of the display and a mirror within a 10 micron-wide \"interferometric modulator\" determines the color of the reflected light. Mirasol was eventually closed down after an attempt to revive it in 2013 in Toq watches.\nIn June 2011, Qualcomm introduced AllJoyn, a wireless standard for communicating between devices like cell phones, televisions, air-conditioners, and refrigerators. The Alljoyn technology was donated to the Linux Foundation in December 2013. Qualcomm and the Linux Foundation then formed the Allseen Alliance to administer the standard and Qualcomm developed products that used the AllJoyn standard In December 2011, Qualcomm formed a healthcare subsidiary called Qualcomm Life. Simultaneously, the subsidiary released a cloud-based service for managing clinical data called 2net and the Qualcomm Life Fund, which invests in wireless healthcare technology companies. The subsidiary doubled its employee-count by acquiring HealthyCircles Inc., a healthcare IT company, the following May. Qualcomm life was later sold to a private equity firm, Francisco Partners, in 2019.\n\nDevelopments since 2016\nIn 2016, Qualcomm developed its first beta processor chip for servers and PCs called \"Server Development Platform\" and sent samples for testing. In January 2017, a second generation data center and PC server chip called Centriq 2400 was released. PC Magazine said the release was \"historic\" for Qualcomm, because it was a new market segment for the company. Qualcomm also created a Qualcomm Datacenter Technologies subsidiary to focus on the PCs and servers market. In 2017, Qualcomm introduced embedded technology for 3D cameras intended for augmented reality apps, and also developed and demonstrated laptop processors.\nIn 2000, Qualcomm formed a joint venture with Ford called Wingcast, which created telematics equipment for cars, but was unsuccessful and closed down two years later. Qualcomm acquired the wireless electric car charging company, HaloIPT, in November 2011 and later sold the company to WiTricity in February 2019. Qualcomm also started introducing Snapdragon system-on-chips and Gobi modems and other software or semiconductor products for self-driving cars and modern in-car computers.\nIn 2020, Qualcomm hired Baidu veteran, Nan Zhou, to head Qualcomm's push into AI.\nIn 2024, Qualcomm identified generative artificial intelligence as a key driver of market demand for its edge computing technology, with the company projecting a total addressable market of approximately $900 billion by 2030. In August 2024, Reuters reported that Qualcomm was among the clients of Contextual AI, a company building retrieval-augmented generation (RAG) agents for enterprise use.\nIn October 2025, Qualcomm announced it was launching new AI accelerator chips meant to challenge NVIDIA's dominant position in the space. The company said its first customer for its AI200 chips will be Humain—an AI company backed by Saudi Arabia's Public Investment Fund, which is set to deploy 200 megawatts worth of Qualcomm's chips in 2026.\n\nPatents and patent disputes\nIn 2024, the World Intellectual Property Organization (WIPO)’s Annual PCT Review ranked Qualcomm's number of patent applications published under the PCT System as 3rd in the world, with 3,848 patent applications being published during 2024. In 2017, Qualcomm owned more than 130,000 current or pending patents, an increase from the early 2000s when Qualcomm had more than 1,000 patents. As the sole early investor in CDMA research and development, Qualcomm's patent portfolio contains much of the intellectual property that is essential to CDMA technologies.\nSince many of Qualcomm's patents are part of an industry standard, the company has agreed to license those patents under \"fair, reasonable, and non-discriminatory\" terms. Qualcomm's royalties come out to about 5% or $30 per mobile device. According to Fortune Magazine, this is about 5–10 times more than what is typically charged by other patent-holders. Qualcomm says its patents are more expensive because they are more important and its pricing is within the range of common licensing practices. However, competitors, clients, and regulators often allege Qualcomm charges unreasonable rates or engages in unfair competition for mandatory patents.\n\nBroadcom\nIn 2005, Broadcom and Qualcomm were unable to reach an agreement on cross-licensing their intellectual property, and Broadcom sued Qualcomm alleging it was breaching ten Broadcom patents. Broadcom asked the International Trade Commission to prohibit importing the affected technology. A separate lawsuit alleged Qualcomm was threatening to withhold UMTS patent licenses against manufacturers that bought their semiconductors from competitors, in violation of the standards agreement.\nQualcomm alleged Broadcom was using litigation as a negotiation tactic and that it would respond with its own lawsuits. Qualcomm sued Broadcom, alleging it was using seven Qualcomm patents without permission. By late 2006, more than 20 lawsuits had been filed between the two parties and both sides claimed to be winning.\nIn September 2006, a New Jersey court judge ruled that Qualcomm's patent monopoly was an inherent aspect of creating industry standards and that Qualcomm's pricing practices were lawful. In May 2007, a jury ordered Qualcomm to pay Broadcom $19.6 million for infringing on three Broadcom patents. In June 2007, the ITC ruled that Qualcomm had infringed on at least one Broadcom patent and banned corresponding imports. Qualcomm and Broadcom reached a settlement in April 2009, resulting in a cross-licensing agreement, a dismissal of all litigation and Qualcomm paying $891 million over four years.\nDuring the litigation, Qualcomm claimed it had never participated in the JVT standards-setting process. However, an engineer's testimony led to discovery of 21 JVT-related emails Qualcomm lawyers had withheld from the court, and 200,000 pages of JVT-related documents. Qualcomm's lawyers said the evidence was accidentally overlooked, whereas the judge said it was gross misconduct. Qualcomm was fined $8.5 million for legal misconduct. On appeal, the court held that Qualcomm could only enforce the related patents against non-JVT members, based on the agreements signed to participate in JVT.\n\nNokia and Project Stockholm\nSix large telecommunications companies led by Nokia filed a complaint against Qualcomm with the European Commission's antitrust division in October 2005. They alleged Qualcomm was abusing its market position to charge unreasonable rates for its patents. Qualcomm alleged the six companies were colluding together under the code name Project Stockholm in a legal strategy to negotiate lower rates. These events led to a protracted legal dispute.\nQualcomm filed a series of patent-infringement lawsuits against Nokia in Europe, Asia, the US, and with the ITC. The parties initiated more than one dozen lawsuits against one another. Several companies filed antitrust complaints against Qualcomm with the Korean Fair Trade Commission, who initiated an investigation into Qualcomm's practices in December 2006. The dispute between Qualcomm and Nokia escalated, when their licensing agreement ended in April 2007.\nIn February 2008, the two parties agreed to halt any new litigation until an initial ruling is made on the first lawsuit in Delaware. Nokia won three consecutive court rulings with the German Federal Patent Court, the High Court in the United Kingdom, and the International Trade Commission respectively. Each found that Nokia was not infringing on Qualcomm's patents. In July 2008, Nokia and Qualcomm reached an out-of-court settlement that ended the dispute and created a 15-year cross-licensing agreement.\n\nRecent disputes\nParkerVision filed a lawsuit against Qualcomm in July 2011 alleging that it infringed on seven ParkerVision patents related to converting electromagnetic radio signals to lower frequencies. A $173 million jury verdict against Qualcomm was overturned by a judge.\nIn November 2013, the China National Development and Reform Commission initiated an anti-trust investigation into Qualcomm's licensing division. The Securities and Exchange Commission also started an investigation into whether Qualcomm breached antibribery laws through its activities in China. The Chinese regulator raided Qualcomm's Chinese offices in August 2013. The dispute was settled in 2015 for $975 million. \nIn late 2016 The Korea Fair Trade Commission alleged Qualcomm abused a \"dominant market position\" to charge cell phone manufacturers excessive royalties for patents and limit sales to companies selling competing semiconductor products. The regulator gave Qualcomm a fine of $854 million, which the company said it will appeal. Eventually, Qualcomm lost the case in Supreme Court of the Republic of Korea in 2023, causing to enact the fine in force.\nIn April 2017, Qualcomm paid an $814.9 million settlement to BlackBerry as a refund for prepaid licensing fees.\nIn October 2017, Taiwan's Fair Trade Commission fined Qualcomm another $773 million. In late 2018 Qualcomm paid a settlement to Taiwan for $93 million in fines and a promise to spend $700 million in the local Taiwan economy.\nIn October 2025, as part of an anti-trust investigation into Qualcomm, China's market regulator said that the company said it did not notify the agency when it acquired Israeli auto-chip design company Autotalks despite having been informed that the deal required the agency's approval and telling it that the company would not pursue the merger. Several media outlets including CNBC, The Wall Street Journal, Reuters, Barrons, and more speculated that the investigation was part of trade discussions between the US and China.\n\nApple\nIn January 2017, the Federal Trade Commission (FTC) initiated an investigation into allegations that Qualcomm charged excessive royalties for patents that are \"essential to industry standards\". That same year, Apple initiated a $1 billion lawsuit against Qualcomm in the U.S. alleging Qualcomm overcharged for semiconductors and failed to pay $1 billion in rebates. Apple also filed lawsuits in China and the United Kingdom.\nApple alleged Qualcomm was engaging in unfair competition by selling industry-standard patents at a discount rate in exchange for an exclusivity agreement for its semiconductor products. An FTC report reached similar conclusions. Qualcomm filed counter-claims alleging Apple made false and misleading statements to induce regulators to sue Qualcomm. Qualcomm also sued Apple's suppliers for allegedly not paying Qualcomm's patent royalties, after Apple stopped reimbursing them for patent fees. Qualcomm petitioned the International Trade Commission to prohibit imports of iPhones, on the premise that they contain stolen Qualcomm patents after Apple's suppliers stopped paying.\nIn August 2017, the International Trade Commission responded to Qualcomm's complaints by starting an investigation of Apple's use of Qualcomm patents without royalties. Qualcomm also filed suit against Apple in China for alleged patent infringement in October 2017. The following month, Apple counter-sued, alleging Qualcomm was using patented Apple technology in its Android components.\nIn December 2018, Chinese and German courts held that Apple infringed on Qualcomm patents and banned sales of certain iPhones. Some patents were held to be invalid, while others were infringed by Apple.\nIn April 2019, Apple and Qualcomm reached an agreement to cease all litigation and sign a six-year licensing agreement. The settlement included a one-time payment from Apple of about $4.5 to 4.7 billion. Terms of the six-year licensing agreement were not disclosed, but the licensing fees were expected to increase revenues by $2 per-share.\nIn January 2018, the European Competition Commission fined Qualcomm $1.2 billion for an arrangement to use Qualcomm chips exclusively in Apple's mobile products. Qualcomm appealed the decision, and in June 2022, Qualcomm announced the company had won its appeal of the European Union antitrust fine. The appeal had highlighted that Apple as a company had no technical alternative other than to use Qualcomm's LTE chipsets.\n\nFederal Trade Commission\nStemming from the investigation that led to the Apple lawsuit actions, the FTC filed suit against Qualcomm in 2017 alleging it engaged in antitrust behavior due to its monopoly on wireless broadband technology. The complaints filed by the FTC included that Qualcomm charged \"disproportionately high\" patent royalty rates to phone manufacturers and refused to sell them broadband chips if they did not license the patents, a policy referred to as \"no license, no chips\", that Qualcomm refused to license the patent to other chip manufacturers as to maintain their monopoly, and that Qualcomm purposely offered Apple a lower license cost to use their chips exclusively, locking other competitors as well as wireless service providers out of Apple's lucrative market. The trial starting in January 2019, heard by Judge Lucy Koh of the federal Northern District Court that also oversaw the Apple case. Judge Koh ruled in May 2019 against Qualcomm, asserting that Qualcomm's practices did violate antitrust. As part of the ruling, Qualcomm was forced to stop its \"no license, no chips\" bundling with phone manufacturers, and was required to license its patents to other chip manufacturers. As Qualcomm had expressed its intent to appeal, a panel of judges on the 9th circuit of appeals stayed the orders pending the litigation action.\nQualcomm appealed to the Ninth Circuit, which reversed the decision in August 2020. The Ninth Circuit determined that Judge Koh's decision strayed beyond the scope of antitrust law and that whether Qualcomm's patent licensing may be considered reasonable and non-discriminatory licensing does not fall within the scope of antitrust law, but rather is a matter of contract and patent law. The court concluded that the FTC failed to meet its burden of proof and that Qualcomm's business practices were better characterized as \"hypercompetitive\" rather than \"anticompetitive\".\n\nOperations and market-share\nQualcomm develops software, semiconductor designs, patented intellectual property, development tools and services, but does not manufacture physical products like phones or infrastructure equipment. The company's revenues are derived from licensing fees for use of its intellectual property, sales of semiconductor products that are based on its designs, and from other wireless hardware, software or services.\nQualcomm divides its business into three categories:\n\nQCT (Qualcomm CDMA Technologies): CDMA wireless products; 80% of revenue\nQTL (Qualcomm Technology Licensing): Licensing; 19% of revenue\nQSI (Qualcomm strategic initiatives): Investing in other tech companies; less than 1% of revenue\nQualcomm is a predominantly fabless provider of semiconductor products for wireless communications and data transfer in portable devices. According to the analyst firm Strategy Analytics, Qualcomm has a 39 percent market-share for smartphone application processors and a 50 percent market-share of baseband processors. Its share of the market for application processors on tablets is 18 percent. According to analyst firm ABI Research, Qualcomm has a 65 percent market-share in LTE baseband. Qualcomm also provides licenses to use its patents, many of which are critical to the CDMA2000, TD-SCDMA and WCDMA wireless standards. The company is estimated to earn $20 for every smartphone sold.\nQualcomm is the largest public company in San Diego. It has a philanthropic arm called The Qualcomm Foundation. A January 2013 lawsuit resulted in Qualcomm voluntarily adopting a policy of disclosing its political contributions. According to The New York Times, Qualcomm's new disclosure policy was praised by transparency advocates.\n\nSee also\nList of Qualcomm Snapdragon systems on chips\nAdreno\nQualcomm Hexagon\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Qualcomm, Inc.:",
  "clean_text": "Qualcomm Incorporated () is an American multinational corporation headquartered in San Diego, California, and incorporated in Delaware. It creates semiconductors, software and services related to wireless technology. It owns patents critical to the 5G, 4G, CDMA2000, TD-SCDMA and WCDMA mobile communications standards. Qualcomm was established in 1985 by Irwin Jacobs and six others. Its early research into code-division multiple access (CDMA) wireless cell phone technology was funded by selling a two-way mobile digital satellite communications system known as Omnitracs. After a heated debate in the wireless industry, CDMA was adopted as a 2G standard in North America, with Qualcomm's patents incorporated. Afterwards, there was a series of legal disputes about pricing for licensing patents required by the standard. Over the years, Qualcomm has expanded into selling semiconductor products in a predominantly fabless manufacturing model. History Early history Qualcomm was created in July 1985 by seven former Linkabit employees led by Irwin Jacobs. Other co-founders included Andrew Viterbi, Franklin Antonio, Adelia Coffman, Andrew Cohen, Klein Gilhousen, and Harvey White. The company was named Qualcomm for \"Quality Communications\". It started as a contract research and development center largely for government and defense projects. Qualcomm merged with Omninet in 1988 and raised $3.5 million in funding to produce the Omnitracs satellite communications system for trucking companies. Qualcomm grew from eight employees in 1986 to 620 employees in 1991, due to demand for Omnitracs. By 1989, Qualcomm had $32 million in revenue, 50 percent of which was from an Omnitracs contract with Schneider National. Omnitracs profits helped fund Qualcomm's research and development into code-division multiple access (CDMA) technologies for cell phone networks. 1990–2015 Qualcomm was operating at a loss in the 1990s due to its investment in CDMA research. To obtain funding, the company filed an initial public offering in September 1991, raising $68 million. An additional $486 million was raised in 1995 through the sale of 11.5 million more shares. The second funding round was done to raise money for the mass manufacturing of CDMA-based phones, base-stations, and equipment, after most US-based cellular networks announced they would adopt the CDMA standard. The company had $383 million in annual revenue in 1995 and $814 million by 1996. In 1998, Qualcomm was restructured, leading to a 700-employee layoff. Its base station and cell-phone manufacturing businesses were spun-off in order to focus on its higher-margin patents and chipset businesses. Since the base station division was losing $400M a year (having never sold another base station after making its 10th sale), profits skyrocketed in the following year, and Qualcomm was the fastest growing stock on the market with a 2,621 percent growth over one year. By 2000, Qualcomm had grown to 6,300 employees, $3.2 billion in revenues, and $670 million in profit. 39 percent of its sales were from CDMA technology, followed by licensing (22%), wireless (22%), and other products (17%). Around this time, Qualcomm established offices in Europe, Asia Pacific, and in the Americas. By 2001, 65 percent of Qualcomm's revenues originated from outside the United States with 35 percent coming from South Korea. In 2005, Paul E. Jacobs, son of Qualcomm founder Irwin Jacobs, was appointed as Qualcomm's new CEO. Whereas Irwin Jacobs focused on CDMA patents, Paul Jacobs refocused much of Qualcomm's new research and development on projects related to the Internet of things. In the same year they acquired Flarion Technologies, a developer of wireless broadband Orthogonal Frequency Division Multiplex Access (OFDMA) technology. Qualcomm announced Steven Mollenkopf would succeed Paul Jacobs as CEO in December 2013. Mollenkopf said he would expand Qualcomm's focus to wireless technology for cars, wearable devices, and other new markets. 2015–2024: NXP, Broadcom and Nuvia Qualcomm announced its intent to acquire NXP Semiconductors for $47 billion in October 2016. The deal was approved by U.S. antitrust regulators in April 2017 with some standard-essential patents excluded to get the deal approved. As the NXP acquisition was ongoing, Broadcom made a $103 billion offer to acquire Qualcomm, and Qualcomm rejected the offer. Broadcom attempted a hostile takeover, and raised its offer, eventually to $121 billion. The potential Broadcom acquisition was investigated by the U.S. Committee on Foreign Investment and blocked by an executive order from U.S. President Donald Trump, citing national security concerns. Qualcomm's NXP acquisition then became a part of the 2018 China–United States trade war. U.S. president Donald Trump blocked China-based ZTE Corporation from buying American-made components, such as those from Qualcomm. The ZTE restriction was lifted after the two countries reached an agreement, but then Trump raised tariffs against Chinese goods. Qualcomm extended a tender offer to NXP at least 29 times pending Chinese approval, before abandoning the deal in July 2018. On January 6, 2021, Qualcomm appointed its president and chip division head Cristiano Amon as its new chief executive. On January 13, 2021, Qualcomm announced it would acquire Nuvia, a server CPU startup founded in early 2019 by ex-Apple and ex-Google architects, for approximately $1.4 billion. The acquisition was completed in March 2021, and it was announced that its first products would be laptop CPUs, shipping in the second half of 2022. In March 2022, Qualcomm acquired the advanced driver-assistance systems and autonomous driving software brand Arriver from the investment company SSW Partners. In June 2022, Qualcomm acquired Israeli startup Cellwize through its investment arm Qualcomm Ventures. In August 2022, Bloomberg News reported that Qualcomm was planning to return to server CPU market based on Nuvia's product. Later that month, Arm Ltd. announced that it sued Qualcomm and Nuvia for breaching license agreements and trademark violations. Arm cited that the chip designs using Arm licenses developed by Nuvia could not be transferred to its parent Qualcomm without permission. Qualcomm indicated that its licenses with Arm cover custom-designed processors. In January 2023, the company announced a new partnership with Salesforce to develop a connected vehicle platform for automakers using the Snapdragon digital chassis. In May 2023, Qualcomm announced their intent to purchase Israeli fabless chipmaking company Autotalks for a reported $350–400 million. The purchase is subject to review by the Competition and Markets Authority. In March 2024, it was announced by the Federal Trade Commission that Qualcomm's proposed acquisition of Autotalks has been terminated. In September 2023, the company announced that it had signed a contract rumored to be worth $75 million per year for its Snapdragon brand to be the primary shirt sponsor for English football club Manchester United starting with the 2024–25 season, replacing German company TeamViewer. In October 2023, Qualcomm introduced the Snapdragon X series, a computing platform for Windows PCs which includes a custom ARM-based Oryon CPU (from Nuvia acquisition), a GPU, and a dedicated neural processing unit. In October 2024, Qualcomm announced that the Qualcomm-Microsoft exclusive protocol will be expired in December 25 2024, allows Windows on ARM devices can adapt ARM CPUs other than Qualcomm Snapdragon. In October 2024, Arm Ltd. said it would cancel Qualcomm's chip design license in an escalation of the dispute over the acquisition of Nuvia. In December 2024, a U.S. federal jury ruled partially in Qualcomm's favor, finding that its designs were properly licensed under an agreement with Arm. However, the jury was deadlocked on one of three issues raised, resulting in a mistrial on that specific point. In February 2025, Arm withdrew its efforts to terminate Qualcomm's chip-licensing agreement. 2025–present: Further acquisitions On 2 April 2025, Qualcomm acquired Movian AI, the generative artificial intelligence unit of Vietnamese research company VinAI. Qualcomm acquired Autotalks through its subsidiary, Qualcomm Technologies, Inc on the 5th of June 2025 for an undisclosed amount. Autotalks is an Israeli fabless semiconductor company founded in 2008, specializing in vehicle-to-everything (V2X) communications. Qualcomm agreed to acquire British semiconductor maker of high-speed wired connectivity, Alphawave IP Group, for $2.4 billion on June 9th 2025, with the intention to expand into data centre and AI infrastructure markets. Qualcomm acquired Arduino on 7 October 2025, an Italian company specialising in single-board microcontrollers and microcontroller kits for an undisclosed amount. At the same time, Arduino announced the Uno Q, which uses the Qualcomm QRB2210 system on a chip, intended for AI and graphical workloads. Wireless CDMA 2G Early history In mid-1985, Qualcomm was hired by Hughes Aircraft to provide research and testing for a satellite network proposal to the Federal Communications Commission (FCC). The following year, Qualcomm filed its first CDMA patent (No. 4,901,307). This patent established Qualcomm's overall approach to CDMA and later became one of the most frequently cited technical documents in history. The project with the FCC was scrapped in 1988, when the FCC told all twelve vendors that submitted proposals to form a joint venture to create a single proposal. Qualcomm further developed the CDMA techniques for commercial use and submitted them to the Cellular Telephone Industries Association (CTIA) in 1989 as an alternative to the time-division multiple access (TDMA) standard for second-generation cell-phone networks. A few months later, CTIA officially rejected Qualcomm's CDMA standard in favor of the more established TDMA standard developed by Ericsson. At the time, CDMA wasn't considered viable in high-volume commercial applications due to the near-far field effect, whereby phones closer to a cell tower with a stronger signal drown out callers that are further away and have a weaker signal. Qualcomm filed three additional patents in 1989. They were for: a power management system that adjusts the signal strength of each call to adjust for the near-far field effect; a \"soft handoff\" methodology for transferring callers from one cell-tower to the next; and a variable rate encoder, which reduces bandwidth usage when a caller isn't speaking. Holy wars of wireless After the FCC said carriers were allowed to implement standards not approved by the CTIA, Qualcomm began pitching its CDMA technology directly to carriers. This started what is often referred to as \"the Holy Wars of Wireless\", an often heated debate about whether TDMA or CDMA was better suited for 2G networks. Qualcomm-supported CDMA standards eventually unseated TDMA as the more popular 2G standard in North America, due to its network capacity. Qualcomm conducted CDMA test demonstrations in 1989 in San Diego and in 1990 in New York City. In 1990, Nynex Mobile Communications and Ameritech Mobile Communications were the first carriers to implement CDMA networks instead of TDMA. Motorola, a prior TDMA advocate, conducted CDMA test implementations in Hong Kong and Los Angeles. This was followed by a $2 million trial network in San Diego for Airtouch Communications. In November 1991, 14 carriers and manufacturers conducted large-scale CDMA field tests. Results from the test implementations convinced CTIA to re-open discussions regarding CDMA and the 2G standard. CTIA changed its position and supported CDMA in 1993, adopting Qualcomm's CDMA as the IS-95A standard, also known as cdmaOne. This prompted widespread criticism in forums, trade press, and conventions from businesses that had already invested heavily in the TDMA standard and from TDMA's developer, Ericsson. The first commercial-scale CDMA cellular network was created in Hong Kong in 1995. On July 21, 1995, Primeco, which represented a joint venture of Bell Atlantic, Nynex, US West and AirTouch Communications, announced it was going to implement CDMA-based services on networks in 15 states. By this time, 11 out of 14 of the world's largest networks supported CDMA. By 1997 CDMA had 57 percent of the US market, whereas 14 percent of the market was on TDMA. International In 1991, Qualcomm and the Electronics and Telecommunications Research Institute (ETRI) agreed to jointly develop CDMA technologies for the Korean telecommunications infrastructure. A CDMA standard was adopted as the national wireless standard in Korea in May 1993 with commercial CDMA networks being launched in 1996. CDMA networks were also launched in Argentina, Brazil, Mexico, India, and Venezuela. Qualcomm entered the Russian and Latin American markets in 2005. By 2007, Qualcomm's technology was in cell phone networks in more than 105 countries. Qualcomm also formed licensing agreements with Nokia in Europe, Nortel in Canada, and with Matsushita and Mitsubishi in Japan. Qualcomm entered the Chinese market through a partnership with China Unicom in 2000, which launched the first CDMA-based network in China in 2003. China became a major market for Qualcomm's semiconductor products, representing more than fifty percent of its revenues, but also the source of many legal disputes regarding Qualcomm's intellectual property. By 2007, $500 million of Qualcomm's annual revenues were coming from Korean manufacturers. Manufacturing Initially, Qualcomm's manufacturing operations were limited to a small ASIC design and manufacturing team to support the Omnitracs system. Qualcomm was forced to expand into manufacturing in the 1990s in order to produce the hardware carriers needed to implement CDMA networks that used Qualcomm's intellectual property. Qualcomm's first large manufacturing project was in May 1993, in a deal to provide 36,000 CDMA phones to US West. For a time, Qualcomm experienced delays and other manufacturing problems, because it was inexperienced with mass manufacturing. In 1994, Qualcomm partnered with Northern Telecom and formed a joint partnership with Sony, in order to leverage their manufacturing expertise. Nokia, Samsung and Motorola introduced their own CDMA phones in 1997. Qualcomm's manufacturing business was losing money due to large capital equipment costs and declining prices caused by competition. Also, in March 1997, after Qualcomm introduced its Q phone, Motorola initiated a lawsuit (settled out of court in 2000) for allegedly copying the design of its Startac phone. In December 1999, Qualcomm sold its manufacturing interests to Kyocera Corporation, a Japanese CDMA manufacturer and Qualcomm licensee. Qualcomm's infrastructure division was sold to competitor Ericsson in 1999 as part of an out-of-court agreement for a CDMA patent dispute that started in 1996. The sale of the infrastructure division marked the beginning of an increase in Qualcomm's stock price and stronger financial performance, but many of the 1,200 employees involved were discontented working for a competitor and losing their stock options. This led to a protracted legal dispute regarding employee stock options, resulting in $74 million in settlements by 2005. 3G 3G standards were expected to force prior TDMA carriers onto CDMA, in order to meet 3G bandwidth goals. The two largest GSM manufacturers, Nokia and Ericsson, advocated for a greater role for GSM, in order to negotiate lower royalty prices from Qualcomm. In 1998, the European Telecommunications Standards Institute (ETSI) voted in support of the WCDMA standard, which relied less on Qualcomm's CDMA patents. Qualcomm responded by refusing to license its intellectual property for the standard. The Telecommunications Industry Association (TIA) and the Third Generation Partnership Program 2 (3GPP2), advocated for a competing CDMA-2000 standard developed primarily by Qualcomm. American and European politicians advocated for the CDMA-2000 and WCDMA standards respectively. The ITU said it would exclude Qualcomm's CDMA technology from the 3G standards entirely if a patent dispute over the technology with Ericsson was not resolved. The two reached an agreement out-of-court in 1999, one month before a deadline set by the ITU. Both companies agreed to cross-license their technology to each other and to work together on 3G standards. A compromise was eventually reached whereby the ITU would initially endorse three standards: CDMA2000 1X, WCDMA and TD-SCDMA. Qualcomm agreed to license its CDMA patents for variants such as WCDMA. There were 240 million CDMA 3G subscribers by 2004 and 143 carriers in 67 countries by 2005. Qualcomm claimed to own 38 percent of WCDMA's essential patents, whereas European GSM interests sponsored a research paper alleging Qualcomm only owned 19 percent. Qualcomm consolidated its interests in telecommunications carriers, such as Cricket Communications and Pegaso into a holding company, Leap Wireless, in 1998. Leap was spun-off later that year and sold to AT&T in 2014. 4G Qualcomm initially advocated for the CDMA-based Ultra Mobile Broadband (UMB) standard for fourth generation wireless networks. UMB wasn't backwards compatible with prior CDMA networks and didn't operate as well in narrow bandwidths as the LTE (long-term evolution) standard. No cellular networks adopted UMB. Qualcomm halted development of UMB in 2005 and decided to support the LTE standard, even though it didn't rely as heavily on Qualcomm patents. Then, Qualcomm purchased LTE-related patents through acquisitions. By 2012, Qualcomm held 81 seminal patents used in 4G LTE standards, or 12.46 percent. Qualcomm also became more focused on using its intellectual property to manufacture semiconductors in a fabless manufacturing model. A VLSI Technology Organization division was founded in 2004, followed by a DFX group in 2006, which did more of the manufacturing design in-house. Qualcomm announced it was developing the Scorpion central processing unit (CPU) for mobile devices in November 2005. This was followed by the first shipments of the Snapdragon system-on-chip product, which includes a CPU, GPS, graphics processing unit, camera support and other software and semiconductors, in November 2007. The Gobi family of modems for portable devices was released in 2008. Gobi modems were embedded in many laptop brands and Snapdragon system on chips were embedded into most Android devices. Qualcomm won a government auction in India in 2010 for $1 billion in spectrum and licenses from which to offer broadband services. It formed four joint ventures with Indian holding companies for this purpose. A 49 percent stake in the holding companies was acquired by Bharti in May 2012 and the remaining was acquired in October 2012 by AT&T. 5G According to Fortune Magazine, Qualcomm has been developing technologies for future 5G standards in three areas: radios that would use bandwidth from any network it has access to, creating larger ranges of spectrum by combining smaller pieces, and a set of services for Internet of things applications. Qualcomm's first 5G modem chip was announced in October 2016 and a prototype was demonstrated in October 2017. Qualcomm's first 5G antennas were announced in July 2018. As of 2018, Qualcomm had partnerships with 19 mobile device manufacturers and 18 carriers to commercialize 5G technology. By late 2019, several phones were being sold with Qualcomm's 5G technology incorporated. Software and other technology Early software Qualcomm acquired an email application called Eudora in 1991. By 1996, Eudora was installed on 63 percent of PCs. Microsoft Outlook eclipsed Eudora, since it was provided for free by default on Windows-based machines. By 2003 Qualcomm's Eudora was the most popular alternative to Microsoft Outlook, but still had only a five percent share of the market. Software development for Eudora was retired in 2006. In 2001, Qualcomm introduced Brew, a smartphone app development service with APIs to access contacts, billing, app-stores, or multimedia on the phone. South Korean carrier KTFreeTel was the first to adopt the Brew system in November 2001, followed by Verizon in March 2002 for its \"Get it Now\" program. There were 2.5 million Brew users by the end of 2002 and 73 million in 2003. Other technology In 2004, Qualcomm created a MediaFLO subsidiary to bring its FLO (forward link only) specification to market. Qualcomm built an $800 million MediaFLO network of cell towers to supplement carrier networks with one that is designed for multimedia. In comparison to cellular towers that provide two-way communications with each cell phone individually, MediaFLO towers would broadcast multimedia content to mobile phones in a one-way broadcast. Qualcomm also sold FLO-based semiconductors and licenses. Qualcomm created the FLO Forum standards group with 15 industry participants in July 2005. Verizon was the first carrier to partner with MediaFlo in December 2005 for its Verizon Wireless' V Cast TV, which was followed by the AT&T Mobile TV service a couple months later. The MediaFlo service was launched on Super Bowl Sunday in 2007. Despite the interest the service got among carriers, it was unpopular among consumers. The service required users to pay for a subscription and have phones that were equipped with special semiconductors. The service was discontinued in 2011 and its spectrum was sold to AT&T for $1.93 billion. Qualcomm rebooted the effort in 2013 with LTE Broadcast, which uses pre-existing cell towers to broadcast select content locally on a dedicated spectrum, such as during major sporting events. Based on technology acquired from Iridigm in 2004 for $170 million, Qualcomm began commercializing Mirasol displays in 2007, which was expanded into eight products in 2008. Mirasol uses natural light shining on a screen to provide lighting for the display, rather a backlight, in order to reduce power consumption. The amount of space between the surface of the display and a mirror within a 10 micron-wide \"interferometric modulator\" determines the color of the reflected light. Mirasol was eventually closed down after an attempt to revive it in 2013 in Toq watches. In June 2011, Qualcomm introduced AllJoyn, a wireless standard for communicating between devices like cell phones, televisions, air-conditioners, and refrigerators. The Alljoyn technology was donated to the Linux Foundation in December 2013. Qualcomm and the Linux Foundation then formed the Allseen Alliance to administer the standard and Qualcomm developed products that used the AllJoyn standard In December 2011, Qualcomm formed a healthcare subsidiary called Qualcomm Life. Simultaneously, the subsidiary released a cloud-based service for managing clinical data called 2net and the Qualcomm Life Fund, which invests in wireless healthcare technology companies. The subsidiary doubled its employee-count by acquiring HealthyCircles Inc., a healthcare IT company, the following May. Qualcomm life was later sold to a private equity firm, Francisco Partners, in 2019. Developments since 2016 In 2016, Qualcomm developed its first beta processor chip for servers and PCs called \"Server Development Platform\" and sent samples for testing. In January 2017, a second generation data center and PC server chip called Centriq 2400 was released. PC Magazine said the release was \"historic\" for Qualcomm, because it was a new market segment for the company. Qualcomm also created a Qualcomm Datacenter Technologies subsidiary to focus on the PCs and servers market. In 2017, Qualcomm introduced embedded technology for 3D cameras intended for augmented reality apps, and also developed and demonstrated laptop processors. In 2000, Qualcomm formed a joint venture with Ford called Wingcast, which created telematics equipment for cars, but was unsuccessful and closed down two years later. Qualcomm acquired the wireless electric car charging company, HaloIPT, in November 2011 and later sold the company to WiTricity in February 2019. Qualcomm also started introducing Snapdragon system-on-chips and Gobi modems and other software or semiconductor products for self-driving cars and modern in-car computers. In 2020, Qualcomm hired Baidu veteran, Nan Zhou, to head Qualcomm's push into AI. In 2024, Qualcomm identified generative artificial intelligence as a key driver of market demand for its edge computing technology, with the company projecting a total addressable market of approximately $900 billion by 2030. In August 2024, Reuters reported that Qualcomm was among the clients of Contextual AI, a company building retrieval-augmented generation (RAG) agents for enterprise use. In October 2025, Qualcomm announced it was launching new AI accelerator chips meant to challenge NVIDIA's dominant position in the space. The company said its first customer for its AI200 chips will be Humain—an AI company backed by Saudi Arabia's Public Investment Fund, which is set to deploy 200 megawatts worth of Qualcomm's chips in 2026. Patents and patent disputes In 2024, the World Intellectual Property Organization (WIPO)’s Annual PCT Review ranked Qualcomm's number of patent applications published under the PCT System as 3rd in the world, with 3,848 patent applications being published during 2024. In 2017, Qualcomm owned more than 130,000 current or pending patents, an increase from the early 2000s when Qualcomm had more than 1,000 patents. As the sole early investor in CDMA research and development, Qualcomm's patent portfolio contains much of the intellectual property that is essential to CDMA technologies. Since many of Qualcomm's patents are part of an industry standard, the company has agreed to license those patents under \"fair, reasonable, and non-discriminatory\" terms. Qualcomm's royalties come out to about 5% or $30 per mobile device. According to Fortune Magazine, this is about 5–10 times more than what is typically charged by other patent-holders. Qualcomm says its patents are more expensive because they are more important and its pricing is within the range of common licensing practices. However, competitors, clients, and regulators often allege Qualcomm charges unreasonable rates or engages in unfair competition for mandatory patents. Broadcom In 2005, Broadcom and Qualcomm were unable to reach an agreement on cross-licensing their intellectual property, and Broadcom sued Qualcomm alleging it was breaching ten Broadcom patents. Broadcom asked the International Trade Commission to prohibit importing the affected technology. A separate lawsuit alleged Qualcomm was threatening to withhold UMTS patent licenses against manufacturers that bought their semiconductors from competitors, in violation of the standards agreement. Qualcomm alleged Broadcom was using litigation as a negotiation tactic and that it would respond with its own lawsuits. Qualcomm sued Broadcom, alleging it was using seven Qualcomm patents without permission. By late 2006, more than 20 lawsuits had been filed between the two parties and both sides claimed to be winning. In September 2006, a New Jersey court judge ruled that Qualcomm's patent monopoly was an inherent aspect of creating industry standards and that Qualcomm's pricing practices were lawful. In May 2007, a jury ordered Qualcomm to pay Broadcom $19.6 million for infringing on three Broadcom patents. In June 2007, the ITC ruled that Qualcomm had infringed on at least one Broadcom patent and banned corresponding imports. Qualcomm and Broadcom reached a settlement in April 2009, resulting in a cross-licensing agreement, a dismissal of all litigation and Qualcomm paying $891 million over four years. During the litigation, Qualcomm claimed it had never participated in the JVT standards-setting process. However, an engineer's testimony led to discovery of 21 JVT-related emails Qualcomm lawyers had withheld from the court, and 200,000 pages of JVT-related documents. Qualcomm's lawyers said the evidence was accidentally overlooked, whereas the judge said it was gross misconduct. Qualcomm was fined $8.5 million for legal misconduct. On appeal, the court held that Qualcomm could only enforce the related patents against non-JVT members, based on the agreements signed to participate in JVT. Nokia and Project Stockholm Six large telecommunications companies led by Nokia filed a complaint against Qualcomm with the European Commission's antitrust division in October 2005. They alleged Qualcomm was abusing its market position to charge unreasonable rates for its patents. Qualcomm alleged the six companies were colluding together under the code name Project Stockholm in a legal strategy to negotiate lower rates. These events led to a protracted legal dispute. Qualcomm filed a series of patent-infringement lawsuits against Nokia in Europe, Asia, the US, and with the ITC. The parties initiated more than one dozen lawsuits against one another. Several companies filed antitrust complaints against Qualcomm with the Korean Fair Trade Commission, who initiated an investigation into Qualcomm's practices in December 2006. The dispute between Qualcomm and Nokia escalated, when their licensing agreement ended in April 2007. In February 2008, the two parties agreed to halt any new litigation until an initial ruling is made on the first lawsuit in Delaware. Nokia won three consecutive court rulings with the German Federal Patent Court, the High Court in the United Kingdom, and the International Trade Commission respectively. Each found that Nokia was not infringing on Qualcomm's patents. In July 2008, Nokia and Qualcomm reached an out-of-court settlement that ended the dispute and created a 15-year cross-licensing agreement. Recent disputes ParkerVision filed a lawsuit against Qualcomm in July 2011 alleging that it infringed on seven ParkerVision patents related to converting electromagnetic radio signals to lower frequencies. A $173 million jury verdict against Qualcomm was overturned by a judge. In November 2013, the China National Development and Reform Commission initiated an anti-trust investigation into Qualcomm's licensing division. The Securities and Exchange Commission also started an investigation into whether Qualcomm breached antibribery laws through its activities in China. The Chinese regulator raided Qualcomm's Chinese offices in August 2013. The dispute was settled in 2015 for $975 million. In late 2016 The Korea Fair Trade Commission alleged Qualcomm abused a \"dominant market position\" to charge cell phone manufacturers excessive royalties for patents and limit sales to companies selling competing semiconductor products. The regulator gave Qualcomm a fine of $854 million, which the company said it will appeal. Eventually, Qualcomm lost the case in Supreme Court of the Republic of Korea in 2023, causing to enact the fine in force. In April 2017, Qualcomm paid an $814.9 million settlement to BlackBerry as a refund for prepaid licensing fees. In October 2017, Taiwan's Fair Trade Commission fined Qualcomm another $773 million. In late 2018 Qualcomm paid a settlement to Taiwan for $93 million in fines and a promise to spend $700 million in the local Taiwan economy. In October 2025, as part of an anti-trust investigation into Qualcomm, China's market regulator said that the company said it did not notify the agency when it acquired Israeli auto-chip design company Autotalks despite having been informed that the deal required the agency's approval and telling it that the company would not pursue the merger. Several media outlets including CNBC, The Wall Street Journal, Reuters, Barrons, and more speculated that the investigation was part of trade discussions between the US and China. Apple In January 2017, the Federal Trade Commission (FTC) initiated an investigation into allegations that Qualcomm charged excessive royalties for patents that are \"essential to industry standards\". That same year, Apple initiated a $1 billion lawsuit against Qualcomm in the U.S. alleging Qualcomm overcharged for semiconductors and failed to pay $1 billion in rebates. Apple also filed lawsuits in China and the United Kingdom. Apple alleged Qualcomm was engaging in unfair competition by selling industry-standard patents at a discount rate in exchange for an exclusivity agreement for its semiconductor products. An FTC report reached similar conclusions. Qualcomm filed counter-claims alleging Apple made false and misleading statements to induce regulators to sue Qualcomm. Qualcomm also sued Apple's suppliers for allegedly not paying Qualcomm's patent royalties, after Apple stopped reimbursing them for patent fees. Qualcomm petitioned the International Trade Commission to prohibit imports of iPhones, on the premise that they contain stolen Qualcomm patents after Apple's suppliers stopped paying. In August 2017, the International Trade Commission responded to Qualcomm's complaints by starting an investigation of Apple's use of Qualcomm patents without royalties. Qualcomm also filed suit against Apple in China for alleged patent infringement in October 2017. The following month, Apple counter-sued, alleging Qualcomm was using patented Apple technology in its Android components. In December 2018, Chinese and German courts held that Apple infringed on Qualcomm patents and banned sales of certain iPhones. Some patents were held to be invalid, while others were infringed by Apple. In April 2019, Apple and Qualcomm reached an agreement to cease all litigation and sign a six-year licensing agreement. The settlement included a one-time payment from Apple of about $4.5 to 4.7 billion. Terms of the six-year licensing agreement were not disclosed, but the licensing fees were expected to increase revenues by $2 per-share. In January 2018, the European Competition Commission fined Qualcomm $1.2 billion for an arrangement to use Qualcomm chips exclusively in Apple's mobile products. Qualcomm appealed the decision, and in June 2022, Qualcomm announced the company had won its appeal of the European Union antitrust fine. The appeal had highlighted that Apple as a company had no technical alternative other than to use Qualcomm's LTE chipsets. Federal Trade Commission Stemming from the investigation that led to the Apple lawsuit actions, the FTC filed suit against Qualcomm in 2017 alleging it engaged in antitrust behavior due to its monopoly on wireless broadband technology. The complaints filed by the FTC included that Qualcomm charged \"disproportionately high\" patent royalty rates to phone manufacturers and refused to sell them broadband chips if they did not license the patents, a policy referred to as \"no license, no chips\", that Qualcomm refused to license the patent to other chip manufacturers as to maintain their monopoly, and that Qualcomm purposely offered Apple a lower license cost to use their chips exclusively, locking other competitors as well as wireless service providers out of Apple's lucrative market. The trial starting in January 2019, heard by Judge Lucy Koh of the federal Northern District Court that also oversaw the Apple case. Judge Koh ruled in May 2019 against Qualcomm, asserting that Qualcomm's practices did violate antitrust. As part of the ruling, Qualcomm was forced to stop its \"no license, no chips\" bundling with phone manufacturers, and was required to license its patents to other chip manufacturers. As Qualcomm had expressed its intent to appeal, a panel of judges on the 9th circuit of appeals stayed the orders pending the litigation action. Qualcomm appealed to the Ninth Circuit, which reversed the decision in August 2020. The Ninth Circuit determined that Judge Koh's decision strayed beyond the scope of antitrust law and that whether Qualcomm's patent licensing may be considered reasonable and non-discriminatory licensing does not fall within the scope of antitrust law, but rather is a matter of contract and patent law. The court concluded that the FTC failed to meet its burden of proof and that Qualcomm's business practices were better characterized as \"hypercompetitive\" rather than \"anticompetitive\". Operations and market-share Qualcomm develops software, semiconductor designs, patented intellectual property, development tools and services, but does not manufacture physical products like phones or infrastructure equipment. The company's revenues are derived from licensing fees for use of its intellectual property, sales of semiconductor products that are based on its designs, and from other wireless hardware, software or services. Qualcomm divides its business into three categories: QCT (Qualcomm CDMA Technologies): CDMA wireless products; 80% of revenue QTL (Qualcomm Technology Licensing): Licensing; 19% of revenue QSI (Qualcomm strategic initiatives): Investing in other tech companies; less than 1% of revenue Qualcomm is a predominantly fabless provider of semiconductor products for wireless communications and data transfer in portable devices. According to the analyst firm Strategy Analytics, Qualcomm has a 39 percent market-share for smartphone application processors and a 50 percent market-share of baseband processors. Its share of the market for application processors on tablets is 18 percent. According to analyst firm ABI Research, Qualcomm has a 65 percent market-share in LTE baseband. Qualcomm also provides licenses to use its patents, many of which are critical to the CDMA2000, TD-SCDMA and WCDMA wireless standards. The company is estimated to earn $20 for every smartphone sold. Qualcomm is the largest public company in San Diego. It has a philanthropic arm called The Qualcomm Foundation. A January 2013 lawsuit resulted in Qualcomm voluntarily adopting a policy of disclosing its political contributions. According to The New York Times, Qualcomm's new disclosure policy was praised by transparency advocates."
}