{
  "ticker": "RCL",
  "cik": "0000884887",
  "company_name": "Royal Caribbean Group",
  "corrected_name": "Royal Caribbean Group",
  "wiki_title_used": "Royal Caribbean Group",
  "exists": true,
  "raw_text": "Royal Caribbean Group, formerly known as Royal Caribbean Cruises Ltd., is a cruise holding company headquartered in Miami, Florida, United States and incorporated in Liberia. It is the world's second-largest cruise line operator, after Carnival Corporation & plc. As of September 2025, Royal Caribbean Group fully owns three cruise lines: Royal Caribbean International, Celebrity Cruises, and Silversea Cruises. It also holds a 50% stake in TUI Cruises, which operates Mein Schiff and Hapag-Lloyd Cruises, with the Group's global fleet consisting of 68 ships.\n\nHistory\nRoyal Caribbean Group was formed as Royal Caribbean Cruises Ltd. in 1997 when Royal Caribbean Cruise Line purchased Celebrity Cruises. The decision was made to keep the two cruise line brands separate following the merger; as a result Royal Caribbean Cruise Line was re-branded Royal Caribbean International and Royal Caribbean Cruises Ltd. was established as the new parent company of both Royal Caribbean International and Celebrity Cruises.\nA third brand under Royal Caribbean Cruises ownership was formed in 2000 when Island Cruises was created as a joint venture with First Choice Holidays. Island Cruises became an informal cruise line on the British and Brazilian markets.\nIn November 2006, Royal Caribbean Cruises purchased Pullmantur Cruises based in Madrid, Spain. From there, the company expanded rapidly with the creation of Azamara Cruises in May 2007 as a subsidiary of Celebrity Cruises. It followed this with the formation of CDF Croisières de France in May 2008 to serve the French-language market.\nRoyal Caribbean also has an interest in TUI Cruises, a joint venture with TUI AG, which began operations in 2009 aimed at a German-speaking market. TUI Cruises's subsidiary, TUI Travel, had a 50% interest in Island Cruises following their merger with First Choice Holidays in 2007. In October 2008, Royal Caribbean Cruises rationalized their holdings by selling their share of Island Cruises to TUI.\nIn early 2019, Royal Caribbean announced in a joint venture with ITM Group the formation of Holistica, a company that intends to develop cruise destinations. The only known destination that the company is to develop is the Grand Lucayan Resort, located in Freeport after the hotel campus was sold to newly formed subsidiary by the Bahamian Government.\nOn July 10, 2020, Royal Caribbean Cruises purchased the remaining shares of Silversea Cruises. That same month, it also changed its name to Royal Caribbean Group. It also adjusted its logo. Royal Caribbean sold Azamara  Cruises to Sycamore Partners in March 2021 for $201 million.\nIn July 2022, Royal Caribbean Group received court approval to purchase Endeavor, a former Crystal Cruise ship, for $275 million. The ship was renamed Silver Endeavour when it officially joins the Royal Caribbean's subsidiary, Silversea Cruises' fleet.\nOn February 1, 2024, Royal Caribbean Group broke ground on a new headquarters building between its two existing headquarters buildings at PortMiami.  The company's new 10-story headquarters building will have about 380,000 square feet of interior space and includes on-site amenities such as \"green spaces, gyms, and dry cleaning\".  The company will also update its existing headquarters buildings and add a multi-story parking garage.\n\nBrands and ships\nRoyal Caribbean International\nRoyal Caribbean International (RCI), formerly Royal Caribbean Cruise Line (RCCL), is a cruise line founded in 1968 in Norway and organized as a wholly owned subsidiary of Royal Caribbean Group since 1997. \nBased in Miami, Florida, it is the largest cruise line by revenue and second largest by passenger counts. As of 2025, Royal Caribbean International controlled 27.0% of the worldwide cruise market by passengers and 24.8% by revenue.\nAs of August 2025, the line operates 29 ships; three additional ships are on order and two ships are planned but do not have a launch date.\n\nCelebrity Cruises\nCelebrity Cruises is a cruise line headquartered in Miami, Florida, and a wholly owned subsidiary of Royal Caribbean Group. Celebrity Cruises was founded in 1988 by the Greece-based Chandris Group, and merged with Royal Caribbean Cruise Line in 1997.\n\nSilversea Cruises\nSilversea Cruises is a luxury cruise line headquartered in Monaco. Founded in 1994 by the Vlasov Group of Monaco and the Lefebvre family of Rome it pioneered all-inclusive cruising with its first ship, Silver Cloud. Since July 2020, it has been owned by Royal Caribbean Group.\n\nOther significant investments\nTUI Cruises\nHolistica Destinations\nHolistica Destinations was formed in early 2019 as a joint venture between Royal Caribbean Group and the ITM Group with the intention of purchasing the Grand Lucayan Resort and re-developing the neighbouring Freeport Harbour in The Bahamas as a cruise destinations that would benefit the local Freeport economy. However, the Government of the Bahamas withdrew support for the re-development of the Grand Lucayan Resort citing that it was 'not in the best interests of the Bahamian people'. Holistica continues to plan for a Freeport Harbour re-development.\nHolistica also operates three other popular cruise destinations in the Caribbean. These are Costa Maya in Mexico, Roatan in Honduras, and Puerto Plata in the Dominican Republic.\n\nGrand Bahama Shipyard\nGrand Bahama Shipyard is a ship maintenance facility located in Freeport, the Bahamas. Royal Caribbean Group holds a 40% stake. Other investors include Carnival Corporation (40% stake) and the Grand Bahama Port Authority (20% stake). Ans MSC.\nRoyal Caribbean Group and Carnival Corporation announced a joint investment of $350 million in the shipyard in 2021, partly in response to damage suffered to the facility after an incident involving the collapse of two cranes during maintenance on Oasis of the Seas and damages caused by Hurricane Dorian, both occurring in 2019.\n\niCON Infrastructure partnership\nRoyal Caribbean Group and iCON Infrastructure entered a partnership in 2022 to own, manage, and develop strategic cruise port infrastructure in home ports and key ports of call. The partnership includes Royal Caribbean International-operated Terminal A in PortMiami, as well as several development projects in Spain, Italy, and the U.S. Virgin Islands. Royal Caribbean Group holds a 10% stake.\n\nWamos Air\nWamos Air (formerly Pullmantur Air) is a wet-leasing and charter airline headquartered in Madrid, Spain. Royal Caribbean Group holds a 19% stake.\n\nStrategic partnership with Meyer Turku and Finland\nIn December 2022, Royal Caribbean announced a strategic partnership with Meyer Turku and the government of Finland to chart the way forward for innovative and sustainable shipbuilding in Finland.\n\nFormer brands\nIsland Cruises (50% share, owned 2000–2008)\nCDF Croisières de France (2007–2017)\nSkySea Cruise Lines (35%, 2016–2018)\nAzamara Cruises (2000–2021, sold)\nPullmantur Cruises (2000–2020, defunct)\nAdmiral Cruises (1988–1992)\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Royal Caribbean Group:",
  "clean_text": "Royal Caribbean Group, formerly known as Royal Caribbean Cruises Ltd., is a cruise holding company headquartered in Miami, Florida, United States and incorporated in Liberia. It is the world's second-largest cruise line operator, after Carnival Corporation & plc. As of September 2025, Royal Caribbean Group fully owns three cruise lines: Royal Caribbean International, Celebrity Cruises, and Silversea Cruises. It also holds a 50% stake in TUI Cruises, which operates Mein Schiff and Hapag-Lloyd Cruises, with the Group's global fleet consisting of 68 ships. History Royal Caribbean Group was formed as Royal Caribbean Cruises Ltd. in 1997 when Royal Caribbean Cruise Line purchased Celebrity Cruises. The decision was made to keep the two cruise line brands separate following the merger; as a result Royal Caribbean Cruise Line was re-branded Royal Caribbean International and Royal Caribbean Cruises Ltd. was established as the new parent company of both Royal Caribbean International and Celebrity Cruises. A third brand under Royal Caribbean Cruises ownership was formed in 2000 when Island Cruises was created as a joint venture with First Choice Holidays. Island Cruises became an informal cruise line on the British and Brazilian markets. In November 2006, Royal Caribbean Cruises purchased Pullmantur Cruises based in Madrid, Spain. From there, the company expanded rapidly with the creation of Azamara Cruises in May 2007 as a subsidiary of Celebrity Cruises. It followed this with the formation of CDF Croisières de France in May 2008 to serve the French-language market. Royal Caribbean also has an interest in TUI Cruises, a joint venture with TUI AG, which began operations in 2009 aimed at a German-speaking market. TUI Cruises's subsidiary, TUI Travel, had a 50% interest in Island Cruises following their merger with First Choice Holidays in 2007. In October 2008, Royal Caribbean Cruises rationalized their holdings by selling their share of Island Cruises to TUI. In early 2019, Royal Caribbean announced in a joint venture with ITM Group the formation of Holistica, a company that intends to develop cruise destinations. The only known destination that the company is to develop is the Grand Lucayan Resort, located in Freeport after the hotel campus was sold to newly formed subsidiary by the Bahamian Government. On July 10, 2020, Royal Caribbean Cruises purchased the remaining shares of Silversea Cruises. That same month, it also changed its name to Royal Caribbean Group. It also adjusted its logo. Royal Caribbean sold Azamara Cruises to Sycamore Partners in March 2021 for $201 million. In July 2022, Royal Caribbean Group received court approval to purchase Endeavor, a former Crystal Cruise ship, for $275 million. The ship was renamed Silver Endeavour when it officially joins the Royal Caribbean's subsidiary, Silversea Cruises' fleet. On February 1, 2024, Royal Caribbean Group broke ground on a new headquarters building between its two existing headquarters buildings at PortMiami. The company's new 10-story headquarters building will have about 380,000 square feet of interior space and includes on-site amenities such as \"green spaces, gyms, and dry cleaning\". The company will also update its existing headquarters buildings and add a multi-story parking garage. Brands and ships Royal Caribbean International Royal Caribbean International (RCI), formerly Royal Caribbean Cruise Line (RCCL), is a cruise line founded in 1968 in Norway and organized as a wholly owned subsidiary of Royal Caribbean Group since 1997. Based in Miami, Florida, it is the largest cruise line by revenue and second largest by passenger counts. As of 2025, Royal Caribbean International controlled 27.0% of the worldwide cruise market by passengers and 24.8% by revenue. As of August 2025, the line operates 29 ships; three additional ships are on order and two ships are planned but do not have a launch date. Celebrity Cruises Celebrity Cruises is a cruise line headquartered in Miami, Florida, and a wholly owned subsidiary of Royal Caribbean Group. Celebrity Cruises was founded in 1988 by the Greece-based Chandris Group, and merged with Royal Caribbean Cruise Line in 1997. Silversea Cruises Silversea Cruises is a luxury cruise line headquartered in Monaco. Founded in 1994 by the Vlasov Group of Monaco and the Lefebvre family of Rome it pioneered all-inclusive cruising with its first ship, Silver Cloud. Since July 2020, it has been owned by Royal Caribbean Group. Other significant investments TUI Cruises Holistica Destinations Holistica Destinations was formed in early 2019 as a joint venture between Royal Caribbean Group and the ITM Group with the intention of purchasing the Grand Lucayan Resort and re-developing the neighbouring Freeport Harbour in The Bahamas as a cruise destinations that would benefit the local Freeport economy. However, the Government of the Bahamas withdrew support for the re-development of the Grand Lucayan Resort citing that it was 'not in the best interests of the Bahamian people'. Holistica continues to plan for a Freeport Harbour re-development. Holistica also operates three other popular cruise destinations in the Caribbean. These are Costa Maya in Mexico, Roatan in Honduras, and Puerto Plata in the Dominican Republic. Grand Bahama Shipyard Grand Bahama Shipyard is a ship maintenance facility located in Freeport, the Bahamas. Royal Caribbean Group holds a 40% stake. Other investors include Carnival Corporation (40% stake) and the Grand Bahama Port Authority (20% stake). Ans MSC. Royal Caribbean Group and Carnival Corporation announced a joint investment of $350 million in the shipyard in 2021, partly in response to damage suffered to the facility after an incident involving the collapse of two cranes during maintenance on Oasis of the Seas and damages caused by Hurricane Dorian, both occurring in 2019. iCON Infrastructure partnership Royal Caribbean Group and iCON Infrastructure entered a partnership in 2022 to own, manage, and develop strategic cruise port infrastructure in home ports and key ports of call. The partnership includes Royal Caribbean International-operated Terminal A in PortMiami, as well as several development projects in Spain, Italy, and the U.S. Virgin Islands. Royal Caribbean Group holds a 10% stake. Wamos Air Wamos Air (formerly Pullmantur Air) is a wet-leasing and charter airline headquartered in Madrid, Spain. Royal Caribbean Group holds a 19% stake. Strategic partnership with Meyer Turku and Finland In December 2022, Royal Caribbean announced a strategic partnership with Meyer Turku and the government of Finland to chart the way forward for innovative and sustainable shipbuilding in Finland. Former brands Island Cruises (50% share, owned 2000–2008) CDF Croisières de France (2007–2017) SkySea Cruise Lines (35%, 2016–2018) Azamara Cruises (2000–2021, sold) Pullmantur Cruises (2000–2020, defunct) Admiral Cruises (1988–1992)"
}