{
  "ticker": "REG",
  "cik": "0000910606",
  "company_name": "Regency Centers",
  "corrected_name": "Regency Centers",
  "wiki_title_used": "Regency Centers",
  "exists": true,
  "raw_text": "Regency Centers Corporation is a real estate investment trust based in Jacksonville, Florida, and is one of the largest operators of shopping centers with grocery stores as anchor tenants. As of October 21, 2020, the company owned 415 properties comprising 56-million-square feet of space. Notable properties owned by the company include Serramonte Center and a 30% interest in Village District.\n\nHistory\nIn 1963, the company was founded as Regency Square Properties by Martin and Joan Stein. Four years later, the company built Jacksonville's first regional mall, Regency Square.\nIn 1993, the company became a public company, raising $108 million in an initial public offering.\nIn 1997, the company acquired Branch Properties, a Publix developer and leading owner of shopping centers in Atlanta, Georgia.\nIn 2004, the company acquired a $400-million property portfolio from Branch Properties.\nOn December 27, 2004, the company and California State Teachers’ Retirement System (CalSTRS) formed a new co-investment partnership to acquire over $200 million in neighborhood and community shopping centers.\nIn 2005, the company, in partnership with Macquarie CountryWide Trust, acquired 101 centers from First Washington Realty, Inc. and California Public Employees' Retirement System for $2.74 billion. First Washington Realty Inc. and the California Public Employees’ Retirement System bought back a 60% interest in most of the portfolio in 2009.\nIn August 2013, the company sold a portfolio of seven grocery-oriented shopping centers to a joint venture between Blackstone Group and DDR Corp. (now SITE Centers) for $332 million.\nIn 2017, the company acquired Equity One.\nLongtime CEO Hap Stein stepped down from his role as Chairman & CEO in 2019. He was succeeded by Lisa Palmer.\n\nReferences\nExternal links\nBusiness data for Regency Centers Corporation:",
  "clean_text": "Regency Centers Corporation is a real estate investment trust based in Jacksonville, Florida, and is one of the largest operators of shopping centers with grocery stores as anchor tenants. As of October 21, 2020, the company owned 415 properties comprising 56-million-square feet of space. Notable properties owned by the company include Serramonte Center and a 30% interest in Village District. History In 1963, the company was founded as Regency Square Properties by Martin and Joan Stein. Four years later, the company built Jacksonville's first regional mall, Regency Square. In 1993, the company became a public company, raising $108 million in an initial public offering. In 1997, the company acquired Branch Properties, a Publix developer and leading owner of shopping centers in Atlanta, Georgia. In 2004, the company acquired a $400-million property portfolio from Branch Properties. On December 27, 2004, the company and California State Teachers’ Retirement System (CalSTRS) formed a new co-investment partnership to acquire over $200 million in neighborhood and community shopping centers. In 2005, the company, in partnership with Macquarie CountryWide Trust, acquired 101 centers from First Washington Realty, Inc. and California Public Employees' Retirement System for $2.74 billion. First Washington Realty Inc. and the California Public Employees’ Retirement System bought back a 60% interest in most of the portfolio in 2009. In August 2013, the company sold a portfolio of seven grocery-oriented shopping centers to a joint venture between Blackstone Group and DDR Corp. (now SITE Centers) for $332 million. In 2017, the company acquired Equity One. Longtime CEO Hap Stein stepped down from his role as Chairman & CEO in 2019. He was succeeded by Lisa Palmer."
}