{
  "ticker": "REGN",
  "cik": "0000872589",
  "company_name": "Regeneron Pharmaceuticals",
  "corrected_name": "Regeneron Pharmaceuticals",
  "wiki_title_used": "Regeneron Pharmaceuticals",
  "exists": true,
  "raw_text": "Regeneron Pharmaceuticals, Inc. is an American biotechnology company headquartered in Westchester County, New York. The company was founded in 1988.  Originally focused on neurotrophic factors and their regenerative capabilities, giving rise to its present name; the company has since expanded operations into the study of both cytokine and tyrosine kinase receptors, which gave rise to their first product, which is a VEGF-trap.\n\nCompany history\nThe company was founded by CEO Leonard Schleifer and scientist George Yancopoulos in 1988.\nRegeneron has developed aflibercept, a VEGF inhibitor, and rilonacept, an interleukin-1 blocker. VEGF is a protein that normally stimulates the growth of blood vessels, and interleukin-1 is a protein that is normally involved in inflammation.\nOn March 26, 2012, Bloomberg announced that Sanofi and Regeneron were in development of a new drug that would help reduce cholesterol up to 72% more than its competitors. The new drug would target the PCSK9 gene.\nIn July 2015, the company announced a new global collaboration with Sanofi to discover, develop, and commercialize new immuno-oncology drugs, which could generate more than $2 billion for Regeneron, with $640 million upfront, $750 million for proof-of-concept data, and $650 million from the development of REGN2810. REGN2810 was later named cemiplimab. In 2019, Regeneron Pharmaceuticals was announced the 7th best publicly listed company of the 2010s, with a total return of 1,457%. Regeneron Pharmaceuticals was home to the two highest-paid pharmaceutical executives as of 2020.\nIn October 2017, Regeneron made a deal with the Biomedical Advanced Research and Development Authority (BARDA) that the U.S. government would fund 80% of the costs for Regeneron to develop and manufacture antibody-based medications, which subsequently, in 2020, included their COVID-19 treatments, and Regeneron would retain the right to set prices and control production. This deal was criticized in The New York Times. Such deals are not unusual for routine drug development in the American pharmaceutical market.\nIn 2019, the company was added to the Dow Jones Sustainability World Index.\nIn May 2020, Regeneron announced it would repurchase approx. 19.2 million of its shares for around $5 billion, held directly by Sanofi. Prior to the transaction, Sanofi held 23.2 million Regeneron shares.\nIn April 2022, the business announced it would acquire Checkmate Pharmaceuticals for around $250 million, enhancing its number of immuno-oncology drugs.\nIn August 2023, Regeneron announced it would acquire Decibel Therapeutics.\nIn December 2023, Regeneron acquired an Avon Products property in Suffern, New York to be used for cold storage, research and development laboratories\nIn April 2024, the company acquired 2seventy Bio.\nIn May 2025, the company was awarded $135.6 million in compensatory damages and $271.2 million in punitive damages in the United States District Court for the District of Delaware in a victorious antitrust case filed against Amgen. Regeneron alleged Amgen employed anticompetitive practices to exclude Praluent from the market and elevate Amgen's rival Repatha.\n\nExperimental treatment for COVID-19\nOn February 4, 2020, the U.S. Department of Health and Human Services, which already worked with Regeneron, announced that Regeneron would pursue monoclonal antibodies to fight COVID-19.\nIn July 2020, under Operation Warp Speed, Regeneron was awarded a $450 million government contract to manufacture and supply its experimental treatment REGN-COV2, an artificial \"antibody cocktail\" which was then undergoing clinical trials for its potential both to treat people with COVID-19 and to prevent SARS-CoV-2 coronavirus infection. The $450 million came from the Biomedical Advanced Research and Development Authority (BARDA), the DoD Joint Program Executive Office for Chemical, Biological, Radiological and Nuclear Defense, and Army Contracting Command. Regeneron expected to produce 70,000–300,000 treatment doses or 420,000–1,300,000 prevention doses. \"By funding this manufacturing effort, the federal government will own the doses expected to result from the demonstration project,\" the government said in its July 7 news release. Regeneron similarly said in its own news release that same day that \"the government has committed to making doses from these lots available to the American people at no cost and would be responsible for their distribution,\" noting that this depended on the government granting emergency use authorization or product approval. California based laboratory, FOMAT, is part of the clinical investigation through their doctors Augusto and Nicholas Focil.\nIn October 2020 when U.S. President Donald Trump was infected with COVID-19 and taken to Walter Reed National Military Medical Center in Bethesda, Maryland, he was administered REGN-COV2. His doctors obtained it from Regeneron via a compassionate use request (as clinical trials had not yet been completed and the drug had not yet been approved by the US Food and Drug Administration (FDA)). On October 7, Trump posted a five-minute video to Twitter reasserting that this drug should be \"free.\" That same day, Regeneron filed with the FDA for emergency use authorization. In the filing, it specified that it currently had 50,000 doses and that it expected to reach a total of 300,000 doses \"within the next few months.\" The FDA granted approval for emergency use authorization in November 2020.\n\nMarketed products\nArcalyst (rilonacept) is used for specific, rare autoinflammatory conditions. Approved by the FDA in February 2008.\nEylea (aflibercept injection) was approved by the U.S. Food and Drug Administration (FDA) in November 2011 to treat a common cause of blindness in the elderly. Eylea is reported to cost $11,000 per year for each eye treated.\nZaltrap (aflibercept injection) is used for metastatic colorectal cancer approved by the FDA in August 2012.\nPraluent (alirocumab) is indicated as an adjunct to diet and maximally tolerated statin therapy for the treatment of adults with heterozygous familial hypercholesterolemia or clinical atherosclerotic cardiovascular disease (ASCVD) who require additional lowering of low-density lipoprotein (LDL) cholesterol. Approved by the FDA in July 2015, It is reported to cost $4,500 to $8,000 per year.\nDupixent (dupilumab injection) is for the treatment of adolescent and adult patients' atopic dermatitis. It was approved by the FDA in March 2017 and is reported to cost $37,000 per year.\nKevzara (sarilumab injection) is an interleukin-6 (IL-6) receptor antagonist for treatment of adults with rheumatoid arthritis approved by the FDA in May 2017.  Trials commenced in March 2020 to evaluate the effectiveness of Kevzara in the treatment of COVID-19.\nLibtayo (cemiplimab injection) is a monoclonal antibody targeting the PD-1 pathway as a checkpoint inhibitor, for the treatment of people with metastatic cutaneous squamous cell carcinoma (cSCC) or locally advanced cSCC who are not candidates for curative surgery or curative radiation. Libtayo was approved by the FDA in September 2018.\nInmazeb (atoltivimab/maftivimab/odesivimab) is a drug made of three antibodies, developed to treat deadly Ebola virus. In October 2020, the U.S. Food and Drug Administration (FDA) approved it with an indication for the treatment of infection caused by Zaire ebolavirus.\nVeopoz (pozelimab-bbfg) is a fully human monoclonal antibody targeting complement factor C5, a protein involved in complement system activation. In August 2023, it was approved by the FDA for children and adults with CHAPLE disease or CD55-deficient protein-losing enteropathy.\n\nTechnology platforms\nTrap Fusion Proteins: Regeneron's novel and patented Trap technology creates high-affinity product candidates for many types of signaling molecules, including growth factors and cytokines. The Trap technology involves fusing two distinct fully human receptor components and a fully human immunoglobulin-G constant region.\nFully Human Monoclonal Antibodies: Regeneron has developed a suite (VelociSuite) of patented technologies, including VelocImmune and VelociMab, that allow Regeneron scientists to determine the best targets for therapeutic intervention and rapidly generate high-quality, fully human antibodies drug candidates addressing these targets.\n\nFinancial performance\nKey people\nThe founders Leonard Schleifer and George Yancopoulos are reported to hold $1.3 billion and $900 million in company stock, respectively. Both are from Queens, New York. Schleifer was formerly a professor of medicine at Weill Cornell Medical School. Yancopoulos was a post-doctoral fellow, and MD/PhD student at Columbia University. Yancopoulos was involved in each drug's development.\n\nSee also\nBiotech and pharmaceutical companies in the New York metropolitan area\nRegeneron Science Talent Search\nRockwood Hall\n\nReferences\nExternal links\n\nOfficial website\n\nBusiness data for Regeneron Pharmaceuticals, Inc.:",
  "clean_text": "Regeneron Pharmaceuticals, Inc. is an American biotechnology company headquartered in Westchester County, New York. The company was founded in 1988. Originally focused on neurotrophic factors and their regenerative capabilities, giving rise to its present name; the company has since expanded operations into the study of both cytokine and tyrosine kinase receptors, which gave rise to their first product, which is a VEGF-trap. Company history The company was founded by CEO Leonard Schleifer and scientist George Yancopoulos in 1988. Regeneron has developed aflibercept, a VEGF inhibitor, and rilonacept, an interleukin-1 blocker. VEGF is a protein that normally stimulates the growth of blood vessels, and interleukin-1 is a protein that is normally involved in inflammation. On March 26, 2012, Bloomberg announced that Sanofi and Regeneron were in development of a new drug that would help reduce cholesterol up to 72% more than its competitors. The new drug would target the PCSK9 gene. In July 2015, the company announced a new global collaboration with Sanofi to discover, develop, and commercialize new immuno-oncology drugs, which could generate more than $2 billion for Regeneron, with $640 million upfront, $750 million for proof-of-concept data, and $650 million from the development of REGN2810. REGN2810 was later named cemiplimab. In 2019, Regeneron Pharmaceuticals was announced the 7th best publicly listed company of the 2010s, with a total return of 1,457%. Regeneron Pharmaceuticals was home to the two highest-paid pharmaceutical executives as of 2020. In October 2017, Regeneron made a deal with the Biomedical Advanced Research and Development Authority (BARDA) that the U.S. government would fund 80% of the costs for Regeneron to develop and manufacture antibody-based medications, which subsequently, in 2020, included their COVID-19 treatments, and Regeneron would retain the right to set prices and control production. This deal was criticized in The New York Times. Such deals are not unusual for routine drug development in the American pharmaceutical market. In 2019, the company was added to the Dow Jones Sustainability World Index. In May 2020, Regeneron announced it would repurchase approx. 19.2 million of its shares for around $5 billion, held directly by Sanofi. Prior to the transaction, Sanofi held 23.2 million Regeneron shares. In April 2022, the business announced it would acquire Checkmate Pharmaceuticals for around $250 million, enhancing its number of immuno-oncology drugs. In August 2023, Regeneron announced it would acquire Decibel Therapeutics. In December 2023, Regeneron acquired an Avon Products property in Suffern, New York to be used for cold storage, research and development laboratories In April 2024, the company acquired 2seventy Bio. In May 2025, the company was awarded $135.6 million in compensatory damages and $271.2 million in punitive damages in the United States District Court for the District of Delaware in a victorious antitrust case filed against Amgen. Regeneron alleged Amgen employed anticompetitive practices to exclude Praluent from the market and elevate Amgen's rival Repatha. Experimental treatment for COVID-19 On February 4, 2020, the U.S. Department of Health and Human Services, which already worked with Regeneron, announced that Regeneron would pursue monoclonal antibodies to fight COVID-19. In July 2020, under Operation Warp Speed, Regeneron was awarded a $450 million government contract to manufacture and supply its experimental treatment REGN-COV2, an artificial \"antibody cocktail\" which was then undergoing clinical trials for its potential both to treat people with COVID-19 and to prevent SARS-CoV-2 coronavirus infection. The $450 million came from the Biomedical Advanced Research and Development Authority (BARDA), the DoD Joint Program Executive Office for Chemical, Biological, Radiological and Nuclear Defense, and Army Contracting Command. Regeneron expected to produce 70,000–300,000 treatment doses or 420,000–1,300,000 prevention doses. \"By funding this manufacturing effort, the federal government will own the doses expected to result from the demonstration project,\" the government said in its July 7 news release. Regeneron similarly said in its own news release that same day that \"the government has committed to making doses from these lots available to the American people at no cost and would be responsible for their distribution,\" noting that this depended on the government granting emergency use authorization or product approval. California based laboratory, FOMAT, is part of the clinical investigation through their doctors Augusto and Nicholas Focil. In October 2020 when U.S. President Donald Trump was infected with COVID-19 and taken to Walter Reed National Military Medical Center in Bethesda, Maryland, he was administered REGN-COV2. His doctors obtained it from Regeneron via a compassionate use request (as clinical trials had not yet been completed and the drug had not yet been approved by the US Food and Drug Administration (FDA)). On October 7, Trump posted a five-minute video to Twitter reasserting that this drug should be \"free.\" That same day, Regeneron filed with the FDA for emergency use authorization. In the filing, it specified that it currently had 50,000 doses and that it expected to reach a total of 300,000 doses \"within the next few months.\" The FDA granted approval for emergency use authorization in November 2020. Marketed products Arcalyst (rilonacept) is used for specific, rare autoinflammatory conditions. Approved by the FDA in February 2008. Eylea (aflibercept injection) was approved by the U.S. Food and Drug Administration (FDA) in November 2011 to treat a common cause of blindness in the elderly. Eylea is reported to cost $11,000 per year for each eye treated. Zaltrap (aflibercept injection) is used for metastatic colorectal cancer approved by the FDA in August 2012. Praluent (alirocumab) is indicated as an adjunct to diet and maximally tolerated statin therapy for the treatment of adults with heterozygous familial hypercholesterolemia or clinical atherosclerotic cardiovascular disease (ASCVD) who require additional lowering of low-density lipoprotein (LDL) cholesterol. Approved by the FDA in July 2015, It is reported to cost $4,500 to $8,000 per year. Dupixent (dupilumab injection) is for the treatment of adolescent and adult patients' atopic dermatitis. It was approved by the FDA in March 2017 and is reported to cost $37,000 per year. Kevzara (sarilumab injection) is an interleukin-6 (IL-6) receptor antagonist for treatment of adults with rheumatoid arthritis approved by the FDA in May 2017. Trials commenced in March 2020 to evaluate the effectiveness of Kevzara in the treatment of COVID-19. Libtayo (cemiplimab injection) is a monoclonal antibody targeting the PD-1 pathway as a checkpoint inhibitor, for the treatment of people with metastatic cutaneous squamous cell carcinoma (cSCC) or locally advanced cSCC who are not candidates for curative surgery or curative radiation. Libtayo was approved by the FDA in September 2018. Inmazeb (atoltivimab/maftivimab/odesivimab) is a drug made of three antibodies, developed to treat deadly Ebola virus. In October 2020, the U.S. Food and Drug Administration (FDA) approved it with an indication for the treatment of infection caused by Zaire ebolavirus. Veopoz (pozelimab-bbfg) is a fully human monoclonal antibody targeting complement factor C5, a protein involved in complement system activation. In August 2023, it was approved by the FDA for children and adults with CHAPLE disease or CD55-deficient protein-losing enteropathy. Technology platforms Trap Fusion Proteins: Regeneron's novel and patented Trap technology creates high-affinity product candidates for many types of signaling molecules, including growth factors and cytokines. The Trap technology involves fusing two distinct fully human receptor components and a fully human immunoglobulin-G constant region. Fully Human Monoclonal Antibodies: Regeneron has developed a suite (VelociSuite) of patented technologies, including VelocImmune and VelociMab, that allow Regeneron scientists to determine the best targets for therapeutic intervention and rapidly generate high-quality, fully human antibodies drug candidates addressing these targets. Financial performance Key people The founders Leonard Schleifer and George Yancopoulos are reported to hold $1.3 billion and $900 million in company stock, respectively. Both are from Queens, New York. Schleifer was formerly a professor of medicine at Weill Cornell Medical School. Yancopoulos was a post-doctoral fellow, and MD/PhD student at Columbia University. Yancopoulos was involved in each drug's development."
}