{
  "ticker": "RF",
  "cik": "0001281761",
  "company_name": "Regions Financial Corporation",
  "corrected_name": "Regions Financial Corporation",
  "wiki_title_used": "Regions Financial Corporation",
  "exists": true,
  "raw_text": "Regions Financial Corporation is an American bank holding company headquartered in the Regions Center in Birmingham, Alabama. The company provides retail and commercial banking, trust, stock brokerage, and mortgage services. Its banking subsidiary, Regions Bank, operates about 2,000 automated teller machines and 1,300 branches in 15 states in the Southern and Midwestern United States.\nRegions is ranked 428th on the Fortune 500 and is component headquartered in Alabama. Regions is also on the list of largest banks in the United States.\nRegions is the largest deposit holder in Alabama and Tennessee. It is also one of the largest deposit holders in Arkansas, Louisiana, Mississippi, and Florida.\nThe company sponsors Regions Field, a Minor League Baseball stadium in Birmingham, Alabama, and the Tradition golf tournament. It sponsored the Regions Charity Classic, a golf tournament held in 2009 and 2010.\nThe company has a partnership with Operation HOPE, Inc. to provide free financial education to underserved communities. In 2019, the company expanded its Workday, Inc. system in partnership with EnterpriseAlumni to engage and enable ex-employees to extend their corporate social responsibility initiatives.\n\nHistory\nRegions Financial Corporation, formerly known as First Alabama Bankshares, was founded on July 13, 1971 with the merger of three Alabama banks: First National Bank of Montgomery, Alabama (opened 1871), Exchange Security Bank of Birmingham, Alabama (opened 1928), and First National Bank of Huntsville, Alabama (opened 1856). The headquarters of First National Bank of Huntsville was a historic building built in 1835. It served as a hospital for Union soldiers during the American Civil War, and once held a rifle owned by Frank James as collateral for bail money when he was incarcerated across the street in the Madison County Jail.\nUntil their formal merger in March 1985, under revised banking regulations, the banks continued to operate independently.\nIn 1986, changes in the Interstate Banking Bill allowed bank holding companies to purchase bank branches outside the state in which they were chartered. First Alabama Bankshares expanded its operations first into Florida, continuing into Georgia, Tennessee, and Arkansas. In 1994, to reflect its growth into a regional company, First Alabama Bankshares changed its name to Regions Financial Corporation and the name of its banking subsidiary to Regions Bank.\nRegions added banking branches in Alabama, Georgia, Tennessee, Florida, South Carolina, Texas, Louisiana, and Arkansas. The name \"Regions\" was purchased from First Commercial Corporation, the Arkansas Bank that Regions subsequently purchased in 1998.\nIn 2001, Regions acquired Rebsamen Insurance Company, which was renamed Regions Insurance Group.\nIn 2001, Regions acquired Morgan Keegan & Company for $789 million. In January 2012, Regions sold Morgan Keegan to Raymond James for $930 million. The trust department was retained by Regions and now operates as Regions Trust.\nIn 2002, the company announced that it will list its common stock on the New York Stock Exchange.\nIn 2002, Regions acquired Independence Bank for approximately $24 million in cash.\nOn January 24, 2004, Regions merged with Memphis, Tennessee–based Union Planters Bank in a $5.9 billion transaction. Jackson W. Moore, the former CEO of Union Planters, became CEO of the merged company. He suffered a stroke after the merger closed, but was still able to assume his new post upon recovery. After the merger, Regions adopted Union Planters' former logo of a young cotton plant and used it until the AmSouth conversion. The merger significantly increased Regions' footprint in Tennessee; Union Planters had been the largest Tennessee-based bank.\nIn 2006, Regions acquired AmSouth Bancorporation, another Birmingham-based bank, in a $10 billion transaction. While Regions was the surviving company, the merged entity adopted AmSouth's corporate structure.\nIn 2008, Regions Bank received a $3.5 billion loan as part of the Troubled Asset Relief Program. On April 4, 2012, Regions repaid the $3.5 billion loan.\nOn August 29, 2008, as a result of the 2008 financial crisis, Integrity Bank of Alpharetta, Georgia was placed into receivership by the Federal Deposit Insurance Corporation and Regions Bank assumed its operations.\nIn February 2009, FirstBank Financial Services of McDonough, Georgia, was also placed into receivership by the FDIC and Regions Bank assumed its operations.\nIn July 2018, the company sold its insurance operations to BB&T.\nIn June 2021 Regions announced they would acquire home improvement lender EnerBank USA for $960 million.  EnerBank USA was previously a subsidiary of CMS Energy.\n\nCriticism\nCustomer fraud\nIn 2011, Regions paid $200 million to settle with the U.S. Securities and Exchange Commission over mispricing risky mortgage-backed bonds in its conservative mutual funds in its Morgan Keegan subsidiary.\n\nOverdraft fees\nIn April 2015, Regions was fined $7.5 million by the Consumer Financial Protection Bureau (CFPB) for charging consumers with inappropriate or illegal overdraft fees. Regions did not obtain affirmative opt-ins from charging overdraft fees on ATM and point of sale transactions. The CFPB also found that Regions misrepresented overdraft and non-sufficient fund fees related to the bank's short-term loan program.\nOn September 28, 2022, the CFPB again ordered Regions Bank to pay $50 million into the CFPB’s victims relief fund and to refund at least $141 million to customers harmed by its illegal surprise overdraft fees, labeling the bank a \"repeat offender.\" From August 2018 through July 2021, Regions charged customers surprise overdraft fees on certain ATM withdrawals and debit card purchases. The bank charged overdraft fees even after telling consumers they had sufficient funds at the time of the transactions. The CFPB also found that Regions leadership knew about and could have discontinued its surprise overdraft fee practices years earlier, but they chose to wait while Regions pursued changes that would generate new fee revenue to make up for ending the illegal fees.\n\nAccount security\nRegions uses text messages for multi-factor authentication which is insecure instead of offering a time-based one-time password using an authenticator application.\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Regions Financial Corporation:",
  "clean_text": "Regions Financial Corporation is an American bank holding company headquartered in the Regions Center in Birmingham, Alabama. The company provides retail and commercial banking, trust, stock brokerage, and mortgage services. Its banking subsidiary, Regions Bank, operates about 2,000 automated teller machines and 1,300 branches in 15 states in the Southern and Midwestern United States. Regions is ranked 428th on the Fortune 500 and is component headquartered in Alabama. Regions is also on the list of largest banks in the United States. Regions is the largest deposit holder in Alabama and Tennessee. It is also one of the largest deposit holders in Arkansas, Louisiana, Mississippi, and Florida. The company sponsors Regions Field, a Minor League Baseball stadium in Birmingham, Alabama, and the Tradition golf tournament. It sponsored the Regions Charity Classic, a golf tournament held in 2009 and 2010. The company has a partnership with Operation HOPE, Inc. to provide free financial education to underserved communities. In 2019, the company expanded its Workday, Inc. system in partnership with EnterpriseAlumni to engage and enable ex-employees to extend their corporate social responsibility initiatives. History Regions Financial Corporation, formerly known as First Alabama Bankshares, was founded on July 13, 1971 with the merger of three Alabama banks: First National Bank of Montgomery, Alabama (opened 1871), Exchange Security Bank of Birmingham, Alabama (opened 1928), and First National Bank of Huntsville, Alabama (opened 1856). The headquarters of First National Bank of Huntsville was a historic building built in 1835. It served as a hospital for Union soldiers during the American Civil War, and once held a rifle owned by Frank James as collateral for bail money when he was incarcerated across the street in the Madison County Jail. Until their formal merger in March 1985, under revised banking regulations, the banks continued to operate independently. In 1986, changes in the Interstate Banking Bill allowed bank holding companies to purchase bank branches outside the state in which they were chartered. First Alabama Bankshares expanded its operations first into Florida, continuing into Georgia, Tennessee, and Arkansas. In 1994, to reflect its growth into a regional company, First Alabama Bankshares changed its name to Regions Financial Corporation and the name of its banking subsidiary to Regions Bank. Regions added banking branches in Alabama, Georgia, Tennessee, Florida, South Carolina, Texas, Louisiana, and Arkansas. The name \"Regions\" was purchased from First Commercial Corporation, the Arkansas Bank that Regions subsequently purchased in 1998. In 2001, Regions acquired Rebsamen Insurance Company, which was renamed Regions Insurance Group. In 2001, Regions acquired Morgan Keegan & Company for $789 million. In January 2012, Regions sold Morgan Keegan to Raymond James for $930 million. The trust department was retained by Regions and now operates as Regions Trust. In 2002, the company announced that it will list its common stock on the New York Stock Exchange. In 2002, Regions acquired Independence Bank for approximately $24 million in cash. On January 24, 2004, Regions merged with Memphis, Tennessee–based Union Planters Bank in a $5.9 billion transaction. Jackson W. Moore, the former CEO of Union Planters, became CEO of the merged company. He suffered a stroke after the merger closed, but was still able to assume his new post upon recovery. After the merger, Regions adopted Union Planters' former logo of a young cotton plant and used it until the AmSouth conversion. The merger significantly increased Regions' footprint in Tennessee; Union Planters had been the largest Tennessee-based bank. In 2006, Regions acquired AmSouth Bancorporation, another Birmingham-based bank, in a $10 billion transaction. While Regions was the surviving company, the merged entity adopted AmSouth's corporate structure. In 2008, Regions Bank received a $3.5 billion loan as part of the Troubled Asset Relief Program. On April 4, 2012, Regions repaid the $3.5 billion loan. On August 29, 2008, as a result of the 2008 financial crisis, Integrity Bank of Alpharetta, Georgia was placed into receivership by the Federal Deposit Insurance Corporation and Regions Bank assumed its operations. In February 2009, FirstBank Financial Services of McDonough, Georgia, was also placed into receivership by the FDIC and Regions Bank assumed its operations. In July 2018, the company sold its insurance operations to BB&T. In June 2021 Regions announced they would acquire home improvement lender EnerBank USA for $960 million. EnerBank USA was previously a subsidiary of CMS Energy. Criticism Customer fraud In 2011, Regions paid $200 million to settle with the U.S. Securities and Exchange Commission over mispricing risky mortgage-backed bonds in its conservative mutual funds in its Morgan Keegan subsidiary. Overdraft fees In April 2015, Regions was fined $7.5 million by the Consumer Financial Protection Bureau (CFPB) for charging consumers with inappropriate or illegal overdraft fees. Regions did not obtain affirmative opt-ins from charging overdraft fees on ATM and point of sale transactions. The CFPB also found that Regions misrepresented overdraft and non-sufficient fund fees related to the bank's short-term loan program. On September 28, 2022, the CFPB again ordered Regions Bank to pay $50 million into the CFPB’s victims relief fund and to refund at least $141 million to customers harmed by its illegal surprise overdraft fees, labeling the bank a \"repeat offender.\" From August 2018 through July 2021, Regions charged customers surprise overdraft fees on certain ATM withdrawals and debit card purchases. The bank charged overdraft fees even after telling consumers they had sufficient funds at the time of the transactions. The CFPB also found that Regions leadership knew about and could have discontinued its surprise overdraft fee practices years earlier, but they chose to wait while Regions pursued changes that would generate new fee revenue to make up for ending the illegal fees. Account security Regions uses text messages for multi-factor authentication which is insecure instead of offering a time-based one-time password using an authenticator application."
}