{
  "ticker": "RJF",
  "cik": "0000720005",
  "company_name": "Raymond James Financial",
  "corrected_name": "Raymond James Financial",
  "wiki_title_used": "Raymond James Financial",
  "exists": true,
  "raw_text": "Raymond James Financial, Inc. is an American multinational independent investment bank and financial services company providing financial services to individuals, corporations, and municipalities through its subsidiary companies that engage primarily in investment and financial planning, in addition to investment banking and asset management. The company is headquartered in St. Petersburg, Florida.\n\nHistory\nRaymond James was founded in 1962 when St. Petersburg broker, Robert James, formed Robert A. James Investments. In 1964, it merged with Raymond & Associates, founded by Edward Raymond in 1963, to form Raymond James & Associates. Robert James' son, Tom James, joined  in 1966 and assumed leadership of the firm in 1970. The firm  planned to go public in 1969, but market conditions delayed its plan until 1983. Tom turned over the CEO's post to Paul Reilly in 2010, and  his title as Chairman of the Board to Paul Reilly in 2016. He  remains on the leadership team as Chairman Emeritus.\nIn 2012, the firm purchased the Canadian assets of Allied Irish Bank. In April 2012, they merged with Morgan Keegan & Company, creating one of the country's largest full-service wealth management and investment banking firms not headquartered in New York.\nAs of the fiscal quarter ending September 30, 2022, the firm had delivered 139 consecutive quarters of profitability.  In June 2016, it was listed as a Fortune 500 company for the first time.\nIn September 2016, the firm announced its acquisition of Deutsche Bank Wealth Management's US private client services unit, Alex Brown & Sons.\nIn April 2017, the firm purchased Reams Asset Management from UMB Financial Corporation. The purchase, which amounted to $172.5 million, included Scouts Investments.\nAs of September 30, 2022, Raymond James has approximately 8,700 financial advisors throughout the United States, Canada and overseas. Total client assets under management are approximately $1.09 trillion.\n\nCurrent operations\nRaymond James has four main lines of operation: private client group, capital markets (made up of equity and fixed income capital markets as well as public finance), asset management group (made up of asset management services and Carillon tower advisers) and banking.\n\nControversies\nSEC v. Dennis Herula\nIn 2004, the SEC fined Raymond James Financial Services, Inc. $6.9 million for failure to supervise former broker Dennis Herula. Herula was accused of participating with others in a Ponzi scheme that raised about $44.5 million from investors in 1999-2000. Herula himself raised about $16.5 million of investor funds, most of which was later transferred to his wife's brokerage account at Raymond James. He was arrested in Bermuda and pleaded guilty to criminal charges of wire fraud and sentenced to 188 months in prison.\n\nSupervision of branch managers\nIn 2005, the National Association of Securities Dealers fined Raymond James $2.75 million for lax supervision of producing branch managers. The investigation began with one Raymond James manager, who worked from an office in her Wisconsin home, handling approximately 700 accounts and selling mainly mutual funds and variable annuities. The Wisconsin manager was accused of selling unsuitable aggressive mutual funds and variable annuities over a four-year period.\n\nAuction rate securities\nOn June 29, 2011, Raymond James announced an agreement to repurchase at par auction rate securities (ARS) sold to clients through its domestic broker/dealer subsidiaries prior to February 13, 2008. The agreement—reached with the Securities and Exchange Commission and with state securities regulators led by Florida and Texas—resolved more than three years of investigation related to activity in the ARS market. Without admitting or denying the allegations, the firm also agreed to pay a fine totaling $1.75 million to the state regulators, but was not fined by the SEC. Raymond James sold $2.3 billion worth of ARS, underwrote $1.2 billion, and was the auction dealer for over $725 million. Since the $330 billion market for ARS crashed in 2008, at least 19 underwriters and broker-dealers were sued in class action suits.\n\nNotable FINRA Fines\nIn September 2011, the Financial Industry Regulatory Authority ordered Raymond James & Associates, Inc. and Raymond James Financial Services, Inc. to pay restitution of $1.69 million to 15,500 of their clients for charging excessive commissions on more than 27,000 securities transactions. The trades were made in client accounts between 2006 and 2010.\nFINRA also fined RJA $225,000 and RJFS $200,000.\nOn May 18, 2016 Raymond James was fined a total of $17M for failing to establish and implement adequate AML procedures, which resulted in the firms’ failure to properly prevent or detect, investigate, and report suspicious activity for several years. RJA's former AML Compliance Officer, Linda L. Busby, was also fined $25,000 and suspended for three months.  On December 21, 2017  Raymond James was fined $2 million for failing to reasonably supervise email communications.\n\nSee also\nRaymond James Stadium, a multi-purpose stadium mostly hosting sports in Tampa, Florida, is named after the company through a licensing deal.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Raymond James Financial, Inc.:",
  "clean_text": "Raymond James Financial, Inc. is an American multinational independent investment bank and financial services company providing financial services to individuals, corporations, and municipalities through its subsidiary companies that engage primarily in investment and financial planning, in addition to investment banking and asset management. The company is headquartered in St. Petersburg, Florida. History Raymond James was founded in 1962 when St. Petersburg broker, Robert James, formed Robert A. James Investments. In 1964, it merged with Raymond & Associates, founded by Edward Raymond in 1963, to form Raymond James & Associates. Robert James' son, Tom James, joined in 1966 and assumed leadership of the firm in 1970. The firm planned to go public in 1969, but market conditions delayed its plan until 1983. Tom turned over the CEO's post to Paul Reilly in 2010, and his title as Chairman of the Board to Paul Reilly in 2016. He remains on the leadership team as Chairman Emeritus. In 2012, the firm purchased the Canadian assets of Allied Irish Bank. In April 2012, they merged with Morgan Keegan & Company, creating one of the country's largest full-service wealth management and investment banking firms not headquartered in New York. As of the fiscal quarter ending September 30, 2022, the firm had delivered 139 consecutive quarters of profitability. In June 2016, it was listed as a Fortune 500 company for the first time. In September 2016, the firm announced its acquisition of Deutsche Bank Wealth Management's US private client services unit, Alex Brown & Sons. In April 2017, the firm purchased Reams Asset Management from UMB Financial Corporation. The purchase, which amounted to $172.5 million, included Scouts Investments. As of September 30, 2022, Raymond James has approximately 8,700 financial advisors throughout the United States, Canada and overseas. Total client assets under management are approximately $1.09 trillion. Current operations Raymond James has four main lines of operation: private client group, capital markets (made up of equity and fixed income capital markets as well as public finance), asset management group (made up of asset management services and Carillon tower advisers) and banking. Controversies SEC v. Dennis Herula In 2004, the SEC fined Raymond James Financial Services, Inc. $6.9 million for failure to supervise former broker Dennis Herula. Herula was accused of participating with others in a Ponzi scheme that raised about $44.5 million from investors in 1999-2000. Herula himself raised about $16.5 million of investor funds, most of which was later transferred to his wife's brokerage account at Raymond James. He was arrested in Bermuda and pleaded guilty to criminal charges of wire fraud and sentenced to 188 months in prison. Supervision of branch managers In 2005, the National Association of Securities Dealers fined Raymond James $2.75 million for lax supervision of producing branch managers. The investigation began with one Raymond James manager, who worked from an office in her Wisconsin home, handling approximately 700 accounts and selling mainly mutual funds and variable annuities. The Wisconsin manager was accused of selling unsuitable aggressive mutual funds and variable annuities over a four-year period. Auction rate securities On June 29, 2011, Raymond James announced an agreement to repurchase at par auction rate securities (ARS) sold to clients through its domestic broker/dealer subsidiaries prior to February 13, 2008. The agreement—reached with the Securities and Exchange Commission and with state securities regulators led by Florida and Texas—resolved more than three years of investigation related to activity in the ARS market. Without admitting or denying the allegations, the firm also agreed to pay a fine totaling $1.75 million to the state regulators, but was not fined by the SEC. Raymond James sold $2.3 billion worth of ARS, underwrote $1.2 billion, and was the auction dealer for over $725 million. Since the $330 billion market for ARS crashed in 2008, at least 19 underwriters and broker-dealers were sued in class action suits. Notable FINRA Fines In September 2011, the Financial Industry Regulatory Authority ordered Raymond James & Associates, Inc. and Raymond James Financial Services, Inc. to pay restitution of $1.69 million to 15,500 of their clients for charging excessive commissions on more than 27,000 securities transactions. The trades were made in client accounts between 2006 and 2010. FINRA also fined RJA $225,000 and RJFS $200,000. On May 18, 2016 Raymond James was fined a total of $17M for failing to establish and implement adequate AML procedures, which resulted in the firms’ failure to properly prevent or detect, investigate, and report suspicious activity for several years. RJA's former AML Compliance Officer, Linda L. Busby, was also fined $25,000 and suspended for three months. On December 21, 2017 Raymond James was fined $2 million for failing to reasonably supervise email communications."
}