{
  "ticker": "RL",
  "cik": "0001037038",
  "company_name": "Ralph Lauren Corporation",
  "corrected_name": "Ralph Lauren Corporation",
  "wiki_title_used": "Ralph Lauren Corporation",
  "exists": true,
  "raw_text": "Ralph Lauren Corporation is a publicly traded American fashion and lifestyle brand founded in 1967 by Ralph Lauren in New York City. The company markets products in apparel, home, accessories, and fragrances, and is most known for its flagship brand, Polo Ralph Lauren. The company's brands include mid-range, sub-premium, and premium labels up to its highest priced luxury Ralph Lauren Purple Label apparel.\nRalph Lauren licenses its name and branding to Luxottica for eyewear; L'Oréal for fragrances and cosmetics; Hanesbrands for underwear and sleepwear; O5 Apparel for its Chaps brand; Kohl's and Hollander Sleep Products for bedding; Designers Guild for fabric and wallpaper; and Theodore Alexander for home furniture.\n\nHistory\nLauren started The Ralph Lauren Corporation in 1967 with men's neckties. At 28 years old, he worked for the tie manufacturer Beau Brummell. Lauren persuaded the company's president to let him start his own line.  Drawing on his interests in sports, Lauren named his first full line of menswear \"Polo\" in 1968. He worked out of a single \"drawer\" from a showroom in the Empire State Building, and made deliveries to stores himself.\nBy 1969, the Manhattan department store Bloomingdale's sold Lauren's men line exclusively. It was the first time that Bloomingdale's had given a designer his own in-store shop. In 1971, Ralph Lauren Corporation launched a line of tailored shirts for women, introducing the Polo player emblem on the shirt cuff. The first full women's collection was launched the following year.\nThe year 1972 marked the opening of Ralph Lauren's store on Rodeo Drive in Beverly Hills, California, his first freestanding store. In 1972, Lauren released a short-sleeve cotton shirt in 24 colors. This design, emblazoned with the company's famed logo based on polo player Bennie Gutierrez, became the brand's signature look. In 1977 Ralph Lauren Corporation introduced a signature cotton mesh polo shirt in various colours, featuring the polo player logo on the chest.\nIn 1974, Ralph Lauren outfitted the male cast of The Great Gatsby in costumes chosen from his Polo line – a 1920s-style series of men's suits and sweaters, except for the pink suit which Lauren designed especially for Robert Redford's Jay Gatsby. In 1977, Diane Keaton and Woody Allen wore Lauren's clothes in the Oscar-winning film, Annie Hall.\nIn 1978, the first Ralph Lauren fragrances, produced by Warner-Lauren, Ltd were launched at Bloomingdale's. Lauren for women, and Polo the men's cologne. This was the first time that a designer introduced two fragrances – one for men and one for women – simultaneously.\nThe company went international in 1981 with the opening of a store in New Bond Street in the West End of London, England.  Lauren opened his first flagship in the Rhinelander mansion on Madison Avenue and 72nd Street in New York City in 1986. On June 12, 1997, the company became a publicly traded company on the New York Stock Exchange.\nThe 98-seat restaurant, RL, opened in March 1999 in Chicago adjacent to its largest and world flagship Ralph Lauren store at the corner of Chicago Avenue  on the Magnificent Mile. It was followed by the opening of two additional restaurants – Ralph's at 173 Boulevard Saint-Germain Paris store in 2010 and The Polo Bar at Polo's store in New York in 2015. The company  owned Club Monaco from 1999 to 2021.\nThe company launched its website and online shop in 2000 as polo.com by RL Media (a cooperation between Ralph Lauren and NBC). In 2007, Ralph Lauren Corporation acquired the NBC share of RL Media and the website was relaunched as ralphlauren.com. In September 2015, it was announced that Stefan Larsson would replace the company's founder, Ralph Lauren, as CEO in November. Lauren stayed on as executive chairman and chief creative officer. In February 2017, it was announced that Larsson had agreed to leave his position as CEO effective May 1, 2017 due to differences with Lauren. On May 17, 2017, Ralph Lauren named Patrice Louvet President and chief executive officer. Louvet most recently was group president, Global Beauty at Procter & Gamble (P&G). He took over on July 17, 2017.\nIn October 2020, Ralph Lauren Corporation announced that it would transition its Chaps brand to a fully licensed business model to focus on its core brands, reduce its direct exposure to the North American department store channel, and setting up the Chaps brand to be nurtured with an experienced partner. Also in October, Ralph Lauren Corporation has appointed former Obama administration consultant Valerie Jarrett to the board of directors.\nIn May 2021, Ralph Lauren Corporation announced it would sell its Club Monaco brand after first purchasing it in 1999, to private equity firm Regent LP.\nIn December 2023, Ralph Lauren announced a partnership with Haworth Lifestyle Design to expand its Home brand starting April 2024. Haworth Lifestyle Design will also launch standalone Ralph Lauren Home stores.\nIn December 2023, Ralph Lauren launched an artist in residence program for artisans to work with their design teams in a creative partnership. The first artist collaboration is with the indigenous artist Naomi Glasses, a Navajo 7th-generation weaver.\nIn 2025, Ralph Lauren Corporation marked the 25th anniversary of its listing on the New York Stock Exchange by hosting an Investor Day event, which included presentations from corporate leadership and product showcases for attendees.\n\nBrands\nChaps: A mid-range brand featuring men's and women's casual sportswear. The Chaps brand is available primarily at Belk, Boscov's, Hudson's Bay and Meijer stores (and until the end of 2021, Kohl's stores). This brand mainly competes with the Izod and U.S. Polo Assn brands. The brand can also frequently be found at several off-price stores such as Ross, T.J. Maxx, Macy's Backstage, and Nordstrom Rack. A lower-cost Chaps line is also sold at Walmart; this line is separate from the one sold at department stores. The brand is currently licensed to O5 Apparel.\nDouble RL: Founded in 1993 and named after Ralph Lauren and his wife Ricky's \"RRL\" ranch in Colorado, RRL offers men a mix of selvage denim, vintage apparel, sportswear and accessories, with roots in workwear and military gear.\nFragrance: In 1978, Ralph Lauren launched his first fragrances: Lauren for women and Polo for men. Originally produced by Warner-Lauren, Ltd, L'Oréal now produces the Ralph Lauren Fragrances for men and women, including World of Polo (Polo, Polo Blue, Polo Black, Polo Red), Ralph Lauren Romance, Midnight Romance, Polo Earth, and the Big Pony Collections For Women and For Men.\nLauren Ralph Lauren: Lauren for Women launched in 1996, offering sportswear, denim, dresses, activewear, and accessories and footwear at a cheaper price point. Lauren for Men offers men's tailored clothing, including suits, sport coats, dress shirts, dress pants, tuxedos, topcoats, and ties at a cheaper price point. This brand generally slots above Chaps in price, but below Polo Ralph Lauren.\nPink Pony: Established in 2000, a percentage of sales from all Pink Pony products benefit the Pink Pony Fund and other major cancer charities around the world. Pink Pony primarily consists of  women's sportswear and accessories. All Pink Pony items feature a pink Polo Player.\nPolo Golf and RLX Golf: Polo Golf launched in 1990 and RLX Golf launched in 1998.\n\nPolo Ralph Lauren: Men's Polo, Ralph Lauren's first complete line of sportswear and tailored clothing, was launched in 1967. In 2014, Women's Polo was launched. While originally focused on clothing centered around the sport of polo, the brand evolved into Ralph Lauren's top-selling and highest-produced complete line of clothing, which is readily available worldwide. The line also helped popularize the polo shirt in American and global fashion.\nPolo Ralph Lauren Children: Items include polo knit shirts and cashmere cable sweaters.\nPolo Sport: Polo Sport launched in 1992, a line of activewear for sports and fitness. In 2014, Ralph Lauren debuted the PoloTech Shirt, which featured smart fabric technology that supposedly \"captures robust biometrics from the wearer\".\nRalph by Ralph Lauren: Launched in 1994, Ralph by Ralph Lauren offers suit separates, sport coats, vests, and topcoats.\nRalph Lauren Home and Paint: Ralph Lauren Home, the first complete home collection from an American clothing designer, makes its debut in 1983 with home furnishings and accessories. Ralph Lauren Home includes furniture, bed and bath linens, china, crystal, silver, decorative accessories and gifts, as well as lighting, fabric, wall covering, and floor covering. Ralph Lauren launched Paint in 1995, now with over 400 palettes.\nRalph Lauren Purple Label: Flagship brand launched in 1994. Purple Label for men offers suiting, custom tailored made-to-measure suits and sportswear, as well as benchmade footwear and made-to-order dress furnishings, accessories, and luggage. The line is focused on using fine textiles and manufacturing methods to represent the highest level of the Ralph Lauren offerings.\nRalph Lauren Restaurants: RL Restaurant Chicago opened in 1999, adjacent to its largest Ralph Lauren flagship store in the world on Michigan Avenue along the Magnificent Mile. In 2010, Ralph's was opened in the courtyard and converted stables at 173 Boulevard Saint-Germain Paris flagship store. In August 2014, Ralph's Coffee opened on the second floor of the Polo Flagship store in New York City. The Polo Bar, adjacent to the New York City Polo Flagship store, opened in January 2015.\nRalph Lauren Watches and Fine Jewelry: In 2009 Ralph Lauren, together with luxury group Compagnie Financière Richemont SA, launched a collection of timepieces through the Ralph Lauren Watch & Jewelry Co. In 2010, the Ralph Lauren Watch & Jewelry Co. also introduced collections of jewelry.\nRalph Lauren Women's Collection: Ralph Lauren Collection for women, launched in 1971, ranges from handmade evening gowns to sportswear.\n\nDefunct brands\nAmerican Living: Ralph Lauren launched American Living for men and women in 2008, a mid-range lifestyle brand created exclusively for JCPenney. This line was comparable to the Chaps line, but was marketed as a more exclusive line, unlike Chaps which is sold at multiple retailers. This line was discontinued in 2012 due to poor sales.  A second American Living line was sold at Macy's; this American Living line only included women's clothing and was discontinued in 2019.\nDenim & Supply Ralph Lauren: The Denim & Supply Ralph Lauren line launched in 2011, inspired by the warehouse and artist communities of Brooklyn, New York, and authentic style found in the music festival scene. Denim & Supply was discontinued in September 2016.\n\nPolo Country: An Americana and country store themed brand launched in 1988. Spiritual predecessor to Double RL.\nPolo Jeans: Denim brand that was mass-produced and sold in many department stores. Ralph Lauren discontinued the line in 2006, citing brand dilution concerns of the line being \"over-produced and over-distributed\". The discontinuation was also motivated by litigation against Jones Apparel Group, Inc. over the licensing of the brand.\nPolo University Club: Entry-level tailoring brand produced during the 1980s. The line offered dress clothes and fine fabrics at a lower price point.\nPolo Western Wear: Western wear brand launched in 1979. The line consisted of western and cowboy apparel such as denim, cattleman jackets, boots, rodeo shirts, fringe jackets and felted hats. Manufactured in partnership with the Gap.\nRalph Lauren Black Label: Mid-level tailoring brand launched in 2005. The line centered around slim cuts and modern fabrics, with sleek and minimal aesthetics. Offered suiting and dress shirts at price point in between Ralph Lauren Purple Label and Polo Ralph Lauren. It was exclusively sold in flagship Ralph Lauren stores, selected high-end department stores, and via the online store.\nRugby Ralph Lauren: Preppy and youth-centered line launched in 2004, and discontinued in 2013.  Centered around brightly colored rugby shirts, its details included a skull-and-crossbones logo, yellow and navy packaging, or \"R.L.F.C\" branding.\n\nStores\nThe Company lists on their website that there are 483 directly operated Ralph Lauren stores. This includes both RLS and PFS stores.\nInternational licensing partners operate 93 Ralph Lauren stores and 42 dedicated shops.\nRalph Lauren operates its representative flagship stores in New York City on Madison Avenue – for menswear in the former Rhinelander Mansion, and for womenswear and home in a structure across the street opened in 2010. The company also manages flagship stores for retailing Ralph Lauren collections in Beverly Hills, Beijing, Chengdu, Chicago, Hong Kong, Miami, Palm Beach, London, Milan, Tokyo, Shanghai, and Paris.\n\nSports sponsorships\nUSTA\nIn 2005, The United States Tennis Association selected Ralph Lauren Corporation as the official apparel sponsor for the U.S. Open. As part of the partnership, all on-court ball persons and officials were dressed in specially designed Ralph Lauren apparel. This was Polo's first tennis sponsorship.\n\nWimbledon\nIn 2006, Ralph Lauren Corporation became the official outfitter of Wimbledon. Lauren is the first designer in the tennis tournament's history to be chosen to create uniforms for all on-court officials.\n\nAustralian Open\nIn 2020, Ralph Lauren Corporation became the official outfitter of the Australian Open.\n\nU.S. Olympic Team\nRalph Lauren Corporation is the exclusive Official Parade Outfitter for the U.S. Olympic and Paralympic Teams, with the right to manufacture, distribute, advertise, promote, and sell products in the U.S. and in other countries which replicate the Parade Outfits and associated leisure wear. The company has established a partnership with athletes as brand ambassadors and the faces of advertising, marketing, and public relations campaigns.\nRalph Lauren Corporation partnered with the United States Olympic Committee to become an Official Outfitter of the U.S. Olympic Team, for the 2008 Summer Olympics in Beijing, 2010 Winter Olympics in Vancouver, 2012 Summer Olympics in London, 2014 Winter Olympics in Sochi and 2016 Summer Olympics in Rio.\nRalph Lauren designs the official Opening Ceremony and Closing Ceremony parade outfits for the U.S. teams in addition to an assortment of village-wear apparel and accessories.\nPreviously, the corporation received negative press when it was found to have sourced the clothing it supplied to the 2012 athletes from China, so it vowed to source everything it produced for the 2014 Olympics from the US. Kraemer Textiles Inc. spun around 6,000 pounds of Merino wool yarn from Imperial Stock Ranch in Oregon, which was then sent to Longview Yarns in North Carolina to be dyed. The clothing assembly was completed by Ball of Cotton in California. Ultimately, 40 American vendors were involved with production.\n\nLeadership\nExecutive chairman and chief creative officer: Ralph Lauren (since 1967)\nPresident and chief executive officer: Patrice Louvet (since 2017)\n\nFormer chief executives\nRalph Lauren (1967–2015)\nStefan Larsson (2015–2017)\n\nControversies\nRacial discrimination tribunal in the UK\nIn 2023, a former Ralph Lauren employee at the Sloane Square store in London won an employment tribunal case against the company for racial discrimination. The tribunal found that the store manager made racially insensitive remarks referring to the employee's mixed heritage, including calling her \"the United Nations\" and \"the United Colors of Benetton.\" The tribunal ruled the remarks were offensive and awarded the employee compensation.\n\nCriticism of sustainability and labor practices\nRalph Lauren has received low scores from watchdogs monitoring environmental sustainability and labor ethics. The brand was rated \"Not Good Enough\" by the platform Good On You, citing lack of evidence of fair wages, sustainable materials, or labor certifications. In the 2023 Fashion Transparency Index, the company scored 51–60%, reflecting moderate but limited disclosure in key areas such as supply chain traceability and environmental impact.\n\n\"Horse Shirt\" lawsuit\nPolo Ralph Lauren, Ltd. sued Mad Dog Productions in late 1983  for its production and sale of the \"Horse Shirt\" – a take-off on the Polo shirt which \"show[ed] the rider being dragged behind the horse.\" The lawsuit was settled out of court in 1984 with Mad Dog Productions agreeing to stop selling the parody shirt by the end of the year. Ultimately, Mad Dog Productions sold 20,000 Horse Shirts at $14.45 each, for a total of $289,000 in gross revenue.\n\nLevi Strauss lawsuit\nLevi Strauss & Co. filed a lawsuit against Abercrombie & Fitch and the RL Corporation in July 2007 for trademark infringement. It alleged that the separate retailers used Levi's trademarked pocket design of connected arches in the design of some of their respective products.\n\nSouth African Polo trademark issues\nThe Polo brand sold in South Africa is not affiliated with the Ralph Lauren brand. An independent South African company trademarked the Polo name and logo in South Africa.\n\nFilippa Hamilton photo controversy\nIn 2009, Ralph Lauren apologized for digitally retouching a photograph of model Filippa Hamilton to make her look thinner. Hamilton also claims that she was fired by the company a few days later.\n\nAccusations of intellectual property violation by Cowichan Tribes\nAfter branding the sale of sweaters online as \"Cowichan\", it was reported that Cowichan Tribes would take \"steps to communicate with Ralph Lauren and ensure that our product and name is protected\". Ralph Lauren later dropped the name from its products.\n\nHoward Smith\nIn March 2022, Howard Smith, Ralph Lauren Corp.'s chief commercial officer, resigned after a board investigation found that his actions had breached the company's code of conduct. The apparel said it \"learned of concerns about Mr. Smith's personal behavior recently\", and the board of directors' audit committee initiated an independent investigation with the help of outside counsel. The firm didn't go into detail about the claims but said the inquiry found that Smith's actions broke the company's code of conduct and ethics and that his resignation was required.\n\nForced labor investigation\nIn August 2023, the Canadian Ombudsperson for Responsible Enterprise announced that it was investigating the company due to allegations of forced labor of Uyghurs.\nResearch of the social democratic party in the European Parliament, the Sheffield Hallam University and further groups in 2023 showed Ralph Lauren using Uyghur forced labour camps provided by the Sunrise Manufacture Group Co. for production.\n\nSee also\nTom Ford\nPerry Ellis\nGeoffrey Beene\nBill Blass\nBilly Reid\nJoseph Abboud\nJ. Press\nPaul Stuart\n\nReferences\nExternal links\n\nRalph Lauren – consumer website\nRalph Lauren – corporate website\nBusiness data for Ralph Lauren Corporation: \n\nRalph Lauren has implemented several initiatives to improve environmental sustainability and ethical practices across its operations. The company has increased the use of recycled and responsibly sourced materials in its clothing, such as cotton and cashmere. In 2023, it announced progress toward reducing greenhouse gas emissions and improving energy efficiency in its supply chain. Ralph Lauren has also developed a circular design strategy that focuses on making products more durable, recyclable, and easier to repurpose. These efforts are part of the brand’s broader goal to create a more sustainable and responsible fashion industry.<https://corporate.ralphlauren.com/sustainability>\nsocial responsibility:\nThe company also supports community programs focused on education, cancer research, and equality. Through the Pink Pony Fund, Ralph Lauren raises awareness and provides funding for cancer care and prevention programs around the world.",
  "clean_text": "Ralph Lauren Corporation is a publicly traded American fashion and lifestyle brand founded in 1967 by Ralph Lauren in New York City. The company markets products in apparel, home, accessories, and fragrances, and is most known for its flagship brand, Polo Ralph Lauren. The company's brands include mid-range, sub-premium, and premium labels up to its highest priced luxury Ralph Lauren Purple Label apparel. Ralph Lauren licenses its name and branding to Luxottica for eyewear; L'Oréal for fragrances and cosmetics; Hanesbrands for underwear and sleepwear; O5 Apparel for its Chaps brand; Kohl's and Hollander Sleep Products for bedding; Designers Guild for fabric and wallpaper; and Theodore Alexander for home furniture. History Lauren started The Ralph Lauren Corporation in 1967 with men's neckties. At 28 years old, he worked for the tie manufacturer Beau Brummell. Lauren persuaded the company's president to let him start his own line. Drawing on his interests in sports, Lauren named his first full line of menswear \"Polo\" in 1968. He worked out of a single \"drawer\" from a showroom in the Empire State Building, and made deliveries to stores himself. By 1969, the Manhattan department store Bloomingdale's sold Lauren's men line exclusively. It was the first time that Bloomingdale's had given a designer his own in-store shop. In 1971, Ralph Lauren Corporation launched a line of tailored shirts for women, introducing the Polo player emblem on the shirt cuff. The first full women's collection was launched the following year. The year 1972 marked the opening of Ralph Lauren's store on Rodeo Drive in Beverly Hills, California, his first freestanding store. In 1972, Lauren released a short-sleeve cotton shirt in 24 colors. This design, emblazoned with the company's famed logo based on polo player Bennie Gutierrez, became the brand's signature look. In 1977 Ralph Lauren Corporation introduced a signature cotton mesh polo shirt in various colours, featuring the polo player logo on the chest. In 1974, Ralph Lauren outfitted the male cast of The Great Gatsby in costumes chosen from his Polo line – a 1920s-style series of men's suits and sweaters, except for the pink suit which Lauren designed especially for Robert Redford's Jay Gatsby. In 1977, Diane Keaton and Woody Allen wore Lauren's clothes in the Oscar-winning film, Annie Hall. In 1978, the first Ralph Lauren fragrances, produced by Warner-Lauren, Ltd were launched at Bloomingdale's. Lauren for women, and Polo the men's cologne. This was the first time that a designer introduced two fragrances – one for men and one for women – simultaneously. The company went international in 1981 with the opening of a store in New Bond Street in the West End of London, England. Lauren opened his first flagship in the Rhinelander mansion on Madison Avenue and 72nd Street in New York City in 1986. On June 12, 1997, the company became a publicly traded company on the New York Stock Exchange. The 98-seat restaurant, RL, opened in March 1999 in Chicago adjacent to its largest and world flagship Ralph Lauren store at the corner of Chicago Avenue on the Magnificent Mile. It was followed by the opening of two additional restaurants – Ralph's at 173 Boulevard Saint-Germain Paris store in 2010 and The Polo Bar at Polo's store in New York in 2015. The company owned Club Monaco from 1999 to 2021. The company launched its website and online shop in 2000 as polo.com by RL Media (a cooperation between Ralph Lauren and NBC). In 2007, Ralph Lauren Corporation acquired the NBC share of RL Media and the website was relaunched as ralphlauren.com. In September 2015, it was announced that Stefan Larsson would replace the company's founder, Ralph Lauren, as CEO in November. Lauren stayed on as executive chairman and chief creative officer. In February 2017, it was announced that Larsson had agreed to leave his position as CEO effective May 1, 2017 due to differences with Lauren. On May 17, 2017, Ralph Lauren named Patrice Louvet President and chief executive officer. Louvet most recently was group president, Global Beauty at Procter & Gamble (P&G). He took over on July 17, 2017. In October 2020, Ralph Lauren Corporation announced that it would transition its Chaps brand to a fully licensed business model to focus on its core brands, reduce its direct exposure to the North American department store channel, and setting up the Chaps brand to be nurtured with an experienced partner. Also in October, Ralph Lauren Corporation has appointed former Obama administration consultant Valerie Jarrett to the board of directors. In May 2021, Ralph Lauren Corporation announced it would sell its Club Monaco brand after first purchasing it in 1999, to private equity firm Regent LP. In December 2023, Ralph Lauren announced a partnership with Haworth Lifestyle Design to expand its Home brand starting April 2024. Haworth Lifestyle Design will also launch standalone Ralph Lauren Home stores. In December 2023, Ralph Lauren launched an artist in residence program for artisans to work with their design teams in a creative partnership. The first artist collaboration is with the indigenous artist Naomi Glasses, a Navajo 7th-generation weaver. In 2025, Ralph Lauren Corporation marked the 25th anniversary of its listing on the New York Stock Exchange by hosting an Investor Day event, which included presentations from corporate leadership and product showcases for attendees. Brands Chaps: A mid-range brand featuring men's and women's casual sportswear. The Chaps brand is available primarily at Belk, Boscov's, Hudson's Bay and Meijer stores (and until the end of 2021, Kohl's stores). This brand mainly competes with the Izod and U.S. Polo Assn brands. The brand can also frequently be found at several off-price stores such as Ross, T.J. Maxx, Macy's Backstage, and Nordstrom Rack. A lower-cost Chaps line is also sold at Walmart; this line is separate from the one sold at department stores. The brand is currently licensed to O5 Apparel. Double RL: Founded in 1993 and named after Ralph Lauren and his wife Ricky's \"RRL\" ranch in Colorado, RRL offers men a mix of selvage denim, vintage apparel, sportswear and accessories, with roots in workwear and military gear. Fragrance: In 1978, Ralph Lauren launched his first fragrances: Lauren for women and Polo for men. Originally produced by Warner-Lauren, Ltd, L'Oréal now produces the Ralph Lauren Fragrances for men and women, including World of Polo (Polo, Polo Blue, Polo Black, Polo Red), Ralph Lauren Romance, Midnight Romance, Polo Earth, and the Big Pony Collections For Women and For Men. Lauren Ralph Lauren: Lauren for Women launched in 1996, offering sportswear, denim, dresses, activewear, and accessories and footwear at a cheaper price point. Lauren for Men offers men's tailored clothing, including suits, sport coats, dress shirts, dress pants, tuxedos, topcoats, and ties at a cheaper price point. This brand generally slots above Chaps in price, but below Polo Ralph Lauren. Pink Pony: Established in 2000, a percentage of sales from all Pink Pony products benefit the Pink Pony Fund and other major cancer charities around the world. Pink Pony primarily consists of women's sportswear and accessories. All Pink Pony items feature a pink Polo Player. Polo Golf and RLX Golf: Polo Golf launched in 1990 and RLX Golf launched in 1998. Polo Ralph Lauren: Men's Polo, Ralph Lauren's first complete line of sportswear and tailored clothing, was launched in 1967. In 2014, Women's Polo was launched. While originally focused on clothing centered around the sport of polo, the brand evolved into Ralph Lauren's top-selling and highest-produced complete line of clothing, which is readily available worldwide. The line also helped popularize the polo shirt in American and global fashion. Polo Ralph Lauren Children: Items include polo knit shirts and cashmere cable sweaters. Polo Sport: Polo Sport launched in 1992, a line of activewear for sports and fitness. In 2014, Ralph Lauren debuted the PoloTech Shirt, which featured smart fabric technology that supposedly \"captures robust biometrics from the wearer\". Ralph by Ralph Lauren: Launched in 1994, Ralph by Ralph Lauren offers suit separates, sport coats, vests, and topcoats. Ralph Lauren Home and Paint: Ralph Lauren Home, the first complete home collection from an American clothing designer, makes its debut in 1983 with home furnishings and accessories. Ralph Lauren Home includes furniture, bed and bath linens, china, crystal, silver, decorative accessories and gifts, as well as lighting, fabric, wall covering, and floor covering. Ralph Lauren launched Paint in 1995, now with over 400 palettes. Ralph Lauren Purple Label: Flagship brand launched in 1994. Purple Label for men offers suiting, custom tailored made-to-measure suits and sportswear, as well as benchmade footwear and made-to-order dress furnishings, accessories, and luggage. The line is focused on using fine textiles and manufacturing methods to represent the highest level of the Ralph Lauren offerings. Ralph Lauren Restaurants: RL Restaurant Chicago opened in 1999, adjacent to its largest Ralph Lauren flagship store in the world on Michigan Avenue along the Magnificent Mile. In 2010, Ralph's was opened in the courtyard and converted stables at 173 Boulevard Saint-Germain Paris flagship store. In August 2014, Ralph's Coffee opened on the second floor of the Polo Flagship store in New York City. The Polo Bar, adjacent to the New York City Polo Flagship store, opened in January 2015. Ralph Lauren Watches and Fine Jewelry: In 2009 Ralph Lauren, together with luxury group Compagnie Financière Richemont SA, launched a collection of timepieces through the Ralph Lauren Watch & Jewelry Co. In 2010, the Ralph Lauren Watch & Jewelry Co. also introduced collections of jewelry. Ralph Lauren Women's Collection: Ralph Lauren Collection for women, launched in 1971, ranges from handmade evening gowns to sportswear. Defunct brands American Living: Ralph Lauren launched American Living for men and women in 2008, a mid-range lifestyle brand created exclusively for JCPenney. This line was comparable to the Chaps line, but was marketed as a more exclusive line, unlike Chaps which is sold at multiple retailers. This line was discontinued in 2012 due to poor sales. A second American Living line was sold at Macy's; this American Living line only included women's clothing and was discontinued in 2019. Denim & Supply Ralph Lauren: The Denim & Supply Ralph Lauren line launched in 2011, inspired by the warehouse and artist communities of Brooklyn, New York, and authentic style found in the music festival scene. Denim & Supply was discontinued in September 2016. Polo Country: An Americana and country store themed brand launched in 1988. Spiritual predecessor to Double RL. Polo Jeans: Denim brand that was mass-produced and sold in many department stores. Ralph Lauren discontinued the line in 2006, citing brand dilution concerns of the line being \"over-produced and over-distributed\". The discontinuation was also motivated by litigation against Jones Apparel Group, Inc. over the licensing of the brand. Polo University Club: Entry-level tailoring brand produced during the 1980s. The line offered dress clothes and fine fabrics at a lower price point. Polo Western Wear: Western wear brand launched in 1979. The line consisted of western and cowboy apparel such as denim, cattleman jackets, boots, rodeo shirts, fringe jackets and felted hats. Manufactured in partnership with the Gap. Ralph Lauren Black Label: Mid-level tailoring brand launched in 2005. The line centered around slim cuts and modern fabrics, with sleek and minimal aesthetics. Offered suiting and dress shirts at price point in between Ralph Lauren Purple Label and Polo Ralph Lauren. It was exclusively sold in flagship Ralph Lauren stores, selected high-end department stores, and via the online store. Rugby Ralph Lauren: Preppy and youth-centered line launched in 2004, and discontinued in 2013. Centered around brightly colored rugby shirts, its details included a skull-and-crossbones logo, yellow and navy packaging, or \"R.L.F.C\" branding. Stores The Company lists on their website that there are 483 directly operated Ralph Lauren stores. This includes both RLS and PFS stores. International licensing partners operate 93 Ralph Lauren stores and 42 dedicated shops. Ralph Lauren operates its representative flagship stores in New York City on Madison Avenue – for menswear in the former Rhinelander Mansion, and for womenswear and home in a structure across the street opened in 2010. The company also manages flagship stores for retailing Ralph Lauren collections in Beverly Hills, Beijing, Chengdu, Chicago, Hong Kong, Miami, Palm Beach, London, Milan, Tokyo, Shanghai, and Paris. Sports sponsorships USTA In 2005, The United States Tennis Association selected Ralph Lauren Corporation as the official apparel sponsor for the U.S. Open. As part of the partnership, all on-court ball persons and officials were dressed in specially designed Ralph Lauren apparel. This was Polo's first tennis sponsorship. Wimbledon In 2006, Ralph Lauren Corporation became the official outfitter of Wimbledon. Lauren is the first designer in the tennis tournament's history to be chosen to create uniforms for all on-court officials. Australian Open In 2020, Ralph Lauren Corporation became the official outfitter of the Australian Open. U.S. Olympic Team Ralph Lauren Corporation is the exclusive Official Parade Outfitter for the U.S. Olympic and Paralympic Teams, with the right to manufacture, distribute, advertise, promote, and sell products in the U.S. and in other countries which replicate the Parade Outfits and associated leisure wear. The company has established a partnership with athletes as brand ambassadors and the faces of advertising, marketing, and public relations campaigns. Ralph Lauren Corporation partnered with the United States Olympic Committee to become an Official Outfitter of the U.S. Olympic Team, for the 2008 Summer Olympics in Beijing, 2010 Winter Olympics in Vancouver, 2012 Summer Olympics in London, 2014 Winter Olympics in Sochi and 2016 Summer Olympics in Rio. Ralph Lauren designs the official Opening Ceremony and Closing Ceremony parade outfits for the U.S. teams in addition to an assortment of village-wear apparel and accessories. Previously, the corporation received negative press when it was found to have sourced the clothing it supplied to the 2012 athletes from China, so it vowed to source everything it produced for the 2014 Olympics from the US. Kraemer Textiles Inc. spun around 6,000 pounds of Merino wool yarn from Imperial Stock Ranch in Oregon, which was then sent to Longview Yarns in North Carolina to be dyed. The clothing assembly was completed by Ball of Cotton in California. Ultimately, 40 American vendors were involved with production. Leadership Executive chairman and chief creative officer: Ralph Lauren (since 1967) President and chief executive officer: Patrice Louvet (since 2017) Former chief executives Ralph Lauren (1967–2015) Stefan Larsson (2015–2017) Controversies Racial discrimination tribunal in the UK In 2023, a former Ralph Lauren employee at the Sloane Square store in London won an employment tribunal case against the company for racial discrimination. The tribunal found that the store manager made racially insensitive remarks referring to the employee's mixed heritage, including calling her \"the United Nations\" and \"the United Colors of Benetton.\" The tribunal ruled the remarks were offensive and awarded the employee compensation. Criticism of sustainability and labor practices Ralph Lauren has received low scores from watchdogs monitoring environmental sustainability and labor ethics. The brand was rated \"Not Good Enough\" by the platform Good On You, citing lack of evidence of fair wages, sustainable materials, or labor certifications. In the 2023 Fashion Transparency Index, the company scored 51–60%, reflecting moderate but limited disclosure in key areas such as supply chain traceability and environmental impact. \"Horse Shirt\" lawsuit Polo Ralph Lauren, Ltd. sued Mad Dog Productions in late 1983 for its production and sale of the \"Horse Shirt\" – a take-off on the Polo shirt which \"show[ed] the rider being dragged behind the horse.\" The lawsuit was settled out of court in 1984 with Mad Dog Productions agreeing to stop selling the parody shirt by the end of the year. Ultimately, Mad Dog Productions sold 20,000 Horse Shirts at $14.45 each, for a total of $289,000 in gross revenue. Levi Strauss lawsuit Levi Strauss & Co. filed a lawsuit against Abercrombie & Fitch and the RL Corporation in July 2007 for trademark infringement. It alleged that the separate retailers used Levi's trademarked pocket design of connected arches in the design of some of their respective products. South African Polo trademark issues The Polo brand sold in South Africa is not affiliated with the Ralph Lauren brand. An independent South African company trademarked the Polo name and logo in South Africa. Filippa Hamilton photo controversy In 2009, Ralph Lauren apologized for digitally retouching a photograph of model Filippa Hamilton to make her look thinner. Hamilton also claims that she was fired by the company a few days later. Accusations of intellectual property violation by Cowichan Tribes After branding the sale of sweaters online as \"Cowichan\", it was reported that Cowichan Tribes would take \"steps to communicate with Ralph Lauren and ensure that our product and name is protected\". Ralph Lauren later dropped the name from its products. Howard Smith In March 2022, Howard Smith, Ralph Lauren Corp.'s chief commercial officer, resigned after a board investigation found that his actions had breached the company's code of conduct. The apparel said it \"learned of concerns about Mr. Smith's personal behavior recently\", and the board of directors' audit committee initiated an independent investigation with the help of outside counsel. The firm didn't go into detail about the claims but said the inquiry found that Smith's actions broke the company's code of conduct and ethics and that his resignation was required. Forced labor investigation In August 2023, the Canadian Ombudsperson for Responsible Enterprise announced that it was investigating the company due to allegations of forced labor of Uyghurs. Research of the social democratic party in the European Parliament, the Sheffield Hallam University and further groups in 2023 showed Ralph Lauren using Uyghur forced labour camps provided by the Sunrise Manufacture Group Co. for production."
}