{
  "ticker": "ROK",
  "cik": "0001024478",
  "company_name": "Rockwell Automation",
  "corrected_name": "Rockwell Automation",
  "wiki_title_used": "Rockwell Automation",
  "exists": true,
  "raw_text": "Rockwell Automation, Inc. is an American provider of industrial automation and digital transformation technologies headquartered in Milwaukee, Wisconsin. Its brands include Allen-Bradley, FactoryTalk software and LifecycleIQ Services. Rockwell Automation employs approximately 27,000 people and has customers in more than 100 countries worldwide.\n\nHistory\nEarly years\nRockwell Automation began in 1903 as the Compression Rheostat Launch Company. It was founded by Dr. Stanton Allen and Lynde Bradley with an initial investment of $1000. In 1904, 19-year-old Harry Bradley joined his brother in the business, and the company's first patented product, a carbon disc compression-type motor controller for industrial cranes, was demonstrated at the St. Louis World's Fair the same year. In 1909, the company was renamed the Allen-Bradley Company.\nAllen-Bradley expanded rapidly during World War I in response to government-contracted work. Its product line grew to include automatic starters, switches, circuit breakers, relays, and other electric equipment. After the war, the company grew its miniature rheostat business to support the burgeoning radio industry. By the middle of the 1920s, nearly 50 percent of the company's sales were attributed to the radio department. The year 1929 closed with record company sales of $3 million.\nBy 1932, at the start of the Great Depression, the company was posting record losses. It reduced its workforce and cut wages by 50%. Throughout this period, Lynde Bradley supported an aggressive research and development approach intended to \"develop the company out of the Depression.\" By 1937, Allen-Bradley employment had rebounded to pre-Depression levels and company sales reached an all-time high of nearly $4 million.\n\nMid-late 20th century\nWorld War II fueled unprecedented levels of production, with 80% of the company's orders being war-related. Wartime orders were centered on two broad lines of products: industrial controls to speed production, and electrical components or radio parts used in a wide range of military equipment. Allen-Bradley expanded its facilities numerous times during the 1940s to meet wartime production needs. With Fred Loock serving as president and Harry Bradley as chairman, the company began a major $1 million, two-year expansion project in 1947. The company completed additional expansions at its Milwaukee facilities in the 1950s and 1960s, including the Allen-Bradley clock tower.\nDuring the 1970s, the company expanded its production facilities and markets and entered the 1980s as a global company. In 1981, the company introduced a new line of programmable logic controllers.\nIn 1985, Rockwell International purchased Allen-Bradley for $1.651 billion; this was the largest acquisition in Wisconsin's history to date. For all intents and purposes, Allen-Bradley took over Rockwell's industrial automation division.\nThe 1990s featured continued technology development, including the company's launch of its software business. Rockwell International developed PowerFlex, a manufacturing software and technology in the 1990s. Rockwell International also acquired a power systems business, composed of Reliance Electric and Dodge. These two brands, combined with control systems brands Allen-Bradley and Rockwell Software, were marketed as Rockwell Automation.\n\n21st century\nIn 2001, Rockwell International split into two companies.  The industrial automation division became Rockwell Automation, while the avionics division became Rockwell Collins. The split was structured so that Rockwell Automation was the legal successor of Rockwell International, while Rockwell Collins was the spin-off. Rockwell Automation retains Rockwell International's stock price history and continues to trade on the New York Stock Exchange under the symbol \"ROK\".\nIn 2007, Reliance Electric Drives and Dodge Bearings were spun off from the company.\nIn February 2019, Rockwell Automation and Schlumberger entered a joint venture to create Sensia, the oil and gas industry's first fully integrated automation solutions provider. Rockwell was later announced as a founding member of the ISA Global Cybersecurity Alliance to help advance readiness and awareness in manufacturing.\nAnother partnership was formed in November 2019 with Accenture's Industry X to help deliver greater industrial supply chain optimization. Simulation software provider Ansys and Rockwell Automation also allied to help customers design simulation-based digital twins of products, processes, and manufacturing.\nIn May 2023, The Wall Street Journal reported that Rockwell Automation was under a U.S. federal investigation regarding potential access to its software by the Chinese government through company employees in Dalian.\n\nBusiness operations\nIn 2021, Rockwell Automation adjusted its organizational structure into three operating segments—Intelligent Devices, Software & Control, and Lifecycle Services.\nRockwell Automation has three primary areas of business operations:\nAllen-Bradley—automated components and integrated control systems for safety, sensing, industrial, power, and motion control.\nFactoryTalk—software that supports advanced industrial applications including system design, operations, plant maintenance, and analytics.\nLifecycleIQ Services—services to help connect, secure, mobilize, and scale manufacturing operations.\n\nSee also\nAllen-Bradley – American factory automation equipment brand owned by Rockwell Automation\nAllen-Bradley Clock Tower – Office building located in Milwaukee, Wisconsin, USAPages displaying short descriptions of redirect targets\nEngineer In Training – U.S. professional certification levelPages displaying short descriptions of redirect targets\nRetro-Encabulator – Fictional electromechanical machinePages displaying short descriptions of redirect targets\n\nReferences\nExternal links\nOfficial website \nBusiness data for Rockwell Automation, Inc.:",
  "clean_text": "Rockwell Automation, Inc. is an American provider of industrial automation and digital transformation technologies headquartered in Milwaukee, Wisconsin. Its brands include Allen-Bradley, FactoryTalk software and LifecycleIQ Services. Rockwell Automation employs approximately 27,000 people and has customers in more than 100 countries worldwide. History Early years Rockwell Automation began in 1903 as the Compression Rheostat Launch Company. It was founded by Dr. Stanton Allen and Lynde Bradley with an initial investment of $1000. In 1904, 19-year-old Harry Bradley joined his brother in the business, and the company's first patented product, a carbon disc compression-type motor controller for industrial cranes, was demonstrated at the St. Louis World's Fair the same year. In 1909, the company was renamed the Allen-Bradley Company. Allen-Bradley expanded rapidly during World War I in response to government-contracted work. Its product line grew to include automatic starters, switches, circuit breakers, relays, and other electric equipment. After the war, the company grew its miniature rheostat business to support the burgeoning radio industry. By the middle of the 1920s, nearly 50 percent of the company's sales were attributed to the radio department. The year 1929 closed with record company sales of $3 million. By 1932, at the start of the Great Depression, the company was posting record losses. It reduced its workforce and cut wages by 50%. Throughout this period, Lynde Bradley supported an aggressive research and development approach intended to \"develop the company out of the Depression.\" By 1937, Allen-Bradley employment had rebounded to pre-Depression levels and company sales reached an all-time high of nearly $4 million. Mid-late 20th century World War II fueled unprecedented levels of production, with 80% of the company's orders being war-related. Wartime orders were centered on two broad lines of products: industrial controls to speed production, and electrical components or radio parts used in a wide range of military equipment. Allen-Bradley expanded its facilities numerous times during the 1940s to meet wartime production needs. With Fred Loock serving as president and Harry Bradley as chairman, the company began a major $1 million, two-year expansion project in 1947. The company completed additional expansions at its Milwaukee facilities in the 1950s and 1960s, including the Allen-Bradley clock tower. During the 1970s, the company expanded its production facilities and markets and entered the 1980s as a global company. In 1981, the company introduced a new line of programmable logic controllers. In 1985, Rockwell International purchased Allen-Bradley for $1.651 billion; this was the largest acquisition in Wisconsin's history to date. For all intents and purposes, Allen-Bradley took over Rockwell's industrial automation division. The 1990s featured continued technology development, including the company's launch of its software business. Rockwell International developed PowerFlex, a manufacturing software and technology in the 1990s. Rockwell International also acquired a power systems business, composed of Reliance Electric and Dodge. These two brands, combined with control systems brands Allen-Bradley and Rockwell Software, were marketed as Rockwell Automation. 21st century In 2001, Rockwell International split into two companies. The industrial automation division became Rockwell Automation, while the avionics division became Rockwell Collins. The split was structured so that Rockwell Automation was the legal successor of Rockwell International, while Rockwell Collins was the spin-off. Rockwell Automation retains Rockwell International's stock price history and continues to trade on the New York Stock Exchange under the symbol \"ROK\". In 2007, Reliance Electric Drives and Dodge Bearings were spun off from the company. In February 2019, Rockwell Automation and Schlumberger entered a joint venture to create Sensia, the oil and gas industry's first fully integrated automation solutions provider. Rockwell was later announced as a founding member of the ISA Global Cybersecurity Alliance to help advance readiness and awareness in manufacturing. Another partnership was formed in November 2019 with Accenture's Industry X to help deliver greater industrial supply chain optimization. Simulation software provider Ansys and Rockwell Automation also allied to help customers design simulation-based digital twins of products, processes, and manufacturing. In May 2023, The Wall Street Journal reported that Rockwell Automation was under a U.S. federal investigation regarding potential access to its software by the Chinese government through company employees in Dalian. Business operations In 2021, Rockwell Automation adjusted its organizational structure into three operating segments—Intelligent Devices, Software & Control, and Lifecycle Services. Rockwell Automation has three primary areas of business operations: Allen-Bradley—automated components and integrated control systems for safety, sensing, industrial, power, and motion control. FactoryTalk—software that supports advanced industrial applications including system design, operations, plant maintenance, and analytics. LifecycleIQ Services—services to help connect, secure, mobilize, and scale manufacturing operations."
}