{
  "ticker": "ROL",
  "cik": "0000084839",
  "company_name": "Rollins, Inc.",
  "corrected_name": "Rollins, Inc.",
  "wiki_title_used": "Rollins, Inc.",
  "exists": true,
  "raw_text": "Rollins, Inc. is a North American pest control company serving residential and commercial clients. Operating globally through its wholly owned subsidiaries, Orkin, Inc., PCO Services (now Orkin Canada), HomeTeam Pest Defense, Western Pest Services, Industrial Fumigant Company, TruTech, Critter Control, Crane, Waltham, OPC Services, PermaTreat, Northwest Exterminating, McCall Service and Clark Pest Control, as well UK subsidiaries Integrated Pest Management Limited, Safeguard Pest Control, NBC Environment, Europest Environmental Services, Guardian Pest Control, Ames, Kestrel and Beaver Pest Control, with Australian subsidiaries Allpest, Scientific Pest Control, Murray Pest Control and Statewide Pest Control, and Singapore subsidiary Aardwolf Pestkare, the company provides pest control services and protection against termite damage, rodents and insects to over 2.8 million customers in the US, Canada, United Kingdom, Mexico, Central America, the Caribbean, the Middle East and Asia from over 800 locations.\nThe United States accounted for 92.7% of net sales. Net sales by activity:\n\ninsect control and residential deratisation (45%);\ninsect control and deratisation for companies (mainly agribusiness, catering, healthcare, hospitality, food distribution companies) (33.9%);\ntermite extermination (19.9%);\nother (1.2%).\n\nHistory\nThe company started as Rollins Broadcasting in 1948, founded by  John W. Rollins and his brother, O. Wayne Rollins.  The company, originally financed in large part by John Rollins' auto dealerships, began as Rollins Broadcasting when the brothers purchased a 1460 WRAD, an AM radio station based in the rural town of Radford, Virginia.  The company grew to include other radio stations, such as jazz station WBEE (AM 1570) in Harvey, Illinois, television stations such as WPTZ in Plattsburgh, New York, Orkin, Inc., Western Pest Services, The Industrial Fumigant Company, a trucking concern (later sold to Penske Truck Leasing), a hazardous waste disposal service, an oil services business, and a cable television company.  In 1984 the company spun off its oil services business, RPC, Inc. (NYSE: RES) to shareholders.\nGary Rollins, son of O. Wayne Rollins, has been the CEO since July 24, 2001.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Rollins, Inc.:",
  "clean_text": "Rollins, Inc. is a North American pest control company serving residential and commercial clients. Operating globally through its wholly owned subsidiaries, Orkin, Inc., PCO Services (now Orkin Canada), HomeTeam Pest Defense, Western Pest Services, Industrial Fumigant Company, TruTech, Critter Control, Crane, Waltham, OPC Services, PermaTreat, Northwest Exterminating, McCall Service and Clark Pest Control, as well UK subsidiaries Integrated Pest Management Limited, Safeguard Pest Control, NBC Environment, Europest Environmental Services, Guardian Pest Control, Ames, Kestrel and Beaver Pest Control, with Australian subsidiaries Allpest, Scientific Pest Control, Murray Pest Control and Statewide Pest Control, and Singapore subsidiary Aardwolf Pestkare, the company provides pest control services and protection against termite damage, rodents and insects to over 2.8 million customers in the US, Canada, United Kingdom, Mexico, Central America, the Caribbean, the Middle East and Asia from over 800 locations. The United States accounted for 92.7% of net sales. Net sales by activity: insect control and residential deratisation (45%); insect control and deratisation for companies (mainly agribusiness, catering, healthcare, hospitality, food distribution companies) (33.9%); termite extermination (19.9%); other (1.2%). History The company started as Rollins Broadcasting in 1948, founded by John W. Rollins and his brother, O. Wayne Rollins. The company, originally financed in large part by John Rollins' auto dealerships, began as Rollins Broadcasting when the brothers purchased a 1460 WRAD, an AM radio station based in the rural town of Radford, Virginia. The company grew to include other radio stations, such as jazz station WBEE (AM 1570) in Harvey, Illinois, television stations such as WPTZ in Plattsburgh, New York, Orkin, Inc., Western Pest Services, The Industrial Fumigant Company, a trucking concern (later sold to Penske Truck Leasing), a hazardous waste disposal service, an oil services business, and a cable television company. In 1984 the company spun off its oil services business, RPC, Inc. (NYSE: RES) to shareholders. Gary Rollins, son of O. Wayne Rollins, has been the CEO since July 24, 2001."
}