{
  "ticker": "ROP",
  "cik": "0000882835",
  "company_name": "Roper Technologies",
  "corrected_name": "Roper Technologies",
  "wiki_title_used": "Roper Technologies",
  "exists": true,
  "raw_text": "Roper Technologies, Inc. is a holding company that owns companies in the technology sector.\nThe company operates three divisions: Application Software (55% of 2024 revenues), which includes Aderant, Clinisys, Data Innovations, Deltek, Frontline, IntelliTrans, PowerPlan, Procare, Strata, Transact/CBORD, and Vertafore; Network Software (21% of 2024 revenues), which includes ConstructConnect, DAT Solutions, The Foundry Visionmongers, iPipeline, iTradeNetwork, Loadlink, MHA, SHP, and SoftWriters; and Technology Enabled Products (24% of 2024 revenues), which includes CIVCO Medical Solutions, FMI, Inovonics, IPA, Neptune, Northern Digital, rf IDEAS, and Verathon.\n\nHistory\nGeorge D. Roper founded the company in 1890 as a manufacturer of home appliances, pumps, and other industrial products. He had part ownership of the Van Wie Gas Stove Company of Cleveland. The Van Wie plant moved to Rockford, Illinois and passed into the hands trustees in the early 1890s. George D. Roper became the sole owner of the Van Wie Gas Stove company after the company's debts had been paid off on September 1, 1894. Ten days later, a fire destroyed the facility. The factory was rebuilt and renamed as the Eclipse Gas Stove Company, and later expanded in 1906 to include the Trahern Pump Company, founded in 1857.\nIn 1957, Roper sold his stove business to Florence Stove Co. of Kankakee, Illinois. The stoves continued to operate under the name George D. Roper, despite the original company changing its name to Roper Pump Company.\nIn 1966, Roper acquired David Bradley Manufacturing Works from Sears Canada.\nIn 1981, Dexter Corporation acquired the company.\nIn 1982, Roper moved his appliance production factory (originally Florence Stove Company) from Kankakee, Illionois to a plant in LaFayette, Georgia. The Kankakee factory was razed in 2016.\nIn 1988, Electrolux purchased Roper's lawn and garden products division.\nIn 1989, Whirlpool Corporation acquired the Roper brand.\nIn 1992, the company once again became a public company via an initial public offering.\nBetween 2001 and 2018, Brian Jellison, a former executive of General Electric and Ingersoll-Rand, served as CEO.\nIn April 2015, Roper Industries Inc. changed its corporate name to Roper Technologies, Inc.\n\nAcquisitions\nReferences\nExternal links\nOfficial website\nBusiness data for Roper Technologies, Inc.:",
  "clean_text": "Roper Technologies, Inc. is a holding company that owns companies in the technology sector. The company operates three divisions: Application Software (55% of 2024 revenues), which includes Aderant, Clinisys, Data Innovations, Deltek, Frontline, IntelliTrans, PowerPlan, Procare, Strata, Transact/CBORD, and Vertafore; Network Software (21% of 2024 revenues), which includes ConstructConnect, DAT Solutions, The Foundry Visionmongers, iPipeline, iTradeNetwork, Loadlink, MHA, SHP, and SoftWriters; and Technology Enabled Products (24% of 2024 revenues), which includes CIVCO Medical Solutions, FMI, Inovonics, IPA, Neptune, Northern Digital, rf IDEAS, and Verathon. History George D. Roper founded the company in 1890 as a manufacturer of home appliances, pumps, and other industrial products. He had part ownership of the Van Wie Gas Stove Company of Cleveland. The Van Wie plant moved to Rockford, Illinois and passed into the hands trustees in the early 1890s. George D. Roper became the sole owner of the Van Wie Gas Stove company after the company's debts had been paid off on September 1, 1894. Ten days later, a fire destroyed the facility. The factory was rebuilt and renamed as the Eclipse Gas Stove Company, and later expanded in 1906 to include the Trahern Pump Company, founded in 1857. In 1957, Roper sold his stove business to Florence Stove Co. of Kankakee, Illinois. The stoves continued to operate under the name George D. Roper, despite the original company changing its name to Roper Pump Company. In 1966, Roper acquired David Bradley Manufacturing Works from Sears Canada. In 1981, Dexter Corporation acquired the company. In 1982, Roper moved his appliance production factory (originally Florence Stove Company) from Kankakee, Illionois to a plant in LaFayette, Georgia. The Kankakee factory was razed in 2016. In 1988, Electrolux purchased Roper's lawn and garden products division. In 1989, Whirlpool Corporation acquired the Roper brand. In 1992, the company once again became a public company via an initial public offering. Between 2001 and 2018, Brian Jellison, a former executive of General Electric and Ingersoll-Rand, served as CEO. In April 2015, Roper Industries Inc. changed its corporate name to Roper Technologies, Inc. Acquisitions"
}