{
  "ticker": "ROST",
  "cik": "0000745732",
  "company_name": "Ross Stores",
  "corrected_name": "Ross Stores",
  "wiki_title_used": "Ross Stores",
  "exists": true,
  "raw_text": "Ross Stores, Inc., operating under the brand name Ross Dress for Less, is an American chain of discount department stores headquartered in Dublin, California. It is the largest off-price retailer in the U.S.; as of July 2024, Ross operates 1,795 stores in 43 U.S. states, Washington, D.C. Puerto Rico and Guam, covering much of the country, but with no presence in New England and Alaska. The company also operates DD's Discounts, a discount department store chain with over 353 locations across the United States, most of which are located in Sun Belt states.\n\nHistory\nRoss Department Store was first opened in San Bruno, California, in 1950 by Morris \"Morrie\" Ross. Morris would work 85 hours a week doing all of the buying and bookkeeping for his department store. In 1958 Ross sold his store to William Isackson to become a residential and commercial real estate developer. Isackson built the company to six stores in the San Francisco Bay Area, located in San Bruno, Pacifica, Novato, Vacaville, Redwood City, and Castro Valley. In 1982 a group of investors, including Mervin Morris, founder of the Mervyn's chain of department stores, purchased the six Ross Department Stores, changed the format to off-price retail units, and within three years rapidly expanded the chain to 107 stores under Stuart Moldaw and Don Rowlett. \nOn August 8, 1985, Ross Stores, Inc. became a public company via an initial public offering, at an initial price of $17.00 per share. Ross Stores trades on Nasdaq's large-cap Global Select Market under the symbol \"ROST\", and is a component of the Nasdaq-100 and S&P 500 indices.\nBy the end of 1995, the chain reached an annual sales of $1.4 billion with 292 stores in 18 states. By 2012, Ross reached $9.7 billion for the fiscal year with 1,091 stores in 33 states with an additional 108 for DD's Discounts in 8 states. Ross moved its headquarters from Newark, California, to Pleasanton, California, in the Tri-Valley area, in 2003.\nBarbara Rentler took the place of CEO Michael Balmuth on June 1, 2014; she was the 25th female CEO of a Fortune 500 company. Ross moved its headquarters from Pleasanton to neighboring Dublin, California, in 2014.\nOn October 28, 2024, the company's board of directors appointed James Conroy as the new CEO, succeeding Barbara Rentler effective February 2, 2025. Conroy previously was CEO of Boot Barn.\nIn 2025, Ross Dress for Less expanded into Puerto Rico.\n\nSee also\nBurlington\nMarshalls\nTarget\nTJ Maxx\nWalmart\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Ross:",
  "clean_text": "Ross Stores, Inc., operating under the brand name Ross Dress for Less, is an American chain of discount department stores headquartered in Dublin, California. It is the largest off-price retailer in the U.S.; as of July 2024, Ross operates 1,795 stores in 43 U.S. states, Washington, D.C. Puerto Rico and Guam, covering much of the country, but with no presence in New England and Alaska. The company also operates DD's Discounts, a discount department store chain with over 353 locations across the United States, most of which are located in Sun Belt states. History Ross Department Store was first opened in San Bruno, California, in 1950 by Morris \"Morrie\" Ross. Morris would work 85 hours a week doing all of the buying and bookkeeping for his department store. In 1958 Ross sold his store to William Isackson to become a residential and commercial real estate developer. Isackson built the company to six stores in the San Francisco Bay Area, located in San Bruno, Pacifica, Novato, Vacaville, Redwood City, and Castro Valley. In 1982 a group of investors, including Mervin Morris, founder of the Mervyn's chain of department stores, purchased the six Ross Department Stores, changed the format to off-price retail units, and within three years rapidly expanded the chain to 107 stores under Stuart Moldaw and Don Rowlett. On August 8, 1985, Ross Stores, Inc. became a public company via an initial public offering, at an initial price of $17.00 per share. Ross Stores trades on Nasdaq's large-cap Global Select Market under the symbol \"ROST\", and is a component of the Nasdaq-100 and S&P 500 indices. By the end of 1995, the chain reached an annual sales of $1.4 billion with 292 stores in 18 states. By 2012, Ross reached $9.7 billion for the fiscal year with 1,091 stores in 33 states with an additional 108 for DD's Discounts in 8 states. Ross moved its headquarters from Newark, California, to Pleasanton, California, in the Tri-Valley area, in 2003. Barbara Rentler took the place of CEO Michael Balmuth on June 1, 2014; she was the 25th female CEO of a Fortune 500 company. Ross moved its headquarters from Pleasanton to neighboring Dublin, California, in 2014. On October 28, 2024, the company's board of directors appointed James Conroy as the new CEO, succeeding Barbara Rentler effective February 2, 2025. Conroy previously was CEO of Boot Barn. In 2025, Ross Dress for Less expanded into Puerto Rico."
}