{
  "ticker": "RSG",
  "cik": "0001060391",
  "company_name": "Republic Services",
  "corrected_name": "Republic Services",
  "wiki_title_used": "Republic Services",
  "exists": true,
  "raw_text": "Republic Services, Inc. is a North American waste disposal company whose services include non-hazardous solid waste collection, waste transfer, waste disposal, recycling, and energy services. It is the second largest provider of waste disposal in the United States (as measured by revenue) after Waste Management. Its operations primarily consist of providing collection, transfer, and disposal of non-hazardous solid waste, recovering and recycling of certain materials, and energy services. The company is 35.1% owned by Bill Gates's Cascade Investment.\nThe company operates 367 collection operations, 248 transfer stations, 75 recycling centers, 208 active landfills, 2 treatment, recovery and disposal facilities, 23 treatment, storage and disposal facilities, 5 salt water disposal wells, 14 deep injection wells, and 1 polymer center. It is involved in 79 landfill gas-to-energy and other renewable energy projects and had post-closure responsibility for 125 closed landfills.\nRepublic Services owns and operates the largest landfill in the United States at 2,200 acres (890 ha) located in Apex, Nevada. Republic operates the Bridgeton Landfill near St. Louis, Missouri. The landfill is the site of an underground event of concern to residents and the United States Environmental Protection Agency (EPA).\n\nHistory\nThe company was created as a waste disposal firm in 1981 by Republic Industries.\nIn 1995, Wayne Huizenga, formerly chairman of Waste Management, invested $64 million of his own money and raised an additional $168 million to acquire the company and became its chairman.\nIn July 1998, Republic Industries completed the corporate spin-off of Republic Services via an initial public offering, and then changed its name to AutoNation.\nIn 2008, Waste Management bid $6.73 billion for the company.\nAt the end of 2015, Republic Services opened a $35 million, 110,000 square-foot North Las Vegas Recycling Center, designed by local architect Edward Vance of EV&A Architects. The plant's solar panels generate enough energy to run the plant for two to three months. The plant can process two million pounds of recycled paper each day, or 70 tons per hour. Eventually, the plant will be able to recycle three million pounds of paper per day. Optical sorters use 2D and 3D technologies to speed sorting.\nIn July 2016, Republic Services and Mas Energy launched a new renewable energy project to serve the Atlanta metropolitan area. The project includes three landfill gas-to-energy facilities in Buford, Griffin, and Winder. The facilities will produce 24.1 megawatts of electricity, enough to power 15,665 households. The three facilities together will be the largest landfill gas-to-energy project in Georgia. \nRepublic Services converts landfill gas, the natural byproduct of decomposing waste, to energy. The use of landfill gas is beneficial to the U.S. economy by reducing air pollution through the capture and use of methane. As of July 2016, Republic Services operated 69 landfill gas and renewable energy projects.\nIn January 2016, the company said it will invest $20 million in 2016 to design and implement its Customer Resource Centers in addition to other customer focused initiatives. The company expects the changes to result in a yearly savings of about $10 million. The plan calls for the consolidation of 108 regional customer centers into three main customer resource centers in Fishers, Indiana, Charlotte, North Carolina, and Chandler, Arizona.\nIn February 2016, it was announced by North Carolina Governor Pat McCrory and N.C. Commerce Secretary John E. Skvareta, III, that Republic Services was planning to open a full-service Customer Resource Center in Charlotte. It is expected that the facility will create over 350 new jobs, while Republic's investment in the center is projected to be over $6.8 million over the next three years.\nIn April 2017, Republic Services opened a customer service center in Fishers, Indiana, employing over 250 workers, with plans to hire an additional 120 during the year. The company invested $13.6 million to renovate and equip office space along the I-69 corporate corridor in Fishers. The customer service office is expected to create up to 469 new jobs by 2025.\nIn April 2015, Republic Services opened a landfill gas-to-energy project near Los Angeles at the Sunshine Canyon Landfill. The 20-megawatt renewable energy project can supply enough electricity to power almost 25,000 homes in the area.\nIn April 2016 the city of Boise, Idaho considered the implementation of a composting program, utilizing Republic Services, the company that was already hauling garbage in the city. The program went into effect in June 2017. After a little more than one month, the company picked up 1,716 tons of compost from Boise's single-family homes.\nIn May 2017, in partnership with the Alabama Coastal Foundation (ACF) Republic Services launched an oyster shell collection program with several coastal restaurants. Funded by a two-year grant from the National Fish and Wildlife Foundation, the goal of the collection program is to create sustainable oyster habitats and to teach the public about the importance of oyster shell recycling.\nIn 2017, the company invested $29 million in solar projects at some of its landfills and other locations. Republic Services has either built, invested in, or operates over 236,000 solar panels at 19 generating facilities in the US, with a total capacity of 80 megawatts, enough electricity to power 208,000 homes.\nIn September 2017, Republic Services and Soltage activated a 13.5 megawatt solar energy project in Massachusetts. When finished, the project, constructed on three former landfill sites, will include approximately 41,000 solar panels to power 1,900 local households and reduce carbon emissions by more than 14,000 tons.\n\nAcquisitions\nManagement\nIn December 1998, James E. O'Connor replaced Wayne Huizenga as CEO.\nAfter 12 years as CEO of Republic Services, James O’Connor retired on January 1, 2011, and was replaced by the president and COO of Republic Services, Don Slager.\nJames P. Snee and Katharine Weymouth were appointed to the Republic Services Board of Directors in 2018, resulting in a total of 12 board members, 11 of them independent.\nIn April 2019, Jon Vander Ark became president and in 2021, Slager retired and Vander Ark was named CEO.\n\nCorporate responsibility, sustainability, and innovation\nRepublic Services scored in the 90th percentile of the Commercial Services and Supplies sector of the 2016 Dow Jones Sustainability—North America Index™ (DJSI) and was also named to the 2016 DJSI World and North America indices. Republic is the only recycling and solid waste collection provider in the Commercial Services and Supplies sector that is included in the 2016 DJSI World Index. The rankings highlight Republic's leadership in corporate governance, environmental, social, and financial aspects of sustainability.\nThe Blue Planet sustainability initiative is Republic Services’ approach to corporate social responsibility through their efforts to reduce emissions from operations; improve materials management; improve safety standards; increase community engagement; and a focus on employee growth opportunities. At the end of August 2017, the company released its most recent Sustainability Report describing how well it was able to advance its sustainability initiatives.\nIn September 2019, the company became the first US solid waste and recycling provider whose emissions reduction targets were approved by the Science Based Targets Initiative. These goals meet the targets that the Paris Agreement requires.\nIn 2019 Republic Services was acknowledged by Barron's as one of the United States' 100 Most Sustainable Companies for the second consecutive year.\nThe company was listed on Forbes as one of the country's best employers for women, the only Arizona-based company to do so.\nThe company implements a Recycling Simplified Education Program which includes K-12 lesson plans, a website that explains what can and cannot be recycled, and other information to help educate the public about recycling. The program won the 2019 Best Recycling Public Education Program Award.\nIn August 2018, the company announced that the Pinehill Landfill in Longview, Texas, will generate 404 million cubic feet of renewable natural gas per year, taking the place of over 19 million gallons of gas annually, with a concomitant reduction in carbon emissions.\n\nLobbying\nThe company spends approximately $600,000 per year in lobbying. In 2014, Republic Services gave $50,000 to Missouri Republicans to their House and Senate campaign committees and $20,000 to House and Senate committees for Missouri Democrats.\n\nCriticism and controversy\nLegal and environmental issues\nIn 2008, Republic Services agreed to pay a $1 million fine and up to $36 million in remediation costs for alleged violations of the Clean Water Act at a closed landfill in Clark County, Nevada.\nIn 2007, Republic Services was fined $725,000 by the State of California related to hazardous waste leaking from a closed landfill into San Francisco Bay.\nIn 2008, the company acquired two closed St. Louis, Missouri landfills, West Lake and Bridgeton. An underground event (more accurately referred to as a “smoldering event”) was detected in the closed Bridgeton Landfill. Due to the odors emitted from the landfill and its proximity to the adjacent West Lake—an EPA-managed Super Fund site that contains low-level radioactive waste dumped there illegally over forty years ago—environmental groups got involved.\n\nWest Lake Landfill (Missouri)\nRepublic Services is identified by the EPA as one of four potentially responsible parties for the EPA Superfund cleanup site West Lake Landfill in Bridgeton, Missouri. Its contents have been shown to include radioactive waste and it was featured in the 2017 HBO documentary Atomic Homefront.\nIn 2013 the company said it would build a barrier to separate the section with a subsurface smoldering fire from the section with radioactive waste, but because the EPA was uncertain where the radioactive contamination was located, progress on the barrier was delayed for more than a year. In response to criticism that the EPA was not moving quickly enough to clean up West Lake Landfill, Republic Services spent between $10,000 and $100,000 on advertising in 2015, according to spokesman Russ Knocke. This included employing representatives to criticize community activists on social media.\nIn March 2016 the EPA released studies that showed the extent of the radioactive waste on the site and allowed the company to build a barrier without disturbing the radioactive areas. During the construction of the barrier, Republic also must submit plans for a cooling system, which must be completed within four months of commencement of construction. The company will also enlarge onto the north quarry of Bridgeton Landfill a plastic liner that it already installed over the south quarry. Environmental Protection Agency Region 7 Administrator Mark Hague said this should help control the reaction by blocking oxygen “as well as mitigate some of the odors coming off of this site.” Republic will also install more temperature monitors plus two sulfur dioxide monitors to track unhealthy emissions. They will also be required to develop a system that can quickly extinguish any new hot spots that the underground event might create.\n\nHurtado et al v. Rainbow Environmental Services and Republic Services (California)\nIn September 2017, former and current employees of Republic Services at the former Rainbow Environmental Services waste transfer station in Huntington Beach, California, filed a legal complaint pursuant to the Employee Retirement Income Security Act of 1974, regarding the illegal sale of the former employee-owned company to Republic Services in 2014. The lawsuit alleged a series of \"bad-faith dealings made by the executive leadership of Rainbow, through which they funded the creation of new companies and otherwise redirected ESOP assets. Apart from allegedly violating the plan document, these investments caused losses to the Rainbow ESOP while benefiting the executives, according to plaintiffs.\" In the decision, there is a section that describes the alleged role played by a fake attorney who, according to the plaintiffs, was a Republic Services corporate manager who attempted to intimidate or misdirect potential plaintiffs. The plaintiffs, representing 400-plus former and current employees, agreed in May 2021 to a $7.9 million settlement.\n\nNational Treasure Historic Wintersburg (California)\nIn October 2014, Republic Services purchased Rainbow Environmental Services in Huntington Beach, California. The purchase included a National Treasure Historic Place representing 100-plus years of Japanese American history known as Historic Wintersburg. The property previously was listed as one of \"America's 11 Most Endangered Historic Places\" in 2014 and designated a \"National Treasure\" in 2015.\nThe Ocean View School District, a public elementary school district in Huntington Beach, California, blocked changes by Republic Services to the Historic Wintersburg property in a 2013 legal complaint regarding the waste transfer station's impacts on the Oak View Preschool and Oak View Elementary School. A legal settlement in 2016 included a provision that Republic Services will not use the adjacent ‘Historic Wintersburg’ property to expand any of their operations. Republic Services said that it would not demolish the property's six historic structures and would participate in discussions regarding the purchase and preservation of Historic Wintersburg as a heritage park.\nIn February 2018, Republic unexpectedly disclosed its intent to sell Historic Wintersburg for development as a self-storage facility. Historical and civil rights organizations protested, including the City of Huntington Beach Historic Resources Board. As of 2022, Republic Services continues to own the endangered historic property. On February 25, 2022, two of the oldest structures on the property, the 1910 Wintersburg Japanese Mission and 1910 manse (parsonage), were lost to fire and demolition.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Republic Services:",
  "clean_text": "Republic Services, Inc. is a North American waste disposal company whose services include non-hazardous solid waste collection, waste transfer, waste disposal, recycling, and energy services. It is the second largest provider of waste disposal in the United States (as measured by revenue) after Waste Management. Its operations primarily consist of providing collection, transfer, and disposal of non-hazardous solid waste, recovering and recycling of certain materials, and energy services. The company is 35.1% owned by Bill Gates's Cascade Investment. The company operates 367 collection operations, 248 transfer stations, 75 recycling centers, 208 active landfills, 2 treatment, recovery and disposal facilities, 23 treatment, storage and disposal facilities, 5 salt water disposal wells, 14 deep injection wells, and 1 polymer center. It is involved in 79 landfill gas-to-energy and other renewable energy projects and had post-closure responsibility for 125 closed landfills. Republic Services owns and operates the largest landfill in the United States at 2,200 acres (890 ha) located in Apex, Nevada. Republic operates the Bridgeton Landfill near St. Louis, Missouri. The landfill is the site of an underground event of concern to residents and the United States Environmental Protection Agency (EPA). History The company was created as a waste disposal firm in 1981 by Republic Industries. In 1995, Wayne Huizenga, formerly chairman of Waste Management, invested $64 million of his own money and raised an additional $168 million to acquire the company and became its chairman. In July 1998, Republic Industries completed the corporate spin-off of Republic Services via an initial public offering, and then changed its name to AutoNation. In 2008, Waste Management bid $6.73 billion for the company. At the end of 2015, Republic Services opened a $35 million, 110,000 square-foot North Las Vegas Recycling Center, designed by local architect Edward Vance of EV&A Architects. The plant's solar panels generate enough energy to run the plant for two to three months. The plant can process two million pounds of recycled paper each day, or 70 tons per hour. Eventually, the plant will be able to recycle three million pounds of paper per day. Optical sorters use 2D and 3D technologies to speed sorting. In July 2016, Republic Services and Mas Energy launched a new renewable energy project to serve the Atlanta metropolitan area. The project includes three landfill gas-to-energy facilities in Buford, Griffin, and Winder. The facilities will produce 24.1 megawatts of electricity, enough to power 15,665 households. The three facilities together will be the largest landfill gas-to-energy project in Georgia. Republic Services converts landfill gas, the natural byproduct of decomposing waste, to energy. The use of landfill gas is beneficial to the U.S. economy by reducing air pollution through the capture and use of methane. As of July 2016, Republic Services operated 69 landfill gas and renewable energy projects. In January 2016, the company said it will invest $20 million in 2016 to design and implement its Customer Resource Centers in addition to other customer focused initiatives. The company expects the changes to result in a yearly savings of about $10 million. The plan calls for the consolidation of 108 regional customer centers into three main customer resource centers in Fishers, Indiana, Charlotte, North Carolina, and Chandler, Arizona. In February 2016, it was announced by North Carolina Governor Pat McCrory and N.C. Commerce Secretary John E. Skvareta, III, that Republic Services was planning to open a full-service Customer Resource Center in Charlotte. It is expected that the facility will create over 350 new jobs, while Republic's investment in the center is projected to be over $6.8 million over the next three years. In April 2017, Republic Services opened a customer service center in Fishers, Indiana, employing over 250 workers, with plans to hire an additional 120 during the year. The company invested $13.6 million to renovate and equip office space along the I-69 corporate corridor in Fishers. The customer service office is expected to create up to 469 new jobs by 2025. In April 2015, Republic Services opened a landfill gas-to-energy project near Los Angeles at the Sunshine Canyon Landfill. The 20-megawatt renewable energy project can supply enough electricity to power almost 25,000 homes in the area. In April 2016 the city of Boise, Idaho considered the implementation of a composting program, utilizing Republic Services, the company that was already hauling garbage in the city. The program went into effect in June 2017. After a little more than one month, the company picked up 1,716 tons of compost from Boise's single-family homes. In May 2017, in partnership with the Alabama Coastal Foundation (ACF) Republic Services launched an oyster shell collection program with several coastal restaurants. Funded by a two-year grant from the National Fish and Wildlife Foundation, the goal of the collection program is to create sustainable oyster habitats and to teach the public about the importance of oyster shell recycling. In 2017, the company invested $29 million in solar projects at some of its landfills and other locations. Republic Services has either built, invested in, or operates over 236,000 solar panels at 19 generating facilities in the US, with a total capacity of 80 megawatts, enough electricity to power 208,000 homes. In September 2017, Republic Services and Soltage activated a 13.5 megawatt solar energy project in Massachusetts. When finished, the project, constructed on three former landfill sites, will include approximately 41,000 solar panels to power 1,900 local households and reduce carbon emissions by more than 14,000 tons. Acquisitions Management In December 1998, James E. O'Connor replaced Wayne Huizenga as CEO. After 12 years as CEO of Republic Services, James O’Connor retired on January 1, 2011, and was replaced by the president and COO of Republic Services, Don Slager. James P. Snee and Katharine Weymouth were appointed to the Republic Services Board of Directors in 2018, resulting in a total of 12 board members, 11 of them independent. In April 2019, Jon Vander Ark became president and in 2021, Slager retired and Vander Ark was named CEO. Corporate responsibility, sustainability, and innovation Republic Services scored in the 90th percentile of the Commercial Services and Supplies sector of the 2016 Dow Jones Sustainability—North America Index™ (DJSI) and was also named to the 2016 DJSI World and North America indices. Republic is the only recycling and solid waste collection provider in the Commercial Services and Supplies sector that is included in the 2016 DJSI World Index. The rankings highlight Republic's leadership in corporate governance, environmental, social, and financial aspects of sustainability. The Blue Planet sustainability initiative is Republic Services’ approach to corporate social responsibility through their efforts to reduce emissions from operations; improve materials management; improve safety standards; increase community engagement; and a focus on employee growth opportunities. At the end of August 2017, the company released its most recent Sustainability Report describing how well it was able to advance its sustainability initiatives. In September 2019, the company became the first US solid waste and recycling provider whose emissions reduction targets were approved by the Science Based Targets Initiative. These goals meet the targets that the Paris Agreement requires. In 2019 Republic Services was acknowledged by Barron's as one of the United States' 100 Most Sustainable Companies for the second consecutive year. The company was listed on Forbes as one of the country's best employers for women, the only Arizona-based company to do so. The company implements a Recycling Simplified Education Program which includes K-12 lesson plans, a website that explains what can and cannot be recycled, and other information to help educate the public about recycling. The program won the 2019 Best Recycling Public Education Program Award. In August 2018, the company announced that the Pinehill Landfill in Longview, Texas, will generate 404 million cubic feet of renewable natural gas per year, taking the place of over 19 million gallons of gas annually, with a concomitant reduction in carbon emissions. Lobbying The company spends approximately $600,000 per year in lobbying. In 2014, Republic Services gave $50,000 to Missouri Republicans to their House and Senate campaign committees and $20,000 to House and Senate committees for Missouri Democrats. Criticism and controversy Legal and environmental issues In 2008, Republic Services agreed to pay a $1 million fine and up to $36 million in remediation costs for alleged violations of the Clean Water Act at a closed landfill in Clark County, Nevada. In 2007, Republic Services was fined $725,000 by the State of California related to hazardous waste leaking from a closed landfill into San Francisco Bay. In 2008, the company acquired two closed St. Louis, Missouri landfills, West Lake and Bridgeton. An underground event (more accurately referred to as a “smoldering event”) was detected in the closed Bridgeton Landfill. Due to the odors emitted from the landfill and its proximity to the adjacent West Lake—an EPA-managed Super Fund site that contains low-level radioactive waste dumped there illegally over forty years ago—environmental groups got involved. West Lake Landfill (Missouri) Republic Services is identified by the EPA as one of four potentially responsible parties for the EPA Superfund cleanup site West Lake Landfill in Bridgeton, Missouri. Its contents have been shown to include radioactive waste and it was featured in the 2017 HBO documentary Atomic Homefront. In 2013 the company said it would build a barrier to separate the section with a subsurface smoldering fire from the section with radioactive waste, but because the EPA was uncertain where the radioactive contamination was located, progress on the barrier was delayed for more than a year. In response to criticism that the EPA was not moving quickly enough to clean up West Lake Landfill, Republic Services spent between $10,000 and $100,000 on advertising in 2015, according to spokesman Russ Knocke. This included employing representatives to criticize community activists on social media. In March 2016 the EPA released studies that showed the extent of the radioactive waste on the site and allowed the company to build a barrier without disturbing the radioactive areas. During the construction of the barrier, Republic also must submit plans for a cooling system, which must be completed within four months of commencement of construction. The company will also enlarge onto the north quarry of Bridgeton Landfill a plastic liner that it already installed over the south quarry. Environmental Protection Agency Region 7 Administrator Mark Hague said this should help control the reaction by blocking oxygen “as well as mitigate some of the odors coming off of this site.” Republic will also install more temperature monitors plus two sulfur dioxide monitors to track unhealthy emissions. They will also be required to develop a system that can quickly extinguish any new hot spots that the underground event might create. Hurtado et al v. Rainbow Environmental Services and Republic Services (California) In September 2017, former and current employees of Republic Services at the former Rainbow Environmental Services waste transfer station in Huntington Beach, California, filed a legal complaint pursuant to the Employee Retirement Income Security Act of 1974, regarding the illegal sale of the former employee-owned company to Republic Services in 2014. The lawsuit alleged a series of \"bad-faith dealings made by the executive leadership of Rainbow, through which they funded the creation of new companies and otherwise redirected ESOP assets. Apart from allegedly violating the plan document, these investments caused losses to the Rainbow ESOP while benefiting the executives, according to plaintiffs.\" In the decision, there is a section that describes the alleged role played by a fake attorney who, according to the plaintiffs, was a Republic Services corporate manager who attempted to intimidate or misdirect potential plaintiffs. The plaintiffs, representing 400-plus former and current employees, agreed in May 2021 to a $7.9 million settlement. National Treasure Historic Wintersburg (California) In October 2014, Republic Services purchased Rainbow Environmental Services in Huntington Beach, California. The purchase included a National Treasure Historic Place representing 100-plus years of Japanese American history known as Historic Wintersburg. The property previously was listed as one of \"America's 11 Most Endangered Historic Places\" in 2014 and designated a \"National Treasure\" in 2015. The Ocean View School District, a public elementary school district in Huntington Beach, California, blocked changes by Republic Services to the Historic Wintersburg property in a 2013 legal complaint regarding the waste transfer station's impacts on the Oak View Preschool and Oak View Elementary School. A legal settlement in 2016 included a provision that Republic Services will not use the adjacent ‘Historic Wintersburg’ property to expand any of their operations. Republic Services said that it would not demolish the property's six historic structures and would participate in discussions regarding the purchase and preservation of Historic Wintersburg as a heritage park. In February 2018, Republic unexpectedly disclosed its intent to sell Historic Wintersburg for development as a self-storage facility. Historical and civil rights organizations protested, including the City of Huntington Beach Historic Resources Board. As of 2022, Republic Services continues to own the endangered historic property. On February 25, 2022, two of the oldest structures on the property, the 1910 Wintersburg Japanese Mission and 1910 manse (parsonage), were lost to fire and demolition."
}