{
  "ticker": "RVTY",
  "cik": "0000031791",
  "company_name": "Revvity",
  "corrected_name": "Revvity",
  "wiki_title_used": "Revvity",
  "exists": true,
  "raw_text": "Revvity, Inc. is an American company in the life sciences and diagnostics business that is focused on selling to the pharmaceutical and biotechnology industries, especially in relation to approaches making use of new cell therapy or gene therapy developments. Its origins lie with the long-existing company PerkinElmer, which has been in a variety of business lines.  \nIn 2022, a split of PerkinElmer resulted in one part, comprising its applied, food and enterprise services businesses, being sold to the private equity firm New Mountain Capital for $2.45 billion and thus no longer being public but keeping the PerkinElmer name. The other part, comprising the life sciences and diagnostics businesses, remained public but required a new name, which in 2023 was announced as Revvity, Inc. From the perspective of Revvity, the goal of creating a separate company was that its businesses might show greater profit margins and more in the way of growth potential.  An associated goal was to have more financial flexibility moving forward.  On May 16, 2023, the PerkinElmer stock symbol PKI was replaced by the new symbol RVTY.\nThe name 'Revvity' itself was formed from a combination of the words \"revolution\" (abrupt change, in English) and \"vita\" (life, in Latin).  It was the larger of the two splitees: of around 17,000 employees of the public PerkinElmer, about 11,000 of them were assigned to it, while some 6,000 went to the newly private PerkinElmer.  Initial annual revenues for Revvity were estimated at about $3 billion.  Singh and some other senior executives came to Revvity from PerkinElmer, while others were new hires. Headquarters for Revvity were kept in the same town as the old PerkinElmer, that being Waltham, Massachusetts.\nCompared with its PerkinElmer past, Revvity was de-emphasizing medical devices in favor of an approach based on reagents and electronic commerce.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Revvity, Inc.:",
  "clean_text": "Revvity, Inc. is an American company in the life sciences and diagnostics business that is focused on selling to the pharmaceutical and biotechnology industries, especially in relation to approaches making use of new cell therapy or gene therapy developments. Its origins lie with the long-existing company PerkinElmer, which has been in a variety of business lines. In 2022, a split of PerkinElmer resulted in one part, comprising its applied, food and enterprise services businesses, being sold to the private equity firm New Mountain Capital for $2.45 billion and thus no longer being public but keeping the PerkinElmer name. The other part, comprising the life sciences and diagnostics businesses, remained public but required a new name, which in 2023 was announced as Revvity, Inc. From the perspective of Revvity, the goal of creating a separate company was that its businesses might show greater profit margins and more in the way of growth potential. An associated goal was to have more financial flexibility moving forward. On May 16, 2023, the PerkinElmer stock symbol PKI was replaced by the new symbol RVTY. The name 'Revvity' itself was formed from a combination of the words \"revolution\" (abrupt change, in English) and \"vita\" (life, in Latin). It was the larger of the two splitees: of around 17,000 employees of the public PerkinElmer, about 11,000 of them were assigned to it, while some 6,000 went to the newly private PerkinElmer. Initial annual revenues for Revvity were estimated at about $3 billion. Singh and some other senior executives came to Revvity from PerkinElmer, while others were new hires. Headquarters for Revvity were kept in the same town as the old PerkinElmer, that being Waltham, Massachusetts. Compared with its PerkinElmer past, Revvity was de-emphasizing medical devices in favor of an approach based on reagents and electronic commerce."
}