{
  "ticker": "SBAC",
  "cik": "0001034054",
  "company_name": "SBA Communications",
  "corrected_name": "SBA Communications",
  "wiki_title_used": "SBA Communications",
  "exists": true,
  "raw_text": "SBA Communications Corporation is a real estate investment trust which owns and operates wireless infrastructure in the United States, Canada, Central America, South America, and South Africa. It was founded in 1989 as Steven Bernstein and Associates by Steven Bernstein.\n\nOperations\nThe company develops wireless infrastructures, including small cells, indoor/outdoor distributed antenna systems, and traditional cell sites that support antennas used for wireless communication by mobile carriers and wireless broadband providers.\nSBA Communications operates in two segments: Site Leasing and Site Development. It leases antenna space to wireless service providers on towers that it owns or operates, and manages rooftop and tower sites for property owners under various contractual arrangements. As of 2020, it owned 30,000 towers around North and South America. Its biggest market is Brazil where the company owns over 10,000 towers. The company also managed or leased approximately 4,800 actual or potential towers. In addition, it provides various site development services comprising network pre-design; site audits; identification of potential locations for towers and antennas; support in buying or leasing of the location; assistance in obtaining zoning approvals and permits; tower structure construction; antenna installation; and radio equipment installation, commissioning, and maintenance.\n\nReferences\nExternal links\nCompany homepage\nBusiness data for SBA Communications:",
  "clean_text": "SBA Communications Corporation is a real estate investment trust which owns and operates wireless infrastructure in the United States, Canada, Central America, South America, and South Africa. It was founded in 1989 as Steven Bernstein and Associates by Steven Bernstein. Operations The company develops wireless infrastructures, including small cells, indoor/outdoor distributed antenna systems, and traditional cell sites that support antennas used for wireless communication by mobile carriers and wireless broadband providers. SBA Communications operates in two segments: Site Leasing and Site Development. It leases antenna space to wireless service providers on towers that it owns or operates, and manages rooftop and tower sites for property owners under various contractual arrangements. As of 2020, it owned 30,000 towers around North and South America. Its biggest market is Brazil where the company owns over 10,000 towers. The company also managed or leased approximately 4,800 actual or potential towers. In addition, it provides various site development services comprising network pre-design; site audits; identification of potential locations for towers and antennas; support in buying or leasing of the location; assistance in obtaining zoning approvals and permits; tower structure construction; antenna installation; and radio equipment installation, commissioning, and maintenance."
}