{
  "ticker": "SBUX",
  "cik": "0000829224",
  "company_name": "Starbucks",
  "corrected_name": "Starbucks",
  "wiki_title_used": "Starbucks",
  "exists": true,
  "raw_text": "Starbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. It was founded in 1971 by Jerry Baldwin, Zev Siegl, and Gordon Bowker at Seattle's Pike Place Market initially as a coffee bean wholesaler. Starbucks was converted into a coffee shop serving espresso-based drinks under the ownership of Howard Schultz, who was chief executive officer from 1986 to 2000 and led the aggressive expansion of the franchise across the West Coast of the United States.\nAs of November 2022, the company had 35,711 stores in 80 countries, 15,873 of which were located in the United States. Of Starbucks' U.S.-based stores, over 8,900 are company-operated, while the remainder are licensed. It is the world's largest coffeehouse chain. The company is ranked 120th on the Fortune 500 and 303rd on the Forbes Global 2000, as of 2022.\nThe rise of the second wave of coffee culture is generally attributed to Starbucks, which introduced a wider variety of coffee experiences. Starbucks serves hot and cold drinks, whole-bean coffee, micro-ground instant coffee, espresso, caffe latte, full and loose-leaf teas, juices, Frappuccino beverages, pastries, and snacks. Some offerings are seasonal or specific to the locality of the store. Depending on the country, most locations provide free Wi-Fi Internet access. The company has been subject to multiple controversies related to its business practices. Conversely, its franchise has commanded substantial brand loyalty, market share, and company value.\n\nHistory\n20th century\n1970s\nStarbucks originally opened in Seattle, Washington, on March 30, 1971. By selling high-quality coffee beans and equipments related, Starbucks became a local coffee bean retailer for the first ten years in Seattle. It was founded by business partners Jerry Baldwin, Zev Siegl and Gordon Bowker who first met as students at the University of San Francisco. The trio were inspired to sell high-quality coffee beans and equipment by coffee roasting entrepreneur Alfred Peet. Bowker recalls that a business partner of his, Terry Heckler, thought words beginning with the letters \"st\" were powerful, leading the founders to create a list of words beginning with \"st\", hoping to find a brand name. They chose \"Starbo\", a misreading of the  mining town Storbo in the Cascade Range named after Peter Storbo, founder and president of the Mount Rainier Mining Company. From there, the group remembered \"Starbuck\", the name of the chief mate in the book Moby-Dick. Bowker said, \"Moby-Dick didn't have anything to do with Starbucks directly; it was only coincidental that the sound seemed to make sense.\"\nThe first Starbucks store was located in Seattle, at 2000 Western Avenue, from 1971 to 1976. The café was later moved to 1912 Pike Place. During this time, Starbucks stores sold just coffee beans and not drinks. In its first two years of operation, Starbucks purchased green coffee beans from Peet's Coffee & Tea. In 1973, Alfred Peet stopped supplying Starbucks and helped train their new Roastmaster, Jim Reynolds.\n\n1980s\nIn 1984, the original owners of Starbucks, led by Jerry Baldwin, purchased Peet's Coffee. By 1986, the company was operating six stores in Seattle and had begun to sell espresso coffee.\nIn 1987, the original owners sold the Starbucks chain to their former director of marketing Howard Schultz, who rebranded his Il Giornale coffee outlets as Starbucks and began to expand the company. Also in 1987, Starbucks opened its first locations outside of Seattle, in Waterfront Station in Vancouver, British Columbia, and in Chicago, Illinois.\nBy 1989, there were 46 Starbucks stores located across the Pacific Northwest and Midwest, and the company was roasting more than 2,000,000 pounds (907,185 kg) of coffee annually.\n\n1990s\nIn June 1992, at the time of its initial public offering, Starbucks (ticker symbol: SBUX) had 140 outlets, with revenue of US$73.5 million, up from US$1.3 million in 1987. The company's market value was US$271 million by this time. The 12% portion of the company that was sold raised around US$25 million for the company, which enabled it to double its number of stores over the next two years.\nIn 1994, Starbucks acquired The Coffee Connection, gaining the rights to use, make, market, and sell the \"Frappuccino\" beverage. The beverage was introduced under the Starbucks name in 1995.\nIn 1999, Starbucks experimented by opening eateries in the San Francisco Bay Area, under the Circadia restaurant brand. At the same time, Starbucks converted its Seattle Circadia restaurant into a Café Starbucks.\nIn 1999, Starbucks acquired Pasqua Coffee—a San Francisco-based retail coffee chain that had almost 60 locations in San Francisco, Los Angeles, and New York City.\n\n21st century\n2000s\nIn April 2003, Starbucks acquired Seattle's Best Coffee and Torrefazione Italia from AFC Enterprises for US$72 million. The deal only gained 150 stores for Starbucks, but according to the Seattle Post-Intelligencer, the wholesale business was more significant.\nBy June 2003, Starbucks Japan had 466 stores and would add another 70 to 75 in the 2003 financial year. Its president, Yuji Tsunoda said it would install ovens in all stores to improve its food offerings.\nFrom 2005 to 2007, Howard Behar served as the president of Starbucks North America.\nIn September 2006, rival Diedrich Coffee announced that it would sell most of its company-owned retail stores to Starbucks, including most locations of Oregon-based Coffee People, escalating regional coffee wars. Starbucks converted the Diedrich Coffee and Coffee People locations to Starbucks. The Coffee People locations at Portland International Airport were excluded from the sale.\nIn early 2008, Starbucks started a community website, My Starbucks Idea, designed to collect suggestions and feedback from customers. Other users could comment and vote on suggestions. Journalist Jack Schofield noted that \"My Starbucks seems to be all sweetness and light at the moment, which I don't think is possible without quite a lot of censorship.\"\nIn March 2008, Starbucks acquired Coffee Equipment Company, which was the manufacturer of the Clover Brewing System. It began testing the \"fresh-pressed\" coffee system at several Starbucks locations in Seattle, California, New York, and Boston.\nIn July 2008, during the Great Recession, Starbucks announced it was closing 600 underperforming company-owned stores and cutting U.S. expansion plans amid growing economic uncertainty. On July 29, 2008, Starbucks also cut almost 1,000 non-retail jobs as part of its bid to re-energize the brand and boost its profit. Of the new cuts, 550 of the positions were layoffs and the rest were unfilled jobs.\nAdditionally in July 2008, Starbucks announced that it would close 61 of its 84 stores in Australia in the following month. Nick Wailes, an expert in strategic management of the University of Sydney, said that \"Starbucks failed to truly understand Australia's café culture.\"\nIn January 2009, Starbucks announced the closure of an additional 300 underperforming stores and the elimination of 7,000 positions. CEO Howard Schultz also announced that he had received board approval to reduce his salary. Altogether, from February 2008 to January 2009, Starbucks terminated an estimated 18,400 U.S. jobs and began closing 977 stores worldwide.\nIn August 2009, Ahold announced closures and rebranding for 43 of its licensed store Starbucks kiosks for their US-based Stop & Shop and Giant supermarkets.\n\n2010s\nIn 2012, Starbucks had annual Frappuccino sales of over US$2 billion.\nIn August 2012, the largest Starbucks in the US opened at the University of Alabama's Ferguson Centre.\nOn June 25, 2013, Starbucks began to post calorie counts on menus for drinks and pastries in all of its U.S. stores.\nIn July 2013, more than 10% of in-store purchases were made on customers' mobile devices via the Starbucks app.\nThe company once again utilized the mobile platform when it launched the \"Tweet-a-Coffee\" promotion in October 2013. On this occasion, the promotion also involved Twitter and customers were able to purchase a US$5 gift card for a friend by entering both \"@tweetacoffee\" and the friend's handle in a tweet. Research firm Keyhole monitored the progress of the campaign; a December 2013 media article reported that 27,000 people had participated and US$180,000 of purchases had been made to date.\nIn January 2014, as part of a change in compact direction, Starbucks management transitioned from a singular brand worldwide to focusing on locally relevant design for each store.\nIn May 2014, Starbucks announced ongoing losses in the Australian market, which resulted in all remaining stores being sold to the Withers Group.\nIn July 2017, Starbucks acquired the remaining 50% stake in its Chinese venture from long-term joint venture partners Uni-President Enterprises Corporation (UPEC) and President Chain Store Corporation (PCSC) for US$1.3 billion.\nOn March 21, 2018, Starbucks announced that it was considering the use of blockchain technology to connect coffee drinkers with coffee farmers who could eventually be able to take advantage of new financial opportunities. The pilot program was planned to start with farmers in Costa Rica, Colombia, and Rwanda in order to develop a new way to track the bean-to-cup journey. In 2019, at the Microsoft Build conference, the coffee company formally announced its \"bean to cup\" program using the Microsoft's Azure-based blockchain service.\nTwo men were arrested in a Philadelphia Starbucks location after a manager claimed the two were trespassing on April 12, 2018. The arrests led to protests due to their apparently racially motivated nature. CEO Kevin Johnson later apologized for the incident, and the company declined to press charges. During the company's second quarter earnings call on April 26, Johnson indicated that the company had not seen a drop in sales as a result of the event and subsequent coverage. The company reiterated its guidance for full year earnings, and beat consensus expectations of 1.8 percent same-store sales growth, with 2 percent growth.\nJohnson announced that the company would close some 8000 locations on May 29 for a seminar about racial bias in order to prevent future events similar to those that occurred in Philadelphia.\nOn June 19, 2018, Starbucks announced the closing of 150 locations in 2019, three times the number the corporation typically closes in a single year. The closings were to happen in urban areas that already have dense clusters of stores.\nIn July 2019, Starbucks announced that it would no longer be selling newspapers in its cafés. It was also announced that kiosks for grab-and-go snacks and bags of whole-bean coffee would be removed from stores beginning in September 2019.\nIn November 2019, Starbucks opened its largest store ever on Michigan Avenue, Chicago, with 200 employees.\n\n2020s\nOn March 20, 2020, due to the COVID-19 pandemic, Starbucks closed all the café-only stores in the United States for two weeks. During that time, only drive-thru and delivery-only services were to function. According to the company representatives, all workers were to be paid for the next 30 days whether they went to work or stayed home. COVID-19 lockdowns caused Starbucks to suffer a general 10% sales decrease, and a 50% decrease in China where quarantine measures were especially strict.\nIn May 2020, the company asked for reduced rent from landlords due to the decrease in sales.\nIn June 2020, during the COVID-19 pandemic in the United States, the company announced that it would close 400 of its locations in the US/Canada region over the subsequent 18 months as it moves from the coffee house concept to what it calls \"convenience-led\" formats with drive-through and curbside pickup. Starbucks announced that it planned to open 300 stores that will primarily focus on carryout and pickup orders. The new stores will work with the Starbucks mobile app for prepayment by the customer before arrival to pick up the order. The layout of some stores will also be modified with a separate counter for picking up mobile orders.\nIn December 2020, Starbucks announced that it is planning to increase its store count to about 55,000 by 2030, up from roughly 33,000.\nBloomberg reported in July 2022 that the company was, through investment bank Houlihan Lokey, exploring selling its stores in the United Kingdom.\nIn August 2022, after months of suspension due to the Russian invasion of Ukraine, Starbucks sold all its stores in Russia to the Russian rapper Timati. The stores were rebranded as \"Stars Coffee\", and are very similar to the former stores. Starbucks said it had no comment on the new owner.\nOn October 1, 2022, Howard Schultz stepped down as CEO, with Laxman Narasimhan becoming Starbucks's next CEO.\nOn March 23, 2023, Narasimhan told employees that he would work a half-day behind a store counter each month, and he trained as a barista to immerse himself in the brand and stay close to customers.\nIn June 2023, Starbucks was ordered to pay $25 million in punitive damages and $600,000 compensatory damages to a former regional manager. The court found that Starbucks fired her in 2018 because she was white.\nIn December 2023, the operator of all of the Starbucks locations in Brazil, SouthRock Capital, declared itself bankrupt. SouthRock will continue to operate Starbucks locations normally while closing a few underperforming ones and will restructure through the bankruptcy procedure. SouthRock Capital later declared Chapter 15 bankruptcy in June 2024.\nOn August 13, 2024, Starbucks announced it was replacing then CEO Laxman Narasimhan with Brian Niccol. Niccol had served as the CEO of Chipotle since 2018.\nIn January 2025, Starbucks ended its 'open-door policy', and requires customers to make a purchase in order to use restrooms and the seating area.\nIn February 2025, Starbucks cut 30% of its menu in an effort to simplify its processes and reduce costs. The discontinued offerings were primarily less popular or more complex items, including some Frappuccino blended drinks, Royal English Breakfast Latte, and White Hot Chocolate.\nIn July 2025, Starbucks announced corporate office employees would have to return to working physically in the office four days per week, starting in October. For workers who would prefer to instead leave the company, Starbucks would offer a one-time voluntary exit program which would include a cash payment.\n\nAmerican unionization efforts\nThree of the company's stores in Buffalo, New York began an attempt to unionize in August 2021. Using Twitter, the workers announced they had formed an organizing committee, Starbucks Workers United, to form a union affiliated with Workers United. Two more stores joined the effort in September, however these petitions were later withdrawn to ensure a speedy process for the original three locations. During the union drive, the company sent other managers and executives, including its North America retail president, to Buffalo to engage with employees about operational issues and participate in their work. Employees were forced to attend captive audience meetings that contained anti-union messages. Starbucks temporarily closed some area stores for remodeling and added excessive staff to one of the stores preparing to vote. Workers said this reduced union support there, while Starbucks said the support was meant to compensate for increased sick leave during the pandemic as it had done elsewhere in the country. On November 9 Workers United filed three more petitions for elections to represent workers at additional Buffalo area stores. On November 10 the National Labor Relations Board mailed out votes for the elections at the original three locations. Votes for the original three stores were counted on December 9. Days before the vote count, the NLRB rejected arguments by Starbucks to halt the election.\nInspired by their colleagues in Buffalo, workers at a Starbucks store in Mesa, Arizona, petitioned the NLRB for a union election on November 18, 2021, to be represented by Workers United. The organizing at the Mesa location stemmed from, in part, a well-liked manager being terminated after whistle-blowing on Starbucks' anti-union plan.\nStarbucks temporarily closed two stores participating in the union drive in October for renovations. The company claimed these closures were unrelated to the unionization efforts. Starbucks began working with Littler Mendelson, a self-described \"union-busting firm\", in October. Starbucks requested that the National Labor Relations Board include all Buffalo Starbucks locations in the union vote, however, the NLRB rejected this argument and declared store by store elections. Finally, on December 9, 2021, the workers at the Elmwood Avenue store became the first unionized Starbucks workers at a Starbucks owned location in the United States with a 19–8 vote. The Camp Road location voted 12–8 not to be in the union. Starbucks does have unionized locations in other countries.\nOn December 13, workers at two Boston area locations petitioned the NLRB for union elections to be unionize with Workers United. The workers cited the win in Buffalo as inspiration for organizing. Workers in at least one location had most cards signed within a day.\nIn February 2022, Starbucks fired seven workers in Memphis who had led the unionization effort and temporarily closed the store.\nIn August 2022, the National Labor Relations Board accused the company of illegally discriminating against unionized workers by refusing them wage and benefit increases and requesting restitution. It also asked that the CEO at the time, Howard Schultz, or a board official read a notice about this purportedly unlawful move.\nAs of August 2022, unions were certified at 211 locations in the US.\nOn November 17, 2022, Starbucks’ annual Red Cup Day and one of the busiest days for employees, over 100 locations had employees go on strike. The workers were seeking higher staffing levels, better wages, and consistent schedules.\nMost unionization efforts are made through SBWU (Starbucks Workers United). There are over 9,000 American locations, but since the first unionized location in New York in 2021, less than 3% have voted to unionize. SBWU and Starbucks have yet to successfully negotiate a contract. Starbucks claims in a letter and on its website that the Workers United has delayed bargaining, has illegally broadcast bargaining sessions, refused to meet in person, and that Starbucks has reported more than 22 unfair labor practice charges to the NLRB (National Labor Relations Board). By March 2023, the NLRB found no merit in Starbucks's complaints and instead ruled that it was Starbucks who refused to bargain.\nOn June 23, 2023, Starbucks workers at unionized stores went on strike over the company's stance on in-store LGBT pride decorations.\n\nEconomic summary\nProducts\nCoffee cup sizes\nLow calorie and sugar-free products\nIn January 2008, Starbucks began a \"skinny\" line of drinks, offering lower-calorie and sugar-free versions of the company's offered drinks that use skim milk, and can be sweetened by a choice of natural sweeteners (such as raw sugar, agave syrup, or honey), artificial sweeteners (such as Sweet'N Low, Splenda, Equal), or one of the company's sugar-free syrup flavors.\n\nNon-dairy milk offerings\nIn 1997, Starbucks first offered non-dairy milk at its U.S. stores with the introduction of soy milk.\nIn 2007, Starbucks stopped using milk originating from rBGH-treated cows. The company also adopted a new dairy standard for all espresso-based drinks, switching from whole to 2% reduced fat milk.\nIn 2015, Starbucks began serving coconut milk. In 2016, it began serving almond milk. In January 2020, oat milk became available nationally. The company also offers non-dairy creamers at retail in partnership with Nestlé SA.\nCEO Kevin Johnson said in a 2020 interview that, milk substitutes will be a big part of reducing carbon emissions. That effort has prompted vegans, environmentalists, people with lactose intolerance and others to urge the company to eliminate the upcharge for drinks made with dairy-free milk. PETA encouraged sit-ins at Starbucks locations and purchased Starbucks stock to draw attention to what they believe is an unfair charge. A Starbucks Canada spokesperson told ET Canada that customizations such as added flavours, non-dairy beverages or an additional shot of espresso, will incur an additional charge.\nIn December 2020, Starbucks announced it will offer Oatly oat milk in all US stores starting in spring 2021.\nWith the launch of their holiday menu in November 2024, Starbucks ended the upcharge for non-dairy milk additions to drinks.\n\nEthos water\nEthos water, a brand of bottled water acquired by Starbucks in 2003, is sold at locations throughout North America. Ethos bottles feature prominent labeling stating \"helping children get clean water\", referring to the fact that US$0.05 from each US$1.80 bottle sold (US$0.10 per bottle in Canada) is used to fund clean water projects in underdeveloped areas. Although sales of Ethos water have raised over US$6.2 million for clean water efforts, the brand is not incorporated as a charity. Critics have argued that the claim on the label misleads consumers into thinking that Ethos is primarily a charitable organization when it is actually a for-profit brand and only 5 cents per bottle supports clean-water projects.\nThe founders of Ethos have stated that the brand is intended to raise awareness of third-world clean water issues and provide socially responsible consumers with an opportunity to support the cause by choosing Ethos over other brands. Starbucks has since redesigned the American version of the Ethos water bottles, stating the amount of money donated per bottle in the description.\n\nInstant coffee\nIn March 2009, Starbucks introduced a line of instant coffee packets, called VIA \"Ready Brew\". It was first unveiled in New York City with subsequent testing of the product also in Seattle, Chicago, and London. The first two VIA flavors include Italian Roast and Colombia, which were then rolled out in October 2009, across the U.S. and Canada with Starbucks stores promoting the product with a blind \"taste challenge\" of the instant versus fresh roast, in which many people could not tell the difference between the instant and freshly brewed coffee. Financial analysts speculated that by introducing instant coffee, Starbucks would devalue its own brand.\n\nCoffee makers and single-use capsules\nIn September 2012, Starbucks announced plans to introduce the Verismo, a consumer-grade single-serve coffee machine that uses sealed plastic cups of coffee grounds, and a \"milk pod\" for lattes.\nIn November 2012, Starbucks Verismo became publicly available, consisting of a line of coffee makers that brew espresso and regular chocolate from coffee capsules, a type of pre-apportioned single-use container of ground coffee and flavourings utilizing the K-Fee pod system.\n\nIn a brief review of the 580 model, Consumer Reports described the results of a comparative test of the Verismo 580 against two competitive brands: Because you have to conduct a rinse cycle between each cup, the Verismo wasn't among the most convenient of single-serve machines in our coffeemaker tests. Other machines we've tested have more flexibility in adjusting brew-strength—the Verismo has buttons for coffee, espresso, and latte with no strength variation for any type. And since Starbucks has limited its coffee selection to its own brand, there are only eight varieties so far plus a milk pod for the latte.\nAs of December 31, 2020, Starbucks has discontinued producing their own K-Fee pods for Verismo machines, however, third-party companies continue to produce coffee pods for K-Fee machines, of which the Starbucks Verismo is compatible.\n\nAlcoholic drinks\nIn 2010, Starbucks began selling alcoholic beverages at some stores in the United States. In August 2014, Starbucks opened its first store in Williamsburg, Brooklyn which by then was among 30 locations serving beer and wine.\nIn 2016, three locations within Toronto, Ontario also announced they were going to serve alcohol, including up-scale appetizers like bacon-wrapped dates and truffle mac and cheese.\nStarbucks ensures that the selected locations that serve alcohol are able to accommodate the community, as well as have the space for extra seating and storage.\n\nFruit juices, fruit beverages, and sodas\nOn November 10, 2011, Starbucks acquired juice company Evolution Fresh for US$30 million in cash and planned to start a chain of juice bars starting in around the middle of 2012, venturing into territory staked out by Jamba Inc. Its first store released in San Bernardino, California and plans for a store in San Francisco were to be launched in early 2013.\nIn March 2012, Starbucks began selling a line of iced Starbucks Refresher beverages that contain a green coffee extract. The beverages are fruit flavored and contain caffeine but advertised as having no coffee flavor. Starbucks's green coffee extraction process involves soaking the beans in water.\nIn June 2014, Starbucks began trialing its own line of carbonated sodas, dubbed \"Fizzio\". The drinks required a special machine to make.\n\nFunctional beverages\nIn January 2022, Starbucks launched a line of canned energy drinks, called \"Baya\". The drink contains caffeine from the coffee fruit.\nIn June 2024, Starbucks introduced Iced Energy, a fruit-flavored energy drink, at its US locations. A canned version was introduced in March 2025.\nIn June 2025, Starbucks began testing a protein-infused foam topping.\n\nSeasonal cups\nEach year between November–January, Starbucks releases new holiday merchandise, including new paper cups with various festive designs.\n\nBarrel-aged coffee\nIn March 2017, Starbucks announced the launch of two new limited-edition specialty drinks made from beans aged in whiskey barrels at its Seattle roastery. Starbucks's barrel-aged coffee will be sold with a small batch of unroasted Starbucks Reserve Sulawesi beans, which are then hand-scooped into whiskey barrels from Washington state.\n\nOleato coffee\nIn February 2023, Starbucks announced it would introduce a line of coffee drinks made with extra virgin olive oil, including lattes, shaken espresso, and cold brews. This would not be a limited-time offering, but rather \"'one of the biggest launches we’ve had in decades,'\" according to Brady Brewer, the company's chief marketing officer. The goal was to create a new category of beverage. Unlike other drinks, this came about because of the habits of then-CEO Howard Schultz, who was introduced to consuming a teaspoon of olive oil each day by an olive oil producer he met in Sicily. The drinks were initially available in Italy and later expanded to stores in Southern California in spring 2023 and then the UK, Middle East, and Japan later the same year. After its launch, CNN reported some customers reported digestive distress after drinking the beverages.\nIn January 2024, the company said it would introduce the beverages nationwide in the US as well as in Canada, France, and China. The Oleato beverages were permanently discontinued in November 2024.\n\nStarbucks card and loyalty program\nIn May 2008, a loyalty program was introduced for registered users of the Starbucks Card (previously simply a gift card) offering perks such as free Wi-Fi Internet access, no charge for soy milk and flavored syrups, and free refills on brewed drip coffee, iced coffee, or tea. Each time a customer purchases a drink, they will earn stars if they present their rewards card or scan their card from the mobile app. Eventually, these stars accumulate to allow customers to redeem for perks such as free drinks, free add-ins, free bakery items or selected merchandise.\nIn 2009, Starbucks began beta testing its mobile app for the Starbucks card, a stored value system in which consumers access pre-paid funds to purchase products at Starbucks. Starbucks released its complete mobile platform in January 2011. By December 2011, the number of mobile transactions exceeded 26 million.\n\nElectricity and Wi-Fi\nIn August 2002, Starbucks provided free Wi-Fi in the United Kingdom, although in the past, a Starbucks rewards card was required.\nOn July 1, 2010, Starbucks offered free Wi-Fi in all of its stores in the U.S. and Canada. \nIn August 2010, Starbucks began offering free Wi-Fi in Germany via BT Openzone.\nIn October 2012, Starbucks and Duracell Powermat announced a pilot program to install Powermat charging surfaces in the tabletops in selected Starbucks stores in the Boston area. Furthermore, Starbucks announced its support in the Power Matters Alliance (PMA) and its membership in the PMA board, along with Google and AT&T, in an effort to create \"a real-world ecosystem of wireless power\" through a universal wireless charging standard that customers could use to recharge smartphones.\nIn 2013, it switched providers in the U.S. from AT&T to Google.\nIn August 2016, startup company FluxPort introduced Qi inductive charging pads at select locations in Germany.\n\nLocations\nThe company's headquarters is the Starbucks Center in Seattle, Washington, United States, where 3,501 people worked as of January 2015. The main building in the Starbucks complex in SODO was previously a Sears mail order distribution center until 1987.\n\nIn addition to drinks and food, many stores carry Starbucks' official merchandise, such as mugs, tumblers, scoops, and coffee presses. There are also several select \"Starbucks Evenings\" locations that offer beer, wine, and appetizers. Starbucks-brand coffee, ice cream, and bottled cold coffee drinks are sold at grocery stores in the United States and other countries. In 2010, the company began its Starbucks Reserve program for single-origin coffees and high-end coffee shops. It planned to open 1,000 Reserve coffee shops by the end of 2017. However, since succeeding Schultz, Johnson has scaled back the Reserve coffee shops to only six to ten shops. Further development on Reserve coffee shops will be dependent on the success of the few already in existence. Currently, Starbucks operates six coffee roasteries with tasting rooms and 43 coffee bars as part of the program.\nAs of February 2023, Starbucks had 36,171 locations open across 83 countries, with 61% of the locations operating in the U.S. and China, and the rest operating elsewhere. In February 2024, the chain unveiled a new store design aimed at improving accessibility. The first location to use this design is the Washington, D.C. Union Market store. The company plans for all future company-owned stores to adopt a similar design.\n\nInternational expansion\nEurope\nIn 1998, Starbucks entered the United Kingdom market with the US$83 million acquisition of the then 56-outlet, UK-based Seattle Coffee Company, re-branding all those stores as Starbucks.\nIn October 2002, Starbucks established a coffee trading company in Lausanne, Switzerland, to handle purchases of green coffee. All other coffee-related business continued to be managed from Seattle. In September 2007, the company opened its first store in Russia, ten years after first registering a trademark there. After the Russian invasion of Ukraine, on May 21, 2022, Starbucks announced closure of all outlets in Russia, and in July it was revealed that a local restaurant manager, Anton Pinsky, is going to acquire Starbucks' Russian operating company OOO Starbucks and all its 130 stores. In 2008, Starbucks opened in Belgium, Bulgaria, the Czech Republic, and Portugal.\n\nIn April 2009, Starbucks opened in Poland. In February 2010, Starbucks opened in Arlanda Airport outside Stockholm, its first location in Sweden. In June 2010, Starbucks opened its first store in Budapest, Hungary. In February 2011, Starbucks started selling its coffee in Norway by supplying Norwegian food shops with their roasts. The first Starbucks-branded Norwegian shop opened in February 2012, at Oslo Airport, Gardermoen.\n\nIn May 2012, Starbucks opened its first coffeehouse in Finland, with the location being Helsinki-Vantaa Airport in Vantaa. In August 2013, the first Starbucks inside Dansk Supermarked opened in the department stores Salling in Aalborg and Aarhus in Denmark. In April 2014, Starbucks announced a store in Azerbaijan, in the Port Baku Mall. In November 2014, Starbucks announced its first Channel Island store, in the primary business area of St Peter Port in Guernsey.\nOn April 21, 2015, Kesko, the second largest retailer in Finland, announced its partnership with Starbucks, with stores opened next to K-Citymarket hypermarkets. As of June 2017, three stores had been opened next to K-Citymarkets: In Sello in Espoo and in Myyrmanni and Jumbo in Vantaa.\nIn February 2016, Howard Schultz announced the opening of stores in Italy. The first Italian Starbucks store was inaugurated in Milan on September 6, 2018, at which point Starbucks already had locations in 78 countries. In May 2016, the first Starbucks store in Slovakia opened in Aupark, in Bratislava. In June 2018, Starbucks announced the opening of stores in Serbia. The first store was opened in April 2019 at Rajiceva Mall. On June 1, 2019, Starbucks opened its first coffee store in Valletta, Malta, the 80th country to have a Starbucks outlet. In July 2025, Starbucks opened its first store in Iceland.\n\nAsia\nIn July 1996, the first Starbucks location opened outside of North America: a store in Tokyo, Japan. Its 300th store opened in October 2001.\nStarbucks in Japan is described by Bloomberg as appealing to \"New Japan\" with its patrons being women in their 20s and 30s who prefer premium coffee and \"trendy, no-smoking environment\".\nOn December 4, 1997, the Philippines became the third market to open outside of North America.\nThe first Starbucks store in Malaysia opened in December 1998.\nThe first Starbucks store in Thailand opened in 1998 at Central Chidlom Department Store. The first drive-thru store opened in 2022 at Porto Chino community mall on Rama II Road.\nIn 2000, Starbucks opened its location in the Forbidden City in Beijing, however, in July 2007, this location was closed after years of controversy since its opening in 2000 with protesters objecting that the presence of the American chain in this location \"was trampling on Chinese culture\".\n\nBetween 2001 and 2003, Starbucks opened six (of 80 planned) locations in Israel and having struggled with fierce local competition, Starbucks, along with its partner Delek, however, in April 2003, after losing US$6 million Starbucks Israel closed all six of its locations in Israel, citing \"on-going operational challenges\" and a \"difficult business environment\".\nIn January 2011, Starbucks and Tata Coffee, Asia's largest coffee plantation company, announced plans for a strategic alliance to bring Starbucks to India and also to source and roast coffee beans at Tata Coffee's Kodagu facility.\nIn January 2011, Starbucks introduced its largest cup size, the Trenta, which can hold 31 US fluid ounces (920 ml).\nIn October 2011, Starbucks opened another location in Beijing, China, at the Beijing Capital International Airport's Terminal 3, international departures hall; making the company's 500th store in China. The store is the seventh location at the airport.\nIn January 2012, despite a false start in 2007, Starbucks created a 50:50 joint venture with Tata Global Beverages called Tata Starbucks. Tata Starbucks owned and operated Starbucks outlets in India as Starbucks Coffee \"A Tata Alliance\". Starbucks opened its first store in India in Mumbai on October 19, 2012.\nOn February 1, 2013, Starbucks opened its first store in Ho Chi Minh City, Vietnam, and its first location in Hanoi in July 2014.\n\nIn May 2014, the Starbucks operations in South Korea launched a mobile ordering system named Siren Order, accessible through a local version of the Starbucks smartphone application. In December 2014, Starbucks launched a similar system named Mobile Order & Pay, in Portland, Oregon. The expanded nationwide in 2015, and in late March 2018, the company opened the system, previously available to Starbucks Rewards members only, to all customers.\nIn September 2014, Starbucks announced the acquisition of the remaining 60.5% stake in Starbucks Coffee Japan that it did not already own, for US$913.5 million.\nIn August 2015, Starbucks announced plans to open in Phnom Penh, Cambodia, its 16th market in the China/Asia Pacific region by the end of 2015.\nOn December 18, 2015, Starbucks opened in Almaty, Kazakhstan. On the next day, one more coffee shop was opened.\nIn December 2017, the Starbucks Reserve Roastery opened at HKRI Taikoo Hui in Shanghai, China, the only such location of its kind outside of Seattle.\nIn November 2020, Starbucks announced that it plans to open an outlet in Laos.\n\nAmericas\nIn September 2002, Starbucks opened its first store in Latin America, in Mexico City. By 2016, there were more than 500 locations in Mexico.\nIn August 2003, Starbucks opened its first store in South America in Lima, Peru.\nIn 2008, Starbucks opened in Argentina and Brazil.\nIn November 2010, the company opened the first Central American store in El Salvador's capital, San Salvador.\nIn June 2012, Starbucks opened a store in San Jose, Costa Rica. In October 2012, Starbucks announced plans to open 1,000 stores in the United States in the next five years.\nIn August 2013, Starbucks's CEO Howard Schultz personally announced the opening of Starbucks stores in Colombia. The first café was set to open in 2014 in Bogotá and add 50 more stores throughout Colombia's main cities in a 5-year limit. Schultz also stated that Starbucks will work with both the Colombian Government and USAID to continue \"empowering local coffee growers and sharing the value, heritage and tradition of its coffee with the world\". Starbucks noted that the aggressive expansion into Colombia was a joint venture with Starbucks's Latin partners, Alsea and Colombia's Grupo Nutresa that has previously worked with Starbucks by providing coffee through Colcafe. This announcement came after Starbucks's Farmer Support Center was established in Manizales, Colombia, the previous year making Colombia an already established country by the corporation.\nIn late August 2013, Starbucks announced its first store in Colombia at a press conference in Bogotá, where the company's CEO explained, \"Starbucks has always admired and respected Colombia's distinguished coffee tradition.\"\nIn May 2014, Starbucks announced its first café in Bolivia would open in 2014 in Santa Cruz de la Sierra and the first in Panama in 2015.\nIn January 2016, Starbucks announced that it would launch operation in Trinidad and Tobago. On August 29, 2016, Starbucks opened its first store at South Park Mall in San Fernando.\nIn November 2017, Starbucks commenced operations in Jamaica, where the first store opened in the resort city of Montego Bay on the shores of the Doctor's Cave Beach Club, offering views of the Caribbean Sea. The company also reaffirmed its commitment to working with local coffee farmers to \"implement systems to increase productivity and yields, while also increasing compliance to international standards\". Starbucks Jamaica opened its first store on November 21, 2017, with plans to open 15 locations island-wide over a 5-year period. Starbucks Jamaica opened stores at the Sangster International Airport in Montego Bay and at the Falmouth Pier, in Falmouth, Jamaica. Starbucks Jamaica announced plans to open up to six stores in Kingston, Jamaica, by 2019. The first of the Kingston stores opened on June 21, 2018. The second store is in Kingston's central business district, New Kingston. Starbucks opened its first in-store location in the flagship location for Jamaica's largest Pharmacy chain, Fontana Pharmacy, also located in Kingston; making it Starbucks's third location.\n\nOn April 11, 2018, Starbucks began operations in Uruguay, with a location in the Montevideo Shopping mall. The company announced that it planned to open up approximately 12 cafes in the country.\nIn August 2019, a franchised location opened in the Cayman Islands.\nIn October 2019, a franchised location opened in the Turks and Caicos Islands.\nOn April 25, 2023, Starbucks commenced operations in Guyana.\nOn April 29, 2024, Starbucks announced its official entry to Ecuador and Honduras in mid-year and late 2024, respectively.\nOn August 14, 2024, Starbucks commenced operations in Ecuador, with its first location in the country at Scala Shopping Mall in Quito. The company announced the plans of opening four more cafes in the capital city until the end of 2025.\n\nOceania\nAustralia\nIn July 2000, the first location in Australia opened in Sydney. After a massive downturn in 2008, the remaining Australian Starbucks stores were sold to the Withers family in 2014, with the company planning a more restrained expansion.\nAs of November 2022, there are 59 Starbucks stores in Australia; 23 in New South Wales, 19 in Queensland and 18 in Victoria. These stores are spread out across Sydney, Melbourne, Brisbane, the Gold Coast, the Sunshine Coast and Ballarat. Before the mass-closure of 61 of their 85 stores in 2008, there were also stores in Adelaide, Canberra, Hobart and Wollongong. However, there are plans to open a restaurant in Toowoomba while the first store in Perth, Western Australia opened on October 23, 2024, with another 11 planned to open by the end of 2025.\n\nNew Zealand\nStarbucks operates several locations in New Zealand.\n\nAfrica\nIn May 2010, Southern Sun Hotels South Africa signed an agreement with Starbucks to brew Starbucks coffees in select Southern Sun and Tsonga Sun hotels in South Africa. The agreement was partially reached so Starbucks coffees could be served in the country in time for the 2010 FIFA World Cup hosted by South Africa.\n\nIn April 2016, after TASTE Holdings acquired outlet licensing for South African stores, Starbucks opened its first stores in South Africa in Rosebank, Gauteng, Johannesburg and the Mall of Africa.\n\nAt sea\nIn December 2010, Starbucks debuted their first-ever Starbucks at sea. In partnership with Royal Caribbean International, Starbucks opened a shop aboard the Allure of the Seas, Royal Caribbean's second-largest ship and the second-largest ship in the world.\n\nLicensed and franchise operations\nStores that independently operate locations include Ahold Delhaize, Barnes & Noble, Target Corporation, Albertsons and, more recently, Publix stores. In the EMEA (Europe, Middle East, and Africa) markets, Starbucks operates a franchising program. Different from the licensing program in which existing corporations may apply to operate a Starbucks kiosk within an existing store, franchises can enable new, freestanding stores.\n\nAutomation\nStarbucks has automation systems in some areas. These machines have 280 possible drink combinations to choose from. They have touchscreens, and customers can play games while they wait for their order.\nVending machines are said to possibly be able to replace baristas. Starbucks has said it does not want to replace baristas with robots, but use them as a complementary tool.\n\nUnbranded stores\nIn 2009, at least three stores in Seattle were de-branded to remove the logo and brand name, and remodel the stores as local coffee houses \"inspired by Starbucks\". CEO Howard Schultz called the unbranded stores a \"laboratory for Starbucks\". The first, 15th Avenue Coffee and Tea, opened in July 2009 on Capitol Hill. It served wine and beer and hosted live music and poetry readings. It has since been remodeled and reopened as a Starbucks-branded store. Another is Roy Street Coffee and Tea at 700 Broadway E., also on Capitol Hill. Although the stores have been called \"stealth Starbucks\" and criticized as \"local-washing\", Schultz says that \"It wasn't so much that we were trying to hide the brand, but trying to do things in those stores that we did not feel were appropriate for Starbucks.\"\n\nTeavana\nStarbucks entered the tea business in 1999 when it acquired the Tazo brand for US$8,100,000. In December 2012, Starbucks paid US$620 million to buy Teavana.\n\n Starbucks did not market Teavana products in its stores, though the acquisition allowed the expansion of Teavana beyond shopping malls. In January 2015, Starbucks began to roll out Teavana teas into Starbucks stores, both in to-go beverage and retail formats. In November 2017, Starbucks sold Tazo to Unilever for $384 million. Starbucks shut down Teavana in early 2018.\n\nCorporate governance and identity\nHoward Schultz was the CEO of Starbucks from 1986 to 2000. He was succeeded by Orin Smith, who ran the company for five years and positioned Starbucks as a large player in fair trade coffee (fair trade later being overturned during Kevin Johnson's leadership in 2022), increasing sales to US$5 billion. Jim Donald was CEO from 2005 to 2008, orchestrating a large-scale earnings expansion. Schultz returned as CEO during the 2008 financial crisis and spent the succeeding decade growing the company's market share, expanding its offerings, and reorienting the brand around corporate social responsibility. \nKevin Johnson, who was president and chief operating officer from 2015 to 2018, succeeded Schultz as CEO in 2017. Myron E. Ullman became chairman of the firm in June 2018. Both Johnson and Ullman succeeded Howard Schultz, who served in both capacities from 2008 to 2017. Since 2018, Schultz has served as the firm's first Chairman emeritus.\nIn March 2022, Starbucks announced that Schultz would return as CEO in April 2022 in an interim role. Later that September, Laxman Narasimhan was appointed to succeed him in April 2023, with Schultz remaining a member of the board of directors. Narasimhan assumed the position sooner than planned, in March 2023. In August 2024, he was ousted and replaced with Brian Niccol, who became the chain's CEO on September 9 after leaving his position as Chipotle's CEO. Niccol received a starting salary of $1.6 million a year and a $10 million starting bonus.\nAnalysts have long believed that the firm's corporate governance must determine how to contend with higher materials prices and enhanced competition from lower-priced fast-food chains, including McDonald's and Dunkin' Donuts. In October 2015, Starbucks hired its first chief technology officer, Gerri Martin-Flickinger, to lead its technology team. Starbucks maintains control of production processes by communicating with farmers to secure beans, roasting its own beans, and managing distribution to all retail locations. Additionally, Starbucks's Coffee and Farmer Equity Practices require suppliers to inform Starbucks what portion of wholesale prices paid reaches farmers. Shortly after becoming CEO, Niccol announced a new 'Back to Starbucks' strategy to win back customers. The plan including simplifying the menu and reversing rules for its cafes in North America that had allowed people to use their facilities even if they had not bought anything.\n\nOwnership\nStarbucks is mainly owned by institutional investors, who hold around 75% of all shares. The 10 largest shareholder of Starbucks in December 2023 were:\n\nThe Vanguard Group (9.53%)\nBlackRock (6.96%)\nState Street Corporation (4.09%)\nGeode Capital Management (2.02%)\nMorgan Stanley (2.00%)\nBank of America (1.75%)\nNorthern Trust (1.30%)\nRoyal Bank of Canada (1.27%)\nJPMorgan Chase (1.21%)\nNorges Bank (1.14%)\n\nBoard of directors\nAs of November 2025:\n\nBrian Niccol, chair and CEO of Starbucks\nRichard Allison, former CEO of Domino's Pizza\nAndrew Campion, COO of Nike, Inc.\nBeth Ford, CEO of Land O'Lakes\nJørgen Vig Knudstorp, executive chairman of LEGO Group\nMarissa Mayer, former president and CEO of Yahoo!\nNeal Mohan, CEO of YouTube\nDambisa Moyo, Co-principal of Versaca Investments\nDaniel Servitje, CEO of Grupo Bimbo\nMike Sievert, former CEO of T-Mobile US\nWei Zhang, former President of Alibaba Pictures Group\nHoward Schultz, president and former CEO of Starbucks\n\nLogo\nIn 2006, Valerie O'Neil, a Starbucks spokeswoman, said that the logo is an image of a \"twin-tailed mermaid, or siren as she's known in Greek mythology\". The logo has been significantly streamlined over the years. In the first version, the Starbucks siren was topless and had a fully visible double fish tail. The image was said by Starbucks to be based on a 16th-century \"Norse\" woodcut, although other scholars note that it is apparently based on a 15th-century woodcut in Juan Eduardo Cirlot's Dictionary of Symbols. Some scholars have identified the image as Melusine. The connection to Melusine has been questioned; Melusine was not linked to heraldic images of two-tailed mermaids until the late 19th century, making it possibly a late misidentification. In the second logo, which was used from 1987 to 1992, the siren's breasts were covered by her flowing hair, but her navel was still visible. The fish tail was cropped slightly, and the primary color was changed from brown to green, a nod to the Alma Mater of the three founders, the University of San Francisco. In the third version, used between 1992 and 2011, her navel and breasts are not visible at all, and only vestiges remain of the fish tails. The original \"woodcut\" logo has been moved to the Starbucks's Headquarters in Seattle.\nAt the beginning of September 2006, and then again in early 2008, Starbucks temporarily reintroduced its original brown logo on paper hot-drink cups. Starbucks has stated that this was done to show the company's heritage from the Pacific Northwest and to celebrate 35 years of business. The vintage logo sparked some controversy due in part to the siren's bare breasts, but the temporary switch garnered little attention from the media. Starbucks had drawn similar criticism when it reintroduced the vintage logo in 2006. The logo was altered when Starbucks entered the Saudi Arabian market in 2000 to remove the siren, leaving only her crown, as reported in a Pulitzer Prize-winning column by Colbert I. King in The Washington Post in 2002. The company announced three months later that it would be using the international logo in Saudi Arabia. In January 2011, Starbucks announced that it would make small changes to the company's logo, removing the Starbucks wordmark around the siren, enlarging the siren image, and making it green.\n\nEnvironmental and social policies\nEnvironmental practices\nIn 1999, Starbucks started the \"Grounds for your Garden\" program. This gives leftover coffee grounds to anyone requesting it for composting. The goal of the program was to make the company environmentally friendlier. Although not all stores and regions participate, customers can request and lobby their local store to begin the practice.\nIn October 2008, The Guardian newspaper reported that Starbucks was wasting 6.2 million U.S. gallons (23.4 million liters) of water a day by leaving a tap constantly running for rinsing utensils in a 'dipper well' in each of its stores, but this is often required by governmental food safety codes.\nIn June 2009, in response to concerns over its excessive water consumption, Starbucks re-evaluated its use of the dipper well system. In September 2009, company-operated Starbucks stores in Canada and the United States successfully implemented a new water saving solution that meets government health standards. Different types of milk are given a dedicated spoon that remains in the pitcher and the dipper wells were replaced with push button metered faucets for rinsing. This will reportedly save up to 150 U.S. gallons (570 liters) of water per day in every store.\nIn January 2020, Starbucks shared its new environmental sustainability commitment to become a resource positive company. It announced three preliminary targets: By 2030, Starbucks will aim to reduce its carbon emissions, waste output, and water impact by 50%. It also identified five areas of focus: expanding plant-based menu options; shifting to reusable packaging; investing in regenerative agriculture, reforestation, forest conservation and water replenishment; better ways to manage waste; and more eco-friendly stores, operations, manufacturing, and delivery.\n\nRecycling\nStarbucks began using 10% recycled paper in its beverage cups in 2006—the company claimed that the initiative was the first time that recycled material had been used in a product that came into direct contact with a food or beverage. Allen Hershkowitz of the Natural Resources Defense Council called the 10% content \"minuscule\", but Starbucks received the National Recycling Coalition Recycling Works Award in 2005 for the initiative. In a 2008 media article, Starbucks's vice president of corporate social responsibility acknowledged that the company continued to struggle with environmental responsibility, as none of its cups were recyclable and stores did not have recycling bins. At the time that the article was published, Starbucks gave customers who brought in their own reusable cup a 10-cent discount, in addition to using corrugated cup sleeves made from 85% post-consumer recycled fiber, which is 34% less paper than the original. During the same period, Starbucks entered into a partnership with Conservation International—pledging US$7.5 million over three years—to help protect the natural environment of coffee-growing communities in Mexico and Indonesia.\n\nPhase out of single-use plastic straws\nOn July 9, 2018, Starbucks President and CEO Kevin Johnson announced that Starbucks will phase out the single-use plastic straws by January 1, 2020, on all cold drinks from all locations worldwide due to climate change concerns, pollution, and sea turtle endangerment as the single-use plastic straws failed to be designed for recycling when they were invented. Frappucinos will get straws made from a different material that is sustainable and environmentally friendly such as paper or compostable plastic, while other cold drinks will get straw-less lids. These new modified lids contain 9% less plastic than Starbucks' previous flat lid. The Starbucks locations in Europe, China, Taiwan, Japan, Thailand, Vietnam, India, Canada, Hawaii, Alaska, Washington D.C., New Mexico, California, New York, Washington State, New Jersey, Oregon, Maryland, Delaware, Vermont, Massachusetts, Connecticut, and Rhode Island already eliminated single-use plastic straws by the end of 2018. South Korea is the first country to introduce paper straws to all stores among 78 countries in the world that Starbucks has entered.\n\nReusable cups\nStarbucks has publicly committed to reducing waste by 50% by 2030. After successfully completing the campaign to provide the Reusable Cup in Vietnam in 2020, it held the same event in Korea in 2021. Along with a picture of throwing away a cleanly washed recycled PET bottle on Instagram, a hashtag designated by Starbucks was written and uploaded, and a reusable cup was provided instead of a disposable cup.\nIn April 2013, Starbucks introduced reusable cups where customers would be able to bring their cup into any location and receive a small discount on their drink. When the COVID-19 pandemic first began in 2019, the company halted the use of personal cups due to concerns with the transferring of germs. In June 2021, the company reintroduced personal reusable cups with a contactless new method to eliminate shared touch points between customers and baristas.\nStarbucks is phasing out disposable cups in Korea entirely by 2025.\n\nFarmer equity practices\nStarbucks began drafting plans for corporate social responsibility in 1994. Since Starbucks has partnered with Conservation International (CI) to draft plans and audit its coffee and farmer equity (C.A.F.E.) program, Starbucks's C.A.F.E. practices are based on a rating system of 249 indicators. Farmers who earn high overall scores receive higher prices than those who achieve lower scores. Ratings categories include economic accountability, social responsibility, environmental leadership in coffee growing and processing. Indicators for social responsibility have evolved and now include 'zero tolerance' indicators that require workers to be paid in cash, check, or direct deposit, ensure that all workers are paid the established minimum wage, that workplaces are free of harassment and abuse, that workplaces are nondiscriminatory and do not employ persons under the age of 14, and several more. Starbucks has moved 90% of its coffee purchases to preferred C.A.F.E. certified providers, and the company is approaching its stated goal to purchase 100% of its coffee through C.A.F.E. or other 'ethically sourced' certification systems.\nWashington State University Assistant Professor Daniel Jaffee argues that Starbucks's C.A.F.E. practices merely 'green wash' \"to burnish their corporate image\". Additionally, Professor Marie-Christine Renard of Rural Sociology of Chapingo University in Mexico wrote a case study of Starbucks's, Conservation International's, and Agro-industries United of Mexico (AMSA)'s joint conservation effort in Chiapas, Mexico in which she concluded that \"[w]hile the CI-Starbucks-AMSA Alliance paid better prices, it did not allow the producers to appropriate the knowledge that was necessary for the organizations to improve the quality of their coffee\".\n\nFair trade\nIn 2000, the company introduced a line of fair trade products. Of the approximately 300 million pounds (136 million kilograms) of coffee Starbucks purchased in 2006, about 18 million pounds (8.2 million kilograms) or 6% was certified as fair trade. Groups such as Global Exchange called for Starbucks to further increase its sales of fair trade coffees. \nAfter a long-running dispute between Starbucks and Ethiopia, Starbucks agreed to support and promote Ethiopian coffees. An article in BBC News, states that Ethiopian ownership of popular coffee designations such as Harrar and Sidamo is acknowledged, even if they are not registered. Ethiopia fought hard for this acknowledgement mainly to help give its poverty-stricken farmers a chance to make more money. In 2006, Starbucks said it paid $1.42 per pound ($3.1/kg) for its coffee, more than 33% higher than the commodity price at the time. However, the coffee Starbucks bought for $1.42 per pound ($3.1/kg), had a selling price—after transportation, processing, marketing, store rentals, taxes, and staff salary and benefits—of $10.99 per pound ($24.2/kg). As of 2013, the Starbucks website sells only one Ethiopian coffee. In addition, Starbucks is an active member of the World Cocoa Foundation, although targets set in 2005, 2008 and 2010 to reduce child labor that the Foundation has backed have consistently not been met.\nIn 2019, the non-profit labor justice organization Fair World Project released an article outling how despite Starbucks had passed coffee producers as slave free in their Brazil production units using their internal C.A.F.E. certification standards, that Brazilian labor inspectors had proof of child slave labor practices being present in their supply chain. In 2022 Starbucks announced that they were going to stop certifying their coffee beans as fairtrade, in favor of their own in-house investigations.\n\nFood bank donations\nSince 2010, Starbucks has been donating leftover pastries in the United States to local food banks through a food collection service named Food Donation Connection. In March 2016, Starbucks unveiled a five-year plan to donate 100 percent of unsold food from its 7,600 company-operated stores in the U.S. to local food banks and pantries. Perishable food will be transported in refrigerated trucks to area food banks through the company's partnerships with the Food Donation Connection and Feeding America. This program, called FoodShare, is expected to provide up to 50 million meals over the next five years. As of 2017, the program was in 10 different markets, including New York City. In New York, Starbucks works with Feeding America and City Harvest, both non-profits, to donate food from 45 locations. It plans to expand the program to all 305 Manhattan stores. In September 2019, 60% of Starbucks stores are participating in FoodShare. This level of participation contributed to 20 million meals served to those in need.\n\nCage-free eggs\nIn 2008, Starbucks announced a comprehensive new animal welfare policy banning many inhumane farming practices, including the caging of hens. In 2009, they established a buying preference in North America to use industry best practices for animal husbandry and processing, including egg production.\nIn 2015, Starbucks made a public announcement that they will switch to 100% cage-free eggs by 2020. However, later, the company altered its commitment to just company-owned locations, excluding around 40% of its licensed restaurants.\nIn 2018, Starbucks committed to reaching the goal of using 100% cage-free eggs and egg products in company-operated stores globally by 2020, including Starbucks branded products and those supplied to licensed partners in the North America. They stated their goal to be for all their products to meet high quality and ethical standards, with a commitment to social responsibility standards with animal welfare as a primary focus.\nOrganizations such as World Animal Protection and Compassion in World Farming have stated that Starbucks has not shown any demonstrable improvement in animal welfare since 2012. According to the Humane Society of the United States, Starbucks no longer qualifies as having an actual cage-free commitment.\n\nIn popular culture\nHear Music\nHear Music began as a music catalog company in 1990, adding a few retail locations in the San Francisco Bay Area. Hear Music was purchased by Starbucks in 1999. In 2002, it produced a Starbucks opera album, featuring artists such as Luciano Pavarotti, followed in March 2007 by the hit CD Memory Almost Full by Paul McCartney, making McCartney the first artist signed to the new Hear Music label sold in Starbucks outlets. In 2006, the company created Starbucks Entertainment, one of the producers of the 2006 film Akeelah and the Bee. Starbucks stores advertised the film before its release and sold the DVD.\nStarbucks has become the subject of a protest song, \"A Rock Star Bucks a Coffee Shop\" by Neil Young and his band, Promise of the Real. This single from the album The Monsanto Years criticized both Starbucks's alleged use of genetically modified food and the GMO company Monsanto.\n\nUpstanders\nIn September 2016, Starbucks announced a debut of its first-ever original content series called \"Upstanders\", which aimed to be inspirational. The series featured podcasts, written word, and video, and was distributed via the Starbucks mobile app, online, and through the company's in-store digital network.\n\nFilms\nIn the 1999 film Austin Powers: The Spy Who Shagged Me, it is stated by Number 2 (Robert Wagner) to Dr. Evil (Mike Myers), that while he was frozen, Virtucon invested in the company years prior which has become a major conglomerate.\nIn the 2021 film Ghostbusters: Afterlife, it is stated by Ray Stantz (Dan Aykroyd) that Starbucks had taken over the Ghostbusters' firehouse headquarters at North Moore Street after they went out of business and had turned it into a coffeehouse before Winston Zeddemore (Ernie Hudson) bought it back from them.\n\nPartnerships\nApple Inc.\nStarbucks has partnered with Apple Inc. to collaborate on selling music as part of the \"coffeehouse experience\". In October 2006, Apple added a Starbucks Entertainment area to the iTunes Store, selling music similar to that played in Starbucks stores. In September 2007, Apple announced that customers would be able to browse the iTunes Store at Starbucks via Wi-Fi in the US—with no requirement to log into the Wi-Fi network—targeted at iPhone, iPod Touch, iPad, and MacBook users. The iTunes Store automatically detects recent songs playing in a Starbucks and offer users the opportunity to download the tracks. Some stores feature LCD screens with the artist name, song, and album information of the current song playing. This feature was rolled out in Seattle, New York City, and the San Francisco Bay Area, and was offered in limited markets during 2007–2008. During the fall of 2007, Starbucks also began to sell digital downloads of certain albums through iTunes. Starbucks gave away 37 different songs for free download through iTunes as part of the \"Song of the Day\" promotion in 2007, and a free \"Pick of the Week\" download is available from the App Store.\n\nMSNBC\nStarting on June 1, 2009, the MSNBC morning news program Morning Joe has been presented as \"brewed by Starbucks\" and the show's logo changed to include the company logo. Although the hosts have previously consumed Starbucks coffee on air \"for free\" in the words of MSNBC president Phil Griffin, it was not paid placement at that time. The move was met with mixed reactions from rival news organizations, viewed as both a clever partnership in an economic downturn and a compromise of journalistic standards. The endorsement deal ended in August 2013.\n\nKraft Foods\nStarbucks and Kraft Foods entered into a partnership in 1998 to sell Starbucks products in the Mondelez grocery stores owned by the latter. Starbucks claimed that Kraft did not sufficiently promote its products and offered Kraft US$750 million to terminate the agreement; however, Kraft declined the offer, but Starbucks proceeded with the termination anyway. Starbucks wanted to terminate the agreement because at the time, single coffee packs were beginning to become popular. In their agreement, Starbucks was confined to selling packs that only worked in Kraft's Tassimo machines. Starbucks did not want to fall behind in the market opportunities for K-Cups. In mid-November 2013, an arbitrator ordered Starbucks to pay a fine of US$2.8 billion to Mondelez International, a corporate spin-off of Kraft, for its premature unilateral termination of the agreement.\n\nArizona State University\nIn June 2014, Starbucks announced a partnership with Arizona State University (ASU) that would allow Starbucks employees in their Junior and Senior years of college to complete four years of college at Arizona State University's online program for only around US$23,000. Starbucks employees admitted into the program will receive a scholarship from the college, that will cover 44% of their tuition. The remaining balance and all other expenses would be paid by the student or through traditional financial aid. In April 2015, Starbucks and ASU announced an expansion of the College Achievement Program. The program would now allow all eligible part-time and full-time employees working in a U.S. Starbucks to enroll in the program for full-tuition reimbursement. After the completion of each semester, Starbucks reimburses the student their portion of the tuition. The student can then use the reimbursement to pay any loans or debt incurred during the semester.\n\nPepsiCo\nIn 2015, Starbucks signed a deal with PepsiCo to market and distribute Starbucks products in several Latin American countries.\n\nSpotify\nIn May 2015, Starbucks entered a partnership with music streaming service Spotify. The partnership entailed giving U.S.-based employees a Spotify premium subscription and to help influence the music played in store via playlists made using Spotify. Starbucks was also given its own curated Spotify playlist to be featured on Spotify's mobile app.\n\nDisney\nOn June 19, 2015, a Starbucks opened at Disney's Animal Kingdom on Discovery Island. Since the park does not allow plastic straws due to the animals, this location features special green eco-friendly straws with their cold drinks. This was the sixth Starbucks to open in Walt Disney World, following locations in the Magic Kingdom (Main Street, U.S.A.), Epcot (Future World), Disney's Hollywood Studios (Hollywood Boulevard), and two in Disney Springs (Marketplace and West Side). In addition to these six, there are locations in Disneyland (Main Street, U.S.A.), Disney California Adventure (Buena Vista Street), Anaheim's Downtown Disney, and Disney Village at Disneyland Paris. The Downtown Disney and Disney Springs locations are Starbucks-operated, while the locations inside of the theme parks are Disney-operated.\n\nUber Eats\nIn December 2018, Starbucks expanded its partnership with Uber Eats to bring its beverages to U.S. customers' doorsteps, as it had already done for some time in China.\n\nLyra Health Inc.\nIn March 2020, Starbucks announced that starting from April 6, all U.S. employees and their eligible family members could use up to 20 free mental health therapy or coaching sessions per year. They can meet with a counselor face-to-face or video call and will also have unlimited access to self-care apps through Lyra Health Inc.\n\nReception\nKevin Knox, who was in charge of doughnuts food quality at Starbucks from 1987 to 1993, recalled on his blog in 2010 how George Howell, coffee veteran and founder of the Cup of Excellence, had been appalled at the dark roasted beans that Starbucks was selling in 1990. Talking to The New York Times in 2008, Howell stated his opinion that the dark roast used by Starbucks does not deepen the flavor of coffee, but instead can destroy purported nuances of flavor.\nThe March 2007 issue of Consumer Reports compared American fast-food chain coffees and ranked Starbucks behind McDonald's Premium Roast in the middle of a coffee war. The magazine called Starbucks coffee \"strong, but burnt and bitter enough to make your eyes water instead of open\".\nAs reported by Time in 2010, third wave coffee proponents generally criticize Starbucks for over-roasting beans. As a result, Starbucks retrained its baristas and changed its roasting methods in 2010 in order to \"standardize quality over quantity\". The Atlantic reported that this push for higher-quality coffee slowed down orders, but stated \"[they] move their product pretty quickly, and with surprising accuracy\". Forbes corroborated this trade off between efficiency and quality at Starbucks.\nIn 2018, Business Insider conducted a test of Starbucks coffee judged by 100 coffee experts. It concluded that although staples of the menu were \"too sugary\", coffee quality materially improved with particularly strong showings in the firm's iced coffee and nitro cold brew coffee offerings. Insider experts, however, did note that the coffee quality in Starbucks Reserves far surpassed that of the typical retail store.\n\nCriticisms and controversies\nResponse to Russian invasion of Ukraine\nFollowing the 2022 Russian invasion of Ukraine, a number of companies have faced growing pressure to halt operations in Russia, but have not yet done so. This includes Starbucks. On March 4, Starbucks CEO Kevin Johnson stated that the company has no business operations in Ukraine, but does have 130 licensed Starbucks locations in Russia that are wholly owned by a \"licensed partner\". While Johnson did not comment on their future, he condemned the Russian invasion and did say that the company \"will donate any royalties we receive from our business operations in Russia to humanitarian relief efforts for Ukraine\".\n\nRacial controversies\nStarbucks has been accused of racial bias and discrimination on several occasions. In 1994, Starbucks settled a lawsuit after two employees were dismissed because of their race, age, and sex. A black woman filed a suit after her direct supervisor, a regional vice president, said he would like to call her Toby, a slave name which was given to African Kunta Kinte in the TV miniseries Roots. Her co-worker spoke on her behalf, after which she was fired. In 2008, a former African American Starbucks engineer sued the company for discrimination after his supervisor failed to address racist bullying he was experiencing at the workplace, instead giving him extra work due to his complaining. Starbucks settled the suit in 2009. The Equal Employment Opportunity Commission has raised allegations against Starbucks for racial bias in its promotions, allegedly based on workforce data from 2007 to 2011 that showed that minority retail partners in the United States received fewer promotions than statistically expected.\nThe 2015 Starbucks \"Race Together\" campaign, when baristas were instructed to write the phrase \"Race Together\" on customer's cups with the aim to start a national dialogue about race, was heavily criticized and received backlash. In 2020, employees were prohibited from wearing Black Lives Matter symbols or phrases on their clothing or accessories.\nIndividual Starbucks cafes have faced criticism over incidents of racial bias, leading the company to close 8,000 cafes for a day in 2018 for racial bias training. In 2014, a Milwaukee Starbucks employee called the police when they noticed a black man sleeping in a park, which resulted in the police officer killing the man by shooting him 14 times, prompting protests. In 2018, two black men were arrested and escorted out of a Philadelphia Starbucks after the staff called the police because they refused to leave. The video of the incident quickly became viral and sparked widespread outrage. In another 2018 incident, a black man was denied the code for the restroom for not being a customer, even though at the same time a white man was given that code before ordering anything. In 2021, a Starbucks in Ireland was fined €12,000 after an Irish Thai customer received her order with a racist drawing on the cup.\n\nUnion busting\nIn 2022, over a period of a few months, Starbucks terminated more than 85 workers in the U.S. who had been involved in organizing worker unions against unfair labor practices. The workers had also accused Starbucks of creating a culture of fear and surveillance in the store.\nIn November 2022, the chain announced it would close a location in Seattle that was the first to unionize. It said the closure was due to safety concerns.\nOn December 18, 2022, workers at over 100 stores across the U.S. undertook a three-day strike in response to alleged union busting and to demand better working conditions.\n\nPride/LGBTQ+\nIn June 2023, Starbucks attracted controversy for allegedly not allowing workers at some locations in 22 states to put up Pride Month decorations. It came during an ongoing public furor over the direction of LGBTQ+ rights in the US, with other major corporations, like Target and AB-InBev, which manufactures Bud Light, also receiving heightened criticism and scrutiny. A strike at some stores was announced as a result.\n\nBoycott amidst the 2023 Gaza war\nIn late 2023, Starbucks faced boycotts following the company's decision to sue the Starbucks Workers United (SWU) union for making a social media post stating \"Solidarity with Palestine\" shortly after the October 7 Hamas-led attack on Israel. Starbucks alleged that the post harmed its reputation, and sued for trademark infringement for the use of the Starbucks name and a related logo. The SWU made a filing in response, requesting the continued use of the name and logo, and alleging defamation from Starbucks that it endorsed violence or terrorism. According to SWU President Lynne Fox the post was written by a single person, shortly deleted, and not authorized by other members of the SWU. CEO Laxman Narasimhan wrote a year-ending letter addressed to employees, writing: \"Our stance is clear. We stand for humanity.\"\n\nOther controversies\nIn 2025, a court ordered Starbucks to pay $50 million to a driver who suffered burns after an unsecured hot drink spilled on him.\nOn Red Cup Day, Starbucks provides reusable cups to customers who buy holiday-themed beverages. On Red Cup Day 2025, Starbucks employees organized a walkout at 4 p.m. local time in over a dozen U.S. cities as part of a strike known as the Red Cup Riot, involving approximately 1,000 baristas. This phase of the strike includes participation from more than 65 locations across over 40 cities. The baristas are advocating for enhanced wages, better working conditions, and reliable and adequate hours.\n\nSee also\nCoffee culture\nList of coffee companies\nList of companies based in Seattle\nMultinational corporation\n\nReferences\nFurther reading\nBehar, Howard with Janet Goldstein. (2007). It's Not About the Coffee: Leadership Principles from a Life at Starbucks, 208 pages. ISBN 1-59184-192-5.\nClark, Taylor. (2007). Starbucked: A Double Tall Tale of Caffeine, Commerce and Culture. 336 pages. ISBN 0-316-01348-X.\nMichelli, Joseph A. (2006). The Starbucks experience: 5 principles for turning ordinary into extraordinary, 208 pages. ISBN 0-07-147784-5.\nPendergrast, Mark (2001) [1999]. Uncommon Grounds: The History of Coffee and How It Transformed Our World. London: Texere. ISBN 1-58799-088-1.\nSchultz, Howard. and Dori Jones Yang. (1997). Pour Your Heart Into It: How Starbucks Built a Company One Cup at a Time, 350 pages. ISBN 0-7868-6315-3.\nSimon, Bryant. (2009). Everything but the Coffee: Learning about America from Starbucks. 320 pages. ISBN 0-520-26106-2.\nMedia\nArchived at Ghostarchive and the Wayback Machine: \"How Starbucks Became An $80B Business\". CNBC. January 10, 2019.\nArchived at Ghostarchive and the Wayback Machine: \"Why Starbucks Failed In Australia\". CNBC. June 26, 2018.\nArchived at Ghostarchive and the Wayback Machine: \"Why Starbucks Is Struggling In South Africa\". CNBC. October 23, 2019.\n\nExternal links\n\nOfficial website \nBusiness data for Starbucks: \n\"Inside Starbucks’ Dirty War Against Organized Labor\" at The New York Times",
  "clean_text": "Starbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. It was founded in 1971 by Jerry Baldwin, Zev Siegl, and Gordon Bowker at Seattle's Pike Place Market initially as a coffee bean wholesaler. Starbucks was converted into a coffee shop serving espresso-based drinks under the ownership of Howard Schultz, who was chief executive officer from 1986 to 2000 and led the aggressive expansion of the franchise across the West Coast of the United States. As of November 2022, the company had 35,711 stores in 80 countries, 15,873 of which were located in the United States. Of Starbucks' U.S.-based stores, over 8,900 are company-operated, while the remainder are licensed. It is the world's largest coffeehouse chain. The company is ranked 120th on the Fortune 500 and 303rd on the Forbes Global 2000, as of 2022. The rise of the second wave of coffee culture is generally attributed to Starbucks, which introduced a wider variety of coffee experiences. Starbucks serves hot and cold drinks, whole-bean coffee, micro-ground instant coffee, espresso, caffe latte, full and loose-leaf teas, juices, Frappuccino beverages, pastries, and snacks. Some offerings are seasonal or specific to the locality of the store. Depending on the country, most locations provide free Wi-Fi Internet access. The company has been subject to multiple controversies related to its business practices. Conversely, its franchise has commanded substantial brand loyalty, market share, and company value. History 20th century 1970s Starbucks originally opened in Seattle, Washington, on March 30, 1971. By selling high-quality coffee beans and equipments related, Starbucks became a local coffee bean retailer for the first ten years in Seattle. It was founded by business partners Jerry Baldwin, Zev Siegl and Gordon Bowker who first met as students at the University of San Francisco. The trio were inspired to sell high-quality coffee beans and equipment by coffee roasting entrepreneur Alfred Peet. Bowker recalls that a business partner of his, Terry Heckler, thought words beginning with the letters \"st\" were powerful, leading the founders to create a list of words beginning with \"st\", hoping to find a brand name. They chose \"Starbo\", a misreading of the mining town Storbo in the Cascade Range named after Peter Storbo, founder and president of the Mount Rainier Mining Company. From there, the group remembered \"Starbuck\", the name of the chief mate in the book Moby-Dick. Bowker said, \"Moby-Dick didn't have anything to do with Starbucks directly; it was only coincidental that the sound seemed to make sense.\" The first Starbucks store was located in Seattle, at 2000 Western Avenue, from 1971 to 1976. The café was later moved to 1912 Pike Place. During this time, Starbucks stores sold just coffee beans and not drinks. In its first two years of operation, Starbucks purchased green coffee beans from Peet's Coffee & Tea. In 1973, Alfred Peet stopped supplying Starbucks and helped train their new Roastmaster, Jim Reynolds. 1980s In 1984, the original owners of Starbucks, led by Jerry Baldwin, purchased Peet's Coffee. By 1986, the company was operating six stores in Seattle and had begun to sell espresso coffee. In 1987, the original owners sold the Starbucks chain to their former director of marketing Howard Schultz, who rebranded his Il Giornale coffee outlets as Starbucks and began to expand the company. Also in 1987, Starbucks opened its first locations outside of Seattle, in Waterfront Station in Vancouver, British Columbia, and in Chicago, Illinois. By 1989, there were 46 Starbucks stores located across the Pacific Northwest and Midwest, and the company was roasting more than 2,000,000 pounds (907,185 kg) of coffee annually. 1990s In June 1992, at the time of its initial public offering, Starbucks (ticker symbol: SBUX) had 140 outlets, with revenue of US$73.5 million, up from US$1.3 million in 1987. The company's market value was US$271 million by this time. The 12% portion of the company that was sold raised around US$25 million for the company, which enabled it to double its number of stores over the next two years. In 1994, Starbucks acquired The Coffee Connection, gaining the rights to use, make, market, and sell the \"Frappuccino\" beverage. The beverage was introduced under the Starbucks name in 1995. In 1999, Starbucks experimented by opening eateries in the San Francisco Bay Area, under the Circadia restaurant brand. At the same time, Starbucks converted its Seattle Circadia restaurant into a Café Starbucks. In 1999, Starbucks acquired Pasqua Coffee—a San Francisco-based retail coffee chain that had almost 60 locations in San Francisco, Los Angeles, and New York City. 21st century 2000s In April 2003, Starbucks acquired Seattle's Best Coffee and Torrefazione Italia from AFC Enterprises for US$72 million. The deal only gained 150 stores for Starbucks, but according to the Seattle Post-Intelligencer, the wholesale business was more significant. By June 2003, Starbucks Japan had 466 stores and would add another 70 to 75 in the 2003 financial year. Its president, Yuji Tsunoda said it would install ovens in all stores to improve its food offerings. From 2005 to 2007, Howard Behar served as the president of Starbucks North America. In September 2006, rival Diedrich Coffee announced that it would sell most of its company-owned retail stores to Starbucks, including most locations of Oregon-based Coffee People, escalating regional coffee wars. Starbucks converted the Diedrich Coffee and Coffee People locations to Starbucks. The Coffee People locations at Portland International Airport were excluded from the sale. In early 2008, Starbucks started a community website, My Starbucks Idea, designed to collect suggestions and feedback from customers. Other users could comment and vote on suggestions. Journalist Jack Schofield noted that \"My Starbucks seems to be all sweetness and light at the moment, which I don't think is possible without quite a lot of censorship.\" In March 2008, Starbucks acquired Coffee Equipment Company, which was the manufacturer of the Clover Brewing System. It began testing the \"fresh-pressed\" coffee system at several Starbucks locations in Seattle, California, New York, and Boston. In July 2008, during the Great Recession, Starbucks announced it was closing 600 underperforming company-owned stores and cutting U.S. expansion plans amid growing economic uncertainty. On July 29, 2008, Starbucks also cut almost 1,000 non-retail jobs as part of its bid to re-energize the brand and boost its profit. Of the new cuts, 550 of the positions were layoffs and the rest were unfilled jobs. Additionally in July 2008, Starbucks announced that it would close 61 of its 84 stores in Australia in the following month. Nick Wailes, an expert in strategic management of the University of Sydney, said that \"Starbucks failed to truly understand Australia's café culture.\" In January 2009, Starbucks announced the closure of an additional 300 underperforming stores and the elimination of 7,000 positions. CEO Howard Schultz also announced that he had received board approval to reduce his salary. Altogether, from February 2008 to January 2009, Starbucks terminated an estimated 18,400 U.S. jobs and began closing 977 stores worldwide. In August 2009, Ahold announced closures and rebranding for 43 of its licensed store Starbucks kiosks for their US-based Stop & Shop and Giant supermarkets. 2010s In 2012, Starbucks had annual Frappuccino sales of over US$2 billion. In August 2012, the largest Starbucks in the US opened at the University of Alabama's Ferguson Centre. On June 25, 2013, Starbucks began to post calorie counts on menus for drinks and pastries in all of its U.S. stores. In July 2013, more than 10% of in-store purchases were made on customers' mobile devices via the Starbucks app. The company once again utilized the mobile platform when it launched the \"Tweet-a-Coffee\" promotion in October 2013. On this occasion, the promotion also involved Twitter and customers were able to purchase a US$5 gift card for a friend by entering both \"@tweetacoffee\" and the friend's handle in a tweet. Research firm Keyhole monitored the progress of the campaign; a December 2013 media article reported that 27,000 people had participated and US$180,000 of purchases had been made to date. In January 2014, as part of a change in compact direction, Starbucks management transitioned from a singular brand worldwide to focusing on locally relevant design for each store. In May 2014, Starbucks announced ongoing losses in the Australian market, which resulted in all remaining stores being sold to the Withers Group. In July 2017, Starbucks acquired the remaining 50% stake in its Chinese venture from long-term joint venture partners Uni-President Enterprises Corporation (UPEC) and President Chain Store Corporation (PCSC) for US$1.3 billion. On March 21, 2018, Starbucks announced that it was considering the use of blockchain technology to connect coffee drinkers with coffee farmers who could eventually be able to take advantage of new financial opportunities. The pilot program was planned to start with farmers in Costa Rica, Colombia, and Rwanda in order to develop a new way to track the bean-to-cup journey. In 2019, at the Microsoft Build conference, the coffee company formally announced its \"bean to cup\" program using the Microsoft's Azure-based blockchain service. Two men were arrested in a Philadelphia Starbucks location after a manager claimed the two were trespassing on April 12, 2018. The arrests led to protests due to their apparently racially motivated nature. CEO Kevin Johnson later apologized for the incident, and the company declined to press charges. During the company's second quarter earnings call on April 26, Johnson indicated that the company had not seen a drop in sales as a result of the event and subsequent coverage. The company reiterated its guidance for full year earnings, and beat consensus expectations of 1.8 percent same-store sales growth, with 2 percent growth. Johnson announced that the company would close some 8000 locations on May 29 for a seminar about racial bias in order to prevent future events similar to those that occurred in Philadelphia. On June 19, 2018, Starbucks announced the closing of 150 locations in 2019, three times the number the corporation typically closes in a single year. The closings were to happen in urban areas that already have dense clusters of stores. In July 2019, Starbucks announced that it would no longer be selling newspapers in its cafés. It was also announced that kiosks for grab-and-go snacks and bags of whole-bean coffee would be removed from stores beginning in September 2019. In November 2019, Starbucks opened its largest store ever on Michigan Avenue, Chicago, with 200 employees. 2020s On March 20, 2020, due to the COVID-19 pandemic, Starbucks closed all the café-only stores in the United States for two weeks. During that time, only drive-thru and delivery-only services were to function. According to the company representatives, all workers were to be paid for the next 30 days whether they went to work or stayed home. COVID-19 lockdowns caused Starbucks to suffer a general 10% sales decrease, and a 50% decrease in China where quarantine measures were especially strict. In May 2020, the company asked for reduced rent from landlords due to the decrease in sales. In June 2020, during the COVID-19 pandemic in the United States, the company announced that it would close 400 of its locations in the US/Canada region over the subsequent 18 months as it moves from the coffee house concept to what it calls \"convenience-led\" formats with drive-through and curbside pickup. Starbucks announced that it planned to open 300 stores that will primarily focus on carryout and pickup orders. The new stores will work with the Starbucks mobile app for prepayment by the customer before arrival to pick up the order. The layout of some stores will also be modified with a separate counter for picking up mobile orders. In December 2020, Starbucks announced that it is planning to increase its store count to about 55,000 by 2030, up from roughly 33,000. Bloomberg reported in July 2022 that the company was, through investment bank Houlihan Lokey, exploring selling its stores in the United Kingdom. In August 2022, after months of suspension due to the Russian invasion of Ukraine, Starbucks sold all its stores in Russia to the Russian rapper Timati. The stores were rebranded as \"Stars Coffee\", and are very similar to the former stores. Starbucks said it had no comment on the new owner. On October 1, 2022, Howard Schultz stepped down as CEO, with Laxman Narasimhan becoming Starbucks's next CEO. On March 23, 2023, Narasimhan told employees that he would work a half-day behind a store counter each month, and he trained as a barista to immerse himself in the brand and stay close to customers. In June 2023, Starbucks was ordered to pay $25 million in punitive damages and $600,000 compensatory damages to a former regional manager. The court found that Starbucks fired her in 2018 because she was white. In December 2023, the operator of all of the Starbucks locations in Brazil, SouthRock Capital, declared itself bankrupt. SouthRock will continue to operate Starbucks locations normally while closing a few underperforming ones and will restructure through the bankruptcy procedure. SouthRock Capital later declared Chapter 15 bankruptcy in June 2024. On August 13, 2024, Starbucks announced it was replacing then CEO Laxman Narasimhan with Brian Niccol. Niccol had served as the CEO of Chipotle since 2018. In January 2025, Starbucks ended its 'open-door policy', and requires customers to make a purchase in order to use restrooms and the seating area. In February 2025, Starbucks cut 30% of its menu in an effort to simplify its processes and reduce costs. The discontinued offerings were primarily less popular or more complex items, including some Frappuccino blended drinks, Royal English Breakfast Latte, and White Hot Chocolate. In July 2025, Starbucks announced corporate office employees would have to return to working physically in the office four days per week, starting in October. For workers who would prefer to instead leave the company, Starbucks would offer a one-time voluntary exit program which would include a cash payment. American unionization efforts Three of the company's stores in Buffalo, New York began an attempt to unionize in August 2021. Using Twitter, the workers announced they had formed an organizing committee, Starbucks Workers United, to form a union affiliated with Workers United. Two more stores joined the effort in September, however these petitions were later withdrawn to ensure a speedy process for the original three locations. During the union drive, the company sent other managers and executives, including its North America retail president, to Buffalo to engage with employees about operational issues and participate in their work. Employees were forced to attend captive audience meetings that contained anti-union messages. Starbucks temporarily closed some area stores for remodeling and added excessive staff to one of the stores preparing to vote. Workers said this reduced union support there, while Starbucks said the support was meant to compensate for increased sick leave during the pandemic as it had done elsewhere in the country. On November 9 Workers United filed three more petitions for elections to represent workers at additional Buffalo area stores. On November 10 the National Labor Relations Board mailed out votes for the elections at the original three locations. Votes for the original three stores were counted on December 9. Days before the vote count, the NLRB rejected arguments by Starbucks to halt the election. Inspired by their colleagues in Buffalo, workers at a Starbucks store in Mesa, Arizona, petitioned the NLRB for a union election on November 18, 2021, to be represented by Workers United. The organizing at the Mesa location stemmed from, in part, a well-liked manager being terminated after whistle-blowing on Starbucks' anti-union plan. Starbucks temporarily closed two stores participating in the union drive in October for renovations. The company claimed these closures were unrelated to the unionization efforts. Starbucks began working with Littler Mendelson, a self-described \"union-busting firm\", in October. Starbucks requested that the National Labor Relations Board include all Buffalo Starbucks locations in the union vote, however, the NLRB rejected this argument and declared store by store elections. Finally, on December 9, 2021, the workers at the Elmwood Avenue store became the first unionized Starbucks workers at a Starbucks owned location in the United States with a 19–8 vote. The Camp Road location voted 12–8 not to be in the union. Starbucks does have unionized locations in other countries. On December 13, workers at two Boston area locations petitioned the NLRB for union elections to be unionize with Workers United. The workers cited the win in Buffalo as inspiration for organizing. Workers in at least one location had most cards signed within a day. In February 2022, Starbucks fired seven workers in Memphis who had led the unionization effort and temporarily closed the store. In August 2022, the National Labor Relations Board accused the company of illegally discriminating against unionized workers by refusing them wage and benefit increases and requesting restitution. It also asked that the CEO at the time, Howard Schultz, or a board official read a notice about this purportedly unlawful move. As of August 2022, unions were certified at 211 locations in the US. On November 17, 2022, Starbucks’ annual Red Cup Day and one of the busiest days for employees, over 100 locations had employees go on strike. The workers were seeking higher staffing levels, better wages, and consistent schedules. Most unionization efforts are made through SBWU (Starbucks Workers United). There are over 9,000 American locations, but since the first unionized location in New York in 2021, less than 3% have voted to unionize. SBWU and Starbucks have yet to successfully negotiate a contract. Starbucks claims in a letter and on its website that the Workers United has delayed bargaining, has illegally broadcast bargaining sessions, refused to meet in person, and that Starbucks has reported more than 22 unfair labor practice charges to the NLRB (National Labor Relations Board). By March 2023, the NLRB found no merit in Starbucks's complaints and instead ruled that it was Starbucks who refused to bargain. On June 23, 2023, Starbucks workers at unionized stores went on strike over the company's stance on in-store LGBT pride decorations. Economic summary Products Coffee cup sizes Low calorie and sugar-free products In January 2008, Starbucks began a \"skinny\" line of drinks, offering lower-calorie and sugar-free versions of the company's offered drinks that use skim milk, and can be sweetened by a choice of natural sweeteners (such as raw sugar, agave syrup, or honey), artificial sweeteners (such as Sweet'N Low, Splenda, Equal), or one of the company's sugar-free syrup flavors. Non-dairy milk offerings In 1997, Starbucks first offered non-dairy milk at its U.S. stores with the introduction of soy milk. In 2007, Starbucks stopped using milk originating from rBGH-treated cows. The company also adopted a new dairy standard for all espresso-based drinks, switching from whole to 2% reduced fat milk. In 2015, Starbucks began serving coconut milk. In 2016, it began serving almond milk. In January 2020, oat milk became available nationally. The company also offers non-dairy creamers at retail in partnership with Nestlé SA. CEO Kevin Johnson said in a 2020 interview that, milk substitutes will be a big part of reducing carbon emissions. That effort has prompted vegans, environmentalists, people with lactose intolerance and others to urge the company to eliminate the upcharge for drinks made with dairy-free milk. PETA encouraged sit-ins at Starbucks locations and purchased Starbucks stock to draw attention to what they believe is an unfair charge. A Starbucks Canada spokesperson told ET Canada that customizations such as added flavours, non-dairy beverages or an additional shot of espresso, will incur an additional charge. In December 2020, Starbucks announced it will offer Oatly oat milk in all US stores starting in spring 2021. With the launch of their holiday menu in November 2024, Starbucks ended the upcharge for non-dairy milk additions to drinks. Ethos water Ethos water, a brand of bottled water acquired by Starbucks in 2003, is sold at locations throughout North America. Ethos bottles feature prominent labeling stating \"helping children get clean water\", referring to the fact that US$0.05 from each US$1.80 bottle sold (US$0.10 per bottle in Canada) is used to fund clean water projects in underdeveloped areas. Although sales of Ethos water have raised over US$6.2 million for clean water efforts, the brand is not incorporated as a charity. Critics have argued that the claim on the label misleads consumers into thinking that Ethos is primarily a charitable organization when it is actually a for-profit brand and only 5 cents per bottle supports clean-water projects. The founders of Ethos have stated that the brand is intended to raise awareness of third-world clean water issues and provide socially responsible consumers with an opportunity to support the cause by choosing Ethos over other brands. Starbucks has since redesigned the American version of the Ethos water bottles, stating the amount of money donated per bottle in the description. Instant coffee In March 2009, Starbucks introduced a line of instant coffee packets, called VIA \"Ready Brew\". It was first unveiled in New York City with subsequent testing of the product also in Seattle, Chicago, and London. The first two VIA flavors include Italian Roast and Colombia, which were then rolled out in October 2009, across the U.S. and Canada with Starbucks stores promoting the product with a blind \"taste challenge\" of the instant versus fresh roast, in which many people could not tell the difference between the instant and freshly brewed coffee. Financial analysts speculated that by introducing instant coffee, Starbucks would devalue its own brand. Coffee makers and single-use capsules In September 2012, Starbucks announced plans to introduce the Verismo, a consumer-grade single-serve coffee machine that uses sealed plastic cups of coffee grounds, and a \"milk pod\" for lattes. In November 2012, Starbucks Verismo became publicly available, consisting of a line of coffee makers that brew espresso and regular chocolate from coffee capsules, a type of pre-apportioned single-use container of ground coffee and flavourings utilizing the K-Fee pod system. In a brief review of the 580 model, Consumer Reports described the results of a comparative test of the Verismo 580 against two competitive brands: Because you have to conduct a rinse cycle between each cup, the Verismo wasn't among the most convenient of single-serve machines in our coffeemaker tests. Other machines we've tested have more flexibility in adjusting brew-strength—the Verismo has buttons for coffee, espresso, and latte with no strength variation for any type. And since Starbucks has limited its coffee selection to its own brand, there are only eight varieties so far plus a milk pod for the latte. As of December 31, 2020, Starbucks has discontinued producing their own K-Fee pods for Verismo machines, however, third-party companies continue to produce coffee pods for K-Fee machines, of which the Starbucks Verismo is compatible. Alcoholic drinks In 2010, Starbucks began selling alcoholic beverages at some stores in the United States. In August 2014, Starbucks opened its first store in Williamsburg, Brooklyn which by then was among 30 locations serving beer and wine. In 2016, three locations within Toronto, Ontario also announced they were going to serve alcohol, including up-scale appetizers like bacon-wrapped dates and truffle mac and cheese. Starbucks ensures that the selected locations that serve alcohol are able to accommodate the community, as well as have the space for extra seating and storage. Fruit juices, fruit beverages, and sodas On November 10, 2011, Starbucks acquired juice company Evolution Fresh for US$30 million in cash and planned to start a chain of juice bars starting in around the middle of 2012, venturing into territory staked out by Jamba Inc. Its first store released in San Bernardino, California and plans for a store in San Francisco were to be launched in early 2013. In March 2012, Starbucks began selling a line of iced Starbucks Refresher beverages that contain a green coffee extract. The beverages are fruit flavored and contain caffeine but advertised as having no coffee flavor. Starbucks's green coffee extraction process involves soaking the beans in water. In June 2014, Starbucks began trialing its own line of carbonated sodas, dubbed \"Fizzio\". The drinks required a special machine to make. Functional beverages In January 2022, Starbucks launched a line of canned energy drinks, called \"Baya\". The drink contains caffeine from the coffee fruit. In June 2024, Starbucks introduced Iced Energy, a fruit-flavored energy drink, at its US locations. A canned version was introduced in March 2025. In June 2025, Starbucks began testing a protein-infused foam topping. Seasonal cups Each year between November–January, Starbucks releases new holiday merchandise, including new paper cups with various festive designs. Barrel-aged coffee In March 2017, Starbucks announced the launch of two new limited-edition specialty drinks made from beans aged in whiskey barrels at its Seattle roastery. Starbucks's barrel-aged coffee will be sold with a small batch of unroasted Starbucks Reserve Sulawesi beans, which are then hand-scooped into whiskey barrels from Washington state. Oleato coffee In February 2023, Starbucks announced it would introduce a line of coffee drinks made with extra virgin olive oil, including lattes, shaken espresso, and cold brews. This would not be a limited-time offering, but rather \"'one of the biggest launches we’ve had in decades,'\" according to Brady Brewer, the company's chief marketing officer. The goal was to create a new category of beverage. Unlike other drinks, this came about because of the habits of then-CEO Howard Schultz, who was introduced to consuming a teaspoon of olive oil each day by an olive oil producer he met in Sicily. The drinks were initially available in Italy and later expanded to stores in Southern California in spring 2023 and then the UK, Middle East, and Japan later the same year. After its launch, CNN reported some customers reported digestive distress after drinking the beverages. In January 2024, the company said it would introduce the beverages nationwide in the US as well as in Canada, France, and China. The Oleato beverages were permanently discontinued in November 2024. Starbucks card and loyalty program In May 2008, a loyalty program was introduced for registered users of the Starbucks Card (previously simply a gift card) offering perks such as free Wi-Fi Internet access, no charge for soy milk and flavored syrups, and free refills on brewed drip coffee, iced coffee, or tea. Each time a customer purchases a drink, they will earn stars if they present their rewards card or scan their card from the mobile app. Eventually, these stars accumulate to allow customers to redeem for perks such as free drinks, free add-ins, free bakery items or selected merchandise. In 2009, Starbucks began beta testing its mobile app for the Starbucks card, a stored value system in which consumers access pre-paid funds to purchase products at Starbucks. Starbucks released its complete mobile platform in January 2011. By December 2011, the number of mobile transactions exceeded 26 million. Electricity and Wi-Fi In August 2002, Starbucks provided free Wi-Fi in the United Kingdom, although in the past, a Starbucks rewards card was required. On July 1, 2010, Starbucks offered free Wi-Fi in all of its stores in the U.S. and Canada. In August 2010, Starbucks began offering free Wi-Fi in Germany via BT Openzone. In October 2012, Starbucks and Duracell Powermat announced a pilot program to install Powermat charging surfaces in the tabletops in selected Starbucks stores in the Boston area. Furthermore, Starbucks announced its support in the Power Matters Alliance (PMA) and its membership in the PMA board, along with Google and AT&T, in an effort to create \"a real-world ecosystem of wireless power\" through a universal wireless charging standard that customers could use to recharge smartphones. In 2013, it switched providers in the U.S. from AT&T to Google. In August 2016, startup company FluxPort introduced Qi inductive charging pads at select locations in Germany. Locations The company's headquarters is the Starbucks Center in Seattle, Washington, United States, where 3,501 people worked as of January 2015. The main building in the Starbucks complex in SODO was previously a Sears mail order distribution center until 1987. In addition to drinks and food, many stores carry Starbucks' official merchandise, such as mugs, tumblers, scoops, and coffee presses. There are also several select \"Starbucks Evenings\" locations that offer beer, wine, and appetizers. Starbucks-brand coffee, ice cream, and bottled cold coffee drinks are sold at grocery stores in the United States and other countries. In 2010, the company began its Starbucks Reserve program for single-origin coffees and high-end coffee shops. It planned to open 1,000 Reserve coffee shops by the end of 2017. However, since succeeding Schultz, Johnson has scaled back the Reserve coffee shops to only six to ten shops. Further development on Reserve coffee shops will be dependent on the success of the few already in existence. Currently, Starbucks operates six coffee roasteries with tasting rooms and 43 coffee bars as part of the program. As of February 2023, Starbucks had 36,171 locations open across 83 countries, with 61% of the locations operating in the U.S. and China, and the rest operating elsewhere. In February 2024, the chain unveiled a new store design aimed at improving accessibility. The first location to use this design is the Washington, D.C. Union Market store. The company plans for all future company-owned stores to adopt a similar design. International expansion Europe In 1998, Starbucks entered the United Kingdom market with the US$83 million acquisition of the then 56-outlet, UK-based Seattle Coffee Company, re-branding all those stores as Starbucks. In October 2002, Starbucks established a coffee trading company in Lausanne, Switzerland, to handle purchases of green coffee. All other coffee-related business continued to be managed from Seattle. In September 2007, the company opened its first store in Russia, ten years after first registering a trademark there. After the Russian invasion of Ukraine, on May 21, 2022, Starbucks announced closure of all outlets in Russia, and in July it was revealed that a local restaurant manager, Anton Pinsky, is going to acquire Starbucks' Russian operating company OOO Starbucks and all its 130 stores. In 2008, Starbucks opened in Belgium, Bulgaria, the Czech Republic, and Portugal. In April 2009, Starbucks opened in Poland. In February 2010, Starbucks opened in Arlanda Airport outside Stockholm, its first location in Sweden. In June 2010, Starbucks opened its first store in Budapest, Hungary. In February 2011, Starbucks started selling its coffee in Norway by supplying Norwegian food shops with their roasts. The first Starbucks-branded Norwegian shop opened in February 2012, at Oslo Airport, Gardermoen. In May 2012, Starbucks opened its first coffeehouse in Finland, with the location being Helsinki-Vantaa Airport in Vantaa. In August 2013, the first Starbucks inside Dansk Supermarked opened in the department stores Salling in Aalborg and Aarhus in Denmark. In April 2014, Starbucks announced a store in Azerbaijan, in the Port Baku Mall. In November 2014, Starbucks announced its first Channel Island store, in the primary business area of St Peter Port in Guernsey. On April 21, 2015, Kesko, the second largest retailer in Finland, announced its partnership with Starbucks, with stores opened next to K-Citymarket hypermarkets. As of June 2017, three stores had been opened next to K-Citymarkets: In Sello in Espoo and in Myyrmanni and Jumbo in Vantaa. In February 2016, Howard Schultz announced the opening of stores in Italy. The first Italian Starbucks store was inaugurated in Milan on September 6, 2018, at which point Starbucks already had locations in 78 countries. In May 2016, the first Starbucks store in Slovakia opened in Aupark, in Bratislava. In June 2018, Starbucks announced the opening of stores in Serbia. The first store was opened in April 2019 at Rajiceva Mall. On June 1, 2019, Starbucks opened its first coffee store in Valletta, Malta, the 80th country to have a Starbucks outlet. In July 2025, Starbucks opened its first store in Iceland. Asia In July 1996, the first Starbucks location opened outside of North America: a store in Tokyo, Japan. Its 300th store opened in October 2001. Starbucks in Japan is described by Bloomberg as appealing to \"New Japan\" with its patrons being women in their 20s and 30s who prefer premium coffee and \"trendy, no-smoking environment\". On December 4, 1997, the Philippines became the third market to open outside of North America. The first Starbucks store in Malaysia opened in December 1998. The first Starbucks store in Thailand opened in 1998 at Central Chidlom Department Store. The first drive-thru store opened in 2022 at Porto Chino community mall on Rama II Road. In 2000, Starbucks opened its location in the Forbidden City in Beijing, however, in July 2007, this location was closed after years of controversy since its opening in 2000 with protesters objecting that the presence of the American chain in this location \"was trampling on Chinese culture\". Between 2001 and 2003, Starbucks opened six (of 80 planned) locations in Israel and having struggled with fierce local competition, Starbucks, along with its partner Delek, however, in April 2003, after losing US$6 million Starbucks Israel closed all six of its locations in Israel, citing \"on-going operational challenges\" and a \"difficult business environment\". In January 2011, Starbucks and Tata Coffee, Asia's largest coffee plantation company, announced plans for a strategic alliance to bring Starbucks to India and also to source and roast coffee beans at Tata Coffee's Kodagu facility. In January 2011, Starbucks introduced its largest cup size, the Trenta, which can hold 31 US fluid ounces (920 ml). In October 2011, Starbucks opened another location in Beijing, China, at the Beijing Capital International Airport's Terminal 3, international departures hall; making the company's 500th store in China. The store is the seventh location at the airport. In January 2012, despite a false start in 2007, Starbucks created a 50:50 joint venture with Tata Global Beverages called Tata Starbucks. Tata Starbucks owned and operated Starbucks outlets in India as Starbucks Coffee \"A Tata Alliance\". Starbucks opened its first store in India in Mumbai on October 19, 2012. On February 1, 2013, Starbucks opened its first store in Ho Chi Minh City, Vietnam, and its first location in Hanoi in July 2014. In May 2014, the Starbucks operations in South Korea launched a mobile ordering system named Siren Order, accessible through a local version of the Starbucks smartphone application. In December 2014, Starbucks launched a similar system named Mobile Order & Pay, in Portland, Oregon. The expanded nationwide in 2015, and in late March 2018, the company opened the system, previously available to Starbucks Rewards members only, to all customers. In September 2014, Starbucks announced the acquisition of the remaining 60.5% stake in Starbucks Coffee Japan that it did not already own, for US$913.5 million. In August 2015, Starbucks announced plans to open in Phnom Penh, Cambodia, its 16th market in the China/Asia Pacific region by the end of 2015. On December 18, 2015, Starbucks opened in Almaty, Kazakhstan. On the next day, one more coffee shop was opened. In December 2017, the Starbucks Reserve Roastery opened at HKRI Taikoo Hui in Shanghai, China, the only such location of its kind outside of Seattle. In November 2020, Starbucks announced that it plans to open an outlet in Laos. Americas In September 2002, Starbucks opened its first store in Latin America, in Mexico City. By 2016, there were more than 500 locations in Mexico. In August 2003, Starbucks opened its first store in South America in Lima, Peru. In 2008, Starbucks opened in Argentina and Brazil. In November 2010, the company opened the first Central American store in El Salvador's capital, San Salvador. In June 2012, Starbucks opened a store in San Jose, Costa Rica. In October 2012, Starbucks announced plans to open 1,000 stores in the United States in the next five years. In August 2013, Starbucks's CEO Howard Schultz personally announced the opening of Starbucks stores in Colombia. The first café was set to open in 2014 in Bogotá and add 50 more stores throughout Colombia's main cities in a 5-year limit. Schultz also stated that Starbucks will work with both the Colombian Government and USAID to continue \"empowering local coffee growers and sharing the value, heritage and tradition of its coffee with the world\". Starbucks noted that the aggressive expansion into Colombia was a joint venture with Starbucks's Latin partners, Alsea and Colombia's Grupo Nutresa that has previously worked with Starbucks by providing coffee through Colcafe. This announcement came after Starbucks's Farmer Support Center was established in Manizales, Colombia, the previous year making Colombia an already established country by the corporation. In late August 2013, Starbucks announced its first store in Colombia at a press conference in Bogotá, where the company's CEO explained, \"Starbucks has always admired and respected Colombia's distinguished coffee tradition.\" In May 2014, Starbucks announced its first café in Bolivia would open in 2014 in Santa Cruz de la Sierra and the first in Panama in 2015. In January 2016, Starbucks announced that it would launch operation in Trinidad and Tobago. On August 29, 2016, Starbucks opened its first store at South Park Mall in San Fernando. In November 2017, Starbucks commenced operations in Jamaica, where the first store opened in the resort city of Montego Bay on the shores of the Doctor's Cave Beach Club, offering views of the Caribbean Sea. The company also reaffirmed its commitment to working with local coffee farmers to \"implement systems to increase productivity and yields, while also increasing compliance to international standards\". Starbucks Jamaica opened its first store on November 21, 2017, with plans to open 15 locations island-wide over a 5-year period. Starbucks Jamaica opened stores at the Sangster International Airport in Montego Bay and at the Falmouth Pier, in Falmouth, Jamaica. Starbucks Jamaica announced plans to open up to six stores in Kingston, Jamaica, by 2019. The first of the Kingston stores opened on June 21, 2018. The second store is in Kingston's central business district, New Kingston. Starbucks opened its first in-store location in the flagship location for Jamaica's largest Pharmacy chain, Fontana Pharmacy, also located in Kingston; making it Starbucks's third location. On April 11, 2018, Starbucks began operations in Uruguay, with a location in the Montevideo Shopping mall. The company announced that it planned to open up approximately 12 cafes in the country. In August 2019, a franchised location opened in the Cayman Islands. In October 2019, a franchised location opened in the Turks and Caicos Islands. On April 25, 2023, Starbucks commenced operations in Guyana. On April 29, 2024, Starbucks announced its official entry to Ecuador and Honduras in mid-year and late 2024, respectively. On August 14, 2024, Starbucks commenced operations in Ecuador, with its first location in the country at Scala Shopping Mall in Quito. The company announced the plans of opening four more cafes in the capital city until the end of 2025. Oceania Australia In July 2000, the first location in Australia opened in Sydney. After a massive downturn in 2008, the remaining Australian Starbucks stores were sold to the Withers family in 2014, with the company planning a more restrained expansion. As of November 2022, there are 59 Starbucks stores in Australia; 23 in New South Wales, 19 in Queensland and 18 in Victoria. These stores are spread out across Sydney, Melbourne, Brisbane, the Gold Coast, the Sunshine Coast and Ballarat. Before the mass-closure of 61 of their 85 stores in 2008, there were also stores in Adelaide, Canberra, Hobart and Wollongong. However, there are plans to open a restaurant in Toowoomba while the first store in Perth, Western Australia opened on October 23, 2024, with another 11 planned to open by the end of 2025. New Zealand Starbucks operates several locations in New Zealand. Africa In May 2010, Southern Sun Hotels South Africa signed an agreement with Starbucks to brew Starbucks coffees in select Southern Sun and Tsonga Sun hotels in South Africa. The agreement was partially reached so Starbucks coffees could be served in the country in time for the 2010 FIFA World Cup hosted by South Africa. In April 2016, after TASTE Holdings acquired outlet licensing for South African stores, Starbucks opened its first stores in South Africa in Rosebank, Gauteng, Johannesburg and the Mall of Africa. At sea In December 2010, Starbucks debuted their first-ever Starbucks at sea. In partnership with Royal Caribbean International, Starbucks opened a shop aboard the Allure of the Seas, Royal Caribbean's second-largest ship and the second-largest ship in the world. Licensed and franchise operations Stores that independently operate locations include Ahold Delhaize, Barnes & Noble, Target Corporation, Albertsons and, more recently, Publix stores. In the EMEA (Europe, Middle East, and Africa) markets, Starbucks operates a franchising program. Different from the licensing program in which existing corporations may apply to operate a Starbucks kiosk within an existing store, franchises can enable new, freestanding stores. Automation Starbucks has automation systems in some areas. These machines have 280 possible drink combinations to choose from. They have touchscreens, and customers can play games while they wait for their order. Vending machines are said to possibly be able to replace baristas. Starbucks has said it does not want to replace baristas with robots, but use them as a complementary tool. Unbranded stores In 2009, at least three stores in Seattle were de-branded to remove the logo and brand name, and remodel the stores as local coffee houses \"inspired by Starbucks\". CEO Howard Schultz called the unbranded stores a \"laboratory for Starbucks\". The first, 15th Avenue Coffee and Tea, opened in July 2009 on Capitol Hill. It served wine and beer and hosted live music and poetry readings. It has since been remodeled and reopened as a Starbucks-branded store. Another is Roy Street Coffee and Tea at 700 Broadway E., also on Capitol Hill. Although the stores have been called \"stealth Starbucks\" and criticized as \"local-washing\", Schultz says that \"It wasn't so much that we were trying to hide the brand, but trying to do things in those stores that we did not feel were appropriate for Starbucks.\" Teavana Starbucks entered the tea business in 1999 when it acquired the Tazo brand for US$8,100,000. In December 2012, Starbucks paid US$620 million to buy Teavana. Starbucks did not market Teavana products in its stores, though the acquisition allowed the expansion of Teavana beyond shopping malls. In January 2015, Starbucks began to roll out Teavana teas into Starbucks stores, both in to-go beverage and retail formats. In November 2017, Starbucks sold Tazo to Unilever for $384 million. Starbucks shut down Teavana in early 2018. Corporate governance and identity Howard Schultz was the CEO of Starbucks from 1986 to 2000. He was succeeded by Orin Smith, who ran the company for five years and positioned Starbucks as a large player in fair trade coffee (fair trade later being overturned during Kevin Johnson's leadership in 2022), increasing sales to US$5 billion. Jim Donald was CEO from 2005 to 2008, orchestrating a large-scale earnings expansion. Schultz returned as CEO during the 2008 financial crisis and spent the succeeding decade growing the company's market share, expanding its offerings, and reorienting the brand around corporate social responsibility. Kevin Johnson, who was president and chief operating officer from 2015 to 2018, succeeded Schultz as CEO in 2017. Myron E. Ullman became chairman of the firm in June 2018. Both Johnson and Ullman succeeded Howard Schultz, who served in both capacities from 2008 to 2017. Since 2018, Schultz has served as the firm's first Chairman emeritus. In March 2022, Starbucks announced that Schultz would return as CEO in April 2022 in an interim role. Later that September, Laxman Narasimhan was appointed to succeed him in April 2023, with Schultz remaining a member of the board of directors. Narasimhan assumed the position sooner than planned, in March 2023. In August 2024, he was ousted and replaced with Brian Niccol, who became the chain's CEO on September 9 after leaving his position as Chipotle's CEO. Niccol received a starting salary of $1.6 million a year and a $10 million starting bonus. Analysts have long believed that the firm's corporate governance must determine how to contend with higher materials prices and enhanced competition from lower-priced fast-food chains, including McDonald's and Dunkin' Donuts. In October 2015, Starbucks hired its first chief technology officer, Gerri Martin-Flickinger, to lead its technology team. Starbucks maintains control of production processes by communicating with farmers to secure beans, roasting its own beans, and managing distribution to all retail locations. Additionally, Starbucks's Coffee and Farmer Equity Practices require suppliers to inform Starbucks what portion of wholesale prices paid reaches farmers. Shortly after becoming CEO, Niccol announced a new 'Back to Starbucks' strategy to win back customers. The plan including simplifying the menu and reversing rules for its cafes in North America that had allowed people to use their facilities even if they had not bought anything. Ownership Starbucks is mainly owned by institutional investors, who hold around 75% of all shares. The 10 largest shareholder of Starbucks in December 2023 were: The Vanguard Group (9.53%) BlackRock (6.96%) State Street Corporation (4.09%) Geode Capital Management (2.02%) Morgan Stanley (2.00%) Bank of America (1.75%) Northern Trust (1.30%) Royal Bank of Canada (1.27%) JPMorgan Chase (1.21%) Norges Bank (1.14%) Board of directors As of November 2025: Brian Niccol, chair and CEO of Starbucks Richard Allison, former CEO of Domino's Pizza Andrew Campion, COO of Nike, Inc. Beth Ford, CEO of Land O'Lakes Jørgen Vig Knudstorp, executive chairman of LEGO Group Marissa Mayer, former president and CEO of Yahoo! Neal Mohan, CEO of YouTube Dambisa Moyo, Co-principal of Versaca Investments Daniel Servitje, CEO of Grupo Bimbo Mike Sievert, former CEO of T-Mobile US Wei Zhang, former President of Alibaba Pictures Group Howard Schultz, president and former CEO of Starbucks Logo In 2006, Valerie O'Neil, a Starbucks spokeswoman, said that the logo is an image of a \"twin-tailed mermaid, or siren as she's known in Greek mythology\". The logo has been significantly streamlined over the years. In the first version, the Starbucks siren was topless and had a fully visible double fish tail. The image was said by Starbucks to be based on a 16th-century \"Norse\" woodcut, although other scholars note that it is apparently based on a 15th-century woodcut in Juan Eduardo Cirlot's Dictionary of Symbols. Some scholars have identified the image as Melusine. The connection to Melusine has been questioned; Melusine was not linked to heraldic images of two-tailed mermaids until the late 19th century, making it possibly a late misidentification. In the second logo, which was used from 1987 to 1992, the siren's breasts were covered by her flowing hair, but her navel was still visible. The fish tail was cropped slightly, and the primary color was changed from brown to green, a nod to the Alma Mater of the three founders, the University of San Francisco. In the third version, used between 1992 and 2011, her navel and breasts are not visible at all, and only vestiges remain of the fish tails. The original \"woodcut\" logo has been moved to the Starbucks's Headquarters in Seattle. At the beginning of September 2006, and then again in early 2008, Starbucks temporarily reintroduced its original brown logo on paper hot-drink cups. Starbucks has stated that this was done to show the company's heritage from the Pacific Northwest and to celebrate 35 years of business. The vintage logo sparked some controversy due in part to the siren's bare breasts, but the temporary switch garnered little attention from the media. Starbucks had drawn similar criticism when it reintroduced the vintage logo in 2006. The logo was altered when Starbucks entered the Saudi Arabian market in 2000 to remove the siren, leaving only her crown, as reported in a Pulitzer Prize-winning column by Colbert I. King in The Washington Post in 2002. The company announced three months later that it would be using the international logo in Saudi Arabia. In January 2011, Starbucks announced that it would make small changes to the company's logo, removing the Starbucks wordmark around the siren, enlarging the siren image, and making it green. Environmental and social policies Environmental practices In 1999, Starbucks started the \"Grounds for your Garden\" program. This gives leftover coffee grounds to anyone requesting it for composting. The goal of the program was to make the company environmentally friendlier. Although not all stores and regions participate, customers can request and lobby their local store to begin the practice. In October 2008, The Guardian newspaper reported that Starbucks was wasting 6.2 million U.S. gallons (23.4 million liters) of water a day by leaving a tap constantly running for rinsing utensils in a 'dipper well' in each of its stores, but this is often required by governmental food safety codes. In June 2009, in response to concerns over its excessive water consumption, Starbucks re-evaluated its use of the dipper well system. In September 2009, company-operated Starbucks stores in Canada and the United States successfully implemented a new water saving solution that meets government health standards. Different types of milk are given a dedicated spoon that remains in the pitcher and the dipper wells were replaced with push button metered faucets for rinsing. This will reportedly save up to 150 U.S. gallons (570 liters) of water per day in every store. In January 2020, Starbucks shared its new environmental sustainability commitment to become a resource positive company. It announced three preliminary targets: By 2030, Starbucks will aim to reduce its carbon emissions, waste output, and water impact by 50%. It also identified five areas of focus: expanding plant-based menu options; shifting to reusable packaging; investing in regenerative agriculture, reforestation, forest conservation and water replenishment; better ways to manage waste; and more eco-friendly stores, operations, manufacturing, and delivery. Recycling Starbucks began using 10% recycled paper in its beverage cups in 2006—the company claimed that the initiative was the first time that recycled material had been used in a product that came into direct contact with a food or beverage. Allen Hershkowitz of the Natural Resources Defense Council called the 10% content \"minuscule\", but Starbucks received the National Recycling Coalition Recycling Works Award in 2005 for the initiative. In a 2008 media article, Starbucks's vice president of corporate social responsibility acknowledged that the company continued to struggle with environmental responsibility, as none of its cups were recyclable and stores did not have recycling bins. At the time that the article was published, Starbucks gave customers who brought in their own reusable cup a 10-cent discount, in addition to using corrugated cup sleeves made from 85% post-consumer recycled fiber, which is 34% less paper than the original. During the same period, Starbucks entered into a partnership with Conservation International—pledging US$7.5 million over three years—to help protect the natural environment of coffee-growing communities in Mexico and Indonesia. Phase out of single-use plastic straws On July 9, 2018, Starbucks President and CEO Kevin Johnson announced that Starbucks will phase out the single-use plastic straws by January 1, 2020, on all cold drinks from all locations worldwide due to climate change concerns, pollution, and sea turtle endangerment as the single-use plastic straws failed to be designed for recycling when they were invented. Frappucinos will get straws made from a different material that is sustainable and environmentally friendly such as paper or compostable plastic, while other cold drinks will get straw-less lids. These new modified lids contain 9% less plastic than Starbucks' previous flat lid. The Starbucks locations in Europe, China, Taiwan, Japan, Thailand, Vietnam, India, Canada, Hawaii, Alaska, Washington D.C., New Mexico, California, New York, Washington State, New Jersey, Oregon, Maryland, Delaware, Vermont, Massachusetts, Connecticut, and Rhode Island already eliminated single-use plastic straws by the end of 2018. South Korea is the first country to introduce paper straws to all stores among 78 countries in the world that Starbucks has entered. Reusable cups Starbucks has publicly committed to reducing waste by 50% by 2030. After successfully completing the campaign to provide the Reusable Cup in Vietnam in 2020, it held the same event in Korea in 2021. Along with a picture of throwing away a cleanly washed recycled PET bottle on Instagram, a hashtag designated by Starbucks was written and uploaded, and a reusable cup was provided instead of a disposable cup. In April 2013, Starbucks introduced reusable cups where customers would be able to bring their cup into any location and receive a small discount on their drink. When the COVID-19 pandemic first began in 2019, the company halted the use of personal cups due to concerns with the transferring of germs. In June 2021, the company reintroduced personal reusable cups with a contactless new method to eliminate shared touch points between customers and baristas. Starbucks is phasing out disposable cups in Korea entirely by 2025. Farmer equity practices Starbucks began drafting plans for corporate social responsibility in 1994. Since Starbucks has partnered with Conservation International (CI) to draft plans and audit its coffee and farmer equity (C.A.F.E.) program, Starbucks's C.A.F.E. practices are based on a rating system of 249 indicators. Farmers who earn high overall scores receive higher prices than those who achieve lower scores. Ratings categories include economic accountability, social responsibility, environmental leadership in coffee growing and processing. Indicators for social responsibility have evolved and now include 'zero tolerance' indicators that require workers to be paid in cash, check, or direct deposit, ensure that all workers are paid the established minimum wage, that workplaces are free of harassment and abuse, that workplaces are nondiscriminatory and do not employ persons under the age of 14, and several more. Starbucks has moved 90% of its coffee purchases to preferred C.A.F.E. certified providers, and the company is approaching its stated goal to purchase 100% of its coffee through C.A.F.E. or other 'ethically sourced' certification systems. Washington State University Assistant Professor Daniel Jaffee argues that Starbucks's C.A.F.E. practices merely 'green wash' \"to burnish their corporate image\". Additionally, Professor Marie-Christine Renard of Rural Sociology of Chapingo University in Mexico wrote a case study of Starbucks's, Conservation International's, and Agro-industries United of Mexico (AMSA)'s joint conservation effort in Chiapas, Mexico in which she concluded that \"[w]hile the CI-Starbucks-AMSA Alliance paid better prices, it did not allow the producers to appropriate the knowledge that was necessary for the organizations to improve the quality of their coffee\". Fair trade In 2000, the company introduced a line of fair trade products. Of the approximately 300 million pounds (136 million kilograms) of coffee Starbucks purchased in 2006, about 18 million pounds (8.2 million kilograms) or 6% was certified as fair trade. Groups such as Global Exchange called for Starbucks to further increase its sales of fair trade coffees. After a long-running dispute between Starbucks and Ethiopia, Starbucks agreed to support and promote Ethiopian coffees. An article in BBC News, states that Ethiopian ownership of popular coffee designations such as Harrar and Sidamo is acknowledged, even if they are not registered. Ethiopia fought hard for this acknowledgement mainly to help give its poverty-stricken farmers a chance to make more money. In 2006, Starbucks said it paid $1.42 per pound ($3.1/kg) for its coffee, more than 33% higher than the commodity price at the time. However, the coffee Starbucks bought for $1.42 per pound ($3.1/kg), had a selling price—after transportation, processing, marketing, store rentals, taxes, and staff salary and benefits—of $10.99 per pound ($24.2/kg). As of 2013, the Starbucks website sells only one Ethiopian coffee. In addition, Starbucks is an active member of the World Cocoa Foundation, although targets set in 2005, 2008 and 2010 to reduce child labor that the Foundation has backed have consistently not been met. In 2019, the non-profit labor justice organization Fair World Project released an article outling how despite Starbucks had passed coffee producers as slave free in their Brazil production units using their internal C.A.F.E. certification standards, that Brazilian labor inspectors had proof of child slave labor practices being present in their supply chain. In 2022 Starbucks announced that they were going to stop certifying their coffee beans as fairtrade, in favor of their own in-house investigations. Food bank donations Since 2010, Starbucks has been donating leftover pastries in the United States to local food banks through a food collection service named Food Donation Connection. In March 2016, Starbucks unveiled a five-year plan to donate 100 percent of unsold food from its 7,600 company-operated stores in the U.S. to local food banks and pantries. Perishable food will be transported in refrigerated trucks to area food banks through the company's partnerships with the Food Donation Connection and Feeding America. This program, called FoodShare, is expected to provide up to 50 million meals over the next five years. As of 2017, the program was in 10 different markets, including New York City. In New York, Starbucks works with Feeding America and City Harvest, both non-profits, to donate food from 45 locations. It plans to expand the program to all 305 Manhattan stores. In September 2019, 60% of Starbucks stores are participating in FoodShare. This level of participation contributed to 20 million meals served to those in need. Cage-free eggs In 2008, Starbucks announced a comprehensive new animal welfare policy banning many inhumane farming practices, including the caging of hens. In 2009, they established a buying preference in North America to use industry best practices for animal husbandry and processing, including egg production. In 2015, Starbucks made a public announcement that they will switch to 100% cage-free eggs by 2020. However, later, the company altered its commitment to just company-owned locations, excluding around 40% of its licensed restaurants. In 2018, Starbucks committed to reaching the goal of using 100% cage-free eggs and egg products in company-operated stores globally by 2020, including Starbucks branded products and those supplied to licensed partners in the North America. They stated their goal to be for all their products to meet high quality and ethical standards, with a commitment to social responsibility standards with animal welfare as a primary focus. Organizations such as World Animal Protection and Compassion in World Farming have stated that Starbucks has not shown any demonstrable improvement in animal welfare since 2012. According to the Humane Society of the United States, Starbucks no longer qualifies as having an actual cage-free commitment. In popular culture Hear Music Hear Music began as a music catalog company in 1990, adding a few retail locations in the San Francisco Bay Area. Hear Music was purchased by Starbucks in 1999. In 2002, it produced a Starbucks opera album, featuring artists such as Luciano Pavarotti, followed in March 2007 by the hit CD Memory Almost Full by Paul McCartney, making McCartney the first artist signed to the new Hear Music label sold in Starbucks outlets. In 2006, the company created Starbucks Entertainment, one of the producers of the 2006 film Akeelah and the Bee. Starbucks stores advertised the film before its release and sold the DVD. Starbucks has become the subject of a protest song, \"A Rock Star Bucks a Coffee Shop\" by Neil Young and his band, Promise of the Real. This single from the album The Monsanto Years criticized both Starbucks's alleged use of genetically modified food and the GMO company Monsanto. Upstanders In September 2016, Starbucks announced a debut of its first-ever original content series called \"Upstanders\", which aimed to be inspirational. The series featured podcasts, written word, and video, and was distributed via the Starbucks mobile app, online, and through the company's in-store digital network. Films In the 1999 film Austin Powers: The Spy Who Shagged Me, it is stated by Number 2 (Robert Wagner) to Dr. Evil (Mike Myers), that while he was frozen, Virtucon invested in the company years prior which has become a major conglomerate. In the 2021 film Ghostbusters: Afterlife, it is stated by Ray Stantz (Dan Aykroyd) that Starbucks had taken over the Ghostbusters' firehouse headquarters at North Moore Street after they went out of business and had turned it into a coffeehouse before Winston Zeddemore (Ernie Hudson) bought it back from them. Partnerships Apple Inc. Starbucks has partnered with Apple Inc. to collaborate on selling music as part of the \"coffeehouse experience\". In October 2006, Apple added a Starbucks Entertainment area to the iTunes Store, selling music similar to that played in Starbucks stores. In September 2007, Apple announced that customers would be able to browse the iTunes Store at Starbucks via Wi-Fi in the US—with no requirement to log into the Wi-Fi network—targeted at iPhone, iPod Touch, iPad, and MacBook users. The iTunes Store automatically detects recent songs playing in a Starbucks and offer users the opportunity to download the tracks. Some stores feature LCD screens with the artist name, song, and album information of the current song playing. This feature was rolled out in Seattle, New York City, and the San Francisco Bay Area, and was offered in limited markets during 2007–2008. During the fall of 2007, Starbucks also began to sell digital downloads of certain albums through iTunes. Starbucks gave away 37 different songs for free download through iTunes as part of the \"Song of the Day\" promotion in 2007, and a free \"Pick of the Week\" download is available from the App Store. MSNBC Starting on June 1, 2009, the MSNBC morning news program Morning Joe has been presented as \"brewed by Starbucks\" and the show's logo changed to include the company logo. Although the hosts have previously consumed Starbucks coffee on air \"for free\" in the words of MSNBC president Phil Griffin, it was not paid placement at that time. The move was met with mixed reactions from rival news organizations, viewed as both a clever partnership in an economic downturn and a compromise of journalistic standards. The endorsement deal ended in August 2013. Kraft Foods Starbucks and Kraft Foods entered into a partnership in 1998 to sell Starbucks products in the Mondelez grocery stores owned by the latter. Starbucks claimed that Kraft did not sufficiently promote its products and offered Kraft US$750 million to terminate the agreement; however, Kraft declined the offer, but Starbucks proceeded with the termination anyway. Starbucks wanted to terminate the agreement because at the time, single coffee packs were beginning to become popular. In their agreement, Starbucks was confined to selling packs that only worked in Kraft's Tassimo machines. Starbucks did not want to fall behind in the market opportunities for K-Cups. In mid-November 2013, an arbitrator ordered Starbucks to pay a fine of US$2.8 billion to Mondelez International, a corporate spin-off of Kraft, for its premature unilateral termination of the agreement. Arizona State University In June 2014, Starbucks announced a partnership with Arizona State University (ASU) that would allow Starbucks employees in their Junior and Senior years of college to complete four years of college at Arizona State University's online program for only around US$23,000. Starbucks employees admitted into the program will receive a scholarship from the college, that will cover 44% of their tuition. The remaining balance and all other expenses would be paid by the student or through traditional financial aid. In April 2015, Starbucks and ASU announced an expansion of the College Achievement Program. The program would now allow all eligible part-time and full-time employees working in a U.S. Starbucks to enroll in the program for full-tuition reimbursement. After the completion of each semester, Starbucks reimburses the student their portion of the tuition. The student can then use the reimbursement to pay any loans or debt incurred during the semester. PepsiCo In 2015, Starbucks signed a deal with PepsiCo to market and distribute Starbucks products in several Latin American countries. Spotify In May 2015, Starbucks entered a partnership with music streaming service Spotify. The partnership entailed giving U.S.-based employees a Spotify premium subscription and to help influence the music played in store via playlists made using Spotify. Starbucks was also given its own curated Spotify playlist to be featured on Spotify's mobile app. Disney On June 19, 2015, a Starbucks opened at Disney's Animal Kingdom on Discovery Island. Since the park does not allow plastic straws due to the animals, this location features special green eco-friendly straws with their cold drinks. This was the sixth Starbucks to open in Walt Disney World, following locations in the Magic Kingdom (Main Street, U.S.A.), Epcot (Future World), Disney's Hollywood Studios (Hollywood Boulevard), and two in Disney Springs (Marketplace and West Side). In addition to these six, there are locations in Disneyland (Main Street, U.S.A.), Disney California Adventure (Buena Vista Street), Anaheim's Downtown Disney, and Disney Village at Disneyland Paris. The Downtown Disney and Disney Springs locations are Starbucks-operated, while the locations inside of the theme parks are Disney-operated. Uber Eats In December 2018, Starbucks expanded its partnership with Uber Eats to bring its beverages to U.S. customers' doorsteps, as it had already done for some time in China. Lyra Health Inc. In March 2020, Starbucks announced that starting from April 6, all U.S. employees and their eligible family members could use up to 20 free mental health therapy or coaching sessions per year. They can meet with a counselor face-to-face or video call and will also have unlimited access to self-care apps through Lyra Health Inc. Reception Kevin Knox, who was in charge of doughnuts food quality at Starbucks from 1987 to 1993, recalled on his blog in 2010 how George Howell, coffee veteran and founder of the Cup of Excellence, had been appalled at the dark roasted beans that Starbucks was selling in 1990. Talking to The New York Times in 2008, Howell stated his opinion that the dark roast used by Starbucks does not deepen the flavor of coffee, but instead can destroy purported nuances of flavor. The March 2007 issue of Consumer Reports compared American fast-food chain coffees and ranked Starbucks behind McDonald's Premium Roast in the middle of a coffee war. The magazine called Starbucks coffee \"strong, but burnt and bitter enough to make your eyes water instead of open\". As reported by Time in 2010, third wave coffee proponents generally criticize Starbucks for over-roasting beans. As a result, Starbucks retrained its baristas and changed its roasting methods in 2010 in order to \"standardize quality over quantity\". The Atlantic reported that this push for higher-quality coffee slowed down orders, but stated \"[they] move their product pretty quickly, and with surprising accuracy\". Forbes corroborated this trade off between efficiency and quality at Starbucks. In 2018, Business Insider conducted a test of Starbucks coffee judged by 100 coffee experts. It concluded that although staples of the menu were \"too sugary\", coffee quality materially improved with particularly strong showings in the firm's iced coffee and nitro cold brew coffee offerings. Insider experts, however, did note that the coffee quality in Starbucks Reserves far surpassed that of the typical retail store. Criticisms and controversies Response to Russian invasion of Ukraine Following the 2022 Russian invasion of Ukraine, a number of companies have faced growing pressure to halt operations in Russia, but have not yet done so. This includes Starbucks. On March 4, Starbucks CEO Kevin Johnson stated that the company has no business operations in Ukraine, but does have 130 licensed Starbucks locations in Russia that are wholly owned by a \"licensed partner\". While Johnson did not comment on their future, he condemned the Russian invasion and did say that the company \"will donate any royalties we receive from our business operations in Russia to humanitarian relief efforts for Ukraine\". Racial controversies Starbucks has been accused of racial bias and discrimination on several occasions. In 1994, Starbucks settled a lawsuit after two employees were dismissed because of their race, age, and sex. A black woman filed a suit after her direct supervisor, a regional vice president, said he would like to call her Toby, a slave name which was given to African Kunta Kinte in the TV miniseries Roots. Her co-worker spoke on her behalf, after which she was fired. In 2008, a former African American Starbucks engineer sued the company for discrimination after his supervisor failed to address racist bullying he was experiencing at the workplace, instead giving him extra work due to his complaining. Starbucks settled the suit in 2009. The Equal Employment Opportunity Commission has raised allegations against Starbucks for racial bias in its promotions, allegedly based on workforce data from 2007 to 2011 that showed that minority retail partners in the United States received fewer promotions than statistically expected. The 2015 Starbucks \"Race Together\" campaign, when baristas were instructed to write the phrase \"Race Together\" on customer's cups with the aim to start a national dialogue about race, was heavily criticized and received backlash. In 2020, employees were prohibited from wearing Black Lives Matter symbols or phrases on their clothing or accessories. Individual Starbucks cafes have faced criticism over incidents of racial bias, leading the company to close 8,000 cafes for a day in 2018 for racial bias training. In 2014, a Milwaukee Starbucks employee called the police when they noticed a black man sleeping in a park, which resulted in the police officer killing the man by shooting him 14 times, prompting protests. In 2018, two black men were arrested and escorted out of a Philadelphia Starbucks after the staff called the police because they refused to leave. The video of the incident quickly became viral and sparked widespread outrage. In another 2018 incident, a black man was denied the code for the restroom for not being a customer, even though at the same time a white man was given that code before ordering anything. In 2021, a Starbucks in Ireland was fined €12,000 after an Irish Thai customer received her order with a racist drawing on the cup. Union busting In 2022, over a period of a few months, Starbucks terminated more than 85 workers in the U.S. who had been involved in organizing worker unions against unfair labor practices. The workers had also accused Starbucks of creating a culture of fear and surveillance in the store. In November 2022, the chain announced it would close a location in Seattle that was the first to unionize. It said the closure was due to safety concerns. On December 18, 2022, workers at over 100 stores across the U.S. undertook a three-day strike in response to alleged union busting and to demand better working conditions. Pride/LGBTQ+ In June 2023, Starbucks attracted controversy for allegedly not allowing workers at some locations in 22 states to put up Pride Month decorations. It came during an ongoing public furor over the direction of LGBTQ+ rights in the US, with other major corporations, like Target and AB-InBev, which manufactures Bud Light, also receiving heightened criticism and scrutiny. A strike at some stores was announced as a result. Boycott amidst the 2023 Gaza war In late 2023, Starbucks faced boycotts following the company's decision to sue the Starbucks Workers United (SWU) union for making a social media post stating \"Solidarity with Palestine\" shortly after the October 7 Hamas-led attack on Israel. Starbucks alleged that the post harmed its reputation, and sued for trademark infringement for the use of the Starbucks name and a related logo. The SWU made a filing in response, requesting the continued use of the name and logo, and alleging defamation from Starbucks that it endorsed violence or terrorism. According to SWU President Lynne Fox the post was written by a single person, shortly deleted, and not authorized by other members of the SWU. CEO Laxman Narasimhan wrote a year-ending letter addressed to employees, writing: \"Our stance is clear. We stand for humanity.\" Other controversies In 2025, a court ordered Starbucks to pay $50 million to a driver who suffered burns after an unsecured hot drink spilled on him. On Red Cup Day, Starbucks provides reusable cups to customers who buy holiday-themed beverages. On Red Cup Day 2025, Starbucks employees organized a walkout at 4 p.m. local time in over a dozen U.S. cities as part of a strike known as the Red Cup Riot, involving approximately 1,000 baristas. This phase of the strike includes participation from more than 65 locations across over 40 cities. The baristas are advocating for enhanced wages, better working conditions, and reliable and adequate hours."
}