{
  "ticker": "SCHW",
  "cik": "0000316709",
  "company_name": "Charles Schwab Corporation",
  "corrected_name": "Charles Schwab Corporation",
  "wiki_title_used": "Charles Schwab Corporation",
  "exists": true,
  "raw_text": "The Charles Schwab Corporation is an American multinational financial services company. It offers banking, commercial banking, investing and related services including consulting, and wealth management advisory services to both retail and institutional clients. It is on the list of largest banks in the United States by assets. As of December 31, 2024, it had $10.10 trillion in client assets, 36.5 million active brokerage accounts, 5.4 million workplace retirement plan participant accounts, and 2.0 million banking accounts. It also offers a donor advised fund for clients seeking to donate securities. It was founded in San Francisco, California, and is headquartered in Westlake, Texas. It has over 380 branches, primarily in financial centers in the United States and the United Kingdom. \nFounded as First Commander Corporation in 1971 and renamed to Charles Schwab & Co. in 1973, the company leveraged deregulation of the 1970s to pioneer discount sales of equity securities. After a flagship opening in Sacramento, California, the bank expanded into Seattle before the 1980s economic expansion financed the bank's investments in technology, automation, and digital record keeping. The first to offer round-clock order entry and quotation, it was purchased by Bank of America in 1983 for $55 million. Three years later, the profitability of the bank's no-charge mutual funds prompted the founder to buy his company back for $280 million.\n\nHistory\nIn 1963, Charles R. Schwab and two other partners launched Investment Indicator, an investment newsletter. At its height, the newsletter had 3,000 subscribers, each paying $84 a year to subscribe. In April 1971, the firm was incorporated in California as First Commander Corporation, a wholly owned subsidiary of Commander Industries, Inc., for traditional brokerage services and to publish the Schwab investment newsletter. In November of that year, Schwab and four others purchased all the stock from Commander Industries, Inc., and in 1972, Schwab bought all the stock from what was once Commander Industries. In 1973, the company name changed to Charles Schwab & Co., Inc.\nIn 1975, the U.S. Securities and Exchange Commission allowed negotiated commission rates and Schwab set up a stock brokerage. In September 1975, Schwab opened its first branch in Sacramento, CA, and started offering discount brokerage services. In 1977, Schwab began offering seminars to clients, and by 1978, Schwab had 45,000 client accounts total, doubling to 84,000 in 1979. In 1979, Schwab risked $500,000 on a back-office settlement system called BETA (short for Brokerage Execution and Transaction Analysis), enabling Schwab to become the first discount broker to bring automation in house. In 1980, Schwab established the industry's first 24-hour quotation service, and the total of client accounts grew to 147,000. In 1981, Schwab became a member of the NYSE, and the total of client accounts grew to 222,000. In 1982, Schwab became the first to offer 24/7 order entry and quote service, its first international office was opened in Hong Kong, and the number of client accounts totaled 374,000.\n\nAcquisition by Bank of America and return to independence\nIn 1983, Bank of America acquired Charles Schwab for $55 million. In 1984, the company launched 140 no-load mutual funds. In 1987, management, including Charles R. Schwab, bought the company back from Bank of America for $280 million. In 1991, the company acquired Mayer & Schweitzer, a market making firm, allowing Schwab to execute its customers' orders without sending them to an exchange. In 1997, it was fined $200,000 for failing to arrange the best trades for its customers. The unit was renamed Schwab Capital Markets in 2000. In 1993, the company opened an office in London.\nIn 1995, Schwab acquired The Hampton Company, founded by Walter W. Bettinger, who became Schwab's CEO in 2008. The following year in 1996, they launched Web trading, letting customers trade listed and OTC stocks and check balances and order statuses on their website. Dissatisfied with its in-house design, the company hired Razorfish to overhaul the site. This redesign later appeared in the Cooper-Hewitt Museum's inaugural National Design Triennial. In 2000, Schwab purchased U.S. Trust for $2.73 billion. Less than a year later, U.S. Trust was fined $10 million for violating bank secrecy laws. It was ordered to pay $5 million to the New York State Banking Department and $5 million to the Federal Reserve Board. On November 20, 2006, Schwab announced agreed to sell U.S. Trust to Bank of America for $3.3 billion in cash. The deal closed in the second quarter of 2007.\nIn January 2004, Schwab acquired SoundView Technology Group for $345 million to add equity research capabilities. David S. Pottruck, who had spent the majority of his 20 years at the brokerage as Charles R. Schwab's right-hand man, shared the CEO title with the company's founder from 1998 to 2003. In May 2003, Mr. Schwab stepped down, and gave Pottruck sole control as CEO. On July 24, 2004, the company's board fired Pottruck, replacing him with its founder and namesake. News of Pottruck's removal came as the firm had announced that overall profit had dropped 10%, to $113 million, for the second quarter, driven largely by a 26% decline in revenue from customer stock trading.\nAfter coming back into control, Mr. Schwab conceded that the company had \"lost touch with our heritage\", and quickly refocused the business on providing financial advice to individual investors. He also rolled back Pottruck's fee hikes. The company rebounded, and earnings began to turn around in 2005, as did the stock. The share price was up as high as 151% since Pottruck's removal, ten times since the return of Charles Schwab. The company's net transfer assets, or assets that come from other firms, quadrupled from 2004 to 2008. Schwab's YieldPlus fund drew controversy during the 2008 financial crisis because of its -31.7% return. Investors in the Schwab YieldPlus Fund, including Charles Schwab himself, lost $1.1 billion. Schwab closed the YieldPlus funds in 2011. In April 2007, the company acquired The 401(k) Company.\n\nSwitch to NASDAQ\nOn December 15, 2005, Charles Schwab announced that it would transition from a dual listing on both the New York Stock Exchange and the NASDAQ to exclusively listing its common stock on the NASDAQ and change its symbol from \"SCH\" to \"SCHW\" starting December 20, 2005 at the stock market open.\nOn July 22, 2008, Walter W. Bettinger, the previous chief operating officer, was named chief executive, succeeding the company's namesake. Charles R. Schwab remained executive chairman of the company and said that he would \"continue to serve as a very active chairman\".\nOn February 22, 2010, Charles Schwab switched its stock exchange listing back to the New York Stock Exchange.\nIn 2011, the company acquired OptionsXpress. The company also acquired Compliance11, Inc., a provider of compliance software. In 2012, it acquired ThomasPartners, an asset management firm.\nOn July 1, 2020, the company acquired Wasmer, Schroeder & Company, an independent investment manager of fixed income in separately managed accounts with $10.7 billion in assets under management.\nOn May 26, 2020, the company acquired USAA's investment management accounts for $1.8 billion in cash.\nIn June 2020, the company began allowing investors to purchase fractional shares.\n\nAcquisition of TD Ameritrade\nOn October 6, 2020, the company acquired TD Ameritrade. As part of the acquisition, Toronto-Dominion Bank acquired around a 12% stake in the company. Soon after, Schwab began the process of transitioning TD Ameritrade accounts to Charles Schwab; once this was finished, TD Ameritrade was shut down in May 2024. In early 2025, TD Bank sold its stake in Schwab.\nEffective on January 1, 2021, the company moved its headquarters from San Francisco, California to Westlake, Texas.\nOn January 1, 2025, Rick Wurster assumed the CEO position of the company, replacing the retiring Walt Bettinger.\nIn November 2025, the company agreed to acquire Forge Global, a private shares platform, in a deal worth $660 million.\n\nSenior leadership\nChairman: Charles R. Schwab (since 1971)\nChief Executive: Richard A. Wurster (since 2025)\n\nList of former chief executives\nCharles R. Schwab (1971–1998)\nCharles R. Schwab and David S. Pottruck (1998–2003); co-CEO's\nDavid S. Pottruck (2003–2004)\nCharles R. Schwab (2004–2008); second term\nWalter W. Bettinger II (2008-2024)\n\nMarketing\nIn 2004, Charles Schwab chose Havas Worldwide (then called Euro RSCG) as its full-service advertising agency. The company launched a series of television ads featuring the slogan Talk to Chuck by Euro RSCG and directed/animated by Bob Sabiston's Flat Black Films in 2005. \"Talk to Chuck\" campaign appeared in print media, online, billboards, and branch offices. A blog post in The Wall Street Journal described the ads as effective because they included a single memorable phrase. In February 2013, Schwab hired Crispin Porter + Bogusky (CP+B) as its lead creative agency with Havas Worldwide remaining to create ads for ActiveTrader and optionsXpress. The company launched an advertising campaign by CP+B with the slogan Own Your Tomorrow that same year. In March 2015, Adweek reported on marketing material created by CP+B for Schwab's Intelligent Portfolio service.\n\nControversies\nFailure to disclose robo-advisor fees and allocations\nIn June 2022, the U.S. Securities and Exchange Commission ordered the company to pay $187 million to settle its charges for failing to disclose fund allocations and fees for its robo-advisor clients. It was determined that between March 2015 to November 2018, Charles Schwab misled customers and prospective investors by allowing them to believe that its robo-advisor service had no hidden fees, and it did not inform the clients about the cash drag on their investments. The SEC stated that the company has made money from cash allocations in the robo-advisor portfolios by sweeping cash to its affiliated bank, loaning it out, and keeping the difference between the interest it earned on the loans and what it paid in interest to the robo-advisor clients.\n\nSee also\nList of largest banks in the United States\nDeregulation in the United States\nFinancial District, San Francisco\n\nReferences\nFurther reading\nCronin, Mary J. Banking and Finance on the Internet (John Wiley & Sons, 1998). online\nIngham, John N., and Lynne B. Feldman. Contemporary American business leaders: a biographical dictionary (Greenwood, 1990). pp 566–71.\nKador, John. Charles Schwab: How one company beat Wall Street and reinvented the brokerage industry (John Wiley & Sons, 2002).excerpt\nSilver, A. David. Entrepreneurial Megabucks: The 100 Greatest Entrepreneurs of the Last 25 Years (1985).\nWillis, Rod. \"Charles Schwab: High-Tech Horatio Alger?\" Management Review (Sept. 1986) 75#9 pp. 17–20.\n\nExternal links\nOfficial website\nBusiness data for Charles Schwab Corporation:",
  "clean_text": "The Charles Schwab Corporation is an American multinational financial services company. It offers banking, commercial banking, investing and related services including consulting, and wealth management advisory services to both retail and institutional clients. It is on the list of largest banks in the United States by assets. As of December 31, 2024, it had $10.10 trillion in client assets, 36.5 million active brokerage accounts, 5.4 million workplace retirement plan participant accounts, and 2.0 million banking accounts. It also offers a donor advised fund for clients seeking to donate securities. It was founded in San Francisco, California, and is headquartered in Westlake, Texas. It has over 380 branches, primarily in financial centers in the United States and the United Kingdom. Founded as First Commander Corporation in 1971 and renamed to Charles Schwab & Co. in 1973, the company leveraged deregulation of the 1970s to pioneer discount sales of equity securities. After a flagship opening in Sacramento, California, the bank expanded into Seattle before the 1980s economic expansion financed the bank's investments in technology, automation, and digital record keeping. The first to offer round-clock order entry and quotation, it was purchased by Bank of America in 1983 for $55 million. Three years later, the profitability of the bank's no-charge mutual funds prompted the founder to buy his company back for $280 million. History In 1963, Charles R. Schwab and two other partners launched Investment Indicator, an investment newsletter. At its height, the newsletter had 3,000 subscribers, each paying $84 a year to subscribe. In April 1971, the firm was incorporated in California as First Commander Corporation, a wholly owned subsidiary of Commander Industries, Inc., for traditional brokerage services and to publish the Schwab investment newsletter. In November of that year, Schwab and four others purchased all the stock from Commander Industries, Inc., and in 1972, Schwab bought all the stock from what was once Commander Industries. In 1973, the company name changed to Charles Schwab & Co., Inc. In 1975, the U.S. Securities and Exchange Commission allowed negotiated commission rates and Schwab set up a stock brokerage. In September 1975, Schwab opened its first branch in Sacramento, CA, and started offering discount brokerage services. In 1977, Schwab began offering seminars to clients, and by 1978, Schwab had 45,000 client accounts total, doubling to 84,000 in 1979. In 1979, Schwab risked $500,000 on a back-office settlement system called BETA (short for Brokerage Execution and Transaction Analysis), enabling Schwab to become the first discount broker to bring automation in house. In 1980, Schwab established the industry's first 24-hour quotation service, and the total of client accounts grew to 147,000. In 1981, Schwab became a member of the NYSE, and the total of client accounts grew to 222,000. In 1982, Schwab became the first to offer 24/7 order entry and quote service, its first international office was opened in Hong Kong, and the number of client accounts totaled 374,000. Acquisition by Bank of America and return to independence In 1983, Bank of America acquired Charles Schwab for $55 million. In 1984, the company launched 140 no-load mutual funds. In 1987, management, including Charles R. Schwab, bought the company back from Bank of America for $280 million. In 1991, the company acquired Mayer & Schweitzer, a market making firm, allowing Schwab to execute its customers' orders without sending them to an exchange. In 1997, it was fined $200,000 for failing to arrange the best trades for its customers. The unit was renamed Schwab Capital Markets in 2000. In 1993, the company opened an office in London. In 1995, Schwab acquired The Hampton Company, founded by Walter W. Bettinger, who became Schwab's CEO in 2008. The following year in 1996, they launched Web trading, letting customers trade listed and OTC stocks and check balances and order statuses on their website. Dissatisfied with its in-house design, the company hired Razorfish to overhaul the site. This redesign later appeared in the Cooper-Hewitt Museum's inaugural National Design Triennial. In 2000, Schwab purchased U.S. Trust for $2.73 billion. Less than a year later, U.S. Trust was fined $10 million for violating bank secrecy laws. It was ordered to pay $5 million to the New York State Banking Department and $5 million to the Federal Reserve Board. On November 20, 2006, Schwab announced agreed to sell U.S. Trust to Bank of America for $3.3 billion in cash. The deal closed in the second quarter of 2007. In January 2004, Schwab acquired SoundView Technology Group for $345 million to add equity research capabilities. David S. Pottruck, who had spent the majority of his 20 years at the brokerage as Charles R. Schwab's right-hand man, shared the CEO title with the company's founder from 1998 to 2003. In May 2003, Mr. Schwab stepped down, and gave Pottruck sole control as CEO. On July 24, 2004, the company's board fired Pottruck, replacing him with its founder and namesake. News of Pottruck's removal came as the firm had announced that overall profit had dropped 10%, to $113 million, for the second quarter, driven largely by a 26% decline in revenue from customer stock trading. After coming back into control, Mr. Schwab conceded that the company had \"lost touch with our heritage\", and quickly refocused the business on providing financial advice to individual investors. He also rolled back Pottruck's fee hikes. The company rebounded, and earnings began to turn around in 2005, as did the stock. The share price was up as high as 151% since Pottruck's removal, ten times since the return of Charles Schwab. The company's net transfer assets, or assets that come from other firms, quadrupled from 2004 to 2008. Schwab's YieldPlus fund drew controversy during the 2008 financial crisis because of its -31.7% return. Investors in the Schwab YieldPlus Fund, including Charles Schwab himself, lost $1.1 billion. Schwab closed the YieldPlus funds in 2011. In April 2007, the company acquired The 401(k) Company. Switch to NASDAQ On December 15, 2005, Charles Schwab announced that it would transition from a dual listing on both the New York Stock Exchange and the NASDAQ to exclusively listing its common stock on the NASDAQ and change its symbol from \"SCH\" to \"SCHW\" starting December 20, 2005 at the stock market open. On July 22, 2008, Walter W. Bettinger, the previous chief operating officer, was named chief executive, succeeding the company's namesake. Charles R. Schwab remained executive chairman of the company and said that he would \"continue to serve as a very active chairman\". On February 22, 2010, Charles Schwab switched its stock exchange listing back to the New York Stock Exchange. In 2011, the company acquired OptionsXpress. The company also acquired Compliance11, Inc., a provider of compliance software. In 2012, it acquired ThomasPartners, an asset management firm. On July 1, 2020, the company acquired Wasmer, Schroeder & Company, an independent investment manager of fixed income in separately managed accounts with $10.7 billion in assets under management. On May 26, 2020, the company acquired USAA's investment management accounts for $1.8 billion in cash. In June 2020, the company began allowing investors to purchase fractional shares. Acquisition of TD Ameritrade On October 6, 2020, the company acquired TD Ameritrade. As part of the acquisition, Toronto-Dominion Bank acquired around a 12% stake in the company. Soon after, Schwab began the process of transitioning TD Ameritrade accounts to Charles Schwab; once this was finished, TD Ameritrade was shut down in May 2024. In early 2025, TD Bank sold its stake in Schwab. Effective on January 1, 2021, the company moved its headquarters from San Francisco, California to Westlake, Texas. On January 1, 2025, Rick Wurster assumed the CEO position of the company, replacing the retiring Walt Bettinger. In November 2025, the company agreed to acquire Forge Global, a private shares platform, in a deal worth $660 million. Senior leadership Chairman: Charles R. Schwab (since 1971) Chief Executive: Richard A. Wurster (since 2025) List of former chief executives Charles R. Schwab (1971–1998) Charles R. Schwab and David S. Pottruck (1998–2003); co-CEO's David S. Pottruck (2003–2004) Charles R. Schwab (2004–2008); second term Walter W. Bettinger II (2008-2024) Marketing In 2004, Charles Schwab chose Havas Worldwide (then called Euro RSCG) as its full-service advertising agency. The company launched a series of television ads featuring the slogan Talk to Chuck by Euro RSCG and directed/animated by Bob Sabiston's Flat Black Films in 2005. \"Talk to Chuck\" campaign appeared in print media, online, billboards, and branch offices. A blog post in The Wall Street Journal described the ads as effective because they included a single memorable phrase. In February 2013, Schwab hired Crispin Porter + Bogusky (CP+B) as its lead creative agency with Havas Worldwide remaining to create ads for ActiveTrader and optionsXpress. The company launched an advertising campaign by CP+B with the slogan Own Your Tomorrow that same year. In March 2015, Adweek reported on marketing material created by CP+B for Schwab's Intelligent Portfolio service. Controversies Failure to disclose robo-advisor fees and allocations In June 2022, the U.S. Securities and Exchange Commission ordered the company to pay $187 million to settle its charges for failing to disclose fund allocations and fees for its robo-advisor clients. It was determined that between March 2015 to November 2018, Charles Schwab misled customers and prospective investors by allowing them to believe that its robo-advisor service had no hidden fees, and it did not inform the clients about the cash drag on their investments. The SEC stated that the company has made money from cash allocations in the robo-advisor portfolios by sweeping cash to its affiliated bank, loaning it out, and keeping the difference between the interest it earned on the loans and what it paid in interest to the robo-advisor clients."
}