{
  "ticker": "SHW",
  "cik": "0000089800",
  "company_name": "Sherwin-Williams",
  "corrected_name": "Sherwin-Williams",
  "wiki_title_used": "Sherwin-Williams",
  "exists": true,
  "raw_text": "Sherwin-Williams is an American paints and coatings company based in Cleveland, Ohio. It is primarily engaged in the manufacture, distribution, and sale of paints, coatings, floorcoverings, and related products with operations in over 120 countries. As of 2024, it is the largest coatings company in the world by revenue.\n\nHistory\nSherwin-Williams dates from 1866, when Cleveland bookkeeper Henry Sherwin invested in Truman Dunham & Co., a paint distributorship. After the partnership dissolved in 1870, he formed Sherwin, Williams, & Co. with Edward Williams and A.T. Osborn. For its first factory, in 1873 the company acquired a cooperage in Cleveland from Standard Oil.\nSherwin-Williams was incorporated in Ohio on July 16, 1884, two years after Osborn sold his interest in the company while retaining the retail operations. The company grew through acquisitions and expansions in the late 19th and early 20th century. In the early 1920s, the company became the largest coatings manufacturer in the U.S.\nSherwin-Williams experienced a downturn in the 1970s, and Gulf and Western Industries unsuccessfully attempted to take over. The company recovered by fending off the raid and undergoing a series of acquisitions in the 1980s and 1990s, as well as divesting its non-coatings businesses.  In 1995, it employed 18,000 people, including 3,200 in Ohio. By 2002, the company operated more than 2,500 stores.\nIn November 2024, the company was added to the Dow Jones Industrial Average.\n\nGlobal headquarters\nIn 1930, Sherwin-Williams moved its headquarters to Cleveland's Midland Building, where it would stay for over 75 years.\nIn September 2019, the company announced that it would move its headquarters to a larger site, and in February 2020, confirmed it would remain in the Cleveland area. That month, the company also began work on a new R&D center in Brecksville, OH. The new headquarters's location was clarified in March 2020, with the company committing to constructing a new building complex, also in Downtown Cleveland. The downtown HQ was originally projected to open in 2023, but a construction pause due to the COVID-19 pandemic delayed the projected opening until 2024. The company is investing $600 million (US) in its new facilities, providing working space for 3,500 employees.\n\nNotable innovations\nIn 1875, Sherwin-Williams started selling ready-mixed paint. Previously, consumers bought paint ingredients that they themselves would mix together.\nIn the 1940s, Sherwin-Williams introduced Kem-Tone, a water-based fast-drying interior paint. In 1996, the American Chemical Society named the product a National Historic Chemical Landmark.\nIn 2016, the first paint registered as microbicidal with the United States Environmental Protection Agency was brought to market by Sherwin-Williams.\n\nOther acquisitions\nIn 2004, Sherwin-Williams acquired Paint Sundry Brands for $295 million and Duron Inc. for $253 million.\nIn June 2007, Sherwin-Williams announced that it had completed an acquisition of M.A. Bruder & Sons, a manufacturer and distributor of paints and coatings.\nOn July 6, 2011, Sherwin-Williams acquired Leighs Paints, based in Bolton UK, manufacturers of intumescent and high performance industrial coatings.\nOn June 4, 2012, Sherwin-Williams acquired Geocel Holdings Corp for an undisclosed amount. Sherwin-Williams acquired the Valspar Corporation on March 20, 2016, for $11.3 billion.\nIn April 2022, the company announced that it had completed an acquisition of the European industrial coatings business of Sika AG. In June 2022, the company agreed to acquire Gross & Perthun GmbH. This Germany-based distributor primarily manufactures and distributes coatings for the heavy equipment and transportation industries.\nSherwin-Williams has created more than 35,000 color names for paint over its history, and as of 2023, it has nearly 200 distinct shades of white classified as either warm or cool.\n\nCorporate structure\nFounded by Henry Sherwin and Edward Williams in Cleveland in 1866, the company operates through three segments: The Paint Stores Group, Consumer Brands Group, and Performance Coatings Group.\n\nPaint Stores Group\nPaint Stores Group, formerly the Americas Group, was the first section of the company to be established, in 1866. These stores market and sell Sherwin-Williams branded architectural paints and coatings, industrial and marine products, floorcovering, and related equipment and supplies.  As of the end of 2019, Paint Stores Group had expanded to 4,758 stores, including more than 135 floorcovering centers.\n\nConsumer Brands Group\nThe Consumer Brands Group develops, manufactures, and distributes various paints, coatings, and related products, under the brand names of Anthony Angelillo, Bestt Liebco, Cabot, Dupli-Color, Duron, Dutch Boy, Frazee, Geocel, Guangdong Huarun Paints, H&C, HGTV Home, Kool Seal, Krylon, MAB, Martin-Senour, Mautz, Minwax, Pratt & Lambert, Purdy, Ronseal, Thompson's WaterSeal, Uniflex, Valspar, and White Lightning to third party customers in addition to overseeing the operations maintained by the Paint Stores Group.\nOn August 28, 2007, Sherwin Williams purchased Columbia Paint & Coatings. On July 6, 2011, Sherwin-Williams acquired Leighs Paints, based in Bolton UK, manufacturers of intumescent and high performance industrial coatings. In late 2012, Sherwin Williams began the process of purchasing the Comex Group.  Comex was the 4th largest paint manufacturer in North America. After Mexican antitrust regulators voted against the deal twice, Sherwin-Williams bought Comex's US and Canadian divisions for $165 million on September 16, 2013. PPG, US-based paint and coating company, acquired Comex's Mexican division for $2.3 billion.  In March 2016, it was announced that Valspar would be acquired for $9.3 billion. The merger was finalized 1 June 2017.\n\nPerformance Coatings Group\nThe Performance Coatings Group sells coatings and finishes to industrial, wood furniture manufacturing, marine, packaging, and automotive markets in more than 110 countries. The Group also contains Valspar's automotive refinishes business.\n\nControversies\nAdvertising\nA billboard near the center-field fence of  Angel Stadium in Anaheim, California featured a giant paint can. In 2014, the owner of the billboard offered to donate $1 million to the Angels Baseball Foundation if a home run ball landed in the can on the fly, though the requirement the ball land on the fly was not noted on the billboard as the billboard simply stated “Angels home run in the can $1,000,000”. On September 19, 2017, a home run ball landed in the can after bouncing. Some commentators were upset that a donation wasn't made \"due to a lame technicality\", causing a public relations embarrassment.\nIn November 2020, the company fired employee Tony Piloseno, who'd amassed over 1.4 million viewers on his TikTok paint mixing channel, Tonesterpaints, for alleged misconduct. The company was criticized for their perceived mishandling of the situation with critics believing the company failed to realize the marketing opportunity they'd just lost. Piloseno received multiple offers of employment from Sherwin-Williams' industry rivals and took up a position with Florida Paints where he will have his own art studio and develop his own custom range of paints. Commentators pointed out the differing reaction the company had after going viral when compared to other companies such as Ocean Spray, who had positively reacted to going viral on the TikTok platform.\n\nLead paint\nIn January 2014, the Santa Clara County Superior Court ruled that Sherwin-Williams, NL Industries and ConAgra were jointly and severally liable for $1.15 billion, to be paid into a lead paint abatement fund to be used to remove lead paint from older housing. The judge ruled that the paint companies manufactured, marketed, and sold lead paint without disclosing the health risks to the consumers in spite of \"actual and constructive knowledge that it was harmful\".  In March 2014 Sherwin-Williams was denied a new trial. In July 2019, a $305 million settlement was reached.\nIn 2018, multiple counties in Pennsylvania sued Sherwin-Williams over lead paint matters. Sherwin-Williams attempted to counter-sue, but that attempt was denied in October 2019, and the denial was upheld in July 2020.\n\nPollution\nOn April 9, 2018, Milwaukee Mayor Tom Barrett and representing attorneys uncovered that Sherwin-Williams tried to \"shift the blame to contaminated water in an effort\" to avoid having to pay tens of millions of dollars in settlements. Almost 170 children had been affected by the potentially fatal lead poisoning.\nIn December 2019, Sherwin-Williams was sued by New Jersey for discharging industrial waste from three sites and failing to disclose the pollution to the New Jersey Department of Environmental Protection.\n\nUnderpayment\nIn May 2020, Sherwin-Williams agreed to pay $3.6M to settle a lawsuit brought by workers in California alleging underpayment of wages and failure to provide obligatory meal or rest breaks.\n\nWater-based paint\nStarting in 2008, businessman John Tyczki entered into an agreement with Sherwin-Williams on the basis of assurances provided by Sherwin-Williams about its water-based paint products. When the products failed to live up to these assurances, causing ongoing problems for his business, Tyczki sued Sherwin-Williams and was awarded $2.88M.\n\nAwards and recognition\nOn June 20, 2011, Computerworld named The Sherwin-Williams Company the #58 Best Place to Work in IT.\nIn 2015, Sherwin-Williams was recognized as the most used brand as well as the winner for brand familiarity and quality rating in the Paints category by Builder magazine.\nAs of 2018, Sherwin-Williams was ranked 190th on the Fortune 500 list of the largest United States corporations by revenue.\n\nSee also\nLead hydrogen arsenate § Safety, depicts an ad for a now-banned Sherwin-Williams pesticide\nPollution in Door County, Wisconsin § Soils and groundwater\n\nReferences\nFurther reading\nMcDemott, Kathleen; Dyer, Davis (1991). America's Paint Company: A History of Sherwin-Williams. Sherwin-Williams. LCCN 91-62014. OCLC 24646956.\nThe Sherwin Williams Home Decorator and Color Guide (1939) Kenneth Franzheim II Rare Books Room, William R. Jenkins Architecture and Art Library, University of Houston Digital Library.\nRabin, R (December 1989). \"Warnings unheeded: a history of child lead poisoning\". American Journal of Public Health. 79 (12): 1668–1674. doi:10.2105/ajph.79.12.1668. PMC 1349776. PMID 2683817.\n\nExternal links\n\nOfficial website\nBusiness data for The Sherwin-Williams Company:",
  "clean_text": "Sherwin-Williams is an American paints and coatings company based in Cleveland, Ohio. It is primarily engaged in the manufacture, distribution, and sale of paints, coatings, floorcoverings, and related products with operations in over 120 countries. As of 2024, it is the largest coatings company in the world by revenue. History Sherwin-Williams dates from 1866, when Cleveland bookkeeper Henry Sherwin invested in Truman Dunham & Co., a paint distributorship. After the partnership dissolved in 1870, he formed Sherwin, Williams, & Co. with Edward Williams and A.T. Osborn. For its first factory, in 1873 the company acquired a cooperage in Cleveland from Standard Oil. Sherwin-Williams was incorporated in Ohio on July 16, 1884, two years after Osborn sold his interest in the company while retaining the retail operations. The company grew through acquisitions and expansions in the late 19th and early 20th century. In the early 1920s, the company became the largest coatings manufacturer in the U.S. Sherwin-Williams experienced a downturn in the 1970s, and Gulf and Western Industries unsuccessfully attempted to take over. The company recovered by fending off the raid and undergoing a series of acquisitions in the 1980s and 1990s, as well as divesting its non-coatings businesses. In 1995, it employed 18,000 people, including 3,200 in Ohio. By 2002, the company operated more than 2,500 stores. In November 2024, the company was added to the Dow Jones Industrial Average. Global headquarters In 1930, Sherwin-Williams moved its headquarters to Cleveland's Midland Building, where it would stay for over 75 years. In September 2019, the company announced that it would move its headquarters to a larger site, and in February 2020, confirmed it would remain in the Cleveland area. That month, the company also began work on a new R&D center in Brecksville, OH. The new headquarters's location was clarified in March 2020, with the company committing to constructing a new building complex, also in Downtown Cleveland. The downtown HQ was originally projected to open in 2023, but a construction pause due to the COVID-19 pandemic delayed the projected opening until 2024. The company is investing $600 million (US) in its new facilities, providing working space for 3,500 employees. Notable innovations In 1875, Sherwin-Williams started selling ready-mixed paint. Previously, consumers bought paint ingredients that they themselves would mix together. In the 1940s, Sherwin-Williams introduced Kem-Tone, a water-based fast-drying interior paint. In 1996, the American Chemical Society named the product a National Historic Chemical Landmark. In 2016, the first paint registered as microbicidal with the United States Environmental Protection Agency was brought to market by Sherwin-Williams. Other acquisitions In 2004, Sherwin-Williams acquired Paint Sundry Brands for $295 million and Duron Inc. for $253 million. In June 2007, Sherwin-Williams announced that it had completed an acquisition of M.A. Bruder & Sons, a manufacturer and distributor of paints and coatings. On July 6, 2011, Sherwin-Williams acquired Leighs Paints, based in Bolton UK, manufacturers of intumescent and high performance industrial coatings. On June 4, 2012, Sherwin-Williams acquired Geocel Holdings Corp for an undisclosed amount. Sherwin-Williams acquired the Valspar Corporation on March 20, 2016, for $11.3 billion. In April 2022, the company announced that it had completed an acquisition of the European industrial coatings business of Sika AG. In June 2022, the company agreed to acquire Gross & Perthun GmbH. This Germany-based distributor primarily manufactures and distributes coatings for the heavy equipment and transportation industries. Sherwin-Williams has created more than 35,000 color names for paint over its history, and as of 2023, it has nearly 200 distinct shades of white classified as either warm or cool. Corporate structure Founded by Henry Sherwin and Edward Williams in Cleveland in 1866, the company operates through three segments: The Paint Stores Group, Consumer Brands Group, and Performance Coatings Group. Paint Stores Group Paint Stores Group, formerly the Americas Group, was the first section of the company to be established, in 1866. These stores market and sell Sherwin-Williams branded architectural paints and coatings, industrial and marine products, floorcovering, and related equipment and supplies. As of the end of 2019, Paint Stores Group had expanded to 4,758 stores, including more than 135 floorcovering centers. Consumer Brands Group The Consumer Brands Group develops, manufactures, and distributes various paints, coatings, and related products, under the brand names of Anthony Angelillo, Bestt Liebco, Cabot, Dupli-Color, Duron, Dutch Boy, Frazee, Geocel, Guangdong Huarun Paints, H&C, HGTV Home, Kool Seal, Krylon, MAB, Martin-Senour, Mautz, Minwax, Pratt & Lambert, Purdy, Ronseal, Thompson's WaterSeal, Uniflex, Valspar, and White Lightning to third party customers in addition to overseeing the operations maintained by the Paint Stores Group. On August 28, 2007, Sherwin Williams purchased Columbia Paint & Coatings. On July 6, 2011, Sherwin-Williams acquired Leighs Paints, based in Bolton UK, manufacturers of intumescent and high performance industrial coatings. In late 2012, Sherwin Williams began the process of purchasing the Comex Group. Comex was the 4th largest paint manufacturer in North America. After Mexican antitrust regulators voted against the deal twice, Sherwin-Williams bought Comex's US and Canadian divisions for $165 million on September 16, 2013. PPG, US-based paint and coating company, acquired Comex's Mexican division for $2.3 billion. In March 2016, it was announced that Valspar would be acquired for $9.3 billion. The merger was finalized 1 June 2017. Performance Coatings Group The Performance Coatings Group sells coatings and finishes to industrial, wood furniture manufacturing, marine, packaging, and automotive markets in more than 110 countries. The Group also contains Valspar's automotive refinishes business. Controversies Advertising A billboard near the center-field fence of Angel Stadium in Anaheim, California featured a giant paint can. In 2014, the owner of the billboard offered to donate $1 million to the Angels Baseball Foundation if a home run ball landed in the can on the fly, though the requirement the ball land on the fly was not noted on the billboard as the billboard simply stated “Angels home run in the can $1,000,000”. On September 19, 2017, a home run ball landed in the can after bouncing. Some commentators were upset that a donation wasn't made \"due to a lame technicality\", causing a public relations embarrassment. In November 2020, the company fired employee Tony Piloseno, who'd amassed over 1.4 million viewers on his TikTok paint mixing channel, Tonesterpaints, for alleged misconduct. The company was criticized for their perceived mishandling of the situation with critics believing the company failed to realize the marketing opportunity they'd just lost. Piloseno received multiple offers of employment from Sherwin-Williams' industry rivals and took up a position with Florida Paints where he will have his own art studio and develop his own custom range of paints. Commentators pointed out the differing reaction the company had after going viral when compared to other companies such as Ocean Spray, who had positively reacted to going viral on the TikTok platform. Lead paint In January 2014, the Santa Clara County Superior Court ruled that Sherwin-Williams, NL Industries and ConAgra were jointly and severally liable for $1.15 billion, to be paid into a lead paint abatement fund to be used to remove lead paint from older housing. The judge ruled that the paint companies manufactured, marketed, and sold lead paint without disclosing the health risks to the consumers in spite of \"actual and constructive knowledge that it was harmful\". In March 2014 Sherwin-Williams was denied a new trial. In July 2019, a $305 million settlement was reached. In 2018, multiple counties in Pennsylvania sued Sherwin-Williams over lead paint matters. Sherwin-Williams attempted to counter-sue, but that attempt was denied in October 2019, and the denial was upheld in July 2020. Pollution On April 9, 2018, Milwaukee Mayor Tom Barrett and representing attorneys uncovered that Sherwin-Williams tried to \"shift the blame to contaminated water in an effort\" to avoid having to pay tens of millions of dollars in settlements. Almost 170 children had been affected by the potentially fatal lead poisoning. In December 2019, Sherwin-Williams was sued by New Jersey for discharging industrial waste from three sites and failing to disclose the pollution to the New Jersey Department of Environmental Protection. Underpayment In May 2020, Sherwin-Williams agreed to pay $3.6M to settle a lawsuit brought by workers in California alleging underpayment of wages and failure to provide obligatory meal or rest breaks. Water-based paint Starting in 2008, businessman John Tyczki entered into an agreement with Sherwin-Williams on the basis of assurances provided by Sherwin-Williams about its water-based paint products. When the products failed to live up to these assurances, causing ongoing problems for his business, Tyczki sued Sherwin-Williams and was awarded $2.88M. Awards and recognition On June 20, 2011, Computerworld named The Sherwin-Williams Company the #58 Best Place to Work in IT. In 2015, Sherwin-Williams was recognized as the most used brand as well as the winner for brand familiarity and quality rating in the Paints category by Builder magazine. As of 2018, Sherwin-Williams was ranked 190th on the Fortune 500 list of the largest United States corporations by revenue."
}