{
  "ticker": "SJM",
  "cik": "0000091419",
  "company_name": "J.M. Smucker Company (The)",
  "corrected_name": "The J. M. Smucker Company",
  "wiki_title_used": "The J. M. Smucker Company",
  "exists": true,
  "raw_text": "The J.M. Smucker Company, also known as Smucker's, is an American manufacturer of food and beverage products. Headquartered in Orrville, Ohio, the company was founded in 1897 as a maker of apple butter. J.M. Smucker currently has three major business units: consumer foods, pet foods, and coffee. Its flagship brand, Smucker's, produces fruit preserves, peanut butter, syrups, frozen crustless sandwiches, and ice cream toppings.\nAmong J.M. Smucker's other food and coffee brands are Bick's Pickle, Café Bustelo, Carnation Milk (Canada), Crosse & Blackwell, Dunkin', Five Roses (Canada), Folgers, Golden Temple (Canada), Jif, Knott's Berry Farm, Laura Scudder's, Robin Hood (Canada), Santa Cruz Organic, and Smucker's Uncrustables. Pet food brands include Meow Mix and Milk-Bone, among others. In 2023, Smuckers acquired Hostess Brands, the makers of Twinkies, in a $5.6 billion cash and stock deal. Listed on the New York Stock Exchange (ticker symbol: SJM), J.M. Smucker ranks 426th on the Fortune 500, with an estimated 2022 market value of $14.6 billion.\n\nHistory\nFounding (1897–1958)\nThe J.M. Smucker Company was founded in 1897 by Jerome Monroe Smucker. Smucker was born on December 5, 1858, in Orrville, Ohio, and much of his life was spent as a farmer in Orrville. In 1897 Smucker built a cider mill in Orrville. The company, which came to produce jellies, jams, and other food items, has stated that he used apples from local Orrville trees planted by Johnny Appleseed in the early nineteenth century. Smucker prepared apple butter and sold it from the back of a horse-drawn wagon. \n\nThe company was incorporated in 1921. At the time, the company sold preserves and jellies, and by 1928 was distributing in Ohio, Pennsylvania, and Indiana. After the company recorded losses in 1932 and 1933, in 1935 Smucker's eldest son Willard established a Smucker's plant in the state of Washington for pre-processing apples, which were then shipped to Orrville to be cooked. After introducing its trademark glass jar in 1939, annual sales reached $1 million. In 1940, Smucker's introduced its first line of ice cream toppings, and two years later began distributing its products nationally. During World War II, the company faced shortages of labor, glass, and fruit. In 1946, Smucker's earned the designation \"U.S. Grade A Fancy\" after it paid U.S. Department of Agriculture inspectors to \"oversee every aspect of its production.\"\n\nNational expansion and IPO (1959–1984)\nThe company went public in 1959, and the following year J.M. Smucker opened a manufacturing plant in Salinas, California that increased its production capacity by 40%. In 1960, Paul Smucker became president and the company hired Wyse Advertising of Cleveland to produce radio spots. J.M. Smucker was then listed on the New York Stock Exchange (NYSE) in 1965.\n1963 saw J.M. Smucker's acquisition of the jams and jellies company Mary Ellen. Profits increased between 1959 and 1969 before dropping in 1970. Between 1973 and 1980, J.M. Smucker implemented cost cutting measures to increase profit margins, acquiring manufacturing operations in Oregon, Tennessee and California and consolidating packing operations. In 1978, J.M. Smucker debuted a low sugar \"spread\" that was so low in sugar the Food and Drug Administration wouldn't allow Smucker's to market it as a jam. J.M. Smucker acquired gourmet preserves company Dickinson's in 1979, and by 1980, J.M. Smucker was the number one jams and jellies company in the United States, with over 25% of the market in the United States.\nIn 1981, Timothy Smucker was named president and the company purchased Magic Shell the following year. After purchasing the pickle companies Wooster Preserving Co. and the H.W. Madison Co. in the 1960s, the company sold its unsuccessful pickle line in the early 1980s. J.M. Smucker in 1984 continued to be traded on the NYSE, with the Smucker family retaining a 30% interest in the business. That year J.M. Smucker acquired the juices company Knudsen & Sons.\n\nDiversification and growth (1980s–2016)\nIn the late 1980s, the company began expanding internationally under CEO Richard Smucker, acquiring brands in Canada, the United States, Australia, and Europe. In 1987 J.M. Smucker purchased R-Line Foods, and in 1988 the company acquired the Canadian toppings brand Shirriff which made products such as Good Morning Marmalade. J.M. Smucker's sales reached $367 million in 1989. In 1989 J.M. Smucker purchased the Australian company Henry Jones Foods, later selling it in 2004 to SPC Ardmona. By 1993, 8% of J.M. Smucker's annual sales were international.\nThe peanut butter company Laura Scudder's and the juice company After the Fall were purchased in 1994, and that year J.M. Smucker also changed advertising agencies from Wyse Advertising to the Leo Burnett Company. The annual Peanut Butter Festival in the town of New Bethlehem, Pennsylvania is co-sponsored by Smucker's. First held in 1996, the festival was held in New Bethlehem because the Smucker's peanut butter factory was the lead employer in the area at the time. In 1998, J.M. Smucker acquired the peanut butter company Adams, as well as the maker of the Incredible Uncrustables frozen crustless sandwich, MenUSAver. J.M. Smucker renamed the product Uncrustables. J.M. Smucker acquired Jif and Crisco in 2002.\nBy 2004, the company was still headquartered in Orrville, Ohio and had been family-run for four generations. Between 1998 and 2004, the company had appeared on Fortune magazine's annual listing of the 100 Best Companies to Work For in the United States each year, ranking number one in 2004. That year the company purchased International Multifoods Corporation. Among the acquired brands in the deal were Pillsbury, Hungry Jack, Pet, Bick's pickles and condiments, and Canadian flour companies Golden Temple, and Robin Hood. In 2006, White Lily Brand was acquired. In 2007, the Canadian flour company Five Roses was acquired. That same year, the company also acquired King Kelly Orange Marmalade, Eagle Family Foods, which brought in the brands Eagle Brand/Borden milk products, None Such mincemeat, and Kava coffee.  \nIn 2008, J.M. Smucker joined the Standard & Poor's 500 Index. That May, J.M. Smucker announced it had bought the food division of Knott's Berry Farm from ConAgra Foods, while Cedar Fair continued to own the theme park itself. That year it also purchased the frozen produce company Europe's Best in Canada and the milk brand Carnation. On November 6, 2008, J.M. Smucker purchased the Folgers coffee brand division from Procter & Gamble for $3.3 billion, acquiring brands such as Millstone Coffee in the process. The Reverse Morris Trust merger doubled J.M. Smucker's size.\nIn 2010, J.M. Smucker acquired Rowland Coffee Roasters, makers of Latin coffee brands, followed by the North American coffee and tea operations of Sara Lee in 2011. J.M. Smucker acquired Big Heart Pet Brands in 2015 for $5.8 billion, bringing in brands such as Milk Bone, Meow Mix, Kibbles ‘n Bits and Pup-Peroni. Also that year, J.M. Smucker announced it would sell its canned milk operations in the United States to Eagle Family Foods Group LLC. In February 2015, J.M Smucker and Keurig partnered together on making K-Cup packs of Dunkin' coffee. Mark Smucker was named CEO in 2016.\n\nRecent (2017–present)\nAfter an antitrust lawsuit filed by the Federal Trade Commission (FTC) in early March 2018, ConAgra Brands Inc. and J. M. Smucker Co. cancelled a deal for Smucker to purchase the Wesson cooking oil brand. The FTC claimed that Smuckers would have controlled at least 70% of the market for branded canola and vegetable oils. As part of a strategy to focus on pet food, coffee, and snacking, on August 31, 2018, J.M. Smucker announced it had sold its baking business in the United States to Brynwood Partners for $375 million, including the brands Pillsbury, Martha White, Hungry Jack, White Lily, and Jim Dandy. The baking business in Canada was retained. The company acquired Ainsworth Pet Nutrition in 2018, including the brands Better Than! Treats, Dad's Pet Care, and Rachael Ray Nutrish, and in October 2018, J.M. Smucker consolidated its $580 million marketing business into Publicis Groupe.\nDuring the COVID-19 pandemic many J.M. Smucker employees began remote work. J.M. Smucker began providing \"pay and benefits to employees to avoid furloughs,\" creating employee hardship and sick leave programs. By August 2020, its international and away-from-home segment had seen a quarterly sales decline of 9%. The Smucker's brand had seen a 25% quarterly increase in sales, Uncrustables had seen a 35% jump, and Crisco had seen a 50% increase. In September 2020, the company announced a new logo and corporate brand identity, with aims to distinguish Smucker the company from Smucker's brand food items. J.M. Smucker Company was shortened to J.M. Smucker Co. In December 2020 J.M. Smucker sold Crisco to B&G Foods for $550 million, part of the company's ongoing plan to divest of baking products in the United States. Overall in 2020, J.M. Smucker had $7.8 billion in net sales, with free cash flow growing 26% from 2019 to $985.5 million. Its US retail consumer foods unit saw a 22% jump in annual profits, while coffee rose 11% and pet food rose 6%. After selling Natural Balance Pet Foods to Nexus Capital for $50 million in Jan. 2021, in early 2022, the company sold R.W. Knudsen and truRoots to Nexus Capital. The deal included an agreement for Nexus Capital to license Santa Cruz Organic beverages, although not the brand's food items. The deal was estimated at $110 million. In January 2024, the Knott's Berry Farm grocery brand was discontinued due to low sales.\n\nHostess Brands acquisition\nOn 11 September 2023, J.M. Smucker announced an acquisition of Hostess Brands for $5.6 billion in cash and stock. This will bring several snack brands, including Twinkies, CupCakes, DingDongs, HoHos, Fruit Pies, CoffeeCakes, MiniMuffins, and Voortman cookies, along with seven manufacturing and distribution facilities, and 3,000 employees to J.M. Smucker. The acquisition was completed in November 2023.\n\nCurrent brands\nJ.M. Smucker's four major business units are consumer foods, pet food, snacks, and coffee. The company is particularly known as a marketer and manufacturer of products such as fruit spreads, peanut butter, ice cream toppings, sweetened condensed milk, and health and natural foods and beverages. The Smucker's flagship brand manufactures and sells its own brands of fruit preserves, jelly, peanut butter including Smucker's Goober PB&J, syrups, ice cream toppings including Smucker's Magic Shell, and the Uncrustables sealed crustless sandwich. In Canada, the brands are limited to ice cream toppings and preserves.\nJ.M. Smucker brands currently include:\n\nSee also\nList of coffee companies\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for The J. M. Smucker Company:",
  "clean_text": "The J.M. Smucker Company, also known as Smucker's, is an American manufacturer of food and beverage products. Headquartered in Orrville, Ohio, the company was founded in 1897 as a maker of apple butter. J.M. Smucker currently has three major business units: consumer foods, pet foods, and coffee. Its flagship brand, Smucker's, produces fruit preserves, peanut butter, syrups, frozen crustless sandwiches, and ice cream toppings. Among J.M. Smucker's other food and coffee brands are Bick's Pickle, Café Bustelo, Carnation Milk (Canada), Crosse & Blackwell, Dunkin', Five Roses (Canada), Folgers, Golden Temple (Canada), Jif, Knott's Berry Farm, Laura Scudder's, Robin Hood (Canada), Santa Cruz Organic, and Smucker's Uncrustables. Pet food brands include Meow Mix and Milk-Bone, among others. In 2023, Smuckers acquired Hostess Brands, the makers of Twinkies, in a $5.6 billion cash and stock deal. Listed on the New York Stock Exchange (ticker symbol: SJM), J.M. Smucker ranks 426th on the Fortune 500, with an estimated 2022 market value of $14.6 billion. History Founding (1897–1958) The J.M. Smucker Company was founded in 1897 by Jerome Monroe Smucker. Smucker was born on December 5, 1858, in Orrville, Ohio, and much of his life was spent as a farmer in Orrville. In 1897 Smucker built a cider mill in Orrville. The company, which came to produce jellies, jams, and other food items, has stated that he used apples from local Orrville trees planted by Johnny Appleseed in the early nineteenth century. Smucker prepared apple butter and sold it from the back of a horse-drawn wagon. The company was incorporated in 1921. At the time, the company sold preserves and jellies, and by 1928 was distributing in Ohio, Pennsylvania, and Indiana. After the company recorded losses in 1932 and 1933, in 1935 Smucker's eldest son Willard established a Smucker's plant in the state of Washington for pre-processing apples, which were then shipped to Orrville to be cooked. After introducing its trademark glass jar in 1939, annual sales reached $1 million. In 1940, Smucker's introduced its first line of ice cream toppings, and two years later began distributing its products nationally. During World War II, the company faced shortages of labor, glass, and fruit. In 1946, Smucker's earned the designation \"U.S. Grade A Fancy\" after it paid U.S. Department of Agriculture inspectors to \"oversee every aspect of its production.\" National expansion and IPO (1959–1984) The company went public in 1959, and the following year J.M. Smucker opened a manufacturing plant in Salinas, California that increased its production capacity by 40%. In 1960, Paul Smucker became president and the company hired Wyse Advertising of Cleveland to produce radio spots. J.M. Smucker was then listed on the New York Stock Exchange (NYSE) in 1965. 1963 saw J.M. Smucker's acquisition of the jams and jellies company Mary Ellen. Profits increased between 1959 and 1969 before dropping in 1970. Between 1973 and 1980, J.M. Smucker implemented cost cutting measures to increase profit margins, acquiring manufacturing operations in Oregon, Tennessee and California and consolidating packing operations. In 1978, J.M. Smucker debuted a low sugar \"spread\" that was so low in sugar the Food and Drug Administration wouldn't allow Smucker's to market it as a jam. J.M. Smucker acquired gourmet preserves company Dickinson's in 1979, and by 1980, J.M. Smucker was the number one jams and jellies company in the United States, with over 25% of the market in the United States. In 1981, Timothy Smucker was named president and the company purchased Magic Shell the following year. After purchasing the pickle companies Wooster Preserving Co. and the H.W. Madison Co. in the 1960s, the company sold its unsuccessful pickle line in the early 1980s. J.M. Smucker in 1984 continued to be traded on the NYSE, with the Smucker family retaining a 30% interest in the business. That year J.M. Smucker acquired the juices company Knudsen & Sons. Diversification and growth (1980s–2016) In the late 1980s, the company began expanding internationally under CEO Richard Smucker, acquiring brands in Canada, the United States, Australia, and Europe. In 1987 J.M. Smucker purchased R-Line Foods, and in 1988 the company acquired the Canadian toppings brand Shirriff which made products such as Good Morning Marmalade. J.M. Smucker's sales reached $367 million in 1989. In 1989 J.M. Smucker purchased the Australian company Henry Jones Foods, later selling it in 2004 to SPC Ardmona. By 1993, 8% of J.M. Smucker's annual sales were international. The peanut butter company Laura Scudder's and the juice company After the Fall were purchased in 1994, and that year J.M. Smucker also changed advertising agencies from Wyse Advertising to the Leo Burnett Company. The annual Peanut Butter Festival in the town of New Bethlehem, Pennsylvania is co-sponsored by Smucker's. First held in 1996, the festival was held in New Bethlehem because the Smucker's peanut butter factory was the lead employer in the area at the time. In 1998, J.M. Smucker acquired the peanut butter company Adams, as well as the maker of the Incredible Uncrustables frozen crustless sandwich, MenUSAver. J.M. Smucker renamed the product Uncrustables. J.M. Smucker acquired Jif and Crisco in 2002. By 2004, the company was still headquartered in Orrville, Ohio and had been family-run for four generations. Between 1998 and 2004, the company had appeared on Fortune magazine's annual listing of the 100 Best Companies to Work For in the United States each year, ranking number one in 2004. That year the company purchased International Multifoods Corporation. Among the acquired brands in the deal were Pillsbury, Hungry Jack, Pet, Bick's pickles and condiments, and Canadian flour companies Golden Temple, and Robin Hood. In 2006, White Lily Brand was acquired. In 2007, the Canadian flour company Five Roses was acquired. That same year, the company also acquired King Kelly Orange Marmalade, Eagle Family Foods, which brought in the brands Eagle Brand/Borden milk products, None Such mincemeat, and Kava coffee. In 2008, J.M. Smucker joined the Standard & Poor's 500 Index. That May, J.M. Smucker announced it had bought the food division of Knott's Berry Farm from ConAgra Foods, while Cedar Fair continued to own the theme park itself. That year it also purchased the frozen produce company Europe's Best in Canada and the milk brand Carnation. On November 6, 2008, J.M. Smucker purchased the Folgers coffee brand division from Procter & Gamble for $3.3 billion, acquiring brands such as Millstone Coffee in the process. The Reverse Morris Trust merger doubled J.M. Smucker's size. In 2010, J.M. Smucker acquired Rowland Coffee Roasters, makers of Latin coffee brands, followed by the North American coffee and tea operations of Sara Lee in 2011. J.M. Smucker acquired Big Heart Pet Brands in 2015 for $5.8 billion, bringing in brands such as Milk Bone, Meow Mix, Kibbles ‘n Bits and Pup-Peroni. Also that year, J.M. Smucker announced it would sell its canned milk operations in the United States to Eagle Family Foods Group LLC. In February 2015, J.M Smucker and Keurig partnered together on making K-Cup packs of Dunkin' coffee. Mark Smucker was named CEO in 2016. Recent (2017–present) After an antitrust lawsuit filed by the Federal Trade Commission (FTC) in early March 2018, ConAgra Brands Inc. and J. M. Smucker Co. cancelled a deal for Smucker to purchase the Wesson cooking oil brand. The FTC claimed that Smuckers would have controlled at least 70% of the market for branded canola and vegetable oils. As part of a strategy to focus on pet food, coffee, and snacking, on August 31, 2018, J.M. Smucker announced it had sold its baking business in the United States to Brynwood Partners for $375 million, including the brands Pillsbury, Martha White, Hungry Jack, White Lily, and Jim Dandy. The baking business in Canada was retained. The company acquired Ainsworth Pet Nutrition in 2018, including the brands Better Than! Treats, Dad's Pet Care, and Rachael Ray Nutrish, and in October 2018, J.M. Smucker consolidated its $580 million marketing business into Publicis Groupe. During the COVID-19 pandemic many J.M. Smucker employees began remote work. J.M. Smucker began providing \"pay and benefits to employees to avoid furloughs,\" creating employee hardship and sick leave programs. By August 2020, its international and away-from-home segment had seen a quarterly sales decline of 9%. The Smucker's brand had seen a 25% quarterly increase in sales, Uncrustables had seen a 35% jump, and Crisco had seen a 50% increase. In September 2020, the company announced a new logo and corporate brand identity, with aims to distinguish Smucker the company from Smucker's brand food items. J.M. Smucker Company was shortened to J.M. Smucker Co. In December 2020 J.M. Smucker sold Crisco to B&G Foods for $550 million, part of the company's ongoing plan to divest of baking products in the United States. Overall in 2020, J.M. Smucker had $7.8 billion in net sales, with free cash flow growing 26% from 2019 to $985.5 million. Its US retail consumer foods unit saw a 22% jump in annual profits, while coffee rose 11% and pet food rose 6%. After selling Natural Balance Pet Foods to Nexus Capital for $50 million in Jan. 2021, in early 2022, the company sold R.W. Knudsen and truRoots to Nexus Capital. The deal included an agreement for Nexus Capital to license Santa Cruz Organic beverages, although not the brand's food items. The deal was estimated at $110 million. In January 2024, the Knott's Berry Farm grocery brand was discontinued due to low sales. Hostess Brands acquisition On 11 September 2023, J.M. Smucker announced an acquisition of Hostess Brands for $5.6 billion in cash and stock. This will bring several snack brands, including Twinkies, CupCakes, DingDongs, HoHos, Fruit Pies, CoffeeCakes, MiniMuffins, and Voortman cookies, along with seven manufacturing and distribution facilities, and 3,000 employees to J.M. Smucker. The acquisition was completed in November 2023. Current brands J.M. Smucker's four major business units are consumer foods, pet food, snacks, and coffee. The company is particularly known as a marketer and manufacturer of products such as fruit spreads, peanut butter, ice cream toppings, sweetened condensed milk, and health and natural foods and beverages. The Smucker's flagship brand manufactures and sells its own brands of fruit preserves, jelly, peanut butter including Smucker's Goober PB&J, syrups, ice cream toppings including Smucker's Magic Shell, and the Uncrustables sealed crustless sandwich. In Canada, the brands are limited to ice cream toppings and preserves. J.M. Smucker brands currently include:"
}