{
  "ticker": "SLB",
  "cik": "0000087347",
  "company_name": "Schlumberger",
  "corrected_name": "Schlumberger",
  "wiki_title_used": "Schlumberger",
  "exists": true,
  "raw_text": "Schlumberger (French: [ʃlumbɛʁʒe, ʃlœ̃b-]), doing business as SLB, is a global multinational oilfield services company. Founded in France in 1926,   the company is now incorporated as Schlumberger NV in Willemstad, Curaçao, with principal executive offices in four cities: Paris, France; Houston, Texas, United States; London, UK; and The Hague, Netherlands. As of 2022, it is both the world's largest offshore drilling company and the world's largest offshore drilling contractor by revenue.\nAlso known as Schlumberger Limited, the company trades on the New York Stock Exchange, Euronext Paris, the London Stock Exchange and SIX Swiss Exchange. In 2022, the Forbes Global 2000 ranked Schlumberger the 349th largest company in the world.\n\nHistory\nSchlumberger was founded in 1926 in Paris as the Electric Prospecting Company (French: Société de prospection électrique) by two brothers Conrad and Marcel Schlumberger from Alsace. Schlumberger supplies the petroleum industry with services such as seismic data processing, formation evaluation, well testing and directional drilling, well cementing and stimulation, artificial lift, well completions, flow assurance and consulting, and software and information management. The company is also involved in the groundwater extraction and carbon capture and storage industries.\nThe Schlumberger brothers had experience conducting geophysical surveys in countries such as Romania, Canada, Serbia, South Africa, the Democratic Republic of the Congo, and the United States. The new company sold electrical-measurement mapping services, and recorded the first-ever electrical resistivity well log in Merkwiller-Pechelbronn, France, in 1927. The company quickly expanded, logging its first well in the U.S. in 1929 in Kern County, California. In 1934, the Schlumberger Well Surveying Corporation was founded in Houston, later evolving into Schlumberger Well Services, and finally Schlumberger Wireline and Testing. Schlumberger invested heavily in research, inaugurating the Schlumberger-Doll Research Center in Ridgefield, Connecticut, in 1948, contributing to the development of a number of new logging tools. In 1956, Schlumberger Limited was incorporated as a holding company for all Schlumberger Limited businesses, which by now included American testing and production company Johnston Testers.\nOver the years, Schlumberger continued to expand its operations and acquisitions. In 1960, Dowell Schlumberger (50% Schlumberger, 50% Dow Chemical), which specialized in pumping services for the oil industry, was formed. On February 2, 1962, Schlumberger Limited became listed on the New York Stock Exchange. That same year, Schlumberger purchased Daystrom, an electronic instruments manufacturer in South Boston, Virginia, which was making furniture by the time the division was sold to Sperry & Hutchinson in 1971. Schlumberger purchased 50% of Forex in 1964 and merged it with 50% of Languedocienne to create the Neptune Drilling Company. The first computerized reservoir analysis, SARABAND, was introduced in 1970. The remaining 50% of Forex was acquired the following year; Neptune was renamed Forex Neptune Drilling Company. In 1979, Fairchild Camera and Instrument (including Fairchild Semiconductor) became a subsidiary of Schlumberger Limited.\nIn 1981, Schlumberger established the first international data links with e-mail. In 1983, Schlumberger opened its Cambridge Research Center in Cambridge, England.\nIn 1984, the SEDCO drilling rig company and half of Dowell of North America were acquired, resulting in the creation of the Anadrill drilling segment, a combination of Dowell and The Analysts' drilling segments. Forex Neptune was merged with SEDCO to create the Sedco Forex Drilling Company the following year, when Schlumberger purchased Merlin and 50% of GECO.\nIn 1987, Schlumberger completed its purchases of Neptune (North America), Bosco and Cori (Italy), and Allmess (Germany). That same year, National Semiconductor acquired Fairchild Semiconductor from Schlumberger for $122 million.\nIn 1991, Schlumberger acquired PRAKLA-SEISMOS, and pioneered the use of geosteering to plan the drill path in horizontal wells.\nIn 1992, Schlumberger acquired software company GeoQuest Systems. With the purchase came the conversion of SINet to TCP/IP and thus internet capable. In the 1990s, Schlumberger bought out the petroleum division, AEG meter, and ECLIPSE reservoir study team Intera Technologies Corp. A joint venture between Schlumberger and Cable & Wireless resulted with the creation of Omnes, which then handled all of the company's internal IT business. Oilphase and Camco International were also purchased.\nIn 1999, Schlumberger and Smith International created a joint venture, M-I L.L.C., the world's largest drilling fluids (mud) company. The company consists of 60% Smith International, and 40% by Schlumberger. Since the joint venture was prohibited by a 1994 antitrust consent decree barring Smith from selling or combining their fluids business with certain other companies, including Schlumberger, the U.S. District Court in Washington, D.C., found Smith International Inc. and Schlumberger Ltd. guilty of criminal contempt and fined each company $750,000 and placed each company on five years probation. Both companies also agreed to pay a total of $13.1 million, representing a full disgorgement of all of the joint venture's profits during the time the companies were in contempt.\nIn 2000, the Geco-Prakla division was merged with Western Geophysical to create the seismic data acquisition and processing contracting company WesternGeco, of which Schlumberger held a 70% stake, the remaining 30% belonging to competitor Baker Hughes. Sedco Forex was spun off, and merged with Transocean Drilling company in 2000.\nIn 2001, Schlumberger acquired the IT consultancy company Sema plc for $5.2 billion. The company was an Athens 2004 Summer Olympics partner, but the venture into IT consultancy did not pay off, and divestiture of Sema to Atos Origin was completed that year for $1.5 billion. The cards division was divested through an IPO to form Axalto, which later merged with Gemplus to form Gemalto, and the Messaging Solutions unit was spun off and merged with Taral Networks to form Airwide Solutions. In 2003, the Automated Test Equipment group, part of the 1979 Fairchild Semiconductor acquisition, was spun off to NPTest Holding, which was sold it to Credence in February 2004.\nIn 2004, Schlumberger Business Consulting was launched and a decade later was acquired by Accenture.\nIn 2005, Schlumberger purchased Waterloo Hydrogeologic, which was followed by several other groundwater industry related companies, such as Westbay Instruments, and Van Essen Instruments. Also that year, Schlumberger relocated its U.S. corporate offices from New York to Houston.\nIn 2006, Schlumberger purchased the remaining 30% of WesternGeco from Baker Hughes for US$2.4 billion. Also that year, the Schlumberger-Doll Research Center was relocated to a newly built research facility in Cambridge, Massachusetts, to replace the Ridgefield, Connecticut, research center. The facility joins the other research centers operated by the company in Cambridge, England; Moscow, Russia; Stavanger, Norway; and Dhahran, Saudi Arabia. In March 2022, Schlumberger stopped investing in its projects in Russia because of International sanctions during the Russo-Ukrainian War.\nIn 2009, Schlumberger acquired Techsia SA, a software company based in Montpellier, France with a product widely used in the oil industry called Techlog.   \nIn 2010, the acquisition of Smith International in an all-stock deal valued at $11.3 billion was announced. The sale price is 45.84-a-share price was 37.5 percent higher than Smith closing price on 18 February 2010. The deal was the biggest acquisition in Schlumberger history until their acquisition of Cameron International. The merger was completed on August 27, 2010. Also announced in 2010 were Schlumberger plans to acquire Geoservices, a French-based company specializing in energy services, in a deal valued at $1.1 billion, including debt.\nIn 2014, Schlumberger announced the purchase of the remaining shares of SES Holdings Limited (\"Saxon\"), a Calgary-based provider of international land drilling services, from First Reserve and certain members of Saxon management. The transaction is subject to customary closing conditions, including the receipt of regulatory approvals. Schlumberger had a minority share in Saxon previously.\nIn 2015, Schlumberger was indicted by the US Department of Justice for sanction violations of conducting business in Iran and Sudan; the company was fined $233 million, amounting to the largest fine for sanctions to date.\nIn 2015, due to a downturn in the global oil and gas industry, Schlumberger announced 21,000 layoffs accounting for 15% of the company's total workforce.\nIn 2015, Schlumberger agreed to acquire oilfield equipment manufacturer Cameron International for $14.8 billion.\nIn 2018, Schlumberger announced that WesternGeco would be exiting the seismic data acquisition business, both onshore and offshore, while retaining its multiclient data processing and interpretation segments. This decision followed the bankruptcy filings of several competitors in the seismic services sector.\nIn 2020, Schlumberger cut more than 21,000 jobs during the global COVID-19 pandemic.\nIn 2021, Schlumberger New Energy announced the signature of pilot project agreements between the French state, Genvia and critical-industry leaders on the pathway to net zero in the cement and steel industries. Through these agreements, the goal is to scale up the next generation of electrolyzer technology, developed over the last two decades, to produce clean hydrogen without CO2 emissions, accelerating the decarbonization of multiple industrial sectors.\nIn 2022, Schlumberger completed a corporate rebranding to be known as SLB. According to media statements, the company's CEO said the corporate rebranding is not a shift away from fossil fuels.\nIn August 2022, SLB announced that SLB OneSubsea was going into a joint venture with AkerSolutions and Subsea7. The ownership of SLB OneSubsea is 70% with Schlumberger, 20% with AkerSolutions and Subsea7 owning the last 10% \nIn February 2023, SLB announced it had completed the acquisition of the Houston-headquartered gyroscopic wellbore positioning and survey technology company, Gyrodata Incorporated.\nIn April 2024, SLB announced its intention to acquire smaller rival ChampionX, in an all-stock deal valued at $7.75 billion, its largest purchase since Cameron International.\n\nCorporate affairs\nFrance\nThe company has offices in multiple cities and regions in France:  Abbeville, Béziers, Clamart, Montpellier, Pau and Paris.\nSuch sites and entities are as well at the forefront of the SLB New Energy strategy and development. (example: Geothermal with Celsius Energy and Hydrogen with Genvia)\n\nUnited States\nSchlumberger maintains a 33-acre (13 ha) campus at the northeast corner of U.S. Highway 90A and Gillingham Lane in Sugar Land, Texas; as of 2017 Schlumberger is the third largest employer in the city. In 2015, Schlumberger announced that it was moving its U.S. corporate headquarters to the Sugar Land facility from its Houston office building. The company plans to build new buildings with a scheduled completion time of late 2017. They include a total of 250,000 square feet (23,000 m2) of Class A office space and an \"amenities\" building with 100,000 square feet (9,300 m2) of space.\nIn the 1930s, the North American headquarters were established in Houston. In the 1970s, the company's top executives in North America were relocated to New York City. By 2006, the head office had 50 executives and support staff. By that year the company was moving that office to a building near the Houston Galleria.\nThe company moved its Houston-area offices from 5000 Gulf Freeway in Houston to the Sugar Land campus in 1995.\n\nControversies\nRadioactive sources\nIn 2006, a radioactive canister imported by Schlumberger was recovered in the Western Australian outback desert. The canister had been lost by the company's transport partner, when the improperly secured container fell off the trailer on which it was being transported.\nIn 2010, the Aberdeen Sheriff court fined Schlumberger Oilfield UK £300,000 for losing a radioactive source on the rig floor on the Ensco 101 mobile drilling rig in the North Sea for 4 hours.\n\nSpills\nIn 2009, the Pennsylvania Department of Environmental Protection fined Chesapeake Appalachia LLC and Schlumberger Technology Corp. more than $15,500 each for a hydrochloric acid spill in February 2009 at Chesapeake's Chancellor natural gas well site in Asylum Township, Bradford County, Pennsylvania. Officials said the leak did not contaminate groundwater.\n\nPCB contamination\nIn 2006, as the current owner of a facility in Pickens, South Carolina, Schlumberger agreed to pay $11.8 million to federal and state agencies for a problem caused by the previous owner, Sangamo-Weston, a capacitor manufacturing plant. The cause of the problem was from polychlorinated biphenyls (PCB) released into the environment by Sangamo-Weston from 1955 to 1987. According to the Justice Department's Environment and Natural Resources Division, an additional agreement by Schlumberger to purchase and remove dams will directly improve the Twelvemile Creek, South Carolina ecosystem and provide significant environmental benefits for the affected communities.\n\nDeepwater Horizon\nIn 2010, Schlumberger was contracted to perform wireline logging on the Deepwater Horizon oil rig in the Gulf of Mexico. On the day of the explosion, the Schlumberger crew was supposed to perform a cement evaluation test, but the test was cancelled and the crew was released by BP to leave the rig on the same day. The cost-cutting decision to cancel the test is dramatized in the subsequent film by Peter Berg.\n\nBusiness with Iran and Sudan\nIn 2015, Schlumberger pled guilty to violating U.S. sanctions related to Iran and Sudan and agreed to pay a $237 million penalty.\n\nSexual harassment\nIn 2020, a class action lawsuit was filed against Schlumberger, alleging a culture of sexual harassment, discrimination, and retaliation. According to the company's pay-gap report for 2018, women composed a mere 5.4% of field roles and 16.2% of roles in the full company. The lawsuit alleges that males regularly documented their harassment of female co-workers and flaunted them on public forums. Male colleagues would also encourage other men to break into a plaintiff's room at night and stonewall her if she did not consent to sexual activity. The lawsuit also outlines instances of \"sexist and hostile comments\", and one instance in which a plaintiff was groped. Women who complain to HR are told it is all just \"oil field talk\" and are subsequently ignored. When a plaintiff kept complaining, Schlumberger allegedly terminated the plaintiff. Women who spoke with The Texas Observer describe a culture of silence, where women stay silent for fear of being fired in the high turnover company.\n\nRussia\nIn October 2022, it was reported that some of Schlumberger's more than 9,000 Russian employees based in Russia received military draft notices through the company. Human rights groups such as Business & Human Rights Resource Centre are watching how the company responds to the concerns. About a week later, the company said it was evaluating unspecified options for its thousands of Russian employees. According to a list maintained by the Chief Executive Leadership Institute at Yale University which tracks company responses about operating in Russia, Schlumberger is noted as \"buying time\" while it continues to carry out the bulk of its business in the country.\nAccording to NACP, the company is also facilitating the issuance of conscription notices and is banning remote work for Russians who avoid military draft.\nIn March 2024, it was reported that SLB has no intentions of withdrawing from Russia, despite western pressure to reduce financial support to the Kremlin’s war efforts.\n\nSee also\nList of oilfield service companies\n\nReferences\nWorks cited\nOristaglio, Michael; Dorozynski, Alexander (2007). A Sixth Sense: The Life and Science of Henri-Georges Doll – Oilfield Pioneer and Inventor. Abrams Books. ISBN 978-1-68335-905-0. Retrieved June 20, 2022.\n\nExternal links\n\nSLB website\nBusiness data for Schlumberger:",
  "clean_text": "Schlumberger (French: [ʃlumbɛʁʒe, ʃlœ̃b-]), doing business as SLB, is a global multinational oilfield services company. Founded in France in 1926, the company is now incorporated as Schlumberger NV in Willemstad, Curaçao, with principal executive offices in four cities: Paris, France; Houston, Texas, United States; London, UK; and The Hague, Netherlands. As of 2022, it is both the world's largest offshore drilling company and the world's largest offshore drilling contractor by revenue. Also known as Schlumberger Limited, the company trades on the New York Stock Exchange, Euronext Paris, the London Stock Exchange and SIX Swiss Exchange. In 2022, the Forbes Global 2000 ranked Schlumberger the 349th largest company in the world. History Schlumberger was founded in 1926 in Paris as the Electric Prospecting Company (French: Société de prospection électrique) by two brothers Conrad and Marcel Schlumberger from Alsace. Schlumberger supplies the petroleum industry with services such as seismic data processing, formation evaluation, well testing and directional drilling, well cementing and stimulation, artificial lift, well completions, flow assurance and consulting, and software and information management. The company is also involved in the groundwater extraction and carbon capture and storage industries. The Schlumberger brothers had experience conducting geophysical surveys in countries such as Romania, Canada, Serbia, South Africa, the Democratic Republic of the Congo, and the United States. The new company sold electrical-measurement mapping services, and recorded the first-ever electrical resistivity well log in Merkwiller-Pechelbronn, France, in 1927. The company quickly expanded, logging its first well in the U.S. in 1929 in Kern County, California. In 1934, the Schlumberger Well Surveying Corporation was founded in Houston, later evolving into Schlumberger Well Services, and finally Schlumberger Wireline and Testing. Schlumberger invested heavily in research, inaugurating the Schlumberger-Doll Research Center in Ridgefield, Connecticut, in 1948, contributing to the development of a number of new logging tools. In 1956, Schlumberger Limited was incorporated as a holding company for all Schlumberger Limited businesses, which by now included American testing and production company Johnston Testers. Over the years, Schlumberger continued to expand its operations and acquisitions. In 1960, Dowell Schlumberger (50% Schlumberger, 50% Dow Chemical), which specialized in pumping services for the oil industry, was formed. On February 2, 1962, Schlumberger Limited became listed on the New York Stock Exchange. That same year, Schlumberger purchased Daystrom, an electronic instruments manufacturer in South Boston, Virginia, which was making furniture by the time the division was sold to Sperry & Hutchinson in 1971. Schlumberger purchased 50% of Forex in 1964 and merged it with 50% of Languedocienne to create the Neptune Drilling Company. The first computerized reservoir analysis, SARABAND, was introduced in 1970. The remaining 50% of Forex was acquired the following year; Neptune was renamed Forex Neptune Drilling Company. In 1979, Fairchild Camera and Instrument (including Fairchild Semiconductor) became a subsidiary of Schlumberger Limited. In 1981, Schlumberger established the first international data links with e-mail. In 1983, Schlumberger opened its Cambridge Research Center in Cambridge, England. In 1984, the SEDCO drilling rig company and half of Dowell of North America were acquired, resulting in the creation of the Anadrill drilling segment, a combination of Dowell and The Analysts' drilling segments. Forex Neptune was merged with SEDCO to create the Sedco Forex Drilling Company the following year, when Schlumberger purchased Merlin and 50% of GECO. In 1987, Schlumberger completed its purchases of Neptune (North America), Bosco and Cori (Italy), and Allmess (Germany). That same year, National Semiconductor acquired Fairchild Semiconductor from Schlumberger for $122 million. In 1991, Schlumberger acquired PRAKLA-SEISMOS, and pioneered the use of geosteering to plan the drill path in horizontal wells. In 1992, Schlumberger acquired software company GeoQuest Systems. With the purchase came the conversion of SINet to TCP/IP and thus internet capable. In the 1990s, Schlumberger bought out the petroleum division, AEG meter, and ECLIPSE reservoir study team Intera Technologies Corp. A joint venture between Schlumberger and Cable & Wireless resulted with the creation of Omnes, which then handled all of the company's internal IT business. Oilphase and Camco International were also purchased. In 1999, Schlumberger and Smith International created a joint venture, M-I L.L.C., the world's largest drilling fluids (mud) company. The company consists of 60% Smith International, and 40% by Schlumberger. Since the joint venture was prohibited by a 1994 antitrust consent decree barring Smith from selling or combining their fluids business with certain other companies, including Schlumberger, the U.S. District Court in Washington, D.C., found Smith International Inc. and Schlumberger Ltd. guilty of criminal contempt and fined each company $750,000 and placed each company on five years probation. Both companies also agreed to pay a total of $13.1 million, representing a full disgorgement of all of the joint venture's profits during the time the companies were in contempt. In 2000, the Geco-Prakla division was merged with Western Geophysical to create the seismic data acquisition and processing contracting company WesternGeco, of which Schlumberger held a 70% stake, the remaining 30% belonging to competitor Baker Hughes. Sedco Forex was spun off, and merged with Transocean Drilling company in 2000. In 2001, Schlumberger acquired the IT consultancy company Sema plc for $5.2 billion. The company was an Athens 2004 Summer Olympics partner, but the venture into IT consultancy did not pay off, and divestiture of Sema to Atos Origin was completed that year for $1.5 billion. The cards division was divested through an IPO to form Axalto, which later merged with Gemplus to form Gemalto, and the Messaging Solutions unit was spun off and merged with Taral Networks to form Airwide Solutions. In 2003, the Automated Test Equipment group, part of the 1979 Fairchild Semiconductor acquisition, was spun off to NPTest Holding, which was sold it to Credence in February 2004. In 2004, Schlumberger Business Consulting was launched and a decade later was acquired by Accenture. In 2005, Schlumberger purchased Waterloo Hydrogeologic, which was followed by several other groundwater industry related companies, such as Westbay Instruments, and Van Essen Instruments. Also that year, Schlumberger relocated its U.S. corporate offices from New York to Houston. In 2006, Schlumberger purchased the remaining 30% of WesternGeco from Baker Hughes for US$2.4 billion. Also that year, the Schlumberger-Doll Research Center was relocated to a newly built research facility in Cambridge, Massachusetts, to replace the Ridgefield, Connecticut, research center. The facility joins the other research centers operated by the company in Cambridge, England; Moscow, Russia; Stavanger, Norway; and Dhahran, Saudi Arabia. In March 2022, Schlumberger stopped investing in its projects in Russia because of International sanctions during the Russo-Ukrainian War. In 2009, Schlumberger acquired Techsia SA, a software company based in Montpellier, France with a product widely used in the oil industry called Techlog. In 2010, the acquisition of Smith International in an all-stock deal valued at $11.3 billion was announced. The sale price is 45.84-a-share price was 37.5 percent higher than Smith closing price on 18 February 2010. The deal was the biggest acquisition in Schlumberger history until their acquisition of Cameron International. The merger was completed on August 27, 2010. Also announced in 2010 were Schlumberger plans to acquire Geoservices, a French-based company specializing in energy services, in a deal valued at $1.1 billion, including debt. In 2014, Schlumberger announced the purchase of the remaining shares of SES Holdings Limited (\"Saxon\"), a Calgary-based provider of international land drilling services, from First Reserve and certain members of Saxon management. The transaction is subject to customary closing conditions, including the receipt of regulatory approvals. Schlumberger had a minority share in Saxon previously. In 2015, Schlumberger was indicted by the US Department of Justice for sanction violations of conducting business in Iran and Sudan; the company was fined $233 million, amounting to the largest fine for sanctions to date. In 2015, due to a downturn in the global oil and gas industry, Schlumberger announced 21,000 layoffs accounting for 15% of the company's total workforce. In 2015, Schlumberger agreed to acquire oilfield equipment manufacturer Cameron International for $14.8 billion. In 2018, Schlumberger announced that WesternGeco would be exiting the seismic data acquisition business, both onshore and offshore, while retaining its multiclient data processing and interpretation segments. This decision followed the bankruptcy filings of several competitors in the seismic services sector. In 2020, Schlumberger cut more than 21,000 jobs during the global COVID-19 pandemic. In 2021, Schlumberger New Energy announced the signature of pilot project agreements between the French state, Genvia and critical-industry leaders on the pathway to net zero in the cement and steel industries. Through these agreements, the goal is to scale up the next generation of electrolyzer technology, developed over the last two decades, to produce clean hydrogen without CO2 emissions, accelerating the decarbonization of multiple industrial sectors. In 2022, Schlumberger completed a corporate rebranding to be known as SLB. According to media statements, the company's CEO said the corporate rebranding is not a shift away from fossil fuels. In August 2022, SLB announced that SLB OneSubsea was going into a joint venture with AkerSolutions and Subsea7. The ownership of SLB OneSubsea is 70% with Schlumberger, 20% with AkerSolutions and Subsea7 owning the last 10% In February 2023, SLB announced it had completed the acquisition of the Houston-headquartered gyroscopic wellbore positioning and survey technology company, Gyrodata Incorporated. In April 2024, SLB announced its intention to acquire smaller rival ChampionX, in an all-stock deal valued at $7.75 billion, its largest purchase since Cameron International. Corporate affairs France The company has offices in multiple cities and regions in France: Abbeville, Béziers, Clamart, Montpellier, Pau and Paris. Such sites and entities are as well at the forefront of the SLB New Energy strategy and development. (example: Geothermal with Celsius Energy and Hydrogen with Genvia) United States Schlumberger maintains a 33-acre (13 ha) campus at the northeast corner of U.S. Highway 90A and Gillingham Lane in Sugar Land, Texas; as of 2017 Schlumberger is the third largest employer in the city. In 2015, Schlumberger announced that it was moving its U.S. corporate headquarters to the Sugar Land facility from its Houston office building. The company plans to build new buildings with a scheduled completion time of late 2017. They include a total of 250,000 square feet (23,000 m2) of Class A office space and an \"amenities\" building with 100,000 square feet (9,300 m2) of space. In the 1930s, the North American headquarters were established in Houston. In the 1970s, the company's top executives in North America were relocated to New York City. By 2006, the head office had 50 executives and support staff. By that year the company was moving that office to a building near the Houston Galleria. The company moved its Houston-area offices from 5000 Gulf Freeway in Houston to the Sugar Land campus in 1995. Controversies Radioactive sources In 2006, a radioactive canister imported by Schlumberger was recovered in the Western Australian outback desert. The canister had been lost by the company's transport partner, when the improperly secured container fell off the trailer on which it was being transported. In 2010, the Aberdeen Sheriff court fined Schlumberger Oilfield UK £300,000 for losing a radioactive source on the rig floor on the Ensco 101 mobile drilling rig in the North Sea for 4 hours. Spills In 2009, the Pennsylvania Department of Environmental Protection fined Chesapeake Appalachia LLC and Schlumberger Technology Corp. more than $15,500 each for a hydrochloric acid spill in February 2009 at Chesapeake's Chancellor natural gas well site in Asylum Township, Bradford County, Pennsylvania. Officials said the leak did not contaminate groundwater. PCB contamination In 2006, as the current owner of a facility in Pickens, South Carolina, Schlumberger agreed to pay $11.8 million to federal and state agencies for a problem caused by the previous owner, Sangamo-Weston, a capacitor manufacturing plant. The cause of the problem was from polychlorinated biphenyls (PCB) released into the environment by Sangamo-Weston from 1955 to 1987. According to the Justice Department's Environment and Natural Resources Division, an additional agreement by Schlumberger to purchase and remove dams will directly improve the Twelvemile Creek, South Carolina ecosystem and provide significant environmental benefits for the affected communities. Deepwater Horizon In 2010, Schlumberger was contracted to perform wireline logging on the Deepwater Horizon oil rig in the Gulf of Mexico. On the day of the explosion, the Schlumberger crew was supposed to perform a cement evaluation test, but the test was cancelled and the crew was released by BP to leave the rig on the same day. The cost-cutting decision to cancel the test is dramatized in the subsequent film by Peter Berg. Business with Iran and Sudan In 2015, Schlumberger pled guilty to violating U.S. sanctions related to Iran and Sudan and agreed to pay a $237 million penalty. Sexual harassment In 2020, a class action lawsuit was filed against Schlumberger, alleging a culture of sexual harassment, discrimination, and retaliation. According to the company's pay-gap report for 2018, women composed a mere 5.4% of field roles and 16.2% of roles in the full company. The lawsuit alleges that males regularly documented their harassment of female co-workers and flaunted them on public forums. Male colleagues would also encourage other men to break into a plaintiff's room at night and stonewall her if she did not consent to sexual activity. The lawsuit also outlines instances of \"sexist and hostile comments\", and one instance in which a plaintiff was groped. Women who complain to HR are told it is all just \"oil field talk\" and are subsequently ignored. When a plaintiff kept complaining, Schlumberger allegedly terminated the plaintiff. Women who spoke with The Texas Observer describe a culture of silence, where women stay silent for fear of being fired in the high turnover company. Russia In October 2022, it was reported that some of Schlumberger's more than 9,000 Russian employees based in Russia received military draft notices through the company. Human rights groups such as Business & Human Rights Resource Centre are watching how the company responds to the concerns. About a week later, the company said it was evaluating unspecified options for its thousands of Russian employees. According to a list maintained by the Chief Executive Leadership Institute at Yale University which tracks company responses about operating in Russia, Schlumberger is noted as \"buying time\" while it continues to carry out the bulk of its business in the country. According to NACP, the company is also facilitating the issuance of conscription notices and is banning remote work for Russians who avoid military draft. In March 2024, it was reported that SLB has no intentions of withdrawing from Russia, despite western pressure to reduce financial support to the Kremlin’s war efforts."
}