{
  "ticker": "SNA",
  "cik": "0000091440",
  "company_name": "Snap-on",
  "corrected_name": "Snap-on",
  "wiki_title_used": "Snap-on",
  "exists": true,
  "raw_text": "Snap-on Incorporated is an American designer, manufacturer, and marketer of high-end tools and equipment for professional use in the transportation industry, including the automotive, heavy duty, equipment, marine, aviation, and railroad industries. Headquartered in Kenosha, Wisconsin, since 1930, Snap-on also distributes lower-end tools under the brand name Blue-Point. Their primary competitors include Matco, Mac Tools, and Cornwell Tools.\n\nOperations\nSnap-on Inc. operates plants in Milwaukee, Wisconsin; Elizabethton, Tennessee; and Elkmont, Alabama. Wheel balancers and tire changers are manufactured in Conway, Arkansas.  Power tools, both cordless and pneumatic, are manufactured in Murphy, North Carolina. Torque products are made and assembled in City of Industry, California. The company manufactures tool storage cabinets in its Algona, Iowa plant. The company's Milwaukee facility manufactures sockets, extension bars, pliers, screwdriver blades and bits.\nSnap-on produces hand-held electronic diagnostic tools for the computer systems used in most modern cars and heavy duty vehicles at their Kenosha site. Software development happens in the US, Ireland, Australia, Mexico, Brazil and China. Automotive emissions control diagnostics equipment is manufactured in its San Jose, California diagnostic facility. Snap-on diagnostic products are marketed in Europe and Brazil under the name Sun.\n\nSales\nSnap-on tools are marketed via mobile franchisee dealers visiting their customers' workplaces weekly in vans loaded with retail inventory — as well as online via their website.\nSnap-on uses two specialized vans, marketed as Shop Essentials to showcase its diagnostic equipment, and the Rock 'n Roll Cab Express demonstrating tool storage customization, including units larger than what can fit on a standard franchisee van. These trucks are typically assigned to a particular region and work within that region.\n\nHistory\nSnap-on was founded as the Snap-on Wrench Company in Milwaukee, Wisconsin in 1920 by Joseph Johnson and William Seidemann. The business manufactured and marketed ten sockets that would \"snap on\" to five interchangeable handles. The company's slogan was \"5 do the work of 50\".  Stanton Palmer and his partner in Chicago, picked up Snap-on Wrench as one of their lines and within a year they had expanded the market to whole US and Mexico and Canada.   In 1930, Stanton Palmer arranged for the funding of the factory in Kenosha to cover their expanded orders and company's headquarters moved to Kenosha. The new company name Snap-on Tools was used with Stanton Palmer as President, Newton Tarble as Vice President and Johnson and Seidemann as Treasurer and Secretary.  The new name was because Palmer added the rest of the line of tools with Blue Point Tools and the marketing company.    Wisconsin. At Stanton Palmer's death Newton Tarble left the corporation.  Mr. Myers became the second president of Snap-on Tools, as a largest creditor after the depression.  He was President of Blue Point Tools.  In return for Snap-on Stock, Myers gave Snap-on Tools stock to Mrs. Stanton Palmer and Newton Tarble in return for merging the marketing company and Blue Point Tools into Snap-on Tools.  \nNewton Tarble left Snap-on Tools and Rogers Palmer, Stanton's son, became Vice President of Sales and President of Snap-on Canada.  During World War II Rogers Palmer was a dollar-year-man and worked with the Defense Department to align the hand tools industry to align with tools needed for jeeps, tanks, airplanes, etc.  He was a first President of the Tools Institute.\nAfter World War II, Rogers Palmer, as senior Vice President Sales,  advertised for a military officer to organize and develop a larger sales force for the expected post war sales boom.    Routes were developed for company dealers to see mechanics on a weekly basis. Eventually these salesmen became independent businessmen and authorized dealers using larger walk in vans to carry a growing product line.\nIn 1956, the company continued to expand with the use of test equipment and wheel service products. This was the start of the company's jump into manufacturing automotive test equipment into the Snap-On line. Equipment included voltmeters, ammeters, disruptors, and alternator testers.\nThe company opened its wrench forging plant in Elizabethton, Tennessee in 1974. The next year, Snap-on opened a manufacturing plant in Johnson City, Tennessee and closed the plant in 2007.\nIn 1998, workers at the company's Milwaukee plant voted to join the Teamsters labor union and the company expanded the facility in 2013. Also in 1998, the company began a partnership with Lowe's home improvement chain retailer to produce its Kobalt line of tools.\nIn 2010, the Murphy, North Carolina plant was named one of the top 10 plants in North America by IndustryWeek. In 2011, J.H. Williams & Co was officially renamed Snap-on Industrial Brands.\nIn 2022, the company announced an expansion to its Milwaukee facility to grow its hand tool business.\n\nAcquisitions\nIn 2014, the company acquired New Hampshire–based Pro-Cut for $42 million.\nIn October 2016, the company acquired Car-O-Liner Holding AB, a Swedish collision repair tool company, for $155 million. Later that year, the company acquired Sturtevant Richmont for $13 million.\nIn May 2017, the company acquired Norbar Torque Tools Holdings Limited for $72 million.\nIn August 2019, the company acquired Cognitran Ltd for $31 million.\nIn September 2020, the company acquired AutoCrib Inc. based in Tustin, California for $36 million.\nIn March 2021, Snap-on acquired Canada-based Dealer-FX Group for $200 million.\n\nRacing sponsorships\nThe first driver Snap-on became associated with was four-time Indianapolis 500 winner, Rick Mears in 1979.\n\nNASCAR\nThe company previously sponsored Team Penske in NASCAR in the Cup Series and the Xfinity Series.\n\nIndyCar\nThe company also sponsored Penske in the NTT IndyCar Series. In 2025, Snap-on would sponsor the IndyCar Series race at the Milwaukee Mile.\n\nMotoGP\nSnap-on had sponsored Repsol Honda Team in MotoGP since 1998.\n\nNHRA\nSnap-on sponsored NHRA drag racer Doug Herbert from 1992 until 2008. For the 2010 racing season, the company sponsored Penske. Since 1992, Snap-on has sponsored Cruz Pedregon. In 2004, the company began sponsoring Cruz's brother Tony Pedregon.\n\nReferences\nExternal links\n\nOfficial website\n\nBusiness data for Snap-on Incorporated: \nHistoric American Engineering Record (HAER) No. MI-350, \"Snap-On Tools, 93 Piquette Avenue, Detroit, Wayne County, MI\", 1 photo, 1 photo caption page",
  "clean_text": "Snap-on Incorporated is an American designer, manufacturer, and marketer of high-end tools and equipment for professional use in the transportation industry, including the automotive, heavy duty, equipment, marine, aviation, and railroad industries. Headquartered in Kenosha, Wisconsin, since 1930, Snap-on also distributes lower-end tools under the brand name Blue-Point. Their primary competitors include Matco, Mac Tools, and Cornwell Tools. Operations Snap-on Inc. operates plants in Milwaukee, Wisconsin; Elizabethton, Tennessee; and Elkmont, Alabama. Wheel balancers and tire changers are manufactured in Conway, Arkansas. Power tools, both cordless and pneumatic, are manufactured in Murphy, North Carolina. Torque products are made and assembled in City of Industry, California. The company manufactures tool storage cabinets in its Algona, Iowa plant. The company's Milwaukee facility manufactures sockets, extension bars, pliers, screwdriver blades and bits. Snap-on produces hand-held electronic diagnostic tools for the computer systems used in most modern cars and heavy duty vehicles at their Kenosha site. Software development happens in the US, Ireland, Australia, Mexico, Brazil and China. Automotive emissions control diagnostics equipment is manufactured in its San Jose, California diagnostic facility. Snap-on diagnostic products are marketed in Europe and Brazil under the name Sun. Sales Snap-on tools are marketed via mobile franchisee dealers visiting their customers' workplaces weekly in vans loaded with retail inventory — as well as online via their website. Snap-on uses two specialized vans, marketed as Shop Essentials to showcase its diagnostic equipment, and the Rock 'n Roll Cab Express demonstrating tool storage customization, including units larger than what can fit on a standard franchisee van. These trucks are typically assigned to a particular region and work within that region. History Snap-on was founded as the Snap-on Wrench Company in Milwaukee, Wisconsin in 1920 by Joseph Johnson and William Seidemann. The business manufactured and marketed ten sockets that would \"snap on\" to five interchangeable handles. The company's slogan was \"5 do the work of 50\". Stanton Palmer and his partner in Chicago, picked up Snap-on Wrench as one of their lines and within a year they had expanded the market to whole US and Mexico and Canada. In 1930, Stanton Palmer arranged for the funding of the factory in Kenosha to cover their expanded orders and company's headquarters moved to Kenosha. The new company name Snap-on Tools was used with Stanton Palmer as President, Newton Tarble as Vice President and Johnson and Seidemann as Treasurer and Secretary. The new name was because Palmer added the rest of the line of tools with Blue Point Tools and the marketing company. Wisconsin. At Stanton Palmer's death Newton Tarble left the corporation. Mr. Myers became the second president of Snap-on Tools, as a largest creditor after the depression. He was President of Blue Point Tools. In return for Snap-on Stock, Myers gave Snap-on Tools stock to Mrs. Stanton Palmer and Newton Tarble in return for merging the marketing company and Blue Point Tools into Snap-on Tools. Newton Tarble left Snap-on Tools and Rogers Palmer, Stanton's son, became Vice President of Sales and President of Snap-on Canada. During World War II Rogers Palmer was a dollar-year-man and worked with the Defense Department to align the hand tools industry to align with tools needed for jeeps, tanks, airplanes, etc. He was a first President of the Tools Institute. After World War II, Rogers Palmer, as senior Vice President Sales, advertised for a military officer to organize and develop a larger sales force for the expected post war sales boom. Routes were developed for company dealers to see mechanics on a weekly basis. Eventually these salesmen became independent businessmen and authorized dealers using larger walk in vans to carry a growing product line. In 1956, the company continued to expand with the use of test equipment and wheel service products. This was the start of the company's jump into manufacturing automotive test equipment into the Snap-On line. Equipment included voltmeters, ammeters, disruptors, and alternator testers. The company opened its wrench forging plant in Elizabethton, Tennessee in 1974. The next year, Snap-on opened a manufacturing plant in Johnson City, Tennessee and closed the plant in 2007. In 1998, workers at the company's Milwaukee plant voted to join the Teamsters labor union and the company expanded the facility in 2013. Also in 1998, the company began a partnership with Lowe's home improvement chain retailer to produce its Kobalt line of tools. In 2010, the Murphy, North Carolina plant was named one of the top 10 plants in North America by IndustryWeek. In 2011, J.H. Williams & Co was officially renamed Snap-on Industrial Brands. In 2022, the company announced an expansion to its Milwaukee facility to grow its hand tool business. Acquisitions In 2014, the company acquired New Hampshire–based Pro-Cut for $42 million. In October 2016, the company acquired Car-O-Liner Holding AB, a Swedish collision repair tool company, for $155 million. Later that year, the company acquired Sturtevant Richmont for $13 million. In May 2017, the company acquired Norbar Torque Tools Holdings Limited for $72 million. In August 2019, the company acquired Cognitran Ltd for $31 million. In September 2020, the company acquired AutoCrib Inc. based in Tustin, California for $36 million. In March 2021, Snap-on acquired Canada-based Dealer-FX Group for $200 million. Racing sponsorships The first driver Snap-on became associated with was four-time Indianapolis 500 winner, Rick Mears in 1979. NASCAR The company previously sponsored Team Penske in NASCAR in the Cup Series and the Xfinity Series. IndyCar The company also sponsored Penske in the NTT IndyCar Series. In 2025, Snap-on would sponsor the IndyCar Series race at the Milwaukee Mile. MotoGP Snap-on had sponsored Repsol Honda Team in MotoGP since 1998. NHRA Snap-on sponsored NHRA drag racer Doug Herbert from 1992 until 2008. For the 2010 racing season, the company sponsored Penske. Since 1992, Snap-on has sponsored Cruz Pedregon. In 2004, the company began sponsoring Cruz's brother Tony Pedregon."
}