{
  "ticker": "SNPS",
  "cik": "0000883241",
  "company_name": "Synopsys",
  "corrected_name": "Synopsys",
  "wiki_title_used": "Synopsys",
  "exists": true,
  "raw_text": "Synopsys, Inc. is an American multinational electronic design automation (EDA) company headquartered in Sunnyvale, California, that focuses on design and verification of silicon chips, electronic system-level design and verification, and reusable components (intellectual property). Synopsys supplies tools and services to the semiconductor design and manufacturing industry. Products include tools for implementation of digital and analog circuits, simulators, and debugging environments that assist in the design of chips and computer systems. In 2024, Synopsys was listed as the 12th largest software company in the world.\n\nHistory\nSynopsys was founded by Aart de Geus, David Gregory, Alberto Sangiovanni-Vincentelli and Bill Krieger in 1986 in Research Triangle Park, North Carolina. The company was initially established as Optimal Solutions with a charter to develop and market logic synthesis technology developed by the team at General Electric's Advanced Computer-Aided Engineering Group. The company changed its name to Synopsys and moved to Mountain View, California in 1987. It became a public company through an initial public offering in February 1992, opening on NASDAQ at $18 a share and closing on the first trading day at $31.50. 2 million shares were offered; the company offered 1.55 million shares and stockholders offered 450,000 shares.\nIn 2006, the company built a supercomputer for EDA applications using commodity Linux servers and off-the-shelf hardware that was listed on the TOP500 as the 242nd most powerful computer, based on results on the LINPACK benchmark.\nSynopsys has been a constituent of the Nasdaq-100 and S&P 500 indices since 2017. \nThe integration of artificial intelligence (AI) has become increasingly important in electronic design automation (EDA), enabling notable advances in the automation, efficiency, and complexity of chip design processes. According to the company, Synopsys engineers began developing reinforcement learning applications for electronic design automation in 2017, which led to the introduction of the DSO.ai (design-space optimization) product for digital chip implementation in 2020, followed by a series of AI tools for IC verification and test, as well as other applications. In 2023, Synopsys announced the Copilot product in collaboration with Microsoft that leveraged large language models from OpenAI to assist in chip design. (For more information, see #Adoption of AI technologies.)\nIn August 2023, Synopsys named COO Sassine Ghazi as CEO. Ghazi succeeded Aart de Geus in January 2024, with de Geus transitioning to the role of executive chairman.\nOver the years, Synopsys has acquired numerous companies as a core part of its business strategy to expand its capabilities in electronic design automation, semiconductor IP, and related software sectors. Industry analysts have noted that these acquisitions have enabled Synopsys to build a broad portfolio and remain competitive within the fast-evolving semiconductor and software industries. (For more information, see #Mergers and acquisitions.) \nOn July 17, 2025, Synopsys completed its acquisition of Ansys, a global provider of engineering simulation software. The transaction, first announced on January 16, 2024, was valued at approximately $35 billion, making it the largest acquisition in Synopsys’ history. Several media outlets described the deal as one of the largest transactions in the engineering and software industry. The merger combines Synopsys’ EDA dominance with Ansys’ multiphysics simulation expertise, promising a new era of co-optimized chip and system design\n\nMarkets and competition\nSynopsys faces significant competition in the electronic design automation market, primarily from Cadence Design Systems and Siemens EDA (formerly Mentor Graphics), with the three companies collectively dominating approximately 75% of the global EDA market as of 2024. Additionally, Synopsys is the second largest semiconductor design intellectual property (IP) company by revenue (after ARM Holdings) and leads in market share for IP license revenues, notably providing reusable chip design modules such as those supporting Ethernet and UALink for advanced data center connectivity and AI accelerator infrastructure.\n\nGeographic presence\nHeadquartered in Sunnyvale, California, Synopsys maintains extensive office locations worldwide, including a strong presence across North America, Asia, and Europe. In the United States, the company’s largest concentration of employees is in the San Francisco Bay Area, comprising more than 1,480 staff, with additional sizable clusters in  Austin, Boston,  Portland, and  Hillsboro, with hundreds of additional employees. India serves as a critical hub, especially in Bengaluru, Noida, and Hyderabad, where Synopsys employs more than 8000 people. As of 2025, Synopsys' workforce numbers approximately 28000 worldwide, with thousands employees distributed across additional offices and remote locations, including significant operations in Canada, Mexico, Armenia, Singapore, and other regions. Its international offices can be found in cities such as Ottawa, Toronto, and Vancouver (Canada); Yerevan and Gyumri (Armenia); Bangalore, Hyderabad, and Noida (India); Penang (Malaysia); and Singapore, among others.\nSynopsys operates on a global scale, with its business spread across several major regions and markets. The United States is the company’s largest market, contributing 44.71% of total revenue in fiscal year 2024 (approximately $2.74 billion). Other significant markets include China, which represented 16.15% of revenue ($989.52 million); Korea, accounting for 12.62% ($773.02 million); and Europe, with 10.03% ($614.58 million). The company also recorded 16.49% of its revenue ($1.01 billion) under the \"Other Countries\" category, highlighting a diversified international footprint.\n\nBusiness in the United States\nIn addition to doing business with multiple American chip design and system integration companies, Synopsys maintains government contracts, which are often focused on research and development initiatives.\nIn 2020, the United States Department of Defense announced Synopsys as a partner in U.S. Defense Advanced Research Projects Agency (DARPA) Automatic Implementation of Secure Silicon (AISS) research program along with ARM, Boeing, IBM, and other entities focused on developing automated design tools for secure chips. In October 2022, Synopsys joined Intel's US Military Aerospace and Government Alliance (USMAG), under which Synopsys supplies secure EDA tools, IP, and design services for the US DoD and other government branches along with other chip design companies including Cadence and Siemens EDA. In 2025, DARPA announced companies that have been selected for the initial stage of the government’s Quantum Benchmarking Initiatives (QBI), in which Synopsys is participating along with Hewlett Packard, Applied Materials, University of Wisconsin and other organizations to advance quantum computing research and development. The company contributes its expertise in modeling and simulation, EDA tools and semiconductor IP, as part of this multi-partner effort to determine whether an industrially useful quantum computer can be built more rapidly than conventional projections suggest.\n\nBusiness in China\nIn 2017, the company established a $100 million strategic investment fund for the Chinese market.\nIn April 2021, following a Washington Post report on the use of Synopsys and Cadence Design Systems technology in the People's Liberation Army's military-civil fusion efforts, U.S. legislators Michael McCaul and Tom Cotton requested that the United States Department of Commerce tighten controls on the sales of semiconductor manufacturing software. In 2022, Bloomberg reported that Synopsys was under investigation by the United States Department of Commerce for unlawful technology transfers to sanctioned companies in China such as Huawei's HiSilicon and Semiconductor Manufacturing International Corporation.\nIn May 2025, the Trump administration briefly paused the issuing of licenses for exports of airplane and semiconductor technology to China, which impacted Synopsys and other American Electronic Design Automation vendors.\n(For more information, see #Controversies.)\n\nOffices in Armenia\nSynopsys Armenia is one of the largest Synopsys sites outside the United States, employing more than 1,000 people across two offices in Yerevan and one in Gyumri, making it one of the largest IT employers in the country. The Armenian offices serve as a key research and development hub, providing support for electronic design automation (EDA), design for manufacturing (DFM), and semiconductor intellectual property (IP) solutions. Synopsys Armenia’s teams work on advanced logic and analog integrated circuit design, software development, and verification, contributing both to global product support and core innovation. In addition to technical work, Synopsys Armenia invests heavily in workforce development and professional education, collaborating with local universities to train highly skilled specialists in microelectronics and related fields. This long-standing commitment has positioned Synopsys Armenia as a driving force for technological and educational advancement within Armenia.\n\nAdoption of AI technologies\nIn the early 2010s, Synopsys launched its Smart Everything Everywhere initiative to explore applications of artificial intelligence within electronic design automation tools. This strategy envisioned the integration of intelligent capabilities into electronic design automation tools, positioning Synopsys to leverage AI for addressing the increasing complexity of semiconductor design challenges. The strategic commitment was formalized in 2017 when Synopsys engineers, inspired by Google's AlphaGo victory over Go master Lee Sedol in 2016, began developing reinforcement learning applications for electronic design automation with management approval intelligence-driven EDA solutions.\nIn March 2020, Synopsys introduced DSO.ai (Design Space Optimization AI), a cloud-based AI-based software tool for chip design, The software uses AI (reinforcement learning) to automate logic synthesis as well as place and route decisions for circuit blocks. The tool searches for optimization targets in large solution spaces of chip design to enhance power, performance, and area metrics.\nAccording to Synopsys, DSO.ai was used in over 100 commercial chip tape-outs by 2023; the company stated that users observed increases in productivity and reductions in power consumption.\nIn March 2023, Synopsys expanded its artificial intelligence applications by introducing VSO.ai (Verification Space Optimization) and TSO.ai (Test Space Optimization) as part of the Synopsys.ai suite. VSO.ai uses machine learning to accelerate verification coverage closure and identify functional coverage gaps, while TSO.ai applies reinforcement learning to optimize test pattern generation. Renesas reported achieving up to 10x improvement in reducing functional coverage holes and up to 30% increase in IP verification productivity using VSO.ai.\nIn November 2023, Synopsys launched Synopsys.ai Copilot through a collaboration with Microsoft, integrating Azure OpenAI service to provide generative artificial intelligence capabilities for semiconductor design via the use of large language models. Synopsys.ai Copilot supports natural language queries in chip design workflows; Synopsys asserts it may help mitigate anticipated staffing shortfalls in the semiconductor industry.\nAs of 2025, the evolution of Synopsys' AI strategy has progressed beyond individual AI tools toward transforming entire workflows. According to industry analysis, early-career engineers in chip design traditionally spend up to 40% of their time searching for information and performing repetitive manual tasks, creating significant inefficiencies in the design process. Synopsys has responded by developing assistive AI technologies that can process large amounts of proprietary technical documentation and EDA tool logs, generate optimized code and scripts, and provide real-time debugging suggestions. Synopsys reports that some users have applied AI-based tools to tasks such as  analog circuit design, register-transfer level (RTL) code generation, timing analysis, and design rule checking, with the intent of reallocating engineering effort toward more complex design activities.\nAt the March 2025 SNUG (Synopsys User Group) conference, CEO Sassine Ghazi presented Synopsys’s strategic framework for AgentEngineer technologies, which the company describes as progressing from AI assistance toward more autonomous chip design workflows. Analogous to  the  classification of vehicular autonomy, this framework defines five distinct levels of automation (including existing products) designed to address the semiconductor industry’s talent shortage and empower engineers to undertake more creative, value-added work while accelerating time-to-market:\n\nThe transition to autonomous AI agents aims to enable engineers to focus on activities that differentiate products and accelerate time-to-market, transforming the traditional chip design process from manual workflows to AI-orchestrated automation.\n\nMergers and acquisitions\nSynopsys has grown significantly by acquiring companies in electronic design automation and related fields.\n\nCoWare\nCoWare development was initiated by the Interuniversity Microelectronics Centre in Belgium as an internal project in 1992; it spun off as an independent company, supplying platform-driven electronic system-level (ESL) design software and services, four years later. CoWare was acquired by Synopsys in February 2010.\n\nCode Dx\nCode Dx was an American software technology company active from 2015 to 2021. The company's self-titled flagship product is a vulnerability management system that combines and correlates the results generated by a wide variety of static and dynamic testing tools. It was acquired by Synopsys in 2021.\n\nAvanti Corporation\nAvanti Corporation (styled as \"Avant!\") was founded when several former Cadence Design Systems employees bought the startup ArcSys, which had previously merged with Integrated Silicon Solutions (ISS), gaining Avanti its design rule checking and layout versus schematic tool Hercules (including 3D silicon structure modeling). Avanti then bought Compass Design Automation, which had fully integrated IC design flow and ASIC libraries, especially its place and route tool, which Avanti reworked to create Saturn and Apollo II. Avanti also bought TMA (Technology Modeling Associates), which brought its pioneering TCAD and Proteus optical proximity correction tools. The acquisition of Avanti was Synopsys' most significant and controversial acquisition. At the time, Avanti was the No. 4 company in the EDA industry, and was struggling with a major lawsuit from Cadence for software theft. Avanti was merged into Synopsys on June 6, 2002, during the litigation. Synopsys paid Cadence about $265 million to end that litigation. Soon after the settlement, the California Supreme Court upheld the lower court's earlier decision. Synopsys then paid $26.1 million to Silvaco to settle two of Silvaco's three lawsuits against Meta-Software, earlier purchased by Avanti, and its president. The lawsuits were filed in 1995 and inherited by Avanti.\n\nOptical Research Associates\nSynopsys acquired Optical Research Associates (ORA) in 2010, including its software products CODE V and LightTools.\n\nMagma Design Automation\nSynopsys agreed to buy its competitor Magma Design Automation for $507 million in an all-cash deal in November 2011.\nThe two companies previously faced drawn-out, back-and-forth patent disputes, which began in 2004. These disputes arose when Synopsys claimed one of Magma's co-founders, Lukas van Ginneken, developed technology for Magma products that was based on work he conducted while employed at Synopsys. While van Ginneken later acknowledged the claim, Magma and Synopsys continued disputing each other's patents. The litigations were eventually settled in 2007, with Magma paying Synopsys $12.5 million, and the companies agreeing to cross-license the disputed patents to each other.\n\nCiranova\nCiranova was an EDA company which focused on analog design automation. The company authored the Python-based PyCell software now central to IPL Alliance iPDK parameterized cells (used by many foundries such as TSMC), and also developed an automatic analog layout tools called Helix. Ciranova was acquired by Synopsys in 2012.\n\nNovas Software\nNovas Software was a company founded in 1996 to address debugging of chip designs. Novas was purchased by Taiwan-based EDA company SpringSoft in May 2008. SpringSoft and Novas were acquired by Synopsys in 2012.\n\nNumerical Technologies\nNumerical Technologies, Inc. was a San Jose-based electronic design automation public (NASDAQ: NMTC) company. The company was primarily known for its intellectual property, software tools and services covering phase-shifting mask technology. On March 3, 2003, it was acquired by Synopsys for $250 million.\n\nSpringSoft\nSpringSoft is a software company that developed VLSI design and debugging software. The company was founded with a grant from the Taiwanese National Science Council in February 1996.\nIn 1997, SpringSoft established Novas Software in Silicon Valley to market Springsoft's VLSI Debugging software. SpringSoft created a custom layout tool called Laker and a US-based company called Silicon Canvas. In May 2008, SpringSoft purchased Novas Software Silicon Canvas and combined them to form the wholly owned subsidiary SpringSoft USA. SpringSoft employed over 400 people with office locations across the world.\nSynopsys announced its acquisition of SpringSoft in 2012.\n\nSynplicity\nSynplicity Inc. was a supplier of software for the design of programmable logic devices (FPGAs, PLDs, and CPLDs) used for communications, military/aerospace, consumer, semiconductor, computer and other electronic systems. Synplicity's tools provided logic synthesis, physical synthesis, and verification functions for FPGA, FPGA-based ASIC prototyping, and DSP designers. Synplicity was listed on Nasdaq until it was acquired by Synopsys for $227 million in a transaction finalized on May 15, 2008.\n\nARC International\nARC International PLC was the designer of ARC (Argonaut RISC Core) embedded processors, which were widely used in SoC devices for IoT, storage, digital home, mobile, and automotive applications. Virage Logic, which acquired ARC International in 2009, was sold to Synopsys in 2010.\n\nCoverity\nIn February 2014, Synopsys agreed to acquire static code analysis vendor Coverity for $375 million. Synopsys relied on Coverity's products for around ten years prior to the acquisition, helping improve software security by finding and fixing defects in software code before its release.\nCoverity's open-source Coverity Scan tool was hacked and used for cryptocurrency mining in February 2018. Synopsys took down the service for four weeks and confirmed the incident did not affect any of its corporate network and found no evidence of data abuse of its open-source users.\n\nCodenomicon\nIn 2015 Synopsys acquired the Finnish developer of security software Codenomicon. Codenomicon had itself previously acquired the Finnish software company Clarified Networks in 2011.\n\nCigital\nSynopsys announced the acquisition of Cigital along with its 2015 spinoff Codiscope in November 2016. The suite of its software security products became part of Synopsys' software integrity group.\n\nQuantumWise\nIn 2017 Synopsys acquired the atomic-scale modeling software company QuantumWise (former Atomistix), which provides tools for quantum-based and classical simulations in the field of material science.\n\nBlack Duck Software\nBlack Duck Software was a privately held company focused on automating the process of identifying and creating an inventory of open source code used in software applications, as well as detecting known security vulnerabilities and license compliance issues. It ran the Open Hub website. Black Duck Software was acquired by Synopsys in December 2017 for $565 million and integrated into the Software Integrity Group (SIG) until it was spun out. In October 2024, the private equity firms Clearlake Capital and Francisco Partners completed the acquisition of the Synopsys Software Integrity Group (SIG) to reestablish Black Duck Software as an independent standalone application security company. The transaction, first announced in May 2024, was valued at up to $2.1 billion, including $475 million in cash.\n\nWhiteHat Security\nIn April 2022, Synopsys announced the acquisition of WhiteHat Security for $330 million. WhiteHat Security was founded in 2001 and provides application security as well as insights for DevOps teams.\n\nPikeTec\nIn 2023, Synopsys completed the acquisition of PikeTec, a provider of verification and testing tools for automotive software.\n\nIntrinsic ID\nIn March 2024, Synopsys announced it had acquired the Internet of things digital authentication company Intrinsic ID for an undisclosed amount.\n\nAnsys\nIn January 2024, Synopsys announced its intention to acquire engineering software company Ansys for $35 billion. That would expand Synopsys' prominence in simulation software and systems design for chip designers, automobiles, airplanes. The companies have had a research and development partnership since 2017. \nThe Federal Trade Commission required Synopsys to divest certain assets as part of the acquisition. Under the proposed consent order, Synopsys agreed to divest its optical and photonic software tools, while Ansys divested its PowerArtist power consumption analysis tool. In September 2024, Synopsys announced it would sell its optical systems division to Keysight Technologies to address regulatory concerns.\nIn January 2025, Synopsys announced that the European Commission had approved its proposed $35 Billion acquisition of Ansys in Phase 1, marking significant progress in obtaining regulatory clearances for the merger. The company also reported that the UK Competition and Markets Authority had provisionally accepted remedies for Phase 1 approval, and the waiting period under the U.S. Hart-Scott-Rodino Antitrust Improvements Act had expired. While actively working with the U.S. Federal Trade Commission (FTC) on proposed remedies review, Synopsys noted that China's State Administration for Market Regulation had officially accepted their merger filing. The acquisition aimed to address growing customer demands for integrated Electronic Design Automation and Simulation and Analysis software solutions. The acquisition was completed on July 17, 2025.\n\nControversies\nExport control investigations and restrictions\nCommerce Department investigation\nIn 2022, media outlets indicated that the U.S. Department of Commerce had opened an inquiry into whether Synopsys may have breached export control rules related to China. The review reportedly focused on Synopsys’s collaboration with its Chinese partners and whether it supplied chip designs and software to Huawei Technologies' HiSilicon unit for manufacture at Semiconductor Manufacturing International Corporation (SMIC), given that both Huawei and SMIC had been placed on the U.S. Entity List due to national security concerns. Synopsys disclosed in December 2021 that it had received a subpoena from the Bureau of Industry and Security requesting information about \"transactions with certain Chinese entities\". The company stated it believed it was in full compliance with all applicable regulations.\n\n2025 export restrictions\nIn May 2025, in the context of trade negotiations with China, the US government briefly paused the issuing of licenses for exports of airplane and semiconductor technology to China, which impacted Synopsys and its competitors. Synopsys suspended its financial guidance after receiving a letter from the Bureau of Industry and Security informing it of new export restrictions related to China. According to an internal memo obtained by Reuters, Synopsys told staff in China to halt services and sales in the country and stop taking new orders to comply with the new restrictions, which took effect on May 29, 2025. The restrictions broadly prohibited sales of Synopsys products and services to China, affecting all customers in the country. However, in July 2025, the U.S. government rescinded these export controls, allowing Synopsys and other electronic design automation companies to resume sales to China.\n\nSee also\nList of EDA companies\nComparison of EDA software\nList of tools for static code analysis\nSecurity information and event management\nDynamic application security testing\n\nReferences\nExternal links\nOfficial website \nBusiness data for Synopsys, Inc.:",
  "clean_text": "Synopsys, Inc. is an American multinational electronic design automation (EDA) company headquartered in Sunnyvale, California, that focuses on design and verification of silicon chips, electronic system-level design and verification, and reusable components (intellectual property). Synopsys supplies tools and services to the semiconductor design and manufacturing industry. Products include tools for implementation of digital and analog circuits, simulators, and debugging environments that assist in the design of chips and computer systems. In 2024, Synopsys was listed as the 12th largest software company in the world. History Synopsys was founded by Aart de Geus, David Gregory, Alberto Sangiovanni-Vincentelli and Bill Krieger in 1986 in Research Triangle Park, North Carolina. The company was initially established as Optimal Solutions with a charter to develop and market logic synthesis technology developed by the team at General Electric's Advanced Computer-Aided Engineering Group. The company changed its name to Synopsys and moved to Mountain View, California in 1987. It became a public company through an initial public offering in February 1992, opening on NASDAQ at $18 a share and closing on the first trading day at $31.50. 2 million shares were offered; the company offered 1.55 million shares and stockholders offered 450,000 shares. In 2006, the company built a supercomputer for EDA applications using commodity Linux servers and off-the-shelf hardware that was listed on the TOP500 as the 242nd most powerful computer, based on results on the LINPACK benchmark. Synopsys has been a constituent of the Nasdaq-100 and S&P 500 indices since 2017. The integration of artificial intelligence (AI) has become increasingly important in electronic design automation (EDA), enabling notable advances in the automation, efficiency, and complexity of chip design processes. According to the company, Synopsys engineers began developing reinforcement learning applications for electronic design automation in 2017, which led to the introduction of the DSO.ai (design-space optimization) product for digital chip implementation in 2020, followed by a series of AI tools for IC verification and test, as well as other applications. In 2023, Synopsys announced the Copilot product in collaboration with Microsoft that leveraged large language models from OpenAI to assist in chip design. (For more information, see #Adoption of AI technologies.) In August 2023, Synopsys named COO Sassine Ghazi as CEO. Ghazi succeeded Aart de Geus in January 2024, with de Geus transitioning to the role of executive chairman. Over the years, Synopsys has acquired numerous companies as a core part of its business strategy to expand its capabilities in electronic design automation, semiconductor IP, and related software sectors. Industry analysts have noted that these acquisitions have enabled Synopsys to build a broad portfolio and remain competitive within the fast-evolving semiconductor and software industries. (For more information, see #Mergers and acquisitions.) On July 17, 2025, Synopsys completed its acquisition of Ansys, a global provider of engineering simulation software. The transaction, first announced on January 16, 2024, was valued at approximately $35 billion, making it the largest acquisition in Synopsys’ history. Several media outlets described the deal as one of the largest transactions in the engineering and software industry. The merger combines Synopsys’ EDA dominance with Ansys’ multiphysics simulation expertise, promising a new era of co-optimized chip and system design Markets and competition Synopsys faces significant competition in the electronic design automation market, primarily from Cadence Design Systems and Siemens EDA (formerly Mentor Graphics), with the three companies collectively dominating approximately 75% of the global EDA market as of 2024. Additionally, Synopsys is the second largest semiconductor design intellectual property (IP) company by revenue (after ARM Holdings) and leads in market share for IP license revenues, notably providing reusable chip design modules such as those supporting Ethernet and UALink for advanced data center connectivity and AI accelerator infrastructure. Geographic presence Headquartered in Sunnyvale, California, Synopsys maintains extensive office locations worldwide, including a strong presence across North America, Asia, and Europe. In the United States, the company’s largest concentration of employees is in the San Francisco Bay Area, comprising more than 1,480 staff, with additional sizable clusters in Austin, Boston, Portland, and Hillsboro, with hundreds of additional employees. India serves as a critical hub, especially in Bengaluru, Noida, and Hyderabad, where Synopsys employs more than 8000 people. As of 2025, Synopsys' workforce numbers approximately 28000 worldwide, with thousands employees distributed across additional offices and remote locations, including significant operations in Canada, Mexico, Armenia, Singapore, and other regions. Its international offices can be found in cities such as Ottawa, Toronto, and Vancouver (Canada); Yerevan and Gyumri (Armenia); Bangalore, Hyderabad, and Noida (India); Penang (Malaysia); and Singapore, among others. Synopsys operates on a global scale, with its business spread across several major regions and markets. The United States is the company’s largest market, contributing 44.71% of total revenue in fiscal year 2024 (approximately $2.74 billion). Other significant markets include China, which represented 16.15% of revenue ($989.52 million); Korea, accounting for 12.62% ($773.02 million); and Europe, with 10.03% ($614.58 million). The company also recorded 16.49% of its revenue ($1.01 billion) under the \"Other Countries\" category, highlighting a diversified international footprint. Business in the United States In addition to doing business with multiple American chip design and system integration companies, Synopsys maintains government contracts, which are often focused on research and development initiatives. In 2020, the United States Department of Defense announced Synopsys as a partner in U.S. Defense Advanced Research Projects Agency (DARPA) Automatic Implementation of Secure Silicon (AISS) research program along with ARM, Boeing, IBM, and other entities focused on developing automated design tools for secure chips. In October 2022, Synopsys joined Intel's US Military Aerospace and Government Alliance (USMAG), under which Synopsys supplies secure EDA tools, IP, and design services for the US DoD and other government branches along with other chip design companies including Cadence and Siemens EDA. In 2025, DARPA announced companies that have been selected for the initial stage of the government’s Quantum Benchmarking Initiatives (QBI), in which Synopsys is participating along with Hewlett Packard, Applied Materials, University of Wisconsin and other organizations to advance quantum computing research and development. The company contributes its expertise in modeling and simulation, EDA tools and semiconductor IP, as part of this multi-partner effort to determine whether an industrially useful quantum computer can be built more rapidly than conventional projections suggest. Business in China In 2017, the company established a $100 million strategic investment fund for the Chinese market. In April 2021, following a Washington Post report on the use of Synopsys and Cadence Design Systems technology in the People's Liberation Army's military-civil fusion efforts, U.S. legislators Michael McCaul and Tom Cotton requested that the United States Department of Commerce tighten controls on the sales of semiconductor manufacturing software. In 2022, Bloomberg reported that Synopsys was under investigation by the United States Department of Commerce for unlawful technology transfers to sanctioned companies in China such as Huawei's HiSilicon and Semiconductor Manufacturing International Corporation. In May 2025, the Trump administration briefly paused the issuing of licenses for exports of airplane and semiconductor technology to China, which impacted Synopsys and other American Electronic Design Automation vendors. (For more information, see #Controversies.) Offices in Armenia Synopsys Armenia is one of the largest Synopsys sites outside the United States, employing more than 1,000 people across two offices in Yerevan and one in Gyumri, making it one of the largest IT employers in the country. The Armenian offices serve as a key research and development hub, providing support for electronic design automation (EDA), design for manufacturing (DFM), and semiconductor intellectual property (IP) solutions. Synopsys Armenia’s teams work on advanced logic and analog integrated circuit design, software development, and verification, contributing both to global product support and core innovation. In addition to technical work, Synopsys Armenia invests heavily in workforce development and professional education, collaborating with local universities to train highly skilled specialists in microelectronics and related fields. This long-standing commitment has positioned Synopsys Armenia as a driving force for technological and educational advancement within Armenia. Adoption of AI technologies In the early 2010s, Synopsys launched its Smart Everything Everywhere initiative to explore applications of artificial intelligence within electronic design automation tools. This strategy envisioned the integration of intelligent capabilities into electronic design automation tools, positioning Synopsys to leverage AI for addressing the increasing complexity of semiconductor design challenges. The strategic commitment was formalized in 2017 when Synopsys engineers, inspired by Google's AlphaGo victory over Go master Lee Sedol in 2016, began developing reinforcement learning applications for electronic design automation with management approval intelligence-driven EDA solutions. In March 2020, Synopsys introduced DSO.ai (Design Space Optimization AI), a cloud-based AI-based software tool for chip design, The software uses AI (reinforcement learning) to automate logic synthesis as well as place and route decisions for circuit blocks. The tool searches for optimization targets in large solution spaces of chip design to enhance power, performance, and area metrics. According to Synopsys, DSO.ai was used in over 100 commercial chip tape-outs by 2023; the company stated that users observed increases in productivity and reductions in power consumption. In March 2023, Synopsys expanded its artificial intelligence applications by introducing VSO.ai (Verification Space Optimization) and TSO.ai (Test Space Optimization) as part of the Synopsys.ai suite. VSO.ai uses machine learning to accelerate verification coverage closure and identify functional coverage gaps, while TSO.ai applies reinforcement learning to optimize test pattern generation. Renesas reported achieving up to 10x improvement in reducing functional coverage holes and up to 30% increase in IP verification productivity using VSO.ai. In November 2023, Synopsys launched Synopsys.ai Copilot through a collaboration with Microsoft, integrating Azure OpenAI service to provide generative artificial intelligence capabilities for semiconductor design via the use of large language models. Synopsys.ai Copilot supports natural language queries in chip design workflows; Synopsys asserts it may help mitigate anticipated staffing shortfalls in the semiconductor industry. As of 2025, the evolution of Synopsys' AI strategy has progressed beyond individual AI tools toward transforming entire workflows. According to industry analysis, early-career engineers in chip design traditionally spend up to 40% of their time searching for information and performing repetitive manual tasks, creating significant inefficiencies in the design process. Synopsys has responded by developing assistive AI technologies that can process large amounts of proprietary technical documentation and EDA tool logs, generate optimized code and scripts, and provide real-time debugging suggestions. Synopsys reports that some users have applied AI-based tools to tasks such as analog circuit design, register-transfer level (RTL) code generation, timing analysis, and design rule checking, with the intent of reallocating engineering effort toward more complex design activities. At the March 2025 SNUG (Synopsys User Group) conference, CEO Sassine Ghazi presented Synopsys’s strategic framework for AgentEngineer technologies, which the company describes as progressing from AI assistance toward more autonomous chip design workflows. Analogous to the classification of vehicular autonomy, this framework defines five distinct levels of automation (including existing products) designed to address the semiconductor industry’s talent shortage and empower engineers to undertake more creative, value-added work while accelerating time-to-market: The transition to autonomous AI agents aims to enable engineers to focus on activities that differentiate products and accelerate time-to-market, transforming the traditional chip design process from manual workflows to AI-orchestrated automation. Mergers and acquisitions Synopsys has grown significantly by acquiring companies in electronic design automation and related fields. CoWare CoWare development was initiated by the Interuniversity Microelectronics Centre in Belgium as an internal project in 1992; it spun off as an independent company, supplying platform-driven electronic system-level (ESL) design software and services, four years later. CoWare was acquired by Synopsys in February 2010. Code Dx Code Dx was an American software technology company active from 2015 to 2021. The company's self-titled flagship product is a vulnerability management system that combines and correlates the results generated by a wide variety of static and dynamic testing tools. It was acquired by Synopsys in 2021. Avanti Corporation Avanti Corporation (styled as \"Avant!\") was founded when several former Cadence Design Systems employees bought the startup ArcSys, which had previously merged with Integrated Silicon Solutions (ISS), gaining Avanti its design rule checking and layout versus schematic tool Hercules (including 3D silicon structure modeling). Avanti then bought Compass Design Automation, which had fully integrated IC design flow and ASIC libraries, especially its place and route tool, which Avanti reworked to create Saturn and Apollo II. Avanti also bought TMA (Technology Modeling Associates), which brought its pioneering TCAD and Proteus optical proximity correction tools. The acquisition of Avanti was Synopsys' most significant and controversial acquisition. At the time, Avanti was the No. 4 company in the EDA industry, and was struggling with a major lawsuit from Cadence for software theft. Avanti was merged into Synopsys on June 6, 2002, during the litigation. Synopsys paid Cadence about $265 million to end that litigation. Soon after the settlement, the California Supreme Court upheld the lower court's earlier decision. Synopsys then paid $26.1 million to Silvaco to settle two of Silvaco's three lawsuits against Meta-Software, earlier purchased by Avanti, and its president. The lawsuits were filed in 1995 and inherited by Avanti. Optical Research Associates Synopsys acquired Optical Research Associates (ORA) in 2010, including its software products CODE V and LightTools. Magma Design Automation Synopsys agreed to buy its competitor Magma Design Automation for $507 million in an all-cash deal in November 2011. The two companies previously faced drawn-out, back-and-forth patent disputes, which began in 2004. These disputes arose when Synopsys claimed one of Magma's co-founders, Lukas van Ginneken, developed technology for Magma products that was based on work he conducted while employed at Synopsys. While van Ginneken later acknowledged the claim, Magma and Synopsys continued disputing each other's patents. The litigations were eventually settled in 2007, with Magma paying Synopsys $12.5 million, and the companies agreeing to cross-license the disputed patents to each other. Ciranova Ciranova was an EDA company which focused on analog design automation. The company authored the Python-based PyCell software now central to IPL Alliance iPDK parameterized cells (used by many foundries such as TSMC), and also developed an automatic analog layout tools called Helix. Ciranova was acquired by Synopsys in 2012. Novas Software Novas Software was a company founded in 1996 to address debugging of chip designs. Novas was purchased by Taiwan-based EDA company SpringSoft in May 2008. SpringSoft and Novas were acquired by Synopsys in 2012. Numerical Technologies Numerical Technologies, Inc. was a San Jose-based electronic design automation public (NASDAQ: NMTC) company. The company was primarily known for its intellectual property, software tools and services covering phase-shifting mask technology. On March 3, 2003, it was acquired by Synopsys for $250 million. SpringSoft SpringSoft is a software company that developed VLSI design and debugging software. The company was founded with a grant from the Taiwanese National Science Council in February 1996. In 1997, SpringSoft established Novas Software in Silicon Valley to market Springsoft's VLSI Debugging software. SpringSoft created a custom layout tool called Laker and a US-based company called Silicon Canvas. In May 2008, SpringSoft purchased Novas Software Silicon Canvas and combined them to form the wholly owned subsidiary SpringSoft USA. SpringSoft employed over 400 people with office locations across the world. Synopsys announced its acquisition of SpringSoft in 2012. Synplicity Synplicity Inc. was a supplier of software for the design of programmable logic devices (FPGAs, PLDs, and CPLDs) used for communications, military/aerospace, consumer, semiconductor, computer and other electronic systems. Synplicity's tools provided logic synthesis, physical synthesis, and verification functions for FPGA, FPGA-based ASIC prototyping, and DSP designers. Synplicity was listed on Nasdaq until it was acquired by Synopsys for $227 million in a transaction finalized on May 15, 2008. ARC International ARC International PLC was the designer of ARC (Argonaut RISC Core) embedded processors, which were widely used in SoC devices for IoT, storage, digital home, mobile, and automotive applications. Virage Logic, which acquired ARC International in 2009, was sold to Synopsys in 2010. Coverity In February 2014, Synopsys agreed to acquire static code analysis vendor Coverity for $375 million. Synopsys relied on Coverity's products for around ten years prior to the acquisition, helping improve software security by finding and fixing defects in software code before its release. Coverity's open-source Coverity Scan tool was hacked and used for cryptocurrency mining in February 2018. Synopsys took down the service for four weeks and confirmed the incident did not affect any of its corporate network and found no evidence of data abuse of its open-source users. Codenomicon In 2015 Synopsys acquired the Finnish developer of security software Codenomicon. Codenomicon had itself previously acquired the Finnish software company Clarified Networks in 2011. Cigital Synopsys announced the acquisition of Cigital along with its 2015 spinoff Codiscope in November 2016. The suite of its software security products became part of Synopsys' software integrity group. QuantumWise In 2017 Synopsys acquired the atomic-scale modeling software company QuantumWise (former Atomistix), which provides tools for quantum-based and classical simulations in the field of material science. Black Duck Software Black Duck Software was a privately held company focused on automating the process of identifying and creating an inventory of open source code used in software applications, as well as detecting known security vulnerabilities and license compliance issues. It ran the Open Hub website. Black Duck Software was acquired by Synopsys in December 2017 for $565 million and integrated into the Software Integrity Group (SIG) until it was spun out. In October 2024, the private equity firms Clearlake Capital and Francisco Partners completed the acquisition of the Synopsys Software Integrity Group (SIG) to reestablish Black Duck Software as an independent standalone application security company. The transaction, first announced in May 2024, was valued at up to $2.1 billion, including $475 million in cash. WhiteHat Security In April 2022, Synopsys announced the acquisition of WhiteHat Security for $330 million. WhiteHat Security was founded in 2001 and provides application security as well as insights for DevOps teams. PikeTec In 2023, Synopsys completed the acquisition of PikeTec, a provider of verification and testing tools for automotive software. Intrinsic ID In March 2024, Synopsys announced it had acquired the Internet of things digital authentication company Intrinsic ID for an undisclosed amount. Ansys In January 2024, Synopsys announced its intention to acquire engineering software company Ansys for $35 billion. That would expand Synopsys' prominence in simulation software and systems design for chip designers, automobiles, airplanes. The companies have had a research and development partnership since 2017. The Federal Trade Commission required Synopsys to divest certain assets as part of the acquisition. Under the proposed consent order, Synopsys agreed to divest its optical and photonic software tools, while Ansys divested its PowerArtist power consumption analysis tool. In September 2024, Synopsys announced it would sell its optical systems division to Keysight Technologies to address regulatory concerns. In January 2025, Synopsys announced that the European Commission had approved its proposed $35 Billion acquisition of Ansys in Phase 1, marking significant progress in obtaining regulatory clearances for the merger. The company also reported that the UK Competition and Markets Authority had provisionally accepted remedies for Phase 1 approval, and the waiting period under the U.S. Hart-Scott-Rodino Antitrust Improvements Act had expired. While actively working with the U.S. Federal Trade Commission (FTC) on proposed remedies review, Synopsys noted that China's State Administration for Market Regulation had officially accepted their merger filing. The acquisition aimed to address growing customer demands for integrated Electronic Design Automation and Simulation and Analysis software solutions. The acquisition was completed on July 17, 2025. Controversies Export control investigations and restrictions Commerce Department investigation In 2022, media outlets indicated that the U.S. Department of Commerce had opened an inquiry into whether Synopsys may have breached export control rules related to China. The review reportedly focused on Synopsys’s collaboration with its Chinese partners and whether it supplied chip designs and software to Huawei Technologies' HiSilicon unit for manufacture at Semiconductor Manufacturing International Corporation (SMIC), given that both Huawei and SMIC had been placed on the U.S. Entity List due to national security concerns. Synopsys disclosed in December 2021 that it had received a subpoena from the Bureau of Industry and Security requesting information about \"transactions with certain Chinese entities\". The company stated it believed it was in full compliance with all applicable regulations. 2025 export restrictions In May 2025, in the context of trade negotiations with China, the US government briefly paused the issuing of licenses for exports of airplane and semiconductor technology to China, which impacted Synopsys and its competitors. Synopsys suspended its financial guidance after receiving a letter from the Bureau of Industry and Security informing it of new export restrictions related to China. According to an internal memo obtained by Reuters, Synopsys told staff in China to halt services and sales in the country and stop taking new orders to comply with the new restrictions, which took effect on May 29, 2025. The restrictions broadly prohibited sales of Synopsys products and services to China, affecting all customers in the country. However, in July 2025, the U.S. government rescinded these export controls, allowing Synopsys and other electronic design automation companies to resume sales to China."
}