{
  "ticker": "SOLS",
  "cik": "0002064953",
  "company_name": "Solstice Advanced Materials",
  "corrected_name": "Solstice Advanced Materials",
  "wiki_title_used": "Solstice Advanced Materials",
  "exists": true,
  "raw_text": "Solstice Advanced Materials, Inc. is an American specialty materials company, based in Morris Plains, New Jersey, that was formed on October 30, 2025, as a spin-off of Honeywell's specialty materials business. The company is listed on the Nasdaq under the ticker symbol SOLS and is a component of the Nasdaq-100 and S&P 500 indices. The company is divided into two business segments: Refrigerants & Applied Solutions (RAS), which includes the namesake Solstice, Genetron, and Aclar brands, used for low global warming potential refrigerants, blowing agents, solvents, and aerosol materials, and Electronic & Specialty Materials (ESM), which includes the Spectra, Fluka, and Hydranal brands, used for electronic materials, specialty fibers, and laboratory life sciences materials.\n\nHistory\nIn October 2024, Honeywell announced it will be spinning off its Advanced Materials business, which was later named Solstice Advanced Materials.\nOn October 17, 2025, Honeywell shareholders of record received one share of Solstice common stock for every four shares of Honeywell common stock they owned.\nThe spin-off of Solstice was completed on October 30, 2025, with the company launching on the Nasdaq and joining the Nasdaq-100 and S&P 500 indices. David Sewell, formerly of WestRock and Sherwin-Williams, became the company's president and CEO.\n\n\n== References ==",
  "clean_text": "Solstice Advanced Materials, Inc. is an American specialty materials company, based in Morris Plains, New Jersey, that was formed on October 30, 2025, as a spin-off of Honeywell's specialty materials business. The company is listed on the Nasdaq under the ticker symbol SOLS and is a component of the Nasdaq-100 and S&P 500 indices. The company is divided into two business segments: Refrigerants & Applied Solutions (RAS), which includes the namesake Solstice, Genetron, and Aclar brands, used for low global warming potential refrigerants, blowing agents, solvents, and aerosol materials, and Electronic & Specialty Materials (ESM), which includes the Spectra, Fluka, and Hydranal brands, used for electronic materials, specialty fibers, and laboratory life sciences materials. History In October 2024, Honeywell announced it will be spinning off its Advanced Materials business, which was later named Solstice Advanced Materials. On October 17, 2025, Honeywell shareholders of record received one share of Solstice common stock for every four shares of Honeywell common stock they owned. The spin-off of Solstice was completed on October 30, 2025, with the company launching on the Nasdaq and joining the Nasdaq-100 and S&P 500 indices. David Sewell, formerly of WestRock and Sherwin-Williams, became the company's president and CEO. == References =="
}