{
  "ticker": "SOLV",
  "cik": "0001964738",
  "company_name": "Solventum",
  "corrected_name": "Solventum",
  "wiki_title_used": "Solventum",
  "exists": true,
  "raw_text": "Solventum Corporation is an American health care company that was spun off from 3M on April 1, 2024.\n\nHistory\nSpin-off\nOn July 26, 2022, 3M announced that it would spin off its healthcare division as a separate company to streamline operations. The new company would assume 3M's business in wound and oral care, health informatics, and biopharmaceutical filtration. The sales of products in these fields accounted for about a quarter of 3M's total sales in 2021. CEO Mike Roman said that the split would \"position 3M for the future, to create more opportunity and greater certainty\".\nBloomberg News said that the move followed a period of declining profits attributed to shifting economic trends, and would \"dramatically reshape a company known for diverse product lines, from electronic components to dental adhesives to Post-it notes\". In fact, the announcement of the spin-off occurred the same day as a separate announcement that a 3M subsidiary, Aearo Technologies, had declared Chapter 11 bankruptcy after settling lawsuits alleging that the earplugs it had manufactured for U.S. military service members were defective and damaged their hearing.\nMany observers placed this business decision in a larger trend of other industrial conglomerates that had undergone similar splits in the preceding few years. In November 2021, General Electric announced that it would spin off its health care, aerospace, and energy businesses as GE HealthCare, GE Aerospace, and GE Vernova, respectively; the same week, Johnson & Johnson announced that it would spin off its consumer health division as a separate company, Kenvue. Comparisons were also made to the decisions by Kellogg's and Toshiba to split into multiple entities, as well as United Technologies's spin-off of Otis Worldwide and Carrier Global before its merger with Raytheon. 3M itself sold its food safety business to Neogen in September 2022.\nOn January 24, 2023, the health care business was registered as a corporation in Delaware under the provisional name \"3M Health Care Co.\". On November 16, 2023, 3M unveiled that the new company would be called Solventum, a portmanteau of the words \"solving\" and \"momentum\".\nThe spin-off was completed on April 1, 2024, with 3M retaining about 19.9% of Solventum.   \nOn February 25, 2025, it was announced that Thermo Fisher Scientific would acquire the company's Purification & Filtration business unit for $4.1B.\n\nIndependent operation\nThe first CEO of Solventum is Bryan Hanson, who has served in the role since September 1, 2023.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Solventum Corporation:",
  "clean_text": "Solventum Corporation is an American health care company that was spun off from 3M on April 1, 2024. History Spin-off On July 26, 2022, 3M announced that it would spin off its healthcare division as a separate company to streamline operations. The new company would assume 3M's business in wound and oral care, health informatics, and biopharmaceutical filtration. The sales of products in these fields accounted for about a quarter of 3M's total sales in 2021. CEO Mike Roman said that the split would \"position 3M for the future, to create more opportunity and greater certainty\". Bloomberg News said that the move followed a period of declining profits attributed to shifting economic trends, and would \"dramatically reshape a company known for diverse product lines, from electronic components to dental adhesives to Post-it notes\". In fact, the announcement of the spin-off occurred the same day as a separate announcement that a 3M subsidiary, Aearo Technologies, had declared Chapter 11 bankruptcy after settling lawsuits alleging that the earplugs it had manufactured for U.S. military service members were defective and damaged their hearing. Many observers placed this business decision in a larger trend of other industrial conglomerates that had undergone similar splits in the preceding few years. In November 2021, General Electric announced that it would spin off its health care, aerospace, and energy businesses as GE HealthCare, GE Aerospace, and GE Vernova, respectively; the same week, Johnson & Johnson announced that it would spin off its consumer health division as a separate company, Kenvue. Comparisons were also made to the decisions by Kellogg's and Toshiba to split into multiple entities, as well as United Technologies's spin-off of Otis Worldwide and Carrier Global before its merger with Raytheon. 3M itself sold its food safety business to Neogen in September 2022. On January 24, 2023, the health care business was registered as a corporation in Delaware under the provisional name \"3M Health Care Co.\". On November 16, 2023, 3M unveiled that the new company would be called Solventum, a portmanteau of the words \"solving\" and \"momentum\". The spin-off was completed on April 1, 2024, with 3M retaining about 19.9% of Solventum. On February 25, 2025, it was announced that Thermo Fisher Scientific would acquire the company's Purification & Filtration business unit for $4.1B. Independent operation The first CEO of Solventum is Bryan Hanson, who has served in the role since September 1, 2023."
}