{
  "ticker": "SPG",
  "cik": "0001063761",
  "company_name": "Simon Property Group",
  "corrected_name": "Simon Property Group",
  "wiki_title_used": "Simon Property Group",
  "exists": true,
  "raw_text": "Simon Property Group, Inc. is an American real estate investment trust that invests in shopping malls, outlet centers, and community/lifestyle centers. It is the largest owner of shopping malls in the United States and is headquartered in Indianapolis, Indiana. As of December 31, 2024, it owned  interests in 232 properties.\n\nHistory\n20th century\nSimon Property Group dates to 1960, when brothers Melvin Simon and Herbert Simon began developing strip malls in Indianapolis, Indiana. In December 1993, they took their interests public as Simon Property Group in the largest initial public offering of a real estate investment trust to date. Simon Property merged with the newly public DeBartolo Realty Corporation, owner of the real estate assets of Edward J. DeBartolo Sr., in 1996 to form Simon DeBartolo Group. In the following year, the company acquired The Retail Property Trust for $1.2 billion in a hostile takeover. Also in 1997, in partnership with Macerich, the company acquired 12 malls from IBM's pension plan for $974.5 million. One year after these acquisitions, the company acquired Corporate Property Investors and was renamed Simon Property Group. The company also acquired an ownership interest in Groupe BEG, S.A., operator of shopping centers in Europe.\nIn 1999, the company acquired 14 shopping centers from New England Development for $725 million.\n\n21st century\nIn 2002, in partnership with Westfield Group and the Rouse Company, the company acquired 13 properties from Rodamco North America including Copley Place, Houston Galleria, and SouthPark Mall. In the following year, Simon acquired a majority interest The Kravco Company, owner of the King of Prussia, for $300 million. The company entered the outlet mall business in 2004 with the acquisition of Chelsea Property Group Inc. for $3.5 billion.\nIn April 2007, Simon and Farallon Capital acquired the Mills Corporation. Two years later, Simon tried to buy malls owned by General Growth Properties. In February 2010, Simon placed a bid acquire General Growth, which was in bankruptcy protection. However, the bid was rejected by GGP. A GGP shareholder filed suit (Young v. Bucksbaum) against the company's board of directors for rejecting Simon's bid, alleging breach of fiduciary duty. In April 2010, Simon offered to make a $2.5 billion equity investment in GGP including a $1 billion investment by Paulson & Co. In May 2010, Simon withdrew from the bidding for GGP after GGP favored transactions with Brookfield Asset Management.\nIn May 2010, Simon acquired Prime Retail's Prime Outlets-Puerto Rico in Barceloneta, Puerto Rico In August 2010, Simon acquired an additional 21 outlet malls, including locations in Williamsburg, Virginia, San Marcos, Texas and Hagerstown, Maryland for a total of $2.3 billion. Several months later, Simon made a $4.5 billion bid for Capital Shopping Centres Group plc in December. However, the offer was rejected and withdrawn in January 2011. In September 2011, Simon acquired Southdale Center in Edina, Minnesota.\nIn August 2013, Toronto Premium Outlets opened in Halton Hills, Ontario, Canada. In October 2014, Premium Outlets Montreal, the second in Canada, opened. In May 2018, Premium Outlet Collection YEG opened at Edmonton International Airport. In May 2014, the company completed the corporate spin-off of Washington Prime Group, headed by Mark Ordan, the final CEO of Mills Corporation. In January 2015, Washington Prime Group acquired Glimcher Realty Trust and was renamed WP Glimcher. As part of the deal, Simon acquired Jersey Gardens in Elizabeth, New Jersey and University Park Village in Fort Worth, Texas, while WP Glimcher acquired Brunswick Square in East Brunswick, New Jersey from Simon. Two months later, the company offered $23.3 billion for Macerich; however the offer was rejected and withdrawn in April 2015. In September 2016, in partnership with Authentic Brands Group and GGP Inc., the company acquired Aéropostale. In February 2020, in partnership with Authentic Brands Group, the company acquired Forever 21.\nIn August 2020, in partnership with Authentic Brands, the company acquired Brooks Brothers and Lucky Brand Jeans. In December 2020, the company acquired Taubman Centers for $3.4 billion. It also acquired J.C. Penney in partnership with Brookfield Asset Management. In April 2022, Simon and Brookfield offered to buy Kohl's but were rejected. Simon purchased a 50% stake in Jamestown, a real estate developer, in October 2022.\nIn February 2025, Herb Simon retired as Chairman and Board of Directors. In August 2025, Simon Property Group named Executive Vice President, Eli Simon, as their new Chief Operating Officer (COO).\n\nLitigation\nIn 2007, the company was sued for banning the use of Segways, which the plaintiff claimed was in violation of the Americans with Disabilities Act. In 2009, the company was sued by a nightclub for racial discrimination for allegedly blocking its main entrance since the majority of its clientele were black.\nIn 2011, the company was sued for allegedly firing a woman because she was pregnant. In the same year, the company agreed to pay $125,000 to settle allegations by the Equal Employment Opportunity Commission that Latino janitors working for the company were subjected to daily verbal attacks because of their national origin.\n\nSee also\nList of Simon Property Group properties\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Simon Property Group, Inc.:",
  "clean_text": "Simon Property Group, Inc. is an American real estate investment trust that invests in shopping malls, outlet centers, and community/lifestyle centers. It is the largest owner of shopping malls in the United States and is headquartered in Indianapolis, Indiana. As of December 31, 2024, it owned interests in 232 properties. History 20th century Simon Property Group dates to 1960, when brothers Melvin Simon and Herbert Simon began developing strip malls in Indianapolis, Indiana. In December 1993, they took their interests public as Simon Property Group in the largest initial public offering of a real estate investment trust to date. Simon Property merged with the newly public DeBartolo Realty Corporation, owner of the real estate assets of Edward J. DeBartolo Sr., in 1996 to form Simon DeBartolo Group. In the following year, the company acquired The Retail Property Trust for $1.2 billion in a hostile takeover. Also in 1997, in partnership with Macerich, the company acquired 12 malls from IBM's pension plan for $974.5 million. One year after these acquisitions, the company acquired Corporate Property Investors and was renamed Simon Property Group. The company also acquired an ownership interest in Groupe BEG, S.A., operator of shopping centers in Europe. In 1999, the company acquired 14 shopping centers from New England Development for $725 million. 21st century In 2002, in partnership with Westfield Group and the Rouse Company, the company acquired 13 properties from Rodamco North America including Copley Place, Houston Galleria, and SouthPark Mall. In the following year, Simon acquired a majority interest The Kravco Company, owner of the King of Prussia, for $300 million. The company entered the outlet mall business in 2004 with the acquisition of Chelsea Property Group Inc. for $3.5 billion. In April 2007, Simon and Farallon Capital acquired the Mills Corporation. Two years later, Simon tried to buy malls owned by General Growth Properties. In February 2010, Simon placed a bid acquire General Growth, which was in bankruptcy protection. However, the bid was rejected by GGP. A GGP shareholder filed suit (Young v. Bucksbaum) against the company's board of directors for rejecting Simon's bid, alleging breach of fiduciary duty. In April 2010, Simon offered to make a $2.5 billion equity investment in GGP including a $1 billion investment by Paulson & Co. In May 2010, Simon withdrew from the bidding for GGP after GGP favored transactions with Brookfield Asset Management. In May 2010, Simon acquired Prime Retail's Prime Outlets-Puerto Rico in Barceloneta, Puerto Rico In August 2010, Simon acquired an additional 21 outlet malls, including locations in Williamsburg, Virginia, San Marcos, Texas and Hagerstown, Maryland for a total of $2.3 billion. Several months later, Simon made a $4.5 billion bid for Capital Shopping Centres Group plc in December. However, the offer was rejected and withdrawn in January 2011. In September 2011, Simon acquired Southdale Center in Edina, Minnesota. In August 2013, Toronto Premium Outlets opened in Halton Hills, Ontario, Canada. In October 2014, Premium Outlets Montreal, the second in Canada, opened. In May 2018, Premium Outlet Collection YEG opened at Edmonton International Airport. In May 2014, the company completed the corporate spin-off of Washington Prime Group, headed by Mark Ordan, the final CEO of Mills Corporation. In January 2015, Washington Prime Group acquired Glimcher Realty Trust and was renamed WP Glimcher. As part of the deal, Simon acquired Jersey Gardens in Elizabeth, New Jersey and University Park Village in Fort Worth, Texas, while WP Glimcher acquired Brunswick Square in East Brunswick, New Jersey from Simon. Two months later, the company offered $23.3 billion for Macerich; however the offer was rejected and withdrawn in April 2015. In September 2016, in partnership with Authentic Brands Group and GGP Inc., the company acquired Aéropostale. In February 2020, in partnership with Authentic Brands Group, the company acquired Forever 21. In August 2020, in partnership with Authentic Brands, the company acquired Brooks Brothers and Lucky Brand Jeans. In December 2020, the company acquired Taubman Centers for $3.4 billion. It also acquired J.C. Penney in partnership with Brookfield Asset Management. In April 2022, Simon and Brookfield offered to buy Kohl's but were rejected. Simon purchased a 50% stake in Jamestown, a real estate developer, in October 2022. In February 2025, Herb Simon retired as Chairman and Board of Directors. In August 2025, Simon Property Group named Executive Vice President, Eli Simon, as their new Chief Operating Officer (COO). Litigation In 2007, the company was sued for banning the use of Segways, which the plaintiff claimed was in violation of the Americans with Disabilities Act. In 2009, the company was sued by a nightclub for racial discrimination for allegedly blocking its main entrance since the majority of its clientele were black. In 2011, the company was sued for allegedly firing a woman because she was pregnant. In the same year, the company agreed to pay $125,000 to settle allegations by the Equal Employment Opportunity Commission that Latino janitors working for the company were subjected to daily verbal attacks because of their national origin."
}