{
  "ticker": "SPGI",
  "cik": "0000064040",
  "company_name": "S&P Global",
  "corrected_name": "S&P Global",
  "wiki_title_used": "S&P Global",
  "exists": true,
  "raw_text": "S&P Global Inc. (prior to 2016, McGraw Hill Financial, Inc., and prior to 2013, The McGraw–Hill Companies, Inc.) is an American publicly traded corporation headquartered in Manhattan, New York City. Its primary areas of business are financial information, analytics, and energy and commodities intelligence. It is the parent company of S&P Global Ratings, S&P Global Energy, S&P Global Market Intelligence, and S&P Global Mobility, as well as the Indian credit rating agency CRISIL. It is also the majority owner of the S&P Dow Jones Indices joint venture. \"S&P\" is a shortening of \"Standard and Poor's\".\n\nCorporate history\nThe predecessor companies of S&P Global have histories dating to 1888, when James H. McGraw purchased the American Journal of Railway Appliances. He continued to add further publications, eventually establishing The McGraw Publishing Company in 1899. John A. Hill had also produced several technical and trade publications and in 1902 formed his own business, The Hill Publishing Company. In 1909, both men, having known each other's interests, agreed upon an alliance and combined the book departments of their publishing companies into The McGraw–Hill Book Company. John Hill served as president, with James McGraw as vice-president. In 1917, the remaining parts of each business were merged into The McGraw–Hill Publishing Company.\nIn 2009, McGraw Hill Cos. sold Business Week to Bloomberg L.P. In 1964, after Hill died, both McGraw–Hill Publishing Company and McGraw–Hill Book Company merged into McGraw–Hill, Inc. McGraw–Hill purchased credit rating agency Standard & Poor's from Paul Talbot Babson in 1966. In 1979, McGraw–Hill acquired Byte magazine from its owner/publisher Virginia Williamson, who then became a vice-president of McGraw–Hill. In 1986, McGraw–Hill bought out competitor The Economy Company, then the United States' largest publisher of educational material. The buyout made McGraw–Hill the largest educational publisher in the United States. In 1994, McGraw–Hill's broadcasting division signed a deal with ABC, due partly to the fact that its stations in San Diego (KGTV) and Indianapolis (WRTV) had already been aligned with the network, and that Denver (KMGH-TV) and Bakersfield (KERO-TV) joined the ABC family. (Bakersfield sister station KERO-TV was also involved in the deal between McGraw–Hill and ABC; however, that station had to wait for its affiliation contract with CBS to expire in March 1996, before it could finally switch to ABC).\nOn October 3, 2011, McGraw–Hill announced it was selling its entire television station group to the E. W. Scripps Company for $212 million. The sale was completed on December 30, 2011. It had been involved in broadcasting since 1972, when it purchased four television stations from a division of Time Inc. The sale included McGraw–Hill Broadcasting's stations KERO-TV and KZKC-LP Bakersfield; KGTV and KZSD-LP San Diego; KZCS-LP Colorado Springs; flagship station KMGH-TV and KZCO-LD Denver; KZFC-LP Fort Collins; and WRTV Indianapolis. On November 26, 2012, McGraw–Hill announced it was selling its entire education division, known as McGraw–Hill Education to Apollo Global Management for $2.5 billion. On March 22, 2013, McGraw–Hill announced it had completed the sale for $2.4 billion cash. On May 1, 2013, shareholders of McGraw–Hill voted to change the company's name to McGraw Hill Financial. McGraw–Hill divested the subsidiary McGraw–Hill Construction to Symphony Technology Group for US$320 million on September 22, 2014. The sale included Engineering News-Record, Architectural Record, Dodge and Sweet's. McGraw–Hill Construction has been renamed Dodge Data & Analytics.\nIn February 2016, McGraw–Hill announced that McGraw–Hill Financial would change its name to S&P Global Inc. by the end of April 2016. McGraw Hill Financial officially changed its name following a shareholder vote on April 27, 2016. In April 2016, McGraw–Hill announced that it was selling J.D. Power and Associates to investment firm XIO Group for $1.1 billion. On August 3, 2020, S&P Global Platts launched S&P Global Platts Analytics fundamental oil information on the redesigned S&P Global Platts Developer Platform. The Platts Developer Platform offers customers with quick exposure to product price databases, business statistics and insights at the pace of market changes. In November 2020, S&P Global agreed to acquire IHS Markit analytics company in a $44 billion transaction. In 2023, S&P sold the former IHS engineering operations to KKR & Co, which rebranded IHS as Accuris.\nIn October 2025, S&P Global announced a deal to buy markets data and analytics firm With Intelligence for $1.8 billion, which is expected to bolster S&P's presence in private markets. The transaction is expected to close in 2025 or early 2026.\n\nCorporate organization\nS&P Global organizes its businesses in six units, based on the market in which they are involved:\n\nS&P Global Ratings\nS&P Global Ratings provides independent investment research including ratings on various investment instruments.\n\nS&P Global Market Intelligence\nS&P Global Market Intelligence is a provider of multi-asset class and real-time data, research, news and analytics to institutional investors, investment and commercial banks, insurance companies, investment advisors and wealth managers, corporations, and universities. Subsidiaries and brands include Capital IQ, EViews, Journal of Commerce, Panjiva, and Global Insight.\n\nS&P Dow Jones Indices\nLaunched in July 2012, S&P Dow Jones Indices is the world's largest global resource for index-based concepts, data, and research. It produces the S&P 500 and the Dow Jones Industrial Average.\nS&P Dow Jones Indices calculates over 830,000 indices, publishes benchmarks that provide the basis for 575 ETFs globally with $387 billion in assets invested, and serves as the DNA for $1.5 trillion of the world's indexed assets.\n\nS&P Global Energy\nHeadquartered in London, S&P Global Energy, formerly Platts, is a provider of information and a source of benchmark price assessments for the commodities, energy, petrochemicals, metals, and agriculture markets. It has offices in more than 15 cities, including major energy centres such as London, Tokyo, Dubai, Singapore, and Houston, and international business centres such as São Paulo, Shanghai, and New York City.\n\nS&P Global Mobility\nS&P Global Mobility is the parent company of Carfax, Market Scan, Polk Automotive Solutions, and other brands. In April 2025, S&P announced plans to spin off its global mobility unit into a standalone public company.\n\nPresidents of the company\nJames H. McGraw (1917–1928)\nJohnathan Heflin (1928–1948)\nJames McGraw Jr. (1948–1950)\nCurtis W. McGraw (1950–1953)\nDonald C. McGraw (1953–1968)\nShelton Fisher (1968–1974)\nHarold McGraw Jr. (1974–1983)\nJoseph Dionne (1983–1998)\nHarold W. McGraw III (1998–2013)\nDouglas L. Peterson (2013–2024)\nMartina Cheung (2024–present)\n\nAcquisitions\nDuring the course of its history, McGraw Hill and from 2016 S&P Global has expanded significantly through acquisition, not just within the publishing industry but also into other areas such as financial services (the purchase of Standard & Poor's in 1966) and broadcasting (the 1972 acquisition of Time-Life Broadcasting). The publishing and education assets are a part of McGraw–Hill Education from the company separation in 2013:\n\nThis list only includes acquisitions made by McGraw–Hill, not its subsidiaries. McGraw–Hill typically does not release financial information regarding its acquisitions or divestitures.\n\nDivestitures\nAfter acquiring a portfolio of diverse companies, McGraw Hill later divested itself of many units to form McGraw Hill Financial which is now S&P Global:\n\nThis list only includes divestitures made by McGraw–Hill, not its subsidiaries.\n\nMcGraw–Hill Building\nThe company was based at 1221 Avenue of the Americas until July 2015.\nThe predecessor company McGraw Hill Inc. had been based at 330 West 42nd Street and both have been known as The McGraw–Hill Building, a name originally used for a prior headquarters at 469 Tenth Avenue.\n\nConnection to the family of George W. Bush\nThe McGraws and the George W. Bush family have close ties dating back several generations. Harold McGraw Jr. (deceased) was a member of the national grant advisory and founding board of the Barbara Bush Foundation for Family Literacy.\n\nMcGraw–Hill Federal Credit Union\nEstablished in 1935, the McGraw–Hill Federal Credit Union originally served employees of the McGraw–Hill companies in New York City only. The credit union moved from its location inside the McGraw–Hill building to East Windsor, New Jersey, in 2005. Its accounts are insured by the National Credit Union Administration. It provides savings, checking accounts, CDs, money-market accounts, IRAs, credit cards, auto loans, and home mortgages. In February 2019, the credit union announced plans to merge with Pentagon Federal Credit Union, completing to convert customers to those of PenFed on May 1, 2019. The East Windsor branch currently operates as a PenFed branch as of September 2019.\n\nAwards\nIn 1999, the National Building Museum presented the McGraw–Hill Companies with its annual Honor Award for the corporation's contributions to the built environment.\nIn 2023, S&P Global was recognized in Newsweek's ranking of America's Greenest Companies 2024 for its commitment to sustainability.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for S&P Global:",
  "clean_text": "S&P Global Inc. (prior to 2016, McGraw Hill Financial, Inc., and prior to 2013, The McGraw–Hill Companies, Inc.) is an American publicly traded corporation headquartered in Manhattan, New York City. Its primary areas of business are financial information, analytics, and energy and commodities intelligence. It is the parent company of S&P Global Ratings, S&P Global Energy, S&P Global Market Intelligence, and S&P Global Mobility, as well as the Indian credit rating agency CRISIL. It is also the majority owner of the S&P Dow Jones Indices joint venture. \"S&P\" is a shortening of \"Standard and Poor's\". Corporate history The predecessor companies of S&P Global have histories dating to 1888, when James H. McGraw purchased the American Journal of Railway Appliances. He continued to add further publications, eventually establishing The McGraw Publishing Company in 1899. John A. Hill had also produced several technical and trade publications and in 1902 formed his own business, The Hill Publishing Company. In 1909, both men, having known each other's interests, agreed upon an alliance and combined the book departments of their publishing companies into The McGraw–Hill Book Company. John Hill served as president, with James McGraw as vice-president. In 1917, the remaining parts of each business were merged into The McGraw–Hill Publishing Company. In 2009, McGraw Hill Cos. sold Business Week to Bloomberg L.P. In 1964, after Hill died, both McGraw–Hill Publishing Company and McGraw–Hill Book Company merged into McGraw–Hill, Inc. McGraw–Hill purchased credit rating agency Standard & Poor's from Paul Talbot Babson in 1966. In 1979, McGraw–Hill acquired Byte magazine from its owner/publisher Virginia Williamson, who then became a vice-president of McGraw–Hill. In 1986, McGraw–Hill bought out competitor The Economy Company, then the United States' largest publisher of educational material. The buyout made McGraw–Hill the largest educational publisher in the United States. In 1994, McGraw–Hill's broadcasting division signed a deal with ABC, due partly to the fact that its stations in San Diego (KGTV) and Indianapolis (WRTV) had already been aligned with the network, and that Denver (KMGH-TV) and Bakersfield (KERO-TV) joined the ABC family. (Bakersfield sister station KERO-TV was also involved in the deal between McGraw–Hill and ABC; however, that station had to wait for its affiliation contract with CBS to expire in March 1996, before it could finally switch to ABC). On October 3, 2011, McGraw–Hill announced it was selling its entire television station group to the E. W. Scripps Company for $212 million. The sale was completed on December 30, 2011. It had been involved in broadcasting since 1972, when it purchased four television stations from a division of Time Inc. The sale included McGraw–Hill Broadcasting's stations KERO-TV and KZKC-LP Bakersfield; KGTV and KZSD-LP San Diego; KZCS-LP Colorado Springs; flagship station KMGH-TV and KZCO-LD Denver; KZFC-LP Fort Collins; and WRTV Indianapolis. On November 26, 2012, McGraw–Hill announced it was selling its entire education division, known as McGraw–Hill Education to Apollo Global Management for $2.5 billion. On March 22, 2013, McGraw–Hill announced it had completed the sale for $2.4 billion cash. On May 1, 2013, shareholders of McGraw–Hill voted to change the company's name to McGraw Hill Financial. McGraw–Hill divested the subsidiary McGraw–Hill Construction to Symphony Technology Group for US$320 million on September 22, 2014. The sale included Engineering News-Record, Architectural Record, Dodge and Sweet's. McGraw–Hill Construction has been renamed Dodge Data & Analytics. In February 2016, McGraw–Hill announced that McGraw–Hill Financial would change its name to S&P Global Inc. by the end of April 2016. McGraw Hill Financial officially changed its name following a shareholder vote on April 27, 2016. In April 2016, McGraw–Hill announced that it was selling J.D. Power and Associates to investment firm XIO Group for $1.1 billion. On August 3, 2020, S&P Global Platts launched S&P Global Platts Analytics fundamental oil information on the redesigned S&P Global Platts Developer Platform. The Platts Developer Platform offers customers with quick exposure to product price databases, business statistics and insights at the pace of market changes. In November 2020, S&P Global agreed to acquire IHS Markit analytics company in a $44 billion transaction. In 2023, S&P sold the former IHS engineering operations to KKR & Co, which rebranded IHS as Accuris. In October 2025, S&P Global announced a deal to buy markets data and analytics firm With Intelligence for $1.8 billion, which is expected to bolster S&P's presence in private markets. The transaction is expected to close in 2025 or early 2026. Corporate organization S&P Global organizes its businesses in six units, based on the market in which they are involved: S&P Global Ratings S&P Global Ratings provides independent investment research including ratings on various investment instruments. S&P Global Market Intelligence S&P Global Market Intelligence is a provider of multi-asset class and real-time data, research, news and analytics to institutional investors, investment and commercial banks, insurance companies, investment advisors and wealth managers, corporations, and universities. Subsidiaries and brands include Capital IQ, EViews, Journal of Commerce, Panjiva, and Global Insight. S&P Dow Jones Indices Launched in July 2012, S&P Dow Jones Indices is the world's largest global resource for index-based concepts, data, and research. It produces the S&P 500 and the Dow Jones Industrial Average. S&P Dow Jones Indices calculates over 830,000 indices, publishes benchmarks that provide the basis for 575 ETFs globally with $387 billion in assets invested, and serves as the DNA for $1.5 trillion of the world's indexed assets. S&P Global Energy Headquartered in London, S&P Global Energy, formerly Platts, is a provider of information and a source of benchmark price assessments for the commodities, energy, petrochemicals, metals, and agriculture markets. It has offices in more than 15 cities, including major energy centres such as London, Tokyo, Dubai, Singapore, and Houston, and international business centres such as São Paulo, Shanghai, and New York City. S&P Global Mobility S&P Global Mobility is the parent company of Carfax, Market Scan, Polk Automotive Solutions, and other brands. In April 2025, S&P announced plans to spin off its global mobility unit into a standalone public company. Presidents of the company James H. McGraw (1917–1928) Johnathan Heflin (1928–1948) James McGraw Jr. (1948–1950) Curtis W. McGraw (1950–1953) Donald C. McGraw (1953–1968) Shelton Fisher (1968–1974) Harold McGraw Jr. (1974–1983) Joseph Dionne (1983–1998) Harold W. McGraw III (1998–2013) Douglas L. Peterson (2013–2024) Martina Cheung (2024–present) Acquisitions During the course of its history, McGraw Hill and from 2016 S&P Global has expanded significantly through acquisition, not just within the publishing industry but also into other areas such as financial services (the purchase of Standard & Poor's in 1966) and broadcasting (the 1972 acquisition of Time-Life Broadcasting). The publishing and education assets are a part of McGraw–Hill Education from the company separation in 2013: This list only includes acquisitions made by McGraw–Hill, not its subsidiaries. McGraw–Hill typically does not release financial information regarding its acquisitions or divestitures. Divestitures After acquiring a portfolio of diverse companies, McGraw Hill later divested itself of many units to form McGraw Hill Financial which is now S&P Global: This list only includes divestitures made by McGraw–Hill, not its subsidiaries. McGraw–Hill Building The company was based at 1221 Avenue of the Americas until July 2015. The predecessor company McGraw Hill Inc. had been based at 330 West 42nd Street and both have been known as The McGraw–Hill Building, a name originally used for a prior headquarters at 469 Tenth Avenue. Connection to the family of George W. Bush The McGraws and the George W. Bush family have close ties dating back several generations. Harold McGraw Jr. (deceased) was a member of the national grant advisory and founding board of the Barbara Bush Foundation for Family Literacy. McGraw–Hill Federal Credit Union Established in 1935, the McGraw–Hill Federal Credit Union originally served employees of the McGraw–Hill companies in New York City only. The credit union moved from its location inside the McGraw–Hill building to East Windsor, New Jersey, in 2005. Its accounts are insured by the National Credit Union Administration. It provides savings, checking accounts, CDs, money-market accounts, IRAs, credit cards, auto loans, and home mortgages. In February 2019, the credit union announced plans to merge with Pentagon Federal Credit Union, completing to convert customers to those of PenFed on May 1, 2019. The East Windsor branch currently operates as a PenFed branch as of September 2019. Awards In 1999, the National Building Museum presented the McGraw–Hill Companies with its annual Honor Award for the corporation's contributions to the built environment. In 2023, S&P Global was recognized in Newsweek's ranking of America's Greenest Companies 2024 for its commitment to sustainability."
}