{
  "ticker": "SRE",
  "cik": "0001032208",
  "company_name": "Sempra",
  "corrected_name": "Sempra",
  "wiki_title_used": "Sempra",
  "exists": true,
  "raw_text": "Sempra is a North American public utility holding company based in San Diego, California. The company is one of the largest utility holding companies in the United States with nearly 40 million consumers. Sempra's focus is on electric and natural gas infrastructure and its operating companies include: Southern California Gas Company (SoCalGas) and San Diego Gas & Electric (SDGE) in Southern California; Oncor Electric Delivery Company in Texas; and Sempra Infrastructure, with offices in California and Texas.\nAs of 2024, Sempra reported more than $96.2 billion in total assets and over 20,000 employees. The company is led by chairman and chief executive officer Jeffrey Martin, who assumed that role in May 2018.\nSempra ranks as one of the largest energy companies in the world and is ranked #246 on the Fortune 500 list as of 2024 and #366 on the Forbes Global 2000 list as of 2024. In 2024, Sempra was named one of the World's Most Admired Companies by Fortune Magazine, marking the 14th year the company is on this prestigious list. Sempra was also recognized by Newsweek as one of America's Most Responsible Companies, earning this distinction for the sixth consecutive year.\n\nHistory\n1998–2018\nSempra Energy, now known as Sempra, was created through the 1998 merger of Los Angeles–based Pacific Enterprises, the parent company of SoCalGas, and Enova Corporation, the parent company of San Diego Gas & Electric.\nIn 1999, the company acquired two utilities in South America; Chilquinta Energia in Chile and Luz Del Sur in Peru, which gave Sempra Energy an entry into the expanding Latin American energy market.\nIn 2003, Sempra Energy Resources, the former power generation subsidiary of Sempra Energy, completed three state-of-the-art power plant projects in Arizona, California and New Mexico.\nSempra was sued over claims it manipulated natural gas supplies and electricity contracts during the 2001 California electricity crisis. In 2006, the company agreed to pay $377 million to settle gas supply claims, and in 2010, it paid another $410 million to settle claims on electricity price gouging, but has never admitted wrongdoing.\nIn 2007, the company created the Sempra Energy Foundation (now known as Sempra Foundation) as a 501(c)(3) private foundation. Since its inception, the foundation has invested over $50 million to help advance a better future for all. Sempra Foundation’s current priorities include climate action, economic prosperity, diversity and inclusion and disaster relief. Additionally, the organization encourages community engagement among the 20,000 employees who work for Sempra and its operating companies by matching certain employee contributions of time and money to eligible 501(c)(3) charitable organizations.\nOn March 8, 2018, regulators in Texas approved Sempra Energy's purchase of a majority stake in Oncor for $9.45 billion.\n\n2019–present\nOn January 16, 2019, Sempra Energy was added to the Dow Jones Utility Average, replacing Pacific Gas and Electric.\nOver 2018 and 2019, Sempra completed its divestiture of its U.S. renewables and non-utility natural gas storage assets, generating approximately $2.5 billion in cash proceeds. The company stated its intent to refocus its investments in North American transmission and distribution infrastructure.\nIn March 2019, Sempra Energy and Oncor Electric Delivery Company announced the acquisition of InfraREIT, and Sempra Energy's acquisition of a 50% interest in Sharyland Utilities. These utility deals were lauded by the company as disciplined, low-risk investments in the fast-growing Texas market.\nIn April 2020, Sempra Energy announced it had completed the sale of its utility business in Peru, Luz del Sur, for $3.59 billion. In June 2020, Sempra Energy announced it completed the sale of its Chilean businesses to China's State Grid International Development Ltd for $2.23 billion in cash. These two sales completed Sempra Energy's exit from South America.\nIn June 2021, Sempra Energy announced it was rebranding to Sempra. It launched an updated logo and dropped \"Energy\" from its name to emphasize its core focus on infrastructure that delivers energy.\nIn 2022, shortly after the Russian invasion of Ukraine, Sempra Infrastructure, a subsidiary of Sempra, announced a series of agreements with European energy companies for U.S. liquefied natural gas (LNG) to help displace reliance on Russian gas. \nIn 2024, Sempra announced a record five-year capital plan of $48 billion for 2023–2028, to improve safety, bolster reliability and support the delivery of cleaner sources of energy across its three growth platforms: Sempra Company in some parts of California and Texas with Sempra Infrastructure facilities and system operation.\n\nOperating companies\nCurrent\nSempra Infrastructure: Sempra Infrastructure was formed in 2021 through a merger of two Sempra operating companies: Sempra LNG and IEnova. The company develops, builds and invests in North American energy infrastructure, including liquefied natural gas and net-zero solutions, energy networks and clean power. The company developed Cameron LNG, a joint-venture LNG facility in Louisiana. The company has also developed the Port Arthur LNG liquefaction project in Texas and has three proposed liquefaction-export facilities on the Pacific Coast of Mexico, Energía Costa Azul LNG, Vista Pacífico LNG and Salina Cruz.\nSouthern California Gas Company: SoCalGas, based in Los Angeles, is the largest natural gas distribution utility in the U.S., providing natural gas service to approximately 22 million consumers, and is an emerging leader in hydrogen and net-zero solutions. In 2022, the company proposed what would be the largest green hydrogen infrastructure system in the U.S., Angeles Link.\nSan Diego Gas & Electric: SDGE is an electric and natural gas utility that provides energy to approximately 3.7 million consumers in San Diego and southern Orange Counties.\nOncor Electric Delivery Company LLC: Oncor, based in Dallas, operates the largest electric distribution and transmission system in the state, providing service to approximately 13 million Texans. Sempra indirectly owns approximately 80 percent of Oncor. In May 2019, Oncor completed the acquisition of InfraREIT, an electricity transmission company in Central, North and West Texas.\n\nFormer\nThe following subsidiaries have been reformed into Sempra LNG & Midstream and Sempra Renewables:\n\nSempra U.S. Gas & Power: With its affiliates and joint-venture partners, the company owns and operates more than 2,000 megawatts of renewable generating capacity. Sempra U.S. Gas & Power also operates natural gas storage facilities, pipelines and distribution utilities.\nSempra Generation: Operates or owns interest in power stations in five U.S. states and in Mexico, as well as property for potential solar and wind electric generation.\nSempra Pipelines & Storage: Owns natural gas storage facilities in Alabama and Louisiana and interests in two natural gas companies in Argentina, Chilquinta Energía of Chile, and Luz del Sur of Peru. It also owns 1,858 miles of distribution pipelines, 216 miles of transmission pipelines, and two compressor stations in Mexico.\nSempra LNG: Develops, owns and operates receipt terminals for importing liquefied natural gas to the U.S., including the Energía Costa Azul LNG terminal in Baja California and the Cameron LNG terminal in Hackberry, Louisiana.\nSempra Commodities: Sempra's stake in a partnership formed on April 1, 2008 to market and trade natural gas, natural gas liquids, power, petroleum and petroleum products, coal, emissions, ethanol and base metals. Royal Bank of Scotland Group sold its stake in RBS Sempra Commodities LLC to Noble Americas Gas and Power, as a condition of the UK Government's 74 percent stake in the Group on December 1, 2010.\nIEnova: IEnova developed, built and operated energy infrastructure in Mexico, and was one of the largest private energy companies in the country.\nPXiSE Energy Solutions: PXiSE Energy Solutions LLC., headquartered in San Diego, was a subsidiary of Sempra and partially owned by Mitsui & Co., Ltd. It develops, operates and markets next-generation power-grid management technology for renewable energy developers and operators, grid operators, commercial property owners and microgrids. Sempra sold PXiSE Energy Solutions in 2021.\n\nAwards and recognition\nIn 2024, Sempra was named one of Fortune Magazine's World's Most Admired Companies and was also recognized by Newsweek as one of America's Most Responsible Companies. Sempra was also included in The Wall Street Journal's 250 Best-Managed Companies list. The company has received numerous recognitions for leadership in diversity and inclusion, including being named to Bloomberg's Gender Equality Index, Forbes Best Employers for Diversity and Fair360's (formerly DiversityInc) #1 for Top Utilities. The company has also been named to a number of stock market indexes focused on sustainability, including the Dow Jones Sustainability Index North America. Its subsidiaries are routinely recognized for leadership in reliability, resilience, technology and innovation and corporate responsibility.\n\nSee also\nList of United States electric companies\nList of United States natural gas companies\nEl Dorado Solar Power Plant\nLuz del Sur\nNorth Baja Pipeline\nRockies Express Pipeline\n\nReferences\nExternal links\nOfficial website\nBusiness data for Sempra:",
  "clean_text": "Sempra is a North American public utility holding company based in San Diego, California. The company is one of the largest utility holding companies in the United States with nearly 40 million consumers. Sempra's focus is on electric and natural gas infrastructure and its operating companies include: Southern California Gas Company (SoCalGas) and San Diego Gas & Electric (SDGE) in Southern California; Oncor Electric Delivery Company in Texas; and Sempra Infrastructure, with offices in California and Texas. As of 2024, Sempra reported more than $96.2 billion in total assets and over 20,000 employees. The company is led by chairman and chief executive officer Jeffrey Martin, who assumed that role in May 2018. Sempra ranks as one of the largest energy companies in the world and is ranked #246 on the Fortune 500 list as of 2024 and #366 on the Forbes Global 2000 list as of 2024. In 2024, Sempra was named one of the World's Most Admired Companies by Fortune Magazine, marking the 14th year the company is on this prestigious list. Sempra was also recognized by Newsweek as one of America's Most Responsible Companies, earning this distinction for the sixth consecutive year. History 1998–2018 Sempra Energy, now known as Sempra, was created through the 1998 merger of Los Angeles–based Pacific Enterprises, the parent company of SoCalGas, and Enova Corporation, the parent company of San Diego Gas & Electric. In 1999, the company acquired two utilities in South America; Chilquinta Energia in Chile and Luz Del Sur in Peru, which gave Sempra Energy an entry into the expanding Latin American energy market. In 2003, Sempra Energy Resources, the former power generation subsidiary of Sempra Energy, completed three state-of-the-art power plant projects in Arizona, California and New Mexico. Sempra was sued over claims it manipulated natural gas supplies and electricity contracts during the 2001 California electricity crisis. In 2006, the company agreed to pay $377 million to settle gas supply claims, and in 2010, it paid another $410 million to settle claims on electricity price gouging, but has never admitted wrongdoing. In 2007, the company created the Sempra Energy Foundation (now known as Sempra Foundation) as a 501(c)(3) private foundation. Since its inception, the foundation has invested over $50 million to help advance a better future for all. Sempra Foundation’s current priorities include climate action, economic prosperity, diversity and inclusion and disaster relief. Additionally, the organization encourages community engagement among the 20,000 employees who work for Sempra and its operating companies by matching certain employee contributions of time and money to eligible 501(c)(3) charitable organizations. On March 8, 2018, regulators in Texas approved Sempra Energy's purchase of a majority stake in Oncor for $9.45 billion. 2019–present On January 16, 2019, Sempra Energy was added to the Dow Jones Utility Average, replacing Pacific Gas and Electric. Over 2018 and 2019, Sempra completed its divestiture of its U.S. renewables and non-utility natural gas storage assets, generating approximately $2.5 billion in cash proceeds. The company stated its intent to refocus its investments in North American transmission and distribution infrastructure. In March 2019, Sempra Energy and Oncor Electric Delivery Company announced the acquisition of InfraREIT, and Sempra Energy's acquisition of a 50% interest in Sharyland Utilities. These utility deals were lauded by the company as disciplined, low-risk investments in the fast-growing Texas market. In April 2020, Sempra Energy announced it had completed the sale of its utility business in Peru, Luz del Sur, for $3.59 billion. In June 2020, Sempra Energy announced it completed the sale of its Chilean businesses to China's State Grid International Development Ltd for $2.23 billion in cash. These two sales completed Sempra Energy's exit from South America. In June 2021, Sempra Energy announced it was rebranding to Sempra. It launched an updated logo and dropped \"Energy\" from its name to emphasize its core focus on infrastructure that delivers energy. In 2022, shortly after the Russian invasion of Ukraine, Sempra Infrastructure, a subsidiary of Sempra, announced a series of agreements with European energy companies for U.S. liquefied natural gas (LNG) to help displace reliance on Russian gas. In 2024, Sempra announced a record five-year capital plan of $48 billion for 2023–2028, to improve safety, bolster reliability and support the delivery of cleaner sources of energy across its three growth platforms: Sempra Company in some parts of California and Texas with Sempra Infrastructure facilities and system operation. Operating companies Current Sempra Infrastructure: Sempra Infrastructure was formed in 2021 through a merger of two Sempra operating companies: Sempra LNG and IEnova. The company develops, builds and invests in North American energy infrastructure, including liquefied natural gas and net-zero solutions, energy networks and clean power. The company developed Cameron LNG, a joint-venture LNG facility in Louisiana. The company has also developed the Port Arthur LNG liquefaction project in Texas and has three proposed liquefaction-export facilities on the Pacific Coast of Mexico, Energía Costa Azul LNG, Vista Pacífico LNG and Salina Cruz. Southern California Gas Company: SoCalGas, based in Los Angeles, is the largest natural gas distribution utility in the U.S., providing natural gas service to approximately 22 million consumers, and is an emerging leader in hydrogen and net-zero solutions. In 2022, the company proposed what would be the largest green hydrogen infrastructure system in the U.S., Angeles Link. San Diego Gas & Electric: SDGE is an electric and natural gas utility that provides energy to approximately 3.7 million consumers in San Diego and southern Orange Counties. Oncor Electric Delivery Company LLC: Oncor, based in Dallas, operates the largest electric distribution and transmission system in the state, providing service to approximately 13 million Texans. Sempra indirectly owns approximately 80 percent of Oncor. In May 2019, Oncor completed the acquisition of InfraREIT, an electricity transmission company in Central, North and West Texas. Former The following subsidiaries have been reformed into Sempra LNG & Midstream and Sempra Renewables: Sempra U.S. Gas & Power: With its affiliates and joint-venture partners, the company owns and operates more than 2,000 megawatts of renewable generating capacity. Sempra U.S. Gas & Power also operates natural gas storage facilities, pipelines and distribution utilities. Sempra Generation: Operates or owns interest in power stations in five U.S. states and in Mexico, as well as property for potential solar and wind electric generation. Sempra Pipelines & Storage: Owns natural gas storage facilities in Alabama and Louisiana and interests in two natural gas companies in Argentina, Chilquinta Energía of Chile, and Luz del Sur of Peru. It also owns 1,858 miles of distribution pipelines, 216 miles of transmission pipelines, and two compressor stations in Mexico. Sempra LNG: Develops, owns and operates receipt terminals for importing liquefied natural gas to the U.S., including the Energía Costa Azul LNG terminal in Baja California and the Cameron LNG terminal in Hackberry, Louisiana. Sempra Commodities: Sempra's stake in a partnership formed on April 1, 2008 to market and trade natural gas, natural gas liquids, power, petroleum and petroleum products, coal, emissions, ethanol and base metals. Royal Bank of Scotland Group sold its stake in RBS Sempra Commodities LLC to Noble Americas Gas and Power, as a condition of the UK Government's 74 percent stake in the Group on December 1, 2010. IEnova: IEnova developed, built and operated energy infrastructure in Mexico, and was one of the largest private energy companies in the country. PXiSE Energy Solutions: PXiSE Energy Solutions LLC., headquartered in San Diego, was a subsidiary of Sempra and partially owned by Mitsui & Co., Ltd. It develops, operates and markets next-generation power-grid management technology for renewable energy developers and operators, grid operators, commercial property owners and microgrids. Sempra sold PXiSE Energy Solutions in 2021. Awards and recognition In 2024, Sempra was named one of Fortune Magazine's World's Most Admired Companies and was also recognized by Newsweek as one of America's Most Responsible Companies. Sempra was also included in The Wall Street Journal's 250 Best-Managed Companies list. The company has received numerous recognitions for leadership in diversity and inclusion, including being named to Bloomberg's Gender Equality Index, Forbes Best Employers for Diversity and Fair360's (formerly DiversityInc) #1 for Top Utilities. The company has also been named to a number of stock market indexes focused on sustainability, including the Dow Jones Sustainability Index North America. Its subsidiaries are routinely recognized for leadership in reliability, resilience, technology and innovation and corporate responsibility."
}