{
  "ticker": "STE",
  "cik": "0001757898",
  "company_name": "Steris",
  "corrected_name": "Steris",
  "wiki_title_used": "Steris",
  "exists": true,
  "raw_text": "Steris plc is an American-Irish-based medical equipment company specializing in sterilization and surgical products for the US healthcare system. Steris is operationally headquartered in Mentor, Ohio, but has been legally registered since 2018 in Dublin, Ireland for tax purposes; it was previously registered in the United Kingdom from 2014 to 2018. Steris is quoted on the NYSE, and is a constituent of the S&P 500 Index.\nAs of 2024, the President and CEO is Daniel A. Carestio.\nSteris' competitors include 3M, Getinge Group, and Belimed (Metall Zug).\n\nHistory\nSteris was founded in August 1985 in Ohio, under the name \"Innovative Medical Technologies\".\nIn 2012, Steris acquired US Endoscopy for $270 million. Steris also acquired Spectrum Surgical Instruments Corp. and Total Repair Express for $110 million combined.\nOn April 1, 2014, Steris announced its acquisition of Integrated Medical Systems International Inc. for ~$175 million, although it would only cost the company ~$140 million after tax benefits. Shortly after, Steris also acquired Chesterfield, Missouri-based Life Systems.\nIn October 2014, Steris executed a tax inversion from the United States to the United Kingdom, via an offer made to acquire UK-based Synergy Health for $1.9 billion.  The tax inversion was notable as it was the first US inversion post the new rules introduced by the Obama administration in 2014 to curb US corporations moving their \"legal domicile\" to reduce their exposure to US corporate taxation.\nOn June 24, 2015, Steris announced the acquisitions of General Econopak for $175 million and Black Diamond Video for $51 million.\nSteris filed accounts which showed global revenues of over US$2.6 billion in 2018, of which US$1.8 billion (or 70 percent) came from the US healthcare system; and employed ~12,000 people. \nIn November 2018, Steris announced that it would further re-domicile its legal headquarters from the United Kingdom to Ireland; Steris had reduced its corporate tax rate from 31.3 percent to 20 percent as a result of its 2014 tax inversion to the United Kingdom, however, it believed a further reduction could be achieved by moving to Ireland.\nIn April 2020, Steris received emergency use authorization from the FDA for a N95 mask sterilization system to help address the shortage of personal protective equipment during the 2019-20 coronavirus pandemic.\nIn November 2020, Steris acquired Key Surgical, a leading global provider of sterile processing, operating room, and endoscopy products.\nIn June 2021, Steris acquired Cantel Medical Corporation a provider of infection prevention products and services to endoscopy, dental and dialysis.\n\nSee also\nCorporate tax inversions to Ireland\nIreland as a tax haven\nMedtronic, another example of US medical device tax inversion to Ireland\n\nReferences\nExternal links\nOfficial website\nBusiness data for STERIS plc:",
  "clean_text": "Steris plc is an American-Irish-based medical equipment company specializing in sterilization and surgical products for the US healthcare system. Steris is operationally headquartered in Mentor, Ohio, but has been legally registered since 2018 in Dublin, Ireland for tax purposes; it was previously registered in the United Kingdom from 2014 to 2018. Steris is quoted on the NYSE, and is a constituent of the S&P 500 Index. As of 2024, the President and CEO is Daniel A. Carestio. Steris' competitors include 3M, Getinge Group, and Belimed (Metall Zug). History Steris was founded in August 1985 in Ohio, under the name \"Innovative Medical Technologies\". In 2012, Steris acquired US Endoscopy for $270 million. Steris also acquired Spectrum Surgical Instruments Corp. and Total Repair Express for $110 million combined. On April 1, 2014, Steris announced its acquisition of Integrated Medical Systems International Inc. for ~$175 million, although it would only cost the company ~$140 million after tax benefits. Shortly after, Steris also acquired Chesterfield, Missouri-based Life Systems. In October 2014, Steris executed a tax inversion from the United States to the United Kingdom, via an offer made to acquire UK-based Synergy Health for $1.9 billion. The tax inversion was notable as it was the first US inversion post the new rules introduced by the Obama administration in 2014 to curb US corporations moving their \"legal domicile\" to reduce their exposure to US corporate taxation. On June 24, 2015, Steris announced the acquisitions of General Econopak for $175 million and Black Diamond Video for $51 million. Steris filed accounts which showed global revenues of over US$2.6 billion in 2018, of which US$1.8 billion (or 70 percent) came from the US healthcare system; and employed ~12,000 people. In November 2018, Steris announced that it would further re-domicile its legal headquarters from the United Kingdom to Ireland; Steris had reduced its corporate tax rate from 31.3 percent to 20 percent as a result of its 2014 tax inversion to the United Kingdom, however, it believed a further reduction could be achieved by moving to Ireland. In April 2020, Steris received emergency use authorization from the FDA for a N95 mask sterilization system to help address the shortage of personal protective equipment during the 2019-20 coronavirus pandemic. In November 2020, Steris acquired Key Surgical, a leading global provider of sterile processing, operating room, and endoscopy products. In June 2021, Steris acquired Cantel Medical Corporation a provider of infection prevention products and services to endoscopy, dental and dialysis."
}