{
  "ticker": "STLD",
  "cik": "0001022671",
  "company_name": "Steel Dynamics",
  "corrected_name": "Steel Dynamics",
  "wiki_title_used": "Steel Dynamics",
  "exists": true,
  "raw_text": "Steel Dynamics, Inc. (SDI) is an American steel producer based in Fort Wayne, Indiana. With a production capacity of 13 million tons of steel, the company is the third largest producer of carbon steel products in the United States. It is among the most profitable American steel companies in terms of profit margins and operating margin per ton. Based on its 2021 revenue, the company ranked 196th on the 2022 edition of the Fortune 500.\n\nHistory\nSteel Dynamics was founded in 1993 by three former executives of Nucor with $370 million in funding. It began production at its $275 million Butler, Indiana, flat roll mill in 1996 and reported its first annual profit in 1997.\nDuring the early 2000s recession, the company offered many incentive programs for employees to cut costs and improve standards and outperformed most other steel manufacturers.\nIn 2007, the company acquired The Techs, three hot-dip galvanization plants in Pittsburgh that coat flat-rolled steel, and OmniSource Corporation, a scrap metal processor and trader.\nIn 2014, the company acquired Severstal Columbus for $1.625 billion. The acquisition increased the company's production capacity to 11 million tons.\nIn 2016, the company acquired Vulcan Threaded Products for $126 million.\nIn 2016, the company began construction of a $100 million facility in Columbus, Mississippi.\nIn 2017, the company began a $28 million expansion of its Roanoke Bar Division.\nIn 2017, the company began a $75 million expansion of its Structural and Rail Division.\nIn 2018, the company acquired the former Kentucky Electric Steel plant in Coalton, Kentucky.\nin 2020, production for the Sinton, TX, facility commenced. It is a 2,400-acre complex which is supposed to also house several other businesses who work with SDI in other cities. 3,000 jobs should be created when complete.\n\nControversies\nClean Air Act violation settlement\nIn 2021, the company agreed to pay $475,000 in civil penalties and spend $3 million to upgrade air pollution control equipment to reduce air emissions at its facilities in Butler, Indiana. Following on-site inspections, the United States Environmental Protection Agency accused Steel Dynamics of violating the Clean Air Act of 1963.\n\nPrice-fixing allegations\nThe company was accused in a lawsuit of participating in a conspiracy with other steel manufacturers to restrict steel production in 2008. In October 2016, the company settled the case, agreeing to pay $4.6 million.\n\nSee also\nList of steel producers\n\nFurther reading\nRichard Sarver - Taking the Heat - A Steelworker's Story (2012)\n\nReferences\nExternal links\nOfficial website\nBusiness data for Steel Dynamics, Inc.:",
  "clean_text": "Steel Dynamics, Inc. (SDI) is an American steel producer based in Fort Wayne, Indiana. With a production capacity of 13 million tons of steel, the company is the third largest producer of carbon steel products in the United States. It is among the most profitable American steel companies in terms of profit margins and operating margin per ton. Based on its 2021 revenue, the company ranked 196th on the 2022 edition of the Fortune 500. History Steel Dynamics was founded in 1993 by three former executives of Nucor with $370 million in funding. It began production at its $275 million Butler, Indiana, flat roll mill in 1996 and reported its first annual profit in 1997. During the early 2000s recession, the company offered many incentive programs for employees to cut costs and improve standards and outperformed most other steel manufacturers. In 2007, the company acquired The Techs, three hot-dip galvanization plants in Pittsburgh that coat flat-rolled steel, and OmniSource Corporation, a scrap metal processor and trader. In 2014, the company acquired Severstal Columbus for $1.625 billion. The acquisition increased the company's production capacity to 11 million tons. In 2016, the company acquired Vulcan Threaded Products for $126 million. In 2016, the company began construction of a $100 million facility in Columbus, Mississippi. In 2017, the company began a $28 million expansion of its Roanoke Bar Division. In 2017, the company began a $75 million expansion of its Structural and Rail Division. In 2018, the company acquired the former Kentucky Electric Steel plant in Coalton, Kentucky. in 2020, production for the Sinton, TX, facility commenced. It is a 2,400-acre complex which is supposed to also house several other businesses who work with SDI in other cities. 3,000 jobs should be created when complete. Controversies Clean Air Act violation settlement In 2021, the company agreed to pay $475,000 in civil penalties and spend $3 million to upgrade air pollution control equipment to reduce air emissions at its facilities in Butler, Indiana. Following on-site inspections, the United States Environmental Protection Agency accused Steel Dynamics of violating the Clean Air Act of 1963. Price-fixing allegations The company was accused in a lawsuit of participating in a conspiracy with other steel manufacturers to restrict steel production in 2008. In October 2016, the company settled the case, agreeing to pay $4.6 million."
}