{
  "ticker": "STZ",
  "cik": "0000016918",
  "company_name": "Constellation Brands",
  "corrected_name": "Constellation Brands",
  "wiki_title_used": "Constellation Brands",
  "exists": true,
  "raw_text": "Constellation Brands, Inc. is an American producer and marketer of beer, wine, and spirits. A Fortune 500 company, Constellation is the largest beer import company in the US, measured by sales, and has the third-largest market share (7.4 percent) of all major beer suppliers. It also has sizable investments in medical and recreational cannabis through its association with Canopy Growth. Based in Rochester, New York, Constellation has about 40 facilities and approximately 9,000 employees.\nThe company has more than 27 brands in its portfolio. Wine brands include Robert Mondavi, Kim Crawford, Ruffino, and The Prisoner Wine Company. Constellation's beer portfolio includes imported brands such as rights in the United States to Corona, Modelo Especial, Negra Modelo, and Pacífico. Spirits brands include Casa Noble Tequila, High West Whiskey, and Nelson's Green Brier Tennessee Whiskey.\n\nBreweries\nConstellation Brands has two breweries in Mexico that produce Corona and Modelo beer for the US market. Those locations are in Nava, Coahuila, and  Ciudad Obregón, Sonora.\n\nA third Brewery in Mexicali Baja California was never finished due to environmental issues. Instead, Constellation is building its third brewery in Veracruz, Mexico.\n\nHistory\nEarly days\nThe company was established in 1945 by Marvin Sands in the Finger Lakes region of New York as Canandaigua Industries, selling bulk wine to bottlers in the eastern United States. In its first year, the company sold approximately 200,000 gallons of wine and had gross sales of $150,000. The company was incorporated as Canandaigua Wine Company, Inc. in 1972 and went public in 1973. Marvin's son Richard Sands became president in 1993 and CEO in 1996. In 1999, Marvin Sands died following a brief illness.\nIn 1987, the company purchased the Manischewitz winery in Canandaigua, New York, and continues to license the Manischewitz name from R.A.B. Foods.\n\nExpansion\nIn 2000, the company changed its name to Constellation Brands, Inc. to reflect the scope of the company and its range of brands. In 2007, Rob Sands was named president and CEO. During the 2000s, there were multiple acquisitions, with some divestments later in the decade. Acquisitions included BRL Hardy (Australia) and Nobilo (New Zealand) in 2003; Robert Mondavi Corp. for $1 billion in 2004; Vincor International, Canada's largest wine company, for $1.44 billion in 2006; Spirits Marque One (owner of Svedka Vodka) in 2007; and Beam Wines Estates, the wine operations of Fortune Brands (which included several major brands such as Clos du Bois) for $885 million in 2008. The company later moved to a more premium wine portfolio, divesting Almaden Vineyards, Inglenook Winery, and the Paul Masson winery in Madera, California, in 2008, and its value spirits portfolio to the Sazerac Company in 2009.  They sold 30 low-cost wine labels in January 2021 to E. & J. Gallo for $810 million including Clos du Bois.\nIn 2013, Constellation acquired Grupo Modelo's US beer business from Anheuser-Busch InBev, who were required to divest the business as a part of an anti-trust settlement permitting Anheuser-Busch InBev to acquire Grupo Modelo. Constellation had formerly imported Corona and other Modelo brands to the United States. The transaction included full ownership of Crown Imports LLC, which provided Constellation with complete, independent control of all aspects of the US commercial business; a brewery in Mexico; an exclusive perpetual brand license in the US to import, market and sell Corona and the Modelo brands and the freedom to develop brand extensions and innovations for the US market.  It now manufactures these products in Mexico for the US market, with Grupo Modelo serving all other countries. In 2014, Constellation finalized a joint venture with Owens-Illinois and completed the acquisition of Anheuser-Busch InBev's glass production plant, located adjacent to the company's brewery in Nava, Mexico.\nIn December 2015, Constellation announced the $1 billion acquisition of Ballast Point Brewing of San Diego. In October 2016, Constellation announced the $160 million acquisition of High West Distillery of Park City, Utah. In August 2017, Constellation announced the acquisition of Funky Buddha Brewery of Oakland Park, Florida.\nIn April 2018, Accolade Wines (acquired under the name BRL Hardy) was sold to private equity firm The Carlyle Group. Constellation had already in 2011 reduced its holdings in Accolade to 20%. In February 2019, Constellation announced it had acquired a minority stake in Black Button Distilling, a craft spirits distillery in Rochester, NY.  In April 2019, Constellation announced a deal to sell wine brands, including Clos du Bois and Mark West, to E. & J. Gallo Winery for $1.7 billion. In July 2019, Constellation announced it had acquired a minority stake in Montanya Distillers, a craft-rum distillery in Crested Butte, Colorado and a majority stake in Nelson's Green Brier Distillery, a revival of the original Green Brier Tennessee Whiskey and Belle Meade Bourbon labels in Nashville, TN. In December 2019, the sale of Ballast Point Brewing to Kings & Convicts Brewery of Illinois was announced. Terms were not disclosed. In July 2020, Constellation Brands acquired Empathy Wines, co-founded by entrepreneur Gary Vaynerchuk. On September 15, 2020, it was announced Constellation Brands acquired craft spirits producer Copper & Kings American Brandy. In February 2022, Constellation was reported to have approached Monster Beverage to enter into a merger with a combined valuation above $90 billion.\nIn 2023, Constellation Brands sold Funky Buddha back to its founders.\nOn June 24, 2024, Constellation Brands re-located its headquarters to a 170,000 square foot campus on the site of the historic Aqueduct Building in Downtown Rochester, the first Fortune 500 company to operate in the city in two decades.\n\nCannabis\nIn 2017, the company began investing in medical marijuana. In March 2019, Bill Newlands became CEO. In October 2017, Constellation agreed to pay about C$245 million ($191 million) for a 9.9% stake in Canopy Growth Corporation, a Canadian seller of medicinal-marijuana products. At the time of the agreement, Constellation became the first Fortune 500 company and the first major alcoholic beverage maker to take a minority stake in a marijuana business. In August 2018, the company announced that it would invest an additional US$4 billion in Canopy Growth Corporation in advance of the legalization of recreational cannabis in Canada in October that year. The investment will increase its share in the Canadian Company to 38%. Canopy Growth president Bruce Linton said the additional funds would be used for international expansion and that future marketing plans included products such as cannabis-infused beverages and sleep aids. Since 2023, Constellation started stepping back from the cannabis-infused drinks market. reducing the stake in Canopy Growth Corporation and signalled that it could withdraw completely.\n\nControversies\nIn 1991, the company reached a consent agreement with the Federal Trade Commission to change the packaging and marketing of Cisco wine after the FTC alleged that Cisco's marketing was deceptively similar to wine coolers despite Cisco having a much higher alcohol content.\nIn 2010, a French court in Carcassonne, France, convicted 12 wine traders and producers, including Constellation, for selling fake pinot noir wine to US buyers in a scheme that lasted from January 2006 to March 2008. Constellation later faced and settled a class action lawsuit because it \"should have known\" that the wine was fake.\nIn 2018 Constellation Brands was involved in a water rights dispute over a proposed manufacturing facility in the city of Mexicali, Baja California, Mexico. The water was from the Colorado River, which not only supplies the water for Mexicali and the agricultural valley but is also piped to the mountain and coastal cities of Tijuana, Tecate, Rosarito and some areas of Ensenada.\nIn 2021, AB InBev sued Constellation Brands after the company launched two new Modelo-branded beers on the US market, arguing that the first beer illegally used the term \"tequila\" to describe the barrels where the beer was aged, and that the second beer was inappropriately using the term \"bourbon\" to describe the barrels where the beer was aged because bourbon has nothing to do with Mexico.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Constellation Brands, Inc.:",
  "clean_text": "Constellation Brands, Inc. is an American producer and marketer of beer, wine, and spirits. A Fortune 500 company, Constellation is the largest beer import company in the US, measured by sales, and has the third-largest market share (7.4 percent) of all major beer suppliers. It also has sizable investments in medical and recreational cannabis through its association with Canopy Growth. Based in Rochester, New York, Constellation has about 40 facilities and approximately 9,000 employees. The company has more than 27 brands in its portfolio. Wine brands include Robert Mondavi, Kim Crawford, Ruffino, and The Prisoner Wine Company. Constellation's beer portfolio includes imported brands such as rights in the United States to Corona, Modelo Especial, Negra Modelo, and Pacífico. Spirits brands include Casa Noble Tequila, High West Whiskey, and Nelson's Green Brier Tennessee Whiskey. Breweries Constellation Brands has two breweries in Mexico that produce Corona and Modelo beer for the US market. Those locations are in Nava, Coahuila, and Ciudad Obregón, Sonora. A third Brewery in Mexicali Baja California was never finished due to environmental issues. Instead, Constellation is building its third brewery in Veracruz, Mexico. History Early days The company was established in 1945 by Marvin Sands in the Finger Lakes region of New York as Canandaigua Industries, selling bulk wine to bottlers in the eastern United States. In its first year, the company sold approximately 200,000 gallons of wine and had gross sales of $150,000. The company was incorporated as Canandaigua Wine Company, Inc. in 1972 and went public in 1973. Marvin's son Richard Sands became president in 1993 and CEO in 1996. In 1999, Marvin Sands died following a brief illness. In 1987, the company purchased the Manischewitz winery in Canandaigua, New York, and continues to license the Manischewitz name from R.A.B. Foods. Expansion In 2000, the company changed its name to Constellation Brands, Inc. to reflect the scope of the company and its range of brands. In 2007, Rob Sands was named president and CEO. During the 2000s, there were multiple acquisitions, with some divestments later in the decade. Acquisitions included BRL Hardy (Australia) and Nobilo (New Zealand) in 2003; Robert Mondavi Corp. for $1 billion in 2004; Vincor International, Canada's largest wine company, for $1.44 billion in 2006; Spirits Marque One (owner of Svedka Vodka) in 2007; and Beam Wines Estates, the wine operations of Fortune Brands (which included several major brands such as Clos du Bois) for $885 million in 2008. The company later moved to a more premium wine portfolio, divesting Almaden Vineyards, Inglenook Winery, and the Paul Masson winery in Madera, California, in 2008, and its value spirits portfolio to the Sazerac Company in 2009. They sold 30 low-cost wine labels in January 2021 to E. & J. Gallo for $810 million including Clos du Bois. In 2013, Constellation acquired Grupo Modelo's US beer business from Anheuser-Busch InBev, who were required to divest the business as a part of an anti-trust settlement permitting Anheuser-Busch InBev to acquire Grupo Modelo. Constellation had formerly imported Corona and other Modelo brands to the United States. The transaction included full ownership of Crown Imports LLC, which provided Constellation with complete, independent control of all aspects of the US commercial business; a brewery in Mexico; an exclusive perpetual brand license in the US to import, market and sell Corona and the Modelo brands and the freedom to develop brand extensions and innovations for the US market. It now manufactures these products in Mexico for the US market, with Grupo Modelo serving all other countries. In 2014, Constellation finalized a joint venture with Owens-Illinois and completed the acquisition of Anheuser-Busch InBev's glass production plant, located adjacent to the company's brewery in Nava, Mexico. In December 2015, Constellation announced the $1 billion acquisition of Ballast Point Brewing of San Diego. In October 2016, Constellation announced the $160 million acquisition of High West Distillery of Park City, Utah. In August 2017, Constellation announced the acquisition of Funky Buddha Brewery of Oakland Park, Florida. In April 2018, Accolade Wines (acquired under the name BRL Hardy) was sold to private equity firm The Carlyle Group. Constellation had already in 2011 reduced its holdings in Accolade to 20%. In February 2019, Constellation announced it had acquired a minority stake in Black Button Distilling, a craft spirits distillery in Rochester, NY. In April 2019, Constellation announced a deal to sell wine brands, including Clos du Bois and Mark West, to E. & J. Gallo Winery for $1.7 billion. In July 2019, Constellation announced it had acquired a minority stake in Montanya Distillers, a craft-rum distillery in Crested Butte, Colorado and a majority stake in Nelson's Green Brier Distillery, a revival of the original Green Brier Tennessee Whiskey and Belle Meade Bourbon labels in Nashville, TN. In December 2019, the sale of Ballast Point Brewing to Kings & Convicts Brewery of Illinois was announced. Terms were not disclosed. In July 2020, Constellation Brands acquired Empathy Wines, co-founded by entrepreneur Gary Vaynerchuk. On September 15, 2020, it was announced Constellation Brands acquired craft spirits producer Copper & Kings American Brandy. In February 2022, Constellation was reported to have approached Monster Beverage to enter into a merger with a combined valuation above $90 billion. In 2023, Constellation Brands sold Funky Buddha back to its founders. On June 24, 2024, Constellation Brands re-located its headquarters to a 170,000 square foot campus on the site of the historic Aqueduct Building in Downtown Rochester, the first Fortune 500 company to operate in the city in two decades. Cannabis In 2017, the company began investing in medical marijuana. In March 2019, Bill Newlands became CEO. In October 2017, Constellation agreed to pay about C$245 million ($191 million) for a 9.9% stake in Canopy Growth Corporation, a Canadian seller of medicinal-marijuana products. At the time of the agreement, Constellation became the first Fortune 500 company and the first major alcoholic beverage maker to take a minority stake in a marijuana business. In August 2018, the company announced that it would invest an additional US$4 billion in Canopy Growth Corporation in advance of the legalization of recreational cannabis in Canada in October that year. The investment will increase its share in the Canadian Company to 38%. Canopy Growth president Bruce Linton said the additional funds would be used for international expansion and that future marketing plans included products such as cannabis-infused beverages and sleep aids. Since 2023, Constellation started stepping back from the cannabis-infused drinks market. reducing the stake in Canopy Growth Corporation and signalled that it could withdraw completely. Controversies In 1991, the company reached a consent agreement with the Federal Trade Commission to change the packaging and marketing of Cisco wine after the FTC alleged that Cisco's marketing was deceptively similar to wine coolers despite Cisco having a much higher alcohol content. In 2010, a French court in Carcassonne, France, convicted 12 wine traders and producers, including Constellation, for selling fake pinot noir wine to US buyers in a scheme that lasted from January 2006 to March 2008. Constellation later faced and settled a class action lawsuit because it \"should have known\" that the wine was fake. In 2018 Constellation Brands was involved in a water rights dispute over a proposed manufacturing facility in the city of Mexicali, Baja California, Mexico. The water was from the Colorado River, which not only supplies the water for Mexicali and the agricultural valley but is also piped to the mountain and coastal cities of Tijuana, Tecate, Rosarito and some areas of Ensenada. In 2021, AB InBev sued Constellation Brands after the company launched two new Modelo-branded beers on the US market, arguing that the first beer illegally used the term \"tequila\" to describe the barrels where the beer was aged, and that the second beer was inappropriately using the term \"bourbon\" to describe the barrels where the beer was aged because bourbon has nothing to do with Mexico."
}