{
  "ticker": "SW",
  "cik": "0002005951",
  "company_name": "Smurfit Westrock",
  "corrected_name": "Smurfit Westrock",
  "wiki_title_used": "Smurfit Westrock",
  "exists": true,
  "raw_text": "Smurfit Westrock plc is an Irish company based in Dublin, Ireland that manufactures corrugated and paper-based packaging. Its stock is listed on the New York Stock Exchange and the London Stock Exchange.\n\nHistory\nThe company was established as a box-maker in the Rathmines area of Dublin, Ireland in 1934 and was acquired by Mr Jefferson Smurfit in 1938, trading afterwards as Jefferson Smurfit. It was listed on the Irish Stock Exchange in 1964 and acquired a partial interest in Time Industries, a Chicago-based paper and packaging company, in 1974. Jefferson Smurfit grew under the leadership of the founder's son, Sir Michael Smurfit, who became Chief Executive in 1977.\nIt merged its 46%-owned US business with Chicago-based Stone Container Corporation to form Smurfit-Stone Container Corporation in 1998.\nJefferson Smurfit was the subject of a management buyout financed by Madison Dearborn Partners, Cinven Limited and CVC Capital Partners in 2002. It merged with Kappa Packaging in 2005, changing its name to Smurfit Kappa, and was the subject of an initial public offering in 2007.\nIn 2012 it bought Orange County Container, a US-based packaging company, for $340 million. In 2016 it acquired two Brazilian Companies for €186 million.\nIn September 2023, it was announced that Smurfit Kappa and the Sandy Springs, Georgia-headquartered corrugated packaging company, WestRock had agreed to merge, to create one of the world's largest paper and packaging producers. It was confirmed in the circular and prospectus that the transaction will be conducted by Smurfit Kappa acquiring WestRock and then changing its name to Smurfit Westrock, and that the Smurfit Kappa Group shareholders and board would represent the majority of the combined entity. The transaction completed on 5 July 2024.\n\nOperations\nThe company specialises in manufacturing paper-based packaging, with a network of paper, recycling and forestry operations. It is an integrated producer, with packaging plants sourcing the major part of their raw material requirements from the company's own paper mills. In turn, the sourcing of recovered fibre and wood for the mills is managed through a combination of reclamation and forestry operations and purchases from third parties. It operates across 35 countries – 22 in Europe, 13 in the Americas. Its global headquarters are in Dublin, with regional headquarters in Amsterdam and Miami.\nThe company also operates a publishing division aimed at the educational sector in Ireland through its subsidiary, the Educational Company of Ireland, more commonly known as Edco. It distributes textbooks for primary and post-primary education, exam papers, revision books and resources for the Irish Curriculum.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Smurfit Westrock (London Shares): \nBusiness data for Smurfit Westrock (New York Shares):",
  "clean_text": "Smurfit Westrock plc is an Irish company based in Dublin, Ireland that manufactures corrugated and paper-based packaging. Its stock is listed on the New York Stock Exchange and the London Stock Exchange. History The company was established as a box-maker in the Rathmines area of Dublin, Ireland in 1934 and was acquired by Mr Jefferson Smurfit in 1938, trading afterwards as Jefferson Smurfit. It was listed on the Irish Stock Exchange in 1964 and acquired a partial interest in Time Industries, a Chicago-based paper and packaging company, in 1974. Jefferson Smurfit grew under the leadership of the founder's son, Sir Michael Smurfit, who became Chief Executive in 1977. It merged its 46%-owned US business with Chicago-based Stone Container Corporation to form Smurfit-Stone Container Corporation in 1998. Jefferson Smurfit was the subject of a management buyout financed by Madison Dearborn Partners, Cinven Limited and CVC Capital Partners in 2002. It merged with Kappa Packaging in 2005, changing its name to Smurfit Kappa, and was the subject of an initial public offering in 2007. In 2012 it bought Orange County Container, a US-based packaging company, for $340 million. In 2016 it acquired two Brazilian Companies for €186 million. In September 2023, it was announced that Smurfit Kappa and the Sandy Springs, Georgia-headquartered corrugated packaging company, WestRock had agreed to merge, to create one of the world's largest paper and packaging producers. It was confirmed in the circular and prospectus that the transaction will be conducted by Smurfit Kappa acquiring WestRock and then changing its name to Smurfit Westrock, and that the Smurfit Kappa Group shareholders and board would represent the majority of the combined entity. The transaction completed on 5 July 2024. Operations The company specialises in manufacturing paper-based packaging, with a network of paper, recycling and forestry operations. It is an integrated producer, with packaging plants sourcing the major part of their raw material requirements from the company's own paper mills. In turn, the sourcing of recovered fibre and wood for the mills is managed through a combination of reclamation and forestry operations and purchases from third parties. It operates across 35 countries – 22 in Europe, 13 in the Americas. Its global headquarters are in Dublin, with regional headquarters in Amsterdam and Miami. The company also operates a publishing division aimed at the educational sector in Ireland through its subsidiary, the Educational Company of Ireland, more commonly known as Edco. It distributes textbooks for primary and post-primary education, exam papers, revision books and resources for the Irish Curriculum."
}