{
  "ticker": "SWK",
  "cik": "0000093556",
  "company_name": "Stanley Black & Decker",
  "corrected_name": "Stanley Black & Decker",
  "wiki_title_used": "Stanley Black & Decker",
  "exists": true,
  "raw_text": "Stanley Black & Decker, Inc., formerly known as The Stanley Works, is an American manufacturer of industrial tools and household hardware, and a provider of security products. Headquartered in the Greater Hartford city of New Britain, Connecticut, Stanley Black & Decker is the result of the merger of The Stanley Works and Black & Decker on March 12, 2010.\n\nHistory\nThe Stanley Works came to existence as a direct result of the 1920 merger of Stanley's Bolt Manufactory, founded by Frederick Trent Stanley in 1843, and the Stanley Rule and Level Company, founded by Frederick's cousin, Henry Stanley, in 1857. DeWalt was acquired in 1960, and sold to Black & Decker.\nIn March 12, 2010 Black & Decker merged with Stanley Works to become Stanley Black & Decker. It’s a wholly owned subsidiary of that company.\nDuring World War II, Stanley Works received the Army-Navy \"E\" Award for excellence in war production.\n\nIn May 2002, the company considered moving its corporate headquarters to Bermuda, but public and governmental outcry forced management to reconsider the move.  By August 2002, the company had decided to maintain its incorporation in the United States.\nJohn F. Lundgren was elected as chairman and chief executive officer in 2004, replacing John Trani, a former protégé of Jack Welch at General Electric.\nThe Hardware & Home Improvement Group, including the Kwikset, Weiser, Baldwin, National Hardware, Stanley, FANAL, Pfister and EZSET brands, was acquired by Spectrum Brands Holdings, Inc. on  December 17, 2012.\nIn July 2016, CEO John F. Lundgren stepped down, with President and COO James M. Loree taking over as CEO.\nIn July 2022, CEO James M. Loree stepped down, with President and CFO Donald Allan, Jr taking over as CEO. Three years later, Allan, Jr was succeeded by Christopher Nelson as CEO.\n\nAcquisitions\n1906-7: To strengthen its position in Canada, a tool plant was opened in Roxton Pond, Quebec. The company was officially incorporated as the Stanley Tool Company of Canada, Ltd. on February 7, 1907. The Roxton Pond plant continued operations until 1984.\n1937: Stanley Works entered the United Kingdom market with the acquisition of J.A. Chapman of Sheffield, England.\n1946: Stanley Works acquired North Brothers Manufacturing Company in Philadelphia, Pennsylvania.\n1963: Stanley started operations in Australia as Stanley-Titan when it bought a 50% share of Titan, a subsidiary of BHP.\n1966: Stanley Works acquired Vidmar Cabinets in Allentown, Pennsylvania.\n1970: Stanley-Titan acquired Turner Tools, based in Melbourne, Australia.\n1980: Stanley Works acquired Mac Tools.\n1984: Stanley Works purchased Proto from Ingersoll Rand and it becomes Stanley Proto.\n1986: Stanley Works acquired Bostitch from Textron.\n1990: Stanley Works acquired Goldblatt and ZAG Industries.\n1990: Acquired Sidchrome Tool Co., headquartered in Melbourne, Australia. Closed plant in 1996 and started to move all tool manufacturing to Taiwan, sourcing various items from Proto in the USA (marked as Proto on items) due to supply of left-over Australian-made tools being sold out until all manufacturing was fully established in Taiwan.\n1992: Stanley Works purchased the Chatsworth, California-based Monarch Mirror Door Co. Inc., an American manufacturer of sliding and folding mirror-doors.\n2000: Stanley Works acquired Blick of Swindon, England, a UK integrator of security, communication, and time-management services, and CST Berger.\n2002: In October, Stanley Works acquired Best Access Systems of Indianapolis, Indiana, for $310 million. The acquisition also prompted the creation of a new Access Controls Group for Stanley. Further additions to this new working group included Blick.\n2004: In January, Stanley announced plans to acquire Frisco Bay Industries Ltd., a Canadian provider of security integration services, for $45.3 million. In December, the acquisition of ISR Solutions, Inc., headquartered in Washington, D.C., was announced. ISR Solutions provides the U.S. federal government and commercial customers with access security system services.\n2005: In January, the acquisition of Security Group was announced. Security Group was composed of two primary operating companies: Sargent & Greenleaf, a manufacturer of locks; and Safemasters, a North American provider of security installation, maintenance and repair services. An additional acquisition of Precision Hardware was made in 2005. In the same year, Stanley Works also acquired Facom.\n2006: Stanley furthered its corporate assets in the security market by acquiring HSM Electronic Protection Systems after it had been spun off from Honeywell in compliance with pre-emptive Securities and Exchange Commission antitrust rulings. In the meantime, the company obtained security contracts as the primary contractor to secure three NASA spaceflight centers.\n2007: Late in the year, Stanley acquired OSI Security of Chula Vista, California, a provider of battery-operated wireless lock technology and supplies to government, education, and healthcare industries.\n2008: Stanley acquired Beach Toolbox Industries, headquartered in Smith Falls, Ontario, Canada, then closed the plant.\n2008: In June, Stanley announced the acquisition of Sonitrol, which provides security systems that use audio listening devices as the primary means of intrusion detection. Stanley also acquired Xmark Corporation, which provides radio frequency identification (RFID) solutions in healthcare environments. As of 2008, many of the Stanley Security Services divisions were being integrated under the HSM brand.\n2009: On November 2, Stanley announced a merger with Black & Decker. The merger was completed on March 12, 2010.\n2010: In July, the company announced the acquisition of CRC-Evans Pipeline International. CRC-Evans provides total project support for pipeline construction contractors with automatic welding and other pipeline construction specific equipment and personnel.\n2011: On September 9, the acquisition of Niscayah was complete.\n2012: On January 1, the acquisition of Lista North America from LISTA, headquartered in Holliston, Massachusetts, was completed.\n2012: On June 1, the acquisition of Powers Fasteners, headquartered in Brewster, New York, was completed.\n2012: On June 5, the acquisition of AeroScout, headquartered in Redwood City, California, was completed.\n2016: Stanley Black & Decker announced in October that it acquired the Irwin, Lenox, and Hilmor tool brands for $1.95 billion from Newell Brands.\n2017: On January 5, news reports indicated that it would acquire the Craftsman brand from KCD, LLC (a Sears Holdings subsidiary). Subsequent reports by Bloomberg indicated that the company would pay $525 million initially, an additional $250 million after three years, as well as annual payments on new Craftsman sales for 15 years.\n2018: On September 12, Stanley Black & Decker announced that it had entered into a definitive agreement to acquire a 20 percent stake in MTD Products Inc, a privately held global manufacturer of outdoor power equipment, for $234 million in cash. Under the terms of the agreement, Stanley Black & Decker has the option to acquire the remaining 80 percent of MTD beginning on July 1, 2021.\n2018: On August 7, Stanley Black & Decker announced it entered into a definitive agreement to acquire International Equipment Solutions Attachments Group (IES Attachments) for $690 million in cash.\n2020: In Q1 2020, Stanley Black & Decker agreed to acquire Consolidated Aerospace Manufacturing, LLC (CAM) for up to $1.5 billion. CAM provides a fastener and component platform which would help the company to grow in aerospace and defense.\n2021: On August 17, 2021, Stanley Black & Decker announced that it has agreed to acquire the remaining 80% ownership stake in MTD Holdings Inc.\n2021: On September 13, 2021, Stanley Black & Decker announced that it would be acquiring Excel Industries; who designs and manufactures commercial and residential turf-care equipment under the Hustler Turf Equipment and BigDog Mower Co. brands. The sale was completed November 12 of the same year.\n2021: On December 8, 2021, Securitas AB announced that it had entered into an agreement to purchase Stanley Black & Decker's electronic security business unit for $3.2 billion \n2022: In Q3 2022, Stanley Black & Decker announced layoffs of over 1,000 corporate employees as part of cost-saving measures in response to plummeting stock price\n\nBusiness segments and brands\nSources:\n\nTools\nPower tools\nDeWalt – power tools; B & D acquired in 1960\nGuoqiang (GQ) Tools (China) – power tools\nPorter-Cable – power tools; B & D acquired in 2004/2005\nOldham Saw Company – circular saw blade and wood router bit products; B & D acquired in 2004\nBlack+Decker – acquired (via merger) in 2010\nCraftsman – acquired from Sears KDCP in 2016\n\nHand tools and storage\nPastorino – carpentry and construction hand tools\nStanley Hand Tools – carpentry and construction hand tools\nBlack and Decker: Home appliances, power tools, hardware, batteries, fastening systems, \n\nCraftsman\nIrwin Industrial Tools Irwin\nLENOX Tools\nExpert – industrial and automotive tools\nFacom (France) – professional tools; acquired in 2006 (includes Britool) owned by Stanley Black and Decker\nLista North America – industrial storage; acquired in 2012\nMac Tools – professional tools; acquired in 1980\nProto – industrial hand tools; acquired in 1984\nBlackhawk – Mechanic's tools; acquired in 1986\nSidchrome (Australia/New Zealand) – mechanics' tools; acquired in 1990\nUSAG (Italy) – professional tools; acquired in 2010\nVidmar – industrial storage; acquired in 1966\nVirax (France) – plumbing tools; acquired in 2006\nWaterloo Industries – Tool Storage Solutions, purchased in 2017. Brand was discontinued shortly thereafter.\n\nFastening and accessories\nBostitch – fastening tools; acquired in 1986\nPowers Fasteners – adhesive and mechanical anchors\n\nOutdoor\nCub Cadet\nHustler\nTroy-bilt\nRover\nMTD\n\nIndustrial\nCribmaster\nCribmaster – tool inventory, storage, tracking and usage/vending management\nStanley Supply & Services – MRO products and services; formerly Contact East and Jensen Tools; renamed in 2006\n\nEngineered fastening\nEmhart Teknologies – fastening and assembly; acquired in 2010; later renamed Stanley Engineered Fastening\nDodge – metal-on-plastic threaded inserts\nGripco – threaded fasteners\nHeliCoil – threaded inserts\nInfastech – acquired in 2013 by Stanley Engineered Fastening\nAvdel – blind fastening systems and related tools\niForm – coated threaded fasteners\nMasterFix (Europe) – blind riveting\nNelson – stud welding fasteners\nNPR/POP – riveting technology\nSpiralock – threaded fasteners and inserts; acquired in 2010 by Emhart\nStanley Assembly Technologies – assembly line power tools\nTucker – hole-less fastening\nWarren – custom fastening fabrication\n\nInfrastructure\nHydraulic tools\nDubuis – cutting, crimping, and grounding tools\nHorst Sprenger GmbH (Germany) – replacement consumables for scrap processing equipment\nLaBounty – non-impact hydraulic attachments\nStanley Hydraulic Tools\nStanley Oil & Gas (CRC-Evans International) – equipment used in the construction of pipelines for the oil and gas (O&G) industry\nStanley – automatic doors for buildings\nPaladin Attachments – equipment used for excavation, farming, and various other infrastructure.\n\nAerospace Manufacturing\nCAM\n\nStanley Security Solutions (SSS)\nAs of July 22, 2022, Stanley Security Solutions was acquired by Securitas Electronic Security and has been rebranded as Securitas Technology \nThe North American headquarters is located in Fishers, Indiana. This division of Stanley Black & Decker comprises the following primary business units:\n\nConvergent Security Solutions\nStanley Access Technologies\nStanley Healthcare Solutions\nLikewise, Stanley Security Solutions has operations in the following global markets:\n\nLatin America\nEurope\nAsia\nEmerging Markets\nStanley Security Solutions is provider of locks, fire sensors, security cameras, and similar hardware. They also provide software to monitor this hardware. In addition they provide computer security software to protect hardware, software, or electronic data.  A partial list of Stanley Security Solutions products:\n\nAero Scout\nSargent and Greenleaf\nAccess Control Systems\nVideo Surveillance Systems\nIntrusion Alarm Monitoring Systems\nSonitrol\nFire Alarm Monitoring Systems\nVideo Alarm Verification\nNetwork Security\nCyber Security\nRetail Analytics\nIntegrated Security Solutions\nEnterprise Security Solutions\n\nDivested businesses\nStanley Securities\nIn Q4 2021, Stanley Black's Commercial Electronic and Healthcare Security business lines- were sold to Securitas for $3.2 billion in cash. In 2021, the businesses were predicted to generate revenues of about $1.7 billion.\nStanley Access Technologies\nIn Q1 2022, Stanley Access Technologies were sold to Allegion for $900 million in cash.\nStanley Oil & Gas\nIn Q2 2022, Stanley Oil & Gas, comprising three business units, namely STANLEY Inspection, Pipeline Induction Heat Ltd. and CRC-Evans Pipeline International, were sold to Pipeline Technique Limited.\n\nMechanical Access Solutions (MAS)\nFormerly a business unit (BU) within Stanley Security Solutions, this comprised Best Access Systems and several product brands that were sold to Dormakaba in 2016Q4. MAS was dissolved however the brand Sergeant & Greenleaf was retained by Convergent Security Solutions.\n\nHardware and Home Improvement (HHI)\nThese were sold to Spectrum Brands in 2012.\n\nBaldwin – acquired in 2010\nKwikset – acquired in 1989 by Black & Decker\nNational Hardware – general hardware; acquired in 2005\nPrice Pfister – plumbing fixtures; acquired in 1989 by Black & Decker\nWeiser Lock – keyless entry and door hardware\n\nAir compressors and pressure washers\nThis was sold to MAT Holdings in 2011.\n\nDeVilbiss Air Power – pneumatic tools; B & D acquired in 2004; now known as MAT Industries, LLC\n\nTools\nHusky – private-label hand tools for The Home Depot; acquired in 1986, later transferred to The Home Depot.\nVector Products – battery chargers, power inverters, and similar power products; acquired in 2007; sold to Baccus Global in 2010.\n\nNotes\nFurther reading\nWalter, John (1996). Antique & Collectible Stanley Tools: Guide to Identity & Value. Ohio: The Tool Merchant. ISBN 1-878911-02-3.\nLista\n\nExternal links\n\nOfficial website\nBusiness data for Stanley Black & Decker:",
  "clean_text": "Stanley Black & Decker, Inc., formerly known as The Stanley Works, is an American manufacturer of industrial tools and household hardware, and a provider of security products. Headquartered in the Greater Hartford city of New Britain, Connecticut, Stanley Black & Decker is the result of the merger of The Stanley Works and Black & Decker on March 12, 2010. History The Stanley Works came to existence as a direct result of the 1920 merger of Stanley's Bolt Manufactory, founded by Frederick Trent Stanley in 1843, and the Stanley Rule and Level Company, founded by Frederick's cousin, Henry Stanley, in 1857. DeWalt was acquired in 1960, and sold to Black & Decker. In March 12, 2010 Black & Decker merged with Stanley Works to become Stanley Black & Decker. It’s a wholly owned subsidiary of that company. During World War II, Stanley Works received the Army-Navy \"E\" Award for excellence in war production. In May 2002, the company considered moving its corporate headquarters to Bermuda, but public and governmental outcry forced management to reconsider the move. By August 2002, the company had decided to maintain its incorporation in the United States. John F. Lundgren was elected as chairman and chief executive officer in 2004, replacing John Trani, a former protégé of Jack Welch at General Electric. The Hardware & Home Improvement Group, including the Kwikset, Weiser, Baldwin, National Hardware, Stanley, FANAL, Pfister and EZSET brands, was acquired by Spectrum Brands Holdings, Inc. on December 17, 2012. In July 2016, CEO John F. Lundgren stepped down, with President and COO James M. Loree taking over as CEO. In July 2022, CEO James M. Loree stepped down, with President and CFO Donald Allan, Jr taking over as CEO. Three years later, Allan, Jr was succeeded by Christopher Nelson as CEO. Acquisitions 1906-7: To strengthen its position in Canada, a tool plant was opened in Roxton Pond, Quebec. The company was officially incorporated as the Stanley Tool Company of Canada, Ltd. on February 7, 1907. The Roxton Pond plant continued operations until 1984. 1937: Stanley Works entered the United Kingdom market with the acquisition of J.A. Chapman of Sheffield, England. 1946: Stanley Works acquired North Brothers Manufacturing Company in Philadelphia, Pennsylvania. 1963: Stanley started operations in Australia as Stanley-Titan when it bought a 50% share of Titan, a subsidiary of BHP. 1966: Stanley Works acquired Vidmar Cabinets in Allentown, Pennsylvania. 1970: Stanley-Titan acquired Turner Tools, based in Melbourne, Australia. 1980: Stanley Works acquired Mac Tools. 1984: Stanley Works purchased Proto from Ingersoll Rand and it becomes Stanley Proto. 1986: Stanley Works acquired Bostitch from Textron. 1990: Stanley Works acquired Goldblatt and ZAG Industries. 1990: Acquired Sidchrome Tool Co., headquartered in Melbourne, Australia. Closed plant in 1996 and started to move all tool manufacturing to Taiwan, sourcing various items from Proto in the USA (marked as Proto on items) due to supply of left-over Australian-made tools being sold out until all manufacturing was fully established in Taiwan. 1992: Stanley Works purchased the Chatsworth, California-based Monarch Mirror Door Co. Inc., an American manufacturer of sliding and folding mirror-doors. 2000: Stanley Works acquired Blick of Swindon, England, a UK integrator of security, communication, and time-management services, and CST Berger. 2002: In October, Stanley Works acquired Best Access Systems of Indianapolis, Indiana, for $310 million. The acquisition also prompted the creation of a new Access Controls Group for Stanley. Further additions to this new working group included Blick. 2004: In January, Stanley announced plans to acquire Frisco Bay Industries Ltd., a Canadian provider of security integration services, for $45.3 million. In December, the acquisition of ISR Solutions, Inc., headquartered in Washington, D.C., was announced. ISR Solutions provides the U.S. federal government and commercial customers with access security system services. 2005: In January, the acquisition of Security Group was announced. Security Group was composed of two primary operating companies: Sargent & Greenleaf, a manufacturer of locks; and Safemasters, a North American provider of security installation, maintenance and repair services. An additional acquisition of Precision Hardware was made in 2005. In the same year, Stanley Works also acquired Facom. 2006: Stanley furthered its corporate assets in the security market by acquiring HSM Electronic Protection Systems after it had been spun off from Honeywell in compliance with pre-emptive Securities and Exchange Commission antitrust rulings. In the meantime, the company obtained security contracts as the primary contractor to secure three NASA spaceflight centers. 2007: Late in the year, Stanley acquired OSI Security of Chula Vista, California, a provider of battery-operated wireless lock technology and supplies to government, education, and healthcare industries. 2008: Stanley acquired Beach Toolbox Industries, headquartered in Smith Falls, Ontario, Canada, then closed the plant. 2008: In June, Stanley announced the acquisition of Sonitrol, which provides security systems that use audio listening devices as the primary means of intrusion detection. Stanley also acquired Xmark Corporation, which provides radio frequency identification (RFID) solutions in healthcare environments. As of 2008, many of the Stanley Security Services divisions were being integrated under the HSM brand. 2009: On November 2, Stanley announced a merger with Black & Decker. The merger was completed on March 12, 2010. 2010: In July, the company announced the acquisition of CRC-Evans Pipeline International. CRC-Evans provides total project support for pipeline construction contractors with automatic welding and other pipeline construction specific equipment and personnel. 2011: On September 9, the acquisition of Niscayah was complete. 2012: On January 1, the acquisition of Lista North America from LISTA, headquartered in Holliston, Massachusetts, was completed. 2012: On June 1, the acquisition of Powers Fasteners, headquartered in Brewster, New York, was completed. 2012: On June 5, the acquisition of AeroScout, headquartered in Redwood City, California, was completed. 2016: Stanley Black & Decker announced in October that it acquired the Irwin, Lenox, and Hilmor tool brands for $1.95 billion from Newell Brands. 2017: On January 5, news reports indicated that it would acquire the Craftsman brand from KCD, LLC (a Sears Holdings subsidiary). Subsequent reports by Bloomberg indicated that the company would pay $525 million initially, an additional $250 million after three years, as well as annual payments on new Craftsman sales for 15 years. 2018: On September 12, Stanley Black & Decker announced that it had entered into a definitive agreement to acquire a 20 percent stake in MTD Products Inc, a privately held global manufacturer of outdoor power equipment, for $234 million in cash. Under the terms of the agreement, Stanley Black & Decker has the option to acquire the remaining 80 percent of MTD beginning on July 1, 2021. 2018: On August 7, Stanley Black & Decker announced it entered into a definitive agreement to acquire International Equipment Solutions Attachments Group (IES Attachments) for $690 million in cash. 2020: In Q1 2020, Stanley Black & Decker agreed to acquire Consolidated Aerospace Manufacturing, LLC (CAM) for up to $1.5 billion. CAM provides a fastener and component platform which would help the company to grow in aerospace and defense. 2021: On August 17, 2021, Stanley Black & Decker announced that it has agreed to acquire the remaining 80% ownership stake in MTD Holdings Inc. 2021: On September 13, 2021, Stanley Black & Decker announced that it would be acquiring Excel Industries; who designs and manufactures commercial and residential turf-care equipment under the Hustler Turf Equipment and BigDog Mower Co. brands. The sale was completed November 12 of the same year. 2021: On December 8, 2021, Securitas AB announced that it had entered into an agreement to purchase Stanley Black & Decker's electronic security business unit for $3.2 billion 2022: In Q3 2022, Stanley Black & Decker announced layoffs of over 1,000 corporate employees as part of cost-saving measures in response to plummeting stock price Business segments and brands Sources: Tools Power tools DeWalt – power tools; B & D acquired in 1960 Guoqiang (GQ) Tools (China) – power tools Porter-Cable – power tools; B & D acquired in 2004/2005 Oldham Saw Company – circular saw blade and wood router bit products; B & D acquired in 2004 Black+Decker – acquired (via merger) in 2010 Craftsman – acquired from Sears KDCP in 2016 Hand tools and storage Pastorino – carpentry and construction hand tools Stanley Hand Tools – carpentry and construction hand tools Black and Decker: Home appliances, power tools, hardware, batteries, fastening systems, Craftsman Irwin Industrial Tools Irwin LENOX Tools Expert – industrial and automotive tools Facom (France) – professional tools; acquired in 2006 (includes Britool) owned by Stanley Black and Decker Lista North America – industrial storage; acquired in 2012 Mac Tools – professional tools; acquired in 1980 Proto – industrial hand tools; acquired in 1984 Blackhawk – Mechanic's tools; acquired in 1986 Sidchrome (Australia/New Zealand) – mechanics' tools; acquired in 1990 USAG (Italy) – professional tools; acquired in 2010 Vidmar – industrial storage; acquired in 1966 Virax (France) – plumbing tools; acquired in 2006 Waterloo Industries – Tool Storage Solutions, purchased in 2017. Brand was discontinued shortly thereafter. Fastening and accessories Bostitch – fastening tools; acquired in 1986 Powers Fasteners – adhesive and mechanical anchors Outdoor Cub Cadet Hustler Troy-bilt Rover MTD Industrial Cribmaster Cribmaster – tool inventory, storage, tracking and usage/vending management Stanley Supply & Services – MRO products and services; formerly Contact East and Jensen Tools; renamed in 2006 Engineered fastening Emhart Teknologies – fastening and assembly; acquired in 2010; later renamed Stanley Engineered Fastening Dodge – metal-on-plastic threaded inserts Gripco – threaded fasteners HeliCoil – threaded inserts Infastech – acquired in 2013 by Stanley Engineered Fastening Avdel – blind fastening systems and related tools iForm – coated threaded fasteners MasterFix (Europe) – blind riveting Nelson – stud welding fasteners NPR/POP – riveting technology Spiralock – threaded fasteners and inserts; acquired in 2010 by Emhart Stanley Assembly Technologies – assembly line power tools Tucker – hole-less fastening Warren – custom fastening fabrication Infrastructure Hydraulic tools Dubuis – cutting, crimping, and grounding tools Horst Sprenger GmbH (Germany) – replacement consumables for scrap processing equipment LaBounty – non-impact hydraulic attachments Stanley Hydraulic Tools Stanley Oil & Gas (CRC-Evans International) – equipment used in the construction of pipelines for the oil and gas (O&G) industry Stanley – automatic doors for buildings Paladin Attachments – equipment used for excavation, farming, and various other infrastructure. Aerospace Manufacturing CAM Stanley Security Solutions (SSS) As of July 22, 2022, Stanley Security Solutions was acquired by Securitas Electronic Security and has been rebranded as Securitas Technology The North American headquarters is located in Fishers, Indiana. This division of Stanley Black & Decker comprises the following primary business units: Convergent Security Solutions Stanley Access Technologies Stanley Healthcare Solutions Likewise, Stanley Security Solutions has operations in the following global markets: Latin America Europe Asia Emerging Markets Stanley Security Solutions is provider of locks, fire sensors, security cameras, and similar hardware. They also provide software to monitor this hardware. In addition they provide computer security software to protect hardware, software, or electronic data. A partial list of Stanley Security Solutions products: Aero Scout Sargent and Greenleaf Access Control Systems Video Surveillance Systems Intrusion Alarm Monitoring Systems Sonitrol Fire Alarm Monitoring Systems Video Alarm Verification Network Security Cyber Security Retail Analytics Integrated Security Solutions Enterprise Security Solutions Divested businesses Stanley Securities In Q4 2021, Stanley Black's Commercial Electronic and Healthcare Security business lines- were sold to Securitas for $3.2 billion in cash. In 2021, the businesses were predicted to generate revenues of about $1.7 billion. Stanley Access Technologies In Q1 2022, Stanley Access Technologies were sold to Allegion for $900 million in cash. Stanley Oil & Gas In Q2 2022, Stanley Oil & Gas, comprising three business units, namely STANLEY Inspection, Pipeline Induction Heat Ltd. and CRC-Evans Pipeline International, were sold to Pipeline Technique Limited. Mechanical Access Solutions (MAS) Formerly a business unit (BU) within Stanley Security Solutions, this comprised Best Access Systems and several product brands that were sold to Dormakaba in 2016Q4. MAS was dissolved however the brand Sergeant & Greenleaf was retained by Convergent Security Solutions. Hardware and Home Improvement (HHI) These were sold to Spectrum Brands in 2012. Baldwin – acquired in 2010 Kwikset – acquired in 1989 by Black & Decker National Hardware – general hardware; acquired in 2005 Price Pfister – plumbing fixtures; acquired in 1989 by Black & Decker Weiser Lock – keyless entry and door hardware Air compressors and pressure washers This was sold to MAT Holdings in 2011. DeVilbiss Air Power – pneumatic tools; B & D acquired in 2004; now known as MAT Industries, LLC Tools Husky – private-label hand tools for The Home Depot; acquired in 1986, later transferred to The Home Depot. Vector Products – battery chargers, power inverters, and similar power products; acquired in 2007; sold to Baccus Global in 2010. Notes Further reading Walter, John (1996). Antique & Collectible Stanley Tools: Guide to Identity & Value. Ohio: The Tool Merchant. ISBN 1-878911-02-3. Lista External links"
}