{
  "ticker": "SWKS",
  "cik": "0000004127",
  "company_name": "Skyworks Solutions",
  "corrected_name": "Skyworks Solutions",
  "wiki_title_used": "Skyworks Solutions",
  "exists": true,
  "raw_text": "Skyworks Solutions, Inc. is an American semiconductor company headquartered in Irvine, California, United States. The company's shares are listed on the Nasdaq Global Select Market under the ticker symbol SWKS and is a constituent of the S&P 500.\n\nHistory\nSkyworks Solutions, Inc. was formed in 2002 through the merger of Alpha Industries and the wireless communications division of Conexant.\nIn 2009, Skyworks Solutions Inc. took over Axiom Microdevices Inc., a company that provides CMOS-based mobile phone power amplifiers, for an undisclosed amount. On October 5, 2015, Skyworks Solutions entered a definitive agreement to acquire PMC-Sierra for $2 billion in cash. However, Skyworks walked away from the deal, having been outbid by Microsemi. In 2018, Skyworks purchased Avnera for US$405 million. On April 22, 2021, Skyworks Solutions entered into a definitive agreement with Silicon Labs to acquire their Infrastructure & Automotive business for $2.75 billion. Mobile products comprised about 60% of total revenue, while Broad Markets products comprised 40% of total revenue from non-mobile markets like automotive, infrastructure and industrial.\nFrom August 3, 2015 to December 19, 2022, the company was a component of the Nasdaq-100 index.\nIn October 2025, Skyworks and American technology company Qorvo announced they would be forming a new merged entity focused on radio-frequency chips for cellphones and other electronic consumer devices, pending regulatory approval.\n\nProducts\nSkyworks products, such as low-noise and power amplifiers, connectivity switches or radio co-processors, can be used in the automotive, streaming or broadcast industry. Other products include DRM platforms for cars, RF switches as well as power management chips. A GSM power amplifier and a RF switch from Skyworks were used in the iPhone 15. Skyworks achieved IATF 16949 Automotive Certification in 2024..\n\nCorporate responsibility\nSince 2018, Skyworks aims to reduce scope 1 and 2 CO2e emissions by 30% by 2030 for its factory operations. In line with the Paris Agreement, Skyworks is trying to achieve net-zero emissions by 2050. In 2022, it wanted to achieve a 5% year-over-year rate reduction and managed to achieve 16%. Skyworks implements the ISO 14001 certified environmental management systems for its manufacturing operations for the reduction and control of its environmental impact.\n\nSee also\nComparison of open-source wireless drivers\n\nReferences\nExternal links\nOfficial website \nBusiness data for Skyworks Solutions:",
  "clean_text": "Skyworks Solutions, Inc. is an American semiconductor company headquartered in Irvine, California, United States. The company's shares are listed on the Nasdaq Global Select Market under the ticker symbol SWKS and is a constituent of the S&P 500. History Skyworks Solutions, Inc. was formed in 2002 through the merger of Alpha Industries and the wireless communications division of Conexant. In 2009, Skyworks Solutions Inc. took over Axiom Microdevices Inc., a company that provides CMOS-based mobile phone power amplifiers, for an undisclosed amount. On October 5, 2015, Skyworks Solutions entered a definitive agreement to acquire PMC-Sierra for $2 billion in cash. However, Skyworks walked away from the deal, having been outbid by Microsemi. In 2018, Skyworks purchased Avnera for US$405 million. On April 22, 2021, Skyworks Solutions entered into a definitive agreement with Silicon Labs to acquire their Infrastructure & Automotive business for $2.75 billion. Mobile products comprised about 60% of total revenue, while Broad Markets products comprised 40% of total revenue from non-mobile markets like automotive, infrastructure and industrial. From August 3, 2015 to December 19, 2022, the company was a component of the Nasdaq-100 index. In October 2025, Skyworks and American technology company Qorvo announced they would be forming a new merged entity focused on radio-frequency chips for cellphones and other electronic consumer devices, pending regulatory approval. Products Skyworks products, such as low-noise and power amplifiers, connectivity switches or radio co-processors, can be used in the automotive, streaming or broadcast industry. Other products include DRM platforms for cars, RF switches as well as power management chips. A GSM power amplifier and a RF switch from Skyworks were used in the iPhone 15. Skyworks achieved IATF 16949 Automotive Certification in 2024.. Corporate responsibility Since 2018, Skyworks aims to reduce scope 1 and 2 CO2e emissions by 30% by 2030 for its factory operations. In line with the Paris Agreement, Skyworks is trying to achieve net-zero emissions by 2050. In 2022, it wanted to achieve a 5% year-over-year rate reduction and managed to achieve 16%. Skyworks implements the ISO 14001 certified environmental management systems for its manufacturing operations for the reduction and control of its environmental impact."
}