{
  "ticker": "SYF",
  "cik": "0001601712",
  "company_name": "Synchrony Financial",
  "corrected_name": "Synchrony Financial",
  "wiki_title_used": "Synchrony Financial",
  "exists": true,
  "raw_text": "Synchrony Financial is an American consumer financial services company with its headquarters in Stamford, Connecticut, United States.  The company offers consumer financing products, including credit, promotional financing and loyalty programs, installment lending to industries and consumers through Synchrony Bank, its wholly owned online bank subsidiary.\nBrands partnered with Synchrony include Amazon, Lowe's, Guitar Center, Cathay Pacific, Rakuten, Verizon, Sleep Number, Walgreens, and Sam's Club. Synchrony owns CareCredit, a credit card for medical and veterinary expenses.\n\nHistory\nPreviously named GE Capital Retail Finance Corporation, Synchrony was incorporated in Delaware in 2003.  The company was inactive  until 2013.  Centered on co-branded credit products, Synchrony went public in July 2014 and raised $2.88 billion in its initial public offering.\nIn 2017, Synchrony acquired GPShopper.\nIn 2018, Synchrony acquired Loop Commerce, which provides a digital gifting platform called GiftNow.  The same year, it acquired  PayPal's $7.6 billion credit receivables portfolio  and became the exclusive issuer for the PayPal Credit point-of-sale financing program in the United States through 2028.  \nGIC Private Limited, the sovereign wealth fund of Singapore, owned 7.72% of Synchrony's stock in 2019. GIC exited its position in 2023.\n\nSynchrony-branded centers at public universities\nIn 2016, the University of Connecticut's School of Engineering announced the launch of Synchrony's Center of Excellence in Cybersecurity.\nIn 2018, Synchrony opened an emerging tech center at the University of Illinois.\nIn 2019, Synchrony opened the Synchrony Digital Technology Center at the University of Connecticut's Stamford campus. During the dedication of the center, the company announced a $1 million donation to the \"Connecticut Commitment\" – an initiative aimed at helping lower-income Connecticut students attend the university, tuition-free.\nSynchrony operates \"Innovation Stations\" in  Stamford, Connecticut; Chicago, Illinois; Kettering, Ohio and Hyderabad, India.\n\nConsumer Financial Protection Bureau and consumer class actions\nIn June 2014, shortly before Synchrony's New York Stock Exchange debut, the U.S. Consumer Financial Protection Bureau and the Department of Justice reached a $225 million settlement with the company after it entered into a consent decree with the Consumer Financial Protection Bureau. The settlement stated that while operating as GE Capital Bank, the company had engaged in deceptive and discriminatory credit card practices, primarily surrounding nefarious enrollment practices for add-on programs such as financial hardship relief.\nIn 2020, consumer advocacy groups urged the Consumer Financial Protection Bureau and Comptroller of the Currency to investigate the use of PayPal Credit to pay tuition at for-profit schools, where students are generally ineligible for lower-cost federal loans.  The advocacy groups classified the 24% interest rates, $40 late fees, and aggressive collection practices as \"predatory.\" \nIn May 2024, a class action suit was filed in New York alleging that CareCredit's interest rates of 32.99%  violate state usury laws.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Synchrony:",
  "clean_text": "Synchrony Financial is an American consumer financial services company with its headquarters in Stamford, Connecticut, United States. The company offers consumer financing products, including credit, promotional financing and loyalty programs, installment lending to industries and consumers through Synchrony Bank, its wholly owned online bank subsidiary. Brands partnered with Synchrony include Amazon, Lowe's, Guitar Center, Cathay Pacific, Rakuten, Verizon, Sleep Number, Walgreens, and Sam's Club. Synchrony owns CareCredit, a credit card for medical and veterinary expenses. History Previously named GE Capital Retail Finance Corporation, Synchrony was incorporated in Delaware in 2003. The company was inactive until 2013. Centered on co-branded credit products, Synchrony went public in July 2014 and raised $2.88 billion in its initial public offering. In 2017, Synchrony acquired GPShopper. In 2018, Synchrony acquired Loop Commerce, which provides a digital gifting platform called GiftNow. The same year, it acquired PayPal's $7.6 billion credit receivables portfolio and became the exclusive issuer for the PayPal Credit point-of-sale financing program in the United States through 2028. GIC Private Limited, the sovereign wealth fund of Singapore, owned 7.72% of Synchrony's stock in 2019. GIC exited its position in 2023. Synchrony-branded centers at public universities In 2016, the University of Connecticut's School of Engineering announced the launch of Synchrony's Center of Excellence in Cybersecurity. In 2018, Synchrony opened an emerging tech center at the University of Illinois. In 2019, Synchrony opened the Synchrony Digital Technology Center at the University of Connecticut's Stamford campus. During the dedication of the center, the company announced a $1 million donation to the \"Connecticut Commitment\" – an initiative aimed at helping lower-income Connecticut students attend the university, tuition-free. Synchrony operates \"Innovation Stations\" in Stamford, Connecticut; Chicago, Illinois; Kettering, Ohio and Hyderabad, India. Consumer Financial Protection Bureau and consumer class actions In June 2014, shortly before Synchrony's New York Stock Exchange debut, the U.S. Consumer Financial Protection Bureau and the Department of Justice reached a $225 million settlement with the company after it entered into a consent decree with the Consumer Financial Protection Bureau. The settlement stated that while operating as GE Capital Bank, the company had engaged in deceptive and discriminatory credit card practices, primarily surrounding nefarious enrollment practices for add-on programs such as financial hardship relief. In 2020, consumer advocacy groups urged the Consumer Financial Protection Bureau and Comptroller of the Currency to investigate the use of PayPal Credit to pay tuition at for-profit schools, where students are generally ineligible for lower-cost federal loans. The advocacy groups classified the 24% interest rates, $40 late fees, and aggressive collection practices as \"predatory.\" In May 2024, a class action suit was filed in New York alleging that CareCredit's interest rates of 32.99% violate state usury laws."
}