{
  "ticker": "SYK",
  "cik": "0000310764",
  "company_name": "Stryker Corporation",
  "corrected_name": "Stryker Corporation",
  "wiki_title_used": "Stryker Corporation",
  "exists": true,
  "raw_text": "Stryker Corporation is an American multinational medical technologies corporation based in Kalamazoo, Michigan. The company's products are used for medical surgery and neurotechnology (60% of 2024 revenues), which include surgical equipment, patient and caregiver safety technologies, endoscopy systems, and patient handling, emergency medical equipment, and intensive care disposable products, as well as neurosurgical, neurovascular and oral and maxillofacial surgery implant products; and orthopedic surgery (40% of 2024 revenues), which includes implants used in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries. Stryker's products are sold in over 75 countries and are used by 150 million patients annually. In 2024, 75% of the company's revenues came from the United States.\nThe company is ranked 195th on the Fortune 500 and 331st on the Forbes Global 2000.\n\nHistory\nIn 1941, The Orthopedic Frame Company was founded by Homer Stryker, an orthopedist from Kalamazoo, Michigan. Stryker developed the Turning Frame, a mobile hospital bed that allowed for repositioning of injured patients while providing necessary body immobility; the cast cutter, a cast cutting apparatus that removed cast material without damaging underlying tissues; and the walking heel, among others. In 1964, the company name was changed to Stryker Corporation.\nIn 1977, John W. Brown joined as president and CEO and became chairman in 1981. He transitioned to chairman in 2003. In 2009, Brown retired as chairman after 32 years with the company. Under his leadership, revenues rose from $17 million to $6.7 billion.\nIn 1979, Stryker became a public company via an initial public offering. \nIn 2003, Stephen P. MacMillan joined Stryker as president and CEO. \nIn 2007, Stryker sold its Physiotherapy Associates division to private equity firm Water Street Healthcare Partners for $150 million. \nIn February 2012, MacMillan resigned and Curt R. Hartman was named Interim Chief Executive Officer and vice president and chief financial officer. William U. Parfet was named non-executive chairman of the board. In October 2012, Kevin A. Lobo was appointed as president and chief executive officer.\nIn 2023, Stryker introduced a minimally invasive bunion treatment system, Prostep MIS Lapidus, which aims to reduce bunion recurrence, minimize scarring, and lower opioid use.\n\nAcquisitions history\nAcquisitions history\nControversies and lawsuits\nIn 2007 and 2008, the company received three FDA warning letters citing issues in compliancy.\nThe first of these, a seven-page correspondence, named various issues at an Irish manufacturing facility, such as untimely fix of failures and procedural noncompliance in the testing of failed or otherwise problem-prone devices. The second, sent November 2007, cited issues at the firm's Mahwah, New Jersey, facility, including poor fixation of hip implant components, in some instances requiring mitigation by revision surgeries; exceeded microbial level violations in the cleaning and final packaging areas of the sterile implants; and failure to institute measures in prevention of recurrence of these and other problems. The third warning letter, sent April 2008, cited issues at the firm's biotechnology facility in Hopkinton, Massachusetts related to quality and noncompliance including falsification of documents relevant to the selling of products to hospitals which are to be sold under a limited, government-mandated basis. Stryker maintains that employees involved in the falsification of documents have since been terminated.\nIn August 2010, the company paid $1.35 million to settle claims that it marketed items without regulatory approval and misled health care providers about the use of its products.\nStryker initiated a product recall on several models of medical vacuums sold under the Neptune Waste Management System brand in June and September 2012. The devices, some of which had not been cleared by the Food and Drug Administration, caused a fatal accident when the vacuum was mistakenly used to suction a passive drainage tube.\nIn 2013, the company agreed to pay $13.2 million to settle charges that it made illicit payments totaling approximately $2.2 million in Argentina, Greece, Mexico, Poland, and Romania. In 2018, the company was fined $7.8 million under the Foreign Corrupt Practices Act for failing to detect the risk of improper payments in sales of products in India, China, and Kuwait.\n\nLawsuits\nOn 2012, FDA has issued a warning for the Stryker Rejuvenate hip replacement after it was discovered that the hip replacement was considered defective and can cause similar side effects to DePuy Synthes hip implants. As a result, in 2014, Stryker was fined $1 billion and $2.5 billion, respectively, for its defective Rejuvenate and ABG II hip replacements that can cause excruciating pain.\nIn 2016, subsidiary company Stryker EMEA Supply Chain Services BV challenged the Dutch authorities' interpretation of procurement nomenclature regarding implant screws intended to be inserted in the human body. The matter was referred to the European Court of Justice for a preliminary ruling on the legal position and on the validity of the relevant EU implementing regulation.\n\nContinuation of business in Russia after the 2022 Russian invasion of Ukraine\nStryker is among companies that continue business-as-usual in Russia during the 2022 Russian invasion of Ukraine despite international sanctions during the Russian invasion of Ukraine. Research from Yale School of Management evaluating companies' reaction to the Russian invasion put Stryker in the \"Grade F\" category of \"Digging In\", meaning \"Defying Demands for Exit or Reduction of Activities.\"\n\nAwards and recognition\nStryker was recognized by Hermann Simon as a role model for other small to medium-sized business in his book Hidden Champions.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Stryker Corporation:",
  "clean_text": "Stryker Corporation is an American multinational medical technologies corporation based in Kalamazoo, Michigan. The company's products are used for medical surgery and neurotechnology (60% of 2024 revenues), which include surgical equipment, patient and caregiver safety technologies, endoscopy systems, and patient handling, emergency medical equipment, and intensive care disposable products, as well as neurosurgical, neurovascular and oral and maxillofacial surgery implant products; and orthopedic surgery (40% of 2024 revenues), which includes implants used in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries. Stryker's products are sold in over 75 countries and are used by 150 million patients annually. In 2024, 75% of the company's revenues came from the United States. The company is ranked 195th on the Fortune 500 and 331st on the Forbes Global 2000. History In 1941, The Orthopedic Frame Company was founded by Homer Stryker, an orthopedist from Kalamazoo, Michigan. Stryker developed the Turning Frame, a mobile hospital bed that allowed for repositioning of injured patients while providing necessary body immobility; the cast cutter, a cast cutting apparatus that removed cast material without damaging underlying tissues; and the walking heel, among others. In 1964, the company name was changed to Stryker Corporation. In 1977, John W. Brown joined as president and CEO and became chairman in 1981. He transitioned to chairman in 2003. In 2009, Brown retired as chairman after 32 years with the company. Under his leadership, revenues rose from $17 million to $6.7 billion. In 1979, Stryker became a public company via an initial public offering. In 2003, Stephen P. MacMillan joined Stryker as president and CEO. In 2007, Stryker sold its Physiotherapy Associates division to private equity firm Water Street Healthcare Partners for $150 million. In February 2012, MacMillan resigned and Curt R. Hartman was named Interim Chief Executive Officer and vice president and chief financial officer. William U. Parfet was named non-executive chairman of the board. In October 2012, Kevin A. Lobo was appointed as president and chief executive officer. In 2023, Stryker introduced a minimally invasive bunion treatment system, Prostep MIS Lapidus, which aims to reduce bunion recurrence, minimize scarring, and lower opioid use. Acquisitions history Acquisitions history Controversies and lawsuits In 2007 and 2008, the company received three FDA warning letters citing issues in compliancy. The first of these, a seven-page correspondence, named various issues at an Irish manufacturing facility, such as untimely fix of failures and procedural noncompliance in the testing of failed or otherwise problem-prone devices. The second, sent November 2007, cited issues at the firm's Mahwah, New Jersey, facility, including poor fixation of hip implant components, in some instances requiring mitigation by revision surgeries; exceeded microbial level violations in the cleaning and final packaging areas of the sterile implants; and failure to institute measures in prevention of recurrence of these and other problems. The third warning letter, sent April 2008, cited issues at the firm's biotechnology facility in Hopkinton, Massachusetts related to quality and noncompliance including falsification of documents relevant to the selling of products to hospitals which are to be sold under a limited, government-mandated basis. Stryker maintains that employees involved in the falsification of documents have since been terminated. In August 2010, the company paid $1.35 million to settle claims that it marketed items without regulatory approval and misled health care providers about the use of its products. Stryker initiated a product recall on several models of medical vacuums sold under the Neptune Waste Management System brand in June and September 2012. The devices, some of which had not been cleared by the Food and Drug Administration, caused a fatal accident when the vacuum was mistakenly used to suction a passive drainage tube. In 2013, the company agreed to pay $13.2 million to settle charges that it made illicit payments totaling approximately $2.2 million in Argentina, Greece, Mexico, Poland, and Romania. In 2018, the company was fined $7.8 million under the Foreign Corrupt Practices Act for failing to detect the risk of improper payments in sales of products in India, China, and Kuwait. Lawsuits On 2012, FDA has issued a warning for the Stryker Rejuvenate hip replacement after it was discovered that the hip replacement was considered defective and can cause similar side effects to DePuy Synthes hip implants. As a result, in 2014, Stryker was fined $1 billion and $2.5 billion, respectively, for its defective Rejuvenate and ABG II hip replacements that can cause excruciating pain. In 2016, subsidiary company Stryker EMEA Supply Chain Services BV challenged the Dutch authorities' interpretation of procurement nomenclature regarding implant screws intended to be inserted in the human body. The matter was referred to the European Court of Justice for a preliminary ruling on the legal position and on the validity of the relevant EU implementing regulation. Continuation of business in Russia after the 2022 Russian invasion of Ukraine Stryker is among companies that continue business-as-usual in Russia during the 2022 Russian invasion of Ukraine despite international sanctions during the Russian invasion of Ukraine. Research from Yale School of Management evaluating companies' reaction to the Russian invasion put Stryker in the \"Grade F\" category of \"Digging In\", meaning \"Defying Demands for Exit or Reduction of Activities.\" Awards and recognition Stryker was recognized by Hermann Simon as a role model for other small to medium-sized business in his book Hidden Champions."
}