{
  "ticker": "SYY",
  "cik": "0000096021",
  "company_name": "Sysco",
  "corrected_name": "Sysco",
  "wiki_title_used": "Sysco",
  "exists": true,
  "raw_text": "Sysco is an American multinational corporation that sells, markets, and distributes food products to restaurants, healthcare and educational facilities, sports stadiums, and other venues that serve food. It also sells foodservice supplies and equipment. The company is headquartered in the Energy Corridor district of Houston, Texas.\nSysco was founded in 1969 by Herbert Irving, John F. Baugh, and Harry Rosenthal. The company became public on March 3, 1970.\nSysco is the world's largest broadline food distributor. As of June 2024, the company has approximately 76,000 employees and serves 730,000 customer locations. It operates 340 distribution centers in 10 countries. In 2019 Sysco entered the UK market by purchasing Brakes and forming Sysco GB. Fortune magazine has consistently included Sysco in its annual Fortune 500 rankings of the largest companies in the United States based on total revenue. In 2024, Sysco placed 54th in these rankings.\n\nHistory\nFounding and early history\nIn 1966, Zero Foods owner John Baugh initiated discussions with the leaders of eight other food distribution companies about the prospect of forming one large corporation. The nine companies agreed to terms and formed Sysco in May 1969. At the time of the merger, the total sales of the nine companies were approximately $115 million. In March 1970, Sysco held its initial public offering.\nSysco made its first acquisition in 1970, purchasing Arrow Foods Distributor. Between 1970 and 1980, the company continued to grow through the acquisition of 25 small food distributors. It also expanded its trucking fleet and constructed refrigerated warehouses for food storage.\nIn 1980, Sysco recorded $1.2 billion in annual revenue. The following year, it moved its stock from the American Stock Exchange to the New York Stock Exchange. In 1985, Sysco was described in a New York Times report as \"the nation's leading food service marketing and distribution company.\"\n\nAcquisitions and expansion\nIn 1988, Sysco achieved nationwide coverage through its acquisition of the food distributor CFS Continental. By 1996, Sysco was the third-largest company in Houston and had over 30,000 employees. Sysco acquired Newport Meat in 1999, which at the time had sales of approximately $100 million per year. This was the company's first acquisition of a California company. Between 1995 and 2000, Sysco's annual sales increased from $12 billion to $19 billion. In 2002, Sysco expanded into the Canadian market by purchasing SERCA Foodservices for $278 million. SERCA's business was similar to Sysco's, with the Canadian company supplying food products and foodservice supplies to approximately 80,000 customers at the time of the acquisition. The following year, Sysco acquired Asian Foods, which was then the largest Asian food distribution company in North America. In 2009, Sysco made its first acquisition outside of North America, buying the Irish food distributor Pallas Foods. Further expanding its footprint in Ireland, Sysco purchased the food distributor Crossgar Foodservice for an undisclosed amount in 2012. In December 2012, Sysco acquired Appert's Foodservice, Buchy Food Service, Central Seafood Company, and Distagro.\nOn December 9, 2013, Sysco announced they were planning to acquire US Foods, their closest competitor, for a total of $3.5 billion. However, on June 24, 2015, US Federal Judge Amit Mehta ruled that the combined Sysco-US Foods would control 75% of the U.S. food service industry and would stifle competition. As a result, on June 29, 2015, Sysco terminated its merger with US Foods.\nIn February 2016, Sysco announced that it was purchasing the Brakes Group for $3.1 billion. At the time, Brakes was serving about 50,000 restaurants, hotels, and schools across Europe. In October 2017, Sysco acquired HFM FoodService, and later changed its name to Sysco Hawai'i in 2019.\nIn February 2018, Sysco acquired Doerle Food Services, a Louisiana-based foodservice. In March 2018, Sysco acquired Kent Frozen Foods. In 2020, Sysco acquired a 50% stake in Pacific Star Foodservice.\nIn May 2021, Sysco acquired Greco and Sons, a distributor of Italian specialty food products. In the September the same year, Sysco acquired Medina Foodservice. In November 2021, FreshPoint, a division of Sysco, acquired Paragon Foods. Later that year, Sysco purchased the fresh produce distributor The Coastal Companies for the purpose of supplementing both its fleet and its specialty produce business. In October 2023, Sysco announced that it was purchasing Edward Don & Company, a food service supplies and equipment distributor. This acquisition gave the company additional office and distribution space, as well as the ability to design and build kitchens for its customers.\nIn December 2023, Sysco Ireland announced plans to acquire Ready Chef Ltd.\n\nIn October 2024, Sysco acquired Scotland-based meat and fish supplier, Cambell's Prime Meat.\n\nProducts and services\nSysco sells and distributes food and non-food products to businesses that serve food, such as restaurants, healthcare facilities, sports stadiums, and schools. These goods include ingredients such as meats and produce, as well as frozen foods and prepared meals. Sysco also provides its customers with dining room supplies, kitchen equipment, and eating utensils.\nWithin its broader business, Sysco provides customers goods and expertise through its specialty divisions. For example, its FreshPoint division supplies produce to customers. In 2021, Sysco acquired Greco & Sons, an importer and distributor of Italian food products. Greco & Sons operates as an independent division within the company. Sysco offers custom kitchen building for its restaurant customers. The company also aids these customers with tasks such as menu design and the development of marketing campaigns.\nSysco owns Sygma, a subsidiary it founded in January 1984. Sygma is a food service supplier specializing in large chain restaurants. As of February 2023, Sygma was operating 15 distribution centers and delivering goods to 13,000 chain franchises throughout the United States.\nSince 2009, Sysco has worked with the World Wildlife Fund to set targets on the volume of seafood it procures from sustainable fisheries. In January 2021, Sysco announced plans to increase purchases of sustainable seafood, particularly from fisheries certified by the Marine Stewardship Council and the Aquaculture Stewardship Council. Sysco's \"One Planet. One Table.\" assortment of products, which includes approximately 3,000 food items backed by at least one of 20 sustainability certifications and standards, launched in November 2023.\nIn 2016, Sysco committed to a 10-year plan to use 100% cage-free eggs in its US supply chain by 2026.\nIn December 2021, Sysco announced its intention to cut its carbon footprint by 27.5% by 2030. In May 2022, Sysco committed to the purchase of 800 Freightliner eCascadia electric trucks. The first vehicles in this order were delivered in November 2022. In August 2022, Sysco's UK division launched its first electric delivery truck. In April 2023, the company announced the construction of an electric vehicle hub in Riverside, California. As of September 2024, the company operates 130 heavy-duty electric tractors across the US, Canada, Sweden, and the UK.\nIn February 2024, the company's UK division partnered with the foodservice technology firm Nutritics to develop a system that helps food businesses quantify the carbon footprint of the food they serve.\n\nLabor disputes and corporate practices\nIn early April 2023, Teamsters members at Sysco locations in Louisville and Indianapolis went on strike for higher wages and to end \"barbaric\" work schedules. In a Department Of Labor review in 2024, Sysco agreed to pay to settle an allegation regarding hiring discrimination against female employees. In October 2025, Teamsters at Sysco San Francisco and Portland authorized a strike for Sysco failing to produce a fair contract.\nIn the food world, Sysco is universally known for being cheap and for having the lowest quality. As one chef remarked, “When I see a Sysco truck delivering to a restaurant, I assume that they’re not trying very hard to be any good.” It’s why you hear the phrase “tonight’s dinner fell off the Sysco truck.” Sysco sells the cheapest option possible, which naturally means a downward spiral for quality. This race to the bottom is best seen in seafood. The Outlaw Ocean Project published a report in October 2023 alleging China's use of North Korean labor, with accounts of rampant sexual abuse. Following this, in January 2024 Sysco published a statement noting the suspension of all contracts with Dalian Haiquing Foods citing \"human and labor rights abuses\". An investigation by the St. Petersburg Times found that the company was selling mislabeled fish (grouper in this instance). Meanwhile, the Associated Press reported that the company sold shrimp from India processed in grueling labor conditions. The company does not generally audit its US suppliers.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Sysco: \nAsian Foods Inc.\nBusinessWeek 50 ranking and analysis of Sysco\nThe SYGMA Network, Inc.",
  "clean_text": "Sysco is an American multinational corporation that sells, markets, and distributes food products to restaurants, healthcare and educational facilities, sports stadiums, and other venues that serve food. It also sells foodservice supplies and equipment. The company is headquartered in the Energy Corridor district of Houston, Texas. Sysco was founded in 1969 by Herbert Irving, John F. Baugh, and Harry Rosenthal. The company became public on March 3, 1970. Sysco is the world's largest broadline food distributor. As of June 2024, the company has approximately 76,000 employees and serves 730,000 customer locations. It operates 340 distribution centers in 10 countries. In 2019 Sysco entered the UK market by purchasing Brakes and forming Sysco GB. Fortune magazine has consistently included Sysco in its annual Fortune 500 rankings of the largest companies in the United States based on total revenue. In 2024, Sysco placed 54th in these rankings. History Founding and early history In 1966, Zero Foods owner John Baugh initiated discussions with the leaders of eight other food distribution companies about the prospect of forming one large corporation. The nine companies agreed to terms and formed Sysco in May 1969. At the time of the merger, the total sales of the nine companies were approximately $115 million. In March 1970, Sysco held its initial public offering. Sysco made its first acquisition in 1970, purchasing Arrow Foods Distributor. Between 1970 and 1980, the company continued to grow through the acquisition of 25 small food distributors. It also expanded its trucking fleet and constructed refrigerated warehouses for food storage. In 1980, Sysco recorded $1.2 billion in annual revenue. The following year, it moved its stock from the American Stock Exchange to the New York Stock Exchange. In 1985, Sysco was described in a New York Times report as \"the nation's leading food service marketing and distribution company.\" Acquisitions and expansion In 1988, Sysco achieved nationwide coverage through its acquisition of the food distributor CFS Continental. By 1996, Sysco was the third-largest company in Houston and had over 30,000 employees. Sysco acquired Newport Meat in 1999, which at the time had sales of approximately $100 million per year. This was the company's first acquisition of a California company. Between 1995 and 2000, Sysco's annual sales increased from $12 billion to $19 billion. In 2002, Sysco expanded into the Canadian market by purchasing SERCA Foodservices for $278 million. SERCA's business was similar to Sysco's, with the Canadian company supplying food products and foodservice supplies to approximately 80,000 customers at the time of the acquisition. The following year, Sysco acquired Asian Foods, which was then the largest Asian food distribution company in North America. In 2009, Sysco made its first acquisition outside of North America, buying the Irish food distributor Pallas Foods. Further expanding its footprint in Ireland, Sysco purchased the food distributor Crossgar Foodservice for an undisclosed amount in 2012. In December 2012, Sysco acquired Appert's Foodservice, Buchy Food Service, Central Seafood Company, and Distagro. On December 9, 2013, Sysco announced they were planning to acquire US Foods, their closest competitor, for a total of $3.5 billion. However, on June 24, 2015, US Federal Judge Amit Mehta ruled that the combined Sysco-US Foods would control 75% of the U.S. food service industry and would stifle competition. As a result, on June 29, 2015, Sysco terminated its merger with US Foods. In February 2016, Sysco announced that it was purchasing the Brakes Group for $3.1 billion. At the time, Brakes was serving about 50,000 restaurants, hotels, and schools across Europe. In October 2017, Sysco acquired HFM FoodService, and later changed its name to Sysco Hawai'i in 2019. In February 2018, Sysco acquired Doerle Food Services, a Louisiana-based foodservice. In March 2018, Sysco acquired Kent Frozen Foods. In 2020, Sysco acquired a 50% stake in Pacific Star Foodservice. In May 2021, Sysco acquired Greco and Sons, a distributor of Italian specialty food products. In the September the same year, Sysco acquired Medina Foodservice. In November 2021, FreshPoint, a division of Sysco, acquired Paragon Foods. Later that year, Sysco purchased the fresh produce distributor The Coastal Companies for the purpose of supplementing both its fleet and its specialty produce business. In October 2023, Sysco announced that it was purchasing Edward Don & Company, a food service supplies and equipment distributor. This acquisition gave the company additional office and distribution space, as well as the ability to design and build kitchens for its customers. In December 2023, Sysco Ireland announced plans to acquire Ready Chef Ltd. In October 2024, Sysco acquired Scotland-based meat and fish supplier, Cambell's Prime Meat. Products and services Sysco sells and distributes food and non-food products to businesses that serve food, such as restaurants, healthcare facilities, sports stadiums, and schools. These goods include ingredients such as meats and produce, as well as frozen foods and prepared meals. Sysco also provides its customers with dining room supplies, kitchen equipment, and eating utensils. Within its broader business, Sysco provides customers goods and expertise through its specialty divisions. For example, its FreshPoint division supplies produce to customers. In 2021, Sysco acquired Greco & Sons, an importer and distributor of Italian food products. Greco & Sons operates as an independent division within the company. Sysco offers custom kitchen building for its restaurant customers. The company also aids these customers with tasks such as menu design and the development of marketing campaigns. Sysco owns Sygma, a subsidiary it founded in January 1984. Sygma is a food service supplier specializing in large chain restaurants. As of February 2023, Sygma was operating 15 distribution centers and delivering goods to 13,000 chain franchises throughout the United States. Since 2009, Sysco has worked with the World Wildlife Fund to set targets on the volume of seafood it procures from sustainable fisheries. In January 2021, Sysco announced plans to increase purchases of sustainable seafood, particularly from fisheries certified by the Marine Stewardship Council and the Aquaculture Stewardship Council. Sysco's \"One Planet. One Table.\" assortment of products, which includes approximately 3,000 food items backed by at least one of 20 sustainability certifications and standards, launched in November 2023. In 2016, Sysco committed to a 10-year plan to use 100% cage-free eggs in its US supply chain by 2026. In December 2021, Sysco announced its intention to cut its carbon footprint by 27.5% by 2030. In May 2022, Sysco committed to the purchase of 800 Freightliner eCascadia electric trucks. The first vehicles in this order were delivered in November 2022. In August 2022, Sysco's UK division launched its first electric delivery truck. In April 2023, the company announced the construction of an electric vehicle hub in Riverside, California. As of September 2024, the company operates 130 heavy-duty electric tractors across the US, Canada, Sweden, and the UK. In February 2024, the company's UK division partnered with the foodservice technology firm Nutritics to develop a system that helps food businesses quantify the carbon footprint of the food they serve. Labor disputes and corporate practices In early April 2023, Teamsters members at Sysco locations in Louisville and Indianapolis went on strike for higher wages and to end \"barbaric\" work schedules. In a Department Of Labor review in 2024, Sysco agreed to pay to settle an allegation regarding hiring discrimination against female employees. In October 2025, Teamsters at Sysco San Francisco and Portland authorized a strike for Sysco failing to produce a fair contract. In the food world, Sysco is universally known for being cheap and for having the lowest quality. As one chef remarked, “When I see a Sysco truck delivering to a restaurant, I assume that they’re not trying very hard to be any good.” It’s why you hear the phrase “tonight’s dinner fell off the Sysco truck.” Sysco sells the cheapest option possible, which naturally means a downward spiral for quality. This race to the bottom is best seen in seafood. The Outlaw Ocean Project published a report in October 2023 alleging China's use of North Korean labor, with accounts of rampant sexual abuse. Following this, in January 2024 Sysco published a statement noting the suspension of all contracts with Dalian Haiquing Foods citing \"human and labor rights abuses\". An investigation by the St. Petersburg Times found that the company was selling mislabeled fish (grouper in this instance). Meanwhile, the Associated Press reported that the company sold shrimp from India processed in grueling labor conditions. The company does not generally audit its US suppliers."
}