{
  "ticker": "TAP",
  "cik": "0000024545",
  "company_name": "Molson Coors Beverage Company",
  "corrected_name": "Molson Coors Beverage Company",
  "wiki_title_used": "Molson Coors Beverage Company",
  "exists": true,
  "raw_text": "Molson Coors Beverage Company is a Canadian-American multinational drink and brewing company headquartered in Chicago, Illinois and Montreal, Quebec.\nMolson Coors was formed in 2005 through the merger of Molson of Canada and Coors of the United States.\nIn 2016, Molson Coors acquired Miller Brewing Company for approximately US$12 billion. The agreement made Molson Coors the world's third largest brewer.\nMolson Coors is a publicly traded company on the New York Stock Exchange and has been a constituent of the S&P 500 since 2005. Its Canadian division, Molson Coors Canada is listed on the Toronto Stock Exchange.\n\nHistory\nOn July 22, 2004, Molson, Inc. and the Adolph Coors Company announced their plan to merge. The merger was completed February 9, 2005, with the merged company being named Molson Coors Brewing Company. The merger included the brands and brewing operations of the Molson Brewery and the Coors Brewing Company. Molson Brewery was started by John Molson in Montreal, Canada, in 1786. Coors Brewing Company was started by Adolph Coors in Golden, Colorado, United States, in 1873.\nMolson Coors bought Creemore Springs Brewery on April 22, 2005.\nThe operations of Molson Coors in Brazil were sold to the Mexican group FEMSA in 2006, and the beer operations of FEMSA was acquired by Heineken International in 2010.\n\nJoint venture with SABMiller\nOn October 9, 2007, SABMiller and Molson Coors Brewing Company announced a joint venture to be known as MillerCoors for their U.S. brewing and sales operations. SABMiller had 58% stake in the company, and Molson Coors had a 42% stake. MillerCoors combined their operations within North America with the headquarters in Chicago.\n\nEuropean acquisitions\nOn February 2, 2011, the company purchased Sharp's Brewery of Cornwall in England for £20 million.\nIn early 2012, the company expanded into the Central and Eastern European markets by acquiring the region's market-leading brewery StarBev from CVC Capital Partners.\n\nMiller acquisition\nIn September 2015, Anheuser-Busch Inbev announced that it had reached agreement to acquire competitor SABMiller for $107 billion. During the merger discussions between the two companies in 2015, the U.S. Department of Justice (DOJ) had agreed to the proposed deal only on the basis that SABMiller \"spins off all its MillerCoors holdings in the U.S. — which include both Miller- and Coors-held brands — along with its Miller brands outside the U.S.\"\nSABMiller agreed to divest itself of the Miller brands by selling its stake in MillerCoors to Molson Coors. The merger between Anheuser-Busch Inbev and SABMiller closed on October 10, 2016. The spinoff deal was completed on October 11, 2016. As per the agreement with the regulators, SABMiller sold to Molson Coors full ownership of the Miller Brewing Company brand portfolio.\nAfter SABMiller divested itself of all interests in MillerCoors, Molson Coors became the largest brewer in North America.\n\n2020 rebranding and restructuring\nOn October 30, 2019, the company announced it would change its name to Molson Coors Beverage Company as a part of a restructuring to take place in 2020. The name change would reflect the company's growing focus on beverages outside of the traditional beer and brewing offerings. Additionally, the company would retire the MillerCoors corporate brand name and reorganize its global business units into Molson Coors North America, headquartered in Toronto, and Molson Coors Europe, headquartered in Prague.\n\n2020 Milwaukee campus shooting\nOn February 26, 2020, six people, including the shooter, were killed at a shooting near the company's Milwaukee brewing campus. The Milwaukee complex serves as a site for some of  Molson Coors' corporate offices and brewing facilities and was in the \"Miller Valley\" area, which served as the headquarters for the Miller Brewing Company before it was acquired by Molson Coors.\n\nJoint venture with Yuengling\nOn September 15, 2020, Molson Coors and D. G. Yuengling & Son announced a joint venture to oversee the expansion of Yuengling beer into states beyond its existing footprint. Under the terms of the deal, Yuengling beers will be brewed and packaged in select Molson Coors’ breweries under Yuengling brewers’ supervision, and distributed into new markets.\n\nCoors Spirits Co\nIn 2023, Molson Coors established Coors Spirits Co., offering Five Trail Blended American Whiskey in 2021, among others.\n\nOperations\nThe company brews, markets and sells the Molson Coors portfolio of brands. Molson Coors operates breweries across the world, including the Molson Brewery in Longueuil, Quebec, Blue Moon Brewing Company in Denver, Colorado, Borsodi Brewery in Bőcs, Hungary, Coors Brewery in Golden, Colorado, Creemore Springs Brewery in Creemore, Ontario, Fraser Valley Brewery in Chilliwack, British Columbia, Leinenkugel Brewery in Chippewa Falls, Wisconsin, Miller Brewery in Milwaukee, Wisconsin, Pardubice Brewery in Pardubice, Czech Republic, Staropramen Brewery in Prague, Czech Republic, and Coors Brewers in Burton upon Trent, England.\n\nCorporate structure\nMolson Coors operates through its business units Molson Coors North America and Molson Coors Europe.\n\nManagement team\nAs of May 2022, the management consisted of the following:\n\nGavin Hattersley, President/Chief Executive Officer\nAdam Collins, Chief Communication and Corporate Affairs\nSergey Yeskov, President and CEO of Molson Coors Europe\nKevin Doyle, President of U.S. Sales and Distributor Operations\nBrian Erhardt, Chief Supply Chain Officer\nRahul Goyal, Chief Strategy Officer\nTracey Joubert, Chief Financial Officer\nFred Landtmeters, President, Molson Coors Canada\nPete Marino, President of Emerging Growth\nDave Osswald, Chief People and Diversity Officer\nAnne-Marie D’Angelo, Chief Legal and Government Affairs Officer\nMichelle St. Jacques, Chief Marketing Officer\nEugene Ubalijoro, Vice President, Central regional U.S. Sales\n\nBrands\nNotable brands include:\n\nZoa energy\n\nSee also\nReferences\nExternal links\n\nOfficial website\nBusiness data for Molson Coors Beverage Company (Class A): \nBusiness data for Molson Coors Beverage Company (Class B):",
  "clean_text": "Molson Coors Beverage Company is a Canadian-American multinational drink and brewing company headquartered in Chicago, Illinois and Montreal, Quebec. Molson Coors was formed in 2005 through the merger of Molson of Canada and Coors of the United States. In 2016, Molson Coors acquired Miller Brewing Company for approximately US$12 billion. The agreement made Molson Coors the world's third largest brewer. Molson Coors is a publicly traded company on the New York Stock Exchange and has been a constituent of the S&P 500 since 2005. Its Canadian division, Molson Coors Canada is listed on the Toronto Stock Exchange. History On July 22, 2004, Molson, Inc. and the Adolph Coors Company announced their plan to merge. The merger was completed February 9, 2005, with the merged company being named Molson Coors Brewing Company. The merger included the brands and brewing operations of the Molson Brewery and the Coors Brewing Company. Molson Brewery was started by John Molson in Montreal, Canada, in 1786. Coors Brewing Company was started by Adolph Coors in Golden, Colorado, United States, in 1873. Molson Coors bought Creemore Springs Brewery on April 22, 2005. The operations of Molson Coors in Brazil were sold to the Mexican group FEMSA in 2006, and the beer operations of FEMSA was acquired by Heineken International in 2010. Joint venture with SABMiller On October 9, 2007, SABMiller and Molson Coors Brewing Company announced a joint venture to be known as MillerCoors for their U.S. brewing and sales operations. SABMiller had 58% stake in the company, and Molson Coors had a 42% stake. MillerCoors combined their operations within North America with the headquarters in Chicago. European acquisitions On February 2, 2011, the company purchased Sharp's Brewery of Cornwall in England for £20 million. In early 2012, the company expanded into the Central and Eastern European markets by acquiring the region's market-leading brewery StarBev from CVC Capital Partners. Miller acquisition In September 2015, Anheuser-Busch Inbev announced that it had reached agreement to acquire competitor SABMiller for $107 billion. During the merger discussions between the two companies in 2015, the U.S. Department of Justice (DOJ) had agreed to the proposed deal only on the basis that SABMiller \"spins off all its MillerCoors holdings in the U.S. — which include both Miller- and Coors-held brands — along with its Miller brands outside the U.S.\" SABMiller agreed to divest itself of the Miller brands by selling its stake in MillerCoors to Molson Coors. The merger between Anheuser-Busch Inbev and SABMiller closed on October 10, 2016. The spinoff deal was completed on October 11, 2016. As per the agreement with the regulators, SABMiller sold to Molson Coors full ownership of the Miller Brewing Company brand portfolio. After SABMiller divested itself of all interests in MillerCoors, Molson Coors became the largest brewer in North America. 2020 rebranding and restructuring On October 30, 2019, the company announced it would change its name to Molson Coors Beverage Company as a part of a restructuring to take place in 2020. The name change would reflect the company's growing focus on beverages outside of the traditional beer and brewing offerings. Additionally, the company would retire the MillerCoors corporate brand name and reorganize its global business units into Molson Coors North America, headquartered in Toronto, and Molson Coors Europe, headquartered in Prague. 2020 Milwaukee campus shooting On February 26, 2020, six people, including the shooter, were killed at a shooting near the company's Milwaukee brewing campus. The Milwaukee complex serves as a site for some of Molson Coors' corporate offices and brewing facilities and was in the \"Miller Valley\" area, which served as the headquarters for the Miller Brewing Company before it was acquired by Molson Coors. Joint venture with Yuengling On September 15, 2020, Molson Coors and D. G. Yuengling & Son announced a joint venture to oversee the expansion of Yuengling beer into states beyond its existing footprint. Under the terms of the deal, Yuengling beers will be brewed and packaged in select Molson Coors’ breweries under Yuengling brewers’ supervision, and distributed into new markets. Coors Spirits Co In 2023, Molson Coors established Coors Spirits Co., offering Five Trail Blended American Whiskey in 2021, among others. Operations The company brews, markets and sells the Molson Coors portfolio of brands. Molson Coors operates breweries across the world, including the Molson Brewery in Longueuil, Quebec, Blue Moon Brewing Company in Denver, Colorado, Borsodi Brewery in Bőcs, Hungary, Coors Brewery in Golden, Colorado, Creemore Springs Brewery in Creemore, Ontario, Fraser Valley Brewery in Chilliwack, British Columbia, Leinenkugel Brewery in Chippewa Falls, Wisconsin, Miller Brewery in Milwaukee, Wisconsin, Pardubice Brewery in Pardubice, Czech Republic, Staropramen Brewery in Prague, Czech Republic, and Coors Brewers in Burton upon Trent, England. Corporate structure Molson Coors operates through its business units Molson Coors North America and Molson Coors Europe. Management team As of May 2022, the management consisted of the following: Gavin Hattersley, President/Chief Executive Officer Adam Collins, Chief Communication and Corporate Affairs Sergey Yeskov, President and CEO of Molson Coors Europe Kevin Doyle, President of U.S. Sales and Distributor Operations Brian Erhardt, Chief Supply Chain Officer Rahul Goyal, Chief Strategy Officer Tracey Joubert, Chief Financial Officer Fred Landtmeters, President, Molson Coors Canada Pete Marino, President of Emerging Growth Dave Osswald, Chief People and Diversity Officer Anne-Marie D’Angelo, Chief Legal and Government Affairs Officer Michelle St. Jacques, Chief Marketing Officer Eugene Ubalijoro, Vice President, Central regional U.S. Sales Brands Notable brands include: Zoa energy"
}