{
  "ticker": "TDG",
  "cik": "0001260221",
  "company_name": "TransDigm Group",
  "corrected_name": "TransDigm Group",
  "wiki_title_used": "TransDigm Group",
  "exists": true,
  "raw_text": "TransDigm Group Incorporated is an American publicly traded aerospace manufacturing company headquartered in Cleveland, Ohio. TransDigm develops and manufactures engineered aerospace components. It was founded in 1993, when four industrial aerospace companies were combined by a private equity firm in a leveraged buyout. TransDigm expanded the range of aerospace components it manufactures through acquisitions over the years. It filed an  initial public offering on the New York Stock Exchange in 2006.\n\nCorporate history\nEarly history\nTransDigm was formed in 1993 under the name TD Holding Corporation. It was founded with an initial equity investment of $10 million. The company was created by founders W. Nicholas Howley and Douglas Peacock, along with private equity firm Kelso & Company, in order to acquire and consolidate four industrial aerospace companies from IMO Industries Inc. in a leveraged buyout. Those four companies were Adel Fasteners, Aero Products Component Services, Controlex Corporation and Wiggins Connectors. Once the acquisitions were completed, TD Holding was renamed to TransDigm, Inc. and based in Richmond Heights, Ohio.\nOriginally, TransDigm manufactured and marketed a small group of aircraft components, such as batteries, pumps and fuel connectors. TransDigm expanded its range of aircraft component products over time through acquisitions of other aerospace component manufacturers, growing in revenues by about 25% per-year from 1993 to 1998. In 1998, Odyssey Investment Partners, a private equity firm, acquired TransDigm from Kelso & Company. After the September 11th attacks, the aerospace industry declined temporarily, resulting in losses and layoffs for TransDigm.\nBy 2002, TransDigm had grown to $300 million in annual revenues, up from $131 million in 1999. TransDigm was acquired from Odyssey Investment Partners by another private equity firm, Warburg Pincus, in 2003 for $1.1 billion. In 2006, the company went public on the New York Stock Exchange. By the following year, TransDigm had grown to $593 million in annual revenues.\n\nAcquisitions\nTransDigm focuses largely on acquiring other aerospace component manufacturers for expansion and growth. The company acquired more than 60 businesses in its first 25 years of operations, 49 of which were completed after TransDigm's initial public offering in 2006.\nIn 2010, TransDigm acquired competing aftermarket aerospace parts company McKechnie Aerospace Holdings for $1.27 billion. In 2016, it bought Data Device Corp., a power, networking and electronics company, for $1 billion. Two years later, TransDigm purchased a competing parts manufacturer, Esterline, for $4 billion.  This was the largest acquisition in TransDigm's history.\nIn March 2022, TransDigm acquired the Montreal-based helicopter mission equipment company, DART Aerospace for approximately $360 million in cash.\nIn May 2023, TransDigm acquired aviation and transportation research company Calspan for $725 million.\nIn November 2023, TransDigm acquired Electron Device Business of Communications & Power Industries for $1.39 billion.\n\nProducts\nTransDigm's subsidiaries manufacture engineered aircraft components. These components include items like pumps, valves and avionics. Most of the aerospace parts the company sells are proprietary products where TransDigm is the only manufacturer that currently makes the part. As of 2016, about half of its revenues are from aftermarket parts and half are from OEM parts. As of 2008, about three-fourths of its revenues were from commercial aircraft parts and one-fourth was from military aircraft parts.\nTransDigm's products fall into three segments. Power and control products, such as pumps, valves and ignition systems, account for about half of TransDigm's revenue. Airframe products like latching and locking devices, cockpit security components and audio systems, account for most of the other half of TransDigm's revenues. A smaller portion of the company's business is from non-aviation products, such as restraints, space systems and parts for heavy industrial equipment.\n\nAccusations of price gouging\nIn 2019, the Department of Defense audited TransDigm's pricing practices for government contracts. It concluded that the Pentagon was purchasing parts from TransDigm at very high profit margins, such as a 9,400% markup on a metal pin. According to the authors of Lessons from the Titans, this is because older aerospace components are not expensive to produce individually, but require keeping expensive dated manufacturing lines active for small-batch production. After a congressional hearing criticizing TransDigm's pricing practices, the company agreed to refund the Pentagon $16 million.\nTransDigm's revenues grew by 15-fold from TransDigm's IPO in 2006 to 2020. However, business declined in 2020 due to the COVID-19 pandemic's impact on the aerospace industry.\nIn 2022, founder Nick Howley was again called to testify before Congress on accusations of price gouging. A Department of Defense review alleged that the company charged $119 million for parts that should have cost $28 million, with an earlier 2021 report alleging that TransDigm made an excess profit of $20.8 million on 105 spare parts on 150 contracts. \nThe company's practices and position have also reached the commercial aviation industry, ranging from employees to executives within the aviation industry. A former employee of AvtechTyee, a firm later acquired by TransDigm, commented on how airlines are stuck with TransDigm's parts with a refusal to utilize the company equating to an airline's plane not flying. Concurring on the situation was  Abdol Moabery, CEO of the aircraft maintenance company GA Telesis, TransDigm's pricing practices have made it costlier for airlines to repair their planes, with aircraft manufacturers like Boeing and Airbus often caught in the middle when TransDigm acquires companies that Boeing contracted with to make its parts. TransDigm counterargues, though, that its pricing practices are justified when considering its efforts to ensure that planes always fly safely, and that the sting is necessary to continue providing quality service.\n\nReferences\nExternal links\nBusiness data for TransDigm Group:",
  "clean_text": "TransDigm Group Incorporated is an American publicly traded aerospace manufacturing company headquartered in Cleveland, Ohio. TransDigm develops and manufactures engineered aerospace components. It was founded in 1993, when four industrial aerospace companies were combined by a private equity firm in a leveraged buyout. TransDigm expanded the range of aerospace components it manufactures through acquisitions over the years. It filed an initial public offering on the New York Stock Exchange in 2006. Corporate history Early history TransDigm was formed in 1993 under the name TD Holding Corporation. It was founded with an initial equity investment of $10 million. The company was created by founders W. Nicholas Howley and Douglas Peacock, along with private equity firm Kelso & Company, in order to acquire and consolidate four industrial aerospace companies from IMO Industries Inc. in a leveraged buyout. Those four companies were Adel Fasteners, Aero Products Component Services, Controlex Corporation and Wiggins Connectors. Once the acquisitions were completed, TD Holding was renamed to TransDigm, Inc. and based in Richmond Heights, Ohio. Originally, TransDigm manufactured and marketed a small group of aircraft components, such as batteries, pumps and fuel connectors. TransDigm expanded its range of aircraft component products over time through acquisitions of other aerospace component manufacturers, growing in revenues by about 25% per-year from 1993 to 1998. In 1998, Odyssey Investment Partners, a private equity firm, acquired TransDigm from Kelso & Company. After the September 11th attacks, the aerospace industry declined temporarily, resulting in losses and layoffs for TransDigm. By 2002, TransDigm had grown to $300 million in annual revenues, up from $131 million in 1999. TransDigm was acquired from Odyssey Investment Partners by another private equity firm, Warburg Pincus, in 2003 for $1.1 billion. In 2006, the company went public on the New York Stock Exchange. By the following year, TransDigm had grown to $593 million in annual revenues. Acquisitions TransDigm focuses largely on acquiring other aerospace component manufacturers for expansion and growth. The company acquired more than 60 businesses in its first 25 years of operations, 49 of which were completed after TransDigm's initial public offering in 2006. In 2010, TransDigm acquired competing aftermarket aerospace parts company McKechnie Aerospace Holdings for $1.27 billion. In 2016, it bought Data Device Corp., a power, networking and electronics company, for $1 billion. Two years later, TransDigm purchased a competing parts manufacturer, Esterline, for $4 billion. This was the largest acquisition in TransDigm's history. In March 2022, TransDigm acquired the Montreal-based helicopter mission equipment company, DART Aerospace for approximately $360 million in cash. In May 2023, TransDigm acquired aviation and transportation research company Calspan for $725 million. In November 2023, TransDigm acquired Electron Device Business of Communications & Power Industries for $1.39 billion. Products TransDigm's subsidiaries manufacture engineered aircraft components. These components include items like pumps, valves and avionics. Most of the aerospace parts the company sells are proprietary products where TransDigm is the only manufacturer that currently makes the part. As of 2016, about half of its revenues are from aftermarket parts and half are from OEM parts. As of 2008, about three-fourths of its revenues were from commercial aircraft parts and one-fourth was from military aircraft parts. TransDigm's products fall into three segments. Power and control products, such as pumps, valves and ignition systems, account for about half of TransDigm's revenue. Airframe products like latching and locking devices, cockpit security components and audio systems, account for most of the other half of TransDigm's revenues. A smaller portion of the company's business is from non-aviation products, such as restraints, space systems and parts for heavy industrial equipment. Accusations of price gouging In 2019, the Department of Defense audited TransDigm's pricing practices for government contracts. It concluded that the Pentagon was purchasing parts from TransDigm at very high profit margins, such as a 9,400% markup on a metal pin. According to the authors of Lessons from the Titans, this is because older aerospace components are not expensive to produce individually, but require keeping expensive dated manufacturing lines active for small-batch production. After a congressional hearing criticizing TransDigm's pricing practices, the company agreed to refund the Pentagon $16 million. TransDigm's revenues grew by 15-fold from TransDigm's IPO in 2006 to 2020. However, business declined in 2020 due to the COVID-19 pandemic's impact on the aerospace industry. In 2022, founder Nick Howley was again called to testify before Congress on accusations of price gouging. A Department of Defense review alleged that the company charged $119 million for parts that should have cost $28 million, with an earlier 2021 report alleging that TransDigm made an excess profit of $20.8 million on 105 spare parts on 150 contracts. The company's practices and position have also reached the commercial aviation industry, ranging from employees to executives within the aviation industry. A former employee of AvtechTyee, a firm later acquired by TransDigm, commented on how airlines are stuck with TransDigm's parts with a refusal to utilize the company equating to an airline's plane not flying. Concurring on the situation was Abdol Moabery, CEO of the aircraft maintenance company GA Telesis, TransDigm's pricing practices have made it costlier for airlines to repair their planes, with aircraft manufacturers like Boeing and Airbus often caught in the middle when TransDigm acquires companies that Boeing contracted with to make its parts. TransDigm counterargues, though, that its pricing practices are justified when considering its efforts to ensure that planes always fly safely, and that the sting is necessary to continue providing quality service."
}