{
  "ticker": "TDY",
  "cik": "0001094285",
  "company_name": "Teledyne Technologies",
  "corrected_name": "Teledyne Technologies",
  "wiki_title_used": "Teledyne Technologies",
  "exists": true,
  "raw_text": "Teledyne Technologies Incorporated is an American industrial conglomerate. It was founded in 1960, as Teledyne, Inc. by Henry Singleton and George Kozmetsky.\nFrom August 1996 to November 1999, Teledyne existed as part of the conglomerate Allegheny Teledyne Incorporated – a combination of the former Teledyne, Inc. and the former Allegheny Ludlum Corporation. On November 29, 1999, three separate entities, Teledyne Technologies, Allegheny Technologies, and  Water Pik Technologies, were spun off as free-standing public companies. Allegheny Technologies retained several companies of the former Teledyne, Inc. that fit with Allegheny's core business of steel and exotic metals production.\nAt various times, Teledyne, Inc. owned more than 150 companies with interests as varied as insurance, dental appliances, specialty metals, and aerospace electronics, but many of these had been divested prior to the merger with Allegheny. The new Teledyne Technologies was initially composed of 19 companies that were earlier in Teledyne, Inc. By 2011, Teledyne Technologies had grown to include nearly 100 companies.\n\nSegments\nTeledyne Technologies operates with four major segments: Digital Imaging, Instrumentation, Engineered Systems, and Aerospace and Defense Electronics.\n\nDigital imaging\nThis segment handles sponsored and central research laboratories for a range of new technologies, as well as development and production efforts in digital imaging products for government applications. Included are infrared detectors, cameras, and opto-mechanical assemblies.\n\nInstrumentation\nThis segment provides monitoring and control instruments for marine, environmental, scientific, industrial, and defense applications as well as harsh environment interconnect products.\n\nEngineered systems\nThis segment provides systems engineering and integration, advanced technology application, software development, and parts to space, military, environmental, energy, chemical, biological and nuclear systems, and missile defense requirements. It also designs and manufactures hydrogen gas generators, thermoelectric and fuel-based power sources, and small turbine engines.\n\nAerospace and defense electronics\nThis segment provides complex electronic components and subsystems for communication products, including defense electronics, data acquisition and communications equipment for air transport and business aircraft, and components and subsystems for wireless and satellite communications, as well as general aviation batteries.\n\nCompanies\nAs of April 2022, Teledyne Technologies listed the following companies:\n\nSome companies previously in Teledyne Technologies include the following:\n\nAcoustic Research (formerly Teledyne AR Loudspeakers)\nContinental Aerospace Technologies (formerly Continental Motors, Inc., Teledyne Continental Motors, Teledyne Aerosance, Teledyne Piston Engines)\nLaars (formerly Teledyne Laars)\nMattituck Services (formerly Teledyne Mattituck Services)\nRyan Aeronautical (formerly Teledyne Ryan Aeronautical)\nTeledyne Readco\nWisconsin Motor Manufacturing Company (formerly Teledyne Wisconsin Motors, Teledyne Total Power)\n\nHistory\nIn June 1960, Henry Singleton and George Kozmetsky, both previously executives with Litton Industries, formed a firm named Instrument Systems located in Beverly Hills, California. Arthur Rock, one of America's first and most successful venture capitalists, financed the startup with a $450,000 investment. Their basic plan was to build a major firm centering on microelectronics and control system development, primarily through acquiring existing companies.\n\nEarly years\nIn October 1960, the first acquisition was made by purchasing the majority of stock in Amelco, a small electronics manufacturing plant. Within a short time, rights to the name Teledyne and its associated logo were bought. In addition to Amelco, two other electronics manufacturing firms were acquired, and by the end of 1960, Teledyne had about 400 employees and 80,000 square feet (7,400 m2) of floor space devoted to engineering development and manufacturing. Teledyne stock was first offered to the public in May 1961. During its first full fiscal year of operations ending in October 1961, Teledyne had sales of $4,491,000 with a net income of $58,000.\nTeledyne’s growth continued in 1962, with the acquisition of companies primarily through equity agreements. Internally, Teledyne Systems was formed as the centerpiece of the firm’s aerospace systems business, diversifying the business base into government contracts with NASA and the U.S. Department of Defense (DoD). By the end of the second fiscal year, Teledyne sales had increased 230 percent and net income by about 570 percent.\nOver the next three years, new companies were acquired in microwave and power electrical products – including the first consumer products. Teledyne Controls was established, moving the Company into the field of hydraulics. Teledyne entered the optics field with the acquisition of Kiernan Optics, producing windows for the Apollo spacecraft and infrared optical domes for missiles.\nIn early 1965, Teledyne had a major breakthrough in winning a large contract from the U.S. Navy for the Integrated Helicopter Avionics System (IHAS), giving Teledyne a name in the military market. This caused a major jump in the stock price, from $15 to $65. By the end of the fiscal year, Teledyne had acquired 34 companies, sales were $86.5 million with net income of $3.4 million, there were about 5,400 employees, assets reached $66.5 million, and there were near 8 million outstanding shares of stock.\n\nMajor growth years\nA new era for Teledyne started in 1966. In June, Kozmetsky left to become dean of the School of Business Administration at the University of Texas. In July, Vanadium-Alloy Steel Company (Vasco), including its subsidiary Allvac, was merged into Teledyne. This expanded the company into the Eastern U.S. and started the formation of material technologies as a major business activity of Teledyne. With the merger, Singleton turned his position of president over to George A. Roberts, a close friend from Naval Academy days, who had headed Vasco.\nSingleton, now assisted by Roberts, continued in acquiring new companies. In 1967, one of the largest of these was Brown Engineering, a firm with about 3,500 employees headquartered in Huntsville, Alabama. With NASA and DoD contracts for engineering services and research, Brown Engineering added a new line of business for Teledyne. Ryan Aeronautical in San Diego, was acquired in 1968. Continental Motors was primarily owned by Ryan, and this acquisition brought Teledyne into the piston-powered engine business with both commercial and military customers.\nIn the remainder of the 1960s, Teledyne acquired some 90 more companies. A number of these businesses were in consumer products, such as Water Pik, Acoustic Research with high-fidelity speakers, and Olson Electronics, a mail order retailer founded in 1927, in Akron, Ohio, as Olson Co., by Irving, later including brothers, Sidney and Philip, that operated retail stores across America. Packard Bell Corporation had both consumer and government sales in computers and television receivers. A number of electronic product lines and smaller acquisitions were consolidated in Teledyne Electronics and Teledyne Microelectronic Technologies. Two acquired firms, Geophysical Exploration and Geotronics, brought Teledyne into off-shore drilling and earth-science instrumentation fields. Twenty-one acquired companies were in the metals business, including Wah Chang Corporation and Cast Products, and this led to the acquisition of firms producing industrial machines and machine tools. Other diverse acquisitions included Monarch Rubber, Sewart Seacraft, Isotopes, Radar Relays, Getz Dental, and the agreement with Subaru to market Wisconsin engines.\nSingleton also added a diverse group of financial institutions, giving Teledyne contact and intimacy with the capital world. These included thrift and loan banks and insurance firms dealing with property, workers compensation, casualty, and life insurance. Most of the insurance investments were later consolidated into the Argonaut and Unitrin subsidiaries, and were ultimately spun off as independent companies.\nTeledyne was divided into groups, and by the end of the 1960s, there were 16 groups with 94 profit centers in 120 locations. Company presidents were given considerable freedom in their operations, but corporate maintained close financial control and capital management. Teledyne sales in 1969 were $2.7 billion and net income was $372 million. The stock had a 2-for-1 split during 1967 and the same split in 1969.\nAs Teledyne moved into its second decade, some 150 firms had been acquired. Singleton then essentially stopped direct acquisition of companies and began investments in stock of technical firms. By the end of the second decade, Teledyne owned 31 percent of Curtiss-Wright, 24 percent of Litton, as well as significant portions of a number of other well-known companies. This stock was mainly held by the insurance subsidiaries.\nDuring the recession of the early 1970s, Teledyne stock fell from about $40 to less than $8; Singleton saw this as an opportunity to buy back Teledyne stock. In buybacks from October 1972 to February 1976, 22 million shares were repurchased at $14 to $40 – well above the market price. This raised the value of Teledyne stock, eventually increasing to near $175 at the end of the decade. In this period, annual income increased by 89 percent and net income by 315 percent. Stockholders who had remained through the buyback achieved a phenomenal gain of about 3,000 percent.\n\nPeak and decline\nGoing into its third decade, Teledyne sales passed the $3 billion mark in 1980, with industrial products leading in both sales and net income. In the race between the U.S. and the Soviet Union, government sales reached almost $800 million. The first significant slump in Teledyne business began in 1985. Sales for 1984 had been about $3.49 billion, but decreased to around $3.26 billion the next year and remained essentially flat for the remainder of the decade.\nIn April 1986, Singleton, who was then 69 years old, turned the position of CEO over to Roberts, but remained as Board Chairman. During 1988, Teledyne faced a number of legal problems, none of which were the direct result of wrongdoings of Singleton or Roberts. After agreeing to plead guilty to officials in Teledyne Electronics having made false statements, Teledyne was fined $17.5 million.\nAfter guiding Teledyne for 29 years, Singleton retired as an employee and officer in April 1989. Nevertheless, that was a peak year for Teledyne sales ($3.53 billion) and earnings ($392 million). Teledyne stock price reached $388.88. Total employment also peaked at near 43,000.\nHenry Singleton retired as Teledyne Chairman in 1991, and was replaced by George Roberts; William P. Rutledge was named president and CEO. Roberts then retired in 1993 and was replaced by Rutledge; Donald B. Rice, previously Secretary of the U.S. Air Force, was then named president and CEO. Many companies had been sold during the prior several years, and in 1993, through consolidations, the number was further reduced from 65 to 18. In January 1995, Teledyne Electronic Systems was sold to Litton Industries, essentially ending the business on which Teledyne had originally been formed.\nIn the early 1990s, while the company underwent these turnovers in leadership, two lawsuits were brought against Teledyne by whistleblowers under the False Claims Act. The suits charged the company with falsifying test reports for relay devices sold to the US government for weapons and spacecraft use, and with padding government contract cost estimates. In April 1994, Teledyne settled both cases for $112.5 million, at the time one of the largest settlements by military contractors in a qui tam case.\nIn late 1994, Teledyne was subjected to a hostile takeover attempt by WHX Corporation. This was successfully challenged, but the Teledyne pension fund had a surplus of $928 million and this was of wide interest. To forestall further hostile takeovers, Allegheny Ludlum, a steel and specialty metal firm, offered to serve as a white knight friendly acquirer. On August 15, 1996, an agreement was reached to merge Teledyne with Allegheny Ludlum, forming Allegheny Teledyne, Inc. (ATI), with headquarters in Pittsburgh, Pennsylvania.\nAfter some reorganization, ATI operated with three segments: Aerospace and Electronics, Specialty Metals, and Consumer Products. The former Teledyne high-technology companies were mainly in the A&E Segment, led by Robert Mehrabian. ATI eventually decided to spin off the segments into independent entities, and on November 29, 1999, Teledyne Technologies Incorporated, Allegheny Technologies Incorporated, and Water Pik Technologies, Inc., were formed.\n\n21st century renewal\nWith Robert Mehrabian as chairman, CEO, and president, Teledyne Technologies (or simply Teledyne, as it is most often called) was initially composed of 19 companies, all dating (in some form) from the original Teledyne, Inc. There were about 5,800 employees, including some 1,400 engineers and scientists. One of these companies, Ryan Aeronautical, was sold to Northrop Grumman before the end of 1999 to raise initial operating capital.\nIn November 1999, Teledyne acquired certain assets of Mattituck Aviation Corporation, a privately owned aftermarket supplier and piston engine rebuilder and overhauler to the general aviation marketplace.\nHeadquarters was initially in the Century City district of Los Angeles, but was later moved to one of the city's suburbs, Thousand Oaks.  The Thousand Oaks location was the site of the Rockwell Scientific Company (formerly Rockwell International Science Center).  Teledyne acquired Rockwell Scientific in 2006, and continued doing scientific and industrial research at the site (as Teledyne Scientific Company), in addition to having its corporate offices there.\nIn 2000, its first full year of operation, Teledyne Technologies had sales of $795.1 million and net income of $40.5 million. The renewed Teledyne operated in much the same manner as Singleton’s early Teledyne, functioning as a conglomerate with growth mainly due to acquisitions. In 2010, the sales were $1,644.2 million with net income of $120.5 million, a cumulative financial growth in the decade of approximately 100 percent. About 44 percent of the 2010 sales were derived from contracts with agencies of, or prime contractors to, the U.S. government. By the start of 2011, there were near 100 companies, functioning in a wide range of products and services.\nTeledyne reported third quarter 2019 net sales of $802.2 million, a 10.6% increase compared to 2018.\nOn 4 January 2021, it was announced Teledyne Technologies would acquire FLIR Systems for $8 billion.\nIn 2021, Teledyne MEMS, which is in part composed by Teledyne DALSA, was ranked second in global revenues in the MEMS field.\nIn October 2023, Teledyne Technologies acquired Xena Networks, a high-speed terabit Ethernet validation, assurance, and production test solutions provider.\nTeledyne Technologies was sanctioned by the Chinese government on December 5, 2024 due to arm sales to Taiwan.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Teledyne Technologies, Inc.:",
  "clean_text": "Teledyne Technologies Incorporated is an American industrial conglomerate. It was founded in 1960, as Teledyne, Inc. by Henry Singleton and George Kozmetsky. From August 1996 to November 1999, Teledyne existed as part of the conglomerate Allegheny Teledyne Incorporated – a combination of the former Teledyne, Inc. and the former Allegheny Ludlum Corporation. On November 29, 1999, three separate entities, Teledyne Technologies, Allegheny Technologies, and Water Pik Technologies, were spun off as free-standing public companies. Allegheny Technologies retained several companies of the former Teledyne, Inc. that fit with Allegheny's core business of steel and exotic metals production. At various times, Teledyne, Inc. owned more than 150 companies with interests as varied as insurance, dental appliances, specialty metals, and aerospace electronics, but many of these had been divested prior to the merger with Allegheny. The new Teledyne Technologies was initially composed of 19 companies that were earlier in Teledyne, Inc. By 2011, Teledyne Technologies had grown to include nearly 100 companies. Segments Teledyne Technologies operates with four major segments: Digital Imaging, Instrumentation, Engineered Systems, and Aerospace and Defense Electronics. Digital imaging This segment handles sponsored and central research laboratories for a range of new technologies, as well as development and production efforts in digital imaging products for government applications. Included are infrared detectors, cameras, and opto-mechanical assemblies. Instrumentation This segment provides monitoring and control instruments for marine, environmental, scientific, industrial, and defense applications as well as harsh environment interconnect products. Engineered systems This segment provides systems engineering and integration, advanced technology application, software development, and parts to space, military, environmental, energy, chemical, biological and nuclear systems, and missile defense requirements. It also designs and manufactures hydrogen gas generators, thermoelectric and fuel-based power sources, and small turbine engines. Aerospace and defense electronics This segment provides complex electronic components and subsystems for communication products, including defense electronics, data acquisition and communications equipment for air transport and business aircraft, and components and subsystems for wireless and satellite communications, as well as general aviation batteries. Companies As of April 2022, Teledyne Technologies listed the following companies: Some companies previously in Teledyne Technologies include the following: Acoustic Research (formerly Teledyne AR Loudspeakers) Continental Aerospace Technologies (formerly Continental Motors, Inc., Teledyne Continental Motors, Teledyne Aerosance, Teledyne Piston Engines) Laars (formerly Teledyne Laars) Mattituck Services (formerly Teledyne Mattituck Services) Ryan Aeronautical (formerly Teledyne Ryan Aeronautical) Teledyne Readco Wisconsin Motor Manufacturing Company (formerly Teledyne Wisconsin Motors, Teledyne Total Power) History In June 1960, Henry Singleton and George Kozmetsky, both previously executives with Litton Industries, formed a firm named Instrument Systems located in Beverly Hills, California. Arthur Rock, one of America's first and most successful venture capitalists, financed the startup with a $450,000 investment. Their basic plan was to build a major firm centering on microelectronics and control system development, primarily through acquiring existing companies. Early years In October 1960, the first acquisition was made by purchasing the majority of stock in Amelco, a small electronics manufacturing plant. Within a short time, rights to the name Teledyne and its associated logo were bought. In addition to Amelco, two other electronics manufacturing firms were acquired, and by the end of 1960, Teledyne had about 400 employees and 80,000 square feet (7,400 m2) of floor space devoted to engineering development and manufacturing. Teledyne stock was first offered to the public in May 1961. During its first full fiscal year of operations ending in October 1961, Teledyne had sales of $4,491,000 with a net income of $58,000. Teledyne’s growth continued in 1962, with the acquisition of companies primarily through equity agreements. Internally, Teledyne Systems was formed as the centerpiece of the firm’s aerospace systems business, diversifying the business base into government contracts with NASA and the U.S. Department of Defense (DoD). By the end of the second fiscal year, Teledyne sales had increased 230 percent and net income by about 570 percent. Over the next three years, new companies were acquired in microwave and power electrical products – including the first consumer products. Teledyne Controls was established, moving the Company into the field of hydraulics. Teledyne entered the optics field with the acquisition of Kiernan Optics, producing windows for the Apollo spacecraft and infrared optical domes for missiles. In early 1965, Teledyne had a major breakthrough in winning a large contract from the U.S. Navy for the Integrated Helicopter Avionics System (IHAS), giving Teledyne a name in the military market. This caused a major jump in the stock price, from $15 to $65. By the end of the fiscal year, Teledyne had acquired 34 companies, sales were $86.5 million with net income of $3.4 million, there were about 5,400 employees, assets reached $66.5 million, and there were near 8 million outstanding shares of stock. Major growth years A new era for Teledyne started in 1966. In June, Kozmetsky left to become dean of the School of Business Administration at the University of Texas. In July, Vanadium-Alloy Steel Company (Vasco), including its subsidiary Allvac, was merged into Teledyne. This expanded the company into the Eastern U.S. and started the formation of material technologies as a major business activity of Teledyne. With the merger, Singleton turned his position of president over to George A. Roberts, a close friend from Naval Academy days, who had headed Vasco. Singleton, now assisted by Roberts, continued in acquiring new companies. In 1967, one of the largest of these was Brown Engineering, a firm with about 3,500 employees headquartered in Huntsville, Alabama. With NASA and DoD contracts for engineering services and research, Brown Engineering added a new line of business for Teledyne. Ryan Aeronautical in San Diego, was acquired in 1968. Continental Motors was primarily owned by Ryan, and this acquisition brought Teledyne into the piston-powered engine business with both commercial and military customers. In the remainder of the 1960s, Teledyne acquired some 90 more companies. A number of these businesses were in consumer products, such as Water Pik, Acoustic Research with high-fidelity speakers, and Olson Electronics, a mail order retailer founded in 1927, in Akron, Ohio, as Olson Co., by Irving, later including brothers, Sidney and Philip, that operated retail stores across America. Packard Bell Corporation had both consumer and government sales in computers and television receivers. A number of electronic product lines and smaller acquisitions were consolidated in Teledyne Electronics and Teledyne Microelectronic Technologies. Two acquired firms, Geophysical Exploration and Geotronics, brought Teledyne into off-shore drilling and earth-science instrumentation fields. Twenty-one acquired companies were in the metals business, including Wah Chang Corporation and Cast Products, and this led to the acquisition of firms producing industrial machines and machine tools. Other diverse acquisitions included Monarch Rubber, Sewart Seacraft, Isotopes, Radar Relays, Getz Dental, and the agreement with Subaru to market Wisconsin engines. Singleton also added a diverse group of financial institutions, giving Teledyne contact and intimacy with the capital world. These included thrift and loan banks and insurance firms dealing with property, workers compensation, casualty, and life insurance. Most of the insurance investments were later consolidated into the Argonaut and Unitrin subsidiaries, and were ultimately spun off as independent companies. Teledyne was divided into groups, and by the end of the 1960s, there were 16 groups with 94 profit centers in 120 locations. Company presidents were given considerable freedom in their operations, but corporate maintained close financial control and capital management. Teledyne sales in 1969 were $2.7 billion and net income was $372 million. The stock had a 2-for-1 split during 1967 and the same split in 1969. As Teledyne moved into its second decade, some 150 firms had been acquired. Singleton then essentially stopped direct acquisition of companies and began investments in stock of technical firms. By the end of the second decade, Teledyne owned 31 percent of Curtiss-Wright, 24 percent of Litton, as well as significant portions of a number of other well-known companies. This stock was mainly held by the insurance subsidiaries. During the recession of the early 1970s, Teledyne stock fell from about $40 to less than $8; Singleton saw this as an opportunity to buy back Teledyne stock. In buybacks from October 1972 to February 1976, 22 million shares were repurchased at $14 to $40 – well above the market price. This raised the value of Teledyne stock, eventually increasing to near $175 at the end of the decade. In this period, annual income increased by 89 percent and net income by 315 percent. Stockholders who had remained through the buyback achieved a phenomenal gain of about 3,000 percent. Peak and decline Going into its third decade, Teledyne sales passed the $3 billion mark in 1980, with industrial products leading in both sales and net income. In the race between the U.S. and the Soviet Union, government sales reached almost $800 million. The first significant slump in Teledyne business began in 1985. Sales for 1984 had been about $3.49 billion, but decreased to around $3.26 billion the next year and remained essentially flat for the remainder of the decade. In April 1986, Singleton, who was then 69 years old, turned the position of CEO over to Roberts, but remained as Board Chairman. During 1988, Teledyne faced a number of legal problems, none of which were the direct result of wrongdoings of Singleton or Roberts. After agreeing to plead guilty to officials in Teledyne Electronics having made false statements, Teledyne was fined $17.5 million. After guiding Teledyne for 29 years, Singleton retired as an employee and officer in April 1989. Nevertheless, that was a peak year for Teledyne sales ($3.53 billion) and earnings ($392 million). Teledyne stock price reached $388.88. Total employment also peaked at near 43,000. Henry Singleton retired as Teledyne Chairman in 1991, and was replaced by George Roberts; William P. Rutledge was named president and CEO. Roberts then retired in 1993 and was replaced by Rutledge; Donald B. Rice, previously Secretary of the U.S. Air Force, was then named president and CEO. Many companies had been sold during the prior several years, and in 1993, through consolidations, the number was further reduced from 65 to 18. In January 1995, Teledyne Electronic Systems was sold to Litton Industries, essentially ending the business on which Teledyne had originally been formed. In the early 1990s, while the company underwent these turnovers in leadership, two lawsuits were brought against Teledyne by whistleblowers under the False Claims Act. The suits charged the company with falsifying test reports for relay devices sold to the US government for weapons and spacecraft use, and with padding government contract cost estimates. In April 1994, Teledyne settled both cases for $112.5 million, at the time one of the largest settlements by military contractors in a qui tam case. In late 1994, Teledyne was subjected to a hostile takeover attempt by WHX Corporation. This was successfully challenged, but the Teledyne pension fund had a surplus of $928 million and this was of wide interest. To forestall further hostile takeovers, Allegheny Ludlum, a steel and specialty metal firm, offered to serve as a white knight friendly acquirer. On August 15, 1996, an agreement was reached to merge Teledyne with Allegheny Ludlum, forming Allegheny Teledyne, Inc. (ATI), with headquarters in Pittsburgh, Pennsylvania. After some reorganization, ATI operated with three segments: Aerospace and Electronics, Specialty Metals, and Consumer Products. The former Teledyne high-technology companies were mainly in the A&E Segment, led by Robert Mehrabian. ATI eventually decided to spin off the segments into independent entities, and on November 29, 1999, Teledyne Technologies Incorporated, Allegheny Technologies Incorporated, and Water Pik Technologies, Inc., were formed. 21st century renewal With Robert Mehrabian as chairman, CEO, and president, Teledyne Technologies (or simply Teledyne, as it is most often called) was initially composed of 19 companies, all dating (in some form) from the original Teledyne, Inc. There were about 5,800 employees, including some 1,400 engineers and scientists. One of these companies, Ryan Aeronautical, was sold to Northrop Grumman before the end of 1999 to raise initial operating capital. In November 1999, Teledyne acquired certain assets of Mattituck Aviation Corporation, a privately owned aftermarket supplier and piston engine rebuilder and overhauler to the general aviation marketplace. Headquarters was initially in the Century City district of Los Angeles, but was later moved to one of the city's suburbs, Thousand Oaks. The Thousand Oaks location was the site of the Rockwell Scientific Company (formerly Rockwell International Science Center). Teledyne acquired Rockwell Scientific in 2006, and continued doing scientific and industrial research at the site (as Teledyne Scientific Company), in addition to having its corporate offices there. In 2000, its first full year of operation, Teledyne Technologies had sales of $795.1 million and net income of $40.5 million. The renewed Teledyne operated in much the same manner as Singleton’s early Teledyne, functioning as a conglomerate with growth mainly due to acquisitions. In 2010, the sales were $1,644.2 million with net income of $120.5 million, a cumulative financial growth in the decade of approximately 100 percent. About 44 percent of the 2010 sales were derived from contracts with agencies of, or prime contractors to, the U.S. government. By the start of 2011, there were near 100 companies, functioning in a wide range of products and services. Teledyne reported third quarter 2019 net sales of $802.2 million, a 10.6% increase compared to 2018. On 4 January 2021, it was announced Teledyne Technologies would acquire FLIR Systems for $8 billion. In 2021, Teledyne MEMS, which is in part composed by Teledyne DALSA, was ranked second in global revenues in the MEMS field. In October 2023, Teledyne Technologies acquired Xena Networks, a high-speed terabit Ethernet validation, assurance, and production test solutions provider. Teledyne Technologies was sanctioned by the Chinese government on December 5, 2024 due to arm sales to Taiwan."
}