{
  "ticker": "TECH",
  "cik": "0000842023",
  "company_name": "Bio-Techne",
  "corrected_name": "Bio-Techne",
  "wiki_title_used": "Bio-Techne",
  "exists": true,
  "raw_text": "Bio-Techne Corporation is an American life sciences company that develops, manufactures and sells life science reagents, instruments and services for the research, diagnostic, and bioprocessing markets.\n\nHistory\nThe company was founded in 1976 by Roger C. Lucas as Research and Diagnostic Systems, Inc. In 1985, it merged into Techne Corporation and became a public company.\nIn March 2013, Charles (Chuck) Kummeth was named chief executive officer  of the company.\nIn July 2013, the company acquired Bionostics for $104 million.\nIn February 2014, the company changed its name to Bio-Techne.\nIn April 2014, the company agreed to acquire Shanghai PrimeGene Bio-Tech Company (PrimeGene).\nIn July 2014, the company acquired Novus Biologicals for $60 million.\nIn August 2014, the company acquired ProteinSimple for $300 million.\nIn November 2014, the company agreed to acquire CyVek for $60 million plus up to an additional $135 million in earn-out payments.\nIn June 2015, the company agreed to acquire Cliniqa Corporation.\nIn March 2016, the company acquired Zephyrus Biosciences.\nIn July 2016, the company acquired Space Import-Export.\nIn August 2016, company acquired Advanced Cell Diagnostics for $250 million plus an additional $75 million in possible milestone payments.\nIn September 2017, the company acquired Trevigen.\nIn January 2018, the company acquired Atlanta Biologicals.\nIn June 2018, the company agreed to acquire Quad Technologies.\nIn August 2018, the company acquired Exosome Diagnostics for $250 million plus up to an additional $325 million in milestone payments.\nIn June 2019, the company acquired B-Mogen.\nIn April 2021, the company acquired Asuragen for $215 million plus up to an additional $105 million in milestone payments.\nIn June 2022, the business announced it would acquire Namocell Inc.\nIn June 2023, Bio-Techne announced it would acquire Lunaphore Technologies SA, the transaction was completed the following month\n\nReferences\nExternal links\nOfficial website\nBusiness data for Bio-Techne Corporation:",
  "clean_text": "Bio-Techne Corporation is an American life sciences company that develops, manufactures and sells life science reagents, instruments and services for the research, diagnostic, and bioprocessing markets. History The company was founded in 1976 by Roger C. Lucas as Research and Diagnostic Systems, Inc. In 1985, it merged into Techne Corporation and became a public company. In March 2013, Charles (Chuck) Kummeth was named chief executive officer of the company. In July 2013, the company acquired Bionostics for $104 million. In February 2014, the company changed its name to Bio-Techne. In April 2014, the company agreed to acquire Shanghai PrimeGene Bio-Tech Company (PrimeGene). In July 2014, the company acquired Novus Biologicals for $60 million. In August 2014, the company acquired ProteinSimple for $300 million. In November 2014, the company agreed to acquire CyVek for $60 million plus up to an additional $135 million in earn-out payments. In June 2015, the company agreed to acquire Cliniqa Corporation. In March 2016, the company acquired Zephyrus Biosciences. In July 2016, the company acquired Space Import-Export. In August 2016, company acquired Advanced Cell Diagnostics for $250 million plus an additional $75 million in possible milestone payments. In September 2017, the company acquired Trevigen. In January 2018, the company acquired Atlanta Biologicals. In June 2018, the company agreed to acquire Quad Technologies. In August 2018, the company acquired Exosome Diagnostics for $250 million plus up to an additional $325 million in milestone payments. In June 2019, the company acquired B-Mogen. In April 2021, the company acquired Asuragen for $215 million plus up to an additional $105 million in milestone payments. In June 2022, the business announced it would acquire Namocell Inc. In June 2023, Bio-Techne announced it would acquire Lunaphore Technologies SA, the transaction was completed the following month"
}