{
  "ticker": "TEL",
  "cik": "0001385157",
  "company_name": "TE Connectivity",
  "corrected_name": "TE Connectivity",
  "wiki_title_used": "TE Connectivity",
  "exists": true,
  "raw_text": "TE Connectivity plc is an American-Irish domiciled technology company that designs and manufactures electrical and electronic components. It serves several industries, including automotive, aerospace, defense, medical, and energy.\nTE Connectivity has a global workforce of 89,000 employees, including more than 8,000 engineers. The company serves customers in approximately 140 countries.\n\nHistory\nIn 1941, Aircraft and Marine Products (AMP) was founded to make solderless electrical connections for quick and removable wire connections used for aircraft and ships. After the war time boom, the company had to adapt to the post-war economy, and in 1956, the name of the company was changed to AMP Incorporated when it re-incorporated. In 1999, Tyco International acquired AMP Incorporated.\nIn September 2002, the CEO (L. Dennis Kozlowski) and CFO (Mark H. Swartz) of Tyco International Ltd. were indicted on charges including fraud, racketeering, stock manipulation, and more, amounting to more than 600 million dollars of theft.\nIn July 2007, Tyco separated into three publicly independent companies, Covidien Ltd (formerly Tyco Healthcare), Tyco Electronics Ltd, and Tyco International Ltd (formerly Tyco Fire & Security and Tyco Engineered Products & Services (TFS/TEPS)).\nIn 2010, the company's Tyco Telecommunications division, which provided and installed submarine communications cables, was renamed to Tyco Electronics Subsea Communications.\nOn March 10, 2011, Tyco Electronics Ltd changed its name to TE Connectivity Ltd., which the company said felt more relevant to its position as a connectivity and sensor component manufacturer.\nOn August 28, 2015, TE Connectivity announced that it has completed the sale of its broadband-networks business to CommScope Holding Co. for about US$3 billion.\nOn February 12, 2025, TE Connectivity announced its intent to acquire Richards Manufacturing, a manufacturer of overhead and underground electrical and gas distribution products, for approximately US$2.3 billion.\n\nProducts and services\nTE Connectivity's product portfolio is focused on connectors and sensors that are made to withstand harsh environments. The company operates three primary segments.\n\nCommunications\nTE Connectivity's communications segment supplies electronic components for home appliances, including products for washers, dryers, refrigerators, air conditioners, dishwashers, cooking appliances, water heaters, and microwaves.\n\nTransportation\nTE Connectivity's transportation segment includes four business units: automotive, industrial and commercial transportation, application tooling, and sensors.\nTE's products are used by the automotive industry for vehicle body and chassis systems, convenience applications, driver information, infotainment, motor and powertrain applications, and safety and security systems. Hybrid and electronic mobility include in-vehicle technologies, battery technologies, and charging. In addition, TE's products are used for on-highway vehicles, off-highway vehicles and recreational transportation, including construction, agriculture, buses, and other vehicles.\nTE offers sensors for industries including automotive, industrial equipment, commercial transportation, medical, aerospace and defense, and consumer applications.\n\nIndustrial\nThe industrial segment supplies products for factory automation and process control systems such as industrial controls, robotics, human machine interface, industrial communication, and power distribution. TE's building products are used to connect lighting, HVAC, elevators/escalators, and security. Its rail products are used in high-speed trains, metros, light rail vehicles, locomotives, and signaling switching equipment. Also, its products are used by the solar and lighting industry.\nTE's products are used by the medical industry in imaging, diagnostic, therapeutic, and surgical applications.\nTE Connectivity provides components for the commercial aerospace industry from the initial stages of aircraft design to aftermarket support. TE's defense products include ruggedized electronic interconnects serving military aviation, marine, and ground vehicles including electronic warfare and space systems. The segment also provides a wide range of relays and contactors for commercial and defense aerospace markets. Its oil and gas products include cables and electronics used for subsea environments in the offshore oil and gas and civil marine industries and in shipboard, subsea, and sonar applications.\nTE Connectivity has produced CPU sockets compatible with Intel processors, such as LGA 771 CPU sockets.\n\nSee also\nF crimp\nMICTOR\nConnectors\nSensors\nRelays\nContactors\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for TE Connectivity plc:",
  "clean_text": "TE Connectivity plc is an American-Irish domiciled technology company that designs and manufactures electrical and electronic components. It serves several industries, including automotive, aerospace, defense, medical, and energy. TE Connectivity has a global workforce of 89,000 employees, including more than 8,000 engineers. The company serves customers in approximately 140 countries. History In 1941, Aircraft and Marine Products (AMP) was founded to make solderless electrical connections for quick and removable wire connections used for aircraft and ships. After the war time boom, the company had to adapt to the post-war economy, and in 1956, the name of the company was changed to AMP Incorporated when it re-incorporated. In 1999, Tyco International acquired AMP Incorporated. In September 2002, the CEO (L. Dennis Kozlowski) and CFO (Mark H. Swartz) of Tyco International Ltd. were indicted on charges including fraud, racketeering, stock manipulation, and more, amounting to more than 600 million dollars of theft. In July 2007, Tyco separated into three publicly independent companies, Covidien Ltd (formerly Tyco Healthcare), Tyco Electronics Ltd, and Tyco International Ltd (formerly Tyco Fire & Security and Tyco Engineered Products & Services (TFS/TEPS)). In 2010, the company's Tyco Telecommunications division, which provided and installed submarine communications cables, was renamed to Tyco Electronics Subsea Communications. On March 10, 2011, Tyco Electronics Ltd changed its name to TE Connectivity Ltd., which the company said felt more relevant to its position as a connectivity and sensor component manufacturer. On August 28, 2015, TE Connectivity announced that it has completed the sale of its broadband-networks business to CommScope Holding Co. for about US$3 billion. On February 12, 2025, TE Connectivity announced its intent to acquire Richards Manufacturing, a manufacturer of overhead and underground electrical and gas distribution products, for approximately US$2.3 billion. Products and services TE Connectivity's product portfolio is focused on connectors and sensors that are made to withstand harsh environments. The company operates three primary segments. Communications TE Connectivity's communications segment supplies electronic components for home appliances, including products for washers, dryers, refrigerators, air conditioners, dishwashers, cooking appliances, water heaters, and microwaves. Transportation TE Connectivity's transportation segment includes four business units: automotive, industrial and commercial transportation, application tooling, and sensors. TE's products are used by the automotive industry for vehicle body and chassis systems, convenience applications, driver information, infotainment, motor and powertrain applications, and safety and security systems. Hybrid and electronic mobility include in-vehicle technologies, battery technologies, and charging. In addition, TE's products are used for on-highway vehicles, off-highway vehicles and recreational transportation, including construction, agriculture, buses, and other vehicles. TE offers sensors for industries including automotive, industrial equipment, commercial transportation, medical, aerospace and defense, and consumer applications. Industrial The industrial segment supplies products for factory automation and process control systems such as industrial controls, robotics, human machine interface, industrial communication, and power distribution. TE's building products are used to connect lighting, HVAC, elevators/escalators, and security. Its rail products are used in high-speed trains, metros, light rail vehicles, locomotives, and signaling switching equipment. Also, its products are used by the solar and lighting industry. TE's products are used by the medical industry in imaging, diagnostic, therapeutic, and surgical applications. TE Connectivity provides components for the commercial aerospace industry from the initial stages of aircraft design to aftermarket support. TE's defense products include ruggedized electronic interconnects serving military aviation, marine, and ground vehicles including electronic warfare and space systems. The segment also provides a wide range of relays and contactors for commercial and defense aerospace markets. Its oil and gas products include cables and electronics used for subsea environments in the offshore oil and gas and civil marine industries and in shipboard, subsea, and sonar applications. TE Connectivity has produced CPU sockets compatible with Intel processors, such as LGA 771 CPU sockets."
}