{
  "ticker": "TER",
  "cik": "0000097210",
  "company_name": "Teradyne",
  "corrected_name": "Teradyne",
  "wiki_title_used": "Teradyne",
  "exists": true,
  "raw_text": "Teradyne, Inc. is an American automatic test equipment (ATE) designer and manufacturer based in North Reading, Massachusetts. Its high-profile customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM.\n\nHistory\nTeradyne was founded by Alex d'Arbeloff and Nick DeWolf, who were classmates at the Massachusetts Institute of Technology (MIT) in the late 1940s. The men founded Teradyne in 1960, and set up shop in rented space above Joe and Nemo's hotdog stand in downtown Boston. The name, Teradyne, was intended to represent a very forceful presence. 1,000,000,000,000 dynes = 10 meganewtons (2,248,089 pounds-force or 1,019,716 kilograms-force).\nd'Arbeloff and DeWolf knew that testing electronic components in high-volume production would reach a bottleneck, unless the tasks performed by technicians and laboratory instruments could be automated. Their business plan involved a new breed of \"industrial-grade\" electronic test equipment, known for its technical performance, reliability and economic payback.\nIn 1961, d'Arbeloff and DeWolf sold their first product, a logic-controlled go/no-go diode tester, to Raytheon.\nIn the 1980s, Teradyne expanded its sub-assembly test business by acquiring Zehntel, a leading manufacturer of in-circuit board test systems. In 1987, the company introduced the first analog VLSI test system, the A500, which led the market in testing integrated devices that provided the interface between analog and digital data.\nThe 1990s brought more diversification. The company acquired Megatest Corporation, which expanded its Semiconductor Test group to include smaller and less expensive testers than had been currently available. Teradyne also became a market leader in high-end System-on-a-Chip (SoC) test with its Catalyst and Tiger test systems.\nIn 2000, Teradyne Connection Systems acquired Herco Technologies and Synthane-Taylor, and a year later they acquired circuit-board test and inspection leader, GenRad, and merged it into the Assembly Test Division. GenRad's Diagnostic Solutions, which made test equipment for the automotive manufacturing and service industries, became a separate product group for Teradyne.\nIn 2006, Teradyne sold its two Boston buildings and consolidated all of its Boston-area staff to its current site in North Reading, Massachusetts.\nTeradyne grew its semiconductor test business with the addition of Nextest and Eagle Test Systems in 2008, serving the flash memory test market and high-volume analog test market, respectively. That same year, Teradyne entered the disk-drive test market with the internally developed Neptune product, which serves the data-intensive internet and computing storage markets.\nIn 2010, Teradyne celebrated its 50th anniversary. The following year, it acquired LitePoint Corporation, a leading provider of test instruments for use with wireless products, such as laptops PCs, tablets, home networking and cell phones. With the addition of LitePoint, Teradyne's product portfolio stretched from wafer test of semiconductor chips to system-level circuit boards to products ready for store shelves.\nUpon d'Arbeloff's retirement, George Chamillard assumed the post of President and CEO. He was replaced at his retirement by former CFO Mike Bradley. Bradley retired in January 2014, and was in turn replaced by Semiconductor Test Division president Mark Jagiela.\nTeradyne acquired Danish company Universal Robots in 2015.\nTeradyne operates major facilities around the world, with headquarters in North Reading, Massachusetts.\n\nDivisions\nThe Semiconductor Test Division provides test equipment used by integrated circuit manufacturers to test logic, RF, analog, power, mixed-signal and memory devices. Teradyne manufactures five principal families of testers known as the \"J750\", \"FLEX,\" \"UltraFLEX,\" “Eagle” and “Magnum” series. These testers are used by semiconductor manufacturers to test and classify the individual devices (\"dies\") on a completed semiconductor wafer and then used again to retest the parts once they are enclosed in their final packaging.\nThe System Test Group builds testers for completed circuit boards (printed circuit boards/printed wiring boards) and hard drives. The division addresses next-level electronics production for consumer, communications, industrial and government customers. Major product families in the system test business include: TestStation, Spectrum Series, High-Speed Subsystem, Neptune, Saturn and Titan. Portions of this division were acquired when Teradyne purchased GenRad in 2002.\nLitePoint, Teradyne's wireless test business, provides services for leading manufacturers of wireless modules and consumer electronics. Serving the rapidly growing wireless communications industry, LitePoint products are used by chipset and product designers along with their contract manufacturers. LitePoint's products include IQxel for connectivity test and IQxstream for cellular test.\nTeradyne's industrial automation business is composed of Universal Robots, Mobile Industrial Robots, AutoGuide and Energid.\nUniversal Robots (UR) provides collaborative robots (cobots) that work side-by-side with production workers. UR cobots automate tasks including machine tending, packaging, gluing, painting, polishing and assembling parts. The cobots are deployed in the automotive, food and agriculture, furniture and equipment, metal and machining, plastics and polymers, and pharma and chemicals industries.\nMobile Industrial Robots (MiR) offers autonomous mobile robots for managing internal logistics (for payloads under 1,500 kg). These robots are currently used in the transportation, healthcare, pharmaceutical, metal and plastics, fashion, technology and food industries.\nAutoGuide Mobile Robots manufactures modular industrial mobile robots (for payloads up to 45,000 kg). These high-payload robots are used for assembly, material handling, warehousing and distribution operations across multiple industries.\nEnergid specializes in the control and simulation of complex robotic systems, and is used in the aerospace, agriculture, manufacturing, transportation, defense and medical industries.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Teradyne, Inc.:",
  "clean_text": "Teradyne, Inc. is an American automatic test equipment (ATE) designer and manufacturer based in North Reading, Massachusetts. Its high-profile customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM. History Teradyne was founded by Alex d'Arbeloff and Nick DeWolf, who were classmates at the Massachusetts Institute of Technology (MIT) in the late 1940s. The men founded Teradyne in 1960, and set up shop in rented space above Joe and Nemo's hotdog stand in downtown Boston. The name, Teradyne, was intended to represent a very forceful presence. 1,000,000,000,000 dynes = 10 meganewtons (2,248,089 pounds-force or 1,019,716 kilograms-force). d'Arbeloff and DeWolf knew that testing electronic components in high-volume production would reach a bottleneck, unless the tasks performed by technicians and laboratory instruments could be automated. Their business plan involved a new breed of \"industrial-grade\" electronic test equipment, known for its technical performance, reliability and economic payback. In 1961, d'Arbeloff and DeWolf sold their first product, a logic-controlled go/no-go diode tester, to Raytheon. In the 1980s, Teradyne expanded its sub-assembly test business by acquiring Zehntel, a leading manufacturer of in-circuit board test systems. In 1987, the company introduced the first analog VLSI test system, the A500, which led the market in testing integrated devices that provided the interface between analog and digital data. The 1990s brought more diversification. The company acquired Megatest Corporation, which expanded its Semiconductor Test group to include smaller and less expensive testers than had been currently available. Teradyne also became a market leader in high-end System-on-a-Chip (SoC) test with its Catalyst and Tiger test systems. In 2000, Teradyne Connection Systems acquired Herco Technologies and Synthane-Taylor, and a year later they acquired circuit-board test and inspection leader, GenRad, and merged it into the Assembly Test Division. GenRad's Diagnostic Solutions, which made test equipment for the automotive manufacturing and service industries, became a separate product group for Teradyne. In 2006, Teradyne sold its two Boston buildings and consolidated all of its Boston-area staff to its current site in North Reading, Massachusetts. Teradyne grew its semiconductor test business with the addition of Nextest and Eagle Test Systems in 2008, serving the flash memory test market and high-volume analog test market, respectively. That same year, Teradyne entered the disk-drive test market with the internally developed Neptune product, which serves the data-intensive internet and computing storage markets. In 2010, Teradyne celebrated its 50th anniversary. The following year, it acquired LitePoint Corporation, a leading provider of test instruments for use with wireless products, such as laptops PCs, tablets, home networking and cell phones. With the addition of LitePoint, Teradyne's product portfolio stretched from wafer test of semiconductor chips to system-level circuit boards to products ready for store shelves. Upon d'Arbeloff's retirement, George Chamillard assumed the post of President and CEO. He was replaced at his retirement by former CFO Mike Bradley. Bradley retired in January 2014, and was in turn replaced by Semiconductor Test Division president Mark Jagiela. Teradyne acquired Danish company Universal Robots in 2015. Teradyne operates major facilities around the world, with headquarters in North Reading, Massachusetts. Divisions The Semiconductor Test Division provides test equipment used by integrated circuit manufacturers to test logic, RF, analog, power, mixed-signal and memory devices. Teradyne manufactures five principal families of testers known as the \"J750\", \"FLEX,\" \"UltraFLEX,\" “Eagle” and “Magnum” series. These testers are used by semiconductor manufacturers to test and classify the individual devices (\"dies\") on a completed semiconductor wafer and then used again to retest the parts once they are enclosed in their final packaging. The System Test Group builds testers for completed circuit boards (printed circuit boards/printed wiring boards) and hard drives. The division addresses next-level electronics production for consumer, communications, industrial and government customers. Major product families in the system test business include: TestStation, Spectrum Series, High-Speed Subsystem, Neptune, Saturn and Titan. Portions of this division were acquired when Teradyne purchased GenRad in 2002. LitePoint, Teradyne's wireless test business, provides services for leading manufacturers of wireless modules and consumer electronics. Serving the rapidly growing wireless communications industry, LitePoint products are used by chipset and product designers along with their contract manufacturers. LitePoint's products include IQxel for connectivity test and IQxstream for cellular test. Teradyne's industrial automation business is composed of Universal Robots, Mobile Industrial Robots, AutoGuide and Energid. Universal Robots (UR) provides collaborative robots (cobots) that work side-by-side with production workers. UR cobots automate tasks including machine tending, packaging, gluing, painting, polishing and assembling parts. The cobots are deployed in the automotive, food and agriculture, furniture and equipment, metal and machining, plastics and polymers, and pharma and chemicals industries. Mobile Industrial Robots (MiR) offers autonomous mobile robots for managing internal logistics (for payloads under 1,500 kg). These robots are currently used in the transportation, healthcare, pharmaceutical, metal and plastics, fashion, technology and food industries. AutoGuide Mobile Robots manufactures modular industrial mobile robots (for payloads up to 45,000 kg). These high-payload robots are used for assembly, material handling, warehousing and distribution operations across multiple industries. Energid specializes in the control and simulation of complex robotic systems, and is used in the aerospace, agriculture, manufacturing, transportation, defense and medical industries."
}