{
  "ticker": "TFC",
  "cik": "0000092230",
  "company_name": "Truist Financial",
  "corrected_name": "Truist Financial",
  "wiki_title_used": "Truist Financial",
  "exists": true,
  "raw_text": "Truist Financial Corporation () is an American bank holding company headquartered in Charlotte, North Carolina. The company was formed in December 2019 as the result of the merger of BB&T (Branch Banking and Trust Company) and SunTrust. Its bank operates 1,928 branches in 15 states and Washington, D.C., offering consumer, commercial, and investment banking, securities brokerage, asset management, mortgage, and insurance products and services. It is on the list of largest banks in the United States by assets; as of May 2025, it is the tenth-largest bank, with $523 billion in assets.\n\nHistory\nHistory of BB&T\nIn 1872, Alpheus Branch and Thomas Jefferson Hadley founded the Branch and Hadley merchant bank in their hometown of Wilson, North Carolina. After many transactions, mostly with local farmers, Branch bought out Hadley's shares in 1887 and renamed the company Branch and Company, Bankers.  Also in 1887, the bank moved to its new headquarters on Nash Street in downtown Wilson, North Carolina. Two years later, Branch, his father-in-law Gen. Joshua Barnes, Hadley, and three other men secured a charter from the North Carolina General Assembly to operate the Wilson Banking and Trust Company. After many more name changes, the company finally settled on the name Branch Banking and Trust Company. Branch remained an active member of the company until his death in 1893. The 1903 Branch Banking and Trust Company Building at Wilson was listed on the National Register of Historic Places in 1978.\nBB&T sold Liberty Bonds during World War I and grew to have more than $4 million in assets by 1923. BB&T Insurance Services was added in 1922 and a mortgage division was added in 1923. Even though banks across the United States failed as a result of the 1929 Stock Market Crash, BB&T survived; it was the only one to do so in the town of Wilson.\n\nHistory of Southern National Bank\nIn 1897, the Bank of Lumberton was started by Angus Mclean in Lumberton, North Carolina, the predecessor of Southern National.  The founding board members of the bank were Angus Mclean, Thomas McNeill, R.D. Caswell, C.B. Townsend, S.A. Edmund, R.L. Steele, W.L.F. Steel, T.C. Guthrie, H.B. Jennings.  The board was composed of members from Lumberton, Rockingham, North Carolina, and Bennettsville, South Carolina. Thomas McNeill was selected to be the bank's first president.  He resigned a year later, when he was appointed as a judge.  After McNeill resigned Mclean became president.   Mclean did not simply view himself as a banker, he wanted to build companies that had a good return on their investment, created jobs, and benefited the communities they operated within.  In 1955 Hector MacLean, Angus Mclean's son, was named president.  The Bank of Lumberton changed its names to Southern National Bank in 1959.\nIn 1979, the Carolina State Bank of Gastonia, started in 1971, became part of Southern National. In 1982, Southern National took over Winston-Salem-based Forsyth Bank & Trust, led by Glenn Orr.\nIn 1985, Southern National had assets of $1.5 billion. With the purchase of a former Northwestern Bank branch in Hickory, which had to be sold after the First Union-Northwestern merger, Southern National had 99 branches in 26 counties. In 1986, Southern National Corporation entered South Carolina with the $10 million purchase of Horry County National Bank of Loris. Later that year, Southern National announced the $5.6 million purchase of First Palmetto Bancshares Corp. of Columbia and the $9.75 million purchase of Capital Bank and Trust Co. of Belton. At the time, Southern National was North Carolina's seventh-largest banking company.  Also in 1986, Southern National sold its Southern National Mortgage Co. to NCNB for an estimated $7 million. Southern National had not intended to sell the business but NCNB made a good offer, and the bank could use the money for its South Carolina purchases. NCNB had exited the mortgage business in 1981 to concentrate on interstate banking, though NCNB bought Bank of North Carolina in 1982 and sold that bank's mortgages to Southern National.  In May 1989, Southern National announced its purchase of Allied Bankshares Inc. of Thomson, Georgia. The $59 million deal fell apart but would have been the first acquisition of a Georgia bank by a mid-sized N.C. bank. Another failed deal in 1990 would have given Southern National $1 billion in South Carolina assets and 53 offices in the state. NBSC had $540 million in assets, while Southern National Corp. had $3.4 billion and was N.C.'s fifth largest bank holding company. NBSC shareholders objected to the $53 million deal.\nIn 1990, Hector MacLean retired from the bank.  During his presidency, the bank changed its name, grew from $3 million in assets to $3.3 billion, and grew to 148 branches.  MacLean's successor was Glenn Orr.  Early in 1993, Southern National completed its purchase of First Federal Savings Bank in Winston-Salem, putting Southern National behind only Wachovia in Forsyth County deposits. Southern National had $4.5 billion in assets, $3.9 billion of those in North Carolina, and was the state's sixth largest banking company. The company's North Carolina banking operations began moving to Winston-Salem, though Orr and the corporate headquarters stayed in Lumberton. One reason for the move was the 20-story, 239,000-square-foot (22,200 m2) One Triad Park, which had 74,000 square feet (6,900 m2) of space Southern National could move into immediately. One of the other contenders, Greensboro, would not have a new building ready, and the bank would need a temporary home. With Southern National taking 80,000 square feet (7,400 m2) on eight floors, the building's name changed to Southern National Financial Center on May 3.\nAlso in 1993, Southern National announced the purchase of Goldsboro-based East Coast Federal Savings Bank, with $256 million in assets, which Orr called \"one of the best savings banks in the state.\" The deal would make Southern National number one in deposits in Fayetteville, the state's fifth-largest banking market. In 1993, Southern National announced the acquisition of First Savings Bank, FSB, headquartered in Greenville, South Carolina. With just over $2 billion in assets, it was the third largest financial institution in South Carolina.  Orr, along with BB&T Chairman John Allison, helped facilitate the Southern Nation BB&T merger.\n\nMerger with Southern National Bank\nIn 1995, the bank merged with Southern National Bank, another bank with roots in the eastern part of the state. This gave BB&T 437 branches in 220 cities in the Carolinas and Virginia. The merged company became Southern National Corp., but all of its banking subsidiaries took the BB&T name. With $19 billion in assets, BB&T had the most North Carolina deposits and branches of any bank. Southern National head Glenn Orr and new BB&T chairman John Allison said the merger likely created a bank that would be too rich to be taken over by an out-of-state bank. Orr retired once the merger was complete. The headquarters became BB&T Financial Center in Winston-Salem, North Carolina.\nIn 1997, Southern National Corp. took over United Carolina Bank, another eastern North Carolina–based bank, in a $985 million deal announced in November 1996. UCB had $4.5 billion in assets. 400 employees worked in Whiteville but despite losing the headquarters, the town would eventually have 500 BB&T employees working at a 250-employee call center and other operations. Starting September 22, 1997, 91 UCB branches began the process of changing to BB&T, and 67 other branches of the two banks closed starting in October because they were close to other BB&T locations.\nOn May 19, 1997, Southern National Corp. changed its name to BB&T Corp. and its stock symbol SN to BBT.\n\nAcquisitions\nThe bank continued to expand nationwide through the 1990s, purchasing Fidelity Financial Bankshares, First Financial of Petersburg, Maryland, Maryland Federal Bancorp, and Franklin Bancorporation. In 1998, BB&T acquired MainStreet Financial of Martinsville, Virginia, and Mason-Dixon Bancshares of Westminster, Maryland, and further expanded into Georgia and West Virginia after purchasing First Liberty of Macon, Georgia, and Matewan Bancshares.-\nIn 2000, BB&T purchased One Valley Bancorp, which was itself formed from a combination of community banks throughout West Virginia. This move gave BB&T the largest bank presence in West Virginia. In 2002, BB&T completed its acquisition of MidAmerica Bancorp of Louisville, Kentucky. (Bank of Louisville) and AREA Bancshares Corporation of Owensboro, Kentucky. In 2003, BB&T completed its acquisition of First Virginia Banks of Falls Church, Virginia. In 2005, the bank acquired Main Street Banks of metro Atlanta for $622 million. In 2006, the bank acquired Coastal Federal Bank, based in Myrtle Beach.\nIn late 2008, the bank accepted $3.1 billion in bailout money through the sale of preferred shares to the U.S. Treasury's Troubled Asset Relief Program. In June 2009, the bank repurchased the shares. In July 2008, the company acquired Puckett, Scheetz & Hogan. In December 2008, the company acquired J. Rolfe Davis. On August 14, 2009, the bank acquired Colonial Bank after its seizure by the FDIC. This acquisition added more than 340 branches in Alabama, Florida, Georgia, Nevada, and Texas, along with approximately $22 billion in assets. BB&T sold the Nevada branch to U.S. Bancorp in January 2010.\nThe company acquired Atlantic Risk Management. In November 2011, the company acquired Precept, an employee benefits consulting firm. In July 2012, the bank acquired BankAtlantic, and its $2.1 billion in loans and $3.3 billion in deposits. The company also began selling flood insurance online. In December 2013, the bank acquired 21 Citigroup branches in Texas for $36 million, adding $1.2 billion in deposits.  In September 2014, the bank acquired 41 more Citigroup branches, adding $2.3 billion in deposits.\nIn June 2015, the bank acquired Bank of Kentucky for $363 million, which added $1.9 billion in assets and gave BB&T a presence in the Northern Kentucky-Cincinnati market and its first branches in Ohio.  In August 2015, the bank acquired Susquehanna Bank for $2.5 billion, adding 240 branches and $18.7 billion in assets, and marking the bank's entry into Pennsylvania and New Jersey. In April 2016, the company acquired Swett & Crawford, a wholesale insurance broker. In April 2016, the bank acquired National Penn for $1.8 billion, which added 124 branches in Pennsylvania, New Jersey, and Maryland, $9.6 billion in assets, and $6.7 billion in deposits. On August 29, 2018, BB&T announced as many as 630 employees would move from its former corporate headquarters on West Nash Street in Wilson to a $35 million, 95,000-square-foot facility on Pine Street. On October 16, 2018, BB&T announced plan to move 500 employees into a 100,000-square-foot, $10 million building in Whiteville, N.C.\nIn May 2022, Truist announced the organisation had acquired the 12-person San Francisco based, gamified financial technology start-up company Long Game Savings inc. The monetary value paid for the company has been left undisclosed.\n\nInsurance services\nBB&T has been in the insurance business since 1922.  In the late '80s and early '90s the division was losing money.  In 1990 Henry William and Wade Reece, a BB&T branch manager, met to discuss how to make the business profitable again.  In 1995 the insurance services division made 6 acquisitions of insurance companies based across North Carolina.  In July 1999 the insurance services division had acquired 24 insurance companies in North Carolina, 15 in Virginia, 3 in South Carolina, and 1 in Georgia.  By 2010 BB&T's insurance division had grown to be the sixth largest broker in the US and the seventh largest in the world with $1 billion in annual revenue.  The division has completed 60 mergers since 1999.  In 2002 CRC was acquired, whose businesses include specialty and high risk clients.  TAPCO and Southern Cross were also acquired and merged into CRC.  In February 2008, the division acquired Burkey Risk Services. In April 2008 UnionBanc Insurance Services was acquired.  In November 2009, the division acquired Oswald Trippe.\nIn September 2011 Liberty Benefit Insurance Services, an agency operating in California, was acquired.  In February 2012, the division acquired the life insurance, property, and casualty insurance divisions of Crump Group.   In March 2014, the Insurance Services division acquired Woodbury & Co., an insurance broker operating in the Carolinas.  In April 2014 Caledonian Insurance Group was, a company which specialized in insurance brokerage services for the aviation industry.  In April 2015, BB&T subsidiary CRC Insurance Services acquired the assets of Napco LLC, a broker of catastrophic commercial insurance.  In the June 2015 acquisition of Bank of Kentucky part of the deal was also American Coastal Insurance which increased BB&T's ownership in AMRisc.  In April 2018 the insurance service division announced it was purchasing Regions Insurance Group which was owned by Regions Financial Corporation and the purchase was completed in July 2018.  The business was based in Memphis, Tennessee and had offices in 10 states.  This acquisition significantly added the insurance division's retail and whole lines of business.  The acquisition provided BB&T Insurance Services with 60,000 new clients in multiple states.\nIn June 2020 BB&T Insurance Holdings rebranded as Truist Insurance Holdings and moved its headquarters to Charlotte, North Carolina inside the Truist Center, Truist's corporate headquarters.  Insurance services has been an important area of growth for Truist. In 2020 it accounted for 10% of Truist's revenue.  Kelly King CEO of Truist stated the company's goal is to have the insurance division eventually make up 14% to 15% of Truist's revenue.\nIn February 2024, Truist Financial agreed to divest the insurance business to an investor group led by Clayton, Dubilier & Rice and Stone Point Capital.\n\nHistory of SunTrust\nSunTrust Banks is the combination of three companies, two banks, one based in Georgia and one based in Florida, and an investment company.  The three companies are Trust Company of Georgia, Sun Bank, and The Robinson-Humphrey Company.\nOn September 21, 1891 what subsequently became the Trust Company of Georgia was started by John M. Green, Joel Hurt, H. L. Atwater, W. A. Hansell, T. J. Hightower, J. G. Oglesby, J. D. Turner, John B. Daniel, Joseph Hirsch, Leon Lieberman, Louis Wellhouse, A. J. McBride, D. O. Dougherty, W. A. Gregg, W. W. Draper, A. C. Hook, W. T. Ashford, George W. Brooke, C. I. Branan, and C. D. Montgomery.  In November 1893, it restructured as a trust company and renamed itself Trust Company of Georgia.\nThe earliest predecessor of Sun Bank was founded in 1911 as The People's National Bank in Orlando, Florida. In 1920, it became the First National Bank. In the early 1930s, during the Great Depression, the First National Bank and Trust Company failed. It was reorganized on Valentine's Day 1934 as the First National Bank at Orlando. In 1973, the bank merged with other Orlando banks to become SunBanks. As of December 31, 1973, it had three bank-related subsidiaries and total assets of $1.713 billion.  In 1985 the Trust Company of Georgia and Sun Banks Inc. merge to form SunTrust Banks Inc.\nThe Robinson-Humphrey Company was founded as a municipal bond shop by Roby Robinson in 1894. Robinson and William G. Humphrey, a bond trader from Toledo, Ohio, eventually incorporated The Robinson-Humphrey Co. in 1902. It blossomed into the leading investment banking firm in the South under Chairman Justus Martin Jr., who helped broaden its ties to Atlanta corporations, European clients and the firm's wealthy families who were brokerage clients. Martin was at the helm when Robinson-Humphrey commissioned the building of the bold Atlanta Financial Center in city's tony Buckhead business district in the early 1980s.  In 1982, Martin sold Robinson-Humphrey to American Express, which was then run by another Atlanta deal maker and fellow Georgia Tech grad, James Robinson (no relation to Roby Robinson). Under AmEx, the firm operated as part of Shearson Lehman Brothers Inc.  In 1993, deal maker Sandy Weill orchestrated a deal for Shearson's retail division, and Robinson-Humphrey was included in the sale, using the Smith Barney unit of Primerica Corp.  The company was acquired by SunTrust in 2001.  In June 2020 SunTrust Robinson Humphrey and BB&T Capital Markets combined to form the new Truist Securities.\n\nSunTrust merger\nOn February 7, 2019, it was reported that Winston-Salem-based BB&T and Atlanta-based SunTrust Banks would come together in a merger of equals to create the eighth-largest US bank in the biggest bank deal since the 2008 financial crisis. BB&T would be the nominal survivor, and the merged bank would retain BB&T's stock price history. However, the merged bank would be headquartered in Charlotte, North Carolina, retaining significant operations in Winston-Salem. It was subsequently announced that Winston-Salem would be the bank's headquarters for community banking, while Atlanta would be the hub for wholesale / retail banking. SunTrust had been the last major bank headquartered in Atlanta, which had been the South's financial capital for much of the 20th century.\nOn June 12, 2019 BB&T and SunTrust announced that the merged company would be called Truist Financial Corporation. This name resulted from research that included hiring Interbrand, seeking opinions of employees of both banks, and focus groups.  The new name drew criticism from analysts and customers of both banks on social media.\nThe merger was completed at midnight December 6, 2019. BB&T CEO Kelly King retained the same position with the new company. Customers of both banks were given free access to all of Truist's ATMs free of charge. The merged bank continued to operate under the BB&T and SunTrust names until the two banks' computer hardware, software and networking systems were streamlined, a process that was projected take as long as two years. Due to delays related to the COVID-19 pandemic, Truist announced in April 2021 that core conversion to combine the branches will be performed in early 2022. However, on the day the merger closed, SunTrust Bank merged into Branch Banking & Trust Company, forming Truist Bank as the merged company's legal banking entity.\nOn December 11, 2019, Truist officially exercised its option to purchase Hearst Tower in downtown Charlotte from Cousins Properties. Truist moved its corporate headquarters to Hearst Tower, which was renamed to Truist Center. Truist had taken over 550,000 square feet (51,000 m2) of 965,000 square feet (89,700 m2) total. The bank announced the deal was completed March 31, 2020. However, due to the COVID-19 pandemic, further actions will be delayed.\n\nTruist unveiled its logo in January 2020, with two Ts representing touch and technology, and a shade of purple combining the blue of SunTrust and the burgundy of BB&T. In November 2020, the bank used helicopters to lift up four signs to the top of the former Hearst Tower. The \"Truist\" wordmark appears on the North Tryon Street and North College Street sides of the building, while the other two sides displayed the Truist logo.  This signage has caused a lot controversy, even leading the building's original architect to refer to the signage as vandalism.\nIn February 2020, Truist announced it would be launching a nonprofit foundation called the Truist Foundation.\nIn March 2020, Truist announced it would vacate its former headquarters building in Winston-Salem except for a branch office and would move employees in its community/retail hub to other locations in the city, including the Park Building on Cherry Street and two locations on Stratford Road.\nThe merger was estimated to cost $4 billion. Part of these costs would be severance for workers laid off, conversion costs, marketing and professional fees. However, through the merger the bank estimates that $1.6 billion in net cost savings will be achieved by the end of 2022. Part of this savings would be fewer branches. Truist intended to close 800 branches by the first quarter of 2022, and office consolidation would reduce space by 4.8 million square feet.\n\nTrademark Infringement Lawsuit\nOn June 17, 2019 Truliant Federal Credit Union of Winston-Salem filed suit claiming \"trademark infringement\", complaining of potential confusion between the two companies’ respective names, including Truliant products with \"Tru\" in their names. The parties agreed to dismiss claims on August 5, 2020 and the lawsuit was closed the next day.\nOn September 5, 2021, former SunTrust Banks' CEO Bill Rogers became chief executive officer of Truist Financial Corporation.\nTruist said it had completed changing signs on branches February 22, 2022. At that time former SunTrust customers had difficulty using debit cards.\n\nSlavery connections\nAccording to the book Genealogy of American Finance, BB&T was formally established in 1872 nearly a decade after slavery was abolished in the US, but the company's roots can be traced to 1805. Branch and Hadley, the founders of BB&T, Both worked on family farms before the Civil War.  Alpheus Branch's father Samuel owned 58 slaves. Thomas Hadley's father owned 37 slaves.  Both later served in the Confederate Army. When the war ended in 1865, the South was forced to accept their new fate. \nIn July 2020, Truist Financial Corp issued a statement condemning racial injustice and acknowledging that the bank’s predecessor, BB&T Corp., had ties to businesses that benefited from slavery.\nKelly King, chairman and chief executive of Truist, issued a 2022 employee memo addressing BB&T's slavery ties, but did not mention BB&T's founders Alpheus Branch and Thomas Hadley by name.  The memo stated that \"we must consider our own past and acknowledge the role our heritage companies played over 100 years ago to perpetuate the atrocity of slavery and the repression of enslaved people, leading to systemic disadvantages their descendants have endured for generations...We deeply regret and denounce these shameful aspects of our history, both known and unknown.\"\n\nPost-merger deals\nOn December 10, 2020 Truist Insurance Holdings announced it will acquire 5 companies in the fourth quarter.  Those include: W. Brown & Associates Property & Casualty, Specialty Risk Associates, Program Insurance Management of Sarasota, Wellington Risk Holdings Inc. and Fidelis Group Holdings.  These companies will add $100 million in revenue.\nIn May 2021 Truist Insurance Holdings announced it will acquire Constellation Affiliated Partners in the third quarter.  The insurance division plans to keep Constellation Affiliated Partners' 475 employees and merge them into CRC.  The acquisition will add $160 million in revenue to Truist Insurance Holdings current  revenue of $2.3 billion.  Truist Insurance has three main segments: retail, insurance premium finance and wholesale.  John Howard, CEO of Truist Insurance, stated this about the division's approach \"We are normally working on acquisition opportunities. We're in an industry that is consolidating, and we have a really good track record, I really think diversification is attractive, and we're already the most diversified insurance broker, so I want to continue to build on that. And for Truist overall, we provide diversification away from...credit businesses, so that we perform well throughout a variety of market cycles.\"\nOn August 11, 2021, Truist announced it is acquiring Service Finance Co. for $2 billion.  Service Finance provides point-of-sale financing 14,000 dealers and contractors for home improvement projects.  Truist already has a point-of-sale financing business that includes Sheffield Financial, which provides financing for power equipment, power sports, and trailers.\nOn March 3, 2022, Truist Insurance Holdings completed the acquisition of Kensington Vanguard National Land Services (KV).  Kensington Vanguard National Land Services is one of the nation's largest independent national title companies.  Truist's existing title business BridgeTrust Title Group will integrated into KV.  The combined organized of BridgeTrust Title Group and KV along with Truist's premium business, AFCO, will all combine to become a new Truist Insurance Holdings division.\nOn May 3, 2022, Truist announced it has acquired Long Game, a 12 person fintech startup that has a gamified finance mobile app.  The startup is a private company based in San Francisco.  It was founded in 2015 by co-founder and CEO Lindsay Holden.  Ms. Holden will continue to lead the team after the integration into Truist.  In October 2022 Truist announced that Truist Foundry has been formed out of the original Long Game team plus 30 engineers.  The purpose of the innovation group will be to build new offerings in emerging product categories.  Lindsay Holden, former CEO of Long Game,  will be the head of the group. Truist Foundry will have their office in San Francisco with engineers all over the US.\nOn August 10, 2022, Truist Insurance Holdings announced the purchase of BenefitMall, the nation's largest benefits wholesale agency.  The company will be integrated into the CRC Group within Truist Insurance Holdings.  The cost of the acquisition was not announced.  BenefitMall is expected to add $150 million of annual revenue.\nOn August 22, 2022, Truist announced the bank is purchasing the Zaloni Arena platform which has been created by Durham based firm Zaloni.  Truist believes this software will “accelerate its data governance, metadata management, advanced analytics, and artificial intelligence and machine learning (AI/ML) programs while driving investments in data talent ...,\" according to a press release. The software is centered around data lakes that allowsfor the collect of data from multiple sources such as structured data, data from sensors, and data from social media. The company's 20 employees will be joining Truist's Enterprise Data Office and the team will be based in Raleigh, North Carolina.\nOn September 6, 2022, Truist Insurance Holdings announced the $3.4 billion purchase of BankDirect Capital Finance from Texas Capital Bancshares Inc., the financial services company's first deal in the life insurance improvement industry. This was the largest deal ever for the former BB&T other than the merger which created Truist.  BankDirect Capital Finance is based in Illinois, it has 122 employees across 5 offices.  The deal is expected to close in the 4th quarter.  Mike Maguire, company CFO, stated this about the deal “Strategically, BankDirect effectively doubles our premium finance business, broadens our capabilities to include life insurance and expands our West Coast presence. … We estimate Truist Insurance Holdings will be the number two premium finance player in the market after this deal closes later this quarter”.\nIn the seven years, from 2016 to October 2022, Truist Insurance Holdings has made 11 insurance brokerage acquisitions, with its sale of WBAIS Inc. to Sompo International Holdings Ltd. in December 2020 it has 10 net acquisitions. According to S&P Market Intelligence this makes the company the second most active US banking acquirer of insurance brokerages during this period.  The first place bank was Boston based Eastern Bankshares Inc.\nIn February 2023 Truist announced they are selling a 20% stake in Truist Insurance Holdings Inc. to Stone Point Capital for $1.95 billion. The deal is expected to close in the second quarter of 2023.  Truist's rationale is to collaborate with Stone Point to grow the subsidiary. To facilitate collaborate once the sale is final a five member board will be created to oversee Truist Insurance Holdings.  It will be composed of four members from Truist Financial and one from Stone Point. In February 2024, Truist Financial agreed to sell the remaining of its Truist Insurance Holdings to an investor group led by Clayton, Dubilier & Rice and Stone Point Capital, valuing the insurance holding company at $15.5 billion.  On May 7, 2024, Truist completed the remaining sale of shares in Truist Insurance Holdings, which was renamed to TIH Insurance Holdings.\n\nBuildings and branches\nNaming rights\nTruist has naming rights for various sports venues and events, mostly inherited from predecessor companies:\n\nTruist Park (formerly SunTrust Park), a 41,000-seat ballpark, home to the Atlanta Braves\nTruist Stadium (formerly BB&T Stadium), a 21,500-seat stadium at North Carolina A&T State University used for football and track & field\nTruist Stadium (formerly BB&T Ballpark), a 5,500-seat ballpark in Winston-Salem, North Carolina\nTruist Arena (formerly The Bank of Kentucky Center and BB&T Arena) — a 10,000-seat multi-purpose arena at Northern Kentucky University\nTruist Field (formerly BB&T Ballpark), a 10,000-seat ballpark, home to the Charlotte Knights\nTruist Point (formerly BB&T Point), an 8,500-seat ballpark in High Point, North Carolina, also used for soccer\nThe Truist Championship, a PGA Tour golf event, usually held at Quail Hollow Club in North Carolina. (The 2025 season, the first with the Truist name, was moved to Philadelphia Cricket Club because the 2025 PGA Championship is at Quail Hollow.)\n\nSee also\nSunTrust Banks\nUptown Charlotte\nSouthern National Bank\nList of bank mergers in the United States\nList of largest banks in the United States\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Truist Financial Corp:",
  "clean_text": "Truist Financial Corporation () is an American bank holding company headquartered in Charlotte, North Carolina. The company was formed in December 2019 as the result of the merger of BB&T (Branch Banking and Trust Company) and SunTrust. Its bank operates 1,928 branches in 15 states and Washington, D.C., offering consumer, commercial, and investment banking, securities brokerage, asset management, mortgage, and insurance products and services. It is on the list of largest banks in the United States by assets; as of May 2025, it is the tenth-largest bank, with $523 billion in assets. History History of BB&T In 1872, Alpheus Branch and Thomas Jefferson Hadley founded the Branch and Hadley merchant bank in their hometown of Wilson, North Carolina. After many transactions, mostly with local farmers, Branch bought out Hadley's shares in 1887 and renamed the company Branch and Company, Bankers. Also in 1887, the bank moved to its new headquarters on Nash Street in downtown Wilson, North Carolina. Two years later, Branch, his father-in-law Gen. Joshua Barnes, Hadley, and three other men secured a charter from the North Carolina General Assembly to operate the Wilson Banking and Trust Company. After many more name changes, the company finally settled on the name Branch Banking and Trust Company. Branch remained an active member of the company until his death in 1893. The 1903 Branch Banking and Trust Company Building at Wilson was listed on the National Register of Historic Places in 1978. BB&T sold Liberty Bonds during World War I and grew to have more than $4 million in assets by 1923. BB&T Insurance Services was added in 1922 and a mortgage division was added in 1923. Even though banks across the United States failed as a result of the 1929 Stock Market Crash, BB&T survived; it was the only one to do so in the town of Wilson. History of Southern National Bank In 1897, the Bank of Lumberton was started by Angus Mclean in Lumberton, North Carolina, the predecessor of Southern National. The founding board members of the bank were Angus Mclean, Thomas McNeill, R.D. Caswell, C.B. Townsend, S.A. Edmund, R.L. Steele, W.L.F. Steel, T.C. Guthrie, H.B. Jennings. The board was composed of members from Lumberton, Rockingham, North Carolina, and Bennettsville, South Carolina. Thomas McNeill was selected to be the bank's first president. He resigned a year later, when he was appointed as a judge. After McNeill resigned Mclean became president. Mclean did not simply view himself as a banker, he wanted to build companies that had a good return on their investment, created jobs, and benefited the communities they operated within. In 1955 Hector MacLean, Angus Mclean's son, was named president. The Bank of Lumberton changed its names to Southern National Bank in 1959. In 1979, the Carolina State Bank of Gastonia, started in 1971, became part of Southern National. In 1982, Southern National took over Winston-Salem-based Forsyth Bank & Trust, led by Glenn Orr. In 1985, Southern National had assets of $1.5 billion. With the purchase of a former Northwestern Bank branch in Hickory, which had to be sold after the First Union-Northwestern merger, Southern National had 99 branches in 26 counties. In 1986, Southern National Corporation entered South Carolina with the $10 million purchase of Horry County National Bank of Loris. Later that year, Southern National announced the $5.6 million purchase of First Palmetto Bancshares Corp. of Columbia and the $9.75 million purchase of Capital Bank and Trust Co. of Belton. At the time, Southern National was North Carolina's seventh-largest banking company. Also in 1986, Southern National sold its Southern National Mortgage Co. to NCNB for an estimated $7 million. Southern National had not intended to sell the business but NCNB made a good offer, and the bank could use the money for its South Carolina purchases. NCNB had exited the mortgage business in 1981 to concentrate on interstate banking, though NCNB bought Bank of North Carolina in 1982 and sold that bank's mortgages to Southern National. In May 1989, Southern National announced its purchase of Allied Bankshares Inc. of Thomson, Georgia. The $59 million deal fell apart but would have been the first acquisition of a Georgia bank by a mid-sized N.C. bank. Another failed deal in 1990 would have given Southern National $1 billion in South Carolina assets and 53 offices in the state. NBSC had $540 million in assets, while Southern National Corp. had $3.4 billion and was N.C.'s fifth largest bank holding company. NBSC shareholders objected to the $53 million deal. In 1990, Hector MacLean retired from the bank. During his presidency, the bank changed its name, grew from $3 million in assets to $3.3 billion, and grew to 148 branches. MacLean's successor was Glenn Orr. Early in 1993, Southern National completed its purchase of First Federal Savings Bank in Winston-Salem, putting Southern National behind only Wachovia in Forsyth County deposits. Southern National had $4.5 billion in assets, $3.9 billion of those in North Carolina, and was the state's sixth largest banking company. The company's North Carolina banking operations began moving to Winston-Salem, though Orr and the corporate headquarters stayed in Lumberton. One reason for the move was the 20-story, 239,000-square-foot (22,200 m2) One Triad Park, which had 74,000 square feet (6,900 m2) of space Southern National could move into immediately. One of the other contenders, Greensboro, would not have a new building ready, and the bank would need a temporary home. With Southern National taking 80,000 square feet (7,400 m2) on eight floors, the building's name changed to Southern National Financial Center on May 3. Also in 1993, Southern National announced the purchase of Goldsboro-based East Coast Federal Savings Bank, with $256 million in assets, which Orr called \"one of the best savings banks in the state.\" The deal would make Southern National number one in deposits in Fayetteville, the state's fifth-largest banking market. In 1993, Southern National announced the acquisition of First Savings Bank, FSB, headquartered in Greenville, South Carolina. With just over $2 billion in assets, it was the third largest financial institution in South Carolina. Orr, along with BB&T Chairman John Allison, helped facilitate the Southern Nation BB&T merger. Merger with Southern National Bank In 1995, the bank merged with Southern National Bank, another bank with roots in the eastern part of the state. This gave BB&T 437 branches in 220 cities in the Carolinas and Virginia. The merged company became Southern National Corp., but all of its banking subsidiaries took the BB&T name. With $19 billion in assets, BB&T had the most North Carolina deposits and branches of any bank. Southern National head Glenn Orr and new BB&T chairman John Allison said the merger likely created a bank that would be too rich to be taken over by an out-of-state bank. Orr retired once the merger was complete. The headquarters became BB&T Financial Center in Winston-Salem, North Carolina. In 1997, Southern National Corp. took over United Carolina Bank, another eastern North Carolina–based bank, in a $985 million deal announced in November 1996. UCB had $4.5 billion in assets. 400 employees worked in Whiteville but despite losing the headquarters, the town would eventually have 500 BB&T employees working at a 250-employee call center and other operations. Starting September 22, 1997, 91 UCB branches began the process of changing to BB&T, and 67 other branches of the two banks closed starting in October because they were close to other BB&T locations. On May 19, 1997, Southern National Corp. changed its name to BB&T Corp. and its stock symbol SN to BBT. Acquisitions The bank continued to expand nationwide through the 1990s, purchasing Fidelity Financial Bankshares, First Financial of Petersburg, Maryland, Maryland Federal Bancorp, and Franklin Bancorporation. In 1998, BB&T acquired MainStreet Financial of Martinsville, Virginia, and Mason-Dixon Bancshares of Westminster, Maryland, and further expanded into Georgia and West Virginia after purchasing First Liberty of Macon, Georgia, and Matewan Bancshares.- In 2000, BB&T purchased One Valley Bancorp, which was itself formed from a combination of community banks throughout West Virginia. This move gave BB&T the largest bank presence in West Virginia. In 2002, BB&T completed its acquisition of MidAmerica Bancorp of Louisville, Kentucky. (Bank of Louisville) and AREA Bancshares Corporation of Owensboro, Kentucky. In 2003, BB&T completed its acquisition of First Virginia Banks of Falls Church, Virginia. In 2005, the bank acquired Main Street Banks of metro Atlanta for $622 million. In 2006, the bank acquired Coastal Federal Bank, based in Myrtle Beach. In late 2008, the bank accepted $3.1 billion in bailout money through the sale of preferred shares to the U.S. Treasury's Troubled Asset Relief Program. In June 2009, the bank repurchased the shares. In July 2008, the company acquired Puckett, Scheetz & Hogan. In December 2008, the company acquired J. Rolfe Davis. On August 14, 2009, the bank acquired Colonial Bank after its seizure by the FDIC. This acquisition added more than 340 branches in Alabama, Florida, Georgia, Nevada, and Texas, along with approximately $22 billion in assets. BB&T sold the Nevada branch to U.S. Bancorp in January 2010. The company acquired Atlantic Risk Management. In November 2011, the company acquired Precept, an employee benefits consulting firm. In July 2012, the bank acquired BankAtlantic, and its $2.1 billion in loans and $3.3 billion in deposits. The company also began selling flood insurance online. In December 2013, the bank acquired 21 Citigroup branches in Texas for $36 million, adding $1.2 billion in deposits. In September 2014, the bank acquired 41 more Citigroup branches, adding $2.3 billion in deposits. In June 2015, the bank acquired Bank of Kentucky for $363 million, which added $1.9 billion in assets and gave BB&T a presence in the Northern Kentucky-Cincinnati market and its first branches in Ohio. In August 2015, the bank acquired Susquehanna Bank for $2.5 billion, adding 240 branches and $18.7 billion in assets, and marking the bank's entry into Pennsylvania and New Jersey. In April 2016, the company acquired Swett & Crawford, a wholesale insurance broker. In April 2016, the bank acquired National Penn for $1.8 billion, which added 124 branches in Pennsylvania, New Jersey, and Maryland, $9.6 billion in assets, and $6.7 billion in deposits. On August 29, 2018, BB&T announced as many as 630 employees would move from its former corporate headquarters on West Nash Street in Wilson to a $35 million, 95,000-square-foot facility on Pine Street. On October 16, 2018, BB&T announced plan to move 500 employees into a 100,000-square-foot, $10 million building in Whiteville, N.C. In May 2022, Truist announced the organisation had acquired the 12-person San Francisco based, gamified financial technology start-up company Long Game Savings inc. The monetary value paid for the company has been left undisclosed. Insurance services BB&T has been in the insurance business since 1922. In the late '80s and early '90s the division was losing money. In 1990 Henry William and Wade Reece, a BB&T branch manager, met to discuss how to make the business profitable again. In 1995 the insurance services division made 6 acquisitions of insurance companies based across North Carolina. In July 1999 the insurance services division had acquired 24 insurance companies in North Carolina, 15 in Virginia, 3 in South Carolina, and 1 in Georgia. By 2010 BB&T's insurance division had grown to be the sixth largest broker in the US and the seventh largest in the world with $1 billion in annual revenue. The division has completed 60 mergers since 1999. In 2002 CRC was acquired, whose businesses include specialty and high risk clients. TAPCO and Southern Cross were also acquired and merged into CRC. In February 2008, the division acquired Burkey Risk Services. In April 2008 UnionBanc Insurance Services was acquired. In November 2009, the division acquired Oswald Trippe. In September 2011 Liberty Benefit Insurance Services, an agency operating in California, was acquired. In February 2012, the division acquired the life insurance, property, and casualty insurance divisions of Crump Group. In March 2014, the Insurance Services division acquired Woodbury & Co., an insurance broker operating in the Carolinas. In April 2014 Caledonian Insurance Group was, a company which specialized in insurance brokerage services for the aviation industry. In April 2015, BB&T subsidiary CRC Insurance Services acquired the assets of Napco LLC, a broker of catastrophic commercial insurance. In the June 2015 acquisition of Bank of Kentucky part of the deal was also American Coastal Insurance which increased BB&T's ownership in AMRisc. In April 2018 the insurance service division announced it was purchasing Regions Insurance Group which was owned by Regions Financial Corporation and the purchase was completed in July 2018. The business was based in Memphis, Tennessee and had offices in 10 states. This acquisition significantly added the insurance division's retail and whole lines of business. The acquisition provided BB&T Insurance Services with 60,000 new clients in multiple states. In June 2020 BB&T Insurance Holdings rebranded as Truist Insurance Holdings and moved its headquarters to Charlotte, North Carolina inside the Truist Center, Truist's corporate headquarters. Insurance services has been an important area of growth for Truist. In 2020 it accounted for 10% of Truist's revenue. Kelly King CEO of Truist stated the company's goal is to have the insurance division eventually make up 14% to 15% of Truist's revenue. In February 2024, Truist Financial agreed to divest the insurance business to an investor group led by Clayton, Dubilier & Rice and Stone Point Capital. History of SunTrust SunTrust Banks is the combination of three companies, two banks, one based in Georgia and one based in Florida, and an investment company. The three companies are Trust Company of Georgia, Sun Bank, and The Robinson-Humphrey Company. On September 21, 1891 what subsequently became the Trust Company of Georgia was started by John M. Green, Joel Hurt, H. L. Atwater, W. A. Hansell, T. J. Hightower, J. G. Oglesby, J. D. Turner, John B. Daniel, Joseph Hirsch, Leon Lieberman, Louis Wellhouse, A. J. McBride, D. O. Dougherty, W. A. Gregg, W. W. Draper, A. C. Hook, W. T. Ashford, George W. Brooke, C. I. Branan, and C. D. Montgomery. In November 1893, it restructured as a trust company and renamed itself Trust Company of Georgia. The earliest predecessor of Sun Bank was founded in 1911 as The People's National Bank in Orlando, Florida. In 1920, it became the First National Bank. In the early 1930s, during the Great Depression, the First National Bank and Trust Company failed. It was reorganized on Valentine's Day 1934 as the First National Bank at Orlando. In 1973, the bank merged with other Orlando banks to become SunBanks. As of December 31, 1973, it had three bank-related subsidiaries and total assets of $1.713 billion. In 1985 the Trust Company of Georgia and Sun Banks Inc. merge to form SunTrust Banks Inc. The Robinson-Humphrey Company was founded as a municipal bond shop by Roby Robinson in 1894. Robinson and William G. Humphrey, a bond trader from Toledo, Ohio, eventually incorporated The Robinson-Humphrey Co. in 1902. It blossomed into the leading investment banking firm in the South under Chairman Justus Martin Jr., who helped broaden its ties to Atlanta corporations, European clients and the firm's wealthy families who were brokerage clients. Martin was at the helm when Robinson-Humphrey commissioned the building of the bold Atlanta Financial Center in city's tony Buckhead business district in the early 1980s. In 1982, Martin sold Robinson-Humphrey to American Express, which was then run by another Atlanta deal maker and fellow Georgia Tech grad, James Robinson (no relation to Roby Robinson). Under AmEx, the firm operated as part of Shearson Lehman Brothers Inc. In 1993, deal maker Sandy Weill orchestrated a deal for Shearson's retail division, and Robinson-Humphrey was included in the sale, using the Smith Barney unit of Primerica Corp. The company was acquired by SunTrust in 2001. In June 2020 SunTrust Robinson Humphrey and BB&T Capital Markets combined to form the new Truist Securities. SunTrust merger On February 7, 2019, it was reported that Winston-Salem-based BB&T and Atlanta-based SunTrust Banks would come together in a merger of equals to create the eighth-largest US bank in the biggest bank deal since the 2008 financial crisis. BB&T would be the nominal survivor, and the merged bank would retain BB&T's stock price history. However, the merged bank would be headquartered in Charlotte, North Carolina, retaining significant operations in Winston-Salem. It was subsequently announced that Winston-Salem would be the bank's headquarters for community banking, while Atlanta would be the hub for wholesale / retail banking. SunTrust had been the last major bank headquartered in Atlanta, which had been the South's financial capital for much of the 20th century. On June 12, 2019 BB&T and SunTrust announced that the merged company would be called Truist Financial Corporation. This name resulted from research that included hiring Interbrand, seeking opinions of employees of both banks, and focus groups. The new name drew criticism from analysts and customers of both banks on social media. The merger was completed at midnight December 6, 2019. BB&T CEO Kelly King retained the same position with the new company. Customers of both banks were given free access to all of Truist's ATMs free of charge. The merged bank continued to operate under the BB&T and SunTrust names until the two banks' computer hardware, software and networking systems were streamlined, a process that was projected take as long as two years. Due to delays related to the COVID-19 pandemic, Truist announced in April 2021 that core conversion to combine the branches will be performed in early 2022. However, on the day the merger closed, SunTrust Bank merged into Branch Banking & Trust Company, forming Truist Bank as the merged company's legal banking entity. On December 11, 2019, Truist officially exercised its option to purchase Hearst Tower in downtown Charlotte from Cousins Properties. Truist moved its corporate headquarters to Hearst Tower, which was renamed to Truist Center. Truist had taken over 550,000 square feet (51,000 m2) of 965,000 square feet (89,700 m2) total. The bank announced the deal was completed March 31, 2020. However, due to the COVID-19 pandemic, further actions will be delayed. Truist unveiled its logo in January 2020, with two Ts representing touch and technology, and a shade of purple combining the blue of SunTrust and the burgundy of BB&T. In November 2020, the bank used helicopters to lift up four signs to the top of the former Hearst Tower. The \"Truist\" wordmark appears on the North Tryon Street and North College Street sides of the building, while the other two sides displayed the Truist logo. This signage has caused a lot controversy, even leading the building's original architect to refer to the signage as vandalism. In February 2020, Truist announced it would be launching a nonprofit foundation called the Truist Foundation. In March 2020, Truist announced it would vacate its former headquarters building in Winston-Salem except for a branch office and would move employees in its community/retail hub to other locations in the city, including the Park Building on Cherry Street and two locations on Stratford Road. The merger was estimated to cost $4 billion. Part of these costs would be severance for workers laid off, conversion costs, marketing and professional fees. However, through the merger the bank estimates that $1.6 billion in net cost savings will be achieved by the end of 2022. Part of this savings would be fewer branches. Truist intended to close 800 branches by the first quarter of 2022, and office consolidation would reduce space by 4.8 million square feet. Trademark Infringement Lawsuit On June 17, 2019 Truliant Federal Credit Union of Winston-Salem filed suit claiming \"trademark infringement\", complaining of potential confusion between the two companies’ respective names, including Truliant products with \"Tru\" in their names. The parties agreed to dismiss claims on August 5, 2020 and the lawsuit was closed the next day. On September 5, 2021, former SunTrust Banks' CEO Bill Rogers became chief executive officer of Truist Financial Corporation. Truist said it had completed changing signs on branches February 22, 2022. At that time former SunTrust customers had difficulty using debit cards. Slavery connections According to the book Genealogy of American Finance, BB&T was formally established in 1872 nearly a decade after slavery was abolished in the US, but the company's roots can be traced to 1805. Branch and Hadley, the founders of BB&T, Both worked on family farms before the Civil War. Alpheus Branch's father Samuel owned 58 slaves. Thomas Hadley's father owned 37 slaves. Both later served in the Confederate Army. When the war ended in 1865, the South was forced to accept their new fate. In July 2020, Truist Financial Corp issued a statement condemning racial injustice and acknowledging that the bank’s predecessor, BB&T Corp., had ties to businesses that benefited from slavery. Kelly King, chairman and chief executive of Truist, issued a 2022 employee memo addressing BB&T's slavery ties, but did not mention BB&T's founders Alpheus Branch and Thomas Hadley by name. The memo stated that \"we must consider our own past and acknowledge the role our heritage companies played over 100 years ago to perpetuate the atrocity of slavery and the repression of enslaved people, leading to systemic disadvantages their descendants have endured for generations...We deeply regret and denounce these shameful aspects of our history, both known and unknown.\" Post-merger deals On December 10, 2020 Truist Insurance Holdings announced it will acquire 5 companies in the fourth quarter. Those include: W. Brown & Associates Property & Casualty, Specialty Risk Associates, Program Insurance Management of Sarasota, Wellington Risk Holdings Inc. and Fidelis Group Holdings. These companies will add $100 million in revenue. In May 2021 Truist Insurance Holdings announced it will acquire Constellation Affiliated Partners in the third quarter. The insurance division plans to keep Constellation Affiliated Partners' 475 employees and merge them into CRC. The acquisition will add $160 million in revenue to Truist Insurance Holdings current revenue of $2.3 billion. Truist Insurance has three main segments: retail, insurance premium finance and wholesale. John Howard, CEO of Truist Insurance, stated this about the division's approach \"We are normally working on acquisition opportunities. We're in an industry that is consolidating, and we have a really good track record, I really think diversification is attractive, and we're already the most diversified insurance broker, so I want to continue to build on that. And for Truist overall, we provide diversification away from...credit businesses, so that we perform well throughout a variety of market cycles.\" On August 11, 2021, Truist announced it is acquiring Service Finance Co. for $2 billion. Service Finance provides point-of-sale financing 14,000 dealers and contractors for home improvement projects. Truist already has a point-of-sale financing business that includes Sheffield Financial, which provides financing for power equipment, power sports, and trailers. On March 3, 2022, Truist Insurance Holdings completed the acquisition of Kensington Vanguard National Land Services (KV). Kensington Vanguard National Land Services is one of the nation's largest independent national title companies. Truist's existing title business BridgeTrust Title Group will integrated into KV. The combined organized of BridgeTrust Title Group and KV along with Truist's premium business, AFCO, will all combine to become a new Truist Insurance Holdings division. On May 3, 2022, Truist announced it has acquired Long Game, a 12 person fintech startup that has a gamified finance mobile app. The startup is a private company based in San Francisco. It was founded in 2015 by co-founder and CEO Lindsay Holden. Ms. Holden will continue to lead the team after the integration into Truist. In October 2022 Truist announced that Truist Foundry has been formed out of the original Long Game team plus 30 engineers. The purpose of the innovation group will be to build new offerings in emerging product categories. Lindsay Holden, former CEO of Long Game, will be the head of the group. Truist Foundry will have their office in San Francisco with engineers all over the US. On August 10, 2022, Truist Insurance Holdings announced the purchase of BenefitMall, the nation's largest benefits wholesale agency. The company will be integrated into the CRC Group within Truist Insurance Holdings. The cost of the acquisition was not announced. BenefitMall is expected to add $150 million of annual revenue. On August 22, 2022, Truist announced the bank is purchasing the Zaloni Arena platform which has been created by Durham based firm Zaloni. Truist believes this software will “accelerate its data governance, metadata management, advanced analytics, and artificial intelligence and machine learning (AI/ML) programs while driving investments in data talent ...,\" according to a press release. The software is centered around data lakes that allowsfor the collect of data from multiple sources such as structured data, data from sensors, and data from social media. The company's 20 employees will be joining Truist's Enterprise Data Office and the team will be based in Raleigh, North Carolina. On September 6, 2022, Truist Insurance Holdings announced the $3.4 billion purchase of BankDirect Capital Finance from Texas Capital Bancshares Inc., the financial services company's first deal in the life insurance improvement industry. This was the largest deal ever for the former BB&T other than the merger which created Truist. BankDirect Capital Finance is based in Illinois, it has 122 employees across 5 offices. The deal is expected to close in the 4th quarter. Mike Maguire, company CFO, stated this about the deal “Strategically, BankDirect effectively doubles our premium finance business, broadens our capabilities to include life insurance and expands our West Coast presence. … We estimate Truist Insurance Holdings will be the number two premium finance player in the market after this deal closes later this quarter”. In the seven years, from 2016 to October 2022, Truist Insurance Holdings has made 11 insurance brokerage acquisitions, with its sale of WBAIS Inc. to Sompo International Holdings Ltd. in December 2020 it has 10 net acquisitions. According to S&P Market Intelligence this makes the company the second most active US banking acquirer of insurance brokerages during this period. The first place bank was Boston based Eastern Bankshares Inc. In February 2023 Truist announced they are selling a 20% stake in Truist Insurance Holdings Inc. to Stone Point Capital for $1.95 billion. The deal is expected to close in the second quarter of 2023. Truist's rationale is to collaborate with Stone Point to grow the subsidiary. To facilitate collaborate once the sale is final a five member board will be created to oversee Truist Insurance Holdings. It will be composed of four members from Truist Financial and one from Stone Point. In February 2024, Truist Financial agreed to sell the remaining of its Truist Insurance Holdings to an investor group led by Clayton, Dubilier & Rice and Stone Point Capital, valuing the insurance holding company at $15.5 billion. On May 7, 2024, Truist completed the remaining sale of shares in Truist Insurance Holdings, which was renamed to TIH Insurance Holdings. Buildings and branches Naming rights Truist has naming rights for various sports venues and events, mostly inherited from predecessor companies: Truist Park (formerly SunTrust Park), a 41,000-seat ballpark, home to the Atlanta Braves Truist Stadium (formerly BB&T Stadium), a 21,500-seat stadium at North Carolina A&T State University used for football and track & field Truist Stadium (formerly BB&T Ballpark), a 5,500-seat ballpark in Winston-Salem, North Carolina Truist Arena (formerly The Bank of Kentucky Center and BB&T Arena) — a 10,000-seat multi-purpose arena at Northern Kentucky University Truist Field (formerly BB&T Ballpark), a 10,000-seat ballpark, home to the Charlotte Knights Truist Point (formerly BB&T Point), an 8,500-seat ballpark in High Point, North Carolina, also used for soccer The Truist Championship, a PGA Tour golf event, usually held at Quail Hollow Club in North Carolina. (The 2025 season, the first with the Truist name, was moved to Philadelphia Cricket Club because the 2025 PGA Championship is at Quail Hollow.)"
}