{
  "ticker": "TGT",
  "cik": "0000027419",
  "company_name": "Target Corporation",
  "corrected_name": "Target Corporation",
  "wiki_title_used": "Target Corporation",
  "exists": true,
  "raw_text": "Target Corporation, doing business as Target, is an American retail corporation headquartered in Minneapolis, Minnesota. Target operates retail stores. It is the seventh-largest retailer in the United States and is a component of the S&P 500 Index.\nThe original Target retail store was co-founded by John Geisse and Douglas Dayton in 1962 for Dayton's in Roseville, Minnesota. Dayton's was renamed the Target Corporation in 2000. Target is notable for its focus on upscale, trend-forward merchandise at lower costs. Its stores typically sell general merchandise. Target's logo refers to the center of a shooting target, and its canine mascot is named Bullseye. The corporation also operates two criminal forensics laboratories.\n\nAs of 2024, Target is ranked No. 32 on the 2022 Fortune 500 list of the largest American corporations by total revenue. As of 2025, it operates more than 2,000 stores throughout the United States. Target has been consistently ranked as one of the most philanthropic companies in the U.S.\n\nHistory\nTarget Corporation is an American retail chain that operates large discount stores.\nIn 1962, John Geisse and Douglas Dayton founded and launched Target stores for the Dayton Company. The first Target store opened in May 1962 in Roseville, Minnesota, a suburb of St. Paul, Minnesota. By the end of that year, there were four Target stores, located in Roseville, Crystal, Duluth, and St. Louis Park, Minnesota, respectively.\nDayton-Hudson Corporation announced in January 2000 a name change to Target Corporation.\nTarget is the seventh-largest retailer in the United States and is a component of the S&P 500 Index. As of 2024, Target is ranked No. 32 on the 2022 Fortune 500 list of the largest American corporations by total revenue. As of 2025, Target operates nearly 2,000 stores in the United States.\n\nStore formats\nTarget\nTarget properties are roughly 135,000 square feet (12,500 m2) and sell general merchandise, including hardlines and softlines. While many Target stores follow a standard big-box architectural style, the company has focused on \"customizing each new store to ensure a locally relevant experience [...] that best fit the surrounding neighborhood's needs\" since August 2006. Initially, only SuperTarget locations operated Starbucks Coffee counters, although they were integrated into general-merchandise stores through their expanded partnership beginning in 2003. Many stores also feature Pizza Hut Express counters (usually in the self-service snack bar), along with Starbucks.\nTarget introduced the \"PFresh\" store prototype in 2008, which expanded its grocery selection in general-merchandise locations by upwards of 200%. Newly constructed stores that follow the PFresh format are roughly 1,500 sq ft (140 m2) larger than properties without groceries, although retain the Target branding because their offerings are considerably more limited than SuperTarget. PFresh sells perishable and frozen foods, baked goods, meat, and dairy. The company remodeled 109 stores accordingly in 2009, and renovated another 350 stores the following year. The company's decision to close their garden centers opened floor space for PFresh expansion and larger seasonal departments beginning in 2010.\n\nCVS Health\nOn June 15, 2015, CVS Health announced an agreement with Target to acquire all of Target's pharmacies and clinic businesses for around $1.9 billion. The Target pharmacies were rebranded as CVS Health pharmacies, which totaled 1,672 pharmacies in February 2016. The Target clinics were also rebranded as MinuteClinic. The acquisition of the Target pharmacies enabled CVS to expand its market into Seattle, Denver, Portland, and Salt Lake City.\n\nSuperTarget\nThe first Target Greatland location opened in Apple Valley, Minnesota, in September 1990. They were about 50% larger than traditional Target stores, and pioneered company standards, including an increased number of checkout lanes and price scanners, larger aisles, expanded pharmacy and photography departments, and a food court. Target Greatland locations have since been converted to stores following the PFresh format beginning in 2009.\n\nThe first SuperTarget hypermarket opened in Omaha, Nebraska, in 1995, and expanded upon the Target Greatland concept with the inclusion of a full grocery department. The company expanded their grocery assortment in 2003 and adopted the modified tagline \"Eat Well. Pay Less.\" (in reference to their tagline \"Expect More. Pay Less.\") in 2004. In the early 2000s, 43 locations (of nearly 100) featured E-Trade trading stations, although they were all closed by June 2003 after E-Trade determined, \"we were not able to make it into a profitable distribution channel.\"\nWhen comparing SuperTargets with rival Walmart Supercenter hypermarkets, then-chief executive Gregg Steinhafel opined that Walmart operates like \"a grocer that happens to also sell general merchandise,\" whereas the less aggressive expansion of SuperTarget stores reflects his view of Target's grocery effort as a \"high-impact, low-cost\" side project. The company operated 239 SuperTarget locations as of September 2015; they each encompass an estimate of 174,000 square feet (16,200 m2).\n\nIn an article written in August 2015, Target was quoted as saying, \"Big or small, our stores have one thing in common: they're all Target.\"\n\nSmall-format Target\nWhile typical Target locations are about 135,000 sq ft (12,500 m2), most \"small-format\" CityTarget stores are roughly 80,000 sq ft (7,400 m2). The first stores were opened in July 2012, in Chicago, Los Angeles, and Seattle; the 160,000 square feet (15,000 m2) location in Boston is the largest CityTarget and opened in July 2015. TargetExpress stores range from 14,000 to 21,000 sq ft (1,300 to 2,000 m2); the first opened in Dinkytown near the University of Minnesota in July 2014. Products in these flexible-format properties are typically sold in smaller packages geared towards customers using public transportation. Locations built in college communities often carry an extended home department of apartment and dormitory furnishings. In August 2015, Target announced that it would rename its nine CityTarget and five TargetExpress stores as Target beginning that October, deciding, \"Big or small, our stores have one thing in common: they're all Target.\" The first small-format stores under the unified naming scheme opened later that month in Chicago, Rosslyn, San Diego, and San Francisco. The company opened a 45,000 square feet (4,200 m2) store in the Tribeca neighborhood of New York in October 2016. In that same month, three other similar-sized stores opened in Philadelphia, Cupertino, California, and the area around Pennsylvania State University. Target opened a 22,000 sq ft (2,000 m2) store in Austin's Dobie Twenty21, adjacent to the UT-Austin campus.\nNearly all of its planned openings through 2019 were small formats, which are less than 50,000 sq ft (4,600 m2). The goal of these smaller-format stores is to win over the business of millennial customers. The nearly 30 newer locations were to be situated in college towns or densely populated areas.\n\nBrands and subsidiaries\nAs of 2018, Target has four subsidiaries: Target Brands, Inc., Target Capital Corporation, Target Enterprise, Inc., and Target General Merchandise, Inc.\n\nFinancial and Retail Services division\nFinancial and Retail Services (FRS), formerly Target Financial Services, original issued Target's credit cards, known as the Target REDcard (formerly the Target Guest Card), issued through Target National Bank (formerly Retailers National Bank) for consumers and through Target Bank for businesses. FRS also oversees GiftCard balances. Target launched its PIN-x debit card, the Target Check Card, which was later rebranded as the Target Debit Card. The Target Debit Card withdraws funds from the customer's existing checking account, and allows for up to $40 \"cash back\". The debit card allows guests to save 5% off each purchase. In late 2017, Target replaced its REDcard slogan, \"Save 5% Today, Tomorrow, & Everyday with Target REDcard\", when it rolled out new benefits for REDcard holders by offering exclusive products on Target.com and preorders with \"Everyday Savings. Exclusive Extras.\"\nIn October 2012, Target enter into an agreement with TD Bank in which TD Bank would handle Target's Visa and private label REDcard accounts for Target for a seven year period. The agreement was finalized in March 2013. The credit card management agreement was extended in 2022 until 2030 in which TD Bank is the sole issuer of Target's credit cards.\nTarget RedCard was rebranded Circle Card in April 2024.\n\nTarget Sourcing Services\nThis global sourcing organization locates merchandise from around the world for Target and helps import the merchandise to the United States, including garments, furniture, bedding, and towels. Target Sourcing Services has 27 full-service offices, 48 quality-control offices, and seven concessionaires located throughout the world, and employs 1,200 people. Its engineers are responsible for evaluating the factories that do business with Target Corporation for quality, labor rights, and trans-shipment issues. It was acquired by Target Corporation in 1998, was founded in 1916 as the Associated Merchandising Corporation, and was previously owned by the clients it served. TSS ceased operations in its department-store group, the division of the former Associated Merchandising Corporation that acted as a buying office for Saks, Inc., Bloomingdale's, Stage Stores Inc., TJ Maxx, and Marshalls.\n\nPrivate-label brands\nTarget Brands is the company's brand-management division that oversees the company's private-label products.\nBullseye (a white Bull Terrier), is Target's mascot. \n\nGood & Gather, a food and beverage brand, replaced Archer Farms and Simply Balanced.\nMarket Pantry, value grocery products\nDealworthy, a low-priced essentials brand\nBoots & Barkley, a pet food and supply line\nEmbark, an outdoor gear line of camping and travel equipment\nRoom Essentials, inexpensive, primarily flat-pack, furniture\nBrightroom, a line of storage solutions\nThreshold, a premium furniture line\nWondershop, a Christmas decoration brand\nHyde and Eek, a Halloween decoration brand\nup & up, offers essential commodities, including household, healthcare, beauty, baby, and personal-care products.\nXhilaration, a line of intimate and sleepwear, along with swimwear.\nOther private labels include brands launched in July 2016, during back-to-school sales.\n\nPillowfort, a children's line of bedding and room decor\nCat and Jack, a children's line of apparel and accessories\nCloud Island, a baby's line of bedding and clothing\nProject 62, a household-goods line placed alongside Room Essentials\nGoodfellow & Co., a clothing and personal-care line for men, with the name being an homage to their beginnings as Goodfellow Dry Goods\nA New Day, a clothing line for women\nJoyLab, a fitness-clothing line for women\nHearth and Hand, a home and lifestyle brand, in collaboration with designer Joanna Gaines\nEight Target private-label brands that launched in 2018:\n\nUniversal Thread, a denim lifestyle brand\nOpalhouse, eclectic home decor\nHeyday, a line of electronic accessories\nOriginal Use, male clothing brand targeting gen-Z and millennials\nWild Fable, women's clothing brand targeting gen-Z\nMade By Design, a homelines brand, made up of home basics such as towels, cooking utensils, glassware, plates, pots, kitchen gadgets, and more\nSmartly, essential a commodity brand, including household, healthcare, beauty, and personal-care products\nIn addition, Target released three new intimates, loungewear, and sleepwear brands for women on February 25, 2019:\n\nAuden, an intimates and lingerie exclusive brand\nStars Above, an in-house brand for sleepwear\nColsie, an intimates and loungewear brand\nOn January 9, 2020, Target announced its new activewear brand, All in Motion, an athleisure line with products for men, women, boys, and girls. The brand's logo plays homage to a previous Dayton's logo.\nOn March 9, 2021, Target announced a new brand called Favorite Day, a brand that sells bakery, snacks, candy, premium ice cream, cake-decorating supplies, and beverage mixers and mocktails items. It launched on April 5, 2021.\nFormer brands include:\n\nCherokee, children's and women's clothing: On September 10, 2015,  Target stores announced it would cease carrying the brand when its partnership with Cherokee Inc. expired on January 31, 2017. It was replaced by Cat & Jack.\nCirco,  toddler's and kids clothing: The brand was replaced by Cat & Jack, along with Pillowfort\nMerona, a clothing brand purchased by Target in 1991\nMossimo Supply Co., a clothing line, in partnership with the brand owner Iconix Brand Group\nGilligan & O'Malley product lines of intimates and sleepwear were discontinued after the release of the brands Auden, Stars Above, and Colsie.\n\nWebsite\nTarget.com owns and oversees the company's e-commerce initiatives, such as the Target.com domain. Founded in early 2000 as target.direct, it was formed by separating the company's existing e-commerce operations from its retailing division and combining it with its Rivertown Trading direct-marketing unit into a stand-alone subsidiary. In 2002, target.direct and Amazon.com's subsidiary Amazon Enterprise Solutions created a partnership in which Amazon.com would provide order fulfillment and guest services for Target.com in exchange for fixed and variable fees. After the company sold Marshall Field's and Mervyn's in 2004, target.direct became Target.com. The domain target.com attracted at least 288 million visitors annually by 2008, according to a Compete.com survey. In August 2009, Target announced that they would build and manage a new Target.com platform, independent of Amazon.com. This new platform was to launch in 2011, in advance of the holiday season. Prior to the announcement, Target and Amazon had extended their partnership until 2011. In January 2010, Target announced their vendor partners for the re-platforming project. These partners include Sapient, IBM, Oracle, Endeca, Autonomy, Sterling Commerce, and Huge, among others. The re-platformed Target.com officially launched on August 23, 2011, effectively ending the partnership with Amazon.com. Over the last few years, Target has been working to grow their fulfillment strategy via the orders placed through their website.. In November 2025, Target added an app within ChatGPT to provide a complete shopping experience using ChatGPT.\n\nFormer subsidiaries\nTarget Portrait Studio was a chain of portrait studios that were located in select Target stores. The chain, which was operated by Lifetouch, opened in 1996 and ceased operations on January 28, 2017.\nTarget Garden Center was a chain of garden centers that were located in Target, Super Target, and Target Greatland stores. Around 260 Target stores in California, Nevada, Arizona, and Florida had garden centers. All of Target's garden centers closed in September 2010. Target spokesperson Jana O'Leary claimed that the reason why their garden centers closed was because \"the garden centers don't provide significant value to our guests. Also, it's no longer a profitable business for us.\"\nTarget Canada was the chain of Target stores in Canada. It was formed in 2013 when Target acquired Zellers leases and converted them into Target stores. Target Canada was in operation for two years until the closure of all stores in 2015.  The retail chain racked up losses of $2.1 billion in its brief lifespan, and the Canadian news media termed Target's foray into Canada as a \"spectacular failure\", \"an unmitigated disaster\", and \"a gold standard case study in what retailers should not do when they enter a new market\".\n\nSupply chain\nAs of May 2016, Target Corporation operates 41 distribution centers across the United States. With the exception of vendor-supplied items, such as greeting cards and soda, these distribution centers ship items directly to Target stores. Also, unlike Walmart, Target's grocery selection does not come from their own distribution centers, but from the companies with whom Target has partnered.\nThe retail chain's first distribution center opened in Fridley, Minnesota, in 1969. It included a computerized distribution system and was known as the Northern Distribution Center. During this time, the chain consisted of 17 stores after having expanded into Oklahoma and Texas.\nOn August 9, 2004, Target announced to their suppliers that they were going to perform a trial on the effects of radio-frequency identification (RFID) on the efficiency of their supply chain management in the Dallas–Fort Worth metroplex. This trial involved one Target distribution center and 10 nearby Target stores. Here, RFID tags were placed on the bar codes of pallets and cartons to track the goods from the suppliers to the distribution center, and from the distribution center to the stores. As of 2009, RFID had been phased out of the Dallas–Fort Worth stores. In 2016, Target planned to roll out the RFID technology at all 1,795 of its store locations across the United States.\nTarget opened new distribution centers in 2006 (Rialto, California, DeKalb, Illinois) to support the growth of its stores. On January 27, 2009, Target announced the closing of its distribution center in Maumelle, Arkansas, the second-oldest in the company. The reason cited was the need to ensure that Target remained competitive in the long term. In June 2009, Target opened a new distribution center to supply more than 60 stores in three states.\nSuperTarget and PFresh stores require fresh produce and refrigerated and frozen items. Food-distribution centers owned by SuperValu have been used by Target for many years. In October 2003, SuperValu's facility in Phoenix, Arizona, was converted to serve Target exclusively. The same change was implemented at the SuperValu center in Fort Worth, Texas. A new distribution center was constructed by Target in Lake City, Florida, to serve the Southeast, but it was operated by SuperValu until 2011, when it transitioned to Target. A fourth center in Cedar Falls, Iowa, opened in 2009 and is unique in that it is located adjacent to a standard Target Distribution Center, each using the same dispatch office. Other warehouses owned by SuperValu are still used in other regions, but Target plans to replace those over the next few years. In Colorado, stores are serviced through FreshPack Produce Inc. of Denver. In the mid-Atlantic region/Philadelphia market, C&S Wholesale Grocers services the fresh produce, meat, dairy, bakery, and frozen-food needs to PFresh stores. Target partnered with Swisslog Holding to use a semiautomated monorail picking system called the CaddyPick system for use in the food-distribution centers.\nThe company operates four facilities to receive shipments from overseas manufacturers and suppliers. They are located near ports at Rialto, California; Savannah, Georgia; Lacey, Washington; and Suffolk, Virginia. Merchandise received is sent directly to Regional Distribution Centers. Internet sales orders from the Target Direct division, which operates from the Target.com website, are processed by the facility in Woodbury, Minnesota, with some support from Savannah, Georgia, and other vendors. New centers opened in Ontario, California, and Tucson, Arizona, in 2009. In 2021, during the COVID-19 pandemic, Target supply chain and inventory teams worked proactively to move products fast, and they hired more than 30,000-year-round supply chain team members to bolster their team.\nSeveral former Target Supply Chain Executives have been named Chief Supply Chain Officers at other large organizations across the United States. Notables are:\n\nArthur Valdez – Starbucks,\nAlexis Depree – Nordstroms,\nColin Yankee – Tractor Supply,\nSean Halligan – RNDC,\nAmanda Martin – Neiman Marcus,\nKristin Bauer – Footlocker,\nMoid Alwy – ATD,\nMario Rivera – CVS,\nDerek Hornsby – Michaels Stores,\nMark Irvin – Best Buy\n\nDistribution centers\nCorporate affairs\nHeadquarters\nTarget Corporation has its headquarters on Nicollet Mall in Minneapolis near the site of the original Goodfellows store. The complex includes Target Plaza North and Target Plaza South. Ryan Companies developed the complex, and Ellerbe Becket served as the architect. Target had the roughly $260 million complex developed to provide one location of office space for 6,000 employees. The 14-story Target Plaza North has 600,000 square feet (56,000 m2) of office and retail space, while the 32-story Target Plaza South has 1,250,000 square feet (116,000 m2) of space. In October 2014, Target completed construction of an 1,600,000 square feet corporate campus in Brooklyn Park, Minnesota, called Target Northern Campus.\nBrian Cornell serves as board chairman and CEO of Target Corporation. In January 2016, Cornell began making home visits in an effort to understand better the needs and desires of his customers. In January 2016, Target fired Tina Tyler from her job as chief stores officer. She was replaced with long-time employee Janna Potts. In August 2025, Target announced Cornell would be replaced by long-time insider and current COO, Michael Fiddelke in February 2026. Cornell will become executive chairman of the board.\nOn August 26, 2020, the headquarters building was broken into and damaged during the Minneapolis false rumours riot. Three Minnesota residents were later convicted of federal arson charges for setting fires inside the building during the riot.\n\nDiversity\nThe company states that \"individuality may include a wide spectrum of attributes such as personal style, age, race, gender, ethnicity, sexual orientation, language, physical ability, religion, family, citizenship status, socio-economic circumstances, education, and life experiences.\"\nIn February 2006, the National Federation of the Blind (NFB) filed a class action discrimination lawsuit in Northern California's Alameda County Superior Court, claiming that Target's commercial website contains \"thousands of access barriers that make it difficult, if not impossible, for blind customers to use.\" Target Corporation settled the lawsuit in October 2008, paying $6 million and agreeing to work with the NFB over the next three years improving the usability of the Target.com site.\nOn August 24, 2009, the United States Equal Employment Opportunity Commission (EEOC) filed a discrimination lawsuit against Target Corporation for unlawfully denying reasonable accommodation to an employee with multiple disability-based impairments and substantially reducing his work hours due to the medical conditions. According to the claims in the EEOC press release, Target's actions violated Title I of the Americans With Disabilities Act (ADA) and Title I of the Civil Rights Act of 1991.\nIn February 2012, the company extended the team member discount to same-sex partners of employees. It had received a 100 on the Human Rights Campaign Corporate Equality Index Score, prior to donating funds to Minnesota Forward.\nThe National Association for the Advancement of Colored People has repeatedly given Target failing grades on its annual Economic Reciprocity Initiative report card, a measure of the company's \"commitment to the African-American citizenry\". In 2003 and 2005, the NAACP has rated Target an \"F\" on this report; in 2004, Target was rated a \"D−\". In 2006, when Target was asked why it didn't participate in the survey again, a representative explained, \"Target views diversity as being inclusive of all people from all different backgrounds, not just one group.\"\nIn September 2020, Target published a \"Workforce Diversity Report\" indicating that 50% of Target's 350K employees are people of color, and over half are women. The report also stated that  within the corporate leadership team, people of color account for 24% of the team and 42% are women. On a retail level, 33% of stores are managed by people of color, with more than half of management positions occupied by women.\nBrian Cornell publicly stated that the commitment to programs at Target to support diversity, equity and inclusion following the murder of George Floyd by police in Minneapolis. He stated “I recognize that it’s time to take it to another level, and that as CEOs, we have to be the company’s head of diversity and inclusion.\" One of the created programs intended to help Black entrepreneurs develop, test, and scale products to sell at mass retailers promised to spend more than $2 billion with Black-owned businesses by 2025.\nIn 2025, Target announced an abrupt change to these policies following an executive order from President Trump ordering a dismantling of the federal government’s diversity and inclusion programs. Target announced a halt to many programs designed to increase diversity equity and inclusion at Target. The company also said it would no longer participate in external diversity surveys, including the Human Rights Campaign’s Corporate Equality Index.\nFollowing Target's statement to roll back on equitable hiring practices, Twin Cities Pride announced Target would no longer be participating in the 2025 Pride Festival.\n\nPhilanthropy\nTarget is consistently ranked as one of the most philanthropic companies in the US. It ranked No. 22 in Fortune magazine's \"World's Most Admired Companies\" for 2010, largely in part to the donation efforts of the company as a whole. According to a November 2005 Forbes article, it ranked as the highest cash-giving company in America in percentage of income given (2.1%). Target donates around 5 percent of its pre-tax operating profit; it gives over $3 million a week (up from $2 million in years prior) to the communities in which it operates. It also gives a percentage of charges from its Target Visa to schools designated by the cardholders. To date, Target has given over $150 million to schools across the United States through this program.\nFurther evidence of Target's philanthropy can be found in the Target House complex in Memphis, Tennessee, a long-term housing solution for families of patients at the city's St. Jude Children's Research Hospital. The corporation led the way with more than $27 million in donations, which made available 96 fully furnished apartments for families needing to stay at St. Jude over 90 days.\nTarget has a no-solicitation rule at its properties, as it seeks to provide a \"distraction-free shopping experience for its guests.\" Exemptions to this policy were previously made for the Salvation Army red kettles and bell-ringers outside Target stores during the holidays through Christmas. In 2004, however, Target asked the organization to explore alternate methods to partner with Target. Target donates to local Salvation Army chapters through its grant program and annually to the United Way of America (the Salvation Army is a member of the United Way coalition).\nIn 2005, Target and the Salvation Army created a joint effort called \"The Target/Salvation Army Wish List\", where online shoppers could donate goods to the organization for hurricane victims by buying them directly from Target.com between November 25, 2005, and January 25, 2006. In 2006, they created another joint effort called \"The Target/Salvation Army Angel Giving Tree\", which is an online version of the Salvation Army's Angel Tree program; in addition to donating proceeds made from the sales of limited edition Harvey Lewis angel ornaments within Target's stores. During the Thanksgiving holiday of 2006, Target and the Salvation Army partnered with magician David Blaine to send several families on a shopping spree the morning of Black Friday. The challenge held that if Blaine could successfully work his way out of a spinning gyroscope by the morning of Black Friday, then several families would receive $500 shopping certificates. The challenge was completed successfully by Blaine.\nDuring disasters, Target has been a major benefactor for relief efforts. Target provided monetary and product donations during the September 11 attacks; it also donated money for relief efforts for the 2004 tsunami in South Asia and donated $1.5 million (US) to the American Red Cross in the aftermath of Hurricane Katrina in 2005. It also allowed its store properties in the affected area to be used as command centers for relief organizations and donated supplies such as water and bug spray.\nTarget will often donate its unused, returned or seasonal merchandise (particularly clothing) to Goodwill Industries.\n\nEnvironmental record\nIn 2007, Target Corporation agreed to reduce its sales on all materials containing polyvinyl chloride (PVC). Testers found toxic lead and phthalates and large amounts of PVC in toys, lunch boxes, baby bibs, jewelry, garden hoses, mini blinds, Christmas trees, and electronics. Several studies have shown that chemicals in vinyl chloride can cause serious health problems for children and adults. The University of Illinois Medical Center in Chicago states that people who use products containing PVC can become exposed with harmful toxic phthalates and lead, which eventually can become a big contributor with dioxins. Lois Gibbs, executive director of the Center for Health, Environment, and Justice, stated, \"Target is doing the right thing by moving away from PVC and switching to safer alternatives.\" Other companies reducing the PVC on their shelves include Walmart, Microsoft, Johnson & Johnson, Nike, and Apple. Target is beginning to reduce energy use with energy-efficient storefronts and reducing waste with recycling programs. All Target stores in the United States use plastic carts with metal frames. In mid-2006, Target took it a step further when it began introducing a newer cart design made entirely of plastic. It also uses the same design in its hand-use baskets.\nTarget released a 13-page report in 2007 that outlined their current and future plans for becoming more earth-friendly according to LEED. Such efforts include installing sand filtration systems for the stores' wastewater. Recycling programs will be aimed at garment hangers, corrugated cardboard, electronics, shopping carts, shrink wrap, construction wastes, carpeting, and ceiling tiles and roofing materials. All stores in Oklahoma will be partnered with Oklahoma Gas & Electric to exclusively use wind power for all Target stores to reduce greenhouse gas emissions. Stores nationwide use only LED and fluorescent lights and low-flow restrooms that reduce wastewater by 30%. Some Target stores are installing roof gardens or green roofs, which absorb stormwater and cut down on surface runoff, mitigate temperature fluctuations, and provide habitats for birds. There are currently four green-roof Target stores in Chicago.\nTarget carries over 700 organic and alternative products from brands such as Archer Farms, Burt's Bees, and Method Products. They also sell clothes made from organic cotton, non-toxic cleaners, low-energy lighting and electronics, non-toxic and non-animal tested cosmetics, and furniture made from recycled materials. As of June 2007, Target has been offering reusable shopping bags as an alternative to disposable plastic bags. Target gift cards are made from corn-based resins. All of the stores' packaging is done with a modified paperboard/clamshell option and has goals for phasing out plastic wrap completely.\nIn collaboration with MBH Architects, Target's first \"green\" building was a 100,000+ square foot Target store built in 1995 in Fullerton, California. It was a part of the EPA Energy Star Showcase for its use of skylights that cut the original energy consumption by 24% with a 5-year payback. Target and MBH Architects were awarded the \"Green Lights Partner/Ally of the Year Award\".\nTarget is the only national retailer employing a Garment Hanger reuse program, which keeps millions of pounds of metal and plastic out of landfills. In 2007, this program prevented 434 million hangers from entering landfills.\nOn June 15, 2009, the California Attorney General and 20 California District Attorneys filed a lawsuit in Alameda County alleging that Target stores across the state have been illegally dumping hazardous wastes in landfills.\nOn October 1, 2009, Target Corporation agreed to pay a $600,000 civil penalty for importing and selling a variety of toys with lead paint levels that were higher than is legally allowed. The Consumer Products Safety Commission alleged that \"Target knowingly imported and sold the illegal Chinese-made toys between May 2006 and August 2007.\" A similar problem occurred a few months later in February 2010, when Target pulled Valentine's Day \"message bears\" from its shelves at the request of the California attorney general's office. The bears, which were manufactured in China, contained more lead than is permissible under federal law for children under 12.\nA class action suit was filed in 2014 in the U.S. District Court for the Northern District of Ohio, on behalf of consumers in Ohio that purchased Target‑brand wet wipes. The lawsuit filed against Target Corporation alleges the retailer misled consumers by marking the packaging on its up & up brand wipes as flushable and safe for sewer and septic systems. The lawsuit also alleges that so-called flushable wipes are a public health hazard because they are alleged to clog pumps at municipal waste-treatment facilities.\nOn April 27, 2017, Target announced a corporate goal to install rooftop solar panels in 500 buildings by 2020 with each project reducing 15 to 40 percent of a property's energy needs. Target also unveiled its first solar installation in shape of the bullseye logo at a distribution center in Phoenix, Arizona.\nOn December 5, 2018, Alameda County District Attorney O'Malley announced fining Target $7.4 million for putting illegal e-waste, medical supplies and private information into the garbage.\nOn April 23, 2018, Target announced plans to accelerate their electric vehicle program by installing charging stations at more than 600 parking spaces at over 100 sites across 20 states.\nOn March 17, 2022, Target announced its first net zero energy store in Vista, California.\n\nCustomer privacy\nIn December 2013, a data breach of Target's systems affected up to 110 million customers. Compromised customer information included names, phone numbers, email and mailing addresses. In March 2015, Target reached a class-action settlement with affected consumers for $10 million (plus class-action attorney fees). In May 2016, Target settled with affected banks and credit unions for $39 million (plus class-action attorney fees), of which $19 million would be disbursed by a MasterCard program.\n\nInternational operations\nTarget only operates in the United States as of 2025. Though previously, from 2013 to 2015, Target operated stores in Canada. Other companies that are under the name of \"Target\" outside of the United States, most notably that of Target Australia, are not owned or operated by the Target Corporation.\n\nLabor relations\nIn 2015, Target followed Walmart in raising its minimum wage to $9 per hour. Two years later, Target announced that the minimum hourly wage would be increased to $11 by October 2017 and pledged to raise it to $15 (referred to as \"living wage\" by labor advocates) by 2020. By April 2019, the company announced that it was on track to meet this goal, increasing its minimum wage to $13 per hour. In June 2020, Target announced ahead of schedule that the minimum hourly wage would rise to $15 permanently, after previously announcing it to be temporary through July 4, 2020. As a thank you to store and distribution center team members who worked during the COVID-19 pandemic in the United States, Target also announced a one-time $200 bonus to be paid towards the end of July 2020. During the COVID-19 pandemic, Target began providing additional team member resources to help team members meet essential needs, obtain virtual healthcare, and take a paid leave of absence (based on certain medical or physical criteria that may cause exposure to coronavirus). In February 2021, Target began offering all of its hourly employees up to four hours of pay when they get both doses of the COVID-19 vaccine as well as covering the cost of a Lyft ride, up to $15 each way, to the vaccination appointment. In August 2021, Target announced a $200 million investment to offer debt-free degrees to more than 340,000 full-time and part-time team members at stores, distribution centers, and headquarters locations.\nIn December 2021, an employee at a Target store in Indianapolis, Indiana named Andrew Stacy filed an unfair labor practice charge against the company with the National Labor Relations Board, alleging that a manager at the store confiscated union flyers that Stacy was distributing with a co-worker and then interrogated the co-worker about the flyers.\n\nCorporate identity\nLogo\nTarget's logo mimics the bullseye used by marksmen.\n\nDifferentiation from competitors\nTarget is notable for its focus on upscale, trend-forward merchandise at lower costs. Douglas J. Dayton, one of the Dayton brothers, explained John Geisse's concept:\n\n\"We will offer high-quality merchandise at low margins because we are cutting expenses. We would much rather do this than trumpet dramatic price cuts on cheap merchandise.\"\nAs a result, Target stores tend to attract younger customers than Walmart, among other competitors. The median Target shopper is 40, the youngest of all major discount retailers that Target competes directly against. The median household income of Target's customer base is roughly $64,000. Roughly 76% of Target customers are female, and more than 43% have children at home. About 80% have attended college and 57% have completed college.\nIn October 2008, Target announced plans to fight the perception that their products are more expensive than those of other discount retailers. It added perishables to their inventory, cut back on discretionary items, and spent three-quarters of their marketing budget on advertising that emphasizes value and includes actual prices of items featured in ads. Target also planned to slow its expansion from about 100 stores a year down to 70 stores a year.\nTarget stores are designed to be more attractive than large big-box stores by having wider aisles, drop ceilings, a more attractive presentation of merchandise, and generally cleaner fixtures. Special attention is given to the design of the store environment: graphics reinforce its advertising imagery, while shelves are dressed with contemporary signage, backdrops, and liners, often printed on inexpensive material such as paper, corrugated and foam boards. Some stores, particularly those in the vicinity of major airports, have a bullseye painted on the roof that can be seen from above: the stores in East Point, Georgia, near Hartsfield-Jackson Atlanta International Airport; Rosemont, Illinois, near O'Hare International Airport; Potomac Yard, Virginia, near Ronald Reagan Washington National Airport; College Point, New York (Queens), east of LaGuardia Airport; and Richfield, Minnesota, adjacent to Minneapolis–St. Paul International Airport are among such locations. The location in Inglewood, California, near Los Angeles International Airport and SoFi Stadium, has an LED bullseye logo on its roof, made out of solar panels.\n\nTarget stores do not sell firearms. In the early 1990s, they ceased sales of toy guns that looked realistic and limited its toy gun selection to ones that were brightly colored and oddly shaped. In 2014, Target also \"respectfully\" asked their guests to leave any firearms at home when visiting the store. They do not sell tobacco products and have not sold cigarettes since 1996.\nMost Target stores do not play music, but may be changing that from 2017 with a rebranding process, adding music to the rebranded stores.\nIn July 2025, Target discontinued its long-standing competitor price-matching policy, effective July 28, ending the practice of matching prices with retailers such as Amazon and Walmart. The retailer now limits price matching to its own in-store, online, and Target Plus prices within 14 days of purchase, citing customer feedback and a focus on internal pricing consistency.\n\nTargét\nSome people jokingly give Target the pseudo-French pronunciation  tar-ZHAY, as though it were an upscale boutique. Though this practice is often attributed to Oprah Winfrey's usage on her television show, it is first attested in 1962, the year the first Target store opened. Target once sold a line of shoes called \"Miss Targé;\" this was reinforced by a 1980s television advertisement starring Didi Conn. This pronunciation has also led some people to incorrectly believe that the company is French-owned. In recognition of the nickname's popularity and cachet, Target Corporation licensed its new name and logo to Brand Central LLC in 2006, complete with an accent over the letter \"E\" for a new line of clothing aimed at more upscale fashion customers. The line, \"Targét Couture\", was originally sold in Los Angeles-based store Intuition, which dealt in high-end brands.\n\nNomenclature\nTarget uses a practice that was derived in 1989 from The Walt Disney Company by calling its customers \"Guests\", its base-level employees \"Team Members\", and its supervisors \"Team Leaders\". Also, managers are known as \"Executive Team Leaders (ETLs)\", \"Senior Team Leaders (SRTLs)\", or \"Service and Engagement Team Leaders (SETLs)\", and the Store Manager is known as the \"Store Team Leader (STL)\", Further up the chain of command are \"District Team Leaders (DTL)\", \"Group Team Leaders (GTL, sometimes also Group Vice President)\", \"Regional Team Leaders (RTL, sometimes also Regional Vice President)\", and corporate-level executives.\nThis practice began to be revised in 2018 and became more widespread in 2019 as the Group Team Leader became the Group Operations Director. District Team Leader became the District Senior Director. The Store Team Leader became Store Director. Executive Team Leaders were shortened to Executive Team Lead. Other Team Leaders retained their title though some of the department names changed such as Guest Service Team Leader was renamed Service & Engagement Team Leader. Front of store team members were renamed Guest Advocates. Specialty areas in Style, Beauty and Tech are considered Consultants. Other areas such as General Merchandise, Presentation, Inbound, Fulfillment, Food Service and Reverse Logistics are considered Experts, and Assets Protection and Security Officers are Specialists. Distribution centers and the supply chain including corporate office refers to its employees as Team members, Operations manager, Senior operations manager, Distribution Director, Problem Solvers, and Leads.\n\nProduct lines and partnerships\nTarget has many exclusive deals with various designers and name brands, including Finnish design company Marimekko; architect Michael Graves; athletic wear company Converse; Portland-based undergarment designer Pair of Thieves; Italian fashion label Fiorucci; fashion designers Lilly Pulitzer, Liz Lange, Mossimo Giannulli, and Isaac Mizrahi, among others. To further increase its fashion profile, Target also created its fashion-forward Go International line, which hires famous designers to design collections available only for a few months.\nAfter hiring architect Michael Graves to design the scaffolding used to renovate the Washington Monument and contributing US$6 million to the restoration plan, Target introduced its first designer line of products in 1999, the Michael Graves Collection of housewares and home decor products. Walmart and Kmart have followed Target's lead by signing exclusive designers to their stores as well. Target also partners with well-established national brands to create exclusive collections for its stores.\nIn 2005, Target introduced a major revision of prescription bottles, which it calls the ClearRx system. The redesigned bottles are color-coded, flattened-out and turned upside down, providing more room for the label. This system was based on the patent by student Deborah Adler and was named one of TIME's \"Most Amazing Inventions of 2005\". After Target sold their in-store pharmacy and clinic operations to CVS Health in December 2015, CVS discontinued the use of ClearRx.\nSometimes manufacturers will create red-colored items exclusively for Target.  In 2002, Nintendo produced a red special edition variant of the Game Boy Advance, which featured the Target logo above the screen.\nIn 2005, IFC began a partnership with Target to promote a selection of independent films, both in Target stores and on IFC Monday nights at 9:00 pm Eastern. Originally titled IFC Cinema Red, the promotion was rebranded on-air as The Spotlight in 2007. The in-store headers refer to the selected titles as IFC Indies – Independent films chosen for Target by the Independent Film Channel.\nIn 2016, Target began to enforce gender neutrality in its marketing of toys, and stopped explicitly listed specific toys as being for \"boys\" or \"girls\". This change came after the store stopped color coding toy aisles with pink and blue for \"girls\" or \"boys\", respectively. This practice was expanded with the February 2016 launch of new children's decor line, Pillowfort, which replaced its Circo brand and features more gender-neutral designs and color schemes.\nIn February 2021, Target announced it would begin opening \"mini Apple shops\" in some of its stores.\n\nGift cards\nThe Target GiftCard is the retailing division's stored-value card or gift card. Target sells more gift cards than any other retailer in the United States and is one of the top sellers, by dollars and units, in the world. The unique designs of their cards contribute to their higher sales, as well as Target's policy of no expiration dates or service fees. Past and current designs include lenticular, \"scratch and sniff\" (such as peppermint during the Christmas season), glow in the dark, LED light-up, a gift card on the side of a bubble blower, a gift card that can function as a CD-ROM, and even a gift card that allows the sender to record a voice message. A current environmentally friendly gift card is made from bioplastic manufactured from corn. Target rolled out a new MP3 player gift card for the 2006 holiday season. It holds 12 songs and must be purchased with an initial value of at least $50.\nBeginning in January 2010, Target Stores rolled out Mobile GiftCards, through which one can produce a GiftCard barcode on any web-capable cell phone. This data matrix barcode can be scanned at a Target POS like any physical card barcode, and balances can be stored, retrieved, and gifted with the convenience of a cell phone.\nSome of these unique design ideas are patented, and these patents are assigned to the Target Brands subsidiary. For example, some such Target GiftCard designs feature a wooden front side. On May 24, 2005, the United States Patent and Trademark Office granted U.S. patent D505,450 for the \"ornamental design for credit or stored value card with wood layer\" to inventors Amy L. Lauer and John D. Mayhew. U.S. patent 7004398, for the \"stored-value card assembly including a stored-value card, an edible product, and a wrapper\", was granted to Michael R. Francis and Barry C. Brooks on February 28, 2006. Both patents have been assigned by their inventors to Target Brands, Inc.\nTarget GiftCards are also collector's items. Some of the first gift cards issued are valued at over $300 (even though the card does not have any money on it). Every year, Target introduces new Holiday GiftCards. In 2007, Target's Holiday GiftCards featured a wind-up flashlight, a musical gift card, a gift card that lights up, and a scented gift card.\n\nTarget forensic services\nIn 2006, The Washington Post revealed that Target was operating two criminal forensics laboratories, one at its headquarters and the other in Las Vegas. Originally, the lab was created with the role of investigating internal instances of theft, fraud, and other criminal actions that have occurred on its own properties. Eventually, the company began offering pro bono services to law enforcement agencies across the country. Target's Forensic Services has assisted agencies at all levels of government, including such federal agencies as the Bureau of Alcohol, Tobacco, Firearms and Explosives, the Federal Bureau of Investigation, and the United States Secret Service.\n\nCriticism and controversy\nAnimal welfare concerns\nIn 2011, Mercy for Animals uncovered apparent animal abuse at a Target egg supplier in Minnesota, Sparboe Farms. The investigation received international media attention, including on ABC's Good Morning America, World News Tonight with Diane Sawyer, and 20/20. As a result of the investigation, Target discontinued its relationship with the supplier.\nIn January 2016, Target announced that it would discontinue sourcing eggs from hens confined in battery cages by 2025. As of July 2024, Target reported that 68% of its egg sales were cage-free but stated that it would not meet its 2025 commitment. This prompted criticism by animal welfare and consumer activist organizations that urged the company to uphold its pledge. In July 2025, activists with Humane World for Animals demonstrated outside Target headquarters to deliver petition signatures demanding that the company set a new timeline to end the use of battery cages and gestation crates in its supply chain.\n\nDEI rollback and boycott\nShortly after the start of the second presidency of Donald Trump, Target was one of dozens of Fortune 500 companies that backtracked on their diversity, equity, and inclusion (DEI) policies in response to conservative court decisions, pressures from activists and right-wing legal groups, as well as the Trump administration and its policies. Many people took to social media to protest the decision, and the daughters of one of the founders called the backtrack of the policies a betrayal. In February 2025, a forty-day consumer boycott was announced. It was reported on February 28 that Target lost $12.4 billion in market value after the stock value dropped by $27.27 per share by the end of February.\nA class action lawsuit was filed on behalf of the City of Riviera Beach Police Pension Fund, containing allegations that Target defrauded investors by issuing false and misleading statements concerning DEI initiatives, along with environmental, social, and governance policies.\n\nLGBTQ\nPop star Lady Gaga was expected to give the store an exclusive expanded edition of her then upcoming album Born This Way, but she ended the deal after discovering that then-CEO Gregg Steinhafel donated to a political action group that supported an anti-gay candidate. Target apologized and began its outward support of the  LGBTQ community. In 2012, it began by stocking gay pride merchandise and donating half of the profits to GLSEN. In 2014, it began featuring LGBTQ individuals and couples in national advertising. In 2015, Target debuted their #takepride campaign, and partnered with GLSEN to produce a mini-documentary celebrating their 25th anniversary. Target sponsors many LGBTQ non-profits including Human Rights Campaign, GLSEN, GLAAD, Family Equality Council, NGLCC and the Williams Institute. For the last three years, Target has been the presenting sponsor of GLAAD's Spirit Day. In 2017, Target was the founding partner of New York City's Pride Youth. Target was ranked by LGBTQ Consumers as a favorite brand in 2016 and 2017 by Community Marketing Inc's 10th and 11th Annual LGBT Community Surveys. Target has a score of 100 on the Human Rights Campaign Corporate Equality Index for their corporate policies and practices pertinent to lesbian, gay, bisexual, transgender and queer employees. In 2019, Target donated $100,000 to GLSEN.\nIn 2025, Target — previously a platinum sponsor of New York City's Heritage of Pride annual Pride Week — donated as a \"silent partner\" to avoid publicity.\n\n2023 Pride Month merchandise backlash\nIn May 2023, Target received threats against team members in response to the stores' Pride Month merchandise. Several viral posts on social media incorrectly claimed that \"tuck-friendly\" products were being sold to children, which sparked outrage among anti-LGBTQ groups. The products were quickly withdrawn from stores in Southern states, to avoid a \"Bud Light situation\".\nIn May 2024, Target announced they would reduce the number of stores that sell their Pride Month collection for the safety of their employees after the backlash and threats received in 2023. The corporation sold their Pride Month collection online for customers who do not live near one of the select stores that carried the merchandise.\n\nConsumer data usage\nOn February 12, 2012, The New York Times published an article which detailed a statistical model that Target had deployed which used customer data to assign guests a \"pregnancy prediction score\". This article contained an account of a father who complained to a store manager about his teenage daughter receiving pregnancy-related coupons and subsequently discovered that his daughter was actually pregnant. This anecdote received wide coverage in other media outlets. The public backlash focused on privacy concerns and companies using data mining techniques to infer sensitive information about customers, as well as perceived attempts to hide the influence of the model by interspersing pregnancy-related coupons in advertising for general household goods. Target responded by defending its customer analytics program and stating that the resulting inferences were in compliance with federal and state health information laws.\nThe controversy also resulted in a wider conversation around informed consent and whether terms of service are sufficient to notify consumers of the potential use of data mining techniques. In response to this and similar consumer concerns, the White House released a \"Consumer Bill of Rights\" which outlined consumer expectations for security, transparency, and corporate accountability when it comes to online data usage.\n\n\"Bathroom policy\" and boycott\nIn April 2016, Target announced on its website that it would allow transgender customers and employees access to use restrooms and changing areas that correspond with the gender with which they identify, except where local laws require otherwise.\nThe announcement read:\n\n\"We believe that everyone—every team member, every guest, and every community—deserves to be protected from discrimination, and treated equally. Consistent with this belief, Target supports the federal Equality Act, which provides protections to LGBT individuals, and opposes action that enables discrimination. In our stores, we demonstrate our commitment to an inclusive experience in many ways. Most relevant for the conversations currently underway, we welcome transgender team members and guests to use the restroom or fitting room facility that corresponds with their gender identity.\"\n\nThe New York Times called this \"the most prominent position taken by a national retailer\". In response, the American Family Association (AFA) launched a nationwide boycott; by April 28 about one million people had signed the AFA's petition. Around the time of publicity about the policy, polls reported a drop from 42% to 38% of consumers noting they would shop at Target. In mid-May, CEO Cornell said the boycott impacted \"just a handful of stores across the country\".\nSome observers, such as Fortune's Phil Wahba, believed that Target's bathroom policy may have caused part of Target's drop in shopper traffic during the second quarter of 2016. On August 17, Target announced it would add a third, private, single-stall locking bathroom at many of its stores. In 2017, Cornell claimed not to know about, or have approved, the policy before it was published. The policy cost the business US$20 million and caused sales to fall nearly 6% in the three-quarters following.\n\nAbsence of AEDs in stores\nIn 2014, the California Supreme Court ruled that Target stores do not have a positive duty to keep automated external defibrillators (AEDs) in stores for purposes of first aid. This decision came after a 49-year-old woman died following a heart attack in a Target store, and two family members filed a wrongful-death lawsuit.\n\nRefusal to stock albums after digital release\nTarget initially refused to sell Frank Ocean's Channel Orange and Beyoncé's self-titled album, because those records were available to digital retailers, such as iTunes, before physical copies were made. Target representatives said that the earlier digital availability hurt how well those records would sell at Target stores and that stocking them might cause the corporation to lose money.\n\nMajor sponsorships\nEvents\nTarget often supports major awards shows, such as the Emmys, Golden Globes, Grammys, and Oscars.\nTarget Corporation is a major sponsor of the annual Minneapolis Aquatennial, where it hosts the Target Fireworks Show, the largest annual fireworks show west of the Mississippi River and the fourth-largest annual fireworks show in the United States.\nTarget was a sponsor of the 2006–2007 New Year's Times Square Ball drop, and had its logo placed on the confetti dropped during the celebrations, as well as specially designed \"2007\" glasses.\n\nSports\nMinnesota United FC\nIn January 2017, Minnesota United FC, a Major League Soccer expansion team debuting for the 2017 season, announced that Target would be the team's front-of-jersey match-kit sponsor, as well as sponsoring MLS overall. This brings one of the largest sponsors in the league, especially for an expansion team making its debut appearance. The team also has an advantage of having a large, well-known hometown brand versus an entity outside the region, in addition to the financial benefits of such a large sponsor.\n\nMajor League Soccer and US Youth Soccer\nIn 2017, Target announced a series of national, local, and charitable initiatives that mark the retailer's largest-ever push into team sports. Target became an official partner of Major League Soccer in a multiyear deal that includes airtime during MLS broadcasts on Univision, FOX Sports, and ESPN, opportunities for in-stadium experiences, player appearances, and ownership of certain major MLS platforms. Target also announced a $14 million commitment to local youth soccer through two new national initiatives—an $8 million local soccer grant program, and a $6 million partnership with the U.S. Soccer Foundation to build 100 new soccer play spaces by 2020. Target is the official sponsor of 2017 and 2018 MLS All Star Games.\n\nExtreme sports\nTarget sponsors professional freestyle motocross rider Nate Adams, pro snowboarder/skateboarder Shaun White, pro skateboarder Paul Rodriguez, pro BMX rider Mat Hoffman, and pro surfer Kolohe Andino.\n\nMotocross\nTarget sponsors Motocross and Supercross champion Ryan Dungey.\n\nChip Ganassi Racing\nTarget was a long-time sponsor of the IndyCar and NASCAR racing teams of Chip Ganassi Racing. Target's relationship with Ganassi in IndyCar go back to 1990 when it began sponsoring Eddie Cheever. Some of their most famous drivers in the 1990s include Michael Andretti, Bryan Herta, and Arie Luyendyk. In the late 1990s, Target Chip Ganassi Racing had a four-year run of winning championships in CART, winning 1996 with Jimmy Vasser, 1997 and 1998 with Alex Zanardi, and 1999 with Juan Pablo Montoya. Ganassi won their first Indianapolis 500 in 2000. The team moved full-time into the rival Indy Racing League in 2003, and won in its first year of full-time competition, with Scott Dixon, who won the championship again in 2008. The 2009 season marked the 20th anniversary of the Target race program. Franchitti won his second career IndyCar championship, and with Scott Dixon finishing second, gave Target a one-two sweep in the IndyCar series. Dixon and Franchitti won 10 of 17 races (five each) and tied the team record from 1998 when Alex Zanardi and Jimmy Vasser combined to win 10 in the 19-race 1998 CART season. In 2010, Franchitti won the Indianapolis 500. He also won the series championship for the Target team, by five points over second-place finisher Will Power.\nIn the 2002 NASCAR Winston Cup Series season, the No. 41 Chip Ganassi Target car was driven by Jimmy Spencer, and from 2003 to 2005, Casey Mears drove the car. In 2006, Reed Sorenson took over the  41 car when Mears moved to a different car on the same team. Sorenson drove the car through the 2008 season, and Target has also had some major sponsorship time on the Ganassi Racing No. 40 car with Dario Franchitti and Jeremy Mayfield, who subbed for the injured Franchitti. The 40 team has since been shut down. For 2009, the Target sponsorship moved to the No. 42 driven by Juan Pablo Montoya with the newly formed Earnhardt Ganassi Racing. Target also sponsored Earnhardt Ganassi Racing's No. 8 car driven by Aric Almirola, which it co-sponsors in some races with other sponsors such as Guitar Hero and TomTom until the team was disbanded in May 2009. Kyle Larson took over the No. 42 car in 2014 and Target sponsored the No. 51 of Phoenix Racing for Larson's Sprint Cup Series debut.\n\nThe Target Chip Ganassi car driven by Dario Franchitti won the 94th running of the Indianapolis 500 on Sunday, May 30, 2010.\nTarget ended its association with IndyCar racing at the end of the 2016 season. In July 2017, Target announced that it would end its sponsorship of Ganassi's NASCAR team at the end of the year.\n\nNaming rights\nTarget owns the naming rights to the Minnesota Timberwolves' home, Target Center since it first opened in 1990. Additionally, Target purchased the naming rights to the Minnesota Twins' home ballpark, Target Field, for an undisclosed amount. The sponsorship agreement expires in 2035.\n\nRadio\nTarget was the founding sponsor of the Weekend America radio program.\n\nNewspaper\nDainik Target is a newly established and rapidly growing Bengali-language daily newspaper in Bangladesh. Founded in Dhaka in 2024, it is owned by the Target Group and led by its editor, Md Sunnat Ali Mollik. Dainik Target was first published in Dhaka in 2024. From its inception, it has captured readers' attention with in-depth analysis and reports on a wide range of topics, including national and international news, politics, economy, sports, and entertainment.\nThe newspaper covers news and features on law, government, biographies, autobiographies, art, technology, politics, and lifestyle. It practices impartial and fact-based journalism, earning the trust of its readers.\n\nFinances\n2020-2024\n\nIn popular culture\nOne of the earliest references to Target in popular culture is the film Career Opportunities (1991), written by John Hughes, in which an employee and a customer fall in love after hours inside a Target store.\nAmerican television program Saturday Night Live featured a recurring sketch in the 2000s starring the Target Lady, an overly enthusiastic Target cashier, played by cast member Kristen Wiig. On April 2, 2024, Wiig reprised her role in a series of Target commercials promoting Target Circle, Target Circle 360, and Target Circle Week.\nTarget is the namesake of an episode of the third season of American TV comedy Superstore. In the episode, an employee at the fictional big-box retailer \"Cloud 9\" leaves for a job at Target, and is accused of poaching employees.\nDuring the 2023 Target Pride Month merchandise backlash, the rapper Forgiato Blow released a song titled \"Boycott Target\" which reached #1 on the iTunes chart.\n\nSee also\nDesign For All (product line)\n\nReferences\nBibliography\nLeebrick, Kristal (2013). Dayton's: A Twin Cities Institution.\nRowley, Laura (2003). On Target: How the World's Hottest Retailer Hit a Bull's-Eye. Hoboken, New Jersey: John Wiley & Sons. ISBN 978-0-471-25067-8.\n\nExternal links\n\nOfficial website retailing website\nTarget Corporation corporate website\nTarget International Shopping Page Archived January 26, 2020, at the Wayback Machine\nBusiness data for Target Corporation: \nGrowth of Target, 1962–2008",
  "clean_text": "Target Corporation, doing business as Target, is an American retail corporation headquartered in Minneapolis, Minnesota. Target operates retail stores. It is the seventh-largest retailer in the United States and is a component of the S&P 500 Index. The original Target retail store was co-founded by John Geisse and Douglas Dayton in 1962 for Dayton's in Roseville, Minnesota. Dayton's was renamed the Target Corporation in 2000. Target is notable for its focus on upscale, trend-forward merchandise at lower costs. Its stores typically sell general merchandise. Target's logo refers to the center of a shooting target, and its canine mascot is named Bullseye. The corporation also operates two criminal forensics laboratories. As of 2024, Target is ranked No. 32 on the 2022 Fortune 500 list of the largest American corporations by total revenue. As of 2025, it operates more than 2,000 stores throughout the United States. Target has been consistently ranked as one of the most philanthropic companies in the U.S. History Target Corporation is an American retail chain that operates large discount stores. In 1962, John Geisse and Douglas Dayton founded and launched Target stores for the Dayton Company. The first Target store opened in May 1962 in Roseville, Minnesota, a suburb of St. Paul, Minnesota. By the end of that year, there were four Target stores, located in Roseville, Crystal, Duluth, and St. Louis Park, Minnesota, respectively. Dayton-Hudson Corporation announced in January 2000 a name change to Target Corporation. Target is the seventh-largest retailer in the United States and is a component of the S&P 500 Index. As of 2024, Target is ranked No. 32 on the 2022 Fortune 500 list of the largest American corporations by total revenue. As of 2025, Target operates nearly 2,000 stores in the United States. Store formats Target Target properties are roughly 135,000 square feet (12,500 m2) and sell general merchandise, including hardlines and softlines. While many Target stores follow a standard big-box architectural style, the company has focused on \"customizing each new store to ensure a locally relevant experience [...] that best fit the surrounding neighborhood's needs\" since August 2006. Initially, only SuperTarget locations operated Starbucks Coffee counters, although they were integrated into general-merchandise stores through their expanded partnership beginning in 2003. Many stores also feature Pizza Hut Express counters (usually in the self-service snack bar), along with Starbucks. Target introduced the \"PFresh\" store prototype in 2008, which expanded its grocery selection in general-merchandise locations by upwards of 200%. Newly constructed stores that follow the PFresh format are roughly 1,500 sq ft (140 m2) larger than properties without groceries, although retain the Target branding because their offerings are considerably more limited than SuperTarget. PFresh sells perishable and frozen foods, baked goods, meat, and dairy. The company remodeled 109 stores accordingly in 2009, and renovated another 350 stores the following year. The company's decision to close their garden centers opened floor space for PFresh expansion and larger seasonal departments beginning in 2010. CVS Health On June 15, 2015, CVS Health announced an agreement with Target to acquire all of Target's pharmacies and clinic businesses for around $1.9 billion. The Target pharmacies were rebranded as CVS Health pharmacies, which totaled 1,672 pharmacies in February 2016. The Target clinics were also rebranded as MinuteClinic. The acquisition of the Target pharmacies enabled CVS to expand its market into Seattle, Denver, Portland, and Salt Lake City. SuperTarget The first Target Greatland location opened in Apple Valley, Minnesota, in September 1990. They were about 50% larger than traditional Target stores, and pioneered company standards, including an increased number of checkout lanes and price scanners, larger aisles, expanded pharmacy and photography departments, and a food court. Target Greatland locations have since been converted to stores following the PFresh format beginning in 2009. The first SuperTarget hypermarket opened in Omaha, Nebraska, in 1995, and expanded upon the Target Greatland concept with the inclusion of a full grocery department. The company expanded their grocery assortment in 2003 and adopted the modified tagline \"Eat Well. Pay Less.\" (in reference to their tagline \"Expect More. Pay Less.\") in 2004. In the early 2000s, 43 locations (of nearly 100) featured E-Trade trading stations, although they were all closed by June 2003 after E-Trade determined, \"we were not able to make it into a profitable distribution channel.\" When comparing SuperTargets with rival Walmart Supercenter hypermarkets, then-chief executive Gregg Steinhafel opined that Walmart operates like \"a grocer that happens to also sell general merchandise,\" whereas the less aggressive expansion of SuperTarget stores reflects his view of Target's grocery effort as a \"high-impact, low-cost\" side project. The company operated 239 SuperTarget locations as of September 2015; they each encompass an estimate of 174,000 square feet (16,200 m2). In an article written in August 2015, Target was quoted as saying, \"Big or small, our stores have one thing in common: they're all Target.\" Small-format Target While typical Target locations are about 135,000 sq ft (12,500 m2), most \"small-format\" CityTarget stores are roughly 80,000 sq ft (7,400 m2). The first stores were opened in July 2012, in Chicago, Los Angeles, and Seattle; the 160,000 square feet (15,000 m2) location in Boston is the largest CityTarget and opened in July 2015. TargetExpress stores range from 14,000 to 21,000 sq ft (1,300 to 2,000 m2); the first opened in Dinkytown near the University of Minnesota in July 2014. Products in these flexible-format properties are typically sold in smaller packages geared towards customers using public transportation. Locations built in college communities often carry an extended home department of apartment and dormitory furnishings. In August 2015, Target announced that it would rename its nine CityTarget and five TargetExpress stores as Target beginning that October, deciding, \"Big or small, our stores have one thing in common: they're all Target.\" The first small-format stores under the unified naming scheme opened later that month in Chicago, Rosslyn, San Diego, and San Francisco. The company opened a 45,000 square feet (4,200 m2) store in the Tribeca neighborhood of New York in October 2016. In that same month, three other similar-sized stores opened in Philadelphia, Cupertino, California, and the area around Pennsylvania State University. Target opened a 22,000 sq ft (2,000 m2) store in Austin's Dobie Twenty21, adjacent to the UT-Austin campus. Nearly all of its planned openings through 2019 were small formats, which are less than 50,000 sq ft (4,600 m2). The goal of these smaller-format stores is to win over the business of millennial customers. The nearly 30 newer locations were to be situated in college towns or densely populated areas. Brands and subsidiaries As of 2018, Target has four subsidiaries: Target Brands, Inc., Target Capital Corporation, Target Enterprise, Inc., and Target General Merchandise, Inc. Financial and Retail Services division Financial and Retail Services (FRS), formerly Target Financial Services, original issued Target's credit cards, known as the Target REDcard (formerly the Target Guest Card), issued through Target National Bank (formerly Retailers National Bank) for consumers and through Target Bank for businesses. FRS also oversees GiftCard balances. Target launched its PIN-x debit card, the Target Check Card, which was later rebranded as the Target Debit Card. The Target Debit Card withdraws funds from the customer's existing checking account, and allows for up to $40 \"cash back\". The debit card allows guests to save 5% off each purchase. In late 2017, Target replaced its REDcard slogan, \"Save 5% Today, Tomorrow, & Everyday with Target REDcard\", when it rolled out new benefits for REDcard holders by offering exclusive products on Target.com and preorders with \"Everyday Savings. Exclusive Extras.\" In October 2012, Target enter into an agreement with TD Bank in which TD Bank would handle Target's Visa and private label REDcard accounts for Target for a seven year period. The agreement was finalized in March 2013. The credit card management agreement was extended in 2022 until 2030 in which TD Bank is the sole issuer of Target's credit cards. Target RedCard was rebranded Circle Card in April 2024. Target Sourcing Services This global sourcing organization locates merchandise from around the world for Target and helps import the merchandise to the United States, including garments, furniture, bedding, and towels. Target Sourcing Services has 27 full-service offices, 48 quality-control offices, and seven concessionaires located throughout the world, and employs 1,200 people. Its engineers are responsible for evaluating the factories that do business with Target Corporation for quality, labor rights, and trans-shipment issues. It was acquired by Target Corporation in 1998, was founded in 1916 as the Associated Merchandising Corporation, and was previously owned by the clients it served. TSS ceased operations in its department-store group, the division of the former Associated Merchandising Corporation that acted as a buying office for Saks, Inc., Bloomingdale's, Stage Stores Inc., TJ Maxx, and Marshalls. Private-label brands Target Brands is the company's brand-management division that oversees the company's private-label products. Bullseye (a white Bull Terrier), is Target's mascot. Good & Gather, a food and beverage brand, replaced Archer Farms and Simply Balanced. Market Pantry, value grocery products Dealworthy, a low-priced essentials brand Boots & Barkley, a pet food and supply line Embark, an outdoor gear line of camping and travel equipment Room Essentials, inexpensive, primarily flat-pack, furniture Brightroom, a line of storage solutions Threshold, a premium furniture line Wondershop, a Christmas decoration brand Hyde and Eek, a Halloween decoration brand up & up, offers essential commodities, including household, healthcare, beauty, baby, and personal-care products. Xhilaration, a line of intimate and sleepwear, along with swimwear. Other private labels include brands launched in July 2016, during back-to-school sales. Pillowfort, a children's line of bedding and room decor Cat and Jack, a children's line of apparel and accessories Cloud Island, a baby's line of bedding and clothing Project 62, a household-goods line placed alongside Room Essentials Goodfellow & Co., a clothing and personal-care line for men, with the name being an homage to their beginnings as Goodfellow Dry Goods A New Day, a clothing line for women JoyLab, a fitness-clothing line for women Hearth and Hand, a home and lifestyle brand, in collaboration with designer Joanna Gaines Eight Target private-label brands that launched in 2018: Universal Thread, a denim lifestyle brand Opalhouse, eclectic home decor Heyday, a line of electronic accessories Original Use, male clothing brand targeting gen-Z and millennials Wild Fable, women's clothing brand targeting gen-Z Made By Design, a homelines brand, made up of home basics such as towels, cooking utensils, glassware, plates, pots, kitchen gadgets, and more Smartly, essential a commodity brand, including household, healthcare, beauty, and personal-care products In addition, Target released three new intimates, loungewear, and sleepwear brands for women on February 25, 2019: Auden, an intimates and lingerie exclusive brand Stars Above, an in-house brand for sleepwear Colsie, an intimates and loungewear brand On January 9, 2020, Target announced its new activewear brand, All in Motion, an athleisure line with products for men, women, boys, and girls. The brand's logo plays homage to a previous Dayton's logo. On March 9, 2021, Target announced a new brand called Favorite Day, a brand that sells bakery, snacks, candy, premium ice cream, cake-decorating supplies, and beverage mixers and mocktails items. It launched on April 5, 2021. Former brands include: Cherokee, children's and women's clothing: On September 10, 2015, Target stores announced it would cease carrying the brand when its partnership with Cherokee Inc. expired on January 31, 2017. It was replaced by Cat & Jack. Circo, toddler's and kids clothing: The brand was replaced by Cat & Jack, along with Pillowfort Merona, a clothing brand purchased by Target in 1991 Mossimo Supply Co., a clothing line, in partnership with the brand owner Iconix Brand Group Gilligan & O'Malley product lines of intimates and sleepwear were discontinued after the release of the brands Auden, Stars Above, and Colsie. Website Target.com owns and oversees the company's e-commerce initiatives, such as the Target.com domain. Founded in early 2000 as target.direct, it was formed by separating the company's existing e-commerce operations from its retailing division and combining it with its Rivertown Trading direct-marketing unit into a stand-alone subsidiary. In 2002, target.direct and Amazon.com's subsidiary Amazon Enterprise Solutions created a partnership in which Amazon.com would provide order fulfillment and guest services for Target.com in exchange for fixed and variable fees. After the company sold Marshall Field's and Mervyn's in 2004, target.direct became Target.com. The domain target.com attracted at least 288 million visitors annually by 2008, according to a Compete.com survey. In August 2009, Target announced that they would build and manage a new Target.com platform, independent of Amazon.com. This new platform was to launch in 2011, in advance of the holiday season. Prior to the announcement, Target and Amazon had extended their partnership until 2011. In January 2010, Target announced their vendor partners for the re-platforming project. These partners include Sapient, IBM, Oracle, Endeca, Autonomy, Sterling Commerce, and Huge, among others. The re-platformed Target.com officially launched on August 23, 2011, effectively ending the partnership with Amazon.com. Over the last few years, Target has been working to grow their fulfillment strategy via the orders placed through their website.. In November 2025, Target added an app within ChatGPT to provide a complete shopping experience using ChatGPT. Former subsidiaries Target Portrait Studio was a chain of portrait studios that were located in select Target stores. The chain, which was operated by Lifetouch, opened in 1996 and ceased operations on January 28, 2017. Target Garden Center was a chain of garden centers that were located in Target, Super Target, and Target Greatland stores. Around 260 Target stores in California, Nevada, Arizona, and Florida had garden centers. All of Target's garden centers closed in September 2010. Target spokesperson Jana O'Leary claimed that the reason why their garden centers closed was because \"the garden centers don't provide significant value to our guests. Also, it's no longer a profitable business for us.\" Target Canada was the chain of Target stores in Canada. It was formed in 2013 when Target acquired Zellers leases and converted them into Target stores. Target Canada was in operation for two years until the closure of all stores in 2015. The retail chain racked up losses of $2.1 billion in its brief lifespan, and the Canadian news media termed Target's foray into Canada as a \"spectacular failure\", \"an unmitigated disaster\", and \"a gold standard case study in what retailers should not do when they enter a new market\". Supply chain As of May 2016, Target Corporation operates 41 distribution centers across the United States. With the exception of vendor-supplied items, such as greeting cards and soda, these distribution centers ship items directly to Target stores. Also, unlike Walmart, Target's grocery selection does not come from their own distribution centers, but from the companies with whom Target has partnered. The retail chain's first distribution center opened in Fridley, Minnesota, in 1969. It included a computerized distribution system and was known as the Northern Distribution Center. During this time, the chain consisted of 17 stores after having expanded into Oklahoma and Texas. On August 9, 2004, Target announced to their suppliers that they were going to perform a trial on the effects of radio-frequency identification (RFID) on the efficiency of their supply chain management in the Dallas–Fort Worth metroplex. This trial involved one Target distribution center and 10 nearby Target stores. Here, RFID tags were placed on the bar codes of pallets and cartons to track the goods from the suppliers to the distribution center, and from the distribution center to the stores. As of 2009, RFID had been phased out of the Dallas–Fort Worth stores. In 2016, Target planned to roll out the RFID technology at all 1,795 of its store locations across the United States. Target opened new distribution centers in 2006 (Rialto, California, DeKalb, Illinois) to support the growth of its stores. On January 27, 2009, Target announced the closing of its distribution center in Maumelle, Arkansas, the second-oldest in the company. The reason cited was the need to ensure that Target remained competitive in the long term. In June 2009, Target opened a new distribution center to supply more than 60 stores in three states. SuperTarget and PFresh stores require fresh produce and refrigerated and frozen items. Food-distribution centers owned by SuperValu have been used by Target for many years. In October 2003, SuperValu's facility in Phoenix, Arizona, was converted to serve Target exclusively. The same change was implemented at the SuperValu center in Fort Worth, Texas. A new distribution center was constructed by Target in Lake City, Florida, to serve the Southeast, but it was operated by SuperValu until 2011, when it transitioned to Target. A fourth center in Cedar Falls, Iowa, opened in 2009 and is unique in that it is located adjacent to a standard Target Distribution Center, each using the same dispatch office. Other warehouses owned by SuperValu are still used in other regions, but Target plans to replace those over the next few years. In Colorado, stores are serviced through FreshPack Produce Inc. of Denver. In the mid-Atlantic region/Philadelphia market, C&S Wholesale Grocers services the fresh produce, meat, dairy, bakery, and frozen-food needs to PFresh stores. Target partnered with Swisslog Holding to use a semiautomated monorail picking system called the CaddyPick system for use in the food-distribution centers. The company operates four facilities to receive shipments from overseas manufacturers and suppliers. They are located near ports at Rialto, California; Savannah, Georgia; Lacey, Washington; and Suffolk, Virginia. Merchandise received is sent directly to Regional Distribution Centers. Internet sales orders from the Target Direct division, which operates from the Target.com website, are processed by the facility in Woodbury, Minnesota, with some support from Savannah, Georgia, and other vendors. New centers opened in Ontario, California, and Tucson, Arizona, in 2009. In 2021, during the COVID-19 pandemic, Target supply chain and inventory teams worked proactively to move products fast, and they hired more than 30,000-year-round supply chain team members to bolster their team. Several former Target Supply Chain Executives have been named Chief Supply Chain Officers at other large organizations across the United States. Notables are: Arthur Valdez – Starbucks, Alexis Depree – Nordstroms, Colin Yankee – Tractor Supply, Sean Halligan – RNDC, Amanda Martin – Neiman Marcus, Kristin Bauer – Footlocker, Moid Alwy – ATD, Mario Rivera – CVS, Derek Hornsby – Michaels Stores, Mark Irvin – Best Buy Distribution centers Corporate affairs Headquarters Target Corporation has its headquarters on Nicollet Mall in Minneapolis near the site of the original Goodfellows store. The complex includes Target Plaza North and Target Plaza South. Ryan Companies developed the complex, and Ellerbe Becket served as the architect. Target had the roughly $260 million complex developed to provide one location of office space for 6,000 employees. The 14-story Target Plaza North has 600,000 square feet (56,000 m2) of office and retail space, while the 32-story Target Plaza South has 1,250,000 square feet (116,000 m2) of space. In October 2014, Target completed construction of an 1,600,000 square feet corporate campus in Brooklyn Park, Minnesota, called Target Northern Campus. Brian Cornell serves as board chairman and CEO of Target Corporation. In January 2016, Cornell began making home visits in an effort to understand better the needs and desires of his customers. In January 2016, Target fired Tina Tyler from her job as chief stores officer. She was replaced with long-time employee Janna Potts. In August 2025, Target announced Cornell would be replaced by long-time insider and current COO, Michael Fiddelke in February 2026. Cornell will become executive chairman of the board. On August 26, 2020, the headquarters building was broken into and damaged during the Minneapolis false rumours riot. Three Minnesota residents were later convicted of federal arson charges for setting fires inside the building during the riot. Diversity The company states that \"individuality may include a wide spectrum of attributes such as personal style, age, race, gender, ethnicity, sexual orientation, language, physical ability, religion, family, citizenship status, socio-economic circumstances, education, and life experiences.\" In February 2006, the National Federation of the Blind (NFB) filed a class action discrimination lawsuit in Northern California's Alameda County Superior Court, claiming that Target's commercial website contains \"thousands of access barriers that make it difficult, if not impossible, for blind customers to use.\" Target Corporation settled the lawsuit in October 2008, paying $6 million and agreeing to work with the NFB over the next three years improving the usability of the Target.com site. On August 24, 2009, the United States Equal Employment Opportunity Commission (EEOC) filed a discrimination lawsuit against Target Corporation for unlawfully denying reasonable accommodation to an employee with multiple disability-based impairments and substantially reducing his work hours due to the medical conditions. According to the claims in the EEOC press release, Target's actions violated Title I of the Americans With Disabilities Act (ADA) and Title I of the Civil Rights Act of 1991. In February 2012, the company extended the team member discount to same-sex partners of employees. It had received a 100 on the Human Rights Campaign Corporate Equality Index Score, prior to donating funds to Minnesota Forward. The National Association for the Advancement of Colored People has repeatedly given Target failing grades on its annual Economic Reciprocity Initiative report card, a measure of the company's \"commitment to the African-American citizenry\". In 2003 and 2005, the NAACP has rated Target an \"F\" on this report; in 2004, Target was rated a \"D−\". In 2006, when Target was asked why it didn't participate in the survey again, a representative explained, \"Target views diversity as being inclusive of all people from all different backgrounds, not just one group.\" In September 2020, Target published a \"Workforce Diversity Report\" indicating that 50% of Target's 350K employees are people of color, and over half are women. The report also stated that within the corporate leadership team, people of color account for 24% of the team and 42% are women. On a retail level, 33% of stores are managed by people of color, with more than half of management positions occupied by women. Brian Cornell publicly stated that the commitment to programs at Target to support diversity, equity and inclusion following the murder of George Floyd by police in Minneapolis. He stated “I recognize that it’s time to take it to another level, and that as CEOs, we have to be the company’s head of diversity and inclusion.\" One of the created programs intended to help Black entrepreneurs develop, test, and scale products to sell at mass retailers promised to spend more than $2 billion with Black-owned businesses by 2025. In 2025, Target announced an abrupt change to these policies following an executive order from President Trump ordering a dismantling of the federal government’s diversity and inclusion programs. Target announced a halt to many programs designed to increase diversity equity and inclusion at Target. The company also said it would no longer participate in external diversity surveys, including the Human Rights Campaign’s Corporate Equality Index. Following Target's statement to roll back on equitable hiring practices, Twin Cities Pride announced Target would no longer be participating in the 2025 Pride Festival. Philanthropy Target is consistently ranked as one of the most philanthropic companies in the US. It ranked No. 22 in Fortune magazine's \"World's Most Admired Companies\" for 2010, largely in part to the donation efforts of the company as a whole. According to a November 2005 Forbes article, it ranked as the highest cash-giving company in America in percentage of income given (2.1%). Target donates around 5 percent of its pre-tax operating profit; it gives over $3 million a week (up from $2 million in years prior) to the communities in which it operates. It also gives a percentage of charges from its Target Visa to schools designated by the cardholders. To date, Target has given over $150 million to schools across the United States through this program. Further evidence of Target's philanthropy can be found in the Target House complex in Memphis, Tennessee, a long-term housing solution for families of patients at the city's St. Jude Children's Research Hospital. The corporation led the way with more than $27 million in donations, which made available 96 fully furnished apartments for families needing to stay at St. Jude over 90 days. Target has a no-solicitation rule at its properties, as it seeks to provide a \"distraction-free shopping experience for its guests.\" Exemptions to this policy were previously made for the Salvation Army red kettles and bell-ringers outside Target stores during the holidays through Christmas. In 2004, however, Target asked the organization to explore alternate methods to partner with Target. Target donates to local Salvation Army chapters through its grant program and annually to the United Way of America (the Salvation Army is a member of the United Way coalition). In 2005, Target and the Salvation Army created a joint effort called \"The Target/Salvation Army Wish List\", where online shoppers could donate goods to the organization for hurricane victims by buying them directly from Target.com between November 25, 2005, and January 25, 2006. In 2006, they created another joint effort called \"The Target/Salvation Army Angel Giving Tree\", which is an online version of the Salvation Army's Angel Tree program; in addition to donating proceeds made from the sales of limited edition Harvey Lewis angel ornaments within Target's stores. During the Thanksgiving holiday of 2006, Target and the Salvation Army partnered with magician David Blaine to send several families on a shopping spree the morning of Black Friday. The challenge held that if Blaine could successfully work his way out of a spinning gyroscope by the morning of Black Friday, then several families would receive $500 shopping certificates. The challenge was completed successfully by Blaine. During disasters, Target has been a major benefactor for relief efforts. Target provided monetary and product donations during the September 11 attacks; it also donated money for relief efforts for the 2004 tsunami in South Asia and donated $1.5 million (US) to the American Red Cross in the aftermath of Hurricane Katrina in 2005. It also allowed its store properties in the affected area to be used as command centers for relief organizations and donated supplies such as water and bug spray. Target will often donate its unused, returned or seasonal merchandise (particularly clothing) to Goodwill Industries. Environmental record In 2007, Target Corporation agreed to reduce its sales on all materials containing polyvinyl chloride (PVC). Testers found toxic lead and phthalates and large amounts of PVC in toys, lunch boxes, baby bibs, jewelry, garden hoses, mini blinds, Christmas trees, and electronics. Several studies have shown that chemicals in vinyl chloride can cause serious health problems for children and adults. The University of Illinois Medical Center in Chicago states that people who use products containing PVC can become exposed with harmful toxic phthalates and lead, which eventually can become a big contributor with dioxins. Lois Gibbs, executive director of the Center for Health, Environment, and Justice, stated, \"Target is doing the right thing by moving away from PVC and switching to safer alternatives.\" Other companies reducing the PVC on their shelves include Walmart, Microsoft, Johnson & Johnson, Nike, and Apple. Target is beginning to reduce energy use with energy-efficient storefronts and reducing waste with recycling programs. All Target stores in the United States use plastic carts with metal frames. In mid-2006, Target took it a step further when it began introducing a newer cart design made entirely of plastic. It also uses the same design in its hand-use baskets. Target released a 13-page report in 2007 that outlined their current and future plans for becoming more earth-friendly according to LEED. Such efforts include installing sand filtration systems for the stores' wastewater. Recycling programs will be aimed at garment hangers, corrugated cardboard, electronics, shopping carts, shrink wrap, construction wastes, carpeting, and ceiling tiles and roofing materials. All stores in Oklahoma will be partnered with Oklahoma Gas & Electric to exclusively use wind power for all Target stores to reduce greenhouse gas emissions. Stores nationwide use only LED and fluorescent lights and low-flow restrooms that reduce wastewater by 30%. Some Target stores are installing roof gardens or green roofs, which absorb stormwater and cut down on surface runoff, mitigate temperature fluctuations, and provide habitats for birds. There are currently four green-roof Target stores in Chicago. Target carries over 700 organic and alternative products from brands such as Archer Farms, Burt's Bees, and Method Products. They also sell clothes made from organic cotton, non-toxic cleaners, low-energy lighting and electronics, non-toxic and non-animal tested cosmetics, and furniture made from recycled materials. As of June 2007, Target has been offering reusable shopping bags as an alternative to disposable plastic bags. Target gift cards are made from corn-based resins. All of the stores' packaging is done with a modified paperboard/clamshell option and has goals for phasing out plastic wrap completely. In collaboration with MBH Architects, Target's first \"green\" building was a 100,000+ square foot Target store built in 1995 in Fullerton, California. It was a part of the EPA Energy Star Showcase for its use of skylights that cut the original energy consumption by 24% with a 5-year payback. Target and MBH Architects were awarded the \"Green Lights Partner/Ally of the Year Award\". Target is the only national retailer employing a Garment Hanger reuse program, which keeps millions of pounds of metal and plastic out of landfills. In 2007, this program prevented 434 million hangers from entering landfills. On June 15, 2009, the California Attorney General and 20 California District Attorneys filed a lawsuit in Alameda County alleging that Target stores across the state have been illegally dumping hazardous wastes in landfills. On October 1, 2009, Target Corporation agreed to pay a $600,000 civil penalty for importing and selling a variety of toys with lead paint levels that were higher than is legally allowed. The Consumer Products Safety Commission alleged that \"Target knowingly imported and sold the illegal Chinese-made toys between May 2006 and August 2007.\" A similar problem occurred a few months later in February 2010, when Target pulled Valentine's Day \"message bears\" from its shelves at the request of the California attorney general's office. The bears, which were manufactured in China, contained more lead than is permissible under federal law for children under 12. A class action suit was filed in 2014 in the U.S. District Court for the Northern District of Ohio, on behalf of consumers in Ohio that purchased Target‑brand wet wipes. The lawsuit filed against Target Corporation alleges the retailer misled consumers by marking the packaging on its up & up brand wipes as flushable and safe for sewer and septic systems. The lawsuit also alleges that so-called flushable wipes are a public health hazard because they are alleged to clog pumps at municipal waste-treatment facilities. On April 27, 2017, Target announced a corporate goal to install rooftop solar panels in 500 buildings by 2020 with each project reducing 15 to 40 percent of a property's energy needs. Target also unveiled its first solar installation in shape of the bullseye logo at a distribution center in Phoenix, Arizona. On December 5, 2018, Alameda County District Attorney O'Malley announced fining Target $7.4 million for putting illegal e-waste, medical supplies and private information into the garbage. On April 23, 2018, Target announced plans to accelerate their electric vehicle program by installing charging stations at more than 600 parking spaces at over 100 sites across 20 states. On March 17, 2022, Target announced its first net zero energy store in Vista, California. Customer privacy In December 2013, a data breach of Target's systems affected up to 110 million customers. Compromised customer information included names, phone numbers, email and mailing addresses. In March 2015, Target reached a class-action settlement with affected consumers for $10 million (plus class-action attorney fees). In May 2016, Target settled with affected banks and credit unions for $39 million (plus class-action attorney fees), of which $19 million would be disbursed by a MasterCard program. International operations Target only operates in the United States as of 2025. Though previously, from 2013 to 2015, Target operated stores in Canada. Other companies that are under the name of \"Target\" outside of the United States, most notably that of Target Australia, are not owned or operated by the Target Corporation. Labor relations In 2015, Target followed Walmart in raising its minimum wage to $9 per hour. Two years later, Target announced that the minimum hourly wage would be increased to $11 by October 2017 and pledged to raise it to $15 (referred to as \"living wage\" by labor advocates) by 2020. By April 2019, the company announced that it was on track to meet this goal, increasing its minimum wage to $13 per hour. In June 2020, Target announced ahead of schedule that the minimum hourly wage would rise to $15 permanently, after previously announcing it to be temporary through July 4, 2020. As a thank you to store and distribution center team members who worked during the COVID-19 pandemic in the United States, Target also announced a one-time $200 bonus to be paid towards the end of July 2020. During the COVID-19 pandemic, Target began providing additional team member resources to help team members meet essential needs, obtain virtual healthcare, and take a paid leave of absence (based on certain medical or physical criteria that may cause exposure to coronavirus). In February 2021, Target began offering all of its hourly employees up to four hours of pay when they get both doses of the COVID-19 vaccine as well as covering the cost of a Lyft ride, up to $15 each way, to the vaccination appointment. In August 2021, Target announced a $200 million investment to offer debt-free degrees to more than 340,000 full-time and part-time team members at stores, distribution centers, and headquarters locations. In December 2021, an employee at a Target store in Indianapolis, Indiana named Andrew Stacy filed an unfair labor practice charge against the company with the National Labor Relations Board, alleging that a manager at the store confiscated union flyers that Stacy was distributing with a co-worker and then interrogated the co-worker about the flyers. Corporate identity Logo Target's logo mimics the bullseye used by marksmen. Differentiation from competitors Target is notable for its focus on upscale, trend-forward merchandise at lower costs. Douglas J. Dayton, one of the Dayton brothers, explained John Geisse's concept: \"We will offer high-quality merchandise at low margins because we are cutting expenses. We would much rather do this than trumpet dramatic price cuts on cheap merchandise.\" As a result, Target stores tend to attract younger customers than Walmart, among other competitors. The median Target shopper is 40, the youngest of all major discount retailers that Target competes directly against. The median household income of Target's customer base is roughly $64,000. Roughly 76% of Target customers are female, and more than 43% have children at home. About 80% have attended college and 57% have completed college. In October 2008, Target announced plans to fight the perception that their products are more expensive than those of other discount retailers. It added perishables to their inventory, cut back on discretionary items, and spent three-quarters of their marketing budget on advertising that emphasizes value and includes actual prices of items featured in ads. Target also planned to slow its expansion from about 100 stores a year down to 70 stores a year. Target stores are designed to be more attractive than large big-box stores by having wider aisles, drop ceilings, a more attractive presentation of merchandise, and generally cleaner fixtures. Special attention is given to the design of the store environment: graphics reinforce its advertising imagery, while shelves are dressed with contemporary signage, backdrops, and liners, often printed on inexpensive material such as paper, corrugated and foam boards. Some stores, particularly those in the vicinity of major airports, have a bullseye painted on the roof that can be seen from above: the stores in East Point, Georgia, near Hartsfield-Jackson Atlanta International Airport; Rosemont, Illinois, near O'Hare International Airport; Potomac Yard, Virginia, near Ronald Reagan Washington National Airport; College Point, New York (Queens), east of LaGuardia Airport; and Richfield, Minnesota, adjacent to Minneapolis–St. Paul International Airport are among such locations. The location in Inglewood, California, near Los Angeles International Airport and SoFi Stadium, has an LED bullseye logo on its roof, made out of solar panels. Target stores do not sell firearms. In the early 1990s, they ceased sales of toy guns that looked realistic and limited its toy gun selection to ones that were brightly colored and oddly shaped. In 2014, Target also \"respectfully\" asked their guests to leave any firearms at home when visiting the store. They do not sell tobacco products and have not sold cigarettes since 1996. Most Target stores do not play music, but may be changing that from 2017 with a rebranding process, adding music to the rebranded stores. In July 2025, Target discontinued its long-standing competitor price-matching policy, effective July 28, ending the practice of matching prices with retailers such as Amazon and Walmart. The retailer now limits price matching to its own in-store, online, and Target Plus prices within 14 days of purchase, citing customer feedback and a focus on internal pricing consistency. Targét Some people jokingly give Target the pseudo-French pronunciation tar-ZHAY, as though it were an upscale boutique. Though this practice is often attributed to Oprah Winfrey's usage on her television show, it is first attested in 1962, the year the first Target store opened. Target once sold a line of shoes called \"Miss Targé;\" this was reinforced by a 1980s television advertisement starring Didi Conn. This pronunciation has also led some people to incorrectly believe that the company is French-owned. In recognition of the nickname's popularity and cachet, Target Corporation licensed its new name and logo to Brand Central LLC in 2006, complete with an accent over the letter \"E\" for a new line of clothing aimed at more upscale fashion customers. The line, \"Targét Couture\", was originally sold in Los Angeles-based store Intuition, which dealt in high-end brands. Nomenclature Target uses a practice that was derived in 1989 from The Walt Disney Company by calling its customers \"Guests\", its base-level employees \"Team Members\", and its supervisors \"Team Leaders\". Also, managers are known as \"Executive Team Leaders (ETLs)\", \"Senior Team Leaders (SRTLs)\", or \"Service and Engagement Team Leaders (SETLs)\", and the Store Manager is known as the \"Store Team Leader (STL)\", Further up the chain of command are \"District Team Leaders (DTL)\", \"Group Team Leaders (GTL, sometimes also Group Vice President)\", \"Regional Team Leaders (RTL, sometimes also Regional Vice President)\", and corporate-level executives. This practice began to be revised in 2018 and became more widespread in 2019 as the Group Team Leader became the Group Operations Director. District Team Leader became the District Senior Director. The Store Team Leader became Store Director. Executive Team Leaders were shortened to Executive Team Lead. Other Team Leaders retained their title though some of the department names changed such as Guest Service Team Leader was renamed Service & Engagement Team Leader. Front of store team members were renamed Guest Advocates. Specialty areas in Style, Beauty and Tech are considered Consultants. Other areas such as General Merchandise, Presentation, Inbound, Fulfillment, Food Service and Reverse Logistics are considered Experts, and Assets Protection and Security Officers are Specialists. Distribution centers and the supply chain including corporate office refers to its employees as Team members, Operations manager, Senior operations manager, Distribution Director, Problem Solvers, and Leads. Product lines and partnerships Target has many exclusive deals with various designers and name brands, including Finnish design company Marimekko; architect Michael Graves; athletic wear company Converse; Portland-based undergarment designer Pair of Thieves; Italian fashion label Fiorucci; fashion designers Lilly Pulitzer, Liz Lange, Mossimo Giannulli, and Isaac Mizrahi, among others. To further increase its fashion profile, Target also created its fashion-forward Go International line, which hires famous designers to design collections available only for a few months. After hiring architect Michael Graves to design the scaffolding used to renovate the Washington Monument and contributing US$6 million to the restoration plan, Target introduced its first designer line of products in 1999, the Michael Graves Collection of housewares and home decor products. Walmart and Kmart have followed Target's lead by signing exclusive designers to their stores as well. Target also partners with well-established national brands to create exclusive collections for its stores. In 2005, Target introduced a major revision of prescription bottles, which it calls the ClearRx system. The redesigned bottles are color-coded, flattened-out and turned upside down, providing more room for the label. This system was based on the patent by student Deborah Adler and was named one of TIME's \"Most Amazing Inventions of 2005\". After Target sold their in-store pharmacy and clinic operations to CVS Health in December 2015, CVS discontinued the use of ClearRx. Sometimes manufacturers will create red-colored items exclusively for Target. In 2002, Nintendo produced a red special edition variant of the Game Boy Advance, which featured the Target logo above the screen. In 2005, IFC began a partnership with Target to promote a selection of independent films, both in Target stores and on IFC Monday nights at 9:00 pm Eastern. Originally titled IFC Cinema Red, the promotion was rebranded on-air as The Spotlight in 2007. The in-store headers refer to the selected titles as IFC Indies – Independent films chosen for Target by the Independent Film Channel. In 2016, Target began to enforce gender neutrality in its marketing of toys, and stopped explicitly listed specific toys as being for \"boys\" or \"girls\". This change came after the store stopped color coding toy aisles with pink and blue for \"girls\" or \"boys\", respectively. This practice was expanded with the February 2016 launch of new children's decor line, Pillowfort, which replaced its Circo brand and features more gender-neutral designs and color schemes. In February 2021, Target announced it would begin opening \"mini Apple shops\" in some of its stores. Gift cards The Target GiftCard is the retailing division's stored-value card or gift card. Target sells more gift cards than any other retailer in the United States and is one of the top sellers, by dollars and units, in the world. The unique designs of their cards contribute to their higher sales, as well as Target's policy of no expiration dates or service fees. Past and current designs include lenticular, \"scratch and sniff\" (such as peppermint during the Christmas season), glow in the dark, LED light-up, a gift card on the side of a bubble blower, a gift card that can function as a CD-ROM, and even a gift card that allows the sender to record a voice message. A current environmentally friendly gift card is made from bioplastic manufactured from corn. Target rolled out a new MP3 player gift card for the 2006 holiday season. It holds 12 songs and must be purchased with an initial value of at least $50. Beginning in January 2010, Target Stores rolled out Mobile GiftCards, through which one can produce a GiftCard barcode on any web-capable cell phone. This data matrix barcode can be scanned at a Target POS like any physical card barcode, and balances can be stored, retrieved, and gifted with the convenience of a cell phone. Some of these unique design ideas are patented, and these patents are assigned to the Target Brands subsidiary. For example, some such Target GiftCard designs feature a wooden front side. On May 24, 2005, the United States Patent and Trademark Office granted U.S. patent D505,450 for the \"ornamental design for credit or stored value card with wood layer\" to inventors Amy L. Lauer and John D. Mayhew. U.S. patent 7004398, for the \"stored-value card assembly including a stored-value card, an edible product, and a wrapper\", was granted to Michael R. Francis and Barry C. Brooks on February 28, 2006. Both patents have been assigned by their inventors to Target Brands, Inc. Target GiftCards are also collector's items. Some of the first gift cards issued are valued at over $300 (even though the card does not have any money on it). Every year, Target introduces new Holiday GiftCards. In 2007, Target's Holiday GiftCards featured a wind-up flashlight, a musical gift card, a gift card that lights up, and a scented gift card. Target forensic services In 2006, The Washington Post revealed that Target was operating two criminal forensics laboratories, one at its headquarters and the other in Las Vegas. Originally, the lab was created with the role of investigating internal instances of theft, fraud, and other criminal actions that have occurred on its own properties. Eventually, the company began offering pro bono services to law enforcement agencies across the country. Target's Forensic Services has assisted agencies at all levels of government, including such federal agencies as the Bureau of Alcohol, Tobacco, Firearms and Explosives, the Federal Bureau of Investigation, and the United States Secret Service. Criticism and controversy Animal welfare concerns In 2011, Mercy for Animals uncovered apparent animal abuse at a Target egg supplier in Minnesota, Sparboe Farms. The investigation received international media attention, including on ABC's Good Morning America, World News Tonight with Diane Sawyer, and 20/20. As a result of the investigation, Target discontinued its relationship with the supplier. In January 2016, Target announced that it would discontinue sourcing eggs from hens confined in battery cages by 2025. As of July 2024, Target reported that 68% of its egg sales were cage-free but stated that it would not meet its 2025 commitment. This prompted criticism by animal welfare and consumer activist organizations that urged the company to uphold its pledge. In July 2025, activists with Humane World for Animals demonstrated outside Target headquarters to deliver petition signatures demanding that the company set a new timeline to end the use of battery cages and gestation crates in its supply chain. DEI rollback and boycott Shortly after the start of the second presidency of Donald Trump, Target was one of dozens of Fortune 500 companies that backtracked on their diversity, equity, and inclusion (DEI) policies in response to conservative court decisions, pressures from activists and right-wing legal groups, as well as the Trump administration and its policies. Many people took to social media to protest the decision, and the daughters of one of the founders called the backtrack of the policies a betrayal. In February 2025, a forty-day consumer boycott was announced. It was reported on February 28 that Target lost $12.4 billion in market value after the stock value dropped by $27.27 per share by the end of February. A class action lawsuit was filed on behalf of the City of Riviera Beach Police Pension Fund, containing allegations that Target defrauded investors by issuing false and misleading statements concerning DEI initiatives, along with environmental, social, and governance policies. LGBTQ Pop star Lady Gaga was expected to give the store an exclusive expanded edition of her then upcoming album Born This Way, but she ended the deal after discovering that then-CEO Gregg Steinhafel donated to a political action group that supported an anti-gay candidate. Target apologized and began its outward support of the LGBTQ community. In 2012, it began by stocking gay pride merchandise and donating half of the profits to GLSEN. In 2014, it began featuring LGBTQ individuals and couples in national advertising. In 2015, Target debuted their #takepride campaign, and partnered with GLSEN to produce a mini-documentary celebrating their 25th anniversary. Target sponsors many LGBTQ non-profits including Human Rights Campaign, GLSEN, GLAAD, Family Equality Council, NGLCC and the Williams Institute. For the last three years, Target has been the presenting sponsor of GLAAD's Spirit Day. In 2017, Target was the founding partner of New York City's Pride Youth. Target was ranked by LGBTQ Consumers as a favorite brand in 2016 and 2017 by Community Marketing Inc's 10th and 11th Annual LGBT Community Surveys. Target has a score of 100 on the Human Rights Campaign Corporate Equality Index for their corporate policies and practices pertinent to lesbian, gay, bisexual, transgender and queer employees. In 2019, Target donated $100,000 to GLSEN. In 2025, Target — previously a platinum sponsor of New York City's Heritage of Pride annual Pride Week — donated as a \"silent partner\" to avoid publicity. 2023 Pride Month merchandise backlash In May 2023, Target received threats against team members in response to the stores' Pride Month merchandise. Several viral posts on social media incorrectly claimed that \"tuck-friendly\" products were being sold to children, which sparked outrage among anti-LGBTQ groups. The products were quickly withdrawn from stores in Southern states, to avoid a \"Bud Light situation\". In May 2024, Target announced they would reduce the number of stores that sell their Pride Month collection for the safety of their employees after the backlash and threats received in 2023. The corporation sold their Pride Month collection online for customers who do not live near one of the select stores that carried the merchandise. Consumer data usage On February 12, 2012, The New York Times published an article which detailed a statistical model that Target had deployed which used customer data to assign guests a \"pregnancy prediction score\". This article contained an account of a father who complained to a store manager about his teenage daughter receiving pregnancy-related coupons and subsequently discovered that his daughter was actually pregnant. This anecdote received wide coverage in other media outlets. The public backlash focused on privacy concerns and companies using data mining techniques to infer sensitive information about customers, as well as perceived attempts to hide the influence of the model by interspersing pregnancy-related coupons in advertising for general household goods. Target responded by defending its customer analytics program and stating that the resulting inferences were in compliance with federal and state health information laws. The controversy also resulted in a wider conversation around informed consent and whether terms of service are sufficient to notify consumers of the potential use of data mining techniques. In response to this and similar consumer concerns, the White House released a \"Consumer Bill of Rights\" which outlined consumer expectations for security, transparency, and corporate accountability when it comes to online data usage. \"Bathroom policy\" and boycott In April 2016, Target announced on its website that it would allow transgender customers and employees access to use restrooms and changing areas that correspond with the gender with which they identify, except where local laws require otherwise. The announcement read: \"We believe that everyone—every team member, every guest, and every community—deserves to be protected from discrimination, and treated equally. Consistent with this belief, Target supports the federal Equality Act, which provides protections to LGBT individuals, and opposes action that enables discrimination. In our stores, we demonstrate our commitment to an inclusive experience in many ways. Most relevant for the conversations currently underway, we welcome transgender team members and guests to use the restroom or fitting room facility that corresponds with their gender identity.\" The New York Times called this \"the most prominent position taken by a national retailer\". In response, the American Family Association (AFA) launched a nationwide boycott; by April 28 about one million people had signed the AFA's petition. Around the time of publicity about the policy, polls reported a drop from 42% to 38% of consumers noting they would shop at Target. In mid-May, CEO Cornell said the boycott impacted \"just a handful of stores across the country\". Some observers, such as Fortune's Phil Wahba, believed that Target's bathroom policy may have caused part of Target's drop in shopper traffic during the second quarter of 2016. On August 17, Target announced it would add a third, private, single-stall locking bathroom at many of its stores. In 2017, Cornell claimed not to know about, or have approved, the policy before it was published. The policy cost the business US$20 million and caused sales to fall nearly 6% in the three-quarters following. Absence of AEDs in stores In 2014, the California Supreme Court ruled that Target stores do not have a positive duty to keep automated external defibrillators (AEDs) in stores for purposes of first aid. This decision came after a 49-year-old woman died following a heart attack in a Target store, and two family members filed a wrongful-death lawsuit. Refusal to stock albums after digital release Target initially refused to sell Frank Ocean's Channel Orange and Beyoncé's self-titled album, because those records were available to digital retailers, such as iTunes, before physical copies were made. Target representatives said that the earlier digital availability hurt how well those records would sell at Target stores and that stocking them might cause the corporation to lose money. Major sponsorships Events Target often supports major awards shows, such as the Emmys, Golden Globes, Grammys, and Oscars. Target Corporation is a major sponsor of the annual Minneapolis Aquatennial, where it hosts the Target Fireworks Show, the largest annual fireworks show west of the Mississippi River and the fourth-largest annual fireworks show in the United States. Target was a sponsor of the 2006–2007 New Year's Times Square Ball drop, and had its logo placed on the confetti dropped during the celebrations, as well as specially designed \"2007\" glasses. Sports Minnesota United FC In January 2017, Minnesota United FC, a Major League Soccer expansion team debuting for the 2017 season, announced that Target would be the team's front-of-jersey match-kit sponsor, as well as sponsoring MLS overall. This brings one of the largest sponsors in the league, especially for an expansion team making its debut appearance. The team also has an advantage of having a large, well-known hometown brand versus an entity outside the region, in addition to the financial benefits of such a large sponsor. Major League Soccer and US Youth Soccer In 2017, Target announced a series of national, local, and charitable initiatives that mark the retailer's largest-ever push into team sports. Target became an official partner of Major League Soccer in a multiyear deal that includes airtime during MLS broadcasts on Univision, FOX Sports, and ESPN, opportunities for in-stadium experiences, player appearances, and ownership of certain major MLS platforms. Target also announced a $14 million commitment to local youth soccer through two new national initiatives—an $8 million local soccer grant program, and a $6 million partnership with the U.S. Soccer Foundation to build 100 new soccer play spaces by 2020. Target is the official sponsor of 2017 and 2018 MLS All Star Games. Extreme sports Target sponsors professional freestyle motocross rider Nate Adams, pro snowboarder/skateboarder Shaun White, pro skateboarder Paul Rodriguez, pro BMX rider Mat Hoffman, and pro surfer Kolohe Andino. Motocross Target sponsors Motocross and Supercross champion Ryan Dungey. Chip Ganassi Racing Target was a long-time sponsor of the IndyCar and NASCAR racing teams of Chip Ganassi Racing. Target's relationship with Ganassi in IndyCar go back to 1990 when it began sponsoring Eddie Cheever. Some of their most famous drivers in the 1990s include Michael Andretti, Bryan Herta, and Arie Luyendyk. In the late 1990s, Target Chip Ganassi Racing had a four-year run of winning championships in CART, winning 1996 with Jimmy Vasser, 1997 and 1998 with Alex Zanardi, and 1999 with Juan Pablo Montoya. Ganassi won their first Indianapolis 500 in 2000. The team moved full-time into the rival Indy Racing League in 2003, and won in its first year of full-time competition, with Scott Dixon, who won the championship again in 2008. The 2009 season marked the 20th anniversary of the Target race program. Franchitti won his second career IndyCar championship, and with Scott Dixon finishing second, gave Target a one-two sweep in the IndyCar series. Dixon and Franchitti won 10 of 17 races (five each) and tied the team record from 1998 when Alex Zanardi and Jimmy Vasser combined to win 10 in the 19-race 1998 CART season. In 2010, Franchitti won the Indianapolis 500. He also won the series championship for the Target team, by five points over second-place finisher Will Power. In the 2002 NASCAR Winston Cup Series season, the No. 41 Chip Ganassi Target car was driven by Jimmy Spencer, and from 2003 to 2005, Casey Mears drove the car. In 2006, Reed Sorenson took over the 41 car when Mears moved to a different car on the same team. Sorenson drove the car through the 2008 season, and Target has also had some major sponsorship time on the Ganassi Racing No. 40 car with Dario Franchitti and Jeremy Mayfield, who subbed for the injured Franchitti. The 40 team has since been shut down. For 2009, the Target sponsorship moved to the No. 42 driven by Juan Pablo Montoya with the newly formed Earnhardt Ganassi Racing. Target also sponsored Earnhardt Ganassi Racing's No. 8 car driven by Aric Almirola, which it co-sponsors in some races with other sponsors such as Guitar Hero and TomTom until the team was disbanded in May 2009. Kyle Larson took over the No. 42 car in 2014 and Target sponsored the No. 51 of Phoenix Racing for Larson's Sprint Cup Series debut. The Target Chip Ganassi car driven by Dario Franchitti won the 94th running of the Indianapolis 500 on Sunday, May 30, 2010. Target ended its association with IndyCar racing at the end of the 2016 season. In July 2017, Target announced that it would end its sponsorship of Ganassi's NASCAR team at the end of the year. Naming rights Target owns the naming rights to the Minnesota Timberwolves' home, Target Center since it first opened in 1990. Additionally, Target purchased the naming rights to the Minnesota Twins' home ballpark, Target Field, for an undisclosed amount. The sponsorship agreement expires in 2035. Radio Target was the founding sponsor of the Weekend America radio program. Newspaper Dainik Target is a newly established and rapidly growing Bengali-language daily newspaper in Bangladesh. Founded in Dhaka in 2024, it is owned by the Target Group and led by its editor, Md Sunnat Ali Mollik. Dainik Target was first published in Dhaka in 2024. From its inception, it has captured readers' attention with in-depth analysis and reports on a wide range of topics, including national and international news, politics, economy, sports, and entertainment. The newspaper covers news and features on law, government, biographies, autobiographies, art, technology, politics, and lifestyle. It practices impartial and fact-based journalism, earning the trust of its readers. Finances 2020-2024 In popular culture One of the earliest references to Target in popular culture is the film Career Opportunities (1991), written by John Hughes, in which an employee and a customer fall in love after hours inside a Target store. American television program Saturday Night Live featured a recurring sketch in the 2000s starring the Target Lady, an overly enthusiastic Target cashier, played by cast member Kristen Wiig. On April 2, 2024, Wiig reprised her role in a series of Target commercials promoting Target Circle, Target Circle 360, and Target Circle Week. Target is the namesake of an episode of the third season of American TV comedy Superstore. In the episode, an employee at the fictional big-box retailer \"Cloud 9\" leaves for a job at Target, and is accused of poaching employees. During the 2023 Target Pride Month merchandise backlash, the rapper Forgiato Blow released a song titled \"Boycott Target\" which reached #1 on the iTunes chart."
}