{
  "ticker": "TJX",
  "cik": "0000109198",
  "company_name": "TJX Companies",
  "corrected_name": "TJX Companies",
  "wiki_title_used": "TJX Companies",
  "exists": true,
  "raw_text": "The TJX Companies, Inc. (abbreviated TJX) is an American multinational off-price department store corporation, headquartered in Framingham, Massachusetts. It was formed as a subsidiary of Zayre Corp. in 1987, and became the legal successor to Zayre Corp. following a company reorganization in 1989.\nAs of 2019, TJX operates TJ Maxx (in the United States) and TK Maxx (in Australia and Europe), its flagship store chains, along with Marshalls, HomeGoods, HomeSense, and Sierra in the United States, and HomeSense, Marshalls, and Winners in Canada. There are over 4,557 discount stores in the TJX portfolio located in nine countries. TJX ranked No. 80 in the 2024 Fortune 500 list of the largest United States corporations by total revenue. TJX is a  publicly listed stock on the New York Stock Exchange (NYSE) under the ticker symbol TJX and has a capital value of $170 Billion (November 2025).\n\nHistory\nZayre\nThe TJ Maxx concept was first announced by Zayre Corp. in April 1977. Setting it apart from the main Zayre chain was a greater emphasis on \"family apparel, giftwares, and domestic goods at discount prices\". On May 19, 1977, the first two TJ Maxx stores held simultaneous openings in Auburn and Worcester, Massachusetts, with a third opening four days later in Charlotte, North Carolina. In June 1987, Zayre established The TJX Companies as a subsidiary and holding company of TJ Maxx and Hit or Miss. In the first half of 1988, Zayre stores had operating losses of $69 million on sales of $1.4 billion. Observers blamed technological inferiority, poor maintenance, inappropriate pricing, and inventory pileups, and Zayre appeared ripe for takeover. Throughout all this, however, The TJX Companies subsidiary continued to yield a profit. In October 1988, Zayre Corp. decided to focus its energies on TJX. It sold the entire chain of nearly 400 Zayre stores to Ames Department Stores Inc. In exchange, the company received $431.4 million in cash, a receivable note, and what was then valued at $140 million of Ames cumulative senior convertible preferred stock.\nThe company continued focus on its core business, spinning off unrelated operations including BJ's Wholesale Club and Home Club, leaving it with just one brand, T.J. Maxx. In June 1989, Zayre Corp. acquired the outstanding minority interest in TJX and merged with the subsidiary, changing its name from Zayre Corp. to The TJX Companies, Inc. in the process. The newly named company began trading on the New York Stock Exchange.\n\nExpansion\nIn 1990, TJX expanded into an additional store brand division, and at the same time it first went international, as it entered the Canadian market by acquiring the five-store Winners chain. Two years later, it launched its third brand, HomeGoods, in the United States.  TJX's expansion beyond North America came in 1994, when the fourth brand division, T.K. Maxx, was founded in the United Kingdom, and then expanded into Ireland. In 1995, TJX doubled in size when it acquired Marshalls, its fifth brand. T.J. Maxx and Marshalls later became consolidated as two brands under a single division, The Marmaxx Group. The following year, TJX Companies Inc. was added to the Standard & Poor's S&P 500 Composite Index, which consists of 500 of the largest companies in the United States.  TJX sold Hit or Miss, a discount mall based clothing store in 1995 as well through an employee leveraged buyout.\nTJX launched a sixth brand, A.J. Wright, in 1998 in the eastern U.S. The brand went national in 2004 when it opened its first stores in California on the west coast. The company's seventh brand division, HomeSense, formed in 2001, was a Canadian brand modeled after the existing US brand, HomeGoods. TJX revenue surpassed $10 billion that year.\nIn 2002, TJX revenue reached almost $12 billion. In 2003, TJX acquired an eighth brand division, Bob's Stores, concentrated in New England. In Canada, TJX began to configure some Winners and HomeSense stores side by side as superstores. The superstores feature open passageways between them, with dual branding. TJX's revenue in 2003 reached over $13 billion. TJX began to test the side-by-side superstore model in the United States in 2004, combining some of each of the two Marmaxx brand stores with HomeGoods. The company reached 141st position in the 2004 Fortune 500 rankings, with almost $15 billion in revenue. That year was also marked by the death of retired Zayre founder Stanley Feldberg.\nIn April 2008, TJX launched the HomeSense brand in the UK, with six stores opening throughout May. The brand is more upmarket than its Canadian namesake. Later that year, in August, TJX sold Bob's Stores to Versa Capital Management and Crystal Capital.\nIn December 2010, TJX announced that the A.J. Wright stores would be closed, cutting about 4,400 jobs, and that more than half of them would reopen under other company brands.\nIn December 2012, TJX acquired Sierra Trading Post, an off-price internet retailer of outdoor gear and apparel.  Since its acquisition, the retail chain has opened over 70 brick-and-mortar stores in the United States. The chain rebranded to Sierra in 2019.\nIn July 2015, TJX acquired the Trade Secret and Home Secret off-price retail businesses from Australian company Gazal Corporation Limited. The deal was completed in December. In October, Ernie Herrman was named CEO of the company, replacing Carol Meyrowitz. He took over in January 2016.\nIn November 2019, TJX purchased a 25% stake in Russian retailer Familia.\n\nCOVID-19 impact\nOn August 19, 2020, TJX Companies continue to deal with the COVID-19 pandemic's effect on its business. The company announced that revenues dropped 31% over the months of May, June, and July, primarily due to extensive closures of the shop for around one-third of the period. TJX Companies reported a second-quarter loss of $214 million.\n\nIncidents\nComputer systems intrusion\nOn January 17, 2007, TJX announced that it was the victim of an unauthorized computer systems intrusion. It discovered in mid-December 2006 that its computer systems were compromised and customer data was stolen. The hackers accessed a system that stores data on credit card, debit card, check, and merchandise return transactions. The intrusion was kept confidential as requested by law enforcement. TJX said that it was working with General Dynamics, IBM and Deloitte to upgrade computer security.\nBy the end of March 2007, the number of affected customers had reached 45.7 million, and prompted credit bureaus to seek legislation requiring retailers to be responsible for compromised customer information saved in their systems. In addition to credit card numbers, personal information such as social security numbers and driver's license numbers from 451,000 customers were downloaded by the intruders. The breach was possible due to a non-secure wireless network in one of the stores. Eleven men were charged in the theft, and one (Damon Patrick Toey) pleaded guilty to numerous charges related to the breach. Another, Jonathan James, professed his innocence and later committed suicide, apparently out of the belief that he was going to be indicted. The alleged ringleader Albert Gonzalez, was later indicted in August 2009 with attacking Heartland Payment Systems, where 130 million records were compromised.\n\nBrands\nCurrent brands\nOperating divisions\nMarmaxx (US) – TJ Maxx and Marshalls\nHomeGoods (US) – HomeGoods and Homesense\nSierra (US) – Sierra\nTJX Canada – Winners, HomeSense, and Marshalls\nTJX International – TK Maxx (UK, Ireland, Poland, Austria, and the Netherlands) and Homesense (UK and Ireland)\n\nFormer brands\nReferences\nExternal links\nBusiness data for TJX Companies:",
  "clean_text": "The TJX Companies, Inc. (abbreviated TJX) is an American multinational off-price department store corporation, headquartered in Framingham, Massachusetts. It was formed as a subsidiary of Zayre Corp. in 1987, and became the legal successor to Zayre Corp. following a company reorganization in 1989. As of 2019, TJX operates TJ Maxx (in the United States) and TK Maxx (in Australia and Europe), its flagship store chains, along with Marshalls, HomeGoods, HomeSense, and Sierra in the United States, and HomeSense, Marshalls, and Winners in Canada. There are over 4,557 discount stores in the TJX portfolio located in nine countries. TJX ranked No. 80 in the 2024 Fortune 500 list of the largest United States corporations by total revenue. TJX is a publicly listed stock on the New York Stock Exchange (NYSE) under the ticker symbol TJX and has a capital value of $170 Billion (November 2025). History Zayre The TJ Maxx concept was first announced by Zayre Corp. in April 1977. Setting it apart from the main Zayre chain was a greater emphasis on \"family apparel, giftwares, and domestic goods at discount prices\". On May 19, 1977, the first two TJ Maxx stores held simultaneous openings in Auburn and Worcester, Massachusetts, with a third opening four days later in Charlotte, North Carolina. In June 1987, Zayre established The TJX Companies as a subsidiary and holding company of TJ Maxx and Hit or Miss. In the first half of 1988, Zayre stores had operating losses of $69 million on sales of $1.4 billion. Observers blamed technological inferiority, poor maintenance, inappropriate pricing, and inventory pileups, and Zayre appeared ripe for takeover. Throughout all this, however, The TJX Companies subsidiary continued to yield a profit. In October 1988, Zayre Corp. decided to focus its energies on TJX. It sold the entire chain of nearly 400 Zayre stores to Ames Department Stores Inc. In exchange, the company received $431.4 million in cash, a receivable note, and what was then valued at $140 million of Ames cumulative senior convertible preferred stock. The company continued focus on its core business, spinning off unrelated operations including BJ's Wholesale Club and Home Club, leaving it with just one brand, T.J. Maxx. In June 1989, Zayre Corp. acquired the outstanding minority interest in TJX and merged with the subsidiary, changing its name from Zayre Corp. to The TJX Companies, Inc. in the process. The newly named company began trading on the New York Stock Exchange. Expansion In 1990, TJX expanded into an additional store brand division, and at the same time it first went international, as it entered the Canadian market by acquiring the five-store Winners chain. Two years later, it launched its third brand, HomeGoods, in the United States. TJX's expansion beyond North America came in 1994, when the fourth brand division, T.K. Maxx, was founded in the United Kingdom, and then expanded into Ireland. In 1995, TJX doubled in size when it acquired Marshalls, its fifth brand. T.J. Maxx and Marshalls later became consolidated as two brands under a single division, The Marmaxx Group. The following year, TJX Companies Inc. was added to the Standard & Poor's S&P 500 Composite Index, which consists of 500 of the largest companies in the United States. TJX sold Hit or Miss, a discount mall based clothing store in 1995 as well through an employee leveraged buyout. TJX launched a sixth brand, A.J. Wright, in 1998 in the eastern U.S. The brand went national in 2004 when it opened its first stores in California on the west coast. The company's seventh brand division, HomeSense, formed in 2001, was a Canadian brand modeled after the existing US brand, HomeGoods. TJX revenue surpassed $10 billion that year. In 2002, TJX revenue reached almost $12 billion. In 2003, TJX acquired an eighth brand division, Bob's Stores, concentrated in New England. In Canada, TJX began to configure some Winners and HomeSense stores side by side as superstores. The superstores feature open passageways between them, with dual branding. TJX's revenue in 2003 reached over $13 billion. TJX began to test the side-by-side superstore model in the United States in 2004, combining some of each of the two Marmaxx brand stores with HomeGoods. The company reached 141st position in the 2004 Fortune 500 rankings, with almost $15 billion in revenue. That year was also marked by the death of retired Zayre founder Stanley Feldberg. In April 2008, TJX launched the HomeSense brand in the UK, with six stores opening throughout May. The brand is more upmarket than its Canadian namesake. Later that year, in August, TJX sold Bob's Stores to Versa Capital Management and Crystal Capital. In December 2010, TJX announced that the A.J. Wright stores would be closed, cutting about 4,400 jobs, and that more than half of them would reopen under other company brands. In December 2012, TJX acquired Sierra Trading Post, an off-price internet retailer of outdoor gear and apparel. Since its acquisition, the retail chain has opened over 70 brick-and-mortar stores in the United States. The chain rebranded to Sierra in 2019. In July 2015, TJX acquired the Trade Secret and Home Secret off-price retail businesses from Australian company Gazal Corporation Limited. The deal was completed in December. In October, Ernie Herrman was named CEO of the company, replacing Carol Meyrowitz. He took over in January 2016. In November 2019, TJX purchased a 25% stake in Russian retailer Familia. COVID-19 impact On August 19, 2020, TJX Companies continue to deal with the COVID-19 pandemic's effect on its business. The company announced that revenues dropped 31% over the months of May, June, and July, primarily due to extensive closures of the shop for around one-third of the period. TJX Companies reported a second-quarter loss of $214 million. Incidents Computer systems intrusion On January 17, 2007, TJX announced that it was the victim of an unauthorized computer systems intrusion. It discovered in mid-December 2006 that its computer systems were compromised and customer data was stolen. The hackers accessed a system that stores data on credit card, debit card, check, and merchandise return transactions. The intrusion was kept confidential as requested by law enforcement. TJX said that it was working with General Dynamics, IBM and Deloitte to upgrade computer security. By the end of March 2007, the number of affected customers had reached 45.7 million, and prompted credit bureaus to seek legislation requiring retailers to be responsible for compromised customer information saved in their systems. In addition to credit card numbers, personal information such as social security numbers and driver's license numbers from 451,000 customers were downloaded by the intruders. The breach was possible due to a non-secure wireless network in one of the stores. Eleven men were charged in the theft, and one (Damon Patrick Toey) pleaded guilty to numerous charges related to the breach. Another, Jonathan James, professed his innocence and later committed suicide, apparently out of the belief that he was going to be indicted. The alleged ringleader Albert Gonzalez, was later indicted in August 2009 with attacking Heartland Payment Systems, where 130 million records were compromised. Brands Current brands Operating divisions Marmaxx (US) – TJ Maxx and Marshalls HomeGoods (US) – HomeGoods and Homesense Sierra (US) – Sierra TJX Canada – Winners, HomeSense, and Marshalls TJX International – TK Maxx (UK, Ireland, Poland, Austria, and the Netherlands) and Homesense (UK and Ireland) Former brands"
}