{
  "ticker": "TKO",
  "cik": "0001973266",
  "company_name": "TKO Group Holdings",
  "corrected_name": "TKO Group Holdings",
  "wiki_title_used": "TKO Group Holdings",
  "exists": true,
  "raw_text": "TKO Group Holdings, Inc. (TKO) is an American sports and sports entertainment company. Established on September 12, 2023, the public company was formed by a merger between Endeavor subsidiary Zuffa—the parent company of the Ultimate Fighting Championship (UFC) mixed martial arts promotion —and  the professional wrestling promotion World Wrestling Entertainment (WWE). \nTKO's CEO is Ari Emanuel and president Mark Shapiro, both of Endeavor; Dana White and Nick Khan retained their roles as CEOs of UFC and WWE, respectively after the merger. WWE co-founder Vince McMahon served as executive chairman until resigning from the company in January 2024 amid a sex trafficking scandal. The merger marked the first time that WWE has not been solely and primarily majority-controlled by the McMahon family, which founded the company and owned it for over 70 years.\nAs of 2024, the UFC and WWE were the two most valuable combat sports organizations in the world according to Forbes. UFC was listed as the most valued mixed martial arts (MMA) company with a revenue of $1.406 billion and WWE is the most valued professional wrestling promotion with a revenue of $1.398 billion in 2023. \nIn 2025, TKO announced plans to form a boxing promotion known as Zuffa Boxing and acquire other sports and entertainment assets from Endeavor as part of Endeavor's sale to Silver Lake Partners, including Professional Bull Riders (PBR), hospitality agency On Location Events, and assets from IMG.\n\nBackground\nWWE was founded in 1953 as the Capitol Wrestling Corporation (CWC), a Northeastern territory of the National Wrestling Alliance (NWA). The CWC was run by Vincent J. McMahon, son of boxing and wrestling promoter Jess McMahon. Following a booking dispute over CWC wrestler Buddy Rogers and the NWA World Heavyweight Championship, the CWC left the NWA and became the World Wide Wrestling Federation (WWWF) in January 1963, and, by April 25, 1963, Rogers was declared the first WWWF World Heavyweight Champion. The WWWF was renamed to the World Wrestling Federation (WWF) in 1979; the WWF made its final departure from the NWA in 1983.\nThe current legal entity, which was originally named Titan Sports, Inc., was incorporated on February 21, 1980, in South Yarmouth, Massachusetts, but reincorporated under Delaware General Corporation Law in 1987. Titan Sports was co-founded by Vincent K. McMahon, Vincent J.'s son, and his wife Linda. It acquired Capitol Wrestling Corporation Ltd., the holding company for the WWF, in 1982. After buying the WWF, Vince McMahon expanded the promotion by overturning the NWA's territory system and holding events around the United States and the world which were televised on a global basis.\nThroughout the 1980s WWF began to capitalize on the popularity of rising star Hulk Hogan after he defeated The Iron Sheik at Madison Square Garden on January 23, 1984 to capture the WWF World Heavyweight Championship. On March 31, 1985 WWF held the first WrestleMania, which would go on to become WWF's flagship event. Initially broadcast on closed-circuit television, WrestleMania became a pay-per-view the following year, as WWF expanded its pay-per-view offerings and became known as a pioneer for the relatively new distribution format. In January 1993, WWF introduced its live, weekly episodic television show, Monday Night Raw.\nWWF became a publicly traded company in August 1999, launching an initial public offering on the New York Stock Exchange. The company's status as the world's premier professional wrestling organization was cemented by its acquisition of the assets of World Championship Wrestling in 2001 following the Monday Night War. Titan Sports was renamed World Wrestling Federation Entertainment, Inc. in 1999, and then World Wrestling Entertainment, Inc. in 2002 after a legal dispute with the World Wildlife Fund. Since 2011, the company has branded itself solely with the initials WWE, though the legal name did not change at the time. WWE's majority owner was its executive chairman, third-generation wrestling promoter Vince McMahon, who retained a 38.6% ownership of the company's outstanding stock and 81.1% of the voting power before the merger. The closure of the merger saw McMahon's voting power and stock ownership dramatically decrease.\n\nThe Ultimate Fighting Championship (UFC), initially under the ownership of the Semaphore Entertainment Group, was founded by American businessman Art Davie and Brazilian martial artist Rorion Gracie with their partners in WOW Promotions. The first UFC event was held in November 12, 1993 at the McNichols Sports Arena in Denver. The purpose of the early ultimate fighting competitions was to identify the most effective martial art in a contest with minimal rules and no weight classes between competitors of different fighting disciplines. In subsequent events, more rigorous rules were created and fighters began adopting effective techniques from more than one discipline, which indirectly helped create a separate style of fighting known as present-day mixed martial arts (MMA).\nIn April 1995, after UFC 5, Davie and Gracie sold their remaining interest in the UFC to the Semaphore Entertainment Group and disbanded WOW Promotions. Six years later in 2001, Zuffa, a sports promotion company headed by Frank and Lorenzo Fertitta, purchased the UFC from the Semaphore Entertainment Group. Zuffa's ownership led to a growth period for the company and the sport of MMA in general; the UFC's global leadership in the sport led to Zuffa buying the assets of the Pride Fighting Championships in 2007 and the Strikeforce promotion in 2011 (among other MMA promotions). In 2016, Zuffa was sold to a group led by Endeavor, then known as William Morris Endeavor (WME–IMG), including Silver Lake Partners, Kohlberg Kravis Roberts and MSD Capital for US$4.025 billion. In 2017, WME–IMG changed its holding name to Endeavor and four years later, in 2021, Endeavor bought out Zuffa's other owners at a valuation of $1.7 billion.\n\nHistory\nWWE's preparations for a sale\nOn June 17, 2022, amid allegations of misconduct, Vince McMahon stepped down as the chairman and CEO of WWE, leaving the company to his daughter, Stephanie McMahon, and Nick Khan. In January 2023, Vince said he planned to return to WWE ahead of media rights negotiations. WWE's media rights with Fox and USA Network were set to expire in 2024. Also in January 2023, JPMorgan & Co was hired to handle a possible sale of the company, with rumored suitors including Comcast and Fox Corporation (owners of WWE's broadcast partners USA Network and Fox), The Walt Disney Company (owners of ESPN), Warner Bros. Discovery (media partners of All Elite Wrestling), Netflix, Amazon, Endeavor (WWE had an existing business relationship with its subsidiary Endeavor Streaming, which took over the technical operations of its streaming service WWE Network in 2019), Liberty Media, Creative Artists Agency, and Saudi Arabia's Public Investment Fund (WWE has a long-term agreement with Saudi Arabia's Ministry of Sport to promote events in the country).\nOn January 10, 2023, Stephanie McMahon resigned as WWE's chairwoman and co-CEO, after which Vince McMahon assumed the role of executive chairman of WWE while Nick Khan became the sole CEO.\n\nFormation\nIn September 2023, Endeavor Group Holdings, UFC, and WWE formed a new publicly traded company, TKO Group Holdings, Inc. The new entity went public on September 12, 2023 and is listed on the New York Stock Exchange (NYSE) under the symbol \"TKO\". At the close of the deal, Endeavor held a 51% stake in TKO Group Holdings, with WWE's shareholders having a 49% stake, valuing WWE at $9.3 billion. This marked the first time that WWE had not been majority-controlled by members of the McMahon family. Endeavor CEO Ari Emanuel became CEO of TKO and Mark Shapiro became president and chief operating officer, with each maintaining their respective roles at Endeavor. UFC and WWE continued to operate as separate divisions under TKO, with Dana White as CEO of the UFC and Nick Khan serving as president of WWE post-merger. WWE's head of creative Paul Levesque remained in his role.\nWhen the merger was first announced in April 2023, Emanuel stated that it would \"bring together two leading pureplay sports and entertainment companies\" and provide \"significant operating synergies\". McMahon stated that \"family businesses have to evolve for all the right reasons\", and that \"given the incredible work that Ari and Endeavor have done to grow the UFC brand — nearly doubling its revenue over the past seven years — and the immense success we've already had in partnering with their team on a number of ventures, I believe that this is without a doubt the best outcome for our shareholders and other stakeholders.\"\nThe merger closed on September 12, 2023; with Vince McMahon personally owning approximately one-third of the Class A Common Stock of TKO Group Holdings, Inc.  The first television show produced under the TKO banner was the September 12 episode of WWE NXT. Following the merger, Dana White was made CEO of UFC.\nIn January 2024, a lawsuit was filed by Janel Grant, a former employee at WWE headquarters between 2019 and 2022 against WWE as well as TKO (by proxy of ownership). Grant alleged that the then current TKO Executive Chairman Vince McMahon, had coerced her into a sexual relationship, and, along with WWE executive John Laurinaitis and a WWE wrestler who was also a former UFC fighter, sexually trafficked her and repeatedly sexually assaulted her between 2020–2021. Grant alleged that she was subjected to \"extreme cruelty and degradation\" by McMahon, including being defecated upon during a sexual encounter. Grant stated that McMahon had agreed to pay her $3 million in 2022 in return for a NDA, but stopped paying after only $1 million had been paid following the initial public emergence of the sexual misconduct allegations the same year. Federal prosecutors have subpoenaed McMahon, and have taken up the filing in question. One day after the report – on January 26, 2024 – Vince McMahon resigned from TKO. In a statement, McMahon said the decision was made \"out of respect for the WWE Universe, the extraordinary TKO business and its board members and shareholders, partners and constituents, and all of the employees\".\n\nFurther investments and acquisitions\nIn July 2024, TKO Group announced an investment in EverPass Media, an NFL-backed distributor of streaming pay television content to commercial establishments. Shapiro joined the company's board of directors.\nOn October 23, 2024, it was announced that TKO Group would acquire several businesses from Endeavor, including sports and event management firm IMG (aside from \"businesses associated with the IMG brand in licensing, models, and tennis representation, nor IMG's full events portfolio\"), On Location Events (a luxury hospitality agency focused on major sporting events), and Professional Bull Riders (PBR), for $3.25 billion in an all-stock deal expected to close in 2025. Shapiro stated that Silver Lake Partners had requested the divestment of certain Endeavor assets as part of its planned buyout of the company, and that Endeavor had approached TKO Group with an offer. He explained that TKO was interested in league ownership and \"businesses that can power our current sports ecosystem\", while the company stated that it would \"[expand] TKO's operational footprint in the fast-growing premium sports market and enables direct participation in the upside from partner leagues and events.\" Under the terms of the deal, Endeavor will own 59% of TKO and the remaining shareholders will control the other 41%. The sale was officially completed on February 28, 2025. To promote the acquisition, TKO staged a series of consecutive PBR, UFC, and WWE events billed as \"TKO Takeover\" on April 24, 26, and 28, at T-Mobile Center in Kansas City, consisting of a PBR team knockout event, a UFC on ESPN card, and WWE Raw respectively.\nOn March 5, 2025, TKO announced a partnership with Turki Al-Sheikh, the chairman of the Saudi General Entertainment Authority, and Saudi entertainment conglomerate Sela to launch a new boxing promotion in 2026. On April 19, 2025, it was announced that via WWE, TKO would acquire the Mexican lucha libre promotion Lucha Libre AAA Worldwide in a joint venture with Fillip, a Mexican sports and entertainment company. The sale is expected to close in the third quarter of 2025, with TKO holding a 51% controlling stake.\nOn June 6, 2025, TKO announced the creation of UFC Brazilian Jiu-Jitsu (UFC BJJ), a sister company to the UFC based on submission grappling. UFC BJJ was described by the UFC as \"the world’s new premier Brazilian Jiu-Jitsu live event series\". On June 23, 2025, Ring Magazine officially announced that TKO's boxing promotion (earlier announced in March 2025 in partnership with Turki Al-Sheikh and Sela) will be known as Zuffa Boxing. Zuffa Boxing's inaugural event, Álvarez vs. Crawford: Once In A Lifetime, took place on September 13, 2025 at the Allegiant Stadium. On September 29, 2025, it was announced that Zuffa Boxing had signed a media rights agreement with Paramount Skydance for their events to air on the Paramount+ streaming platform; the promotion will air 12 events yearly on the streaming platform with the potential of simulcasts on CBS.\n\nOwnership\nAs of June 2025, the ownership structure of TKO Group Holdings consists of: \n\nEndeavor (via Silver Lake) – 61.72%\nWWE shareholders – 38.28%\nVarious stockholders – 24.65%\nMcMahon family – 4.52%\nVince McMahon – 3.25%\nStephanie McMahon – 0.98%\nLinda McMahon – 0.29%\nThe Vanguard Group – 4.03%\nState Street Corporation – 2.54%\nBlackRock – 2.20%\nDwayne Johnson – 0.17%\nNick Khan – 0.11%\nAndrew Schleimer – 0.04%\nJonathan Kraft (Kraft Group) – 0.02%\n\nCorporate governance\nThe board of directors of TKO Group Holdings initially consisted of eleven members. On January 23, 2024, the TKO board of directors would be increased from eleven members to thirteen members. Following this, WWE underwent some changes, which included broadcast deals with different partners (including Netflix) and giving up ownership of Dwayne Johnson's trademarked name \"The Rock\" to Johnson, who would also join TKO's board of directors. The board of directors shrunk to twelve members on January 26, 2024 after board of directors member and Executive Chairman Vince McMahon resigned from TKO following sex trafficking and sexual assault allegations involving a former WWE employee.\nThe board of directors of TKO Group Holdings currently consists of these twelve members:\n\nAssets\nWorld Wrestling Entertainment (WWE)\nLucha Libre AAA Worldwide (51% with Fillip Holdings)\nTapout (50% with Authentic)\nBreath Death Inc. (minority owner)\nBreath Death\nRahm Inc. (minority owner)\nReal American Beer\nTSI Realty Services, Inc.\nWWE Jet Services Inc.\nWCW Inc.\nWWE Books\nWWE Music Group\nWWE Network\nWWE Performance Center\nWWE Podcast Network\nWWE Recruit\nWWE Studios\nWWE Legacy Department\nAmerican Wrestling Association\nMinneapolis Boxing & Wrestling Club\nCentral States Wrestling (select footage)\nMidwest Wrestling Association\nChampionship Wrestling from Florida\nChampionship Wrestling from Georgia\nDeep South Wrestling (select footage)\nDragon Gate USA (select footage)\nEvolve\nExtreme Championship Wrestling\nEastern Championship Wrestling\nFlorida Championship Wrestling\nGeorgia Championship Wrestling (select footage)\nGlobal Wrestling Federation\nHeartland Wrestling Association (select footage)\nInternational Championship Wrestling\nJim Crockett Promotions\nEastern States Championship Wrestling\nMid-Atlantic Championship Wrestling\nMaple Leaf Wrestling\nQueensbury Athletic Club\nMemphis Championship Wrestling\nOhio Valley Wrestling (select footage)\nSmoky Mountain Wrestling\nStampede Wrestling (select footage)\nBig Time Wrestling\nKlondike Wrestling\nWildcat Wrestling\nSt. Louis Wrestling Club\nUltimate Pro Wrestling\nUniversal Wrestling Federation\nMid-South Wrestling\nNWA Tri-State\nWorld Class Championship Wrestling (select footage)\nNWA Big Time Wrestling\nWorld Class Wrestling Association\nWorld Championship Wrestling\nWorld Wrestling Council (select footage)\nCapitol Sports Promotions\nUltimate Fighting Championship (UFC)\nUFC Apex\nUFC Brazilian Jiu-Jitsu\nUFC Fight Pass\nUFC Gym\nUFC Fit\nUFC Magazine\nUFC Performance Institute\nUFC Performance Institute Shanghai\nUFC Performance Institute Mexico City\nUFC Store\nUltimate Fighting Productions, LLC\nZuffa (assets)\nPride Fighting Championships\nStrikeforce\nWorld Extreme Cagefighting\nWorld Fighting Alliance\nProfessional Bull Riders (PBR)\nAmerican Bucking Bull\nPBR Cowboy Bar\nIMG\nVarious IMG assets\nOn Location Events\nZuffa Boxing\n\nSee also\nProfessional wrestling in the United States\nMixed martial arts in the United States\nBoxing in the United States\n\nNotes\nReferences\nExternal links\nOfficial website \nBusiness data for TKO Group Holdings, Inc. (Class A):",
  "clean_text": "TKO Group Holdings, Inc. (TKO) is an American sports and sports entertainment company. Established on September 12, 2023, the public company was formed by a merger between Endeavor subsidiary Zuffa—the parent company of the Ultimate Fighting Championship (UFC) mixed martial arts promotion —and the professional wrestling promotion World Wrestling Entertainment (WWE). TKO's CEO is Ari Emanuel and president Mark Shapiro, both of Endeavor; Dana White and Nick Khan retained their roles as CEOs of UFC and WWE, respectively after the merger. WWE co-founder Vince McMahon served as executive chairman until resigning from the company in January 2024 amid a sex trafficking scandal. The merger marked the first time that WWE has not been solely and primarily majority-controlled by the McMahon family, which founded the company and owned it for over 70 years. As of 2024, the UFC and WWE were the two most valuable combat sports organizations in the world according to Forbes. UFC was listed as the most valued mixed martial arts (MMA) company with a revenue of $1.406 billion and WWE is the most valued professional wrestling promotion with a revenue of $1.398 billion in 2023. In 2025, TKO announced plans to form a boxing promotion known as Zuffa Boxing and acquire other sports and entertainment assets from Endeavor as part of Endeavor's sale to Silver Lake Partners, including Professional Bull Riders (PBR), hospitality agency On Location Events, and assets from IMG. Background WWE was founded in 1953 as the Capitol Wrestling Corporation (CWC), a Northeastern territory of the National Wrestling Alliance (NWA). The CWC was run by Vincent J. McMahon, son of boxing and wrestling promoter Jess McMahon. Following a booking dispute over CWC wrestler Buddy Rogers and the NWA World Heavyweight Championship, the CWC left the NWA and became the World Wide Wrestling Federation (WWWF) in January 1963, and, by April 25, 1963, Rogers was declared the first WWWF World Heavyweight Champion. The WWWF was renamed to the World Wrestling Federation (WWF) in 1979; the WWF made its final departure from the NWA in 1983. The current legal entity, which was originally named Titan Sports, Inc., was incorporated on February 21, 1980, in South Yarmouth, Massachusetts, but reincorporated under Delaware General Corporation Law in 1987. Titan Sports was co-founded by Vincent K. McMahon, Vincent J.'s son, and his wife Linda. It acquired Capitol Wrestling Corporation Ltd., the holding company for the WWF, in 1982. After buying the WWF, Vince McMahon expanded the promotion by overturning the NWA's territory system and holding events around the United States and the world which were televised on a global basis. Throughout the 1980s WWF began to capitalize on the popularity of rising star Hulk Hogan after he defeated The Iron Sheik at Madison Square Garden on January 23, 1984 to capture the WWF World Heavyweight Championship. On March 31, 1985 WWF held the first WrestleMania, which would go on to become WWF's flagship event. Initially broadcast on closed-circuit television, WrestleMania became a pay-per-view the following year, as WWF expanded its pay-per-view offerings and became known as a pioneer for the relatively new distribution format. In January 1993, WWF introduced its live, weekly episodic television show, Monday Night Raw. WWF became a publicly traded company in August 1999, launching an initial public offering on the New York Stock Exchange. The company's status as the world's premier professional wrestling organization was cemented by its acquisition of the assets of World Championship Wrestling in 2001 following the Monday Night War. Titan Sports was renamed World Wrestling Federation Entertainment, Inc. in 1999, and then World Wrestling Entertainment, Inc. in 2002 after a legal dispute with the World Wildlife Fund. Since 2011, the company has branded itself solely with the initials WWE, though the legal name did not change at the time. WWE's majority owner was its executive chairman, third-generation wrestling promoter Vince McMahon, who retained a 38.6% ownership of the company's outstanding stock and 81.1% of the voting power before the merger. The closure of the merger saw McMahon's voting power and stock ownership dramatically decrease. The Ultimate Fighting Championship (UFC), initially under the ownership of the Semaphore Entertainment Group, was founded by American businessman Art Davie and Brazilian martial artist Rorion Gracie with their partners in WOW Promotions. The first UFC event was held in November 12, 1993 at the McNichols Sports Arena in Denver. The purpose of the early ultimate fighting competitions was to identify the most effective martial art in a contest with minimal rules and no weight classes between competitors of different fighting disciplines. In subsequent events, more rigorous rules were created and fighters began adopting effective techniques from more than one discipline, which indirectly helped create a separate style of fighting known as present-day mixed martial arts (MMA). In April 1995, after UFC 5, Davie and Gracie sold their remaining interest in the UFC to the Semaphore Entertainment Group and disbanded WOW Promotions. Six years later in 2001, Zuffa, a sports promotion company headed by Frank and Lorenzo Fertitta, purchased the UFC from the Semaphore Entertainment Group. Zuffa's ownership led to a growth period for the company and the sport of MMA in general; the UFC's global leadership in the sport led to Zuffa buying the assets of the Pride Fighting Championships in 2007 and the Strikeforce promotion in 2011 (among other MMA promotions). In 2016, Zuffa was sold to a group led by Endeavor, then known as William Morris Endeavor (WME–IMG), including Silver Lake Partners, Kohlberg Kravis Roberts and MSD Capital for US$4.025 billion. In 2017, WME–IMG changed its holding name to Endeavor and four years later, in 2021, Endeavor bought out Zuffa's other owners at a valuation of $1.7 billion. History WWE's preparations for a sale On June 17, 2022, amid allegations of misconduct, Vince McMahon stepped down as the chairman and CEO of WWE, leaving the company to his daughter, Stephanie McMahon, and Nick Khan. In January 2023, Vince said he planned to return to WWE ahead of media rights negotiations. WWE's media rights with Fox and USA Network were set to expire in 2024. Also in January 2023, JPMorgan & Co was hired to handle a possible sale of the company, with rumored suitors including Comcast and Fox Corporation (owners of WWE's broadcast partners USA Network and Fox), The Walt Disney Company (owners of ESPN), Warner Bros. Discovery (media partners of All Elite Wrestling), Netflix, Amazon, Endeavor (WWE had an existing business relationship with its subsidiary Endeavor Streaming, which took over the technical operations of its streaming service WWE Network in 2019), Liberty Media, Creative Artists Agency, and Saudi Arabia's Public Investment Fund (WWE has a long-term agreement with Saudi Arabia's Ministry of Sport to promote events in the country). On January 10, 2023, Stephanie McMahon resigned as WWE's chairwoman and co-CEO, after which Vince McMahon assumed the role of executive chairman of WWE while Nick Khan became the sole CEO. Formation In September 2023, Endeavor Group Holdings, UFC, and WWE formed a new publicly traded company, TKO Group Holdings, Inc. The new entity went public on September 12, 2023 and is listed on the New York Stock Exchange (NYSE) under the symbol \"TKO\". At the close of the deal, Endeavor held a 51% stake in TKO Group Holdings, with WWE's shareholders having a 49% stake, valuing WWE at $9.3 billion. This marked the first time that WWE had not been majority-controlled by members of the McMahon family. Endeavor CEO Ari Emanuel became CEO of TKO and Mark Shapiro became president and chief operating officer, with each maintaining their respective roles at Endeavor. UFC and WWE continued to operate as separate divisions under TKO, with Dana White as CEO of the UFC and Nick Khan serving as president of WWE post-merger. WWE's head of creative Paul Levesque remained in his role. When the merger was first announced in April 2023, Emanuel stated that it would \"bring together two leading pureplay sports and entertainment companies\" and provide \"significant operating synergies\". McMahon stated that \"family businesses have to evolve for all the right reasons\", and that \"given the incredible work that Ari and Endeavor have done to grow the UFC brand — nearly doubling its revenue over the past seven years — and the immense success we've already had in partnering with their team on a number of ventures, I believe that this is without a doubt the best outcome for our shareholders and other stakeholders.\" The merger closed on September 12, 2023; with Vince McMahon personally owning approximately one-third of the Class A Common Stock of TKO Group Holdings, Inc. The first television show produced under the TKO banner was the September 12 episode of WWE NXT. Following the merger, Dana White was made CEO of UFC. In January 2024, a lawsuit was filed by Janel Grant, a former employee at WWE headquarters between 2019 and 2022 against WWE as well as TKO (by proxy of ownership). Grant alleged that the then current TKO Executive Chairman Vince McMahon, had coerced her into a sexual relationship, and, along with WWE executive John Laurinaitis and a WWE wrestler who was also a former UFC fighter, sexually trafficked her and repeatedly sexually assaulted her between 2020–2021. Grant alleged that she was subjected to \"extreme cruelty and degradation\" by McMahon, including being defecated upon during a sexual encounter. Grant stated that McMahon had agreed to pay her $3 million in 2022 in return for a NDA, but stopped paying after only $1 million had been paid following the initial public emergence of the sexual misconduct allegations the same year. Federal prosecutors have subpoenaed McMahon, and have taken up the filing in question. One day after the report – on January 26, 2024 – Vince McMahon resigned from TKO. In a statement, McMahon said the decision was made \"out of respect for the WWE Universe, the extraordinary TKO business and its board members and shareholders, partners and constituents, and all of the employees\". Further investments and acquisitions In July 2024, TKO Group announced an investment in EverPass Media, an NFL-backed distributor of streaming pay television content to commercial establishments. Shapiro joined the company's board of directors. On October 23, 2024, it was announced that TKO Group would acquire several businesses from Endeavor, including sports and event management firm IMG (aside from \"businesses associated with the IMG brand in licensing, models, and tennis representation, nor IMG's full events portfolio\"), On Location Events (a luxury hospitality agency focused on major sporting events), and Professional Bull Riders (PBR), for $3.25 billion in an all-stock deal expected to close in 2025. Shapiro stated that Silver Lake Partners had requested the divestment of certain Endeavor assets as part of its planned buyout of the company, and that Endeavor had approached TKO Group with an offer. He explained that TKO was interested in league ownership and \"businesses that can power our current sports ecosystem\", while the company stated that it would \"[expand] TKO's operational footprint in the fast-growing premium sports market and enables direct participation in the upside from partner leagues and events.\" Under the terms of the deal, Endeavor will own 59% of TKO and the remaining shareholders will control the other 41%. The sale was officially completed on February 28, 2025. To promote the acquisition, TKO staged a series of consecutive PBR, UFC, and WWE events billed as \"TKO Takeover\" on April 24, 26, and 28, at T-Mobile Center in Kansas City, consisting of a PBR team knockout event, a UFC on ESPN card, and WWE Raw respectively. On March 5, 2025, TKO announced a partnership with Turki Al-Sheikh, the chairman of the Saudi General Entertainment Authority, and Saudi entertainment conglomerate Sela to launch a new boxing promotion in 2026. On April 19, 2025, it was announced that via WWE, TKO would acquire the Mexican lucha libre promotion Lucha Libre AAA Worldwide in a joint venture with Fillip, a Mexican sports and entertainment company. The sale is expected to close in the third quarter of 2025, with TKO holding a 51% controlling stake. On June 6, 2025, TKO announced the creation of UFC Brazilian Jiu-Jitsu (UFC BJJ), a sister company to the UFC based on submission grappling. UFC BJJ was described by the UFC as \"the world’s new premier Brazilian Jiu-Jitsu live event series\". On June 23, 2025, Ring Magazine officially announced that TKO's boxing promotion (earlier announced in March 2025 in partnership with Turki Al-Sheikh and Sela) will be known as Zuffa Boxing. Zuffa Boxing's inaugural event, Álvarez vs. Crawford: Once In A Lifetime, took place on September 13, 2025 at the Allegiant Stadium. On September 29, 2025, it was announced that Zuffa Boxing had signed a media rights agreement with Paramount Skydance for their events to air on the Paramount+ streaming platform; the promotion will air 12 events yearly on the streaming platform with the potential of simulcasts on CBS. Ownership As of June 2025, the ownership structure of TKO Group Holdings consists of: Endeavor (via Silver Lake) – 61.72% WWE shareholders – 38.28% Various stockholders – 24.65% McMahon family – 4.52% Vince McMahon – 3.25% Stephanie McMahon – 0.98% Linda McMahon – 0.29% The Vanguard Group – 4.03% State Street Corporation – 2.54% BlackRock – 2.20% Dwayne Johnson – 0.17% Nick Khan – 0.11% Andrew Schleimer – 0.04% Jonathan Kraft (Kraft Group) – 0.02% Corporate governance The board of directors of TKO Group Holdings initially consisted of eleven members. On January 23, 2024, the TKO board of directors would be increased from eleven members to thirteen members. Following this, WWE underwent some changes, which included broadcast deals with different partners (including Netflix) and giving up ownership of Dwayne Johnson's trademarked name \"The Rock\" to Johnson, who would also join TKO's board of directors. The board of directors shrunk to twelve members on January 26, 2024 after board of directors member and Executive Chairman Vince McMahon resigned from TKO following sex trafficking and sexual assault allegations involving a former WWE employee. The board of directors of TKO Group Holdings currently consists of these twelve members: Assets World Wrestling Entertainment (WWE) Lucha Libre AAA Worldwide (51% with Fillip Holdings) Tapout (50% with Authentic) Breath Death Inc. (minority owner) Breath Death Rahm Inc. (minority owner) Real American Beer TSI Realty Services, Inc. WWE Jet Services Inc. WCW Inc. WWE Books WWE Music Group WWE Network WWE Performance Center WWE Podcast Network WWE Recruit WWE Studios WWE Legacy Department American Wrestling Association Minneapolis Boxing & Wrestling Club Central States Wrestling (select footage) Midwest Wrestling Association Championship Wrestling from Florida Championship Wrestling from Georgia Deep South Wrestling (select footage) Dragon Gate USA (select footage) Evolve Extreme Championship Wrestling Eastern Championship Wrestling Florida Championship Wrestling Georgia Championship Wrestling (select footage) Global Wrestling Federation Heartland Wrestling Association (select footage) International Championship Wrestling Jim Crockett Promotions Eastern States Championship Wrestling Mid-Atlantic Championship Wrestling Maple Leaf Wrestling Queensbury Athletic Club Memphis Championship Wrestling Ohio Valley Wrestling (select footage) Smoky Mountain Wrestling Stampede Wrestling (select footage) Big Time Wrestling Klondike Wrestling Wildcat Wrestling St. Louis Wrestling Club Ultimate Pro Wrestling Universal Wrestling Federation Mid-South Wrestling NWA Tri-State World Class Championship Wrestling (select footage) NWA Big Time Wrestling World Class Wrestling Association World Championship Wrestling World Wrestling Council (select footage) Capitol Sports Promotions Ultimate Fighting Championship (UFC) UFC Apex UFC Brazilian Jiu-Jitsu UFC Fight Pass UFC Gym UFC Fit UFC Magazine UFC Performance Institute UFC Performance Institute Shanghai UFC Performance Institute Mexico City UFC Store Ultimate Fighting Productions, LLC Zuffa (assets) Pride Fighting Championships Strikeforce World Extreme Cagefighting World Fighting Alliance Professional Bull Riders (PBR) American Bucking Bull PBR Cowboy Bar IMG Various IMG assets On Location Events Zuffa Boxing"
}