{
  "ticker": "TMO",
  "cik": "0000097745",
  "company_name": "Thermo Fisher Scientific",
  "corrected_name": "Thermo Fisher Scientific",
  "wiki_title_used": "Thermo Fisher Scientific",
  "exists": true,
  "raw_text": "Thermo Fisher Scientific Inc. is an American life science and clinical research company. It is a global supplier of analytical instruments, clinical development solutions, specialty diagnostics, laboratory, pharmaceutical and biotechnology services. Based in Waltham, Massachusetts, Thermo Fisher was formed through the merger of Thermo Electron and Fisher Scientific in 2006. Thermo Fisher Scientific has acquired other reagent, consumable, instrumentation, and service providers, including Life Technologies Corporation (2013), Alfa Aesar (2015), Affymetrix (2016), FEI Company (2016), BD Advanced Bioprocessing (2018), and PPD (2021).\nIt ranked 104th on the Fortune 500 list based on its 2024 annual revenue of $42.879 billion.\nThermo Fisher announced a $2 billion investment over four years in the U.S., including $1.5 billion for expanding manufacturing capacity and $500 million for R&D investment. This initiative aims to bolster domestic biotech manufacturing, create high-paying jobs, and reinforce the U.S. healthcare supply chain.\n\nHistory\nPredecessors and merger\nThermo Electron was co-founded in 1956 by George N. Hatsopoulos and Peter M Nomikos. Hatsopoulos received a PhD from MIT in mechanical engineering and Nomikos was a Harvard Business School graduate.  The company focused on providing analytical and laboratory products, and had revenues of over $2 billion in 2004.\nFisher Scientific was founded in 1902 by Chester G. Fisher from Pittsburgh. It focused on providing laboratory equipment, chemicals, supplies and services used in healthcare, scientific research, safety, and education.\nOn May 8, 2006, Thermo Electron and Fisher Scientific announced that they would merge in a tax-free, stock-for-stock exchange; the merged company was named Thermo Fisher Scientific, and had about 30,000 employees, and reported US$9 billion in combined revenue. On November 9, 2006, the companies announced that the merger had been completed. However, the Federal Trade Commission ruled that this acquisition was anti-competitive regarding centrifugal evaporators, requiring Fisher to divest Genevac.  In April 2007, Genevac was sold to Riverlake Partners LLC and the merger closed with FTC approval.\nThe company's products are sold under the brand names of Thermo Scientific, Fisher Scientific, and several other recognized brand names (e.g. Applied Biosystems, Invitrogen, Patheon, PPD, and Nalgene). According to company figures, as of 2007, 46% of its sales were in life sciences, 20% in healthcare, and 34% in industrial/environmental and safety.\n\nAcquisition history\nIn 1990, Thermo Fisher Scientific (then known as Thermo Instrument Systems) acquired mass spectrometer manufacturer Finnigan Instrument Corporation.\nIn 2003, the company (then Fisher Scientific International) acquired Perbio Science, a transaction that included brands such as Pierce Biotechnology, HyClone and Endogen.\nIn April 2006, BioImage was acquired by Thermo Fisher Scientific. The merger was complete in November 2006, and technology transfer to a US site was completed during 2007 and 2008. BioImage was established in 1993 as a drug discovery research unit led by Ole Thastrup within Novo Nordisk, from which it spun out of in 1999. It had specialized in developing and selling proprietary bioassays to biopharmaceutical companies and research institutions. It made broad patents covering Enhanced GFP (EGFP), GFP-based biosensors and any genetically encoded protein fusion to a luminophore, with subsequent monitoring of the protein's translocation within a cell as the primary readout for drug discovery assays.\nIn December 2010, Thermo Fisher Scientific announced its acquisition of Dionex for $2.1 billion.\nIn May 2011, Thermo Fisher Scientific Inc. bought Phadia to expand into the testing of allergies and autoimmune diseases for €2.47 billion ($3.5 billion) in cash.\nIn April 2013, after a competitive bidding with Hoffmann-La Roche, Thermo Fisher acquired Life Technologies Corporation for US$13.6 billion in a deal, adding further service lines related to advanced DNA sequencing and genetic testing. Life Technologies was originally formed in 2008 through a $6.7B merger of Invitrogen, a cell therapy, and Applied Biosystems. The company also acquired GIBCO (Grand Island Biological Company) as part of the Life Technologies acquisition.\nIn February 2015, the company announced it would acquire Advanced Scientifics for $300 million in a cash-deal. ASI designs manufactures, and delivers technologies used in bioprocessing. In June 2015, the company announced its intention to acquire Alfa Aesar, a global manufacturer of research chemicals for $405 million from Johnson Matthey, and the acquisition was completed at the end of September\nIn January 2016, the company announced it would acquire Affymetrix for $1.3 billion. On May 27, 2016, the company announced it would acquire FEI Company for $4.2 billion, a manufacturer of electron microscopes. This acquisition is anticipated to close in early 2017 and will contribute to the growth of Thermo's Analytical Instruments business group. In November the company announced it would acquire MTI-GlobalStem, a previously privately held company that develops reagents for cell transfection, neurobiology and stem cell research.\nIn February 2017, the company acquired Finesse Solutions, Inc., developer of scalable control automation systems and software for bioproduction after receiving early termination of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act. The transaction was completed a day later. In March, the company announced it would acquire Core Informatics, provider of cloud-based platforms supporting scientific data management. In August, the company acquired Patheon, a contract development and manufacturing organization serving the pharmaceutical and biotechnology sectors, for approximately $7.2 billion. As of 2017, the company had revenues of $20.9 billion, and was a Fortune 500 company.\nIn September 2018, Thermo Fisher Scientific announced it had signed a definitive agreement with Becton, Dickinson and Company (BDX) to acquire their Advanced Bioprocessing business.  This BD business had annualized revenue of approximately $100 million; as of October 16, 2018, it had been integrated into Thermo Fisher's Life Sciences Solutions Segment.\nIn March 2019, Thermo Fisher Scientific announced its entry into the gene therapy manufacturing market with a $1.7 billion cash acquisition for Brammer Bio. In May 2019, Thermo Fisher Scientific partnered with MMJ International Holdings to manufacture drug products developed by MMJ for the treatment of multiple sclerosis and Huntington's disease. In June, the business announced it would acquire mass spectrometry software provider, HighChem.\nIn March 2020, Thermo Fisher Scientific received emergency use authorization from the FDA for a test for SARS-CoV-2 to help mitigate the COVID-19 pandemic. Thermo Fisher also partnered with its biopharma customers, including Pfizer and Moderna, to\nsupport the development and production of new mRNA-based COVID-19 vaccines.\nIn March 2020, Thermo Fisher Scientific agreed to purchase Qiagen, a molecular diagnostics company, for $10.1 billion. In July, the offer for Qiagen was raised from €39 to €43 per share (€11.3 billion in total).  On August 13, the company announced that its offer to acquire all of the ordinary share had lapsed, and it terminated the acquisition agreement.\nIn August 2020, Thermo Fisher Scientific opened its new Lenexa facility aimed at boosting the production and manufacturing of COVID-19 testing supplies. In December the business announced it would acquire Phitonex, Inc.\nIn January 2021, Thermo Fisher Scientific announced it had acquired Belgium-based viral vector manufacturer, Henogen SA, from Groupe Novasep SAS for €725 million in cash and point-of-care molecular diagnostics provider Mesa Biotech, Inc. for up to $550 million.\nIn April 2021, Thermo Fisher Scientific announced the acquisition of PPD, Inc., a contract research organization, for a total cash purchase price of $17.4 billion-plus the assumption of approximately $3.5 billion of net debt. PPD generated $4.7 billion in revenue during FY 2020, and this transaction, which values their company at approximately $20.9 billion. In November, the business announced it would acquire PharmaFluidics and its μPAC range of micro-chip-based chromatography products.\nIn January 2022, Thermo Fisher Scientific acquired PeproTech, a developer and manufacturer of recombinant proteins, for $1.85 billion. PeproTech became part of Thermo Fisher’s biosciences business and was integrated into the Life Sciences Solutions Segment.\nIn October 2022, the company agreed to buy British diagnostics firm, The Binding Site Group, in an all-cash deal for US$2.6 billion from Nordic Capital. The acquisition completed in January 2023.\nIn July 2023, the business announced it would acquire CorEvitas, LLC from Audax Private Equity for more than $900 million in cash. In August 2023, it was announced Thermo Fisher had completed the acquisition for $912.5 million (in cash).\nIn October 2023, Thermo Fisher Scientific acquired Olink Holding for $3.1 billion.\nIn February 2025, Thermo Fisher announced the acquisition of Solventum’s purification and filtration business for $4.1 billion.\nIn July 2025, Thermo Fisher added drug manufacturing capabilities in the United States through its purchase of a sterile fill-finish and packaging plant from Sanofi in Ridgefield, New Jersey.\nIn October 2025, Thermo Fisher announced a deal to acquire Clario Holdings—an endpoint data management solutions provider—for $8.88 billion in cash from a shareholder group including Novo Holding. The transaction was expected to close mid-2026.\n\nLeadership\nMarc N. Casper  is chairman, president and chief executive officer of Thermo Fisher Scientific. He first joined Thermo Electron in December 2001 as Vice President of the Life and Laboratory Sciences segment. In November 2006, when Thermo Electron and Fisher Scientific merged to form Thermo Fisher Scientific, Casper was named executive vice president of the company and president of the Analytical Technologies Group. He became president and CEO in 2009.\n\nPartnerships\nIn September 2017, Thermo Fisher Scientific signed an agreement with the Institute of Pathology Heidelberg (IPH) to establish its Center of Molecular Pathology at Heidelberg University Hospital as the newest member of the Next Generation Sequencing Companion Dx Center of Excellence Program (COEP). The initiative focuses on establishing strategic collaborations with leading, European-based organizations that can lead studies using Thermo Fisher's Oncomine portfolio of research panels destined for development as companion diagnostics to help drive precision oncology in the region.\nIn 2021, Thermo Fisher announced the construction of a cell therapy development, manufacturing and collaboration center in cooperation with University of California, San Francisco on the school's Mission Bay campus.\nIn February 2022, Thermo Fisher Scientific announced a 15-year strategic collaboration\nagreement with Moderna, Inc. The collaboration was designed to scale up the\nmanufacturing of Moderna’s COVID-19 vaccine and other investigational mRNA\nproducts.\nIn May 2023, Thermo Fisher partnered with Pfizer, with plans to work together on expanding testing capabilities for lung and breast cancer patients.\nIn November 2023, Thermo Fisher partnered with Flagship Pioneering, a biotechnology company. Together, they plan to create companies in the biotechnology field.\nIn January 2025, Thermo Fisher partnered with the UK Biobank Pharma Proteomics Project (UKB-PPP) to support the world’s largest human proteomics study. Using the Olink Explore platform, UKB-PPP seeks to analyze more than 5,400 proteins from 600,000 samples to fuel the discovery of new protein biomarkers that can be used to predict, diagnose, and treat diseases.\nIn February 2025, Thermo Fisher entered a 10-year virtual power purchase agreement (VPPA) with X-ELIO to secure 118 megawatts of solar energy, moving its European operations closer to a 100% renewable electricity goal.\nIn June 2025, Thermo Fisher partnered with the Regeneron Genetics Center which selected the Olink Explore platform for large-scale proteomics investigation involving nearly 200,000 patient samples aiming to unlock new insights into the dynamic biology and mechanisms of human disease.\n\nControversies\nXinjiang and Tibet\nIn February 2019, Thermo Fisher Scientific announced that it would stop selling its equipment in Xinjiang. In June 2020, Thermo Fisher Scientific was reported to sell its equipment to security services in China for use in what was alleged as part of a genetic surveillance program. A report from the Australian Strategic Policy Institute found that Thermo Fisher Scientific collaborated with the Chinese Ministry of Public Security to develop a Huaxia PCR amplification kit specifically to identify the genotypes of Uyghur, Tibetan and Hui ethnic minorities. In June 2021, The New York Times reported that, despite bans, Thermo Fisher Scientific equipment continued to be sold to police in Xinjiang.\nIn 2022, following reports that Thermo Fisher Scientific had sold products to police in the Tibet Autonomous Region, the Inter-Parliamentary Alliance on China called on governments to \"investigate and suspend commercial activities with companies providing the PRC government with technologies to carry out biometric surveillance in the Uyghur Region, Tibet and elsewhere in the PRC, including the PRC state backed BGI Group and US firm Thermo Fisher.\" Thermo Fisher Scientific subsequently halted sales of DNA collection kits in Tibet.\n\nHeLa cells\nIn October 2021 the estate of Henrietta Lacks sued to get past and future payment for the alleged and widely known unauthorized sale by Thermo Fisher Scientific of her HeLa cells which are essential in many types of research. Over 50 million tons of her cells have been produced and used in over 60,000 scientific studies touching virtually every realm of medicine, including the development of polio vaccines, gene mapping, in-vitro fertilization, and multitudes more.\nIn May 2022, it was announced Thermo Fisher Scientific went to court to seek a dismissal of the lawsuit. In late July 2023, with the motion to dismiss still outstanding, the court ordered the parties to attend a settlement conference. Soon after that, settlement of the suit, with undisclosed terms, was announced.\n\nMexican plant\nIn 2013, Opengate Capital Group LLC filed suit against Thermo Fisher Scientific for selling it a manufacturing plant controlled by the Gulf Cartel. According to Opengate Capital, the company withheld important documents and pressured employees into concealing the presence of the drug cartel.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Thermo Fisher Scientific Inc.:",
  "clean_text": "Thermo Fisher Scientific Inc. is an American life science and clinical research company. It is a global supplier of analytical instruments, clinical development solutions, specialty diagnostics, laboratory, pharmaceutical and biotechnology services. Based in Waltham, Massachusetts, Thermo Fisher was formed through the merger of Thermo Electron and Fisher Scientific in 2006. Thermo Fisher Scientific has acquired other reagent, consumable, instrumentation, and service providers, including Life Technologies Corporation (2013), Alfa Aesar (2015), Affymetrix (2016), FEI Company (2016), BD Advanced Bioprocessing (2018), and PPD (2021). It ranked 104th on the Fortune 500 list based on its 2024 annual revenue of $42.879 billion. Thermo Fisher announced a $2 billion investment over four years in the U.S., including $1.5 billion for expanding manufacturing capacity and $500 million for R&D investment. This initiative aims to bolster domestic biotech manufacturing, create high-paying jobs, and reinforce the U.S. healthcare supply chain. History Predecessors and merger Thermo Electron was co-founded in 1956 by George N. Hatsopoulos and Peter M Nomikos. Hatsopoulos received a PhD from MIT in mechanical engineering and Nomikos was a Harvard Business School graduate. The company focused on providing analytical and laboratory products, and had revenues of over $2 billion in 2004. Fisher Scientific was founded in 1902 by Chester G. Fisher from Pittsburgh. It focused on providing laboratory equipment, chemicals, supplies and services used in healthcare, scientific research, safety, and education. On May 8, 2006, Thermo Electron and Fisher Scientific announced that they would merge in a tax-free, stock-for-stock exchange; the merged company was named Thermo Fisher Scientific, and had about 30,000 employees, and reported US$9 billion in combined revenue. On November 9, 2006, the companies announced that the merger had been completed. However, the Federal Trade Commission ruled that this acquisition was anti-competitive regarding centrifugal evaporators, requiring Fisher to divest Genevac. In April 2007, Genevac was sold to Riverlake Partners LLC and the merger closed with FTC approval. The company's products are sold under the brand names of Thermo Scientific, Fisher Scientific, and several other recognized brand names (e.g. Applied Biosystems, Invitrogen, Patheon, PPD, and Nalgene). According to company figures, as of 2007, 46% of its sales were in life sciences, 20% in healthcare, and 34% in industrial/environmental and safety. Acquisition history In 1990, Thermo Fisher Scientific (then known as Thermo Instrument Systems) acquired mass spectrometer manufacturer Finnigan Instrument Corporation. In 2003, the company (then Fisher Scientific International) acquired Perbio Science, a transaction that included brands such as Pierce Biotechnology, HyClone and Endogen. In April 2006, BioImage was acquired by Thermo Fisher Scientific. The merger was complete in November 2006, and technology transfer to a US site was completed during 2007 and 2008. BioImage was established in 1993 as a drug discovery research unit led by Ole Thastrup within Novo Nordisk, from which it spun out of in 1999. It had specialized in developing and selling proprietary bioassays to biopharmaceutical companies and research institutions. It made broad patents covering Enhanced GFP (EGFP), GFP-based biosensors and any genetically encoded protein fusion to a luminophore, with subsequent monitoring of the protein's translocation within a cell as the primary readout for drug discovery assays. In December 2010, Thermo Fisher Scientific announced its acquisition of Dionex for $2.1 billion. In May 2011, Thermo Fisher Scientific Inc. bought Phadia to expand into the testing of allergies and autoimmune diseases for €2.47 billion ($3.5 billion) in cash. In April 2013, after a competitive bidding with Hoffmann-La Roche, Thermo Fisher acquired Life Technologies Corporation for US$13.6 billion in a deal, adding further service lines related to advanced DNA sequencing and genetic testing. Life Technologies was originally formed in 2008 through a $6.7B merger of Invitrogen, a cell therapy, and Applied Biosystems. The company also acquired GIBCO (Grand Island Biological Company) as part of the Life Technologies acquisition. In February 2015, the company announced it would acquire Advanced Scientifics for $300 million in a cash-deal. ASI designs manufactures, and delivers technologies used in bioprocessing. In June 2015, the company announced its intention to acquire Alfa Aesar, a global manufacturer of research chemicals for $405 million from Johnson Matthey, and the acquisition was completed at the end of September In January 2016, the company announced it would acquire Affymetrix for $1.3 billion. On May 27, 2016, the company announced it would acquire FEI Company for $4.2 billion, a manufacturer of electron microscopes. This acquisition is anticipated to close in early 2017 and will contribute to the growth of Thermo's Analytical Instruments business group. In November the company announced it would acquire MTI-GlobalStem, a previously privately held company that develops reagents for cell transfection, neurobiology and stem cell research. In February 2017, the company acquired Finesse Solutions, Inc., developer of scalable control automation systems and software for bioproduction after receiving early termination of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act. The transaction was completed a day later. In March, the company announced it would acquire Core Informatics, provider of cloud-based platforms supporting scientific data management. In August, the company acquired Patheon, a contract development and manufacturing organization serving the pharmaceutical and biotechnology sectors, for approximately $7.2 billion. As of 2017, the company had revenues of $20.9 billion, and was a Fortune 500 company. In September 2018, Thermo Fisher Scientific announced it had signed a definitive agreement with Becton, Dickinson and Company (BDX) to acquire their Advanced Bioprocessing business. This BD business had annualized revenue of approximately $100 million; as of October 16, 2018, it had been integrated into Thermo Fisher's Life Sciences Solutions Segment. In March 2019, Thermo Fisher Scientific announced its entry into the gene therapy manufacturing market with a $1.7 billion cash acquisition for Brammer Bio. In May 2019, Thermo Fisher Scientific partnered with MMJ International Holdings to manufacture drug products developed by MMJ for the treatment of multiple sclerosis and Huntington's disease. In June, the business announced it would acquire mass spectrometry software provider, HighChem. In March 2020, Thermo Fisher Scientific received emergency use authorization from the FDA for a test for SARS-CoV-2 to help mitigate the COVID-19 pandemic. Thermo Fisher also partnered with its biopharma customers, including Pfizer and Moderna, to support the development and production of new mRNA-based COVID-19 vaccines. In March 2020, Thermo Fisher Scientific agreed to purchase Qiagen, a molecular diagnostics company, for $10.1 billion. In July, the offer for Qiagen was raised from €39 to €43 per share (€11.3 billion in total). On August 13, the company announced that its offer to acquire all of the ordinary share had lapsed, and it terminated the acquisition agreement. In August 2020, Thermo Fisher Scientific opened its new Lenexa facility aimed at boosting the production and manufacturing of COVID-19 testing supplies. In December the business announced it would acquire Phitonex, Inc. In January 2021, Thermo Fisher Scientific announced it had acquired Belgium-based viral vector manufacturer, Henogen SA, from Groupe Novasep SAS for €725 million in cash and point-of-care molecular diagnostics provider Mesa Biotech, Inc. for up to $550 million. In April 2021, Thermo Fisher Scientific announced the acquisition of PPD, Inc., a contract research organization, for a total cash purchase price of $17.4 billion-plus the assumption of approximately $3.5 billion of net debt. PPD generated $4.7 billion in revenue during FY 2020, and this transaction, which values their company at approximately $20.9 billion. In November, the business announced it would acquire PharmaFluidics and its μPAC range of micro-chip-based chromatography products. In January 2022, Thermo Fisher Scientific acquired PeproTech, a developer and manufacturer of recombinant proteins, for $1.85 billion. PeproTech became part of Thermo Fisher’s biosciences business and was integrated into the Life Sciences Solutions Segment. In October 2022, the company agreed to buy British diagnostics firm, The Binding Site Group, in an all-cash deal for US$2.6 billion from Nordic Capital. The acquisition completed in January 2023. In July 2023, the business announced it would acquire CorEvitas, LLC from Audax Private Equity for more than $900 million in cash. In August 2023, it was announced Thermo Fisher had completed the acquisition for $912.5 million (in cash). In October 2023, Thermo Fisher Scientific acquired Olink Holding for $3.1 billion. In February 2025, Thermo Fisher announced the acquisition of Solventum’s purification and filtration business for $4.1 billion. In July 2025, Thermo Fisher added drug manufacturing capabilities in the United States through its purchase of a sterile fill-finish and packaging plant from Sanofi in Ridgefield, New Jersey. In October 2025, Thermo Fisher announced a deal to acquire Clario Holdings—an endpoint data management solutions provider—for $8.88 billion in cash from a shareholder group including Novo Holding. The transaction was expected to close mid-2026. Leadership Marc N. Casper is chairman, president and chief executive officer of Thermo Fisher Scientific. He first joined Thermo Electron in December 2001 as Vice President of the Life and Laboratory Sciences segment. In November 2006, when Thermo Electron and Fisher Scientific merged to form Thermo Fisher Scientific, Casper was named executive vice president of the company and president of the Analytical Technologies Group. He became president and CEO in 2009. Partnerships In September 2017, Thermo Fisher Scientific signed an agreement with the Institute of Pathology Heidelberg (IPH) to establish its Center of Molecular Pathology at Heidelberg University Hospital as the newest member of the Next Generation Sequencing Companion Dx Center of Excellence Program (COEP). The initiative focuses on establishing strategic collaborations with leading, European-based organizations that can lead studies using Thermo Fisher's Oncomine portfolio of research panels destined for development as companion diagnostics to help drive precision oncology in the region. In 2021, Thermo Fisher announced the construction of a cell therapy development, manufacturing and collaboration center in cooperation with University of California, San Francisco on the school's Mission Bay campus. In February 2022, Thermo Fisher Scientific announced a 15-year strategic collaboration agreement with Moderna, Inc. The collaboration was designed to scale up the manufacturing of Moderna’s COVID-19 vaccine and other investigational mRNA products. In May 2023, Thermo Fisher partnered with Pfizer, with plans to work together on expanding testing capabilities for lung and breast cancer patients. In November 2023, Thermo Fisher partnered with Flagship Pioneering, a biotechnology company. Together, they plan to create companies in the biotechnology field. In January 2025, Thermo Fisher partnered with the UK Biobank Pharma Proteomics Project (UKB-PPP) to support the world’s largest human proteomics study. Using the Olink Explore platform, UKB-PPP seeks to analyze more than 5,400 proteins from 600,000 samples to fuel the discovery of new protein biomarkers that can be used to predict, diagnose, and treat diseases. In February 2025, Thermo Fisher entered a 10-year virtual power purchase agreement (VPPA) with X-ELIO to secure 118 megawatts of solar energy, moving its European operations closer to a 100% renewable electricity goal. In June 2025, Thermo Fisher partnered with the Regeneron Genetics Center which selected the Olink Explore platform for large-scale proteomics investigation involving nearly 200,000 patient samples aiming to unlock new insights into the dynamic biology and mechanisms of human disease. Controversies Xinjiang and Tibet In February 2019, Thermo Fisher Scientific announced that it would stop selling its equipment in Xinjiang. In June 2020, Thermo Fisher Scientific was reported to sell its equipment to security services in China for use in what was alleged as part of a genetic surveillance program. A report from the Australian Strategic Policy Institute found that Thermo Fisher Scientific collaborated with the Chinese Ministry of Public Security to develop a Huaxia PCR amplification kit specifically to identify the genotypes of Uyghur, Tibetan and Hui ethnic minorities. In June 2021, The New York Times reported that, despite bans, Thermo Fisher Scientific equipment continued to be sold to police in Xinjiang. In 2022, following reports that Thermo Fisher Scientific had sold products to police in the Tibet Autonomous Region, the Inter-Parliamentary Alliance on China called on governments to \"investigate and suspend commercial activities with companies providing the PRC government with technologies to carry out biometric surveillance in the Uyghur Region, Tibet and elsewhere in the PRC, including the PRC state backed BGI Group and US firm Thermo Fisher.\" Thermo Fisher Scientific subsequently halted sales of DNA collection kits in Tibet. HeLa cells In October 2021 the estate of Henrietta Lacks sued to get past and future payment for the alleged and widely known unauthorized sale by Thermo Fisher Scientific of her HeLa cells which are essential in many types of research. Over 50 million tons of her cells have been produced and used in over 60,000 scientific studies touching virtually every realm of medicine, including the development of polio vaccines, gene mapping, in-vitro fertilization, and multitudes more. In May 2022, it was announced Thermo Fisher Scientific went to court to seek a dismissal of the lawsuit. In late July 2023, with the motion to dismiss still outstanding, the court ordered the parties to attend a settlement conference. Soon after that, settlement of the suit, with undisclosed terms, was announced. Mexican plant In 2013, Opengate Capital Group LLC filed suit against Thermo Fisher Scientific for selling it a manufacturing plant controlled by the Gulf Cartel. According to Opengate Capital, the company withheld important documents and pressured employees into concealing the presence of the drug cartel."
}