{
  "ticker": "TMUS",
  "cik": "0001283699",
  "company_name": "T-Mobile US",
  "corrected_name": "T-Mobile US",
  "wiki_title_used": "T-Mobile US",
  "exists": true,
  "raw_text": "T-Mobile US, Inc. is an American wireless network operator headquartered in Bellevue, Washington. Its majority shareholder and namesake is the German telecommunications company Deutsche Telekom. T-Mobile is the second largest wireless carrier in the United States, with 140 million subscribers as of September 30, 2025.\nThe company was founded in 1994 by John W. Stanton of the Western Wireless Corporation as VoiceStream Wireless. Deutsche Telekom then gained plurality ownership in 2001 and renamed it after its global T-Mobile brand. As of April 2023, the German company holds a 51.4% stake in the company.\nT-Mobile US operates two main brands: T-Mobile and Metro by T-Mobile (acquired in a 2013 reverse takeover of MetroPCS that also led to T-Mobile's listing on the NASDAQ). In 2020, T-Mobile expanded through the acquisition of Sprint, which also made T-Mobile the operator of Assurance Wireless, a service subsidized by the federal Lifeline program. The company's growth continued in 2024 with the acquisitions of Mint Mobile and Ultra Mobile, two low-cost mobile virtual network operators which remain separate brands. In August 2025, the company acquired the wireless operations of UScellular.\n\nHistory\nT-Mobile U.S. traces its roots to the 1994 establishment of VoiceStream Wireless PCS as a subsidiary of Western Wireless Corporation. After its spin off from parent Western Wireless on May 3, 1999, VoiceStream Wireless was purchased by Deutsche Telekom AG in 2001 for $35 billion and renamed T-Mobile USA, Inc., in July 2002. In 2013, T-Mobile and MetroPCS finalized a merger of the two companies which started trading as T-Mobile U.S.\n\nVoiceStream Wireless\nVoiceStream Wireless PCS was established in 1994 as a subsidiary of Western Wireless Corporation to provide wireless personal communications services (PCS) in 19 FCC-defined metropolitan service areas in several western and southwestern states using the GSM digital wireless standard. VoiceStream Wireless' digital, urban service areas complemented the analog, rural service areas marketed by Western Wireless under the Cellular One brand.\nWestern Wireless spun off its VoiceStream Wireless division into a new company called VoiceStream Wireless Corporation in May 1999.\n\nOmnipoint and Aerial acquisition\nIn 2000, VoiceStream Wireless acquired two regional GSM carriers. Omnipoint Corporation, a regional network operator in the Northeastern United States, was acquired on February 25, 2000. Aerial Communications Inc.; a regional network operator in the Columbus, Houston, Kansas City, Minneapolis-St. Paul, Pittsburgh, and Tampa-St. Petersburg-Orlando markets; was acquired on May 4, 2000. The combined company retired the Omnipoint and Aerial brands and completed integrating the three companies by converting to a single customer billing platform, implementing standard business practices and launching the VoiceStream brand and \"GET MORE\" marketing strategy in all markets.\n\nDeutsche Telekom acquires VoiceStream and Powertel\nOn June 1, 2001, Deutsche Telekom (DT) completed its acquisition of VoiceStream Wireless, Inc., for $35 billion and Southern U.S. regional GSM network operator Powertel, Inc., for $24 billion. By the end of 2001, VoiceStream Wireless had 19,000 employees serving 7 million subscribers.\n\nOn September 2, 2001, VoiceStream Wireless Inc. adopted the name, T-Mobile USA, Inc. and began rolling out the T-Mobile brand, starting with locations in California and Nevada. T-Mobile USA, Inc. was an operating entity of T-Mobile International AG, before becoming a direct subsidiary of Deutsche Telekom AG. The merger became official in July 2002.\n\nSunCom acquisition\nOn September 17, 2007, the company announced the acquisition of regional GSM carrier SunCom Wireless Holdings, Inc. for $2.4 billion; the acquisition closed on February 22, 2008. By September 8, 2008, SunCom's operations were integrated with those of the company. The acquisition added SunCom's 1.1 million customers to the company's customer base and expanded the company's network coverage to include southern Virginia, North Carolina, South Carolina, eastern Tennessee, northeastern Georgia, Puerto Rico and the U.S. Virgin Islands. Following the Suncom acquisition, T-Mobile possessed native network presence in all the major metro areas in the United States.\n\nAborted acquisition by AT&T\nOn March 20, 2011, AT&T announced its intention to purchase T-Mobile US from Deutsche Telekom. The Antitrust Division of the United States Department of Justice responded by filing a federal lawsuit on August 31, 2011, to block the merger. AT&T then decided to formally abandon the merger bid on December 19, 2011.\n\nMerger with MetroPCS Communications\nOn October 3, 2012, MetroPCS Communications agreed to merge with T-Mobile USA. MetroPCS shareholders would hold a 26% stake in the company formed after the merger, which retained the T-Mobile brand. While the new company was still the fourth-largest carrier in the United States (at the time), the acquisition gave T-Mobile access to more spectrum and financial resources to maintain competitiveness and expand its LTE network. The merger between T-Mobile USA Inc. and MetroPCS was officially approved by MetroPCS shareholders on April 24, 2013. The deal was structured as a reverse takeover; the combined company went public on the New York Stock Exchange as TMUS and became T-Mobile U.S. Inc. on May 1, 2013. The merger agreement gave Deutsche Telekom the option to sell its 72% stake in the company formed by the merger and valued at around $14.2 billion to a third party before the end of the 18-month lock-up period.\n\nThe \"Un-carrier\", additional wireless spectrum acquisition\nIn March 2013, T-Mobile introduced a major overhaul of its plan structure, marketed by branding themselves as being \"the Un-carrier\". A new contract-free pricing structure with simpler plans was introduced in which a phone's cost is paid over a two-year financing plan. The \"Un-carrier\" strategy has since been expanded to encompass other value-added services, such as a plan add-on allowing phone trade-ins for early upgrades twice per year, carrying over unused data allotments for up to a year, and zero-rating of selected music and video services (the latter locked to \"DVD quality\") over the mobile network, These moves came as part of an effort under new CEO John Legere to help revitalize the business as it improves its network quality.\nThough this system is said to improve network quality, issues surrounding net neutrality infringement have also come to light. The type of zero-rating that is offered by T-Mobile allows it to charge higher rates to third-parties, meaning that ISP can prioritize the company that pays a higher premium. This makes it more difficult for smaller third-parties who are unable to pay the high premium charged by the ISP.\nOn June 28, 2013, T-Mobile agreed to buy wireless spectrum for the Mississippi Valley region from its competitor U.S. Cellular for around $308 million, allowing it to expand its 4G network across 29 more markets.\nOn January 6, 2014, T-Mobile signed agreements with Verizon Wireless to purchase some 700 MHz A-Block spectrum licenses for $2.365 billion. Moreover, a transfer of some AWS and PCS spectrum licenses with a value of $950 million has been agreed upon by T-Mobile and Verizon. The acquisition reportedly gave T-Mobile additional coverage for approximately 158 million people in 9 of the top 10 and 21 of the top 30 U.S. markets.\n\nMerger with Sprint Corporation\nOn April 29, 2018, T-Mobile US and Sprint Corporation announced their intention to merge. Although the U.S. Justice Department initially approved the merger on July 26, 2019, the attorneys general from several states filed a lawsuit in the U.S. District Court for the Southern District of New York to block it, alleging that the merger would result in higher prices for consumers in the range of $4.5 billion annually. District Judge Victor Marrero then announced his decision in favor of the merger on February 11, 2020, stating that it \"is not likely to substantially lessen competition like the suing [states] had claimed it would\" and that Sprint \"does not have a sustainable long-term competitive strategy\" to remain a viable competitor.\nThe merger finally closed on April 1, 2020, and the Sprint brand was officially discontinued on August 2, 2020. Leadership, background and stock changes happened immediately, with customer-side changes happening over time. Billing was already showing the T-Mobile brand, and all retail, customer service, and all other company branding switched to the T-Mobile brand. T-Mobile and Sprint accounts were still managed by employees in separate systems and the company still offered Sprint branded SIM cards. New rate plans were also introduced as well for all new and existing customers from both companies, though all were grandfathered into their current plan should they choose not to switch to a new T-Mobile plan for at least three years.\nAs part of the Sprint merger, T-Mobile US acquired Assurance Wireless, the service subsidized by the Lifeline Assistance program of the federal Universal Service Fund.\n\nAcquisition of Mint Mobile and Ultra Mobile\nIn March 2023, T-Mobile US agreed to acquire Ka’ena Corporation as well as subsidiaries and brands: Mint Mobile, a successful budget direct-to-consumer prepaid wireless brand in the US, and Ultra Mobile, a wireless service that offers international calling options to communities across the country, for up to $1.35 billion. It was noted that Ryan Reynolds who owns a majority stake in Mint Mobile would stay on as Mint's official spokesman. The deal was expected to close later that year, and the final price would be based on Ka’ena's performance.\n\nAcquisition of U.S. Cellular assets\nOn May 28, 2024, T-Mobile US announced it would acquire the wireless operations of U.S. Cellular. Valued at $4.4 billion, the deal includes U.S. Cellular's customer base of 4 million users, approximately 30% of spectrum assets, and the rights to more than 2,000 towers. On July 11, 2025, the Federal Communications Commission approved the acquisition. The deal closed on August 1, 2025.\n\nWireless networks\nT-Mobile's network provides coverage in the continental United States, Hawaii, Puerto Rico, and the U.S. Virgin Islands.\n\nCellular network\n2G GSM\nVoiceStream Wireless (T-Mobile's predecessor) first started building out its cellular network in 1994. This initial 2G network utilized the GSM standard was first turned on in Honolulu and Salt Lake City by 1996. Through strategic acquisitions and spectrum purchases, the network steadily expanded its geographic reach and technological capabilities.\nData transmission was later added the network by implementing General Packet Radio Service (GPRS). This was later augmented with the Enhanced Data Rates for GSM Evolution (EDGE) technology, significantly accelerating data transmission speeds. EDGE coverage was available within at least forty percent of the GSM footprint.\nT-Mobile began notifying customers in January 2025 of the impending shutdown of the GSM network on February 9, 2025. And Today is barely hanging on in rural areas.\n\n3G UMTS\nIn September 2006, T-Mobile made a significant strategic investment in its network infrastructure by participating in a Federal Communications Commission (FCC) auction, securing licenses in the 1700 MHz and 2100 MHz Advanced Wireless Services (AWS) bands for US$4.18 billion (equivalent to $6.52 billion in 2024). This spectrum acquisition provided the foundation for the nationwide deployment of a 3G network utilizing the UMTS standard.\nThe initial rollout targeted major markets and offered projected speeds of 7.2 Mbit/s, exceeding competitor offerings at the time. This ambitious initiative required an additional investment of $2.6 billion (equivalent to $4.1 billion in 2024) beyond the spectrum acquisition cost.\nThe initial network activation was delayed due to unforeseen circumstances related to government agencies vacating the allocated spectrum. Despite launching the first 3G phone in November 2007, the network itself wasn't operational until May 2008 in New York City. By 2009, T-Mobile had expanded its 3G network to cover over 200 markets. The company further enhanced its network capabilities by upgrading to HSPA+ in 2010.\nIn 2015, to optimize network bandwidth for the deployment of 4G LTE services, T-Mobile initiated a process of migrating 3G services to its PCS band. This strategic shift ultimately rendered some 3G devices incompatible with the network. T-Mobile decommissioned its UMTS network in July 2022.\n\n4G LTE\nOn February 23, 2012, during the Q4 Earnings Call, T-Mobile laid out the future of their 4G upgrade path. They would roll out the LTE network on the AWS spectrum, and transition their HSPA+ network to the PCS band. To achieve compatibility with other networks and phones in the US, T-Mobile began this transition in March 2013, and the rollout of LTE is currently underway as T-Mobile expands to more markets. Due to the failed acquisition of T-Mobile USA by AT&T, T-Mobile USA received additional UMTS frequency band 4 (AWS) spectrum. On March 26, 2013, T-Mobile began rolling out LTE in 7 markets: Baltimore, San Jose, Washington, D.C., Phoenix, Las Vegas, Kansas City, and Houston.\nOn August 21, 2012, the FCC approved a deal between T-Mobile and Verizon in which T-Mobile gained additional AWS spectrum licenses in 125 Cellular Market Areas.\nOn February 25, 2014, T-Mobile announced in its Q4 2013 earnings call that its 4G LTE network covered 209 million people in 273 metro areas. They also planned to start rolling out their 700 MHz A-Block spectrum by the end of 2014, which by the end of the rollout would cover 158 million people. This spectrum led to improved LTE coverage overall in these areas, particularly indoors.\nOn March 13, 2014, T-Mobile announced a new plan to upgrade its entire 2G/EDGE network to 4G LTE. They expected 50% to be done by the end of 2014, and it to be \"substantially complete\" by the middle of 2015.\nOn December 16, 2014, T-Mobile announced during CEO John Legere's Un-carrier 8.0 interview that their 4G LTE network covered 260 million people and their 700 MHz Band 12 LTE had been rolled out in Cleveland, Colorado Springs, Minneapolis, and Washington, D.C. They expected to cover 280 million with LTE by mid-2015 and 300 million by the end of 2015. They also stated that they covered 121 metro areas with their Wideband LTE.\nOn October 27, 2015, T-Mobile announced in its Q3 2015 earnings call that they covered over 300 million people with LTE, reaching their 2015 end of year goal months ahead of schedule. They had 245 markets with Wideband (at least 15+15 MHz) LTE. They also had 204 markets with Extended Range 700 MHz Band 12 LTE covering around 175 million people. Their coverage map revealed that they now had new native LTE coverage in Montana, the Dakotas, Eastern West Virginia, and Northern Michigan.\nOn May 25, 2016, T-Mobile announced that it will be purchasing the 700Mhz A-block license (LTE band 12) for the Chicago metro area. When this transaction closes, together with several other pending 700Mhz license acquisitions, T-Mobile expects to possess 700Mhz licenses covering a total of 272 million people, or 84% of the US population – including 10 of the top 10 largest US metro areas. T-Mobile refers to its 700Mhz low-band network as 'Extended-range LTE' and claims it penetrates buildings and reaches out farther than its PCS and AWS only network. In September 2016, T-Mobile launched 4x4 MIMO and 3 channel carrier aggregation allowing theoretical speeds of 400 Mbit/s, and also announced that the company's LTE network reaches over 312 million potential subscribers.\nIn early 2017, T-Mobile purchased 45% of available 600 MHz spectrum in the US, covering 100% geographically of the US. They started the rollout of LTE on this band on August 15, 2017.\nIn 2018 T-Mobile has stated they will not discontinue rollout and upgrades of LTE in favor of 5G. Instead, they will continue to grow and support their LTE network to work simultaneously with 5G.\nAs of January 22, 2019, the LTE-Advanced upgrade has been deployed in 6,000 cities and towns.\nAs of October 28, 2019, LTE now covers 326 million people.\nAs of February 6, 2020, the 600 MHz network reaches 8,900 cities and towns, covering 248 million people.\n\n5G NR\nPreparations\nOn June 25, 2018, T-Mobile and Nokia completed their first bi-directional 5G NR transmission in the 28 GHz frequency compliant with 3GPP 5G standards, showing a big step forward to building a nationwide 5G Network.\nOn November 20, 2018, T-Mobile and Nokia completed their first downlink 5G NR transmission in the 600 MHz frequency compliant with 3GPP 5G standards in Spokane, Washington. 28 GHz only reaches roughly 1 square mile (2.6 km2), whereas 600 MHz can reach hundreds of square miles. This marks one step closer to a rural 5G network, one highly sought improvement with 5G technology (high-speed data in rural areas).\nOn January 7, 2019, T-Mobile and Ericsson completed the first audio and video call using a live 5G NR network using 3 separate frequency bands; 600 MHz, 28 GHz, and 39 GHz. This was also the first live network test with successful uplink and downlink.\nOn July 11, 2019, T-Mobile and Ericsson completed their first n71 (600 MHz) data session in their lab in Bellevue, Washington on a commercial 5G modem, the Snapdragon X55, which is the first commercial 5G modem to feature the n71 band. However, the modem was pre-market and not in any commercially available device.\n\nVendors\nOn July 30, 2018, T-Mobile and Nokia announced a $3.5 billion contract for equipment and software to build out a nationwide 5G network that will be compliant with 3GPP 5G standards. The network will use the 600 MHz and 28 GHz frequency bands.\nOn September 11, 2018, T-Mobile and Ericsson announced a $3.5 Billion contract for equipment to build out a nationwide 5G network that will be compliant with 3GPP 5G standards. The network will use the 600 MHz and 28 GHz frequency bands. This marked $7 billion invested in T-Mobile's 5G network, which will use both companies equipment.\n\nLaunches\nOn February 26, 2018, T-Mobile announced it would roll out 5G to 30 cities by the end of 2018, with compatible handsets delivering early 2019. They also stated their 5G network will be able to work simultaneously with their 4G LTE network, delivering faster speeds and broader range.\nOn June 28, 2019, T-Mobile officially launched their 5G mmWave network with the launch of their first commercially available 5G NR device, the Galaxy S10 5G. The network has launched in 6 cities; Los Angeles, NYC, Atlanta, Dallas, Las Vegas, and Cleveland.\nOn August 4, 2020, T-Mobile launched standalone (SA) mode across their national 5G network, becoming the first operator in the world to do so. They also stated SA mode improved 5G coverage because a connection to a mid-band LTE cell was no longer required as it was in non-standalone mode (NSA).\n\nExtended-Range 5G\nOn November 7, 2019, T-Mobile announced that its 600 MHz 5G network will launch on December 6, 2019. The network will launch alongside the first two 600 MHz 5G-capable devices, the Samsung Galaxy Note 10+ 5G and the OnePlus 7T Pro 5G McLaren Edition.\nOn December 2, 2019, T-Mobile officially launched its 600 MHz 5G network. It launched with an initial coverage of 200 million people and over 5,000 cities or towns.\nAs of February 15, 2023, T-Mobile's 600 MHz network covers an estimated 323 million pops.\n\nUltra Capacity 5G\nOn April 21, 2020, T-Mobile launched the T-Mobile branded 2.5 GHz as Ultra-Capacity 5G with the spectrum it acquired in the Sprint merger in Philadelphia. In October 2023, the company announced that their Ultra-Capacity 5G (including PCS, 2.5 GHz and 24/28/39 GHz) currently covers over 300 million pops, by providing an average speed of 400 MB/s, two months ahead of schedule by the year-end.\nT-Mobile also stated that the same network will go live in New York, NY, the first city with all 3 parts of T-Mobile's \"layer cake\" strategy to 5G NR of having 3 separate bands on low, mid and high band frequencies.\nT-Mobile has also acquired C-Band 3.7 GHz licenses in early 2021 for an average of 40 MHz of spectrum covering 225 million people nationwide, bidding over $9.3 billion in licenses. This spectrum is currently pending and is going be in use by the end of 2023, adding an additional layer of \"Ultra-Capacity 5G\" with deployment starting in early 2023.\nOn January 31, 2022, T-Mobile announced that they have bid on C-Band 3.45 GHz licenses for approximately $3 billion from Auction 110 auctioned off by Federal Communications Commission for an average of 21 MHz of spectrum to bring up to 184 million people covered across the United States, placing second behind AT&T. T-Mobile intends to deploy this spectrum alongside its C-Band holdings in 2023.\nOn September 30, 2024, T-Mobile divested its 3.45 GHz upper mid-band spectrum holdings. Seven percent of the portfolio valued at $159 million was swapped for 2.5 GHz licenses with SoniqWave in May with the remaining 93 percent sold to Columbia Capital for over $2.7 billion.\n\nRoaming\nT-Mobile has roaming arrangements with a number of national and regional mobile network operators, including AT&T Mobility.\nAs of 2008, prepaid customers have almost all of the postpaid domestic roaming privileges and restricted international roaming to Canada and Mexico.\nIn 2009, T-Mobile USA began removing AT&T Mobility roaming coverage in many locations across the country, and updated its on-line coverage maps to reflect the smaller coverage area. AT&T Mobility roaming remains available in select locations, primarily on smaller carriers that were acquired by AT&T Mobility after long-term roaming contracts were in place between T-Mobile and the smaller carriers, including Centennial Wireless and Edge Wireless.\nOn June 29, 2010, the company launched voice service in the Gulf of Mexico on GSM via roaming agreement through Broadpoint. T-Mobile USA was scheduled to launch data service in Fall 2010. Also in 2010, T-Mobile US became a member of the FreeMove alliance.\nOn October 9, 2013, T-Mobile announced Simple Global, a service included with eligible Simple Choice plans. This service allows one to roam in over 100 countries with unlimited text and speed-limited data, and make calls at $0.20/minute. High-speed data passes will be available for purchase. On March 7, 2014, T-Mobile announced this number will be increasing to 122 countries. If one is connected to WiFi in one of these countries, and their phone supports WiFi calling, all calls and texts to and from the US are free, and work the same as if they were on the cellular network.\nOn July 15, 2015, T-Mobile launched Mobile Without Borders, a service included with all new T-Mobile plans and available as an add-on to grandfathered or promotional plans for $10. This service allows the user to use their normal voice, text message, and data allotments while roaming in Mexico and Canada. Most T-Mobile services are available while roaming, with the notable exception of using the data in one's Data Stash.\nIn August 2015, T-Mobile joined the Competitive Carriers Association's Data Services Hub, enabling the company to expand roaming partnerships with over a dozen rural and regional carriers. Smaller carriers will now be able to access T-Mobile's LTE network for roaming and T-Mobile will be able to expand roaming partnerships and extend its footprint with members whose network technologies had previously been incompatible.\nIn October 2017, T-Mobile announced that starting November 12, 2017, LTE-speeds will be limited at 5 GB (with speeds going at speeds at 128 kbit/s or 256 kbit/s on some plans) while data roaming in Canada and Mexico still remains unlimited. However, calling and texting in these countries still remain free from roaming charges. T-Mobile also announced a partnership with US Cellular in California, Iowa, Washington, and Wisconsin to expand 4G LTE coverage. Compatible device required.\nIn August 2022, T-Mobile and SpaceX announced a partnership called Coverage Above and Beyond where the latter's satellites would provide connections for cellphones throughout the US, even in remote areas with no existing service. The goal was to allow customers to have service everywhere, with no dead zones. Starlink satellites would function like cell towers. At the time of announcement, the plan was to start with text messages and messaging apps and using existing hardware as opposed to new phones.\n\nRadio frequency spectrum chart\nT-Mobile network\nThe following chart describes radio frequency spectrum bands accessible by the company's customers.\n\nPast networks\nThe following chart lists the networks that T-Mobile previously operated.\n\nSprint network\nSprint's network was decommissioned and integrated into T-Mobile's network. The CDMA network was completely shut down on May 31, 2022 and the LTE network was discontinued on June 30, 2022. Sprint used bands 25, 26 and 41 to provide LTE coverage and used band n41 for NR coverage.\n\nT-Mobile HotSpots\nT-Mobile has used the term \"Hotspot\" to represent various products and technologies.\n\nWi-Fi network (public)\nThe company operates a nationwide Wi-Fi Internet access network under the T-Mobile HotSpots brand. The T-Mobile HotSpots network consists of thousands of Wi-Fi access points installed in businesses, hotels, and airports throughout the U.S.\nThe T-Mobile HotSpot service offers access to a nationwide network of approximately 8,350 access points, installed in venues such as Starbucks coffeehouses, FedEx Office Office and Print Centers, Hyatt hotels and resorts, Red Roof Inns, Sofitel hotels, Novotel hotels, the airline clubs of American Airlines, Delta Air Lines and United Airlines, as well as airports.\nThe T-Mobile HotSpots network can be traced to the company's 2002 purchase of bankrupt wireless ISP MobileStar, which began building its network in 1998. After completing the purchase, the company expanded the network into 400 Borders bookstores, as well as 100 of the most-frequented airport clubs and lounges operated by American Airlines, Delta Air Lines, and United Airlines.\nOn September 14, 2014, T-Mobile partnered up with GoGo to provide free texting on airplanes for its customers. GoGo services are provided on Delta Air Lines, American Airlines, United Airlines and Alaska Airlines.\nOn June 6, 2016, T-Mobile expanded its partnership with GoGo to offer T-Mobile users one hour of free WiFi on customers phones while T-Mobile One Plus and One Plus International users also get free WiFi throughout the entire flight. T-Mobile also included other messaging apps (iMessage, Google Hangouts, WhatsApp and Viber) in addition to SMS texting being provided since September 2014.\n\nWi-Fi network (private)\nT-Mobile has also used the term to describe Wi-Fi Access Points that it sold to end users to expand their cell phone network to phones equipped to also receive Wi-Fi using a VOIP-like technology. (The models included at least two by Linksys: the WRTU54G-TM and the WRT54G-TM and one by D-Link: the TM-G5240.)\n\nFinances\nFor the fiscal year 2023, T-Mobile US reported earnings of US$8.317 billion, with an annual revenue of US$78.558 billion, a decrease of 1.3% over the previous fiscal cycle. T-Mobile's shares traded at over $160 per share and its market capitalization was valued at over US$195 billion in February 2024.\n\n* Merger with Sprint in 2020\n\nLocations\nT-Mobile US's headquarters are located in the Factoria neighborhood of Bellevue, Washington, a suburb east of Seattle on Interstate 90. The headquarters includes ten buildings in Factoria and other areas of the Eastside region that employed 8,000 workers in 2020. The company launched a shuttle bus service, named the Magenta Express, in 2017 to serve the buildings and other commute trips.\n\nProducts and services\nMobile phone and data\nCurrent plans\nIn April 2023, the company announced its new Go5G and Go5G Plus plans. The Go5G Plus plan brought new features to T-Mobile's premier voice plan offering. Namely, it guaranteed subscribers 24 month device financing terms, and access to the best available device promotions on new purchases. These perks were available to new and existing customers alike, as long as they stayed on the plan. A single voice line on Go5G Plus cost $90 per month and included the same features Magenta MAX offered, like Netflix and Apple TV+, as well as an extra 10 GB of premium mobile hotspot data for a total of 50 GB per month, and 15 GB of high-speed data in Canada and Mexico.\nDiscounted versions of the new plans were announced for small businesses, customers 55-years-old and up, first responders, and military families.\nThe T-Mobile Essentials plan provides customers unlimited talk, text, and data service at a lower price than a standard Magenta or Magenta Plus plan. However, unlike most other plans, the Essentials plan does not include taxes and fees. It also allows T-Mobile to prioritize other customers over Essentials customers' data usage on the network at any time during network congestion or peak times. Additionally, the company unveiled a \"limited time\" plan called Essentials Saver that lowered the price to $50 from $60.\nOn June 2, 2019, T-Mobile announced the launch of the Magenta plan, replacing the T-Mobile ONE plans. The Magenta family of plans build on the existing features of the T-Mobile ONE and ONE Plus plans, but now include additional features like 3 GB of mobile hotspot data for standard Magenta plans, and retaining the same enhanced HD streaming, 20 GB of mobile hotspot data, and other features of the T-Mobile ONE Plus plans. On January 22, 2021, it was announced that T-Mobile unveiled its newest 5G smartphone plan with no throttling, called Magenta MAX. Customers get unlimited Premium Data (4G and 5G), unlimited 4K UHD video streaming, complimentary video streaming services, mobile high-speed hotspot data at 40 GB, unlimited talk, text, and data in Mexico and Canada with up to 5 GB of high-speed data, T-Mobile Tuesdays free thank you gifts and discounts, unlimited Gogo in-flight texting and Wi-Fi all flight long, free texting and data in 210 countries and destinations, and free Scam Shield Premium protection, including free Scam Block and Caller ID. Magenta MAX cost the same as the Magenta Plus plan at $57 per line per month for three lines with autopay with taxes and fees included.\nBoth Go5G plans and the Essential Saver plan were announced on April 20, or 4/20, a reference to pot consumption. The Verge noted T-Mobile's aim to \"smoke the competition\" had \"some real 'How do you do, fellow kids?' energy\", in reference to actor Steve Buscemi appearing out of touch on the sitcom 30 Rock.\n\nSenior, military and first responder plans\nAlongside the T-Mobile Magenta family of plans are the specialized plans offered to Military personnel, First Responders, and seniors age 55 and up.\nMilitary and First Responder plans allow for qualified service members to receive 50% off of standard pricing Magenta and Magenta Plus plans. Customers must verify their affiliation within 45 days of activation or switching to the plan in order to retain the discounted offer.\nThe Unlimited 55+ allows customers at or over the age of 55 to receive a set discounted price on standard rate plans, however these accounts are limited to only 2 lines per account. Certain customers were permitted to add a third line to their account during a specific promotional period.\n\nComplementary video streaming\nOn September 12, 2017, T-Mobile introduced the Netflix On Us program. Initially, this was limited to T-Mobile ONE family plans, and the Standard ad-free Netflix plan was included, valued at $11/month after an October 2017 price increase. Over time, the benefit was expanded to several other individual and family plans. On January 15, 2021, the benefit was changed to the Netflix Basic plan for Magenta subscribers, and the Netflix Standard plan for Magenta Plus and ONE Plus subscribers. As of January 24, 2024, all T-Mobile subscribers with the Netflix On Us benefit receive the ad-supported Standard plan from Netflix, regardless of their T-Mobile plan. This plan is missing several titles compared to ad-free plans, and a few devices with older Netflix software are unsupported. Customers can pay an additional fee for a plan without advertisements.\n\nDiscontinued plans\nIn March 2013, T-Mobile introduced a new streamlined plan, Simple Choice, for new customers. This is part of an initiative called Un-carrier which drops contracts, subsidized phones, overage fees for data, and early termination fees. In August 2016, T-Mobile introduced T-Mobile ONE as a replacement for Simple Choice. The plan has been criticized by the Electronic Frontier Foundation and others for potentially violating net neutrality rules and making previously included features paid extras. In August 2018, T-Mobile introduced the ONE Plus family plan, which allows HD streaming and adds 20 GB of mobile hotspot at 4G LTE speeds, and Name ID. As of June 2, 2019, the T-Mobile ONE and ONE Plus plans have been retired, and replaced by the new Magenta plans.\nOn June 2, 2019, T-Mobile announced the launch of Magenta Plus. T-Mobile has since discontinued this plan, but it has upgraded the Magenta plan with 100 GB of premium data, while the high-speed hotspot data was increased to 5 GB.\n\nCapping unlimited data users\nOn August 31, 2015, T-Mobile announced it will ask users who abuse its unlimited on-smartphone data plan by violating T-Mobile's Terms & Conditions regarding tethering (which like unlimited on-smartphone data, remains unlimited, but offers a 14 GB high-speed allotment before throttling takes effect), by permanently removing user access to unlimited plans and migrating users to a tiered data plan. By doing so, all plans after a select amount of inclusive high-speed data, result in automatic throttled speeds, preventing unlimited high-speed tethering use and abuse of the network. T-Mobile stated that there are a small handful of users who abuse the tethering plan by altering device software and/or the use of an Android app that masks T-Mobile's ability monitoring whether data is on-smartphone, or through smartphone mobile hotspot (tethering) by mimicking all data as on-smartphone use, with some customers abusing the service by using as much as 2 TB per month, causing speed issues for all other customers.\n\nInReach program\nThe InReach program provides a free cell phone and a limited number of voice minutes each month for low-income-eligible families (one per family) who do not use Lifeline services offered by any other phone or wireless company. It is funded through the Universal Service Fund, but is only operational in a limited number of states and Puerto Rico.\n\nPrepaid mobile phone and data\nUltra Mobile\nUltra Mobile is a prepaid MVNO that offers limited and unlimited plans that include international calling and texting to select countries. Ultra Mobile was acquired alongside Mint Mobile by T-Mobile US on May 1, 2024.\n\nMint Mobile\nMint Mobile is an MVNO that offers plans charged in increments of 3, 6, or 12 months, offering discounts for longer subscriptions. Mint Mobile was officially acquired by T-Mobile US on May 1, 2024.\n\nTello Mobile\nFounded in 2016, Tello Mobile now uses the T-Mobile network to provide MVNO talk, text, and data to its customers. Tello originally used the Sprint network, but transitioned to the T-Mobile network after the T-Mobile and Sprint merger.\n\nMetro by T-Mobile\nThe former MetroPCS was taken over by T-Mobile in 2013, the new company formed T-Mobile US and currently continues to offer prepaid wireless services under the Metro by T-Mobile brand.\n\nAssurance Wireless\nThe T-Mobile network has carried Assurance Wireless since the 2020 Sprint merger. The service is subsidized by the federal Lifeline Assistance program, a government benefit program supported by the federal Universal Service Fund. Low-income people who qualify for the services are provided a free phone, free monthly data and minutes, and unlimited texting.\n\nFormer prepaid services\nGoSmart Mobile\nGoSmart Mobile was a T-Mobile branded service that launched in beta on December 7, 2012, and became officially available nationwide on February 19, 2013. GoSmart offered no-contract SIM wireless services. GoSmart Mobile was sold to consumers through dealers who worked as independent contractors under their own company name. Such sellers are known as \"Authorized Dealers\" with either physical or online stores. In September 2016, T-Mobile sold the brand and 326,000 GoSmart Mobile customers to TracFone Wireless. The customers were reclassified as wholesale subscribers.\n\nTelevision and streaming\nTVision\nOn December 13, 2017, T-Mobile US announced its intent to acquire the IPTV provider Layer3 TV, which operates in Chicago and Washington, as the basis of its own subscription television service initially planned to launch in 2018. On April 10, 2019, T-Mobile officially announced the re-branding and re-launch of Layer3 TV as TVision Home The service mirrors the hardware, packaging, and pricing models of other linear television providers.\nOn October 27, 2020, T-Mobile US introduced over-the-top streaming services under the TVision branding. It consisted of several packages, including TVision Vibe (a lower-cost bundle focused on entertainment channels), TVision Live (network television, basic cable and sports networks, as well as cloud DVR), and TVision Channels (with standalone subscriptions for pay television services). TVision Home ceased operations on December 30, 2020.\nOn March 29, 2021, T-Mobile announced that TVision would be discontinued on April 29, 2021. The provider will instead offer promotional bundles with the third-party providers Philo and YouTube TV.\n\nFinancial services\nBanking cards\nOn January 22, 2014, T-Mobile announced that it would expand its products into banking. T-Mobile would provide Visa card with banking features and a smartphone money management application with reduced-fee or zero-cost services for T-Mobile wireless customers. In addition, customers would have access to over 42,000 ATMs with no fees. In early 2016, T-Mobile decided to discontinue the banking cards. They can no longer be purchased at T-Mobile.\n\nOnline banking\nIn early 2019, T-Mobile released an online banking option called \"T-Mobile Money\".\n\nCustomer service\nTeam of Experts\nIn 2018, T-Mobile officially announced its new customer care concept called Team of Experts. The premise being customers never being transferred to another department. All representatives are trained in billing, payment arrangements, and cancellations when in the past each had their own separate department. In addition to being cross-trained, the Team of Experts, which consists of usually between 30 and 35 account reps, 4 to 6 technical support representatives, 4 supervisors overseeing the representatives, and one manager, are assigned specific markets, usually within the region the call center is in.\n\nAwards\nFrom as early as 2004, the company has captured multiple J. D. Power annual awards in the areas of retail sales satisfaction, wireless customer care, and overall customer satisfaction. In 2011, J. D. Power and Associates stated that T-Mobile retail stores achieved the highest ratings among major wireless carriers for customer satisfaction for the fourth consecutive year, performing particularly well in price and promotions. Also in 2011, J. D. Power and Associates ranked T-Mobile USA highest among major providers in wireless customer care for the second consecutive year.\nOn December 3, 2015, Consumer Reports named T-Mobile the number one American wireless service provider. The results combine data from customer service, voice quality, text messaging services, and data speeds.\nOn February 6, 2016, T-Mobile was awarded the JD Power Award for customer satisfaction in the full-service wireless category for the second year in a row. T-Mobile received the highest score ever in the wireless industry.\nIn 2019, T-Mobile was recognized as one of Fortune's Top 100 Companies To Work For, ranking #49.\nIn 2024, it was named in Time's list of influential companies for the year.\n\nMarketing\nJamie Lee Curtis was the spokesperson for T-Mobile USA's predecessor, VoiceStream Wireless, since 1998. VoiceStream's advertising slogan was: \"Get more from life\". During the transition to the T-Mobile brand, Jamie Lee Curtis continued as a spokesperson for a short time and the slogan was changed to \"T-Mobile. Get More.\", which was also adopted by the other T-Mobile companies around the world, including Germany and the UK.\nStarting in 2002, the company's spokesperson was Catherine Zeta-Jones who was the main figure in its branding strategy. As of September 2006, Zeta-Jones had officially been dropped as the \"face\" of the company for its advertising campaigns due to a corporate rebranding strategy. The company also relied on rapper Snoop Dogg as the spokesperson for its T-Mobile Sidekick in a series of commercials late in 2004, the company also released a series of Sidekick phones known as the D-Wade Edition for basketball player Dwyane Wade.\nThe company is also an official sponsor of Major League Baseball, the National Basketball Association, the NBA Rookie Challenge, Women's National Basketball Association, and the Overwatch League. In Puerto Rico, the company also sponsors the Puerto Rico Olympic Committee.\nIn late May 2009, Zeta-Jones was brought back as a company spokesperson to show customers how to pay less for their wireless plan in a new \"Mobile Makeovers\" advertising campaign that refers a customer to third-party comparison site BillShrink.com.\nIn late 2009, commercials for the T-Mobile MyTouch 3G featured the song \"If You Want to Sing Out, Sing Out\" by Cat Stevens and celebrities such as Chevy Chase, Molly Shannon, Dana Carvey, and Darrell Hammond. Another commercial with the same song performed by a different artist showed Wyclef Jean, Avril Lavigne, and Brad Paisley.\nCarly Foulkes is the spokeswoman for the myTouch 4G in commercials that parody the Get a Mac campaign. The model is known for Rugby Ralph Lauren ads.\nAlthough Foulkes is often identified with the color pink, T-Mobile actually has a color trademark for the color magenta, and markets itself using its corporate colors.\nVirgin Mobile has, in turn, parodied the Carly Foulkes ads.\nIn September 2010, the company launched \"Kids are free till 2012\" for family lines.\nOn December 1, 2011, a group of 100 Chicago-area women, along with Carly Foulkes, were featured in a flash-mob style performance at Woodfield Mall in Schaumburg, Illinois, where the group, dressed in magenta dresses, sang and danced through the mall's atrium to their cover of (There's No Place Like) Home for the Holidays. The performance was filmed and edited into a holiday commercial, which was a success.\nT-Mobile US has naming rights contracts with several prominent US sports venues. In 2016, the company signed a contract to place its name on a venue then nearing completion on the Las Vegas Strip. T-Mobile Arena became home to the Vegas Golden Knights of the NHL the following year. In 2018, with Safeco Insurance choosing not to renew its naming contract with Major League Baseball's Seattle Mariners to place its name on the team's stadium, T- Mobile US signed a similar deal, resulting in the former Safeco Field becoming T-Mobile Park on January 1, 2019. Most recently, the name of the main indoor arena in Kansas City, Missouri, changed from Sprint Center to T-Mobile Center following the two companies' 2020 merger. Additionally, T-Mobile US has naming rights for the Distrito T-Mobile, an entertainment and retail complex located next to the Puerto Rico Convention Center in San Juan, Puerto Rico.\n\nUn-carrier movement\nStarting in 2013, T-Mobile launched the Un-carrier marketing campaign. This movement introduced a slew of new tactics to offer consumers cheaper rate plans, cheaper global coverage, and several other benefits. T-Mobile CEO John Legere laid out an \"Un-Carrier manifesto\" highlighting the approach and goals he wanted the company to pursue. One popular Un-carrier move features T-Mobile Tuesdays, where customers are offered a variety of free products and also able to win prizes. The most recent Un-carrier campaign is titled \"T-Mobile One\". This is a new family plan offering, replacing all previous plans and is an all-inclusive unlimited plan, giving unlimited talk, text, and data. The only caveat being a video streaming on any device is limited to 480p resolution. CEO John Legere in an interview said \"The biggest pain point that a million customers told me about is that they hate data buckets. And we had such success with Binge On that we wanted to turn our company into somebody that's selling a monthly subscription to the internet, all in, unlimited.\" As of October 7, 2016, about a quarter of the overall account numbers have moved over to T-Mobile One, and about three-quarters of new postpaid accounts are activating on T-Mobile One.\n\nLabor relations\nT-Mobile US employees and two labor unions have led multiple unionization attempts beginning as early as 2001.\n\nFormation of TU\nHundreds of T-Mobile employees, with the backing of the Communications Workers of America (CWA) and the German union ver.di, have come together as TU to gain representation at T-Mobile. In July 2011, technicians in Connecticut, voted for representation by the Communications Workers of America-TU. On September 25, 2013, MetroPCS workers in Harlem, NY, voted for a union voice and representation by CWA-TU.\n\nLobbying and political influence\nIn 2025, T-Mobile was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom.\n\n2009 coordinated organizing effort\nIn 2008, the CWA and ver.di launched a coordinated effort to unionize company employees. A spokesman for the CWA called on the company to stop resisting mobilization efforts and allow company employees to unionize as German employees of T-Mobile USA's parent company, DT, have done. In response, the company released an employee satisfaction study showing that more than seventy percent of the company's 40,000 workers were \"very satisfied\" with their jobs. Through a spokesman, the company stated, \"Despite the Communication Workers of America's periodic organizing efforts for more than nine years, no group of T-Mobile employees has ever chosen to be represented by a union. While our company is always striving to find ways to improve, year after year, employees continue to view T-Mobile as a good place to work where they have no need for, or interest in, a union.\"\n\nPolitical pressure\nIn 2009, a number of politicians, in one case acting after lobbying efforts by CWA union activists, wrote letters to René Obermann, DT's chief executive officer, in an effort to influence T-Mobile USA's labor practices in the U.S.\nIn a March 13, 2009, letter, U.S. Senator John Kerry (D-MA) asked \"why the company's approach to labor rights are different in Germany than in the United States\". In an April 30, 2010, letter sent after lobbying by Communications Workers of America activists, 26 Democratic members of Congress called on DT to protect and respect workers' rights in the U.S. A separate July 1, 2010, letter from seven Republicans addressed the same issue. On August 10, 2010, U.S. Senator Bob Casey (D-PA) released a statement in support of the worker's efforts to organize a union at the company.\n\nReports\nOn December 9, 2009, the non-profit organization American Rights at Work published a report written by Prof. John Logan, Director of Labor Studies at San Francisco State University, titled \"Lowering the Bar or Setting the Standard? Deutsche Telekom's U.S. Labor Practices\". The report details behavior by the company that the author perceives as anti-union including dissemination of anti-union materials, intimidation and threats directed at pro-union workers, \"captive audience meetings\" and the retention of anti-union specialists. In the report, which is based on documents from the National Labor Relations Board, internal company memos and handbooks, and interviews with workers, Logan asserts that the company engaged in a systematic campaign to prevent employees from forming a union and that DT was guilty of operating by a double standard.\nOn September 2, 2010, Human Rights Watch released a report written by Lance Compa titled \"A Strange Case: Violations of Workers' Freedom of Association in the United States by European Multinational Corporations\". The report concludes that \"company policy has translated into practices that leave the workforce fearful about even seeking union representation.\" DT proclaims its adherence to international labor law and standards that are embodied in German domestic laws. But HRW found that \"T-Mobile USA's harsh opposition to workers' freedom of association in the United States betrays Deutsche Telekom's purported commitment to social responsibility, impedes constructive dialogue with employee representatives, and in several cases, has violated ILO and OECD labor and human rights standards\".\n\nLabor Related Awards\nT-Mobile has received multiple workplace awards. T-Mobile received a score of 100 on the Disability Equality Index (DEI), which measures disability inclusion. They were also named the Best Place to Work for LGBT Equality by the Human Rights Campaign for four consecutive years. T-Mobile was also awarded a Designation for the top 100 Military Friendly Employer by Military Friendly in 2017 for the tenth time. It was recognized as one of the World's Most Ethical Companies by the Ethisphere Institute for the ninth year in a row. In addition to national awards, T-Mobile has also won local awards in many locations, including the best place to work in Albuquerque, New Mexico, and Wichita, Kansas, where the company has some call centers located. On February 16, 2018 Fortune announced their 100 best companies to work for, naming T-Mobile 86th. On July 24, 2018, Forbes ranked T-Mobile 182nd on their top 300 Best Places to Work for Women list.\n\nControversies\nSidekick data outage\nOn October 1, 2009, some users of Microsoft's Sidekick handset temporarily lost personal data, including contacts, notes, and calendars. On October 8, most data services were restored to users. The company and Microsoft announced on October 10 that Sidekick device data \"almost certainly has been lost as a result of a server failure at Microsoft/Danger.\" On October 15, Microsoft said it had been able to recover most or all data and would begin to restore it.\n\nNetwork outages\nOn November 9, 2009, some of the company's subscribers temporarily lost the ability to send and receive calls and text messages for several hours. The company confirmed the outage via Twitter. The company stated that approximately five percent of its subscribers had been affected. It claimed that the problem was caused by a system software error.\nOn May 8, 2018, subscribers in Houston, Texas, experienced a four-hour service interruption caused by damage to a fiber-optic cable.\nOn June 15, 2020, subscribers across the United States suffered a service outage (primarily voice and text) due to routing issues.\nOn February 13, 2023, T-Mobile users across the United States experienced widespread network outages. The company quickly responded that they were looking to address the disruption that caused the cellular service outage.\n\nMisrepresentation as 4G\nIn 2010, T-Mobile began marketing both its HSPA and HSPA+ services as \"4G\". Media outlets called this branding deceptive.\nAfter the ITU expanded its definition of 4G to include HSPA+, T-Mobile continued to market standard HSPA devices and service as 4G. Not only do these HSPA (non-Evolved) devices continue to not meet 4G standards, they are incapable of operating at 4G speeds. Concerns were also displayed over the possibility of confusion when actual LTE networks were deployed.\n\nInformation security\nNicolas Jacobsen was charged with intruding into the company's internal network in January 2005. Reports indicated that for about a year Jacobsen had access to customer passwords, e-mail, address books, Social Security numbers, birth dates, and Sidekick photos. Affected customers included members of the United States Secret Service. Secret Service informant identified Jacobsen as part of \"Operation Firewall\" which provided evidence that Jacobsen had attempted to sell customer information to others for identity theft. T-Mobile USA and the Secret Service did not elaborate on the methods Jacobsen used to gain access but sources close to the case indicated that Jacobsen exploited an unpatched flaw in the Oracle WebLogic Server application software used by the company. Additional SQL injection vulnerabilities with the company's web site were reported by Jack Koziol of the InfoSec Institute.\nT-Mobile offers access to voicemail without the input of a password by default. Parties acting in bad faith may be able to access such voice mailboxes via Caller ID spoofing. To avoid this possibility, T-Mobile recommends that all customers password-protect their mailboxes, but still offers the no password configuration by default due to customer demand.\nOn June 6, 2009, a message posted from an email account \"pwnmobile_at_Safe-mail.net\" to the Full Disclosure mailing list claimed that the company's network had been breached and showed sample data. The sender offered \"databases, confidential documents, scripts and programs from their servers, financial documents up to 2009\" to the highest bidder. On June 9, the company issued a statement confirming the breach but stating that customer data was safe. It claimed to have identified the source document for the sample data and believe it was not obtained by hacking. A later statement claimed that there was not any evidence of a breach.\n\nPrivacy and surveillance\nT-Mobile USA received a portion of the 1.3 million largely warrantless law enforcement requests for subscriber information (including text messages and phone location data) made in 2011, but refused to state how many requests it received. It did say that in the last decade, the number of requests have increased by 12 to 16 percent annually.\nIn April 2024, the FCC fined T-Mobile $92 million for illegally sharing access to customers' real-time location information to location information aggregators LocationSmart and Zumigo without customer consent. In response, T-Mobile said the FCC decision was \"wrong\" and that they intended to challenge it.\n\nData retention policies\nAccording to T-Mobile's privacy policy highlights, \"Retention and Disposal\", information is retained for as long as there is business or tax need or as applicable laws, regulations, or government orders require. T-Mobile notes that it disposes of Personal Information, uses reasonable procedures designed to erase or render it unreadable (for example, shredding documents and wiping electronic media).\nIn 2010, the Department of Justice (DOJ) released a document entitled, \"Retention Periods of Major Cellular Providers,\" to advise law enforcement agents seeking to obtain cell phone records. This document was uncovered by the ACLU's coordinated records request on cell phone location tracking by police. Notably, the document showed that T-Mobile subscriber information was retained for 5 years and call detail records were kept for 2 years (prepaid) and 5 years (postpaid).\nIn 2013, Massachusetts Sen. Edward Markey revealed responses from the top four U.S. wireless providers as well as U.S. Cellular, C Spire, and Cricket/Leap Wireless, to his inquiry regarding user information disclosed to law enforcement officials. The following was T-Mobile's response regarding data retention: T-Mobile US retains customers' historic cell site information and cell tower dump information (180 days); call details records (7–10 years); text message content, data requests, and geo-location data not stored; voicemail content (up to 21 days); subscriber information (6 years after the account is closed).\n\n2021 data breach\nOn August 16, 2021, T-Mobile confirmed that the company had been subject to a data breach but declined to say whether any customers' personal information was accessed or how widespread the damage was. The company acknowledged the breach after hackers told Vice the day prior that they were selling \"full customer info\" obtained from T-Mobile servers.\nOn August 18, 2021, T-Mobile provided an update on the latest findings regarding the data breach. According to the preliminary analysis, the hackers were able to obtain the records more than 40 million former and prospective customers that had applied for credit along with 7.8 million existing postpaid customers. T-Mobile has confirmed that the data collected by the hackers included sensitive personal information, such as the first and last names, birthdates, driver's license/ID numbers, and Social Security numbers, but were unable to access phone numbers, account numbers, PINs or passwords. T-Mobile offered two years of free identity protection services and also recommended for customers to change their PIN as soon as possible. No Metro by T-Mobile, former Sprint prepaid, or Boost Mobile customers were affected by the breach.\nHacker John Erin Binns, aka IRDev, has been listed as the primary hacker based on unsealed court documents. As of March 2025, Binns was also involved in other hacks involving Snowflake customers and is currently being held in a Turkish prison.\n\nOther cybersecurity incidents\nIncluding the widely reported 2021 data breach, T-Mobile has had no less than twelve cybersecurity-related incidents since 2009. At least two data breaches have occurred in 2023, marking a total of nine breaches since 2018. Some of these breaches occurred even after T-Mobile spent $150 million on cybersecurity in response to the 2021 data breach.\n\nSee also\nList of companies based in Bellevue, Washington\nList of mobile network operators in the United States\nList of mobile network operators of the Americas\n\nReferences\nExternal links\nOfficial website\nDeutsche Telekom AG website\nT-Mobile's 2021 data breach website\nBusiness data for T-Mobile US:",
  "clean_text": "T-Mobile US, Inc. is an American wireless network operator headquartered in Bellevue, Washington. Its majority shareholder and namesake is the German telecommunications company Deutsche Telekom. T-Mobile is the second largest wireless carrier in the United States, with 140 million subscribers as of September 30, 2025. The company was founded in 1994 by John W. Stanton of the Western Wireless Corporation as VoiceStream Wireless. Deutsche Telekom then gained plurality ownership in 2001 and renamed it after its global T-Mobile brand. As of April 2023, the German company holds a 51.4% stake in the company. T-Mobile US operates two main brands: T-Mobile and Metro by T-Mobile (acquired in a 2013 reverse takeover of MetroPCS that also led to T-Mobile's listing on the NASDAQ). In 2020, T-Mobile expanded through the acquisition of Sprint, which also made T-Mobile the operator of Assurance Wireless, a service subsidized by the federal Lifeline program. The company's growth continued in 2024 with the acquisitions of Mint Mobile and Ultra Mobile, two low-cost mobile virtual network operators which remain separate brands. In August 2025, the company acquired the wireless operations of UScellular. History T-Mobile U.S. traces its roots to the 1994 establishment of VoiceStream Wireless PCS as a subsidiary of Western Wireless Corporation. After its spin off from parent Western Wireless on May 3, 1999, VoiceStream Wireless was purchased by Deutsche Telekom AG in 2001 for $35 billion and renamed T-Mobile USA, Inc., in July 2002. In 2013, T-Mobile and MetroPCS finalized a merger of the two companies which started trading as T-Mobile U.S. VoiceStream Wireless VoiceStream Wireless PCS was established in 1994 as a subsidiary of Western Wireless Corporation to provide wireless personal communications services (PCS) in 19 FCC-defined metropolitan service areas in several western and southwestern states using the GSM digital wireless standard. VoiceStream Wireless' digital, urban service areas complemented the analog, rural service areas marketed by Western Wireless under the Cellular One brand. Western Wireless spun off its VoiceStream Wireless division into a new company called VoiceStream Wireless Corporation in May 1999. Omnipoint and Aerial acquisition In 2000, VoiceStream Wireless acquired two regional GSM carriers. Omnipoint Corporation, a regional network operator in the Northeastern United States, was acquired on February 25, 2000. Aerial Communications Inc.; a regional network operator in the Columbus, Houston, Kansas City, Minneapolis-St. Paul, Pittsburgh, and Tampa-St. Petersburg-Orlando markets; was acquired on May 4, 2000. The combined company retired the Omnipoint and Aerial brands and completed integrating the three companies by converting to a single customer billing platform, implementing standard business practices and launching the VoiceStream brand and \"GET MORE\" marketing strategy in all markets. Deutsche Telekom acquires VoiceStream and Powertel On June 1, 2001, Deutsche Telekom (DT) completed its acquisition of VoiceStream Wireless, Inc., for $35 billion and Southern U.S. regional GSM network operator Powertel, Inc., for $24 billion. By the end of 2001, VoiceStream Wireless had 19,000 employees serving 7 million subscribers. On September 2, 2001, VoiceStream Wireless Inc. adopted the name, T-Mobile USA, Inc. and began rolling out the T-Mobile brand, starting with locations in California and Nevada. T-Mobile USA, Inc. was an operating entity of T-Mobile International AG, before becoming a direct subsidiary of Deutsche Telekom AG. The merger became official in July 2002. SunCom acquisition On September 17, 2007, the company announced the acquisition of regional GSM carrier SunCom Wireless Holdings, Inc. for $2.4 billion; the acquisition closed on February 22, 2008. By September 8, 2008, SunCom's operations were integrated with those of the company. The acquisition added SunCom's 1.1 million customers to the company's customer base and expanded the company's network coverage to include southern Virginia, North Carolina, South Carolina, eastern Tennessee, northeastern Georgia, Puerto Rico and the U.S. Virgin Islands. Following the Suncom acquisition, T-Mobile possessed native network presence in all the major metro areas in the United States. Aborted acquisition by AT&T On March 20, 2011, AT&T announced its intention to purchase T-Mobile US from Deutsche Telekom. The Antitrust Division of the United States Department of Justice responded by filing a federal lawsuit on August 31, 2011, to block the merger. AT&T then decided to formally abandon the merger bid on December 19, 2011. Merger with MetroPCS Communications On October 3, 2012, MetroPCS Communications agreed to merge with T-Mobile USA. MetroPCS shareholders would hold a 26% stake in the company formed after the merger, which retained the T-Mobile brand. While the new company was still the fourth-largest carrier in the United States (at the time), the acquisition gave T-Mobile access to more spectrum and financial resources to maintain competitiveness and expand its LTE network. The merger between T-Mobile USA Inc. and MetroPCS was officially approved by MetroPCS shareholders on April 24, 2013. The deal was structured as a reverse takeover; the combined company went public on the New York Stock Exchange as TMUS and became T-Mobile U.S. Inc. on May 1, 2013. The merger agreement gave Deutsche Telekom the option to sell its 72% stake in the company formed by the merger and valued at around $14.2 billion to a third party before the end of the 18-month lock-up period. The \"Un-carrier\", additional wireless spectrum acquisition In March 2013, T-Mobile introduced a major overhaul of its plan structure, marketed by branding themselves as being \"the Un-carrier\". A new contract-free pricing structure with simpler plans was introduced in which a phone's cost is paid over a two-year financing plan. The \"Un-carrier\" strategy has since been expanded to encompass other value-added services, such as a plan add-on allowing phone trade-ins for early upgrades twice per year, carrying over unused data allotments for up to a year, and zero-rating of selected music and video services (the latter locked to \"DVD quality\") over the mobile network, These moves came as part of an effort under new CEO John Legere to help revitalize the business as it improves its network quality. Though this system is said to improve network quality, issues surrounding net neutrality infringement have also come to light. The type of zero-rating that is offered by T-Mobile allows it to charge higher rates to third-parties, meaning that ISP can prioritize the company that pays a higher premium. This makes it more difficult for smaller third-parties who are unable to pay the high premium charged by the ISP. On June 28, 2013, T-Mobile agreed to buy wireless spectrum for the Mississippi Valley region from its competitor U.S. Cellular for around $308 million, allowing it to expand its 4G network across 29 more markets. On January 6, 2014, T-Mobile signed agreements with Verizon Wireless to purchase some 700 MHz A-Block spectrum licenses for $2.365 billion. Moreover, a transfer of some AWS and PCS spectrum licenses with a value of $950 million has been agreed upon by T-Mobile and Verizon. The acquisition reportedly gave T-Mobile additional coverage for approximately 158 million people in 9 of the top 10 and 21 of the top 30 U.S. markets. Merger with Sprint Corporation On April 29, 2018, T-Mobile US and Sprint Corporation announced their intention to merge. Although the U.S. Justice Department initially approved the merger on July 26, 2019, the attorneys general from several states filed a lawsuit in the U.S. District Court for the Southern District of New York to block it, alleging that the merger would result in higher prices for consumers in the range of $4.5 billion annually. District Judge Victor Marrero then announced his decision in favor of the merger on February 11, 2020, stating that it \"is not likely to substantially lessen competition like the suing [states] had claimed it would\" and that Sprint \"does not have a sustainable long-term competitive strategy\" to remain a viable competitor. The merger finally closed on April 1, 2020, and the Sprint brand was officially discontinued on August 2, 2020. Leadership, background and stock changes happened immediately, with customer-side changes happening over time. Billing was already showing the T-Mobile brand, and all retail, customer service, and all other company branding switched to the T-Mobile brand. T-Mobile and Sprint accounts were still managed by employees in separate systems and the company still offered Sprint branded SIM cards. New rate plans were also introduced as well for all new and existing customers from both companies, though all were grandfathered into their current plan should they choose not to switch to a new T-Mobile plan for at least three years. As part of the Sprint merger, T-Mobile US acquired Assurance Wireless, the service subsidized by the Lifeline Assistance program of the federal Universal Service Fund. Acquisition of Mint Mobile and Ultra Mobile In March 2023, T-Mobile US agreed to acquire Ka’ena Corporation as well as subsidiaries and brands: Mint Mobile, a successful budget direct-to-consumer prepaid wireless brand in the US, and Ultra Mobile, a wireless service that offers international calling options to communities across the country, for up to $1.35 billion. It was noted that Ryan Reynolds who owns a majority stake in Mint Mobile would stay on as Mint's official spokesman. The deal was expected to close later that year, and the final price would be based on Ka’ena's performance. Acquisition of U.S. Cellular assets On May 28, 2024, T-Mobile US announced it would acquire the wireless operations of U.S. Cellular. Valued at $4.4 billion, the deal includes U.S. Cellular's customer base of 4 million users, approximately 30% of spectrum assets, and the rights to more than 2,000 towers. On July 11, 2025, the Federal Communications Commission approved the acquisition. The deal closed on August 1, 2025. Wireless networks T-Mobile's network provides coverage in the continental United States, Hawaii, Puerto Rico, and the U.S. Virgin Islands. Cellular network 2G GSM VoiceStream Wireless (T-Mobile's predecessor) first started building out its cellular network in 1994. This initial 2G network utilized the GSM standard was first turned on in Honolulu and Salt Lake City by 1996. Through strategic acquisitions and spectrum purchases, the network steadily expanded its geographic reach and technological capabilities. Data transmission was later added the network by implementing General Packet Radio Service (GPRS). This was later augmented with the Enhanced Data Rates for GSM Evolution (EDGE) technology, significantly accelerating data transmission speeds. EDGE coverage was available within at least forty percent of the GSM footprint. T-Mobile began notifying customers in January 2025 of the impending shutdown of the GSM network on February 9, 2025. And Today is barely hanging on in rural areas. 3G UMTS In September 2006, T-Mobile made a significant strategic investment in its network infrastructure by participating in a Federal Communications Commission (FCC) auction, securing licenses in the 1700 MHz and 2100 MHz Advanced Wireless Services (AWS) bands for US$4.18 billion (equivalent to $6.52 billion in 2024). This spectrum acquisition provided the foundation for the nationwide deployment of a 3G network utilizing the UMTS standard. The initial rollout targeted major markets and offered projected speeds of 7.2 Mbit/s, exceeding competitor offerings at the time. This ambitious initiative required an additional investment of $2.6 billion (equivalent to $4.1 billion in 2024) beyond the spectrum acquisition cost. The initial network activation was delayed due to unforeseen circumstances related to government agencies vacating the allocated spectrum. Despite launching the first 3G phone in November 2007, the network itself wasn't operational until May 2008 in New York City. By 2009, T-Mobile had expanded its 3G network to cover over 200 markets. The company further enhanced its network capabilities by upgrading to HSPA+ in 2010. In 2015, to optimize network bandwidth for the deployment of 4G LTE services, T-Mobile initiated a process of migrating 3G services to its PCS band. This strategic shift ultimately rendered some 3G devices incompatible with the network. T-Mobile decommissioned its UMTS network in July 2022. 4G LTE On February 23, 2012, during the Q4 Earnings Call, T-Mobile laid out the future of their 4G upgrade path. They would roll out the LTE network on the AWS spectrum, and transition their HSPA+ network to the PCS band. To achieve compatibility with other networks and phones in the US, T-Mobile began this transition in March 2013, and the rollout of LTE is currently underway as T-Mobile expands to more markets. Due to the failed acquisition of T-Mobile USA by AT&T, T-Mobile USA received additional UMTS frequency band 4 (AWS) spectrum. On March 26, 2013, T-Mobile began rolling out LTE in 7 markets: Baltimore, San Jose, Washington, D.C., Phoenix, Las Vegas, Kansas City, and Houston. On August 21, 2012, the FCC approved a deal between T-Mobile and Verizon in which T-Mobile gained additional AWS spectrum licenses in 125 Cellular Market Areas. On February 25, 2014, T-Mobile announced in its Q4 2013 earnings call that its 4G LTE network covered 209 million people in 273 metro areas. They also planned to start rolling out their 700 MHz A-Block spectrum by the end of 2014, which by the end of the rollout would cover 158 million people. This spectrum led to improved LTE coverage overall in these areas, particularly indoors. On March 13, 2014, T-Mobile announced a new plan to upgrade its entire 2G/EDGE network to 4G LTE. They expected 50% to be done by the end of 2014, and it to be \"substantially complete\" by the middle of 2015. On December 16, 2014, T-Mobile announced during CEO John Legere's Un-carrier 8.0 interview that their 4G LTE network covered 260 million people and their 700 MHz Band 12 LTE had been rolled out in Cleveland, Colorado Springs, Minneapolis, and Washington, D.C. They expected to cover 280 million with LTE by mid-2015 and 300 million by the end of 2015. They also stated that they covered 121 metro areas with their Wideband LTE. On October 27, 2015, T-Mobile announced in its Q3 2015 earnings call that they covered over 300 million people with LTE, reaching their 2015 end of year goal months ahead of schedule. They had 245 markets with Wideband (at least 15+15 MHz) LTE. They also had 204 markets with Extended Range 700 MHz Band 12 LTE covering around 175 million people. Their coverage map revealed that they now had new native LTE coverage in Montana, the Dakotas, Eastern West Virginia, and Northern Michigan. On May 25, 2016, T-Mobile announced that it will be purchasing the 700Mhz A-block license (LTE band 12) for the Chicago metro area. When this transaction closes, together with several other pending 700Mhz license acquisitions, T-Mobile expects to possess 700Mhz licenses covering a total of 272 million people, or 84% of the US population – including 10 of the top 10 largest US metro areas. T-Mobile refers to its 700Mhz low-band network as 'Extended-range LTE' and claims it penetrates buildings and reaches out farther than its PCS and AWS only network. In September 2016, T-Mobile launched 4x4 MIMO and 3 channel carrier aggregation allowing theoretical speeds of 400 Mbit/s, and also announced that the company's LTE network reaches over 312 million potential subscribers. In early 2017, T-Mobile purchased 45% of available 600 MHz spectrum in the US, covering 100% geographically of the US. They started the rollout of LTE on this band on August 15, 2017. In 2018 T-Mobile has stated they will not discontinue rollout and upgrades of LTE in favor of 5G. Instead, they will continue to grow and support their LTE network to work simultaneously with 5G. As of January 22, 2019, the LTE-Advanced upgrade has been deployed in 6,000 cities and towns. As of October 28, 2019, LTE now covers 326 million people. As of February 6, 2020, the 600 MHz network reaches 8,900 cities and towns, covering 248 million people. 5G NR Preparations On June 25, 2018, T-Mobile and Nokia completed their first bi-directional 5G NR transmission in the 28 GHz frequency compliant with 3GPP 5G standards, showing a big step forward to building a nationwide 5G Network. On November 20, 2018, T-Mobile and Nokia completed their first downlink 5G NR transmission in the 600 MHz frequency compliant with 3GPP 5G standards in Spokane, Washington. 28 GHz only reaches roughly 1 square mile (2.6 km2), whereas 600 MHz can reach hundreds of square miles. This marks one step closer to a rural 5G network, one highly sought improvement with 5G technology (high-speed data in rural areas). On January 7, 2019, T-Mobile and Ericsson completed the first audio and video call using a live 5G NR network using 3 separate frequency bands; 600 MHz, 28 GHz, and 39 GHz. This was also the first live network test with successful uplink and downlink. On July 11, 2019, T-Mobile and Ericsson completed their first n71 (600 MHz) data session in their lab in Bellevue, Washington on a commercial 5G modem, the Snapdragon X55, which is the first commercial 5G modem to feature the n71 band. However, the modem was pre-market and not in any commercially available device. Vendors On July 30, 2018, T-Mobile and Nokia announced a $3.5 billion contract for equipment and software to build out a nationwide 5G network that will be compliant with 3GPP 5G standards. The network will use the 600 MHz and 28 GHz frequency bands. On September 11, 2018, T-Mobile and Ericsson announced a $3.5 Billion contract for equipment to build out a nationwide 5G network that will be compliant with 3GPP 5G standards. The network will use the 600 MHz and 28 GHz frequency bands. This marked $7 billion invested in T-Mobile's 5G network, which will use both companies equipment. Launches On February 26, 2018, T-Mobile announced it would roll out 5G to 30 cities by the end of 2018, with compatible handsets delivering early 2019. They also stated their 5G network will be able to work simultaneously with their 4G LTE network, delivering faster speeds and broader range. On June 28, 2019, T-Mobile officially launched their 5G mmWave network with the launch of their first commercially available 5G NR device, the Galaxy S10 5G. The network has launched in 6 cities; Los Angeles, NYC, Atlanta, Dallas, Las Vegas, and Cleveland. On August 4, 2020, T-Mobile launched standalone (SA) mode across their national 5G network, becoming the first operator in the world to do so. They also stated SA mode improved 5G coverage because a connection to a mid-band LTE cell was no longer required as it was in non-standalone mode (NSA). Extended-Range 5G On November 7, 2019, T-Mobile announced that its 600 MHz 5G network will launch on December 6, 2019. The network will launch alongside the first two 600 MHz 5G-capable devices, the Samsung Galaxy Note 10+ 5G and the OnePlus 7T Pro 5G McLaren Edition. On December 2, 2019, T-Mobile officially launched its 600 MHz 5G network. It launched with an initial coverage of 200 million people and over 5,000 cities or towns. As of February 15, 2023, T-Mobile's 600 MHz network covers an estimated 323 million pops. Ultra Capacity 5G On April 21, 2020, T-Mobile launched the T-Mobile branded 2.5 GHz as Ultra-Capacity 5G with the spectrum it acquired in the Sprint merger in Philadelphia. In October 2023, the company announced that their Ultra-Capacity 5G (including PCS, 2.5 GHz and 24/28/39 GHz) currently covers over 300 million pops, by providing an average speed of 400 MB/s, two months ahead of schedule by the year-end. T-Mobile also stated that the same network will go live in New York, NY, the first city with all 3 parts of T-Mobile's \"layer cake\" strategy to 5G NR of having 3 separate bands on low, mid and high band frequencies. T-Mobile has also acquired C-Band 3.7 GHz licenses in early 2021 for an average of 40 MHz of spectrum covering 225 million people nationwide, bidding over $9.3 billion in licenses. This spectrum is currently pending and is going be in use by the end of 2023, adding an additional layer of \"Ultra-Capacity 5G\" with deployment starting in early 2023. On January 31, 2022, T-Mobile announced that they have bid on C-Band 3.45 GHz licenses for approximately $3 billion from Auction 110 auctioned off by Federal Communications Commission for an average of 21 MHz of spectrum to bring up to 184 million people covered across the United States, placing second behind AT&T. T-Mobile intends to deploy this spectrum alongside its C-Band holdings in 2023. On September 30, 2024, T-Mobile divested its 3.45 GHz upper mid-band spectrum holdings. Seven percent of the portfolio valued at $159 million was swapped for 2.5 GHz licenses with SoniqWave in May with the remaining 93 percent sold to Columbia Capital for over $2.7 billion. Roaming T-Mobile has roaming arrangements with a number of national and regional mobile network operators, including AT&T Mobility. As of 2008, prepaid customers have almost all of the postpaid domestic roaming privileges and restricted international roaming to Canada and Mexico. In 2009, T-Mobile USA began removing AT&T Mobility roaming coverage in many locations across the country, and updated its on-line coverage maps to reflect the smaller coverage area. AT&T Mobility roaming remains available in select locations, primarily on smaller carriers that were acquired by AT&T Mobility after long-term roaming contracts were in place between T-Mobile and the smaller carriers, including Centennial Wireless and Edge Wireless. On June 29, 2010, the company launched voice service in the Gulf of Mexico on GSM via roaming agreement through Broadpoint. T-Mobile USA was scheduled to launch data service in Fall 2010. Also in 2010, T-Mobile US became a member of the FreeMove alliance. On October 9, 2013, T-Mobile announced Simple Global, a service included with eligible Simple Choice plans. This service allows one to roam in over 100 countries with unlimited text and speed-limited data, and make calls at $0.20/minute. High-speed data passes will be available for purchase. On March 7, 2014, T-Mobile announced this number will be increasing to 122 countries. If one is connected to WiFi in one of these countries, and their phone supports WiFi calling, all calls and texts to and from the US are free, and work the same as if they were on the cellular network. On July 15, 2015, T-Mobile launched Mobile Without Borders, a service included with all new T-Mobile plans and available as an add-on to grandfathered or promotional plans for $10. This service allows the user to use their normal voice, text message, and data allotments while roaming in Mexico and Canada. Most T-Mobile services are available while roaming, with the notable exception of using the data in one's Data Stash. In August 2015, T-Mobile joined the Competitive Carriers Association's Data Services Hub, enabling the company to expand roaming partnerships with over a dozen rural and regional carriers. Smaller carriers will now be able to access T-Mobile's LTE network for roaming and T-Mobile will be able to expand roaming partnerships and extend its footprint with members whose network technologies had previously been incompatible. In October 2017, T-Mobile announced that starting November 12, 2017, LTE-speeds will be limited at 5 GB (with speeds going at speeds at 128 kbit/s or 256 kbit/s on some plans) while data roaming in Canada and Mexico still remains unlimited. However, calling and texting in these countries still remain free from roaming charges. T-Mobile also announced a partnership with US Cellular in California, Iowa, Washington, and Wisconsin to expand 4G LTE coverage. Compatible device required. In August 2022, T-Mobile and SpaceX announced a partnership called Coverage Above and Beyond where the latter's satellites would provide connections for cellphones throughout the US, even in remote areas with no existing service. The goal was to allow customers to have service everywhere, with no dead zones. Starlink satellites would function like cell towers. At the time of announcement, the plan was to start with text messages and messaging apps and using existing hardware as opposed to new phones. Radio frequency spectrum chart T-Mobile network The following chart describes radio frequency spectrum bands accessible by the company's customers. Past networks The following chart lists the networks that T-Mobile previously operated. Sprint network Sprint's network was decommissioned and integrated into T-Mobile's network. The CDMA network was completely shut down on May 31, 2022 and the LTE network was discontinued on June 30, 2022. Sprint used bands 25, 26 and 41 to provide LTE coverage and used band n41 for NR coverage. T-Mobile HotSpots T-Mobile has used the term \"Hotspot\" to represent various products and technologies. Wi-Fi network (public) The company operates a nationwide Wi-Fi Internet access network under the T-Mobile HotSpots brand. The T-Mobile HotSpots network consists of thousands of Wi-Fi access points installed in businesses, hotels, and airports throughout the U.S. The T-Mobile HotSpot service offers access to a nationwide network of approximately 8,350 access points, installed in venues such as Starbucks coffeehouses, FedEx Office Office and Print Centers, Hyatt hotels and resorts, Red Roof Inns, Sofitel hotels, Novotel hotels, the airline clubs of American Airlines, Delta Air Lines and United Airlines, as well as airports. The T-Mobile HotSpots network can be traced to the company's 2002 purchase of bankrupt wireless ISP MobileStar, which began building its network in 1998. After completing the purchase, the company expanded the network into 400 Borders bookstores, as well as 100 of the most-frequented airport clubs and lounges operated by American Airlines, Delta Air Lines, and United Airlines. On September 14, 2014, T-Mobile partnered up with GoGo to provide free texting on airplanes for its customers. GoGo services are provided on Delta Air Lines, American Airlines, United Airlines and Alaska Airlines. On June 6, 2016, T-Mobile expanded its partnership with GoGo to offer T-Mobile users one hour of free WiFi on customers phones while T-Mobile One Plus and One Plus International users also get free WiFi throughout the entire flight. T-Mobile also included other messaging apps (iMessage, Google Hangouts, WhatsApp and Viber) in addition to SMS texting being provided since September 2014. Wi-Fi network (private) T-Mobile has also used the term to describe Wi-Fi Access Points that it sold to end users to expand their cell phone network to phones equipped to also receive Wi-Fi using a VOIP-like technology. (The models included at least two by Linksys: the WRTU54G-TM and the WRT54G-TM and one by D-Link: the TM-G5240.) Finances For the fiscal year 2023, T-Mobile US reported earnings of US$8.317 billion, with an annual revenue of US$78.558 billion, a decrease of 1.3% over the previous fiscal cycle. T-Mobile's shares traded at over $160 per share and its market capitalization was valued at over US$195 billion in February 2024. * Merger with Sprint in 2020 Locations T-Mobile US's headquarters are located in the Factoria neighborhood of Bellevue, Washington, a suburb east of Seattle on Interstate 90. The headquarters includes ten buildings in Factoria and other areas of the Eastside region that employed 8,000 workers in 2020. The company launched a shuttle bus service, named the Magenta Express, in 2017 to serve the buildings and other commute trips. Products and services Mobile phone and data Current plans In April 2023, the company announced its new Go5G and Go5G Plus plans. The Go5G Plus plan brought new features to T-Mobile's premier voice plan offering. Namely, it guaranteed subscribers 24 month device financing terms, and access to the best available device promotions on new purchases. These perks were available to new and existing customers alike, as long as they stayed on the plan. A single voice line on Go5G Plus cost $90 per month and included the same features Magenta MAX offered, like Netflix and Apple TV+, as well as an extra 10 GB of premium mobile hotspot data for a total of 50 GB per month, and 15 GB of high-speed data in Canada and Mexico. Discounted versions of the new plans were announced for small businesses, customers 55-years-old and up, first responders, and military families. The T-Mobile Essentials plan provides customers unlimited talk, text, and data service at a lower price than a standard Magenta or Magenta Plus plan. However, unlike most other plans, the Essentials plan does not include taxes and fees. It also allows T-Mobile to prioritize other customers over Essentials customers' data usage on the network at any time during network congestion or peak times. Additionally, the company unveiled a \"limited time\" plan called Essentials Saver that lowered the price to $50 from $60. On June 2, 2019, T-Mobile announced the launch of the Magenta plan, replacing the T-Mobile ONE plans. The Magenta family of plans build on the existing features of the T-Mobile ONE and ONE Plus plans, but now include additional features like 3 GB of mobile hotspot data for standard Magenta plans, and retaining the same enhanced HD streaming, 20 GB of mobile hotspot data, and other features of the T-Mobile ONE Plus plans. On January 22, 2021, it was announced that T-Mobile unveiled its newest 5G smartphone plan with no throttling, called Magenta MAX. Customers get unlimited Premium Data (4G and 5G), unlimited 4K UHD video streaming, complimentary video streaming services, mobile high-speed hotspot data at 40 GB, unlimited talk, text, and data in Mexico and Canada with up to 5 GB of high-speed data, T-Mobile Tuesdays free thank you gifts and discounts, unlimited Gogo in-flight texting and Wi-Fi all flight long, free texting and data in 210 countries and destinations, and free Scam Shield Premium protection, including free Scam Block and Caller ID. Magenta MAX cost the same as the Magenta Plus plan at $57 per line per month for three lines with autopay with taxes and fees included. Both Go5G plans and the Essential Saver plan were announced on April 20, or 4/20, a reference to pot consumption. The Verge noted T-Mobile's aim to \"smoke the competition\" had \"some real 'How do you do, fellow kids?' energy\", in reference to actor Steve Buscemi appearing out of touch on the sitcom 30 Rock. Senior, military and first responder plans Alongside the T-Mobile Magenta family of plans are the specialized plans offered to Military personnel, First Responders, and seniors age 55 and up. Military and First Responder plans allow for qualified service members to receive 50% off of standard pricing Magenta and Magenta Plus plans. Customers must verify their affiliation within 45 days of activation or switching to the plan in order to retain the discounted offer. The Unlimited 55+ allows customers at or over the age of 55 to receive a set discounted price on standard rate plans, however these accounts are limited to only 2 lines per account. Certain customers were permitted to add a third line to their account during a specific promotional period. Complementary video streaming On September 12, 2017, T-Mobile introduced the Netflix On Us program. Initially, this was limited to T-Mobile ONE family plans, and the Standard ad-free Netflix plan was included, valued at $11/month after an October 2017 price increase. Over time, the benefit was expanded to several other individual and family plans. On January 15, 2021, the benefit was changed to the Netflix Basic plan for Magenta subscribers, and the Netflix Standard plan for Magenta Plus and ONE Plus subscribers. As of January 24, 2024, all T-Mobile subscribers with the Netflix On Us benefit receive the ad-supported Standard plan from Netflix, regardless of their T-Mobile plan. This plan is missing several titles compared to ad-free plans, and a few devices with older Netflix software are unsupported. Customers can pay an additional fee for a plan without advertisements. Discontinued plans In March 2013, T-Mobile introduced a new streamlined plan, Simple Choice, for new customers. This is part of an initiative called Un-carrier which drops contracts, subsidized phones, overage fees for data, and early termination fees. In August 2016, T-Mobile introduced T-Mobile ONE as a replacement for Simple Choice. The plan has been criticized by the Electronic Frontier Foundation and others for potentially violating net neutrality rules and making previously included features paid extras. In August 2018, T-Mobile introduced the ONE Plus family plan, which allows HD streaming and adds 20 GB of mobile hotspot at 4G LTE speeds, and Name ID. As of June 2, 2019, the T-Mobile ONE and ONE Plus plans have been retired, and replaced by the new Magenta plans. On June 2, 2019, T-Mobile announced the launch of Magenta Plus. T-Mobile has since discontinued this plan, but it has upgraded the Magenta plan with 100 GB of premium data, while the high-speed hotspot data was increased to 5 GB. Capping unlimited data users On August 31, 2015, T-Mobile announced it will ask users who abuse its unlimited on-smartphone data plan by violating T-Mobile's Terms & Conditions regarding tethering (which like unlimited on-smartphone data, remains unlimited, but offers a 14 GB high-speed allotment before throttling takes effect), by permanently removing user access to unlimited plans and migrating users to a tiered data plan. By doing so, all plans after a select amount of inclusive high-speed data, result in automatic throttled speeds, preventing unlimited high-speed tethering use and abuse of the network. T-Mobile stated that there are a small handful of users who abuse the tethering plan by altering device software and/or the use of an Android app that masks T-Mobile's ability monitoring whether data is on-smartphone, or through smartphone mobile hotspot (tethering) by mimicking all data as on-smartphone use, with some customers abusing the service by using as much as 2 TB per month, causing speed issues for all other customers. InReach program The InReach program provides a free cell phone and a limited number of voice minutes each month for low-income-eligible families (one per family) who do not use Lifeline services offered by any other phone or wireless company. It is funded through the Universal Service Fund, but is only operational in a limited number of states and Puerto Rico. Prepaid mobile phone and data Ultra Mobile Ultra Mobile is a prepaid MVNO that offers limited and unlimited plans that include international calling and texting to select countries. Ultra Mobile was acquired alongside Mint Mobile by T-Mobile US on May 1, 2024. Mint Mobile Mint Mobile is an MVNO that offers plans charged in increments of 3, 6, or 12 months, offering discounts for longer subscriptions. Mint Mobile was officially acquired by T-Mobile US on May 1, 2024. Tello Mobile Founded in 2016, Tello Mobile now uses the T-Mobile network to provide MVNO talk, text, and data to its customers. Tello originally used the Sprint network, but transitioned to the T-Mobile network after the T-Mobile and Sprint merger. Metro by T-Mobile The former MetroPCS was taken over by T-Mobile in 2013, the new company formed T-Mobile US and currently continues to offer prepaid wireless services under the Metro by T-Mobile brand. Assurance Wireless The T-Mobile network has carried Assurance Wireless since the 2020 Sprint merger. The service is subsidized by the federal Lifeline Assistance program, a government benefit program supported by the federal Universal Service Fund. Low-income people who qualify for the services are provided a free phone, free monthly data and minutes, and unlimited texting. Former prepaid services GoSmart Mobile GoSmart Mobile was a T-Mobile branded service that launched in beta on December 7, 2012, and became officially available nationwide on February 19, 2013. GoSmart offered no-contract SIM wireless services. GoSmart Mobile was sold to consumers through dealers who worked as independent contractors under their own company name. Such sellers are known as \"Authorized Dealers\" with either physical or online stores. In September 2016, T-Mobile sold the brand and 326,000 GoSmart Mobile customers to TracFone Wireless. The customers were reclassified as wholesale subscribers. Television and streaming TVision On December 13, 2017, T-Mobile US announced its intent to acquire the IPTV provider Layer3 TV, which operates in Chicago and Washington, as the basis of its own subscription television service initially planned to launch in 2018. On April 10, 2019, T-Mobile officially announced the re-branding and re-launch of Layer3 TV as TVision Home The service mirrors the hardware, packaging, and pricing models of other linear television providers. On October 27, 2020, T-Mobile US introduced over-the-top streaming services under the TVision branding. It consisted of several packages, including TVision Vibe (a lower-cost bundle focused on entertainment channels), TVision Live (network television, basic cable and sports networks, as well as cloud DVR), and TVision Channels (with standalone subscriptions for pay television services). TVision Home ceased operations on December 30, 2020. On March 29, 2021, T-Mobile announced that TVision would be discontinued on April 29, 2021. The provider will instead offer promotional bundles with the third-party providers Philo and YouTube TV. Financial services Banking cards On January 22, 2014, T-Mobile announced that it would expand its products into banking. T-Mobile would provide Visa card with banking features and a smartphone money management application with reduced-fee or zero-cost services for T-Mobile wireless customers. In addition, customers would have access to over 42,000 ATMs with no fees. In early 2016, T-Mobile decided to discontinue the banking cards. They can no longer be purchased at T-Mobile. Online banking In early 2019, T-Mobile released an online banking option called \"T-Mobile Money\". Customer service Team of Experts In 2018, T-Mobile officially announced its new customer care concept called Team of Experts. The premise being customers never being transferred to another department. All representatives are trained in billing, payment arrangements, and cancellations when in the past each had their own separate department. In addition to being cross-trained, the Team of Experts, which consists of usually between 30 and 35 account reps, 4 to 6 technical support representatives, 4 supervisors overseeing the representatives, and one manager, are assigned specific markets, usually within the region the call center is in. Awards From as early as 2004, the company has captured multiple J. D. Power annual awards in the areas of retail sales satisfaction, wireless customer care, and overall customer satisfaction. In 2011, J. D. Power and Associates stated that T-Mobile retail stores achieved the highest ratings among major wireless carriers for customer satisfaction for the fourth consecutive year, performing particularly well in price and promotions. Also in 2011, J. D. Power and Associates ranked T-Mobile USA highest among major providers in wireless customer care for the second consecutive year. On December 3, 2015, Consumer Reports named T-Mobile the number one American wireless service provider. The results combine data from customer service, voice quality, text messaging services, and data speeds. On February 6, 2016, T-Mobile was awarded the JD Power Award for customer satisfaction in the full-service wireless category for the second year in a row. T-Mobile received the highest score ever in the wireless industry. In 2019, T-Mobile was recognized as one of Fortune's Top 100 Companies To Work For, ranking #49. In 2024, it was named in Time's list of influential companies for the year. Marketing Jamie Lee Curtis was the spokesperson for T-Mobile USA's predecessor, VoiceStream Wireless, since 1998. VoiceStream's advertising slogan was: \"Get more from life\". During the transition to the T-Mobile brand, Jamie Lee Curtis continued as a spokesperson for a short time and the slogan was changed to \"T-Mobile. Get More.\", which was also adopted by the other T-Mobile companies around the world, including Germany and the UK. Starting in 2002, the company's spokesperson was Catherine Zeta-Jones who was the main figure in its branding strategy. As of September 2006, Zeta-Jones had officially been dropped as the \"face\" of the company for its advertising campaigns due to a corporate rebranding strategy. The company also relied on rapper Snoop Dogg as the spokesperson for its T-Mobile Sidekick in a series of commercials late in 2004, the company also released a series of Sidekick phones known as the D-Wade Edition for basketball player Dwyane Wade. The company is also an official sponsor of Major League Baseball, the National Basketball Association, the NBA Rookie Challenge, Women's National Basketball Association, and the Overwatch League. In Puerto Rico, the company also sponsors the Puerto Rico Olympic Committee. In late May 2009, Zeta-Jones was brought back as a company spokesperson to show customers how to pay less for their wireless plan in a new \"Mobile Makeovers\" advertising campaign that refers a customer to third-party comparison site BillShrink.com. In late 2009, commercials for the T-Mobile MyTouch 3G featured the song \"If You Want to Sing Out, Sing Out\" by Cat Stevens and celebrities such as Chevy Chase, Molly Shannon, Dana Carvey, and Darrell Hammond. Another commercial with the same song performed by a different artist showed Wyclef Jean, Avril Lavigne, and Brad Paisley. Carly Foulkes is the spokeswoman for the myTouch 4G in commercials that parody the Get a Mac campaign. The model is known for Rugby Ralph Lauren ads. Although Foulkes is often identified with the color pink, T-Mobile actually has a color trademark for the color magenta, and markets itself using its corporate colors. Virgin Mobile has, in turn, parodied the Carly Foulkes ads. In September 2010, the company launched \"Kids are free till 2012\" for family lines. On December 1, 2011, a group of 100 Chicago-area women, along with Carly Foulkes, were featured in a flash-mob style performance at Woodfield Mall in Schaumburg, Illinois, where the group, dressed in magenta dresses, sang and danced through the mall's atrium to their cover of (There's No Place Like) Home for the Holidays. The performance was filmed and edited into a holiday commercial, which was a success. T-Mobile US has naming rights contracts with several prominent US sports venues. In 2016, the company signed a contract to place its name on a venue then nearing completion on the Las Vegas Strip. T-Mobile Arena became home to the Vegas Golden Knights of the NHL the following year. In 2018, with Safeco Insurance choosing not to renew its naming contract with Major League Baseball's Seattle Mariners to place its name on the team's stadium, T- Mobile US signed a similar deal, resulting in the former Safeco Field becoming T-Mobile Park on January 1, 2019. Most recently, the name of the main indoor arena in Kansas City, Missouri, changed from Sprint Center to T-Mobile Center following the two companies' 2020 merger. Additionally, T-Mobile US has naming rights for the Distrito T-Mobile, an entertainment and retail complex located next to the Puerto Rico Convention Center in San Juan, Puerto Rico. Un-carrier movement Starting in 2013, T-Mobile launched the Un-carrier marketing campaign. This movement introduced a slew of new tactics to offer consumers cheaper rate plans, cheaper global coverage, and several other benefits. T-Mobile CEO John Legere laid out an \"Un-Carrier manifesto\" highlighting the approach and goals he wanted the company to pursue. One popular Un-carrier move features T-Mobile Tuesdays, where customers are offered a variety of free products and also able to win prizes. The most recent Un-carrier campaign is titled \"T-Mobile One\". This is a new family plan offering, replacing all previous plans and is an all-inclusive unlimited plan, giving unlimited talk, text, and data. The only caveat being a video streaming on any device is limited to 480p resolution. CEO John Legere in an interview said \"The biggest pain point that a million customers told me about is that they hate data buckets. And we had such success with Binge On that we wanted to turn our company into somebody that's selling a monthly subscription to the internet, all in, unlimited.\" As of October 7, 2016, about a quarter of the overall account numbers have moved over to T-Mobile One, and about three-quarters of new postpaid accounts are activating on T-Mobile One. Labor relations T-Mobile US employees and two labor unions have led multiple unionization attempts beginning as early as 2001. Formation of TU Hundreds of T-Mobile employees, with the backing of the Communications Workers of America (CWA) and the German union ver.di, have come together as TU to gain representation at T-Mobile. In July 2011, technicians in Connecticut, voted for representation by the Communications Workers of America-TU. On September 25, 2013, MetroPCS workers in Harlem, NY, voted for a union voice and representation by CWA-TU. Lobbying and political influence In 2025, T-Mobile was one of the donors who funded the White House's East Wing demolition, and planned building of a ballroom. 2009 coordinated organizing effort In 2008, the CWA and ver.di launched a coordinated effort to unionize company employees. A spokesman for the CWA called on the company to stop resisting mobilization efforts and allow company employees to unionize as German employees of T-Mobile USA's parent company, DT, have done. In response, the company released an employee satisfaction study showing that more than seventy percent of the company's 40,000 workers were \"very satisfied\" with their jobs. Through a spokesman, the company stated, \"Despite the Communication Workers of America's periodic organizing efforts for more than nine years, no group of T-Mobile employees has ever chosen to be represented by a union. While our company is always striving to find ways to improve, year after year, employees continue to view T-Mobile as a good place to work where they have no need for, or interest in, a union.\" Political pressure In 2009, a number of politicians, in one case acting after lobbying efforts by CWA union activists, wrote letters to René Obermann, DT's chief executive officer, in an effort to influence T-Mobile USA's labor practices in the U.S. In a March 13, 2009, letter, U.S. Senator John Kerry (D-MA) asked \"why the company's approach to labor rights are different in Germany than in the United States\". In an April 30, 2010, letter sent after lobbying by Communications Workers of America activists, 26 Democratic members of Congress called on DT to protect and respect workers' rights in the U.S. A separate July 1, 2010, letter from seven Republicans addressed the same issue. On August 10, 2010, U.S. Senator Bob Casey (D-PA) released a statement in support of the worker's efforts to organize a union at the company. Reports On December 9, 2009, the non-profit organization American Rights at Work published a report written by Prof. John Logan, Director of Labor Studies at San Francisco State University, titled \"Lowering the Bar or Setting the Standard? Deutsche Telekom's U.S. Labor Practices\". The report details behavior by the company that the author perceives as anti-union including dissemination of anti-union materials, intimidation and threats directed at pro-union workers, \"captive audience meetings\" and the retention of anti-union specialists. In the report, which is based on documents from the National Labor Relations Board, internal company memos and handbooks, and interviews with workers, Logan asserts that the company engaged in a systematic campaign to prevent employees from forming a union and that DT was guilty of operating by a double standard. On September 2, 2010, Human Rights Watch released a report written by Lance Compa titled \"A Strange Case: Violations of Workers' Freedom of Association in the United States by European Multinational Corporations\". The report concludes that \"company policy has translated into practices that leave the workforce fearful about even seeking union representation.\" DT proclaims its adherence to international labor law and standards that are embodied in German domestic laws. But HRW found that \"T-Mobile USA's harsh opposition to workers' freedom of association in the United States betrays Deutsche Telekom's purported commitment to social responsibility, impedes constructive dialogue with employee representatives, and in several cases, has violated ILO and OECD labor and human rights standards\". Labor Related Awards T-Mobile has received multiple workplace awards. T-Mobile received a score of 100 on the Disability Equality Index (DEI), which measures disability inclusion. They were also named the Best Place to Work for LGBT Equality by the Human Rights Campaign for four consecutive years. T-Mobile was also awarded a Designation for the top 100 Military Friendly Employer by Military Friendly in 2017 for the tenth time. It was recognized as one of the World's Most Ethical Companies by the Ethisphere Institute for the ninth year in a row. In addition to national awards, T-Mobile has also won local awards in many locations, including the best place to work in Albuquerque, New Mexico, and Wichita, Kansas, where the company has some call centers located. On February 16, 2018 Fortune announced their 100 best companies to work for, naming T-Mobile 86th. On July 24, 2018, Forbes ranked T-Mobile 182nd on their top 300 Best Places to Work for Women list. Controversies Sidekick data outage On October 1, 2009, some users of Microsoft's Sidekick handset temporarily lost personal data, including contacts, notes, and calendars. On October 8, most data services were restored to users. The company and Microsoft announced on October 10 that Sidekick device data \"almost certainly has been lost as a result of a server failure at Microsoft/Danger.\" On October 15, Microsoft said it had been able to recover most or all data and would begin to restore it. Network outages On November 9, 2009, some of the company's subscribers temporarily lost the ability to send and receive calls and text messages for several hours. The company confirmed the outage via Twitter. The company stated that approximately five percent of its subscribers had been affected. It claimed that the problem was caused by a system software error. On May 8, 2018, subscribers in Houston, Texas, experienced a four-hour service interruption caused by damage to a fiber-optic cable. On June 15, 2020, subscribers across the United States suffered a service outage (primarily voice and text) due to routing issues. On February 13, 2023, T-Mobile users across the United States experienced widespread network outages. The company quickly responded that they were looking to address the disruption that caused the cellular service outage. Misrepresentation as 4G In 2010, T-Mobile began marketing both its HSPA and HSPA+ services as \"4G\". Media outlets called this branding deceptive. After the ITU expanded its definition of 4G to include HSPA+, T-Mobile continued to market standard HSPA devices and service as 4G. Not only do these HSPA (non-Evolved) devices continue to not meet 4G standards, they are incapable of operating at 4G speeds. Concerns were also displayed over the possibility of confusion when actual LTE networks were deployed. Information security Nicolas Jacobsen was charged with intruding into the company's internal network in January 2005. Reports indicated that for about a year Jacobsen had access to customer passwords, e-mail, address books, Social Security numbers, birth dates, and Sidekick photos. Affected customers included members of the United States Secret Service. Secret Service informant identified Jacobsen as part of \"Operation Firewall\" which provided evidence that Jacobsen had attempted to sell customer information to others for identity theft. T-Mobile USA and the Secret Service did not elaborate on the methods Jacobsen used to gain access but sources close to the case indicated that Jacobsen exploited an unpatched flaw in the Oracle WebLogic Server application software used by the company. Additional SQL injection vulnerabilities with the company's web site were reported by Jack Koziol of the InfoSec Institute. T-Mobile offers access to voicemail without the input of a password by default. Parties acting in bad faith may be able to access such voice mailboxes via Caller ID spoofing. To avoid this possibility, T-Mobile recommends that all customers password-protect their mailboxes, but still offers the no password configuration by default due to customer demand. On June 6, 2009, a message posted from an email account \"pwnmobile_at_Safe-mail.net\" to the Full Disclosure mailing list claimed that the company's network had been breached and showed sample data. The sender offered \"databases, confidential documents, scripts and programs from their servers, financial documents up to 2009\" to the highest bidder. On June 9, the company issued a statement confirming the breach but stating that customer data was safe. It claimed to have identified the source document for the sample data and believe it was not obtained by hacking. A later statement claimed that there was not any evidence of a breach. Privacy and surveillance T-Mobile USA received a portion of the 1.3 million largely warrantless law enforcement requests for subscriber information (including text messages and phone location data) made in 2011, but refused to state how many requests it received. It did say that in the last decade, the number of requests have increased by 12 to 16 percent annually. In April 2024, the FCC fined T-Mobile $92 million for illegally sharing access to customers' real-time location information to location information aggregators LocationSmart and Zumigo without customer consent. In response, T-Mobile said the FCC decision was \"wrong\" and that they intended to challenge it. Data retention policies According to T-Mobile's privacy policy highlights, \"Retention and Disposal\", information is retained for as long as there is business or tax need or as applicable laws, regulations, or government orders require. T-Mobile notes that it disposes of Personal Information, uses reasonable procedures designed to erase or render it unreadable (for example, shredding documents and wiping electronic media). In 2010, the Department of Justice (DOJ) released a document entitled, \"Retention Periods of Major Cellular Providers,\" to advise law enforcement agents seeking to obtain cell phone records. This document was uncovered by the ACLU's coordinated records request on cell phone location tracking by police. Notably, the document showed that T-Mobile subscriber information was retained for 5 years and call detail records were kept for 2 years (prepaid) and 5 years (postpaid). In 2013, Massachusetts Sen. Edward Markey revealed responses from the top four U.S. wireless providers as well as U.S. Cellular, C Spire, and Cricket/Leap Wireless, to his inquiry regarding user information disclosed to law enforcement officials. The following was T-Mobile's response regarding data retention: T-Mobile US retains customers' historic cell site information and cell tower dump information (180 days); call details records (7–10 years); text message content, data requests, and geo-location data not stored; voicemail content (up to 21 days); subscriber information (6 years after the account is closed). 2021 data breach On August 16, 2021, T-Mobile confirmed that the company had been subject to a data breach but declined to say whether any customers' personal information was accessed or how widespread the damage was. The company acknowledged the breach after hackers told Vice the day prior that they were selling \"full customer info\" obtained from T-Mobile servers. On August 18, 2021, T-Mobile provided an update on the latest findings regarding the data breach. According to the preliminary analysis, the hackers were able to obtain the records more than 40 million former and prospective customers that had applied for credit along with 7.8 million existing postpaid customers. T-Mobile has confirmed that the data collected by the hackers included sensitive personal information, such as the first and last names, birthdates, driver's license/ID numbers, and Social Security numbers, but were unable to access phone numbers, account numbers, PINs or passwords. T-Mobile offered two years of free identity protection services and also recommended for customers to change their PIN as soon as possible. No Metro by T-Mobile, former Sprint prepaid, or Boost Mobile customers were affected by the breach. Hacker John Erin Binns, aka IRDev, has been listed as the primary hacker based on unsealed court documents. As of March 2025, Binns was also involved in other hacks involving Snowflake customers and is currently being held in a Turkish prison. Other cybersecurity incidents Including the widely reported 2021 data breach, T-Mobile has had no less than twelve cybersecurity-related incidents since 2009. At least two data breaches have occurred in 2023, marking a total of nine breaches since 2018. Some of these breaches occurred even after T-Mobile spent $150 million on cybersecurity in response to the 2021 data breach."
}