{
  "ticker": "TPL",
  "cik": "0001811074",
  "company_name": "Texas Pacific Land Corporation",
  "corrected_name": "Texas Pacific Land Corporation",
  "wiki_title_used": "Texas Pacific Land Corporation",
  "exists": true,
  "raw_text": "The Texas Pacific Land Corporation is a publicly traded real estate operating company with its administrative office in Dallas, Texas. Owning over 880,000 acres (3,600 km2) in 20 West Texas counties, TPL is among the largest private landowners in the state of Texas. It was previously organized as a publicly traded trust taxed as a corporation, and operated under the name Texas Pacific Land Trust.\nTPL has two business lines: royalties from oil and gas, its main business segment, and selling water.\n\nHistory\nTexas Pacific Land Holdings was created in 1888 in the wake of the Texas and Pacific Railway bankruptcy, as a means to dispose of the T&P's vast land holdings. Over 3.5 million acres were put into the trust, and bondholders exchanged their bonds for shares. Trustees were to sell the land and repay shareholders, eventually liquidating the trust, though there was no timetable for liquidation. The certificates were later divided into \"sub-share\" certificates on a 100 for one basis, which have been traded on the NYSE since January 1927. One such bond, No. 390, was not exchanged for stocks at this time. In 1979, a bank officer at Wells Fargo tracked down its ownership to Dutch sailor Joseph Raphael De Lamar. Worth $3,000 in 1888, the bond had been provided to De Lamar as partial payment for a debt. In 1979 its value was $3.2 million.\nIn 1954, shareholders approved the transfer of mineral rights on the land to a new entity, TXL Oil Corporation, who could engage in the exploration, drilling and development of oil and gas properties. At the time, TPL’s holdings included approximately 1.8 million acres across 28 counties in Texas. Between 1980 and 1995, TPL bought back stock more quickly than it sold land, reducing its outstanding shares by 34% and its land inventory by only 8%, to 1.1 million acres.\nIn 2010, the introduction of hydraulic fracturing and horizontal drilling unlocked oil and gas within the Permian shale, where TPL owned approximately 909,000 acres of land. In 2016, there was a significant discovery of oil and gas reserves in the southern portion of the Delaware Basin in Reeves County where the company owned substantial land. Subsequently, the company’s annual revenue rose from $66 million in 2016 to $451 million in 2021.\nIn 2019, TPL settled a months-long proxy fight over the election of trustee Eric Oliver. As part of the settlement, the company established a committee to explore whether Texas Pacific should be converted to a Delaware corporation. In 2021, the company reorganized from a trust to a corporation, was subsequently renamed Texas Pacific Land Corporation, and appointed a board of directors to govern.\n\nOperations\nTPL is among the largest private landowners in the State of Texas. As of 2022, the corporation owned approximately 880,000 acres (3,600 km2) of land in 20 West Texas counties.\nApproximately two-thirds of TPL’s income is derived from oil and gas royalties. Another 30% is derived from supplying and disposing of water used in fracking shale. In June 2017, TPL hired a team from EOG Resources and established the Texas Pacific Water Resources, LLC, a wholly owned subsidiary that offers brackish water sourcing, water disposal, water recycling, and other hydrocarbon extraction related water services.\n\nReferences\nExternal links\nOfficial website \nBusiness data for Texas Pacific Land Corporation:",
  "clean_text": "The Texas Pacific Land Corporation is a publicly traded real estate operating company with its administrative office in Dallas, Texas. Owning over 880,000 acres (3,600 km2) in 20 West Texas counties, TPL is among the largest private landowners in the state of Texas. It was previously organized as a publicly traded trust taxed as a corporation, and operated under the name Texas Pacific Land Trust. TPL has two business lines: royalties from oil and gas, its main business segment, and selling water. History Texas Pacific Land Holdings was created in 1888 in the wake of the Texas and Pacific Railway bankruptcy, as a means to dispose of the T&P's vast land holdings. Over 3.5 million acres were put into the trust, and bondholders exchanged their bonds for shares. Trustees were to sell the land and repay shareholders, eventually liquidating the trust, though there was no timetable for liquidation. The certificates were later divided into \"sub-share\" certificates on a 100 for one basis, which have been traded on the NYSE since January 1927. One such bond, No. 390, was not exchanged for stocks at this time. In 1979, a bank officer at Wells Fargo tracked down its ownership to Dutch sailor Joseph Raphael De Lamar. Worth $3,000 in 1888, the bond had been provided to De Lamar as partial payment for a debt. In 1979 its value was $3.2 million. In 1954, shareholders approved the transfer of mineral rights on the land to a new entity, TXL Oil Corporation, who could engage in the exploration, drilling and development of oil and gas properties. At the time, TPL’s holdings included approximately 1.8 million acres across 28 counties in Texas. Between 1980 and 1995, TPL bought back stock more quickly than it sold land, reducing its outstanding shares by 34% and its land inventory by only 8%, to 1.1 million acres. In 2010, the introduction of hydraulic fracturing and horizontal drilling unlocked oil and gas within the Permian shale, where TPL owned approximately 909,000 acres of land. In 2016, there was a significant discovery of oil and gas reserves in the southern portion of the Delaware Basin in Reeves County where the company owned substantial land. Subsequently, the company’s annual revenue rose from $66 million in 2016 to $451 million in 2021. In 2019, TPL settled a months-long proxy fight over the election of trustee Eric Oliver. As part of the settlement, the company established a committee to explore whether Texas Pacific should be converted to a Delaware corporation. In 2021, the company reorganized from a trust to a corporation, was subsequently renamed Texas Pacific Land Corporation, and appointed a board of directors to govern. Operations TPL is among the largest private landowners in the State of Texas. As of 2022, the corporation owned approximately 880,000 acres (3,600 km2) of land in 20 West Texas counties. Approximately two-thirds of TPL’s income is derived from oil and gas royalties. Another 30% is derived from supplying and disposing of water used in fracking shale. In June 2017, TPL hired a team from EOG Resources and established the Texas Pacific Water Resources, LLC, a wholly owned subsidiary that offers brackish water sourcing, water disposal, water recycling, and other hydrocarbon extraction related water services."
}