{
  "ticker": "TPR",
  "cik": "0001116132",
  "company_name": "Tapestry, Inc.",
  "corrected_name": "Tapestry, Inc.",
  "wiki_title_used": "Tapestry, Inc.",
  "exists": true,
  "raw_text": "Tapestry, Inc. is an American multinational fashion holding company. It is based in New York City and is the parent company of two major brands: Coach New York and Kate Spade New York. Originally named Coach, Inc., the business changed its name to Tapestry on October 31, 2017.\n\nHistory\nCoach New York\nCoach was founded in 1941. Starting as a workshop, it grew into a company  with over 17,000 employees when its founders Miles Cahn and Lillian Cahn took over. Seeking wider recognition and a larger market, the company acquired brands such as Kate Spade and Stuart Weitzman. This broadened the appeal to consumers of all three brands. The company changed names, reducing the share price because investors felt that the name change was not well received by customers. The share price later recovered.\n\nKate Spade New York\nAmerican fashion designer Kate Spade founded Kate Spade New York in 1993. It was initially similar to the Coach company. The company was purchased by Coach in 2017 in a $2.4 billion deal.\n\nStuart Weitzman\nStuart Weitzman (born 1941) began working in the early 1960s for Seymour Shoes, a company set up by his father Seymour Weitzman and his older brother Warren in Haverhill, Massachusetts in the late 1950s.\nAfter the company was taken over by a Spanish company in 1971, it was bought by Stuart Weitzman in 1994. Over the years, and following a series of takeovers, the company has grown considerably to become one of the Tapestry group's luxury brands.\nThe brand was purchased by Coach in 2015 for $574 million. It was made to broaden Coach's product line. In February of 2025 Coach began negotiations with Calares Inc. to sell the brand. The sale was completed August 4, 2025.\n\nTapestry, Inc.\nThe business originally named Coach changed its name to Tapestry to better represent its broader product range when it expanded beyond Coach-brand handbags. The company officially changed its name and ticker symbol on the New York Stock Exchange from COH to TPR on October 31, 2017. Most of these products are accessories, such as handbags, key-chains, shoes and other small fashion items. Most of these items are leather goods and are produced by the individual subsidiaries.\nIn late July, 2020, the company named Joanne Crevoiserat, Tapestry's CFO since early 2019, the new CEO. She became the 36th female to lead a Fortune 500 company.\n\nAttempted acquisition of Capri Holdings\nTapestry announced it would acquire Capri Holdings in August 2023 for $8.5 billion. Capri owns the brands Versace, Michael Kors, and Jimmy Choo. The U.S. Federal Trade Commission sued to block the acquisition in April 2024 citing reduced competition between their brands, like Coach and Michael Kors, in the affordable luxury handbag market. It was also concerned that the deal would negatively impact hiring of workers and their wages. The merger was blocked on 24 October 2024. Tapestry and Capri committed to appealing the decision, but called off the merger the following month citing the regulatory hurdles.\nFourth quarter earnings in 2025, according to Barron’s, showed that Tapestry had boosted both sales and revenue of the Coach brand.\n\nLeadership\nVictor Luis began working with the company as the CEO of the Japanese subsidiary. He then worked in China. He rose to serve as Tapestry's International CEO, and then CEO of Tapestry, Inc.   In September 2019, Tapestry Inc. replaced Luis as CEO, announcing he would leave immediately and be succeeded by board Chairman Jide Zeitlin, a former Goldman Sachs executive who has been on the board since 2006. Jide J. Zeitlin was appointed chief executive officer (CEO) of Tapestry in September 2019. In this role, Jide was responsible for the execution of the company's strategic agenda and financial performance. Mr. Zeitlin was elected to Tapestry's board of directors in June 2006 and served as the chairman of the board from November 2014 until his resignation in July 2020 after accusations of personal misconduct. Tapestry announced in April 2021 that VF Corp. executive Scott Roe would be succeeding Andrea Shaw Resnick as CFO.\n\nControversy\nIn July 2020, Tapestry CEO Jide Zeitlin resigned from his positions as CEO and chairman amidst an investigation into his personal behavior. Previously, a woman had accused him of luring her into a romantic relationship in 2007 by pretending to be a photographer.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Tapestry, Inc.:",
  "clean_text": "Tapestry, Inc. is an American multinational fashion holding company. It is based in New York City and is the parent company of two major brands: Coach New York and Kate Spade New York. Originally named Coach, Inc., the business changed its name to Tapestry on October 31, 2017. History Coach New York Coach was founded in 1941. Starting as a workshop, it grew into a company with over 17,000 employees when its founders Miles Cahn and Lillian Cahn took over. Seeking wider recognition and a larger market, the company acquired brands such as Kate Spade and Stuart Weitzman. This broadened the appeal to consumers of all three brands. The company changed names, reducing the share price because investors felt that the name change was not well received by customers. The share price later recovered. Kate Spade New York American fashion designer Kate Spade founded Kate Spade New York in 1993. It was initially similar to the Coach company. The company was purchased by Coach in 2017 in a $2.4 billion deal. Stuart Weitzman Stuart Weitzman (born 1941) began working in the early 1960s for Seymour Shoes, a company set up by his father Seymour Weitzman and his older brother Warren in Haverhill, Massachusetts in the late 1950s. After the company was taken over by a Spanish company in 1971, it was bought by Stuart Weitzman in 1994. Over the years, and following a series of takeovers, the company has grown considerably to become one of the Tapestry group's luxury brands. The brand was purchased by Coach in 2015 for $574 million. It was made to broaden Coach's product line. In February of 2025 Coach began negotiations with Calares Inc. to sell the brand. The sale was completed August 4, 2025. Tapestry, Inc. The business originally named Coach changed its name to Tapestry to better represent its broader product range when it expanded beyond Coach-brand handbags. The company officially changed its name and ticker symbol on the New York Stock Exchange from COH to TPR on October 31, 2017. Most of these products are accessories, such as handbags, key-chains, shoes and other small fashion items. Most of these items are leather goods and are produced by the individual subsidiaries. In late July, 2020, the company named Joanne Crevoiserat, Tapestry's CFO since early 2019, the new CEO. She became the 36th female to lead a Fortune 500 company. Attempted acquisition of Capri Holdings Tapestry announced it would acquire Capri Holdings in August 2023 for $8.5 billion. Capri owns the brands Versace, Michael Kors, and Jimmy Choo. The U.S. Federal Trade Commission sued to block the acquisition in April 2024 citing reduced competition between their brands, like Coach and Michael Kors, in the affordable luxury handbag market. It was also concerned that the deal would negatively impact hiring of workers and their wages. The merger was blocked on 24 October 2024. Tapestry and Capri committed to appealing the decision, but called off the merger the following month citing the regulatory hurdles. Fourth quarter earnings in 2025, according to Barron’s, showed that Tapestry had boosted both sales and revenue of the Coach brand. Leadership Victor Luis began working with the company as the CEO of the Japanese subsidiary. He then worked in China. He rose to serve as Tapestry's International CEO, and then CEO of Tapestry, Inc. In September 2019, Tapestry Inc. replaced Luis as CEO, announcing he would leave immediately and be succeeded by board Chairman Jide Zeitlin, a former Goldman Sachs executive who has been on the board since 2006. Jide J. Zeitlin was appointed chief executive officer (CEO) of Tapestry in September 2019. In this role, Jide was responsible for the execution of the company's strategic agenda and financial performance. Mr. Zeitlin was elected to Tapestry's board of directors in June 2006 and served as the chairman of the board from November 2014 until his resignation in July 2020 after accusations of personal misconduct. Tapestry announced in April 2021 that VF Corp. executive Scott Roe would be succeeding Andrea Shaw Resnick as CFO. Controversy In July 2020, Tapestry CEO Jide Zeitlin resigned from his positions as CEO and chairman amidst an investigation into his personal behavior. Previously, a woman had accused him of luring her into a romantic relationship in 2007 by pretending to be a photographer."
}