{
  "ticker": "TRGP",
  "cik": "0001389170",
  "company_name": "Targa Resources",
  "corrected_name": "Targa Resources",
  "wiki_title_used": "Targa Resources",
  "exists": true,
  "raw_text": "Targa Resources Corp. is a Fortune 500 company based in Houston, Texas. Targa, a midstream energy infrastructure corporation, is one of the largest infrastructure companies delivering natural gas and natural gas liquids in the United States. Their operations are based largely, though not entirely, on the Gulf Coast, particularly in Texas and Louisiana. Matthew J. Meloy has been Chief Executive Officer since 2020.\n\nHistory and Acquisitions\nTarga Resources was founded on October 27, 2005, and is headquartered in Houston, Texas.\nIn 2015, Targa Resources acquired Oklahoma-based Atlas Pipeline Partners LP and Atlas Energy LP. In 2017, Targa acquired Outrigger Delaware Operating, LLC, Outrigger Southern Delaware Operating, LLC and Outrigger Midland Operating, LLC.\nIn 2022, Targa acquired Southcross Energy Operating LLC for $200 million.\nAlso that year, Targa announced plans to add a new 275 million cubic feet-per-day gas processing plant in the Midland Basin portion of the Permian Basin by the fourth quarter of 2023, in addition to the four plants it was already busy constructing in the region to service rising associated gas production in the region.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Targa Resources Corp.:",
  "clean_text": "Targa Resources Corp. is a Fortune 500 company based in Houston, Texas. Targa, a midstream energy infrastructure corporation, is one of the largest infrastructure companies delivering natural gas and natural gas liquids in the United States. Their operations are based largely, though not entirely, on the Gulf Coast, particularly in Texas and Louisiana. Matthew J. Meloy has been Chief Executive Officer since 2020. History and Acquisitions Targa Resources was founded on October 27, 2005, and is headquartered in Houston, Texas. In 2015, Targa Resources acquired Oklahoma-based Atlas Pipeline Partners LP and Atlas Energy LP. In 2017, Targa acquired Outrigger Delaware Operating, LLC, Outrigger Southern Delaware Operating, LLC and Outrigger Midland Operating, LLC. In 2022, Targa acquired Southcross Energy Operating LLC for $200 million. Also that year, Targa announced plans to add a new 275 million cubic feet-per-day gas processing plant in the Midland Basin portion of the Permian Basin by the fourth quarter of 2023, in addition to the four plants it was already busy constructing in the region to service rising associated gas production in the region."
}