{
  "ticker": "TRMB",
  "cik": "0000864749",
  "company_name": "Trimble Inc.",
  "corrected_name": "Trimble Inc.",
  "wiki_title_used": "Trimble Inc.",
  "exists": true,
  "raw_text": "Trimble Inc. is an American software, hardware, and services technology company. Trimble also develops hardware for Vehicle tracking systems including global navigation satellite system (GNSS) receivers, scanners, total stations, laser rangefinders, unmanned aerial vehicles (UAVs), inertial navigation systems and software processing tools.\n\nHistory\nTrimble Navigation was founded in November 1978 by Charles Trimble and two partners from Hewlett-Packard. It initially operated above a movie theatre in Los Altos, California.\nin 1991, Trimble started offering new surveying and mapping software products, with the acquisition of a New Zealand company, Datacom Software Research Ltd. \nIn 2002, Caterpillar and Trimble formed a joint venture, Caterpillar Trimble Control Technologies (CTCT), to develop machine control products for improved customer productivity and lower costs on earthmoving projects. In 2003, Trimble acquired 3D Laser Scanning company MENSI. \nTrimble acquired the 3D modeling software package SketchUp from Google in 2012; prior to the acqusition, Google acquired @Last Software, another company based in Colorado, in 2006. That same year, it acquired TMW Systems, a provider of Fleet management software. In 2016, it acquired Sefaira (sustainability analysis software including energy modeling and daylight visualization).\nThe company changed its name from Trimble Navigation Limited to Trimble Inc.; the name change and change in legal domicile became effective October 1, 2016. Later that month, Trimble divested its UAV manufacturing business to France-based Delair.\nOn April 23, 2018, Trimble agreed to acquire privately held Viewpoint from investment firm Bain Capital in an all-cash transaction of US$1.2bn, with an expected completion in Q3 of 2018.\nOn October 30, 2019, Trimble announced that its board of directors had unanimously elected Robert G. Painter as president and CEO of Trimble, effective January 4, 2020. Painter joined the Trimble Board of Directors on January 4, 2020 as well.\nIn November 2020, the firm signed an agreement with Boston Dynamics to further develop the Spot dog product.\nOn October 6, 2022, Trimble announced its headquarters had relocated to Westminster, Colorado, from Sunnyvale, California. \nOn September 28, 2023, AGCO announced that it would acquire an 85% stake in Trimble's agriculture business as a part of a new Joint Venture.\nIn May 2024, Trimble acquired Flashtract, a company specialized in payment, compliance, and documentation exchange.\n\nReferences\nExternal links\nBusiness data for Trimble Inc.:",
  "clean_text": "Trimble Inc. is an American software, hardware, and services technology company. Trimble also develops hardware for Vehicle tracking systems including global navigation satellite system (GNSS) receivers, scanners, total stations, laser rangefinders, unmanned aerial vehicles (UAVs), inertial navigation systems and software processing tools. History Trimble Navigation was founded in November 1978 by Charles Trimble and two partners from Hewlett-Packard. It initially operated above a movie theatre in Los Altos, California. in 1991, Trimble started offering new surveying and mapping software products, with the acquisition of a New Zealand company, Datacom Software Research Ltd. In 2002, Caterpillar and Trimble formed a joint venture, Caterpillar Trimble Control Technologies (CTCT), to develop machine control products for improved customer productivity and lower costs on earthmoving projects. In 2003, Trimble acquired 3D Laser Scanning company MENSI. Trimble acquired the 3D modeling software package SketchUp from Google in 2012; prior to the acqusition, Google acquired @Last Software, another company based in Colorado, in 2006. That same year, it acquired TMW Systems, a provider of Fleet management software. In 2016, it acquired Sefaira (sustainability analysis software including energy modeling and daylight visualization). The company changed its name from Trimble Navigation Limited to Trimble Inc.; the name change and change in legal domicile became effective October 1, 2016. Later that month, Trimble divested its UAV manufacturing business to France-based Delair. On April 23, 2018, Trimble agreed to acquire privately held Viewpoint from investment firm Bain Capital in an all-cash transaction of US$1.2bn, with an expected completion in Q3 of 2018. On October 30, 2019, Trimble announced that its board of directors had unanimously elected Robert G. Painter as president and CEO of Trimble, effective January 4, 2020. Painter joined the Trimble Board of Directors on January 4, 2020 as well. In November 2020, the firm signed an agreement with Boston Dynamics to further develop the Spot dog product. On October 6, 2022, Trimble announced its headquarters had relocated to Westminster, Colorado, from Sunnyvale, California. On September 28, 2023, AGCO announced that it would acquire an 85% stake in Trimble's agriculture business as a part of a new Joint Venture. In May 2024, Trimble acquired Flashtract, a company specialized in payment, compliance, and documentation exchange."
}