{
  "ticker": "TROW",
  "cik": "0001113169",
  "company_name": "T. Rowe Price",
  "corrected_name": "T. Rowe Price",
  "wiki_title_used": "T. Rowe Price",
  "exists": true,
  "raw_text": "T. Rowe Price Group, Inc. is an American publicly owned global investment management firm that offers funds, subadvisory services, separate account management, and retirement plans and services for individuals, institutions, and financial intermediaries. The firm has assets under management of more than $1.51 trillion and annual revenues of $6.48 billion as of 2023, placing it 537 on the Fortune 1000 list of the largest U.S. companies. Headquartered at 100 East Pratt Street in Baltimore, Maryland, it has 7,868 employees across 17 international offices serving clients in 55 countries.\nThe firm was founded in 1937 by Thomas Rowe Price Jr. who is best known for developing the growth stock philosophy of investing. As of 2019, the company is focused on active management after strategically deciding against a major initiative in passive investment.\nConsistently ranked among the world's top asset managers, T. Rowe Price was named one of the best places to work in money management by Pensions & Investments and was one of Fortune' most admired companies in 2020. Listed on Nasdaq under the stock ticker TROW since 1986, T. Rowe Price is a component of the Nasdaq Financial-100 and S&P 500 indices.\n\nBusiness philosophy\nThomas Rowe Price Jr. started in finance in the 1920s as an entry-level researcher and account manager at Baltimore-area brokerages, but disliked the operating models of sales-oriented firms at the time. When he founded T. Rowe Price & Associates in 1937, his firm diverged from the norm in three major ways: charging fees based on assets under management rather than sales volume, actively managing his clients' accounts strictly as a fiduciary, and investing in growth stocks instead of value stocks. He became well known as the \"father of growth investing\" and was nicknamed the \"Sage of Baltimore\" by Forbes.\n\nHistory\n1937–1986\nThomas Rowe Price, Jr. founded T. Rowe Price & Associates in Baltimore in 1937. The firm was originally headquartered at 10 Light Street and staffed by a small pool of associates, many of whom left Legg Mason's precursor, MacKubin, Legg and Co., along with Price. Initially a very small firm focused on wealth management, and private investment accounts for Baltimore-area families, the company struggled during the Great Depression and World War II before gaining solid footing at the end of the 1940s. By 1950, its clientele grew too large for the staff to manage accounts individually, so the firm incorporated and launched its first mutual fund, the T. Rowe Price Growth Stock Fund.\nGaining traction in Baltimore and along the U.S. eastern seaboard, the firm continued a steady expansion of clientele, staff, and geographic reach. By 1960, Price opened a second fund, named the New Horizons Fund, focused on growth investment opportunities, and especially technology firms like Xerox, IBM, and Boeing. In need of more room, the headquarters were moved in 1962 to the new One Charles Center building designed by Ludwig Mies van der Rohe nearby in downtown Baltimore. At the same time, Price began to prepare for retirement, resigning as president of the firm in 1963, delegating some responsibilities, and selling his shares in the company. Despite this, Price maintained an active presence in the firm for several years and urged the opening of the New Era Fund in 1969 as a response to the rapid inflation he predicted would dominate the 1970s. In 1971, the year Price completely retired, T. Rowe Price opened its Fixed Income Division, and began to modernize and diversify its operations.\nIn the 1970s and early 1980s, T. Rowe Price kicked off more assertive growth than before, moving to its current location at 100 East Pratt Street and opening its first international office. In 1979, T. Rowe Price launched a joint venture with British asset manager Robert Fleming & Co. named Rowe Price-Fleming International. The venture, which managed $39 billion at its height in 2000, allowed T. Rowe Price to offer a broader range of services and expertise internationally.\n\n1986–2010\nT. Rowe Price held its initial public offering, valued at nearly $200 million, in 1986. Shortly thereafter, the firm began establishing larger office complexes in the U.S. and research offices around the world, beginning with a Hong Kong office in 1987. Retirement Plan Services were launched in the 1990s alongside additional new services and funds, including mutual funds acquired from other companies such as USF&G. This momentum, and the firm reaching $100 billion assets under management, pushed T. Rowe Price to create an asset management partnership with Sumitomo Bank and Daiwa Securities in Tokyo in 1999, and to purchase 100% interest of the London-based Rowe Price-Fleming International, which was renamed T. Rowe Price International. Also in 1999, T. Rowe Price was added to the S&P 500 Index.\nT. Rowe Price largely avoided the dot-com bubble of 2000. The Wall Street Journal expressed surprise at the firm's moderation with avoiding concentrated holdings in trendy internet technology stocks, in an article published a week before the markets began to crash in March 2000. \nIn 2001, the company launched T. Rowe Price Funds SICAV, domiciled in Luxembourg, for non-U.S. institutional investors and financial intermediaries. Two years later it created target-date retirement funds. In 2010, T. Rowe Price bought a significant interest in Unit Trust of India, India's oldest mutual fund company and one of its five largest. Since 2000, T. Rowe Price has opened global offices in locations ranging from Madrid and Dubai to Stockholm and Sydney.\n\n2010–present\nAs of 2019, T. Rowe Price has continued to focus on active management rather than passive management. Since 2010, T. Rowe Price increased its assets under management from $400 billion to $1.73 trillion and annual revenues increased more than 10 percent to $6.48 billion, placing it 537 on the Fortune 1000 list of the largest U.S. companies.\n\nBranding and sponsorships\nT. Rowe Price's corporate logo since 1983 is a bighorn sheep affectionately known within the firm as Trusty. The firm explained its symbol, \"Known for its sure-footed agility and sharp vision, the bighorn sheep's ability to navigate challenging terrain with purpose and independence is an apt reflection of T. Rowe Price's mission and positioning.\"\nThe firm was announced as the first-ever jersey sponsor of the Baltimore Orioles on June 10, 2024. A circular dark blue, aqua and white sleeve patch with Trusty on it debuted in a home game against the Atlanta Braves the following night on June 11.\n\nAwards and recognition\n2017 Ranked one of the World's Most Admired Companies by Fortune\n2016 Top Companies for Women Technologists by the Anita Borg Institute Leadership Index\n2015 P&I Best Places to Work in Money Management by Pension&Investments\n2015 Best Employers for Healthy Lifestyle by the National Business Group on Health\n\nNotable people\nBoard of directors\nGlenn August, Founder and CEO of Oak Hill Advisors, L.P.\nMark S. Bartlett, Former Managing Partner of Ernst & Young\nWilliam P. Donnelly, Former Executive Vice President of Mettler-Toledo\nDina Dublon, Former Vice President and Chief Financial Officer of JPMorgan Chase & Co.\nRobert F. MacLellan, Chairman of Northleaf Capital Partners\nEileen Rominger, Former Senior Advisor of CamberView Partners\nRob Sharps, President, and CEO of T. Rowe Price\nCynthia Smith, Senior Vice President, Regional Business and Distribution Development of MetLife\nRobert J. Stevens, Former Chairman and CEO of Lockheed Martin\nSandra S. Wijnberg, Executive Adviser at Aquiline Capital Partners LLC\nAlan D. Wilson, Former President of McCormick & Company\n\nOthers\nEddie C. Brown, former portfolio manager at T. Rowe Price, Founder and President of Brown Capital Management, and noted philanthropist\nAbby Joseph Cohen, former research director at T. Rowe Price, named Institutional Investor's top strategist in the late 1990s.\nRoger McNamee, former manager of the T. Rowe Price Science & Technology Fund who since founded the venture capital firm Elevation Partners\nMary J. Miller, former director of the firm's Fixed Income Division who left to work for the U.S. Department of the Treasury, becoming Assistant Secretary of the Treasury for Financial Markets, then Under Secretary of the Treasury for Domestic Finance, and finally the Deputy Secretary of the Treasury.\nOlympia Snowe, former board member of T. Rowe Price and former US Senator and founder of Olympia Snowe LLC\nAlfred Sommer, former board member of T. Rowe Price and noted epidemiologist at the Johns Hopkins Bloomberg School of Public Health\nRichard Verma, former board member of T. Rowe Price and former U.S. Ambassador to India, Vice Chairman and Partner of The Asia Group\n\nReferences\nExternal links\nBusiness data for T. Rowe Price:",
  "clean_text": "T. Rowe Price Group, Inc. is an American publicly owned global investment management firm that offers funds, subadvisory services, separate account management, and retirement plans and services for individuals, institutions, and financial intermediaries. The firm has assets under management of more than $1.51 trillion and annual revenues of $6.48 billion as of 2023, placing it 537 on the Fortune 1000 list of the largest U.S. companies. Headquartered at 100 East Pratt Street in Baltimore, Maryland, it has 7,868 employees across 17 international offices serving clients in 55 countries. The firm was founded in 1937 by Thomas Rowe Price Jr. who is best known for developing the growth stock philosophy of investing. As of 2019, the company is focused on active management after strategically deciding against a major initiative in passive investment. Consistently ranked among the world's top asset managers, T. Rowe Price was named one of the best places to work in money management by Pensions & Investments and was one of Fortune' most admired companies in 2020. Listed on Nasdaq under the stock ticker TROW since 1986, T. Rowe Price is a component of the Nasdaq Financial-100 and S&P 500 indices. Business philosophy Thomas Rowe Price Jr. started in finance in the 1920s as an entry-level researcher and account manager at Baltimore-area brokerages, but disliked the operating models of sales-oriented firms at the time. When he founded T. Rowe Price & Associates in 1937, his firm diverged from the norm in three major ways: charging fees based on assets under management rather than sales volume, actively managing his clients' accounts strictly as a fiduciary, and investing in growth stocks instead of value stocks. He became well known as the \"father of growth investing\" and was nicknamed the \"Sage of Baltimore\" by Forbes. History 1937–1986 Thomas Rowe Price, Jr. founded T. Rowe Price & Associates in Baltimore in 1937. The firm was originally headquartered at 10 Light Street and staffed by a small pool of associates, many of whom left Legg Mason's precursor, MacKubin, Legg and Co., along with Price. Initially a very small firm focused on wealth management, and private investment accounts for Baltimore-area families, the company struggled during the Great Depression and World War II before gaining solid footing at the end of the 1940s. By 1950, its clientele grew too large for the staff to manage accounts individually, so the firm incorporated and launched its first mutual fund, the T. Rowe Price Growth Stock Fund. Gaining traction in Baltimore and along the U.S. eastern seaboard, the firm continued a steady expansion of clientele, staff, and geographic reach. By 1960, Price opened a second fund, named the New Horizons Fund, focused on growth investment opportunities, and especially technology firms like Xerox, IBM, and Boeing. In need of more room, the headquarters were moved in 1962 to the new One Charles Center building designed by Ludwig Mies van der Rohe nearby in downtown Baltimore. At the same time, Price began to prepare for retirement, resigning as president of the firm in 1963, delegating some responsibilities, and selling his shares in the company. Despite this, Price maintained an active presence in the firm for several years and urged the opening of the New Era Fund in 1969 as a response to the rapid inflation he predicted would dominate the 1970s. In 1971, the year Price completely retired, T. Rowe Price opened its Fixed Income Division, and began to modernize and diversify its operations. In the 1970s and early 1980s, T. Rowe Price kicked off more assertive growth than before, moving to its current location at 100 East Pratt Street and opening its first international office. In 1979, T. Rowe Price launched a joint venture with British asset manager Robert Fleming & Co. named Rowe Price-Fleming International. The venture, which managed $39 billion at its height in 2000, allowed T. Rowe Price to offer a broader range of services and expertise internationally. 1986–2010 T. Rowe Price held its initial public offering, valued at nearly $200 million, in 1986. Shortly thereafter, the firm began establishing larger office complexes in the U.S. and research offices around the world, beginning with a Hong Kong office in 1987. Retirement Plan Services were launched in the 1990s alongside additional new services and funds, including mutual funds acquired from other companies such as USF&G. This momentum, and the firm reaching $100 billion assets under management, pushed T. Rowe Price to create an asset management partnership with Sumitomo Bank and Daiwa Securities in Tokyo in 1999, and to purchase 100% interest of the London-based Rowe Price-Fleming International, which was renamed T. Rowe Price International. Also in 1999, T. Rowe Price was added to the S&P 500 Index. T. Rowe Price largely avoided the dot-com bubble of 2000. The Wall Street Journal expressed surprise at the firm's moderation with avoiding concentrated holdings in trendy internet technology stocks, in an article published a week before the markets began to crash in March 2000. In 2001, the company launched T. Rowe Price Funds SICAV, domiciled in Luxembourg, for non-U.S. institutional investors and financial intermediaries. Two years later it created target-date retirement funds. In 2010, T. Rowe Price bought a significant interest in Unit Trust of India, India's oldest mutual fund company and one of its five largest. Since 2000, T. Rowe Price has opened global offices in locations ranging from Madrid and Dubai to Stockholm and Sydney. 2010–present As of 2019, T. Rowe Price has continued to focus on active management rather than passive management. Since 2010, T. Rowe Price increased its assets under management from $400 billion to $1.73 trillion and annual revenues increased more than 10 percent to $6.48 billion, placing it 537 on the Fortune 1000 list of the largest U.S. companies. Branding and sponsorships T. Rowe Price's corporate logo since 1983 is a bighorn sheep affectionately known within the firm as Trusty. The firm explained its symbol, \"Known for its sure-footed agility and sharp vision, the bighorn sheep's ability to navigate challenging terrain with purpose and independence is an apt reflection of T. Rowe Price's mission and positioning.\" The firm was announced as the first-ever jersey sponsor of the Baltimore Orioles on June 10, 2024. A circular dark blue, aqua and white sleeve patch with Trusty on it debuted in a home game against the Atlanta Braves the following night on June 11. Awards and recognition 2017 Ranked one of the World's Most Admired Companies by Fortune 2016 Top Companies for Women Technologists by the Anita Borg Institute Leadership Index 2015 P&I Best Places to Work in Money Management by Pension&Investments 2015 Best Employers for Healthy Lifestyle by the National Business Group on Health Notable people Board of directors Glenn August, Founder and CEO of Oak Hill Advisors, L.P. Mark S. Bartlett, Former Managing Partner of Ernst & Young William P. Donnelly, Former Executive Vice President of Mettler-Toledo Dina Dublon, Former Vice President and Chief Financial Officer of JPMorgan Chase & Co. Robert F. MacLellan, Chairman of Northleaf Capital Partners Eileen Rominger, Former Senior Advisor of CamberView Partners Rob Sharps, President, and CEO of T. Rowe Price Cynthia Smith, Senior Vice President, Regional Business and Distribution Development of MetLife Robert J. Stevens, Former Chairman and CEO of Lockheed Martin Sandra S. Wijnberg, Executive Adviser at Aquiline Capital Partners LLC Alan D. Wilson, Former President of McCormick & Company Others Eddie C. Brown, former portfolio manager at T. Rowe Price, Founder and President of Brown Capital Management, and noted philanthropist Abby Joseph Cohen, former research director at T. Rowe Price, named Institutional Investor's top strategist in the late 1990s. Roger McNamee, former manager of the T. Rowe Price Science & Technology Fund who since founded the venture capital firm Elevation Partners Mary J. Miller, former director of the firm's Fixed Income Division who left to work for the U.S. Department of the Treasury, becoming Assistant Secretary of the Treasury for Financial Markets, then Under Secretary of the Treasury for Domestic Finance, and finally the Deputy Secretary of the Treasury. Olympia Snowe, former board member of T. Rowe Price and former US Senator and founder of Olympia Snowe LLC Alfred Sommer, former board member of T. Rowe Price and noted epidemiologist at the Johns Hopkins Bloomberg School of Public Health Richard Verma, former board member of T. Rowe Price and former U.S. Ambassador to India, Vice Chairman and Partner of The Asia Group"
}