{
  "ticker": "TRV",
  "cik": "0000086312",
  "company_name": "Travelers Companies (The)",
  "corrected_name": "The Travelers Companies",
  "wiki_title_used": "The Travelers Companies",
  "exists": true,
  "raw_text": "The Travelers Companies, Inc., commonly known as Travelers, is an American multinational insurance company. It is the second-largest writer of U.S. commercial property casualty insurance, and the sixth-largest writer of U.S. personal insurance through independent agents. Travelers is incorporated in Minnesota, with headquarters in New York City, and its largest office in Hartford, Connecticut. It has been a component of the Dow Jones Industrial Average since June 8, 2009.\nThe company has field offices in every U.S. state, plus operations in the United Kingdom, Ireland, Singapore, China, Canada, and Brazil. Travelers ranked No. 98 in the 2021 Fortune 500 list of the largest United States corporations with total revenue of $32 billion.\n\nHistory\nThe main predecessor companies of The Travelers Companies, Inc. are The St. Paul Companies, Inc. and Travelers Property Casualty Corporation.\nSaint Paul Fire and Marine Insurance Co. was founded March 5, 1853, in Saint Paul, Minnesota, to serve local customers in lieu of waiting for claim payments from insurance companies on the east coast. It barely survived the Panic of 1857 by dramatically paring down its operations and later reorganizing itself into a stock company (as opposed to a mutual company). It then spread its operations across the country.\nIn 1998 it acquired USF&G, known formerly as United States Fidelity and Guaranty Company, an insurance company based in Baltimore, Maryland, for $3.9 billion in stock and assumed debt. By buying USF&G, it went from the 13th to the eighth largest property and casualty insurance company in the United States. Through economies of scale between the two companies, and a difficult business environment, it downsized the company substantially over the coming years by selling certain business units to focus on more profitable business units.\nThe Travelers Insurance Company was founded in Hartford by James G. Batterson, a stone contractor who became aware for the first time of accident insurance for travelers (i.e., an early form of travel insurance) while traveling in England in 1859 from Leamington to London. His railway ticket included accidental death insurance coverage up to the amount of £1,000, and lesser indemnities for non-fatal injuries. Batterson visited the London and Paris offices of European insurers to learn about the accident insurance business, then went home to Hartford and raised $500,000 in capital to launch a company to provide accident insurance to American travelers.\nTravelers obtained its official state charter on June 17, 1863.  The company did not issue its first regular insurance policy until April 5, 1864, but informally entered into its first insurance agreement a month earlier.  On March 1, 1864, local banker James Bolter jokingly inquired of Batterson how much it would cost to insure him up to $5,000 for accidental death for the journey from the post office to his home.  Batterson replied, \"Two cents,\" which Bolter promptly tendered; those coins have been kept by Travelers ever since.  \nTravelers's original state charter only authorized the company to insure travelers \"against loss of life or personal injury while journeying by railway or steamboat\". Within a year, this was amended to allow for insurance against accidents of all kinds, and then life insurance was added the next year. The company later expanded into many other lines of insurance. \nTravelers's official launch in 1864 touched off a short-lived craze for travel insurance; approximately 70 competitors were founded during the next few months and competition was ferocious.  Travelers eventually acquired and absorbed all of them. \nOne problem with starting in travel insurance is that it was a tiny and novel niche product in the nineteenth century.  Most people either did not travel or did not travel often, at a time when the news media was full of frightening stories of rail and steamship accidents.  From its founding, Travelers attempted to expand its coverage beyond travel to cover other types of accidents. To sell its strange new kind of insurance, Travelers advertised heavily in popular publications like Harper's Weekly and published its own magazine, The Travelers Record, to share stories of policyholders whose claims had been promptly paid.  Although Travelers became the industry leader, accident insurance remained a niche product during the 19th century in comparison to more established products like life insurance. For example, Travelers reported that it had grown from writing about 10,000 policies in 1865 to about 77,000 in 1889, but American life insurers in 1889 wrote just under 4 million policies. \nThe original company logo was a knight's suit of armor.  The red umbrella first appeared in Travelers advertising as early as 1870, but at that time was not yet the official logo.  The company changed its official logo from a suit of armor to the Travelers Tower in 1920, and then replaced that with the red umbrella in 1959.\nDuring the 20th century, Travelers was responsible for many insurance industry firsts, including the first automobile policy (1897), the first air travel policy (1919), and the first space travel policy (late 1960s, for astronauts in the Apollo program).  In 1954, the company established the world's first privately owned weather research facility, the Travelers Weather Research Center, the first organization to make weather predictions using probabilities (\"20% chance of rain\").\nBy the early 1990s, Travelers was predominantly a general property and casualty insurer that also happened to do some travel insurance on the side, and in February 1994, Travelers quietly exited its original travel insurance business by selling the unit to a retiring Travelers executive.  The resulting company is now known as Travel Insured International, a Crum and Forster Company.\n\nIn the 1990s, Travelers went through a series of mergers and acquisitions. It was bought by Primerica in December 1993, but the resulting company retained the Travelers name. In 1995, it became The Travelers Group. It bought Aetna's property and casualty business in 1996.\nIn April 1998, the Travelers Group merged with Citicorp to form Citigroup. However, the synergies between the banking and insurance arms of the company did not work as well as planned, so Citigroup spun off Travelers Property and Casualty into a subsidiary company in 2002, although it kept the red umbrella logo. Three years later, Citigroup sold Travelers Life & Annuity to MetLife. In 2003, Travelers bought renewal rights for Royal & SunAlliance Personal Insurance and Commercial businesses.\nIn 2004, the St. Paul and Travelers Companies merged and renamed itself St. Paul Travelers, with its headquarters set in St. Paul, Minnesota. In August of that year, it was charged with making misleading statements in connection with the merger. Despite many assurances from CEO Jay Fishman that the newly formed company would retain the St. Paul name, the corporate name only lasted until 2007, when the company repurchased the rights to the famous red umbrella logo from Citigroup and readopted it as its main corporate symbol, while also changing the corporate name to The Travelers Companies.  In 2009, Travelers designated its New York City office as its headquarters for legal purposes, but as a practical matter, the company considers its \"executive offices\" to be New York City, Hartford, and St. Paul, of which Hartford is by far the largest.\nMany of Travelers' ancestor companies, such as St. Paul and USF&G, are technically still around today, and still write policies and accept claims in their own names (under the overarching Travelers brand name). As is typical of most insurers in the United States, Travelers never dissolved the various companies it acquired, but simply made them wholly owned subsidiaries and trained its employees to act on behalf of those subsidiaries. This is a common risk management strategy used by U.S. insurance groups. If any one company in the group gets hit with too many claims, the situation can be easily contained to that one company (which is placed in runoff and allowed to run its policies to completion), while the remainder of the group continues to operate normally.\nIn November 2010, Travelers entered into a joint venture agreement under which the company would invest in J. Malucelli Participações em Seguros e Resseguros S.A., the market leader in the surety insurance business in Brazil. The transaction closed in June 2011 with Travelers acquiring a 43.4 percent interest. Travelers' investment in newly issued shares significantly increased J. Malucelli's capital level, positioning it for substantial growth in Brazil. At the time, Travelers had the option to increase its investment to retain a 49.5 percent interest, which the company later did in 2012.\nIn June 2013, Travelers announced the acquisition of Dominion of Canada General Insurance Company from E-L Financial Corporation Limited (TSX: ELF). The transaction later closed in November 2013. The combined organization, referred to as Travelers Canada, remains headquartered in Toronto.\nThe company's joint venture with J. Malucelli in Brazil completed the acquisition of a majority interest in Cardinal Compañía de Seguros, a Colombian start-up surety provider in September 2015. The business, which is based in Bogotá, operates under the co-branded name J. Malucelli Travelers.\n\nIn October 2015, Travelers acquired a majority interest in the property casualty business of its J. Malucelli joint venture in Brazil. J. Malucelli commenced writing property casualty business in 2012. The property casualty business operates under the Travelers brand and focuses on property, general liability, construction and financial insurance products. The business is based in São Paulo.As a result of the transaction, Travelers now owns 95 percent of the property casualty business with Paraná Banco, the parent company of J. Malucelli, retaining a five percent interest. Travelers' interest in the surety business of the J. Malucelli joint venture remains at 49.5 percent.\nIn March 2017, Travelers agreed to acquire UK-based Simply Business from Aquiline Capital Partners for approximately $490 million. Simply Business is a leading U.K. distributor of small business insurance policies, offering products online on behalf of a broad panel of carriers. It has more than 425,000 microbusiness customers covering more than 1,000 classes of business, and was named \"Best Company to Work For\" by The Sunday Times in 2015 and 2016. The transaction adds to Travelers' digital capabilities.\nIn 2018, Travelers ranked 106 on the Fortune 500 list of largest U.S. companies. On June 8, 2009, Travelers replaced its former parent Citigroup on the Dow Jones Industrial Average.\nOn August 4, 2015, the company announced that Alan Schnitzer would succeed Jay Fishman as chief executive officer effective December 1, 2015.\nOn August 4, 2017, Travelers completed its previously announced acquisition of Simply Business, a leading provider of small business insurance policies in the United Kingdom.\nOn August 15, 2018, Travelers acquired the majority stake of Zensurance, a digital business insurance brokerage in Canada.\nOn May 27, 2025, Travellers announced it would sell the Canadian personal insurance business and the majority of the commercial insurance business of Travelers Canada to Economical Insurance for approximately US$2.4 billion.\n\nBusiness model and products\nTravelers provides commercial and personal property and casualty insurance products and services to businesses, government units, associations, and individuals. The company offers insurance through three segments:\n\nPersonal Insurance, which includes home, auto and other insurance products for individuals\nBusiness Insurance, which includes a broad array of property and casualty insurance and insurance-related services in the United States\nBond and Specialty Insurance, which includes surety, crime, and financial liability businesses which primarily use credit-based underwriting processes, as well as property and casualty products that are predominantly marketed on an international basis.\n\nAlleged anticompetitive practices\nIn January 2007, Travelers agreed to pay US$77 million to six states to settle a class action suit and end investigations into its insurance practices. The charges involved paying the insurance broker Marsh & McLennan Companies contingent commissions to win business without the knowledge of clients, thus creating a conflict of interest. Additionally, the investigation examined whether Travelers had created the illusion of competition by submitting fake bids, thus misleading clients into believing they were receiving competitive commercial premiums.\n\nNational Football League lawsuit\nIn August 2012, Travelers sued the National Football League for forcing the company and its subsidiaries to pay to defend the league for failing to protect players from brain injury, in a case filed in the New York State Supreme Court. The league had sued over three dozen insurance companies the week before in an attempt to cover  the claims that players made against the league.\n\nAdvertising\nThe logo of the red umbrella was created in 1870 when it appeared in a newspaper ad for the insurance company. It was revived in the early 1960s, when it was given its signature red color by Harry W. Knettell, then the account executive for The Travelers and Vice President at the Charles Brunelle advertising agency. During the late 1960s Charles Brunelle was the largest advertising agency in Hartford, a city known as \"the insurance capital of the world,\" \"the Hollywood of insurance,\" or \"America's file cabinet\" due to the many insurance companies in that town. The Travelers was one of their many insurance company clients.\nIn 2006, a Travelers commercial titled Snowball was nominated for an Emmy. Snowball featured a man, walking down a steep San Francisco sidewalk, who trips and knocks over a table of items at a garage sale. The man and the items roll down the street, forming a ball which gathers garbage cans, pedestrians, construction materials, motorcycles, light poles, and other items, in a manner very reminiscent of the \"snowball\" effect or the cult video game Katamari Damacy. The creators of the ad said it was simply based on the snowball effect, that they had never heard of the game, and were surprised by the resulting similarity.\nIn 2007, the company secured naming rights for an annual golf event to be called the Travelers Championship golf tournament, formerly the Greater Hartford Open, on the PGA Tour.\nIn April 2008, The Travelers repurchased the rights to the famous red umbrella, which is featured in several commercials starring Paul Freeman as well as other advertisements.  In July 2008, the spot \"Delivery,\" also starring Freeman, was nominated for an Emmy Primetime Emmy Award for Outstanding Commercial.\n\nCurrent and former executives\nEdward Budd, former Travelers Chairman & CEO\nRobert I. Lipp, former Travelers CEO\nJoe Plumeri, former Travelers Vice Chairman, former Chairman & CEO of Willis Group Holdings, and owner of the Trenton Thunder\nSandy Weill, former Travelers Chairman & CEO\nJay S. Fishman, former Travelers Chairman & CEO\nLisa Caputo, Current Chief Marketing & Communications Officer, former press secretary for Hillary Clinton\nAlan Schnitzer, Current President & CEO\n\nReferences\nExternal links\nOfficial website\nBusiness data for The Travelers Companies:",
  "clean_text": "The Travelers Companies, Inc., commonly known as Travelers, is an American multinational insurance company. It is the second-largest writer of U.S. commercial property casualty insurance, and the sixth-largest writer of U.S. personal insurance through independent agents. Travelers is incorporated in Minnesota, with headquarters in New York City, and its largest office in Hartford, Connecticut. It has been a component of the Dow Jones Industrial Average since June 8, 2009. The company has field offices in every U.S. state, plus operations in the United Kingdom, Ireland, Singapore, China, Canada, and Brazil. Travelers ranked No. 98 in the 2021 Fortune 500 list of the largest United States corporations with total revenue of $32 billion. History The main predecessor companies of The Travelers Companies, Inc. are The St. Paul Companies, Inc. and Travelers Property Casualty Corporation. Saint Paul Fire and Marine Insurance Co. was founded March 5, 1853, in Saint Paul, Minnesota, to serve local customers in lieu of waiting for claim payments from insurance companies on the east coast. It barely survived the Panic of 1857 by dramatically paring down its operations and later reorganizing itself into a stock company (as opposed to a mutual company). It then spread its operations across the country. In 1998 it acquired USF&G, known formerly as United States Fidelity and Guaranty Company, an insurance company based in Baltimore, Maryland, for $3.9 billion in stock and assumed debt. By buying USF&G, it went from the 13th to the eighth largest property and casualty insurance company in the United States. Through economies of scale between the two companies, and a difficult business environment, it downsized the company substantially over the coming years by selling certain business units to focus on more profitable business units. The Travelers Insurance Company was founded in Hartford by James G. Batterson, a stone contractor who became aware for the first time of accident insurance for travelers (i.e., an early form of travel insurance) while traveling in England in 1859 from Leamington to London. His railway ticket included accidental death insurance coverage up to the amount of £1,000, and lesser indemnities for non-fatal injuries. Batterson visited the London and Paris offices of European insurers to learn about the accident insurance business, then went home to Hartford and raised $500,000 in capital to launch a company to provide accident insurance to American travelers. Travelers obtained its official state charter on June 17, 1863. The company did not issue its first regular insurance policy until April 5, 1864, but informally entered into its first insurance agreement a month earlier. On March 1, 1864, local banker James Bolter jokingly inquired of Batterson how much it would cost to insure him up to $5,000 for accidental death for the journey from the post office to his home. Batterson replied, \"Two cents,\" which Bolter promptly tendered; those coins have been kept by Travelers ever since. Travelers's original state charter only authorized the company to insure travelers \"against loss of life or personal injury while journeying by railway or steamboat\". Within a year, this was amended to allow for insurance against accidents of all kinds, and then life insurance was added the next year. The company later expanded into many other lines of insurance. Travelers's official launch in 1864 touched off a short-lived craze for travel insurance; approximately 70 competitors were founded during the next few months and competition was ferocious. Travelers eventually acquired and absorbed all of them. One problem with starting in travel insurance is that it was a tiny and novel niche product in the nineteenth century. Most people either did not travel or did not travel often, at a time when the news media was full of frightening stories of rail and steamship accidents. From its founding, Travelers attempted to expand its coverage beyond travel to cover other types of accidents. To sell its strange new kind of insurance, Travelers advertised heavily in popular publications like Harper's Weekly and published its own magazine, The Travelers Record, to share stories of policyholders whose claims had been promptly paid. Although Travelers became the industry leader, accident insurance remained a niche product during the 19th century in comparison to more established products like life insurance. For example, Travelers reported that it had grown from writing about 10,000 policies in 1865 to about 77,000 in 1889, but American life insurers in 1889 wrote just under 4 million policies. The original company logo was a knight's suit of armor. The red umbrella first appeared in Travelers advertising as early as 1870, but at that time was not yet the official logo. The company changed its official logo from a suit of armor to the Travelers Tower in 1920, and then replaced that with the red umbrella in 1959. During the 20th century, Travelers was responsible for many insurance industry firsts, including the first automobile policy (1897), the first air travel policy (1919), and the first space travel policy (late 1960s, for astronauts in the Apollo program). In 1954, the company established the world's first privately owned weather research facility, the Travelers Weather Research Center, the first organization to make weather predictions using probabilities (\"20% chance of rain\"). By the early 1990s, Travelers was predominantly a general property and casualty insurer that also happened to do some travel insurance on the side, and in February 1994, Travelers quietly exited its original travel insurance business by selling the unit to a retiring Travelers executive. The resulting company is now known as Travel Insured International, a Crum and Forster Company. In the 1990s, Travelers went through a series of mergers and acquisitions. It was bought by Primerica in December 1993, but the resulting company retained the Travelers name. In 1995, it became The Travelers Group. It bought Aetna's property and casualty business in 1996. In April 1998, the Travelers Group merged with Citicorp to form Citigroup. However, the synergies between the banking and insurance arms of the company did not work as well as planned, so Citigroup spun off Travelers Property and Casualty into a subsidiary company in 2002, although it kept the red umbrella logo. Three years later, Citigroup sold Travelers Life & Annuity to MetLife. In 2003, Travelers bought renewal rights for Royal & SunAlliance Personal Insurance and Commercial businesses. In 2004, the St. Paul and Travelers Companies merged and renamed itself St. Paul Travelers, with its headquarters set in St. Paul, Minnesota. In August of that year, it was charged with making misleading statements in connection with the merger. Despite many assurances from CEO Jay Fishman that the newly formed company would retain the St. Paul name, the corporate name only lasted until 2007, when the company repurchased the rights to the famous red umbrella logo from Citigroup and readopted it as its main corporate symbol, while also changing the corporate name to The Travelers Companies. In 2009, Travelers designated its New York City office as its headquarters for legal purposes, but as a practical matter, the company considers its \"executive offices\" to be New York City, Hartford, and St. Paul, of which Hartford is by far the largest. Many of Travelers' ancestor companies, such as St. Paul and USF&G, are technically still around today, and still write policies and accept claims in their own names (under the overarching Travelers brand name). As is typical of most insurers in the United States, Travelers never dissolved the various companies it acquired, but simply made them wholly owned subsidiaries and trained its employees to act on behalf of those subsidiaries. This is a common risk management strategy used by U.S. insurance groups. If any one company in the group gets hit with too many claims, the situation can be easily contained to that one company (which is placed in runoff and allowed to run its policies to completion), while the remainder of the group continues to operate normally. In November 2010, Travelers entered into a joint venture agreement under which the company would invest in J. Malucelli Participações em Seguros e Resseguros S.A., the market leader in the surety insurance business in Brazil. The transaction closed in June 2011 with Travelers acquiring a 43.4 percent interest. Travelers' investment in newly issued shares significantly increased J. Malucelli's capital level, positioning it for substantial growth in Brazil. At the time, Travelers had the option to increase its investment to retain a 49.5 percent interest, which the company later did in 2012. In June 2013, Travelers announced the acquisition of Dominion of Canada General Insurance Company from E-L Financial Corporation Limited (TSX: ELF). The transaction later closed in November 2013. The combined organization, referred to as Travelers Canada, remains headquartered in Toronto. The company's joint venture with J. Malucelli in Brazil completed the acquisition of a majority interest in Cardinal Compañía de Seguros, a Colombian start-up surety provider in September 2015. The business, which is based in Bogotá, operates under the co-branded name J. Malucelli Travelers. In October 2015, Travelers acquired a majority interest in the property casualty business of its J. Malucelli joint venture in Brazil. J. Malucelli commenced writing property casualty business in 2012. The property casualty business operates under the Travelers brand and focuses on property, general liability, construction and financial insurance products. The business is based in São Paulo.As a result of the transaction, Travelers now owns 95 percent of the property casualty business with Paraná Banco, the parent company of J. Malucelli, retaining a five percent interest. Travelers' interest in the surety business of the J. Malucelli joint venture remains at 49.5 percent. In March 2017, Travelers agreed to acquire UK-based Simply Business from Aquiline Capital Partners for approximately $490 million. Simply Business is a leading U.K. distributor of small business insurance policies, offering products online on behalf of a broad panel of carriers. It has more than 425,000 microbusiness customers covering more than 1,000 classes of business, and was named \"Best Company to Work For\" by The Sunday Times in 2015 and 2016. The transaction adds to Travelers' digital capabilities. In 2018, Travelers ranked 106 on the Fortune 500 list of largest U.S. companies. On June 8, 2009, Travelers replaced its former parent Citigroup on the Dow Jones Industrial Average. On August 4, 2015, the company announced that Alan Schnitzer would succeed Jay Fishman as chief executive officer effective December 1, 2015. On August 4, 2017, Travelers completed its previously announced acquisition of Simply Business, a leading provider of small business insurance policies in the United Kingdom. On August 15, 2018, Travelers acquired the majority stake of Zensurance, a digital business insurance brokerage in Canada. On May 27, 2025, Travellers announced it would sell the Canadian personal insurance business and the majority of the commercial insurance business of Travelers Canada to Economical Insurance for approximately US$2.4 billion. Business model and products Travelers provides commercial and personal property and casualty insurance products and services to businesses, government units, associations, and individuals. The company offers insurance through three segments: Personal Insurance, which includes home, auto and other insurance products for individuals Business Insurance, which includes a broad array of property and casualty insurance and insurance-related services in the United States Bond and Specialty Insurance, which includes surety, crime, and financial liability businesses which primarily use credit-based underwriting processes, as well as property and casualty products that are predominantly marketed on an international basis. Alleged anticompetitive practices In January 2007, Travelers agreed to pay US$77 million to six states to settle a class action suit and end investigations into its insurance practices. The charges involved paying the insurance broker Marsh & McLennan Companies contingent commissions to win business without the knowledge of clients, thus creating a conflict of interest. Additionally, the investigation examined whether Travelers had created the illusion of competition by submitting fake bids, thus misleading clients into believing they were receiving competitive commercial premiums. National Football League lawsuit In August 2012, Travelers sued the National Football League for forcing the company and its subsidiaries to pay to defend the league for failing to protect players from brain injury, in a case filed in the New York State Supreme Court. The league had sued over three dozen insurance companies the week before in an attempt to cover the claims that players made against the league. Advertising The logo of the red umbrella was created in 1870 when it appeared in a newspaper ad for the insurance company. It was revived in the early 1960s, when it was given its signature red color by Harry W. Knettell, then the account executive for The Travelers and Vice President at the Charles Brunelle advertising agency. During the late 1960s Charles Brunelle was the largest advertising agency in Hartford, a city known as \"the insurance capital of the world,\" \"the Hollywood of insurance,\" or \"America's file cabinet\" due to the many insurance companies in that town. The Travelers was one of their many insurance company clients. In 2006, a Travelers commercial titled Snowball was nominated for an Emmy. Snowball featured a man, walking down a steep San Francisco sidewalk, who trips and knocks over a table of items at a garage sale. The man and the items roll down the street, forming a ball which gathers garbage cans, pedestrians, construction materials, motorcycles, light poles, and other items, in a manner very reminiscent of the \"snowball\" effect or the cult video game Katamari Damacy. The creators of the ad said it was simply based on the snowball effect, that they had never heard of the game, and were surprised by the resulting similarity. In 2007, the company secured naming rights for an annual golf event to be called the Travelers Championship golf tournament, formerly the Greater Hartford Open, on the PGA Tour. In April 2008, The Travelers repurchased the rights to the famous red umbrella, which is featured in several commercials starring Paul Freeman as well as other advertisements. In July 2008, the spot \"Delivery,\" also starring Freeman, was nominated for an Emmy Primetime Emmy Award for Outstanding Commercial. Current and former executives Edward Budd, former Travelers Chairman & CEO Robert I. Lipp, former Travelers CEO Joe Plumeri, former Travelers Vice Chairman, former Chairman & CEO of Willis Group Holdings, and owner of the Trenton Thunder Sandy Weill, former Travelers Chairman & CEO Jay S. Fishman, former Travelers Chairman & CEO Lisa Caputo, Current Chief Marketing & Communications Officer, former press secretary for Hillary Clinton Alan Schnitzer, Current President & CEO"
}