{
  "ticker": "TSCO",
  "cik": "0000916365",
  "company_name": "Tractor Supply",
  "corrected_name": "Tractor Supply",
  "wiki_title_used": "Tractor Supply",
  "exists": true,
  "raw_text": "Tractor Supply Company (also known as TSCO or TSC), founded in 1938, is an American chain store that sells home improvement, agriculture, lawn and garden maintenance, livestock, equine and pet care equipment and supplies. It caters to farmers, ranchers, pet owners, and landowners. As of 2024, the company had 2,250 stores. It is based in Brentwood, Tennessee. It is publicly traded on the Nasdaq under the symbol TSCO and is a Fortune 500 company.\n\nHistory\nIn 1938, Charles Schmidt founded Tractor Supply Company in Chicago as a mail-order business that sold tractor parts. The first retail store was founded in 1939 in Minot, North Dakota. From 1941 to 1946, the company opened stores in Nebraska, Minnesota and Iowa.\nOn January 14, 1959, Tractor Supply became publicly traded on the over-the-counter market and reached $10 million in sales. The company was later traded on the New York Stock Exchange.\nIn 1967, TSC opened its first international stores in Canada. Two years later, Schmidt sold his controlling interest in the company to National Industries. This and other factors, such as changing executive leadership and adding inventory that strayed from its traditional categories, led to a few years of losses for the company.\nFrom that point onward, the Canadian stores were now completely separate from the US Tractor Supply Company and were 100% Canadian-owned. The licensing agreement allowed them to keep using TSC, but not \"Tractor Supply Company.\"\nIn 1979, the company moved to Nashville, Tennessee.\nIn 1982, Tractor Supply put ownership of the company back in the hands of executives and returned to their farm-store niche, resulting in a break-even year. The company was re-incorporated in Delaware the same year.\nOn February 17, 1994, the company's stock was listed on the Nasdaq under the symbol TSCO.\nTractor Supply expanded to serve hobbyist farmers, such as families living in the suburbs with an interest in gardening and livestock. In 2002, the company earned $1.21 billion.\nTwo years later in 2004, the company reported revenues of more than $1.7 billion and Fortune magazine named Tractor Supply to its list of the 100 fastest growing businesses. That year, Tractor Supply moved its headquarters to Brentwood, Tennessee. Jim Wright served as the CEO from 2004 to 2013. He was replaced by Gregory Sandfort.\nIn 2014, Tractor Supply made it on the Fortune 500 list. On March 31, 2018, the company opened its 1700th store. On September 4, 2018, the company celebrated its 80th anniversary by ringing the closing bell at the NASDAQ Stock Exchange in New York.\nTSC's 1,900th store opened in September 2020. By December, the company had 1,923 stores in 49 states. By October 2021, there were 1,967 stores in 49 states. Hal Lawton became CEO in 2020.  That year, the company received a Great Place to Work certification.\nDuring the COVID-19 pandemic, Tractor Supply was deemed an essential business and remained open. The company saw revenue grow 27 percent as more people turned to gardening and pet and livestock ownership. That year, it also established the Tractor Supply Company Foundation.\nIn 2021, Tractor Supply reached #291 on the Fortune 500 list and had over 20 million members in its loyalty program, Neighbor's Club. TSC is the largest retail ranch and farm store operator in the U.S.\nOn Oct 11, 2022, Tractor Supply received clearance from the FTC to close on its acquisition of Orscheln Farm & Home. In order to mitigate federal anti-trust concerns, Tractor Supply sold 73 Orscheln stores and the Orscheln distribution center in Moberly, Missouri, to Bomgaars; 12 stores were sold to Missouri-based farm store chain Buchheit.\nAs of late 2024, Tractor Supply had 2,216 locations with a target of 3,000. The target number of locations increased by 200 from the previous year.\n\nProducts\nTractor Supply carries between 15,500 and 20,000 products in store, including work and recreational clothing, lawn and garden tools, home goods, fencing, truck beds, chicken coops, pet food, and feed for farm animals. Around 15 percent of in-store products are unique to each store's region. Online, the company offers thirteen product categories and sells between 125,000 and 150,000 products.\nIn 2020, the livestock and pet products category accounted for 47 percent of the company's sales. Two categories tied for second-highest sales with 21 percent each: hardware, tools, truck and towing products; and seasonal products such as lawn and garden equipment, gifts, and toys. They were followed by clothing and footwear with 7 percent and agricultural products with 4 percent of sales. Tractor Supply's exclusive brands represented 29 percent of their total sales in 2021.\n\nStore brands\nTractor Supply's store brands include:\n\nOperations and corporate affairs\nManagement\nHal Lawton\nAs of 2024, Hal Lawton is president and chief executive officer of Tractor Supply Company. He is also a member of the firm's board. Lawton started his career in a paper mill in rural North Carolina. In 2000, he joined McKinsey & Co. and was an associate principal until 2005. From 2005 to 2015, Lawton held different positions at The Home Depot. From August 2015 to September 2017, Lawton was the SVP of eBay North America. From September 2017 to December 2019, he served as the president for Macy's.\n\nMarketing\nTractor Supply's mission statement is: \"To work hard, have fun and make money by providing legendary service and great products at everyday low prices.\" In the mid-2000s, Tractor Supply conducted advertising campaigns featuring the slogan \"The Stuff You Need Out Here.\" The company's tagline later became “For Life Out Here.”\nFrom 1998 to 2002, George Strait was the spokesman for Tractor Supply.\nIn 2020, Tractor Supply was a sponsor of the NBA. In 2021, the company became a corporate sponsor of PBR.\nIn 2024, Tractor Supply extended its contract with Yellowstone star Lainey Wilson to serve as a brand ambassador for the company. In 2023, Wilson served as the curator for the firm's Emerging Artist Program that supports country music talent.\n\nAcquisitions and subsidiaries\nIn 2002, Tractor Supply was part of a group (also including four liquidation firms) that purchased some of the leases of the bankrupt Quality Stores, a Michigan-based company. The company operated over 300 stores in 30 states under the names CT Farm & Country; Country General; Quality Farm & Fleet; County Post; Central Farm and Fleet, and FISCO.\nIn September 2016, Tractor Supply acquired Petsense, a small-box specialty retailer of pet supplies primarily located in small and mid-size communities.\nIn February 2021, the company announced that it would acquire Orscheln Farm & Home for $297 million. The acquisition was approved by the Federal Trade Commission in October 2022 on the condition that 85 of the locations to be acquired would be divested. Tractor Supply sold 73 stores to Bomgaars Supply and 12 stores to Burcheit Enterprises. Tractor Supply received about $72 million in consideration for these locations.\nTractor Supply also owns Del's Feed & Farm Supply, a former farm retail chain in the Pacific Northwest and Hawaii, with all but two Del's stores having been converted into Tractor Supply stores.\n\nPhilanthropy\nThe company has been a sponsor for 4-H since 2010. In the fall of 2021, Tractor Supply raised $1.3 million for 4-H members through their Paper Clover campaign. In 2016, the company started its Grants for Growing program to raise money for FFA students. In 2021, the company raised $790,269.\nIn 2019, Tractor Supply started working with the MuttNation Foundation, a nonprofit founded by Miranda Lambert that helps shelter pets. The foundation is supported by proceeds from MuttNation's line of pet products sold by Tractor Supply.\nIn 2020, Tractor Supply joined Land O'Lakes, Microsoft and others in the American Connection Project to support rural broadband access.\nTractor Supply has been a backer of Future Farmers of America (FFA) since 1985. As of 2024, the company has given $24 million to support the FFA. In 2022, Tractor Supply announced that it would spend $5 million over the next five years to support the FFA Future Leaders Scholarship. As of late 2024, about 300 students have received such scholarships for use at colleges and trade schools.\nAs of late 2023, Tractor Supply had a partnership with the Make-A-Wish Foundation. The company has collaborated with the foundation on at least 12 wishes within Tennessee.\nAs of 2024, Tractor Supply supports service members, veterans, and first responders through its \"Hometown Heroes\" program. The program provides several perks to these groups. As a part of this program, the company donated $1 million split evenly among ten groups. The National Law Enforcement Officers Memorial Fund and The Bob Woodruff Foundation both received such donations.\n\nConservation initiatives\nIn 2017, all TSC stores were outfitted with LED lighting. In 2021, the company was named to Investor Business Daily's 100 Best ESG Companies. In December 2021, the company joined the U.S. Environmental Protection Agency’s Green Power Partnership.\n\nWithdrawal of DEI, LGBTQ, and carbon emissions initiatives\nOn June 27, 2024, TSC issued a statement that they were abandoning a range of LGBTQ, DEI, and environmental initiatives. TSC said it would stop submitting data to Human Rights Campaign and would no longer sponsor pride festivals. It eliminated internal DEI roles and abandoned its DEI goals. TSC also gave up its plan to reach net zero carbon emissions by 2040. The company said that the changes were made to better represent the values of its customers who were upset by its practices.\n\nAwards and recognition\nIn 2023, Tractor Supply was named a \"Great Place to Work\" by Fortune.\n\nReferences\nFurther reading\nEddy, Nelson (2004). Work hard, have fun, make money: the Tractor Supply story. Brentwood, Tenn.: Tractor Supply Co. ISBN 0976106604.\n\nExternal links\n\nOfficial website\nBusiness data for Tractor Supply Company:",
  "clean_text": "Tractor Supply Company (also known as TSCO or TSC), founded in 1938, is an American chain store that sells home improvement, agriculture, lawn and garden maintenance, livestock, equine and pet care equipment and supplies. It caters to farmers, ranchers, pet owners, and landowners. As of 2024, the company had 2,250 stores. It is based in Brentwood, Tennessee. It is publicly traded on the Nasdaq under the symbol TSCO and is a Fortune 500 company. History In 1938, Charles Schmidt founded Tractor Supply Company in Chicago as a mail-order business that sold tractor parts. The first retail store was founded in 1939 in Minot, North Dakota. From 1941 to 1946, the company opened stores in Nebraska, Minnesota and Iowa. On January 14, 1959, Tractor Supply became publicly traded on the over-the-counter market and reached $10 million in sales. The company was later traded on the New York Stock Exchange. In 1967, TSC opened its first international stores in Canada. Two years later, Schmidt sold his controlling interest in the company to National Industries. This and other factors, such as changing executive leadership and adding inventory that strayed from its traditional categories, led to a few years of losses for the company. From that point onward, the Canadian stores were now completely separate from the US Tractor Supply Company and were 100% Canadian-owned. The licensing agreement allowed them to keep using TSC, but not \"Tractor Supply Company.\" In 1979, the company moved to Nashville, Tennessee. In 1982, Tractor Supply put ownership of the company back in the hands of executives and returned to their farm-store niche, resulting in a break-even year. The company was re-incorporated in Delaware the same year. On February 17, 1994, the company's stock was listed on the Nasdaq under the symbol TSCO. Tractor Supply expanded to serve hobbyist farmers, such as families living in the suburbs with an interest in gardening and livestock. In 2002, the company earned $1.21 billion. Two years later in 2004, the company reported revenues of more than $1.7 billion and Fortune magazine named Tractor Supply to its list of the 100 fastest growing businesses. That year, Tractor Supply moved its headquarters to Brentwood, Tennessee. Jim Wright served as the CEO from 2004 to 2013. He was replaced by Gregory Sandfort. In 2014, Tractor Supply made it on the Fortune 500 list. On March 31, 2018, the company opened its 1700th store. On September 4, 2018, the company celebrated its 80th anniversary by ringing the closing bell at the NASDAQ Stock Exchange in New York. TSC's 1,900th store opened in September 2020. By December, the company had 1,923 stores in 49 states. By October 2021, there were 1,967 stores in 49 states. Hal Lawton became CEO in 2020. That year, the company received a Great Place to Work certification. During the COVID-19 pandemic, Tractor Supply was deemed an essential business and remained open. The company saw revenue grow 27 percent as more people turned to gardening and pet and livestock ownership. That year, it also established the Tractor Supply Company Foundation. In 2021, Tractor Supply reached #291 on the Fortune 500 list and had over 20 million members in its loyalty program, Neighbor's Club. TSC is the largest retail ranch and farm store operator in the U.S. On Oct 11, 2022, Tractor Supply received clearance from the FTC to close on its acquisition of Orscheln Farm & Home. In order to mitigate federal anti-trust concerns, Tractor Supply sold 73 Orscheln stores and the Orscheln distribution center in Moberly, Missouri, to Bomgaars; 12 stores were sold to Missouri-based farm store chain Buchheit. As of late 2024, Tractor Supply had 2,216 locations with a target of 3,000. The target number of locations increased by 200 from the previous year. Products Tractor Supply carries between 15,500 and 20,000 products in store, including work and recreational clothing, lawn and garden tools, home goods, fencing, truck beds, chicken coops, pet food, and feed for farm animals. Around 15 percent of in-store products are unique to each store's region. Online, the company offers thirteen product categories and sells between 125,000 and 150,000 products. In 2020, the livestock and pet products category accounted for 47 percent of the company's sales. Two categories tied for second-highest sales with 21 percent each: hardware, tools, truck and towing products; and seasonal products such as lawn and garden equipment, gifts, and toys. They were followed by clothing and footwear with 7 percent and agricultural products with 4 percent of sales. Tractor Supply's exclusive brands represented 29 percent of their total sales in 2021. Store brands Tractor Supply's store brands include: Operations and corporate affairs Management Hal Lawton As of 2024, Hal Lawton is president and chief executive officer of Tractor Supply Company. He is also a member of the firm's board. Lawton started his career in a paper mill in rural North Carolina. In 2000, he joined McKinsey & Co. and was an associate principal until 2005. From 2005 to 2015, Lawton held different positions at The Home Depot. From August 2015 to September 2017, Lawton was the SVP of eBay North America. From September 2017 to December 2019, he served as the president for Macy's. Marketing Tractor Supply's mission statement is: \"To work hard, have fun and make money by providing legendary service and great products at everyday low prices.\" In the mid-2000s, Tractor Supply conducted advertising campaigns featuring the slogan \"The Stuff You Need Out Here.\" The company's tagline later became “For Life Out Here.” From 1998 to 2002, George Strait was the spokesman for Tractor Supply. In 2020, Tractor Supply was a sponsor of the NBA. In 2021, the company became a corporate sponsor of PBR. In 2024, Tractor Supply extended its contract with Yellowstone star Lainey Wilson to serve as a brand ambassador for the company. In 2023, Wilson served as the curator for the firm's Emerging Artist Program that supports country music talent. Acquisitions and subsidiaries In 2002, Tractor Supply was part of a group (also including four liquidation firms) that purchased some of the leases of the bankrupt Quality Stores, a Michigan-based company. The company operated over 300 stores in 30 states under the names CT Farm & Country; Country General; Quality Farm & Fleet; County Post; Central Farm and Fleet, and FISCO. In September 2016, Tractor Supply acquired Petsense, a small-box specialty retailer of pet supplies primarily located in small and mid-size communities. In February 2021, the company announced that it would acquire Orscheln Farm & Home for $297 million. The acquisition was approved by the Federal Trade Commission in October 2022 on the condition that 85 of the locations to be acquired would be divested. Tractor Supply sold 73 stores to Bomgaars Supply and 12 stores to Burcheit Enterprises. Tractor Supply received about $72 million in consideration for these locations. Tractor Supply also owns Del's Feed & Farm Supply, a former farm retail chain in the Pacific Northwest and Hawaii, with all but two Del's stores having been converted into Tractor Supply stores. Philanthropy The company has been a sponsor for 4-H since 2010. In the fall of 2021, Tractor Supply raised $1.3 million for 4-H members through their Paper Clover campaign. In 2016, the company started its Grants for Growing program to raise money for FFA students. In 2021, the company raised $790,269. In 2019, Tractor Supply started working with the MuttNation Foundation, a nonprofit founded by Miranda Lambert that helps shelter pets. The foundation is supported by proceeds from MuttNation's line of pet products sold by Tractor Supply. In 2020, Tractor Supply joined Land O'Lakes, Microsoft and others in the American Connection Project to support rural broadband access. Tractor Supply has been a backer of Future Farmers of America (FFA) since 1985. As of 2024, the company has given $24 million to support the FFA. In 2022, Tractor Supply announced that it would spend $5 million over the next five years to support the FFA Future Leaders Scholarship. As of late 2024, about 300 students have received such scholarships for use at colleges and trade schools. As of late 2023, Tractor Supply had a partnership with the Make-A-Wish Foundation. The company has collaborated with the foundation on at least 12 wishes within Tennessee. As of 2024, Tractor Supply supports service members, veterans, and first responders through its \"Hometown Heroes\" program. The program provides several perks to these groups. As a part of this program, the company donated $1 million split evenly among ten groups. The National Law Enforcement Officers Memorial Fund and The Bob Woodruff Foundation both received such donations. Conservation initiatives In 2017, all TSC stores were outfitted with LED lighting. In 2021, the company was named to Investor Business Daily's 100 Best ESG Companies. In December 2021, the company joined the U.S. Environmental Protection Agency’s Green Power Partnership. Withdrawal of DEI, LGBTQ, and carbon emissions initiatives On June 27, 2024, TSC issued a statement that they were abandoning a range of LGBTQ, DEI, and environmental initiatives. TSC said it would stop submitting data to Human Rights Campaign and would no longer sponsor pride festivals. It eliminated internal DEI roles and abandoned its DEI goals. TSC also gave up its plan to reach net zero carbon emissions by 2040. The company said that the changes were made to better represent the values of its customers who were upset by its practices. Awards and recognition In 2023, Tractor Supply was named a \"Great Place to Work\" by Fortune."
}