{
  "ticker": "TSN",
  "cik": "0000100493",
  "company_name": "Tyson Foods",
  "corrected_name": "Tyson Foods",
  "wiki_title_used": "Tyson Foods",
  "exists": true,
  "raw_text": "Tyson Foods, Inc. is an American multinational corporation based in Springdale, Arkansas that operates in the food industry. The company is the world's second-largest processor and marketer of chicken, beef, and pork after JBS S.A. It is the largest meat company in America. It annually exports the largest percentage of beef out of the United States. Together with its subsidiaries, it operates major food brands, including Jimmy Dean, Hillshire Farm, Ball Park, Wright Brand, Aidells, and State Fair. Tyson Foods ranked No. 79 in the 2020 Fortune 500 list of the largest United States corporations by total revenue.\nTyson Foods has been involved in a number of controversies related to the environment, animal welfare, and the welfare of their own employees. During the COVID-19 pandemic, Tyson Foods was accused by some employees of failing to implement certain recommended protections, including physical distancing measures, plexiglass barriers and wearing of face masks. Multiple lawsuits have been filed against the company, alleging gross and willful negligence for the spread of COVID-19 at their plants. Additionally, Tyson is being investigated for allegations of child labor. In 2023 multiple Tyson Foods facilities were closed nationwide in response to a decline in earnings.\n\nHistory\nThe company was established by John W. Tyson in 1935. It expanded during World War II, when chicken was not included in foods that were rationed by the federal government. As of 2019, the company employs 141,000 people, including 122,000 in the United States. Tyson's locations are concentrated in the Midwest and South, with 16 locations in Arkansas, 11 in Texas, 9 in Iowa, and the remainder mostly in the eastern U.S., including Tennessee.\nTyson produces about one-fifth of the beef, chicken, and pork sold in the United States. It is one of the largest U.S. marketers of chicken, beef and pork to retail grocers, broad line foodservice distributors and national fast food and full-service restaurant chains; fresh beef and pork; frozen and fully cooked chicken, beef and pork products; case-ready beef and pork; supermarket deli chicken products; meat toppings for the pizza industry and retail frozen pizza; club store chicken, beef and pork; ground beef and flour tortillas. It supplies Yum! Brands chains that use chicken, including KFC and Taco Bell, as well as McDonald's, Burger King, Wendy's, Walmart, Kroger, IGA, Beef O'Brady's, small restaurant businesses, and prisons.\nThe company makes a wide variety of animal-based, prepared foods and plant-based products at its 123 food processing plants. It produces many different products, including Buffalo wings, boneless Buffalo wings, chicken nuggets, and tenders. Its plants slaughter approximately 155,000 cattle, 461,000 pigs, and 45,000,000 chickens every week. Their largest meat packing facility is their beef production plant in Dakota City, Nebraska. Other plants include feed mills, hatcheries, farms and tanneries.\nIn 2019, the company entered the plant protein category with their Raised & Rooted brand. The brand initially included vegetarian nuggets as well as burgers with a blend of beef and pea protein, then expanded to include tenders. In 2020 Tyson discontinued the burger and removed egg whites from the nuggets, announcing that the Raised & Rooted brand would be free of animal products moving forward. In 2021, the company launched two vegetarian patty breakfast sandwiches under its Jimmy Dean brand.\nOn June 13, 2024, Tyson Foods heir John R. Tyson, who has served as the company's chief financial officer (CFO), would be suspended from the company following his second alcohol related arrest.\n\nAcquisitions and investments\nIn 2001, Tyson Foods acquired IBP, Inc., the largest beef packer and number two pork processor in the United States., for US$3.2 billion in cash and stock. Along with its purchase of IBP, it also acquired the naming rights to an event center in Sioux City, Iowa. Tyson has also acquired such companies as Hudson Foods Company, Garrett poultry, Washington Creamery, Franz Foods, Prospect Farms, Krispy Kitchens, Ocoma Foods, Cassady Broiler, Vantress Pedigree, Wilson Foods, Honeybear Foods, Mexican Original, Valmac Industries, Heritage Valley, Lane Poultry, Cobb-Vantress, Holly Farms, Wright Brand Foods, Inc. and Don Julio Foods. On May 29, 2014, the company announced a $6.13 billion cash offer to acquire all the shares in Hillshire Brands, two days after a $6.4 billion cash and shares bid for Hillshire by Pilgrim's Corp. In June 2014, Tyson won the bidding war against Pilgrim's Pride, agreeing to buy the maker of Jimmy Dean sausage and Ball Park hot dogs for $8.5 billion. On July 28, 2014, the company said it would sell its Mexican and Brazilian poultry businesses to JBS S.A. for $575 million and use the proceeds to pay down debt from its pending $7.7 billion purchase of Hillshire Brands Co.\nIn April 2017, Tyson announced plans to acquire AdvancePierre Foods Holdings, a supplier of packaged sandwiches, for approximately $3.2 billion. The acquisition was completed on June 7, 2017.\nIn November 2017, Tyson Foods bought the Philadelphia-based cheesesteak company Original Philly Holdings.\nIn May 2018, Tyson announced the acquisition of American Proteins, Inc. and AMPRO Products, Inc. for approximately $850 million.\nOn June 1, 2018, Tyson announced that it would sell the Sara Lee, Van's, Chef Pierre and  Bistro Collection brands to Kohlberg & Company. The sale was completed on August 1. What is now known as Sara Lee Frozen Bakery will be based in Oakbrook Terrace, Illinois.\nIn mid-2018, Tyson Foods agreed to acquire the organic chicken and chicken-sausage brand Smart Chicken and parent company Tecumseh Poultry.\nOn August 9, 2018, Tyson announced that it would sell its pizza crust business, including TNT Crust, to Austin-based Peak Rock Capital, who completed the acquisition on September 4.\nOn August 20, 2018, Tyson announced its intent to acquire food supplier Keystone Foods from Marfrig. Tyson announced it had completed the acquisition on November 30, 2018.\nOn February 7, 2019, Tyson Foods reached an agreement to acquire the European and Thai businesses of Brazilian food company BRF. The acquisition was completed on June 3, 2019.\nOn January 10, 2020, Tyson Foods announced that it sold its Golden Island jerky business to Jack Link's.\nOn May 15, 2021, Tyson Foods announced that it was selling its pet treats business, including True Chews, Nudges and Top Chews, to General Mills for $1.2 billion. The sale was completed on July 7, 2021.\nIn March 2024, it was announced Tyson Foods had sold its broiler processing plant, hatchery and feed mill in Dexter, Missouri to the American fresh egg producer, Cal-Maine Foods for an undisclosed amount.\nIn 2023 and 2024, in response to market demands, Tyson Foods chose to close plants across the United States in an effort to optimize operations.\n\nMeat alternatives and clean meat\nIn 2016, Tyson Foods bought a 5% stake in the meat alternative company Beyond Meat, becoming the first major meat producer to invest in a meat alternative company. Tyson made an additional investment in Beyond Meat in 2017. In 2019, Tyson sold its stake in advance of Beyond Meat's initial public offering, with CEO Noel White saying Tyson intended to develop its own meat alternatives. The company also developed the \"blended products\" line called Raised and Rooted, which featured a combination of animal and plant based ingredients. This line includes a burger that is produced from a combination of beef and pea protein isolate.\nIn early 2018, Tyson, through its venture capital arm Tyson Ventures, funded clean meat (cultured meat) research with an investment in California-based Memphis Meats. The same year, Tyson Ventures also invested $2.2 million in Israel-based clean meat company Future Meat.\nFormer CEO Tom Hayes said that Tyson's investments in clean meat and meat alternatives \"might seem counterintuitive\", but they are part of an effort to meet future consumer demand in a sustainable way. The company also announced in July 2015 that it had reduced the use of human antibiotics in their chicken by more than 84 percent since 2011.\n\nInsects\nIn 2023, Tyson announced an investment in Protix, a company which raises insects to feed to pets and to non-human animals intended for human consumption.\n\nCorporate charity\nSince 2000, Tyson Foods has donated millions of dollars in cash to help non-profit organizations across the country. Forbes named Tyson Foods the second most proportionally generous company for its donations in 2007, totaling 1.6 percent ($8 million) of its annual operating income. Tyson initiated the KNOW Hunger campaign in early 2011 to raise awareness of hunger in the United States. After the Joplin, Missouri tornado of 2011, Tyson sent 77,000 pounds of food to the city. It also sent 100,000 pounds of food to the communities along the Gulf of Mexico after the April 20, 2010, oil spill. Tyson has supported \"Little Free Pantries,\" and has partnered with the Chicago Urban League for educational programs on misconceptions about SNAP (food stamp) benefits. Tyson \"pledged to invest $50 million by 2020 in various efforts to fight food insecurity\" in 2015. The company exceeded that goal, with contributions of over $60 million to start the year 2020.\nTyson Foods has made political donations to both major parties.\n\nResearch and development\nIn 2007, Tyson created the Tyson Discovery Center, a 100,000-square-foot (9,300 m2) R&D center at their headquarters in Springdale, Arkansas, to work on new products and better packaging. They later opened a second Discovery Center in Downers Grove, Illinois.\nAs of 2017, Tyson has about 300 employees in R&D.\n\nCorporate governance\nCEOs\nJohn W. Tyson, the founder, was CEO from 1935 until his death in 1967.\nDon Tyson, CEO and chairman (1967 to 1991).\nLeland Tollett (1991 to 1998).\nJohn H. Tyson (1999 to 2006).\nRichard L. Bond (2006 until January 7, 2009). His position was filled temporarily by Leland Tollett.\nDonnie Smith (November 2009 to December 2016). In November 2016, the company announced Smith would be succeeded at the turn of the year by company president Tom Hayes.\nTom Hayes (January 2017-September 2018).\nNoel White (October 2018-October 3, 2020, beginning of the 2021 fiscal year). White had worked at Tyson since 2001.\nDean Banks, former Alphabet executive (October 2020-June 2021). He received a $1.2 million salary and received a $5 million bonus to move to northwest Arkansas by December 2020 or not voluntarily resign by the end of 2021 fiscal year. On June 2, 2021, President and CEO Dean Banks resigned citing family reasons.\nDonnie King, the former Chief Operating Officer (COO), began serving as president and CEO in June 2021 and is still in office. An alumnus of the University of Arkansas at Little Rock, he had worked at Tyson for 36 years, beginning in 1982. King's total compensation for his first year as CEO was over $12 million. His total compensation rose to $22.8 million for fiscal year 2024, an increase of 72.8% over FY2023.\n\nEnvironmental record\nTyson Foods has been responsible for numerous instances of environmental damage. Tyson is the second-largest emitter of greenhouse gases in the global food industry. According to the Institute for Agriculture and Trade Policy, Tyson is among the largest single sources of greenhouse gases in the world, when the whole process of rearing animals for slaughter (such as producing feed for the animals and using agriculture chemicals) is considered.\nTyson has been involved in several lawsuits related to air and water pollution. In June 2003, the company admitted to illegally dumping untreated wastewater from its poultry processing plant near Sedalia, Missouri, from 1998 to 2001. The company pleaded guilty to 20 felony violations of the federal Clean Water Act. According to a Department of Justice attorney, the dumping had continued even after the United States Environmental Protection Agency and the Federal Bureau of Investigation searched the plant in 1999. As part of the plea agreement, the company agreed to pay $7.5 million in fines: $5.5 million to the federal government, $1 million to the state of Missouri, and $1 million to the Missouri Natural Resources Protection Fund. The company also agreed to hire an outside consultant to perform an environmental audit, and institute an \"enhanced environmental management system\" at the Sedalia plant. At the same time, Tyson also settled a case filed by the Missouri attorney general's office related to the same illegal dumping.\nIn 2002, three residents of Western Kentucky, together with the Sierra Club, filed a lawsuit concerning the discharge of dangerous quantities of ammonia from Tyson's Western Kentucky factories. Tyson settled the suit in January 2005, agreeing to spend $500,000 to mitigate and monitor the ammonia levels.\nIn 2004, Tyson was one of six poultry companies to pay a $7.3 million settlement fee to the city of Tulsa, Oklahoma, to settle charges that the use of chicken waste as fertilizer had created phosphorus pollution in Tulsa's main drinking water sources.\nIn 2005, Tyson settled a $500,000 lawsuit related to air pollution in Kentucky.\nTyson's processing plants generate a vast supply of animal fats. In late 2006, the company created a business unit called Tyson Renewable Energy to examine ways of commercializing the use of this leftover material by converting it into biofuels.  The unit also examined the potential use of poultry litter to generate energy and other products.\nTyson's 2010 Sustainability Report said that it had reduced water use by 7.6 percent between October 2004 and 2009, and reduced wastewater related permit exceedances by 5.4 percent during 2007–2009. However, the company reported a 51.9 percent increase in violation notices related to wastewater, storm water, and drinking water. The company reduced landfill solid waste by 12.5 percent during 2008–2009.\nAs of 2010, six of Tyson Foods' wastewater treatment facilities capture biogas via enclosed anaerobic lagoons. Four of the systems use the biogas as an alternative fuel to natural gas; during 2008–2009, the four facilities used 1.8 billion cubic feet of biogas, replacing 1.3 billion cubic feet of natural gas and saving the company approximately $9.1 million.\nAccording to Tyson's 2012 Sustainability Report, the company reduced total water use by 4.7 percent during 2011–2012, but normalized water use increased 1 percent over the same period. Through conservation efforts and closures, the company reduced water use by 10.9 percent between October 2004 and 2012. During 2010–2012, Tyson Foods reduced wastewater related permit exceedances by 48 percent and notices of violations by 86 percent. Tyson reduced greenhouse gas emissions by approximately 8 percent during 2010–2011, and the company cut 145 million truck miles via lightweight equipment purchases, packaging improvements, and use of rail transport.\nIn 2013, Tyson paid nearly $4 million in fines due to eight separate incidents between 2006 and 2010 where it accidentally released anhydrous ammonia, an extremely hazardous substance which causes chemical-type burns. These releases killed at least one worker and injured nearly a dozen others.\nIn Newsweek's 2017 \"green ranking\", an environmental performance assessment of the largest public companies, Tyson Foods ranked number 223 in the U.S. and number 312 in the world.\nTyson Foods worked with the World Resources Institute to set a goal for reducing greenhouse gas emissions 30 percent by 2030. The plan was accepted by the Science Based Targets initiative, a coalition of companies working to limit carbon emissions based on the goals of the Paris Agreement.\nAccording to Tyson's 2019 Sustainability Report, the company was on track to meet most of its sustainability goals and had decreased water use by 6.8 percent since 2015. Tyson Foods joined the United Nations Global Compact in 2019, and the report also states that the company has goals similar to the United Nations' Sustainable Development Goals.\nEnvironmental groups have blamed Tyson for polluting the Illinois River with poultry litter. A company spokesperson said the litter belongs to independent contract farmers and not to Tyson. To address the problem of poultry litter in watersheds, Tyson and four other poultry companies formed the non-profit organization BMPs in 2004. Tyson says that the organization has helped to move more than 1 million tons of poultry litter out of the Illinois River watershed, redistributing the litter to less nutrient-dense areas.\nIn 2019, the Environmental Integrity Project identified Tyson as being a major discharger of pollution to waterways in East Texas. The high volumes of blood, urine, feces, and feathers discharged into East Texas rivers and lakes contribute to declining oxygen levels in the water, which endanger local animals, fish and habitat. The Environmental Integrity Project found that the Tyson plant in East Texas violated its Clean Water Act permit a dozen times over 2016–2017.\nIn 2019, wastewater from a Tyson plant in Alabama polluted rivers and killed approximately 175,000 fish. The state of Alabama sued Tyson over the incident the following year.\nAlso in 2019, Tyson Foods partnered with the Environmental Defense Fund to help farmers reduce nitrogen and erosion across 2 million acres of corn fields in the Midwestern United States and Pennsylvania. The same year, a Tyson building in Springdale, Arkansas, won a LEED silver certification for environmentally friendly design.\nAs of January 2020, Tyson Foods' land stewardship and sustainable farming program had enrolled approximately 400,000 acres of corn, and planned to support improved environmental practices on 2 million acres of corn by the end of 2020.\nIn 2020, Tyson Foods partnered with the nonprofit organization Proforest to complete a deforestation risk assessment, which concluded that approximately 94 percent of the company's land footprint is at low risk of being associated with deforestation. To address the remainder found to be at risk, in November the company announced a Forest Protection Standard focused on reducing deforestation risk in supply chains of cattle and beef, soy, palm oil, pulp, paper and packaging.\nIn 2020, Tyson Foods received a SmartWay Excellence Award from the Environmental Protection Agency, recognizing \"top shipping (retailers and manufacturers) and logistics company partners for superior environmental performance\".\nIn 2020, it was reported that Tyson Foods uses 4.89 million acres of land for soybeans and 5.2 million acres of corn for providing feed for their 6 million cows, 22 million hogs, and 2 billion chickens. A study by the Union of Concerned Scientists in 2018 found that only 5% (408,000 acres) of their land has been enrolled in sustainable practices. This is set to change though as Tyson sets their net zero gas house emissions by 2050. The farm land and fertilizer also have an effect on the environment as potent nitrous oxide is being released. For every one of Tyson's 10.1 million acres, fertilizer is being used which can increase the pounds of nitrous oxide per acre in a year from 0.5 to 3 depending on how much fertilizer is being used. Tyson can easily reduce their emissions by 2050 by starting to use less fertilizer and being more precise with their fertilizing.\nTyson doesn't directly raise their livestock, as they hire private farms, but they are still responsible for the emissions released from their animals and the feed they use. Tyson is responsible for 6 million cows, which burp methane and release approximately 1.2 billion pounds of methane a year. Tyson also raises chickens and pigs, but they have a much smaller effect on the environment. The main greenhouse gas emissions that come from them are in their manure and are very minuscule compared to those of cows. Tyson has made strides to prevent animal waste being sent to landfills, as 6 of their plants have reached gold status, which means 95-99 percent of their waste is not ending up in a landfill.\nIn 2024, a study by the Union of Concerned Scientists found that between 2018 and 2022 Tyson released 371 million pounds of pollutants, including nitrogen, phosphorus, chloride, oil, and cyanide, from just 41 slaughterhouses and processing plants into local waterways across the United States.\n\nLabor relations\nWorkers' rights\nAccording to Celeste Monforton, professor of occupational health at George Washington University, 34 employees were injured at 10 Tyson meatpacking plants during January–September 2015, resulting in one amputation per month on average. Reporting on Monforton's findings in 2016, BuzzFeed News said Tyson Foods \"recently launched new programs to improve workplace safety communication, awareness and education.\"\nAn Oxfam report issued in 2016 cited anonymous employees who stated they were routinely denied bathroom breaks; they wore adult diapers to work in order to get through the day. In 2017, Tyson Foods announced plans to provide regularly scheduled bathroom breaks and training on workers' rights for employees, \"give more attention to line speeds at plants\", and establish safety councils that involved workers. Additionally, the company announced plans for \"hiking wages, publicly sharing results of a third-party audit on worker conditions, increasing benefits to include more vacation and holidays, and expanding existing safety programs\".\nThe plans stem from compliance audits started in 2012 and an occupational safety and health pilot program established in 2015. The announcement was made in conjunction with Oxfam America and United Food and Commercial Workers. By May 2018, hundreds of Tyson Foods workers at 27 plants had participated in the company's Upward Academy education program.\nIn December 2024, Tyson and its subsidiary Keystone agreed to pay $115.5 million to settle an antitrust lawsuit, which alleged that the company had illegally conspired with other poultry processors to suppress workers' wages.\n\nEmployment of illegal immigrants\nTyson Foods was indicted on December 9, 2001, along with six employees, on charges that it conspired to smuggle illegal immigrants across the Mexican border to work in its processing plants. The 36-count indictment, which was unsealed at Federal District Court in Chattanooga, Tennessee, accused Tyson of arranging to transport illegal immigrant workers across the border and helping them to get counterfeit work papers for jobs at 15 Tyson plants. Prosecutors alleged that the conspiracy to import workers dated back to 1994. Of the six managers who were indicted, two accepted plea bargain deals, and one committed suicide a few months after being charged. In March 2003, a federal jury acquitted Tyson and its managers of having hired illegal immigrants as part of a conspiracy.\nIn October 2006, a federal judge granted class-action status to a lawsuit brought by Tyson employees who allege that Tyson's practice of hiring illegal immigrants depresses wages 10–30%. The suit further contends that the company violated federal racketeering laws by conspiring with National Council of La Raza and League of United Latin American Countries not to question the employment applications of anyone with a Hispanic surname.\n\nCoronavirus (COVID-19) pandemic\nAs the COVID-19 pandemic spread across the United States, officials including the sheriff in Black Hawk County, Iowa criticized Tyson Foods on April 17, 2020, for failing to close a Waterloo, Iowa plant where an outbreak of the disease began. Tyson closed the Waterloo plant on April 22. According to an Associated Press report, the company said the shutdown \"would deny a vital market to hog farmers and further disrupt the nation's meat supply\".\nSteve Stouffer, president of the fresh meats division at Tyson Foods, expressed some resistance to universal testing of their workers. \"Everybody wants to test meatpacking employees, but nobody is testing the communities around them to show what’s the baseline,\" Stouffer said, adding \"And until we know the baselines, my question has always been: Are we the cause or are we just the victim of our surroundings?\" On April 21, Tyson announced the closure of a plant in Center, Texas, which is located in Shelby County, a rural area with a rate of coronavirus infections about four times higher than the state average. A local physician reported that over half of the county's cases were associated with employees of the Tyson facility.\nOn April 22, Tyson announced the closure of a pork processing plant in Logansport, Indiana. The president of the Indiana Farm Bureau said that the organization is \"extremely concerned about the closure of the Tyson pork processing facility. This is a devastating blow to the pork producers who sell hogs to Tyson.\" On April 23, Tyson announced that a beef processing plant in Wallula, Washington was closing. Tyson executive Steve Stouffer said, \"Unfortunately, the closure will mean reduced food supplies and presents problems to farmers who have no place to take their livestock. It’s a complicated situation across the supply chain.\nOn April 26, John Tyson, chairman of the board, wrote in the New York Times that \"The food supply chain is breaking...There will be limited supply of our products available in grocery stores until we are able to reopen our facilities that are currently closed.\"\nIn June 2020, ProPublica reported that well after outbreaks had occurred, Tyson did not implement recommended safety measures to protect its workers, such as physical distancing, plexiglass barriers, and wearing of face masks.\nOn June 21, the government of China announced that it was suspending imports of chicken from a Tyson factory. The company confirmed that the affected facility was its Berry Street plant in Springdale, Arkansas.\nIn July 2020, Tyson Foods said it would hire 200 nurses and administrative personnel, and begin administering coronavirus tests at all of its U.S. production facilities, as part of the company's response to the pandemic. Tyson's Chief Executive Noel White said that the company's investment in automation would likely increase in light of the pandemic.\nIn August 2020, at least 10,261 Tyson workers were confirmed to have COVID-19 (out of a workforce of over 120,000).\nIn November 2020 a wrongful-death lawsuit previously filed by the family of a Tyson employee, alleging \"willful and wanton disregard\" for employees' health and safety with regard to COVID-19, was amended with new allegations that a plant manager had organized a betting pool for supervisor and managers to bet on how many employees would be affected with COVID-19.\nIn November 2020, Tyson suspended multiple top officials and retained the law firm Covington & Burling to conduct an investigation into these allegations. In December 2020, Tyson received the results of the investigation led by former US Attorney General and Covington & Burling partner Eric Holder, and terminated seven of its top managers at the Waterloo, Iowa plant. The Waterloo plant is Tyson's largest pork plant and was the centre of a COVID-19 outbreak that infected more than 1000 Tyson employees, killing six, before spreading into the broader community. Tyson did not publicly disclose the names of those terminated or the detailed findings of the report, but issued a statement saying that those terminated did not represent the company's core values.\nIn August 2021, Tyson announced that all employees were required to be \"fully vaccinated\" with COVID-19 vaccines by November. The company offered employees a $200 incentive to get vaccinated. The mandate was suspended on October 31, 2022.\n\nProduction\nUse of antibiotics\nIn 2007, Tyson began labeling and advertising its chicken products as \"raised without antibiotics\". Tyson competitors Perdue Farms and Sanderson Farms sued, claiming that Tyson's claim violated truth-in-advertising/labeling standards. Tyson acknowledged using ionophores in chicken feed. Ionophores are used to control coccidiosis, a parasite common in poultry, and the medication is not used in human medicine. A federal judge ordered Tyson to stop making the \"raised without antibiotics\" claim by May 15, 2008.\nIn June 2008, USDA inspectors discovered that Tyson had also been using gentamicin, an antibiotic, in unhatched eggs. USDA spokespeople stated that Tyson had not disclosed the use of this antibiotic to the agency, and they issued a letter informing Tyson that the \"raised without antibiotics\" claim was not truthful. A Tyson spokesperson acknowledged that the company uses the antibiotic and stated that its use is standard industry practice.\nThe USDA had originally approved the \"raised without antibiotics\" label, but withdrew their approval after learning that Tyson used ionophores. Tyson and the USDA compromised on rewording Tyson's slogan as \"raised without antibiotics that impact antibiotic resistance in humans\", but the USDA later said that Tyson could not use that label either. In June 2008, Tyson agreed to voluntarily remove its \"raised without antibiotics\" label in future packaging and advertising.\nIn 2015, Tyson Foods announced plans to stop feeding chickens with antibiotics used in human medicine. In 2017, the company announced plans to stop using all antibiotics on chickens for Tyson-branded breasts, nuggets, and wings. In 2023, Tyson introduced ionophores into their chicken feed and dropped the \"no antibiotics ever\" label from their chicken products.\nA USDA inspection announced in August 2024 found that 20% of tested beef samples on track to be labeled as antibiotic-free were positive for antibiotics.  The advocacy group Farm Forward found, through a Freedom of Information Act request, that Tyson was one of several producers of beef that tested positive for antibiotics, alongside JBS and Cargill.\n\nAnimal welfare\nTyson Foods has been embroiled in numerous scandals related to animal abuse and cruelty. In response to undercover revelations of animal abuse, Tyson has responded by arguing that the undercover animal rights activists were at fault for the abuse by not actively preventing it.\nIn 2006, Tyson completed a study to determine whether controlled atmosphere killing, which uses gas to render chickens unconscious before slaughter, could be a more humane practice than conventional electrical stunning. According to Bill Lovette, Tyson's senior group vice president of poultry and prepared foods, the study found no difference between the humaneness of the two methods. The company plans to ask scientists at the University of Arkansas to initiate a similar study to test these initial results. The research will be led by the newly created chair in Food Animal Wellbeing at the Dale Bumpers College of Agricultural, Food and Life Sciences of the University of Arkansas. Tyson has committed $1.5 million to help establish the chair, which will be involved in overseeing research and classes focused on the humane management and treatment of food animals.\nIn 2012, Tyson introduced an auditing program known as FarmCheck to check how animals are treated by the company's suppliers. The program was introduced as a trial on certain hog farms, and was the first major program of its kind to apply penalties to producers for noncompliance. By 2020, FarmCheck had expanded to Tyson's poultry suppliers, and its poultry audits were certified by the Professional Animal Auditor Certification Organization.\nIn 2014, after an NBC News reported on abuse of piglets at a Tyson pig farm in Oklahoma, Tyson announced new animal care guidelines, such as keeping sows in larger cages, installing video cameras in cages, using pain mitigation strategies in the castration of piglets, and avoiding killing piglets through blunt force. Animal rights activities called on Tyson to make the guidelines a \"mandate\" rather than a \"recommendation.\"\nIn 2015, Tyson Foods severed ties with a supplier after Mercy For Animals published videos showing that employees at a Tyson supplier were stabbing, clubbing and stomping on chickens. A 2016 undercover investigation by the animal rights organization Compassion Over Killing showed workers at four separate Tyson processing plants throwing, punching and kicking chickens, as well as sticking plastic rods through their beaks. They also wrung birds' necks, ran over them with forklifts, and left injured birds in heaping piles to die.\nA 2017 investigation showed more abuse and cruelty towards chickens. After the 2017 investigation, Tyson responded by saying it would introduce a remote video auditing system to monitor treatment of chickens in its supply chain and hire off-site auditors. The company also started a pilot program for controlled atmosphere stunning, considered to be a more humane method of slaughter. Animal rights activists said the measure did not go far enough. In 2017, Matthew Prescott of the Humane Society of the United States criticized Tyson for failing to implement many of the animal welfare standards that other food suppliers were adopting.\nIn 2020, Tyson worked with the University of Arkansas System Division of Agriculture to investigate the effects of lighting on broiler chicken welfare. Their research project, \"Effect of Variable Light Intensity Program on Broiler Gait Score, Stress and Central Positive Welfare in Commercial Broiler Farm\", received a $110,000 grant from the U.S. Poultry and Egg Association.\nFollowing a 2020 complaint, the Federal Trade Commission is investigating Tyson for making false and misleading advertising claims regarding the treatment of its chickens.\n\nFood recalls\nOn January 30, 2019, Tyson Foods announced a recall for over 36,000 pounds of chicken nuggets that were at risk of being contaminated with small pieces of rubber. The recall followed allegations by consumers who submitted complaints to the U.S. Agriculture Department. Tyson identified the contaminated nuggets as those received by Arizona, California, Illinois, New Jersey, and Utah club store distribution centers. On March 21, 2019, the company issued a recall for 69,000 pounds of chicken strips potentially contaminated with pieces of metal, following six complaints submitted to the Food Safety and Inspection Service, including three alleged oral injuries. An expanded recall for nearly 12 million pounds of chicken strips was issued on May 4, 2019.\nOn June 7, 2019, Tyson Foods announced a recall for over 190,000 pounds of chicken fritters which potentially contained hard plastic following reports from three consumers. The products were not sold in retail stores but supplied to various food service locations, including schools.\nOn July 3, 2021, Tyson Foods announced a recall for approximately 8,955,296 pounds of ready-to-eat (RTE) chicken products that may be adulterated with Listeria monocytogenes. These frozen, fully cooked chicken products were produced between December 26, 2020, and April 13, 2021.\n\nPrice manipulation\nIn 2016, Maplevale sued Tyson and other poultry producers for alleged price fixing. Since the original filing, numerous other customers and consumers have filed similar lawsuits, which are consolidated in the Northern District of Illinois. The companies were accused of working together to restrict the supply of chickens and to manipulate chicken prices; these activities allegedly started in 2008. Tyson has denied the allegations, with a spokesperson calling them \"baseless.\"\nIn 2018, a class-action lawsuit was filed against Tyson, along with other major pork producers including Hormel Foods, JBS, Seaboard, and Smithfield Foods, accusing the companies of conspiring to artificially raise the price of pork via the tech platform Agri Stats, thereby forcing consumers and restaurants to pay inflated prices for pork products. In October 2025, Tyson agreed to pay $85 million to settle the lawsuit.\nIn June 2020, Tyson announced it was cooperating with the U.S. Department of Justice (DOJ) in relation to price fixing and bid rigging in the poultry industry. Tyson was cooperating under a leniency program whereby it would avoid criminal prosecution by providing aid to DOJ investigators. Just prior to the announcement, four poultry industry executives were indicted for conspiracy to engage in price fixing. In October 2020, Pilgrim's Pride agreed to a plea agreement and a settlement of $110 million. In March 2021, Tyson agreed to pay $221.5 million to poultry buyers to settle the price-fixing claims.\nIn 2024, McDonald's Corporation sued JBS, National Beef, Cargill, and Tyson, along with their subsidiaries, for alleged price fixing.\n\nSee also\nBroiler industry\nChicken patty\nCultured meat\nFood industry\nFood, Inc.\nGolden Triangle of Meat-packing\nThe Meat Racket, book by Christopher Leonard\nLabor rights in American meatpacking industry\n\nReferences\nExternal links\nConsumer web site for Tyson Foods\nCorporate web site for Tyson Foods\nBusiness data for Tyson Foods:",
  "clean_text": "Tyson Foods, Inc. is an American multinational corporation based in Springdale, Arkansas that operates in the food industry. The company is the world's second-largest processor and marketer of chicken, beef, and pork after JBS S.A. It is the largest meat company in America. It annually exports the largest percentage of beef out of the United States. Together with its subsidiaries, it operates major food brands, including Jimmy Dean, Hillshire Farm, Ball Park, Wright Brand, Aidells, and State Fair. Tyson Foods ranked No. 79 in the 2020 Fortune 500 list of the largest United States corporations by total revenue. Tyson Foods has been involved in a number of controversies related to the environment, animal welfare, and the welfare of their own employees. During the COVID-19 pandemic, Tyson Foods was accused by some employees of failing to implement certain recommended protections, including physical distancing measures, plexiglass barriers and wearing of face masks. Multiple lawsuits have been filed against the company, alleging gross and willful negligence for the spread of COVID-19 at their plants. Additionally, Tyson is being investigated for allegations of child labor. In 2023 multiple Tyson Foods facilities were closed nationwide in response to a decline in earnings. History The company was established by John W. Tyson in 1935. It expanded during World War II, when chicken was not included in foods that were rationed by the federal government. As of 2019, the company employs 141,000 people, including 122,000 in the United States. Tyson's locations are concentrated in the Midwest and South, with 16 locations in Arkansas, 11 in Texas, 9 in Iowa, and the remainder mostly in the eastern U.S., including Tennessee. Tyson produces about one-fifth of the beef, chicken, and pork sold in the United States. It is one of the largest U.S. marketers of chicken, beef and pork to retail grocers, broad line foodservice distributors and national fast food and full-service restaurant chains; fresh beef and pork; frozen and fully cooked chicken, beef and pork products; case-ready beef and pork; supermarket deli chicken products; meat toppings for the pizza industry and retail frozen pizza; club store chicken, beef and pork; ground beef and flour tortillas. It supplies Yum! Brands chains that use chicken, including KFC and Taco Bell, as well as McDonald's, Burger King, Wendy's, Walmart, Kroger, IGA, Beef O'Brady's, small restaurant businesses, and prisons. The company makes a wide variety of animal-based, prepared foods and plant-based products at its 123 food processing plants. It produces many different products, including Buffalo wings, boneless Buffalo wings, chicken nuggets, and tenders. Its plants slaughter approximately 155,000 cattle, 461,000 pigs, and 45,000,000 chickens every week. Their largest meat packing facility is their beef production plant in Dakota City, Nebraska. Other plants include feed mills, hatcheries, farms and tanneries. In 2019, the company entered the plant protein category with their Raised & Rooted brand. The brand initially included vegetarian nuggets as well as burgers with a blend of beef and pea protein, then expanded to include tenders. In 2020 Tyson discontinued the burger and removed egg whites from the nuggets, announcing that the Raised & Rooted brand would be free of animal products moving forward. In 2021, the company launched two vegetarian patty breakfast sandwiches under its Jimmy Dean brand. On June 13, 2024, Tyson Foods heir John R. Tyson, who has served as the company's chief financial officer (CFO), would be suspended from the company following his second alcohol related arrest. Acquisitions and investments In 2001, Tyson Foods acquired IBP, Inc., the largest beef packer and number two pork processor in the United States., for US$3.2 billion in cash and stock. Along with its purchase of IBP, it also acquired the naming rights to an event center in Sioux City, Iowa. Tyson has also acquired such companies as Hudson Foods Company, Garrett poultry, Washington Creamery, Franz Foods, Prospect Farms, Krispy Kitchens, Ocoma Foods, Cassady Broiler, Vantress Pedigree, Wilson Foods, Honeybear Foods, Mexican Original, Valmac Industries, Heritage Valley, Lane Poultry, Cobb-Vantress, Holly Farms, Wright Brand Foods, Inc. and Don Julio Foods. On May 29, 2014, the company announced a $6.13 billion cash offer to acquire all the shares in Hillshire Brands, two days after a $6.4 billion cash and shares bid for Hillshire by Pilgrim's Corp. In June 2014, Tyson won the bidding war against Pilgrim's Pride, agreeing to buy the maker of Jimmy Dean sausage and Ball Park hot dogs for $8.5 billion. On July 28, 2014, the company said it would sell its Mexican and Brazilian poultry businesses to JBS S.A. for $575 million and use the proceeds to pay down debt from its pending $7.7 billion purchase of Hillshire Brands Co. In April 2017, Tyson announced plans to acquire AdvancePierre Foods Holdings, a supplier of packaged sandwiches, for approximately $3.2 billion. The acquisition was completed on June 7, 2017. In November 2017, Tyson Foods bought the Philadelphia-based cheesesteak company Original Philly Holdings. In May 2018, Tyson announced the acquisition of American Proteins, Inc. and AMPRO Products, Inc. for approximately $850 million. On June 1, 2018, Tyson announced that it would sell the Sara Lee, Van's, Chef Pierre and Bistro Collection brands to Kohlberg & Company. The sale was completed on August 1. What is now known as Sara Lee Frozen Bakery will be based in Oakbrook Terrace, Illinois. In mid-2018, Tyson Foods agreed to acquire the organic chicken and chicken-sausage brand Smart Chicken and parent company Tecumseh Poultry. On August 9, 2018, Tyson announced that it would sell its pizza crust business, including TNT Crust, to Austin-based Peak Rock Capital, who completed the acquisition on September 4. On August 20, 2018, Tyson announced its intent to acquire food supplier Keystone Foods from Marfrig. Tyson announced it had completed the acquisition on November 30, 2018. On February 7, 2019, Tyson Foods reached an agreement to acquire the European and Thai businesses of Brazilian food company BRF. The acquisition was completed on June 3, 2019. On January 10, 2020, Tyson Foods announced that it sold its Golden Island jerky business to Jack Link's. On May 15, 2021, Tyson Foods announced that it was selling its pet treats business, including True Chews, Nudges and Top Chews, to General Mills for $1.2 billion. The sale was completed on July 7, 2021. In March 2024, it was announced Tyson Foods had sold its broiler processing plant, hatchery and feed mill in Dexter, Missouri to the American fresh egg producer, Cal-Maine Foods for an undisclosed amount. In 2023 and 2024, in response to market demands, Tyson Foods chose to close plants across the United States in an effort to optimize operations. Meat alternatives and clean meat In 2016, Tyson Foods bought a 5% stake in the meat alternative company Beyond Meat, becoming the first major meat producer to invest in a meat alternative company. Tyson made an additional investment in Beyond Meat in 2017. In 2019, Tyson sold its stake in advance of Beyond Meat's initial public offering, with CEO Noel White saying Tyson intended to develop its own meat alternatives. The company also developed the \"blended products\" line called Raised and Rooted, which featured a combination of animal and plant based ingredients. This line includes a burger that is produced from a combination of beef and pea protein isolate. In early 2018, Tyson, through its venture capital arm Tyson Ventures, funded clean meat (cultured meat) research with an investment in California-based Memphis Meats. The same year, Tyson Ventures also invested $2.2 million in Israel-based clean meat company Future Meat. Former CEO Tom Hayes said that Tyson's investments in clean meat and meat alternatives \"might seem counterintuitive\", but they are part of an effort to meet future consumer demand in a sustainable way. The company also announced in July 2015 that it had reduced the use of human antibiotics in their chicken by more than 84 percent since 2011. Insects In 2023, Tyson announced an investment in Protix, a company which raises insects to feed to pets and to non-human animals intended for human consumption. Corporate charity Since 2000, Tyson Foods has donated millions of dollars in cash to help non-profit organizations across the country. Forbes named Tyson Foods the second most proportionally generous company for its donations in 2007, totaling 1.6 percent ($8 million) of its annual operating income. Tyson initiated the KNOW Hunger campaign in early 2011 to raise awareness of hunger in the United States. After the Joplin, Missouri tornado of 2011, Tyson sent 77,000 pounds of food to the city. It also sent 100,000 pounds of food to the communities along the Gulf of Mexico after the April 20, 2010, oil spill. Tyson has supported \"Little Free Pantries,\" and has partnered with the Chicago Urban League for educational programs on misconceptions about SNAP (food stamp) benefits. Tyson \"pledged to invest $50 million by 2020 in various efforts to fight food insecurity\" in 2015. The company exceeded that goal, with contributions of over $60 million to start the year 2020. Tyson Foods has made political donations to both major parties. Research and development In 2007, Tyson created the Tyson Discovery Center, a 100,000-square-foot (9,300 m2) R&D center at their headquarters in Springdale, Arkansas, to work on new products and better packaging. They later opened a second Discovery Center in Downers Grove, Illinois. As of 2017, Tyson has about 300 employees in R&D. Corporate governance CEOs John W. Tyson, the founder, was CEO from 1935 until his death in 1967. Don Tyson, CEO and chairman (1967 to 1991). Leland Tollett (1991 to 1998). John H. Tyson (1999 to 2006). Richard L. Bond (2006 until January 7, 2009). His position was filled temporarily by Leland Tollett. Donnie Smith (November 2009 to December 2016). In November 2016, the company announced Smith would be succeeded at the turn of the year by company president Tom Hayes. Tom Hayes (January 2017-September 2018). Noel White (October 2018-October 3, 2020, beginning of the 2021 fiscal year). White had worked at Tyson since 2001. Dean Banks, former Alphabet executive (October 2020-June 2021). He received a $1.2 million salary and received a $5 million bonus to move to northwest Arkansas by December 2020 or not voluntarily resign by the end of 2021 fiscal year. On June 2, 2021, President and CEO Dean Banks resigned citing family reasons. Donnie King, the former Chief Operating Officer (COO), began serving as president and CEO in June 2021 and is still in office. An alumnus of the University of Arkansas at Little Rock, he had worked at Tyson for 36 years, beginning in 1982. King's total compensation for his first year as CEO was over $12 million. His total compensation rose to $22.8 million for fiscal year 2024, an increase of 72.8% over FY2023. Environmental record Tyson Foods has been responsible for numerous instances of environmental damage. Tyson is the second-largest emitter of greenhouse gases in the global food industry. According to the Institute for Agriculture and Trade Policy, Tyson is among the largest single sources of greenhouse gases in the world, when the whole process of rearing animals for slaughter (such as producing feed for the animals and using agriculture chemicals) is considered. Tyson has been involved in several lawsuits related to air and water pollution. In June 2003, the company admitted to illegally dumping untreated wastewater from its poultry processing plant near Sedalia, Missouri, from 1998 to 2001. The company pleaded guilty to 20 felony violations of the federal Clean Water Act. According to a Department of Justice attorney, the dumping had continued even after the United States Environmental Protection Agency and the Federal Bureau of Investigation searched the plant in 1999. As part of the plea agreement, the company agreed to pay $7.5 million in fines: $5.5 million to the federal government, $1 million to the state of Missouri, and $1 million to the Missouri Natural Resources Protection Fund. The company also agreed to hire an outside consultant to perform an environmental audit, and institute an \"enhanced environmental management system\" at the Sedalia plant. At the same time, Tyson also settled a case filed by the Missouri attorney general's office related to the same illegal dumping. In 2002, three residents of Western Kentucky, together with the Sierra Club, filed a lawsuit concerning the discharge of dangerous quantities of ammonia from Tyson's Western Kentucky factories. Tyson settled the suit in January 2005, agreeing to spend $500,000 to mitigate and monitor the ammonia levels. In 2004, Tyson was one of six poultry companies to pay a $7.3 million settlement fee to the city of Tulsa, Oklahoma, to settle charges that the use of chicken waste as fertilizer had created phosphorus pollution in Tulsa's main drinking water sources. In 2005, Tyson settled a $500,000 lawsuit related to air pollution in Kentucky. Tyson's processing plants generate a vast supply of animal fats. In late 2006, the company created a business unit called Tyson Renewable Energy to examine ways of commercializing the use of this leftover material by converting it into biofuels. The unit also examined the potential use of poultry litter to generate energy and other products. Tyson's 2010 Sustainability Report said that it had reduced water use by 7.6 percent between October 2004 and 2009, and reduced wastewater related permit exceedances by 5.4 percent during 2007–2009. However, the company reported a 51.9 percent increase in violation notices related to wastewater, storm water, and drinking water. The company reduced landfill solid waste by 12.5 percent during 2008–2009. As of 2010, six of Tyson Foods' wastewater treatment facilities capture biogas via enclosed anaerobic lagoons. Four of the systems use the biogas as an alternative fuel to natural gas; during 2008–2009, the four facilities used 1.8 billion cubic feet of biogas, replacing 1.3 billion cubic feet of natural gas and saving the company approximately $9.1 million. According to Tyson's 2012 Sustainability Report, the company reduced total water use by 4.7 percent during 2011–2012, but normalized water use increased 1 percent over the same period. Through conservation efforts and closures, the company reduced water use by 10.9 percent between October 2004 and 2012. During 2010–2012, Tyson Foods reduced wastewater related permit exceedances by 48 percent and notices of violations by 86 percent. Tyson reduced greenhouse gas emissions by approximately 8 percent during 2010–2011, and the company cut 145 million truck miles via lightweight equipment purchases, packaging improvements, and use of rail transport. In 2013, Tyson paid nearly $4 million in fines due to eight separate incidents between 2006 and 2010 where it accidentally released anhydrous ammonia, an extremely hazardous substance which causes chemical-type burns. These releases killed at least one worker and injured nearly a dozen others. In Newsweek's 2017 \"green ranking\", an environmental performance assessment of the largest public companies, Tyson Foods ranked number 223 in the U.S. and number 312 in the world. Tyson Foods worked with the World Resources Institute to set a goal for reducing greenhouse gas emissions 30 percent by 2030. The plan was accepted by the Science Based Targets initiative, a coalition of companies working to limit carbon emissions based on the goals of the Paris Agreement. According to Tyson's 2019 Sustainability Report, the company was on track to meet most of its sustainability goals and had decreased water use by 6.8 percent since 2015. Tyson Foods joined the United Nations Global Compact in 2019, and the report also states that the company has goals similar to the United Nations' Sustainable Development Goals. Environmental groups have blamed Tyson for polluting the Illinois River with poultry litter. A company spokesperson said the litter belongs to independent contract farmers and not to Tyson. To address the problem of poultry litter in watersheds, Tyson and four other poultry companies formed the non-profit organization BMPs in 2004. Tyson says that the organization has helped to move more than 1 million tons of poultry litter out of the Illinois River watershed, redistributing the litter to less nutrient-dense areas. In 2019, the Environmental Integrity Project identified Tyson as being a major discharger of pollution to waterways in East Texas. The high volumes of blood, urine, feces, and feathers discharged into East Texas rivers and lakes contribute to declining oxygen levels in the water, which endanger local animals, fish and habitat. The Environmental Integrity Project found that the Tyson plant in East Texas violated its Clean Water Act permit a dozen times over 2016–2017. In 2019, wastewater from a Tyson plant in Alabama polluted rivers and killed approximately 175,000 fish. The state of Alabama sued Tyson over the incident the following year. Also in 2019, Tyson Foods partnered with the Environmental Defense Fund to help farmers reduce nitrogen and erosion across 2 million acres of corn fields in the Midwestern United States and Pennsylvania. The same year, a Tyson building in Springdale, Arkansas, won a LEED silver certification for environmentally friendly design. As of January 2020, Tyson Foods' land stewardship and sustainable farming program had enrolled approximately 400,000 acres of corn, and planned to support improved environmental practices on 2 million acres of corn by the end of 2020. In 2020, Tyson Foods partnered with the nonprofit organization Proforest to complete a deforestation risk assessment, which concluded that approximately 94 percent of the company's land footprint is at low risk of being associated with deforestation. To address the remainder found to be at risk, in November the company announced a Forest Protection Standard focused on reducing deforestation risk in supply chains of cattle and beef, soy, palm oil, pulp, paper and packaging. In 2020, Tyson Foods received a SmartWay Excellence Award from the Environmental Protection Agency, recognizing \"top shipping (retailers and manufacturers) and logistics company partners for superior environmental performance\". In 2020, it was reported that Tyson Foods uses 4.89 million acres of land for soybeans and 5.2 million acres of corn for providing feed for their 6 million cows, 22 million hogs, and 2 billion chickens. A study by the Union of Concerned Scientists in 2018 found that only 5% (408,000 acres) of their land has been enrolled in sustainable practices. This is set to change though as Tyson sets their net zero gas house emissions by 2050. The farm land and fertilizer also have an effect on the environment as potent nitrous oxide is being released. For every one of Tyson's 10.1 million acres, fertilizer is being used which can increase the pounds of nitrous oxide per acre in a year from 0.5 to 3 depending on how much fertilizer is being used. Tyson can easily reduce their emissions by 2050 by starting to use less fertilizer and being more precise with their fertilizing. Tyson doesn't directly raise their livestock, as they hire private farms, but they are still responsible for the emissions released from their animals and the feed they use. Tyson is responsible for 6 million cows, which burp methane and release approximately 1.2 billion pounds of methane a year. Tyson also raises chickens and pigs, but they have a much smaller effect on the environment. The main greenhouse gas emissions that come from them are in their manure and are very minuscule compared to those of cows. Tyson has made strides to prevent animal waste being sent to landfills, as 6 of their plants have reached gold status, which means 95-99 percent of their waste is not ending up in a landfill. In 2024, a study by the Union of Concerned Scientists found that between 2018 and 2022 Tyson released 371 million pounds of pollutants, including nitrogen, phosphorus, chloride, oil, and cyanide, from just 41 slaughterhouses and processing plants into local waterways across the United States. Labor relations Workers' rights According to Celeste Monforton, professor of occupational health at George Washington University, 34 employees were injured at 10 Tyson meatpacking plants during January–September 2015, resulting in one amputation per month on average. Reporting on Monforton's findings in 2016, BuzzFeed News said Tyson Foods \"recently launched new programs to improve workplace safety communication, awareness and education.\" An Oxfam report issued in 2016 cited anonymous employees who stated they were routinely denied bathroom breaks; they wore adult diapers to work in order to get through the day. In 2017, Tyson Foods announced plans to provide regularly scheduled bathroom breaks and training on workers' rights for employees, \"give more attention to line speeds at plants\", and establish safety councils that involved workers. Additionally, the company announced plans for \"hiking wages, publicly sharing results of a third-party audit on worker conditions, increasing benefits to include more vacation and holidays, and expanding existing safety programs\". The plans stem from compliance audits started in 2012 and an occupational safety and health pilot program established in 2015. The announcement was made in conjunction with Oxfam America and United Food and Commercial Workers. By May 2018, hundreds of Tyson Foods workers at 27 plants had participated in the company's Upward Academy education program. In December 2024, Tyson and its subsidiary Keystone agreed to pay $115.5 million to settle an antitrust lawsuit, which alleged that the company had illegally conspired with other poultry processors to suppress workers' wages. Employment of illegal immigrants Tyson Foods was indicted on December 9, 2001, along with six employees, on charges that it conspired to smuggle illegal immigrants across the Mexican border to work in its processing plants. The 36-count indictment, which was unsealed at Federal District Court in Chattanooga, Tennessee, accused Tyson of arranging to transport illegal immigrant workers across the border and helping them to get counterfeit work papers for jobs at 15 Tyson plants. Prosecutors alleged that the conspiracy to import workers dated back to 1994. Of the six managers who were indicted, two accepted plea bargain deals, and one committed suicide a few months after being charged. In March 2003, a federal jury acquitted Tyson and its managers of having hired illegal immigrants as part of a conspiracy. In October 2006, a federal judge granted class-action status to a lawsuit brought by Tyson employees who allege that Tyson's practice of hiring illegal immigrants depresses wages 10–30%. The suit further contends that the company violated federal racketeering laws by conspiring with National Council of La Raza and League of United Latin American Countries not to question the employment applications of anyone with a Hispanic surname. Coronavirus (COVID-19) pandemic As the COVID-19 pandemic spread across the United States, officials including the sheriff in Black Hawk County, Iowa criticized Tyson Foods on April 17, 2020, for failing to close a Waterloo, Iowa plant where an outbreak of the disease began. Tyson closed the Waterloo plant on April 22. According to an Associated Press report, the company said the shutdown \"would deny a vital market to hog farmers and further disrupt the nation's meat supply\". Steve Stouffer, president of the fresh meats division at Tyson Foods, expressed some resistance to universal testing of their workers. \"Everybody wants to test meatpacking employees, but nobody is testing the communities around them to show what’s the baseline,\" Stouffer said, adding \"And until we know the baselines, my question has always been: Are we the cause or are we just the victim of our surroundings?\" On April 21, Tyson announced the closure of a plant in Center, Texas, which is located in Shelby County, a rural area with a rate of coronavirus infections about four times higher than the state average. A local physician reported that over half of the county's cases were associated with employees of the Tyson facility. On April 22, Tyson announced the closure of a pork processing plant in Logansport, Indiana. The president of the Indiana Farm Bureau said that the organization is \"extremely concerned about the closure of the Tyson pork processing facility. This is a devastating blow to the pork producers who sell hogs to Tyson.\" On April 23, Tyson announced that a beef processing plant in Wallula, Washington was closing. Tyson executive Steve Stouffer said, \"Unfortunately, the closure will mean reduced food supplies and presents problems to farmers who have no place to take their livestock. It’s a complicated situation across the supply chain. On April 26, John Tyson, chairman of the board, wrote in the New York Times that \"The food supply chain is breaking...There will be limited supply of our products available in grocery stores until we are able to reopen our facilities that are currently closed.\" In June 2020, ProPublica reported that well after outbreaks had occurred, Tyson did not implement recommended safety measures to protect its workers, such as physical distancing, plexiglass barriers, and wearing of face masks. On June 21, the government of China announced that it was suspending imports of chicken from a Tyson factory. The company confirmed that the affected facility was its Berry Street plant in Springdale, Arkansas. In July 2020, Tyson Foods said it would hire 200 nurses and administrative personnel, and begin administering coronavirus tests at all of its U.S. production facilities, as part of the company's response to the pandemic. Tyson's Chief Executive Noel White said that the company's investment in automation would likely increase in light of the pandemic. In August 2020, at least 10,261 Tyson workers were confirmed to have COVID-19 (out of a workforce of over 120,000). In November 2020 a wrongful-death lawsuit previously filed by the family of a Tyson employee, alleging \"willful and wanton disregard\" for employees' health and safety with regard to COVID-19, was amended with new allegations that a plant manager had organized a betting pool for supervisor and managers to bet on how many employees would be affected with COVID-19. In November 2020, Tyson suspended multiple top officials and retained the law firm Covington & Burling to conduct an investigation into these allegations. In December 2020, Tyson received the results of the investigation led by former US Attorney General and Covington & Burling partner Eric Holder, and terminated seven of its top managers at the Waterloo, Iowa plant. The Waterloo plant is Tyson's largest pork plant and was the centre of a COVID-19 outbreak that infected more than 1000 Tyson employees, killing six, before spreading into the broader community. Tyson did not publicly disclose the names of those terminated or the detailed findings of the report, but issued a statement saying that those terminated did not represent the company's core values. In August 2021, Tyson announced that all employees were required to be \"fully vaccinated\" with COVID-19 vaccines by November. The company offered employees a $200 incentive to get vaccinated. The mandate was suspended on October 31, 2022. Production Use of antibiotics In 2007, Tyson began labeling and advertising its chicken products as \"raised without antibiotics\". Tyson competitors Perdue Farms and Sanderson Farms sued, claiming that Tyson's claim violated truth-in-advertising/labeling standards. Tyson acknowledged using ionophores in chicken feed. Ionophores are used to control coccidiosis, a parasite common in poultry, and the medication is not used in human medicine. A federal judge ordered Tyson to stop making the \"raised without antibiotics\" claim by May 15, 2008. In June 2008, USDA inspectors discovered that Tyson had also been using gentamicin, an antibiotic, in unhatched eggs. USDA spokespeople stated that Tyson had not disclosed the use of this antibiotic to the agency, and they issued a letter informing Tyson that the \"raised without antibiotics\" claim was not truthful. A Tyson spokesperson acknowledged that the company uses the antibiotic and stated that its use is standard industry practice. The USDA had originally approved the \"raised without antibiotics\" label, but withdrew their approval after learning that Tyson used ionophores. Tyson and the USDA compromised on rewording Tyson's slogan as \"raised without antibiotics that impact antibiotic resistance in humans\", but the USDA later said that Tyson could not use that label either. In June 2008, Tyson agreed to voluntarily remove its \"raised without antibiotics\" label in future packaging and advertising. In 2015, Tyson Foods announced plans to stop feeding chickens with antibiotics used in human medicine. In 2017, the company announced plans to stop using all antibiotics on chickens for Tyson-branded breasts, nuggets, and wings. In 2023, Tyson introduced ionophores into their chicken feed and dropped the \"no antibiotics ever\" label from their chicken products. A USDA inspection announced in August 2024 found that 20% of tested beef samples on track to be labeled as antibiotic-free were positive for antibiotics. The advocacy group Farm Forward found, through a Freedom of Information Act request, that Tyson was one of several producers of beef that tested positive for antibiotics, alongside JBS and Cargill. Animal welfare Tyson Foods has been embroiled in numerous scandals related to animal abuse and cruelty. In response to undercover revelations of animal abuse, Tyson has responded by arguing that the undercover animal rights activists were at fault for the abuse by not actively preventing it. In 2006, Tyson completed a study to determine whether controlled atmosphere killing, which uses gas to render chickens unconscious before slaughter, could be a more humane practice than conventional electrical stunning. According to Bill Lovette, Tyson's senior group vice president of poultry and prepared foods, the study found no difference between the humaneness of the two methods. The company plans to ask scientists at the University of Arkansas to initiate a similar study to test these initial results. The research will be led by the newly created chair in Food Animal Wellbeing at the Dale Bumpers College of Agricultural, Food and Life Sciences of the University of Arkansas. Tyson has committed $1.5 million to help establish the chair, which will be involved in overseeing research and classes focused on the humane management and treatment of food animals. In 2012, Tyson introduced an auditing program known as FarmCheck to check how animals are treated by the company's suppliers. The program was introduced as a trial on certain hog farms, and was the first major program of its kind to apply penalties to producers for noncompliance. By 2020, FarmCheck had expanded to Tyson's poultry suppliers, and its poultry audits were certified by the Professional Animal Auditor Certification Organization. In 2014, after an NBC News reported on abuse of piglets at a Tyson pig farm in Oklahoma, Tyson announced new animal care guidelines, such as keeping sows in larger cages, installing video cameras in cages, using pain mitigation strategies in the castration of piglets, and avoiding killing piglets through blunt force. Animal rights activities called on Tyson to make the guidelines a \"mandate\" rather than a \"recommendation.\" In 2015, Tyson Foods severed ties with a supplier after Mercy For Animals published videos showing that employees at a Tyson supplier were stabbing, clubbing and stomping on chickens. A 2016 undercover investigation by the animal rights organization Compassion Over Killing showed workers at four separate Tyson processing plants throwing, punching and kicking chickens, as well as sticking plastic rods through their beaks. They also wrung birds' necks, ran over them with forklifts, and left injured birds in heaping piles to die. A 2017 investigation showed more abuse and cruelty towards chickens. After the 2017 investigation, Tyson responded by saying it would introduce a remote video auditing system to monitor treatment of chickens in its supply chain and hire off-site auditors. The company also started a pilot program for controlled atmosphere stunning, considered to be a more humane method of slaughter. Animal rights activists said the measure did not go far enough. In 2017, Matthew Prescott of the Humane Society of the United States criticized Tyson for failing to implement many of the animal welfare standards that other food suppliers were adopting. In 2020, Tyson worked with the University of Arkansas System Division of Agriculture to investigate the effects of lighting on broiler chicken welfare. Their research project, \"Effect of Variable Light Intensity Program on Broiler Gait Score, Stress and Central Positive Welfare in Commercial Broiler Farm\", received a $110,000 grant from the U.S. Poultry and Egg Association. Following a 2020 complaint, the Federal Trade Commission is investigating Tyson for making false and misleading advertising claims regarding the treatment of its chickens. Food recalls On January 30, 2019, Tyson Foods announced a recall for over 36,000 pounds of chicken nuggets that were at risk of being contaminated with small pieces of rubber. The recall followed allegations by consumers who submitted complaints to the U.S. Agriculture Department. Tyson identified the contaminated nuggets as those received by Arizona, California, Illinois, New Jersey, and Utah club store distribution centers. On March 21, 2019, the company issued a recall for 69,000 pounds of chicken strips potentially contaminated with pieces of metal, following six complaints submitted to the Food Safety and Inspection Service, including three alleged oral injuries. An expanded recall for nearly 12 million pounds of chicken strips was issued on May 4, 2019. On June 7, 2019, Tyson Foods announced a recall for over 190,000 pounds of chicken fritters which potentially contained hard plastic following reports from three consumers. The products were not sold in retail stores but supplied to various food service locations, including schools. On July 3, 2021, Tyson Foods announced a recall for approximately 8,955,296 pounds of ready-to-eat (RTE) chicken products that may be adulterated with Listeria monocytogenes. These frozen, fully cooked chicken products were produced between December 26, 2020, and April 13, 2021. Price manipulation In 2016, Maplevale sued Tyson and other poultry producers for alleged price fixing. Since the original filing, numerous other customers and consumers have filed similar lawsuits, which are consolidated in the Northern District of Illinois. The companies were accused of working together to restrict the supply of chickens and to manipulate chicken prices; these activities allegedly started in 2008. Tyson has denied the allegations, with a spokesperson calling them \"baseless.\" In 2018, a class-action lawsuit was filed against Tyson, along with other major pork producers including Hormel Foods, JBS, Seaboard, and Smithfield Foods, accusing the companies of conspiring to artificially raise the price of pork via the tech platform Agri Stats, thereby forcing consumers and restaurants to pay inflated prices for pork products. In October 2025, Tyson agreed to pay $85 million to settle the lawsuit. In June 2020, Tyson announced it was cooperating with the U.S. Department of Justice (DOJ) in relation to price fixing and bid rigging in the poultry industry. Tyson was cooperating under a leniency program whereby it would avoid criminal prosecution by providing aid to DOJ investigators. Just prior to the announcement, four poultry industry executives were indicted for conspiracy to engage in price fixing. In October 2020, Pilgrim's Pride agreed to a plea agreement and a settlement of $110 million. In March 2021, Tyson agreed to pay $221.5 million to poultry buyers to settle the price-fixing claims. In 2024, McDonald's Corporation sued JBS, National Beef, Cargill, and Tyson, along with their subsidiaries, for alleged price fixing."
}