{
  "ticker": "TT",
  "cik": "0001466258",
  "company_name": "Trane Technologies",
  "corrected_name": "Trane Technologies",
  "wiki_title_used": "Trane Technologies",
  "exists": true,
  "raw_text": "Trane Technologies plc is an American-Irish domiciled company focused on heating, ventilation, and air conditioning (HVAC) and refrigeration systems. The company traces its corporate history back more than 150 years and was created after a series of mergers and spin-offs. In 2008, HVAC manufacturer Trane was acquired by Ingersoll Rand, a US industrial tools manufacturer. In 2020, the tools business was spun off as Ingersoll Rand and the remaining company was renamed Trane Technologies.\n\nHistory\nHistory of Ingersoll Rand\nSimon Ingersoll founded Ingersoll Rock Drill Company in 1871 in New York, and in 1888, it combined with Sergeant Drill to form Ingersoll Sergeant Drill Company. The Ingersoll Sergeant Drill Company introduced the world's first direct-connected, electric motor-driven compressor. Also in 1871, brothers Addison Rand and Jasper Rand Jr. established Rand Drill Company with its main manufacturing plant in Tarrytown, New York. In 1905, the Ingersoll-Sergeant Drill Company merged with the Rand Drill Company to form Ingersoll Rand.\nIn 2002, shareholders voted to move the company's incorporation to Bermuda to capitalize on the savings on U.S. corporate income taxes on products sold overseas. Moving the company on paper cost only US$27,000 per year, with tax savings estimated at US$40 million annually.\nIn July 2004, the Drilling Solutions business was sold to the Swedish company Atlas Copco. This included factories in United States, China, Japan making above ground rotary blasthole and deephole drilling machines. Atlas Copco purchased the company for US$225M. Drilling Solutions was a legacy business from the company's founding.\nIn May 2007, the company announced it was looking into a sale or spin-off of its Bobcat, utility equipment, and attachments divisions.  With this divestiture, Ingersoll Rand was left with the industrial technologies, climate control technologies, and security technologies sectors.  This completed the transformation from the diversified machinery label to a diversified industrial company.\nIn February 2007, Volvo, a Swedish truck and construction equipment manufacturer, announced its agreement to buy the road construction equipment division of Ingersoll-Rand for $1.3 billion in cash to expand its operations in the United States. The road unit manufactures and sells asphalt paving equipment, compaction equipment, milling machines and construction-related material handling equipment and generated net revenues of approximately $850 million for 2006. The sale included manufacturing facilities in Pennsylvania, Germany, China and India, as well as 20 distribution and service facilities in the United States. The business employs approximately 2,000 people worldwide.\nOn 30 July 2007, Ingersoll Rand announced that the utility and attachment businesses had been sold to Doosan Infracore, part of the South Korean chaebol Doosan, for US$4.9 billion.\nOn 17 December 2007, Ingersoll Rand announced an offer to purchase HVAC supplier Trane, in a stock and cash transaction. The purchase was approved by Trane's stockholders, and the unit became a part of the climate control technologies business, which is divided into commercial and residential business units, each reporting directly to the chairman. The sale was completed on 5 June 2008.\n\nHistory of Trane\nIn 1885, James Trane, a Norwegian immigrant, opened his own plumbing and pipe-fitting shop in La Crosse, Wisconsin. He designed a new type of low-pressure steam heating system, Trane vapor heating. Reuben Trane, James' son, earned a mechanical engineering degree in 1910 and joined his father's plumbing firm. In 1913, James and Reuben incorporated The Trane Company. By 1916, the Tranes focused their attention on manufacturing heating products. Reuben's invention of the convector radiator in 1923, which replaced the heavy, bulky, cast-iron radiators that prevailed at the time, was a major success. Trane's first air conditioning unit was developed in 1931.\nIn 1984, Trane was acquired by the American Standard Companies. The company was broken up in 2007, with the remaining business renamed Trane. Shortly after, in 2008, Trane was acquired by Ingersoll Rand.\n\nAfter the Ingersoll Rand and Trane merger\nIngersoll Rand announced in March 2009 its intention to relocate its offices from Bermuda to Ireland, a decision which shareholders approved in a vote.\nOn 16 November 2010, the company became a constituent of the S&P 500 Index, replacing Pactiv Corporation.\nOn 2 December 2013,  Ingersoll Rand completed the spinoff of its security hardware sector into a standalone business named Allegion, which maintains commercial and residential security hardware brands such as Schlage, Von Duprin, LCN, Bricard, Interflex, Normbau and CISA.\nIn August 2014, it was announced that Ingersoll-Rand would acquire the centrifugal compression unit of Cameron International for $850 million.\nIn October 2018, Ingersoll Rand received takeover interest in its power tools business, which was slated to be worth up to $750 million in a potential sale. Power Tools is the oldest business with the least revenue, and the decision of whether to sell this unit or not has not been announced.\n\nSpin-off of Ingersoll Rand\nIn 2020 Ingersoll Rand sold its non-refrigeration businesses via a Reverse Morris Trust transaction to Gardner Denver, rebranding themselves as Trane Technologies and focusing on their Commercial HVAC, Residential HVAC (Trane) and Refrigeration Transport businesses (Thermo King).\n\nCorporate affairs\nTrane Technologies's headquarters are in Swords, County Dublin, Ireland. Its European headquarters are in Sint-Stevens-Woluwe, Zaventem, Belgium. Its Asia headquarters are in Tower B of City Center of Shanghai in Shanghai, People's Republic of China. Its North American headquarters are in Davidson, North Carolina.\n\nBrands and subsidiaries\nThe company's brands and subsidiaries include:\n\nTrane – subsidiary brand manufacturing heating, ventilation, and air conditioning (HVAC) equipment\nAmerican Standard Heating & Air Conditioning – HVAC equipment brand\nAmeristar – Value HVAC equipment brand of American Standard\nOxbox – Value HVAC equipment brand\nRunTru – Value HVAC equipment brand\nThermocold – European HVAC equipment brand\nFarrar Scientific – Life sciences refrigeration brand\nHelmer Scientific - Life sciences refrigeration brand\nDiversified Laboratory Repair (DLR) - maintenance and repair services of laboratory equipment\nThermo King – subsidiary brand manufacturing refrigeration units for transport industry, HVAC units for buses and trains\nFrigoblock – European refrigeration unit brand\nICS Cool Energy – Refrigeration and HVAC equipment for European industrial customers\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Trane Technologies plc:",
  "clean_text": "Trane Technologies plc is an American-Irish domiciled company focused on heating, ventilation, and air conditioning (HVAC) and refrigeration systems. The company traces its corporate history back more than 150 years and was created after a series of mergers and spin-offs. In 2008, HVAC manufacturer Trane was acquired by Ingersoll Rand, a US industrial tools manufacturer. In 2020, the tools business was spun off as Ingersoll Rand and the remaining company was renamed Trane Technologies. History History of Ingersoll Rand Simon Ingersoll founded Ingersoll Rock Drill Company in 1871 in New York, and in 1888, it combined with Sergeant Drill to form Ingersoll Sergeant Drill Company. The Ingersoll Sergeant Drill Company introduced the world's first direct-connected, electric motor-driven compressor. Also in 1871, brothers Addison Rand and Jasper Rand Jr. established Rand Drill Company with its main manufacturing plant in Tarrytown, New York. In 1905, the Ingersoll-Sergeant Drill Company merged with the Rand Drill Company to form Ingersoll Rand. In 2002, shareholders voted to move the company's incorporation to Bermuda to capitalize on the savings on U.S. corporate income taxes on products sold overseas. Moving the company on paper cost only US$27,000 per year, with tax savings estimated at US$40 million annually. In July 2004, the Drilling Solutions business was sold to the Swedish company Atlas Copco. This included factories in United States, China, Japan making above ground rotary blasthole and deephole drilling machines. Atlas Copco purchased the company for US$225M. Drilling Solutions was a legacy business from the company's founding. In May 2007, the company announced it was looking into a sale or spin-off of its Bobcat, utility equipment, and attachments divisions. With this divestiture, Ingersoll Rand was left with the industrial technologies, climate control technologies, and security technologies sectors. This completed the transformation from the diversified machinery label to a diversified industrial company. In February 2007, Volvo, a Swedish truck and construction equipment manufacturer, announced its agreement to buy the road construction equipment division of Ingersoll-Rand for $1.3 billion in cash to expand its operations in the United States. The road unit manufactures and sells asphalt paving equipment, compaction equipment, milling machines and construction-related material handling equipment and generated net revenues of approximately $850 million for 2006. The sale included manufacturing facilities in Pennsylvania, Germany, China and India, as well as 20 distribution and service facilities in the United States. The business employs approximately 2,000 people worldwide. On 30 July 2007, Ingersoll Rand announced that the utility and attachment businesses had been sold to Doosan Infracore, part of the South Korean chaebol Doosan, for US$4.9 billion. On 17 December 2007, Ingersoll Rand announced an offer to purchase HVAC supplier Trane, in a stock and cash transaction. The purchase was approved by Trane's stockholders, and the unit became a part of the climate control technologies business, which is divided into commercial and residential business units, each reporting directly to the chairman. The sale was completed on 5 June 2008. History of Trane In 1885, James Trane, a Norwegian immigrant, opened his own plumbing and pipe-fitting shop in La Crosse, Wisconsin. He designed a new type of low-pressure steam heating system, Trane vapor heating. Reuben Trane, James' son, earned a mechanical engineering degree in 1910 and joined his father's plumbing firm. In 1913, James and Reuben incorporated The Trane Company. By 1916, the Tranes focused their attention on manufacturing heating products. Reuben's invention of the convector radiator in 1923, which replaced the heavy, bulky, cast-iron radiators that prevailed at the time, was a major success. Trane's first air conditioning unit was developed in 1931. In 1984, Trane was acquired by the American Standard Companies. The company was broken up in 2007, with the remaining business renamed Trane. Shortly after, in 2008, Trane was acquired by Ingersoll Rand. After the Ingersoll Rand and Trane merger Ingersoll Rand announced in March 2009 its intention to relocate its offices from Bermuda to Ireland, a decision which shareholders approved in a vote. On 16 November 2010, the company became a constituent of the S&P 500 Index, replacing Pactiv Corporation. On 2 December 2013, Ingersoll Rand completed the spinoff of its security hardware sector into a standalone business named Allegion, which maintains commercial and residential security hardware brands such as Schlage, Von Duprin, LCN, Bricard, Interflex, Normbau and CISA. In August 2014, it was announced that Ingersoll-Rand would acquire the centrifugal compression unit of Cameron International for $850 million. In October 2018, Ingersoll Rand received takeover interest in its power tools business, which was slated to be worth up to $750 million in a potential sale. Power Tools is the oldest business with the least revenue, and the decision of whether to sell this unit or not has not been announced. Spin-off of Ingersoll Rand In 2020 Ingersoll Rand sold its non-refrigeration businesses via a Reverse Morris Trust transaction to Gardner Denver, rebranding themselves as Trane Technologies and focusing on their Commercial HVAC, Residential HVAC (Trane) and Refrigeration Transport businesses (Thermo King). Corporate affairs Trane Technologies's headquarters are in Swords, County Dublin, Ireland. Its European headquarters are in Sint-Stevens-Woluwe, Zaventem, Belgium. Its Asia headquarters are in Tower B of City Center of Shanghai in Shanghai, People's Republic of China. Its North American headquarters are in Davidson, North Carolina. Brands and subsidiaries The company's brands and subsidiaries include: Trane – subsidiary brand manufacturing heating, ventilation, and air conditioning (HVAC) equipment American Standard Heating & Air Conditioning – HVAC equipment brand Ameristar – Value HVAC equipment brand of American Standard Oxbox – Value HVAC equipment brand RunTru – Value HVAC equipment brand Thermocold – European HVAC equipment brand Farrar Scientific – Life sciences refrigeration brand Helmer Scientific - Life sciences refrigeration brand Diversified Laboratory Repair (DLR) - maintenance and repair services of laboratory equipment Thermo King – subsidiary brand manufacturing refrigeration units for transport industry, HVAC units for buses and trains Frigoblock – European refrigeration unit brand ICS Cool Energy – Refrigeration and HVAC equipment for European industrial customers"
}