{
  "ticker": "TTD",
  "cik": "0001671933",
  "company_name": "Trade Desk (The)",
  "corrected_name": "The Trade Desk",
  "wiki_title_used": "The Trade Desk",
  "exists": true,
  "raw_text": "The Trade Desk, Inc. (stylized as theTradeDesk) is an American multinational technology company that specializes in real-time programmatic marketing automation technologies, products, and services, designed to personalize digital content delivery to users.\nThe Trade Desk is headquartered in Ventura, California. It is the largest independent demand-side platform in the world, competing against DoubleClick by Google, Facebook Ads, and others.\nThe company continued to grow since its founding in 2009. As of 2021, it offers a self-service publishing platform for brands & advertisers, a data management platform for analytics & segmentation, and enterprise APIs. It has over 225 partners worldwide, and is responsible for delivering personalized content on Spotify.\nThe Trade Desk has been recognized for its omni-channel approach to programmatic marketing automation, with strong data analytics capabilities, fast response-times, and support for various connected devices, online platforms, and media formats. It reported a 95% customer retention rate for 27 straight quarters in 2020, and an annual revenue of US$836 million in the same year.\n\nHistory\nEarly years\nThe Trade Desk was co-founded in 2009 by Jeff Green and David Pickles. They met at Microsoft after it had acquired Green's real-time digital advertising auction firm, AdECN, in 2007. By 2012, the company was included as an alpha partner in Facebook’s launch of the real-time bidding (RTB) advertising platform, Facebook Exchange.\nIn 2015, The Trade Desk was named among the top 10 of America’s Most Promising Companies by Forbes. Founders Green and Pickles were also named as Ernst & Young Entrepreneurs of The Year 2015 in the Greater Los Angeles region.\n\nInitial public offering\nOn September 21, 2016, The Trade Desk became a public company. The company reached a market cap of US$40 billion by 2021.\n\nPost-IPO growth\nIn 2017, The Trade Desk integrated connected TV buying and measurement directly into its platform; acquired marketing insights firm AdBrain; and partnered with fraud prevention firm White Ops to block fraudulent ad traffic prior to purchase. The firm also improved transparency in programmatic buying by enabling buyers to see all selling or reselling parties to a bid request.\nIn 2018, the firm launched its programmatic ad buying platform in China, giving access to Chinese media companies, such as Alibaba, Tencent and Baidu Exchange Services. It also launched new AI tools: an AI forecasting engine named Koa, a new user interface, new tools for mapping strategies called The Trade Desk Planner, and a proprietary global user identity resolution tool called Unified ID.\nIn 2019, Amazon opened connected TV (CTV) Apps integrated with Amazon Publisher Services, enabling the purchase of ad inventory for third-party TV content provider The Trade Desk, through Amazon Fire TV devices.\nIn September 2019, The Trade Desk launched an advertising campaign, \"Media for Humankind\", to position itself as a \"more transparent digital advertising\" alternative to Google and Facebook.\nIn mid-2020, Unified ID 2.0 (UID 2.0) launched as a second iteration to leverage a post-cookie internet using encrypted email and phone number data to create a secure identity standard. The identity resolution software was adopted by Disney and Paramount, as well as by major advertisers, including Procter & Gamble and Unilever. In early 2022, The Trade Desk launched OpenPath, granting advertisers direct access to its premium digital advertising inventory. Publishers using OpenPath include Conde Nast, Reuters, and The Washington Post.\nIn March 2024, NBCUniversal announced that its broadcast content for the Paris 2024 Summer Olympics would be available, in partnership with The Trade Desk, to online automated programmatic marketers, for the first time.\nThe company has consistently been named to annual lists by, among others, Fortune magazine, and was included with the Forbes Global 2000 in 2022.\nIn May 2024, Netflix announced its first expansion of its advertising partnerships to include The Trade Desk, Magnite, and Google DV360.\n\nFinancials\nThe Trade Desk raised $2.5 million of venture capital in March, 2010. Investors included venture capital firms Founder Collective and IA Ventures, and angel investors Jerry Neumann and Josh Stylman.\nIn 2017, revenue rose 52 percent to $308 million, then rose to $477 million in 2018. In 2019, third-quarter revenue was reported as $164 million, attributed to the growth of connected TV advertising.\nThe Trade Desk finished 2022 with a record total spent on the platform of $7.8 billion, and annual revenue of over $1.5 billion.\nAfter 33 consecutive earning periods or meeting (or exceeding) financial expectations, The Trade Desk missed analyst expectations by about 2% in Q4 2024. Despite reporting growth, the stock tumbled by more than 32% in February 2025 after missing this target. The Trade Desk's revenues for the quarter were $741 million; total 2024 revenues grew 26%, reaching $2.4 billion.\n\nWorkforce and offices\nThe firm currently employs around 3,500 people in 25 office locations worldwide. It was ranked among the 100 Best Medium Workplaces by Fortune in 2018, and have been continually named in the list since then.\n\nSee also\nList of advertising technology companies\n\nReferences\nExternal links\nOfficial website\nThe Current (News resource by theTradeDesk)\nBusiness data for The Trade Desk, Inc.:",
  "clean_text": "The Trade Desk, Inc. (stylized as theTradeDesk) is an American multinational technology company that specializes in real-time programmatic marketing automation technologies, products, and services, designed to personalize digital content delivery to users. The Trade Desk is headquartered in Ventura, California. It is the largest independent demand-side platform in the world, competing against DoubleClick by Google, Facebook Ads, and others. The company continued to grow since its founding in 2009. As of 2021, it offers a self-service publishing platform for brands & advertisers, a data management platform for analytics & segmentation, and enterprise APIs. It has over 225 partners worldwide, and is responsible for delivering personalized content on Spotify. The Trade Desk has been recognized for its omni-channel approach to programmatic marketing automation, with strong data analytics capabilities, fast response-times, and support for various connected devices, online platforms, and media formats. It reported a 95% customer retention rate for 27 straight quarters in 2020, and an annual revenue of US$836 million in the same year. History Early years The Trade Desk was co-founded in 2009 by Jeff Green and David Pickles. They met at Microsoft after it had acquired Green's real-time digital advertising auction firm, AdECN, in 2007. By 2012, the company was included as an alpha partner in Facebook’s launch of the real-time bidding (RTB) advertising platform, Facebook Exchange. In 2015, The Trade Desk was named among the top 10 of America’s Most Promising Companies by Forbes. Founders Green and Pickles were also named as Ernst & Young Entrepreneurs of The Year 2015 in the Greater Los Angeles region. Initial public offering On September 21, 2016, The Trade Desk became a public company. The company reached a market cap of US$40 billion by 2021. Post-IPO growth In 2017, The Trade Desk integrated connected TV buying and measurement directly into its platform; acquired marketing insights firm AdBrain; and partnered with fraud prevention firm White Ops to block fraudulent ad traffic prior to purchase. The firm also improved transparency in programmatic buying by enabling buyers to see all selling or reselling parties to a bid request. In 2018, the firm launched its programmatic ad buying platform in China, giving access to Chinese media companies, such as Alibaba, Tencent and Baidu Exchange Services. It also launched new AI tools: an AI forecasting engine named Koa, a new user interface, new tools for mapping strategies called The Trade Desk Planner, and a proprietary global user identity resolution tool called Unified ID. In 2019, Amazon opened connected TV (CTV) Apps integrated with Amazon Publisher Services, enabling the purchase of ad inventory for third-party TV content provider The Trade Desk, through Amazon Fire TV devices. In September 2019, The Trade Desk launched an advertising campaign, \"Media for Humankind\", to position itself as a \"more transparent digital advertising\" alternative to Google and Facebook. In mid-2020, Unified ID 2.0 (UID 2.0) launched as a second iteration to leverage a post-cookie internet using encrypted email and phone number data to create a secure identity standard. The identity resolution software was adopted by Disney and Paramount, as well as by major advertisers, including Procter & Gamble and Unilever. In early 2022, The Trade Desk launched OpenPath, granting advertisers direct access to its premium digital advertising inventory. Publishers using OpenPath include Conde Nast, Reuters, and The Washington Post. In March 2024, NBCUniversal announced that its broadcast content for the Paris 2024 Summer Olympics would be available, in partnership with The Trade Desk, to online automated programmatic marketers, for the first time. The company has consistently been named to annual lists by, among others, Fortune magazine, and was included with the Forbes Global 2000 in 2022. In May 2024, Netflix announced its first expansion of its advertising partnerships to include The Trade Desk, Magnite, and Google DV360. Financials The Trade Desk raised $2.5 million of venture capital in March, 2010. Investors included venture capital firms Founder Collective and IA Ventures, and angel investors Jerry Neumann and Josh Stylman. In 2017, revenue rose 52 percent to $308 million, then rose to $477 million in 2018. In 2019, third-quarter revenue was reported as $164 million, attributed to the growth of connected TV advertising. The Trade Desk finished 2022 with a record total spent on the platform of $7.8 billion, and annual revenue of over $1.5 billion. After 33 consecutive earning periods or meeting (or exceeding) financial expectations, The Trade Desk missed analyst expectations by about 2% in Q4 2024. Despite reporting growth, the stock tumbled by more than 32% in February 2025 after missing this target. The Trade Desk's revenues for the quarter were $741 million; total 2024 revenues grew 26%, reaching $2.4 billion. Workforce and offices The firm currently employs around 3,500 people in 25 office locations worldwide. It was ranked among the 100 Best Medium Workplaces by Fortune in 2018, and have been continually named in the list since then."
}