{
  "ticker": "TTWO",
  "cik": "0000946581",
  "company_name": "Take-Two Interactive",
  "corrected_name": "Take-Two Interactive",
  "wiki_title_used": "Take-Two Interactive",
  "exists": true,
  "raw_text": "Take-Two Interactive Software, Inc. is an American video game holding company based in New York City founded by Ryan Brant in September 1993.\nThe company owns three major publishing labels: Rockstar Games, Zynga and 2K, which operate internal game development studios. Take-Two created the Private Division label to support publishing from independent developers, though it sold the label in 2024 to private equity. The company also formed Ghost Story Games which was a former 2K studio under the name Irrational Games. The company acquired the developers Socialpoint, Playdots and Nordeus to establish itself in the mobile game market. The company also owns 50% of professional esports organization NBA 2K League through NBA Take-Two Media. Take-Two's combined portfolio includes franchises such as BioShock, Borderlands, Civilization, Grand Theft Auto, NBA 2K, WWE 2K, and Red Dead among others.\nAs of April 2025, it is one of the largest publicly traded game companies globally with an estimated market cap of US$41 billion.\n\nHistory\n1993–2000: Formation and initial growth\nTake-Two Interactive was founded by Ryan Ashley Brant (1971-2019), the son of media executive and Interview co-owner Peter Brant. Ryan Brant had attended the Hotchkiss School and the Wharton School of the University of Pennsylvania, graduating in May 1992. He began his career in May 1991, working for his father as the chief operating officer of Stewart, Tabori & Chang, a publisher of illustrated books, until August 1993. As Brant wanted to forge his own path, he decided to create a video game publishing company. He stated \"I wanted to get into a business where I could raise capital as a younger guy. In technology, people expect you to be a younger person.\" An initial US$1.5 million in funding was raised from his family and private investors. Take-Two was incorporated under the Delaware General Corporation Law on September 30, 1993, with Brant (21 years old at the time) as chief executive officer (CEO). The business was launched with assistance from John Antinori and Mark Seremet. Seremet sold his stake in the company in 1998. Early on, Take-Two had a location in Latrobe, Pennsylvania. By June 1994, the company had acquired and absorbed InterOptica, a software publisher owned by Wan Chai and headed by Catherine Winchester (later Heald); the latter became Take-Two's first president. Later that month, Take-Two struck a deal with GameTek that would see the publisher distribute five of Take-Two's games worldwide.\nStarting with Star Crusader in September 1994, Take-Two found its first major success with games that included full motion video with well-known live actors performing the parts, following the success that Mechadeus had with The Daedalus Encounter which featured Tia Carrere. Take-Two hired Dennis Hopper, among others, to star in parts for Hell: A Cyberpunk Thriller (1994), which sold over 300,000 copies over the following year and established profit for the company. This was followed by Ripper (1996), of which US$625,000 of its US$2.5 million budget was used to hire actors such as Christopher Walken, Karen Allen, and Burgess Meredith. The success of both these games, as well as earlier titles, led to a publishing agreement between Take-Two and Acclaim Entertainment to publish Take-Two's titles, as well as obtaining overseas distribution. Take-Two also secured a license with Sony Computer Entertainment to publish on the PlayStation line of consoles. In February 1995, GameTek acquired a stake in Take-Two, aligning the studio with its own Alternative Reality Technologies. By July 1995, Take-Two had established its head office in the Silicon Alley area of New York City. Take-Two expanded in its Latrobe location and, in September 1996, took over the second floor of its office building, which had been occupied by the Chestnut Ridge Chapter of the American Red Cross.\nAround 1996, the company was making about US$10 million, but Brant wanted to further expand the company, and made its first acquisition of Mission Studios and publishing its JetFighter III game in 1996. Brant decided to secure additional funds for acquisition by taking the company public. The company announced this intent in April 1997, looking to raise $8.2 million. The company had its initial public offering (IPO) on April 15, 1997, being listed under the ticker symbol TTWO on the NASDAQ stock exchange. The opening price was $5.50, above the expected $5, and on its first day rose to $5.75. From the IPO, the company gained about US$6.5 million along with US$4 million on venture fund promissory notes. At this time, Peter Brant had been the largest shareholder in Take-Two at 25% owned through Bridgehampton Investors LP, which also had Ryan Brant as general partner. The additional funds allowed Take-Two to acquire GameTek's European operations, its internal Alternative Reality Technologies studio (later renamed Rockstar Toronto), and the rights to GameTek's Dark Colony, The Quivering, The Reap, Jeopardy! and Wheel of Fortune games. The company hired Kelly Sumner, a GameTek executive director, as part of this purchase. Additionally, the company acquired Inventory Management Systems, Creative Alliance Group, and Alliance Inventory Management, three video game distribution companies that helped to extend Take-Two's reach into the retail market.\nIn the same year, Take-Two stepped in as the publisher of Monkey Hero. Its developer, Blam!, had been struggling financially after the game's original publisher, BMG Interactive, was shut down by BMG Entertainment (a unit of Bertelsmann), its parent company. In March 1998, Take-Two acquired all assets of BMG Interactive for 1.85 million shares (16% of Take-Two's common stock), worth about US$14.2 million. In the previous year, the United Kingdom-based DMA Design and BMG Entertainment had just released Grand Theft Auto, and while it financially performed well but was not a critical success in Europe, it had sparked controversy over the use of violence in video games, with United States Senator Joe Lieberman speaking out strongly against it. Seeing the opportunity to capture attention on the game, Brant had initiated the acquisition of BMG as to acquire the Grand Theft Auto property, and at the same time, contacted BMG's Sam and Dan Houser (both instrumental to getting Grand Theft Auto to market), Terry Donovan, and Jamie King to found a new label within Take-Two, called Rockstar Games for which to develop more titles like it. Electronic Arts' (EA) 2008 CEO, John Riccitiello, stated that, with the establishing of Rockstar, Take-Two effectively invented the \"label\" corporate structure, which EA followed into in 2008. With the rights to Grand Theft Auto, Take-Two expanded its publication into North America, and the game became Take-Two's first financial success with over 1.5 million copies sold.\nTake-Two also began taking on distribution capabilities, acquiring various distribution firms such as DirectSoft Australia for the Oceania market. Notably, in August 1998, Take-Two acquired Jack of All Games, an America game distributor, for about US$16.8 million. Take-Two subsequently bundled many of its existing and future distribution outlets under the Jack of All Games brand.\nIn 1999, Take-Two acquired DMA Design (ultimately renamed Rockstar North), and invested into Gathering of Developers and Bungie (eventually transferred over to Microsoft Game Studios). In September, the company also acquired Triad Distributors and Global Star Software, a video game distributor and publisher, respectively, both founded in 1993 by Craig McGauley and Damian Cristiani and operating out of the same offices in Concord, Ontario, with the same management team. Israeli developer Pixel Broadband Studios was acquired for $50.4 million in March 2000, before Take-Two sold it off to Gameplay.com in October that year, receiving £34.1 million in Gameplay.com shares in return.\n\n2001–2006: Further acquisitions and regulatory investigations\nIn February 2001, Brant stepped down as CEO of Take-Two to serve as its chairman, being replaced in the former role by Sumner. Around this time, the company had 658 employees. With Rockstar, Take-Two invested into developments of sequels to Grand Theft Auto, including Grand Theft Auto 2 (1999), and Grand Theft Auto III (2001) along with sequels, Grand Theft Auto: Vice City (2002) and Grand Theft Auto: San Andreas (2004). By 2003, Take-Two had revenues exceeding US$1 billion. In 2002, the Take-Two name was dropped as a publishing label when the short-lived publishing label Gotham Games was introduced. In 2004, Take-Two paid US$22.3 million to Infogrames for the rights to the Civilization series. The company had also planned to acquire Vivendi Universal Games for $1 billion.\nIn 2005, Take-Two began a host of acquisitions, spending more than US$80 million buying game developers. One of its largest acquisitions was for the development studios Visual Concepts and Kush Games from Sega for about US$32 million in January 2005. Both studios had been extensively behind several sports simulation games, branded through ESPN, and typically released updated versions each year, using a 2K brand to differentiate versions (such as ESPN NFL 2K5). In 2004, Take-Two had struck a deal with Sega to help publish these titles. Just prior to Take-Two's acquisition, Electronic Arts announced it had secured the exclusive rights to create video games based on the National Football League (NFL) and a fifteen-year branding deal with ESPN, effectively killing Visual Concepts' own NFL title and devaluing their others games. This decision led Sega to abandon the sports-game market. Take-Two acquired these studios and unique branding (including the 2K brand), as well as negotiated for exclusive rights with Major League Baseball for video games. A day after announcing these acquisitions, Take-Two established their 2K publishing label to maintain the 2K brand, moving several planned games from their budget software label, Global Star, to 2K. Take-Two further realigned the other existing internal studios — Indie Built, Venom Games, PopTop Software and Frog City Software, and Take-Two Licensing — within this new structure.\nAfter the formation of 2K, Take-Two completed other major acquisitions. Firaxis Games was acquired in November 2005 for around US$27 million; Take-Two had already supported the studio by using their acquisition of the Civilization license to support publishing of Civilization IV. Irrational Games was acquired around January 2006 for about US$10 million, including both its Boston and its Canberra studio. At the time Irrational had already established a publishing deal with Take-Two for their upcoming BioShock game. With the deal, Irrational became part of the 2K label. It also acquired PAM Development from the Gaia Capital Group for US$11.4 million, giving them access to the Top Spin series of tennis games.\nHowever, during this period, the U.S. Securities and Exchange Commission (SEC) began examining Take-Two's business records, based on complaints filed from 2001 that Take-Two's earnings did not seem to match figures of game sales reported by NPD Group. The SEC's formal complaint found that the company had purportedly sold products to distributors as a \"parking transaction\" for a quarter, as to artificially increase their revenues for investors, which it estimated was a US$60 million fraud. A lawsuit was filed against Take-Two in December 2001, alleging that the company had lied to shareholders. Take-Two initially restated seven quarters of past financial results in February 2002, then five years in January 2004. Brant stepped down as chairman in March, being succeeded by Richard Roedel. After the SEC's issuance of the complaint in 2005, Take-Two agreed to pay a US$7.5 million fine, along with Brant and other executives paying fines totaling around US$6.4 million. Brant, who had remained with the company in the non-executive role of \"Vice President of Production\", ultimately resigned from the company in October 2006, following a four-month disability leave due to a bad back.\nIn 2007, a separate investigation by the SEC found further issues with Brant and two other executives of the company. In an industry-wide sweep against options backdating (receiving shares when they are priced high but backdating their ownership to when they were priced low), the SEC had found Brant had received backdating options of over 2.1 million shares, though he had excised all options upon his 2006 resignation. Brant pleaded guilty to falsifying business records, but agreed to co-operate with the SEC and instead of receiving up to four years in prison, was fined US$7.3 million and barred from holding any \"control management positions\" in a publicly traded company. Brant died of cardiac arrest in March 2019 at the age of 47.\nFurther troubling Take-Two during this period was criticism and legal actions taken against the Hot Coffee mod, a user-made modification to Grand Theft Auto: San Andreas that unlocked a hidden graphic sex scene that was built into the game, with concerned politicians and consumers stating the scene belied the game's ESRB content rating. Actions taken against Take-Two included an investigation by the Federal Trade Commission for deceptive advertising, to which Take-Two and Rockstar settled in 2006 on fines for any future violations of content ratings. Take-Two completed a US$20.1 million settlement related to class-action lawsuits filed against it in 2005 over the Hot Coffee mod, as well as to a class-action lawsuit brought by shareholders over the options backdating fraud, in September 2009.\n\n2007–2008: Shareholder takeover and attempted buy-out\nA fire had damaged part of the Take-Two headquarters building in New York in 2006. In early January 2007, Take-Two relocated the headquarters for 2K to Novato, California to 65,000 square feet of space at Hamilton Landing, an office park that had repurposed the former hangar structures from the Hamilton Army Airfield. Later that year in September, Take-Two established a partnership with Nickelodeon and launched a new label, 2K Play, designed for publishing of family-friendly titles alongside 2K's 2K Games and 2K Sports sub-labels, absorbing the remaining publishing duties of the Global Star label. In December 2007, Take-Two established 2K Marin (named after Marin County, where Novato is located) and expanded its presence at Hamilton Landing.\n\nDue to the various SEC investigations and the Hot Coffee controversy, investors in Take-Two discussed the possibility of taking over the company and ousting the current management at its next board meeting in March 2007. There were also issues with Take-Two failing to make its revenue targets, having lost US$163.3 million in 2006. Investors OppenheimerFunds Inc., S.A.C. Capital Management, Tudor Investment Corp., D.E. Shaw Valence Portfolios and ZelnickMedia held 46% of the company's stock at this point, and were looking to put ZelnickMedia's Strauss Zelnick as the chairman of the board while ousting long-standing management and board members. Zelnick had previously been president and CEO of BMG's North American division at the time of the sale of BMG Interactive to Take-Two, a move he had been against, believing that BMG could have capitalized on the video game sector more. Following BMG, Zelnick had been COO of 20th Century Fox and CEO of Crystal Dynamics. He founded ZelnickMedia in 2001 as a private equity firm to focus on media and interactive entertainment investments. Industry analyst Michael Pachter stated that a takeover would be best for Take-Two, as the present management \"completely abdicated any responsibility for the oversight of the options-granting policy. A more responsible board would have committed hari-kari.\" CEO Paul Eibeler, who had replaced Brant after his resignation, had tried to find a buyer for Take-Two after the investors filed their intent with the SEC. Among the potential buyers were EA, but a deal could not be negotiated before the meeting. The takeover was successfully agreed to by stockholders on March 29, 2007, with Zelnick naming Ben Feder, a partner at ZelnickMedia, as the new CEO. As of July 2015, Strauss Zelnick is the largest single shareholder by voting power.\nThe company announced a major restructuring in mid-2007, following the takeover. With the move of the 2K labels to Novato, the executive, management, distribution and sales areas were evaluated to align these by business discipline rather than geography. Subsequently, the company let go about 5 to 15% of its approximately 2100 employees, closed down some of its European offices and centralizing these in its Geneva location, and looked to get out of the distribution market by looking for buyers of Jack of All Games.\nIn mid-February 2008, EA made a US$25-per-share all-cash transaction offer worth around US$1.9 billion to the board of Take-Two, subsequently revising it to US$26 per share after being rejected and making the offer known to the public. At the time, Take-Two's stock was valued around US$10 per share. EA CEO John Riccitiello said that EA had previously considered a deal for Take-Two in the previous year when they were approached by Eibeler, however, with Activision's acquisition of Vivendi Games in December 2007, EA was looking to resecure itself as one of the top video game publishers with the acquisition of Take-Two. While Take-Two had been discussing the potential of a buyout to a large media company after the shareholder takeover, Zelnick and the board rejected the offer, with Zelnick stating \"We didn't slam the door, we just said look, the price is not right and the time is wrong\". Take-Two offered to discuss the offer after Grand Theft Auto IV's release on April 29, 2008, which many considered to be the lucrative property that EA desired. An acquisition would have ended EA's main competition in sports video games. EA continued to extend its bid offer throughout 2008, but by September 2008, EA decided to back away and let the offer expire, as Take-Two continued to call EA's cash offer as inadequate.\n\n2008–2018: Continued growth\nIn September 2008, Take-Two established an outsourcing agreement with Ditan Distribution LLC, at the time owned by Cinram, a Canadian manufacturer of optical media. Through the agreement, Take-Two offloaded all distributing duties from Jack of All Games to Ditan, while establishing the means for Jack of All Games to license and distribute third-party titles. Subsequently, in December 2009, Take-Two sold Jack of All Games to Synnex for about US$43 million, leaving the distribution market and focusing solely on development and publishing.\nIn 2010, Ben Feder stepped down as CEO, and was replaced by Zelnick, who remains the company's chairman and CEO. In January 2013, while being dissolved, THQ sold the rights of the WWE wrestling games series to Take-Two. Subsequently, 2K Sports has published annual WWE 2K games as part of its lineup.\nAround 2013, Take-Two began to repurchase about 7.5 million outstanding shares of the company (about 10%), based on the company's projections that it would remain profitable over the next several years. As part of this, the company bought back around 12 million shares owned by Carl Icahn, about 11% of the total shares, for about US$203 million. Icahn had been seen as favoring selling the company to a buyer. This subsequently led to three board members who had been recommended on the board by Icahn to resign. The move to buy back shares was seen by analysts of the company's assurance in Grand Theft Auto V, which was released in September 2013. Grand Theft Auto V has since sold nearly 100 million units by 2018, making it one of the most successful video games ever and bringing an estimated US$6 billion to Take-Two, increasing its stock value by more than 600%.\nIn December 2013, former Marvel editor-in-chief Bill Jemas announced that he had joined Take-Two to start a \"graphic fiction imprint\". The imprint, Double Take Comics, was launched in October 2014, but ultimately was not successful and was shuttered in November 2016. Leslie Benzies, former President of Rockstar North, took sabbatical leave from Rockstar on September 1, 2014. In January 2016 it was announced that he had left the company. On April 12, 2016, Benzies started legal action against Rockstar and Take-Two claiming $150 million in unpaid royalties. Take-Two had invested into mobile-game developer Scopely in July 2016. On February 1, 2017, the company acquired social and mobile game developer Social Point for about US$250 million to enter into the mobile gaming industry.\nIn that same month, Take-Two and the National Basketball Association (NBA) announced a partnership to create the NBA 2K League, a professional eSports league based on the NBA 2K games, and the first eSports league to be managed by a professional sports league. Teams for the League are to be partially sponsored by existing NBA teams, so that there would be eSports equivalent teams for each of the thirty professional NBA teams. The inaugural season is planned to launch in May 2018.\nOn May 31, 2017, Take-Two Interactive acquired Kerbal Space Program. Later, Take-Two announced the formation of its Private Division publishing label on December 14, 2017. Private Division was established to fund and publish games by mid-size independent development studios, such as Kerbal Space Program, and had four planned games from separate studios at its launch.\nThe company completed its move of its New York headquarters from NoHo to more than 61,000 square feet of space in Bryant Park in early 2018. According to Dan Houser, Rockstar Games required to expand in the two companies' shared headquarters and thus asked the Take-Two executives to move. On March 8, 2018, Zelnick attended a White House meeting held by the 45th president of the United States, Donald Trump, along with various other attendees involved with the video game industry, and members of Congress, to discuss video game violence in the wake of the Stoneman Douglas High School shooting.\nOn March 9, 2018, S&P Global announced the addition of Take-Two Interactive to the S&P 500, joining two other major video game publishers EA and Activision Blizzard. Similar to the situation in 2013, Take-Two started buying back around US$308 million of its stock (estimated to be about 2.5% of the outstanding stock), predicated on similar expectations that Red Dead Redemption 2, to be released in October 2018, would similarly boost the company's profits as Grand Theft Auto V had done.\nOn March 29, 2018, Benzies' litigation against Rockstar and Take-Two suffered a significant setback when the companies succeeded in dismissing 12 out of 18 of his claims, though the court did rule that Benzies \"remains entitled to receive certain royalties\" as part of his compensation.\nSometime in 2018, Take-Two levied a legal warning against Benzies' new company Royal Circus Games, citing the similarity of its acronym (RCG) to Rockstar Games (RSG) as an infringement of intellectual property; due to this, Benzies later renamed his company Build a Rocket Boy Games in October 2018. Take-Two had also decried their employment of Rockstar North staff as a deceptive tactic to create an affiliation between them.\nTake-Two and the NBA signed a seven-year, US$1.1 billion licensing deal to extend Take-Two's rights to develop the NBA 2K games in January 2019. Analysts estimated that this represented at least 15% of Take-Two's revenue from the sale of NBA 2K games, atypical of other license deals, due to the growing popularity of the series.\n\n2019–present: Studio expansions\nA then-yet-to-be named studio under the 2K brand in the Silicon Valley region of the San Francisco Bay Area was established by Take-Two in February 2019. The studio is led by Michael Condrey, formerly of Sledgehammer Games and Visceral Games, and was initially working on an unannounced project. A year later, it was announced that the studio would be officially named 31st Union, that it was opening a second studio in Spain, and that it was focusing on \"an ambitious and inspired new IP\".\nOn February 7, 2019, Benzies' litigation with Take-Two had officially come to an end. All parties involved in the case successfully executed a confidential settlement, with each agreeing to bear its own costs and expenses, including, without limitation, attorney's fees.\nIn May 2019, Rockstar Games announced that they had acquired Dhruva Interactive from Starbreeze Studios for $7.9 million, with the sale having been finalized later that same month. The company had been merged into Rockstar India, which added an additional 320 employees to the studio.\nIn September 2019, Rockstar Games announced that they had released their own game launcher, a digital distribution, digital rights management, multiplayer and communications service.\nTake-Two established a new, yet-to-be named studio under Private Division in February 2020, later named Intercept Games, located in Seattle to take on the development of Kerbal Space Program 2. The new studio staff included more than a dozen former members of Star Theory Games who had been working on the title, including Jeremy Ables and Nate Simpson from Star Theory, which had been previously handling the development of the game but outside of Take-Two's structure.\nVia 2K Sports, Take-Two established a new publishing agreement with the NFL in March 2020 to start republishing NFL games starting in 2021. While EA's Madden series will coexist and remain the official game of the NFL, while 2K's are called \"non-simulation football game experiences\" to distinguish from EA's games.\nIn August 2020, Take-Two announced it was acquiring mobile game developer Playdots (developer of the mobile games Dots, Two Dots and Dots & Co.) for $192 million in cash and stock with the acquisition expected to be completed in Q3 2020.\nIn October 2020, it was announced that Take-Two had acquired Dundee-based Ruffian Games (known for their work on Halo: The Master Chief Collection and Crackdown 3) after a year-long development partnership on an undisclosed partnership; following the acquisition, Ruffian became part of Rockstar Games as Rockstar Dundee.\nTake-Two offered to buyout Codemasters in November 2020 in a deal valued approximately US$973 million. While the offer awaited regulatory approval and was expected to be complete by early 2021, both Take-Two and Codemasters' board of directors confirmed the deal. However, Take-Two's bid was subsequently trumped by Electronic Arts in December 2020, which offered US$1.2 billion (US$7.98 per share), and agreed to acquire Codemasters. Take-Two formally withdrew its offer in January 2021.\nThe Public Investment Fund of Saudi Arabia acquired 3.9 million shares of Take-Two, valued at $826 million, in February 2021.\n2K acquired HB Studios in March 2021, who previously developed PGA Tour 2K21 and The Golf Club 2019 featuring PGA Tour under 2K Sports' publishing labels. The acquisition includes the rights to the PGA Tour games, which have the official endorsement of the PGA Tour itself. Additionally, 2K announced they had secured a contract with Tiger Woods, who had previously been a key figure for Electronic Arts' PGA Tour series, as an executive director and consultant for future 2K PGA Tour games as well as his likeness for the games. Later that month, 2K acquired the games division of HookBang based in Austin, Texas, which had supported work on the NBA 2K series in the past. The division was relocated to a new Austin location and rebranded as Visual Concepts Austin to continue support for that series.\nIn June 2021, Take-Two made its largest acquisition to date with the $378 million acquisition of Top Eleven developer Nordeus, further expanding its mobile game division, which, as of July 2021, is known as T2 Mobile Games.\nTake-Two Interactive announced its intent to acquire the mobile developer Zynga in January 2022, in a cash-and-stock deal with a value of $12.7 billion, with Take-Two acquiring all outstanding shares of Zynga at $9.86 apiece. The deal was expected to close in June. Take-Two said that the acquisition would help boost its presence in the mobile gaming market, stating \"We see tremendous untapped potential to bring Take-Two’s renowned console and PC properties to mobile, a high-priority initiative that will be energized by the addition of Zynga’s leading development, publishing, and live operations teams.\" Both shareholders of the companies approved the merger on May 19, 2022, and the closing of the transaction took effect on May 23, 2022.\nIn October 2022, Take-Two announced that Playdots would be shut down, with control of Two Dots being transferred to Zynga.\nIn March 2023, Take-Two acquired mobile games subscription service GameClub for an undisclosed sum. That same month, Take-Two had layoffs impacting an unspecified number of employees at publishing label Private Division and 30 employees at Firaxis Games.\nIn March 2024, Take-Two announced that it would acquire The Gearbox Entertainment Company, the parent of Gearbox Software from Embracer Group for $460 million. As part of the deal, Embracer would retain certain studios and titles that were held under Gearbox Entertainment. The acquisition was completed on June 12, 2024.\nIn April 2024, Take-Two announced it would be laying off 5% of its workforce (579 employees) as part of a cost-reduction program. It also cancelled several unannounced projects. Take-Two shut down Intercept Games two months later.\nIn July 2024, the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA) labor union, of which numerous video game voice actors are members of, would initiate a labor strike against a number of video publishers, including Take Two Interactive, over concerns about lack of AI protections related to not only video game actors, but also the use of AI to replicate an actor's voice, or create a digital replica of their likeness.\n\nCompany structure\nTake-Two's executive offices and worldwide headquarters are located in New York City. The company runs its European operations from Windsor, Berkshire and its Asian operations from Singapore. As of 2018, Take-Two's primary business is through two self-owned publishing labels. One label is Rockstar Games, also located in New York City, and is specialized on development and publication of action-adventure games such as Grand Theft Auto. The other label is 2K, headquartered in Novato, California, and is composed of its divisions 2K Games, 2K Sports, and 2K Play. The 2K Sports division handles the development and publication of Take-Two's sports simulation games, such as the NBA 2K series. 2K Play covers family-friendly and children's video games produced by Take-Two's studios. 2K Games handles nearly all other production from Take-Two's internal development studios as well as titles from selected third parties.\nFinally, Take-Two owns Zynga, a developer for the mobile game market. With this structure in place since 1997–1998, each label is an incorporated principal operating businesses and has a higher degree of autonomy, and each with their own infrastructure and resources, management, and profit and loss strategies.\nTake-Two has divested itself of its older manufacturing and distribution operations in favor of digital publication and third-party retail distribution. Since 2016, around half of the company's revenues are from digital distribution, whether from digital sales of games through personal computer or consoles, or through video game monetization of its computer, console, and mobile titles.\nIn November, Take-Two's CEO Strauss Zelnick confirmed that the company had sold Private Division to an undisclosed buyer for an undisclosed sum, as to allow Take-Two to focus on AAA and mobile games. The company also affirmed the closure of Roll7 and Intercept Games. Take-Two would continue to support No Rest for the Wicked, while five other titles were transferred to the new buyer.\n\nPublishers\nFormer\nDevelopers\nFormer\nOther holdings\nTake-Two equally shares control of the NBA 2K League, a competitive esports league based on its NBA 2K series, along with the National Basketball Association.\nThe company has an undisclosed minority interest in Scopely. It had previously held 19.9% interest in Bungie, which it turned over to Microsoft Game Studios on their acquisition in June 2000, in exchange for receiving the rights to Bungie's Myth and Oni IPs, and the license to use the Halo engine to produce two new games. Take-Two also had a 2.3% interest in Twitch, which was bought out upon the service's acquisition by Amazon in 2014, receiving US$22 million from the sale.\n\nLitigation\nTake-Two has used trademark dilution complaints to prevent other publishers and developers from registering trademarks comparable to Take-Two's own trademarks, such as blocking trademark registration that involve \"rockstar\", \"bully\", \"2K\", and the capital letter \"R\". The publisher filed a dispute against Hazelight Studios to block its attempt to trademark It Takes Two, due to the similarity of its name to Take-Two's. Hazelight was forced to abandon the trademark application, making it more difficult to promote the game.\nTake-Two has also been active in blocking the release of mods for Grand Theft Auto games. While some of these mods had used assets from the original games and gave valid reason for Take-Two to protect its copyrights, other mods that Take-Two had targeted were made from legal reverse engineering of the game, making Take-Two's claims contentious. Take-Two has clarified that it had no issue with mods intended for single-player games that were legally made, but would take action against other types of mods.\n\nGames published\nNotes\nReferences\nExternal links\nOfficial website\nBusiness data for Take-Two Interactive Software, Inc.:",
  "clean_text": "Take-Two Interactive Software, Inc. is an American video game holding company based in New York City founded by Ryan Brant in September 1993. The company owns three major publishing labels: Rockstar Games, Zynga and 2K, which operate internal game development studios. Take-Two created the Private Division label to support publishing from independent developers, though it sold the label in 2024 to private equity. The company also formed Ghost Story Games which was a former 2K studio under the name Irrational Games. The company acquired the developers Socialpoint, Playdots and Nordeus to establish itself in the mobile game market. The company also owns 50% of professional esports organization NBA 2K League through NBA Take-Two Media. Take-Two's combined portfolio includes franchises such as BioShock, Borderlands, Civilization, Grand Theft Auto, NBA 2K, WWE 2K, and Red Dead among others. As of April 2025, it is one of the largest publicly traded game companies globally with an estimated market cap of US$41 billion. History 1993–2000: Formation and initial growth Take-Two Interactive was founded by Ryan Ashley Brant (1971-2019), the son of media executive and Interview co-owner Peter Brant. Ryan Brant had attended the Hotchkiss School and the Wharton School of the University of Pennsylvania, graduating in May 1992. He began his career in May 1991, working for his father as the chief operating officer of Stewart, Tabori & Chang, a publisher of illustrated books, until August 1993. As Brant wanted to forge his own path, he decided to create a video game publishing company. He stated \"I wanted to get into a business where I could raise capital as a younger guy. In technology, people expect you to be a younger person.\" An initial US$1.5 million in funding was raised from his family and private investors. Take-Two was incorporated under the Delaware General Corporation Law on September 30, 1993, with Brant (21 years old at the time) as chief executive officer (CEO). The business was launched with assistance from John Antinori and Mark Seremet. Seremet sold his stake in the company in 1998. Early on, Take-Two had a location in Latrobe, Pennsylvania. By June 1994, the company had acquired and absorbed InterOptica, a software publisher owned by Wan Chai and headed by Catherine Winchester (later Heald); the latter became Take-Two's first president. Later that month, Take-Two struck a deal with GameTek that would see the publisher distribute five of Take-Two's games worldwide. Starting with Star Crusader in September 1994, Take-Two found its first major success with games that included full motion video with well-known live actors performing the parts, following the success that Mechadeus had with The Daedalus Encounter which featured Tia Carrere. Take-Two hired Dennis Hopper, among others, to star in parts for Hell: A Cyberpunk Thriller (1994), which sold over 300,000 copies over the following year and established profit for the company. This was followed by Ripper (1996), of which US$625,000 of its US$2.5 million budget was used to hire actors such as Christopher Walken, Karen Allen, and Burgess Meredith. The success of both these games, as well as earlier titles, led to a publishing agreement between Take-Two and Acclaim Entertainment to publish Take-Two's titles, as well as obtaining overseas distribution. Take-Two also secured a license with Sony Computer Entertainment to publish on the PlayStation line of consoles. In February 1995, GameTek acquired a stake in Take-Two, aligning the studio with its own Alternative Reality Technologies. By July 1995, Take-Two had established its head office in the Silicon Alley area of New York City. Take-Two expanded in its Latrobe location and, in September 1996, took over the second floor of its office building, which had been occupied by the Chestnut Ridge Chapter of the American Red Cross. Around 1996, the company was making about US$10 million, but Brant wanted to further expand the company, and made its first acquisition of Mission Studios and publishing its JetFighter III game in 1996. Brant decided to secure additional funds for acquisition by taking the company public. The company announced this intent in April 1997, looking to raise $8.2 million. The company had its initial public offering (IPO) on April 15, 1997, being listed under the ticker symbol TTWO on the NASDAQ stock exchange. The opening price was $5.50, above the expected $5, and on its first day rose to $5.75. From the IPO, the company gained about US$6.5 million along with US$4 million on venture fund promissory notes. At this time, Peter Brant had been the largest shareholder in Take-Two at 25% owned through Bridgehampton Investors LP, which also had Ryan Brant as general partner. The additional funds allowed Take-Two to acquire GameTek's European operations, its internal Alternative Reality Technologies studio (later renamed Rockstar Toronto), and the rights to GameTek's Dark Colony, The Quivering, The Reap, Jeopardy! and Wheel of Fortune games. The company hired Kelly Sumner, a GameTek executive director, as part of this purchase. Additionally, the company acquired Inventory Management Systems, Creative Alliance Group, and Alliance Inventory Management, three video game distribution companies that helped to extend Take-Two's reach into the retail market. In the same year, Take-Two stepped in as the publisher of Monkey Hero. Its developer, Blam!, had been struggling financially after the game's original publisher, BMG Interactive, was shut down by BMG Entertainment (a unit of Bertelsmann), its parent company. In March 1998, Take-Two acquired all assets of BMG Interactive for 1.85 million shares (16% of Take-Two's common stock), worth about US$14.2 million. In the previous year, the United Kingdom-based DMA Design and BMG Entertainment had just released Grand Theft Auto, and while it financially performed well but was not a critical success in Europe, it had sparked controversy over the use of violence in video games, with United States Senator Joe Lieberman speaking out strongly against it. Seeing the opportunity to capture attention on the game, Brant had initiated the acquisition of BMG as to acquire the Grand Theft Auto property, and at the same time, contacted BMG's Sam and Dan Houser (both instrumental to getting Grand Theft Auto to market), Terry Donovan, and Jamie King to found a new label within Take-Two, called Rockstar Games for which to develop more titles like it. Electronic Arts' (EA) 2008 CEO, John Riccitiello, stated that, with the establishing of Rockstar, Take-Two effectively invented the \"label\" corporate structure, which EA followed into in 2008. With the rights to Grand Theft Auto, Take-Two expanded its publication into North America, and the game became Take-Two's first financial success with over 1.5 million copies sold. Take-Two also began taking on distribution capabilities, acquiring various distribution firms such as DirectSoft Australia for the Oceania market. Notably, in August 1998, Take-Two acquired Jack of All Games, an America game distributor, for about US$16.8 million. Take-Two subsequently bundled many of its existing and future distribution outlets under the Jack of All Games brand. In 1999, Take-Two acquired DMA Design (ultimately renamed Rockstar North), and invested into Gathering of Developers and Bungie (eventually transferred over to Microsoft Game Studios). In September, the company also acquired Triad Distributors and Global Star Software, a video game distributor and publisher, respectively, both founded in 1993 by Craig McGauley and Damian Cristiani and operating out of the same offices in Concord, Ontario, with the same management team. Israeli developer Pixel Broadband Studios was acquired for $50.4 million in March 2000, before Take-Two sold it off to Gameplay.com in October that year, receiving £34.1 million in Gameplay.com shares in return. 2001–2006: Further acquisitions and regulatory investigations In February 2001, Brant stepped down as CEO of Take-Two to serve as its chairman, being replaced in the former role by Sumner. Around this time, the company had 658 employees. With Rockstar, Take-Two invested into developments of sequels to Grand Theft Auto, including Grand Theft Auto 2 (1999), and Grand Theft Auto III (2001) along with sequels, Grand Theft Auto: Vice City (2002) and Grand Theft Auto: San Andreas (2004). By 2003, Take-Two had revenues exceeding US$1 billion. In 2002, the Take-Two name was dropped as a publishing label when the short-lived publishing label Gotham Games was introduced. In 2004, Take-Two paid US$22.3 million to Infogrames for the rights to the Civilization series. The company had also planned to acquire Vivendi Universal Games for $1 billion. In 2005, Take-Two began a host of acquisitions, spending more than US$80 million buying game developers. One of its largest acquisitions was for the development studios Visual Concepts and Kush Games from Sega for about US$32 million in January 2005. Both studios had been extensively behind several sports simulation games, branded through ESPN, and typically released updated versions each year, using a 2K brand to differentiate versions (such as ESPN NFL 2K5). In 2004, Take-Two had struck a deal with Sega to help publish these titles. Just prior to Take-Two's acquisition, Electronic Arts announced it had secured the exclusive rights to create video games based on the National Football League (NFL) and a fifteen-year branding deal with ESPN, effectively killing Visual Concepts' own NFL title and devaluing their others games. This decision led Sega to abandon the sports-game market. Take-Two acquired these studios and unique branding (including the 2K brand), as well as negotiated for exclusive rights with Major League Baseball for video games. A day after announcing these acquisitions, Take-Two established their 2K publishing label to maintain the 2K brand, moving several planned games from their budget software label, Global Star, to 2K. Take-Two further realigned the other existing internal studios — Indie Built, Venom Games, PopTop Software and Frog City Software, and Take-Two Licensing — within this new structure. After the formation of 2K, Take-Two completed other major acquisitions. Firaxis Games was acquired in November 2005 for around US$27 million; Take-Two had already supported the studio by using their acquisition of the Civilization license to support publishing of Civilization IV. Irrational Games was acquired around January 2006 for about US$10 million, including both its Boston and its Canberra studio. At the time Irrational had already established a publishing deal with Take-Two for their upcoming BioShock game. With the deal, Irrational became part of the 2K label. It also acquired PAM Development from the Gaia Capital Group for US$11.4 million, giving them access to the Top Spin series of tennis games. However, during this period, the U.S. Securities and Exchange Commission (SEC) began examining Take-Two's business records, based on complaints filed from 2001 that Take-Two's earnings did not seem to match figures of game sales reported by NPD Group. The SEC's formal complaint found that the company had purportedly sold products to distributors as a \"parking transaction\" for a quarter, as to artificially increase their revenues for investors, which it estimated was a US$60 million fraud. A lawsuit was filed against Take-Two in December 2001, alleging that the company had lied to shareholders. Take-Two initially restated seven quarters of past financial results in February 2002, then five years in January 2004. Brant stepped down as chairman in March, being succeeded by Richard Roedel. After the SEC's issuance of the complaint in 2005, Take-Two agreed to pay a US$7.5 million fine, along with Brant and other executives paying fines totaling around US$6.4 million. Brant, who had remained with the company in the non-executive role of \"Vice President of Production\", ultimately resigned from the company in October 2006, following a four-month disability leave due to a bad back. In 2007, a separate investigation by the SEC found further issues with Brant and two other executives of the company. In an industry-wide sweep against options backdating (receiving shares when they are priced high but backdating their ownership to when they were priced low), the SEC had found Brant had received backdating options of over 2.1 million shares, though he had excised all options upon his 2006 resignation. Brant pleaded guilty to falsifying business records, but agreed to co-operate with the SEC and instead of receiving up to four years in prison, was fined US$7.3 million and barred from holding any \"control management positions\" in a publicly traded company. Brant died of cardiac arrest in March 2019 at the age of 47. Further troubling Take-Two during this period was criticism and legal actions taken against the Hot Coffee mod, a user-made modification to Grand Theft Auto: San Andreas that unlocked a hidden graphic sex scene that was built into the game, with concerned politicians and consumers stating the scene belied the game's ESRB content rating. Actions taken against Take-Two included an investigation by the Federal Trade Commission for deceptive advertising, to which Take-Two and Rockstar settled in 2006 on fines for any future violations of content ratings. Take-Two completed a US$20.1 million settlement related to class-action lawsuits filed against it in 2005 over the Hot Coffee mod, as well as to a class-action lawsuit brought by shareholders over the options backdating fraud, in September 2009. 2007–2008: Shareholder takeover and attempted buy-out A fire had damaged part of the Take-Two headquarters building in New York in 2006. In early January 2007, Take-Two relocated the headquarters for 2K to Novato, California to 65,000 square feet of space at Hamilton Landing, an office park that had repurposed the former hangar structures from the Hamilton Army Airfield. Later that year in September, Take-Two established a partnership with Nickelodeon and launched a new label, 2K Play, designed for publishing of family-friendly titles alongside 2K's 2K Games and 2K Sports sub-labels, absorbing the remaining publishing duties of the Global Star label. In December 2007, Take-Two established 2K Marin (named after Marin County, where Novato is located) and expanded its presence at Hamilton Landing. Due to the various SEC investigations and the Hot Coffee controversy, investors in Take-Two discussed the possibility of taking over the company and ousting the current management at its next board meeting in March 2007. There were also issues with Take-Two failing to make its revenue targets, having lost US$163.3 million in 2006. Investors OppenheimerFunds Inc., S.A.C. Capital Management, Tudor Investment Corp., D.E. Shaw Valence Portfolios and ZelnickMedia held 46% of the company's stock at this point, and were looking to put ZelnickMedia's Strauss Zelnick as the chairman of the board while ousting long-standing management and board members. Zelnick had previously been president and CEO of BMG's North American division at the time of the sale of BMG Interactive to Take-Two, a move he had been against, believing that BMG could have capitalized on the video game sector more. Following BMG, Zelnick had been COO of 20th Century Fox and CEO of Crystal Dynamics. He founded ZelnickMedia in 2001 as a private equity firm to focus on media and interactive entertainment investments. Industry analyst Michael Pachter stated that a takeover would be best for Take-Two, as the present management \"completely abdicated any responsibility for the oversight of the options-granting policy. A more responsible board would have committed hari-kari.\" CEO Paul Eibeler, who had replaced Brant after his resignation, had tried to find a buyer for Take-Two after the investors filed their intent with the SEC. Among the potential buyers were EA, but a deal could not be negotiated before the meeting. The takeover was successfully agreed to by stockholders on March 29, 2007, with Zelnick naming Ben Feder, a partner at ZelnickMedia, as the new CEO. As of July 2015, Strauss Zelnick is the largest single shareholder by voting power. The company announced a major restructuring in mid-2007, following the takeover. With the move of the 2K labels to Novato, the executive, management, distribution and sales areas were evaluated to align these by business discipline rather than geography. Subsequently, the company let go about 5 to 15% of its approximately 2100 employees, closed down some of its European offices and centralizing these in its Geneva location, and looked to get out of the distribution market by looking for buyers of Jack of All Games. In mid-February 2008, EA made a US$25-per-share all-cash transaction offer worth around US$1.9 billion to the board of Take-Two, subsequently revising it to US$26 per share after being rejected and making the offer known to the public. At the time, Take-Two's stock was valued around US$10 per share. EA CEO John Riccitiello said that EA had previously considered a deal for Take-Two in the previous year when they were approached by Eibeler, however, with Activision's acquisition of Vivendi Games in December 2007, EA was looking to resecure itself as one of the top video game publishers with the acquisition of Take-Two. While Take-Two had been discussing the potential of a buyout to a large media company after the shareholder takeover, Zelnick and the board rejected the offer, with Zelnick stating \"We didn't slam the door, we just said look, the price is not right and the time is wrong\". Take-Two offered to discuss the offer after Grand Theft Auto IV's release on April 29, 2008, which many considered to be the lucrative property that EA desired. An acquisition would have ended EA's main competition in sports video games. EA continued to extend its bid offer throughout 2008, but by September 2008, EA decided to back away and let the offer expire, as Take-Two continued to call EA's cash offer as inadequate. 2008–2018: Continued growth In September 2008, Take-Two established an outsourcing agreement with Ditan Distribution LLC, at the time owned by Cinram, a Canadian manufacturer of optical media. Through the agreement, Take-Two offloaded all distributing duties from Jack of All Games to Ditan, while establishing the means for Jack of All Games to license and distribute third-party titles. Subsequently, in December 2009, Take-Two sold Jack of All Games to Synnex for about US$43 million, leaving the distribution market and focusing solely on development and publishing. In 2010, Ben Feder stepped down as CEO, and was replaced by Zelnick, who remains the company's chairman and CEO. In January 2013, while being dissolved, THQ sold the rights of the WWE wrestling games series to Take-Two. Subsequently, 2K Sports has published annual WWE 2K games as part of its lineup. Around 2013, Take-Two began to repurchase about 7.5 million outstanding shares of the company (about 10%), based on the company's projections that it would remain profitable over the next several years. As part of this, the company bought back around 12 million shares owned by Carl Icahn, about 11% of the total shares, for about US$203 million. Icahn had been seen as favoring selling the company to a buyer. This subsequently led to three board members who had been recommended on the board by Icahn to resign. The move to buy back shares was seen by analysts of the company's assurance in Grand Theft Auto V, which was released in September 2013. Grand Theft Auto V has since sold nearly 100 million units by 2018, making it one of the most successful video games ever and bringing an estimated US$6 billion to Take-Two, increasing its stock value by more than 600%. In December 2013, former Marvel editor-in-chief Bill Jemas announced that he had joined Take-Two to start a \"graphic fiction imprint\". The imprint, Double Take Comics, was launched in October 2014, but ultimately was not successful and was shuttered in November 2016. Leslie Benzies, former President of Rockstar North, took sabbatical leave from Rockstar on September 1, 2014. In January 2016 it was announced that he had left the company. On April 12, 2016, Benzies started legal action against Rockstar and Take-Two claiming $150 million in unpaid royalties. Take-Two had invested into mobile-game developer Scopely in July 2016. On February 1, 2017, the company acquired social and mobile game developer Social Point for about US$250 million to enter into the mobile gaming industry. In that same month, Take-Two and the National Basketball Association (NBA) announced a partnership to create the NBA 2K League, a professional eSports league based on the NBA 2K games, and the first eSports league to be managed by a professional sports league. Teams for the League are to be partially sponsored by existing NBA teams, so that there would be eSports equivalent teams for each of the thirty professional NBA teams. The inaugural season is planned to launch in May 2018. On May 31, 2017, Take-Two Interactive acquired Kerbal Space Program. Later, Take-Two announced the formation of its Private Division publishing label on December 14, 2017. Private Division was established to fund and publish games by mid-size independent development studios, such as Kerbal Space Program, and had four planned games from separate studios at its launch. The company completed its move of its New York headquarters from NoHo to more than 61,000 square feet of space in Bryant Park in early 2018. According to Dan Houser, Rockstar Games required to expand in the two companies' shared headquarters and thus asked the Take-Two executives to move. On March 8, 2018, Zelnick attended a White House meeting held by the 45th president of the United States, Donald Trump, along with various other attendees involved with the video game industry, and members of Congress, to discuss video game violence in the wake of the Stoneman Douglas High School shooting. On March 9, 2018, S&P Global announced the addition of Take-Two Interactive to the S&P 500, joining two other major video game publishers EA and Activision Blizzard. Similar to the situation in 2013, Take-Two started buying back around US$308 million of its stock (estimated to be about 2.5% of the outstanding stock), predicated on similar expectations that Red Dead Redemption 2, to be released in October 2018, would similarly boost the company's profits as Grand Theft Auto V had done. On March 29, 2018, Benzies' litigation against Rockstar and Take-Two suffered a significant setback when the companies succeeded in dismissing 12 out of 18 of his claims, though the court did rule that Benzies \"remains entitled to receive certain royalties\" as part of his compensation. Sometime in 2018, Take-Two levied a legal warning against Benzies' new company Royal Circus Games, citing the similarity of its acronym (RCG) to Rockstar Games (RSG) as an infringement of intellectual property; due to this, Benzies later renamed his company Build a Rocket Boy Games in October 2018. Take-Two had also decried their employment of Rockstar North staff as a deceptive tactic to create an affiliation between them. Take-Two and the NBA signed a seven-year, US$1.1 billion licensing deal to extend Take-Two's rights to develop the NBA 2K games in January 2019. Analysts estimated that this represented at least 15% of Take-Two's revenue from the sale of NBA 2K games, atypical of other license deals, due to the growing popularity of the series. 2019–present: Studio expansions A then-yet-to-be named studio under the 2K brand in the Silicon Valley region of the San Francisco Bay Area was established by Take-Two in February 2019. The studio is led by Michael Condrey, formerly of Sledgehammer Games and Visceral Games, and was initially working on an unannounced project. A year later, it was announced that the studio would be officially named 31st Union, that it was opening a second studio in Spain, and that it was focusing on \"an ambitious and inspired new IP\". On February 7, 2019, Benzies' litigation with Take-Two had officially come to an end. All parties involved in the case successfully executed a confidential settlement, with each agreeing to bear its own costs and expenses, including, without limitation, attorney's fees. In May 2019, Rockstar Games announced that they had acquired Dhruva Interactive from Starbreeze Studios for $7.9 million, with the sale having been finalized later that same month. The company had been merged into Rockstar India, which added an additional 320 employees to the studio. In September 2019, Rockstar Games announced that they had released their own game launcher, a digital distribution, digital rights management, multiplayer and communications service. Take-Two established a new, yet-to-be named studio under Private Division in February 2020, later named Intercept Games, located in Seattle to take on the development of Kerbal Space Program 2. The new studio staff included more than a dozen former members of Star Theory Games who had been working on the title, including Jeremy Ables and Nate Simpson from Star Theory, which had been previously handling the development of the game but outside of Take-Two's structure. Via 2K Sports, Take-Two established a new publishing agreement with the NFL in March 2020 to start republishing NFL games starting in 2021. While EA's Madden series will coexist and remain the official game of the NFL, while 2K's are called \"non-simulation football game experiences\" to distinguish from EA's games. In August 2020, Take-Two announced it was acquiring mobile game developer Playdots (developer of the mobile games Dots, Two Dots and Dots & Co.) for $192 million in cash and stock with the acquisition expected to be completed in Q3 2020. In October 2020, it was announced that Take-Two had acquired Dundee-based Ruffian Games (known for their work on Halo: The Master Chief Collection and Crackdown 3) after a year-long development partnership on an undisclosed partnership; following the acquisition, Ruffian became part of Rockstar Games as Rockstar Dundee. Take-Two offered to buyout Codemasters in November 2020 in a deal valued approximately US$973 million. While the offer awaited regulatory approval and was expected to be complete by early 2021, both Take-Two and Codemasters' board of directors confirmed the deal. However, Take-Two's bid was subsequently trumped by Electronic Arts in December 2020, which offered US$1.2 billion (US$7.98 per share), and agreed to acquire Codemasters. Take-Two formally withdrew its offer in January 2021. The Public Investment Fund of Saudi Arabia acquired 3.9 million shares of Take-Two, valued at $826 million, in February 2021. 2K acquired HB Studios in March 2021, who previously developed PGA Tour 2K21 and The Golf Club 2019 featuring PGA Tour under 2K Sports' publishing labels. The acquisition includes the rights to the PGA Tour games, which have the official endorsement of the PGA Tour itself. Additionally, 2K announced they had secured a contract with Tiger Woods, who had previously been a key figure for Electronic Arts' PGA Tour series, as an executive director and consultant for future 2K PGA Tour games as well as his likeness for the games. Later that month, 2K acquired the games division of HookBang based in Austin, Texas, which had supported work on the NBA 2K series in the past. The division was relocated to a new Austin location and rebranded as Visual Concepts Austin to continue support for that series. In June 2021, Take-Two made its largest acquisition to date with the $378 million acquisition of Top Eleven developer Nordeus, further expanding its mobile game division, which, as of July 2021, is known as T2 Mobile Games. Take-Two Interactive announced its intent to acquire the mobile developer Zynga in January 2022, in a cash-and-stock deal with a value of $12.7 billion, with Take-Two acquiring all outstanding shares of Zynga at $9.86 apiece. The deal was expected to close in June. Take-Two said that the acquisition would help boost its presence in the mobile gaming market, stating \"We see tremendous untapped potential to bring Take-Two’s renowned console and PC properties to mobile, a high-priority initiative that will be energized by the addition of Zynga’s leading development, publishing, and live operations teams.\" Both shareholders of the companies approved the merger on May 19, 2022, and the closing of the transaction took effect on May 23, 2022. In October 2022, Take-Two announced that Playdots would be shut down, with control of Two Dots being transferred to Zynga. In March 2023, Take-Two acquired mobile games subscription service GameClub for an undisclosed sum. That same month, Take-Two had layoffs impacting an unspecified number of employees at publishing label Private Division and 30 employees at Firaxis Games. In March 2024, Take-Two announced that it would acquire The Gearbox Entertainment Company, the parent of Gearbox Software from Embracer Group for $460 million. As part of the deal, Embracer would retain certain studios and titles that were held under Gearbox Entertainment. The acquisition was completed on June 12, 2024. In April 2024, Take-Two announced it would be laying off 5% of its workforce (579 employees) as part of a cost-reduction program. It also cancelled several unannounced projects. Take-Two shut down Intercept Games two months later. In July 2024, the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA) labor union, of which numerous video game voice actors are members of, would initiate a labor strike against a number of video publishers, including Take Two Interactive, over concerns about lack of AI protections related to not only video game actors, but also the use of AI to replicate an actor's voice, or create a digital replica of their likeness. Company structure Take-Two's executive offices and worldwide headquarters are located in New York City. The company runs its European operations from Windsor, Berkshire and its Asian operations from Singapore. As of 2018, Take-Two's primary business is through two self-owned publishing labels. One label is Rockstar Games, also located in New York City, and is specialized on development and publication of action-adventure games such as Grand Theft Auto. The other label is 2K, headquartered in Novato, California, and is composed of its divisions 2K Games, 2K Sports, and 2K Play. The 2K Sports division handles the development and publication of Take-Two's sports simulation games, such as the NBA 2K series. 2K Play covers family-friendly and children's video games produced by Take-Two's studios. 2K Games handles nearly all other production from Take-Two's internal development studios as well as titles from selected third parties. Finally, Take-Two owns Zynga, a developer for the mobile game market. With this structure in place since 1997–1998, each label is an incorporated principal operating businesses and has a higher degree of autonomy, and each with their own infrastructure and resources, management, and profit and loss strategies. Take-Two has divested itself of its older manufacturing and distribution operations in favor of digital publication and third-party retail distribution. Since 2016, around half of the company's revenues are from digital distribution, whether from digital sales of games through personal computer or consoles, or through video game monetization of its computer, console, and mobile titles. In November, Take-Two's CEO Strauss Zelnick confirmed that the company had sold Private Division to an undisclosed buyer for an undisclosed sum, as to allow Take-Two to focus on AAA and mobile games. The company also affirmed the closure of Roll7 and Intercept Games. Take-Two would continue to support No Rest for the Wicked, while five other titles were transferred to the new buyer. Publishers Former Developers Former Other holdings Take-Two equally shares control of the NBA 2K League, a competitive esports league based on its NBA 2K series, along with the National Basketball Association. The company has an undisclosed minority interest in Scopely. It had previously held 19.9% interest in Bungie, which it turned over to Microsoft Game Studios on their acquisition in June 2000, in exchange for receiving the rights to Bungie's Myth and Oni IPs, and the license to use the Halo engine to produce two new games. Take-Two also had a 2.3% interest in Twitch, which was bought out upon the service's acquisition by Amazon in 2014, receiving US$22 million from the sale. Litigation Take-Two has used trademark dilution complaints to prevent other publishers and developers from registering trademarks comparable to Take-Two's own trademarks, such as blocking trademark registration that involve \"rockstar\", \"bully\", \"2K\", and the capital letter \"R\". The publisher filed a dispute against Hazelight Studios to block its attempt to trademark It Takes Two, due to the similarity of its name to Take-Two's. Hazelight was forced to abandon the trademark application, making it more difficult to promote the game. Take-Two has also been active in blocking the release of mods for Grand Theft Auto games. While some of these mods had used assets from the original games and gave valid reason for Take-Two to protect its copyrights, other mods that Take-Two had targeted were made from legal reverse engineering of the game, making Take-Two's claims contentious. Take-Two has clarified that it had no issue with mods intended for single-player games that were legally made, but would take action against other types of mods. Games published Notes"
}