{
  "ticker": "TXT",
  "cik": "0000217346",
  "company_name": "Textron",
  "corrected_name": "Textron",
  "wiki_title_used": "Textron",
  "exists": true,
  "raw_text": "Textron Inc. is an American industrial  conglomerate based in Providence, Rhode Island. Textron's subsidiaries include Bell Textron, Kautex, Textron Aviation (which itself includes the Beechcraft and Cessna brands), and Lycoming Engines. It was founded by Royal Little in 1923 as the Special Yarns Company. In 2020, Textron employed over 33,000 people in 25 countries.\nThe company ranked 265th on the 2021 Fortune 500 of the largest United States corporations by revenue.\n\nHistory\nEarly history\nTextron started as a textile company in 1923, when 27-year-old Royal Little founded the Special Yarns Corporation in Boston, Massachusetts. The company manufactured synthetic yarns, a niche product at the time. By the start of World War II, the company was known as Atlantic Rayon Corporation and manufactured parachutes. As war production wound down, the company started making civilian products as well and was renamed Textron: \"Tex\" for \"textiles\" and \"tron\" from synthetics such as \"Lustron\". The company was listed on the NYSE in 1947.\nRoyal Little began the process of turning Textron into a conglomerate in 1953, with the purchase of Burkart Manufacturing Company (upholstery filling for the automotive industry) in September 1953, followed by the purchase of Dalmo-Victor (airborne Radar Antennae) and MB Manufacturing Company in early 1954. The push for diversification would see Textron purchase various other manufacturing companies. In 1960, the company also bought Bell Aerospace and E-Z-Go. The textile division was sold to Deering Milliken in 1963.\nLater CEOs included G. William Miller (1968–1977), Joseph Collinson (1977–1979) and Robert P. Straetz (1979–1986). In 1984, Textron took on more debt and bought Avco, a conglomerate almost as big as itself. Later on, James Hardymon took over as CEO. This $1.4 billion acquisition included the parent of Paul Revere Insurance Company (through 1996, when they sold it).\n\nCampbell era\nJames Hardymon brought in Lewis B. Campbell, who became CEO in 1998. Starting in 2000, Campbell led a company-wide restructuring program. The share price fell to as low as $13/share in March 2003 after the economic downturn following the collapse of Internet companies and the terrorist attacks on the World Trade Center. Diminished demand for helicopters and airplanes led to layoffs at Cessna and Bell Textron.\nIn 2007, the Wall Street Journal reported that Campbell had received $494,700 in compensation in the form of his use of a corporate jet to travel between his home and office, which made him the most expensive CEO in the country in terms of use of jet travel. Some shareholders have questioned whether it is a good use of shareholder dollars to pay for the personal lifestyle choice of the CEO to live in one state and work in another. Shares in Textron plummeted to as low as $10.09 per share in the aftermath of the 2008 economic downturn, driving its market capitalization down to just $3.17 billion. While the company lost 75% of its value in the first ten years of Campbell's leadership, he managed to take home over $120 million in compensation. His salary in 2008 was $25 million, making him the highest-paid executive of a conglomerate. Campbell managed to sell over $40 million in Textron stock in April and May 2008, at prices over $60 per share.\n\nAfter Campbell\nScott C. Donnelly became CEO in December 2009. Textron acquired Mechtronix in Montreal, Quebec, and OPINICUS in Tampa, Florida, in 2013. Donnelly combined these flight simulation companies, along with Textron's AAI Logistics & Technical Services, to form TRU Simulation & Training in 2014.\nOn December 26, 2013, Textron agreed to purchase Beechcraft, including the discontinued Hawker jet line, for $1.4 billion. The sale closed in March 2014. The company formed a new company called Textron Aviation to market the products of Beechcraft, Cessna and Hawker as individual brands.\nFrom 2013 to 2016, R&D investments were 4.3%, 4.0%, 4.6%, and 4.2% of its revenues ($13.78 billion in 2016) and totaled more than $2.2 billion as it developed seven aircraft: the Bell 525 Relentless, Bell V-280 Valor tiltrotor, Cessna Citation Longitude, Cessna Citation Hemisphere, Beechcraft Denali single-engine turboprop, the Cessna SkyCourier twin cargo hauler and the Textron Scorpion close support jet after the certification of the Bell 505 Jet Ranger X.\nIn March 2022, Textron agreed to acquire Pipistrel, an electrically powered aircraft manufacturer based in Italy and Slovenia.\nOn April 5, 2022, U.S. authorities announced criminal as well as civil charges in a Manhattan federal court against the former head of a now-defunct London-based company, Xcalibur Aerospace Ltd., for making a fraudulent bid to buy Textron for $13.8 billion. The Department of Justice and the SEC claimed that Xcalibur Aerospace was never in a position to complete a tender offer for Textron and lacked the finances to do so.\n\nDivisions\nAble Aerospace Services\nAble Aerospace Services is an international business and $70 million aerospace enterprise that is performing more than 2,800 proprietary FAA-approved repairs on aircraft and components.\n\nATAC\nAirborne Tactical Advantage Company (ATAC) is a government contractor based in Newport News, Virginia.\n\nArctic Cat\nOn March 6, 2017, Textron acquired Arctic Cat for US$247M. Arctic Cat is a manufacturer of snowmobiles, all-terrain vehicles, and side-by-sides. Textron operates Arctic Cat as a subsidiary of Textron Specialized Vehicles.\n\nBell Textron\nBell Textron is an American helicopter and rotorcraft manufacturer headquartered in Fort Worth, Texas.\n\nE-Z-GO\nAcquired by Textron in 1960, E-Z-GO is a designer and manufacturer of light transportation vehicles for golf courses, planned communities, campuses, and other uses. Products include electric and internal combustion golf carts, low speed vehicles and other multipurpose utility vehicles under the E-Z-Go, Cushman and Bad Boy Buggy brands.\n\nGreenlee\nGreenlee Textron is an industrial and electrical tool company headquartered in Rockford, Illinois. It was founded in 1862 by brothers Robert and Ralph Greenlee to manufacture their invention, a drill surrounded by four chisel blades, used in making the pockets for a mortise and tenon joint for the furniture industry in Rockford. This device is still used in cabinetmaking. The brothers later diversified into a variety of hand woodworking tools as well as machinery for making wooden barrels. The company was acquired by Textron in 1986. Greenlee produces various wire and cable installation tools that are used in a variety of fields. On April 18, 2018, Textron announced that it would sell its Greenlee brand to Emerson Electric.\n\nJacobsen\nTextron purchased Jacobsen Manufacturing in June 1978 and continued to produce Jacobsen garden tractors into the 1990s. Today, Jacobsen sells various products used for turf care: maintenance equipment, vehicles, and other products.\n\nKautex Textron\nKautex Textron is a supplier to the automotive industry. The company produces plastic fuel systems, selective catalytic reduction systems, windshield and headlamp washer systems, and other products. In August 2019, Textron Inc. was looking to spin off or sell this division to focus on higher-margin parts of their business.\n\nTextron AirLand\nTextron AirLand, LLC is a joint venture between Textron Inc. and AirLand Enterprises, LLC that is currently developing the Textron AirLand Scorpion aircraft as a private venture.\n\nTextron Aviation\nTextron Aviation is a new venture formed in March 2014 from Beechcraft and Cessna, retaining the Beechcraft, Cessna and Hawker aircraft type names as brands.\n\nBeechcraft Corporation is an American manufacturer of general aviation and military aircraft, ranging from light, single-engined aircraft to twin-engined turboprop transports and military trainers.\nThe Cessna Aircraft Company is an American general aviation aircraft manufacturing corporation headquartered in Wichita, Kansas. It was merged into Textron Aviation in March 2014.\n\nTextron eAviation\nIn March 2022 Textron agreed to buy Slovenian aircraft builder Pipistrel and form a new division for electric aircraft development, called Textron eAviation. Pipistrel will continue as a brand and retain its existing headquarters and operations in Slovenia and Italy. Textron will invest in the division to hasten future aircraft development and production. Pipistrel's founder and CEO, Ivo Boscarol, will stay on as a minority shareholder and also as the Chairman Emeritus. The purchase was completed in April 2022, for a price of US$235M.\n\nTextron Systems\nTextron Systems is an aerospace and defense development and manufacturing firm headquartered in Providence, Rhode Island. The company reported 2012 annual sales in the Textron Systems segment as $1.7 billion.\nIts operating units are:\n\nSupport Solutions, Electronic Solutions, Unmanned Systems (Hunt Valley, Maryland)\nAdvanced Information Solutions (Austin, Texas)\nGeospatial Solutions (Sterling, Virginia)\nLycoming Engines (Williamsport, Pennsylvania)\nMarine & Land Systems (Slidell, Louisiana)\nTRU Simulation & Training (Tampa, Florida)\nWeapon & Sensor Systems (Wilmington, Massachusetts): a maker of weapons such as anti-vehicle mines  and surveillance systems.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Textron:",
  "clean_text": "Textron Inc. is an American industrial conglomerate based in Providence, Rhode Island. Textron's subsidiaries include Bell Textron, Kautex, Textron Aviation (which itself includes the Beechcraft and Cessna brands), and Lycoming Engines. It was founded by Royal Little in 1923 as the Special Yarns Company. In 2020, Textron employed over 33,000 people in 25 countries. The company ranked 265th on the 2021 Fortune 500 of the largest United States corporations by revenue. History Early history Textron started as a textile company in 1923, when 27-year-old Royal Little founded the Special Yarns Corporation in Boston, Massachusetts. The company manufactured synthetic yarns, a niche product at the time. By the start of World War II, the company was known as Atlantic Rayon Corporation and manufactured parachutes. As war production wound down, the company started making civilian products as well and was renamed Textron: \"Tex\" for \"textiles\" and \"tron\" from synthetics such as \"Lustron\". The company was listed on the NYSE in 1947. Royal Little began the process of turning Textron into a conglomerate in 1953, with the purchase of Burkart Manufacturing Company (upholstery filling for the automotive industry) in September 1953, followed by the purchase of Dalmo-Victor (airborne Radar Antennae) and MB Manufacturing Company in early 1954. The push for diversification would see Textron purchase various other manufacturing companies. In 1960, the company also bought Bell Aerospace and E-Z-Go. The textile division was sold to Deering Milliken in 1963. Later CEOs included G. William Miller (1968–1977), Joseph Collinson (1977–1979) and Robert P. Straetz (1979–1986). In 1984, Textron took on more debt and bought Avco, a conglomerate almost as big as itself. Later on, James Hardymon took over as CEO. This $1.4 billion acquisition included the parent of Paul Revere Insurance Company (through 1996, when they sold it). Campbell era James Hardymon brought in Lewis B. Campbell, who became CEO in 1998. Starting in 2000, Campbell led a company-wide restructuring program. The share price fell to as low as $13/share in March 2003 after the economic downturn following the collapse of Internet companies and the terrorist attacks on the World Trade Center. Diminished demand for helicopters and airplanes led to layoffs at Cessna and Bell Textron. In 2007, the Wall Street Journal reported that Campbell had received $494,700 in compensation in the form of his use of a corporate jet to travel between his home and office, which made him the most expensive CEO in the country in terms of use of jet travel. Some shareholders have questioned whether it is a good use of shareholder dollars to pay for the personal lifestyle choice of the CEO to live in one state and work in another. Shares in Textron plummeted to as low as $10.09 per share in the aftermath of the 2008 economic downturn, driving its market capitalization down to just $3.17 billion. While the company lost 75% of its value in the first ten years of Campbell's leadership, he managed to take home over $120 million in compensation. His salary in 2008 was $25 million, making him the highest-paid executive of a conglomerate. Campbell managed to sell over $40 million in Textron stock in April and May 2008, at prices over $60 per share. After Campbell Scott C. Donnelly became CEO in December 2009. Textron acquired Mechtronix in Montreal, Quebec, and OPINICUS in Tampa, Florida, in 2013. Donnelly combined these flight simulation companies, along with Textron's AAI Logistics & Technical Services, to form TRU Simulation & Training in 2014. On December 26, 2013, Textron agreed to purchase Beechcraft, including the discontinued Hawker jet line, for $1.4 billion. The sale closed in March 2014. The company formed a new company called Textron Aviation to market the products of Beechcraft, Cessna and Hawker as individual brands. From 2013 to 2016, R&D investments were 4.3%, 4.0%, 4.6%, and 4.2% of its revenues ($13.78 billion in 2016) and totaled more than $2.2 billion as it developed seven aircraft: the Bell 525 Relentless, Bell V-280 Valor tiltrotor, Cessna Citation Longitude, Cessna Citation Hemisphere, Beechcraft Denali single-engine turboprop, the Cessna SkyCourier twin cargo hauler and the Textron Scorpion close support jet after the certification of the Bell 505 Jet Ranger X. In March 2022, Textron agreed to acquire Pipistrel, an electrically powered aircraft manufacturer based in Italy and Slovenia. On April 5, 2022, U.S. authorities announced criminal as well as civil charges in a Manhattan federal court against the former head of a now-defunct London-based company, Xcalibur Aerospace Ltd., for making a fraudulent bid to buy Textron for $13.8 billion. The Department of Justice and the SEC claimed that Xcalibur Aerospace was never in a position to complete a tender offer for Textron and lacked the finances to do so. Divisions Able Aerospace Services Able Aerospace Services is an international business and $70 million aerospace enterprise that is performing more than 2,800 proprietary FAA-approved repairs on aircraft and components. ATAC Airborne Tactical Advantage Company (ATAC) is a government contractor based in Newport News, Virginia. Arctic Cat On March 6, 2017, Textron acquired Arctic Cat for US$247M. Arctic Cat is a manufacturer of snowmobiles, all-terrain vehicles, and side-by-sides. Textron operates Arctic Cat as a subsidiary of Textron Specialized Vehicles. Bell Textron Bell Textron is an American helicopter and rotorcraft manufacturer headquartered in Fort Worth, Texas. E-Z-GO Acquired by Textron in 1960, E-Z-GO is a designer and manufacturer of light transportation vehicles for golf courses, planned communities, campuses, and other uses. Products include electric and internal combustion golf carts, low speed vehicles and other multipurpose utility vehicles under the E-Z-Go, Cushman and Bad Boy Buggy brands. Greenlee Greenlee Textron is an industrial and electrical tool company headquartered in Rockford, Illinois. It was founded in 1862 by brothers Robert and Ralph Greenlee to manufacture their invention, a drill surrounded by four chisel blades, used in making the pockets for a mortise and tenon joint for the furniture industry in Rockford. This device is still used in cabinetmaking. The brothers later diversified into a variety of hand woodworking tools as well as machinery for making wooden barrels. The company was acquired by Textron in 1986. Greenlee produces various wire and cable installation tools that are used in a variety of fields. On April 18, 2018, Textron announced that it would sell its Greenlee brand to Emerson Electric. Jacobsen Textron purchased Jacobsen Manufacturing in June 1978 and continued to produce Jacobsen garden tractors into the 1990s. Today, Jacobsen sells various products used for turf care: maintenance equipment, vehicles, and other products. Kautex Textron Kautex Textron is a supplier to the automotive industry. The company produces plastic fuel systems, selective catalytic reduction systems, windshield and headlamp washer systems, and other products. In August 2019, Textron Inc. was looking to spin off or sell this division to focus on higher-margin parts of their business. Textron AirLand Textron AirLand, LLC is a joint venture between Textron Inc. and AirLand Enterprises, LLC that is currently developing the Textron AirLand Scorpion aircraft as a private venture. Textron Aviation Textron Aviation is a new venture formed in March 2014 from Beechcraft and Cessna, retaining the Beechcraft, Cessna and Hawker aircraft type names as brands. Beechcraft Corporation is an American manufacturer of general aviation and military aircraft, ranging from light, single-engined aircraft to twin-engined turboprop transports and military trainers. The Cessna Aircraft Company is an American general aviation aircraft manufacturing corporation headquartered in Wichita, Kansas. It was merged into Textron Aviation in March 2014. Textron eAviation In March 2022 Textron agreed to buy Slovenian aircraft builder Pipistrel and form a new division for electric aircraft development, called Textron eAviation. Pipistrel will continue as a brand and retain its existing headquarters and operations in Slovenia and Italy. Textron will invest in the division to hasten future aircraft development and production. Pipistrel's founder and CEO, Ivo Boscarol, will stay on as a minority shareholder and also as the Chairman Emeritus. The purchase was completed in April 2022, for a price of US$235M. Textron Systems Textron Systems is an aerospace and defense development and manufacturing firm headquartered in Providence, Rhode Island. The company reported 2012 annual sales in the Textron Systems segment as $1.7 billion. Its operating units are: Support Solutions, Electronic Solutions, Unmanned Systems (Hunt Valley, Maryland) Advanced Information Solutions (Austin, Texas) Geospatial Solutions (Sterling, Virginia) Lycoming Engines (Williamsport, Pennsylvania) Marine & Land Systems (Slidell, Louisiana) TRU Simulation & Training (Tampa, Florida) Weapon & Sensor Systems (Wilmington, Massachusetts): a maker of weapons such as anti-vehicle mines and surveillance systems."
}