{
  "ticker": "TYL",
  "cik": "0000860731",
  "company_name": "Tyler Technologies",
  "corrected_name": "Tyler Technologies",
  "wiki_title_used": "Tyler Technologies",
  "exists": true,
  "raw_text": "Tyler Technologies, Inc., based in Plano, Texas, is a provider of proprietary software to the United States public sector. Tyler Technologies has offices in 17 states and one in Toronto, Ontario, Canada.\n\nHistory\nTyler Technologies was founded by Joseph F. McKinney in 1966 as Saturn Industries after buying three government companies from Ling-Temco-Vought. In 1968, the company acquired Tyler Pipe, a manufacturer of iron pipes, which eventually became the company's main source of annual revenue. Tyler Pipe was later renamed Tyler Corporation as a result of its success. In 1969, Saturn Industries was listed on the New York Stock Exchange. In 1970, the company changed its name to Tyler Corporation. Tyler Corporation entered the government software market in 1998. Tyler Corporation changed its name to Tyler Technologies in 1999.\n\nAcquisitions\nProducts\nThe company's public sector software includes eight categories: appraisal and tax software and services, integrated software for courts and justice agencies, data and insights services, enterprise financial software systems, planning/regulatory/maintenance software, public safety software, records/document management software, and transportation software for schools.\n\nControversies\nIn 2014, people in Marion County, Indiana sued claiming they had been wrongfully jailed. In 2016, public defenders in Alameda County, California found dozens of people wrongfully arrested or wrongfully jailed after switching to Tyler’s Odyssey Case Manager software.   An October 2021 report from Lubbock County, Texas, cited problems with Tyler Technologies software there as well as in numerous other jurisdictions. In 2021, a $4.9 million federal class action lawsuit was being settled with the county paying $2.45 million and Tyler $816,668. In December 2020, the District Clerk of Wichita Falls, Texas, said they were still experiencing problems they had had since they implemented Tyler Technologies Odyssey Case Manager in July 2019, almost 1.5 years earlier. In December 2021, everythingLubbock.com reported that four months after Lubbock County, Texas, switched their court records to Tyler Technologies software, a trial attorney said, “The rollout of this Tyler system has been an absolute debacle\". \nIn November 2016, Washington County, Pennsylvania, paid Tyler Technologies $1.6 million over their original contract amount of $6.96 million, including paying Tyler Technologies personnel to testify as expert witnesses in county court responding to property owners' complaints.\nIn 2021, Tyler Technologies paid $3 million to settle a federal class action lawsuit claiming that it had required some employees to work overtime and had not paid them for that time.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Tyler Technologies, Inc.:",
  "clean_text": "Tyler Technologies, Inc., based in Plano, Texas, is a provider of proprietary software to the United States public sector. Tyler Technologies has offices in 17 states and one in Toronto, Ontario, Canada. History Tyler Technologies was founded by Joseph F. McKinney in 1966 as Saturn Industries after buying three government companies from Ling-Temco-Vought. In 1968, the company acquired Tyler Pipe, a manufacturer of iron pipes, which eventually became the company's main source of annual revenue. Tyler Pipe was later renamed Tyler Corporation as a result of its success. In 1969, Saturn Industries was listed on the New York Stock Exchange. In 1970, the company changed its name to Tyler Corporation. Tyler Corporation entered the government software market in 1998. Tyler Corporation changed its name to Tyler Technologies in 1999. Acquisitions Products The company's public sector software includes eight categories: appraisal and tax software and services, integrated software for courts and justice agencies, data and insights services, enterprise financial software systems, planning/regulatory/maintenance software, public safety software, records/document management software, and transportation software for schools. Controversies In 2014, people in Marion County, Indiana sued claiming they had been wrongfully jailed. In 2016, public defenders in Alameda County, California found dozens of people wrongfully arrested or wrongfully jailed after switching to Tyler’s Odyssey Case Manager software. An October 2021 report from Lubbock County, Texas, cited problems with Tyler Technologies software there as well as in numerous other jurisdictions. In 2021, a $4.9 million federal class action lawsuit was being settled with the county paying $2.45 million and Tyler $816,668. In December 2020, the District Clerk of Wichita Falls, Texas, said they were still experiencing problems they had had since they implemented Tyler Technologies Odyssey Case Manager in July 2019, almost 1.5 years earlier. In December 2021, everythingLubbock.com reported that four months after Lubbock County, Texas, switched their court records to Tyler Technologies software, a trial attorney said, “The rollout of this Tyler system has been an absolute debacle\". In November 2016, Washington County, Pennsylvania, paid Tyler Technologies $1.6 million over their original contract amount of $6.96 million, including paying Tyler Technologies personnel to testify as expert witnesses in county court responding to property owners' complaints. In 2021, Tyler Technologies paid $3 million to settle a federal class action lawsuit claiming that it had required some employees to work overtime and had not paid them for that time."
}