{
  "ticker": "UDR",
  "cik": "0000074208",
  "company_name": "UDR, Inc.",
  "corrected_name": "UDR, Inc.",
  "wiki_title_used": "UDR, Inc.",
  "exists": true,
  "raw_text": "UDR Inc. (formerly United Dominion Realty) is a publicly traded real estate investment trust that invests in apartments. The company is organized in Maryland with its headquarters in Highlands Ranch, Colorado. As of December 31, 2024, the company owned interests in 169 apartment communities containing 55.696 apartment units in 21 markets in the United States.\nIt is the 15th largest owner of apartments in the United States and the 31st largest apartment property manager in the United States.\n\nHistory\nThe company was founded in Highlands Ranch, Colorado in 1972.\nIn October 1996, the company acquired South West Property for $312 million in common stock. At that time, South West owned 14,975 apartments and UDR owned 41,004 apartments.\nIn March 1998, the company acquired ASR Investments Corporation, which owned 7,550 apartments, for $313 million.\nIn December 1998, the company acquired American Apartment Communities II, which owned 14,001 apartments primarily in California, the Pacific Northwest, the Midwest and Florida.\n\nReferences\nExternal links\nBusiness data for UDR, Inc.:",
  "clean_text": "UDR Inc. (formerly United Dominion Realty) is a publicly traded real estate investment trust that invests in apartments. The company is organized in Maryland with its headquarters in Highlands Ranch, Colorado. As of December 31, 2024, the company owned interests in 169 apartment communities containing 55.696 apartment units in 21 markets in the United States. It is the 15th largest owner of apartments in the United States and the 31st largest apartment property manager in the United States. History The company was founded in Highlands Ranch, Colorado in 1972. In October 1996, the company acquired South West Property for $312 million in common stock. At that time, South West owned 14,975 apartments and UDR owned 41,004 apartments. In March 1998, the company acquired ASR Investments Corporation, which owned 7,550 apartments, for $313 million. In December 1998, the company acquired American Apartment Communities II, which owned 14,001 apartments primarily in California, the Pacific Northwest, the Midwest and Florida."
}