{
  "ticker": "UHS",
  "cik": "0000352915",
  "company_name": "Universal Health Services",
  "corrected_name": "Universal Health Services",
  "wiki_title_used": "Universal Health Services",
  "exists": true,
  "raw_text": "Universal Health Services, Inc. (UHS) is an American Fortune 500 company  that provides hospital and healthcare services, based in King of Prussia, Pennsylvania. In 2024, UHS reported total revenues of $15.8 billion.\n\nCompany history\nAlan B. Miller, who currently serves as the company's Executive Chairman, founded Universal Health Services, Inc. in 1979. Within 18 months of its founding, UHS owned four hospitals and had management contracts with two additional hospitals.\nIn 1979, UHS entered Las Vegas with the purchase of Valley Hospital.\nIn 1980, the company chose its first Board of Directors. In 1981, UHS held its initial public offering. In 1982, UHS purchased five hospitals from the Stewards Foundation, marking the first time a for-profit corporation purchased hospitals from a nonprofit religious organization. In 1983, UHS purchased Qualicare, Inc. for more than $116 million. The purchase included 11 acute care hospitals and four behavioral health hospitals. In 1986, UHS created Universal Health Realty Income Trust, the first REIT in the healthcare industry.\nIn 1991, UHS stock trading moved from NASDAQ to NYSE.\nIn November 2010, UHS reached an agreement in May to acquire Psychiatric Solutions, Inc. for $3.1 billion. In June 2012, UHS announced its plans to acquire Ascend Health Corporation for $517 million. In February 2014, UHS bought Palo Verde Mental Health for an undisclosed amount, renaming the facility to Palo Verde Behavioral Health. In April of that year, UHS announced the acquisition of the Psychiatric Institute of Washington. In September of that year, UHS' stock joined the S&P 500 Index and acquired Cygnet Health Care Limited for approximately $335 million. In August 2015, UHS acquired Alpha Hospitals Holdings Limited for $148 million from private equity group C&C Alpha Group. In September of that year, UHS announced the acquisition of Foundations Recovery Network based in Brentwood, Tennessee for $350 million. In August 2016, UHS bought Desert View Hospital in Pahrump, Nevada for an undisclosed amount. In December of that year, UHS acquired Cambian Group PLC's Adult Services Division. In July 2018, UHS announced its acquisition of the Danshell Group.\nOn September 28, 2020, Universal Health Services Inc. announced that its network went offline after an unspecified \"IT security issue\".\nIn September 2020, consistent with the company's long-standing succession plan, UHS announced that Alan B. Miller would step down as CEO in January 2021 and that President Marc D. Miller would be named CEO.\nUHS ranked on the Fortune 500 in 2021, 2022 in 2023 and 2024, and 2025 \nUHS was named on the Fortune World's Most Admired List in 2025, 2024  2023, 2022, 2021 and 2020.\nUHS has been named on the Forbes Global 2000 ranking in 2025.  UHS is ranked at #1,090. Of the American companies on the ranking, UHS ranked #355 among U.S. companies and #23 among global Health Care Equipment and Services category. UHS has been on the ranking for 22 years, and in 2023 earned ‘Hall of Fame’ status.\n\nControversies\nHospital licenses\nThe Centers for Medicare and Medicaid Services (CMS) threatened the Rancho Springs Medical Center (Murrieta) and Inland Valley Regional Medical Center (Wildomar) in California with decertification in June 2010 while the State of California warned of a possible hospital license revocation.  Universal Health Services implemented a program to address all concerns and in November 2011 the two hospitals passed a CMS Certification Survey. As a result, CMS rescinded its termination notice and the California Department of Public Health withdrew its license revocation notice.\n\nAllegations of noncompliance with same-sex visitation law\nAccording to a petition started on Change.org by Terri-Ann Simonelli of Henderson, Nevada, Spring Valley Hospital (owned and operated by UHS) claimed that their policy required power of attorney for a same-sex partner to make medical decisions on behalf of their partner. If true, this would seemingly violate new Department of Health and Human Services rules enabling same-sex partners to make said decisions, with or without power of attorney.\n\nFraudulent Medicaid claims\nIn September 2012, UHS and its subsidiaries, Keystone Education and Youth Services LLC and Keystone Marion LLC d/b/a Keystone Marion Youth Center agreed to pay over $6.9 million to resolve allegations that they submitted false and fraudulent claims to Medicaid. Between October 2004 and March 2010, the entities allegedly provided substandard psychiatric counseling and treatment to adolescents in violation of the Medicaid requirements. The United States alleged that UHS falsely represented Keystone Marion Youth Center as a residential treatment facility providing inpatient psychiatric services to Medicaid enrolled children, when in fact it was a juvenile detention facility. The United States further alleged that neither a medical director nor licensed psychiatrist provided the required direction for psychiatric services or for the development of initial or continuing treatment plans. The settlement further resolved allegations that the entities filed false records or statements to Medicaid when they filed treatment plans that falsely represented the level of services that would be provided to the patients.\nOn July 10, 2020, the US Department of Justice announced a $122 million Fraudulent Claims case with \"Universal Health Services, Inc., UHS of Delaware, Inc.(together, UHS), and Turning Point Care Center, LLC (Turning Point), a UHS facility located in Moultrie, Georgia, have agreed to pay a combined total of $122 million to resolve alleged violations of the False Claims Act for billing for medically unnecessary inpatient behavioral health services, failing to provide adequate and appropriate services, and paying illegal inducements to federal healthcare beneficiaries.\" From the announcement: \"The government alleged that, between January 2006, and December 2018, UHS's facilities admitted federal healthcare beneficiaries who were not eligible for inpatient or residential treatment because their conditions did not require that level of care, while also failing to properly discharge appropriately admitted beneficiaries when they no longer required inpatient care. The government further alleged that UHS's facilities billed for services not rendered, billed for improper and excessive lengths of stay, failed to provide adequate staffing, training, and/or supervision of staff, and improperly used physical and chemical restraints and seclusion. In addition, UHS's facilities allegedly failed to develop and/or update individual assessments and treatment plans for patients, failed to provide adequate discharge planning, and failed to provide required individual and group therapy services in accordance with federal and state regulations.\nOf the $117 million to be paid by UHS to resolve these claims, the federal government will receive a total of $88,124,761.27, and a total of $28,875,238.73 will be returned to individual states, which jointly fund state Medicaid programs.\"\n\nBuzzFeed investigation\nOn December 7, 2016, BuzzFeed published a report detailing questionable practices within UHS psychiatric facilities.  The report includes allegations of holding nonthreatening patients against their will, manipulative misinterpretation of patient testimonies to fit guidelines to involuntary confinement, aggressive staff layoffs and understaffing in hospitals, needless patient deaths due to understaffing and misprescription of medication, \"violating a patient's right to be discharged or holding a patient without the proper documentation\", and unnecessary extension of stay times to the maximum Medicare payout. UHS denied the conclusions of the report. UHS stock fell approximately 12% after publication.\nAccording to BuzzFeed investigative reporter Rosalind Adams, UHS responded to the report by hiring \"a global PR firm that offers specialized crisis management services... UHS didn't just implement a crisis PR plan. It also fired an employee that the company believed to have spoken to a reporter; it sued a former employee it alleges leaked damaging internal surveillance videos; it threatened to sue other employees; at least one facility held a series of town hall meetings to warn employees from speaking with us; it conducted \"in-depth interviews\" with nearly two dozen staff, then distributed a public apology that two of them signed; it enlisted one of the most powerful law firms in the United States; it built multiple, high-production-value websites specifically designed to overcome the reputational damage that our reporting might cause.\"\n\nCygnet Healthcare\nA UK subsidiary, Cygnet Health Care, was the subject of a BBC investigation that found that staff had been taunting, provoking and scaring vulnerable people.   It runs 140 mental health services across the UK.  85% of its services are \"rated good or outstanding by our regulators\".  New admissions were banned at Cygnet Acer clinic after the Care Quality Commission found it unsafe to use.  A patient hanged herself, others self harmed, ligature points were found where patients could hang themselves and too many of the staff were untrained to deal with the highly vulnerable patients at the clinic.\nThe company bought four inpatient units which were previously operated by the Danshell Group in 2018. All four were condemned by the Care Quality Commission which raised concerns about patients' \"unexplained injuries\" and high levels of restraint in 2019.\n\nLaurel Oaks Behavior Health Center\nOn February 8, 2024, a lawsuit was filed against the company's Dothan, Alabama-based Laurel Oaks Behavioral Health Center and its CEO Janette Jackson which alleged that Laurel Oaks Behavior Health Center mishandled numerous incidents involving the assault of an eight-year-old boy residing in the facility. The boy was reportedly assaulted by his larger roommate while he residing at the facility for a week in 2022. Universal Health Services would be sued as well. The lawsuit also noted that a 40-year-old man was convicted in 2011 of sexually assaulting a teenage patient while employed at Laurel Oaks.  A 17-year-old patient had been charged in 2014 with felony counts of first-degree sodomy as well.\n\nAdditional allegations\nOn May 16, 2021, Detroit Free Press published an article exposing St. Simons By The Sea (formerly Focus By The Sea) in St. Simons Island, Georgia for recruiting patients from a local soup kitchen.(subscription required) St. Simons By The Sea contracts physician services with Southland MD in Thomasville, Georgia.\n\nFacilities\nHospitals and medical centers\nAs of June 2024, the UCS website  lists the following medical and acute care facilities in the United States.\n\nCalifornia\nCorona\nSouthwest Healthcare Corona Regional Medical Center\nMurrieta\nA Plus Urgent Care\nSouthwest Healthcare Rancho Springs Hospital\nTemecula Valley Day Surgery\nPalmdale\nSouthwest Healthcare Palmdale Regional Medical Center\nRiverside\nRiverside Medical Clinic Surgery Center\nTemecula\nSouthwest Healthcare Temecula Valley Hospital\nWildomar\nSouthwest Healthcare Inland Valley Hospital\n\nDistrict of Columbia\nWashington\nThe George Washington University Hospital\n\nFlorida\nArcadia\nManatee Diagnostic Center (Arcadia)\nBradenton\nER at Bayshore Gardens\nER at Sun City Center\nER at Palma Sola\nLakewood Ranch Medical Center\nLakewood Ranch Medical Group\nManatee Diagnostic Center (Pointe West)\nManatee Diagnostic Center (Riverside)\nManatee Health\nManatee Memorial Hospital\nManatee Physician Alliance\nOrlando\nUniversity Behaviorial Center\nParrish\nManatee Diagnostic Center (Parrish)\nRoyal Palm Beach\nPalms Westside Clinic ASC\nSarasota\nER at Fruitville\nWellington\nWellington Physicians Alliance\nWest Palm Beach\nWellington Regional Medical Center\nWestlake\nER at Westlake\nWimauma\nER at Sun City Center\n\nNevada\nHenderson\nER at Green Valley Ranch\nHenderson Hospital\nLas Vegas\nCentennial Hills Hospital Medical Center\nElite Medical Center\nER at Blue Diamond\nER at Desert Springs\nER at West Craig Road\nSpring Valley Hospital Medical Center\nSummerlin Hospital Medical Center\nValley Health Physician Alliance\nValley Health Specialty Hospital\nValley Hospital Medical Center\nNorth Las Vegas\nER at North Las Vegas\nER at Valley Vista\nPahrump\nDesert View Hospital\nReno\nER at Damonte Ranch\nER at McCarran NW\nNorthern Nevada Sierra Medical Center\nQuail Surgical and Pain Management Center\nSparks\nER at Spanish Springs\nNorthern Nevada Medical Center\nNorthern Nevada Medical Group\n\nOklahoma\nEnid\nSt. Mary's Physician Associates\nSt. Mary's Regional Medical Center\n\nPennsylvania\nKing of Prussia\nEastern Pennsylvania Physician Alliance\nUHS Corporate\n\nSouth Carolina\nAiken\nAiken Physicians Alliance\nAiken Regional Medical Centers\nCancer Care Institute of Carolina\nThe Surgery Center of Aiken\nNorth Augusta\nER at Sweetwater\n\nTexas\nAlamo\nSouth Texas Health System ER Alamo\nAmarillo\nNorthwest Emergency at Town Square\nNorthwest Emergency on Georgia\nNorthwest Physicians Group\nNorthwest Texas Healthcare System\nAnna\nER at Anna\nBonham\nTMC Bonham Hospital\nDenison\nTexoma Medical Center\nTexomaCare\nEagle Pass\nFort Duncan Regional Medical Center\nEdinburg\nCornerstone Regional Hospital\nSouth Texas Health System Edinburg / South Texas Health System Children's\nSouth Texas Health System ER McColl\nSouth Texas Health System ER Monte Cristo\nLaredo\nDoctors Hospital Emergency Room Saunders\nDoctors Hospital Emergency Room South\nDoctors Hospital of Laredo\nLaredo Physicians Group\nMcAllen\nSouth Texas Health System Clinics\nSouth Texas Health System ER Ware Road\nSouth Texas Health System Heart\nSouth Texas Health System McAllen\nMission\nSouth Texas Health System ER Mission\nSherman\nER at Sherman\nWeslaco\nSouth Texas Health System ER Weslaco\n\nBehavioral health facilities\nUHS also operates over 300 behavioral health facilities in the United States and the United Kingdom, including:\n\nCygnet Health Care, UK\nPsychiatric Institute of Washington, Washington, District of Columbia\nSuncoast Behavioral Health Center, Bradenton, Florida\nFuller Hospital, South Attleboro, Massachusetts\nWillow Springs Center, Reno, Nevada\nFriends Hospital, Philadelphia, Pennsylvania\nProvo Canyon School, Provo, Utah\nLancaster Behavioral Health Hospital, Lancaster, PA\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for Universal Health Services: \nUniversal Health Services recipient profile on USAspending.gov\nUHS Behind Closed Doors from the Service Employees International Union",
  "clean_text": "Universal Health Services, Inc. (UHS) is an American Fortune 500 company that provides hospital and healthcare services, based in King of Prussia, Pennsylvania. In 2024, UHS reported total revenues of $15.8 billion. Company history Alan B. Miller, who currently serves as the company's Executive Chairman, founded Universal Health Services, Inc. in 1979. Within 18 months of its founding, UHS owned four hospitals and had management contracts with two additional hospitals. In 1979, UHS entered Las Vegas with the purchase of Valley Hospital. In 1980, the company chose its first Board of Directors. In 1981, UHS held its initial public offering. In 1982, UHS purchased five hospitals from the Stewards Foundation, marking the first time a for-profit corporation purchased hospitals from a nonprofit religious organization. In 1983, UHS purchased Qualicare, Inc. for more than $116 million. The purchase included 11 acute care hospitals and four behavioral health hospitals. In 1986, UHS created Universal Health Realty Income Trust, the first REIT in the healthcare industry. In 1991, UHS stock trading moved from NASDAQ to NYSE. In November 2010, UHS reached an agreement in May to acquire Psychiatric Solutions, Inc. for $3.1 billion. In June 2012, UHS announced its plans to acquire Ascend Health Corporation for $517 million. In February 2014, UHS bought Palo Verde Mental Health for an undisclosed amount, renaming the facility to Palo Verde Behavioral Health. In April of that year, UHS announced the acquisition of the Psychiatric Institute of Washington. In September of that year, UHS' stock joined the S&P 500 Index and acquired Cygnet Health Care Limited for approximately $335 million. In August 2015, UHS acquired Alpha Hospitals Holdings Limited for $148 million from private equity group C&C Alpha Group. In September of that year, UHS announced the acquisition of Foundations Recovery Network based in Brentwood, Tennessee for $350 million. In August 2016, UHS bought Desert View Hospital in Pahrump, Nevada for an undisclosed amount. In December of that year, UHS acquired Cambian Group PLC's Adult Services Division. In July 2018, UHS announced its acquisition of the Danshell Group. On September 28, 2020, Universal Health Services Inc. announced that its network went offline after an unspecified \"IT security issue\". In September 2020, consistent with the company's long-standing succession plan, UHS announced that Alan B. Miller would step down as CEO in January 2021 and that President Marc D. Miller would be named CEO. UHS ranked on the Fortune 500 in 2021, 2022 in 2023 and 2024, and 2025 UHS was named on the Fortune World's Most Admired List in 2025, 2024 2023, 2022, 2021 and 2020. UHS has been named on the Forbes Global 2000 ranking in 2025. UHS is ranked at #1,090. Of the American companies on the ranking, UHS ranked #355 among U.S. companies and #23 among global Health Care Equipment and Services category. UHS has been on the ranking for 22 years, and in 2023 earned ‘Hall of Fame’ status. Controversies Hospital licenses The Centers for Medicare and Medicaid Services (CMS) threatened the Rancho Springs Medical Center (Murrieta) and Inland Valley Regional Medical Center (Wildomar) in California with decertification in June 2010 while the State of California warned of a possible hospital license revocation. Universal Health Services implemented a program to address all concerns and in November 2011 the two hospitals passed a CMS Certification Survey. As a result, CMS rescinded its termination notice and the California Department of Public Health withdrew its license revocation notice. Allegations of noncompliance with same-sex visitation law According to a petition started on Change.org by Terri-Ann Simonelli of Henderson, Nevada, Spring Valley Hospital (owned and operated by UHS) claimed that their policy required power of attorney for a same-sex partner to make medical decisions on behalf of their partner. If true, this would seemingly violate new Department of Health and Human Services rules enabling same-sex partners to make said decisions, with or without power of attorney. Fraudulent Medicaid claims In September 2012, UHS and its subsidiaries, Keystone Education and Youth Services LLC and Keystone Marion LLC d/b/a Keystone Marion Youth Center agreed to pay over $6.9 million to resolve allegations that they submitted false and fraudulent claims to Medicaid. Between October 2004 and March 2010, the entities allegedly provided substandard psychiatric counseling and treatment to adolescents in violation of the Medicaid requirements. The United States alleged that UHS falsely represented Keystone Marion Youth Center as a residential treatment facility providing inpatient psychiatric services to Medicaid enrolled children, when in fact it was a juvenile detention facility. The United States further alleged that neither a medical director nor licensed psychiatrist provided the required direction for psychiatric services or for the development of initial or continuing treatment plans. The settlement further resolved allegations that the entities filed false records or statements to Medicaid when they filed treatment plans that falsely represented the level of services that would be provided to the patients. On July 10, 2020, the US Department of Justice announced a $122 million Fraudulent Claims case with \"Universal Health Services, Inc., UHS of Delaware, Inc.(together, UHS), and Turning Point Care Center, LLC (Turning Point), a UHS facility located in Moultrie, Georgia, have agreed to pay a combined total of $122 million to resolve alleged violations of the False Claims Act for billing for medically unnecessary inpatient behavioral health services, failing to provide adequate and appropriate services, and paying illegal inducements to federal healthcare beneficiaries.\" From the announcement: \"The government alleged that, between January 2006, and December 2018, UHS's facilities admitted federal healthcare beneficiaries who were not eligible for inpatient or residential treatment because their conditions did not require that level of care, while also failing to properly discharge appropriately admitted beneficiaries when they no longer required inpatient care. The government further alleged that UHS's facilities billed for services not rendered, billed for improper and excessive lengths of stay, failed to provide adequate staffing, training, and/or supervision of staff, and improperly used physical and chemical restraints and seclusion. In addition, UHS's facilities allegedly failed to develop and/or update individual assessments and treatment plans for patients, failed to provide adequate discharge planning, and failed to provide required individual and group therapy services in accordance with federal and state regulations. Of the $117 million to be paid by UHS to resolve these claims, the federal government will receive a total of $88,124,761.27, and a total of $28,875,238.73 will be returned to individual states, which jointly fund state Medicaid programs.\" BuzzFeed investigation On December 7, 2016, BuzzFeed published a report detailing questionable practices within UHS psychiatric facilities. The report includes allegations of holding nonthreatening patients against their will, manipulative misinterpretation of patient testimonies to fit guidelines to involuntary confinement, aggressive staff layoffs and understaffing in hospitals, needless patient deaths due to understaffing and misprescription of medication, \"violating a patient's right to be discharged or holding a patient without the proper documentation\", and unnecessary extension of stay times to the maximum Medicare payout. UHS denied the conclusions of the report. UHS stock fell approximately 12% after publication. According to BuzzFeed investigative reporter Rosalind Adams, UHS responded to the report by hiring \"a global PR firm that offers specialized crisis management services... UHS didn't just implement a crisis PR plan. It also fired an employee that the company believed to have spoken to a reporter; it sued a former employee it alleges leaked damaging internal surveillance videos; it threatened to sue other employees; at least one facility held a series of town hall meetings to warn employees from speaking with us; it conducted \"in-depth interviews\" with nearly two dozen staff, then distributed a public apology that two of them signed; it enlisted one of the most powerful law firms in the United States; it built multiple, high-production-value websites specifically designed to overcome the reputational damage that our reporting might cause.\" Cygnet Healthcare A UK subsidiary, Cygnet Health Care, was the subject of a BBC investigation that found that staff had been taunting, provoking and scaring vulnerable people. It runs 140 mental health services across the UK. 85% of its services are \"rated good or outstanding by our regulators\". New admissions were banned at Cygnet Acer clinic after the Care Quality Commission found it unsafe to use. A patient hanged herself, others self harmed, ligature points were found where patients could hang themselves and too many of the staff were untrained to deal with the highly vulnerable patients at the clinic. The company bought four inpatient units which were previously operated by the Danshell Group in 2018. All four were condemned by the Care Quality Commission which raised concerns about patients' \"unexplained injuries\" and high levels of restraint in 2019. Laurel Oaks Behavior Health Center On February 8, 2024, a lawsuit was filed against the company's Dothan, Alabama-based Laurel Oaks Behavioral Health Center and its CEO Janette Jackson which alleged that Laurel Oaks Behavior Health Center mishandled numerous incidents involving the assault of an eight-year-old boy residing in the facility. The boy was reportedly assaulted by his larger roommate while he residing at the facility for a week in 2022. Universal Health Services would be sued as well. The lawsuit also noted that a 40-year-old man was convicted in 2011 of sexually assaulting a teenage patient while employed at Laurel Oaks. A 17-year-old patient had been charged in 2014 with felony counts of first-degree sodomy as well. Additional allegations On May 16, 2021, Detroit Free Press published an article exposing St. Simons By The Sea (formerly Focus By The Sea) in St. Simons Island, Georgia for recruiting patients from a local soup kitchen.(subscription required) St. Simons By The Sea contracts physician services with Southland MD in Thomasville, Georgia. Facilities Hospitals and medical centers As of June 2024, the UCS website lists the following medical and acute care facilities in the United States. California Corona Southwest Healthcare Corona Regional Medical Center Murrieta A Plus Urgent Care Southwest Healthcare Rancho Springs Hospital Temecula Valley Day Surgery Palmdale Southwest Healthcare Palmdale Regional Medical Center Riverside Riverside Medical Clinic Surgery Center Temecula Southwest Healthcare Temecula Valley Hospital Wildomar Southwest Healthcare Inland Valley Hospital District of Columbia Washington The George Washington University Hospital Florida Arcadia Manatee Diagnostic Center (Arcadia) Bradenton ER at Bayshore Gardens ER at Sun City Center ER at Palma Sola Lakewood Ranch Medical Center Lakewood Ranch Medical Group Manatee Diagnostic Center (Pointe West) Manatee Diagnostic Center (Riverside) Manatee Health Manatee Memorial Hospital Manatee Physician Alliance Orlando University Behaviorial Center Parrish Manatee Diagnostic Center (Parrish) Royal Palm Beach Palms Westside Clinic ASC Sarasota ER at Fruitville Wellington Wellington Physicians Alliance West Palm Beach Wellington Regional Medical Center Westlake ER at Westlake Wimauma ER at Sun City Center Nevada Henderson ER at Green Valley Ranch Henderson Hospital Las Vegas Centennial Hills Hospital Medical Center Elite Medical Center ER at Blue Diamond ER at Desert Springs ER at West Craig Road Spring Valley Hospital Medical Center Summerlin Hospital Medical Center Valley Health Physician Alliance Valley Health Specialty Hospital Valley Hospital Medical Center North Las Vegas ER at North Las Vegas ER at Valley Vista Pahrump Desert View Hospital Reno ER at Damonte Ranch ER at McCarran NW Northern Nevada Sierra Medical Center Quail Surgical and Pain Management Center Sparks ER at Spanish Springs Northern Nevada Medical Center Northern Nevada Medical Group Oklahoma Enid St. Mary's Physician Associates St. Mary's Regional Medical Center Pennsylvania King of Prussia Eastern Pennsylvania Physician Alliance UHS Corporate South Carolina Aiken Aiken Physicians Alliance Aiken Regional Medical Centers Cancer Care Institute of Carolina The Surgery Center of Aiken North Augusta ER at Sweetwater Texas Alamo South Texas Health System ER Alamo Amarillo Northwest Emergency at Town Square Northwest Emergency on Georgia Northwest Physicians Group Northwest Texas Healthcare System Anna ER at Anna Bonham TMC Bonham Hospital Denison Texoma Medical Center TexomaCare Eagle Pass Fort Duncan Regional Medical Center Edinburg Cornerstone Regional Hospital South Texas Health System Edinburg / South Texas Health System Children's South Texas Health System ER McColl South Texas Health System ER Monte Cristo Laredo Doctors Hospital Emergency Room Saunders Doctors Hospital Emergency Room South Doctors Hospital of Laredo Laredo Physicians Group McAllen South Texas Health System Clinics South Texas Health System ER Ware Road South Texas Health System Heart South Texas Health System McAllen Mission South Texas Health System ER Mission Sherman ER at Sherman Weslaco South Texas Health System ER Weslaco Behavioral health facilities UHS also operates over 300 behavioral health facilities in the United States and the United Kingdom, including: Cygnet Health Care, UK Psychiatric Institute of Washington, Washington, District of Columbia Suncoast Behavioral Health Center, Bradenton, Florida Fuller Hospital, South Attleboro, Massachusetts Willow Springs Center, Reno, Nevada Friends Hospital, Philadelphia, Pennsylvania Provo Canyon School, Provo, Utah Lancaster Behavioral Health Hospital, Lancaster, PA"
}