{
  "ticker": "ULTA",
  "cik": "0001403568",
  "company_name": "Ulta Beauty",
  "corrected_name": "Ulta Beauty",
  "wiki_title_used": "Ulta Beauty",
  "exists": true,
  "raw_text": "Ulta Beauty, Inc., formerly known as Ulta Salon, Cosmetics & Fragrance Inc. and before 2000 as Ulta3, is an American chain of cosmetic stores headquartered in Bolingbrook, Illinois. Ulta Beauty carries both high- and low-end cosmetics, fragrances, nail products, bath and body products, beauty tools and haircare products. Each location  has a beauty salon available to the public.\n\nHistory\nUlta was founded by Richard E. George, the former president of Osco Drug, Inc., and Terry Hanson. George left Osco in 1989 to develop a business plan for a retailer that would offer beauty products at different price levels. Other Osco executives joined George and Hanson in the business and raised $11.5 million in venture capital. The company, initially called Ulta3, was launched in 1990, with five stores in the suburbs of Chicago. The first of these opened at High Point Centre in Lombard, Illinois in early October 1990. The name was changed from Ulta3 to Ulta at the end of 1999.\nGeorge left Ulta in 1995, and Hanson became the company's chief executive officer (CEO). In December 1999, Lyn Kirby became the president and CEO and Charles \"Rick\" Weber became senior executive vice president, chief operating and CEO. On October 25, 2007, the company became publicly traded on the NASDAQ.\nIn 2008, Ulta also  opened a second distribution center in Phoenix, Arizona. In 2010, Carl \"Chuck\" Rubin was appointed as chief operating officer, president, and as a member of the board of directors.\nOn June 24, 2013, it was announced that Mary Dillon would be appointed as CEO and a member of the board of directors, effective July 1, 2013. Dillon was previously the chief of U.S. Cellular and a senior executive at McDonald's and PepsiCo.\nIn 2020, before the COVID-19 pandemic there were 44,000 employees. As of 2021, Ulta employs approximately 37,000 people.\nOn January 6th, 2025, Dave Kimbell announced his retirement as CEO of Ulta Beauty effective immediately. Dave Kimbell was succeeded as CEO by Kecia Steelman, who was previously the company’s chief operating officer.\n\nLocations\nUlta Beauty only operates in the United States of America. As of January 28, 2023, Ulta had some 1,355 stores across all 50 states, with about 250 of those stores located inside Target stores. Ulta Beauty had 168 retail locations across California, the highest number of any state. Ulta Beauty has a total of 7 distribution centers in 7 different states.\nIn 2025, Ulta Beauty announced its expansion into the Mexican market through a joint venture with the retail group Axo, marking its first international operation outside the United States. This decision was part of the company's long-term growth strategy, following an evaluation that identified Mexico's beauty market as a sector with significant growth potential. The initial phase of this expansion includes plans to open stores in Mexico City and Guadalajara, aiming to introduce the brand to key urban centers.\n\nOperations\nUlta Beauty offers both high-end and drugstore cosmetics, skincare, and fragrances, in addition to its own brands of beauty products and fragrances. They sell brands such as MAC Cosmetics, Kylie Cosmetics, and ColourPop cosmetics.\nUlta Beauty sales were $713.8 million for the first quarter ending in May 2014. At the end of the second quarter ending in August 2014, Ulta Beauty reported that total sales increased by 22.2% and comparable store sales increased 9.8%.\nAs of 2019, Ulta had stores in 48 states. A majority of Ulta Beauty stores are located in the East Coast region and in California.\nIn August 2021, the retail chain Target started selling Ulta's products.\nThe same year, Ulta joined the 15 Percent Pledge, which dedicated more store shelf space to Black-owned businesses.\nIn 2022, Ulta collaborated with Allure, bringing a collection of 25,000 products to Allure’s online and brick-and-mortar stores. The collaboration ran from July to September 2022 and included brands such as Fenty Beauty, Drybar, Olaplex, Tula, The Ordinary, Peter Thomas Roth, CosRX, NYX, Morphe, and Beekman 1802 selected by Ulta's merchandising team.\nOn January 1, 2024, Ulta Beauty began construction to move out from their original distribution center located in Romeoville, IL 888-FFC to their new Bolingbrook, IL 871-MFC building & began operations on August 5, 2024.\nIn August 2025, Ulta Beauty and Target Corporation formally announced that they were ending their partnership. The two companies mutually agreed to not renew their agreement for the coming year, meaning the Ulta Beauty at Target experience will end in August 2026. Ulta Beauty products will still be available in Target stores and online until then.\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Ulta Beauty: \nOfficial website ULTA México",
  "clean_text": "Ulta Beauty, Inc., formerly known as Ulta Salon, Cosmetics & Fragrance Inc. and before 2000 as Ulta3, is an American chain of cosmetic stores headquartered in Bolingbrook, Illinois. Ulta Beauty carries both high- and low-end cosmetics, fragrances, nail products, bath and body products, beauty tools and haircare products. Each location has a beauty salon available to the public. History Ulta was founded by Richard E. George, the former president of Osco Drug, Inc., and Terry Hanson. George left Osco in 1989 to develop a business plan for a retailer that would offer beauty products at different price levels. Other Osco executives joined George and Hanson in the business and raised $11.5 million in venture capital. The company, initially called Ulta3, was launched in 1990, with five stores in the suburbs of Chicago. The first of these opened at High Point Centre in Lombard, Illinois in early October 1990. The name was changed from Ulta3 to Ulta at the end of 1999. George left Ulta in 1995, and Hanson became the company's chief executive officer (CEO). In December 1999, Lyn Kirby became the president and CEO and Charles \"Rick\" Weber became senior executive vice president, chief operating and CEO. On October 25, 2007, the company became publicly traded on the NASDAQ. In 2008, Ulta also opened a second distribution center in Phoenix, Arizona. In 2010, Carl \"Chuck\" Rubin was appointed as chief operating officer, president, and as a member of the board of directors. On June 24, 2013, it was announced that Mary Dillon would be appointed as CEO and a member of the board of directors, effective July 1, 2013. Dillon was previously the chief of U.S. Cellular and a senior executive at McDonald's and PepsiCo. In 2020, before the COVID-19 pandemic there were 44,000 employees. As of 2021, Ulta employs approximately 37,000 people. On January 6th, 2025, Dave Kimbell announced his retirement as CEO of Ulta Beauty effective immediately. Dave Kimbell was succeeded as CEO by Kecia Steelman, who was previously the company’s chief operating officer. Locations Ulta Beauty only operates in the United States of America. As of January 28, 2023, Ulta had some 1,355 stores across all 50 states, with about 250 of those stores located inside Target stores. Ulta Beauty had 168 retail locations across California, the highest number of any state. Ulta Beauty has a total of 7 distribution centers in 7 different states. In 2025, Ulta Beauty announced its expansion into the Mexican market through a joint venture with the retail group Axo, marking its first international operation outside the United States. This decision was part of the company's long-term growth strategy, following an evaluation that identified Mexico's beauty market as a sector with significant growth potential. The initial phase of this expansion includes plans to open stores in Mexico City and Guadalajara, aiming to introduce the brand to key urban centers. Operations Ulta Beauty offers both high-end and drugstore cosmetics, skincare, and fragrances, in addition to its own brands of beauty products and fragrances. They sell brands such as MAC Cosmetics, Kylie Cosmetics, and ColourPop cosmetics. Ulta Beauty sales were $713.8 million for the first quarter ending in May 2014. At the end of the second quarter ending in August 2014, Ulta Beauty reported that total sales increased by 22.2% and comparable store sales increased 9.8%. As of 2019, Ulta had stores in 48 states. A majority of Ulta Beauty stores are located in the East Coast region and in California. In August 2021, the retail chain Target started selling Ulta's products. The same year, Ulta joined the 15 Percent Pledge, which dedicated more store shelf space to Black-owned businesses. In 2022, Ulta collaborated with Allure, bringing a collection of 25,000 products to Allure’s online and brick-and-mortar stores. The collaboration ran from July to September 2022 and included brands such as Fenty Beauty, Drybar, Olaplex, Tula, The Ordinary, Peter Thomas Roth, CosRX, NYX, Morphe, and Beekman 1802 selected by Ulta's merchandising team. On January 1, 2024, Ulta Beauty began construction to move out from their original distribution center located in Romeoville, IL 888-FFC to their new Bolingbrook, IL 871-MFC building & began operations on August 5, 2024. In August 2025, Ulta Beauty and Target Corporation formally announced that they were ending their partnership. The two companies mutually agreed to not renew their agreement for the coming year, meaning the Ulta Beauty at Target experience will end in August 2026. Ulta Beauty products will still be available in Target stores and online until then."
}