{
  "ticker": "UNH",
  "cik": "0000731766",
  "company_name": "UnitedHealth Group",
  "corrected_name": "UnitedHealth Group",
  "wiki_title_used": "UnitedHealth Group",
  "exists": true,
  "raw_text": "UnitedHealth Group Incorporated is an American multinational for-profit company specializing in health insurance and health care services based in Eden Prairie, Minnesota. Selling insurance products under UnitedHealthcare, and health care services under the Optum brand, it is the world's seventh-largest company by revenue and the largest health care company by revenue. The company is ranked eighth on the 2024 Fortune Global 500.\nUnitedHealth Group has a market capitalization of more than $460 billion as of 2024. The company is the largest health insurer in the United States, insuring over 50 million people, and operates globally.\nOptum, carrying the same brand and name as Optum, functions as UnitedHealth Group's Business Process Outsourcing (BPO) and Shared Services subsidiary, catering to the group's customer service management with sites in countries like the Philippines.\nUnitedHealth Group has faced numerous investigations, lawsuits, and fines, including SEC enforcement for stock option backdating, Medicare over-billing, unfair claims practices, mental health treatment denials, and anticompetitive behavior.\n\nHistory\n1970s–1990s\nUnitedHealth Group originated in late 1974, when Minnesota-based Charter Med Incorporated was founded by Richard Taylor Burke. It originally processed claims for doctors at the Hennepin County Medical Society. UnitedHealthcare Corporation was founded in 1977 to purchase Charter Med and create a network-based health plan for seniors. It became a publicly traded company in 1984 and changed its name to UnitedHealth Group in 1998.\nIn 1988, UnitedHealthcare started its first pharmacy benefit management, through its Diversified Pharmaceutical Services subsidiary. It managed pharmacy benefits delivered both through retail pharmacies and mail. The subsidiary was sold to SmithKline Beecham in 1994 for $2.3 billion.\nIn 1994, UnitedHealthcare acquired Ramsey-HMO, a Florida insurer. In 1995, the company acquired The MetraHealth Companies Inc. for $1.65 billion. MetraHealth was a privately held company formed by combining the group healthcare operations of The Travelers Companies and MetLife. In 1996, UnitedHealthcare acquired HealthWise of America, which operated HMOs in Arkansas, Maryland, Kentucky and Tennessee.\nIn 1998, the company was reorganized as the holding of independent companies UnitedHealthcare, Ovations, Uniprise, Specialized Care Services, and Ingenix and rebranded as \"UnitedHealth Group\". Also in 1998, UnitedHealth Group acquired HealthPartners of Arizona, operator of Arizona's largest AHCCCS provider.\n\n2000s\nIn 2001, EverCare, a UnitedHealth Group subsidiary, merged with LifeMark Health Plans In 2002, UnitedHealth Group acquired GeoAccess and Medicaid insurance company AmeriChoice. In 2003, UnitedHealth Group acquired Mid Atlantic Medical Services, an insurer serving Maryland, Washington D.C., Virginia, Delaware and West Virginia. Also in 2003, UnitedHealth Group acquired Golden Rule Financial, a provider of health savings accounts. On July 21, 2003, Exante Bank started operating in Salt Lake City, Utah, as a Utah state-chartered industrial loan corporation. It changed its name to OptumHealth Bank in 2008 and to Optum Bank in 2012.\nIn April 2004, UnitedHealth Group acquired Touchpoint Health Plan, a Wisconsin health plan. In July 2004, the company acquired Oxford Health Plans.\nIn December 2005, the company acquired PacifiCare Health Systems. It agreed to divest parts of PacifiCare's commercial health insurance business in Tucson, Arizona and Boulder, Colorado to satisfy antitrust regulator concerns, and also agreed to end its network access agreement with Blue Shield of California. The Tucson business was sold to Cigna. The company acquired Prescription Solutions, another pharmacy benefits manager, as part of its acquisition of PacifiCare Health Systems. This business was later rebranded OptumRx.\nIn February 2006, the company acquired John Deere Health Care. The same year, William W. McGuire stepped down as chairman and director due to his involvement in the employee stock options scandal. He was replaced by CEO Stephen Hemsley who had served as president and COO and a member of the board of directors. McGuire's exit compensation from UnitedHealth was anticipated to be $1.1 billion, but he only received $618 million after returning $420 million in stock options.\nIn February 2008, the company acquired Sierra Health Services for $2.6 billion. As part of the transaction, to obtain regulatory approval, 25,000 customers were sold to Humana. In July 2009, UnitedHealth Group agreed to acquire Health Net's Northeast licensed subsidiaries for up to $570 million in payments spread out over two years.\n\n2010s\nThrough 2010 and into 2011, senior executives of the company met monthly with executives of other health insurers to limit the effect of the health care reform law. In July 2010, Ingenix acquired Picis Clinical Solutions, Inc., a health information provider for the high-acuity areas of hospitals. In 2011, Logistics Health, Inc. of La Crosse, Wisconsin, was acquired by OptumHealth. In September 2014, the office buildings where LHI is based were sold to UnitedHealth Group for $45 million. In February 2012, the company acquired XLHealth, a sponsor of Medicare Advantage health plans with a primary focus on medicare recipients with special needs such as those with chronic illness and those eligible for Medicaid (\"dual eligibles\"). In October 2012, UnitedHealth Group and Amil Participações, one of the biggest Brazilian health insurance companies, completed the first phase of their merger.\n\nIn February 2014, Optum secured a majority stake in the Washington, D.C.–based startup Audax Health. Audax's CEO, Grant Verstandig, continued running the firm alongside COO David Ko. In October 2014, Optum Health acquired the health services unit of Alere for $600 million cash.\nIn March 2015, it was announced that CatamaranRx would be acquired by OptumRx. In April 2016, the company announced it was pulling out of all but a \"handful\" of state healthcare exchanges provided under Affordable Care Act and will continue to sell only in three states in 2017.\nIn 2017, UnitedHealth's Optum unit acquired Rally Health, a company started by Audax Health's executives. Prior to acquisition, in 2015, UnitedHealth supported Rally Health as a majority investor, and through enrolling more than 5 million UnitedHealth policy holders in Rally Health's flagship product, Rally. The close relations between UnitedHealth, Audax Health and Rally Health follows a close personal relationship between Grant Verstandig (Audax and Rally) and UnitedHealth's President and CFO at the time, David Wichmann.\nIn June 2019, UnitedHealth's Optum division acquired Davita Medical Group from DaVita Inc. for $4.3 billion. That year, the company also agreed to acquire Equian for $3.2 billion. On June 19, 2019, UnitedHealth acquired the online patient community platform PatientsLikeMe for an undisclosed amount and it will be incorporated into UnitedHealth Group's research division.\nIn November 2019, Andrew Witty was named president of UnitedHealth Group, in addition to his role as chief executive of the company's Optum division.\n\n2020s–present\nUnitedHealth announced in March 2022 that it would acquire LHC Group for $5.4 billion. The deal will expand its home health capabilities by combining LHC's services with UnitedHealth's Optum unit.\nIn 2022, UnitedHealth Group said there would be no out-of-pocket costs for albuterol, epinephrine, glucagon, insulin, and naloxone for fully insured members starting in 2023. The discounts were guaranteed for less than a quarter of UnitedHealthcare's membership and did not extend to those enrolled in UHC's Medicare Advantage and Medicaid plans.\nIn 2023, UnitedHealthGroup announced it would move its headquarters from Minnetonka to Eden Prairie, Minnesota.\nIn February 2024, UnitedHealth Group completed the sale of its operations in Brazil.\nIn February 2022, UnitedHealth announced the acquisition of Change Healthcare, the largest health payments platform in the US, which the US Justice Department tried to block on antitrust grounds; the sale went through by September. 18 months later, in February 2024, the subsidiary was brought completely down by the 2024 Change Healthcare ransomware attack, and the Justice Department announced that it was opening a new antitrust and Medicare overcharging probe. Despite making a ransomware payment, services remained down or incomplete for months. The CEO, Andrew Witty, was called before the US House and US Senate to testify about the cyberattack and DoJ concerns. In late April 2024, the Senate held a hearing concerning the cyberattack and UnitedHealth's response. Andrew Witty went before the Senate stating that there needed to be a strong digital security system in place along with an adequate backup plan. UnitedHealth revealed the hackers did gain access to patient information, but the Senate was informed the company is not yet aware of the extent of the data breach.\n\nOn December 4, 2024, Brian Thompson, the CEO of UnitedHealth Group's insurance division, was killed in a shooting in New York City. The shooting occurred outside the New York Hilton Midtown, where UnitedHealth Group was hosting an investor event. The shooting prompted many social media users to criticize UnitedHealthcare, the American health insurance system, and Thompson personally. Police later arrested a suspect, Luigi Mangione, and charged him with murder. Tim Noel joined UnitedHealthCare in 2007 and succeeded Brian Thompson as the CEO. Prior to becoming CEO, Noel was in charge of UnitedHealthCare's Medicare Advantage plans.\n\nOrganizational structure\nUnitedHealth Group has about 2700 subsidiaries and affiliates worldwide, the highest profile being Optum and UnitedHealthcare.\n\nOptum\nFormed in 2011, Optum says that it provides \"data and analytics, pharmacy care services, population health, healthcare delivery, and healthcare operations\".\nIt is organized into three businesses:\n\nOptumHealth – provides primary and secondary care.\nOptumInsight – provides data analytics, technology, and operations services.\nOptumRX – provides pharmacy services.\n\nUnitedHealthcare\nUnitedHealthcare (UHC) is an insurance and managed care company with four main divisions:\n\nUnitedHealthcare Employer and Individual – provides health benefit plans and services for large national employers and individuals.\nUnitedHealthcare Medicare and Retirement – provides health and well-being services to individuals age 65 and older.\nUnitedHealthcare Community and State – serves state programs that care for the economically disadvantaged, the medically underserved, and people without the benefit of employer-funded health care coverage, in exchange for a monthly premium per member from the state program.\nUnitedHealthcare Global – provides nearly 2.2 million people with care and benefits services in South America.\n\nFinance\nFor the fiscal year 2022, UnitedHealth Group reported earnings of US$20.64 billion, with an annual revenue of US$324.16 billion. UnitedHealth Group's 2023 revenue grew by $47.5 billion, or 14.6%, on annualized revenue of $371.6 billion. Operating income for 2023 was $32.4 billion (up 13.8%). Cash flows from operations were $29.1 billion. UnitedHealth Group’s 2024 revenues grew $28.7 billion or 8% year-over-year to $400.3 billion. Earnings from operations of $32.3 billion compared to $32.4 billion in 2023. Cash flows from operations were $24.2 billion.\n\nLobbying and political activity\nIn 2009, according to OpenSecrets, people affiliated with UnitedHealth Group gave $4.77 million to political candidates and groups. The Affordable Care Act was being discussed in Congress at the time and was subsequently passed in the first quarter of 2010. In 2010 UnitedHealth Group hired nine different lobbying firms to work on its behalf. In addition, its corporate political action committee (PAC), called United for Health, spent an additional $1 million on lobbying activities. UnitedHealth Group subsequently spent $4.11 million to $4.75 million from 2011 to 2021.\n\nThe Lewin Group\nThe Lewin Group is a policy research and consulting firm that provides an economic analysis of health care and human services issues and policies. The organization has existed for about 40 years and has maintained a nonpartisan reputation through the many ownership changes that have occurred over that time. The Lewin Group was purchased in 2007 by Ingenix, a subsidiary of UnitedHealth Group, but alleges editorial and analytical \"independence\" from UnitedHealth Group, its parent company. The Lewin Group discloses its ownership in its reports and on its website. While the Lewin Group does not advocate for or against any legislation, both Democratic and Republican politicians frequently cite the firm's studies to argue for and against various U.S. healthcare reform proposals. For example, Democratic Senator Ron Wyden uses Lewin Group estimates to cite the feasibility of his Healthy Americans Act. Former U.S. Representative Eric Cantor, the former House Republican Whip, has referred to the organization as \"the nonpartisan Lewin Group\" in arguing against government-funded health insurance proposals.\nSeveral Lewin studies have been used to argue both for and against the inclusion of a public option in national health reform. Lewin clients who often cite its findings include The Commonwealth Fund, which, in 2009, held up a Lewin study it commissioned to advocate for a public plan. The report showed that legislative proposals would achieve nearly universal coverage and \"estimated that a public plan could offer small businesses insurance that is at least 9 percent cheaper than current small-business policies.\"\nHowever, the Lewin Group has acknowledged that clients sometimes choose to keep the results of studies they have commissioned private. Indeed, Lewin Group Vice President John Sheils told The Washington Post that \"sometimes studies come out that don't show exactly what the client wants to see. And in those instances, they have [the] option to bury the study.\"\n\nCriticism and controversies\nSEC investigation\nIn 2006, the U.S. Securities and Exchange Commission (SEC) began investigating the conduct of UnitedHealth Group's management and directors, for backdating of stock options. Investigations were also started by the Internal Revenue Service and prosecutors in the U.S. attorney's office for the Southern District of New York, who subpoenaed documents from the company. The investigations came to light after a series of probing stories in the Wall Street Journal in May 2006, discussing the apparent backdating of hundreds of millions of dollars' worth of stock options by UHC management. The backdating apparently occurred with the knowledge and approval of the directors, according to the Journal. Major shareholders have filed lawsuits accusing former New Jersey governor Thomas Kean and UHC's other directors of failing in their fiduciary duty. On October 15, 2006, CEO William W. McGuire was forced to resign, and relinquish hundreds of millions of dollars in stock options.\nOn December 6, 2007, the SEC announced a settlement under which McGuire was to repay $468 million, including a $7 million civil penalty, as a partial settlement of the backdating prosecution. He was also barred from serving as an officer or director of a public company for ten years. This was the first time in which the little-used \"clawback\" provision under the Sarbanes-Oxley Act was used against an individual by the SEC. The SEC continued its investigations even after it in 2008 settled legal actions against both UnitedHealth Group itself and its former general counsel.\n\nAmerican Chiropractic Association lawsuit\nIn June 2006, the American Chiropractic Association filed a national class-action lawsuit against the American Chiropractic Network (ACN), which is owned by UnitedHealth Group and administers chiropractic benefits, and against UnitedHealth Group itself, for alleged practices in violation of the federal Racketeer Influenced and Corrupt Organizations Act (RICO). The Missouri Department of Insurance, Financial Institutions and Professional Registration determined that UnitedHealth Group violated state insurance laws, so levied $536,000 in fines and ordered more than 50,000 cases re-opened; any improperly denied claims must have been reimbursed with interest for chiropractors and patients.\n\nOptumInsight, a.k.a. Ingenix lawsuit\nIn February 2008, New York State Attorney General Andrew Cuomo announced an industry-wide investigation into a scheme by health insurers to defraud consumers by manipulating reasonable and customary rates. The announcement included a statement that Cuomo intended \"to file suit against Ingenix, Inc., its parent UnitedHealth Group, and three additional subsidiaries.\" Cuomo asserted that his investigation found that rates found in a database of health care charges maintained by Ingenix were lower than what he determined was the actual cost of certain medical expenses. Cuomo said this inappropriately allowed health insurance companies to deny a portion of provider claims, thereby pushing costs down to members.\nOn January 13, 2009, Ingenix announced an agreement with the New York State attorney settling the probe into the independence of the health pricing database. Under the settlement, UnitedHealth Group and Ingenix would pay $50 million to finance a new, non-profit entity that would develop a new healthcare pricing database. Ingenix would discontinue its medical pricing databases when the new entity makes its product available. The company acknowledged the appearance of a conflict of interest but admitted no wrongdoing.\nOn January 15, 2009, UnitedHealth Group announced a $350 million settlement of three class action lawsuits filed in Federal court by the American Medical Association, UnitedHealth Group members, healthcare providers, and state medical societies for not paying out-of-network benefits. This settlement came two days after a similar settlement with Cuomo.\nOn October 27, 2009, Cuomo announced the creation of FAIR Health, an independent, non-profit organization that would develop a nationwide database for consumer reimbursement, as well as a website where consumers would be able to compare prices before choosing doctors. To fund FAIR Health, the Attorney General's office secured nearly $100 million from insurers such as Aetna, UnitedHealth Group, and Anthem Inc.\n\nPacifiCare fine in California\nIn 2008, the California Department of Insurance took action against UnitedHealthcare's subsidiary PacifiCare Health Systems, acquired in 2005, ultimately fining UnitedHealthcare around $173 million for an estimated over 900,000 violations of the Unfair Insurance Practices Act; by 2019, the case was still being disputed in court, with the possibility of affirming $91 million in penalties.\n\nMedicare overbilling lawsuit\nA whistleblower lawsuit filed in 2011 charged UnitedHealth Group's data analytics division with assisting in defrauding Medicare by boosting risk adjustment scores from Medicare Advantage companies. The suit alleged that UnitedHealth Group subsidiary Ingenix (now OptumInsight) \"defrauded the United States of hundreds of millions – and likely billions – of dollars.\" Former UnitedHealth executive Benjamin Poehling brought the suit under the False Claims Act. The government said it would proceed on claims against two healthcare companies, UnitedHealth and its Texas subsidiary WellMed Medical Management. In February 2017, a federal judge unsealed the suit after the Department of Justice announced it would join the case.\n\nCMS fine over Medicare Part D\nIn 2017, the Centers for Medicare and Medicaid Services (CMS) fined UnitedHealthcare $2.5 million after discovering issues in Medicare Part D leading to delays or denials in a 2016 audit.\n\n2018 New Jersey fine\nIn 2018, the New Jersey Department of Banking and Insurance fined UnitedHealthcare $2.5 million due to various compliance issues; this was the largest fine against a licensee in nine years.\n\nRichard Cole, and others v. UnitedHealthcare\nOn April 29, 2019, Judge Robert N. Scola Jr. of the United States District Court for the Southern District of Florida, a cancer survivor, recused himself from a case against UnitedHealthcare, stating that the company's denial of treatment was \"immoral and barbaric\", and that his opinions regarding the company would prevent him from \"deciding this case fairly and impartially.\"\n\nMental health treatment lawsuit\nAs reported by openminds.com:\n\nOn September 13, 2019, three addiction and mental health treatment centers sued United Behavioral Health (UBH), UnitedHealthcare's mental health subsidiary. The centers alleged that UBH wrongfully denied $5 million in behavioral health treatment claims for self-insured and fully insured employer health plans for residential and outpatient treatment from 2011 to 2017. The case involves claims for 157 employer group health plan members, including children.\n\nPennsylvania lawsuit\nIn 2019, UnitedHealthcare paid a $1 million penalty to settle Pennsylvania regulators' allegations that the company violated state and federal laws when paying medical claims, particularly for patients seeking treatment for autism and substance use disorders. The regulators also compelled the company to pay restitution for wrongly denied or delayed claims and to spend $800,000 on an outreach campaign to notify consumers of their mental health and substance use disorder benefits.\n\nDispute with TeamHealth\nIn late 2021, Tennessee-based physician network TeamHealth, a subsidiary of the private equity company Blackstone Inc., sued UnitedHealthcare in the 8th District Court of Clark County, Nevada, alleging the insurer underpaid claims to three of TeamHealth's Nevada-based affiliates. In November 2021, the jury unanimously found United guilty of \"oppression, fraud, and malice\" in its conduct and awarded TeamHealth $2.65 million in compensatory damages. In December, the jury reconvened to determine punitive damages and awarded TeamHealth $60 million. TeamHealth plans to pursue similar legal action against United and other insurers in New Jersey, Pennsylvania, New York, Florida, Oklahoma, and Texas.\n\nMedicare Advantage overbilling\nAn October 2021 New York Times report identified UnitedHealth in a list of Medicare insurers accused of over-billing. According to the Inspector General, a whistleblower came forward, so the U.S. government went after UnitedHealth for over-billing Medicare. Executives at UnitedHealth Group told workers to mine old medical records for more illnesses, to identify diagnoses of serious diseases that might have never existed, inflating bills paid by the federal government's Medicare Advantage program.\nA study by the Kaiser Family Foundation found that in 2021, Medicare Advantage programs provided insurers with double the gross margin of insurance for individuals, groups, or Medicaid Managed Care.\nIn July 2024, the Wall Street Journal concluded that UnitedHealth was the worst offender among private insurers who made dubious diagnoses in their clients in order to trigger large payments from the government's Medicare Advantage program. The patients often did not receive any treatment for those insurer-added diagnoses. The report, based on Medicare data obtained from the federal government under a research agreement, calculated that diagnoses added by UnitedHealth for diseases patients had never been treated for had yielded $8.7 billion in payments to the company in 2021 – over half of its net income of $17 billion for that year. In July 2025, the Wall Street Journal reported that DOJ officials were interviewing former UnitedHealth employees in connection with the investigation, and later that month, UnitedHealth confirmed that it was under criminal and civil federal investigation for its Medicare practices.\n\nChange Healthcare acquisition\nIn February 2022, the United States Department of Justice sued to stop UnitedHealth Group's $8 billion acquisition of Change Healthcare, arguing that the deal would give UnitedHealth access to its competitors' data and ultimately push up healthcare costs. The Justice Department said that UnitedHealth knew that access to claims would give it a view into rival health plans at Humana, Anthem Inc, CVS Health, Aetna, and Cigna. A U.S. judge rejected the department's bid in September. Following the completion of the acquisition in October 2022, the parties agreed that the appeal would be voluntarily dismissed, with no reasons provided by the Justice Department for dropping the appeal.\n\nSecret payments to nursing homes\nIn May 2025, The Guardian published an investigative report which uncovered a systemic effort by UnitedHealth to secretly pay nursing homes bonuses to deny hospital transfers for nursing home residents who needed immediate hospital care. Other tactics uncovered by The Guardian include UnitedHealth managers pressuring nurse practitioners to persuade members to sign onto Do not resuscitate agreements and payments for leaking confidential patient data to UnitedHealth sales teams. In June, UnitedHealth sued The Guardian for defamation over the findings of their article.\n\nCampaign against critics\nIn 2025, a New York Times investigation revealed that UnitedHealth Group, with the help of the law firm Clare Locke, had made legal threats against journalists, social media users and healthcare professionals who criticized their policies and practices. UnitedHealth also made take-down requests to social media companies hosting content critical of them.\n\nFoundations\nFoundations affiliated with UnitedHealth Group include the UnitedHealth Foundation (UHF) and the UnitedHealthcare Children's Foundation (UHCCF), both of which were established in 1999.\nUHF pledged $100 million over ten years to fund scholarships and workforce development programs focused on increasing ethnic and racial diversity within the health care industry. UHF's investment will support 10,000 physicians from underrepresented communities: 5,000 students with a primary care focus and 5,000 physicians who want to advance careers in mental health, nursing, midwifery and medicine. The work of this fund is part of a broader initiative in which UnitedHealth Group has teamed up with nine organizations to provide scholarships to more than 3,000 students through the Diverse Scholars Initiative.\nUHCCF administers grants to help pay for medical costs for families with coverage gaps. According to UHCCF, the foundation raises money for medical grants by selling gift items such as backpacks, books, cards, and games, some of which are created by children.\n\nSee also\nAmerica's Health Rankings reports released annually (in conjunction with UnitedHealth Group's UnitedHealth Foundation) since 1990\n2024 Change Healthcare ransomware attack\nKilling of Brian Thompson\nnH Predict\n\"United Health\", a protest song by Jesse Welles\n\nNotes\nReferences\nExternal links\nOfficial website \nBusiness data for UnitedHealth Group Incorporated: \nUnitedHealth Group Incorporated recipient profile on USAspending.gov",
  "clean_text": "UnitedHealth Group Incorporated is an American multinational for-profit company specializing in health insurance and health care services based in Eden Prairie, Minnesota. Selling insurance products under UnitedHealthcare, and health care services under the Optum brand, it is the world's seventh-largest company by revenue and the largest health care company by revenue. The company is ranked eighth on the 2024 Fortune Global 500. UnitedHealth Group has a market capitalization of more than $460 billion as of 2024. The company is the largest health insurer in the United States, insuring over 50 million people, and operates globally. Optum, carrying the same brand and name as Optum, functions as UnitedHealth Group's Business Process Outsourcing (BPO) and Shared Services subsidiary, catering to the group's customer service management with sites in countries like the Philippines. UnitedHealth Group has faced numerous investigations, lawsuits, and fines, including SEC enforcement for stock option backdating, Medicare over-billing, unfair claims practices, mental health treatment denials, and anticompetitive behavior. History 1970s–1990s UnitedHealth Group originated in late 1974, when Minnesota-based Charter Med Incorporated was founded by Richard Taylor Burke. It originally processed claims for doctors at the Hennepin County Medical Society. UnitedHealthcare Corporation was founded in 1977 to purchase Charter Med and create a network-based health plan for seniors. It became a publicly traded company in 1984 and changed its name to UnitedHealth Group in 1998. In 1988, UnitedHealthcare started its first pharmacy benefit management, through its Diversified Pharmaceutical Services subsidiary. It managed pharmacy benefits delivered both through retail pharmacies and mail. The subsidiary was sold to SmithKline Beecham in 1994 for $2.3 billion. In 1994, UnitedHealthcare acquired Ramsey-HMO, a Florida insurer. In 1995, the company acquired The MetraHealth Companies Inc. for $1.65 billion. MetraHealth was a privately held company formed by combining the group healthcare operations of The Travelers Companies and MetLife. In 1996, UnitedHealthcare acquired HealthWise of America, which operated HMOs in Arkansas, Maryland, Kentucky and Tennessee. In 1998, the company was reorganized as the holding of independent companies UnitedHealthcare, Ovations, Uniprise, Specialized Care Services, and Ingenix and rebranded as \"UnitedHealth Group\". Also in 1998, UnitedHealth Group acquired HealthPartners of Arizona, operator of Arizona's largest AHCCCS provider. 2000s In 2001, EverCare, a UnitedHealth Group subsidiary, merged with LifeMark Health Plans In 2002, UnitedHealth Group acquired GeoAccess and Medicaid insurance company AmeriChoice. In 2003, UnitedHealth Group acquired Mid Atlantic Medical Services, an insurer serving Maryland, Washington D.C., Virginia, Delaware and West Virginia. Also in 2003, UnitedHealth Group acquired Golden Rule Financial, a provider of health savings accounts. On July 21, 2003, Exante Bank started operating in Salt Lake City, Utah, as a Utah state-chartered industrial loan corporation. It changed its name to OptumHealth Bank in 2008 and to Optum Bank in 2012. In April 2004, UnitedHealth Group acquired Touchpoint Health Plan, a Wisconsin health plan. In July 2004, the company acquired Oxford Health Plans. In December 2005, the company acquired PacifiCare Health Systems. It agreed to divest parts of PacifiCare's commercial health insurance business in Tucson, Arizona and Boulder, Colorado to satisfy antitrust regulator concerns, and also agreed to end its network access agreement with Blue Shield of California. The Tucson business was sold to Cigna. The company acquired Prescription Solutions, another pharmacy benefits manager, as part of its acquisition of PacifiCare Health Systems. This business was later rebranded OptumRx. In February 2006, the company acquired John Deere Health Care. The same year, William W. McGuire stepped down as chairman and director due to his involvement in the employee stock options scandal. He was replaced by CEO Stephen Hemsley who had served as president and COO and a member of the board of directors. McGuire's exit compensation from UnitedHealth was anticipated to be $1.1 billion, but he only received $618 million after returning $420 million in stock options. In February 2008, the company acquired Sierra Health Services for $2.6 billion. As part of the transaction, to obtain regulatory approval, 25,000 customers were sold to Humana. In July 2009, UnitedHealth Group agreed to acquire Health Net's Northeast licensed subsidiaries for up to $570 million in payments spread out over two years. 2010s Through 2010 and into 2011, senior executives of the company met monthly with executives of other health insurers to limit the effect of the health care reform law. In July 2010, Ingenix acquired Picis Clinical Solutions, Inc., a health information provider for the high-acuity areas of hospitals. In 2011, Logistics Health, Inc. of La Crosse, Wisconsin, was acquired by OptumHealth. In September 2014, the office buildings where LHI is based were sold to UnitedHealth Group for $45 million. In February 2012, the company acquired XLHealth, a sponsor of Medicare Advantage health plans with a primary focus on medicare recipients with special needs such as those with chronic illness and those eligible for Medicaid (\"dual eligibles\"). In October 2012, UnitedHealth Group and Amil Participações, one of the biggest Brazilian health insurance companies, completed the first phase of their merger. In February 2014, Optum secured a majority stake in the Washington, D.C.–based startup Audax Health. Audax's CEO, Grant Verstandig, continued running the firm alongside COO David Ko. In October 2014, Optum Health acquired the health services unit of Alere for $600 million cash. In March 2015, it was announced that CatamaranRx would be acquired by OptumRx. In April 2016, the company announced it was pulling out of all but a \"handful\" of state healthcare exchanges provided under Affordable Care Act and will continue to sell only in three states in 2017. In 2017, UnitedHealth's Optum unit acquired Rally Health, a company started by Audax Health's executives. Prior to acquisition, in 2015, UnitedHealth supported Rally Health as a majority investor, and through enrolling more than 5 million UnitedHealth policy holders in Rally Health's flagship product, Rally. The close relations between UnitedHealth, Audax Health and Rally Health follows a close personal relationship between Grant Verstandig (Audax and Rally) and UnitedHealth's President and CFO at the time, David Wichmann. In June 2019, UnitedHealth's Optum division acquired Davita Medical Group from DaVita Inc. for $4.3 billion. That year, the company also agreed to acquire Equian for $3.2 billion. On June 19, 2019, UnitedHealth acquired the online patient community platform PatientsLikeMe for an undisclosed amount and it will be incorporated into UnitedHealth Group's research division. In November 2019, Andrew Witty was named president of UnitedHealth Group, in addition to his role as chief executive of the company's Optum division. 2020s–present UnitedHealth announced in March 2022 that it would acquire LHC Group for $5.4 billion. The deal will expand its home health capabilities by combining LHC's services with UnitedHealth's Optum unit. In 2022, UnitedHealth Group said there would be no out-of-pocket costs for albuterol, epinephrine, glucagon, insulin, and naloxone for fully insured members starting in 2023. The discounts were guaranteed for less than a quarter of UnitedHealthcare's membership and did not extend to those enrolled in UHC's Medicare Advantage and Medicaid plans. In 2023, UnitedHealthGroup announced it would move its headquarters from Minnetonka to Eden Prairie, Minnesota. In February 2024, UnitedHealth Group completed the sale of its operations in Brazil. In February 2022, UnitedHealth announced the acquisition of Change Healthcare, the largest health payments platform in the US, which the US Justice Department tried to block on antitrust grounds; the sale went through by September. 18 months later, in February 2024, the subsidiary was brought completely down by the 2024 Change Healthcare ransomware attack, and the Justice Department announced that it was opening a new antitrust and Medicare overcharging probe. Despite making a ransomware payment, services remained down or incomplete for months. The CEO, Andrew Witty, was called before the US House and US Senate to testify about the cyberattack and DoJ concerns. In late April 2024, the Senate held a hearing concerning the cyberattack and UnitedHealth's response. Andrew Witty went before the Senate stating that there needed to be a strong digital security system in place along with an adequate backup plan. UnitedHealth revealed the hackers did gain access to patient information, but the Senate was informed the company is not yet aware of the extent of the data breach. On December 4, 2024, Brian Thompson, the CEO of UnitedHealth Group's insurance division, was killed in a shooting in New York City. The shooting occurred outside the New York Hilton Midtown, where UnitedHealth Group was hosting an investor event. The shooting prompted many social media users to criticize UnitedHealthcare, the American health insurance system, and Thompson personally. Police later arrested a suspect, Luigi Mangione, and charged him with murder. Tim Noel joined UnitedHealthCare in 2007 and succeeded Brian Thompson as the CEO. Prior to becoming CEO, Noel was in charge of UnitedHealthCare's Medicare Advantage plans. Organizational structure UnitedHealth Group has about 2700 subsidiaries and affiliates worldwide, the highest profile being Optum and UnitedHealthcare. Optum Formed in 2011, Optum says that it provides \"data and analytics, pharmacy care services, population health, healthcare delivery, and healthcare operations\". It is organized into three businesses: OptumHealth – provides primary and secondary care. OptumInsight – provides data analytics, technology, and operations services. OptumRX – provides pharmacy services. UnitedHealthcare UnitedHealthcare (UHC) is an insurance and managed care company with four main divisions: UnitedHealthcare Employer and Individual – provides health benefit plans and services for large national employers and individuals. UnitedHealthcare Medicare and Retirement – provides health and well-being services to individuals age 65 and older. UnitedHealthcare Community and State – serves state programs that care for the economically disadvantaged, the medically underserved, and people without the benefit of employer-funded health care coverage, in exchange for a monthly premium per member from the state program. UnitedHealthcare Global – provides nearly 2.2 million people with care and benefits services in South America. Finance For the fiscal year 2022, UnitedHealth Group reported earnings of US$20.64 billion, with an annual revenue of US$324.16 billion. UnitedHealth Group's 2023 revenue grew by $47.5 billion, or 14.6%, on annualized revenue of $371.6 billion. Operating income for 2023 was $32.4 billion (up 13.8%). Cash flows from operations were $29.1 billion. UnitedHealth Group’s 2024 revenues grew $28.7 billion or 8% year-over-year to $400.3 billion. Earnings from operations of $32.3 billion compared to $32.4 billion in 2023. Cash flows from operations were $24.2 billion. Lobbying and political activity In 2009, according to OpenSecrets, people affiliated with UnitedHealth Group gave $4.77 million to political candidates and groups. The Affordable Care Act was being discussed in Congress at the time and was subsequently passed in the first quarter of 2010. In 2010 UnitedHealth Group hired nine different lobbying firms to work on its behalf. In addition, its corporate political action committee (PAC), called United for Health, spent an additional $1 million on lobbying activities. UnitedHealth Group subsequently spent $4.11 million to $4.75 million from 2011 to 2021. The Lewin Group The Lewin Group is a policy research and consulting firm that provides an economic analysis of health care and human services issues and policies. The organization has existed for about 40 years and has maintained a nonpartisan reputation through the many ownership changes that have occurred over that time. The Lewin Group was purchased in 2007 by Ingenix, a subsidiary of UnitedHealth Group, but alleges editorial and analytical \"independence\" from UnitedHealth Group, its parent company. The Lewin Group discloses its ownership in its reports and on its website. While the Lewin Group does not advocate for or against any legislation, both Democratic and Republican politicians frequently cite the firm's studies to argue for and against various U.S. healthcare reform proposals. For example, Democratic Senator Ron Wyden uses Lewin Group estimates to cite the feasibility of his Healthy Americans Act. Former U.S. Representative Eric Cantor, the former House Republican Whip, has referred to the organization as \"the nonpartisan Lewin Group\" in arguing against government-funded health insurance proposals. Several Lewin studies have been used to argue both for and against the inclusion of a public option in national health reform. Lewin clients who often cite its findings include The Commonwealth Fund, which, in 2009, held up a Lewin study it commissioned to advocate for a public plan. The report showed that legislative proposals would achieve nearly universal coverage and \"estimated that a public plan could offer small businesses insurance that is at least 9 percent cheaper than current small-business policies.\" However, the Lewin Group has acknowledged that clients sometimes choose to keep the results of studies they have commissioned private. Indeed, Lewin Group Vice President John Sheils told The Washington Post that \"sometimes studies come out that don't show exactly what the client wants to see. And in those instances, they have [the] option to bury the study.\" Criticism and controversies SEC investigation In 2006, the U.S. Securities and Exchange Commission (SEC) began investigating the conduct of UnitedHealth Group's management and directors, for backdating of stock options. Investigations were also started by the Internal Revenue Service and prosecutors in the U.S. attorney's office for the Southern District of New York, who subpoenaed documents from the company. The investigations came to light after a series of probing stories in the Wall Street Journal in May 2006, discussing the apparent backdating of hundreds of millions of dollars' worth of stock options by UHC management. The backdating apparently occurred with the knowledge and approval of the directors, according to the Journal. Major shareholders have filed lawsuits accusing former New Jersey governor Thomas Kean and UHC's other directors of failing in their fiduciary duty. On October 15, 2006, CEO William W. McGuire was forced to resign, and relinquish hundreds of millions of dollars in stock options. On December 6, 2007, the SEC announced a settlement under which McGuire was to repay $468 million, including a $7 million civil penalty, as a partial settlement of the backdating prosecution. He was also barred from serving as an officer or director of a public company for ten years. This was the first time in which the little-used \"clawback\" provision under the Sarbanes-Oxley Act was used against an individual by the SEC. The SEC continued its investigations even after it in 2008 settled legal actions against both UnitedHealth Group itself and its former general counsel. American Chiropractic Association lawsuit In June 2006, the American Chiropractic Association filed a national class-action lawsuit against the American Chiropractic Network (ACN), which is owned by UnitedHealth Group and administers chiropractic benefits, and against UnitedHealth Group itself, for alleged practices in violation of the federal Racketeer Influenced and Corrupt Organizations Act (RICO). The Missouri Department of Insurance, Financial Institutions and Professional Registration determined that UnitedHealth Group violated state insurance laws, so levied $536,000 in fines and ordered more than 50,000 cases re-opened; any improperly denied claims must have been reimbursed with interest for chiropractors and patients. OptumInsight, a.k.a. Ingenix lawsuit In February 2008, New York State Attorney General Andrew Cuomo announced an industry-wide investigation into a scheme by health insurers to defraud consumers by manipulating reasonable and customary rates. The announcement included a statement that Cuomo intended \"to file suit against Ingenix, Inc., its parent UnitedHealth Group, and three additional subsidiaries.\" Cuomo asserted that his investigation found that rates found in a database of health care charges maintained by Ingenix were lower than what he determined was the actual cost of certain medical expenses. Cuomo said this inappropriately allowed health insurance companies to deny a portion of provider claims, thereby pushing costs down to members. On January 13, 2009, Ingenix announced an agreement with the New York State attorney settling the probe into the independence of the health pricing database. Under the settlement, UnitedHealth Group and Ingenix would pay $50 million to finance a new, non-profit entity that would develop a new healthcare pricing database. Ingenix would discontinue its medical pricing databases when the new entity makes its product available. The company acknowledged the appearance of a conflict of interest but admitted no wrongdoing. On January 15, 2009, UnitedHealth Group announced a $350 million settlement of three class action lawsuits filed in Federal court by the American Medical Association, UnitedHealth Group members, healthcare providers, and state medical societies for not paying out-of-network benefits. This settlement came two days after a similar settlement with Cuomo. On October 27, 2009, Cuomo announced the creation of FAIR Health, an independent, non-profit organization that would develop a nationwide database for consumer reimbursement, as well as a website where consumers would be able to compare prices before choosing doctors. To fund FAIR Health, the Attorney General's office secured nearly $100 million from insurers such as Aetna, UnitedHealth Group, and Anthem Inc. PacifiCare fine in California In 2008, the California Department of Insurance took action against UnitedHealthcare's subsidiary PacifiCare Health Systems, acquired in 2005, ultimately fining UnitedHealthcare around $173 million for an estimated over 900,000 violations of the Unfair Insurance Practices Act; by 2019, the case was still being disputed in court, with the possibility of affirming $91 million in penalties. Medicare overbilling lawsuit A whistleblower lawsuit filed in 2011 charged UnitedHealth Group's data analytics division with assisting in defrauding Medicare by boosting risk adjustment scores from Medicare Advantage companies. The suit alleged that UnitedHealth Group subsidiary Ingenix (now OptumInsight) \"defrauded the United States of hundreds of millions – and likely billions – of dollars.\" Former UnitedHealth executive Benjamin Poehling brought the suit under the False Claims Act. The government said it would proceed on claims against two healthcare companies, UnitedHealth and its Texas subsidiary WellMed Medical Management. In February 2017, a federal judge unsealed the suit after the Department of Justice announced it would join the case. CMS fine over Medicare Part D In 2017, the Centers for Medicare and Medicaid Services (CMS) fined UnitedHealthcare $2.5 million after discovering issues in Medicare Part D leading to delays or denials in a 2016 audit. 2018 New Jersey fine In 2018, the New Jersey Department of Banking and Insurance fined UnitedHealthcare $2.5 million due to various compliance issues; this was the largest fine against a licensee in nine years. Richard Cole, and others v. UnitedHealthcare On April 29, 2019, Judge Robert N. Scola Jr. of the United States District Court for the Southern District of Florida, a cancer survivor, recused himself from a case against UnitedHealthcare, stating that the company's denial of treatment was \"immoral and barbaric\", and that his opinions regarding the company would prevent him from \"deciding this case fairly and impartially.\" Mental health treatment lawsuit As reported by openminds.com: On September 13, 2019, three addiction and mental health treatment centers sued United Behavioral Health (UBH), UnitedHealthcare's mental health subsidiary. The centers alleged that UBH wrongfully denied $5 million in behavioral health treatment claims for self-insured and fully insured employer health plans for residential and outpatient treatment from 2011 to 2017. The case involves claims for 157 employer group health plan members, including children. Pennsylvania lawsuit In 2019, UnitedHealthcare paid a $1 million penalty to settle Pennsylvania regulators' allegations that the company violated state and federal laws when paying medical claims, particularly for patients seeking treatment for autism and substance use disorders. The regulators also compelled the company to pay restitution for wrongly denied or delayed claims and to spend $800,000 on an outreach campaign to notify consumers of their mental health and substance use disorder benefits. Dispute with TeamHealth In late 2021, Tennessee-based physician network TeamHealth, a subsidiary of the private equity company Blackstone Inc., sued UnitedHealthcare in the 8th District Court of Clark County, Nevada, alleging the insurer underpaid claims to three of TeamHealth's Nevada-based affiliates. In November 2021, the jury unanimously found United guilty of \"oppression, fraud, and malice\" in its conduct and awarded TeamHealth $2.65 million in compensatory damages. In December, the jury reconvened to determine punitive damages and awarded TeamHealth $60 million. TeamHealth plans to pursue similar legal action against United and other insurers in New Jersey, Pennsylvania, New York, Florida, Oklahoma, and Texas. Medicare Advantage overbilling An October 2021 New York Times report identified UnitedHealth in a list of Medicare insurers accused of over-billing. According to the Inspector General, a whistleblower came forward, so the U.S. government went after UnitedHealth for over-billing Medicare. Executives at UnitedHealth Group told workers to mine old medical records for more illnesses, to identify diagnoses of serious diseases that might have never existed, inflating bills paid by the federal government's Medicare Advantage program. A study by the Kaiser Family Foundation found that in 2021, Medicare Advantage programs provided insurers with double the gross margin of insurance for individuals, groups, or Medicaid Managed Care. In July 2024, the Wall Street Journal concluded that UnitedHealth was the worst offender among private insurers who made dubious diagnoses in their clients in order to trigger large payments from the government's Medicare Advantage program. The patients often did not receive any treatment for those insurer-added diagnoses. The report, based on Medicare data obtained from the federal government under a research agreement, calculated that diagnoses added by UnitedHealth for diseases patients had never been treated for had yielded $8.7 billion in payments to the company in 2021 – over half of its net income of $17 billion for that year. In July 2025, the Wall Street Journal reported that DOJ officials were interviewing former UnitedHealth employees in connection with the investigation, and later that month, UnitedHealth confirmed that it was under criminal and civil federal investigation for its Medicare practices. Change Healthcare acquisition In February 2022, the United States Department of Justice sued to stop UnitedHealth Group's $8 billion acquisition of Change Healthcare, arguing that the deal would give UnitedHealth access to its competitors' data and ultimately push up healthcare costs. The Justice Department said that UnitedHealth knew that access to claims would give it a view into rival health plans at Humana, Anthem Inc, CVS Health, Aetna, and Cigna. A U.S. judge rejected the department's bid in September. Following the completion of the acquisition in October 2022, the parties agreed that the appeal would be voluntarily dismissed, with no reasons provided by the Justice Department for dropping the appeal. Secret payments to nursing homes In May 2025, The Guardian published an investigative report which uncovered a systemic effort by UnitedHealth to secretly pay nursing homes bonuses to deny hospital transfers for nursing home residents who needed immediate hospital care. Other tactics uncovered by The Guardian include UnitedHealth managers pressuring nurse practitioners to persuade members to sign onto Do not resuscitate agreements and payments for leaking confidential patient data to UnitedHealth sales teams. In June, UnitedHealth sued The Guardian for defamation over the findings of their article. Campaign against critics In 2025, a New York Times investigation revealed that UnitedHealth Group, with the help of the law firm Clare Locke, had made legal threats against journalists, social media users and healthcare professionals who criticized their policies and practices. UnitedHealth also made take-down requests to social media companies hosting content critical of them. Foundations Foundations affiliated with UnitedHealth Group include the UnitedHealth Foundation (UHF) and the UnitedHealthcare Children's Foundation (UHCCF), both of which were established in 1999. UHF pledged $100 million over ten years to fund scholarships and workforce development programs focused on increasing ethnic and racial diversity within the health care industry. UHF's investment will support 10,000 physicians from underrepresented communities: 5,000 students with a primary care focus and 5,000 physicians who want to advance careers in mental health, nursing, midwifery and medicine. The work of this fund is part of a broader initiative in which UnitedHealth Group has teamed up with nine organizations to provide scholarships to more than 3,000 students through the Diverse Scholars Initiative. UHCCF administers grants to help pay for medical costs for families with coverage gaps. According to UHCCF, the foundation raises money for medical grants by selling gift items such as backpacks, books, cards, and games, some of which are created by children."
}