{
  "ticker": "UNP",
  "cik": "0000100885",
  "company_name": "Union Pacific Corporation",
  "corrected_name": "Union Pacific Corporation",
  "wiki_title_used": "Union Pacific Corporation",
  "exists": true,
  "raw_text": "The Union Pacific Corporation is a publicly traded railroad holding company serving as the holding company for the Union Pacific Railroad. \nIncorporated in 1969 in Utah, it is headquartered in Omaha, Nebraska along with its Union Pacific Railroad subsidiary. Along with BNSF Railway, owned by Berkshire Hathaway, the companies have a near-duopoly on freight railroad transportation west of the Mississippi River.\nNotable companies acquired by Union Pacific and merged into Union Pacific Railroad include Missouri Pacific Railroad which included the Missouri–Kansas–Texas Railroad, the Chicago and North Western Transportation Company, the Western Pacific Railroad, the Denver and Rio Grande Western Railroad, the St. Louis Southwestern Railway, the SPCSL Corporation, and the Southern Pacific Transportation Company. \nUnion Pacific has announced plans to acquire the Norfolk Southern in a deal worth $85 billion. If approved by regulators, it would create the first transcontinental railroad network in the United States.\n\nHistory\nPre-history\nOn July 1, 1862, after the passage of the Pacific Railway Acts, an entity called Union Pacific Railroad was incorporated. The act was approved by President Abraham Lincoln, and it provided for the construction of railroads from the Missouri River to the Pacific as a war measure for the preservation of the Union. The railroad was constructed westward from Council Bluffs, Iowa to meet the Central Pacific Railroad line, which was constructed eastward from San Francisco Bay. The railroads were united with the \"Golden spike\" in May 1869. The combined Union Pacific-Central Pacific line became known as the First transcontinental railroad and the train route that operated on it was called the Overland Route.\nUnion Pacific was entangled in the Crédit Mobilier scandal, a fraud involving the company, which hurriedly constructed the railroad, and Crédit Mobilier of America, which was formed to finance the construction, from 1864 to 1867 and exposed in 1872. The company was significantly overbilled, with executives and financiers, led by Thomas C. Durant, Oakes Ames, and Oliver Ames, embezzling large sums of money. The company faced financial difficulty during the Panic of 1873.\nIn the 1870s, under the ownership of Jay Gould, the company expanded its rail network noticeably. On January 24, 1880, Union Pacific Railroad was consolidated with Kansas Pacific Railway and Denver Pacific Railway under a new holding company called Union Pacific Railway. Jay Gould controlled all three railroads but, after leveraging the company and paying large dividends, Gould sold a large stake that year.\nThe Union Pacific Railway declared bankruptcy during the Panic of 1893, in part due to losses from the fraud and new competition, and went into government receivership. In 1898, under a bankruptcy plan sponsored by Kuhn, Loeb & Co., it emerged from the receivership under a new similarly named entity controlled by E. H. Harriman.\nIn 1901, the company acquired a 46% interest in Southern Pacific Railroad; however, the government forced the company to sell the stake in 1913 due to antitrust concerns.\n\n20th century\nThe Union Pacific Corporation was established in 1969 with its incorporation in Utah as a holding company for the Union Pacific Railroad and other subsidiaries.\nIn 1982, Union Pacific Corporation acquired Missouri Pacific Railroad, which included the Missouri–Kansas–Texas Railroad, and the Western Pacific Railroad. The Missouri Pacific Railroad continued operations until January 1, 1997 when it was legally merged into Union Pacific Railroad.\nIn 1986, the company acquired Overnite Transportation Company (now TForce Freight) for $1.2 billion. At the time, it was the fifth largest trucking company in the United States and represented the expansion of Union Pacific east of the Mississippi River. It also created the first transcontinental transportation system in the United States. However, the companies did not integrate well, exacerbated by issues with labor unions. In 2001, the division acquired Motor Cargo Industries for $580 million. In 2003, Union Pacific completed a corporate spin-off and initial public offering of Overnite. In 2005, the company was acquired by United Parcel Service for $1.3 billion.\nUnion Pacific completed the corporate spin-off of Union Pacific Resources, its hydrocarbon exploration subsidiary, in 1996. Anadarko Petroleum acquired Union Pacific Resources in 2000 for $4.4 billion in stock.\nIn June 1995, the company acquired the 70% of Chicago and North Western Transportation Company that it did not already own for $1.1 billion.\nIn 1996, Union Pacific Corporation acquired the Southern Pacific Rail Corporation, which included the Southern Pacific Transportation Company, the Denver and Rio Grande Western Railroad, the St. Louis Southwestern Railway and the SPCSL Corporation, for $5.4 billion. It was led by Philip Anschutz.\nIn 1997, the company sold 220 miles of track in northern Wisconsin and Michigan to Wisconsin Central Ltd. for $85 million.\n\n21st century\nIn 2000, due to a slowdown in business activity during the early 2000s recession, the company cut 2,000 jobs.\nIn 2005, James R. Young was named CEO of the company.\nIn 2015, Union Pacific Corporation legally merged the Southern Pacific Rail Corporation into Union Pacific Railroad.\nIn March 2024 Union Pacific layoffs caused concern at the Federal Railroad Administration to the extent that the FRA, in a letter to UP's CEO, said \"safety of railroad operations is paramount ... decisions that comprise that fundamental ... are unacceptable. You must ensure that highly trained and experienced personnel perform critical inspections and repairs .... Your railroad (layoffs) are far outpacing any of your Class 1 peers.\"\nOn July 29, 2025, Union Pacific and Norfolk Southern announced an $85 billion agreement to create a transcontinental railroad. The boards of both companies unanimously approved the transaction, which remains subject to review by the Surface Transportation Board. If approved, the combined network would encompass more than 50,000 route miles across 43 states and connect approximately 100 ports in the United States.\n\nHeadquarters history\nThe Union Pacific Corporation was headquartered in New York City at the time of its in 1969. \nIn 1998, CEO Drew Lewis relocated the corporate headquarters to Bethlehem, Pennsylvania. In 1997, the headquarters was shifted to Dallas, Texas. \nIn 2004, the corporate headquarters was relocated to Omaha to join the Union Pacific Railroad headquarters.\n\nFinances\nSee also\nEconomy of Omaha, Nebraska\n\nReferences\nExternal links\n\nOfficial website\nBusiness data for Union Pacific: \nSystem map\nPhotographs of the Construction of the Union Pacific Railroad, 1868–69 at the Beinecke Rare Book and Manuscript Library at Yale University",
  "clean_text": "The Union Pacific Corporation is a publicly traded railroad holding company serving as the holding company for the Union Pacific Railroad. Incorporated in 1969 in Utah, it is headquartered in Omaha, Nebraska along with its Union Pacific Railroad subsidiary. Along with BNSF Railway, owned by Berkshire Hathaway, the companies have a near-duopoly on freight railroad transportation west of the Mississippi River. Notable companies acquired by Union Pacific and merged into Union Pacific Railroad include Missouri Pacific Railroad which included the Missouri–Kansas–Texas Railroad, the Chicago and North Western Transportation Company, the Western Pacific Railroad, the Denver and Rio Grande Western Railroad, the St. Louis Southwestern Railway, the SPCSL Corporation, and the Southern Pacific Transportation Company. Union Pacific has announced plans to acquire the Norfolk Southern in a deal worth $85 billion. If approved by regulators, it would create the first transcontinental railroad network in the United States. History Pre-history On July 1, 1862, after the passage of the Pacific Railway Acts, an entity called Union Pacific Railroad was incorporated. The act was approved by President Abraham Lincoln, and it provided for the construction of railroads from the Missouri River to the Pacific as a war measure for the preservation of the Union. The railroad was constructed westward from Council Bluffs, Iowa to meet the Central Pacific Railroad line, which was constructed eastward from San Francisco Bay. The railroads were united with the \"Golden spike\" in May 1869. The combined Union Pacific-Central Pacific line became known as the First transcontinental railroad and the train route that operated on it was called the Overland Route. Union Pacific was entangled in the Crédit Mobilier scandal, a fraud involving the company, which hurriedly constructed the railroad, and Crédit Mobilier of America, which was formed to finance the construction, from 1864 to 1867 and exposed in 1872. The company was significantly overbilled, with executives and financiers, led by Thomas C. Durant, Oakes Ames, and Oliver Ames, embezzling large sums of money. The company faced financial difficulty during the Panic of 1873. In the 1870s, under the ownership of Jay Gould, the company expanded its rail network noticeably. On January 24, 1880, Union Pacific Railroad was consolidated with Kansas Pacific Railway and Denver Pacific Railway under a new holding company called Union Pacific Railway. Jay Gould controlled all three railroads but, after leveraging the company and paying large dividends, Gould sold a large stake that year. The Union Pacific Railway declared bankruptcy during the Panic of 1893, in part due to losses from the fraud and new competition, and went into government receivership. In 1898, under a bankruptcy plan sponsored by Kuhn, Loeb & Co., it emerged from the receivership under a new similarly named entity controlled by E. H. Harriman. In 1901, the company acquired a 46% interest in Southern Pacific Railroad; however, the government forced the company to sell the stake in 1913 due to antitrust concerns. 20th century The Union Pacific Corporation was established in 1969 with its incorporation in Utah as a holding company for the Union Pacific Railroad and other subsidiaries. In 1982, Union Pacific Corporation acquired Missouri Pacific Railroad, which included the Missouri–Kansas–Texas Railroad, and the Western Pacific Railroad. The Missouri Pacific Railroad continued operations until January 1, 1997 when it was legally merged into Union Pacific Railroad. In 1986, the company acquired Overnite Transportation Company (now TForce Freight) for $1.2 billion. At the time, it was the fifth largest trucking company in the United States and represented the expansion of Union Pacific east of the Mississippi River. It also created the first transcontinental transportation system in the United States. However, the companies did not integrate well, exacerbated by issues with labor unions. In 2001, the division acquired Motor Cargo Industries for $580 million. In 2003, Union Pacific completed a corporate spin-off and initial public offering of Overnite. In 2005, the company was acquired by United Parcel Service for $1.3 billion. Union Pacific completed the corporate spin-off of Union Pacific Resources, its hydrocarbon exploration subsidiary, in 1996. Anadarko Petroleum acquired Union Pacific Resources in 2000 for $4.4 billion in stock. In June 1995, the company acquired the 70% of Chicago and North Western Transportation Company that it did not already own for $1.1 billion. In 1996, Union Pacific Corporation acquired the Southern Pacific Rail Corporation, which included the Southern Pacific Transportation Company, the Denver and Rio Grande Western Railroad, the St. Louis Southwestern Railway and the SPCSL Corporation, for $5.4 billion. It was led by Philip Anschutz. In 1997, the company sold 220 miles of track in northern Wisconsin and Michigan to Wisconsin Central Ltd. for $85 million. 21st century In 2000, due to a slowdown in business activity during the early 2000s recession, the company cut 2,000 jobs. In 2005, James R. Young was named CEO of the company. In 2015, Union Pacific Corporation legally merged the Southern Pacific Rail Corporation into Union Pacific Railroad. In March 2024 Union Pacific layoffs caused concern at the Federal Railroad Administration to the extent that the FRA, in a letter to UP's CEO, said \"safety of railroad operations is paramount ... decisions that comprise that fundamental ... are unacceptable. You must ensure that highly trained and experienced personnel perform critical inspections and repairs .... Your railroad (layoffs) are far outpacing any of your Class 1 peers.\" On July 29, 2025, Union Pacific and Norfolk Southern announced an $85 billion agreement to create a transcontinental railroad. The boards of both companies unanimously approved the transaction, which remains subject to review by the Surface Transportation Board. If approved, the combined network would encompass more than 50,000 route miles across 43 states and connect approximately 100 ports in the United States. Headquarters history The Union Pacific Corporation was headquartered in New York City at the time of its in 1969. In 1998, CEO Drew Lewis relocated the corporate headquarters to Bethlehem, Pennsylvania. In 1997, the headquarters was shifted to Dallas, Texas. In 2004, the corporate headquarters was relocated to Omaha to join the Union Pacific Railroad headquarters. Finances"
}