{
  "ticker": "URI",
  "cik": "0001067701",
  "company_name": "United Rentals",
  "corrected_name": "United Rentals",
  "wiki_title_used": "United Rentals",
  "exists": true,
  "raw_text": "United Rentals, Inc. is an American equipment rental company, with about 16 percent of the North American market share as of 2022. It owns the largest rental fleet in the world with approximately 4,800 classes of equipment totaling about $20.59 billion in original equipment cost (OEC) as of 2025. The company has a combined total of 1,625 locations, including an integrated network of 1,504 rental locations in North America, 38 in Europe, 23 in Australia and 19 in New Zealand. In North America, the company operates in 49 U.S. states and Puerto Rico and in every Canadian province. In 2017, United Rentals' revenue totaled more than $6.64 billion, with over $1.35 billion in profit. It is ranked #424 on the Fortune 500,  #1183 on the Forbes Global 2000 list of the world's largest public companies, and is the world's largest equipment rental company.\nURI was founded in 1997 by Brad Jacobs and grew primarily through acquisition. It offers general, aerial, and specialty rentals to a customer base that includes construction and industrial companies; utilities; municipalities; and homeowners. In addition to rentals, the company offers new and used equipment sales, servicing, and safety training.\nSince 2019, United Rentals has been led by Matthew Flannery (President & CEO), Michael Durand (Executive Vice President & COO), and Ted Grace (Executive Vice President & CFO). The company is headquartered in Stamford, Connecticut. In 2019, United Rentals was announced the 6th best stock of the 2010s, with a total return of 1,559%.\nIn 2025 United Rental's Power and HVAC Boise Branch were announced as sponsors of the Heterosexual Awesomeness Festival, providing financial backing and supplying all power needs for the stage, kid's zone, and vendors. Branch manager Paul Mitchell stated, \"We're proud to support an event that celebrates the strength and unity of traditional families.\" The event was poorly attended, and drew criticism for its anti-LGBTQ+ mission.\n\nHistory\nUnited Rentals was founded in September 1997. Then-chairman and CEO Hector Salazar Jr. planned to grow the company through acquisition and consolidation, beginning in October 1997 with six small leasing companies scattered across North America.\nIn December 1997, three months after forming, United Rentals began trading on the New York Stock Exchange under the symbol URI.\nIn June 1998, it acquired U.S. Rentals, Inc., for a sum variously reported as $1.2 billion and $1.31 billion. The acquisition made United Rentals the largest equipment rental company in North America.\nOn December 26, 2006, United Rentals announced the sale of their Highway Technology division to HTS Acquisition, Inc.\nOn July 23, 2007, United Rentals announced a definitive agreement to sell itself to Cerberus Capital Management in a transaction valued at approximately $6.6 billion, including the assumption of approximately $2.6 billion in debt obligations. URI's board of directors approved the merger agreement and recommended that stockholders do the same.\nOn November 15, 2007, the company announced that Cerberus was not prepared to proceed with the purchase on the terms set forth in its merger agreement. Cerberus confirmed that there had not been a material adverse change at United Rentals, which would have let it bow out of the deal without penalty. On December 21, 2007, a Delaware Chancery Court ruling denied United Rentals' attempt to force Cerberus to follow through on the takeover bid. However, the court did order Cerberus to pay the $100 million termination fee stipulated in the original agreement.\nOn December 16, 2011, United Rentals and RSC Holdings, Inc. announced that they had entered into a definitive merger agreement, under which United Rentals would acquire RSC in a cash-and-stock transaction. The largest merger in rental equipment history was finalized on April 30, 2012, boosting URI to what was at the time a 13 percent market share of the equipment rental industry.\nIn 2013, United Rentals moved its headquarters from Greenwich, Connecticut, to Stamford, Connecticut.\nOn March 9, 2014, the company announced plans to acquire National Pump for $780 million. This made United Rentals the second-largest pump rental company in North America. The transaction was finalized on March 31, 2014.\nIn June 2014, United Rentals was first listed on the Fortune 500. Based on its 2013 revenues of $4.955 billion, the company was ranked exactly 500th. It had previously made it as high as 517 in 2002, before falling back down.\nOn September 19, 2014, URI was added to the S&P 500 Index.\nOn January 25, 2017, United Rentals announced the purchase of NES Rentals, a competing general equipment rentals company, for approximately $965 million. It completed the acquisition on April 3, 2017.\nOn August 22, 2017, United Rentals announced it had acquired all power generation assets, primarily mobile generator sets, from Cummins Inc. To maintain fleet and customer service continuity, a small number of Cummins employees joined United Rentals.\nOn October 2, 2017, United Rentals announced it had completed the acquisition of Neff Corporation, a competing general equipment rentals company, for approximately $1.3 billion. In the transaction, United Rentals acquired approximately $867 million in equipment (based on original equipment cost) and Neff's 69 rental facility locations in the United States.\nOn October 4, 2017, United Rentals announced it had acquired the assets of Superior Speedie Portable Services, Inc. and Superior Logistics Services, Inc. (together \"Superior Speedie\"), which includes a fleet of over 8,000 portable toilets and over 130 restroom trailers. This new specialty division is named United Rentals Reliable Onsite Services.\nOn July 2, 2018, United Rentals announced it had agreed to purchase BakerCorp International for about $715 million in cash, enhancing its Pump Solutions division. BakerCorp is a leading provider of tank, pump, filtration, and trench shoring rentals, with about 950 employees, 46 locations in North America, and another 11 locations in Europe. Following the transaction, United Rentals changed the name of its Pump Solutions division to United Rentals Fluid Solutions.\nOn September 11, 2018, United Rentals announced an agreement to add BlueLine Rental, one of the top ten rental equipment companies in North America, to its growing list of acquisitions. United Rentals' board of directors unanimously approved the deal to purchase BlueLine from Platinum Equity for about $2.1 billion in cash. BlueLine has 114 locations in 25 US states, Canada, and Puerto Rico, and approximately 46,000 rental assets marketed primarily to mid-sized and local accounts.\nOn December 7, 2022, United Rentals completed the acquisition of Ahern Rentals, Inc. for approximately $2.0 billion in cash, adding Ahern's 106 rental facilities and approximately 66,000 rental assets.\nOn March 15, 2024, United Access completed the acquisition of Yak Access, Yak Mat and New South Access & Environmental Solutions from Platinum Equity for approximately $1.1 billion.\n\nOperations\nUnited Rentals is primarily a provider of construction and industrial equipment: trucks, aerial work platforms, counterbalance forklifts, reach forklifts, earth movers, compressors, homeowner equipment, and similar devices. Together, these are considered general and aerial rentals, and they make up the bulk of URI's rental fleet and customer base.\nThe company also rents equipment in five primary specialty fields:\n\nTrench safety includes shoring equipment for excavation in confined spaces and below-ground construction sites, and the training necessary to safely handle such equipment.\nPower & HVAC includes temporary power generators and mobile climate control. These devices are often used during commercial renovations, on television and movie sets, or in response to natural disasters.\nTool solutions involve renting out trailers stocked with tools and supplies. They are often used at large construction sites or during refinery shutdowns.\nFluid solutions include the devices and supplies necessary for transferring, containing or removing liquids. They tend to have applications in mining and agriculture.\nReliable Onsite Services involve the renting of portable toilets, restroom and shower trailers and, as of 2021, mobile and modular offices and mobile storage.\nAdditional specialty fields include:\n\nRadio Services involve the renting of portable radios. United Rentals is an authorized dealer for Motorola and can provide a variety of handheld and portable radio solutions.\nSports & Entertainment involve the renting of equipment that covers anything from movie production to large events like the Super Bowl.\nDrone Services involve providing drone services to scope out job sites and survey projects. Can be used on anything from large job sites to nuclear silos, etc.\nMatting services involve wood and composite matting for protecting surfaces during construction and maintenance.\n\nCanada\nUnited Rentals of Canada, Inc., a subsidiary of United Rentals, has agreed to acquire WesternOne Rentals & Sales LP with an all cash purchase of $91.8 million. The acquisition will add 330 employees and twelve locations in Alberta, British Columbia, and Manitoba.\n\nReferences\nExternal links\nOfficial website\nBusiness data for United Rentals:",
  "clean_text": "United Rentals, Inc. is an American equipment rental company, with about 16 percent of the North American market share as of 2022. It owns the largest rental fleet in the world with approximately 4,800 classes of equipment totaling about $20.59 billion in original equipment cost (OEC) as of 2025. The company has a combined total of 1,625 locations, including an integrated network of 1,504 rental locations in North America, 38 in Europe, 23 in Australia and 19 in New Zealand. In North America, the company operates in 49 U.S. states and Puerto Rico and in every Canadian province. In 2017, United Rentals' revenue totaled more than $6.64 billion, with over $1.35 billion in profit. It is ranked #424 on the Fortune 500, #1183 on the Forbes Global 2000 list of the world's largest public companies, and is the world's largest equipment rental company. URI was founded in 1997 by Brad Jacobs and grew primarily through acquisition. It offers general, aerial, and specialty rentals to a customer base that includes construction and industrial companies; utilities; municipalities; and homeowners. In addition to rentals, the company offers new and used equipment sales, servicing, and safety training. Since 2019, United Rentals has been led by Matthew Flannery (President & CEO), Michael Durand (Executive Vice President & COO), and Ted Grace (Executive Vice President & CFO). The company is headquartered in Stamford, Connecticut. In 2019, United Rentals was announced the 6th best stock of the 2010s, with a total return of 1,559%. In 2025 United Rental's Power and HVAC Boise Branch were announced as sponsors of the Heterosexual Awesomeness Festival, providing financial backing and supplying all power needs for the stage, kid's zone, and vendors. Branch manager Paul Mitchell stated, \"We're proud to support an event that celebrates the strength and unity of traditional families.\" The event was poorly attended, and drew criticism for its anti-LGBTQ+ mission. History United Rentals was founded in September 1997. Then-chairman and CEO Hector Salazar Jr. planned to grow the company through acquisition and consolidation, beginning in October 1997 with six small leasing companies scattered across North America. In December 1997, three months after forming, United Rentals began trading on the New York Stock Exchange under the symbol URI. In June 1998, it acquired U.S. Rentals, Inc., for a sum variously reported as $1.2 billion and $1.31 billion. The acquisition made United Rentals the largest equipment rental company in North America. On December 26, 2006, United Rentals announced the sale of their Highway Technology division to HTS Acquisition, Inc. On July 23, 2007, United Rentals announced a definitive agreement to sell itself to Cerberus Capital Management in a transaction valued at approximately $6.6 billion, including the assumption of approximately $2.6 billion in debt obligations. URI's board of directors approved the merger agreement and recommended that stockholders do the same. On November 15, 2007, the company announced that Cerberus was not prepared to proceed with the purchase on the terms set forth in its merger agreement. Cerberus confirmed that there had not been a material adverse change at United Rentals, which would have let it bow out of the deal without penalty. On December 21, 2007, a Delaware Chancery Court ruling denied United Rentals' attempt to force Cerberus to follow through on the takeover bid. However, the court did order Cerberus to pay the $100 million termination fee stipulated in the original agreement. On December 16, 2011, United Rentals and RSC Holdings, Inc. announced that they had entered into a definitive merger agreement, under which United Rentals would acquire RSC in a cash-and-stock transaction. The largest merger in rental equipment history was finalized on April 30, 2012, boosting URI to what was at the time a 13 percent market share of the equipment rental industry. In 2013, United Rentals moved its headquarters from Greenwich, Connecticut, to Stamford, Connecticut. On March 9, 2014, the company announced plans to acquire National Pump for $780 million. This made United Rentals the second-largest pump rental company in North America. The transaction was finalized on March 31, 2014. In June 2014, United Rentals was first listed on the Fortune 500. Based on its 2013 revenues of $4.955 billion, the company was ranked exactly 500th. It had previously made it as high as 517 in 2002, before falling back down. On September 19, 2014, URI was added to the S&P 500 Index. On January 25, 2017, United Rentals announced the purchase of NES Rentals, a competing general equipment rentals company, for approximately $965 million. It completed the acquisition on April 3, 2017. On August 22, 2017, United Rentals announced it had acquired all power generation assets, primarily mobile generator sets, from Cummins Inc. To maintain fleet and customer service continuity, a small number of Cummins employees joined United Rentals. On October 2, 2017, United Rentals announced it had completed the acquisition of Neff Corporation, a competing general equipment rentals company, for approximately $1.3 billion. In the transaction, United Rentals acquired approximately $867 million in equipment (based on original equipment cost) and Neff's 69 rental facility locations in the United States. On October 4, 2017, United Rentals announced it had acquired the assets of Superior Speedie Portable Services, Inc. and Superior Logistics Services, Inc. (together \"Superior Speedie\"), which includes a fleet of over 8,000 portable toilets and over 130 restroom trailers. This new specialty division is named United Rentals Reliable Onsite Services. On July 2, 2018, United Rentals announced it had agreed to purchase BakerCorp International for about $715 million in cash, enhancing its Pump Solutions division. BakerCorp is a leading provider of tank, pump, filtration, and trench shoring rentals, with about 950 employees, 46 locations in North America, and another 11 locations in Europe. Following the transaction, United Rentals changed the name of its Pump Solutions division to United Rentals Fluid Solutions. On September 11, 2018, United Rentals announced an agreement to add BlueLine Rental, one of the top ten rental equipment companies in North America, to its growing list of acquisitions. United Rentals' board of directors unanimously approved the deal to purchase BlueLine from Platinum Equity for about $2.1 billion in cash. BlueLine has 114 locations in 25 US states, Canada, and Puerto Rico, and approximately 46,000 rental assets marketed primarily to mid-sized and local accounts. On December 7, 2022, United Rentals completed the acquisition of Ahern Rentals, Inc. for approximately $2.0 billion in cash, adding Ahern's 106 rental facilities and approximately 66,000 rental assets. On March 15, 2024, United Access completed the acquisition of Yak Access, Yak Mat and New South Access & Environmental Solutions from Platinum Equity for approximately $1.1 billion. Operations United Rentals is primarily a provider of construction and industrial equipment: trucks, aerial work platforms, counterbalance forklifts, reach forklifts, earth movers, compressors, homeowner equipment, and similar devices. Together, these are considered general and aerial rentals, and they make up the bulk of URI's rental fleet and customer base. The company also rents equipment in five primary specialty fields: Trench safety includes shoring equipment for excavation in confined spaces and below-ground construction sites, and the training necessary to safely handle such equipment. Power & HVAC includes temporary power generators and mobile climate control. These devices are often used during commercial renovations, on television and movie sets, or in response to natural disasters. Tool solutions involve renting out trailers stocked with tools and supplies. They are often used at large construction sites or during refinery shutdowns. Fluid solutions include the devices and supplies necessary for transferring, containing or removing liquids. They tend to have applications in mining and agriculture. Reliable Onsite Services involve the renting of portable toilets, restroom and shower trailers and, as of 2021, mobile and modular offices and mobile storage. Additional specialty fields include: Radio Services involve the renting of portable radios. United Rentals is an authorized dealer for Motorola and can provide a variety of handheld and portable radio solutions. Sports & Entertainment involve the renting of equipment that covers anything from movie production to large events like the Super Bowl. Drone Services involve providing drone services to scope out job sites and survey projects. Can be used on anything from large job sites to nuclear silos, etc. Matting services involve wood and composite matting for protecting surfaces during construction and maintenance. Canada United Rentals of Canada, Inc., a subsidiary of United Rentals, has agreed to acquire WesternOne Rentals & Sales LP with an all cash purchase of $91.8 million. The acquisition will add 330 employees and twelve locations in Alberta, British Columbia, and Manitoba."
}