{
  "ticker": "VLO",
  "cik": "0001035002",
  "company_name": "Valero Energy",
  "corrected_name": "Valero Energy",
  "wiki_title_used": "Valero Energy",
  "exists": true,
  "raw_text": "Valero Energy Corporation is an American-based fuels producer mostly involved in manufacturing and marketing transportation fuels and other related products. It is headquartered in San Antonio, Texas, United States. Throughout the United States, Canada, and the United Kingdom, the company owns and operates 15 refineries with a combined throughput capacity of approximately 3.2 million barrels per day, two renewable diesel plants that produce approximately 1.2 billion gallons per year, and 12 ethanol plants with a combined production capacity of 1.6 billion gallons as its subsidiaries.\nAccording to a number of estimates, Valero has become a major producer of corn ethanol and renewable diesel, both low-carbon liquid transportation fuels.\n\nHistory\nValero was established on January 1, 1980, as a spinoff of Coastal States Gas Corporation's Subsidiary, LoVaca Gathering Company. The company took over the natural gas operations of the LoVaca Gathering Company, later renamed the Valero Transmission Company. In the 1970s, the Coastal company faced litigation due to its inability to honor contracts to supply utilities around Texas due to a natural gas shortage. After six years, Coastal agreed to a $1.6 billion settlement, which included the establishment of Valero as a new company.\nThe name Valero comes from Mission San Antonio de Valero, the original name of the mission in the Alamo. The company acquired Corpus Christi Marine Services Company, a small barge company in Corpus Christi, Texas, in April 1981 when it purchased a stake in Saber Energy Inc. of Houston. In May 1985, Valero Refining and Marketing Company was born from Valero's subsidiary, Saber Energy Inc.\nIn 1997, Valero merged its natural gas service business with Pacific Gas and Electric Company and spun off its refining assets to form Valero Energy Corporation. At the same time, the remaining divisions, which consisted of natural gas operations, merged with a wholly owned subsidiary of PG&E. In May of that year, Valero Energy acquired three refineries from Bassis Petroleum. The following year, the company expanded its operations by purchasing the Paulsboro Refinery in New Jersey from Mobil, making it the second-largest independent refiner in the U.S.\nIn 2000, Valero purchased the Benicia, California, refinery and interest in 350 Exxon-branded service stations in California, mainly in the San Francisco Bay Area. The company also began retailing gasoline under the Valero brand. In June 2001, Valero acquired two asphalt plants on the West Coast.\nIn 2001, Valero completed its acquisition of Ultramar Diamond Shamrock. With this acquisition, the company also received ownership of Shamrock Logistics L.P., which was renamed Valero L.P.  In 2006, Valero L.P. was spun off and renamed NuStar Energy.  Starting in 2002, Valero has expanded its marketing to the East Coast, specifically the Northeast and Florida, using the Valero brand.\nBy 2003, Valero completed its acquisition of El Paso Corp's refinery, pipeline system and terminal assets in Corpus Christi and South Texas. On April 25, 2005, the company purchased Premcor, Inc., for $8 billion. In June 2005, Valero announced that it was beginning a two-year process of converting Diamond Shamrock stations to the Valero brand. And in 2008, the company bought 72 Albertsons gas stations.\nIn 2009, it was reported that Valero lost an average $1 million per day since the beginning of the year. In November of that year, the company was forced to lay off 500 employees, and subsequently began to permanently shut down its refinery in Delaware City, Delaware.\nIn 2009, Valero Energy Corporation entered the ethanol market by acquiring 7 ethanol plants in March, and another 3 ethanol plants, purchased in December, all located in the Midwest of the United States.\nIn 2011, Valero Energy Corporation entered into a joint venture with a subsidiary of Darling Ingredients Inc. to establish Diamond Green Diesel Holdings (DGD). This venture resulted in the construction of a renewable diesel plant adjacent to Valero's refinery in St. Charles, Louisiana.\nOn March 11, 2011, Valero announced that it had agreed to a major European purchase from Chevron Corp., Chevron's Pembroke Refinery in Wales together with marketing and logistical assets throughout the United Kingdom and Ireland, which include 4 pipelines, 11 terminals, an aviation fuel business, about 1,000 retail outlets, inventory and other items.\nIn 2013, Valero spun off its retail operations into a new publicly traded company, CST Brands. Under long-term supply agreements, Valero continues to supply fuel to more than 7,000 retail locations, many of which use brand names owned by Valero. That same year, the company started renewable diesel production at the DGD joint venture plant next to Valero’s St. Charles refinery in Louisiana.\nIn 2021, DGD began expansion of the DGD St. Charles plant in 2019 and increased its renewable diesel capacity. In 2022, the second DGD plant, located next to Valero’s refinery in Port Arthur, Texas, began its operations.\nA change to the logo, store canopy and facade was announced in April 2018. Known as \"Vanguard\", with various hues of blue, white, and yellow, Valero explained that applying the new design to all its stores would take several months to complete.\n\nOperations\nValero's operations are managed through three main segments: refining, renewable diesel, and ethanol.\n\nRefining\nThis segment includes the operations of Valero's 15 petroleum refineries. The segment also encompasses the marketing of refined petroleum products and the logistics assets supporting these operations.\n\nRenewable Diesel\nValero operates this segment through Diamond Green Diesel (DGD), which has two plants in the Gulf Coast region of the United States. These plants have a combined annual production capacity of about 1.2 billion gallons of renewable diesel and 50 million gallons of renewable naphtha.\n\nEthanol\nValero's ethanol segment includes 12 plants combined production capacity of around 4.1 million gallons per day or approximately 1.6 billion gallons annually.\n\nSustainable Jet Fuel\nIn January 2023, Valero and Darling Ingredients Inc. announced an investment decision on a Sustainable Aviation Fuel (“SAF”) project at the Diamond Green Diesel Port Arthur plant. Valero announced the project was completed in October, 2024, bringing online a capacity of 235 million gallons a year of sustainable jet fuel, or SAF. The fuel consists of 50% synthetic paraffinic kerosene and can be blended with 50% conventional jet fuel. It is calculated to reduce greenhouse gas emissions by 74% to 84% compared to standard jet fuels.\nSouthwest Airlines signed a two-year agreement with Valero in October 2024, to begin using the sustainable jet fuel at Chicago’s Midway International Airport in a deal noted by Illinois Governor JB Pritzker, who enacted a SAF tax credit in 2023. JetBlue also started using Valero’s SAF at John F Kennedy International Airport in March 2024. It was the first long-term use of sustainable jet fuel in the Northeastern US.\n\nFinances\nFor the fiscal year 2017, Valero Energy reported earnings of US$4.065 billion, with an annual revenue of US$93.980 billion, an increase of 24.2% over the previous fiscal cycle. Valero Energy's shares traded at over $67 per share, and its market capitalization was valued at over US$39.2 billion in November 2018. Valero is ranked No. 31 on the Fortune 500 rankings of the largest United States corporations by total revenue as of 2018.\nFor 2023, the company reported earnings of US$9.149 billion, with an annual revenue of US$144.766 billion. Valero Energy's shares traded at $130 per share, and its market capitalization was valued at over US$44 billion. Valero is ranked No. 40 on the Fortune 500 rankings of United States corporations by total revenue as of 2022.\n\nEnvironmental record\nThe Political Economy Research Institute ranks Valero 28th among U.S. corporations based on their airborne pollutant emissions. This ranking considers both the quantity (3.4 million pounds in 2005) and the toxicity of the emissions.\nIn 2010, Valero was reportedly the largest financial supporter of California Proposition 23, contributing over $4 million by August of that year. Proposition 23 aimed to delay the implementation of California's Global Warming Solutions Act of 2006 until the state achieved an unemployment rate of 5.5% or lower for a full year. Critics argued that because that had happened only three times over the last 40 years, the proposition would have had the practical effect of repealing the law.\nValero owns two oil refineries in California. The Benicia Refinery is located on the Carquinez Strait, a tributary of the San Francisco Bay and the  Wilmington Refinery, located 23 miles (37 km) south from downtown Los Angeles. The company's refineries in Wilmington (CA), Benicia (CA), and Port Arthur (TX) were noted for processing crude oil from the Amazon region of South America, raising environmental concerns regarding the protection of the Amazon rainforest. In 2015, the Wilmington and Benicia refineries processed approximately 13,000 and 7,200 barrels of Amazonian crude oil per day, respectively.\nIn 2022, non-profit environmental group San Francisco Baykeeper sued Valero and Amports, a shipping operator, alleging that the companies had been dumping petroleum coke (or \"petcoke\") from Valero's Benicia Refinery into the San Francisco Bay. The lawsuit was settled in October 2024 for $2.38 million, with the companies also agreeing to site cleanup and investment in equipment to reduce spills and dust.\nIn 2024, the Bay Area Air Quality Management District and California Air Resources Board fined Valero $82 million over air pollution violations following a 2019 inspection at Valero's Benicia Refinery, with the fine being the largest in the District's history.\nIn April 2025, Valero announced it would shut down the Benicia refinery, after recording $1.1 billion in \"impairment\" costs related to its California operations as the state made efforts to move away from fossil fuels.\n\nEPA Compliance and mitigation\nIn 2020, the United States Environmental Protection Agency (EPA) announced a settlement with Valero and its subsidiaries regarding alleged Clean Air Act violations related to fuel quality standards and compliance requirements at the company's refineries and an import facilities. The related consent decree requires Valero to implement a company-wide Fuels Management System to help ensure its production complies with regulations. In 2023, an audit by Montrose Environmental concluded that Valero has taken substantial actions to address environmental and health concerns in underserved communities, aligning with the U.S. EPA's principles of environmental justice.\n\nCarbon footprint\nValero Energy reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 27,500 Kt (-2,000 /-6.8% y-o-y).\n\nDefense contracts\nIn the past years, Valero Energy Corp. has secured contracts worth several hundred millions of dollars from the United States Defense Logistics Agency Energy (DLA Energy) through the U.S. Defense Energy Support Center (DESC) to provide fuel for various defense needs.\n\nDivestitures\nDuring 2010, Valero sold its operations on the United States Atlantic coast.\nIn November 2009, Valero Energy closed its operations at Delaware City. Later, Valero Energy reached an agreement to sell the assets of its Delaware City Refining and Delaware Pipeline to a Petroplus Holdings subsidiary, PBF Energy Partners LP, for approximately $220 million in September 2010.\nShortly after the divestiture of Delaware City, the company sold its refinery at the Port of Paulsboro to PBF Holdings, a wholly owned subsidiary of PBF Energy, as well. The sale concluded Valero's refinery ownership on the East Coast.\n\nAcquisitions\nThrough acquisitions in 2011, Valero entered the European market while strengthening its position in the United States, by reducing costs in supplying the Atlantic coast.\nOn August 1, 2011, Valero acquired the Pembroke Refinery from Chevron, as well as the marketing and logistics assets, for $730 million, excluding working capital, which was valued at approximately $1 billion. The Pembroke plant is one of the largest and most complex refineries in Western Europe with a total throughput capacity of 270,000 barrels (43,000 m3) per day and a Nelson complexity index rating of 11.8.\nValero also purchased ownership interest in four major pipelines and eleven fuel terminals, a 14,000-barrel (2,200 m3)-per-day aviation fuel business, and a network of more than 1,000 Texaco-branded wholesale sites. Valero has continued with the Texaco brand in these markets.\n\nRetail\nValero retails gasoline branded as Valero, Shamrock, Diamond Shamrock, Beacon, and Total, the last under license from TotalEnergies. While this arm of the company was the most visible to the public, it was, according to CEO Bill Greehey, \"a very small part of [Valero's] operations\".\n\nValero attempted to shift its focus from being a discount gasoline brand to becoming a premium brand.  As part of the shift, Valero began to rebrand its Ultramar, Beacon, Total, and Diamond Shamrock stations to the Valero brand.  The Beacon and Shamrock brands are used by retailers as a low-cost alternative to the premium Valero brand. The Shamrock brand is based on the former Shamrock Oil and Gas Company, which merged with Diamond Alkali in 1967 to form Diamond Shamrock, thus declaring the trademark from official abandonment. The name Ultramar, while being eliminated in the United States, continued as Valero's brand name in Canada. Valero introduced its updated \"Corner Store\" retail concept on December 28, 2007, opening the company's first 5,500-square-foot (510 m2) prototype in western San Antonio. The Corner Store retail division, originally part of Diamond Shamrock, was absorbed into Valero's business portfolio in 2001. Not all Valero gas stations included a Corner Store - one Valero gas station in Euless, Texas east of Fort Worth was co-branded with a 7-Eleven convenience store.\n\nCreation of CST Brands\nOn July 31, 2012, during the 2nd Quarter Earnings Conference Call, Valero announced intentions to separate the retail business from the remainder of the company.  CFO Mike Ciskowski stated \"We believe the separation of our retail business by way of a tax-efficient distribution to our shareholders will create operational flexibility within the business and unlock value for our shareholders.\" In 2013, Valero completed the spinoff of the retail operations as CST Brands. Valero no longer owns retail operations using the Diamond Shamrock, Shamrock, Beacon, Ultramar, or Total names, but Valero continues to supply fuel.\nValero also supplies fuel in the United Kingdom and Ireland under the Texaco and Valero brand, and in October 2023 started test marketing of the Valero brand at 3 service stations close to its refinery in Wales, United Kingdom. In 2020, the Valero brand was introduced in Mexico and as of 2024 is the branded fuel supplier for 260 gas stations across the country.\n\nCredit cards\nValero issues its own private label credit cards for its stations through its credit card-only subsidiary, DSRM National Bank.  The initials stand for \"Diamond Shamrock Refining & Marketing\", the unit of Diamond Shamrock which created it before being purchased by Valero.  The credit card operations are based in Amarillo, Texas, a city where Diamond Shamrock was once previously based.\n\nSee also\nWilliam Greehey\nList of automotive fuel brands\nValero Alamo Bowl\nValero Texas Open\n\nNotes\nReferences\nExternal links\nOfficial website\nBusiness data for Valero Energy: \nValero Energy Asset Map",
  "clean_text": "Valero Energy Corporation is an American-based fuels producer mostly involved in manufacturing and marketing transportation fuels and other related products. It is headquartered in San Antonio, Texas, United States. Throughout the United States, Canada, and the United Kingdom, the company owns and operates 15 refineries with a combined throughput capacity of approximately 3.2 million barrels per day, two renewable diesel plants that produce approximately 1.2 billion gallons per year, and 12 ethanol plants with a combined production capacity of 1.6 billion gallons as its subsidiaries. According to a number of estimates, Valero has become a major producer of corn ethanol and renewable diesel, both low-carbon liquid transportation fuels. History Valero was established on January 1, 1980, as a spinoff of Coastal States Gas Corporation's Subsidiary, LoVaca Gathering Company. The company took over the natural gas operations of the LoVaca Gathering Company, later renamed the Valero Transmission Company. In the 1970s, the Coastal company faced litigation due to its inability to honor contracts to supply utilities around Texas due to a natural gas shortage. After six years, Coastal agreed to a $1.6 billion settlement, which included the establishment of Valero as a new company. The name Valero comes from Mission San Antonio de Valero, the original name of the mission in the Alamo. The company acquired Corpus Christi Marine Services Company, a small barge company in Corpus Christi, Texas, in April 1981 when it purchased a stake in Saber Energy Inc. of Houston. In May 1985, Valero Refining and Marketing Company was born from Valero's subsidiary, Saber Energy Inc. In 1997, Valero merged its natural gas service business with Pacific Gas and Electric Company and spun off its refining assets to form Valero Energy Corporation. At the same time, the remaining divisions, which consisted of natural gas operations, merged with a wholly owned subsidiary of PG&E. In May of that year, Valero Energy acquired three refineries from Bassis Petroleum. The following year, the company expanded its operations by purchasing the Paulsboro Refinery in New Jersey from Mobil, making it the second-largest independent refiner in the U.S. In 2000, Valero purchased the Benicia, California, refinery and interest in 350 Exxon-branded service stations in California, mainly in the San Francisco Bay Area. The company also began retailing gasoline under the Valero brand. In June 2001, Valero acquired two asphalt plants on the West Coast. In 2001, Valero completed its acquisition of Ultramar Diamond Shamrock. With this acquisition, the company also received ownership of Shamrock Logistics L.P., which was renamed Valero L.P. In 2006, Valero L.P. was spun off and renamed NuStar Energy. Starting in 2002, Valero has expanded its marketing to the East Coast, specifically the Northeast and Florida, using the Valero brand. By 2003, Valero completed its acquisition of El Paso Corp's refinery, pipeline system and terminal assets in Corpus Christi and South Texas. On April 25, 2005, the company purchased Premcor, Inc., for $8 billion. In June 2005, Valero announced that it was beginning a two-year process of converting Diamond Shamrock stations to the Valero brand. And in 2008, the company bought 72 Albertsons gas stations. In 2009, it was reported that Valero lost an average $1 million per day since the beginning of the year. In November of that year, the company was forced to lay off 500 employees, and subsequently began to permanently shut down its refinery in Delaware City, Delaware. In 2009, Valero Energy Corporation entered the ethanol market by acquiring 7 ethanol plants in March, and another 3 ethanol plants, purchased in December, all located in the Midwest of the United States. In 2011, Valero Energy Corporation entered into a joint venture with a subsidiary of Darling Ingredients Inc. to establish Diamond Green Diesel Holdings (DGD). This venture resulted in the construction of a renewable diesel plant adjacent to Valero's refinery in St. Charles, Louisiana. On March 11, 2011, Valero announced that it had agreed to a major European purchase from Chevron Corp., Chevron's Pembroke Refinery in Wales together with marketing and logistical assets throughout the United Kingdom and Ireland, which include 4 pipelines, 11 terminals, an aviation fuel business, about 1,000 retail outlets, inventory and other items. In 2013, Valero spun off its retail operations into a new publicly traded company, CST Brands. Under long-term supply agreements, Valero continues to supply fuel to more than 7,000 retail locations, many of which use brand names owned by Valero. That same year, the company started renewable diesel production at the DGD joint venture plant next to Valero’s St. Charles refinery in Louisiana. In 2021, DGD began expansion of the DGD St. Charles plant in 2019 and increased its renewable diesel capacity. In 2022, the second DGD plant, located next to Valero’s refinery in Port Arthur, Texas, began its operations. A change to the logo, store canopy and facade was announced in April 2018. Known as \"Vanguard\", with various hues of blue, white, and yellow, Valero explained that applying the new design to all its stores would take several months to complete. Operations Valero's operations are managed through three main segments: refining, renewable diesel, and ethanol. Refining This segment includes the operations of Valero's 15 petroleum refineries. The segment also encompasses the marketing of refined petroleum products and the logistics assets supporting these operations. Renewable Diesel Valero operates this segment through Diamond Green Diesel (DGD), which has two plants in the Gulf Coast region of the United States. These plants have a combined annual production capacity of about 1.2 billion gallons of renewable diesel and 50 million gallons of renewable naphtha. Ethanol Valero's ethanol segment includes 12 plants combined production capacity of around 4.1 million gallons per day or approximately 1.6 billion gallons annually. Sustainable Jet Fuel In January 2023, Valero and Darling Ingredients Inc. announced an investment decision on a Sustainable Aviation Fuel (“SAF”) project at the Diamond Green Diesel Port Arthur plant. Valero announced the project was completed in October, 2024, bringing online a capacity of 235 million gallons a year of sustainable jet fuel, or SAF. The fuel consists of 50% synthetic paraffinic kerosene and can be blended with 50% conventional jet fuel. It is calculated to reduce greenhouse gas emissions by 74% to 84% compared to standard jet fuels. Southwest Airlines signed a two-year agreement with Valero in October 2024, to begin using the sustainable jet fuel at Chicago’s Midway International Airport in a deal noted by Illinois Governor JB Pritzker, who enacted a SAF tax credit in 2023. JetBlue also started using Valero’s SAF at John F Kennedy International Airport in March 2024. It was the first long-term use of sustainable jet fuel in the Northeastern US. Finances For the fiscal year 2017, Valero Energy reported earnings of US$4.065 billion, with an annual revenue of US$93.980 billion, an increase of 24.2% over the previous fiscal cycle. Valero Energy's shares traded at over $67 per share, and its market capitalization was valued at over US$39.2 billion in November 2018. Valero is ranked No. 31 on the Fortune 500 rankings of the largest United States corporations by total revenue as of 2018. For 2023, the company reported earnings of US$9.149 billion, with an annual revenue of US$144.766 billion. Valero Energy's shares traded at $130 per share, and its market capitalization was valued at over US$44 billion. Valero is ranked No. 40 on the Fortune 500 rankings of United States corporations by total revenue as of 2022. Environmental record The Political Economy Research Institute ranks Valero 28th among U.S. corporations based on their airborne pollutant emissions. This ranking considers both the quantity (3.4 million pounds in 2005) and the toxicity of the emissions. In 2010, Valero was reportedly the largest financial supporter of California Proposition 23, contributing over $4 million by August of that year. Proposition 23 aimed to delay the implementation of California's Global Warming Solutions Act of 2006 until the state achieved an unemployment rate of 5.5% or lower for a full year. Critics argued that because that had happened only three times over the last 40 years, the proposition would have had the practical effect of repealing the law. Valero owns two oil refineries in California. The Benicia Refinery is located on the Carquinez Strait, a tributary of the San Francisco Bay and the Wilmington Refinery, located 23 miles (37 km) south from downtown Los Angeles. The company's refineries in Wilmington (CA), Benicia (CA), and Port Arthur (TX) were noted for processing crude oil from the Amazon region of South America, raising environmental concerns regarding the protection of the Amazon rainforest. In 2015, the Wilmington and Benicia refineries processed approximately 13,000 and 7,200 barrels of Amazonian crude oil per day, respectively. In 2022, non-profit environmental group San Francisco Baykeeper sued Valero and Amports, a shipping operator, alleging that the companies had been dumping petroleum coke (or \"petcoke\") from Valero's Benicia Refinery into the San Francisco Bay. The lawsuit was settled in October 2024 for $2.38 million, with the companies also agreeing to site cleanup and investment in equipment to reduce spills and dust. In 2024, the Bay Area Air Quality Management District and California Air Resources Board fined Valero $82 million over air pollution violations following a 2019 inspection at Valero's Benicia Refinery, with the fine being the largest in the District's history. In April 2025, Valero announced it would shut down the Benicia refinery, after recording $1.1 billion in \"impairment\" costs related to its California operations as the state made efforts to move away from fossil fuels. EPA Compliance and mitigation In 2020, the United States Environmental Protection Agency (EPA) announced a settlement with Valero and its subsidiaries regarding alleged Clean Air Act violations related to fuel quality standards and compliance requirements at the company's refineries and an import facilities. The related consent decree requires Valero to implement a company-wide Fuels Management System to help ensure its production complies with regulations. In 2023, an audit by Montrose Environmental concluded that Valero has taken substantial actions to address environmental and health concerns in underserved communities, aligning with the U.S. EPA's principles of environmental justice. Carbon footprint Valero Energy reported Total CO2e emissions (Direct + Indirect) for the twelve months ending 31 December 2020 at 27,500 Kt (-2,000 /-6.8% y-o-y). Defense contracts In the past years, Valero Energy Corp. has secured contracts worth several hundred millions of dollars from the United States Defense Logistics Agency Energy (DLA Energy) through the U.S. Defense Energy Support Center (DESC) to provide fuel for various defense needs. Divestitures During 2010, Valero sold its operations on the United States Atlantic coast. In November 2009, Valero Energy closed its operations at Delaware City. Later, Valero Energy reached an agreement to sell the assets of its Delaware City Refining and Delaware Pipeline to a Petroplus Holdings subsidiary, PBF Energy Partners LP, for approximately $220 million in September 2010. Shortly after the divestiture of Delaware City, the company sold its refinery at the Port of Paulsboro to PBF Holdings, a wholly owned subsidiary of PBF Energy, as well. The sale concluded Valero's refinery ownership on the East Coast. Acquisitions Through acquisitions in 2011, Valero entered the European market while strengthening its position in the United States, by reducing costs in supplying the Atlantic coast. On August 1, 2011, Valero acquired the Pembroke Refinery from Chevron, as well as the marketing and logistics assets, for $730 million, excluding working capital, which was valued at approximately $1 billion. The Pembroke plant is one of the largest and most complex refineries in Western Europe with a total throughput capacity of 270,000 barrels (43,000 m3) per day and a Nelson complexity index rating of 11.8. Valero also purchased ownership interest in four major pipelines and eleven fuel terminals, a 14,000-barrel (2,200 m3)-per-day aviation fuel business, and a network of more than 1,000 Texaco-branded wholesale sites. Valero has continued with the Texaco brand in these markets. Retail Valero retails gasoline branded as Valero, Shamrock, Diamond Shamrock, Beacon, and Total, the last under license from TotalEnergies. While this arm of the company was the most visible to the public, it was, according to CEO Bill Greehey, \"a very small part of [Valero's] operations\". Valero attempted to shift its focus from being a discount gasoline brand to becoming a premium brand. As part of the shift, Valero began to rebrand its Ultramar, Beacon, Total, and Diamond Shamrock stations to the Valero brand. The Beacon and Shamrock brands are used by retailers as a low-cost alternative to the premium Valero brand. The Shamrock brand is based on the former Shamrock Oil and Gas Company, which merged with Diamond Alkali in 1967 to form Diamond Shamrock, thus declaring the trademark from official abandonment. The name Ultramar, while being eliminated in the United States, continued as Valero's brand name in Canada. Valero introduced its updated \"Corner Store\" retail concept on December 28, 2007, opening the company's first 5,500-square-foot (510 m2) prototype in western San Antonio. The Corner Store retail division, originally part of Diamond Shamrock, was absorbed into Valero's business portfolio in 2001. Not all Valero gas stations included a Corner Store - one Valero gas station in Euless, Texas east of Fort Worth was co-branded with a 7-Eleven convenience store. Creation of CST Brands On July 31, 2012, during the 2nd Quarter Earnings Conference Call, Valero announced intentions to separate the retail business from the remainder of the company. CFO Mike Ciskowski stated \"We believe the separation of our retail business by way of a tax-efficient distribution to our shareholders will create operational flexibility within the business and unlock value for our shareholders.\" In 2013, Valero completed the spinoff of the retail operations as CST Brands. Valero no longer owns retail operations using the Diamond Shamrock, Shamrock, Beacon, Ultramar, or Total names, but Valero continues to supply fuel. Valero also supplies fuel in the United Kingdom and Ireland under the Texaco and Valero brand, and in October 2023 started test marketing of the Valero brand at 3 service stations close to its refinery in Wales, United Kingdom. In 2020, the Valero brand was introduced in Mexico and as of 2024 is the branded fuel supplier for 260 gas stations across the country. Credit cards Valero issues its own private label credit cards for its stations through its credit card-only subsidiary, DSRM National Bank. The initials stand for \"Diamond Shamrock Refining & Marketing\", the unit of Diamond Shamrock which created it before being purchased by Valero. The credit card operations are based in Amarillo, Texas, a city where Diamond Shamrock was once previously based."
}