{
  "ticker": "VLTO",
  "cik": "0001967680",
  "company_name": "Veralto",
  "corrected_name": "Veralto",
  "wiki_title_used": "Veralto",
  "exists": true,
  "raw_text": "Veralto Corporation is an American technology company headquartered in Waltham, Massachusetts. It produces products related to water analytics, water treatment, marking and coding, and packaging and color.\nThe company operates two divisions: Water Quality (60% of 2024 revenues), focused on products for water analytics and water treatment, which includes Hach Company, Trojan Technologies, ChemTreat, and SeaBird Scientific; and Product Quality & Innovation (40% of 2024 revenues), focused on products for marking and coding, and packaging and color and includes Videojet, Linx, Esko, and X-Rite the latter of which is the parent company of Pantone.\nIn 2024, Veralto generated 48% of its sales in North America, 22% of its sales in Western Europe, and 30% of its sales in other locations.\nThe company ranked 647th and 1393rd  on the 2025 editions of the Fortune 500 and Forbes Global 2000, respectively.\n\nHistory\nDanaher Corporation completed the corporate spin-off of the company in September 2023, with each shareholder of Danaher receiving one share of Veralto common stock for every three shares of Danaher held as of 13 September.\nIn October 2024, the company acquired TraceGains, a cloud-based software platform used for compliance and reporting regulations for food and beverage safety and traceability, for $350 million.\nIn November 2024, Veralto invested $15 million in Axine Water Technologies. \nIn February 2025, the company acquired Aquafides, which produces ultraviolet water treatment systems, for $20 million.\nIn July 2025, Veralto made a $20 million investment in Emerald Technology Ventures, a venture capital fund.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Veralto Corporation:",
  "clean_text": "Veralto Corporation is an American technology company headquartered in Waltham, Massachusetts. It produces products related to water analytics, water treatment, marking and coding, and packaging and color. The company operates two divisions: Water Quality (60% of 2024 revenues), focused on products for water analytics and water treatment, which includes Hach Company, Trojan Technologies, ChemTreat, and SeaBird Scientific; and Product Quality & Innovation (40% of 2024 revenues), focused on products for marking and coding, and packaging and color and includes Videojet, Linx, Esko, and X-Rite the latter of which is the parent company of Pantone. In 2024, Veralto generated 48% of its sales in North America, 22% of its sales in Western Europe, and 30% of its sales in other locations. The company ranked 647th and 1393rd on the 2025 editions of the Fortune 500 and Forbes Global 2000, respectively. History Danaher Corporation completed the corporate spin-off of the company in September 2023, with each shareholder of Danaher receiving one share of Veralto common stock for every three shares of Danaher held as of 13 September. In October 2024, the company acquired TraceGains, a cloud-based software platform used for compliance and reporting regulations for food and beverage safety and traceability, for $350 million. In November 2024, Veralto invested $15 million in Axine Water Technologies. In February 2025, the company acquired Aquafides, which produces ultraviolet water treatment systems, for $20 million. In July 2025, Veralto made a $20 million investment in Emerald Technology Ventures, a venture capital fund."
}