{
  "ticker": "VMC",
  "cik": "0001396009",
  "company_name": "Vulcan Materials Company",
  "corrected_name": "Vulcan Materials Company",
  "wiki_title_used": "Vulcan Materials Company",
  "exists": true,
  "raw_text": "Vulcan Materials Company (NYSE: VMC) is an American company based in Birmingham, Alabama. It is principally engaged in the production, distribution and sale of construction materials. Vulcan is the largest producer of construction materials, primarily gravel, crushed stone, and sand, and employs approximately 12,000 people at over 400 facilities. Vulcan serves 22 states, the District of Columbia, Mexico, Canada, Bahamas and the U.S. Virgin Islands. Vulcan's Crescent Market project led to construction of a large quarry and deep water seaport on the Yucatán Peninsula of Mexico, just south of Cancún. This quarry supplies Tampa, New Orleans, Houston, and Brownsville, Texas, as well as other Gulf coast seaports, with crushed limestone via large 62,000-ton self-discharging ships.\n\nHistory\nIn the late 1980s Vulcan acquired Reed Crushed Stone, near Kentucky.\nOn November 16, 1998, Vulcan announced it was purchasing CalMat Company, a producer of asphalt and ready-mixed concrete based in Los Angeles, for $760 million in cash.\nOn June 7, 2005, Vulcan completed the sale of its chemicals business, known as Vulcan Chemicals, to Occidental Chemical Corporation. The sale of assets included Vulcan's chloralkali plants in Wichita, Kansas; Geismar, Louisiana; and Port Edwards, Wisconsin, as well as Vulcan Chemicals' joint venture located in Geismar, Louisiana. In 2005, Vulcan acquired 11 aggregates operations and five asphalt plants in Arizona, Georgia, Indiana and Tennessee.\nOn February 19, 2007, Vulcan announced that it would buy stone and cement producer Florida Rock Industries for $4.7 billion. Vulcan completed the acquisition of Florida Rock on November 16, 2007.\nIn March 2007, Vulcan announced that it had been named to Fortune Magazine's list of Most Admired Companies for the sixth time. The company was ranked first in its industry sector, \"Building Materials, Glass.\" Overall, Vulcan ranked among the top 10 companies in the Fortune 1000 for both long-term investment and social responsibility.\nIn January 2014, Vulcan Materials announced they would be selling their Florida Rock Industry (cement and ready-mixed concrete) plants and equipment to Cementos Argos, of Colombia. In March 2014, Vulcan was able to fully divest these properties to Cementos Argos.\nIn January 2018, Vulcan Materials was found to be partially responsible for the Bayou Corne sinkhole, along with Occidental Petroleum and Texas Brine Company.\nIn June 2021, Vulcan Materials announced they would be acquiring US Concrete (USCR) for $74 per share, a 30% premium on the date of the announcement. U.S. Concrete was formed in 1999, with its headquarters in Euless, TX. The deal is valued at $1.3 billion.  The acquisition will allow for integrated expansion of Vulcan and make the subsidiary debt-free with adequate working capital. The deal has been approved by both boards and will close in the second half of 2021.\nIn early 2023, after being accused by president Andrés Manuel López Obrador of exporting materials from Mexico without a permit, the Mexican military seized a marine terminal belonging to Vulcan, leading to a diplomatic spat between the U.S. and Mexico.\n\nSee also\nList of Alabama companies\n\nReferences\nExternal links\n\nOfficial website\nU.S. v. Vulcan Materials Co. and Florida Rock Industries Inc., a US Supreme court case\nBusiness data for Vulcan Materials Company:",
  "clean_text": "Vulcan Materials Company (NYSE: VMC) is an American company based in Birmingham, Alabama. It is principally engaged in the production, distribution and sale of construction materials. Vulcan is the largest producer of construction materials, primarily gravel, crushed stone, and sand, and employs approximately 12,000 people at over 400 facilities. Vulcan serves 22 states, the District of Columbia, Mexico, Canada, Bahamas and the U.S. Virgin Islands. Vulcan's Crescent Market project led to construction of a large quarry and deep water seaport on the Yucatán Peninsula of Mexico, just south of Cancún. This quarry supplies Tampa, New Orleans, Houston, and Brownsville, Texas, as well as other Gulf coast seaports, with crushed limestone via large 62,000-ton self-discharging ships. History In the late 1980s Vulcan acquired Reed Crushed Stone, near Kentucky. On November 16, 1998, Vulcan announced it was purchasing CalMat Company, a producer of asphalt and ready-mixed concrete based in Los Angeles, for $760 million in cash. On June 7, 2005, Vulcan completed the sale of its chemicals business, known as Vulcan Chemicals, to Occidental Chemical Corporation. The sale of assets included Vulcan's chloralkali plants in Wichita, Kansas; Geismar, Louisiana; and Port Edwards, Wisconsin, as well as Vulcan Chemicals' joint venture located in Geismar, Louisiana. In 2005, Vulcan acquired 11 aggregates operations and five asphalt plants in Arizona, Georgia, Indiana and Tennessee. On February 19, 2007, Vulcan announced that it would buy stone and cement producer Florida Rock Industries for $4.7 billion. Vulcan completed the acquisition of Florida Rock on November 16, 2007. In March 2007, Vulcan announced that it had been named to Fortune Magazine's list of Most Admired Companies for the sixth time. The company was ranked first in its industry sector, \"Building Materials, Glass.\" Overall, Vulcan ranked among the top 10 companies in the Fortune 1000 for both long-term investment and social responsibility. In January 2014, Vulcan Materials announced they would be selling their Florida Rock Industry (cement and ready-mixed concrete) plants and equipment to Cementos Argos, of Colombia. In March 2014, Vulcan was able to fully divest these properties to Cementos Argos. In January 2018, Vulcan Materials was found to be partially responsible for the Bayou Corne sinkhole, along with Occidental Petroleum and Texas Brine Company. In June 2021, Vulcan Materials announced they would be acquiring US Concrete (USCR) for $74 per share, a 30% premium on the date of the announcement. U.S. Concrete was formed in 1999, with its headquarters in Euless, TX. The deal is valued at $1.3 billion. The acquisition will allow for integrated expansion of Vulcan and make the subsidiary debt-free with adequate working capital. The deal has been approved by both boards and will close in the second half of 2021. In early 2023, after being accused by president Andrés Manuel López Obrador of exporting materials from Mexico without a permit, the Mexican military seized a marine terminal belonging to Vulcan, leading to a diplomatic spat between the U.S. and Mexico."
}