{
  "ticker": "VRSK",
  "cik": "0001442145",
  "company_name": "Verisk Analytics",
  "corrected_name": "Verisk Analytics",
  "wiki_title_used": "Verisk Analytics",
  "exists": true,
  "raw_text": "Verisk Analytics, Inc. is an American multinational data analytics and risk assessment firm based in Jersey City, New Jersey, with customers in insurance, natural resources, financial services, government, and risk management sectors. The company uses proprietary data sets and industry expertise to provide predictive analytics and decision support consultations in areas including fraud prevention, actuarial science, insurance coverage, fire protection, catastrophe and weather risk, and data management.\nThe company was privately held until an initial public offering on October 6, 2009, which raised $1.9 billion for several of the large insurance companies that were its primary shareholders, making it the largest IPO in the United States for the year. The firm did not raise any funds for itself in the IPO, which was designed to provide an opportunity for the firm's casualty and property insurer owners to sell some or all of their holdings and to provide a market price for those retaining their shares. The 2009 IPO was priced at $22 per share for 85.25 million shares owned by its shareholders, including American International Group, The Hartford and Travelers, making it the largest since the 2008 IPO for Visa Inc. In an action described by investment research company Morningstar as a \"vote of confidence\" in Verisk, Berkshire Hathaway was the only company among the firm's largest shareholders that did not sell any of its stock in the October 2009 IPO.\n\nHistory & acquisitions\nThe company's Insurance Services Office (ISO) subsidiary was created in 1971 through the consolidation of various state, regional, and national rating bureaus for various lines of property/casualty insurance. ISO helps insurers with product development, underwriting, and rating. In 2008, Verisk Analytics was established to serve as the parent holding company of ISO. In 2009, Verisk completed its IPO and became a publicly traded company.\nSince 2000, the company has acquired about 40 new businesses, which have helped broaden its product offerings. In 2002, it expanded its decision analytics business with the acquisition of AIR Worldwide, a catastrophe modeling firm. In 2004, it entered the healthcare market by acquiring several businesses, through which it offers analytical and reporting systems for health insurers, provider organizations, and self-insured employers. In 2006, the company expanded in the insurance claims sector with the acquisition of Xactware, a provider of estimating software for building repair and construction. In 2010, Verisk acquired 3E Company, a provider of services that help customers comply with government-mandated environmental health and safety requirements.\nIn 2012, Verisk acquired Argus & Advisory Services, a provider of competitive benchmarking, analytics, and customized services to financial institutions and regulators in North America, Latin America, and Europe. Also in 2012, Verisk acquired Aspect Loss Prevention, a loss prevention software developer for retail, entertainment, and food industries; and MediConnect Global, Inc., which develops software for medical records aggregation and analysis.\nIn 2014, Verisk acquired Maplecroft, a provider of global risk analytics and advisory services, and Dart, a provider of benchmarking financial services for companies operating in Australia, New Zealand, and other Asia-Pacific markets. Then in 2015, Verisk acquired Wood Mackenzie, a data analytics and commercial intelligence company for energy, chemicals, metals, and mining industries, in a deal valued at $2.8 billion. Verisk later acquired PowerAdvocate, a provider of data analytics and consulting services for the utilities and oil & gas industries, in 2017 for approximately $280 million.\nVerisk also currently owns and operates Atmospheric and Environmental Research (AER), a research agency headquartered in Lexington, Massachusetts. AER conducts environmental studies with a focus on weather and climate research in order to provide risk assessment and analysis for various clients such as NOAA, NASA, and the United States Armed Forces.\nWood Mackenzie was sold to Veritas Capital in October 2022 in a deal valued at $3.1 billion.\nIn December 2022, Verisk announced that it had entered into an agreement to acquire Mavera, a Sweden-based insurtech firm that operates a personal injury claims management platform.\n\nReferences\nExternal links\nBusiness data for Verisk Analytics:",
  "clean_text": "Verisk Analytics, Inc. is an American multinational data analytics and risk assessment firm based in Jersey City, New Jersey, with customers in insurance, natural resources, financial services, government, and risk management sectors. The company uses proprietary data sets and industry expertise to provide predictive analytics and decision support consultations in areas including fraud prevention, actuarial science, insurance coverage, fire protection, catastrophe and weather risk, and data management. The company was privately held until an initial public offering on October 6, 2009, which raised $1.9 billion for several of the large insurance companies that were its primary shareholders, making it the largest IPO in the United States for the year. The firm did not raise any funds for itself in the IPO, which was designed to provide an opportunity for the firm's casualty and property insurer owners to sell some or all of their holdings and to provide a market price for those retaining their shares. The 2009 IPO was priced at $22 per share for 85.25 million shares owned by its shareholders, including American International Group, The Hartford and Travelers, making it the largest since the 2008 IPO for Visa Inc. In an action described by investment research company Morningstar as a \"vote of confidence\" in Verisk, Berkshire Hathaway was the only company among the firm's largest shareholders that did not sell any of its stock in the October 2009 IPO. History & acquisitions The company's Insurance Services Office (ISO) subsidiary was created in 1971 through the consolidation of various state, regional, and national rating bureaus for various lines of property/casualty insurance. ISO helps insurers with product development, underwriting, and rating. In 2008, Verisk Analytics was established to serve as the parent holding company of ISO. In 2009, Verisk completed its IPO and became a publicly traded company. Since 2000, the company has acquired about 40 new businesses, which have helped broaden its product offerings. In 2002, it expanded its decision analytics business with the acquisition of AIR Worldwide, a catastrophe modeling firm. In 2004, it entered the healthcare market by acquiring several businesses, through which it offers analytical and reporting systems for health insurers, provider organizations, and self-insured employers. In 2006, the company expanded in the insurance claims sector with the acquisition of Xactware, a provider of estimating software for building repair and construction. In 2010, Verisk acquired 3E Company, a provider of services that help customers comply with government-mandated environmental health and safety requirements. In 2012, Verisk acquired Argus & Advisory Services, a provider of competitive benchmarking, analytics, and customized services to financial institutions and regulators in North America, Latin America, and Europe. Also in 2012, Verisk acquired Aspect Loss Prevention, a loss prevention software developer for retail, entertainment, and food industries; and MediConnect Global, Inc., which develops software for medical records aggregation and analysis. In 2014, Verisk acquired Maplecroft, a provider of global risk analytics and advisory services, and Dart, a provider of benchmarking financial services for companies operating in Australia, New Zealand, and other Asia-Pacific markets. Then in 2015, Verisk acquired Wood Mackenzie, a data analytics and commercial intelligence company for energy, chemicals, metals, and mining industries, in a deal valued at $2.8 billion. Verisk later acquired PowerAdvocate, a provider of data analytics and consulting services for the utilities and oil & gas industries, in 2017 for approximately $280 million. Verisk also currently owns and operates Atmospheric and Environmental Research (AER), a research agency headquartered in Lexington, Massachusetts. AER conducts environmental studies with a focus on weather and climate research in order to provide risk assessment and analysis for various clients such as NOAA, NASA, and the United States Armed Forces. Wood Mackenzie was sold to Veritas Capital in October 2022 in a deal valued at $3.1 billion. In December 2022, Verisk announced that it had entered into an agreement to acquire Mavera, a Sweden-based insurtech firm that operates a personal injury claims management platform."
}