{
  "ticker": "VRTX",
  "cik": "0000875320",
  "company_name": "Vertex Pharmaceuticals",
  "corrected_name": "Vertex Pharmaceuticals",
  "wiki_title_used": "Vertex Pharmaceuticals",
  "exists": true,
  "raw_text": "Vertex Pharmaceuticals Incorporated is an American biopharmaceutical company based in Boston, Massachusetts. It was one of the first biotech firms to use an explicit strategy of rational drug design rather than combinatorial chemistry. It maintains headquarters in Boston, Massachusetts, and three research facilities, in San Diego, California, and Milton Park, Oxfordshire, England.\n\nHistory\nVertex was founded in 1989 by Joshua Boger and Kevin J. Kinsella to \"transform the way serious diseases are treated.\"\nThe company's beginnings were profiled by Barry Werth in the 1994 book The Billion-Dollar Molecule. His 2014 book, The Antidote: Inside the World of New Pharma, chronicled the company's subsequent development over the next two decades.\nBy 2004, its product pipeline focused on viral infections, inflammatory and autoimmune disorders, and cancer.\nIn 2009, the company had about 1,800 employees, including 1,200 in the Boston area. By 2019 there were about 2,500 employees.\nSince late 2011, Vertex has ranked among the top 15 best-performing companies on the Standard & Poor's 500. Vertex shares increased 250 percent in the same period. In January 2014, Vertex completed its move from Cambridge, Massachusetts, to Boston, Massachusetts, and took residence in a new, $800 million complex. Located on the South Boston waterfront, it marked the first time in the company's history that all of the roughly 1,200 Vertex employees in the Greater Boston area worked together.\nOn 23 January 2019, Ian Smith, the COO and interim CFO of Vertex, was terminated from his position for undisclosed personal behavior that violated established company code of conduct rules. In June of the same year, Vertex announced it would acquire Exonics Therapeutics for up to $1 billion and collaborate with CRISPR Therapeutics, boosting its development of treatments for Duchenne muscular dystrophy and myotonic dystrophy type 1.\nIn September 2019 the company announced it would acquire Semma Therapeutics for $950 million in cash. Semma Therapeutics created a \"small, implantable device that holds millions of replacement beta cells, letting glucose and insulin through but keeping immune cells out.\"\nOn 1 April 2020, Reshma Kewalramani, then the chief medical officer, became president and chief executive officer of Vertex Pharmaceuticals. Former CEO and president Jeffrey Leiden transitioned to the role of executive chairman of the board of directors, as of 1 April 2020. Leiden was to serve as executive chairman until April 2023, although as of September 2024 he remained in that post.\nIn July 2022, the business announced it would acquire ViaCyte, Inc. for $320 million.\nIn April 2024, it was announced Vertex had agreed to acquire the Seattle-headquartered clinical stage biopharmaceutical company Alpine Immune Sciences for $4.9 billion.\n\nMedicines\nIvacaftor, lumacaftor and tezacaftor\nIn 2012 ivacaftor was designated as an orphan drug, identifying cystic fibrosis as affecting fewer than 200,000 people in the United States. On 31 January 2012, Vertex gained FDA approval of the first drug, Kalydeco, to treat the underlying cause of cystic fibrosis rather than the symptoms, in patients 6 years or older who have the G551D gene mutation. \nIn the US, 30,000 people have cystic fibrosis. About 4% of those, or 1,200, have the G551D gene mutation. In 2017 Vertex marketed the drug for $311,000 per person per year.\nVertex also studied ivacaftor in combination with another drug (lumacaftor) for the most common mutation in cystic fibrosis (CF), known as F508del, and published the first set of results in 2012. Vertex produced the drug after 13 years of research and development, with $70 million in support from the Cystic Fibrosis Foundation.\nIn the UK, the company provided the drug free for a limited time for certain patients. Subsequently, the hospitals decided to continue to pay for the drug for those patients. UK agencies estimated the cost per quality adjusted life year (QALY) at between £335,000 and £1,274,000—far above the NICE thresholds of £20,000-£30,000.\nOn 5 November 2014 Vertex announced the submission of a New Drug Application (NDA) to the FDA for a fully co-formulated combination of lumacaftor and ivacaftor for people with cystic fibrosis ages 12 and older who have two copies of the F508del mutation in the cystic fibrosis transmembrane conductance regulator (CFTR) gene. In 2015, FDA approved the combination of lumacaftor and ivacaftor to treat CF in patients 12 years and older, who have the F508del mutation. The combination drug is marketed under the tradename Orkambi.\nOn 28 March 2017, Vertex announced Phase 3 data from a dual combination treatment, tezacaftor plus ivacaftor, in patients with cystic fibrosis. On 12 February 2018, the FDA approved the combination, marketed as Symdeko.\n\nTriple combination treatments\nIn 2016, Vertex began developing a new group of CFTR modulators in combination with tezacaftor and ivacaftor. In 2017, the company reported results that showed benefits for patients with different mutations that represent 90% of the CF population.\nOn 22 October 2019, two months after a new drug application was filed with it, the FDA approved Vertex's Triple-combo therapy Trikafta (elexacaftor/tezacaftor/ivacaftor) for patients 12 and older with at least one F508del mutation. The FDA approval covers approximately 90% of patients with cystic fibrosis.\nVertex has refused to make Trikafta available in developing countries and works to block generic alternatives, making it inaccessible for thousands of patients.\n\nGenetic therapies\nIn 2015, Vertex entered into a research collaboration with CRISPR Therapeutics to develop gene-editing therapies for genetic diseases. In May 2020, CTX001 has received Orphan Drug Designation from the U.S. Food and Drug Administration for transfusion-dependent beta thalassemia and from the European Medicines Agency for sickle cell disease and transfusion-dependent beta thalassemia.\nIn 2016, the company entered into a collaboration with Moderna to develop new mRNA-based therapeutics to treat CF; Vertex paid Moderna $20 million in cash and provided an additional $20 million in cash in exchange for a convertible note that Vertex can cash in for stock.  Vertex also promised to pay up to $275 million in milestone payments.\nIn 2019, Vertex established a research collaboration with a privately held company Arbor Biotechnologies to discover novel proteins to advance the development of new gene-editing therapies for cystic fibrosis and four other diseases. With seven different areas of focus in the deal, Vertex is paying  up to $1.2 billion in milestones along with undisclosed up-front payments.\nVertex's product pipeline includes drug regimens targeting specialty diseases like sickle cell disease, beta thalassemia, Duchenne muscular dystrophy, alpha-1 antitrypsin deficiency, pain, and APOL1-mediated kidney diseases.\n\nPain management\nIn January 2025, Vertex became the first drugmaker in 25 years to gain U.S. approval for a new type of pain medicine when the FDA approved Journavx (suzetrigine), a novel non-opioid treatment for moderate to severe acute pain. Journavx was evaluated via two randomized, double-blind, placebo- and active-controlled trials of acute surgical pain.\n\nHistorical\nTelaprevir\nIn 2014, Vertex discontinued telaprevir. In May 2011, the Food and Drug Administration (FDA) had approved the drug telaprevir (Incivek) as an oral treatment for hepatitis C. Development and commercialization of telaprevir was shared with Johnson & Johnson for European distribution and Mitsubishi for Asia. Telaprevir is a protease inhibitor.\n\nCEO compensation\nIn 2015, several media outlets reported CEO Jeffrey Leiden's 2014 compensation to be approximately US$48.5 million. Vertex shareholders opted for a reduction in CEO compensation in 2015 and 2016, resulting in 2016 earnings of US$17.4 million. In August 2025, Reshma Kewalramani, CEO of Vertex, reportedly bought a large portion of the company's stock.\n\nPricing in the UK\nThe initial pricing of Orkambi at US$135,000 to US$270,000 per patient per year, depending on the patient's country, led to campaigns by  parent groups concerned that it limited access to the drug for children and young adults with cystic fibrosis, and also led to allegations of unfair pricing by the UK's National Health Service.\nIn March 2019, Vertex was legally required to destroy 7,880 packs of Orkambi that reached their expiry dates during price negotiations with the NHS.\nOn October 24, 2019, NHS England agreed to fund wider access to all of the pharmaceutical company's cystic fibrosis medications that were already licensed at that time, such as Orkambi, Symkevi and Kalydeco, and any future indications of these medicines. The funding agreement was finalized soon after Vertex signed reimbursement deals elsewhere, including NHS Scotland, Spain and Australia.  Vertex agreed to offer equivalent pricing to the NHS in Wales and Northern Ireland . On June 30, 2020, Vertex and NHS expanded the agreement to include reimbursement of Kaftrio (the name used for marketing Trikafta in the UK), making England one of the first countries in Europe to fund it.\nIn October 2023, NICE declined to recommend Vertex's cystic fibrosis drugs Kaftrio, Symkevi, and Orkambi for use in CF patients, citing their high costs as beyond the acceptable range for NHS resources. However, in June 2024, NICE and Vertex reached an agreement on acceptable pricing terms, extending the pricing deal originally established in 2019 to include these drugs. The extended agreement also ensures that patients will have access to future license extensions for these CF medications.\n\nGlobal pricing\nPricing and public funding varies by country beyond the USA and the UK.\nBy October 2019,  Vertex's CF medicines were publicly funded in 17 countries. \nBy 2023, Vertex had reimbursement agreements in 36 countries for their CF medicines, of which 35 are considered high-income countries. About 27% (51,322) of the estimated CF patients were treated with Trikafta, of whom nearly half (49%) lived in the U.S., 42% in Europe, and 9% in Canada, Israel, Australia, and New Zealand combined. \nTrikafta has become increasingly available worldwide since its initial approval in 2019. As of 2023, the medication is reimbursed in over 30 countries, primarily in high-income nations across North America, Europe, and Oceania. By 2024, the company's group of CF medications were \"broadly available\" in over 60 countries. Although access to Cystic Fibrosis medications is still limited in many countries, as of 2024 about two-thirds of people diagnosed are receiving the treatment around the world. The high cost of Trikafta presents a significant barrier to access. In countries where it is reimbursed, patients typically pay a fraction of this cost, but the financial burden on healthcare systems remains substantial. Price negotiations and managed entry agreements (which for example link reimbursement to clinical performance) are common strategies used by countries to make Trikafta more affordable, though the details of these arrangements are often confidential.\n\nAs of 2024, a large proportion of diagnosed patients in South America, Asia, and Africa had no subsidies for Trikafta, and until 2024, the therapy was inaccessible in Mexico and Cuba. As of April 2024, Trikafta was made available in South Africa via agreements between Vertex and several commercial insurers to make the medication available to individual patients.  As of September 2024, Mexico's Cofepris authorized Trikafta as the first orphan drug for the care of cystic fibrosis patients.\n\nVenture philanthropy\nIn the late 1990s the Bethesda-based Cystic Fibrosis Foundation, encouraged by then-President Robert Beall, began investing in Vertex— when it was a small start-up biotechnology company— to help fund the development of Kalydeco in the form of venture philanthropy. The total investment amounted to $150 million. In 2014, the CF Foundation sold the rights to the royalties of the drugs for $3.3 billion, twenty times the foundation's 2013 budget. Proponents of venture philanthropy say the high financial return helps speed drug development and also provides potential monetary rewards that can go to more research.\nBy 2015 the annual price of Kalydeco had been increased to more than $300,000 per patient.\nAccording to an article published in the Milwaukee Journal Sentinel Vertex executives \"grossed more than $100 million by cashing in stocks and stock options\" and at \"one point, the value of company's stock increased more $6 billion in a single day.\"\nTwenty-nine physicians and scientists working with people with cystic fibrosis (CF) wrote to Jeff Leiden, CEO of Vertex Pharmaceuticals to plead for lower prices.\n\nWe are aware of the financial complexities of the huge expenses for R & D with respect to the small number of patients or the market system that enables these advances to become reality. Yet – notwithstanding all your patient support programs – it is at best unseemly for Vertex to charge our patients' insurance plans (including strapped state medical assistance plans), $294,000 annually for two pills a day (a 10-fold increase in a typical patient's total drug costs). This action could appear to be leveraging pain and suffering into huge financial gain for speculators, some of whom were your top executives who reportedly made millions of dollars in a single day (Boston Globe, 29 May).\nThe company responded in an email that \"while publicly funded academic research provided important early understanding of the cause of cystic fibrosis, it took Vertex scientists 14 years of their own research, funded mostly by the company, before the drug won approval.\"\nOn 15 April 2015 in Cambridge, Massachusetts, Joan Finnegan Brooks of the Cystic Fibrosis Foundation spoke about the role of Vertex and venture philanthropy to a panel of biotech leaders hosted by Life Sciences Foundation on the topic of patient advocacy in the biotech industry. While Brooks, who has cystic fibrosis, expressed gratitude for Vertex's development of Kalydeco, she observed that \"More than 25% of people are saying (in surveys conducted by the CFF) that they are skipping medications or delaying medications or skipping doctor appointments because of cost of care issues.\" She added that \"one of the things that the Foundation has done,\" is to \"develop resources that can help patients bridge that gap through patient access programs, and so forth.\"\n\nSee also\nCystic Fibrosis Foundation\nTelaprevir\n\nReferences\nAnnual Report. Vertex Pharmaceuticals. 15 March 2004. Archived from the original on 3 March 2016. Retrieved 24 June 2012.\n\"Vertex Completes New Drug Application for Telaprevir for Hepatitis C\" (Press release). Vertex Pharmaceuticals. 23 November 2010. Retrieved 24 June 2012.\n\nExternal links\nOfficial website \nBusiness data for Vertex Pharmaceuticals:",
  "clean_text": "Vertex Pharmaceuticals Incorporated is an American biopharmaceutical company based in Boston, Massachusetts. It was one of the first biotech firms to use an explicit strategy of rational drug design rather than combinatorial chemistry. It maintains headquarters in Boston, Massachusetts, and three research facilities, in San Diego, California, and Milton Park, Oxfordshire, England. History Vertex was founded in 1989 by Joshua Boger and Kevin J. Kinsella to \"transform the way serious diseases are treated.\" The company's beginnings were profiled by Barry Werth in the 1994 book The Billion-Dollar Molecule. His 2014 book, The Antidote: Inside the World of New Pharma, chronicled the company's subsequent development over the next two decades. By 2004, its product pipeline focused on viral infections, inflammatory and autoimmune disorders, and cancer. In 2009, the company had about 1,800 employees, including 1,200 in the Boston area. By 2019 there were about 2,500 employees. Since late 2011, Vertex has ranked among the top 15 best-performing companies on the Standard & Poor's 500. Vertex shares increased 250 percent in the same period. In January 2014, Vertex completed its move from Cambridge, Massachusetts, to Boston, Massachusetts, and took residence in a new, $800 million complex. Located on the South Boston waterfront, it marked the first time in the company's history that all of the roughly 1,200 Vertex employees in the Greater Boston area worked together. On 23 January 2019, Ian Smith, the COO and interim CFO of Vertex, was terminated from his position for undisclosed personal behavior that violated established company code of conduct rules. In June of the same year, Vertex announced it would acquire Exonics Therapeutics for up to $1 billion and collaborate with CRISPR Therapeutics, boosting its development of treatments for Duchenne muscular dystrophy and myotonic dystrophy type 1. In September 2019 the company announced it would acquire Semma Therapeutics for $950 million in cash. Semma Therapeutics created a \"small, implantable device that holds millions of replacement beta cells, letting glucose and insulin through but keeping immune cells out.\" On 1 April 2020, Reshma Kewalramani, then the chief medical officer, became president and chief executive officer of Vertex Pharmaceuticals. Former CEO and president Jeffrey Leiden transitioned to the role of executive chairman of the board of directors, as of 1 April 2020. Leiden was to serve as executive chairman until April 2023, although as of September 2024 he remained in that post. In July 2022, the business announced it would acquire ViaCyte, Inc. for $320 million. In April 2024, it was announced Vertex had agreed to acquire the Seattle-headquartered clinical stage biopharmaceutical company Alpine Immune Sciences for $4.9 billion. Medicines Ivacaftor, lumacaftor and tezacaftor In 2012 ivacaftor was designated as an orphan drug, identifying cystic fibrosis as affecting fewer than 200,000 people in the United States. On 31 January 2012, Vertex gained FDA approval of the first drug, Kalydeco, to treat the underlying cause of cystic fibrosis rather than the symptoms, in patients 6 years or older who have the G551D gene mutation. In the US, 30,000 people have cystic fibrosis. About 4% of those, or 1,200, have the G551D gene mutation. In 2017 Vertex marketed the drug for $311,000 per person per year. Vertex also studied ivacaftor in combination with another drug (lumacaftor) for the most common mutation in cystic fibrosis (CF), known as F508del, and published the first set of results in 2012. Vertex produced the drug after 13 years of research and development, with $70 million in support from the Cystic Fibrosis Foundation. In the UK, the company provided the drug free for a limited time for certain patients. Subsequently, the hospitals decided to continue to pay for the drug for those patients. UK agencies estimated the cost per quality adjusted life year (QALY) at between £335,000 and £1,274,000—far above the NICE thresholds of £20,000-£30,000. On 5 November 2014 Vertex announced the submission of a New Drug Application (NDA) to the FDA for a fully co-formulated combination of lumacaftor and ivacaftor for people with cystic fibrosis ages 12 and older who have two copies of the F508del mutation in the cystic fibrosis transmembrane conductance regulator (CFTR) gene. In 2015, FDA approved the combination of lumacaftor and ivacaftor to treat CF in patients 12 years and older, who have the F508del mutation. The combination drug is marketed under the tradename Orkambi. On 28 March 2017, Vertex announced Phase 3 data from a dual combination treatment, tezacaftor plus ivacaftor, in patients with cystic fibrosis. On 12 February 2018, the FDA approved the combination, marketed as Symdeko. Triple combination treatments In 2016, Vertex began developing a new group of CFTR modulators in combination with tezacaftor and ivacaftor. In 2017, the company reported results that showed benefits for patients with different mutations that represent 90% of the CF population. On 22 October 2019, two months after a new drug application was filed with it, the FDA approved Vertex's Triple-combo therapy Trikafta (elexacaftor/tezacaftor/ivacaftor) for patients 12 and older with at least one F508del mutation. The FDA approval covers approximately 90% of patients with cystic fibrosis. Vertex has refused to make Trikafta available in developing countries and works to block generic alternatives, making it inaccessible for thousands of patients. Genetic therapies In 2015, Vertex entered into a research collaboration with CRISPR Therapeutics to develop gene-editing therapies for genetic diseases. In May 2020, CTX001 has received Orphan Drug Designation from the U.S. Food and Drug Administration for transfusion-dependent beta thalassemia and from the European Medicines Agency for sickle cell disease and transfusion-dependent beta thalassemia. In 2016, the company entered into a collaboration with Moderna to develop new mRNA-based therapeutics to treat CF; Vertex paid Moderna $20 million in cash and provided an additional $20 million in cash in exchange for a convertible note that Vertex can cash in for stock. Vertex also promised to pay up to $275 million in milestone payments. In 2019, Vertex established a research collaboration with a privately held company Arbor Biotechnologies to discover novel proteins to advance the development of new gene-editing therapies for cystic fibrosis and four other diseases. With seven different areas of focus in the deal, Vertex is paying up to $1.2 billion in milestones along with undisclosed up-front payments. Vertex's product pipeline includes drug regimens targeting specialty diseases like sickle cell disease, beta thalassemia, Duchenne muscular dystrophy, alpha-1 antitrypsin deficiency, pain, and APOL1-mediated kidney diseases. Pain management In January 2025, Vertex became the first drugmaker in 25 years to gain U.S. approval for a new type of pain medicine when the FDA approved Journavx (suzetrigine), a novel non-opioid treatment for moderate to severe acute pain. Journavx was evaluated via two randomized, double-blind, placebo- and active-controlled trials of acute surgical pain. Historical Telaprevir In 2014, Vertex discontinued telaprevir. In May 2011, the Food and Drug Administration (FDA) had approved the drug telaprevir (Incivek) as an oral treatment for hepatitis C. Development and commercialization of telaprevir was shared with Johnson & Johnson for European distribution and Mitsubishi for Asia. Telaprevir is a protease inhibitor. CEO compensation In 2015, several media outlets reported CEO Jeffrey Leiden's 2014 compensation to be approximately US$48.5 million. Vertex shareholders opted for a reduction in CEO compensation in 2015 and 2016, resulting in 2016 earnings of US$17.4 million. In August 2025, Reshma Kewalramani, CEO of Vertex, reportedly bought a large portion of the company's stock. Pricing in the UK The initial pricing of Orkambi at US$135,000 to US$270,000 per patient per year, depending on the patient's country, led to campaigns by parent groups concerned that it limited access to the drug for children and young adults with cystic fibrosis, and also led to allegations of unfair pricing by the UK's National Health Service. In March 2019, Vertex was legally required to destroy 7,880 packs of Orkambi that reached their expiry dates during price negotiations with the NHS. On October 24, 2019, NHS England agreed to fund wider access to all of the pharmaceutical company's cystic fibrosis medications that were already licensed at that time, such as Orkambi, Symkevi and Kalydeco, and any future indications of these medicines. The funding agreement was finalized soon after Vertex signed reimbursement deals elsewhere, including NHS Scotland, Spain and Australia. Vertex agreed to offer equivalent pricing to the NHS in Wales and Northern Ireland . On June 30, 2020, Vertex and NHS expanded the agreement to include reimbursement of Kaftrio (the name used for marketing Trikafta in the UK), making England one of the first countries in Europe to fund it. In October 2023, NICE declined to recommend Vertex's cystic fibrosis drugs Kaftrio, Symkevi, and Orkambi for use in CF patients, citing their high costs as beyond the acceptable range for NHS resources. However, in June 2024, NICE and Vertex reached an agreement on acceptable pricing terms, extending the pricing deal originally established in 2019 to include these drugs. The extended agreement also ensures that patients will have access to future license extensions for these CF medications. Global pricing Pricing and public funding varies by country beyond the USA and the UK. By October 2019, Vertex's CF medicines were publicly funded in 17 countries. By 2023, Vertex had reimbursement agreements in 36 countries for their CF medicines, of which 35 are considered high-income countries. About 27% (51,322) of the estimated CF patients were treated with Trikafta, of whom nearly half (49%) lived in the U.S., 42% in Europe, and 9% in Canada, Israel, Australia, and New Zealand combined. Trikafta has become increasingly available worldwide since its initial approval in 2019. As of 2023, the medication is reimbursed in over 30 countries, primarily in high-income nations across North America, Europe, and Oceania. By 2024, the company's group of CF medications were \"broadly available\" in over 60 countries. Although access to Cystic Fibrosis medications is still limited in many countries, as of 2024 about two-thirds of people diagnosed are receiving the treatment around the world. The high cost of Trikafta presents a significant barrier to access. In countries where it is reimbursed, patients typically pay a fraction of this cost, but the financial burden on healthcare systems remains substantial. Price negotiations and managed entry agreements (which for example link reimbursement to clinical performance) are common strategies used by countries to make Trikafta more affordable, though the details of these arrangements are often confidential. As of 2024, a large proportion of diagnosed patients in South America, Asia, and Africa had no subsidies for Trikafta, and until 2024, the therapy was inaccessible in Mexico and Cuba. As of April 2024, Trikafta was made available in South Africa via agreements between Vertex and several commercial insurers to make the medication available to individual patients. As of September 2024, Mexico's Cofepris authorized Trikafta as the first orphan drug for the care of cystic fibrosis patients. Venture philanthropy In the late 1990s the Bethesda-based Cystic Fibrosis Foundation, encouraged by then-President Robert Beall, began investing in Vertex— when it was a small start-up biotechnology company— to help fund the development of Kalydeco in the form of venture philanthropy. The total investment amounted to $150 million. In 2014, the CF Foundation sold the rights to the royalties of the drugs for $3.3 billion, twenty times the foundation's 2013 budget. Proponents of venture philanthropy say the high financial return helps speed drug development and also provides potential monetary rewards that can go to more research. By 2015 the annual price of Kalydeco had been increased to more than $300,000 per patient. According to an article published in the Milwaukee Journal Sentinel Vertex executives \"grossed more than $100 million by cashing in stocks and stock options\" and at \"one point, the value of company's stock increased more $6 billion in a single day.\" Twenty-nine physicians and scientists working with people with cystic fibrosis (CF) wrote to Jeff Leiden, CEO of Vertex Pharmaceuticals to plead for lower prices. We are aware of the financial complexities of the huge expenses for R & D with respect to the small number of patients or the market system that enables these advances to become reality. Yet – notwithstanding all your patient support programs – it is at best unseemly for Vertex to charge our patients' insurance plans (including strapped state medical assistance plans), $294,000 annually for two pills a day (a 10-fold increase in a typical patient's total drug costs). This action could appear to be leveraging pain and suffering into huge financial gain for speculators, some of whom were your top executives who reportedly made millions of dollars in a single day (Boston Globe, 29 May). The company responded in an email that \"while publicly funded academic research provided important early understanding of the cause of cystic fibrosis, it took Vertex scientists 14 years of their own research, funded mostly by the company, before the drug won approval.\" On 15 April 2015 in Cambridge, Massachusetts, Joan Finnegan Brooks of the Cystic Fibrosis Foundation spoke about the role of Vertex and venture philanthropy to a panel of biotech leaders hosted by Life Sciences Foundation on the topic of patient advocacy in the biotech industry. While Brooks, who has cystic fibrosis, expressed gratitude for Vertex's development of Kalydeco, she observed that \"More than 25% of people are saying (in surveys conducted by the CFF) that they are skipping medications or delaying medications or skipping doctor appointments because of cost of care issues.\" She added that \"one of the things that the Foundation has done,\" is to \"develop resources that can help patients bridge that gap through patient access programs, and so forth.\""
}