{
  "ticker": "VST",
  "cik": "0001692819",
  "company_name": "Vistra Corp.",
  "corrected_name": "Vistra Corp.",
  "wiki_title_used": "Vistra Corp.",
  "exists": true,
  "raw_text": "Vistra Corp. is an integrated retail electricity and power generation company based in Irving, Texas. The company is the largest competitive power generator in the U.S. with a capacity of approximately 39GW powered by a diverse portfolio, including natural gas, coal, nuclear, solar, and battery energy storage facilities.\nIn the 2020 Forbes Global 2000, Vistra Energy was ranked as the 756th-largest public company in the world. The company owns the Moss Landing Power Plant in California which as of 2021 contained the largest battery energy storage system in the world (400-MW/1,600-MWh), but was significantly damaged in a fire in January 2025. As of 2020, the company was ranked as the highest CO2 emitter in the US. In 2024, it is ranked first as the No. 1 polluter in the United States for the 2024 Greenhouse 100 Polluters Index Report, producing 1.5% of all greenhouse gas emissions generated in the United States of America, according to the Political Economy Research Institute (PERI) at the University of Massachusetts, Amherst.\n\nHistory\nIn 2016, Texas Competitive Electric Holdings (TCEH) parent company of TXU Energy and Luminant, emerged from Chapter 11 (as part of the bankruptcy protection for Energy Future Holdings Corporation). TCEH was then rebranded as Vistra Energy.\nVistra acquired Dynegy in 2018. In 2019, Ambit Energy was acquired, resulting in a 32% residential market share in Electric Reliability Council of Texas (ERCOT), with NRG Energy as its largest competitor. It also acquired Crius Energy in 2019.\nIn May 2025, Vistra announced they were set to buy seven natural gas power plants for US$1.9 billion from Lotus Infrastructure Partners.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Vistra Corp.:",
  "clean_text": "Vistra Corp. is an integrated retail electricity and power generation company based in Irving, Texas. The company is the largest competitive power generator in the U.S. with a capacity of approximately 39GW powered by a diverse portfolio, including natural gas, coal, nuclear, solar, and battery energy storage facilities. In the 2020 Forbes Global 2000, Vistra Energy was ranked as the 756th-largest public company in the world. The company owns the Moss Landing Power Plant in California which as of 2021 contained the largest battery energy storage system in the world (400-MW/1,600-MWh), but was significantly damaged in a fire in January 2025. As of 2020, the company was ranked as the highest CO2 emitter in the US. In 2024, it is ranked first as the No. 1 polluter in the United States for the 2024 Greenhouse 100 Polluters Index Report, producing 1.5% of all greenhouse gas emissions generated in the United States of America, according to the Political Economy Research Institute (PERI) at the University of Massachusetts, Amherst. History In 2016, Texas Competitive Electric Holdings (TCEH) parent company of TXU Energy and Luminant, emerged from Chapter 11 (as part of the bankruptcy protection for Energy Future Holdings Corporation). TCEH was then rebranded as Vistra Energy. Vistra acquired Dynegy in 2018. In 2019, Ambit Energy was acquired, resulting in a 32% residential market share in Electric Reliability Council of Texas (ERCOT), with NRG Energy as its largest competitor. It also acquired Crius Energy in 2019. In May 2025, Vistra announced they were set to buy seven natural gas power plants for US$1.9 billion from Lotus Infrastructure Partners."
}