{
  "ticker": "VTRS",
  "cik": "0001792044",
  "company_name": "Viatris",
  "corrected_name": "Viatris",
  "wiki_title_used": "Viatris",
  "exists": true,
  "raw_text": "Viatris Inc. is an American global pharmaceutical and healthcare corporation headquartered in Canonsburg, Pennsylvania. The corporation was formed through the merger of Mylan and Upjohn, a legacy division of Pfizer, on November 16, 2020.\nThe name of the corporation comes from the Latin words via, meaning path, and tris, which means three, referring to the path to three main objectives the corporation set: expanding access to medicines, meeting patient needs through innovation, and earning the trust of the healthcare community.\nViatris ranked 254th on the 2021 Fortune 500 rankings of the largest United States corporations based on its 2020 total revenue.\n\nHistory\nOn November 16, 2020, Upjohn merged with Mylan in a Reverse Morris Trust transaction and changed its name to Viatris. At that time, Michael Goettler became chief executive officer.\nFollowing the combination, the company began trading on the NASDAQ using the ticker symbol VTRS.\nIn December 2020, the company announced a cost-reducing restructuring plan that would impact up to 20% of its global workforce, or 9,000 jobs at its facilities around the world.\nIn 2021, Viatris was ranked 5th by Fortune on its annual \"Change the World\" list for having \"transformed the treatment of HIV around the world in the [previous] five years through the first low-cost antiretroviral drug for first-line treatment of HIV and a children's version in the form of fruit-flavored tablets that dissolve in liquid.\nIn February 2022, Viatris announced an agreement where it will contribute to Biocon Biologics its biosimilars portfolio and related commercial and operational capabilities in exchange for up to $3.335 billion, including a stake of at least 12.9% in Biocon Biologics. The transaction was completed in November 2022.\nIn November 2022, the business agreed to acquire Oyster Point Pharma and Famy Life Sciences for an aggregate of $700–750 million to create an ophthalmology division. The acquisitions closed in January 2023.\nIn 2022 and 2024, Viatris was recognized by Forbes as one of the world's best employers and by Newsweek as one of America's most responsible companies.\nOn April 1, 2023, Scott A. Smith became Viatris' CEO, succeeding Michael Goettler. Smith previously served on the company's board since 2022. \nIn April 2023, Viatris was recognized by LinkedIn as one of the 25 best companies to work for in India, and one of the 25 best companies offering career development in Ireland.\nIn May 2023, USA Today included Viatris in its list of 400 US companies that have reduced their greenhouse gas emissions intensity from 2019 to 2021. \nIn June 2023, Viatris was named to the Forbes Global 2000 list of the world's largest companies.\nIn October 2023, Viatris reached agreements to divest from almost all of its OTC business, its women’s healthcare business, and its India-based active pharmaceutical ingredients business for a total of about $3.6 billion.\nIn late December 2024, Viatris disclosed that the U.S. FDA had issued a warning letter and an import alert concerning the company's drug-making facility in Indore, India. The import alert affects 11 actively distributed products, which will no longer be accepted into the U.S. until the warning letter is lifted, while four products were conditionally exempted due to shortages. The violations cited by the FDA included subpar quality control and improper management of manufacturing defect. In response, the company announced that it has taken corrective and preventative actions.\n\nPredecessors\nThe following is an illustration of the company's major mergers and acquisitions and historical predecessors:\n\nProducts\nThe company produces and sells a variety of medicines, with 1,400 approved therapeutic molecules in its portfolio. It owns brands (like Viagra, Xanax, Lipitor), generics, including branded and complex generics, biosimilars, and over-the-counter (OTC) drugs and active pharmaceutical ingredients. Viatris products cover therapeutic areas including cardiovascular, infectious disease, oncology, immunology, CNS and anesthesia, women's healthcare, diabetes and metabolism, gastroenterology, respiratory and allergy, and dermatology.\nThe following products have been newly launched or received regulatory approvals since Viatris was established include:\n\nDolutegravir: In December 2020, received FDA approval to treat children with HIV/AIDS in low to middle income countries. The formulation is strawberry-flavored to make it easier to give to children and was made available at a 75% discount compared to previous treatments.\nBreyna (budesonide and formoterol fumarate dihydrate inhalation aerosol): In March 2022, received approval from the US FDA in March 2022 as the first generic version of Symbicort for the treatment of asthma and COPD.\nGA Depot (long-acting version of glatiramer acetate): In August 2023, received New Drug Application acceptance from the US FDA as a once-monthly injection for the treatment of relapsing forms of multiple sclerosis.\nAbacavir/dolutegravir/lamivudine: In September 2023, received tentative US FDA approval for a New Drug Application through the President's Emergency Plan for AIDS Relief (PEPFAR)  for the treatment of HIV-1 infection in pediatric patients.\nRyzumvi (phentolamine ophthalmic solution 0.75%): In September 2023, received FDA approval for the treatment of mydriasis caused by adrenergic agonist or parasympatholytic agents or a combination of those drugs. It was previously known as Nyxol.\n\nPartnerships\nFollowing the formation of Viatris, the company became a member of the Biosimilars Forum, a trade organization that advocates for greater biosimilar usage.\nViatris partnered with the American College of Cardiology, the NCD Alliance, and the World Heart Federation to create the NCD Academy, a platform to help fight non-communicable diseases around the world.\nIn December 2020, the company worked with Sesame Workshop to create resources to help children and their caregivers manage their social and emotional needs impacted by the COVID-19 pandemic.\nIn April 2021, the company partnered with Atomo Diagnostics and Unitaid to expand access to HIV self-testing to 135 countries and lower the price of the tests by around 50%.\nIn February 2024, Viatris entered into an agreement with Idorsia to collaborate on global research and development and the commercialization rights to Phase 3 pharmaceuticals selatogrel, a cardiac medication, and cenerimod, a novel immunology medication used to treat systemic lupus erythematosus. The agreement includes the potential to add more assets in the future.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Viatris Inc.:",
  "clean_text": "Viatris Inc. is an American global pharmaceutical and healthcare corporation headquartered in Canonsburg, Pennsylvania. The corporation was formed through the merger of Mylan and Upjohn, a legacy division of Pfizer, on November 16, 2020. The name of the corporation comes from the Latin words via, meaning path, and tris, which means three, referring to the path to three main objectives the corporation set: expanding access to medicines, meeting patient needs through innovation, and earning the trust of the healthcare community. Viatris ranked 254th on the 2021 Fortune 500 rankings of the largest United States corporations based on its 2020 total revenue. History On November 16, 2020, Upjohn merged with Mylan in a Reverse Morris Trust transaction and changed its name to Viatris. At that time, Michael Goettler became chief executive officer. Following the combination, the company began trading on the NASDAQ using the ticker symbol VTRS. In December 2020, the company announced a cost-reducing restructuring plan that would impact up to 20% of its global workforce, or 9,000 jobs at its facilities around the world. In 2021, Viatris was ranked 5th by Fortune on its annual \"Change the World\" list for having \"transformed the treatment of HIV around the world in the [previous] five years through the first low-cost antiretroviral drug for first-line treatment of HIV and a children's version in the form of fruit-flavored tablets that dissolve in liquid. In February 2022, Viatris announced an agreement where it will contribute to Biocon Biologics its biosimilars portfolio and related commercial and operational capabilities in exchange for up to $3.335 billion, including a stake of at least 12.9% in Biocon Biologics. The transaction was completed in November 2022. In November 2022, the business agreed to acquire Oyster Point Pharma and Famy Life Sciences for an aggregate of $700–750 million to create an ophthalmology division. The acquisitions closed in January 2023. In 2022 and 2024, Viatris was recognized by Forbes as one of the world's best employers and by Newsweek as one of America's most responsible companies. On April 1, 2023, Scott A. Smith became Viatris' CEO, succeeding Michael Goettler. Smith previously served on the company's board since 2022. In April 2023, Viatris was recognized by LinkedIn as one of the 25 best companies to work for in India, and one of the 25 best companies offering career development in Ireland. In May 2023, USA Today included Viatris in its list of 400 US companies that have reduced their greenhouse gas emissions intensity from 2019 to 2021. In June 2023, Viatris was named to the Forbes Global 2000 list of the world's largest companies. In October 2023, Viatris reached agreements to divest from almost all of its OTC business, its women’s healthcare business, and its India-based active pharmaceutical ingredients business for a total of about $3.6 billion. In late December 2024, Viatris disclosed that the U.S. FDA had issued a warning letter and an import alert concerning the company's drug-making facility in Indore, India. The import alert affects 11 actively distributed products, which will no longer be accepted into the U.S. until the warning letter is lifted, while four products were conditionally exempted due to shortages. The violations cited by the FDA included subpar quality control and improper management of manufacturing defect. In response, the company announced that it has taken corrective and preventative actions. Predecessors The following is an illustration of the company's major mergers and acquisitions and historical predecessors: Products The company produces and sells a variety of medicines, with 1,400 approved therapeutic molecules in its portfolio. It owns brands (like Viagra, Xanax, Lipitor), generics, including branded and complex generics, biosimilars, and over-the-counter (OTC) drugs and active pharmaceutical ingredients. Viatris products cover therapeutic areas including cardiovascular, infectious disease, oncology, immunology, CNS and anesthesia, women's healthcare, diabetes and metabolism, gastroenterology, respiratory and allergy, and dermatology. The following products have been newly launched or received regulatory approvals since Viatris was established include: Dolutegravir: In December 2020, received FDA approval to treat children with HIV/AIDS in low to middle income countries. The formulation is strawberry-flavored to make it easier to give to children and was made available at a 75% discount compared to previous treatments. Breyna (budesonide and formoterol fumarate dihydrate inhalation aerosol): In March 2022, received approval from the US FDA in March 2022 as the first generic version of Symbicort for the treatment of asthma and COPD. GA Depot (long-acting version of glatiramer acetate): In August 2023, received New Drug Application acceptance from the US FDA as a once-monthly injection for the treatment of relapsing forms of multiple sclerosis. Abacavir/dolutegravir/lamivudine: In September 2023, received tentative US FDA approval for a New Drug Application through the President's Emergency Plan for AIDS Relief (PEPFAR) for the treatment of HIV-1 infection in pediatric patients. Ryzumvi (phentolamine ophthalmic solution 0.75%): In September 2023, received FDA approval for the treatment of mydriasis caused by adrenergic agonist or parasympatholytic agents or a combination of those drugs. It was previously known as Nyxol. Partnerships Following the formation of Viatris, the company became a member of the Biosimilars Forum, a trade organization that advocates for greater biosimilar usage. Viatris partnered with the American College of Cardiology, the NCD Alliance, and the World Heart Federation to create the NCD Academy, a platform to help fight non-communicable diseases around the world. In December 2020, the company worked with Sesame Workshop to create resources to help children and their caregivers manage their social and emotional needs impacted by the COVID-19 pandemic. In April 2021, the company partnered with Atomo Diagnostics and Unitaid to expand access to HIV self-testing to 135 countries and lower the price of the tests by around 50%. In February 2024, Viatris entered into an agreement with Idorsia to collaborate on global research and development and the commercialization rights to Phase 3 pharmaceuticals selatogrel, a cardiac medication, and cenerimod, a novel immunology medication used to treat systemic lupus erythematosus. The agreement includes the potential to add more assets in the future."
}