{
  "ticker": "WAB",
  "cik": "0000943452",
  "company_name": "Wabtec",
  "corrected_name": "Wabtec",
  "wiki_title_used": "Wabtec",
  "exists": true,
  "raw_text": "Westinghouse Air Brake Technologies Corporation, commonly known as Wabtec, is an American company formed by the merger of the Westinghouse Air Brake Company (WABCO) and MotivePower in 1999.  It is headquartered in Pittsburgh, Pennsylvania.\nWabtec manufactures products for locomotives, freight cars and passenger transit vehicles, and builds new locomotives up to 6,000 horsepower (4 MW). It is a Fortune 500 company.\nThe company purchased GE Transportation on February 25, 2019.\n\nHistory\nThe company's origins go back to 1869 with the founding of the Westinghouse Air Brake Company. That company (known as WA&B and later also as WABCO) became independent in 1990 via a management buy-out, and went public in 1995. (Another company, WABCO Vehicle Control Systems, also created from the Westinghouse Brake Company, is independent of Wabtec. It was spun off by American Standard Companies in 2007, and is today part of German automotive components firm ZF Friedrichshafen.)\nThe other company forming Wabtec, MotivePower, can be traced back to 1972, with the formation of the MK Rail division by Morrison Knudsen and the purchase of a manufacturing facility in Boise. In 1994 Morrison Knudsen created a subsidiary MK Rail Corporation; during the first half of the same decade the MK Rail group expanded with the acquisition of various other locomotive component companies. In 1996, MK Rail group separated from the parent Morrison Knudsen and adopted the name MotivePower Industries Corporation. In the later half of the 1990s additional companies were acquired – again all in the locomotive components business. MotivePower, a wholly owned subsidiary of Wabtec, continues to manufacture locomotives.\nThe corporate logo is said to represent an axial view of a mechanical brake valve, where different air ports line up between the 'stator' and 'rotor' depending upon the handle position.\nOn June 10, 2023, United Electrical, Radio and Machine Workers of America workers at Wabtec's Erie, Pennsylvania, plant went on strike. Issues included pay, healthcare benefits, paid time off, prohibitions on grievance strikes, and the number of tier-4 emission rules compliant locomotives built at the Erie plant. The strike ended on August 31 with an agreement that raised the pay of workers.\n\nMergers and acquisitions\nIn March 2010, Wabtec announced that it had purchased Xorail, a railway signaling design and construction company for $40 million. In July 2010, Wabtec announced the plan to purchase two manufacturers of rail equipment, G&B Specialties and Bach-Simpson Corp. The companies produce track products and locomotive components respectively. The acquisition of G&B Specialties was completed on July 28, 2010, for approximately $31.8 million. The acquisition of Bach-Simpson Corporation was completed on August 20, 2010, for approximately $12.0 million. In November 2010, Wabtec acquired all of the assets of Swiger Coil Systems, a Cleveland-based manufacturer of traction motors and electric coils for rail and power generation markets, for approximately $43.0 million.\nOn June 14, 2012, Wabtec acquired Mors Smitt Holding for a purchase price of $88.4 million. On June 6, 2014, Wabtec  acquired Fandstan Electric Group, a rail and industrial equipment manufacturer, for a purchase price of $199.4 million. On June 17, 2015, Wabtec acquired all three units of  Metalocaucho (MTC), which are leaders in the field of suspension and anti-vibration systems in Spain, China and India, for a purchase price of $23.4 million. On July 27, 2015, Wabtec announced that it plans to purchase 51% of Faiveley Transport's shares in a cash-and-stock deal valued at $1.8 billion, including debt. The deal closed on December 1, 2016, for a total of $1.7 billion.\nOn August 21, 2014, Wabtec acquired Dia-Frag, a manufacturer of friction products including motorcycle braking, for a purchase price of $70.6 million. On October 12, 2015, Wabtec announced its acquisition of lineside sensor manufacturer Track IQ. On April 20, 2018, it was reported that General Electric (GE), undergoing a strategic review, was in talks to sell its century-old locomotive business, GE Transportation, to Wabtec, according to people familiar with the matter. On May 21, 2018, GE and Wabtec confirmed the merger of GE Transportation with Wabtec in an $11 billion deal, completed on February 25, 2019, which saw Wabtec shareholders take a 50.8% shareholding in the merged company, with GE shareholders owning 24.3% and GE itself 24.9%. On 4 January 2022, it was announced that Wabtec had acquired the New Delhi-based railway friction business, Masu, for 34 million USD.\nOn 20 April 2022, it was announced that Wabtec acquired Trimble’s Beena Vision business. On 16 June 2022, it was announced that Wabtec acquired Collins Aerospace ARINC rail solutions. On 16 June 2023, it was announced that Wabtec acquired L&M Radiator, a heat exchanger manufacturer in Hibbing, Minnesota. On 14 January 2025, it was announced that Wabtec acquired Evident's Inspection Technologies division in an $1.78 billion deal. In March 2025, coupler manufacturer Dellner was purchased.\n\nUnited Kingdom\nBrush Traction\nWabtec bought Brush Traction of Loughborough, an English locomotive builder and maintainer, for US$31 million on 25 February 2011.\n\nBearward Engineering\nIn November 2011, Wabtec acquired Bearward Engineering, an industrial radiator manufacturer employing some 300 people based in Northampton, England. Bearward Engineering mainly makes cooling systems for power generators. At the time of purchase Bearward had an annual sales of US$70 million.\n\nBreknell Willis\nWabtec acquired Brecknell Willis Composites Ltd in 2014. Brecknell Willis is now a brand within the Wabtec group. Wabtec has since closed the production facility in Chard, Somerset, where Brecknell Willis was based, transferring production to other Wabtec plants in 2023. The office in Chard continues to function for engineering, project management, and sales.\n\nWabtec Rail UK\nWabtec Rail is a railway engineering company based in at the Doncaster Works in Doncaster, England. It was purchased by Wabtec in 1998. Services include the overhaul and repair of railway rolling stock and components. Wabtec Rail occupies part of the former British Rail Engineering Limited site known locally as the Plant Works. The two main unions on site (Unite and RMT) gave notice on November 3, 2014, of their intention to ballot their members for industrial action over a pay dispute, for the first time in Wabtec Rail Limited's history. It is scheduled to close in 2025.\n\nWabtec Rail Scotland\nWabtec Rail Scotland occupied the Kilmarnock works of the former locomotive builder Andrew Barclay Sons & Company. It closed in 2020.\n\nLH Group Services\nWabtec announced the $48 million acquisition of diesel engine, transmission and bogie overhaul and industrial locomotive supplier LH Group on October 1, 2012. Based at Barton-under-Needwood, LH has around 400 employees and annual sales of US$65m, about 10% of which are in non-rail markets.\n\nBattery electric locomotive\nIn September 2021, at an event in Pittsburgh, Wabtec unveiled the world’s first battery-electric freight locomotive. It was the result of a joint venture with Carnegie Mellon University, and is part of an initiative by the two organizations to develop zero-emissions technology. Using a traditional locomotive body, the usual diesel engine has been replaced by a large bank of batteries, which drive the traction motors of the locomotive. Regenerative braking is used to help recharge the batteries.\nWabtec claimed that the next version of the locomotive, to be developed within two years, would reduce the consumption of diesel fuel by nearly a third, and that emissions could be entirely eliminated through the development of accompanying hydrogen fuel cells. \nThe first battery locomotives were for the Roy Hill railway line.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Wabtec Corporation:",
  "clean_text": "Westinghouse Air Brake Technologies Corporation, commonly known as Wabtec, is an American company formed by the merger of the Westinghouse Air Brake Company (WABCO) and MotivePower in 1999. It is headquartered in Pittsburgh, Pennsylvania. Wabtec manufactures products for locomotives, freight cars and passenger transit vehicles, and builds new locomotives up to 6,000 horsepower (4 MW). It is a Fortune 500 company. The company purchased GE Transportation on February 25, 2019. History The company's origins go back to 1869 with the founding of the Westinghouse Air Brake Company. That company (known as WA&B and later also as WABCO) became independent in 1990 via a management buy-out, and went public in 1995. (Another company, WABCO Vehicle Control Systems, also created from the Westinghouse Brake Company, is independent of Wabtec. It was spun off by American Standard Companies in 2007, and is today part of German automotive components firm ZF Friedrichshafen.) The other company forming Wabtec, MotivePower, can be traced back to 1972, with the formation of the MK Rail division by Morrison Knudsen and the purchase of a manufacturing facility in Boise. In 1994 Morrison Knudsen created a subsidiary MK Rail Corporation; during the first half of the same decade the MK Rail group expanded with the acquisition of various other locomotive component companies. In 1996, MK Rail group separated from the parent Morrison Knudsen and adopted the name MotivePower Industries Corporation. In the later half of the 1990s additional companies were acquired – again all in the locomotive components business. MotivePower, a wholly owned subsidiary of Wabtec, continues to manufacture locomotives. The corporate logo is said to represent an axial view of a mechanical brake valve, where different air ports line up between the 'stator' and 'rotor' depending upon the handle position. On June 10, 2023, United Electrical, Radio and Machine Workers of America workers at Wabtec's Erie, Pennsylvania, plant went on strike. Issues included pay, healthcare benefits, paid time off, prohibitions on grievance strikes, and the number of tier-4 emission rules compliant locomotives built at the Erie plant. The strike ended on August 31 with an agreement that raised the pay of workers. Mergers and acquisitions In March 2010, Wabtec announced that it had purchased Xorail, a railway signaling design and construction company for $40 million. In July 2010, Wabtec announced the plan to purchase two manufacturers of rail equipment, G&B Specialties and Bach-Simpson Corp. The companies produce track products and locomotive components respectively. The acquisition of G&B Specialties was completed on July 28, 2010, for approximately $31.8 million. The acquisition of Bach-Simpson Corporation was completed on August 20, 2010, for approximately $12.0 million. In November 2010, Wabtec acquired all of the assets of Swiger Coil Systems, a Cleveland-based manufacturer of traction motors and electric coils for rail and power generation markets, for approximately $43.0 million. On June 14, 2012, Wabtec acquired Mors Smitt Holding for a purchase price of $88.4 million. On June 6, 2014, Wabtec acquired Fandstan Electric Group, a rail and industrial equipment manufacturer, for a purchase price of $199.4 million. On June 17, 2015, Wabtec acquired all three units of Metalocaucho (MTC), which are leaders in the field of suspension and anti-vibration systems in Spain, China and India, for a purchase price of $23.4 million. On July 27, 2015, Wabtec announced that it plans to purchase 51% of Faiveley Transport's shares in a cash-and-stock deal valued at $1.8 billion, including debt. The deal closed on December 1, 2016, for a total of $1.7 billion. On August 21, 2014, Wabtec acquired Dia-Frag, a manufacturer of friction products including motorcycle braking, for a purchase price of $70.6 million. On October 12, 2015, Wabtec announced its acquisition of lineside sensor manufacturer Track IQ. On April 20, 2018, it was reported that General Electric (GE), undergoing a strategic review, was in talks to sell its century-old locomotive business, GE Transportation, to Wabtec, according to people familiar with the matter. On May 21, 2018, GE and Wabtec confirmed the merger of GE Transportation with Wabtec in an $11 billion deal, completed on February 25, 2019, which saw Wabtec shareholders take a 50.8% shareholding in the merged company, with GE shareholders owning 24.3% and GE itself 24.9%. On 4 January 2022, it was announced that Wabtec had acquired the New Delhi-based railway friction business, Masu, for 34 million USD. On 20 April 2022, it was announced that Wabtec acquired Trimble’s Beena Vision business. On 16 June 2022, it was announced that Wabtec acquired Collins Aerospace ARINC rail solutions. On 16 June 2023, it was announced that Wabtec acquired L&M Radiator, a heat exchanger manufacturer in Hibbing, Minnesota. On 14 January 2025, it was announced that Wabtec acquired Evident's Inspection Technologies division in an $1.78 billion deal. In March 2025, coupler manufacturer Dellner was purchased. United Kingdom Brush Traction Wabtec bought Brush Traction of Loughborough, an English locomotive builder and maintainer, for US$31 million on 25 February 2011. Bearward Engineering In November 2011, Wabtec acquired Bearward Engineering, an industrial radiator manufacturer employing some 300 people based in Northampton, England. Bearward Engineering mainly makes cooling systems for power generators. At the time of purchase Bearward had an annual sales of US$70 million. Breknell Willis Wabtec acquired Brecknell Willis Composites Ltd in 2014. Brecknell Willis is now a brand within the Wabtec group. Wabtec has since closed the production facility in Chard, Somerset, where Brecknell Willis was based, transferring production to other Wabtec plants in 2023. The office in Chard continues to function for engineering, project management, and sales. Wabtec Rail UK Wabtec Rail is a railway engineering company based in at the Doncaster Works in Doncaster, England. It was purchased by Wabtec in 1998. Services include the overhaul and repair of railway rolling stock and components. Wabtec Rail occupies part of the former British Rail Engineering Limited site known locally as the Plant Works. The two main unions on site (Unite and RMT) gave notice on November 3, 2014, of their intention to ballot their members for industrial action over a pay dispute, for the first time in Wabtec Rail Limited's history. It is scheduled to close in 2025. Wabtec Rail Scotland Wabtec Rail Scotland occupied the Kilmarnock works of the former locomotive builder Andrew Barclay Sons & Company. It closed in 2020. LH Group Services Wabtec announced the $48 million acquisition of diesel engine, transmission and bogie overhaul and industrial locomotive supplier LH Group on October 1, 2012. Based at Barton-under-Needwood, LH has around 400 employees and annual sales of US$65m, about 10% of which are in non-rail markets. Battery electric locomotive In September 2021, at an event in Pittsburgh, Wabtec unveiled the world’s first battery-electric freight locomotive. It was the result of a joint venture with Carnegie Mellon University, and is part of an initiative by the two organizations to develop zero-emissions technology. Using a traditional locomotive body, the usual diesel engine has been replaced by a large bank of batteries, which drive the traction motors of the locomotive. Regenerative braking is used to help recharge the batteries. Wabtec claimed that the next version of the locomotive, to be developed within two years, would reduce the consumption of diesel fuel by nearly a third, and that emissions could be entirely eliminated through the development of accompanying hydrogen fuel cells. The first battery locomotives were for the Roy Hill railway line."
}