{
  "ticker": "WAT",
  "cik": "0001000697",
  "company_name": "Waters Corporation",
  "corrected_name": "Waters Corporation",
  "wiki_title_used": "Waters Corporation",
  "exists": true,
  "raw_text": "Waters Corporation, headquartered in Milford, Massachusetts, provides analytical instruments and software used for chromatography, mass spectrometry, laboratory informatics, and rheometry by the life, materials and food sciences industries.\nThe company has primary manufacturing facilities in 9 U.S. locations as well as 11 international locations including Wexford, Wilmslow, Birmingham, Hüllhorst, Singapore, Bangalore, Beijing, and Shanghai.\nMajor brands include ACQUITY UPC2 / UPLC Systems and columns, Xevo mass spectrometry systems, Synapt MS / HDMS systems, Zodiac HPLC columns, XTerra HPLC columns, XBridge columns, Alliance HPLC systems, Empower chromatography software, MassLynx mass spectrometry software, Oasis sample preparation products, and NuGenesis lab management system (LMS).\nThe company's primary competitors are Agilent Technologies, Thermo Fisher Scientific, Revvity, and Danaher.\n\nHistory\nIn 1958, James (Jim) Logan Waters founded Waters Associates in an office in the basement of a police station in Framingham, Massachusetts.\nEarly products included a boiler feedwater flame photometer, a balloon hydrometer, a nerve gas detector, a lab refractometer and process control refractometers.\nIn 1962, Hardie Sheppard provided the company with $150,000, its first external financing raise.\nIn 1961, Dow Chemical requested Waters to design a refractometer. Dow had designed a method of analyzing polymers using gel columns. Waters negotiated an exclusive license to the patent, paying $10,000 plus a 10% royalty.\nIn 1963, Waters’ produced its first five gel permeation chromatography instruments, selling three to Dow Chemical, one to BFGoodrich, and one to Esso. Dow Chemical then invested $400,000 in Waters.\nIn 1965, interest surged after Waters sponsored a symposium where scientists presented the results of using Waters equipment.\nIn 1966, Dow converted its royalty receivable into equity in Waters.\nIn 1967, the company introduced the ALC 100, the first Waters LC system. It was a benchtop system equipped with a Milton Roy pump, syringe injection, and two detectors: a Waters differential refractometer and a UV detector from Laboratory Data Control.\nIn 1969, Dimitri D’Arbeloff, then president of Millipore Corporation, joined the board of directors. Millipore's venture capital subsidiary made a $600,000 equity investment in Waters and provided the company with marketing expertise.\nBy 1972, Dow Chemical had invested $700,000 in the company and owned a 20% stake.\nIn 1972, Helmut Hamberger, chief post-doc for Nobel laureate Robert Burns Woodward of Harvard University, sought Jim Waters’ help to the first synthesis of vitamin B12. Dr. Hamberger wanted to purify the positional isomers, which were needed to give him the right compound for the final stages of the synthesis. Working with Dr. Hamberger, the pair took two days to develop a separation, five more days to obtain larger columns to scale up the separation, and three more days to prep his material, successfully isolating and purifying 200 mg of the precursor compound.\nIn 1972, Waters Associates appointed Frank Zenie president. A year later, it moved its headquarters from Framingham to a semi-rural 26-acre (110,000 m2) site in Milford, Massachusetts. Waters became chairman.\nFrom 1972 to 1977, sales grew at a 40% compound annual growth rate. The company introduced its M6000 pump, the first high-pressure, high-accuracy pumping system, which won an award from Industrial Research Magazine. In 1973, the company became a public company via an initial public offering on the predecessor to the Nasdaq.\nBy 1978, Waters had a 40% market share in liquid chromatography and was five times bigger than any competitor.\nBy 1979, Dow owned almost 25% of the company. At that time, the company had 1,100 employees and over 10,000 customers.\nIn May 1980, Millipore acquired the company for $167 million and the company was referred to as the Waters Chromatography Division of Millipore. Due to competition, the early 1980s recession, the early 1990s recession, and lost focus, the company's growth stalled in the 1980s and early 1990s. D’Arbeloff, the chairman of the company, died of cancer and the COO and CTO died in a helicopter crash while commuting between facilities. The anticipated synergies never materialized.\nIn 1994, an investor group led by management purchased the company for $360 million. That year, the company introduced Symmetry HPLC columns. It had a renewed focus for growth under CEO Douglas A. Berthiaume. Pharmaceutical spending also increased after the failure of the Clinton health care plan of 1993.\nIn November 1995, the company once again became a public company via an initial public offering.\nIn 1996, the company acquired TA Instruments. It also introduced the Alliance HPLC system.\nIn 1997, Waters acquired Micromass for $176 million, entering the mass spectrometry market.\nIn 2004, the company introduced the Acquity UPLC system, which brought greater speed, resolution, and sensitivity to chromatographic separations and was considered a breakthrough technology.\nIn 2006, Waters acquired Vicam, provider of bio-separation and rapid detection products for improving food safety and quality.\nIn January 2020, Waters acquired Andrew Alliance, a producer of software and robotics for laboratory automation, for $77.4 million.\nIn September 2020, Udit Batra was named President and Chief Executive Officer of the company.\nIn May 2023, Waters acquired Wyatt Technology for $1.36 billion in cash.\nIn July 2025, Waters agreed to merge with the biosciences & diagnostics unit of Becton Dickinson, subject to shareholder approval.\n\nMass spectrometers\nSee also\nLaboratory equipment\n\nReferences\nExternal links\nOfficial website\nBusiness data for Waters Corporation:",
  "clean_text": "Waters Corporation, headquartered in Milford, Massachusetts, provides analytical instruments and software used for chromatography, mass spectrometry, laboratory informatics, and rheometry by the life, materials and food sciences industries. The company has primary manufacturing facilities in 9 U.S. locations as well as 11 international locations including Wexford, Wilmslow, Birmingham, Hüllhorst, Singapore, Bangalore, Beijing, and Shanghai. Major brands include ACQUITY UPC2 / UPLC Systems and columns, Xevo mass spectrometry systems, Synapt MS / HDMS systems, Zodiac HPLC columns, XTerra HPLC columns, XBridge columns, Alliance HPLC systems, Empower chromatography software, MassLynx mass spectrometry software, Oasis sample preparation products, and NuGenesis lab management system (LMS). The company's primary competitors are Agilent Technologies, Thermo Fisher Scientific, Revvity, and Danaher. History In 1958, James (Jim) Logan Waters founded Waters Associates in an office in the basement of a police station in Framingham, Massachusetts. Early products included a boiler feedwater flame photometer, a balloon hydrometer, a nerve gas detector, a lab refractometer and process control refractometers. In 1962, Hardie Sheppard provided the company with $150,000, its first external financing raise. In 1961, Dow Chemical requested Waters to design a refractometer. Dow had designed a method of analyzing polymers using gel columns. Waters negotiated an exclusive license to the patent, paying $10,000 plus a 10% royalty. In 1963, Waters’ produced its first five gel permeation chromatography instruments, selling three to Dow Chemical, one to BFGoodrich, and one to Esso. Dow Chemical then invested $400,000 in Waters. In 1965, interest surged after Waters sponsored a symposium where scientists presented the results of using Waters equipment. In 1966, Dow converted its royalty receivable into equity in Waters. In 1967, the company introduced the ALC 100, the first Waters LC system. It was a benchtop system equipped with a Milton Roy pump, syringe injection, and two detectors: a Waters differential refractometer and a UV detector from Laboratory Data Control. In 1969, Dimitri D’Arbeloff, then president of Millipore Corporation, joined the board of directors. Millipore's venture capital subsidiary made a $600,000 equity investment in Waters and provided the company with marketing expertise. By 1972, Dow Chemical had invested $700,000 in the company and owned a 20% stake. In 1972, Helmut Hamberger, chief post-doc for Nobel laureate Robert Burns Woodward of Harvard University, sought Jim Waters’ help to the first synthesis of vitamin B12. Dr. Hamberger wanted to purify the positional isomers, which were needed to give him the right compound for the final stages of the synthesis. Working with Dr. Hamberger, the pair took two days to develop a separation, five more days to obtain larger columns to scale up the separation, and three more days to prep his material, successfully isolating and purifying 200 mg of the precursor compound. In 1972, Waters Associates appointed Frank Zenie president. A year later, it moved its headquarters from Framingham to a semi-rural 26-acre (110,000 m2) site in Milford, Massachusetts. Waters became chairman. From 1972 to 1977, sales grew at a 40% compound annual growth rate. The company introduced its M6000 pump, the first high-pressure, high-accuracy pumping system, which won an award from Industrial Research Magazine. In 1973, the company became a public company via an initial public offering on the predecessor to the Nasdaq. By 1978, Waters had a 40% market share in liquid chromatography and was five times bigger than any competitor. By 1979, Dow owned almost 25% of the company. At that time, the company had 1,100 employees and over 10,000 customers. In May 1980, Millipore acquired the company for $167 million and the company was referred to as the Waters Chromatography Division of Millipore. Due to competition, the early 1980s recession, the early 1990s recession, and lost focus, the company's growth stalled in the 1980s and early 1990s. D’Arbeloff, the chairman of the company, died of cancer and the COO and CTO died in a helicopter crash while commuting between facilities. The anticipated synergies never materialized. In 1994, an investor group led by management purchased the company for $360 million. That year, the company introduced Symmetry HPLC columns. It had a renewed focus for growth under CEO Douglas A. Berthiaume. Pharmaceutical spending also increased after the failure of the Clinton health care plan of 1993. In November 1995, the company once again became a public company via an initial public offering. In 1996, the company acquired TA Instruments. It also introduced the Alliance HPLC system. In 1997, Waters acquired Micromass for $176 million, entering the mass spectrometry market. In 2004, the company introduced the Acquity UPLC system, which brought greater speed, resolution, and sensitivity to chromatographic separations and was considered a breakthrough technology. In 2006, Waters acquired Vicam, provider of bio-separation and rapid detection products for improving food safety and quality. In January 2020, Waters acquired Andrew Alliance, a producer of software and robotics for laboratory automation, for $77.4 million. In September 2020, Udit Batra was named President and Chief Executive Officer of the company. In May 2023, Waters acquired Wyatt Technology for $1.36 billion in cash. In July 2025, Waters agreed to merge with the biosciences & diagnostics unit of Becton Dickinson, subject to shareholder approval. Mass spectrometers"
}