{
  "ticker": "WBD",
  "cik": "0001437107",
  "company_name": "Warner Bros. Discovery",
  "corrected_name": "Warner Bros. Discovery",
  "wiki_title_used": "Warner Bros. Discovery",
  "exists": true,
  "raw_text": "Warner Bros. Discovery, Inc. (WBD) is an American multinational mass media and entertainment conglomerate headquartered in New York City. It was formed from WarnerMedia's spin-off by AT&T and merger with Discovery, Inc. on April 8, 2022.\nThe company operates via two divisions: Streaming & Studios and Global Linear Networks. S&S includes the flagship Warner Bros. studios, HBO, DC Entertainment, and the company's streaming services. GLN largely includes advertising-supported cable networks. Those networks were inherited from its predecessors Discovery (such as Discovery Channel among others), Scripps Networks Interactive (such as HGTV among others), and Turner Broadcasting System (such as Cartoon Network, CNN, TBS, and TNT). Warner Bros. Discovery International is also included in the division, which manages broadcasting operations outside of the United States.\n\nBackground\n1923–1979\nWarner Bros., Turner Broadcasting System, Scripps Networks Interactive and Discovery, Inc. have conjoined histories. Warner Bros. was founded on April 4, 1923, by four brothers, Harry, Albert, Sam, and Jack Warner in Hollywood. The company established itself as a leader in the American film industry before diversifying into animation, television, and video games. It is one of the \"Big Five\" American film studios, as well as a member of the Motion Picture Association (MPA). In 1965, Turner Broadcasting System was founded by Ted Turner in Atlanta, Georgia. A year later, Kinney National Company came into existence. It reincorporated as Warner Communications in 1972 before merging with Time Inc. in 1990 to become Time Warner. During its time as Warner Communications, the company made further acquisitions.\n\n1979–1996\nIn 1979, Warner Communications formed a joint venture with credit card company American Express called Warner-Amex Satellite Entertainment. American Express acquired a 50% stake in Warner Communications' cable television holdings for $175 million. This company owned such cable channels as MTV, Nickelodeon, The Movie Channel, and VH1 (which was launched in 1985 on the channel space left by Turner's Cable Music Channel). Warner Communications bought American Express's half in 1984 and sold the venture a year later to the original iteration of Viacom, which renamed it MTV Networks (now known as Paramount Media Networks). In 1982, Warner Communications purchased Popular Library from CBS Publications. In the same year, Cable Education Network was founded, launching The Discovery Channel three years later. It was named Discovery Communications in 1994.\n\n1996–2021\nTime Warner acquired Turner Broadcasting System in 1996, allowing it to reenter the cable industry. In 2001, it merged with America Online (AOL) to form AOL Time Warner in 2001, but the merger proved disastrous, and the company reverted to its former name, Time Warner, in 2003.\nTime Warner spun off its cable division (later known as Spectrum, owned by Charter Communications), AOL (later owned by Yahoo! Inc.) in 2009, and Time Inc. in 2013, which was later acquired by Meredith Corporation and became Dotdash Meredith.\nIn 2018, Discovery Communications acquired Scripps Networks Interactive (a 2008 spun off from E. W. Scripps Company's cable division) and was renamed as Discovery, Inc. AT&T acquired Time Warner, becoming WarnerMedia. In 2019, AT&T integrated its related assets into Warner's business divisions as part of its reorganization, effectively breaking up Turner Broadcasting System.\n\nHistory\nFormation (2021–2022)\nAT&T and Discovery announced their merger on May 17, 2021; the merger would be structured as a Reverse Morris Trust, with AT&T shareholders holding a 71% interest in the new company's stock and appointing seven board members, and Discovery shareholders holding a 29% interest and appointing six board members. AT&T would receive US$43 billion in cash and debt. The merger was expected to be completed in mid-2022.\nThe merged company would be led by Discovery's current CEO, David Zaslav; WarnerMedia's CEO Jason Kilar's position in the new company was uncertain. Zaslav stated that the two companies would spend a combined US$20 billion annually on content (outpacing Netflix). The company aimed to expand their streaming services, which included WarnerMedia's HBO Max, to reach 400 million global subscribers. \nOn June 1, 2021, it was announced that the merged company would be known as Warner Bros. Discovery, and an interim wordmark was unveiled with the tagline \"The stuff that dreams are made of\"—a quote from the 1941 Warner Bros. film The Maltese Falcon, itself paraphrasing Shakespeare's The Tempest.\nIn an SEC Filing on November 18, 2021, Discovery revealed that talks with AT&T had fallen through, in April 2021, due to disagreements over the ownership of the new company between AT&T and Discovery shareholders, and the amount of debt transferred to Discovery when they merged with WarnerMedia, before talks resumed on May 17, 2021.\nIn November 2021, during an earnings call, Discovery Streaming CEO JB Perrette discussed possible options for its Discovery+ streaming service post-merger, including bundling the service with HBO Max and eventually merging them under a single platform with a mixture of both companies' technologies. He noted that WBD may prioritize launching Discovery+ and HBO Max as a unified platform in markets where Discovery+ had yet to launch, such as other parts of Asia-Pacific. \nOn December 22, 2021, the transaction was approved by the European Commission. On January 5, 2022, The Wall Street Journal reported that WarnerMedia and Paramount Global (at the time named ViacomCBS) were exploring a possible sale of either a majority stake or all of The CW, and that Nexstar Media Group was considered a leading bidder. The reports also indicated that WarnerMedia and ViacomCBS could include a contractual commitment that would require any new owner to buy new programming from those companies, allowing them to reap some continual revenue through the network. The CW's then-president-and-CEO Mark Pedowitz confirmed talks of a potential sale in a memo to CW staffers, but added that \"It's too early to speculate what might happen.\"\nOn January 26, 2022, AT&T CEO John Stankey stated that the merger was expected to close sometime during the second quarter of 2022. On February 1, 2022, it was reported that AT&T had finalized the structure of the merger: WarnerMedia would be spun off pro rata to AT&T's shareholders, and then merge into Discovery Inc. to form the new company. The transaction was approved by the Brazilian antitrust regulator Cade on February 7, followed by the United States Department of Justice on February 9. On March 11, 2022, the merger was approved by Discovery's shareholders. Due to the structure of the merger, it did not require separate approval from AT&T shareholders.\n\nIn an SEC filing on March 25, 2022, AT&T stated that two-way trading of WBD stock with that of AT&T would begin on April 4, 2022, and that a special dividend would be issued the next day to give AT&T shareholders a 0.24 share in WBD for each share of AT&T common stock they held. The merger was officially completed on April 8, 2022. Trading began on Nasdaq on April 11. At this time the company unveiled its final logo, designed by Chermayeff & Geismar & Haviv, which features a rendition of Warner Bros.' long-time shield logo.\nThe combined company retained several top executives from WarnerMedia, including film and television heads Toby Emmerich and Channing Dungey, and HBO and HBO Max chief content officer (CCO) Casey Bloys. Most of the company's top executive roles are filled by their Discovery counterparts, including Gunnar Wiedenfels as Warner Bros. Discovery's chief financial officer (CFO), JB Perrette as president and CEO of global streaming and interactive, and Discovery's chief lifestyle brands officer Kathleen Finch—whose role expanded to cover most of the combined company's U.S. linear networks, besides CNN (which was taken over by Chris Licht, replacing the outgoing Jeff Zucker), Magnolia Network (which reported to Bloys, after reporting directly to Zaslav under Discovery), and the Turner Sports unit (which would be overseen by the newly formed Warner Bros. Discovery Sports division).\nIn an introductory town hall hosted by Oprah Winfrey, Zaslav stated that the combined company would need to have \"one culture\" that \"starts with people feeling safe, people feeling valued for who they are\", as opposed what he described as a culture of internal competition between WarnerMedia's businesses. He expected that \"investment avoidance\" via the consolidation of redundant business units (such as streaming) and staff would be one of the main ways that the company would achieve its promised $3 billion in cost savings. On April 21, 2022, Licht and Perrette announced the shutdown of CNN's streaming service CNN+, which had launched only two weeks prior to the completion of the merger; the new leadership considered it to be incompatible with their goal of a unified streaming service for WBD properties.\nIn an investors' call on April 26 (concurrent with the first quarter earnings reports for Discovery Inc., its last prior to the merger), Zaslav contrasted the company's streaming businesses with Netflix (whose stock declined after a quarterly loss in subscribers), describing Warner Bros. Discovery as a \"far more balanced and competitive company\" that would \"invest at scale smartly\" and not \"overspend\" on growth and that its streaming businesses would complement its linear networks. He stated that HBO Max had \"meaningful subscriber churn\", and that the planned merger of it with Discovery+ would help to reduce churn by offering a broader content mix. It was reported that the company had suspended scripted development at TBS and TNT, to evaluate their strategies. The following day, Zaslav purchased approximately $1 million worth of WBD stock.\nOn May 11, 2022, Warner Bros. Discovery eliminated several executive positions carried over from WarnerMedia, including Kids, Young Adults and Classics head Tom Ascheim, and general manager of TBS, TNT, and TruTV head Brett Weitz. These networks would be overseen by Finch as head of U.S. Networks, while the studios under the Kids, Young Adults and Classics division (Warner Bros. Animation, Cartoon Network Studios, Williams Street and Hanna-Barbera Studios Europe) was moved under Warner Bros. Television. That day, it announced an agreement with British telecom company BT Group for it to contribute its BT Sport channels into a 50/50 joint venture with its UK Eurosport channels, and eventually merge them.\nOn June 1, 2022, Warner Bros. Pictures head Toby Emmerich announced his departure to establish a new studio, to be funded and distributed exclusively (for five-years) by Warner Bros. Pictures. Warner Bros. Pictures was then divided into three business units with separate leadership: former MGM executives Michael De Luca and Pamela Abdy became the co-chairs of Warner Bros. Pictures and New Line Cinema, and temporarily oversaw the DC Films and Warner Animation Group units. Eight days later, WBD named former Discovery and Univision executive Luis Silberwasser as chairman of Sports. In July 2022, Alan Horn rejoined Warner Bros. as a consultant.\nWBD delivered its second-quarter earnings report on August 4, 2022. Ahead of the report, the company performed surgery on HBO Max, including cutting new programming development in much of Europe, live-action children's programming development, and direct-to-streaming films—including notable August 3 cancellations of the nearly completed films Batgirl and Scoob! Holiday Haunt as tax write-offs, and the quiet removals of multiple HBO Max original films from the platform along with upcoming releases.\nIn the second quarter of 2022, WBD revealed $9.8 billion in revenue and a net loss of $2.2 billion pro forma, primarily from integration and restructuring expenses. The company took $825 million in write-offs on \"content impairments and development\". The company confirmed cuts to children's program development, and abandoned the production of direct-to-streaming films for HBO Max—with Zaslav arguing that they lacked economic value and impact in comparison to theatrical releases. WBD renewed its contracts with Bloys and other key HBO executives; Zaslav praised Bloys' performance as chief content officer. Zaslav stated that a \"10-year plan\" was in development for DC Films, modeled after those of Marvel Studios, while Perrette stated that the planned merger of Discovery+ and HBO Max would occur by summer 2023 in the United States, followed by other markets.\nHBO subsequently reorganized on August 15 to dismantle most of HBO Max's autonomous units. HBO Max's head of comedy Suzanna Makkos began reporting to HBO's head of comedy Amy Gravitt. Layoffs hit HBO Max's non-scripted, live-action family entertainment, international originals, and casting units, as well as HBO's acquisitions unit. HBO Max also continued to remove and cancel some of its lesser-viewed original programming, particularly family-oriented and animated series.\nOn August 15, 2022, Nexstar confirmed in June that it would buy a controlling 75% interest in The CW; WBD and Paramount would each retain a 12.5% ownership interest. Nexstar stated that Mark Pedowitz would remain its chairman and CEO. WBD and Paramount would remain The network's main content suppliers, but Nexstar stated that the arrangement would be for the 2022–23 broadcast season, and it retained the option to extend the partnership. As the transaction did not require regulatory approval (unlike the \"Big Four\" networks, The CW does not own stations), Nexstar immediately took over the network's operations.\nIn September 2022, WBD became the subject of a proposed class-action lawsuit by one of its shareholders, alleging that WarnerMedia was overinvesting in streaming content \"without sufficient concern for return on investments\", and had overstated the number of HBO Max subscribers by at least 10 million by counting inactivated subscriptions bundled with AT&T services—thus misleading investors in violation of the Securities Act. It also alleged that Discovery executives failed to warn investors that WarnerMedia's prospectus contained misleading statements.\nOn September 28 during a company town hall, Zaslav addressed speculation that WBD was pursuing a possible sale as early as 2024, stating that they were \"absolutely not for sale\", and \"have everything we need to be successful\". On October 11, Warner Bros. Television Group laid off 82 employees and eliminated 43 vacant positions as part of a restructuring that primarily impacted their unscripted and animation units. The restructuring saw the consolidation of Warner Horizon and Telepictures' creative operations, and the consolidation of Cartoon Network Studios' and Warner Bros. Animation's development and production teams (with the two studios retaining separate labels with distinct output).\nOn October 3, 2022, Nexstar closed its deal to acquire a controlling interest in The CW. Mark Pedowitz resigned from his position as the network's chairman and CEO, replaced by Dennis Miller as president. Later that month, it was announced that filmmaker James Gunn and producer Peter Safran would serve as co-CEOs and co-chairs of DC Films which rebranded as DC Studios. The duo signed a four-year deal to oversee film, television, and animation production for DC. The pair reported directly to Zaslav, while working independently with other members of the studio. Gunn would oversee creative development on DC projects, while Safran took the business aspect. An earnings report in November 2022, announced that the launch of WBD's streaming service had been moved up to spring 2023. Max was unveiled April 12, 2023. In December 2022, CNN announced cutbacks and a reorganization to prioritize its \"core\" operations, resulting in sister channel HLN being brought under the auspices of Investigation Discovery and abandoning its remaining original live news programming.\n\nDeclining turnover, cutbacks and restructuring (2023–2025)\nIn January 2023, WBD announced licensing agreements with free ad-supported streaming television (FAST) services The Roku Channel and Fox Corporation's Tubi, featuring library content from Discovery, TLC, HGTV, Food Network, Warner Bros. Pictures, Warner Bros. Television, and HBO (including series that were pulled from HBO Max).\nOn February 8, 2023, The Wall Street Journal reported that WBD had amended its plans to merge Discovery+ with HBO Max, with HBO Max's successor slated to include \"most\" Discovery content, and Discovery+ remaining operational to retain its subscriber base, and provide an alternative option for customers not interested in the higher-priced unified service. On February 24, WBD CEO David Zaslav confirmed the change of plans, saying that Discovery+ has \"profitable subscribers that are very happy with the product offering\".\nIn early-June, Licht was fired from CNN. On June 20 WBD underwent a round of layoffs affecting around 100 employees in the U.S. Networks division, most notably including multiple Turner Classic Movies (TCM) executives such as Pola Changnon (who had been with Turner for over 25 years). WBD announced plans to place the channel under Cartoon Network head Michael Ouweleen. It was also reported that WBD was preparing a deal to sell half of the published music catalog of Warner Bros. Entertainment (which films and television scores, and is administered by Universal Music Publishing Group) for around $500 million. Amid concerns over the future of TCM, Martin Scorsese, Steven Spielberg, and Paul Thomas Anderson met with Zaslav, and on June 23 the company announced that the channel would move under Warner Bros. Pictures Group heads Michael De Luca and Pamela Abdy—who both affirmed the cultural significance of TCM and pledged to keep its programming \"untouched and protected\".\nIn December 2023, WBD announced the purchase of Turkish streaming platform BluTV, with operations in the MENA region. On February 16, 2024, RedBird Capital Partners (via its United Arab Emirates-backed partnership RedBird IMI) announced its intent to acquire All3Media—a WBD joint venture with Liberty Global—for £1.15 billion. The acquisition was completed on May 16, 2024. \nIn April 2024, Warner Bros. Discovery New Zealand announced that it would shut down Newshub (which produced bulletins for its free-to-air channel Three) in July 2024, citing declining local advertising revenue. Newshub was supplanted by a partnership with local media company Stuff, which launched an evening newscast under the ThreeNews banner. In July 2024, CNN CEO Mark Thompson announced 100 layoffs. A week later, additional WBD employees at Max and in production, business affairs, and finance were also let go.\nOn July 24, the NBA announced new media rights agreements with Disney (ESPN and ABC), NBCUniversal (NBC and Peacock), and Amazon Prime Video beginning in the 2025–26 season, ending a nearly 36-year association between the NBA and TNT. WBD had attempted to invoke a condition in its contract allowing it to match offers made by competitors (targeting the package sold to Amazon), but the league argued that it did not sufficiently match Amazon's offer. WBD threatened legal action, claiming that the NBA had \"grossly misinterpreted our contractual rights\".\nIn August, WBD reported that it had lost $10 billion in the second quarter of 2024, relating to continued losses from its direct-to-consumer segment and the devaluation of its linear television assets.\nIn November WBD agreed to a settlement with the NBA. The settlement included access to NBA highlights at no additional cost for Bleacher Report and House of Highlights and allowed WBD, under its TNT Sports division, to continue operating NBA TV and NBA.com. The agreement included live game rights for select international territories in Nordic Europe and South America. In a separate agreement with Disney, WBD agreed to a deal to move Inside the NBA to ESPN and ABC (TNT Sports continuing to produce the program), in exchange for ESPN sublicensing Big 12 college football and basketball games to TNT Sports.\nOn March 24, 2025, WBD announced that it would buy a 30% minority stake in Dubai-based OSN Streaming Limited for $57 million.\nIn mid July 2025, WBD confirmed it would sell its New Zealand assets including the Three TV channel and ThreeNow streaming service to the New Zealand media company Sky Network Television, effective August 1, 2025.\n\nSplit and proposed sale (2025–present)\nOn July 18, 2024, Financial Times reported that Zaslav and WBD executives had been discussing the possibility of breaking up the company, to insulate unprofitable linear television networks from more profitable studio and direct-to-consumer businesses. On December 12 WBD announced plans to reorganize. These businesses would be reorganized into two units: Streaming & Studios would include Warner Bros., HBO, and Max, and Global Linear Networks. Zaslav stated that the new structure would enable greater flexibility and \"potential future strategic opportunities\".\nOn May 8 CNBC's David Faber reported that WBD was \"moving towards\" the possibility of divesting its Global Linear Networks division as an independent company, following NBCUniversal's plan to spin off most of its cable networks as a new public company controlled by Comcast shareholders known as Versant. Plans were officially announced on June 9, 2025. WBD announced on July 28 that the two companies would be known as Warner Bros. and Discovery Global respectively.\nWarner Bros. will include the Warner Bros. film, television, and video game studios, DC Studios, DC Entertainment, Cartoon Network Studios, HBO and HBO Max, and TCM. Discovery Global will be led by current WBD CFO Gunnar Wiedenfels, and include assets such as WBD's linear television brands and Discovery+ and its library would remain with Warner Bros. Television Group, while Warner Bros. International Television Production will go to Discovery Global. Sports rights would be divided between the two companies. TNT Sports' US assets would go to Discovery Global, and TNT Sports in the United Kingdom and Ireland to Warner Bros. The transactions were expected to complete in mid-2026; the split is structured to be tax-free; Discovery Global will assume Warner Bros.' debt. On September 10, 2025, Zaslav stated that the split was on track for completion by April 2026. Part of the split included that Warner Bros. Corporation would move their global headquarters from New York City to Burbank.\nOn September 11, 2025, The Wall Street Journal reported that David Ellison's Paramount Skydance (owner of several networks previously held by Warner such as MTV, Nickelodeon, The Movie Channel, VH1, Comedy Central and BET; Paramount and Warner both hold stakes at The CW) was exploring a bid to acquire the entirety of Warner Bros. Discovery; the company had been formed via the acquisition of Paramount Global by Skydance Media. Such an acquisition would integrate overlapping assets between the two companies, including two of the five major film studios (Warner Bros. and Paramount Pictures), streaming services HBO Max and Paramount+, TNT Sports and CBS Sports (which collaborated on properties such as the NCAA men's basketball tournament), and CNN and CBS News. WBD's share prices increased by 33% following the reports.\nRobert Fishman of MoffettNathanson believed that Paramount Skydance was pursuing a strategy of consolidating streaming and studio businesses to take advantage of \"a period of industry-wide instability\", and that preempting the split by bidding for the entirety of WBD would prevent competitors from cherry-picking the \"attractive\" assets of the post-split Warner Bros. company. While such an acquisition would not be subject to FCC scrutiny, unlike the Paramount acquisition, the sale has faced the possibility of antitrust issues due to its horizontal integration of two legacy media conglomerates and film studios; such a merger would resemble the bigger Disney acquisition of 21st Century Fox in 2019. Senator Elizabeth Warren criticized the prospective deal as a \"dangerous concentration of power\".\nOn September 19, Faber reported that Paramount Skydance's bid could be an all-cash offer of approximately $22 to 24 per-share. The previous day, Puck had reported that Netflix was exploring a potential bid.\nOn October 2, CNBC speculated that Comcast could be the biggest wild card for the acquisition of Warner Bros. Discovery's assets. However, they questioned whether it would make sense for Comcast to counter Paramount Skydance's bid, as Comcast was in the process of pushing its own cable assets into Versant. Comcast would also face more regulatory hurdles than Paramount Skydance, due to its contentious relationship with president Donald Trump. On October 8 the New York Post reported that Paramount Skydance was in talks with private equity firms, including Apollo Global Management (the company that owns Legendary Entertainment and Cox Media Group) to join its WBD bid, which could cost upwards of $60 billion. The next day, David Ellison was questioned about the bid in an interview, and while not directly addressing it, Ellison didn't deny it was happening. \nOn October 11, Bloomberg News reported that WBD had rejected Paramount Skydance's proposed offer of $20-a-share.According to reports, Zaslav wants around $30-a-share, and believes that he could unlock greater value by selling Warner Bros. once it splits from Discovery in 2026, given the likelihood that Warner Bros. could spark a bidding war. In an October 14 interview, Apple's Eddy Cue dismissed speculation that his company was interested in acquiring Warner Bros. Earlier on October 8, 2025, Netflix co-CEO Greg Peters similarly indicated that a bid from his company was unlikely. He said, \"we come from a deep heritage of being builders rather than buyers\". \nIn October, Paramount Skydance reportedly made three failed bids, at $19, $22 and $23.50 per share. On October 21, WBD announced that they had begun to review several \"unsolicited\" offers. On October 27, Bloomberg News reported that if a Paramount Skydance deal was successful, Ellison would retain WBD's creative teams and most of its assets, including the cable networks. Previous speculation that he was planning to immediately divest WBD's cable networks, along with Paramount Skydance's own cable networks was not supported. Bloomberg also reported that Ellison intended to merge HBO Max with Paramount+. Ellison suggested that Zaslav might retain his position as co-CEO and that he would be personally compensated with $500 million upon accepting the offer of sale.\nOn October 31, Netflix was reported to be actively exploring a bid for WBD's studio and streaming assets. The acquisition would give Netflix control over IP such as the Harry Potter and DC Comics franchises, along with HBO’s premium dramas. Netflix stressed that it remains “predominantly focused on growing organically” and is not interested in owning legacy cable networks such as CNN and TNT.\nOn November 6, 2025, it was reported that Comcast contracted Goldman Sachs and Morgan Stanley about a possible takeover of WBD's studio and streaming assets. On November 20, Paramount Skydance, Netflix, and Comcast each officially submitted their bids. According to CNBC, David Zaslav will announce whether to split the company in two or sell off the whole company to one of the potential buyers before the end of the year.\n\nAssets\nWarner Bros. Discovery includes two primary business divisions:\n\nWarner Bros. includes assets including Warner Bros. Entertainment and its units, Warner Bros. Theatre Ventures, Warner Bros. Discovery Home Entertainment, Turner Entertainment Co., The Wolper Organization, WaterTower Music and Warner Bros. Studio Operations.\nWarner Bros. Motion Picture Group includes the company's filmed entertainment and theatrical entertainment businesses, including Warner Bros. Pictures, New Line Cinema, Warner Bros. Pictures Animation and Castle Rock Entertainment. The division is led by Michael De Luca and Pamela Abdy.\nWarner Bros. Television Group includes domestic and international network of television production companies, including the flagship Warner Bros. Television label, Telepictures, Alloy Entertainment, Warner Bros. Animation, Cartoon Network Studios, Williams Street and Warner Horizon Unscripted Television. The division also holds 12.5% of The CW along with the CBS Entertainment Group unit of Paramount Skydance Corporation and Turner Classic Movies. The division is led by Channing Dungey.\nWarner Bros. Discovery Streaming manages the company's direct-to-consumer platforms, online brands and gaming businesses, including HBO Max, Warner Bros. Games, and the now-defunct digital media company Rooster Teeth. It also houses Home Box Office, Inc., the parent company of HBO and Cinemax.\nWarner Bros. Discovery Global Experiences manages Warner Bros. theme parks and studio tours. Additional business segments include divisions responsible for Global Content Distribution (Warner Bros. Worldwide Television Distribution), and Advertising Sales.\nDC Entertainment oversees DC Comics and Mad. It works with other WBD units and delves into those units within their flagship DC Universe franchise.\nDC Studios oversees DC Comics and is the film and series production sites of WBD for DC media in the new film and series franchise DC Universe. The division is led by James Gunn and Peter Safran.\nDiscovery Global includes the company's linear cable networks, including Discovery+, Discovery Channel, TLC, Animal Planet, Oprah Winfrey Network, Investigation Discovery, Food Network and Cooking Channel, HGTV, TBS, TNT, TruTV, Cartoon Network/Adult Swim/Cartoonito, and Boomerang. The division is also led by Channing Dungey.\nCNN Worldwide operates CNN and other news assets owned by Warner Bros. Discovery, including various international CNN branches and HLN. The division is led by Mark Thompson.\nTNT Sports is the brand name used for sports-related divisions. The American division manages the company's domestic broadcast sports businesses, including MLB Network, formerly NBA TV, and the sports media website Bleacher Report and previously AT&T SportsNet until it shut down in 2023, while the European division handles international sports operations, including Eurosport and TNT Sports UK, and Warner Bros. Discovery Sports Latin America which owns the sports channel TNT Sports LATAM which replaces Esporte Interativo. Both divisions are led by Luis Silberwasser.\nWarner Bros. Discovery International focuses on local and regional variations that pipelined with global market through operations for its domestic television channels, including region-specific operations such as TVN Group in Poland, as well as the distribution of linear networks from CNN Worldwide and TNT Sports, including Eurosport. The division is led by Gerhard Zeiler. It is split into four regional hubs: Warner Bros. Discovery Asia-Pacific, Warner Bros. Discovery EMEA, TVN Warner Bros. Discovery (Poland), and Warner Bros. Discovery Americas.\n\nLeadership\nReferences\nExternal links\nOfficial website \nBusiness data for Warner Bros. Discovery:",
  "clean_text": "Warner Bros. Discovery, Inc. (WBD) is an American multinational mass media and entertainment conglomerate headquartered in New York City. It was formed from WarnerMedia's spin-off by AT&T and merger with Discovery, Inc. on April 8, 2022. The company operates via two divisions: Streaming & Studios and Global Linear Networks. S&S includes the flagship Warner Bros. studios, HBO, DC Entertainment, and the company's streaming services. GLN largely includes advertising-supported cable networks. Those networks were inherited from its predecessors Discovery (such as Discovery Channel among others), Scripps Networks Interactive (such as HGTV among others), and Turner Broadcasting System (such as Cartoon Network, CNN, TBS, and TNT). Warner Bros. Discovery International is also included in the division, which manages broadcasting operations outside of the United States. Background 1923–1979 Warner Bros., Turner Broadcasting System, Scripps Networks Interactive and Discovery, Inc. have conjoined histories. Warner Bros. was founded on April 4, 1923, by four brothers, Harry, Albert, Sam, and Jack Warner in Hollywood. The company established itself as a leader in the American film industry before diversifying into animation, television, and video games. It is one of the \"Big Five\" American film studios, as well as a member of the Motion Picture Association (MPA). In 1965, Turner Broadcasting System was founded by Ted Turner in Atlanta, Georgia. A year later, Kinney National Company came into existence. It reincorporated as Warner Communications in 1972 before merging with Time Inc. in 1990 to become Time Warner. During its time as Warner Communications, the company made further acquisitions. 1979–1996 In 1979, Warner Communications formed a joint venture with credit card company American Express called Warner-Amex Satellite Entertainment. American Express acquired a 50% stake in Warner Communications' cable television holdings for $175 million. This company owned such cable channels as MTV, Nickelodeon, The Movie Channel, and VH1 (which was launched in 1985 on the channel space left by Turner's Cable Music Channel). Warner Communications bought American Express's half in 1984 and sold the venture a year later to the original iteration of Viacom, which renamed it MTV Networks (now known as Paramount Media Networks). In 1982, Warner Communications purchased Popular Library from CBS Publications. In the same year, Cable Education Network was founded, launching The Discovery Channel three years later. It was named Discovery Communications in 1994. 1996–2021 Time Warner acquired Turner Broadcasting System in 1996, allowing it to reenter the cable industry. In 2001, it merged with America Online (AOL) to form AOL Time Warner in 2001, but the merger proved disastrous, and the company reverted to its former name, Time Warner, in 2003. Time Warner spun off its cable division (later known as Spectrum, owned by Charter Communications), AOL (later owned by Yahoo! Inc.) in 2009, and Time Inc. in 2013, which was later acquired by Meredith Corporation and became Dotdash Meredith. In 2018, Discovery Communications acquired Scripps Networks Interactive (a 2008 spun off from E. W. Scripps Company's cable division) and was renamed as Discovery, Inc. AT&T acquired Time Warner, becoming WarnerMedia. In 2019, AT&T integrated its related assets into Warner's business divisions as part of its reorganization, effectively breaking up Turner Broadcasting System. History Formation (2021–2022) AT&T and Discovery announced their merger on May 17, 2021; the merger would be structured as a Reverse Morris Trust, with AT&T shareholders holding a 71% interest in the new company's stock and appointing seven board members, and Discovery shareholders holding a 29% interest and appointing six board members. AT&T would receive US$43 billion in cash and debt. The merger was expected to be completed in mid-2022. The merged company would be led by Discovery's current CEO, David Zaslav; WarnerMedia's CEO Jason Kilar's position in the new company was uncertain. Zaslav stated that the two companies would spend a combined US$20 billion annually on content (outpacing Netflix). The company aimed to expand their streaming services, which included WarnerMedia's HBO Max, to reach 400 million global subscribers. On June 1, 2021, it was announced that the merged company would be known as Warner Bros. Discovery, and an interim wordmark was unveiled with the tagline \"The stuff that dreams are made of\"—a quote from the 1941 Warner Bros. film The Maltese Falcon, itself paraphrasing Shakespeare's The Tempest. In an SEC Filing on November 18, 2021, Discovery revealed that talks with AT&T had fallen through, in April 2021, due to disagreements over the ownership of the new company between AT&T and Discovery shareholders, and the amount of debt transferred to Discovery when they merged with WarnerMedia, before talks resumed on May 17, 2021. In November 2021, during an earnings call, Discovery Streaming CEO JB Perrette discussed possible options for its Discovery+ streaming service post-merger, including bundling the service with HBO Max and eventually merging them under a single platform with a mixture of both companies' technologies. He noted that WBD may prioritize launching Discovery+ and HBO Max as a unified platform in markets where Discovery+ had yet to launch, such as other parts of Asia-Pacific. On December 22, 2021, the transaction was approved by the European Commission. On January 5, 2022, The Wall Street Journal reported that WarnerMedia and Paramount Global (at the time named ViacomCBS) were exploring a possible sale of either a majority stake or all of The CW, and that Nexstar Media Group was considered a leading bidder. The reports also indicated that WarnerMedia and ViacomCBS could include a contractual commitment that would require any new owner to buy new programming from those companies, allowing them to reap some continual revenue through the network. The CW's then-president-and-CEO Mark Pedowitz confirmed talks of a potential sale in a memo to CW staffers, but added that \"It's too early to speculate what might happen.\" On January 26, 2022, AT&T CEO John Stankey stated that the merger was expected to close sometime during the second quarter of 2022. On February 1, 2022, it was reported that AT&T had finalized the structure of the merger: WarnerMedia would be spun off pro rata to AT&T's shareholders, and then merge into Discovery Inc. to form the new company. The transaction was approved by the Brazilian antitrust regulator Cade on February 7, followed by the United States Department of Justice on February 9. On March 11, 2022, the merger was approved by Discovery's shareholders. Due to the structure of the merger, it did not require separate approval from AT&T shareholders. In an SEC filing on March 25, 2022, AT&T stated that two-way trading of WBD stock with that of AT&T would begin on April 4, 2022, and that a special dividend would be issued the next day to give AT&T shareholders a 0.24 share in WBD for each share of AT&T common stock they held. The merger was officially completed on April 8, 2022. Trading began on Nasdaq on April 11. At this time the company unveiled its final logo, designed by Chermayeff & Geismar & Haviv, which features a rendition of Warner Bros.' long-time shield logo. The combined company retained several top executives from WarnerMedia, including film and television heads Toby Emmerich and Channing Dungey, and HBO and HBO Max chief content officer (CCO) Casey Bloys. Most of the company's top executive roles are filled by their Discovery counterparts, including Gunnar Wiedenfels as Warner Bros. Discovery's chief financial officer (CFO), JB Perrette as president and CEO of global streaming and interactive, and Discovery's chief lifestyle brands officer Kathleen Finch—whose role expanded to cover most of the combined company's U.S. linear networks, besides CNN (which was taken over by Chris Licht, replacing the outgoing Jeff Zucker), Magnolia Network (which reported to Bloys, after reporting directly to Zaslav under Discovery), and the Turner Sports unit (which would be overseen by the newly formed Warner Bros. Discovery Sports division). In an introductory town hall hosted by Oprah Winfrey, Zaslav stated that the combined company would need to have \"one culture\" that \"starts with people feeling safe, people feeling valued for who they are\", as opposed what he described as a culture of internal competition between WarnerMedia's businesses. He expected that \"investment avoidance\" via the consolidation of redundant business units (such as streaming) and staff would be one of the main ways that the company would achieve its promised $3 billion in cost savings. On April 21, 2022, Licht and Perrette announced the shutdown of CNN's streaming service CNN+, which had launched only two weeks prior to the completion of the merger; the new leadership considered it to be incompatible with their goal of a unified streaming service for WBD properties. In an investors' call on April 26 (concurrent with the first quarter earnings reports for Discovery Inc., its last prior to the merger), Zaslav contrasted the company's streaming businesses with Netflix (whose stock declined after a quarterly loss in subscribers), describing Warner Bros. Discovery as a \"far more balanced and competitive company\" that would \"invest at scale smartly\" and not \"overspend\" on growth and that its streaming businesses would complement its linear networks. He stated that HBO Max had \"meaningful subscriber churn\", and that the planned merger of it with Discovery+ would help to reduce churn by offering a broader content mix. It was reported that the company had suspended scripted development at TBS and TNT, to evaluate their strategies. The following day, Zaslav purchased approximately $1 million worth of WBD stock. On May 11, 2022, Warner Bros. Discovery eliminated several executive positions carried over from WarnerMedia, including Kids, Young Adults and Classics head Tom Ascheim, and general manager of TBS, TNT, and TruTV head Brett Weitz. These networks would be overseen by Finch as head of U.S. Networks, while the studios under the Kids, Young Adults and Classics division (Warner Bros. Animation, Cartoon Network Studios, Williams Street and Hanna-Barbera Studios Europe) was moved under Warner Bros. Television. That day, it announced an agreement with British telecom company BT Group for it to contribute its BT Sport channels into a 50/50 joint venture with its UK Eurosport channels, and eventually merge them. On June 1, 2022, Warner Bros. Pictures head Toby Emmerich announced his departure to establish a new studio, to be funded and distributed exclusively (for five-years) by Warner Bros. Pictures. Warner Bros. Pictures was then divided into three business units with separate leadership: former MGM executives Michael De Luca and Pamela Abdy became the co-chairs of Warner Bros. Pictures and New Line Cinema, and temporarily oversaw the DC Films and Warner Animation Group units. Eight days later, WBD named former Discovery and Univision executive Luis Silberwasser as chairman of Sports. In July 2022, Alan Horn rejoined Warner Bros. as a consultant. WBD delivered its second-quarter earnings report on August 4, 2022. Ahead of the report, the company performed surgery on HBO Max, including cutting new programming development in much of Europe, live-action children's programming development, and direct-to-streaming films—including notable August 3 cancellations of the nearly completed films Batgirl and Scoob! Holiday Haunt as tax write-offs, and the quiet removals of multiple HBO Max original films from the platform along with upcoming releases. In the second quarter of 2022, WBD revealed $9.8 billion in revenue and a net loss of $2.2 billion pro forma, primarily from integration and restructuring expenses. The company took $825 million in write-offs on \"content impairments and development\". The company confirmed cuts to children's program development, and abandoned the production of direct-to-streaming films for HBO Max—with Zaslav arguing that they lacked economic value and impact in comparison to theatrical releases. WBD renewed its contracts with Bloys and other key HBO executives; Zaslav praised Bloys' performance as chief content officer. Zaslav stated that a \"10-year plan\" was in development for DC Films, modeled after those of Marvel Studios, while Perrette stated that the planned merger of Discovery+ and HBO Max would occur by summer 2023 in the United States, followed by other markets. HBO subsequently reorganized on August 15 to dismantle most of HBO Max's autonomous units. HBO Max's head of comedy Suzanna Makkos began reporting to HBO's head of comedy Amy Gravitt. Layoffs hit HBO Max's non-scripted, live-action family entertainment, international originals, and casting units, as well as HBO's acquisitions unit. HBO Max also continued to remove and cancel some of its lesser-viewed original programming, particularly family-oriented and animated series. On August 15, 2022, Nexstar confirmed in June that it would buy a controlling 75% interest in The CW; WBD and Paramount would each retain a 12.5% ownership interest. Nexstar stated that Mark Pedowitz would remain its chairman and CEO. WBD and Paramount would remain The network's main content suppliers, but Nexstar stated that the arrangement would be for the 2022–23 broadcast season, and it retained the option to extend the partnership. As the transaction did not require regulatory approval (unlike the \"Big Four\" networks, The CW does not own stations), Nexstar immediately took over the network's operations. In September 2022, WBD became the subject of a proposed class-action lawsuit by one of its shareholders, alleging that WarnerMedia was overinvesting in streaming content \"without sufficient concern for return on investments\", and had overstated the number of HBO Max subscribers by at least 10 million by counting inactivated subscriptions bundled with AT&T services—thus misleading investors in violation of the Securities Act. It also alleged that Discovery executives failed to warn investors that WarnerMedia's prospectus contained misleading statements. On September 28 during a company town hall, Zaslav addressed speculation that WBD was pursuing a possible sale as early as 2024, stating that they were \"absolutely not for sale\", and \"have everything we need to be successful\". On October 11, Warner Bros. Television Group laid off 82 employees and eliminated 43 vacant positions as part of a restructuring that primarily impacted their unscripted and animation units. The restructuring saw the consolidation of Warner Horizon and Telepictures' creative operations, and the consolidation of Cartoon Network Studios' and Warner Bros. Animation's development and production teams (with the two studios retaining separate labels with distinct output). On October 3, 2022, Nexstar closed its deal to acquire a controlling interest in The CW. Mark Pedowitz resigned from his position as the network's chairman and CEO, replaced by Dennis Miller as president. Later that month, it was announced that filmmaker James Gunn and producer Peter Safran would serve as co-CEOs and co-chairs of DC Films which rebranded as DC Studios. The duo signed a four-year deal to oversee film, television, and animation production for DC. The pair reported directly to Zaslav, while working independently with other members of the studio. Gunn would oversee creative development on DC projects, while Safran took the business aspect. An earnings report in November 2022, announced that the launch of WBD's streaming service had been moved up to spring 2023. Max was unveiled April 12, 2023. In December 2022, CNN announced cutbacks and a reorganization to prioritize its \"core\" operations, resulting in sister channel HLN being brought under the auspices of Investigation Discovery and abandoning its remaining original live news programming. Declining turnover, cutbacks and restructuring (2023–2025) In January 2023, WBD announced licensing agreements with free ad-supported streaming television (FAST) services The Roku Channel and Fox Corporation's Tubi, featuring library content from Discovery, TLC, HGTV, Food Network, Warner Bros. Pictures, Warner Bros. Television, and HBO (including series that were pulled from HBO Max). On February 8, 2023, The Wall Street Journal reported that WBD had amended its plans to merge Discovery+ with HBO Max, with HBO Max's successor slated to include \"most\" Discovery content, and Discovery+ remaining operational to retain its subscriber base, and provide an alternative option for customers not interested in the higher-priced unified service. On February 24, WBD CEO David Zaslav confirmed the change of plans, saying that Discovery+ has \"profitable subscribers that are very happy with the product offering\". In early-June, Licht was fired from CNN. On June 20 WBD underwent a round of layoffs affecting around 100 employees in the U.S. Networks division, most notably including multiple Turner Classic Movies (TCM) executives such as Pola Changnon (who had been with Turner for over 25 years). WBD announced plans to place the channel under Cartoon Network head Michael Ouweleen. It was also reported that WBD was preparing a deal to sell half of the published music catalog of Warner Bros. Entertainment (which films and television scores, and is administered by Universal Music Publishing Group) for around $500 million. Amid concerns over the future of TCM, Martin Scorsese, Steven Spielberg, and Paul Thomas Anderson met with Zaslav, and on June 23 the company announced that the channel would move under Warner Bros. Pictures Group heads Michael De Luca and Pamela Abdy—who both affirmed the cultural significance of TCM and pledged to keep its programming \"untouched and protected\". In December 2023, WBD announced the purchase of Turkish streaming platform BluTV, with operations in the MENA region. On February 16, 2024, RedBird Capital Partners (via its United Arab Emirates-backed partnership RedBird IMI) announced its intent to acquire All3Media—a WBD joint venture with Liberty Global—for £1.15 billion. The acquisition was completed on May 16, 2024. In April 2024, Warner Bros. Discovery New Zealand announced that it would shut down Newshub (which produced bulletins for its free-to-air channel Three) in July 2024, citing declining local advertising revenue. Newshub was supplanted by a partnership with local media company Stuff, which launched an evening newscast under the ThreeNews banner. In July 2024, CNN CEO Mark Thompson announced 100 layoffs. A week later, additional WBD employees at Max and in production, business affairs, and finance were also let go. On July 24, the NBA announced new media rights agreements with Disney (ESPN and ABC), NBCUniversal (NBC and Peacock), and Amazon Prime Video beginning in the 2025–26 season, ending a nearly 36-year association between the NBA and TNT. WBD had attempted to invoke a condition in its contract allowing it to match offers made by competitors (targeting the package sold to Amazon), but the league argued that it did not sufficiently match Amazon's offer. WBD threatened legal action, claiming that the NBA had \"grossly misinterpreted our contractual rights\". In August, WBD reported that it had lost $10 billion in the second quarter of 2024, relating to continued losses from its direct-to-consumer segment and the devaluation of its linear television assets. In November WBD agreed to a settlement with the NBA. The settlement included access to NBA highlights at no additional cost for Bleacher Report and House of Highlights and allowed WBD, under its TNT Sports division, to continue operating NBA TV and NBA.com. The agreement included live game rights for select international territories in Nordic Europe and South America. In a separate agreement with Disney, WBD agreed to a deal to move Inside the NBA to ESPN and ABC (TNT Sports continuing to produce the program), in exchange for ESPN sublicensing Big 12 college football and basketball games to TNT Sports. On March 24, 2025, WBD announced that it would buy a 30% minority stake in Dubai-based OSN Streaming Limited for $57 million. In mid July 2025, WBD confirmed it would sell its New Zealand assets including the Three TV channel and ThreeNow streaming service to the New Zealand media company Sky Network Television, effective August 1, 2025. Split and proposed sale (2025–present) On July 18, 2024, Financial Times reported that Zaslav and WBD executives had been discussing the possibility of breaking up the company, to insulate unprofitable linear television networks from more profitable studio and direct-to-consumer businesses. On December 12 WBD announced plans to reorganize. These businesses would be reorganized into two units: Streaming & Studios would include Warner Bros., HBO, and Max, and Global Linear Networks. Zaslav stated that the new structure would enable greater flexibility and \"potential future strategic opportunities\". On May 8 CNBC's David Faber reported that WBD was \"moving towards\" the possibility of divesting its Global Linear Networks division as an independent company, following NBCUniversal's plan to spin off most of its cable networks as a new public company controlled by Comcast shareholders known as Versant. Plans were officially announced on June 9, 2025. WBD announced on July 28 that the two companies would be known as Warner Bros. and Discovery Global respectively. Warner Bros. will include the Warner Bros. film, television, and video game studios, DC Studios, DC Entertainment, Cartoon Network Studios, HBO and HBO Max, and TCM. Discovery Global will be led by current WBD CFO Gunnar Wiedenfels, and include assets such as WBD's linear television brands and Discovery+ and its library would remain with Warner Bros. Television Group, while Warner Bros. International Television Production will go to Discovery Global. Sports rights would be divided between the two companies. TNT Sports' US assets would go to Discovery Global, and TNT Sports in the United Kingdom and Ireland to Warner Bros. The transactions were expected to complete in mid-2026; the split is structured to be tax-free; Discovery Global will assume Warner Bros.' debt. On September 10, 2025, Zaslav stated that the split was on track for completion by April 2026. Part of the split included that Warner Bros. Corporation would move their global headquarters from New York City to Burbank. On September 11, 2025, The Wall Street Journal reported that David Ellison's Paramount Skydance (owner of several networks previously held by Warner such as MTV, Nickelodeon, The Movie Channel, VH1, Comedy Central and BET; Paramount and Warner both hold stakes at The CW) was exploring a bid to acquire the entirety of Warner Bros. Discovery; the company had been formed via the acquisition of Paramount Global by Skydance Media. Such an acquisition would integrate overlapping assets between the two companies, including two of the five major film studios (Warner Bros. and Paramount Pictures), streaming services HBO Max and Paramount+, TNT Sports and CBS Sports (which collaborated on properties such as the NCAA men's basketball tournament), and CNN and CBS News. WBD's share prices increased by 33% following the reports. Robert Fishman of MoffettNathanson believed that Paramount Skydance was pursuing a strategy of consolidating streaming and studio businesses to take advantage of \"a period of industry-wide instability\", and that preempting the split by bidding for the entirety of WBD would prevent competitors from cherry-picking the \"attractive\" assets of the post-split Warner Bros. company. While such an acquisition would not be subject to FCC scrutiny, unlike the Paramount acquisition, the sale has faced the possibility of antitrust issues due to its horizontal integration of two legacy media conglomerates and film studios; such a merger would resemble the bigger Disney acquisition of 21st Century Fox in 2019. Senator Elizabeth Warren criticized the prospective deal as a \"dangerous concentration of power\". On September 19, Faber reported that Paramount Skydance's bid could be an all-cash offer of approximately $22 to 24 per-share. The previous day, Puck had reported that Netflix was exploring a potential bid. On October 2, CNBC speculated that Comcast could be the biggest wild card for the acquisition of Warner Bros. Discovery's assets. However, they questioned whether it would make sense for Comcast to counter Paramount Skydance's bid, as Comcast was in the process of pushing its own cable assets into Versant. Comcast would also face more regulatory hurdles than Paramount Skydance, due to its contentious relationship with president Donald Trump. On October 8 the New York Post reported that Paramount Skydance was in talks with private equity firms, including Apollo Global Management (the company that owns Legendary Entertainment and Cox Media Group) to join its WBD bid, which could cost upwards of $60 billion. The next day, David Ellison was questioned about the bid in an interview, and while not directly addressing it, Ellison didn't deny it was happening. On October 11, Bloomberg News reported that WBD had rejected Paramount Skydance's proposed offer of $20-a-share.According to reports, Zaslav wants around $30-a-share, and believes that he could unlock greater value by selling Warner Bros. once it splits from Discovery in 2026, given the likelihood that Warner Bros. could spark a bidding war. In an October 14 interview, Apple's Eddy Cue dismissed speculation that his company was interested in acquiring Warner Bros. Earlier on October 8, 2025, Netflix co-CEO Greg Peters similarly indicated that a bid from his company was unlikely. He said, \"we come from a deep heritage of being builders rather than buyers\". In October, Paramount Skydance reportedly made three failed bids, at $19, $22 and $23.50 per share. On October 21, WBD announced that they had begun to review several \"unsolicited\" offers. On October 27, Bloomberg News reported that if a Paramount Skydance deal was successful, Ellison would retain WBD's creative teams and most of its assets, including the cable networks. Previous speculation that he was planning to immediately divest WBD's cable networks, along with Paramount Skydance's own cable networks was not supported. Bloomberg also reported that Ellison intended to merge HBO Max with Paramount+. Ellison suggested that Zaslav might retain his position as co-CEO and that he would be personally compensated with $500 million upon accepting the offer of sale. On October 31, Netflix was reported to be actively exploring a bid for WBD's studio and streaming assets. The acquisition would give Netflix control over IP such as the Harry Potter and DC Comics franchises, along with HBO’s premium dramas. Netflix stressed that it remains “predominantly focused on growing organically” and is not interested in owning legacy cable networks such as CNN and TNT. On November 6, 2025, it was reported that Comcast contracted Goldman Sachs and Morgan Stanley about a possible takeover of WBD's studio and streaming assets. On November 20, Paramount Skydance, Netflix, and Comcast each officially submitted their bids. According to CNBC, David Zaslav will announce whether to split the company in two or sell off the whole company to one of the potential buyers before the end of the year. Assets Warner Bros. Discovery includes two primary business divisions: Warner Bros. includes assets including Warner Bros. Entertainment and its units, Warner Bros. Theatre Ventures, Warner Bros. Discovery Home Entertainment, Turner Entertainment Co., The Wolper Organization, WaterTower Music and Warner Bros. Studio Operations. Warner Bros. Motion Picture Group includes the company's filmed entertainment and theatrical entertainment businesses, including Warner Bros. Pictures, New Line Cinema, Warner Bros. Pictures Animation and Castle Rock Entertainment. The division is led by Michael De Luca and Pamela Abdy. Warner Bros. Television Group includes domestic and international network of television production companies, including the flagship Warner Bros. Television label, Telepictures, Alloy Entertainment, Warner Bros. Animation, Cartoon Network Studios, Williams Street and Warner Horizon Unscripted Television. The division also holds 12.5% of The CW along with the CBS Entertainment Group unit of Paramount Skydance Corporation and Turner Classic Movies. The division is led by Channing Dungey. Warner Bros. Discovery Streaming manages the company's direct-to-consumer platforms, online brands and gaming businesses, including HBO Max, Warner Bros. Games, and the now-defunct digital media company Rooster Teeth. It also houses Home Box Office, Inc., the parent company of HBO and Cinemax. Warner Bros. Discovery Global Experiences manages Warner Bros. theme parks and studio tours. Additional business segments include divisions responsible for Global Content Distribution (Warner Bros. Worldwide Television Distribution), and Advertising Sales. DC Entertainment oversees DC Comics and Mad. It works with other WBD units and delves into those units within their flagship DC Universe franchise. DC Studios oversees DC Comics and is the film and series production sites of WBD for DC media in the new film and series franchise DC Universe. The division is led by James Gunn and Peter Safran. Discovery Global includes the company's linear cable networks, including Discovery+, Discovery Channel, TLC, Animal Planet, Oprah Winfrey Network, Investigation Discovery, Food Network and Cooking Channel, HGTV, TBS, TNT, TruTV, Cartoon Network/Adult Swim/Cartoonito, and Boomerang. The division is also led by Channing Dungey. CNN Worldwide operates CNN and other news assets owned by Warner Bros. Discovery, including various international CNN branches and HLN. The division is led by Mark Thompson. TNT Sports is the brand name used for sports-related divisions. The American division manages the company's domestic broadcast sports businesses, including MLB Network, formerly NBA TV, and the sports media website Bleacher Report and previously AT&T SportsNet until it shut down in 2023, while the European division handles international sports operations, including Eurosport and TNT Sports UK, and Warner Bros. Discovery Sports Latin America which owns the sports channel TNT Sports LATAM which replaces Esporte Interativo. Both divisions are led by Luis Silberwasser. Warner Bros. Discovery International focuses on local and regional variations that pipelined with global market through operations for its domestic television channels, including region-specific operations such as TVN Group in Poland, as well as the distribution of linear networks from CNN Worldwide and TNT Sports, including Eurosport. The division is led by Gerhard Zeiler. It is split into four regional hubs: Warner Bros. Discovery Asia-Pacific, Warner Bros. Discovery EMEA, TVN Warner Bros. Discovery (Poland), and Warner Bros. Discovery Americas. Leadership"
}