{
  "ticker": "WDAY",
  "cik": "0001327811",
  "company_name": "Workday, Inc.",
  "corrected_name": "Workday, Inc.",
  "wiki_title_used": "Workday, Inc.",
  "exists": true,
  "raw_text": "Workday, Inc., is an American on‑demand (cloud-based) financial management, human capital management, and student information system software vendor. Workday was founded by David Duffield, founder and former CEO of ERP company PeopleSoft, along with former PeopleSoft chief strategist Aneel Bhusri, following Oracle's acquisition of PeopleSoft in 2005.\nIn October 2012, Workday launched a successful initial public offering that valued the company at $9.5 billion. Competitors of Workday include SAP Successfactors, Dayforce, UKG, and Oracle.\nIn 2020, Fortune magazine ranked Workday Inc. at number five on their Fortune List of the Top 100 Companies to Work For in 2020 based on an employee satisfaction survey.\n\nHistory\n2005–2015\nWorkday was founded in March 2005 and launched in November 2006. Initially, it was funded by David Duffield and the venture capital firm Greylock Partners. In December 2008, Workday moved its headquarters from Walnut Creek, California to Pleasanton, California, where PeopleSoft founder Duffield's prior company was located.\nOn February 6, 2008, Workday announced that it had reached a definitive agreement to purchase Cape Clear Software. In May 2008, Workday signed a large contract with Flextronics to provide human capital management software services. Companies that have publicly disclosed contracts or deployments of Workday include Aviva, Chiquita Brands, and other firms.\nOn April 29, 2009, Workday announced that it had secured $75 million in funding led by New Enterprise Associates. Existing investors Greylock Partners and Workday CEO and co‑founder Dave Duffield also participated in the round. On October 24, 2011, Workday announced $85 million in new funding, bringing the total capital raised to $250 million. Investors in the latest round included T. Rowe Price, Morgan Stanley Investment Management, Janus, and Bezos Expeditions. As of spring 2012, Workday had 310 customers, ranging from mid-sized businesses to Fortune 500 companies.\nIn October 2012, Workday launched its initial public offering (IPO) on the New York Stock Exchange with ticker symbol WDAY. Its shares were priced at $28 and ended trading Friday, October 12, at $48.69, which \"propelled the start-up to a market capitalization of nearly $9.5 billion including unexercised stock options.\" It sold 22.75 million Class A shares, raising $637 million. The IPO raised more cash than any launch in the U.S. technology sector since Facebook's $16 billion IPO in May 2012. Its shares surged 74% in their IPO, underscoring investor interest in cloud computing.\n\n2015–present\nIn 2016, Workday launched a cloud-based student information system to augment its portfolio of financial management and human capital management products. In 2018, Workday acquired Filip Doušek's company Stories.bi.\nThe CEO of Workday was Aneel Bhusri, who is a partner with Greylock Partners and handled senior leadership positions earlier in his career at PeopleSoft. In 2020, Chano Fernandez was promoted to co-CEO along with Bhusri. Dave Duffield served as the chairman of the board until his resignation in April 2022, after which Aneel Bhusri took over as the chairman.\nIn November 2021, Workday announced its acquisition of VNDLY, a startup that helps companies manage external workforce personnel, for $510 million.\nSequoia Capital's Carl Eschenbach replaced Fernandez as co-CEO in December 2022. The company also announced that Eschenbach would become its sole CEO after March 2024, when Bhusri will move to the role of executive chair. Eschenbach is now the company's sole CEO.\nIt was announced in February 2025 that Workday would cut 8.5% of its workforce in favor of investing in artificial intelligence to counter a \"softer macroeconomic environment\". In the same year, the company acquired Paradox, which enables the implementation of a conversational AI agent.\n\nAdaptive Insights\nAdaptive Insights was a software as a service company founded in 2003 and headquartered in Palo Alto, California. The company was acquired by Workday in a $1.55 billion deal completed in August 2018, renaming the company and its core product to Workday Adaptive Planning.\nIn 2003, Robert S. Hull and Richard L. Dellinger co-founded Adaptive Planning to market enterprise budgeting, forecasting, and reporting software as an alternative to spreadsheet-based planning or larger on-premises software. Adaptive Planning was an early user of the software as a service (SaaS) model for business intelligence and corporate performance management. In 2003, it was incorporated in Delaware as Visus Technology, renamed as Adaptive Planning. It was incubated at Onset Ventures in Menlo Park, California. \nIn 2009, Adaptive Insights partnered with NetSuite, Inc. and is currently a member of the SuiteCloud Developer Network. The company also integrates with other cloud ERP solutions from Sage Intacct, Microsoft, and others. Adaptive Insights partners with associates in Australia, Canada, Europe, India, Japan, New Zealand, the UK and the United States.\nIn September 2012, the company acquired the Louisville, Colorado based company myDIALS for an undisclosed amount. By October 2013, Adaptive Planning held a fourth round of fundraising, totaling $45 million. The company also added salesforce.com as a backer.\nIn February 2014, Adaptive Planning was renamed Adaptive Insights and released a new version of the software with an updated user interface. \nIn January 2015, the company appointed Citrix chairman Tom Bogan as CEO. In June, the company reported another investment round of $75 million with several investors, including Norwest Venture Partners, ONSET Ventures, Bessemer Venture Partners, Cardinal Venture Capital, Information Venture Partners, and others.\nIn April 2018, the company announced it added 500 net new customers in 2018, bringing Adaptive Insights' total customer base to more than 3,700 customers worldwide in FY2018. In August, Workday completed the acquisition of Adaptive Insights, announcing that the company would operate as Adaptive Insights, a Workday company. In May 2020, Adaptive Insights rebranded once again and was renamed Workday Adaptive Planning.\n\nLawsuit over hiring algorithm bias\nIn 2023, Workday was named in a federal class-action lawsuit alleging that its artificial intelligence (AI)-driven hiring tools discriminated against applicants based on age, race, and disability. The lead plaintiff, Derek Mobley, claimed that Workday’s résumé screening algorithms systematically excluded older candidates and individuals with disabilities from consideration. Workday denied the allegations, stating that its systems were not designed to consider protected characteristics directly, but critics argued that bias emerged through proxy variables in the data.\nIn May 2025, a U.S. District Court judge allowed the age discrimination claims under the Age Discrimination in Employment Act (ADEA) to proceed as a collective action. Subsequent rulings required Workday to disclose the list of clients that used its AI hiring features. Legal analysts noted that the case could set a significant precedent for whether software vendors can be held liable under U.S. employment discrimination law when their algorithms are used in hiring at scale.\n\nBusiness model\nWorkday sells subscriptions to its services. Expenses are booked up front when it signs on a new customer, but the associated revenue is recognized over the life of multiyear agreements. In the first quarter of 2016, Workday announced annual revenue in excess of $1 billion for the first time in fiscal year 2016.\n\nCorporate governance\nDuffield holds voting rights to Workday shares that are worth $3.4 billion and Bhusri holds voting rights to shares valued at $1.3 billion. Collectively, they hold 67% of the company's voting shares. This voting structure makes the event of a hostile takeover much less likely.\n\nProduct\nWorkday provides software to help businesses manage finances and human resources. Key features include:\n\nGlobal workforce and recruitment management with real-time reporting and analytics.\nFinancial management capabilities, including accounting tools, expense tracking, and financial planning insights.\nEmployee self-service, such as with onboarding and time-tracking tasks.\nIn February 2014, Workday acquired the startup Identified and its artificial intelligence Syman to create its Insight Apps line of products. The first products running SYMAN were announced at Workday Rising 2014.\nIn July 2017, Workday CEO Aneel Bhusri announced that the company had decided to open up its platform to developers, partners, and third-party software. As a result, Workday will enter the Platform as a Service (PaaS) market. Bhusri said the move will allow customers to build custom extensions and applications to work with Workday.\nIn January 2018, Workday announced that it acquired SkipFlag, makers of an AI knowledge base that builds itself from a company's internal communications.\nWorkday has released 39 updates to its product line as of September 2022, the most recent being \"2022 R2\". It releases a major update every 6 months, in September and March.\nWorkday operates data centers located in Ashburn, Virginia; Lithia Springs, Georgia; Portland, Oregon; Dublin, Ireland; Amsterdam, Netherlands; and also uses Amazon Web Services for its primary computing infrastructure platforms to accelerate its worldwide expansion.\n\nWorkday Adaptive Planning\nThe Workday Adaptive Planning application is a cloud-based software app designed to help organizations with financial planning, budgeting, forecasting, and reporting. It is a part of the broader Workday suite of enterprise applications, which includes solutions for human resources, finance, sales, operations, and HR in their planning processes. The app covers the planning, consolidation, analytics, and reporting functions with its Business Planning Cloud. It automates consolidations and integration of data from other systems and enables collaboration and real-time updates via its on-demand SaaS-based model.\n\nAcquisitions\nSponsorship\nIn May 2021, Workday signed a sponsorship deal with Formula One as the regional finance & human resource enterprise partner across the UK and Germany. The deal was renewed and expanded in 2022, where Workday will be a regional partner of Formula One in a multiyear deal.\nIn March 2023, Workday signed a multiyear sponsorship deal with McLaren as an official partner.\n\nSee also\nCloud computing\nCorporate performance management\n\nReferences\nExternal links\nOfficial website\nBusiness data for Workday, Inc.:",
  "clean_text": "Workday, Inc., is an American on‑demand (cloud-based) financial management, human capital management, and student information system software vendor. Workday was founded by David Duffield, founder and former CEO of ERP company PeopleSoft, along with former PeopleSoft chief strategist Aneel Bhusri, following Oracle's acquisition of PeopleSoft in 2005. In October 2012, Workday launched a successful initial public offering that valued the company at $9.5 billion. Competitors of Workday include SAP Successfactors, Dayforce, UKG, and Oracle. In 2020, Fortune magazine ranked Workday Inc. at number five on their Fortune List of the Top 100 Companies to Work For in 2020 based on an employee satisfaction survey. History 2005–2015 Workday was founded in March 2005 and launched in November 2006. Initially, it was funded by David Duffield and the venture capital firm Greylock Partners. In December 2008, Workday moved its headquarters from Walnut Creek, California to Pleasanton, California, where PeopleSoft founder Duffield's prior company was located. On February 6, 2008, Workday announced that it had reached a definitive agreement to purchase Cape Clear Software. In May 2008, Workday signed a large contract with Flextronics to provide human capital management software services. Companies that have publicly disclosed contracts or deployments of Workday include Aviva, Chiquita Brands, and other firms. On April 29, 2009, Workday announced that it had secured $75 million in funding led by New Enterprise Associates. Existing investors Greylock Partners and Workday CEO and co‑founder Dave Duffield also participated in the round. On October 24, 2011, Workday announced $85 million in new funding, bringing the total capital raised to $250 million. Investors in the latest round included T. Rowe Price, Morgan Stanley Investment Management, Janus, and Bezos Expeditions. As of spring 2012, Workday had 310 customers, ranging from mid-sized businesses to Fortune 500 companies. In October 2012, Workday launched its initial public offering (IPO) on the New York Stock Exchange with ticker symbol WDAY. Its shares were priced at $28 and ended trading Friday, October 12, at $48.69, which \"propelled the start-up to a market capitalization of nearly $9.5 billion including unexercised stock options.\" It sold 22.75 million Class A shares, raising $637 million. The IPO raised more cash than any launch in the U.S. technology sector since Facebook's $16 billion IPO in May 2012. Its shares surged 74% in their IPO, underscoring investor interest in cloud computing. 2015–present In 2016, Workday launched a cloud-based student information system to augment its portfolio of financial management and human capital management products. In 2018, Workday acquired Filip Doušek's company Stories.bi. The CEO of Workday was Aneel Bhusri, who is a partner with Greylock Partners and handled senior leadership positions earlier in his career at PeopleSoft. In 2020, Chano Fernandez was promoted to co-CEO along with Bhusri. Dave Duffield served as the chairman of the board until his resignation in April 2022, after which Aneel Bhusri took over as the chairman. In November 2021, Workday announced its acquisition of VNDLY, a startup that helps companies manage external workforce personnel, for $510 million. Sequoia Capital's Carl Eschenbach replaced Fernandez as co-CEO in December 2022. The company also announced that Eschenbach would become its sole CEO after March 2024, when Bhusri will move to the role of executive chair. Eschenbach is now the company's sole CEO. It was announced in February 2025 that Workday would cut 8.5% of its workforce in favor of investing in artificial intelligence to counter a \"softer macroeconomic environment\". In the same year, the company acquired Paradox, which enables the implementation of a conversational AI agent. Adaptive Insights Adaptive Insights was a software as a service company founded in 2003 and headquartered in Palo Alto, California. The company was acquired by Workday in a $1.55 billion deal completed in August 2018, renaming the company and its core product to Workday Adaptive Planning. In 2003, Robert S. Hull and Richard L. Dellinger co-founded Adaptive Planning to market enterprise budgeting, forecasting, and reporting software as an alternative to spreadsheet-based planning or larger on-premises software. Adaptive Planning was an early user of the software as a service (SaaS) model for business intelligence and corporate performance management. In 2003, it was incorporated in Delaware as Visus Technology, renamed as Adaptive Planning. It was incubated at Onset Ventures in Menlo Park, California. In 2009, Adaptive Insights partnered with NetSuite, Inc. and is currently a member of the SuiteCloud Developer Network. The company also integrates with other cloud ERP solutions from Sage Intacct, Microsoft, and others. Adaptive Insights partners with associates in Australia, Canada, Europe, India, Japan, New Zealand, the UK and the United States. In September 2012, the company acquired the Louisville, Colorado based company myDIALS for an undisclosed amount. By October 2013, Adaptive Planning held a fourth round of fundraising, totaling $45 million. The company also added salesforce.com as a backer. In February 2014, Adaptive Planning was renamed Adaptive Insights and released a new version of the software with an updated user interface. In January 2015, the company appointed Citrix chairman Tom Bogan as CEO. In June, the company reported another investment round of $75 million with several investors, including Norwest Venture Partners, ONSET Ventures, Bessemer Venture Partners, Cardinal Venture Capital, Information Venture Partners, and others. In April 2018, the company announced it added 500 net new customers in 2018, bringing Adaptive Insights' total customer base to more than 3,700 customers worldwide in FY2018. In August, Workday completed the acquisition of Adaptive Insights, announcing that the company would operate as Adaptive Insights, a Workday company. In May 2020, Adaptive Insights rebranded once again and was renamed Workday Adaptive Planning. Lawsuit over hiring algorithm bias In 2023, Workday was named in a federal class-action lawsuit alleging that its artificial intelligence (AI)-driven hiring tools discriminated against applicants based on age, race, and disability. The lead plaintiff, Derek Mobley, claimed that Workday’s résumé screening algorithms systematically excluded older candidates and individuals with disabilities from consideration. Workday denied the allegations, stating that its systems were not designed to consider protected characteristics directly, but critics argued that bias emerged through proxy variables in the data. In May 2025, a U.S. District Court judge allowed the age discrimination claims under the Age Discrimination in Employment Act (ADEA) to proceed as a collective action. Subsequent rulings required Workday to disclose the list of clients that used its AI hiring features. Legal analysts noted that the case could set a significant precedent for whether software vendors can be held liable under U.S. employment discrimination law when their algorithms are used in hiring at scale. Business model Workday sells subscriptions to its services. Expenses are booked up front when it signs on a new customer, but the associated revenue is recognized over the life of multiyear agreements. In the first quarter of 2016, Workday announced annual revenue in excess of $1 billion for the first time in fiscal year 2016. Corporate governance Duffield holds voting rights to Workday shares that are worth $3.4 billion and Bhusri holds voting rights to shares valued at $1.3 billion. Collectively, they hold 67% of the company's voting shares. This voting structure makes the event of a hostile takeover much less likely. Product Workday provides software to help businesses manage finances and human resources. Key features include: Global workforce and recruitment management with real-time reporting and analytics. Financial management capabilities, including accounting tools, expense tracking, and financial planning insights. Employee self-service, such as with onboarding and time-tracking tasks. In February 2014, Workday acquired the startup Identified and its artificial intelligence Syman to create its Insight Apps line of products. The first products running SYMAN were announced at Workday Rising 2014. In July 2017, Workday CEO Aneel Bhusri announced that the company had decided to open up its platform to developers, partners, and third-party software. As a result, Workday will enter the Platform as a Service (PaaS) market. Bhusri said the move will allow customers to build custom extensions and applications to work with Workday. In January 2018, Workday announced that it acquired SkipFlag, makers of an AI knowledge base that builds itself from a company's internal communications. Workday has released 39 updates to its product line as of September 2022, the most recent being \"2022 R2\". It releases a major update every 6 months, in September and March. Workday operates data centers located in Ashburn, Virginia; Lithia Springs, Georgia; Portland, Oregon; Dublin, Ireland; Amsterdam, Netherlands; and also uses Amazon Web Services for its primary computing infrastructure platforms to accelerate its worldwide expansion. Workday Adaptive Planning The Workday Adaptive Planning application is a cloud-based software app designed to help organizations with financial planning, budgeting, forecasting, and reporting. It is a part of the broader Workday suite of enterprise applications, which includes solutions for human resources, finance, sales, operations, and HR in their planning processes. The app covers the planning, consolidation, analytics, and reporting functions with its Business Planning Cloud. It automates consolidations and integration of data from other systems and enables collaboration and real-time updates via its on-demand SaaS-based model. Acquisitions Sponsorship In May 2021, Workday signed a sponsorship deal with Formula One as the regional finance & human resource enterprise partner across the UK and Germany. The deal was renewed and expanded in 2022, where Workday will be a regional partner of Formula One in a multiyear deal. In March 2023, Workday signed a multiyear sponsorship deal with McLaren as an official partner."
}