{
  "ticker": "WDC",
  "cik": "0000106040",
  "company_name": "Western Digital",
  "corrected_name": "Western Digital",
  "wiki_title_used": "Western Digital",
  "exists": true,
  "raw_text": "Western Digital Corporation is an American data storage company headquartered in San Jose, California. Established in 1970, the company is one of the world's largest manufacturers of hard disk drives (HDDs).\n\nHistory\n1970s\nWestern Digital was founded on April 23, 1970, by Alvin B. Phillips, a Motorola employee, as General Digital Corporation, initially a manufacturer of MOS test equipment. It was originally based in Newport Beach, California, shortly thereafter moving to Santa Ana, California, and would go on to become one of the largest technology firms headquartered in Orange County.  It rapidly became a specialty semiconductor maker, with start-up capital provided by several individual investors and industrial giant Emerson Electric. Around July 1971, it adopted its current name and soon introduced its first product, the WD1402A UART.\nDuring the early 1970s, the company focused on making and selling calculator chips, and by 1975, Western Digital was the largest independent calculator chip maker in the world. The oil crisis of the mid-1970s and the bankruptcy of its biggest calculator customer, Bowmar Instrument, changed its fortunes, however, and in 1976 Western Digital declared Chapter 11 bankruptcy. After this, Emerson Electric withdrew their support of the company. Chuck Missler joined Western Digital as chairman and chief executive in June 1977, and became the largest shareholder of Western Digital.\nIn 1973, Western Digital established its Malaysian plant, initially to manufacture semiconductors.\nWestern Digital introduced several products during the late 1970s, including the MCP-1600 multi-chip, microcoded CPU. The MCP-1600 was used to implement DEC's LSI-11 system, the WD16, and their own Pascal MicroEngine microcomputer which ran the UCSD p-System Version III and UCSD Pascal. However, the WD integrated circuit that arguably drove Western's forward integration was the FD1771, one of the first single-chip floppy disk drive formatter/controllers, which could replace significant amounts of TTL logic.\n\n1980s\nThe FD1771 and its kin were Western Digital's first entry into the data storage industry; by the early 1980s, they were making hard disk drive controllers, and in 1983, they won the contract to provide IBM with controllers for the PC/AT. That controller, the WD1003, became the basis of the ATA interface (which Western Digital developed along with Compaq and Control Data Corporation's MPI division, now owned by Seagate Technology), starting in 1986. Throughout most of the 1980s, the family of controllers based on the WD1003 provided the bulk of Western Digital's revenues and profits, and for a time generated enormous corporate growth.\n\nMuch of the mid-to-late 1980s saw an effort by Western Digital to use the profits from their ATA storage controllers to become a general-purpose OEM hardware supplier for the PC industry. As a result, Western Digital purchased a number of hardware companies. These included graphics cards (through its Paradise Systems subsidiary, purchased 1986, which later became Western Digital Imaging), core logic chipsets (by purchasing Faraday Electronics in 1987), SCSI controller chips for disk and tape devices (by purchasing ADSI in 1986), networking (WD8003, WD8013 Ethernet and WD8003S StarLAN). They did well (especially Paradise, which produced one of the best VGA cards of the era), but storage-related chips and disk controllers were their biggest money makers. In 1986, they introduced the WD33C93 single-chip SCSI interface, which was used in the first 16-bit bus mastering SCSI host adapter, the WD7000 \"FASST\"; in 1987 they introduced the WD37C65, a single-chip implementation of the PC/AT's floppy disk controller circuitry, and the grandfather of modern super I/O chips; in 1988 they introduced the WD42C22 \"Vanilla\", the first single-chip ATA hard disk controller.\n1988 also brought what would be the biggest change in Western Digital's history. That year, Western Digital bought the hard drive production assets of PC hardware maker Tandon; the first products of that union under Western Digital's own name were the \"Centaur\" series of ATA and XT attachment drives.\n\n1990s\nBy 1991, things were starting to slow down, as the PC industry moved from ST-506 and ESDI drives to ATA and SCSI, and thus were buying fewer hard disk controller boards. That year saw the rise of Western Digital's Caviar drives, brand new designs that used the latest in embedded servo and computerized diagnostic systems.\nEventually, the successful sales of the Caviar drives resulted in Western Digital starting to sell some of its divisions. Paradise was sold to Philips, and since disappeared. Its networking and floppy drive controller divisions went to SMC Networks and its SCSI chip business went to Future Domain, which was later bought out by market leader Adaptec. Around 1995, the technological lead that the Caviar drives had enjoyed was eclipsed by newer offerings from other companies, especially Quantum Corp., and Western Digital fell into a slump.\nIn 1994, Western Digital began producing hard drives at its Malaysian factory, employing 13,000 people.\nProducts and ideas of this time did not go far. The Portfolio drive (a 3-inch (76 mm) form factor model, developed with JT Storage) was a flop, as was the SDX hard disk to CD-ROM interface. Western Digital's drives started to slip further behind competing products, and quality began to suffer; system builders and PC enthusiasts who used to recommend Western Digital above all else, were going to the competition, particularly Maxtor, whose products had improved significantly by the late 1990s.\nIn an attempt to turn the tide in 1998, Western Digital recruited the help of IBM. This agreement gave Western Digital the rights to use certain IBM technologies, including giant magneto-resistive (GMR) heads and access to IBM production facilities. The result was the Expert line of drives, introduced in early 1999. The idea worked, and Western Digital regained respect in the press and among users, even despite a recall in 2000 (which was due to bad motor driver chips). Western Digital later broke ties with IBM.\n\n2000s\nIn 2001, Western Digital became the first manufacturer to offer mainstream ATA hard disk drives with 8 MiB of disk buffer. At that time, most desktop hard disk drives had 2 MB of buffer. Western Digital labeled these 8 MB models as \"Special Edition\" and distinguished them with the JB code (the 2 MB models had the BB code). The first 8 MB cache drive was the 100 GB WD1000JB, followed by other models starting with 40 GB capacity. Western Digital advertised the JB models for cost-effective file servers. In October 2001, Western Digital restated its prior year results to reflect the adoption of SEC Staff Accounting Bulletin No.101 and the reclassification of Connex and SANavigator results as discontinued operations.\nIn 2003, Western Digital acquired most of the assets of bankrupt one-time market leading magnetic hard drive read-write head developer Read-Rite Corporation for $95 million. In the same year, Western Digital offered the first 10,000 rpm Serial ATA HDD, the WD360GD \"Raptor\", with a capacity of 36 GB and an average access time of less than six milliseconds. Soon, the 74 GB WD740GD followed, which was also much quieter. In 2004, Western Digital redesigned its logo for the first time since 1997, with the design of new logo focusing on the company's initials (\"WD\"). In 2005, Western Digital released a 150 GB version, the WD1500ADFD, which was also available in a special version with a transparent window enabling the user to see the drive's heads move over the platters while the drive read and wrote data (Raptor X, WD1500AHFD). The biggest capacity 3,5 inch Raptor is the WD1600ADFD, with 160 GB of disk space. As of 2004, the Western Digital Raptor drives have a five-year warranty, making them a more attractive choice for inexpensive storage servers, where a large number of drives in constant use increases the likelihood of a drive failure.\nIn 2006, Western Digital introduced its My Book line of mass market external hard drives that feature a compact book-like design. On October 7, 2007, Western Digital released several editions of a single 1 TB hard drive, the largest in its My Book line.\n\nIn 2007, Western Digital acquired magnetic media maker Komag. Also in the same year, Western Digital adopted perpendicular recording technology in its line of notebook and desktop drives. This allowed it to produce notebook and desktop drives in the largest classes of the time. Western Digital also started to produce the energy efficient GP (Green Power) range of drives.\nIn 2007, Western Digital announced the WD GP drive touting rotational speed \"between 7200 and 5400 rpm\", which is technically correct while also being misleading; the drive spins at 5405 rpm, and the Green Power spin speed is not variable. WD GP drives are programmed to unload the heads whenever idle for a very short period of time. Many Linux installations write to the file system a few times a minute in the background. As a result, there may be 100 or more load cycles per hour, and the 300,000 load cycles rating of a WD GP drive may be exceeded in less than a year.\n\nOn April 21, 2008, Western Digital announced the next generation of its 10,000 rpm SATA WD Raptor series of hard drives. The new drives, called WD VelociRaptor, featured 300 GB capacity and 2.5-inch (64 mm) platters enclosed in the IcePack, a 3.5-inch (89 mm) mounting frame with a built-in heat sink. Western Digital said that the new drives are 35 percent faster than the previous generation. On September 12, 2008, Western Digital shipped a 500 GB 2.5-inch (64 mm) notebook hard drive which is part of their Scorpio Blue series of notebook hard drives.\nOn January 27, 2009, Western Digital shipped the first 2 TB internal hard disk drive. On March 30, 2009, they entered the solid-state drive market with the acquisition of Siliconsystems, Inc. Its acquisition was unsuccessful, and few years later Western Digital discontinued all solid-state storage products based on Siliconsystems design (SiliconEdge and SiliconDrive families of SSDs and memory cards), but its inventions was used later in development of various other solid-state storage products, with larger developments going on after 2016 acquisition of SanDisk.\nOn July 27, 2009, Western Digital announced the first 1 TB mobile hard disk drive, which shipped as both a Passport series portable USB drive as well as a Scorpio Blue series notebook drive.\nIn October 2009, Western Digital announced the shipment of first 3 TB internal hard disk drive, which has 750 GB-per-platter density with SATA interface.\n\n2010s\nIn March 2011, Western Digital agreed to acquire parts of the storage unit of Hitachi, HGST, for about $4.3 billion of which $3.5 billion was paid in cash and the rest with 25 million shares of Western Digital.\n\nIn 2011, Western Digital established an R&D facility at its Malaysian plant at a cost of 1.2 billion US dollars.\nIn March 2012, Western Digital completed the acquisition of HGST and became the largest traditional hard drive manufacturer in the world. To address the requirements of regulatory agencies, in May 2012 Western Digital divested assets to manufacture and sell certain 3.5-inch hard drives for the desktop and consumer electronics markets to Toshiba, in exchange for one of its 2.5-inch hard drive factories in Thailand.\nIn December 2013, Western Digital stopped manufacturing parallel ATA hard disk drives for laptops (2.5-inch form factor) and desktop PCs (3.5-inch form factor). Until that time, they were last hard disk manufacturer to produce PATA hard disk drives. Furthermore, they were the only manufacturer that had 250 GB and 320 GB in 2.5-inch form factor.\nIn February 2014, Western Digital announced a new \"Purple\" line of hard disk drives for use in video surveillance systems, with capacities from 1 to 4 TB. They feature internal optimizations for applications that involve near-constant disk writing, and \"AllFrame\" technology which is designed to reduce write errors.\n\nIn October 2015, after being required to operate the company autonomously from WD, the Chinese Ministry of Commerce issued a decision allowing the company to begin integrating HGST into its main business, but under the condition that it maintain the HGST brand and sales team for at least two more years. The HGST brand was phased out in 2018, and since then, all HGST-branded products were rebranded to Western Digital.\nIn May 2016, Western Digital acquired SanDisk for US$19 billion. In the summer of 2017, Western Digital licensed the Fusion-io/SanDisk ION Accelerator software to One Stop Systems.\nIn 2016, HGST closed its Malaysian plant.\nIn April 2017, Western Digital moved its headquarters from Irvine, California to HGST's headquarters in San Jose, California.\nIn August 2017, Western Digital bought cloud storage provider Upthere, with the intention to continue building out the service.\nIn September 2017, Western Digital acquired Tegile Systems, maker of flash memory storage arrays. Western Digital rebranded Tegile as IntelliFlash and sold it to DataDirect Networks in September 2019.\nIn October 2017, Western Digital shipped the world's first 14 TB HDD, the helium-filled HGST Ultrastar Hs14.\nIn December 2017, Western Digital reached an agreement with Toshiba about the sale of the jointly owned NAND production facility in Japan.\nIn June 2018, Western Digital acquired Wearable, Inc., a small company based in the Chicago area that produced the SanDisk Wireless Drive and SanDisk Connect Wireless Stick, which were derived from Wearable Inc.’s AirStash wireless server platform.\nIn May 2018, Toshiba reached an agreement with the Bain consortium about the sale of that chip unit.\nIn July 2018, Western Digital announced their plan to close their hard disk production facility in Kuala Lumpur to shift the company towards flash drive production, leaving the company with just two HDD production facilities in Thailand. The company ranked 158th on the 2018 Fortune 500 of the largest United States corporations by revenue.\nIn June 2019, Kioxia experienced a power cut at one of its factories in Yokkaichi, Japan, resulting in the loss of at least 6 exabytes of flash memory, with some sources estimating the loss as high as 15 exabytes. Western Digital used (and still uses) Kioxia's facilities for making its own flash memory chips.\n\n2020s\nIn November 2020, Western Digital produced a new consumer SSD, the WD Black SN850 1TB. Using a proprietary NVMe version 1.4 controller (\"G2\"), it is reported to outperform Samsung's 980 Pro 1TB as well as other, new-to-market SSDs containing the Phison E18 controller that arrived after the SN850 became available. The only higher-performing SSD at that time was Intel's Optane line, which is a non-consumer, workstation/server-based SSD with a cost of over five times the SN850.\nIn June 2021, users reported that their My Book Live NAS drives, which were discontinued products last manufactured in 2013, had been erased, leading to the company advising that the devices be disconnected from the internet.\nIn August 2021, Western Digital and Japanese memory-chip supplier Kioxia (formerly Toshiba Memory) began working out the details of a merger to be finalized in September 2021. In October of the same year, it became clear that the merger talks stalled.\nIn February 2022, Western Digital and Kioxia reported that contamination issues have affected the output of their flash memory joint-production factories, with WD admitting that at least 6.5 exabytes of memory output being affected. The Kiakami and Yokkaichi factories in Japan stopped producing due to the contamination.\nWD experienced a cyberattack breaching the company's systems on March 23, 2023. On April 2, the company proactively took some services offline, including My Cloud, to examine the extent of the intrusion. The attackers allegedly exfiltrated around 10 TB of data from the company, including customer information, and demanded a ransom of \"minimum 8 figures\" to not publish the data.\nMerger talks with Kioxia resumed in 2023, but was called off after Kioxia's largest shareholder Bain Capital and indirect shareholder SK Hynix declared their opposition to the deal in October.\nOn February 24, 2025, Western Digital spun off its flash memory business as Sandisk Corporation, leaving WD solely focused on hard disk drives; the spin-off would effectively reverse Western Digital's earlier acquisition of SanDisk, but would also include flash storage product lines that were previously sold under the WD brand.\n\nProducts\nWestern Digital's offerings include hard drives for personal computers, security surveillance systems, video game consoles, network-attached storage (NAS), and set-top boxes. Western Digital sells datacenter hardware and software including an enterprise-class Ultrastar product line that was previously sold under the HGST brand. \nIts storage product lines are divided into brands based on colors, based on their intended use case:\nOn February 24, 2025, Western Digital spun off its flash memory business as Sandisk Corporation, leaving WD solely focused on hard disk drives; the spin-off would effectively reverse Western Digital's earlier acquisition of SanDisk, but would also include flash storage product lines that were previously sold under the WD brand.\n\nWD Purple hard drives are designed for write-heavy workloads, such as security cameras. These drives feature AllFrame technology, which attempts to reduce video frame loss, time limited error recovery, and support for the ATA streaming command set.\nExternal hard drives are sold under the My Passport, My Book, WD Elements, and Easystore brands. Western Digital external hard drives with encryption software (sold under the My Passport brand) have been reported to have severe data protection faults and to be easy to decrypt. After first offering the Western Digital Media Center in 2004 (which was actually only a storage device), Western Digital offered the WD TV series of products between 2008 and 2016. The WD TV series of products functioned as a home theater PC, able to play videos, images, and music from USB drives or network locations.\nWestern Digital offers the My Cloud series of products, which function as home media servers. In September 2015, Western Digital released My Cloud OS 3, a platform that enables connected HDDs to sync between PCs and mobile devices.\nThrough Western Digital's acquisition of Upthere, the company offers personal cloud storage through the Upthere Home app and UpOS operating system.\n\nLegacy product lines\nSome of Western Digital's old product lines that are no longer produced include:\n\nTidbit\nCaviar\nExpert\nRaptor - High speed and high performance HDDs with speeds of 10,000 RPM.\nVelociRaptor - 2.5 inch version of Raptor.\nS25 (Rebranded to XE) - SAS version of VelociRaptor.\nScorpio\nWD Green - HDD models aimed towards energy efficiency, with variable RPMs between 5400 and 7200 RPM. The Green brand was discontinued for HDDs in 2015, with its models folded into the Blue line. The Green branding continued to be used for SSDs.\n\nFormer products\nWestern Digital manufactured wireless routers. They discontinued its networking product line as of early 2014.\n\nCorporate affairs\nWestern Digital Capital is Western Digital's investment arm. It has contributed funding for data technology companies such as Elastifile and Avere Systems.\n\nLawsuits\nLawsuits have been filed against various manufacturers including Western Digital, related to the claimed capacity of their drives. The drives are labelled using the convention of 103 (1,000) bytes to the kilobyte, resulting in a perceived capacity shortfall when reported by most operating systems, which tend to use 210 (1,024) bytes to the kilobyte.\nWhile Western Digital maintained that they used \"the indisputably correct industry standard for measuring and describing storage capacity\", and that they \"cannot be expected to reform the software industry\", they agreed to settle in March 2006, with a $30 refund to affected customers in the form of backup and recovery software of the same value.\nIn May 2020, Western Digital was sued for using shingled magnetic recording (SMR) technology in its WD Red line of consumer NAS drives without explicitly informing consumers. The lawsuit alleged that SMR technology is not suitable for the advertised use of the drives in a RAID array. Seagate, another data storage company and a direct competitor of Western Digital, stated that SMR is not suitable for NAS use and that Seagate uses only conventional magnetic recording (CMR) in its NAS-oriented products.  In June 2020, in response to the controversy, Western Digital announced that it would adopt the \"Red Plus\" brand for drive models that utilize CMR; the \"WD Red\" brand would be used primarily for drives utilizing SMR, and Western Digital would promote these drives as primarily being for low-intensity, small office/home office use cases.\n\nAcquisitions\nReferences\nExternal links\n\nOfficial website\n\"25 Years of Innovation: The History of Western Digital\" (PDF). Western Digital. Archived from the original (PDF) on November 10, 1997. Retrieved February 8, 2016.\nBusiness data for Western Digital:",
  "clean_text": "Western Digital Corporation is an American data storage company headquartered in San Jose, California. Established in 1970, the company is one of the world's largest manufacturers of hard disk drives (HDDs). History 1970s Western Digital was founded on April 23, 1970, by Alvin B. Phillips, a Motorola employee, as General Digital Corporation, initially a manufacturer of MOS test equipment. It was originally based in Newport Beach, California, shortly thereafter moving to Santa Ana, California, and would go on to become one of the largest technology firms headquartered in Orange County. It rapidly became a specialty semiconductor maker, with start-up capital provided by several individual investors and industrial giant Emerson Electric. Around July 1971, it adopted its current name and soon introduced its first product, the WD1402A UART. During the early 1970s, the company focused on making and selling calculator chips, and by 1975, Western Digital was the largest independent calculator chip maker in the world. The oil crisis of the mid-1970s and the bankruptcy of its biggest calculator customer, Bowmar Instrument, changed its fortunes, however, and in 1976 Western Digital declared Chapter 11 bankruptcy. After this, Emerson Electric withdrew their support of the company. Chuck Missler joined Western Digital as chairman and chief executive in June 1977, and became the largest shareholder of Western Digital. In 1973, Western Digital established its Malaysian plant, initially to manufacture semiconductors. Western Digital introduced several products during the late 1970s, including the MCP-1600 multi-chip, microcoded CPU. The MCP-1600 was used to implement DEC's LSI-11 system, the WD16, and their own Pascal MicroEngine microcomputer which ran the UCSD p-System Version III and UCSD Pascal. However, the WD integrated circuit that arguably drove Western's forward integration was the FD1771, one of the first single-chip floppy disk drive formatter/controllers, which could replace significant amounts of TTL logic. 1980s The FD1771 and its kin were Western Digital's first entry into the data storage industry; by the early 1980s, they were making hard disk drive controllers, and in 1983, they won the contract to provide IBM with controllers for the PC/AT. That controller, the WD1003, became the basis of the ATA interface (which Western Digital developed along with Compaq and Control Data Corporation's MPI division, now owned by Seagate Technology), starting in 1986. Throughout most of the 1980s, the family of controllers based on the WD1003 provided the bulk of Western Digital's revenues and profits, and for a time generated enormous corporate growth. Much of the mid-to-late 1980s saw an effort by Western Digital to use the profits from their ATA storage controllers to become a general-purpose OEM hardware supplier for the PC industry. As a result, Western Digital purchased a number of hardware companies. These included graphics cards (through its Paradise Systems subsidiary, purchased 1986, which later became Western Digital Imaging), core logic chipsets (by purchasing Faraday Electronics in 1987), SCSI controller chips for disk and tape devices (by purchasing ADSI in 1986), networking (WD8003, WD8013 Ethernet and WD8003S StarLAN). They did well (especially Paradise, which produced one of the best VGA cards of the era), but storage-related chips and disk controllers were their biggest money makers. In 1986, they introduced the WD33C93 single-chip SCSI interface, which was used in the first 16-bit bus mastering SCSI host adapter, the WD7000 \"FASST\"; in 1987 they introduced the WD37C65, a single-chip implementation of the PC/AT's floppy disk controller circuitry, and the grandfather of modern super I/O chips; in 1988 they introduced the WD42C22 \"Vanilla\", the first single-chip ATA hard disk controller. 1988 also brought what would be the biggest change in Western Digital's history. That year, Western Digital bought the hard drive production assets of PC hardware maker Tandon; the first products of that union under Western Digital's own name were the \"Centaur\" series of ATA and XT attachment drives. 1990s By 1991, things were starting to slow down, as the PC industry moved from ST-506 and ESDI drives to ATA and SCSI, and thus were buying fewer hard disk controller boards. That year saw the rise of Western Digital's Caviar drives, brand new designs that used the latest in embedded servo and computerized diagnostic systems. Eventually, the successful sales of the Caviar drives resulted in Western Digital starting to sell some of its divisions. Paradise was sold to Philips, and since disappeared. Its networking and floppy drive controller divisions went to SMC Networks and its SCSI chip business went to Future Domain, which was later bought out by market leader Adaptec. Around 1995, the technological lead that the Caviar drives had enjoyed was eclipsed by newer offerings from other companies, especially Quantum Corp., and Western Digital fell into a slump. In 1994, Western Digital began producing hard drives at its Malaysian factory, employing 13,000 people. Products and ideas of this time did not go far. The Portfolio drive (a 3-inch (76 mm) form factor model, developed with JT Storage) was a flop, as was the SDX hard disk to CD-ROM interface. Western Digital's drives started to slip further behind competing products, and quality began to suffer; system builders and PC enthusiasts who used to recommend Western Digital above all else, were going to the competition, particularly Maxtor, whose products had improved significantly by the late 1990s. In an attempt to turn the tide in 1998, Western Digital recruited the help of IBM. This agreement gave Western Digital the rights to use certain IBM technologies, including giant magneto-resistive (GMR) heads and access to IBM production facilities. The result was the Expert line of drives, introduced in early 1999. The idea worked, and Western Digital regained respect in the press and among users, even despite a recall in 2000 (which was due to bad motor driver chips). Western Digital later broke ties with IBM. 2000s In 2001, Western Digital became the first manufacturer to offer mainstream ATA hard disk drives with 8 MiB of disk buffer. At that time, most desktop hard disk drives had 2 MB of buffer. Western Digital labeled these 8 MB models as \"Special Edition\" and distinguished them with the JB code (the 2 MB models had the BB code). The first 8 MB cache drive was the 100 GB WD1000JB, followed by other models starting with 40 GB capacity. Western Digital advertised the JB models for cost-effective file servers. In October 2001, Western Digital restated its prior year results to reflect the adoption of SEC Staff Accounting Bulletin No.101 and the reclassification of Connex and SANavigator results as discontinued operations. In 2003, Western Digital acquired most of the assets of bankrupt one-time market leading magnetic hard drive read-write head developer Read-Rite Corporation for $95 million. In the same year, Western Digital offered the first 10,000 rpm Serial ATA HDD, the WD360GD \"Raptor\", with a capacity of 36 GB and an average access time of less than six milliseconds. Soon, the 74 GB WD740GD followed, which was also much quieter. In 2004, Western Digital redesigned its logo for the first time since 1997, with the design of new logo focusing on the company's initials (\"WD\"). In 2005, Western Digital released a 150 GB version, the WD1500ADFD, which was also available in a special version with a transparent window enabling the user to see the drive's heads move over the platters while the drive read and wrote data (Raptor X, WD1500AHFD). The biggest capacity 3,5 inch Raptor is the WD1600ADFD, with 160 GB of disk space. As of 2004, the Western Digital Raptor drives have a five-year warranty, making them a more attractive choice for inexpensive storage servers, where a large number of drives in constant use increases the likelihood of a drive failure. In 2006, Western Digital introduced its My Book line of mass market external hard drives that feature a compact book-like design. On October 7, 2007, Western Digital released several editions of a single 1 TB hard drive, the largest in its My Book line. In 2007, Western Digital acquired magnetic media maker Komag. Also in the same year, Western Digital adopted perpendicular recording technology in its line of notebook and desktop drives. This allowed it to produce notebook and desktop drives in the largest classes of the time. Western Digital also started to produce the energy efficient GP (Green Power) range of drives. In 2007, Western Digital announced the WD GP drive touting rotational speed \"between 7200 and 5400 rpm\", which is technically correct while also being misleading; the drive spins at 5405 rpm, and the Green Power spin speed is not variable. WD GP drives are programmed to unload the heads whenever idle for a very short period of time. Many Linux installations write to the file system a few times a minute in the background. As a result, there may be 100 or more load cycles per hour, and the 300,000 load cycles rating of a WD GP drive may be exceeded in less than a year. On April 21, 2008, Western Digital announced the next generation of its 10,000 rpm SATA WD Raptor series of hard drives. The new drives, called WD VelociRaptor, featured 300 GB capacity and 2.5-inch (64 mm) platters enclosed in the IcePack, a 3.5-inch (89 mm) mounting frame with a built-in heat sink. Western Digital said that the new drives are 35 percent faster than the previous generation. On September 12, 2008, Western Digital shipped a 500 GB 2.5-inch (64 mm) notebook hard drive which is part of their Scorpio Blue series of notebook hard drives. On January 27, 2009, Western Digital shipped the first 2 TB internal hard disk drive. On March 30, 2009, they entered the solid-state drive market with the acquisition of Siliconsystems, Inc. Its acquisition was unsuccessful, and few years later Western Digital discontinued all solid-state storage products based on Siliconsystems design (SiliconEdge and SiliconDrive families of SSDs and memory cards), but its inventions was used later in development of various other solid-state storage products, with larger developments going on after 2016 acquisition of SanDisk. On July 27, 2009, Western Digital announced the first 1 TB mobile hard disk drive, which shipped as both a Passport series portable USB drive as well as a Scorpio Blue series notebook drive. In October 2009, Western Digital announced the shipment of first 3 TB internal hard disk drive, which has 750 GB-per-platter density with SATA interface. 2010s In March 2011, Western Digital agreed to acquire parts of the storage unit of Hitachi, HGST, for about $4.3 billion of which $3.5 billion was paid in cash and the rest with 25 million shares of Western Digital. In 2011, Western Digital established an R&D facility at its Malaysian plant at a cost of 1.2 billion US dollars. In March 2012, Western Digital completed the acquisition of HGST and became the largest traditional hard drive manufacturer in the world. To address the requirements of regulatory agencies, in May 2012 Western Digital divested assets to manufacture and sell certain 3.5-inch hard drives for the desktop and consumer electronics markets to Toshiba, in exchange for one of its 2.5-inch hard drive factories in Thailand. In December 2013, Western Digital stopped manufacturing parallel ATA hard disk drives for laptops (2.5-inch form factor) and desktop PCs (3.5-inch form factor). Until that time, they were last hard disk manufacturer to produce PATA hard disk drives. Furthermore, they were the only manufacturer that had 250 GB and 320 GB in 2.5-inch form factor. In February 2014, Western Digital announced a new \"Purple\" line of hard disk drives for use in video surveillance systems, with capacities from 1 to 4 TB. They feature internal optimizations for applications that involve near-constant disk writing, and \"AllFrame\" technology which is designed to reduce write errors. In October 2015, after being required to operate the company autonomously from WD, the Chinese Ministry of Commerce issued a decision allowing the company to begin integrating HGST into its main business, but under the condition that it maintain the HGST brand and sales team for at least two more years. The HGST brand was phased out in 2018, and since then, all HGST-branded products were rebranded to Western Digital. In May 2016, Western Digital acquired SanDisk for US$19 billion. In the summer of 2017, Western Digital licensed the Fusion-io/SanDisk ION Accelerator software to One Stop Systems. In 2016, HGST closed its Malaysian plant. In April 2017, Western Digital moved its headquarters from Irvine, California to HGST's headquarters in San Jose, California. In August 2017, Western Digital bought cloud storage provider Upthere, with the intention to continue building out the service. In September 2017, Western Digital acquired Tegile Systems, maker of flash memory storage arrays. Western Digital rebranded Tegile as IntelliFlash and sold it to DataDirect Networks in September 2019. In October 2017, Western Digital shipped the world's first 14 TB HDD, the helium-filled HGST Ultrastar Hs14. In December 2017, Western Digital reached an agreement with Toshiba about the sale of the jointly owned NAND production facility in Japan. In June 2018, Western Digital acquired Wearable, Inc., a small company based in the Chicago area that produced the SanDisk Wireless Drive and SanDisk Connect Wireless Stick, which were derived from Wearable Inc.’s AirStash wireless server platform. In May 2018, Toshiba reached an agreement with the Bain consortium about the sale of that chip unit. In July 2018, Western Digital announced their plan to close their hard disk production facility in Kuala Lumpur to shift the company towards flash drive production, leaving the company with just two HDD production facilities in Thailand. The company ranked 158th on the 2018 Fortune 500 of the largest United States corporations by revenue. In June 2019, Kioxia experienced a power cut at one of its factories in Yokkaichi, Japan, resulting in the loss of at least 6 exabytes of flash memory, with some sources estimating the loss as high as 15 exabytes. Western Digital used (and still uses) Kioxia's facilities for making its own flash memory chips. 2020s In November 2020, Western Digital produced a new consumer SSD, the WD Black SN850 1TB. Using a proprietary NVMe version 1.4 controller (\"G2\"), it is reported to outperform Samsung's 980 Pro 1TB as well as other, new-to-market SSDs containing the Phison E18 controller that arrived after the SN850 became available. The only higher-performing SSD at that time was Intel's Optane line, which is a non-consumer, workstation/server-based SSD with a cost of over five times the SN850. In June 2021, users reported that their My Book Live NAS drives, which were discontinued products last manufactured in 2013, had been erased, leading to the company advising that the devices be disconnected from the internet. In August 2021, Western Digital and Japanese memory-chip supplier Kioxia (formerly Toshiba Memory) began working out the details of a merger to be finalized in September 2021. In October of the same year, it became clear that the merger talks stalled. In February 2022, Western Digital and Kioxia reported that contamination issues have affected the output of their flash memory joint-production factories, with WD admitting that at least 6.5 exabytes of memory output being affected. The Kiakami and Yokkaichi factories in Japan stopped producing due to the contamination. WD experienced a cyberattack breaching the company's systems on March 23, 2023. On April 2, the company proactively took some services offline, including My Cloud, to examine the extent of the intrusion. The attackers allegedly exfiltrated around 10 TB of data from the company, including customer information, and demanded a ransom of \"minimum 8 figures\" to not publish the data. Merger talks with Kioxia resumed in 2023, but was called off after Kioxia's largest shareholder Bain Capital and indirect shareholder SK Hynix declared their opposition to the deal in October. On February 24, 2025, Western Digital spun off its flash memory business as Sandisk Corporation, leaving WD solely focused on hard disk drives; the spin-off would effectively reverse Western Digital's earlier acquisition of SanDisk, but would also include flash storage product lines that were previously sold under the WD brand. Products Western Digital's offerings include hard drives for personal computers, security surveillance systems, video game consoles, network-attached storage (NAS), and set-top boxes. Western Digital sells datacenter hardware and software including an enterprise-class Ultrastar product line that was previously sold under the HGST brand. Its storage product lines are divided into brands based on colors, based on their intended use case: On February 24, 2025, Western Digital spun off its flash memory business as Sandisk Corporation, leaving WD solely focused on hard disk drives; the spin-off would effectively reverse Western Digital's earlier acquisition of SanDisk, but would also include flash storage product lines that were previously sold under the WD brand. WD Purple hard drives are designed for write-heavy workloads, such as security cameras. These drives feature AllFrame technology, which attempts to reduce video frame loss, time limited error recovery, and support for the ATA streaming command set. External hard drives are sold under the My Passport, My Book, WD Elements, and Easystore brands. Western Digital external hard drives with encryption software (sold under the My Passport brand) have been reported to have severe data protection faults and to be easy to decrypt. After first offering the Western Digital Media Center in 2004 (which was actually only a storage device), Western Digital offered the WD TV series of products between 2008 and 2016. The WD TV series of products functioned as a home theater PC, able to play videos, images, and music from USB drives or network locations. Western Digital offers the My Cloud series of products, which function as home media servers. In September 2015, Western Digital released My Cloud OS 3, a platform that enables connected HDDs to sync between PCs and mobile devices. Through Western Digital's acquisition of Upthere, the company offers personal cloud storage through the Upthere Home app and UpOS operating system. Legacy product lines Some of Western Digital's old product lines that are no longer produced include: Tidbit Caviar Expert Raptor - High speed and high performance HDDs with speeds of 10,000 RPM. VelociRaptor - 2.5 inch version of Raptor. S25 (Rebranded to XE) - SAS version of VelociRaptor. Scorpio WD Green - HDD models aimed towards energy efficiency, with variable RPMs between 5400 and 7200 RPM. The Green brand was discontinued for HDDs in 2015, with its models folded into the Blue line. The Green branding continued to be used for SSDs. Former products Western Digital manufactured wireless routers. They discontinued its networking product line as of early 2014. Corporate affairs Western Digital Capital is Western Digital's investment arm. It has contributed funding for data technology companies such as Elastifile and Avere Systems. Lawsuits Lawsuits have been filed against various manufacturers including Western Digital, related to the claimed capacity of their drives. The drives are labelled using the convention of 103 (1,000) bytes to the kilobyte, resulting in a perceived capacity shortfall when reported by most operating systems, which tend to use 210 (1,024) bytes to the kilobyte. While Western Digital maintained that they used \"the indisputably correct industry standard for measuring and describing storage capacity\", and that they \"cannot be expected to reform the software industry\", they agreed to settle in March 2006, with a $30 refund to affected customers in the form of backup and recovery software of the same value. In May 2020, Western Digital was sued for using shingled magnetic recording (SMR) technology in its WD Red line of consumer NAS drives without explicitly informing consumers. The lawsuit alleged that SMR technology is not suitable for the advertised use of the drives in a RAID array. Seagate, another data storage company and a direct competitor of Western Digital, stated that SMR is not suitable for NAS use and that Seagate uses only conventional magnetic recording (CMR) in its NAS-oriented products. In June 2020, in response to the controversy, Western Digital announced that it would adopt the \"Red Plus\" brand for drive models that utilize CMR; the \"WD Red\" brand would be used primarily for drives utilizing SMR, and Western Digital would promote these drives as primarily being for low-intensity, small office/home office use cases. Acquisitions"
}