{
  "ticker": "WEC",
  "cik": "0000783325",
  "company_name": "WEC Energy Group",
  "corrected_name": "WEC Energy Group",
  "wiki_title_used": "WEC Energy Group",
  "exists": true,
  "raw_text": "WEC Energy Group is an American energy company based in Milwaukee, Wisconsin. It provides electricity and natural gas to 4.4 million customers across four states.\nDuring 2018 WEC Energy Group along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017.\n\nSubsidiaries\nWisconsin\nWe Energies, the umbrella name for Wisconsin Electric Power and Wisconsin Gas, provides electricity and natural gas to customers in Wisconsin\nWisconsin Public Service Corporation provides electricity and natural gas to customers in northeastern and northcentral Wisconsin\nBluewater Gas Storage provides natural gas storage and hub services for We Energies and Wisconsin Public Service\nWEC Infrastructure designs, builds and owns electric generating plants\nWispark develops and invests in real estate, industrial/office buildings and urban redevelopment projects\nWisconsin River Power Company, WEC Energy Group owns 50% while Alliant Energy owns the other 50%\n\nIllinois\nPeoples Energy provides natural gas to customers in the city of Chicago\nNorth Shore Gas provides natural gas to customers in Chicago's northern suburbs\n\nMinnesota\nMinnesota Energy Resources Corporation provides natural gas to customers in Minnesota\n\nMichigan\nMichigan Gas Utilities Corporation provides natural gas to customers in lower Michigan\nUpper Michigan Energy Resources provides electric and natural gas to customers in Michigan's Upper Peninsula\n\nHistory\n1896  The Milwaukee Electric Railway and Light Company was formed as a subsidiary of the North American Company to provide interurban rail service in a 12,000-square-mile (31,000 km2) area of southeastern Wisconsin. In time, the company began selling electricity not needed to power the interurban trains to individuals and businesses.\n1919  Experiments at the company's East Wells Power Plant (then called Oneida Street Station) in downtown Milwaukee, proved that use of pulverized coal reduced the cost of producing electric power and conserved fuel.\n1921  Wisconsin Electric Power Company is formed by the North American Company to build and operate   the Lakeside Power Plant in St. Francis, Wisconsin. Lakeside was the world's first power plant to burn pulverized coal exclusively.\n1935  The first of five 80-megawatt units at Port Washington Power Plant was brought on line. From 1935 to 1948, Port Washington was the most efficient coal-fueled power plant in the world.\n1938   Milwaukee Electric Railway and Light was merged into Wisconsin Electric.\n1941  Wisconsin Electric purchased Wisconsin Gas & Electric Company and Wisconsin Michigan Power Company, which also had been under the North American Company.\n1946  Wisconsin Electric becomes an independent company, no longer part of the North American Company.\n1953  Wisconsin Electric placed into service the first 120-megawatt unit at Oak Creek Power Plant. Seven additional units were completed through 1968.\n1970  Wisconsin Electric's 908-megawatt Point Beach Nuclear Plant began operation and gained a worldwide reputation for efficiency.\n1980  Wisconsin Electric placed the first 580-megawatt unit at Pleasant Prairie into service. A second unit was added in 1985.\n1987  Wisconsin Electric reorganized as a holding company, Wisconsin Energy Corporation, with Wisconsin Electric, Wispark, Wisvest and Witech as subsidiaries.\n1994  Wisconsin Energy purchased Lake Geneva-based Wisconsin Southern Gas Co. and merged it into Wisconsin Natural, which subsequently merged with Wisconsin Electric in 1995.\n1998  Wisconsin Energy bought ESELCO, parent company of the Edison Sault Electric Company, based in Sault Ste. Marie, Michigan.\n2000  WICOR, holding company of Wisconsin Gas, became part of Wisconsin Energy, creating the largest electric and natural gas provider in Wisconsin. The corporation also announced a 10-year plant to invest US$7.0 billion to build five new power plants, to upgrade existing plants and to improve its electric distribution system.\n2001  American Transmission Company, the first multi-state all-transmission utility in the United States, was formed by Wisconsin's major utilities, and Wisconsin Electric transferred ownership of its transmission lines to American Transmission in exchange for shares in the new company.\n2002  Wisconsin Electric and Wisconsin Gas began doing business as We Energies.\n2004  Wisconsin Energy sold the non-energy assets of WICOR for US$850 million as part of its strategy to divest its non-core businesses.\n2005  Construction of two 615-megawatt coal-fired units began at the Oak Creek Power Plant site. The same year, the first of two 545-megawatt natural-gas-fueled units began commercial operation at Port Washington Generating Station.\n2007  Wisconsin Energy sold Point Beach Nuclear Plant to FPL Energy for approximately US$924 million, with We Energies entitled to the output for the life of the plant.\n2008  The Blue Sky Green Field Wind Farm began operation on a 10,600-acre (43 km2) site with 88 turbines (145-megawatt capacity) in Wisconsin's Fond du Lac County.\n2009  We Energies received approval to construct and operate the Glacier Hills Wind Park in Wisconsin's Columbia County. The company also announced plans to build a biomass generating facility at the Domtar paper mill in Rothschild, Wisconsin.\n2010  The first of two 615-megawatt coal-fueled units at the company's Oak Creek expansion site attains commercial operation on Feb. 2. Wisconsin Energy completed the sale of Edison Sault Electric Company to Cloverland Electric Cooperative. In May, construction began on the Glacier Hills Wind Park in Columbia County.\n2011  The second of two 615-megawatt coal-fueled units at the company's Oak Creek expansion site attains commercial operation on Jan. 12. Glacier Hills Wind Park began operating 90 turbines in the towns of Randolph and Scott in Wisconsin.\n2013  A 50-megawatt, biomass-based, cogeneration facility in Rothschild, Wisconsin, began commercial operation to provide base-load power for the electric system and steam to the Domtar paper mill.\n2014  Wisconsin Energy announced that it was purchasing Integrys Energy Group, parent company of Peoples Gas, North Shore Gas and Wisconsin Public Service, for $9.1 billion.\n2015  The company completed its acquisition of Integrys Energy Group in a deal worth $9.1 billion.\n2017  WEC Energy Group acquired Bluewater Gas Storage, a Michigan-based company, to provide about one-third of storage needs for WEC Energy Group's natural gas distribution companies in Wisconsin.\n2019 WEC Energy Group \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017.\n\nPrimergy merger\nOn May 3, 1995, Wisconsin Energy Corporation and Northern States Power Company (NYSE: NSP) each filed a Securities and Exchange Commission Form 8-K to combine in a merger-of-equals transaction to form Primergy Corporation. It would have been the 10th largest investor-owned electric and gas utility company in the United States, based on market capitalization at that time of about US$6.0 billion.  NSP would have been the nominal survivor, and the merged company would be headquartered in Minneapolis (headquarters of the old NSP), but the merged company would have been registered in Wisconsin.\nOn May 16, 1997, both CEOs announced that the boards of directors of both companies had terminated the merger plan because of approval delays by the U.S. Department of Justice, the SEC, and state regulators in Minnesota and Wisconsin. They also stated that regulatory agencies were changing their merger policies as they were considering the companies' filing and that further delay would reduce the benefits of the Primergy transaction.\nThe delay already had put the merger five months behind schedule and had reduced earnings for both utilities by a total of US$58 million to that point. In addition, Wisconsin Energy's stock had fallen about 13% since early 1995 when the deal had been announced, while NSP's stock had risen by 6%. The case was considered to be a bellwether in the utilities industry, putting an end to the rapid pace of mergers and acquisitions that had been ongoing up to then.\n\nReferences\nExternal links\nWEC Energy Group\nBusiness data for WEC Energy Group:",
  "clean_text": "WEC Energy Group is an American energy company based in Milwaukee, Wisconsin. It provides electricity and natural gas to 4.4 million customers across four states. During 2018 WEC Energy Group along with 90 additional Fortune 500 companies \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. Subsidiaries Wisconsin We Energies, the umbrella name for Wisconsin Electric Power and Wisconsin Gas, provides electricity and natural gas to customers in Wisconsin Wisconsin Public Service Corporation provides electricity and natural gas to customers in northeastern and northcentral Wisconsin Bluewater Gas Storage provides natural gas storage and hub services for We Energies and Wisconsin Public Service WEC Infrastructure designs, builds and owns electric generating plants Wispark develops and invests in real estate, industrial/office buildings and urban redevelopment projects Wisconsin River Power Company, WEC Energy Group owns 50% while Alliant Energy owns the other 50% Illinois Peoples Energy provides natural gas to customers in the city of Chicago North Shore Gas provides natural gas to customers in Chicago's northern suburbs Minnesota Minnesota Energy Resources Corporation provides natural gas to customers in Minnesota Michigan Michigan Gas Utilities Corporation provides natural gas to customers in lower Michigan Upper Michigan Energy Resources provides electric and natural gas to customers in Michigan's Upper Peninsula History 1896 The Milwaukee Electric Railway and Light Company was formed as a subsidiary of the North American Company to provide interurban rail service in a 12,000-square-mile (31,000 km2) area of southeastern Wisconsin. In time, the company began selling electricity not needed to power the interurban trains to individuals and businesses. 1919 Experiments at the company's East Wells Power Plant (then called Oneida Street Station) in downtown Milwaukee, proved that use of pulverized coal reduced the cost of producing electric power and conserved fuel. 1921 Wisconsin Electric Power Company is formed by the North American Company to build and operate the Lakeside Power Plant in St. Francis, Wisconsin. Lakeside was the world's first power plant to burn pulverized coal exclusively. 1935 The first of five 80-megawatt units at Port Washington Power Plant was brought on line. From 1935 to 1948, Port Washington was the most efficient coal-fueled power plant in the world. 1938 Milwaukee Electric Railway and Light was merged into Wisconsin Electric. 1941 Wisconsin Electric purchased Wisconsin Gas & Electric Company and Wisconsin Michigan Power Company, which also had been under the North American Company. 1946 Wisconsin Electric becomes an independent company, no longer part of the North American Company. 1953 Wisconsin Electric placed into service the first 120-megawatt unit at Oak Creek Power Plant. Seven additional units were completed through 1968. 1970 Wisconsin Electric's 908-megawatt Point Beach Nuclear Plant began operation and gained a worldwide reputation for efficiency. 1980 Wisconsin Electric placed the first 580-megawatt unit at Pleasant Prairie into service. A second unit was added in 1985. 1987 Wisconsin Electric reorganized as a holding company, Wisconsin Energy Corporation, with Wisconsin Electric, Wispark, Wisvest and Witech as subsidiaries. 1994 Wisconsin Energy purchased Lake Geneva-based Wisconsin Southern Gas Co. and merged it into Wisconsin Natural, which subsequently merged with Wisconsin Electric in 1995. 1998 Wisconsin Energy bought ESELCO, parent company of the Edison Sault Electric Company, based in Sault Ste. Marie, Michigan. 2000 WICOR, holding company of Wisconsin Gas, became part of Wisconsin Energy, creating the largest electric and natural gas provider in Wisconsin. The corporation also announced a 10-year plant to invest US$7.0 billion to build five new power plants, to upgrade existing plants and to improve its electric distribution system. 2001 American Transmission Company, the first multi-state all-transmission utility in the United States, was formed by Wisconsin's major utilities, and Wisconsin Electric transferred ownership of its transmission lines to American Transmission in exchange for shares in the new company. 2002 Wisconsin Electric and Wisconsin Gas began doing business as We Energies. 2004 Wisconsin Energy sold the non-energy assets of WICOR for US$850 million as part of its strategy to divest its non-core businesses. 2005 Construction of two 615-megawatt coal-fired units began at the Oak Creek Power Plant site. The same year, the first of two 545-megawatt natural-gas-fueled units began commercial operation at Port Washington Generating Station. 2007 Wisconsin Energy sold Point Beach Nuclear Plant to FPL Energy for approximately US$924 million, with We Energies entitled to the output for the life of the plant. 2008 The Blue Sky Green Field Wind Farm began operation on a 10,600-acre (43 km2) site with 88 turbines (145-megawatt capacity) in Wisconsin's Fond du Lac County. 2009 We Energies received approval to construct and operate the Glacier Hills Wind Park in Wisconsin's Columbia County. The company also announced plans to build a biomass generating facility at the Domtar paper mill in Rothschild, Wisconsin. 2010 The first of two 615-megawatt coal-fueled units at the company's Oak Creek expansion site attains commercial operation on Feb. 2. Wisconsin Energy completed the sale of Edison Sault Electric Company to Cloverland Electric Cooperative. In May, construction began on the Glacier Hills Wind Park in Columbia County. 2011 The second of two 615-megawatt coal-fueled units at the company's Oak Creek expansion site attains commercial operation on Jan. 12. Glacier Hills Wind Park began operating 90 turbines in the towns of Randolph and Scott in Wisconsin. 2013 A 50-megawatt, biomass-based, cogeneration facility in Rothschild, Wisconsin, began commercial operation to provide base-load power for the electric system and steam to the Domtar paper mill. 2014 Wisconsin Energy announced that it was purchasing Integrys Energy Group, parent company of Peoples Gas, North Shore Gas and Wisconsin Public Service, for $9.1 billion. 2015 The company completed its acquisition of Integrys Energy Group in a deal worth $9.1 billion. 2017 WEC Energy Group acquired Bluewater Gas Storage, a Michigan-based company, to provide about one-third of storage needs for WEC Energy Group's natural gas distribution companies in Wisconsin. 2019 WEC Energy Group \"paid an effective federal tax rate of 0% or less\" as a result of Donald Trump´s Tax Cuts and Jobs Act of 2017. Primergy merger On May 3, 1995, Wisconsin Energy Corporation and Northern States Power Company (NYSE: NSP) each filed a Securities and Exchange Commission Form 8-K to combine in a merger-of-equals transaction to form Primergy Corporation. It would have been the 10th largest investor-owned electric and gas utility company in the United States, based on market capitalization at that time of about US$6.0 billion. NSP would have been the nominal survivor, and the merged company would be headquartered in Minneapolis (headquarters of the old NSP), but the merged company would have been registered in Wisconsin. On May 16, 1997, both CEOs announced that the boards of directors of both companies had terminated the merger plan because of approval delays by the U.S. Department of Justice, the SEC, and state regulators in Minnesota and Wisconsin. They also stated that regulatory agencies were changing their merger policies as they were considering the companies' filing and that further delay would reduce the benefits of the Primergy transaction. The delay already had put the merger five months behind schedule and had reduced earnings for both utilities by a total of US$58 million to that point. In addition, Wisconsin Energy's stock had fallen about 13% since early 1995 when the deal had been announced, while NSP's stock had risen by 6%. The case was considered to be a bellwether in the utilities industry, putting an end to the rapid pace of mergers and acquisitions that had been ongoing up to then."
}