{
  "ticker": "WELL",
  "cik": "0000766704",
  "company_name": "Welltower",
  "corrected_name": "Welltower",
  "wiki_title_used": "Welltower",
  "exists": true,
  "raw_text": "Welltower Inc. is a real estate investment trust that invests in healthcare infrastructure. As of December 31, 2022, the company had investments in approximately 3,000 properties, all of which were in the United States, Canada, and the United Kingdom.\n\nHistory\nFrederic D. \"Fritz\" Wolfe helped grow Wolfe Industries, a diversified, family-owned construction from one Lima, Ohio lumberyard, investing in health-care real estate. The company began building nursing homes in 1963.\nIn 1970, Health Care Fund was founded in Lima by Wolfe and Bruce Thompson, as the first healthcare-focused real estate investment trust (REIT). In 1981, Wolfe also founded Health Care & Retirement Corp., later Manor Care Inc., now ProMedica Senior Care.\nHealth Care Fund changed its name to Health Care REIT in 1985, moving its headquarters to Toledo the following year. The company next became Welltower, in September 2015.\nHealth Care REIT was led by George Chapman from 1996 to 2014, when he retired and was succeeded by Thomas DeRosa.\nWelltower is ranked 534th on the Fortune 500 in 2025.\n\nAcquisitions\nIn 2011, the company acquired most real estate assets of Genesis HealthCare for $2.4 billion, adding 147 properties, including post-acute, skilled nursing, and assisted living facilities, in 11 states. Genesis continues to operate the properties.\nIn 2011, it formed a partnership valued at $890 million with Benchmark Senior Living, which included 34 private-pay senior housing complexes. In January 2015, the company acquired nine Benchmark Senior Living complexes in New England for $360 million.\nIn 2012, the company invested about $5 billion, primarily in private-pay senior housing and medical office buildings; $530 million  purchased assets from Belmont Village Senior Living, and $240 million acquired a property portfolio from Brookdale Senior Living.\nOn January 8, 2013, the company acquired nearly all the real estate assets of Sunrise Senior Living in a $4.3 billion transaction, including 125 properties in large urban areas in the U.S., Canada, and the UK, with 120 owned properties and five joint-venture properties among them. In a related deal, Sunrise's property management business was recapitalized and spun-off to a partnership including Kohlberg Kravis Roberts and Coastwood Senior Housing Partners LLC, for $130 million. The company bought out their interests in late 2014 through a joint venture with Canadian senior living operator Revera, with Revera owning a 76% equity interest in the Sunrise Senior Living real estate management, and the remainder retained by Health Care REIT.\nThe company first partnered with Revera in May 2013 when it formed a joint venture to share ownership of 47 Revera retirement residences in Canada. The company bought a 75 percent interest in the approximately CAD$1.35 billion portfolio, with Revera owning the remaining 25 percent. In 2015, the joint venture then acquired Regal Lifestyle Communities for CAD$764 million, including 23 private-pay senior housing properties, thirteen properties in Ontario and seven in Quebec, totalling 3,600 units. One property each is located in British Columbia, Saskatchewan, and Newfoundland.\nIn early 2015, the company purchased all of Aspen Healthcare's four London hospitals for £226 million, including Holly House Hospital, Highgate Hospital, and Parkside Hospital and Cancer Centre, which were then leased back to Aspen  for a 25-year terms.\nIn August 2015, Welltower formed a joint venture with the Canada Pension Plan Investment Board (CPPIB) to acquire a combined interest of 50.5 percent in a portfolio of medical office buildings in Southern California from healthcare REIT G&L Realty. In February 2016, Welltower formed another joint venture with the CPPIB to buy a 97.5 percent interest in senior housing run by Discovery Senior Living in Florida for $555 million. The remaining 2.5 percent equity was retained by Discovery, which operates all six properties, known as \"Aston Gardens\".\nWelltower acquired 19 properties from Vintage Senior Living for $1.15 billion in the Los Angeles and San Francisco areas, in September 2016, making Welltower the largest owner of senior housing in the state.\nIn April 2018, Welltower and ProMedica acquired Healthpeak Properties spin-off Quality Care Properties, along with HCR ManorCare, for $4.4 billion.\nIn 2025, Welltower acquired Amica Senior Lifestyles from the Ontario Teachers' Pension Plan, for US$4.6 billion and, that June, it acquired NorthStar Healthcare Income REIT for $US900 million in cash.\nIn October 2025, the company acquired Barchester Healthcare, a British care home company, for $6.875 billion.\n\nSee also\nList of public REITs in the United States\n\nReferences\nExternal links\nOfficial website\nBusiness data for Welltower Inc.:",
  "clean_text": "Welltower Inc. is a real estate investment trust that invests in healthcare infrastructure. As of December 31, 2022, the company had investments in approximately 3,000 properties, all of which were in the United States, Canada, and the United Kingdom. History Frederic D. \"Fritz\" Wolfe helped grow Wolfe Industries, a diversified, family-owned construction from one Lima, Ohio lumberyard, investing in health-care real estate. The company began building nursing homes in 1963. In 1970, Health Care Fund was founded in Lima by Wolfe and Bruce Thompson, as the first healthcare-focused real estate investment trust (REIT). In 1981, Wolfe also founded Health Care & Retirement Corp., later Manor Care Inc., now ProMedica Senior Care. Health Care Fund changed its name to Health Care REIT in 1985, moving its headquarters to Toledo the following year. The company next became Welltower, in September 2015. Health Care REIT was led by George Chapman from 1996 to 2014, when he retired and was succeeded by Thomas DeRosa. Welltower is ranked 534th on the Fortune 500 in 2025. Acquisitions In 2011, the company acquired most real estate assets of Genesis HealthCare for $2.4 billion, adding 147 properties, including post-acute, skilled nursing, and assisted living facilities, in 11 states. Genesis continues to operate the properties. In 2011, it formed a partnership valued at $890 million with Benchmark Senior Living, which included 34 private-pay senior housing complexes. In January 2015, the company acquired nine Benchmark Senior Living complexes in New England for $360 million. In 2012, the company invested about $5 billion, primarily in private-pay senior housing and medical office buildings; $530 million purchased assets from Belmont Village Senior Living, and $240 million acquired a property portfolio from Brookdale Senior Living. On January 8, 2013, the company acquired nearly all the real estate assets of Sunrise Senior Living in a $4.3 billion transaction, including 125 properties in large urban areas in the U.S., Canada, and the UK, with 120 owned properties and five joint-venture properties among them. In a related deal, Sunrise's property management business was recapitalized and spun-off to a partnership including Kohlberg Kravis Roberts and Coastwood Senior Housing Partners LLC, for $130 million. The company bought out their interests in late 2014 through a joint venture with Canadian senior living operator Revera, with Revera owning a 76% equity interest in the Sunrise Senior Living real estate management, and the remainder retained by Health Care REIT. The company first partnered with Revera in May 2013 when it formed a joint venture to share ownership of 47 Revera retirement residences in Canada. The company bought a 75 percent interest in the approximately CAD$1.35 billion portfolio, with Revera owning the remaining 25 percent. In 2015, the joint venture then acquired Regal Lifestyle Communities for CAD$764 million, including 23 private-pay senior housing properties, thirteen properties in Ontario and seven in Quebec, totalling 3,600 units. One property each is located in British Columbia, Saskatchewan, and Newfoundland. In early 2015, the company purchased all of Aspen Healthcare's four London hospitals for £226 million, including Holly House Hospital, Highgate Hospital, and Parkside Hospital and Cancer Centre, which were then leased back to Aspen for a 25-year terms. In August 2015, Welltower formed a joint venture with the Canada Pension Plan Investment Board (CPPIB) to acquire a combined interest of 50.5 percent in a portfolio of medical office buildings in Southern California from healthcare REIT G&L Realty. In February 2016, Welltower formed another joint venture with the CPPIB to buy a 97.5 percent interest in senior housing run by Discovery Senior Living in Florida for $555 million. The remaining 2.5 percent equity was retained by Discovery, which operates all six properties, known as \"Aston Gardens\". Welltower acquired 19 properties from Vintage Senior Living for $1.15 billion in the Los Angeles and San Francisco areas, in September 2016, making Welltower the largest owner of senior housing in the state. In April 2018, Welltower and ProMedica acquired Healthpeak Properties spin-off Quality Care Properties, along with HCR ManorCare, for $4.4 billion. In 2025, Welltower acquired Amica Senior Lifestyles from the Ontario Teachers' Pension Plan, for US$4.6 billion and, that June, it acquired NorthStar Healthcare Income REIT for $US900 million in cash. In October 2025, the company acquired Barchester Healthcare, a British care home company, for $6.875 billion."
}