{
  "ticker": "WFC",
  "cik": "0000072971",
  "company_name": "Wells Fargo",
  "corrected_name": "Wells Fargo",
  "wiki_title_used": "Wells Fargo",
  "exists": true,
  "raw_text": "Wells Fargo & Company is an American multinational financial services company with a significant global presence. The company operates in 35 countries and serves over 70 million customers worldwide. It is a systemically important financial institution according to the Financial Stability Board, and is considered one of the \"Big Four Banks\" in the United States, alongside JPMorgan Chase, Bank of America, and Citigroup.\nThe company's primary subsidiary is Wells Fargo Bank, N.A., a national bank that designates its Sioux Falls, South Dakota, site as its main office (and therefore is treated by most U.S. federal courts as a citizen of South Dakota). It is the fourth-largest bank in the United States by total assets and is also one of the largest as ranked by bank deposits and market capitalization. It has 8,050 branches and 13,000 automated teller machines and 2,000 stand-alone mortgage branches. It is the second-largest retail mortgage originator in the United States, originating one out of every four home loans, and services $1.8 trillion in home mortgages, one of the largest servicing portfolios in the U.S. It is one of the most valuable bank brands. Wells Fargo is ranked 47th on the Fortune 500 list of the largest companies in the U.S.\nIn addition to banking, the company provides equipment financing via subsidiaries including Wells Fargo Rail and provides investment management and stockbrokerage services. A key part of Wells Fargo's business strategy is cross-selling, the practice of encouraging existing customers to buy additional banking services. This led to the Wells Fargo cross-selling scandal.\nWells Fargo has international offices in London, Dublin, Paris, Milan, Dubai, Singapore, Tokyo, Shanghai, Beijing, and Toronto, among others. Back-offices are in India and the Philippines with more than 20,000 staff. Notably, Wells Fargo is the first major national U.S. bank to undergo a successful unionization drive. As of 2024, 20 branch locations have joined Wells Fargo Workers United-CWA, a division of Communications Workers of America, in less than a year.\nWells Fargo operates under Charter No. 1, the first national bank charter issued in the United States. This charter was issued to First National Bank of Philadelphia on June 20, 1863, by the Office of the Comptroller of the Currency. Wells Fargo, in its present form, is a result of a merger between the original Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998. The merged company took the better-known Wells Fargo name and moved to Wells Fargo's hub in San Francisco. At the same time, Norwest's banking subsidiary merged with Wells Fargo's Sioux Falls-based banking subsidiary. Wells Fargo became a coast-to-coast bank with the 2008 acquisition of Charlotte-based Wachovia.\n\nHistory\nHenry Wells and William G. Fargo, who founded American Express along with John Butterfield, formed Wells Fargo & Company in 1852 to provide \"express\" and banking services to California, which was growing rapidly due to the California Gold Rush. Its earliest and most significant tasks included transporting gold from the Philadelphia Mint and \"express\" mail delivery that was faster and less expensive than U.S. Mail. American Express was not interested in serving California.\n\nBy the end of the California Gold Rush, Wells Fargo was a dominant express and banking organization in the West, making large shipments of gold and delivering mail and supplies. It was also the primary lender of Butterfield Overland Mail Company, which ran a 2,757-mile route through the Southwest to San Francisco and was nicknamed the \"Butterfield Line\" after the name of the company's president, John Butterfield. In 1860, Congress failed to pass the annual Post Office appropriation bill, leaving the Post Office unable to pay Overland Mail Company. This caused Overland to default on its debts to Wells Fargo, allowing Wells Fargo to take control of the mail route. Wells Fargo then operated the western portion of the Pony Express.\nSix years later, the \"Grand Consolidation\" united Wells Fargo, Holladay, and Overland Mail stage lines under the Wells Fargo name.\n\nIn 1872, Lloyd Tevis, a friend of the Central Pacific \"Big Four\" and holder of rights to operate an express service over the Transcontinental Railroad, became president of the company after acquiring a large stake, a position he held until 1892.\nIn 1905, Wells Fargo separated its banking and express operations, and Wells Fargo's bank merged with the Nevada National Bank to form the Wells Fargo Nevada National Bank.\nDuring the First World War, the United States government nationalized Wells Fargo's express business into a federal agency known as the US Railway Express Agency (REA). After the war, the REA was privatized and continued service until 1975.\nIn 1923, Wells Fargo Nevada merged with the Union Trust Company to form the Wells Fargo Bank & Union Trust Company.\nIn 1954, Wells Fargo & Union Trust shortened its name to Wells Fargo Bank. Four years later, it merged with American Trust Company to form the Wells Fargo Bank American Trust Company. It changed its name back to Wells Fargo Bank in 1962.\nIn 1968, Wells Fargo was converted to a federal banking charter and became Wells Fargo Bank, N.A. In that same year, Wells Fargo merged with Henry Trione's Sonoma Mortgage in a $10.8 million stock transfer, making Trione the largest shareholder in Wells Fargo until Warren Buffett and Walter Annenberg surpassed him.\nOne year later, Wells Fargo & Company holding company was formed, with Wells Fargo Bank as its main subsidiary.\nIn September 1983, a Wells Fargo armored truck depot in West Hartford, Connecticut, was the victim of the White Eagle robbery. The robbery was organized by Los Macheteros (a guerrilla group seeking Puerto Rican independence from the United States) and involved an insider armored truck guard. It was the largest US bank theft to date with $7.1 million stolen.\nThroughout the 1980s and '90s, Wells Fargo completed a series of acquisitions. In 1986, it acquired Crocker National Bank from Midland Bank. Then, in 1987 it acquired the personal trust business of Bank of America. In 1988, it acquired Barclays Bank of California from Barclays plc. In 1991, Wells Fargo spent $491 million to acquire 130 branches in California from Great American Bank. In 1996, Wells Fargo acquired First Interstate Bancorp for $11.6 billion. Integration went poorly as many executives left.\nWells Fargo became the first major US financial services firm to offer internet banking, in May 1995.\nAfter its string of acquisitions, in 1998, Wells Fargo Bank was acquired by Norwest Corporation of Minneapolis, with the combined company assuming the Wells Fargo name.\nIt then began on another set of acquisitions, starting in 2000, when Wells Fargo Bank acquired National Bank of Alaska and First Security Corporation. In late 2001, it acquired H.D. Vest Financial Services for $128 million, but sold it in 2015 for $580 million. The 2008 financial crisis resulted in many bank takeovers. In 2007, Wells Fargo acquired Greater Bay Bancorp, which had $7.4 billion in assets, in a $1.5 billion transaction. It also acquired Placer Sierra Bank and CIT Group's construction unit that same year. In 2008, Wells Fargo acquired United Bancorporation of Wyoming and Century Bancshares of Texas.\nOn October 3, 2008, after Wachovia turned down an inferior offer from Citigroup, Wachovia agreed to be bought by Wells Fargo for about $14.8 billion in stock. The next day, a New York state judge issued a temporary injunction blocking the transaction from going forward while the competing offer from Citigroup was sorted out. Citigroup alleged that it had an exclusivity agreement with Wachovia that barred Wachovia from negotiating with other potential buyers. The injunction was overturned late in the evening on October 5, 2008, by the New York state appeals court. Citigroup and Wells Fargo then entered into negotiations brokered by the FDIC to reach an amicable solution to the impasse. The negotiations failed. Citigroup was unwilling to take on more risk than the $42 billion that would have been the cap under the previous FDIC-backed deal (with the FDIC incurring all losses over $42 billion). Citigroup did not block the merger, but sought damages of $60 billion for breach of an alleged exclusivity agreement with Wachovia.\nOn October 28, 2008, Wells Fargo received $25 billion of funds via the Emergency Economic Stabilization Act in the form of a preferred stock purchase by the United States Department of the Treasury. As a result of requirements of the government stress tests, the company raised $8.6 billion in capital in May 2009. On December 23, 2009, Wells Fargo redeemed $25 billion of preferred stock issued to the United States Department of the Treasury. As part of the redemption of the preferred stock, Wells Fargo also paid accrued dividends of $131.9 million, bringing the total dividends paid to $1.441 billion since the preferred stock was issued in October 2008.\nIn April 2009, Wells Fargo acquired North Coast Surety Insurance Services.\nIn 2010, hedge fund administrator Citco purchased the trust company operation of Wells Fargo in the Cayman Islands.\nIn 2011, the company hired 25 investment bankers from Citadel LLC.\nIn April 2012, Wells Fargo acquired Merlin Securities. In December 2012, it was rebranded as Wells Fargo Prime Services. In December of that year, Wells Fargo acquired a 35% stake in The Rock Creek Group LP. The stake was increased to 65% in 2014 but sold back to management in July 2018.\nIn 2015, Wells Fargo Rail acquired GE Capital Rail Services and merged in with First Union Rail. In late 2015, Wells Fargo acquired three GE units focused on business loans equipment financing.\nIn March 2017, Wells Fargo announced a plan to offer smartphone-based transactions with mobile wallets including Wells Fargo Wallet, Android Pay and Samsung Pay.\nIn June 2018, Wells Fargo sold all 52 of its physical bank branch locations in Indiana, Michigan, and Ohio to Flagstar Bank.\nIn September 2018, Wells Fargo announced it would cut 26,450 jobs by 2020 to reduce costs by $4 billion.\nIn March 2019, CEO Tim Sloan resigned amidst the Wells Fargo account fraud scandal and former general counsel C. Allen Parker became interim CEO.\nIn July 2019, Principal Financial Group acquired the company's Institutional Retirement & Trust business.\nOn September 27, 2019, Charles Scharf was announced as the firm's new CEO.\nIn 2020, the company sold its student loan portfolio.\nIn May 2021, the company sold its Canadian Direct Equipment Finance business to Toronto-Dominion Bank.\nIn 2021, the company sold its asset management division, Wells Fargo Asset Management (WFAM) to private equity firms GTCR and Reverence Capital Partners for $2.1 billion. WFAM had $603 billion in assets under management as of December 31, 2020, of which 33% was invested in money market funds. WFAM was rebranded as Allspring Global Investments.\nOn September 23, 2024, Wells Fargo launched a $1.6 billion delayed-draw term loan to support Tempur Sealy International's acquisition of Mattress Firm Group.\nIn December 2024, Wells Fargo announced that it would be selling it decades-long San Francisco headquarters building to downsize its footprint in San Francisco by moving to another building nearby. The move was interpreted by bankers as a sign of the financial industry drifting away from San Francisco and California.\nIn June 2025, Wells Fargo hired a senior banker from Citigroup to lead its activism defense practice, as corporations find it difficult to build out business units to help clients facing pressure from activist investors.\nIn July 2025, Wells Fargo announced that it sought to end its partnership with Bilt Rewards ahead of schedule, a venture that initially began in 2022. Wells Fargo was losing as much as $10 million per month according to The Wall Street Journal. The partnership was initially set to end in 2029.\n\nEnvironmental record\nIn 2022, Wells Fargo announced a goal of reducing absolute emissions by companies it lends to in the oil and gas sector by 26% by 2030 from 2019 levels. Some critics say these goals conflict with the bank being the largest lender to fossil fuel companies in the U.S. and one of the largest globally. The company has committed to net zero financed emissions by 2050; however, major environmental groups are skeptical that this goal will be achieved. The company has stated that it will not finance any hydrocarbon exploration projects in the Arctic. The company has also provided financing to renewable energy projects.\nIn December 2024, Wells Fargo withdrew itself from its membership of Net- Zero Banking Alliance.\n\nFinancing of Dakota Access Pipeline\nWells Fargo is a lender on the Dakota Access Pipeline, a 1,172-mile-long (1,886 km) underground oil pipeline transport system in North Dakota. The pipeline has been controversial regarding its potential impact on the environment.\nIn February 2017, the city councils of Seattle, Washington and Davis, California voted to move $3 billion of deposits from the bank due to its financing of the Dakota Access Pipeline as well as the Wells Fargo account fraud scandal.\n\nLawsuits, fines, and controversies\nRegulatory issues\nThe company has been the subject of several investigations by regulators. Many of these issues have resulted in reputational damage. On February 2, 2018, the Wells Fargo account fraud scandal resulted in the Federal Reserve barring Wells Fargo from growing its nearly $2 trillion asset base any further until the company fixed its internal problems to the satisfaction of the Federal Reserve. In June 2025, the Federal Reserve lifted the punitive asset cap, allowing the bank to pursue growth and provide more financing to corporate clients. Scharf called the decision “a pivotal milestone in our journey to transform Wells Fargo.\"\nIn September 2021, Wells Fargo incurred further fines from the United States Justice Department charging fraudulent behavior by the bank against foreign-exchange currency trading customers. Bloomberg L.P. reported in March 2022 that Wells Fargo was the only major lender in 2020 to reject more home refinance applications from Black applicants than it approved.\nIn December 2022, the U.S. levied a $3.7 billion loan-management fine upon Wells Fargo. In March 2023, Wells Fargo blamed a technical glitch for misstating the balances of customers' accounts, in many cases incorrectly deeming the customers as having a negative bank balance. Subsequently, in 2023, prison sentencing took place for employee-directed money laundering and funneling cash illegally to Mexico through the creation of fictitious accounts.\n\n1981 MAPS Wells Fargo embezzlement scandal\nIn 1981, it was discovered that a Wells Fargo assistant operations officer, Lloyd Benjamin \"Ben\" Lewis, had perpetrated one of the largest embezzlements in history through its Beverly Drive branch. During 1978–1981, Lewis had successfully written phony debit and credit receipts to benefit boxing promoters Harold J. Smith (né Ross Eugene Fields) and Sam \"Sammie\" Marshall, chairman and president, respectively, of Muhammad Ali Professional Sports, Inc. (MAPS), of which Lewis was also listed as a director; Marshall, too, was a former employee of the same Wells Fargo branch as Lewis. In excess of $300,000 was paid to Lewis, who pled guilty to embezzlement and conspiracy charges in 1981, and testified against his co-conspirators for a reduced five-year sentence. (Boxer Muhammad Ali had received a fee for the use of his name, and had no other involvement with the organization.)\n\nHigher costs charged to African-American and Hispanic borrowers\nIllinois Attorney General Lisa Madigan filed suit against Wells Fargo on July 31, 2009, alleging that the bank steered African Americans and Hispanics into high-cost subprime loans. A Wells Fargo spokesman responded that \"The policies, systems, and controls we have in place – including in Illinois – ensure race is not a factor...\" An affidavit filed in the case stated that loan officers had referred to black mortgage-seekers as \"mud people,\" and the subprime loans as \"ghetto loans.\" According to Beth Jacobson, a loan officer at Wells Fargo interviewed for a report in The New York Times, \"We just went right after them. Wells Fargo mortgage had an emerging-markets unit that specifically targeted black churches because it figured church leaders had a lot of influence and could convince congregants to take out subprime loans.\" The report presented data from the city of Baltimore, where more than half the properties subject to foreclosure on a Wells Fargo loan from 2005 to 2008 now stand vacant, and 71 percent of those are in predominantly black neighborhoods. Wells Fargo agreed to pay $125 million to subprime borrowers and $50 million in direct down payment assistance in certain areas, for a total of $175 million.\n\nFailure to monitor suspected money laundering\nIn a March 2010 agreement with US federal prosecutors, Wells Fargo acknowledged that between 2004 and 2007 Wachovia had failed to monitor and report suspected money laundering by narcotics traffickers, including the cash used to buy four planes that shipped a total of 22 tons of cocaine into Mexico.\n\nOverdraft fees\nIn August 2010, Wells Fargo was fined by United States district court judge William Alsup for overdraft practices designed to \"gouge\" consumers and \"profiteer\" at their expense, and for misleading consumers about how the bank processed transactions and assessed overdraft fees. In May 2013, Wells Fargo paid $203 million to settle class-action litigation accusing the bank of imposing excessive overdraft fees on checking-account customers.\n\nSettlement and fines regarding mortgage servicing practices\nOn February 9, 2012, it was announced that the five largest mortgage servicers (Ally Financial, Bank of America, Citigroup, JPMorgan Chase, and Wells Fargo) agreed to a settlement with the US Federal Government and 49 states over improper foreclosure practices in the 2010 United States foreclosure crisis, including \"robo-signing\" (having someone fraudulently sign that they know the contents of a document they do not in fact know) and foreclosing without standing via MERS. The settlement, known as the National Mortgage Settlement (NMS), required the servicers to provide about $26 billion in relief to distressed homeowners and in direct payments to the federal and state governments; Wells Fargo's share was the second largest, at $5.4 billion. This settlement amount makes the NMS the second largest civil settlement in U.S. history, only trailing the Tobacco Master Settlement Agreement. The five banks were also required to comply with 305 new mortgage servicing standards. Oklahoma held out and agreed to settle with the banks separately.\nOn April 5, 2012, a federal judge ordered Wells Fargo to pay $3.1 million in punitive damages over a single loan, one of the largest fines for a bank ever for mortgaging service misconduct, after the bank improperly charged Michael Jones, a New Orleans homeowner, with $24,000 in mortgage fees, after the bank misallocated payments to interest instead of principal. Elizabeth Magner, a federal bankruptcy judge in the Eastern District of Louisiana, cited the bank's behavior as \"highly reprehensible\", stating that Wells Fargo has taken advantage of borrowers who rely on the bank's accurate calculations. The award was affirmed on appeal in 2013.\nIn May 2013, New York attorney-general Eric Schneiderman announced a lawsuit against Wells Fargo over alleged violations of the national mortgage settlement. Schneidermann claimed Wells Fargo had violated rules over giving fair and timely serving. In 2015, a judge sided with Wells Fargo.\n\nSEC fine due to inadequate risk disclosures\nOn August 14, 2012, Wells Fargo agreed to pay around $6.5 million to settle U.S. Securities and Exchange Commission (SEC) charges that in 2007 it sold risky mortgage-backed securities without fully realizing their dangers.\n\nLawsuit by FHA over loan underwriting\nIn 2016, Wells Fargo agreed to pay $1.2 billion to settle allegations that the company violated the False Claims Act by underwriting over 100,000 Federal Housing Administration (FHA) backed loans when over half of the applicants did not qualify for the program.\nIn October 2012, Wells Fargo was sued by United States Attorney Preet Bharara over questionable mortgage deals.\n\nLawsuit due to premium inflation on forced place insurance\nIn April 2013, Wells Fargo settled a suit with 24,000 Florida homeowners alongside insurer QBE Insurance, in which Wells Fargo was accused of inflating premiums on forced-place insurance.\n\nViolation of New York credit card laws\nIn February 2015, Wells Fargo agreed to pay $4 million, including a $2 million penalty and $2 million in restitution for illegally taking an interest in the homes of borrowers in exchange for opening credit card accounts for the homeowners.\n\nTax liability and lobbying\nIn December 2011, Public Campaign criticized Wells Fargo for spending $11 million on lobbying during 2008–2010, while increasing executive pay and laying off workers, while having no federal tax liability due to losses from the Great Recession. However, in 2013, the company paid $9.1 billion in income taxes.\n\nPrison industry investment\nThe company has invested its clients' funds in GEO Group, a multi-national provider of for-profit private prisons. By March 2012, its stake had grown to more than 4.4 million shares worth $86.7 million. As of November 2012, Wells Fargo divested 33% of its holdings of GEO's stock, reducing its stake to 4.98% of Geo Group's common stock, below the threshold of which it must disclose further transactions.\n\nDiscrimination against African Americans in hiring\nIn August 2020, the company agreed to pay $7.8 million in back wages for allegedly discriminating against 34,193 African Americans in hiring for tellers, personal bankers, customer sales and service representatives, and administrative support positions. The company agreed to provide jobs to 580 of the affected applicants.\n\nSEC settlement for insider trading case\nIn May 2015, Gregory T. Bolan Jr., a stock analyst at Wells Fargo agreed to pay $75,000 to the U.S. Securities and Exchange Commission to settle allegations that he gave Joseph C. Ruggieri, a stock trader, insider information on probable ratings charges. Ruggieri was not convicted of any crime.\n\nWells Fargo cross-selling scandal\nIn September 2016, Wells Fargo was issued a combined total of $185 million in fines for opening over 1.5 million checking and savings accounts and 500,000 credit cards on behalf of customers without their consent. The Consumer Financial Protection Bureau (CFPB) issued $100 million in fines, the largest in the agency's five-year history, along with $50 million in fines from the City and County of Los Angeles, and $35 million in fines from the Office of Comptroller of the Currency. The scandal was caused by an incentive-compensation program for employees to create new accounts. It led to the firing of nearly 5,300 employees and $5 million being set aside for customer refunds on fees for accounts the customers never wanted. Carrie Tolstedt, who headed the department, retired in July 2016 and received $124.6 million in stock, options, and restricted Wells Fargo shares as a retirement package.\nOn October 12, 2016, John Stumpf, the then chairman and CEO, announced that he would be retiring amidst the scandals. President and chief operating officer Timothy J. Sloan succeeded Stumpf, effective immediately. Following the scandal, applications for credit cards and checking accounts at the bank plummeted. In response to the event, the Better Business Bureau dropped accreditation of the bank. Several states and cities ended business relations with the company.\nAn investigation by the Wells Fargo board of directors, the report of which was released in April 2017, primarily blamed Stumpf, who it said had not responded to evidence of wrongdoing in the consumer services division, and Tolstedt, who was said to have knowingly set impossible sales goals and refused to respond when subordinates disagreed with them. Wells Fargo coined the phrase, \"Go for Gr-Eight\" – or, in other words, aim to sell at least 8 products to every customer. The board chose to use a clawback clause in the retirement contracts of Stumpf and Tolstedt to recover $75 million worth of cash and stock from the former executives.\nIn February 2020, the company agreed to pay $3 billion to settle claims by the United States Department of Justice and the Securities and Exchange Commission. The settlement did not prevent individual employees from being targets of future litigation. The Federal Reserve put a limit to Wells Fargo's assets, as a result of the scandal. In 2020, Wells Fargo sold $100 million in assets to stay under the limit.\nIn December 2022, the bank agreed to a settlement with the CFPB of $3.7 billion over abuses tied to the fake account scandal as well as mortgages and auto loans. The total was split between $1.7 billion for a civil penalty and $2 billion for customers. Separately, in May 2023, the bank agreed to pay $1 billion to settle a shareholder class-action suit.\n\nRacketeering lawsuit for mortgage appraisal overcharges\nIn November 2016, Wells Fargo agreed to pay $50 million to settle allegations of overcharging hundreds of thousands of homeowners for appraisals ordered after they defaulted on their mortgage loans. While banks are allowed to charge homeowners for such appraisals, Wells Fargo frequently charged homeowners fees of $95 to $125 on appraisals for which the bank had been charged $50 or less. The plaintiffs had sought triple damages under the U.S. Racketeer Influenced and Corrupt Organizations Act on grounds that sending invoices and statements with fraudulently concealed fees constituted mail and wire fraud sufficient to allege racketeering.\n\nFailure to comply with document security requirements\nIn December 2016, the Financial Industry Regulatory Authority fined Wells Fargo $5.5 million for failing to store electronic documents in a \"write once, read many\" format, which makes it impossible to alter or destroy records after they are written.\n\nDoing business with the gun industry and NRA\nFrom December 2012 through February 2018, Wells Fargo reportedly helped two of the biggest firearms and ammunition companies obtain $431.1 million in loans. It also handled banking for the National Rifle Association of America (NRA) and provided bank accounts and a $28-million line of credit.\nIn 2020, the company said that it was winding down its business with the NRA. Scharf claimed Wells Fargo's relationship with the NRA was \"declining,\" with the company no longer participating in the organization's line of credit and mortgage loan commitments.\n\nDiscrimination against female workers\nIn June 2018, about a dozen female Wells Fargo executives from the wealth management division met in Scottsdale, Arizona to discuss the minimal presence of women occupying senior roles within the company. The meeting, dubbed \"the meeting of 12\", represented the majority of the regional managing directors, of which 12 out of 45 were women. Wells Fargo had previously been investigating reports of gender bias in the division in the months leading up to the meeting. The women reported that they had been turned down for top jobs despite their qualifications, and instead the roles were occupied by men.\nThere were also complaints against company president Jay Welker, who is also the head of the Wells Fargo wealth management division, due to his sexist statements regarding female employees. The female workers claimed that he called them \"girls\" and said that they \"should be at home taking care of their children.\"\n\nOverselling auto insurance\nOn June 10, 2019, Wells Fargo agreed to pay $385 million to settle a lawsuit accusing it of allegedly scamming millions of auto-loan customers into buying insurance they did not need from National General Insurance.\nIn February 2023, Wells Fargo agreed to pay $300 million in a settlement with shareholders over auto insurance disclosures.\n\nFailure to Supervise Registered Representatives\nOn August 28, 2020, Wells Fargo agreed to pay a fine of $350,000 as well as $10 million in restitution payments to certain customers after the Financial Industry Regulatory Authority accused the company of failing to reasonably supervise two of its registered representatives that recommended that customers invest a high percentage of their assets in high-risk energy securities in 2014 and 2015.\n\nSteering customers to more expensive retirement accounts\nIn April 2018, the United States Department of Labor launched a probe into whether Wells Fargo was pushing its customers into more expensive retirement plans as well as into retirement funds managed by Wells Fargo itself.\n\nAlteration of documents\nIn May 2018, the company discovered that its business banking group had improperly altered documents about business clients in 2017 and early 2018.\n\nExecutive compensation\nWith CEO John Stumpf being paid 473 times more than the median employee, Wells Fargo ranked number 33 among the S&P 500 companies for CEO—employee pay inequality. In October 2014, a Wells Fargo employee earning $15 per hour emailed the CEO—copying 200,000 other employees—asking that all employees be given a $10,000 per year raise taken from a portion of annual corporate profits to address wage stagnation and income inequality. After being contacted by the media, Wells Fargo responded that all employees receive \"market competitive\" pay and benefits significantly above U.S. federal minimums.\nPursuant to Section 953(b) of the Dodd-Frank Wall Street Reform and Consumer Protection Act, publicly traded companies are required to disclose (1) the median total annual compensation of all employees other than the CEO and (2) the ratio of the CEO's annual total compensation to that of the median employee.\n\nAggressive freezing and closing of bank accounts\nThe Consumer Financial Protection Bureau found that, between 2011 and 2016, Wells Fargo had been freezing entire consumer deposit accounts based on automated fraud detection. This freeze extended to the entire account, not just the suspicious amount, and all access to funds was blocked. As a result, customers were unable to access their funds until the accounts were closed and the funds were returned. In 2022, the Consumer Financial Protection Bureau mandated that Wells Fargo provide $160 million in compensation to more than a million individuals, addressing the significant harm caused by its aggressive tactic of freezing and closing bank accounts during the period from 2011 to 2016.\n\nBanker blocked from leaving China\nOn 17 July 2025, Mao Chenyue, a managing director of Wells Fargo, was subjected to an exit ban in China amid an investigation of a criminal case that involved her, as confirmed by Guo Jiakun, a spokesperson of the Ministry of Foreign Affairs. In response to her exit restrictions, WF announced that they would be suspending employee travel to China.\n\nIn popular culture\nThe company was a theme or the subject in several films. In the 1939 John Ford-directed movie \"Stagecoach\", at the 5:22 mark two men can be seen hoisting a chest plainly marked \"Wells Fargo.\" Seven Men from Now (a 1956 film), Cheyenne (the 1947 film), Wells Fargo (a 1937 film) and Unclaimed Goods (a 1918 silent) are examples. A long running television series, Tales of Wells Fargo ran from 1957 to 1962, focusing on a fictitious Wells Fargo special agent.\nWells Fargo stagecoaches are mentioned in the song \"The Deadwood Stage (Whip-Crack-Away!)\" in the 1953 film Calamity Jane performed by Doris Day: \"With a fancy cargo, care of Wells and Fargo, Illinois - Boy!\". Wells Fargo is also shown as the delivery service bringing the instruments for the town band in the 1962 film The Music Man. A Wells Fargo & Company stagecoach is seen passing through the town of Hill Valley as Marty is walking down the street in the 1990 film, Back to the Future Part III.\nThe song \"The Wells Fargo Wagon\" is part of the Broadway musical The Music Man, referring to Wells, Fargo & Company's stagecoach delivery in the early 20th century, the time in which The Music Man is set.\n\nCharity\nOn March 2, 2022, Wells Fargo announced $1 million donation to the American Red Cross that will be used for Ukrainian refugees fleeing from the Russian invasion.\nIn April 2022, The Wells Fargo foundation announced its pledge of $210 million toward racial equity in homeownership. With $60 million of the donation awarded in Wealth Opportunities Restored through Homeownership (WORTH) grants which will run until 2025. Additionally, $150 million will be committed to lower mortgage rates and reducing the refinancing costs to aid minority homeowners.\nIn April 2023, TD Jakes Group and Wells Fargo have formalized a 10-year partnership to create inclusive communities for people of all income levels. Wells Fargo has committed approximately $1 billion to fund projects that align with the overall strategy. \nThe first of the projects focuses on the development of mixed-income housing and retail facilities outside of Atlanta.\nIn December 2023, Wells Fargo appointed Darlene Goins as president of the Wells Fargo Foundation and Head of Philanthropy and Community Impact. Previously, she had held leadership roles at FICO, a leading data and analytics company, and at Wells Fargo, she was responsible for helping low-income populations as head of philanthropy for financial health. She also led the Banking Inclusion Initiative, a 10-year commitment to help people access low-cost basic accounts and help those without bank accounts gain easy access to low-cost banking services and financial education.\n\nSee also\nList of Wells Fargo directors\nList of Wells Fargo presidents\nWells Fargo Arena\nWells Fargo Center\nWells Fargo History Museum\nBig Four banks\n\nReferences\nExternal links\n\nOfficial website \nBusiness data for Wells Fargo & Company:",
  "clean_text": "Wells Fargo & Company is an American multinational financial services company with a significant global presence. The company operates in 35 countries and serves over 70 million customers worldwide. It is a systemically important financial institution according to the Financial Stability Board, and is considered one of the \"Big Four Banks\" in the United States, alongside JPMorgan Chase, Bank of America, and Citigroup. The company's primary subsidiary is Wells Fargo Bank, N.A., a national bank that designates its Sioux Falls, South Dakota, site as its main office (and therefore is treated by most U.S. federal courts as a citizen of South Dakota). It is the fourth-largest bank in the United States by total assets and is also one of the largest as ranked by bank deposits and market capitalization. It has 8,050 branches and 13,000 automated teller machines and 2,000 stand-alone mortgage branches. It is the second-largest retail mortgage originator in the United States, originating one out of every four home loans, and services $1.8 trillion in home mortgages, one of the largest servicing portfolios in the U.S. It is one of the most valuable bank brands. Wells Fargo is ranked 47th on the Fortune 500 list of the largest companies in the U.S. In addition to banking, the company provides equipment financing via subsidiaries including Wells Fargo Rail and provides investment management and stockbrokerage services. A key part of Wells Fargo's business strategy is cross-selling, the practice of encouraging existing customers to buy additional banking services. This led to the Wells Fargo cross-selling scandal. Wells Fargo has international offices in London, Dublin, Paris, Milan, Dubai, Singapore, Tokyo, Shanghai, Beijing, and Toronto, among others. Back-offices are in India and the Philippines with more than 20,000 staff. Notably, Wells Fargo is the first major national U.S. bank to undergo a successful unionization drive. As of 2024, 20 branch locations have joined Wells Fargo Workers United-CWA, a division of Communications Workers of America, in less than a year. Wells Fargo operates under Charter No. 1, the first national bank charter issued in the United States. This charter was issued to First National Bank of Philadelphia on June 20, 1863, by the Office of the Comptroller of the Currency. Wells Fargo, in its present form, is a result of a merger between the original Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998. The merged company took the better-known Wells Fargo name and moved to Wells Fargo's hub in San Francisco. At the same time, Norwest's banking subsidiary merged with Wells Fargo's Sioux Falls-based banking subsidiary. Wells Fargo became a coast-to-coast bank with the 2008 acquisition of Charlotte-based Wachovia. History Henry Wells and William G. Fargo, who founded American Express along with John Butterfield, formed Wells Fargo & Company in 1852 to provide \"express\" and banking services to California, which was growing rapidly due to the California Gold Rush. Its earliest and most significant tasks included transporting gold from the Philadelphia Mint and \"express\" mail delivery that was faster and less expensive than U.S. Mail. American Express was not interested in serving California. By the end of the California Gold Rush, Wells Fargo was a dominant express and banking organization in the West, making large shipments of gold and delivering mail and supplies. It was also the primary lender of Butterfield Overland Mail Company, which ran a 2,757-mile route through the Southwest to San Francisco and was nicknamed the \"Butterfield Line\" after the name of the company's president, John Butterfield. In 1860, Congress failed to pass the annual Post Office appropriation bill, leaving the Post Office unable to pay Overland Mail Company. This caused Overland to default on its debts to Wells Fargo, allowing Wells Fargo to take control of the mail route. Wells Fargo then operated the western portion of the Pony Express. Six years later, the \"Grand Consolidation\" united Wells Fargo, Holladay, and Overland Mail stage lines under the Wells Fargo name. In 1872, Lloyd Tevis, a friend of the Central Pacific \"Big Four\" and holder of rights to operate an express service over the Transcontinental Railroad, became president of the company after acquiring a large stake, a position he held until 1892. In 1905, Wells Fargo separated its banking and express operations, and Wells Fargo's bank merged with the Nevada National Bank to form the Wells Fargo Nevada National Bank. During the First World War, the United States government nationalized Wells Fargo's express business into a federal agency known as the US Railway Express Agency (REA). After the war, the REA was privatized and continued service until 1975. In 1923, Wells Fargo Nevada merged with the Union Trust Company to form the Wells Fargo Bank & Union Trust Company. In 1954, Wells Fargo & Union Trust shortened its name to Wells Fargo Bank. Four years later, it merged with American Trust Company to form the Wells Fargo Bank American Trust Company. It changed its name back to Wells Fargo Bank in 1962. In 1968, Wells Fargo was converted to a federal banking charter and became Wells Fargo Bank, N.A. In that same year, Wells Fargo merged with Henry Trione's Sonoma Mortgage in a $10.8 million stock transfer, making Trione the largest shareholder in Wells Fargo until Warren Buffett and Walter Annenberg surpassed him. One year later, Wells Fargo & Company holding company was formed, with Wells Fargo Bank as its main subsidiary. In September 1983, a Wells Fargo armored truck depot in West Hartford, Connecticut, was the victim of the White Eagle robbery. The robbery was organized by Los Macheteros (a guerrilla group seeking Puerto Rican independence from the United States) and involved an insider armored truck guard. It was the largest US bank theft to date with $7.1 million stolen. Throughout the 1980s and '90s, Wells Fargo completed a series of acquisitions. In 1986, it acquired Crocker National Bank from Midland Bank. Then, in 1987 it acquired the personal trust business of Bank of America. In 1988, it acquired Barclays Bank of California from Barclays plc. In 1991, Wells Fargo spent $491 million to acquire 130 branches in California from Great American Bank. In 1996, Wells Fargo acquired First Interstate Bancorp for $11.6 billion. Integration went poorly as many executives left. Wells Fargo became the first major US financial services firm to offer internet banking, in May 1995. After its string of acquisitions, in 1998, Wells Fargo Bank was acquired by Norwest Corporation of Minneapolis, with the combined company assuming the Wells Fargo name. It then began on another set of acquisitions, starting in 2000, when Wells Fargo Bank acquired National Bank of Alaska and First Security Corporation. In late 2001, it acquired H.D. Vest Financial Services for $128 million, but sold it in 2015 for $580 million. The 2008 financial crisis resulted in many bank takeovers. In 2007, Wells Fargo acquired Greater Bay Bancorp, which had $7.4 billion in assets, in a $1.5 billion transaction. It also acquired Placer Sierra Bank and CIT Group's construction unit that same year. In 2008, Wells Fargo acquired United Bancorporation of Wyoming and Century Bancshares of Texas. On October 3, 2008, after Wachovia turned down an inferior offer from Citigroup, Wachovia agreed to be bought by Wells Fargo for about $14.8 billion in stock. The next day, a New York state judge issued a temporary injunction blocking the transaction from going forward while the competing offer from Citigroup was sorted out. Citigroup alleged that it had an exclusivity agreement with Wachovia that barred Wachovia from negotiating with other potential buyers. The injunction was overturned late in the evening on October 5, 2008, by the New York state appeals court. Citigroup and Wells Fargo then entered into negotiations brokered by the FDIC to reach an amicable solution to the impasse. The negotiations failed. Citigroup was unwilling to take on more risk than the $42 billion that would have been the cap under the previous FDIC-backed deal (with the FDIC incurring all losses over $42 billion). Citigroup did not block the merger, but sought damages of $60 billion for breach of an alleged exclusivity agreement with Wachovia. On October 28, 2008, Wells Fargo received $25 billion of funds via the Emergency Economic Stabilization Act in the form of a preferred stock purchase by the United States Department of the Treasury. As a result of requirements of the government stress tests, the company raised $8.6 billion in capital in May 2009. On December 23, 2009, Wells Fargo redeemed $25 billion of preferred stock issued to the United States Department of the Treasury. As part of the redemption of the preferred stock, Wells Fargo also paid accrued dividends of $131.9 million, bringing the total dividends paid to $1.441 billion since the preferred stock was issued in October 2008. In April 2009, Wells Fargo acquired North Coast Surety Insurance Services. In 2010, hedge fund administrator Citco purchased the trust company operation of Wells Fargo in the Cayman Islands. In 2011, the company hired 25 investment bankers from Citadel LLC. In April 2012, Wells Fargo acquired Merlin Securities. In December 2012, it was rebranded as Wells Fargo Prime Services. In December of that year, Wells Fargo acquired a 35% stake in The Rock Creek Group LP. The stake was increased to 65% in 2014 but sold back to management in July 2018. In 2015, Wells Fargo Rail acquired GE Capital Rail Services and merged in with First Union Rail. In late 2015, Wells Fargo acquired three GE units focused on business loans equipment financing. In March 2017, Wells Fargo announced a plan to offer smartphone-based transactions with mobile wallets including Wells Fargo Wallet, Android Pay and Samsung Pay. In June 2018, Wells Fargo sold all 52 of its physical bank branch locations in Indiana, Michigan, and Ohio to Flagstar Bank. In September 2018, Wells Fargo announced it would cut 26,450 jobs by 2020 to reduce costs by $4 billion. In March 2019, CEO Tim Sloan resigned amidst the Wells Fargo account fraud scandal and former general counsel C. Allen Parker became interim CEO. In July 2019, Principal Financial Group acquired the company's Institutional Retirement & Trust business. On September 27, 2019, Charles Scharf was announced as the firm's new CEO. In 2020, the company sold its student loan portfolio. In May 2021, the company sold its Canadian Direct Equipment Finance business to Toronto-Dominion Bank. In 2021, the company sold its asset management division, Wells Fargo Asset Management (WFAM) to private equity firms GTCR and Reverence Capital Partners for $2.1 billion. WFAM had $603 billion in assets under management as of December 31, 2020, of which 33% was invested in money market funds. WFAM was rebranded as Allspring Global Investments. On September 23, 2024, Wells Fargo launched a $1.6 billion delayed-draw term loan to support Tempur Sealy International's acquisition of Mattress Firm Group. In December 2024, Wells Fargo announced that it would be selling it decades-long San Francisco headquarters building to downsize its footprint in San Francisco by moving to another building nearby. The move was interpreted by bankers as a sign of the financial industry drifting away from San Francisco and California. In June 2025, Wells Fargo hired a senior banker from Citigroup to lead its activism defense practice, as corporations find it difficult to build out business units to help clients facing pressure from activist investors. In July 2025, Wells Fargo announced that it sought to end its partnership with Bilt Rewards ahead of schedule, a venture that initially began in 2022. Wells Fargo was losing as much as $10 million per month according to The Wall Street Journal. The partnership was initially set to end in 2029. Environmental record In 2022, Wells Fargo announced a goal of reducing absolute emissions by companies it lends to in the oil and gas sector by 26% by 2030 from 2019 levels. Some critics say these goals conflict with the bank being the largest lender to fossil fuel companies in the U.S. and one of the largest globally. The company has committed to net zero financed emissions by 2050; however, major environmental groups are skeptical that this goal will be achieved. The company has stated that it will not finance any hydrocarbon exploration projects in the Arctic. The company has also provided financing to renewable energy projects. In December 2024, Wells Fargo withdrew itself from its membership of Net- Zero Banking Alliance. Financing of Dakota Access Pipeline Wells Fargo is a lender on the Dakota Access Pipeline, a 1,172-mile-long (1,886 km) underground oil pipeline transport system in North Dakota. The pipeline has been controversial regarding its potential impact on the environment. In February 2017, the city councils of Seattle, Washington and Davis, California voted to move $3 billion of deposits from the bank due to its financing of the Dakota Access Pipeline as well as the Wells Fargo account fraud scandal. Lawsuits, fines, and controversies Regulatory issues The company has been the subject of several investigations by regulators. Many of these issues have resulted in reputational damage. On February 2, 2018, the Wells Fargo account fraud scandal resulted in the Federal Reserve barring Wells Fargo from growing its nearly $2 trillion asset base any further until the company fixed its internal problems to the satisfaction of the Federal Reserve. In June 2025, the Federal Reserve lifted the punitive asset cap, allowing the bank to pursue growth and provide more financing to corporate clients. Scharf called the decision “a pivotal milestone in our journey to transform Wells Fargo.\" In September 2021, Wells Fargo incurred further fines from the United States Justice Department charging fraudulent behavior by the bank against foreign-exchange currency trading customers. Bloomberg L.P. reported in March 2022 that Wells Fargo was the only major lender in 2020 to reject more home refinance applications from Black applicants than it approved. In December 2022, the U.S. levied a $3.7 billion loan-management fine upon Wells Fargo. In March 2023, Wells Fargo blamed a technical glitch for misstating the balances of customers' accounts, in many cases incorrectly deeming the customers as having a negative bank balance. Subsequently, in 2023, prison sentencing took place for employee-directed money laundering and funneling cash illegally to Mexico through the creation of fictitious accounts. 1981 MAPS Wells Fargo embezzlement scandal In 1981, it was discovered that a Wells Fargo assistant operations officer, Lloyd Benjamin \"Ben\" Lewis, had perpetrated one of the largest embezzlements in history through its Beverly Drive branch. During 1978–1981, Lewis had successfully written phony debit and credit receipts to benefit boxing promoters Harold J. Smith (né Ross Eugene Fields) and Sam \"Sammie\" Marshall, chairman and president, respectively, of Muhammad Ali Professional Sports, Inc. (MAPS), of which Lewis was also listed as a director; Marshall, too, was a former employee of the same Wells Fargo branch as Lewis. In excess of $300,000 was paid to Lewis, who pled guilty to embezzlement and conspiracy charges in 1981, and testified against his co-conspirators for a reduced five-year sentence. (Boxer Muhammad Ali had received a fee for the use of his name, and had no other involvement with the organization.) Higher costs charged to African-American and Hispanic borrowers Illinois Attorney General Lisa Madigan filed suit against Wells Fargo on July 31, 2009, alleging that the bank steered African Americans and Hispanics into high-cost subprime loans. A Wells Fargo spokesman responded that \"The policies, systems, and controls we have in place – including in Illinois – ensure race is not a factor...\" An affidavit filed in the case stated that loan officers had referred to black mortgage-seekers as \"mud people,\" and the subprime loans as \"ghetto loans.\" According to Beth Jacobson, a loan officer at Wells Fargo interviewed for a report in The New York Times, \"We just went right after them. Wells Fargo mortgage had an emerging-markets unit that specifically targeted black churches because it figured church leaders had a lot of influence and could convince congregants to take out subprime loans.\" The report presented data from the city of Baltimore, where more than half the properties subject to foreclosure on a Wells Fargo loan from 2005 to 2008 now stand vacant, and 71 percent of those are in predominantly black neighborhoods. Wells Fargo agreed to pay $125 million to subprime borrowers and $50 million in direct down payment assistance in certain areas, for a total of $175 million. Failure to monitor suspected money laundering In a March 2010 agreement with US federal prosecutors, Wells Fargo acknowledged that between 2004 and 2007 Wachovia had failed to monitor and report suspected money laundering by narcotics traffickers, including the cash used to buy four planes that shipped a total of 22 tons of cocaine into Mexico. Overdraft fees In August 2010, Wells Fargo was fined by United States district court judge William Alsup for overdraft practices designed to \"gouge\" consumers and \"profiteer\" at their expense, and for misleading consumers about how the bank processed transactions and assessed overdraft fees. In May 2013, Wells Fargo paid $203 million to settle class-action litigation accusing the bank of imposing excessive overdraft fees on checking-account customers. Settlement and fines regarding mortgage servicing practices On February 9, 2012, it was announced that the five largest mortgage servicers (Ally Financial, Bank of America, Citigroup, JPMorgan Chase, and Wells Fargo) agreed to a settlement with the US Federal Government and 49 states over improper foreclosure practices in the 2010 United States foreclosure crisis, including \"robo-signing\" (having someone fraudulently sign that they know the contents of a document they do not in fact know) and foreclosing without standing via MERS. The settlement, known as the National Mortgage Settlement (NMS), required the servicers to provide about $26 billion in relief to distressed homeowners and in direct payments to the federal and state governments; Wells Fargo's share was the second largest, at $5.4 billion. This settlement amount makes the NMS the second largest civil settlement in U.S. history, only trailing the Tobacco Master Settlement Agreement. The five banks were also required to comply with 305 new mortgage servicing standards. Oklahoma held out and agreed to settle with the banks separately. On April 5, 2012, a federal judge ordered Wells Fargo to pay $3.1 million in punitive damages over a single loan, one of the largest fines for a bank ever for mortgaging service misconduct, after the bank improperly charged Michael Jones, a New Orleans homeowner, with $24,000 in mortgage fees, after the bank misallocated payments to interest instead of principal. Elizabeth Magner, a federal bankruptcy judge in the Eastern District of Louisiana, cited the bank's behavior as \"highly reprehensible\", stating that Wells Fargo has taken advantage of borrowers who rely on the bank's accurate calculations. The award was affirmed on appeal in 2013. In May 2013, New York attorney-general Eric Schneiderman announced a lawsuit against Wells Fargo over alleged violations of the national mortgage settlement. Schneidermann claimed Wells Fargo had violated rules over giving fair and timely serving. In 2015, a judge sided with Wells Fargo. SEC fine due to inadequate risk disclosures On August 14, 2012, Wells Fargo agreed to pay around $6.5 million to settle U.S. Securities and Exchange Commission (SEC) charges that in 2007 it sold risky mortgage-backed securities without fully realizing their dangers. Lawsuit by FHA over loan underwriting In 2016, Wells Fargo agreed to pay $1.2 billion to settle allegations that the company violated the False Claims Act by underwriting over 100,000 Federal Housing Administration (FHA) backed loans when over half of the applicants did not qualify for the program. In October 2012, Wells Fargo was sued by United States Attorney Preet Bharara over questionable mortgage deals. Lawsuit due to premium inflation on forced place insurance In April 2013, Wells Fargo settled a suit with 24,000 Florida homeowners alongside insurer QBE Insurance, in which Wells Fargo was accused of inflating premiums on forced-place insurance. Violation of New York credit card laws In February 2015, Wells Fargo agreed to pay $4 million, including a $2 million penalty and $2 million in restitution for illegally taking an interest in the homes of borrowers in exchange for opening credit card accounts for the homeowners. Tax liability and lobbying In December 2011, Public Campaign criticized Wells Fargo for spending $11 million on lobbying during 2008–2010, while increasing executive pay and laying off workers, while having no federal tax liability due to losses from the Great Recession. However, in 2013, the company paid $9.1 billion in income taxes. Prison industry investment The company has invested its clients' funds in GEO Group, a multi-national provider of for-profit private prisons. By March 2012, its stake had grown to more than 4.4 million shares worth $86.7 million. As of November 2012, Wells Fargo divested 33% of its holdings of GEO's stock, reducing its stake to 4.98% of Geo Group's common stock, below the threshold of which it must disclose further transactions. Discrimination against African Americans in hiring In August 2020, the company agreed to pay $7.8 million in back wages for allegedly discriminating against 34,193 African Americans in hiring for tellers, personal bankers, customer sales and service representatives, and administrative support positions. The company agreed to provide jobs to 580 of the affected applicants. SEC settlement for insider trading case In May 2015, Gregory T. Bolan Jr., a stock analyst at Wells Fargo agreed to pay $75,000 to the U.S. Securities and Exchange Commission to settle allegations that he gave Joseph C. Ruggieri, a stock trader, insider information on probable ratings charges. Ruggieri was not convicted of any crime. Wells Fargo cross-selling scandal In September 2016, Wells Fargo was issued a combined total of $185 million in fines for opening over 1.5 million checking and savings accounts and 500,000 credit cards on behalf of customers without their consent. The Consumer Financial Protection Bureau (CFPB) issued $100 million in fines, the largest in the agency's five-year history, along with $50 million in fines from the City and County of Los Angeles, and $35 million in fines from the Office of Comptroller of the Currency. The scandal was caused by an incentive-compensation program for employees to create new accounts. It led to the firing of nearly 5,300 employees and $5 million being set aside for customer refunds on fees for accounts the customers never wanted. Carrie Tolstedt, who headed the department, retired in July 2016 and received $124.6 million in stock, options, and restricted Wells Fargo shares as a retirement package. On October 12, 2016, John Stumpf, the then chairman and CEO, announced that he would be retiring amidst the scandals. President and chief operating officer Timothy J. Sloan succeeded Stumpf, effective immediately. Following the scandal, applications for credit cards and checking accounts at the bank plummeted. In response to the event, the Better Business Bureau dropped accreditation of the bank. Several states and cities ended business relations with the company. An investigation by the Wells Fargo board of directors, the report of which was released in April 2017, primarily blamed Stumpf, who it said had not responded to evidence of wrongdoing in the consumer services division, and Tolstedt, who was said to have knowingly set impossible sales goals and refused to respond when subordinates disagreed with them. Wells Fargo coined the phrase, \"Go for Gr-Eight\" – or, in other words, aim to sell at least 8 products to every customer. The board chose to use a clawback clause in the retirement contracts of Stumpf and Tolstedt to recover $75 million worth of cash and stock from the former executives. In February 2020, the company agreed to pay $3 billion to settle claims by the United States Department of Justice and the Securities and Exchange Commission. The settlement did not prevent individual employees from being targets of future litigation. The Federal Reserve put a limit to Wells Fargo's assets, as a result of the scandal. In 2020, Wells Fargo sold $100 million in assets to stay under the limit. In December 2022, the bank agreed to a settlement with the CFPB of $3.7 billion over abuses tied to the fake account scandal as well as mortgages and auto loans. The total was split between $1.7 billion for a civil penalty and $2 billion for customers. Separately, in May 2023, the bank agreed to pay $1 billion to settle a shareholder class-action suit. Racketeering lawsuit for mortgage appraisal overcharges In November 2016, Wells Fargo agreed to pay $50 million to settle allegations of overcharging hundreds of thousands of homeowners for appraisals ordered after they defaulted on their mortgage loans. While banks are allowed to charge homeowners for such appraisals, Wells Fargo frequently charged homeowners fees of $95 to $125 on appraisals for which the bank had been charged $50 or less. The plaintiffs had sought triple damages under the U.S. Racketeer Influenced and Corrupt Organizations Act on grounds that sending invoices and statements with fraudulently concealed fees constituted mail and wire fraud sufficient to allege racketeering. Failure to comply with document security requirements In December 2016, the Financial Industry Regulatory Authority fined Wells Fargo $5.5 million for failing to store electronic documents in a \"write once, read many\" format, which makes it impossible to alter or destroy records after they are written. Doing business with the gun industry and NRA From December 2012 through February 2018, Wells Fargo reportedly helped two of the biggest firearms and ammunition companies obtain $431.1 million in loans. It also handled banking for the National Rifle Association of America (NRA) and provided bank accounts and a $28-million line of credit. In 2020, the company said that it was winding down its business with the NRA. Scharf claimed Wells Fargo's relationship with the NRA was \"declining,\" with the company no longer participating in the organization's line of credit and mortgage loan commitments. Discrimination against female workers In June 2018, about a dozen female Wells Fargo executives from the wealth management division met in Scottsdale, Arizona to discuss the minimal presence of women occupying senior roles within the company. The meeting, dubbed \"the meeting of 12\", represented the majority of the regional managing directors, of which 12 out of 45 were women. Wells Fargo had previously been investigating reports of gender bias in the division in the months leading up to the meeting. The women reported that they had been turned down for top jobs despite their qualifications, and instead the roles were occupied by men. There were also complaints against company president Jay Welker, who is also the head of the Wells Fargo wealth management division, due to his sexist statements regarding female employees. The female workers claimed that he called them \"girls\" and said that they \"should be at home taking care of their children.\" Overselling auto insurance On June 10, 2019, Wells Fargo agreed to pay $385 million to settle a lawsuit accusing it of allegedly scamming millions of auto-loan customers into buying insurance they did not need from National General Insurance. In February 2023, Wells Fargo agreed to pay $300 million in a settlement with shareholders over auto insurance disclosures. Failure to Supervise Registered Representatives On August 28, 2020, Wells Fargo agreed to pay a fine of $350,000 as well as $10 million in restitution payments to certain customers after the Financial Industry Regulatory Authority accused the company of failing to reasonably supervise two of its registered representatives that recommended that customers invest a high percentage of their assets in high-risk energy securities in 2014 and 2015. Steering customers to more expensive retirement accounts In April 2018, the United States Department of Labor launched a probe into whether Wells Fargo was pushing its customers into more expensive retirement plans as well as into retirement funds managed by Wells Fargo itself. Alteration of documents In May 2018, the company discovered that its business banking group had improperly altered documents about business clients in 2017 and early 2018. Executive compensation With CEO John Stumpf being paid 473 times more than the median employee, Wells Fargo ranked number 33 among the S&P 500 companies for CEO—employee pay inequality. In October 2014, a Wells Fargo employee earning $15 per hour emailed the CEO—copying 200,000 other employees—asking that all employees be given a $10,000 per year raise taken from a portion of annual corporate profits to address wage stagnation and income inequality. After being contacted by the media, Wells Fargo responded that all employees receive \"market competitive\" pay and benefits significantly above U.S. federal minimums. Pursuant to Section 953(b) of the Dodd-Frank Wall Street Reform and Consumer Protection Act, publicly traded companies are required to disclose (1) the median total annual compensation of all employees other than the CEO and (2) the ratio of the CEO's annual total compensation to that of the median employee. Aggressive freezing and closing of bank accounts The Consumer Financial Protection Bureau found that, between 2011 and 2016, Wells Fargo had been freezing entire consumer deposit accounts based on automated fraud detection. This freeze extended to the entire account, not just the suspicious amount, and all access to funds was blocked. As a result, customers were unable to access their funds until the accounts were closed and the funds were returned. In 2022, the Consumer Financial Protection Bureau mandated that Wells Fargo provide $160 million in compensation to more than a million individuals, addressing the significant harm caused by its aggressive tactic of freezing and closing bank accounts during the period from 2011 to 2016. Banker blocked from leaving China On 17 July 2025, Mao Chenyue, a managing director of Wells Fargo, was subjected to an exit ban in China amid an investigation of a criminal case that involved her, as confirmed by Guo Jiakun, a spokesperson of the Ministry of Foreign Affairs. In response to her exit restrictions, WF announced that they would be suspending employee travel to China. In popular culture The company was a theme or the subject in several films. In the 1939 John Ford-directed movie \"Stagecoach\", at the 5:22 mark two men can be seen hoisting a chest plainly marked \"Wells Fargo.\" Seven Men from Now (a 1956 film), Cheyenne (the 1947 film), Wells Fargo (a 1937 film) and Unclaimed Goods (a 1918 silent) are examples. A long running television series, Tales of Wells Fargo ran from 1957 to 1962, focusing on a fictitious Wells Fargo special agent. Wells Fargo stagecoaches are mentioned in the song \"The Deadwood Stage (Whip-Crack-Away!)\" in the 1953 film Calamity Jane performed by Doris Day: \"With a fancy cargo, care of Wells and Fargo, Illinois - Boy!\". Wells Fargo is also shown as the delivery service bringing the instruments for the town band in the 1962 film The Music Man. A Wells Fargo & Company stagecoach is seen passing through the town of Hill Valley as Marty is walking down the street in the 1990 film, Back to the Future Part III. The song \"The Wells Fargo Wagon\" is part of the Broadway musical The Music Man, referring to Wells, Fargo & Company's stagecoach delivery in the early 20th century, the time in which The Music Man is set. Charity On March 2, 2022, Wells Fargo announced $1 million donation to the American Red Cross that will be used for Ukrainian refugees fleeing from the Russian invasion. In April 2022, The Wells Fargo foundation announced its pledge of $210 million toward racial equity in homeownership. With $60 million of the donation awarded in Wealth Opportunities Restored through Homeownership (WORTH) grants which will run until 2025. Additionally, $150 million will be committed to lower mortgage rates and reducing the refinancing costs to aid minority homeowners. In April 2023, TD Jakes Group and Wells Fargo have formalized a 10-year partnership to create inclusive communities for people of all income levels. Wells Fargo has committed approximately $1 billion to fund projects that align with the overall strategy. The first of the projects focuses on the development of mixed-income housing and retail facilities outside of Atlanta. In December 2023, Wells Fargo appointed Darlene Goins as president of the Wells Fargo Foundation and Head of Philanthropy and Community Impact. Previously, she had held leadership roles at FICO, a leading data and analytics company, and at Wells Fargo, she was responsible for helping low-income populations as head of philanthropy for financial health. She also led the Banking Inclusion Initiative, a 10-year commitment to help people access low-cost basic accounts and help those without bank accounts gain easy access to low-cost banking services and financial education."
}