{
  "ticker": "WMB",
  "cik": "0000107263",
  "company_name": "Williams Companies",
  "corrected_name": "Williams Companies",
  "wiki_title_used": "Williams Companies",
  "exists": true,
  "raw_text": "The Williams Companies, Inc. is an American energy company based in Tulsa, Oklahoma. Its core business is natural gas processing and transportation, with additional petroleum and electricity generation assets. A Fortune 500 company, its common stock is a component of the S&P 500.\n\nHistory\nIt was founded as Williams Brothers in 1908 by Miller and David Williams in Fort Smith, Arkansas, and soon expanded to building nationwide pipelines for natural gas and petroleum. The company relocated to Tulsa in 1919.  In 1949, John H. Williams, a nephew of the founders, together with his brother Charles Williams and David's son David Williams Jr., bought the business from the founders; John H. Williams remained as president of the company until 1971 and CEO until 1979.\nThe company went public in 1957 under the Williams Brothers name.  As it diversified in the 1970s, it was renamed The Williams Companies, Inc.  Since 1997, their brand identity has been simplified to \"Williams\".\nIn 1966, Williams bought the then-largest petroleum products pipeline in America, known as the Great Lakes Pipeline Company, for about $287 million. In 1982, it expanded into natural gas transportation with the purchase of Northwest Energy Company, and extended their reach to the East Coast with the 1995 purchase of Transco Energy Company.\nIn 2001, Williams acquired Barrett Resources, which provided them with additional national gas reserves.\nIn 2002, the company found itself in financial distress due to changed market conditions, its competition with Enron Corp. and the large debt of its subsidiary Williams Communications Group. The company obtained and paid off an emergency high interest loan from Warren Buffett to stay out of bankruptcy, and redirected its focus toward natural gas production, processing, and transportation as well as increasing its resource holdings. One of the moves it made around that time (2004) was the sale of two of Canada's largest natural gas straddle plants, and its interest in another to Inter Pipeline Fund for US$540 million.\nIn 2010, the company underwent a major restructuring that included a reorganization of its extensive pipeline holdings in Williams Partners LP. In October 2010, Williams and Williams Partners LP announced that chairman and chief executive officer Steve Malcolm would retire at the end of the year. The board of directors at Williams said it had elected Alan Armstrong to succeed Malcolm as CEO effective January 3, 2011. Armstrong had served as senior vice president of Williams since 2002.\nOn February 16, 2011, Williams' board of directors had approved pursuing a plan to separate the company's businesses into two stand-alone, publicly traded corporations. The plan calls for Williams to separate its exploration and production business via an initial public offering in third-quarter 2011 of up to 20 percent of its interest and, in 2012, a tax-free spinoff to Williams shareholders of its remaining interest. The company's former exploration and production business, WPX Energy Inc., began trading on the New York Stock Exchange on Jan. 3, 2011. The spinoff was completed with the Dec. 31, 2011, distribution of one share of WPX Energy common stock for every three shares of Williams common stock. Williams became an infrastructure company, and many of its pipeline assets are held through the master limited partnership Williams Partners LP.\n\nTelecommunications\nThe company helped to get the modern telecommunications industry off the ground by running fiber optic cable through its decommissioned pipelines.  It built two nationwide networks, which subsequently spun off into separate companies.  The first was sold in 1995 to LDDS, which would become WorldCom & then MCI). The second was spun off in 2001 as Williams Communications, filed for bankruptcy the following year, adopted the name WilTel Communications, and ultimately was acquired by and consolidated into Level 3 Communications.\n\nLawsuits and fines\nIn 2002, Williams Communications Group was sued because company officials did not properly disclose the failing company's true financial condition, the officials' public statements belied the firm's plummeting fiscal picture. In 2007, the Williams Companies agreed to pay $290 million.\nBoardwalk Pipeline Partners and the Williams Companies were fined $2.4 million for 18 incidents that took place between 2006 and 2013. These incidents included one where they failed to monitor corrosion and another, where they waited to repair a natural gas line showing metal loss in Kentucky.\n\nRestatement\nOn March 1, 1999, Jack D. McCarthy, chief financial officer, said the company's additional review and its annual audit process resulted in\nthe previously announced 1998 pre-tax income being adjusted downward by $21.2 million.\nOn September 16, 2004, Williams Cos. said it amended its fiscal 2003 and first-quarter 2004 filings with the Securities and Exchange Commission to show a reclassification to its discontinued operations and a segment reporting change.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Williams Companies: \nVoices of Oklahoma interview with John Williams. First person interview conducted on September 30, 2009, with John Williams.\n\"Williams Companies\" at Encyclopedia of Oklahoma History and Culture",
  "clean_text": "The Williams Companies, Inc. is an American energy company based in Tulsa, Oklahoma. Its core business is natural gas processing and transportation, with additional petroleum and electricity generation assets. A Fortune 500 company, its common stock is a component of the S&P 500. History It was founded as Williams Brothers in 1908 by Miller and David Williams in Fort Smith, Arkansas, and soon expanded to building nationwide pipelines for natural gas and petroleum. The company relocated to Tulsa in 1919. In 1949, John H. Williams, a nephew of the founders, together with his brother Charles Williams and David's son David Williams Jr., bought the business from the founders; John H. Williams remained as president of the company until 1971 and CEO until 1979. The company went public in 1957 under the Williams Brothers name. As it diversified in the 1970s, it was renamed The Williams Companies, Inc. Since 1997, their brand identity has been simplified to \"Williams\". In 1966, Williams bought the then-largest petroleum products pipeline in America, known as the Great Lakes Pipeline Company, for about $287 million. In 1982, it expanded into natural gas transportation with the purchase of Northwest Energy Company, and extended their reach to the East Coast with the 1995 purchase of Transco Energy Company. In 2001, Williams acquired Barrett Resources, which provided them with additional national gas reserves. In 2002, the company found itself in financial distress due to changed market conditions, its competition with Enron Corp. and the large debt of its subsidiary Williams Communications Group. The company obtained and paid off an emergency high interest loan from Warren Buffett to stay out of bankruptcy, and redirected its focus toward natural gas production, processing, and transportation as well as increasing its resource holdings. One of the moves it made around that time (2004) was the sale of two of Canada's largest natural gas straddle plants, and its interest in another to Inter Pipeline Fund for US$540 million. In 2010, the company underwent a major restructuring that included a reorganization of its extensive pipeline holdings in Williams Partners LP. In October 2010, Williams and Williams Partners LP announced that chairman and chief executive officer Steve Malcolm would retire at the end of the year. The board of directors at Williams said it had elected Alan Armstrong to succeed Malcolm as CEO effective January 3, 2011. Armstrong had served as senior vice president of Williams since 2002. On February 16, 2011, Williams' board of directors had approved pursuing a plan to separate the company's businesses into two stand-alone, publicly traded corporations. The plan calls for Williams to separate its exploration and production business via an initial public offering in third-quarter 2011 of up to 20 percent of its interest and, in 2012, a tax-free spinoff to Williams shareholders of its remaining interest. The company's former exploration and production business, WPX Energy Inc., began trading on the New York Stock Exchange on Jan. 3, 2011. The spinoff was completed with the Dec. 31, 2011, distribution of one share of WPX Energy common stock for every three shares of Williams common stock. Williams became an infrastructure company, and many of its pipeline assets are held through the master limited partnership Williams Partners LP. Telecommunications The company helped to get the modern telecommunications industry off the ground by running fiber optic cable through its decommissioned pipelines. It built two nationwide networks, which subsequently spun off into separate companies. The first was sold in 1995 to LDDS, which would become WorldCom & then MCI). The second was spun off in 2001 as Williams Communications, filed for bankruptcy the following year, adopted the name WilTel Communications, and ultimately was acquired by and consolidated into Level 3 Communications. Lawsuits and fines In 2002, Williams Communications Group was sued because company officials did not properly disclose the failing company's true financial condition, the officials' public statements belied the firm's plummeting fiscal picture. In 2007, the Williams Companies agreed to pay $290 million. Boardwalk Pipeline Partners and the Williams Companies were fined $2.4 million for 18 incidents that took place between 2006 and 2013. These incidents included one where they failed to monitor corrosion and another, where they waited to repair a natural gas line showing metal loss in Kentucky. Restatement On March 1, 1999, Jack D. McCarthy, chief financial officer, said the company's additional review and its annual audit process resulted in the previously announced 1998 pre-tax income being adjusted downward by $21.2 million. On September 16, 2004, Williams Cos. said it amended its fiscal 2003 and first-quarter 2004 filings with the Securities and Exchange Commission to show a reclassification to its discontinued operations and a segment reporting change."
}