{
  "ticker": "WRB",
  "cik": "0000011544",
  "company_name": "W. R. Berkley Corporation",
  "corrected_name": "W. R. Berkley Corporation",
  "wiki_title_used": "W. R. Berkley Corporation",
  "exists": true,
  "raw_text": "W. R. Berkley Corporation is an American commercial lines property and casualty insurance holding company organized in Delaware and based in Greenwich, Connecticut.\nThe company operates commercial insurance businesses in the United Kingdom, Continental Europe, South America, Canada, Mexico, Scandinavia, Asia and Australia and reinsurance businesses in the United States, United Kingdom, Continental Europe, Australia, the Asia-Pacific region and South Africa.\nThe company is ranked 397th on the Fortune 500.\n\nHistory\nW. R. Berkley Corporation was founded in 1967 by William R. Berkley, who currently serves as Executive Chairman.\nIn November 1973, the company became a public company via an initial public offering. At that time, the founder owned 23.8% of the company.\nIn 1994, the company acquired Key Risk Management Services Inc.\nIn 1995, the company acquired the remaining 40% interest in Signet Star from Gen Re. The company also acquired MECC for $138 million.\nIn August 2006, the company acquired Garnet Captive Services LLC, a San Francisco insurance brokerage and alternative risk consulting firm.\nOn October 31, 2015, Mr. Berkley's son, W. Robert Berkley, Jr., became President and CEO.\n\nReferences\nExternal links\nOfficial website\nBusiness data for W. R. Berkley Corporation:",
  "clean_text": "W. R. Berkley Corporation is an American commercial lines property and casualty insurance holding company organized in Delaware and based in Greenwich, Connecticut. The company operates commercial insurance businesses in the United Kingdom, Continental Europe, South America, Canada, Mexico, Scandinavia, Asia and Australia and reinsurance businesses in the United States, United Kingdom, Continental Europe, Australia, the Asia-Pacific region and South Africa. The company is ranked 397th on the Fortune 500. History W. R. Berkley Corporation was founded in 1967 by William R. Berkley, who currently serves as Executive Chairman. In November 1973, the company became a public company via an initial public offering. At that time, the founder owned 23.8% of the company. In 1994, the company acquired Key Risk Management Services Inc. In 1995, the company acquired the remaining 40% interest in Signet Star from Gen Re. The company also acquired MECC for $138 million. In August 2006, the company acquired Garnet Captive Services LLC, a San Francisco insurance brokerage and alternative risk consulting firm. On October 31, 2015, Mr. Berkley's son, W. Robert Berkley, Jr., became President and CEO."
}