{
  "ticker": "WSM",
  "cik": "0000719955",
  "company_name": "Williams-Sonoma, Inc.",
  "corrected_name": "Williams-Sonoma, Inc.",
  "wiki_title_used": "Williams-Sonoma, Inc.",
  "exists": true,
  "raw_text": "Williams-Sonoma, Inc., is an American publicly traded consumer retail company that sells kitchenware and home furnishings. It is headquartered in San Francisco, California, United States. The company has 625 brick and mortar stores and distributes to more than 60 countries, with brands including Williams Sonoma, Williams Sonoma Home, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Mark and Graham, and Rejuvenation. Williams-Sonoma, Inc., also operates through eight corresponding websites and a gift registry.\nThe company is one of the largest e-commerce retailers in the U.S., and one of the biggest multi-channel specialty retailers in the world. In 2019, Williams-Sonoma, Inc., was named as a Fortune 500 company for the first time in its history.\n\nHistory\nWilliams-Sonoma, Inc., had its initial public offering in July 1983. One million shares were offered on the OTC Market at $23 a share. At the end of 1985, the company was generating over $51 million in sales. In September 1986, Williams-Sonoma, Inc., acquired Pottery Barn from Gap. The acquisition included Pottery Barn's 27 housewares stores located in California, Connecticut, New Jersey, and New York for $6 million. The company's expansion led to the opening of its first distribution center in Memphis, Tennessee, in 1984. Williams-Sonoma, Inc., was one of the largest proprietary distributors in the Memphis area with 3.5 million square feet of distribution space.\nFrom 1986 to 1989, Williams-Sonoma, Inc., grew by an average of 12 stores per year, bringing the total locations to over 100 stores in the U.S. It was listed on the New York Stock Exchange starting in 1998, while sales reached $1 billion for the first time.\nThe following year, Williams-Sonoma, Inc., launched its e-commerce websites. The company also launched Pottery Barn Kids, a spin-off of Pottery Barn that specializes in home furnishings for children.\nThe Pottery Barn brand further expanded with the launch of PBteen in early 2003. Pottery Barn extended its merchandising with the introduction of the Pottery Barn Bed & Bath and Pottery Barn Kids in Manhattan.\nBy 2009, Williams-Sonoma, Inc., was operating 610 stores with an annual revenue of over $3 billion. In May 2010, Lester retired, and Laura Alber was named CEO of the umbrella organization. Alber joined the company in 1995. She was active in building the Pottery Barn catalog and the development and launch of Pottery Barn Kids and PBteen. In November 2011, the company acquired Portland, Oregon-based Rejuvenation, a manufacturer and direct marketer of light fixtures and hardware with stores in Portland, Seattle, and Los Angeles. The company launched a lifestyle brand offering personalized products, Mark and Graham, in November 2012.\nWilliams Sonoma's e-commerce sales were approximately 52 percent of its parent company's revenue of the first quarter of 2015.\nThe West Elm brand was launched in 2002 with the release of a catalog; the following year, the brand opened its first store. Through the West Elm brand, the company launched West Elm Hotels. The joint venture  with DDK hospitality management and development company has locations in Detroit, Michigan, Indianapolis, Indiana, Minneapolis, Minnesota, Oakland, California and Savannah, Georgia.\nThe West Elm brand is active with the Clinton Global Initiative and in 2013 agreed to invest $35 million on hand made goods from U.S. and abroad to sell in its stores over the course of two years. The collaborations were aimed to positively impact over 4,000 artisan workers. Former President Bill Clinton visited a West Elm showroom after the company spent nearly that amount in the first year of the agreement. In 2015, the company made a pledge at the Clinton Global Initiative Annual Meeting to expand its Fair Trade Certified product offerings.\nIn March 2021, commercial marketing services provider CoStar reported that Williams-Sonoma would be opening new distribution centers and closing up to a quarter of its stores as it continued a migration to e-commerce.\nAs of January 2024, Williams-Sonoma share prices were up over 65% in the previous year, and over four times that in the previous five years. In June 2024, the company announced a two-for-one stock split.\n\nInternational presence\nCanada\nIn October 2001, the company opened its first international stores in Toronto, Ontario, Canada. The Williams-Sonoma and Pottery Barn stores in Yorkville occupied a combined 37,000 square feet of space at the retail podium of the 100 Bloor Street West condominium; these stores closed in 2017 after the landlord substantially raised rents in 2014.\n\nLatin America\nIn 2008, the company opened Pottery Barn and West Elm stores at Plaza Las Americas in Hato Rey, Puerto Rico, a district of the capital San Juan.\nFor Mexico, in 2014, El Puerto de Liverpool, which operates two nationwide department store chains (Liverpool) and Suburbia, signed a franchise agreement to operate stores and e-commerce sites for six brands. Brand covered are Williams-Sonoma, Pottery Barn, Pottery Barn Kids, PB Teen, West Elm.\n\nMiddle East\nIn 2010, Williams-Sonoma, Inc., partnered with M.H. Alshaya Co. to launch Pottery Barn and Pottery Barn Kids franchise operations in the Middle East. The first Williams-Sonoma brand store outside of North America opened in Kuwait in 2012, along with West Elm at The Avenues Mall, the largest shopping center in Kuwait.\n\nEurope\nThe company opened its first store in the United Kingdom in 2014 with the launch of its West Elm location in London.\n\nAsia Pacific\nWilliams-Sonoma, Inc., opened four stores (Williams-Sonoma, Pottery Barn, Pottery Barn Kids, and West Elm) in Australia in 2015 as the first retail locations outside of North America owned and operated by Williams-Sonoma, Inc.\nIn the same year, the company also opened Pottery Barn and Pottery Barn Kids stores with a franchise partner in the Philippines.\n\nBrands\nUnder the umbrella organization of Williams-Sonoma, Inc., the company's brands are:\n\nWilliams Sonoma – upscale products for the kitchen and home\nWilliams Sonoma Home – upscale home furnishings\nPottery Barn – home furnishings\nPottery Barn Kids – home furnishings for children\nPBteen – home furnishings for young adults\nWest Elm – modern furniture and home decor\nRejuvenation – light fixtures, hardware and home furnishings\nMark and Graham – monogrammed gifts and accessories\nGreen Row – sustainably sourced furnishings\n\nControversies\nIn March 2020, the Federal Trade Commission (FTC) announced a settlement with Williams-Sonoma, Inc., over false advertising claims where Goldtouch Bakeware products, Rejuvenation-branded products, and Pottery Barn Teen and Pottery Barn Kids-branded upholstered furniture products were falsely advertised as being made in the USA. As part of the settlement with the FTC, Williams-Sonoma, Inc., agreed to stop making false, misleading or unsubstantiated \"Made in USA\" claims and is required to pay $1 million to the FTC.\nIn April 2024, the FTC fined the Williams-Sonoma almost $3.2 million for violating the FTC's 2020 order to be truthful about whether its products were made in the US, which marked the largest-ever civil penalty in a \"Made in USA\" case.\n\nSee also\nCharles E. Williams\nW. Howard Lester\n\nReferences\nExternal links\nOfficial website\nBusiness data for Williams-Sonoma, Inc.:",
  "clean_text": "Williams-Sonoma, Inc., is an American publicly traded consumer retail company that sells kitchenware and home furnishings. It is headquartered in San Francisco, California, United States. The company has 625 brick and mortar stores and distributes to more than 60 countries, with brands including Williams Sonoma, Williams Sonoma Home, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Mark and Graham, and Rejuvenation. Williams-Sonoma, Inc., also operates through eight corresponding websites and a gift registry. The company is one of the largest e-commerce retailers in the U.S., and one of the biggest multi-channel specialty retailers in the world. In 2019, Williams-Sonoma, Inc., was named as a Fortune 500 company for the first time in its history. History Williams-Sonoma, Inc., had its initial public offering in July 1983. One million shares were offered on the OTC Market at $23 a share. At the end of 1985, the company was generating over $51 million in sales. In September 1986, Williams-Sonoma, Inc., acquired Pottery Barn from Gap. The acquisition included Pottery Barn's 27 housewares stores located in California, Connecticut, New Jersey, and New York for $6 million. The company's expansion led to the opening of its first distribution center in Memphis, Tennessee, in 1984. Williams-Sonoma, Inc., was one of the largest proprietary distributors in the Memphis area with 3.5 million square feet of distribution space. From 1986 to 1989, Williams-Sonoma, Inc., grew by an average of 12 stores per year, bringing the total locations to over 100 stores in the U.S. It was listed on the New York Stock Exchange starting in 1998, while sales reached $1 billion for the first time. The following year, Williams-Sonoma, Inc., launched its e-commerce websites. The company also launched Pottery Barn Kids, a spin-off of Pottery Barn that specializes in home furnishings for children. The Pottery Barn brand further expanded with the launch of PBteen in early 2003. Pottery Barn extended its merchandising with the introduction of the Pottery Barn Bed & Bath and Pottery Barn Kids in Manhattan. By 2009, Williams-Sonoma, Inc., was operating 610 stores with an annual revenue of over $3 billion. In May 2010, Lester retired, and Laura Alber was named CEO of the umbrella organization. Alber joined the company in 1995. She was active in building the Pottery Barn catalog and the development and launch of Pottery Barn Kids and PBteen. In November 2011, the company acquired Portland, Oregon-based Rejuvenation, a manufacturer and direct marketer of light fixtures and hardware with stores in Portland, Seattle, and Los Angeles. The company launched a lifestyle brand offering personalized products, Mark and Graham, in November 2012. Williams Sonoma's e-commerce sales were approximately 52 percent of its parent company's revenue of the first quarter of 2015. The West Elm brand was launched in 2002 with the release of a catalog; the following year, the brand opened its first store. Through the West Elm brand, the company launched West Elm Hotels. The joint venture with DDK hospitality management and development company has locations in Detroit, Michigan, Indianapolis, Indiana, Minneapolis, Minnesota, Oakland, California and Savannah, Georgia. The West Elm brand is active with the Clinton Global Initiative and in 2013 agreed to invest $35 million on hand made goods from U.S. and abroad to sell in its stores over the course of two years. The collaborations were aimed to positively impact over 4,000 artisan workers. Former President Bill Clinton visited a West Elm showroom after the company spent nearly that amount in the first year of the agreement. In 2015, the company made a pledge at the Clinton Global Initiative Annual Meeting to expand its Fair Trade Certified product offerings. In March 2021, commercial marketing services provider CoStar reported that Williams-Sonoma would be opening new distribution centers and closing up to a quarter of its stores as it continued a migration to e-commerce. As of January 2024, Williams-Sonoma share prices were up over 65% in the previous year, and over four times that in the previous five years. In June 2024, the company announced a two-for-one stock split. International presence Canada In October 2001, the company opened its first international stores in Toronto, Ontario, Canada. The Williams-Sonoma and Pottery Barn stores in Yorkville occupied a combined 37,000 square feet of space at the retail podium of the 100 Bloor Street West condominium; these stores closed in 2017 after the landlord substantially raised rents in 2014. Latin America In 2008, the company opened Pottery Barn and West Elm stores at Plaza Las Americas in Hato Rey, Puerto Rico, a district of the capital San Juan. For Mexico, in 2014, El Puerto de Liverpool, which operates two nationwide department store chains (Liverpool) and Suburbia, signed a franchise agreement to operate stores and e-commerce sites for six brands. Brand covered are Williams-Sonoma, Pottery Barn, Pottery Barn Kids, PB Teen, West Elm. Middle East In 2010, Williams-Sonoma, Inc., partnered with M.H. Alshaya Co. to launch Pottery Barn and Pottery Barn Kids franchise operations in the Middle East. The first Williams-Sonoma brand store outside of North America opened in Kuwait in 2012, along with West Elm at The Avenues Mall, the largest shopping center in Kuwait. Europe The company opened its first store in the United Kingdom in 2014 with the launch of its West Elm location in London. Asia Pacific Williams-Sonoma, Inc., opened four stores (Williams-Sonoma, Pottery Barn, Pottery Barn Kids, and West Elm) in Australia in 2015 as the first retail locations outside of North America owned and operated by Williams-Sonoma, Inc. In the same year, the company also opened Pottery Barn and Pottery Barn Kids stores with a franchise partner in the Philippines. Brands Under the umbrella organization of Williams-Sonoma, Inc., the company's brands are: Williams Sonoma – upscale products for the kitchen and home Williams Sonoma Home – upscale home furnishings Pottery Barn – home furnishings Pottery Barn Kids – home furnishings for children PBteen – home furnishings for young adults West Elm – modern furniture and home decor Rejuvenation – light fixtures, hardware and home furnishings Mark and Graham – monogrammed gifts and accessories Green Row – sustainably sourced furnishings Controversies In March 2020, the Federal Trade Commission (FTC) announced a settlement with Williams-Sonoma, Inc., over false advertising claims where Goldtouch Bakeware products, Rejuvenation-branded products, and Pottery Barn Teen and Pottery Barn Kids-branded upholstered furniture products were falsely advertised as being made in the USA. As part of the settlement with the FTC, Williams-Sonoma, Inc., agreed to stop making false, misleading or unsubstantiated \"Made in USA\" claims and is required to pay $1 million to the FTC. In April 2024, the FTC fined the Williams-Sonoma almost $3.2 million for violating the FTC's 2020 order to be truthful about whether its products were made in the US, which marked the largest-ever civil penalty in a \"Made in USA\" case."
}