{
  "ticker": "WST",
  "cik": "0000105770",
  "company_name": "West Pharmaceutical Services",
  "corrected_name": "West Pharmaceutical Services",
  "wiki_title_used": "West Pharmaceutical Services",
  "exists": true,
  "raw_text": "West Pharmaceutical Services, Inc. is a designer and manufacturer of injectable pharmaceutical packaging and delivery systems. Founded in 1923 by Herman O. West and J.R. Wike of Philadelphia, the company is headquartered in Exton, Pennsylvania. In its early years of development, West produced rubber components for packaging injectable drugs, providing a sterile environment for the producers of penicillin and insulin.\n\nOverview\nWest manufactures components and systems for injectable drug delivery and plastic packaging, and delivery system components for the healthcare and consumer products markets. In 2019, the company reported US$1,849.9 million in sales.\nOn January 29, 2003, an accumulation of combustible polyethelene powder caused an explosion at a West rubber-manufacturing plant in Kinston, North Carolina.\nIn 2005, West acquired The Tech Group, Scottsdale, Ariz., and Medimop Medical Projects Ltd., Ra’anana, Israel.\n\nReferences\nExternal links\nOfficial website\n\nBusiness data for West Pharmaceutical Services Inc.:",
  "clean_text": "West Pharmaceutical Services, Inc. is a designer and manufacturer of injectable pharmaceutical packaging and delivery systems. Founded in 1923 by Herman O. West and J.R. Wike of Philadelphia, the company is headquartered in Exton, Pennsylvania. In its early years of development, West produced rubber components for packaging injectable drugs, providing a sterile environment for the producers of penicillin and insulin. Overview West manufactures components and systems for injectable drug delivery and plastic packaging, and delivery system components for the healthcare and consumer products markets. In 2019, the company reported US$1,849.9 million in sales. On January 29, 2003, an accumulation of combustible polyethelene powder caused an explosion at a West rubber-manufacturing plant in Kinston, North Carolina. In 2005, West acquired The Tech Group, Scottsdale, Ariz., and Medimop Medical Projects Ltd., Ra’anana, Israel."
}