{
  "ticker": "WTW",
  "cik": "0001140536",
  "company_name": "Willis Towers Watson",
  "corrected_name": "Willis Towers Watson",
  "wiki_title_used": "Willis Towers Watson",
  "exists": true,
  "raw_text": "Willis Towers Watson plc (branded as WTW) is a British-American multinational advisory, broking and solutions company. Its operations span commercial insurance brokerage and risk advisory, employee benefits and rewards consulting, retirement and actuarial services, and investment advice for pension funds and institutional investors. \nThe company is legally domiciled in Ireland and has its principal executive offices at the Willis Building in London. In 2024 WTW reported revenue of US$9.93 billion and employed about 48,900 people. Following completion of the Willis Group - Towers Watson merger, the company was added to the S&P 500 index in January 2016. WTW ranks among the largest global insurance brokers by revenue.\n\nHistory\nOrigins and predecessor firms\nWTW’s roots trace to nineteenth- and twentieth-century insurance broking and actuarial consultancies that later combined to form Willis Group and Towers Watson.\n\nWillis Group\nHenry Willis began broking at Lloyd’s in the 1840s and founded Henry Willis & Co. The firm merged with Faber Brothers in 1898 to form Willis, Faber & Co., and with Dumas & Wylie in 1928 to form Willis, Faber & Dumas. The company listed on the London Stock Exchange in 1976. In 1990 Willis entered the U.S. retail market through a merger with Corroon & Black to create Willis Corroon. It was taken private by KKR in 1998, adopted the Willis Group name, and relisted on the New York Stock Exchange in 2001 under the ticker WSH. Willis expanded in North America by acquiring Hilb, Rogal & Hobbs in 2008, increased its longtime stake to acquire French broker Gras Savoye in 2015, and agreed that year to purchase an 85% stake in London broker Miller. Willis launched the Willis Research Network in 2006 to link academia and industry on natural-hazard and risk science.\n\nWatson Wyatt Worldwide\nR. Watson & Sons was founded in the United Kingdom in 1878. The Wyatt Company was founded in the United States in the 1940s. The firms merged in 1995 under the Watson Wyatt name, the U.S. business listed on the New York Stock Exchange in 2000, and the UK and U.S. businesses formally merged in 2005 as Watson Wyatt Worldwide.\n\nTowers Perrin and Towers Watson\nTowers, Perrin, Forster & Crosby (TPF&C) was established in 1934. It acquired actuarial firm Tillinghast, Nelson & Warren in 1986 and shortened its name to Towers Perrin in 1987. Towers Perrin and Watson Wyatt completed a merger of equals on 4 January 2010 to form Towers Watson, led by John Haley, before the 2016 merger with Willis Group created WTW.\n\nFormation of Willis Towers Watson (2016)\nShareholders approved the merger of Willis Group and Towers Watson in December 2015. The combined company began operating as Willis Towers Watson in early January 2016, with shares trading on Nasdaq under the ticker WLTW.\n\nProposed acquisition by Aon\nOn 9 March 2020 Aon announced an all-stock deal to acquire Willis Towers Watson valued at about US$30 billion. The combined group would have been the world’s largest insurance broker by revenue. The parties targeted completion in 2021 subject to regulatory approvals and other conditions.\nCompetition authorities conducted in-depth reviews. The European Commission opened a Phase II investigation in December 2020 and on 9 July 2021 approved the transaction subject to structural remedies that included the divestment of substantial Willis Towers Watson reinsurance and commercial risk broking activities to an approved purchaser. The Commission said the commitments preserved competition for large commercial clients and for reinsurance broking in the EEA. Outside Europe, the Australian Competition & Consumer Commission set out preliminary concerns in February 2021 relating to reinsurance broking and broking for large commercial clients in Australia.\nIn the United States the Department of Justice filed a civil antitrust complaint on 16 June 2021 to block the merger. The complaint alleged that the deal would substantially lessen competition in five markets covering large-client broking, reinsurance broking, health benefits broking for large customers, private multicarrier retiree exchanges and pension administration services for large customers. \nOn 26 July 2021 Aon and Willis Towers Watson terminated their business combination agreement, citing the uncertainty created by the DOJ litigation. Under the termination agreement Aon paid a US$1 billion fee to Willis Towers Watson. In the months that followed, Willis Towers Watson completed the sale of its treaty reinsurance brokerage operations to Arthur J. Gallagher & Co., which had been the intended purchaser under the European remedy package.\n\nRebranding since 2020\nIn November 2020 WTW acquired Acclimatise, a UK-based climate consultancy, and in November 2021 it agreed to acquire Israeli broker Leaderim as part of a broader build-out of specialty and regional broking networks. WTW completed the sale of its treaty reinsurance operations to Arthur J. Gallagher & Co. on 1 December 2021 for an initial US$3.25 billion with a potential earn-out.\nThe company rebranded commercially as WTW in January 2022 and changed its Nasdaq ticker to WTW. In March 2022 it withdrew from Russia, transferring ownership of its Russian businesses to local management. In July 2022 WTW acquired Butterwire, a climate risk analytics firm, to support its advisory and software offerings. In October 2024 WTW announced an agreement to sell its direct-to-consumer unit TRANZACT, completion of which was announced on 2 January 2025.\n\nOperations\nSegments\nWTW reports two operating segments. Risk & Broking provides risk advice, insurance brokerage and related consulting to clients from small firms to multinationals. Health, Wealth & Career provides benefits administration and technology, health and benefits brokerage, retirement and actuarial consulting, investment advice and human capital and rewards services.\n\nRisk and broking\nThe segment comprises two primary businesses: Corporate Risk & Broking and Insurance Consulting and Technology. Corporate Risk & Broking places and services commercial and specialty risks for corporate and institutional clients.\n\nInsurance consulting and technology\nWithin Risk & Broking, Insurance Consulting and Technology provides advisory services to insurers and develops software used for pricing, reserving and capital modelling, including the Radar pricing suite, ResQ reserving and the Igloo modelling platform used by general insurers.\n\nHealth, wealth and career\nHealth, Wealth & Career covers benefits administration and technology, health and benefits brokerage, retirement and actuarial consulting, investment advisory for institutional investors, and workforce and rewards advisory.\n\nMarkets and geography\nIn 2024 the revenue mix by segment was 59 percent Health, Wealth & Career and 41 percent Risk & Broking. Revenue by geography was 55 percent North America, 34 percent Europe and 11 percent International.\n\nDefined contribution master trust\nIn the United Kingdom, WTW sponsors LifeSight, a multi-employer defined contribution master trust open to participating employers. LifeSight was the first master trust to be granted authorisation under The Pensions Regulator’s regime in February 2019, confirming that it met the regulator’s standards on governance and financial sustainability.\nLifeSight has grown through employer onboarding and consolidation. By July 2024 it had passed £20 billion in assets under management and covered more than 400,000 members. By September 2025 assets reached above £24 billion with about 430,000 members. The master trust offers an in-scheme drawdown arrangement, in September 2025 over 7,500 members had used this option, with drawdown assets exceeding £1 billion.\nThe scheme is governed by an independent trustee board with an independent chair, separate from WTW’s management. Its Statement of investment principles states that the standard default is a medium-risk drawdown lifecycle that gradually de-risks as members approach retirement. The trustee permits use of certain illiquid assets within the default where appropriate. Earlier reporting highlighted an increased allocation to ESG strategies within the default from 2018. In August 2025 LifeSight announced an allocation to a renewables long-term asset fund as part of its default’s long-term growth exposure.\n\nGovernance\nWTW is an Irish public limited company with a single-tier board. In May 2025 the board appointed Paul Reilly as non-executive chair following the company’s annual general meeting, succeeding Paul Thomas, who retired from the board at the end of his term. The chief executive officer is Carl Hess, who succeeded John Haley on 1 January 2022, and the chief financial officer is Andrew Krasner, appointed in September 2021.\n\nFinancials\nFor the year ended 31 December 2024 WTW reported revenue of US$9.93 billion, operating income of US$627 million and a net loss of US$98 million. Total assets were US$27.7 billion and total equity was US$7.94 billion. The 2024 net loss primarily reflected non-cash impairment charges related to the sale of the company’s TRANZACT unit, partially offset by recognition of an earn-out related to the 2021 Willis Re divestment.\n\nSelected annual results\nNotes: 2021 net income includes gains related to divestitures and discontinued operations following regulatory remedies associated with the terminated Aon transaction; 2024 reflects impairments related to the TRANZACT sale.\n\nLegal issues\nIn 2005 U.S. authorities examined the use of contingent commissions in commercial insurance broking. Willis Group said it would cease the practice and improve transparency in the wake of wider industry settlements that followed the Marsh & McLennan probe.\nIn July 2011 the UK Financial Services Authority fined Willis Limited £6.895 million after finding that anti-bribery and corruption systems and controls were inadequate between 2005 and 2009.\nDuring the Willis Group and Towers Watson merger process in 2015 some Towers Watson investors objected to the original terms. A first shareholder vote on 18 November 2015 did not secure sufficient support, and reporting highlighted concerns about valuation and potential conflicts of interest. Towers Watson shareholder Driehaus Capital Management urged other shareholders to vote against the proposed merger, calculating that Towers Watson was worth between 39% and 53% more as a standalone company. Towers Watson CEO John Haley was accused of having a conflict of interest since he was to receive $165 million from the completion of the deal. Haley had disposed of 55% of his shares in the company for a $10 million profit in early March 2015 while the merger negotiations were ongoing and before the stock price dropped on the news of the acquisition. Willis then increased a special cash dividend payable to Towers Watson shareholders and the revised offer was approved on 11 December 2015.\nFollowing completion, stockholders brought litigation in the Delaware Court of Chancery and related federal actions concerning the merger process and disclosures. In 2019 the Court of Chancery allowed certain claims to proceed. In 2024 the parties reported settlements totaling about US$90 million across the federal proxy action and related Delaware proceedings.\nA separate insurance coverage dispute concerned whether directors’ and officers’ policies covered the merger-related settlements. On 9 August 2024 the United States Court of Appeals for the Fourth Circuit vacated a district court ruling that had applied a “bump-up” exclusion and remanded for further proceedings. Commentary discussed possible implications for coverage of merger-related settlements.\n\nNotable office locations\nWillis Building at 51 Lime Street in the City of London, WTW’s principal executive offices. It was designed by Foster + Partners, opening in 2008, and received the Council on Tall Buildings and Urban Habitat’s regional award for Europe in 2008.\nWillis Building in Ipswich, England, designed by Norman Foster and given Grade I listed building status.\nThe company is incorporated in Ireland and its registered office is at Willis Towers Watson House, Elm Park, Merrion Road, Dublin 4.\nWillis Tower in Chicago, United States. Willis secured naming rights in July 2009 in connection with a large lease commitment. The tower had been known as the Sears Tower since its completion in 1973.\n\nSee also\nAon (company)\nArthur J. Gallagher & Co.\nMarsh McLennan\nReinsurance\n\nReferences\nExternal links\nOfficial website\nBusiness data for Willis Towers Watson plc:",
  "clean_text": "Willis Towers Watson plc (branded as WTW) is a British-American multinational advisory, broking and solutions company. Its operations span commercial insurance brokerage and risk advisory, employee benefits and rewards consulting, retirement and actuarial services, and investment advice for pension funds and institutional investors. The company is legally domiciled in Ireland and has its principal executive offices at the Willis Building in London. In 2024 WTW reported revenue of US$9.93 billion and employed about 48,900 people. Following completion of the Willis Group - Towers Watson merger, the company was added to the S&P 500 index in January 2016. WTW ranks among the largest global insurance brokers by revenue. History Origins and predecessor firms WTW’s roots trace to nineteenth- and twentieth-century insurance broking and actuarial consultancies that later combined to form Willis Group and Towers Watson. Willis Group Henry Willis began broking at Lloyd’s in the 1840s and founded Henry Willis & Co. The firm merged with Faber Brothers in 1898 to form Willis, Faber & Co., and with Dumas & Wylie in 1928 to form Willis, Faber & Dumas. The company listed on the London Stock Exchange in 1976. In 1990 Willis entered the U.S. retail market through a merger with Corroon & Black to create Willis Corroon. It was taken private by KKR in 1998, adopted the Willis Group name, and relisted on the New York Stock Exchange in 2001 under the ticker WSH. Willis expanded in North America by acquiring Hilb, Rogal & Hobbs in 2008, increased its longtime stake to acquire French broker Gras Savoye in 2015, and agreed that year to purchase an 85% stake in London broker Miller. Willis launched the Willis Research Network in 2006 to link academia and industry on natural-hazard and risk science. Watson Wyatt Worldwide R. Watson & Sons was founded in the United Kingdom in 1878. The Wyatt Company was founded in the United States in the 1940s. The firms merged in 1995 under the Watson Wyatt name, the U.S. business listed on the New York Stock Exchange in 2000, and the UK and U.S. businesses formally merged in 2005 as Watson Wyatt Worldwide. Towers Perrin and Towers Watson Towers, Perrin, Forster & Crosby (TPF&C) was established in 1934. It acquired actuarial firm Tillinghast, Nelson & Warren in 1986 and shortened its name to Towers Perrin in 1987. Towers Perrin and Watson Wyatt completed a merger of equals on 4 January 2010 to form Towers Watson, led by John Haley, before the 2016 merger with Willis Group created WTW. Formation of Willis Towers Watson (2016) Shareholders approved the merger of Willis Group and Towers Watson in December 2015. The combined company began operating as Willis Towers Watson in early January 2016, with shares trading on Nasdaq under the ticker WLTW. Proposed acquisition by Aon On 9 March 2020 Aon announced an all-stock deal to acquire Willis Towers Watson valued at about US$30 billion. The combined group would have been the world’s largest insurance broker by revenue. The parties targeted completion in 2021 subject to regulatory approvals and other conditions. Competition authorities conducted in-depth reviews. The European Commission opened a Phase II investigation in December 2020 and on 9 July 2021 approved the transaction subject to structural remedies that included the divestment of substantial Willis Towers Watson reinsurance and commercial risk broking activities to an approved purchaser. The Commission said the commitments preserved competition for large commercial clients and for reinsurance broking in the EEA. Outside Europe, the Australian Competition & Consumer Commission set out preliminary concerns in February 2021 relating to reinsurance broking and broking for large commercial clients in Australia. In the United States the Department of Justice filed a civil antitrust complaint on 16 June 2021 to block the merger. The complaint alleged that the deal would substantially lessen competition in five markets covering large-client broking, reinsurance broking, health benefits broking for large customers, private multicarrier retiree exchanges and pension administration services for large customers. On 26 July 2021 Aon and Willis Towers Watson terminated their business combination agreement, citing the uncertainty created by the DOJ litigation. Under the termination agreement Aon paid a US$1 billion fee to Willis Towers Watson. In the months that followed, Willis Towers Watson completed the sale of its treaty reinsurance brokerage operations to Arthur J. Gallagher & Co., which had been the intended purchaser under the European remedy package. Rebranding since 2020 In November 2020 WTW acquired Acclimatise, a UK-based climate consultancy, and in November 2021 it agreed to acquire Israeli broker Leaderim as part of a broader build-out of specialty and regional broking networks. WTW completed the sale of its treaty reinsurance operations to Arthur J. Gallagher & Co. on 1 December 2021 for an initial US$3.25 billion with a potential earn-out. The company rebranded commercially as WTW in January 2022 and changed its Nasdaq ticker to WTW. In March 2022 it withdrew from Russia, transferring ownership of its Russian businesses to local management. In July 2022 WTW acquired Butterwire, a climate risk analytics firm, to support its advisory and software offerings. In October 2024 WTW announced an agreement to sell its direct-to-consumer unit TRANZACT, completion of which was announced on 2 January 2025. Operations Segments WTW reports two operating segments. Risk & Broking provides risk advice, insurance brokerage and related consulting to clients from small firms to multinationals. Health, Wealth & Career provides benefits administration and technology, health and benefits brokerage, retirement and actuarial consulting, investment advice and human capital and rewards services. Risk and broking The segment comprises two primary businesses: Corporate Risk & Broking and Insurance Consulting and Technology. Corporate Risk & Broking places and services commercial and specialty risks for corporate and institutional clients. Insurance consulting and technology Within Risk & Broking, Insurance Consulting and Technology provides advisory services to insurers and develops software used for pricing, reserving and capital modelling, including the Radar pricing suite, ResQ reserving and the Igloo modelling platform used by general insurers. Health, wealth and career Health, Wealth & Career covers benefits administration and technology, health and benefits brokerage, retirement and actuarial consulting, investment advisory for institutional investors, and workforce and rewards advisory. Markets and geography In 2024 the revenue mix by segment was 59 percent Health, Wealth & Career and 41 percent Risk & Broking. Revenue by geography was 55 percent North America, 34 percent Europe and 11 percent International. Defined contribution master trust In the United Kingdom, WTW sponsors LifeSight, a multi-employer defined contribution master trust open to participating employers. LifeSight was the first master trust to be granted authorisation under The Pensions Regulator’s regime in February 2019, confirming that it met the regulator’s standards on governance and financial sustainability. LifeSight has grown through employer onboarding and consolidation. By July 2024 it had passed £20 billion in assets under management and covered more than 400,000 members. By September 2025 assets reached above £24 billion with about 430,000 members. The master trust offers an in-scheme drawdown arrangement, in September 2025 over 7,500 members had used this option, with drawdown assets exceeding £1 billion. The scheme is governed by an independent trustee board with an independent chair, separate from WTW’s management. Its Statement of investment principles states that the standard default is a medium-risk drawdown lifecycle that gradually de-risks as members approach retirement. The trustee permits use of certain illiquid assets within the default where appropriate. Earlier reporting highlighted an increased allocation to ESG strategies within the default from 2018. In August 2025 LifeSight announced an allocation to a renewables long-term asset fund as part of its default’s long-term growth exposure. Governance WTW is an Irish public limited company with a single-tier board. In May 2025 the board appointed Paul Reilly as non-executive chair following the company’s annual general meeting, succeeding Paul Thomas, who retired from the board at the end of his term. The chief executive officer is Carl Hess, who succeeded John Haley on 1 January 2022, and the chief financial officer is Andrew Krasner, appointed in September 2021. Financials For the year ended 31 December 2024 WTW reported revenue of US$9.93 billion, operating income of US$627 million and a net loss of US$98 million. Total assets were US$27.7 billion and total equity was US$7.94 billion. The 2024 net loss primarily reflected non-cash impairment charges related to the sale of the company’s TRANZACT unit, partially offset by recognition of an earn-out related to the 2021 Willis Re divestment. Selected annual results Notes: 2021 net income includes gains related to divestitures and discontinued operations following regulatory remedies associated with the terminated Aon transaction; 2024 reflects impairments related to the TRANZACT sale. Legal issues In 2005 U.S. authorities examined the use of contingent commissions in commercial insurance broking. Willis Group said it would cease the practice and improve transparency in the wake of wider industry settlements that followed the Marsh & McLennan probe. In July 2011 the UK Financial Services Authority fined Willis Limited £6.895 million after finding that anti-bribery and corruption systems and controls were inadequate between 2005 and 2009. During the Willis Group and Towers Watson merger process in 2015 some Towers Watson investors objected to the original terms. A first shareholder vote on 18 November 2015 did not secure sufficient support, and reporting highlighted concerns about valuation and potential conflicts of interest. Towers Watson shareholder Driehaus Capital Management urged other shareholders to vote against the proposed merger, calculating that Towers Watson was worth between 39% and 53% more as a standalone company. Towers Watson CEO John Haley was accused of having a conflict of interest since he was to receive $165 million from the completion of the deal. Haley had disposed of 55% of his shares in the company for a $10 million profit in early March 2015 while the merger negotiations were ongoing and before the stock price dropped on the news of the acquisition. Willis then increased a special cash dividend payable to Towers Watson shareholders and the revised offer was approved on 11 December 2015. Following completion, stockholders brought litigation in the Delaware Court of Chancery and related federal actions concerning the merger process and disclosures. In 2019 the Court of Chancery allowed certain claims to proceed. In 2024 the parties reported settlements totaling about US$90 million across the federal proxy action and related Delaware proceedings. A separate insurance coverage dispute concerned whether directors’ and officers’ policies covered the merger-related settlements. On 9 August 2024 the United States Court of Appeals for the Fourth Circuit vacated a district court ruling that had applied a “bump-up” exclusion and remanded for further proceedings. Commentary discussed possible implications for coverage of merger-related settlements. Notable office locations Willis Building at 51 Lime Street in the City of London, WTW’s principal executive offices. It was designed by Foster + Partners, opening in 2008, and received the Council on Tall Buildings and Urban Habitat’s regional award for Europe in 2008. Willis Building in Ipswich, England, designed by Norman Foster and given Grade I listed building status. The company is incorporated in Ireland and its registered office is at Willis Towers Watson House, Elm Park, Merrion Road, Dublin 4. Willis Tower in Chicago, United States. Willis secured naming rights in July 2009 in connection with a large lease commitment. The tower had been known as the Sears Tower since its completion in 1973."
}