{
  "ticker": "WY",
  "cik": "0000106535",
  "company_name": "Weyerhaeuser",
  "corrected_name": "Weyerhaeuser",
  "wiki_title_used": "Weyerhaeuser",
  "exists": true,
  "raw_text": "The Weyerhaeuser Company ( WAIR-how-zər) is an American timberland company which owns nearly 12,400,000 acres (19,400 sq mi; 50,000 km2) of timberlands in the U.S., and manages an additional 14,000,000 acres (22,000 sq mi; 57,000 km2) of timberlands under long-term licenses in Canada. The company has manufactured wood products for over a century. It operates as a real estate investment trust (REIT).\n\nHistory\nIn 1900, after years of successful Mississippi River-based lumber and mill operations with Frederick Denkmann and others, Frederick Weyerhäuser moved west to fresh timber areas and founded the Weyerhäuser Timber Company. Fifteen partners and 900,000 acres (1,400 sq mi; 3,600 km2) of Washington timberland were involved in the founding, and the land was purchased from James J. Hill of the Great Northern Railway.  In 1929, the company built what was then the world's largest sawmill in Longview, Washington. Weyerhaeuser's pulp mill in Longview, which began production in 1931, sustained the company financially during the Great Depression. In 1959, the company eliminated the word \"Timber\" from its name to better reflect its operations. In 1965, Weyerhaeuser built its first bleached kraft pulp mill in Canada. Weyerhaeuser implemented its High Yield Forestry Plan in 1967 which drew upon 30 years of forestry research and field experience. It called for the planting of seedlings within one year of a harvest, soil fertilization, thinning, rehabilitation of brushlands, and, eventually, genetic improvement of trees. In 1975 the company bought the 3,200 acres of land of the Northwest Landing and developed the town of DuPont, Washington using a New Urbanism model.\nWeyerhaeuser consolidated its core businesses in the late 1990s and ended its services in mortgage banking, personal care products, financial services, and information systems consulting. Weyerhaeuser also expanded into South America, Australia, and Asia. In 1999, Weyerhaeuser purchased MacMillan Bloedel Limited, a large Canadian forestry company. Then in 2002 after a protracted hostile buyout, the company acquired Willamette Industries, Inc. of Portland, Oregon. On August 23, 2006, Weyerhaeuser announced a deal which spun off its fine paper business to be combined with Domtar, a $3.3 billion cash and stock deal leaving Weyerhaeuser stockholders with 55 percent ownership of the new Domtar company.\nIn March 2008, Weyerhaeuser Company announced the sale of its containerboard packaging and recycling business to International Paper for $6 billion in cash, subject to post closing adjustments. The transaction included nine containerboard mills, 72 packaging locations, 10 specialty packaging plants, four craft bag and sack locations and 19 recycling facilities. The transaction affected approximately 14,300 employees. The deal closed on August 4, 2008.\nWeyerhaeuser converted into a REIT when it filed its 2010 tax return.\nIn 2013, Weyerhaeuser purchased Longview Timber for $2.65 billion including debt from Brookfield Asset Management. The acquisition added 645,000 acres (1,008 sq mi; 2,610 km2) of timberland to Weyerhaeuser's holdings in Oregon and Washington.\nIn 2014, Weyerhaeuser spun off its home building unit to TRI Pointe Homes in a $2.8 billion transaction. The company also announced its intention to sell its corporate headquarters in Federal Way and relocate to Seattle's Pioneer Square in 2016. The sale and move were completed in 2016.\nOn November 8, 2015, it was announced that Weyerhaeuser would buy Plum Creek Timber for $8.4 billion, forming the largest private owner of timberland in the United States. The transaction closed on February 19, 2016. At the time of the merger the combined companies own about 13,000,000 acres (20,000 sq mi; 53,000 km2) of timberlands.\nIn 2018, it won the Weyerhaeuser Company v. United States Fish and Wildlife Service case in the U.S. Supreme Court regarding whether private land can be classified as critical habitat if the land is not currently suitable as habitat for the protected species.\n\nOperations\nThe company's operations are divided into three major business segments:\n\nTimberlands—growing and harvesting trees in renewable cycles.\nWood products—manufacturing and distribution of building materials for homes and other structures.\nReal estate, energy and natural resources—all surface and subsurface resources in timberlands that are worth more than the timber itself.\n\nCorporate governance\nDevin Stockfish is the CEO and president of Weyerhaeuser Company. The Weyerhaeuser board of directors consists of: Mark Emmert, Sara Grootwassink Lewis, Rick Holley, Deidra \"Dee\" Merriwether, Al Monaco, Nicole Piasecki, Marc Racicot, Lawrence Selzer, D. Michael Steuert, Devin Stockfish, Kim Williams and Charles Williamson.\n\nPresident\nFriedrich Weyerhäuser, 1900–1914\nJohn Philip Weyerhaeuser Sr., 1914–1928\nFrederick S. Bell, 1928–1934\nFrederick Edward Weyerhaeuser, 1934–1945\nHorace H. Irvine, 1946–1947\nJohn Philip Weyerhaeuser Jr., 1947–1956\nFrederick King Weyerhaeuser, 1956–1960\nM. Norton Clapp, 1960–1966\nGeorge Hunt Weyerhaeuser, 1966–1991\nJohn W. Creighton Jr., 1991–1997\nSteven R. Rogel, 1997–2008\nDaniel S. Fulton, 2008–2013\nDoyle R. Simons, 2013–2018\nDevin W. Stockfish, 2019–\n\nChairman of the Board\nFrederick S. Bell, 1934–1938\nLaird Bell, 1947–1955\nFrederick King Weyerhaeuser, 1955–1957\nM. Norton Clapp, 1957–1960\nFrederick King Weyerhaeuser, 1960–1966\nM. Norton Clapp, 1966–1976\nRobert B. Wilson, 1976–1988\nGeorge Hunt Weyerhaeuser, 1988–1999\nSteven R. Rogel, 1999–2009\nCharles R. Williamson, 2009–2016\nRick R. Holley, 2016–\n\nReferences\nFurther reading\nHidy, Ralph W; Hill, Frank Ernest; Nevins, Allan (1963). Timber and Men: The Weyerhaeuser story. New York: Macmillan.\n\nExternal links\nWeyerhaeuser (official website)\nWeyerhaeuser Company EDGAR Filing History\nBusiness data for Weyerhaeuser: \nInventory of the Weyerhaeuser Company Records, 1864-2010 (Forest History Society)\nHistorical Annual Reports for Weyerhaeuser",
  "clean_text": "The Weyerhaeuser Company ( WAIR-how-zər) is an American timberland company which owns nearly 12,400,000 acres (19,400 sq mi; 50,000 km2) of timberlands in the U.S., and manages an additional 14,000,000 acres (22,000 sq mi; 57,000 km2) of timberlands under long-term licenses in Canada. The company has manufactured wood products for over a century. It operates as a real estate investment trust (REIT). History In 1900, after years of successful Mississippi River-based lumber and mill operations with Frederick Denkmann and others, Frederick Weyerhäuser moved west to fresh timber areas and founded the Weyerhäuser Timber Company. Fifteen partners and 900,000 acres (1,400 sq mi; 3,600 km2) of Washington timberland were involved in the founding, and the land was purchased from James J. Hill of the Great Northern Railway. In 1929, the company built what was then the world's largest sawmill in Longview, Washington. Weyerhaeuser's pulp mill in Longview, which began production in 1931, sustained the company financially during the Great Depression. In 1959, the company eliminated the word \"Timber\" from its name to better reflect its operations. In 1965, Weyerhaeuser built its first bleached kraft pulp mill in Canada. Weyerhaeuser implemented its High Yield Forestry Plan in 1967 which drew upon 30 years of forestry research and field experience. It called for the planting of seedlings within one year of a harvest, soil fertilization, thinning, rehabilitation of brushlands, and, eventually, genetic improvement of trees. In 1975 the company bought the 3,200 acres of land of the Northwest Landing and developed the town of DuPont, Washington using a New Urbanism model. Weyerhaeuser consolidated its core businesses in the late 1990s and ended its services in mortgage banking, personal care products, financial services, and information systems consulting. Weyerhaeuser also expanded into South America, Australia, and Asia. In 1999, Weyerhaeuser purchased MacMillan Bloedel Limited, a large Canadian forestry company. Then in 2002 after a protracted hostile buyout, the company acquired Willamette Industries, Inc. of Portland, Oregon. On August 23, 2006, Weyerhaeuser announced a deal which spun off its fine paper business to be combined with Domtar, a $3.3 billion cash and stock deal leaving Weyerhaeuser stockholders with 55 percent ownership of the new Domtar company. In March 2008, Weyerhaeuser Company announced the sale of its containerboard packaging and recycling business to International Paper for $6 billion in cash, subject to post closing adjustments. The transaction included nine containerboard mills, 72 packaging locations, 10 specialty packaging plants, four craft bag and sack locations and 19 recycling facilities. The transaction affected approximately 14,300 employees. The deal closed on August 4, 2008. Weyerhaeuser converted into a REIT when it filed its 2010 tax return. In 2013, Weyerhaeuser purchased Longview Timber for $2.65 billion including debt from Brookfield Asset Management. The acquisition added 645,000 acres (1,008 sq mi; 2,610 km2) of timberland to Weyerhaeuser's holdings in Oregon and Washington. In 2014, Weyerhaeuser spun off its home building unit to TRI Pointe Homes in a $2.8 billion transaction. The company also announced its intention to sell its corporate headquarters in Federal Way and relocate to Seattle's Pioneer Square in 2016. The sale and move were completed in 2016. On November 8, 2015, it was announced that Weyerhaeuser would buy Plum Creek Timber for $8.4 billion, forming the largest private owner of timberland in the United States. The transaction closed on February 19, 2016. At the time of the merger the combined companies own about 13,000,000 acres (20,000 sq mi; 53,000 km2) of timberlands. In 2018, it won the Weyerhaeuser Company v. United States Fish and Wildlife Service case in the U.S. Supreme Court regarding whether private land can be classified as critical habitat if the land is not currently suitable as habitat for the protected species. Operations The company's operations are divided into three major business segments: Timberlands—growing and harvesting trees in renewable cycles. Wood products—manufacturing and distribution of building materials for homes and other structures. Real estate, energy and natural resources—all surface and subsurface resources in timberlands that are worth more than the timber itself. Corporate governance Devin Stockfish is the CEO and president of Weyerhaeuser Company. The Weyerhaeuser board of directors consists of: Mark Emmert, Sara Grootwassink Lewis, Rick Holley, Deidra \"Dee\" Merriwether, Al Monaco, Nicole Piasecki, Marc Racicot, Lawrence Selzer, D. Michael Steuert, Devin Stockfish, Kim Williams and Charles Williamson. President Friedrich Weyerhäuser, 1900–1914 John Philip Weyerhaeuser Sr., 1914–1928 Frederick S. Bell, 1928–1934 Frederick Edward Weyerhaeuser, 1934–1945 Horace H. Irvine, 1946–1947 John Philip Weyerhaeuser Jr., 1947–1956 Frederick King Weyerhaeuser, 1956–1960 M. Norton Clapp, 1960–1966 George Hunt Weyerhaeuser, 1966–1991 John W. Creighton Jr., 1991–1997 Steven R. Rogel, 1997–2008 Daniel S. Fulton, 2008–2013 Doyle R. Simons, 2013–2018 Devin W. Stockfish, 2019– Chairman of the Board Frederick S. Bell, 1934–1938 Laird Bell, 1947–1955 Frederick King Weyerhaeuser, 1955–1957 M. Norton Clapp, 1957–1960 Frederick King Weyerhaeuser, 1960–1966 M. Norton Clapp, 1966–1976 Robert B. Wilson, 1976–1988 George Hunt Weyerhaeuser, 1988–1999 Steven R. Rogel, 1999–2009 Charles R. Williamson, 2009–2016 Rick R. Holley, 2016–"
}