{
  "ticker": "WYNN",
  "cik": "0001174922",
  "company_name": "Wynn Resorts",
  "corrected_name": "Wynn Resorts",
  "wiki_title_used": "Wynn Resorts",
  "exists": true,
  "raw_text": "Wynn Resorts, Limited is an American publicly traded corporation based in Paradise, Nevada, that is a developer and operator of high-end hotels and casinos. It was founded in 2002 by former Mirage Resorts Chairman and CEO Steve Wynn and is now run by CEO Craig Billings. As of 2020, the company has developed six properties.\n\nHistory\nIn 2000, Steve Wynn agreed to sell Mirage Resorts to MGM Grand, after having led Mirage and its predecessors since 1973.  Wynn laid the foundation for his next venture that same year, buying the Desert Inn for $270 million.\nWynn found an early partner in Japanese billionaire Kazuo Okada of Universal Entertainment Corporation. Wynn, together with Universal subsidiary Aruze USA, controlled almost half the stock, making it harder for outside investors to exert control, as they had done at Mirage in response to Wynn's prolific spending.\nWynn hired investment banker Ronald Kramer as president and director in 2002 in order to help take the company public and oversee its expansion.\nSteve Wynn's wife, and later ex-wife, Elaine was acknowledged to have been the company's largest shareholder. \nWynn Resorts made its initial public offering on NASDAQ on October 25, 2002. The company's first project, Wynn Las Vegas, opened on April 28, 2005.\nWynn Macau, the company's second project started construction on June 28, 2004. It opened September 6, 2006 and is now the largest-grossing casino in the region.\nEncore, an extension to Wynn Las Vegas, broke ground on April 28, 2006, the first anniversary of the opening of Wynn Las Vegas. Encore at Wynn Macau, the company's second project on the Macau Peninsula, Macau, People's Republic of China, opened on April 21, 2010. A second resort in Macau, Wynn Palace in Cotai, opened August 22, 2016, on 52 acres (21 ha).\nThe Encore in Las Vegas opened shortly after the beginning of the Great Recession. Despite the additional casino at the Encore (which added 97 tables and 857 slot machines to the original 190 tables and 2000 slots), net casino revenues for the combined resort were initially lower. Similarly, in the first quarter of 2009, net revenues of the Macau operations declined. Following the global economic recovery, performance of the Wynn properties also recovered. Wynn remained the only gaming operator to not perform mass layoffs during the recession. \nThe company considered opening a casino as part of the Entertainment City development in the Philippines, but decided against it because of corruption in the country's gaming industry. Okada decided to proceed with the project alone, leading to the rupture of his partnership with Wynn. The dispute went public with reciprocal accusations of corrupt practices. Wynn and his allies accused Okada of bribing Philippines gaming regulators with over $110,000 in benefits, including free nights in a luxury suite at Wynn Las Vegas, while Okada claimed that Wynn Resorts' record $135 million donation to the University of Macau constituted a bribe. Okada resigned as vice chairman in October 2011, and the following February, after a company investigation by the Freeh Group confirmed the charges against him, the board of directors forced Aruze USA to sell back its shares at a nearly 30% discount. Aruze had been the company's largest shareholder, with a 19.7% stake.\nOn September 17, 2014, the Massachusetts Gaming Commission voted to approve Wynn Resorts' proposed $1.6 billion casino to be located in Everett, Massachusetts on the Mystic River, just north of Boston. Encore Boston Harbor opened on June 23, 2019 at a cost of $1.4 billion.”\nOn February 6, 2018, Steve Wynn resigned as CEO of the company amidst sexual allegations and was replaced by Matthew Maddox. Amid sexual harassment lawsuits involving directors, Maddox announced the planned departure of two board members, Ray Irani and Alvin Shoemaker, on March 7, 2018. The departure of Irani and Shoemaker was to reassure investors that the corporate culture was changing. In April 2018, the company nominated three women to the board of directors: Dee Dee Myers, Betsy Atkins, and Wendy Webb. Elaine Wynn, who still served on the company's board of directors, would acquire her ex-husband's stock and have her voting rights, which she had previously lost in her 2010 divorce from Steve, restored. Elaine Wynn would also become owner of Wynn Resorts, maintaining 8.25 % of the company's stock by December 2021.\nTalks between Wynn and Crown Resorts of Australia for a $7.1 billion offer collapsed in April 2019; analysts saw the bid as an attempt to diversify away from Macau, where its license was set to expire in 2022. Wynn reached an agreement with the government of Macau for an extension of its concession on December 16, 2022.\nOn May 28, 2019, Wynn paid a $35 million fine to the Massachusetts Gaming Commission and the $500,000 fine placed on Matthew Maddox.\nOn November 9, 2021, Wynn announced that Matthew Maddox would be stepping down as CEO on January 31, 2022. Craig Billings was named as successor to Maddox. Previously, Craig Billings was the CEO of Wynn Interactive and former CFO of Wynn Resorts. Billings assumed the role of CEO effective February 1, 2022. \nAs of 2024, Wynn Resorts was bidding for a casino license to build an integrated resort at the Hudson Yards in New York City. Wynn entered into a partnership with Related Companies to develop an integrated resort with a casino on the western yard; it was announced that the plan would include a \"resort tower\" featuring a casino and hotel. The plan included a 2-million-square-foot office tower, as well as 5.5 acres of public parkland, a public school, and a 1 million-square-foot apartment building with 329 affordable housing units. However, supporters of the High Line later prompted Wynn to make \"substantive changes to plans in response to [supporters'] concerns\"; the revised plan now includes 5.6 acres of public green space in order to generate thousands of union jobs. In March 2024, Wynn Resorts released renderings of the proposed resort and other components of the western portion of the project. Wynn’s proposal for the site was to build a 1,189 foot tall 80 story hotel and casino above the western portion of the West Side Yards. Wynn New York City would have had 1,750 rooms, making it one of the largest hotels in New York City. Wynn Resorts withdrew their New York City casino bid in May 2025. \nWynn is currently building Wynn Al Marjan Island which will be the first legal casino in the United Arab Emirates. They are also looking to expand their new property in the UAE in the years following its opening.  \nWynn Resorts was also exploring the possibility of developing a property in Thailand if gambling were to be legalized there, however efforts to legalize casinos in Thailand have stalled. \nIn November 2024, prominent Houston-based billionaire Tilman Fertitta, who also owned the rival Golden Nugget brand of casinos, became the largest stockholder at Wynn Resorts after acquiring 9.9% of the company. In April 2025, Fertitta managed to increase his stake at Wynn Resorts after acquiring 12.3% of the company.\nIn January 2025, Wynn Resorts completed the acquisition of the Crown London casino, formerly owned by Crown Resorts. It was rebranded as Wynn Mayfair. \nOn April 14, 2025, Elaine Wynn died at 82 years of age.\n\nEconomic performance\nIn 2017 CNBC reported that Wynn's stock was up 44% for the year and that Wynn's Macau operations were the leading US-based resorts there. \nWynn resorts continued to operate during the pandemic while requiring employees who chose not to receive a COVID-19 vaccination to submit weekly test results for the virus; employees were paid during this time, including a make-whole for tipped employees. The company temporarily suspended its dividend in response to liquidity issues during the pandemic; the divided was reinstated in May 2023. Shortly after pandemic restrictions were lifted in the United States and in Macau, the company began a recovery of revenues and profits.\n\nUnion relations\n47% of Wynn's American employees are unionized. The largest union of Wynn employees is the Culinary Workers Union which agreed to delay automatic contractual wage increases for its members during the COVID-19 pandemic. In 2023 the union reached a new five-year agreement with Wynn which provided pay raises for the employees and was approved with 99% of the vote.\n\nProperties\nProperties in the United States\nLas Vegas Strip, Nevada\nEverett, Massachusetts\nProperties in the United Kingdom\nLondon, England\nProperties in China\nMacau\nFuture properties\nRas al Khaimah, UAE\nProposed properties\nLas Vegas Strip, Nevada\nFormer properties\nLas Vegas Strip, Nevada\nSee also\nList of integrated resorts\nList of casino hotels\n\nReferences\nExternal links\nOfficial website\nBusiness data for Wynn Resorts, Limited:",
  "clean_text": "Wynn Resorts, Limited is an American publicly traded corporation based in Paradise, Nevada, that is a developer and operator of high-end hotels and casinos. It was founded in 2002 by former Mirage Resorts Chairman and CEO Steve Wynn and is now run by CEO Craig Billings. As of 2020, the company has developed six properties. History In 2000, Steve Wynn agreed to sell Mirage Resorts to MGM Grand, after having led Mirage and its predecessors since 1973. Wynn laid the foundation for his next venture that same year, buying the Desert Inn for $270 million. Wynn found an early partner in Japanese billionaire Kazuo Okada of Universal Entertainment Corporation. Wynn, together with Universal subsidiary Aruze USA, controlled almost half the stock, making it harder for outside investors to exert control, as they had done at Mirage in response to Wynn's prolific spending. Wynn hired investment banker Ronald Kramer as president and director in 2002 in order to help take the company public and oversee its expansion. Steve Wynn's wife, and later ex-wife, Elaine was acknowledged to have been the company's largest shareholder. Wynn Resorts made its initial public offering on NASDAQ on October 25, 2002. The company's first project, Wynn Las Vegas, opened on April 28, 2005. Wynn Macau, the company's second project started construction on June 28, 2004. It opened September 6, 2006 and is now the largest-grossing casino in the region. Encore, an extension to Wynn Las Vegas, broke ground on April 28, 2006, the first anniversary of the opening of Wynn Las Vegas. Encore at Wynn Macau, the company's second project on the Macau Peninsula, Macau, People's Republic of China, opened on April 21, 2010. A second resort in Macau, Wynn Palace in Cotai, opened August 22, 2016, on 52 acres (21 ha). The Encore in Las Vegas opened shortly after the beginning of the Great Recession. Despite the additional casino at the Encore (which added 97 tables and 857 slot machines to the original 190 tables and 2000 slots), net casino revenues for the combined resort were initially lower. Similarly, in the first quarter of 2009, net revenues of the Macau operations declined. Following the global economic recovery, performance of the Wynn properties also recovered. Wynn remained the only gaming operator to not perform mass layoffs during the recession. The company considered opening a casino as part of the Entertainment City development in the Philippines, but decided against it because of corruption in the country's gaming industry. Okada decided to proceed with the project alone, leading to the rupture of his partnership with Wynn. The dispute went public with reciprocal accusations of corrupt practices. Wynn and his allies accused Okada of bribing Philippines gaming regulators with over $110,000 in benefits, including free nights in a luxury suite at Wynn Las Vegas, while Okada claimed that Wynn Resorts' record $135 million donation to the University of Macau constituted a bribe. Okada resigned as vice chairman in October 2011, and the following February, after a company investigation by the Freeh Group confirmed the charges against him, the board of directors forced Aruze USA to sell back its shares at a nearly 30% discount. Aruze had been the company's largest shareholder, with a 19.7% stake. On September 17, 2014, the Massachusetts Gaming Commission voted to approve Wynn Resorts' proposed $1.6 billion casino to be located in Everett, Massachusetts on the Mystic River, just north of Boston. Encore Boston Harbor opened on June 23, 2019 at a cost of $1.4 billion.” On February 6, 2018, Steve Wynn resigned as CEO of the company amidst sexual allegations and was replaced by Matthew Maddox. Amid sexual harassment lawsuits involving directors, Maddox announced the planned departure of two board members, Ray Irani and Alvin Shoemaker, on March 7, 2018. The departure of Irani and Shoemaker was to reassure investors that the corporate culture was changing. In April 2018, the company nominated three women to the board of directors: Dee Dee Myers, Betsy Atkins, and Wendy Webb. Elaine Wynn, who still served on the company's board of directors, would acquire her ex-husband's stock and have her voting rights, which she had previously lost in her 2010 divorce from Steve, restored. Elaine Wynn would also become owner of Wynn Resorts, maintaining 8.25 % of the company's stock by December 2021. Talks between Wynn and Crown Resorts of Australia for a $7.1 billion offer collapsed in April 2019; analysts saw the bid as an attempt to diversify away from Macau, where its license was set to expire in 2022. Wynn reached an agreement with the government of Macau for an extension of its concession on December 16, 2022. On May 28, 2019, Wynn paid a $35 million fine to the Massachusetts Gaming Commission and the $500,000 fine placed on Matthew Maddox. On November 9, 2021, Wynn announced that Matthew Maddox would be stepping down as CEO on January 31, 2022. Craig Billings was named as successor to Maddox. Previously, Craig Billings was the CEO of Wynn Interactive and former CFO of Wynn Resorts. Billings assumed the role of CEO effective February 1, 2022. As of 2024, Wynn Resorts was bidding for a casino license to build an integrated resort at the Hudson Yards in New York City. Wynn entered into a partnership with Related Companies to develop an integrated resort with a casino on the western yard; it was announced that the plan would include a \"resort tower\" featuring a casino and hotel. The plan included a 2-million-square-foot office tower, as well as 5.5 acres of public parkland, a public school, and a 1 million-square-foot apartment building with 329 affordable housing units. However, supporters of the High Line later prompted Wynn to make \"substantive changes to plans in response to [supporters'] concerns\"; the revised plan now includes 5.6 acres of public green space in order to generate thousands of union jobs. In March 2024, Wynn Resorts released renderings of the proposed resort and other components of the western portion of the project. Wynn’s proposal for the site was to build a 1,189 foot tall 80 story hotel and casino above the western portion of the West Side Yards. Wynn New York City would have had 1,750 rooms, making it one of the largest hotels in New York City. Wynn Resorts withdrew their New York City casino bid in May 2025. Wynn is currently building Wynn Al Marjan Island which will be the first legal casino in the United Arab Emirates. They are also looking to expand their new property in the UAE in the years following its opening. Wynn Resorts was also exploring the possibility of developing a property in Thailand if gambling were to be legalized there, however efforts to legalize casinos in Thailand have stalled. In November 2024, prominent Houston-based billionaire Tilman Fertitta, who also owned the rival Golden Nugget brand of casinos, became the largest stockholder at Wynn Resorts after acquiring 9.9% of the company. In April 2025, Fertitta managed to increase his stake at Wynn Resorts after acquiring 12.3% of the company. In January 2025, Wynn Resorts completed the acquisition of the Crown London casino, formerly owned by Crown Resorts. It was rebranded as Wynn Mayfair. On April 14, 2025, Elaine Wynn died at 82 years of age. Economic performance In 2017 CNBC reported that Wynn's stock was up 44% for the year and that Wynn's Macau operations were the leading US-based resorts there. Wynn resorts continued to operate during the pandemic while requiring employees who chose not to receive a COVID-19 vaccination to submit weekly test results for the virus; employees were paid during this time, including a make-whole for tipped employees. The company temporarily suspended its dividend in response to liquidity issues during the pandemic; the divided was reinstated in May 2023. Shortly after pandemic restrictions were lifted in the United States and in Macau, the company began a recovery of revenues and profits. Union relations 47% of Wynn's American employees are unionized. The largest union of Wynn employees is the Culinary Workers Union which agreed to delay automatic contractual wage increases for its members during the COVID-19 pandemic. In 2023 the union reached a new five-year agreement with Wynn which provided pay raises for the employees and was approved with 99% of the vote. Properties Properties in the United States Las Vegas Strip, Nevada Everett, Massachusetts Properties in the United Kingdom London, England Properties in China Macau Future properties Ras al Khaimah, UAE Proposed properties Las Vegas Strip, Nevada Former properties Las Vegas Strip, Nevada"
}