{
  "ticker": "XYL",
  "cik": "0001524472",
  "company_name": "Xylem Inc.",
  "corrected_name": "Xylem Inc.",
  "wiki_title_used": "Xylem Inc.",
  "exists": true,
  "raw_text": "Xylem Inc. is a large American water technology provider, in public utility, industrial, commercial, agricultural and residential settings. The company does business in more than 150 countries. Launched in 2011 as the spinoff of the water-related businesses of ITT Corporation, Xylem is headquartered in Washington, DC, with 2024 revenues of $8.6 billion and 23,000 employees worldwide.\nXylem made its debut on the Fortune 500 list in 2024, ranking #486.\nIts products and services are focused in two areas: water infrastructure, which consists of businesses serving clean water delivery, wastewater transport and treatment, dewatering and analytical instrumentation; and applied water, which is residential and commercial building services companies, as well as industrial and agricultural applications.\n\nHistory\nOn January 12, 2011, Xylem's parent, ITT Corporation announced its plan to separate the company into three, stand-alone publicly traded, independent companies\". The future water company was named Xylem, pronounced zi-lem. (The name \"Xylem\", derived from classical Greek, is the tissue that transports water in plants.) It comprises three business units – Water Solutions, Analytics, and Applied Water Systems.\nITT Corporation spun off its defense businesses into a company named ITT Exelis, and retained its corporate name, logo and \"Engineered for life\" company tagline for its other activities.\nIn March 2014, Patrick Decker succeeded Steven R. Loranger as the CEO and president of Xylem. Loranger was chairman, president and CEO of ITT Corporation when it spun its water businesses off as Xylem in October 2011.\nIn May 2023, Xylem completed the acquisition of Evoqua Water Technologies, a provider of water and wastewater treatment solutions and services, in an all-stock transaction valued at $7.5 billion. The combined company becomes the world's largest pure-play water technology company. The structure's projected pro forma revenue is $7.3 billion, with a global workforce of more than 22,000 employees.\nThe company's revenue for 2023 totalled $7.4 billion, exceeding the reported basis by 33%. The company's net profit totalled $266 million, with a net profit margin of 12.6%.\nIn May 2024, Xylem, in partnership with the German city of Weissenburg and the Technical University of Munich, launched a revolutionary water-related initiative, Reuse Brew. This is a traditional German pale lager beer made from recycled wastewater. This process, utilizing technology developed by Xylem, involves ozone injection, ultraviolet radiation, hydrogen peroxide pellets, and filtration through carbon and nano filters.\n\nBrands\nFlygt\nFlygt is a manufacturer of dry and submersible pumps, submersible mixers and related intelligent control systems. Product development and manufacturing of Flygt products are based in Sweden.\n\nHistory\nIn 1901, Per Alfred Stenberg established a foundry in the small town of Emmaboda in southern Sweden. One of the main products was molds for the glass industry. Per Alfred transferred ownership of the company to his sons. In 1922, Hilding Flygt set up a pump and fan sales company in Stockholm. Through a newspaper advertisement the two companies are brought into contact with one another in 1929, and led to the Stenberg brothers beginning to produce Flygt pumps in Emmaboda. \nSixten Englesson, chief engineer, invented the first submersible drainage pump in 1947 and the first submersible sewage pump in 1956. In 1968, the Stenberg family sold the company to ITT Corporation. During the 1970s, the product range was expanded with mixers and other products.\n\nGoulds Water Technology\nGoulds Water Technology is an American manufacturer of water pumps. Incorporated in the 19th century, Goulds Water is a brand of Xylem Inc.\n\nHistory\nThe corporate history of Goulds Pumps began in Seneca Falls, New York in 1848, when Seabury S. Gould purchased the interests of Edward Mynderse and H.C. Silsby in Downs, Mynderse & Co., a pump making business which had started up in 1840. The company, known as Downs & Company until 1869, cast and assembled the world's first all-metal pump in 1849.\nIn 1869, the Goulds name was added, and the company became known as Goulds Manufacturing Company. The Gould family ran the operation from 1872 until 1964, renaming the company Goulds Pumps Incorporated in 1926.\nIn the 1960s, Goulds expanded by adding acquisitions of companies in California, Texas, Pennsylvania and New York. The company expanded under a joint operational agreement into China, Singapore and Korea. By the 1990s, Goulds expanded into Austria, Italy, Mexico and Venezuela.\nIn 1997, Goulds Pumps was purchased by ITT Industries. Goulds and ITT served 130 nations combined. Goulds Pumps was a subsidiary with its own name under ITT. Goulds Pumps management moved back to Seneca Falls in 1998.\n\nBranding under Xylem\nOn October 31, 2011, Xylem Inc. completed its spinoff from ITT Corporation, and had 2011 revenues of $3.8 billion. Goulds Water Technology is a brand of Xylem Inc. providing pumps for residential, commercial and agricultural applications and Goulds Pumps remains a part of ITT Corporation providing pump products for the industrial market.\nXylem comprises three business units – Water Solutions, Analytics, and Applied Water Systems. These three units are interconnected, anticipating and reflecting evolving needs and sharing their applications expertise to cover every stage of the water cycle. The Goulds Water technology brand is part of the Applied Water Systems business unit that manufactures centrifugal and turbine pumps, controllers, variable frequency drives, and accessories for agricultural, building trades, commercial and light industrial water and products for wastewater applications.\n\nHYPACK\nHYPACK, a leading producer of hydrographic data acquisition and processing software, was acquired by Xylem in November, 2015.\n\nYSI\nYSI, a Xylem brand, is a developer and manufacturer of sensors, instruments, software, and data collection platforms for environmental water quality monitoring and testing.\n\nCorporate history\nThe company reaches back to 1948 when a three-man partnership was forged at Antioch College in Yellow Springs, Ohio, US. This village, between Dayton and Columbus, still serves as the headquarters for what started as the Yellow Springs Instrument Company, and later became YSI Inc.\nIn 1985, Malte von Matthiessen succeeded Hardy Trolander as president. In 1999 Rick Omlor became president and COO, and in 2002 he became CEO when von Matthiessen retired. In 2011 Ron Geis was appointed new general manager of YSI; former CEO Rick Omlor continued as executive advisor.\nIn 2011 YSI merged with Analytics division of ITT Corp. to form the water company Xylem.\n\nBranches\nThe firm opened branches in the 1990s in Japan (YSI (Japan) Limited), and then one in Hong Kong (YSI (Hong Kong) Limited). In the 2000s, they opened an office in Qingdao, China, followed by ones in Beijing and in Bahrain. They opened a specialized branch in Shanghai (Asian Hydroacoustics Center). In 2006 they opened an office in Ireland, in 2009 in Australia. and in 2010 in Abu Dhabi. In the US, they opened a Gulf Coast sales and service office in Baton Rouge, Louisiana in 2003.\n\nAcquisitions\nThe firm acquired various companies in the 1980s: Design Analysis Associates, Inc., a firm founded by William I. Fletcher; and acquired Endeco, a Marion, Massachusetts, oceanographic data collection and monitoring company. In the 1990s they acquired Victory Engineering Company, in Springfield, New Jersey, to complement the YSI temperature product line, and SonTek, a precision water velocity measurement company, founded in California; they also acquired controlling interests in Clandon Scientific in England. In the 2000s, they acquired Hydrodta UK, and acquired the environmental business from AMJ Equipment Corp and renamed the new environmental monitoring and services company AMJ Environmental in St. Petersburg, Florida. In 2009, Design Analysis Associates in Logan, Utah, a manufacturer of data loggers and radar level sensors was acquired.\nXylem announced that it would buy Sensus USA Inc., an advanced metering technology manufacturer, in August 2016. The acquisition was completed on October 31, 2016 for $1.7 billion.\n\nProducts\nThe company from the start introduced the first commercial product in many categories: In 1952, they introduced the first quartz crystal electronic stopwatch, and the first practical electronic thermometer. In 1956, first commercial heart-lung machine, in 1957, the first instantaneous blood-gas analyzer.\nThey continued development in their key area of temperature measurement. They produced the first interchangeable thermistor temperature probes in 1955, and developed it into a complete line of precision interchangeable thermistors in 1961, and in 1965 developed the first linear thermistor temperature sensor, which Industrial Research magazine recognized as one of the 100 most significant new technological products of the year. In other analytical instruments, they produced the first practical dissolved oxygen meter for field and laboratory use in 1965, which the same magazine recognized as yet another of the most significant technological products of the year.\nTheir oxygen meter had used the technique of polarography, and they developed further products on the same principle, including the first immobilized-enzyme-activated polarographic sensor in 1972. They then developed further biomedical instrumentation: the first commercially successful whole blood glucose analyzer in 1975, the first commercial alcohol measurement instrument using immobilized enzyme electrode technology in 1982. They continued using immobilized enzyme techniques, for the first direct whole-blood L-lactate assays using immobilized enzyme electrode also in 1982. They also continued developing thermal technology, with the first commercial gallium melting-point temperature standard (29.7715 °C) in 1977 and the first robotic-manufactured glass-encapsulated precision thermistors in 1996.\nThey produced their first environmental monitoring instrument, a dissolved oxygen sensor, in 1992. They then developed instrumentation for conductivity measurement of ultrapure water in 1996, and the first accurate commercial fiber-optic based CO2 measurement system, in 1998.\nBeginning in the late 1990s, they began producing analytical software and integrated analytical instrumentation: BOD Analyst(TM), software that automates BOD testing. They also began developing integrated analytical systems: the YSI 600 QS Quick Sample multiparameter spot sampling system, the YSI 5200 Recirculating System Monitor, and the YSI 7100 Multiparameter Bioanalytical System (MBS).\n\nCharitable\nIn the spring of 2015, Gulf Specimen Marine Laboratory, a small nonprofit educational and scientific marine supply company, raised over $72,000 in a social media campaign to replace their ancient and failing Wedeco ozonator system for water purification required in their aquarium. Xylem Inc provided their new ozonator system \"at cost\", with full engineering support and installation allowing GSML to have the new system with the funds they had raised.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Xylem Inc.:",
  "clean_text": "Xylem Inc. is a large American water technology provider, in public utility, industrial, commercial, agricultural and residential settings. The company does business in more than 150 countries. Launched in 2011 as the spinoff of the water-related businesses of ITT Corporation, Xylem is headquartered in Washington, DC, with 2024 revenues of $8.6 billion and 23,000 employees worldwide. Xylem made its debut on the Fortune 500 list in 2024, ranking #486. Its products and services are focused in two areas: water infrastructure, which consists of businesses serving clean water delivery, wastewater transport and treatment, dewatering and analytical instrumentation; and applied water, which is residential and commercial building services companies, as well as industrial and agricultural applications. History On January 12, 2011, Xylem's parent, ITT Corporation announced its plan to separate the company into three, stand-alone publicly traded, independent companies\". The future water company was named Xylem, pronounced zi-lem. (The name \"Xylem\", derived from classical Greek, is the tissue that transports water in plants.) It comprises three business units – Water Solutions, Analytics, and Applied Water Systems. ITT Corporation spun off its defense businesses into a company named ITT Exelis, and retained its corporate name, logo and \"Engineered for life\" company tagline for its other activities. In March 2014, Patrick Decker succeeded Steven R. Loranger as the CEO and president of Xylem. Loranger was chairman, president and CEO of ITT Corporation when it spun its water businesses off as Xylem in October 2011. In May 2023, Xylem completed the acquisition of Evoqua Water Technologies, a provider of water and wastewater treatment solutions and services, in an all-stock transaction valued at $7.5 billion. The combined company becomes the world's largest pure-play water technology company. The structure's projected pro forma revenue is $7.3 billion, with a global workforce of more than 22,000 employees. The company's revenue for 2023 totalled $7.4 billion, exceeding the reported basis by 33%. The company's net profit totalled $266 million, with a net profit margin of 12.6%. In May 2024, Xylem, in partnership with the German city of Weissenburg and the Technical University of Munich, launched a revolutionary water-related initiative, Reuse Brew. This is a traditional German pale lager beer made from recycled wastewater. This process, utilizing technology developed by Xylem, involves ozone injection, ultraviolet radiation, hydrogen peroxide pellets, and filtration through carbon and nano filters. Brands Flygt Flygt is a manufacturer of dry and submersible pumps, submersible mixers and related intelligent control systems. Product development and manufacturing of Flygt products are based in Sweden. History In 1901, Per Alfred Stenberg established a foundry in the small town of Emmaboda in southern Sweden. One of the main products was molds for the glass industry. Per Alfred transferred ownership of the company to his sons. In 1922, Hilding Flygt set up a pump and fan sales company in Stockholm. Through a newspaper advertisement the two companies are brought into contact with one another in 1929, and led to the Stenberg brothers beginning to produce Flygt pumps in Emmaboda. Sixten Englesson, chief engineer, invented the first submersible drainage pump in 1947 and the first submersible sewage pump in 1956. In 1968, the Stenberg family sold the company to ITT Corporation. During the 1970s, the product range was expanded with mixers and other products. Goulds Water Technology Goulds Water Technology is an American manufacturer of water pumps. Incorporated in the 19th century, Goulds Water is a brand of Xylem Inc. History The corporate history of Goulds Pumps began in Seneca Falls, New York in 1848, when Seabury S. Gould purchased the interests of Edward Mynderse and H.C. Silsby in Downs, Mynderse & Co., a pump making business which had started up in 1840. The company, known as Downs & Company until 1869, cast and assembled the world's first all-metal pump in 1849. In 1869, the Goulds name was added, and the company became known as Goulds Manufacturing Company. The Gould family ran the operation from 1872 until 1964, renaming the company Goulds Pumps Incorporated in 1926. In the 1960s, Goulds expanded by adding acquisitions of companies in California, Texas, Pennsylvania and New York. The company expanded under a joint operational agreement into China, Singapore and Korea. By the 1990s, Goulds expanded into Austria, Italy, Mexico and Venezuela. In 1997, Goulds Pumps was purchased by ITT Industries. Goulds and ITT served 130 nations combined. Goulds Pumps was a subsidiary with its own name under ITT. Goulds Pumps management moved back to Seneca Falls in 1998. Branding under Xylem On October 31, 2011, Xylem Inc. completed its spinoff from ITT Corporation, and had 2011 revenues of $3.8 billion. Goulds Water Technology is a brand of Xylem Inc. providing pumps for residential, commercial and agricultural applications and Goulds Pumps remains a part of ITT Corporation providing pump products for the industrial market. Xylem comprises three business units – Water Solutions, Analytics, and Applied Water Systems. These three units are interconnected, anticipating and reflecting evolving needs and sharing their applications expertise to cover every stage of the water cycle. The Goulds Water technology brand is part of the Applied Water Systems business unit that manufactures centrifugal and turbine pumps, controllers, variable frequency drives, and accessories for agricultural, building trades, commercial and light industrial water and products for wastewater applications. HYPACK HYPACK, a leading producer of hydrographic data acquisition and processing software, was acquired by Xylem in November, 2015. YSI YSI, a Xylem brand, is a developer and manufacturer of sensors, instruments, software, and data collection platforms for environmental water quality monitoring and testing. Corporate history The company reaches back to 1948 when a three-man partnership was forged at Antioch College in Yellow Springs, Ohio, US. This village, between Dayton and Columbus, still serves as the headquarters for what started as the Yellow Springs Instrument Company, and later became YSI Inc. In 1985, Malte von Matthiessen succeeded Hardy Trolander as president. In 1999 Rick Omlor became president and COO, and in 2002 he became CEO when von Matthiessen retired. In 2011 Ron Geis was appointed new general manager of YSI; former CEO Rick Omlor continued as executive advisor. In 2011 YSI merged with Analytics division of ITT Corp. to form the water company Xylem. Branches The firm opened branches in the 1990s in Japan (YSI (Japan) Limited), and then one in Hong Kong (YSI (Hong Kong) Limited). In the 2000s, they opened an office in Qingdao, China, followed by ones in Beijing and in Bahrain. They opened a specialized branch in Shanghai (Asian Hydroacoustics Center). In 2006 they opened an office in Ireland, in 2009 in Australia. and in 2010 in Abu Dhabi. In the US, they opened a Gulf Coast sales and service office in Baton Rouge, Louisiana in 2003. Acquisitions The firm acquired various companies in the 1980s: Design Analysis Associates, Inc., a firm founded by William I. Fletcher; and acquired Endeco, a Marion, Massachusetts, oceanographic data collection and monitoring company. In the 1990s they acquired Victory Engineering Company, in Springfield, New Jersey, to complement the YSI temperature product line, and SonTek, a precision water velocity measurement company, founded in California; they also acquired controlling interests in Clandon Scientific in England. In the 2000s, they acquired Hydrodta UK, and acquired the environmental business from AMJ Equipment Corp and renamed the new environmental monitoring and services company AMJ Environmental in St. Petersburg, Florida. In 2009, Design Analysis Associates in Logan, Utah, a manufacturer of data loggers and radar level sensors was acquired. Xylem announced that it would buy Sensus USA Inc., an advanced metering technology manufacturer, in August 2016. The acquisition was completed on October 31, 2016 for $1.7 billion. Products The company from the start introduced the first commercial product in many categories: In 1952, they introduced the first quartz crystal electronic stopwatch, and the first practical electronic thermometer. In 1956, first commercial heart-lung machine, in 1957, the first instantaneous blood-gas analyzer. They continued development in their key area of temperature measurement. They produced the first interchangeable thermistor temperature probes in 1955, and developed it into a complete line of precision interchangeable thermistors in 1961, and in 1965 developed the first linear thermistor temperature sensor, which Industrial Research magazine recognized as one of the 100 most significant new technological products of the year. In other analytical instruments, they produced the first practical dissolved oxygen meter for field and laboratory use in 1965, which the same magazine recognized as yet another of the most significant technological products of the year. Their oxygen meter had used the technique of polarography, and they developed further products on the same principle, including the first immobilized-enzyme-activated polarographic sensor in 1972. They then developed further biomedical instrumentation: the first commercially successful whole blood glucose analyzer in 1975, the first commercial alcohol measurement instrument using immobilized enzyme electrode technology in 1982. They continued using immobilized enzyme techniques, for the first direct whole-blood L-lactate assays using immobilized enzyme electrode also in 1982. They also continued developing thermal technology, with the first commercial gallium melting-point temperature standard (29.7715 °C) in 1977 and the first robotic-manufactured glass-encapsulated precision thermistors in 1996. They produced their first environmental monitoring instrument, a dissolved oxygen sensor, in 1992. They then developed instrumentation for conductivity measurement of ultrapure water in 1996, and the first accurate commercial fiber-optic based CO2 measurement system, in 1998. Beginning in the late 1990s, they began producing analytical software and integrated analytical instrumentation: BOD Analyst(TM), software that automates BOD testing. They also began developing integrated analytical systems: the YSI 600 QS Quick Sample multiparameter spot sampling system, the YSI 5200 Recirculating System Monitor, and the YSI 7100 Multiparameter Bioanalytical System (MBS). Charitable In the spring of 2015, Gulf Specimen Marine Laboratory, a small nonprofit educational and scientific marine supply company, raised over $72,000 in a social media campaign to replace their ancient and failing Wedeco ozonator system for water purification required in their aquarium. Xylem Inc provided their new ozonator system \"at cost\", with full engineering support and installation allowing GSML to have the new system with the funds they had raised."
}