{
  "ticker": "XYZ",
  "cik": "0001512673",
  "company_name": "Block, Inc.",
  "corrected_name": "Block, Inc.",
  "wiki_title_used": "Block, Inc.",
  "exists": true,
  "raw_text": "Block, Inc. (formerly Square, Inc.) is an American technology company and a financial services provider for consumers and merchants. Founded in 2009 by Jack Dorsey, it is the U.S. market leader in point-of-sale systems. As of 2024, Block serves 57 million users and 4 million sellers, processing $241 billion in payments annually.\nBlock's inaugural product Square, launched in 2009, is a point-of-sale system. It allows sellers to accept card payments and manage operations, including bookings, e-commerce, inventory, payroll, banking, and obtaining business loans. Additionally, Block's portfolio includes Cash App, a consumer-focused digital wallet introduced in 2013. This app allows users to send, receive, save or borrow money, access a debit card, invest in stocks and bitcoin, and file taxes. Block also owns Afterpay, a buy now, pay later business; Bitkey, a self-custody bitcoin wallet; Proto; a bitcoin mining system; and Tidal, a music streaming business.\n\nHistory\n2009: Conception\nThe original inspiration for Block's first product \"Square\" occurred to Jack Dorsey in 2009 when his friend Jim McKelvey was unable to complete a $2,000 sale of his glass faucets and fittings because he could not accept credit cards. Co-founders Dorsey—who also co-founded Twitter—and McKelvey began developing the company out of a small office in St. Louis. The name \"Square\" derives from the company's square-shaped card reader product.\n\n2010–2014: Early years\nAccording to Forbes, Block, named Square, Inc. then, tested its payment method on 50,000 merchants in the summer of 2010, and was reporting a chargeback rate of less than 0.05 percent. In February 2011, Square was reportedly valued at approximately US$240 million, signing up 100,000 new merchants every month. In April 2011, Square announced that it has secured an investment from Visa. In October 2011, the company stated that it was processing about US$2 billion per year in payments through its \"Square\" card readers, charging 2.75 percent per swipe.\nIn 2012, Starbucks and Square announced a partnership that would allow Starbucks to use the Square payment technology to accept payments for coffee. In the same year, Starbucks also reportedly invested in Square at a valuation of US$25 million. Square was handling an annual payment volume of around US$6 billion around that time.\nIn 2013, Square launched Cash App, a peer to peer payment service. In October 2014, the company launched the integration of a payroll feature into its Square payment processing system, following the integrations of a merchant cash advance offering, a customer feedback product and an invoicing service into the system.\n\n2015–2020: Initial public offering, growth\nIn 2015, Square stated that it processed about US$23.8 billion worth of payment volume in 2014. In the same year, the company sold shares in its initial public offering for US$9 per share, giving itself a market capitalization of $2.9 billion.\nIn 2018, Vox reported Square as stating that over 7 million people used the Cash App in December 2017. Vox also stated that Cash App was the \"No. 1 free finance app\" in Apple's U.S. iPhone App Store and was \"ahead\" of PayPal and Venmo.\nIn October 2020, Square put approximately 1% of their total assets ($50 million) in Bitcoin (4,709 bitcoins), citing Bitcoin's \"potential to be a more ubiquitous currency in the future\" as their main reasoning. The company purchased approximately 3,318 bitcoins in February 2021 for a cost of around $170 million, bringing Square's total holdings to around 8,027 bitcoins (equivalent to around US$500 million in 2021, around US$481 million as of July 2024).\n\n2021–2022: Name change, acquisitions\nOn March 2, 2021, Square reached an agreement to acquire majority ownership in Tidal. Square paid $297 million in cash and stock for Tidal, with Jay-Z joining the company's board of directors. Jay-Z, as well as other artists who currently own stock in Tidal, will remain stakeholders.\nOn December 1, 2021, Square announced that it would change its company name to Block, Inc. on December 10. The change was announced shortly after Dorsey resigned as CEO of Twitter. On December 10, 2021, the name change took effect, and Square, Inc. became Block, Inc. On December 16, less than a week into the rebrand, H&R Block, sued the company for trademark infringement, claiming that the name seeks to confuse customers by misappropriating the Block brand name, which H&R owns. The lawsuit was resolved in April 2023 when the two companies jointly agreed to dismiss the suit.\nOn January 31, 2022, Block completed its acquisition of Afterpay, an Australian buy now, pay later (BNPL) lender.\n\n2023–present: Business realignment, S&P 500 addition\nIn February 2023, Afterpay suffered a service issue which led to a sudden reduction in the spending limits for many users. At least 2000 users reported experiencing a difficulty with the service. Afterpay acknowledged the problem and said it was working on a fix. On September 7 and 8, 2023, Square and Cash App experienced outages, affecting thousands of users. Card payment processing, peer-to-peer payments and other transactions were among the impacted operations. On September 8, 2023, Block informed that the service disruptions had been resolved and all systems were operational by the afternoon of that day. It also said the outage was caused by an issue with the company's Domain Name System (DNS), and did not stem from a cyberattack. In the following week, Block apologized to its customers and acknowledged “this situation was made more difficult by our communication”. To reduce the risk of a similar outage in future, the company said it had deployed a new set of firewall and DNS server changes, expanded offline payment capabilities so merchants can still accept payments in offline mode, and put in place additional measures. Later in the month, Block said in a regulatory filing that the CEO of its Square business, Alyssa Henry, was set to leave the company in October 2023, and that Jack Dorsey, serving then as the \"Block Head\" and Chairperson, would take on an additional role of \"Square Head\".\nIn February 2024, Block reported an annual \"Gross Payment Volume\" of US$228 billion and an annual income of $9.8 million for the year 2023. In April 2024, CNBC reported that Block announced it had finished the development of its own standalone three-nanometer bitcoin mining chip and was in the process of working through the design with a semiconductor foundry. The company was also reported to be developing a \"full bitcoin mining system\", stating that its goal was to both decentralize the supply of bitcoin mining hardware and the distribution of hashrate — a proxy for industry competition and mining difficulty. In this regard, according to CNBC, Block was solving a \"major barrier to entry\" posed by the relative difficulty in sourcing mining rigs, their high prices and unpredictable delivery. In May 2024, the company's Square platform was found to be the market leader in point-of-sale systems in the U.S. In July 2024, Block signed a \"large-scale crypto mining hardware pact\", agreeing to supply its chips to bitcoin miner \"Core Scientific\". The company did not disclose financial details of the pact. In September 2024, Block announced a leadership reshuffle, moving many longtime executives into more senior roles and creating a new position focused on customer safety. As part of these changes, Brian Grassadonia, formerly the CEO of Cash App, was appointed as the company's new \"ecosystem lead\" to enhance coordination across Block's business sectors.\nIn October 2024, Bitkey appeared in TIME's list of the \"best inventions of 2024\". In November 2024, Fortune reported that Block was laying off many employees from its Tidal, TBD and Square services. That same month, Block announced it was \"winding down\" TBD, \"scaling back\" investments in Tidal and focussing its resources on its bitcoin mining initiative as well as Bitkey, while adding that it was \"refining\" its investments based on progress. The firm changed its stock ticker from SQ to XYZ in January 2025.\nIn March 2025, Block announced to staff that they had plans to cut almost 1000 employees.\nOn July 23, 2025, Block was added to the S&P 500, replacing Hess Corporation.\n\nSubsidiaries, products, services\nSquare\nSquare is a payments platform that allows businesses to accept card payments and use smartphones or tablets or computers as payment registers for a point-of-sale system (POS). The platform was founded in 2009 by Dorsey and McKelvey. Square also offers additional features to manage various operations including staff payroll and shift schedules, customer bookings, inventory, e-Commerce, banking and business loans.\nIn 2022, a Protocol survey showed that 35% of U.S. small business owners used Square, a higher percentage than its competitors, while also highlighting the POS market's continued fragmentation. In April 2023, Square was reported to have 4 million merchants as its customers. Its client base includes small and medium-sized businesses as well as larger ones. As of 2024, the platform is available in the U.S., Australia, Canada, France, Japan, Republic of Ireland, Spain and the U.K., and is the U.S. market leader in point-of-sale systems.\n\nCash App\nLaunched in October 2013, Cash App (formerly Square Cash) is a digital wallet which allows sending and receiving money, investing in stocks or bitcoin, and filing taxes. In March 2015, the firm introduced Square Cash for businesses, which includes the ability for individuals, organizations, and business owners to use a unique username, known as a $cashtag, to send and receive money. As of 2023, Cash App also offers a savings account and a debit card, and services such as direct deposit and investing in stocks and Bitcoin. In March 2023, USA Today reported that Cash App offered a free tax-filing service while cautioning that it didn't accommodate \"every tax situation\" and didn't offer \"live tax support\". In October 2023, it was reported that Cash App also allowed users to borrow up to $200 from the app, and that \"not everyone is an eligible user for this feature\".\nCash App has been found to be the preferred payment app among lower-income adults in the U.S., reporting 57 million \"monthly active users\" as of 2024.\n\nAfterpay\nAfterpay is an Australian digital payment platform in which a bought product can be paid off in four installments. This idea made in 2008 by a then eighteen-year-old Nick Molnar was geared towards millennials and inspired by the 2008 financial crisis. Molnar and Partner/ Co-founder Anthony Eisen launched their platform in 2014 and in four years their product reached a market capitalization of around $3.3 billion. In February 2020, Afterpay was reported to have 3.6 million active customers in the US, 3.1 million in Australia and New Zealand, and 600,000 in the UK. According to ABC News (Australia) in August 2021, Afterpay had operations in the U.S., Canada and New Zealand, as well as in the U.K., France, Italy and Spain as Clearpay. In the same month, Afterpay and Block announced that Afterpay would be acquired by Block. Block paid US$29 billion in stock for the acquisition and the process was finalized in January 2022. Molnar and Eisen continued to lead Afterpay's merchant and consumer businesses following the acquisition. In 2024, Molnar was promoted to the role of the \"head of sales\", leading all sales activity at Block while reporting to Dorsey.\nAs of 2023, Afterpay serves 24 million users and 348,000 merchants, processing US$27.3 billion in payments annually. It also ranks among the three most-used BNPL services globally.\n\nBitkey\nIn December 2023, Block launched Bitkey, a self-custody Bitcoin hardware wallet, in 95 countries including the U.S., the U.K., Canada, Nigeria, Argentina, Mexico, and India. The wallet allows investors to own, manage and store their Bitcoin without relying on third-party exchanges or custodians. Bitkey includes a mobile app, hardware device, and a set of recovery tools in case the customer loses the phone, their hardware or both. The wallet cannot access or move a customer's Bitcoin without them. In October 2024, TIME named Bitkey as one of the \"best inventions of 2024\".\n\nProto\nProto is Block's bitcoin mining system. In April 2024, the company announced it was building a bitcoin mining system, aiming to decentralize both the supply of bitcoin mining hardware and the distribution of hashrate. The company also said it had finished developing its own standalone three-nanometer bitcoin mining chip and was finalizing the design with a semiconductor foundry. In July 2024, Block signed an agreement to supply its chips to bitcoin miner \"Core Scientific\". In February 2025, the company stated it was manufacturing chips with roll out plans later in the year, along with its mining system. The firm also said it was expecting Proto to contribute to Block's business growth in the second half of 2025.\n\nTidal\nTidal is a high-definition music streaming service with a catalog of over 100 million songs across various genres. It only offers a subscription based plan. Originally launched in 2014 by Aspiro, a Norwegian company, Tidal was purchased in 2015 by American rapper Jay-Z for $56 million, reportedly to \"give artists more control over the distribution of their music\". At that time, Tidal was available in the U.S., Canada, the U.K., Republic of Ireland, Finland, the Netherlands, Belgium and Luxembourg. In 2021, Block took majority ownership of Tidal for $297 million, stating it aimed to find \"new ways for artists to support their work\" and to create \"tools that can help support musicians' businesses\". Tidal was then operating in a streaming market dominated by Spotify and others, and was paying \"better royalty rates\" to artists than its rivals including Spotify. In May 2023, Wired reported that Tidal's “Direct Artist Payouts” scheme, in which up to 10 percent of a user's subscription fee was delivered to the artists they listened to most, had been discontinued in 2022. According to Wired, the scheme was \"thoughtful\" and supportive of bands and artists, and its closure reduced some of Tidal's market differentiation. In November 2024, Block announced it was \"scaling back\" investments in Tidal after reports emerged that the company was laying off Tidal employees. Block added it was eliminating Tidal's product management and product marketing functions entirely and that Tidal would become a smaller entity, focusing on fewer areas while emphasizing product development.\n\nWeebly\nWeebly is a web hosting service that allows users to create and manage websites through an intuitive drag-and-drop interface. It offers a range of customizable templates and e-commerce tools, catering to small businesses and personal websites. Founded in 2006 by David Rusenko, Chris Fanini, and Dan Veltri, Weebly was initially developed to simplify website creation for non-technical users. In 2018, Square (now Block, Inc.) acquired Weebly for $365 million, integrating its services with Square's payment and commerce solutions. At the time of the acquisition, Weebly hosted over 625,000 paid subscribers and had more than 40 million sites built on its platform. Despite competition from platforms like Wix and Squarespace, Weebly maintained a strong user base due to its ease of use and affordable pricing. In 2021, Block announced plans to merge Weebly with its Square Online platform, phasing out the Weebly brand in favor of a unified e-commerce solution. By 2023, the transition was complete, with existing Weebly users migrated to Square Online while retaining access to Weebly's core features. Analysts noted that the rebranding aimed to streamline Block's product offerings but left some long-time Weebly users dissatisfied with the changes.\n\nFinancials\nBlock received angel investments from Marissa Mayer, Kevin Rose, Biz Stone, Dennis Crowley, Shawn Fanning, MC Hammer, and Esther Dyson. Since then, it has raised several additional rounds of funding:\n\nSeries A funding from Khosla Ventures\nSeries B funding from Sequoia Capital\nSeries C funding from Kleiner Perkins\nSeries D funding from Citi Ventures, Rizvi Traverse Management, and Starbucks\nSeries E funding from Goldman Sachs, Rizvi Traverse Management, and GIC Private Limited\nThe company's valuation in October 2014 was $6 billion. On November 19, 2015, Block had its IPO on the New York Stock Exchange with an initial valuation of $2.9 billion, down by more than half from its last valuation in October 2014 at $6 billion. The series E funding shares had different rights than the common shares sold at the IPO, therefore the $6 billion 'valuation' from October 2014 is wrong. Although the firm was yet to make a profit as of 2015 and had lost $420 million since 2012, it had decreased its losses from 44% of revenues to 16% in the six months leading up to its IPO. For the fiscal year 2018, Block reported losses of US$38 million, with an annual revenue of US$3.299 billion, an increase of 49.0% over the previous fiscal cycle. The company reported $24.12 billion in revenue, $892 million in operating income, $2.9 billion in net income and $240.81 billion in gross payment volume (GPV) for the year 2024. It also stated that it had 11,372 employees, $36.78 billion in total assets and $21.27 billion in total stockholders' equity by the end of the year.\n\nBusiness\nOperations\nBlock was co-founded by Twitter creator Jack Dorsey under the name Square. Dorsey also serves as chief executive officer and Amrita Ahuja serves as chief financial officer. Block's office is in San Francisco. The firm has more than 5,000 employees.\nBlock's payment platform, Square, has been available in the United States since 2010 and the company launched in Canada at the end of 2012. In March 2020, Square implemented remote work due to the COVID-19 pandemic. In May 2020, Square announced that some of its workers would be allowed to be permanent remote workers. As of 2021, although Block's real estate footprint remains intact, they no longer have a designated headquarters location.\n\nFinancing and acquisitions\nIn August 2014, Victory Park Capital, an asset management firm, invested in Square Capital. In May 2015, Square Capital raised additional funding, with Victory Park Capital tripling its initial investment. As of 2016, Square had loaned $1 billion to companies through Square Capital since the program's inception. On November 19, 2015, Square Inc. became a public company via an initial public offering. On April 19, 2018, Square announced that it had acquired Zesty, a food delivery service that caters to corporate offices. On April 26, 2018, Square announced that it would acquire Weebly, a website-building service, for $365 million. In May 2019, Square announced that it had acquired Eloquent Labs, an artificial intelligence startup helping improve the customer service experience.\nIn February 2020, Square announced that it had acquired Dessa, a Toronto-based deep learning company. In November 2020, Square announced it was acquiring Credit Karma Tax, a free do-it-yourself tax-filing service, from Credit Karma for $50 million and would make it a part of its Cash App unit. In March 2021, Square announced it was acquiring a significant majority in music streaming platform Tidal for $293 million in a deal of stock and cash. In the same month, Square's Q1 sales surged 266% as transactions jumped amid economic recovery. In August 2021, Square announced its acquisition of Afterpay, a company offering a \"buy now, pay later\" service. Square finalized the $29 billion stock deal on January 31, 2022.\n\nControversies\nAllegations of illegal activity\nOn March 23, 2023, investment research firm Hindenburg Research disclosed a short position in Block, leading to a 15% drop in the company's shares that day. Hindenburg's accusations of Block included exaggerating user counts, failing to curb fraud and illegal activity on Cash App, and permitting impersonation of high-profile individuals. It also wrote in its report that Block \"embraced predatory offerings and compliance worst practices in order to fuel growth and profit from facilitation of fraud against consumers and the government.\"\nBlock responded to the allegations in a press release saying, \"We intend to work with the SEC and explore legal action against Hindenburg Research for the factually inaccurate and misleading report they shared about our Cash App business today\".\nNBC News reported in May 2024 that prosecutors at the Southern District of New York were examining financial transactions and internal practices at Block, stemming from alleged compliance lapses at its Square and Cash App units. According to the report, the company allegedly failed to collect adequate information from customers, processed transactions involving countries subject to economic sanctions, and processed cryptocurrency transactions for terrorist groups. In November 2024, Block disclosed in its earnings report for July–September 2024 that it was negotiating a potential settlement with several state regulators that had probed the company's anti-money laundering program. Additionally, Block stated it was negotiating a potential settlement with the Consumer Financial Protection Bureau (CFPB) in matters including those related to Cash App's handling of customer complaints and disputes. The company added it had accrued a liability for estimated amount in connection with each potential settlement and the amount was not material to the company's financial statements as of September 30, 2024.\n\nNotes\nReferences\nExternal links\nOfficial website\nBusiness data for Block, Inc.:",
  "clean_text": "Block, Inc. (formerly Square, Inc.) is an American technology company and a financial services provider for consumers and merchants. Founded in 2009 by Jack Dorsey, it is the U.S. market leader in point-of-sale systems. As of 2024, Block serves 57 million users and 4 million sellers, processing $241 billion in payments annually. Block's inaugural product Square, launched in 2009, is a point-of-sale system. It allows sellers to accept card payments and manage operations, including bookings, e-commerce, inventory, payroll, banking, and obtaining business loans. Additionally, Block's portfolio includes Cash App, a consumer-focused digital wallet introduced in 2013. This app allows users to send, receive, save or borrow money, access a debit card, invest in stocks and bitcoin, and file taxes. Block also owns Afterpay, a buy now, pay later business; Bitkey, a self-custody bitcoin wallet; Proto; a bitcoin mining system; and Tidal, a music streaming business. History 2009: Conception The original inspiration for Block's first product \"Square\" occurred to Jack Dorsey in 2009 when his friend Jim McKelvey was unable to complete a $2,000 sale of his glass faucets and fittings because he could not accept credit cards. Co-founders Dorsey—who also co-founded Twitter—and McKelvey began developing the company out of a small office in St. Louis. The name \"Square\" derives from the company's square-shaped card reader product. 2010–2014: Early years According to Forbes, Block, named Square, Inc. then, tested its payment method on 50,000 merchants in the summer of 2010, and was reporting a chargeback rate of less than 0.05 percent. In February 2011, Square was reportedly valued at approximately US$240 million, signing up 100,000 new merchants every month. In April 2011, Square announced that it has secured an investment from Visa. In October 2011, the company stated that it was processing about US$2 billion per year in payments through its \"Square\" card readers, charging 2.75 percent per swipe. In 2012, Starbucks and Square announced a partnership that would allow Starbucks to use the Square payment technology to accept payments for coffee. In the same year, Starbucks also reportedly invested in Square at a valuation of US$25 million. Square was handling an annual payment volume of around US$6 billion around that time. In 2013, Square launched Cash App, a peer to peer payment service. In October 2014, the company launched the integration of a payroll feature into its Square payment processing system, following the integrations of a merchant cash advance offering, a customer feedback product and an invoicing service into the system. 2015–2020: Initial public offering, growth In 2015, Square stated that it processed about US$23.8 billion worth of payment volume in 2014. In the same year, the company sold shares in its initial public offering for US$9 per share, giving itself a market capitalization of $2.9 billion. In 2018, Vox reported Square as stating that over 7 million people used the Cash App in December 2017. Vox also stated that Cash App was the \"No. 1 free finance app\" in Apple's U.S. iPhone App Store and was \"ahead\" of PayPal and Venmo. In October 2020, Square put approximately 1% of their total assets ($50 million) in Bitcoin (4,709 bitcoins), citing Bitcoin's \"potential to be a more ubiquitous currency in the future\" as their main reasoning. The company purchased approximately 3,318 bitcoins in February 2021 for a cost of around $170 million, bringing Square's total holdings to around 8,027 bitcoins (equivalent to around US$500 million in 2021, around US$481 million as of July 2024). 2021–2022: Name change, acquisitions On March 2, 2021, Square reached an agreement to acquire majority ownership in Tidal. Square paid $297 million in cash and stock for Tidal, with Jay-Z joining the company's board of directors. Jay-Z, as well as other artists who currently own stock in Tidal, will remain stakeholders. On December 1, 2021, Square announced that it would change its company name to Block, Inc. on December 10. The change was announced shortly after Dorsey resigned as CEO of Twitter. On December 10, 2021, the name change took effect, and Square, Inc. became Block, Inc. On December 16, less than a week into the rebrand, H&R Block, sued the company for trademark infringement, claiming that the name seeks to confuse customers by misappropriating the Block brand name, which H&R owns. The lawsuit was resolved in April 2023 when the two companies jointly agreed to dismiss the suit. On January 31, 2022, Block completed its acquisition of Afterpay, an Australian buy now, pay later (BNPL) lender. 2023–present: Business realignment, S&P 500 addition In February 2023, Afterpay suffered a service issue which led to a sudden reduction in the spending limits for many users. At least 2000 users reported experiencing a difficulty with the service. Afterpay acknowledged the problem and said it was working on a fix. On September 7 and 8, 2023, Square and Cash App experienced outages, affecting thousands of users. Card payment processing, peer-to-peer payments and other transactions were among the impacted operations. On September 8, 2023, Block informed that the service disruptions had been resolved and all systems were operational by the afternoon of that day. It also said the outage was caused by an issue with the company's Domain Name System (DNS), and did not stem from a cyberattack. In the following week, Block apologized to its customers and acknowledged “this situation was made more difficult by our communication”. To reduce the risk of a similar outage in future, the company said it had deployed a new set of firewall and DNS server changes, expanded offline payment capabilities so merchants can still accept payments in offline mode, and put in place additional measures. Later in the month, Block said in a regulatory filing that the CEO of its Square business, Alyssa Henry, was set to leave the company in October 2023, and that Jack Dorsey, serving then as the \"Block Head\" and Chairperson, would take on an additional role of \"Square Head\". In February 2024, Block reported an annual \"Gross Payment Volume\" of US$228 billion and an annual income of $9.8 million for the year 2023. In April 2024, CNBC reported that Block announced it had finished the development of its own standalone three-nanometer bitcoin mining chip and was in the process of working through the design with a semiconductor foundry. The company was also reported to be developing a \"full bitcoin mining system\", stating that its goal was to both decentralize the supply of bitcoin mining hardware and the distribution of hashrate — a proxy for industry competition and mining difficulty. In this regard, according to CNBC, Block was solving a \"major barrier to entry\" posed by the relative difficulty in sourcing mining rigs, their high prices and unpredictable delivery. In May 2024, the company's Square platform was found to be the market leader in point-of-sale systems in the U.S. In July 2024, Block signed a \"large-scale crypto mining hardware pact\", agreeing to supply its chips to bitcoin miner \"Core Scientific\". The company did not disclose financial details of the pact. In September 2024, Block announced a leadership reshuffle, moving many longtime executives into more senior roles and creating a new position focused on customer safety. As part of these changes, Brian Grassadonia, formerly the CEO of Cash App, was appointed as the company's new \"ecosystem lead\" to enhance coordination across Block's business sectors. In October 2024, Bitkey appeared in TIME's list of the \"best inventions of 2024\". In November 2024, Fortune reported that Block was laying off many employees from its Tidal, TBD and Square services. That same month, Block announced it was \"winding down\" TBD, \"scaling back\" investments in Tidal and focussing its resources on its bitcoin mining initiative as well as Bitkey, while adding that it was \"refining\" its investments based on progress. The firm changed its stock ticker from SQ to XYZ in January 2025. In March 2025, Block announced to staff that they had plans to cut almost 1000 employees. On July 23, 2025, Block was added to the S&P 500, replacing Hess Corporation. Subsidiaries, products, services Square Square is a payments platform that allows businesses to accept card payments and use smartphones or tablets or computers as payment registers for a point-of-sale system (POS). The platform was founded in 2009 by Dorsey and McKelvey. Square also offers additional features to manage various operations including staff payroll and shift schedules, customer bookings, inventory, e-Commerce, banking and business loans. In 2022, a Protocol survey showed that 35% of U.S. small business owners used Square, a higher percentage than its competitors, while also highlighting the POS market's continued fragmentation. In April 2023, Square was reported to have 4 million merchants as its customers. Its client base includes small and medium-sized businesses as well as larger ones. As of 2024, the platform is available in the U.S., Australia, Canada, France, Japan, Republic of Ireland, Spain and the U.K., and is the U.S. market leader in point-of-sale systems. Cash App Launched in October 2013, Cash App (formerly Square Cash) is a digital wallet which allows sending and receiving money, investing in stocks or bitcoin, and filing taxes. In March 2015, the firm introduced Square Cash for businesses, which includes the ability for individuals, organizations, and business owners to use a unique username, known as a $cashtag, to send and receive money. As of 2023, Cash App also offers a savings account and a debit card, and services such as direct deposit and investing in stocks and Bitcoin. In March 2023, USA Today reported that Cash App offered a free tax-filing service while cautioning that it didn't accommodate \"every tax situation\" and didn't offer \"live tax support\". In October 2023, it was reported that Cash App also allowed users to borrow up to $200 from the app, and that \"not everyone is an eligible user for this feature\". Cash App has been found to be the preferred payment app among lower-income adults in the U.S., reporting 57 million \"monthly active users\" as of 2024. Afterpay Afterpay is an Australian digital payment platform in which a bought product can be paid off in four installments. This idea made in 2008 by a then eighteen-year-old Nick Molnar was geared towards millennials and inspired by the 2008 financial crisis. Molnar and Partner/ Co-founder Anthony Eisen launched their platform in 2014 and in four years their product reached a market capitalization of around $3.3 billion. In February 2020, Afterpay was reported to have 3.6 million active customers in the US, 3.1 million in Australia and New Zealand, and 600,000 in the UK. According to ABC News (Australia) in August 2021, Afterpay had operations in the U.S., Canada and New Zealand, as well as in the U.K., France, Italy and Spain as Clearpay. In the same month, Afterpay and Block announced that Afterpay would be acquired by Block. Block paid US$29 billion in stock for the acquisition and the process was finalized in January 2022. Molnar and Eisen continued to lead Afterpay's merchant and consumer businesses following the acquisition. In 2024, Molnar was promoted to the role of the \"head of sales\", leading all sales activity at Block while reporting to Dorsey. As of 2023, Afterpay serves 24 million users and 348,000 merchants, processing US$27.3 billion in payments annually. It also ranks among the three most-used BNPL services globally. Bitkey In December 2023, Block launched Bitkey, a self-custody Bitcoin hardware wallet, in 95 countries including the U.S., the U.K., Canada, Nigeria, Argentina, Mexico, and India. The wallet allows investors to own, manage and store their Bitcoin without relying on third-party exchanges or custodians. Bitkey includes a mobile app, hardware device, and a set of recovery tools in case the customer loses the phone, their hardware or both. The wallet cannot access or move a customer's Bitcoin without them. In October 2024, TIME named Bitkey as one of the \"best inventions of 2024\". Proto Proto is Block's bitcoin mining system. In April 2024, the company announced it was building a bitcoin mining system, aiming to decentralize both the supply of bitcoin mining hardware and the distribution of hashrate. The company also said it had finished developing its own standalone three-nanometer bitcoin mining chip and was finalizing the design with a semiconductor foundry. In July 2024, Block signed an agreement to supply its chips to bitcoin miner \"Core Scientific\". In February 2025, the company stated it was manufacturing chips with roll out plans later in the year, along with its mining system. The firm also said it was expecting Proto to contribute to Block's business growth in the second half of 2025. Tidal Tidal is a high-definition music streaming service with a catalog of over 100 million songs across various genres. It only offers a subscription based plan. Originally launched in 2014 by Aspiro, a Norwegian company, Tidal was purchased in 2015 by American rapper Jay-Z for $56 million, reportedly to \"give artists more control over the distribution of their music\". At that time, Tidal was available in the U.S., Canada, the U.K., Republic of Ireland, Finland, the Netherlands, Belgium and Luxembourg. In 2021, Block took majority ownership of Tidal for $297 million, stating it aimed to find \"new ways for artists to support their work\" and to create \"tools that can help support musicians' businesses\". Tidal was then operating in a streaming market dominated by Spotify and others, and was paying \"better royalty rates\" to artists than its rivals including Spotify. In May 2023, Wired reported that Tidal's “Direct Artist Payouts” scheme, in which up to 10 percent of a user's subscription fee was delivered to the artists they listened to most, had been discontinued in 2022. According to Wired, the scheme was \"thoughtful\" and supportive of bands and artists, and its closure reduced some of Tidal's market differentiation. In November 2024, Block announced it was \"scaling back\" investments in Tidal after reports emerged that the company was laying off Tidal employees. Block added it was eliminating Tidal's product management and product marketing functions entirely and that Tidal would become a smaller entity, focusing on fewer areas while emphasizing product development. Weebly Weebly is a web hosting service that allows users to create and manage websites through an intuitive drag-and-drop interface. It offers a range of customizable templates and e-commerce tools, catering to small businesses and personal websites. Founded in 2006 by David Rusenko, Chris Fanini, and Dan Veltri, Weebly was initially developed to simplify website creation for non-technical users. In 2018, Square (now Block, Inc.) acquired Weebly for $365 million, integrating its services with Square's payment and commerce solutions. At the time of the acquisition, Weebly hosted over 625,000 paid subscribers and had more than 40 million sites built on its platform. Despite competition from platforms like Wix and Squarespace, Weebly maintained a strong user base due to its ease of use and affordable pricing. In 2021, Block announced plans to merge Weebly with its Square Online platform, phasing out the Weebly brand in favor of a unified e-commerce solution. By 2023, the transition was complete, with existing Weebly users migrated to Square Online while retaining access to Weebly's core features. Analysts noted that the rebranding aimed to streamline Block's product offerings but left some long-time Weebly users dissatisfied with the changes. Financials Block received angel investments from Marissa Mayer, Kevin Rose, Biz Stone, Dennis Crowley, Shawn Fanning, MC Hammer, and Esther Dyson. Since then, it has raised several additional rounds of funding: Series A funding from Khosla Ventures Series B funding from Sequoia Capital Series C funding from Kleiner Perkins Series D funding from Citi Ventures, Rizvi Traverse Management, and Starbucks Series E funding from Goldman Sachs, Rizvi Traverse Management, and GIC Private Limited The company's valuation in October 2014 was $6 billion. On November 19, 2015, Block had its IPO on the New York Stock Exchange with an initial valuation of $2.9 billion, down by more than half from its last valuation in October 2014 at $6 billion. The series E funding shares had different rights than the common shares sold at the IPO, therefore the $6 billion 'valuation' from October 2014 is wrong. Although the firm was yet to make a profit as of 2015 and had lost $420 million since 2012, it had decreased its losses from 44% of revenues to 16% in the six months leading up to its IPO. For the fiscal year 2018, Block reported losses of US$38 million, with an annual revenue of US$3.299 billion, an increase of 49.0% over the previous fiscal cycle. The company reported $24.12 billion in revenue, $892 million in operating income, $2.9 billion in net income and $240.81 billion in gross payment volume (GPV) for the year 2024. It also stated that it had 11,372 employees, $36.78 billion in total assets and $21.27 billion in total stockholders' equity by the end of the year. Business Operations Block was co-founded by Twitter creator Jack Dorsey under the name Square. Dorsey also serves as chief executive officer and Amrita Ahuja serves as chief financial officer. Block's office is in San Francisco. The firm has more than 5,000 employees. Block's payment platform, Square, has been available in the United States since 2010 and the company launched in Canada at the end of 2012. In March 2020, Square implemented remote work due to the COVID-19 pandemic. In May 2020, Square announced that some of its workers would be allowed to be permanent remote workers. As of 2021, although Block's real estate footprint remains intact, they no longer have a designated headquarters location. Financing and acquisitions In August 2014, Victory Park Capital, an asset management firm, invested in Square Capital. In May 2015, Square Capital raised additional funding, with Victory Park Capital tripling its initial investment. As of 2016, Square had loaned $1 billion to companies through Square Capital since the program's inception. On November 19, 2015, Square Inc. became a public company via an initial public offering. On April 19, 2018, Square announced that it had acquired Zesty, a food delivery service that caters to corporate offices. On April 26, 2018, Square announced that it would acquire Weebly, a website-building service, for $365 million. In May 2019, Square announced that it had acquired Eloquent Labs, an artificial intelligence startup helping improve the customer service experience. In February 2020, Square announced that it had acquired Dessa, a Toronto-based deep learning company. In November 2020, Square announced it was acquiring Credit Karma Tax, a free do-it-yourself tax-filing service, from Credit Karma for $50 million and would make it a part of its Cash App unit. In March 2021, Square announced it was acquiring a significant majority in music streaming platform Tidal for $293 million in a deal of stock and cash. In the same month, Square's Q1 sales surged 266% as transactions jumped amid economic recovery. In August 2021, Square announced its acquisition of Afterpay, a company offering a \"buy now, pay later\" service. Square finalized the $29 billion stock deal on January 31, 2022. Controversies Allegations of illegal activity On March 23, 2023, investment research firm Hindenburg Research disclosed a short position in Block, leading to a 15% drop in the company's shares that day. Hindenburg's accusations of Block included exaggerating user counts, failing to curb fraud and illegal activity on Cash App, and permitting impersonation of high-profile individuals. It also wrote in its report that Block \"embraced predatory offerings and compliance worst practices in order to fuel growth and profit from facilitation of fraud against consumers and the government.\" Block responded to the allegations in a press release saying, \"We intend to work with the SEC and explore legal action against Hindenburg Research for the factually inaccurate and misleading report they shared about our Cash App business today\". NBC News reported in May 2024 that prosecutors at the Southern District of New York were examining financial transactions and internal practices at Block, stemming from alleged compliance lapses at its Square and Cash App units. According to the report, the company allegedly failed to collect adequate information from customers, processed transactions involving countries subject to economic sanctions, and processed cryptocurrency transactions for terrorist groups. In November 2024, Block disclosed in its earnings report for July–September 2024 that it was negotiating a potential settlement with several state regulators that had probed the company's anti-money laundering program. Additionally, Block stated it was negotiating a potential settlement with the Consumer Financial Protection Bureau (CFPB) in matters including those related to Cash App's handling of customer complaints and disputes. The company added it had accrued a liability for estimated amount in connection with each potential settlement and the amount was not material to the company's financial statements as of September 30, 2024. Notes"
}