{
  "ticker": "ZBH",
  "cik": "0001136869",
  "company_name": "Zimmer Biomet",
  "corrected_name": "Zimmer Biomet",
  "wiki_title_used": "Zimmer Biomet",
  "exists": true,
  "raw_text": "Zimmer Biomet Holdings, Inc. is a publicly traded American medical device company. It was founded in 1927 to produce aluminum splints. The firm is headquartered in Warsaw, Indiana, where it is part of the medical devices business cluster.\nIn 2001, Zimmer was spun off from Bristol Myers Squibb and began trading on the New York Stock Exchange, on August 7, under the ticker symbol “ZMH”. In November 2011, the company acquired ExtraOrtho, Inc. (ExtraOrtho). In January 2012, the company acquired Reno, Nevada-based Synvasive Technology, Inc. On June 29, 2015, the company changed the ticker symbol to \"ZBH\" to reflect its acquisition of Biomet.\nOn January 12, 2017, Zimmer Biomet announced a resolution with the DOJ and the SEC in which it agreed to pay a fine of approximately $30.5 million, an amount which would not affect its 2017 outlook.\n\nHistory\nZimmer Biomet was established in 1927 by Justin O. Zimmer (1884–1951) in Warsaw, Indiana.\nOn April 24, 2014, it was announced that Zimmer had agreed to purchase Biomet Inc. for $13.4 billion. In October 2014, however, it was announced that the EU's antitrust regulators had opened an extensive investigation into Zimmer's bid for Biomet due to concern that it would substantially lessen competition in certain markets. In March 2016, European Commission (“EC”) conditionally cleared Zimmer's proposed acquisition of Biomet, Inc. and on June 24, 2015, Zimmer completed its acquisition of Biomet forming Zimmer Biomet Holdings.\nIn October 2014, the company announced it would acquire ETEX Holdings, Inc.\nIn March 2016, Zimmer Biomet announced it would acquire Ortho Transmission, LLC. The company also announced it would acquire sports medicine company, Cayenne Medical, Inc. Later in the same year the company acquired medical device manufacturer, LDR Holding Corporation for $37 per share ($1 billion in total), merging it into their Spine division. In July, the company acquired French surgical robotics company Medtech. In August, the company announced it was acquiring Delaware-based CD Diagnostics, a diagnostics company developing immunoassays and biomarker testing. In September, Zimmer announced the acquisition of Clinical Graphics, B.V.\nThe Justin Zimmer House in Warsaw is listed on the National Register of Historic Places.\nIn January 2023, the company announced its intention to acquire Embody, Inc. for $155 million (plus a potential $120 million in milestones).\nIn August 2024, Zimmer Biomet  announced plans to acquire OrthoGrid Systems, an AI surgical guidance company, in order to expand its market share in hip replacement procedures.\n\nProducts\nZimmer designs, develops, manufactures and markets orthopedics products, including knee, hip, shoulder, elbow, foot and ankle artificial joints and dental prostheses. In 2024, Zimmer introduced the ROSA Shoulder, said to be the world's first robotic surgery system for shoulder replacement, and the fourth application for the company's ROSA Robotics portfolio, which includes the ROSA Knee System for total knee arthroplasty and ROSA Hip System for total hip replacement. Zimmer has operations in more than 40 countries around the world (US, Australia, Austria, Belgium, Canada, China, Czech Republic, Finland, France, Germany, India, Ireland, Israel, Italy, Japan, Latin America, Netherlands, Brasil, Poland, Portugal, Russia, South Africa, Spain etc.) and sells products in more than 100 countries.\n\nAcquisition history\nThe following is an illustration of the company's major mergers, acquisitions and historical predecessors:\n\nCompany data\nZimmer's 2023 sales were approximately $7.4 billion. The company has approximately 18,000 employees worldwide.\n\nLeadership\nRaymond Elliott was president and CEO from August 2001 to May 2007.\nDavid C. Dvorak, was president and CEO from May 1, 2007, to July 11, 2017.\nDan Florin, Interim President and CEO from July 11, 2017, to December 19, 2017.\nBryan C. Hanson, President and CEO from December 19, 2017 to August 22, 2023.\nIvan Tornos, President and CEO from August 22, 2023, to present.\n\nRecognition\nIn 2016, the company was recognized on the Fortune 500 list for the first time, ranking in position #431. Since then, it has been on the list for three straight years. As of 2018, the company is ranked 361st on the list.\n\nCriticism\nDuring the 2022 Russian invasion of Ukraine, Zimmer Biomet continued to sell to the Russian market. Research from Yale University updated on April 28, 2022, identifying how companies were reacting to Russia's invasion identified Zimmer Biomet as continuing business-as-usual in Russia: companies defying demands for exit/reduction of activities.\n\nPublic-private engagement\nActivism\nZimmer Biomet is a corporate partner of Human Rights Campaign, a large LGBT advocacy organization.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Zimmer Biomet:",
  "clean_text": "Zimmer Biomet Holdings, Inc. is a publicly traded American medical device company. It was founded in 1927 to produce aluminum splints. The firm is headquartered in Warsaw, Indiana, where it is part of the medical devices business cluster. In 2001, Zimmer was spun off from Bristol Myers Squibb and began trading on the New York Stock Exchange, on August 7, under the ticker symbol “ZMH”. In November 2011, the company acquired ExtraOrtho, Inc. (ExtraOrtho). In January 2012, the company acquired Reno, Nevada-based Synvasive Technology, Inc. On June 29, 2015, the company changed the ticker symbol to \"ZBH\" to reflect its acquisition of Biomet. On January 12, 2017, Zimmer Biomet announced a resolution with the DOJ and the SEC in which it agreed to pay a fine of approximately $30.5 million, an amount which would not affect its 2017 outlook. History Zimmer Biomet was established in 1927 by Justin O. Zimmer (1884–1951) in Warsaw, Indiana. On April 24, 2014, it was announced that Zimmer had agreed to purchase Biomet Inc. for $13.4 billion. In October 2014, however, it was announced that the EU's antitrust regulators had opened an extensive investigation into Zimmer's bid for Biomet due to concern that it would substantially lessen competition in certain markets. In March 2016, European Commission (“EC”) conditionally cleared Zimmer's proposed acquisition of Biomet, Inc. and on June 24, 2015, Zimmer completed its acquisition of Biomet forming Zimmer Biomet Holdings. In October 2014, the company announced it would acquire ETEX Holdings, Inc. In March 2016, Zimmer Biomet announced it would acquire Ortho Transmission, LLC. The company also announced it would acquire sports medicine company, Cayenne Medical, Inc. Later in the same year the company acquired medical device manufacturer, LDR Holding Corporation for $37 per share ($1 billion in total), merging it into their Spine division. In July, the company acquired French surgical robotics company Medtech. In August, the company announced it was acquiring Delaware-based CD Diagnostics, a diagnostics company developing immunoassays and biomarker testing. In September, Zimmer announced the acquisition of Clinical Graphics, B.V. The Justin Zimmer House in Warsaw is listed on the National Register of Historic Places. In January 2023, the company announced its intention to acquire Embody, Inc. for $155 million (plus a potential $120 million in milestones). In August 2024, Zimmer Biomet announced plans to acquire OrthoGrid Systems, an AI surgical guidance company, in order to expand its market share in hip replacement procedures. Products Zimmer designs, develops, manufactures and markets orthopedics products, including knee, hip, shoulder, elbow, foot and ankle artificial joints and dental prostheses. In 2024, Zimmer introduced the ROSA Shoulder, said to be the world's first robotic surgery system for shoulder replacement, and the fourth application for the company's ROSA Robotics portfolio, which includes the ROSA Knee System for total knee arthroplasty and ROSA Hip System for total hip replacement. Zimmer has operations in more than 40 countries around the world (US, Australia, Austria, Belgium, Canada, China, Czech Republic, Finland, France, Germany, India, Ireland, Israel, Italy, Japan, Latin America, Netherlands, Brasil, Poland, Portugal, Russia, South Africa, Spain etc.) and sells products in more than 100 countries. Acquisition history The following is an illustration of the company's major mergers, acquisitions and historical predecessors: Company data Zimmer's 2023 sales were approximately $7.4 billion. The company has approximately 18,000 employees worldwide. Leadership Raymond Elliott was president and CEO from August 2001 to May 2007. David C. Dvorak, was president and CEO from May 1, 2007, to July 11, 2017. Dan Florin, Interim President and CEO from July 11, 2017, to December 19, 2017. Bryan C. Hanson, President and CEO from December 19, 2017 to August 22, 2023. Ivan Tornos, President and CEO from August 22, 2023, to present. Recognition In 2016, the company was recognized on the Fortune 500 list for the first time, ranking in position #431. Since then, it has been on the list for three straight years. As of 2018, the company is ranked 361st on the list. Criticism During the 2022 Russian invasion of Ukraine, Zimmer Biomet continued to sell to the Russian market. Research from Yale University updated on April 28, 2022, identifying how companies were reacting to Russia's invasion identified Zimmer Biomet as continuing business-as-usual in Russia: companies defying demands for exit/reduction of activities. Public-private engagement Activism Zimmer Biomet is a corporate partner of Human Rights Campaign, a large LGBT advocacy organization."
}