{
  "ticker": "ZBRA",
  "cik": "0000877212",
  "company_name": "Zebra Technologies",
  "corrected_name": "Zebra Technologies",
  "wiki_title_used": "Zebra Technologies",
  "exists": true,
  "raw_text": "Zebra Technologies Corporation is an American multinational technology company, specializing in smart data capture systems. The company manufactures and sells marking, tracking, and computer printing technologies. Its products include mobile computers and tablets, software, thermal barcode label and receipt printers, RFID smart label printers/encoders/fixed & handheld readers/antennas, autonomous mobile robots (AMRs) & machine vision (MV), and fixed industrial scanning hardware & software.\n\nHistory\nZebra was incorporated in 1969 as Data Specialties Incorporated, a manufacturer of high-speed electromechanical products. The company changed its focus to specialty on-demand labeling and ticketing systems in 1982 and became Zebra Technologies Corporation in 1986. Zebra became a publicly traded company in 1991.\nIn 1986, Zebra (then Data Specialties Incorporated) acquired Qwint Systems (formerly Martin Research), an early microcomputer pioneer which had restructured as a teletypewriter manufacturer at the beginning of the 1980s.\nIn 1998, Zebra Technologies merged with Eltron International, Inc. In 2000, Comtec Information Systems was acquired by Zebra Technologies, followed in 2003 by the acquisition of Atlantek, Inc., which was a manufacturer of photo ID printers.\nIn 2004, the company expanded into RFID smart label manufacturing. In the following years, Zebra also acquired Swecoin, WhereNet Corp, Proveo AG, and Navis Holdings (later divested in 2011).\nThe company bought the Enterprise Solutions Group (ESG) in 2008 and renamed the group Zebra Enterprise Solutions in 2009. In the same year, Multispectral Solutions, Inc. was acquired. In 2012, the companies LaserBand, and StepOne Systems were purchased with a cash price of $1.5 million.\nIn 2013, the company acquired Hart Systems for $94 million in cash from the private equity firm Topspin Partners LBO.\nIn 2014, Zebra acquired Motorola Solutions' Enterprise Division in a $3.45 billion transaction, providing mobile computing and advanced data capture communications technologies and services. Zebra's acquisition of the Enterprise Division included the Symbol Technologies and Psion product lines. Also in 2014, Zebra provided its real-time location system (RTLS) in NFL stadiums to track players and officials and provide location-based data for the NFL's Next Gen Stats program. Zebra’s partnership with the NFL extends through the 2025 football season.\nIn 2018, the company acquired Xplore Technologies, a maker of ruggedized tablets and other hard-wearing hardware.\nIn 2019, Zebra acquired Temptime Corporation, a provider of temperature monitoring devices to the healthcare industry. That same year, Zebra also acquired Profitect, a retail software company that developed a product line used for tracking and identifying inventory losses.\nIn 2020, Zebra acquired Reflexis Systems, a provider of workforce scheduling and task management software to the retail, food service, hospitality, and banking industries for $575 Million.\nIn 2021, Zebra acquired Adaptive Vision (provider of graphical Machine Vision software), Fetch Robotics (manufacturer of autonomous mobile robots) and Antuit.ai (provider of AI-powered SaaS solutions specific to forecasting and merchandising for the retail and CPG industries).\nIn 2022, Zebra acquired Matrox Imaging, a developer of machine vision components and systems.\nIn December 2023, Zebra partnered with Verizon Business to create a software package that will allow for a faster private 5G network. Zebra tablets and computers will work on Verizon's private network, allowing for more network capacity and fast communication.\nIn 2023, Zebra unveiled Zebra Workcloud - its purpose-built suite of enterprise software applications, primarily serving in retail, banking and healthcare industries. Zebra also introduced the WS50 powered by Workcloud, the first wearable Android touch computer.\n\nLocations\nZebra Technologies has more than 128 offices in 55 countries, including Australia, Poland, Czech Republic, Brazil, Canada, China, France, Germany, India, Japan, Mexico, Russia, the United Arab Emirates, and the United Kingdom. The company also has over 10,000+ partners across 180 countries. In the 2021 annual report, Zebra stated that it traded in 180 countries, with approximately 128 facilities and 9,800 employees.\n\nReception\nNewsweek included Zebra on its 2023 America’s Greatest Workplaces for Diversity list.\n\nReferences\nExternal links\nBusiness data for Zebra Technologies Corporation:",
  "clean_text": "Zebra Technologies Corporation is an American multinational technology company, specializing in smart data capture systems. The company manufactures and sells marking, tracking, and computer printing technologies. Its products include mobile computers and tablets, software, thermal barcode label and receipt printers, RFID smart label printers/encoders/fixed & handheld readers/antennas, autonomous mobile robots (AMRs) & machine vision (MV), and fixed industrial scanning hardware & software. History Zebra was incorporated in 1969 as Data Specialties Incorporated, a manufacturer of high-speed electromechanical products. The company changed its focus to specialty on-demand labeling and ticketing systems in 1982 and became Zebra Technologies Corporation in 1986. Zebra became a publicly traded company in 1991. In 1986, Zebra (then Data Specialties Incorporated) acquired Qwint Systems (formerly Martin Research), an early microcomputer pioneer which had restructured as a teletypewriter manufacturer at the beginning of the 1980s. In 1998, Zebra Technologies merged with Eltron International, Inc. In 2000, Comtec Information Systems was acquired by Zebra Technologies, followed in 2003 by the acquisition of Atlantek, Inc., which was a manufacturer of photo ID printers. In 2004, the company expanded into RFID smart label manufacturing. In the following years, Zebra also acquired Swecoin, WhereNet Corp, Proveo AG, and Navis Holdings (later divested in 2011). The company bought the Enterprise Solutions Group (ESG) in 2008 and renamed the group Zebra Enterprise Solutions in 2009. In the same year, Multispectral Solutions, Inc. was acquired. In 2012, the companies LaserBand, and StepOne Systems were purchased with a cash price of $1.5 million. In 2013, the company acquired Hart Systems for $94 million in cash from the private equity firm Topspin Partners LBO. In 2014, Zebra acquired Motorola Solutions' Enterprise Division in a $3.45 billion transaction, providing mobile computing and advanced data capture communications technologies and services. Zebra's acquisition of the Enterprise Division included the Symbol Technologies and Psion product lines. Also in 2014, Zebra provided its real-time location system (RTLS) in NFL stadiums to track players and officials and provide location-based data for the NFL's Next Gen Stats program. Zebra’s partnership with the NFL extends through the 2025 football season. In 2018, the company acquired Xplore Technologies, a maker of ruggedized tablets and other hard-wearing hardware. In 2019, Zebra acquired Temptime Corporation, a provider of temperature monitoring devices to the healthcare industry. That same year, Zebra also acquired Profitect, a retail software company that developed a product line used for tracking and identifying inventory losses. In 2020, Zebra acquired Reflexis Systems, a provider of workforce scheduling and task management software to the retail, food service, hospitality, and banking industries for $575 Million. In 2021, Zebra acquired Adaptive Vision (provider of graphical Machine Vision software), Fetch Robotics (manufacturer of autonomous mobile robots) and Antuit.ai (provider of AI-powered SaaS solutions specific to forecasting and merchandising for the retail and CPG industries). In 2022, Zebra acquired Matrox Imaging, a developer of machine vision components and systems. In December 2023, Zebra partnered with Verizon Business to create a software package that will allow for a faster private 5G network. Zebra tablets and computers will work on Verizon's private network, allowing for more network capacity and fast communication. In 2023, Zebra unveiled Zebra Workcloud - its purpose-built suite of enterprise software applications, primarily serving in retail, banking and healthcare industries. Zebra also introduced the WS50 powered by Workcloud, the first wearable Android touch computer. Locations Zebra Technologies has more than 128 offices in 55 countries, including Australia, Poland, Czech Republic, Brazil, Canada, China, France, Germany, India, Japan, Mexico, Russia, the United Arab Emirates, and the United Kingdom. The company also has over 10,000+ partners across 180 countries. In the 2021 annual report, Zebra stated that it traded in 180 countries, with approximately 128 facilities and 9,800 employees. Reception Newsweek included Zebra on its 2023 America’s Greatest Workplaces for Diversity list."
}