{
  "ticker": "ZTS",
  "cik": "0001555280",
  "company_name": "Zoetis",
  "corrected_name": "Zoetis",
  "wiki_title_used": "Zoetis",
  "exists": true,
  "raw_text": "Zoetis Inc. (/zō-EH-tis/) is an American drug company, the world's largest producer of medicine and vaccinations for pets and livestock. The company was a subsidiary of Pfizer, the world's largest drug maker, but with Pfizer's spinoff of its 83% interest in the firm it is now a completely independent company. The company directly markets its products in approximately 45 countries, and sells them in more than 100 countries. Operations outside the United States accounted for 50% of the total revenue. Contemporaneous with the spinoff in June 2013 S&P Dow Jones Indices announced that Zoetis would replace First Horizon National Corporation in the S&P 500 stock market index.\n\nHistory\n1950s to 2000s\nIn the 1950s, Pfizer began research on several drugs, including oxytetracycline, which was found to be effective in livestock. In 1952, the Pfizer Agriculture Division opened a 732-acre research and development facility in Terre Haute, Indiana, called Vigo. By 1988 the division was renamed Pfizer Animal Health.\nThe 1995 acquisition of Norden Laboratories from GlaxoSmithKline expanded Pfizer's animal health division into small animal care, including domestic pets. Secondary research and development centres were opened in Kalamazoo, Michigan, in 2003. In the same year, Pfizer acquired Pharmacia Corporation for US$60 billion in stock options. Between 2007 and 2011, the company acquired Embrex Inc, Catapult Genetics, Bovigen, Wyeth, Fort Dodge Animal Health, Vetnex Animal Health Ltd, Synbiotics Corporation, Microtek, King Pharmaceuticals, and Alpharma.\n\n2010s to present\nPlans to break away Pfizer Animal Health into a separate company were officially announced in 2012. The new firm was named Zoetis in allusion to the Greek-derived  zoological term zoetic, meaning \"pertaining to life\".\nZoetis Inc.'s revenues exceeded $4.2 billion in 2011 and $4.34 billion in 2012. The animal health industry worldwide is an estimated US$22 billion industry.\nOn May 22, 2013, The Wall Street Journal reported that Pfizer planned to sell its majority stake in the company. According to the report, shareholders would have the option to swap their Pfizer shares for Zoetis shares. The sell-off of Zoetis was consistent with Pfizer's recent decision to shed other non-pharmaceutical subsidiaries in an effort to save costs, raise capital, and pay off debt. The company announced that JPMorgan Chase, Bank of America, Merrill Lynch, Goldman Sachs & Co., and Morgan Stanley would be the lead underwriters.\nIn November 2014, activist investor Bill Ackman disclosed that Pershing Square Capital Management had taken an 8.5% stake in the company, amassing approximately 41.8 million shares, causing the share price to hit its highest price since the IPO. On  17 November, the company announced it would acquire a portfolio of pet drugs from Abbott Laboratories for approximately $255 million.\nAugust 2025, Soros Capital Management bought shares in the company.\n\n2012: IPO\nRecords show that Pfizer officially filed for registration of a Class A stock with the U.S. Securities and Exchange Commission on August 10, 2012. Zoetis' IPO on February 1, 2013 sold 86.1 million shares for US$ 2.2 billion. Shares sharply rose 19% by the end of the trading day to $35.01 a share, up from $26. At the time, it was the largest IPO from a U.S. company since Facebook's $16 billion IPO on May 18, 2012. Pfizer retained 414 million Class B shares giving it an 83% controlling stake in the firm. Stock investors were attracted to the steep profit margin in proportion to revenue and consumer confidence in potential future growth of the subsidiary. The offering's lead underwriters were JPMorgan Chase, Bank of America Merrill Lynch and Morgan Stanley. Most of the money raised through the IPO was used to pay off existing Pfizer debt.\n\nAcquisitions\nIn November 2015, the company announced it would acquire a developer of aquaculture treatments and diseases, Pharmaq, for $765 million. In 2017, Zoetis acquired Ireland-based Nexvet, a company with a biologics focused technology and product candidate pipeline. In the same year, the company also acquired KL Automation, a robotics company.\nIn May 2018, the company announced its intention to acquire Abaxis for $1.9 billion in cash.\nIn August 2021, Zoetis announced it would buy Jurox, increasing the business' presence in New Zealand, the US, Canada and the UK.\nIn June 2022, Zoetis acquired Basepaws, a privately held genetics company. \nIn September 2023, Zoetis acquired Petmedix, a privately held Cambridge, UK-based company, to bring the benefits of species-specific antibody therapies to pet owners.\n\nProducts\nTwenty-eight sites in 11 countries make up Zoetis' manufacturing network, each facility designed to meet chemical and infectious agent safety regulatory requirements. Many R&D operations are co-located with manufacturing sites, a collaboration that allows bringing new products to market faster. Zoetis builds on six-decade Pfizer history and aims for high-tech innovative manufacturing technologies. \nZoetis products include:\n\n2025 Bird Flu outbreak in the U.S.\nThe U.S. Department of Agriculture has granted Zoetis conditional approval to deploy its bird flu vaccine in poultry. Since April 2024, nearly 70 people in the U.S. have contracted bird flu, resulting in one death, with most cases occurring among farm workers exposed to infected poultry or cattle. Wyoming health officials recently confirmed the state’s first human case of H5N1, marking the third hospitalization in the country linked to the virus. A conditional license is issued in emergencies or special circumstances for a limited duration. Last month, the USDA announced plans to replenish its bird flu vaccine stockpile for poultry, aligning with the strain currently affecting commercial and wild bird populations, similar to efforts following major outbreaks in 2014 and 2015.\n\nReferences\nExternal links\nOfficial website\nBusiness data for Zoetis:",
  "clean_text": "Zoetis Inc. (/zō-EH-tis/) is an American drug company, the world's largest producer of medicine and vaccinations for pets and livestock. The company was a subsidiary of Pfizer, the world's largest drug maker, but with Pfizer's spinoff of its 83% interest in the firm it is now a completely independent company. The company directly markets its products in approximately 45 countries, and sells them in more than 100 countries. Operations outside the United States accounted for 50% of the total revenue. Contemporaneous with the spinoff in June 2013 S&P Dow Jones Indices announced that Zoetis would replace First Horizon National Corporation in the S&P 500 stock market index. History 1950s to 2000s In the 1950s, Pfizer began research on several drugs, including oxytetracycline, which was found to be effective in livestock. In 1952, the Pfizer Agriculture Division opened a 732-acre research and development facility in Terre Haute, Indiana, called Vigo. By 1988 the division was renamed Pfizer Animal Health. The 1995 acquisition of Norden Laboratories from GlaxoSmithKline expanded Pfizer's animal health division into small animal care, including domestic pets. Secondary research and development centres were opened in Kalamazoo, Michigan, in 2003. In the same year, Pfizer acquired Pharmacia Corporation for US$60 billion in stock options. Between 2007 and 2011, the company acquired Embrex Inc, Catapult Genetics, Bovigen, Wyeth, Fort Dodge Animal Health, Vetnex Animal Health Ltd, Synbiotics Corporation, Microtek, King Pharmaceuticals, and Alpharma. 2010s to present Plans to break away Pfizer Animal Health into a separate company were officially announced in 2012. The new firm was named Zoetis in allusion to the Greek-derived zoological term zoetic, meaning \"pertaining to life\". Zoetis Inc.'s revenues exceeded $4.2 billion in 2011 and $4.34 billion in 2012. The animal health industry worldwide is an estimated US$22 billion industry. On May 22, 2013, The Wall Street Journal reported that Pfizer planned to sell its majority stake in the company. According to the report, shareholders would have the option to swap their Pfizer shares for Zoetis shares. The sell-off of Zoetis was consistent with Pfizer's recent decision to shed other non-pharmaceutical subsidiaries in an effort to save costs, raise capital, and pay off debt. The company announced that JPMorgan Chase, Bank of America, Merrill Lynch, Goldman Sachs & Co., and Morgan Stanley would be the lead underwriters. In November 2014, activist investor Bill Ackman disclosed that Pershing Square Capital Management had taken an 8.5% stake in the company, amassing approximately 41.8 million shares, causing the share price to hit its highest price since the IPO. On 17 November, the company announced it would acquire a portfolio of pet drugs from Abbott Laboratories for approximately $255 million. August 2025, Soros Capital Management bought shares in the company. 2012: IPO Records show that Pfizer officially filed for registration of a Class A stock with the U.S. Securities and Exchange Commission on August 10, 2012. Zoetis' IPO on February 1, 2013 sold 86.1 million shares for US$ 2.2 billion. Shares sharply rose 19% by the end of the trading day to $35.01 a share, up from $26. At the time, it was the largest IPO from a U.S. company since Facebook's $16 billion IPO on May 18, 2012. Pfizer retained 414 million Class B shares giving it an 83% controlling stake in the firm. Stock investors were attracted to the steep profit margin in proportion to revenue and consumer confidence in potential future growth of the subsidiary. The offering's lead underwriters were JPMorgan Chase, Bank of America Merrill Lynch and Morgan Stanley. Most of the money raised through the IPO was used to pay off existing Pfizer debt. Acquisitions In November 2015, the company announced it would acquire a developer of aquaculture treatments and diseases, Pharmaq, for $765 million. In 2017, Zoetis acquired Ireland-based Nexvet, a company with a biologics focused technology and product candidate pipeline. In the same year, the company also acquired KL Automation, a robotics company. In May 2018, the company announced its intention to acquire Abaxis for $1.9 billion in cash. In August 2021, Zoetis announced it would buy Jurox, increasing the business' presence in New Zealand, the US, Canada and the UK. In June 2022, Zoetis acquired Basepaws, a privately held genetics company. In September 2023, Zoetis acquired Petmedix, a privately held Cambridge, UK-based company, to bring the benefits of species-specific antibody therapies to pet owners. Products Twenty-eight sites in 11 countries make up Zoetis' manufacturing network, each facility designed to meet chemical and infectious agent safety regulatory requirements. Many R&D operations are co-located with manufacturing sites, a collaboration that allows bringing new products to market faster. Zoetis builds on six-decade Pfizer history and aims for high-tech innovative manufacturing technologies. Zoetis products include: 2025 Bird Flu outbreak in the U.S. The U.S. Department of Agriculture has granted Zoetis conditional approval to deploy its bird flu vaccine in poultry. Since April 2024, nearly 70 people in the U.S. have contracted bird flu, resulting in one death, with most cases occurring among farm workers exposed to infected poultry or cattle. Wyoming health officials recently confirmed the state’s first human case of H5N1, marking the third hospitalization in the country linked to the virus. A conditional license is issued in emergencies or special circumstances for a limited duration. Last month, the USDA announced plans to replenish its bird flu vaccine stockpile for poultry, aligning with the strain currently affecting commercial and wild bird populations, similar to efforts following major outbreaks in 2014 and 2015."
}