{
  "ticker": "ADI",
  "cik": "0000006281",
  "company_name": "ANALOG DEVICES INC",
  "filing_date": "2025-11-25",
  "accession": "0000006281-25-000153",
  "primary_doc": "adi-20251101.htm",
  "item_sections": {
    "item1": "ITEM 1.    BUSINESS\nCompany Overview, Strategy and Mission\nAnalog Devices, Inc. (we, Analog Devices or the Company) is a global semiconductor leader dedicated to solving our customers’ most complex engineering challenges. We deliver innovations that connect technology to human breakthroughs and play a critical role at the intersection of the physical and digital worlds by providing the building blocks to sense, measure, interpret, connect and power. We design, manufacture, test and market a broad portfolio of solutions, including integrated circuits (ICs), software and subsystems that leverage high-performance analog, mixed-signal and digital signal processing technologies. Our comprehensive product portfolio, deep domain expertise and advanced manufacturing capabilities extend across high-performance precision and high-speed mixed-signal, power management and processing technologies – including data converters, amplifiers, power management, radio frequency (RF) ICs, edge processors and other sensors.  \nThe Intelligent Edge is characterized by ubiquitous sensing, hyper-scale and edge computing, artificial intelligence (AI) and pervasive connectivity. These technological trends drive new generations of applications that expand the demand for Analog Devices’ high-performance analog, mixed-signal, power and RF ICs. We have positioned our business to capitalize on these long-term growth opportunities and to deliver innovative solutions across industries. Central to our strategy is our focus on solving challenges that our customers face across the most impactful application areas. This strategy is built around the following key priorities, which we believe will continue to drive our long-term success: \n•\nEfficient use of capital.\n Research and development (R&D) is critical to continuing our cycle of innovation, driven by a diverse array of engineering talent who “engineer good” for our planet and society. We are committed to realizing targeted shareholder value creation from acquisitions to complement our R&D and drive long-term value creation. Through the development of cutting-edge innovations and our ability to solve difficult problems across a broad array of applications, we generate significant cash flow and are committed to delivering strong shareholder returns.\n•\nDeepening customer-centricity.\n Close customer relationships influence all aspects of our business: from our broad range of product portfolios and application expertise to manufacturing capabilities in high-performance power management and precision and high-speed signal processing technologies. We believe that our engineering talent continues to be an important competitive differentiator in the semiconductor space that will enable us to deepen our relationships with customers. We strive to be the destination for the world’s best engineering talent, with a team of approximately 13,000 engineers. Together, our products and our engineering talent enable us to partner with our customers, leveraging our analog domain expertise and the full breadth of our technology capabilities to develop complete and innovative solutions.\n•\nCapitalizing on secular trends. \nWe are positioned to capitalize on critical long-term growth trends to drive advancements in digitized factories, mobility and digital healthcare, combat climate change and reliably connect humans and the world. We are well aligned with the key B2B markets driving the increase in data at the Intelligent Edge and will continue to be a critical partner in the collection, creation and communication of our customers’ edge data. In addition, we incorporate AI capabilities across our technologies, business operations, products and services to enhance performance and drive smarter, more efficient solutions.\nWe were incorporated in Massachusetts in 1965\n \nwith our corporate headquarters near Boston in Wilmington, Massachusetts. We have manufacturing facilities primarily in the United States, Ireland and Southeast Asia. Our common stock is listed on the Nasdaq Global Select Market under the symbol ADI and is included in the Standard & Poor’s 500 Index. Our fiscal year is the 52-week or 53-week period ending on the Saturday closest to the last day in October; November 1, 2025 (fiscal 2025) was a 52-week fiscal period, while the fiscal year ended November 2, 2024 (fiscal 2024) was a 53-week fiscal period and the fiscal year ended October 28, 2023 (fiscal 2023) was a 52-week fiscal period. The additional week in fiscal 2024 was included in the first quarter ended February 3, 2024. Therefore, fiscal 2025 and fiscal 2023 include one less week of operations as compared to fiscal 2024.\n2\nAvailable Information\nWe maintain a website with the address www.analog.com. We make available free of charge through our website our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K (including exhibits), and amendments to these reports, as soon as reasonably practicable after we electronically file such material with, or furnish such material to, the Securities and Exchange Commission (SEC). We also make available on our website our by-laws, corporate governance guidelines, the charters for the committees of our Board of Directors, our code of business conduct and ethics, which applies to our directors, officers and employees, and other governance documents. Such information is available in print and free of charge to any shareholder of Analog Devices who requests it. In addition, we intend to disclose on our website any amendments to, or waivers from, our code of business conduct and ethics that are required to be publicly disclosed pursuant to rules of the SEC or Nasdaq.\nWe have included our website address in this Annual Report on Form 10-K as an inactive textual reference. We are not including the information contained on our website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K. \nProducts\nSemiconductor components are the building blocks used in electronic systems and equipment. These components are classified as either discrete devices, such as individual transistors, or as ICs, in which a number of transistors and other elements are combined to form a more complicated electronic circuit. \nOur ICs are designed to address a wide range of real-world signal processing applications. We sell our ICs to customers worldwide, many of whom use products spanning our core technologies in a wide range of applications. Our IC product portfolio includes both general-purpose products used by a broad range of customers and applications, as well as application-specific products designed for specific target markets. By using readily available, high-performance, general-purpose products in their systems, our customers can reduce the time they need to bring new products to market. Given the high cost of developing more customized ICs, our standard products often provide a cost-effective solution for many low to medium volume applications. Our analog ICs monitor, condition, amplify or transform continuous analog signals associated with physical properties, such as temperature, pressure, weight, light, sound or motion, and play an important role in bridging real world phenomena to a variety of electronic systems. Our analog ICs also provide voltage regulation and power control to electronic systems.\nWe also work with customers to design application-specific solutions. We begin with our existing core technologies, which leverage our analog and mixed signal, power management, RF and microwave, edge processors and other sensors, and devise solutions that more closely meet the needs of a specific customer or group of customers. In certain cases, because we have already developed the core technology platform for our general-purpose products, we can create application-specific solutions quickly and efficiently.\nOur analog and mixed-signal IC technology have been the foundation of our business for six decades, and we are one of the world’s largest suppliers of high-performance analog ICs. Our analog signal processing ICs are primarily high-performance devices, offering higher dynamic range, greater bandwidth and other enhanced features. We believe that the principal advantages these products have as compared to competitors’ products include higher accuracy, higher speed, smaller size, lower power consumption and fewer components, resulting in improved performance and reliability. Our product portfolio includes several thousand analog ICs, many of which can have several hundred end customers. Our analog ICs typically have long product life cycles. Our customers include original equipment manufacturers (OEMs) and customers who build electronic subsystems for integration into larger systems.\nWe continue to expand our capabilities in software, digital platforms and AI to support the evolving needs of our customers and markets. These efforts are intended to enhance system-level performance, improve design efficiency, reduce complexity and help customers accelerate time to market for their products and solutions.  Our strategic goal is to bridge the domains of analog and mixed-signal, digital and embedded and AI and software technologies to enable intelligent systems that can sense, process and respond to real-world conditions. This integrated approach supports the development of differentiated solutions across industrial, automotive, communications, consumer and healthcare applications.\nOur product offerings include more than 75,000 stock keeping units (SKUs) that can be aggregated into the following general categories:\n•\nAnalog and Mixed Signal\n—We are a leading supplier of data converter products. Data converters translate real-world analog signals into digital data and also translate digital data into analog signals. Data converters remain our largest and most diverse product family and an area where we are continuously innovating to enable our customers to redefine and differentiate their products. Our converter products combine sampling rates and accuracy with the low noise, power, price and small package size required by industrial, automotive, consumer and communications electronics.\n3\n•\nPower Management & Reference\n—Power management and reference products, which include functions such as power conversion, driver monitoring, sequencing and energy management, provide efficient solutions for power management and conversion applications in the automotive, communications, industrial and high-end consumer markets. Our high-performance power ICs include powerful performance, integration and software design simulation tools to provide fast and accurate power supply designs.\n•\nAmplifiers/RF and Microwave\n—We are also a leading supplier of high-performance amplifiers which are used to condition analog signals. High performance amplifiers emphasize the performance dimensions of speed and precision. Within this product portfolio we provide precision, instrumentation, high-speed, intermediate frequency/RF/microwave, broadband and other amplifiers. Our analog product line also includes a broad portfolio of high-performance RF and microwave ICs covering the entire RF signal chain. Our high-performance RF and microwave ICs support the high-performance requirements of cellular infrastructure and a broad range of applications in our target markets, including instrumentation, aerospace and automotive.\n•\nSensors & Actuators\n—Our analog technology portfolio is comprised of sensor and actuator products, including products based on micro-electro-mechanical systems (MEMS) technology. MEMS technology enables us to build extremely small sensors that incorporate an electromechanical structure and the supporting analog circuitry for conditioning signals obtained from the sensing element. Our MEMS product portfolio includes accelerometers used to sense acceleration, gyroscopes used to sense rotation, inertial measurement units used to sense multiple degrees of freedom combining multiple sensing types along multiple axes, and broadband switches suitable for radio and instrument systems. We offer other high-performance sensors, from temperature to magnetic fields, that are deployed in a variety of systems. In addition to sensor products, our other analog product category includes isolators that enable designers to implement isolation in designs without the cost, size, power, performance and reliability constraints found with optocouplers.\n•\nDigital Signal Processing and System Products\n \n(DSPs)\n—DSPs are optimized for high-speed numeric calculations, which are essential for instantaneous, or real-time, processing of digital data generated, in most cases, from analog to digital signal conversion. Our DSPs are designed to be fully programmable and to efficiently execute specialized software programs, or algorithms, associated with processing digitized real-time, real-world data. Programmable DSPs are designed to provide the flexibility to modify the device’s function quickly and inexpensively using software. Our general-purpose DSP IC customers typically write their own algorithms using software development tools provided by us and third-party suppliers. Our DSPs are designed in families of products that share common architectures and therefore can execute the same software across a range of products.\n•\nInterface\n—Includes general purpose analog ICs whose primary function is to modify or shape the signal in order to ensure signal integrity for transmission over a distance through a physical medium such as a wire, cable, waveguide or tracks within a printed circuit board. These include devices that shape the signal for transmission over the medium or reconstruct the received signal after transmission to recover the intended signal integrity. \n•\nSoftware, Digital Platforms and Artificial Intelligence\n—As part of our evolution from a component supplier to a full-system and solutions provider, we recently introduced an upgrade to our open-source embedded development platform, CodeFusion Studio 2.0, designed to support embedded system design through integrated workflows for signal processing, edge computing and connectivity. CodeFusion Studio 2.0 facilitates prototyping and deployment of applications on ADI platforms and is intended to reduce development time and improve system integration. In fiscal 2025, we also launched Power Studio, a digital simulation and design ecosystem integrating new system-level and IC-level design capabilities into a single product family. Together, the Power Studio family of products is designed to enable faster time to market by streamlining power management design and optimization. These platforms are part of our broader Physical Intelligence vision, which seeks to leverage our deep expertise in electro-physical systems to develop and fine-tune foundational AI models that can reason about and interact with the real world. This initiative integrates signal, power, sensing, time-series sampling, actuation and more to support autonomous operation and enhanced system responsiveness. These software and AI-driven capabilities complement our existing product portfolio and support our strategy to deliver differentiated solutions that address complex customer requirements.\nSales Channel\nWe sell our products globally through a direct sales force, third-party distributors, independent sales representatives and via our website. We have direct sales offices, sales representatives and/or distributors in approximately 50 countries. We support our worldwide sales efforts through our website and with extensive promotional programs that include editorial coverage and paid advertising in online and printed trade publications, webinars, social media and communities, promotional and training videos, direct mail programs, technical seminars and participation in trade shows. We publish, share and distribute technical content such as data sheets, application guides and catalogs. We maintain a staff of field application engineers who aid \n4\ncustomers in incorporating our products into their products. In addition, we offer a variety of web-based tools that ease product selection and aid in the design process for our customers.\nWe believe distributors provide a cost-effective means of reaching a broad range of customers while providing efficient logistics services. From time to time, we may add or terminate distributors in specific geographies, or move customers to a direct support or fulfillment model as we deem appropriate given our strategies, the level of distributor business activity and distributor performance and financial condition.\nThese distributors typically maintain an inventory of our products. Some of them also sell products that compete with our products, including those for which we are an alternate source. We make sales to distributors under agreements that allow certain distributors to receive price adjustment credits and to return qualifying products for credit, typically as determined by us, in order to reduce the amounts of slow-moving, discontinued or obsolete product from their inventory. These agreements limit such returns to a certain percentage of our shipments to that distributor during the prior quarter. In addition, certain distributors are allowed to return unsold products if we terminate the relationship with the distributor. Additional information relating to our revenue and customer concentration is set forth in Note 2l, \nConcentrations of Risk\n; Note 2n, \nRevenue Recognition\n; and Note 4, \nIndustry, Segment and Geographic Information\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K.  \nWe typically do not have long-term sales contracts with our customers. In some of our markets where end-user demand may be particularly volatile and difficult to predict, some customers place orders that require us to manufacture product and have it available for shipment, even though the customer is unwilling to make a binding commitment to purchase all, or even any, of the product. In other instances, we manufacture product based on forecasts of customer demand. As a result, we may incur inventory and manufacturing costs in advance of anticipated sales and are subject to the risk of cancellation of orders leading to a sharp reduction of sales and backlog. Further, those orders or forecasts may be for products that meet the customer’s unique requirements such that those canceled orders would result in an inventory of unsaleable products, causing potential inventory write-offs. \nMarkets \nThe breakdown of our annual revenue by end market is set out in the table below:\nEnd Market*\nPercent of Fiscal 2025 Revenue\nPercent of Fiscal 2024 Revenue\nPercent of Fiscal 2023 Revenue\nIndustrial\n45%\n46%\n53%\nAutomotive\n30%\n30%\n24%\nConsumer\n13%\n13%\n10%\nCommunications\n13%\n12%\n13%\n*The sum of the individual percentages may not equal 100% due to rounding.\nThe following describes some of the characteristics of, and customer products within, our major end markets of Industrial, Automotive, Communications and Consumer:\nIndustrial\n — Our industrial market includes the following sectors:\nIndustrial Automation \n— We are a leader in industrial automation demonstrated through our delivery of robust, high-performance solutions derived from our expertise in deep motion and process control and precision sensing measurement and interpretation, which translate into expansive connectivity and power capabilities. We take real-world phenomena in the most complex environments on the factory floor and translate them into valuable insights and outcomes. We co-create with customers to architect robotics systems and solutions that improve dynamic behavior and precision while enhancing worker safety, machine health and manufacturing flexibility. Our industrial automation market includes applications such as:\n• Condition-based monitoring (CbM)\n \n• Industrial power supplies\n• Industrial robotics\n \n• Industrial motion control\n• Factory and process control\n \nInstrumentation & Measurement\n — Trusted measurement is at the forefront of innovation. With the rapid pace of global transformation, from ubiquitous connectivity, to electrification, to AI, to human health and environmental sustainability — all of these trends require reliable and efficient test solutions from R&D to manufacturing to field deployment. We enable high performance measurement through our components and system solutions. Our RF, high-speed and power management products are designed to enable solutions for complying with evolving communications standards. Our high-voltage, isolation and precision products are a key part of the systems that are designed for safety, longevity and efficiency in electric vehicles and renewable energy. Beyond electrical testing, our precision and power technology enable analytical instruments for drug or \n5\nvaccine R&D and manufacturing, food safety and quality and environmental monitoring. Our instrumentation and measurement market includes applications such as:\n• Automated test equipment\n \n• Automotive and energy test\n• Electronic test and measurement\n \n• Life sciences and drug discovery\n• Environmental and process analysis\nAerospace/Defense\n — The defense, commercial avionics and space markets all require high-performance ICs that meet rigorous environmental and reliability specifications. Many of our ICs can be supplied in versions that meet these standards. In addition, many products can be supplied to meet the standards required for broadcast satellites and other commercial space applications. Most of our products sold in this market are specially tested versions of products derived from our standard product offering. As end systems are becoming more complex, many of our customers in this market also look for us to provide higher levels of integration in order to minimize size, weight and power and to improve ease-of-use. As such, we also sell products in the form of system in package (SiPs), printed circuit board assemblies, modules and subsystems. Customer products include applications such as:\n• Navigation systems\n \n• Radar systems\n• Space and satellite communications\n \n• Security devices\n• Communication systems\n• Electronic surveillance and countermeasures\nHealthcare\n — The healthcare market is evolving in response to the need for increased access to better and more affordable care, as well as a growing focus on preventative healthcare and the need to better and more cost effectively manage chronic conditions. To help achieve this, we collaborate with customers and partners on innovative solutions designed to achieve better outcomes for patients and more efficient workflows for physicians at reduced costs. Our offerings include both standard and application-specific hardware, software and service-based products and are used in applications such as:\n• Ultrasound, PET and MRI systems\n \n• Anesthesia equipment\n• X-Ray equipment (CT and DX-Ray)\n \n• Lab and point of care diagnostic equipment\n• Image guided therapy\n \n• Robotic surgery, surgical tools and instruments\n• Multi-parameter vital signs monitors\n \n• Blood analyzers and infusion pumps\n• Remote patient monitoring and wellness\n \n• Renal therapy and organ transplant systems\n• Continuous glucose monitoring\n• Insulin pumps\nEnergy Management\n — The global drive towards improved energy efficiency, conservation, reliability and clean energy is driving investments in electrification across many different application areas, including electric vehicle charging infrastructure, renewable energy, power transmission and distribution systems, electric meters and other innovative areas. The common characteristic behind these efforts is the addition of sensing, measurement and communication technologies to electrical infrastructure. Our offerings include both standard and application-specific products and are used in applications such as:\n• Utility meters\n \n• Wind turbines\n• Electric vehicle charging infrastructure\n \n• Solar inverters\n• Substation relays and automation equipment\n \n• Building energy automation/control\nAutomotive \n— We develop differentiated, high-performance signal processing technologies that enable intelligent, efficient and immersive mobility solutions across electrification, digital cabin systems and autonomous platforms. Collaborating with global mobility solution providers, we deliver a comprehensive portfolio of analog, digital, power and sensor ICs engineered to meet the complex demands of modern mobility systems. Our innovations in precision sensing, edge processing and connectivity empower real-time insights and system-level intelligence, helping transform mobility platforms into dynamic, software-defined environments. These technologies support immersive user experiences, optimize energy efficiency and enable mission-critical perception and navigation capabilities across a wide range of mobility applications. Our solutions are deployed in applications such as:\n•\nAudio, voice processing and connectivity\n•\nBattery monitoring and management systems\n•\nVideo processing and networking\n•\nIntelligent power solutions\n6\nCommunications\n — Our communications market includes the following sectors:\nWireless Communications \n— The demand for ubiquitous global connectivity continues to drive the need for wireless network infrastructure. This market requires a range of high-performance RF communications ICs and solutions. Wireless technology relies on the conversion and processing of signals in both analog and digital domains to transmit and receive data over the air. Our high-performance RF and mixed-signal products are designed to deliver higher speed connectivity with lower latency and improved energy efficiency to mobile operators and network providers. In addition, we enable signal chains and advanced processing across the wireless spectrum supporting a diverse range of end systems. In wireless communication applications, our products are incorporated into:\n• Cellular base station equipment\n• Satellite and terrestrial broadband access equipment\n• Microwave backhaul systems\n• Two-way radio communication devices\n• Fixed wireless access systems\nData Center \n— This market is driven by rapid adoption of AI, machine learning and hyperscale architectures, which require advanced power delivery, thermal management and high-speed connectivity solutions to address the growing demand for high-performance computing and cloud infrastructure. Our offerings in this space include:\n• Power management solutions\n• Optical and high-speed connectivity\n• Energy optimization\nConsumer\n — To address the market demand for state of the art personal and professional entertainment systems and the consumer demand for high quality user interfaces, music, movies and photographs, we have developed analog, digital and mixed-signal and power solutions that meet the rigorous cost and time-to-market requirements of the consumer electronics market. The emergence of high-performance, feature-rich consumer products has created a market for our high-performance ICs with a high level of specific functionality that enables best in class user experience and battery management. These products include:\n• Portable devices (smartphones, tablets, handheld gaming and wearable technology) for media and vital signs monitoring applications\n• Prosumer audio/video equipment\n• Hearable devices (headphones, earbuds and hearing health)\nSee Note 4, \nIndustry, Segment and Geographic Information\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further information about our products by end market.\nCompetition \nWe believe that competitive performance in the marketplace for integrated circuits depends upon multiple factors, including technological innovation, strength of brand, diversity of product portfolio, product performance, technical support, delivery capabilities, customer service quality, reliability and price, with the relative importance of these factors varying among products, markets and customers. We compete with a number of semiconductor companies in markets that are highly competitive. Many companies have sufficient financial, manufacturing, technical, sales and marketing resources to develop and market products that compete with our products. Some of our competitors may have more advantageous supply or development relationships with our current and potential customers or suppliers. Our competitors also include both emerging companies selling specialized products in markets we serve and companies outside of the U.S., including entities associated with well-funded efforts by foreign governments to create indigenous semiconductor industries.  \nWe believe that our technical innovation emphasizing product performance and reliability, supported by our commitment to strong customer service and technical support, enables us to make a fundamental difference to our customers’ competitiveness in our chosen markets.\nSeasonality\nOur sales are subject to a varying degree of seasonality. Historically, sales to customers during our first fiscal quarter have been lower than other quarters due to plant shutdowns at some of our customers. In addition, as explained in our risk factors contained in",
    "item1a": "Item 1A of this Annual Report on Form 10-K for further information.\n \nGovernance\nManagement is responsible for assessing and managing our day-to-day risks and control systems, and our Board is responsible for overseeing our enterprise risk management programs as a whole.\n The Board has delegated the oversight of cybersecurity risk assessment and management to the audit committee. \nAs reflected in its charter, the audit committee is responsible for overseeing and reviewing the Company’s cybersecurity and information security programs, practices and risk mitigation efforts.\n \nThe audit committee receives quarterly reports on cybersecurity risks, or more frequent reports if circumstances dictate.\n \nWe have established a cross-functional Cybersecurity Steering Committee, comprised of our \nChief Information Officer (CIO), our Chief Information Security Officer (CISO)\n and other senior management. The Cybersecurity Steering Committee is charged with overseeing the management of our enterprise security program, including reviewing and prioritizing cybersecurity risks, monitoring potential incidents, establishing key mitigation initiatives, overseeing cybersecurity governance and promoting and supporting cybersecurity best practices. The Cybersecurity Steering Committee is chaired by our CISO. \nBoth our CISO and our CIO have extensive experience in assessing and managing cybersecurity programs and risk management through serving in various senior roles in information technology and cybersecurity and holding multiple industry-recognized certifications.\n \n25\nThe prevention, detection, mitigation and remediation of cybersecurity incidents is accomplished pursuant to various policies, procedures and processes, including our incident response and recovery plan and the other elements of our enterprise security program described above under “Risk Management and Strategy.” These measures include escalation protocols through which the Cybersecurity Steering Committee is informed about cybersecurity and incidents by our CISO. As part of our enterprise security program, we have communication processes enabled for employees to identify and report threats or potential vulnerabilities. \nOur CIO and CISO provide regular updates to the full \nBoard\n on the performance of, and enhancements to, key information technology projects, our enterprise security program and risk mitigation efforts, including relevant findings of the Cybersecurity Steering Committee. The full Board also receives updates from the audit committee.\n In addition, there are protocols in place for immediate escalation in the event of any cybersecurity issues or developments that may require consideration between regularly scheduled audit committee or Board meetings. Our internal audit team also provides regular updates to the audit committee on the performance of our enterprise security program from an internal audit perspective. In addition, our Chief Compliance and Risk Officer, who oversees our overall enterprise risk management and compliance programs and chairs our Enterprise Risk Management Committee, provides regular reports to the full Board, including periodic updates on risk management.\n26",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS\nNone.\n24",
    "item1c": "ITEM 1C.        CYBERSECURITY\nRisk Management and Strategy\nAs part of our enterprise security program, we perform risk assessments relating to cybersecurity and technology risks. Our enterprise security program has been developed based on industry standards, including those published by the International Organization for Standardization (ISO) and the National Institute of Standards and Technology.\n The program includes a comprehensive set of enterprise security policies and procedures that guide our protection strategy. Our policies, procedures and practices include, but are not limited to:\n•\nidentifying critical assets and high-risk threats and analyzing identified risks to determine the potential impact on the organization and the likelihood of occurrence; \n•\ncybersecurity detection, controls and remediation practices, including vulnerability assessments, penetration testing and tabletop exercises; \n•\nan incident response and recovery plan that includes escalation protocols, procedures for containment of incidents and investigation and remediation procedures;\n•\ninstallation of and regular updates to antivirus software on all company managed systems and workstations to detect and prevent malicious code from impacting our systems; \n•\nconducting regular workforce trainings for employees to identify cybersecurity concerns and educate employees on potential risks and best practices;\n•\nevaluating the effectiveness of our program by performing internal assessments; \n•\nperiodic external audits by an independent third party to test for the adequacy of, and compliance with, controls and standards; and\n•\nregular collaboration with leading global security providers, intelligence and law enforcement communities and industry peers to exchange information on trends and best practices in order to address new and evolving cybersecurity risks.\nWe have in place a third-party risk management program to evaluate the cyber postures of our critical partners who handle the Company’s sensitive data in order to identify, monitor and address material cybersecurity risks that may arise from such third-party relationships.\n \nWhile we have experienced cybersecurity incidents in the past, in the last three years we have not experienced any cybersecurity incidents that have materially affected or are currently viewed as reasonably likely to materially affect us, including our business strategy, results of operations or financial condition. However, the scope and impact of any future incidents cannot be predicted and there can be no assurance that our enterprise security program will be effective in preventing material cybersecurity incidents in the future.\n \nSee the risk factor titled “Our computer systems and networks are subject to attempted security breaches and other cyber incidents and a significant disruption in, or breach in security of, our information technology systems or certain products could materially and adversely affect our business or reputation.” in Risk Factors in Part I,"
  }
}