{
  "ticker": "ADP",
  "cik": "0000008670",
  "company_name": "AUTOMATIC DATA PROCESSING INC",
  "filing_date": "2025-08-06",
  "accession": "0000008670-25-000037",
  "primary_doc": "adp-20250630.htm",
  "item_sections": {
    "item1": "Item 15.\nExhibits, Financial Statement Schedules\n90\nSignatures\n95\n2\nPart I\nItem 1. Business\nCORPORATE BACKGROUND\nGeneral\nIn 1949, our founders established ADP with a simple, innovative idea: help clients focus on their business by solving their payroll challenges. In the more than 75 years since, we have shaped the world of work with innovation and expertise, transforming Human Capital Management (“HCM”) from an administrative challenge to a strategic business advantage. We continuously aim to solve complex business challenges for our clients and their workers, helping them work smarter today so they can have more success tomorrow. \nA\nlways \nD\nesigning for \nP\neople means ADP focuses on people, leveraging our unparalleled data insights and innovative technology to elevate human potential. Today, we are a global leader in HR and payroll solutions, serving over 1.1 million clients and paying over 42 million workers in over 140 countries and territories. Our common stock is listed on the NASDAQ Global Select Market® under the symbol “ADP.”\nWhen we refer to “we,” “us,” “our,” “ADP,” or the “Company” in this Annual Report on Form 10-K, we mean Automatic Data Processing, Inc. and its consolidated subsidiaries.\n3\nBUSINESS OVERVIEW\nADP’s Mission\nOur mission is to help businesses make meaningful change in the world of work by providing insightful HCM solutions that meet the evolving needs of our clients and their workers. \nAs new technologies and shifting workplace dynamics continuously reshape the way people work, we support every HCM need of our clients whether that client is a small, local business or a large, global enterprise operating around the world. From HR, payroll, time and benefits to HR outsourcing, talent, compliance and retirement, our solutions span the entire employee experience from hire to retire. Our leading technology and commitment to service excellence are at the core of our relationship with each one of our clients, which span over 140 countries and territories. We are always designing better ways to work through industry leading products, premium services and exceptional experiences that enable people to reach their full potential all around the world.\nADP’s Strategy\nWith a large and growing addressable market, we are focused on our core growth areas and further enhancing our market position by executing on our three strategic priorities: \n• Lead with Best-in-Class HCM Technology. \nWe design and develop world-class HCM platforms that simplify work and utilize enabling technologies such as artificial intelligence (“AI”) and modern cloud architecture. We aim to solve the needs of our clients and their workers today by making HCM transactions compliant and effortless, while anticipating their needs of tomorrow by incorporating valuable data insights and guidance into our solutions to help them better understand their workforce and position them to make better decisions.\n• Provide Unmatched Expertise and Outsourcing Solutions.\n Our clients look to us as a source of expertise to understand key HR trends and best practices, employment and related legislation and regulations, and to offer thoughtful strategies to utilize HCM technology to achieve their business objectives and support their workforce. Many of our clients also ask us to take on responsibility for a portion or all of their HCM workflows via one of our Human Resources Outsourcing (“HRO”) solutions. We continue to build on our deep expertise and make it readily available to our clients through a variety of channels, ranging from traditional call and chat options to self-guided and AI-powered options. We will continue to leverage our significant data insights and investments in AI and other technologies to further enable and effectively apply our decades of knowledge and experience to help our clients and their workers navigate the ever-changing world of work.\n• Benefit our Clients with Our Global Scale. \nOur clients benefit from our unmatched global footprint and scale in the HCM industry. We will continue to build on these strengths to further improve our client experience, and to add to our global footprint to further meet our clients where they choose to do business and address their needs for a distributed and flexible workforce. We see meaningful opportunities to leverage our strength in global payroll and expand our HR and workforce management \n4\nsolutions to support our global and multinational clients. We continue to build more relationships with partners, such as through the ADP Marketplace, in order to provide clients with seamless integrations and customizations that simplify their HR processes and best address their unique needs. And we intend to grow our sales organization and continue to invest in best-in-class sales technology to not only optimize the purchase experience but to also empower our sellers to provide the deep expertise and insights our clients require to ensure they have the right HCM solutions to help them achieve their objectives and make a meaningful impact for their employees. \nInnovation at ADP\nInnovation is in our DNA. For over 75 years, we have proven that actively listening and responding to what clients and their employees need and want keeps the world of work progressing forward. As a founder in the industry, we pioneered HCM automation, HCM in the cloud, mobile HCM and a digital HCM marketplace, laying the groundwork and streamlining our infrastructure to innovate at a faster pace. This spirit of innovation remains a steady guide as we continue to listen and respond to emerging needs. As technologies like AI, machine learning (“ML”) and generative AI change how work happens, we remain focused on providing our clients and associates with HCM technology that is easy to use, powered with smart insights and personalized to support a human-centric experience. \nTo bring these solutions to market, we pursue multiple paths to innovation. From leveraging our unique data to provide differentiated insights to collaborating with, or investing in, organizations with complementary products to purchasing solutions that add to our strong foundation, each of these paths helps ADP sustain a culture focused on continuous innovation.\nStrategically infusing AI\nThe AI landscape is evolving quickly. As we move from early automation and predictive analytics to AI-enabled workflows, agentic AI is the future of innovation in the HCM space. Our AI strategy is to deliver AI agents for all \nmajor HCM roles that our clients have. Our clients have employees performing different roles such as payroll, HR, benefits, compensation, and recruiting. Our goal is to deliver AI agents that continue to automate tedious, time heavy tasks and deliver value to these individuals to do more strategic activities. Similarly, we intend to deliver AI role-based agents to our internal associates such as sales, software engineering, testing, product management, service, and implementation.\nTo advance these efforts, we continue to roll out ADP Assist, our award-winning cross-platform solution powered by generative AI that transforms data into credible and actionable insights. ADP Assist offers smart, user-centric solutions through a conversational interface that touches every aspect of HR – payroll, time, talent, benefits, recruitment, analytics, reporting, and compliance.\nADP Assist validates payroll information, checking for payroll anomalies and using generative AI to identify and help resolve missing tax registrations and answer questions by drawing on ADP’s large, up-to-date dataset of compliance information. ADP Assist also uses generative AI to simplify report creation, helping HR practitioners and leaders access internal, national, and global workforce data to analyze compensation, turnover, candidate profile relevancy, and talent market insights. A 2024 AI Breakthrough Award winner, the solution was also recognized in Business Intelligence Group’s 2025 BIG Innovation Awards and 2025 Artificial Intelligence Excellence Awards for driving innovation and possibilities in AI. \nAlong with transforming our solutions, we firmly believe AI and generative AI enhance our operations and enable us to elevate the end-to-end client experience. To lean into our service expertise, we continue to extend generative AI capabilities to a broader portion of our service and implementation associates to deliver an even better client experience. We also continue to explore generative AI capabilities to further empower our sellers to be more productive. In addition, we extended AI tools to all of our product developers for coding, testing, and documentation. \nData is our differentiator\nTo harness the power of AI, data is critical – and it’s the foundation of the advantage we bring to our clients. Data is at the core of our products and solutions, informing and driving our approach to innovation and new technology. The global scale and scope of our client base provide us the industry’s largest and deepest HCM dataset with over 1.1 million clients spanning over 140 countries and territories and 42 million workers globally. Our broad and granular data set positions us well to deliver smarter and more tailored HCM agents that we believe will be truly differentiated in the market. Additionally, combining our vast client and service data with client outcomes gives us a deeper understanding of clients’ needs and goals. \nAI represents the next frontier, and our industry-leading data set married to our best-in-class distribution offers \n5\nADP a distinct, competitive advantage. AI and ML drive many of the key features of ADP’s data products, including ADP DataCloud, our award-winning people analytics solution. ADP DataCloud analyzes aggregated, anonymized and timely HCM and compensation data from more than one million organizations across the U.S., powering solutions that provide clients with in-depth workforce and business insights that enable critical HR decisions. \nAnalytics enhanced by ADP Assist leverages generative AI to deliver answers to analytics questions across key practice areas including benefits, HR, payroll, recruitment and time, helping to remove user friction. \nScalable, Global HCM Offerings\nWe also continue to advance our next-gen platforms, launching ADP Lyric HCM in September 2024. Building on our position as a leader in global pay, we designed Lyric to be as dynamic as the world of work. The unified, global HCM solution is designed for adaptability, providing our clients with the flexibility they need to address today’s and tomorrow’s workplace challenges, and to personalize the experience based on their needs. The solution was named “Data Solution of the Year for Human Resources” in the 2025 Data Breakthrough Awards.\nTo expand our global offering and enhance our enterprise solution suite, in October 2024 ADP acquired WorkForce Software, a premier workforce management solutions provider that specializes in supporting large, global enterprises. WorkForce Software’s solutions can adapt to the dynamic needs of today’s employers, creating resiliency, driving performance and making managing a global workforce easy. This acquisition expands our current array of global time and attendance, absence management and scheduling tools and will drive workforce management innovation to help meet the future needs of businesses. In addition, ADP acquired Procesamiento Externo de Información, S.C. (PEI) in February 2025, a provider of  local payroll, HCM expertise, and technology solutions for Mexican businesses, strengthening ADP’s capabilities in local and global payroll and HR.\nSustaining a culture of responsible AI\nIn harnessing the power of data through AI and ML, ADP \nrecognizes the importance of accountability, transparency, privacy, explainability and governance, and in furtherance of those goals has established an active AI & Data Ethics Committee, comprised of both industry leaders and ADP experts, which advises on emerging industry trends and concerns and provides guidance with respect to compliance with the principles that ADP should follow while developing products, systems and applications that involve AI, ML and data.\nAs we continue to explore the potential that new technologies like generative AI can provide, we understand the great responsibility we have to approach these innovations in a way that is ethical, secure, and compliant for our business and the clients and workers we serve around the world. This led to our establishment of an interdisciplinary working group across ADP to determine governance for use cases and adoption of a set of principles and processes to govern the use of these newer technologies, including operational monitoring of recommendations made by AI and ML technologies.\nCreating a customized HR ecosystem\nTo meet clients’ shifting needs, we also collaborate with partners through solutions like ADP Marketplace, one of the largest e-commerce platforms for HR solutions in the industry. This innovative marketplace empowers our clients to connect and share data seamlessly across their HR systems, offering access to over 800 partner solutions - from recruiting and onboarding to compliance and learning management. With the introduction of AI technology, including our generative AI smart search tool, clients can quickly discover and evaluate partner solutions using natural language, enabling clients to tailor their HCM ecosystem with integrated solutions that best fit their unique needs. \nAdditionally, ADP API Central offers secure APIs and tools and resources for custom integrations to simplify and automate business processes. This solution was named \n6\n“New Product of the Year” in Business Intelligence Group’s 2024 BIG Awards for Business.\nAccelerating innovation\nReflecting our commitment to innovation, ADP’s corporate venture capital arm and innovation lab, ADP Ventures, is focused on enhancing and strengthening ADP’s core business, creating offerings in new adjacent segments and geographies, and developing new assets to monetize markets and segments beyond HCM.  As part of its strategy, ADP Ventures invests in and partners with early-stage and scaling tech startups that advance ADP’s innovation strategy. \nReportable Segments\nOur two reportable business segments are Employer Services and Professional Employer Organization (“PEO”), and are based on the way that management reviews the performance of, and makes decisions about, our businesses. For financial data by segment and by geographic area, see Note 15 to the “Consolidated Financial Statements” contained in this Annual Report on Form 10-K.\nEmployer Services\n.  Our Employer Services segment serves clients ranging from single-employee small businesses to large enterprises with tens of thousands of employees around the world, offering a comprehensive range of technology-based HCM solutions, including our strategic, cloud-based platforms, and HRO (other than PEO) solutions. These solutions address critical client needs and include: Payroll Services, Benefits Administration, Talent Management, HR Management, Workforce Management, Compliance Services, Insurance Services and Retirement Services.\nProfessional Employer Organization\n.  Our PEO business, called ADP TotalSource\n®\n, is our full-service PEO that offers expert guidance, user-friendly technology, comprehensive employee benefits, and a risk management, safety, and workers’ compensation program as part of a co-employment arrangement in which employees who work for a client (referred to as “worksite employees”) are co-employed by us and the client.\n7\nPRODUCTS AND SOLUTIONS\nIn order to serve the unique needs of our clients and their diverse types of businesses and workforce models, we provide a range of solutions that businesses of all types and sizes and across geographies can use to recruit, onboard, pay, manage, and retain their workforce. We address these broad market needs with our cloud-based strategic platforms: RUN Powered by ADP\n®\n, serving over 940,000 small businesses; ADP Workforce Now\n®\n, serving over 90,000 mid-sized and large businesses; and ADP Lyric HCM, serving large enterprise businesses. All of these solutions can be combined with ADP SmartCompliance\n®\n to address the increasingly broad and complex needs of employers. Outside the United States, we address the needs of over 70,000 clients with premier global solutions consisting of in-country solutions and multinational offerings, including Lyric, ADP Global Payroll and ADP iHCM.\nHCM Solutions\nIntegrated HCM Solutions.\n \n \nOur premier suite of HCM products offers complete solutions that assist employers of all types and sizes in all stages of the employment cycle, from recruitment to retirement.\nOur suite of HCM solutions are powered by our strategic, cloud-based, award-winning platforms, including:\n• RUN Powered by ADP is an all-in-one platform designed specifically for small businesses to simplify payroll, HR, and compliance. It combines easy-to-use technology with 24/7 real-person support from ADP’s team of payroll professionals.  RUN also integrates with other ADP solutions, including workforce management, workers’ compensation, benefits, and retirement services.\n• ADP Workforce Now is a flexible HCM solution used across mid-sized and large businesses in North America to manage their employees. \nMore businesses use ADP \nWorkforce Now in North America\n than any other HCM solution designed for both mid-sized and large businesses.\n• ADP Lyric HCM is a global HCM for large enterprises, unifying HR management, payroll, workforce management, talent, and data analytics into a flexible, intelligent, and human-centric solution. Businesses using Lyric also benefit from comprehensive end-to-end service support, with an emphasis on global compliance and expertise.\n \nLyric is built for the way people actually work together, mirroring practically any structure of work groups, such as divisions, regions, or dynamic teams.  Lyric integrates generative AI technology with ADP’s unmatched dataset, helping to support decision-making, drive efficiency and personalize employee experiences based on attributes of role, geographic location, typical behaviors, and anticipated need.\nGlobal Payroll\n. \n \nWe pay over 26 million (approximately 1 out of every 6) workers in the United States. We offer flexible payroll services to employers of all sizes, including the preparation of employee paychecks, pay statements, supporting journals, summaries, and management reports.\n8\nWe provide employers with a wide range of payroll options, including using mobile technology, connecting their major enterprise resource planning (“ERP”) applications with ADP’s payroll services or outsourcing their entire payroll process to us. Employers can choose a variety of payroll payment options including ADP’s electronic wage payment and, in the United States, payroll card solutions and digital accounts. On behalf of our clients in the United States, we prepare and file federal, state and local payroll tax returns, and quarterly and annual Social Security, Medicare, and federal, state and local income tax withholding reports. \nBenefits Administration.\n \n In the United States, we provide powerful and agile solutions for employee benefits administration. These options include health and welfare administration services, leave administration services, insurance carrier enrollment services, employee communication services, and dependent verification services. In addition, ADP benefits administration solutions offer employers a simple and flexible cloud-based eligibility and enrollment system that provides their employees with tools, communications, and other resources they need to understand their benefits options and make informed choices.\nTalent Management.\n \n \nADP’s Talent Management solutions simplify and improve the talent acquisition, management and activation process, from recruitment to ongoing employee engagement and development. Employers can outsource their internal recruitment function to ADP through ADP’s Recruitment Process Outsourcing services. Employers can also receive employer brand activation services, management of candidate advertising, talent community building services, and recruiter training services, as well as career search support and outplacement for reductions in force. Our solutions provide performance, learning, succession and compensation management tools that help employers align goals to outcomes, and enable managers to identify and mitigate potential retention risks. Our talent activation solutions include \nStandOut\n® powered by ADP, which provides team leaders with data and insights to drive employee engagement and leadership development, which in turn help drive employee performance.\nWorkforce Management.\n \n ADP’s Workforce Management offers a range of solutions to over 140,000 employers of all sizes, including time and attendance, absence management and scheduling tools. Time and attendance solutions include time capture via online timesheets, timeclocks with badge readers, biometrics and touch-screens, telephone/interactive voice response, and mobile smartphones and tablets. These tools automate the calculation and reporting of hours worked, helping employers prepare payroll, control costs and overtime, and manage compliance with wage and hour regulations. Absence management tools include accrued time off, attendance policy and leave case management modules. Our employee scheduling tools simplify visibility, offer shift-swapping capabilities and can assist managers with optimizing schedules to boost productivity and minimize under- and over-staffing. We also offer data analytics and reporting tools that provide clients with insights, benchmarks and performance metrics so they can better manage their workforce. In addition, industry-specific modules are available for labor forecasting, budgeting, activity and task management, grant and project tracking, and tips management.\nCompliance Solutions.\n \nADP’s Compliance Solutions provides industry-leading expertise in payment compliance and employment-related tax matters that complement the payroll, HR and ERP systems of our clients. In our fiscal year ended June 30, 2025, in the United States, we processed and delivered more than 78 million employee year-end tax statements and moved more than $3.3 trillion in client funds to our clients’ employees, tax authorities and other payees. Our offerings within Compliance Solutions include employment tax services, W-2 management, business tax credits, I-9 management, employment verification, wage garnishment and Wisely by ADP, our paycard solution.\nHuman Resources Management.\n \n \nCommonly referred to as Human Resource Information Systems, ADP’s Human Resources Management Solutions provide employers with a single system of record to support the entry, validation, maintenance, and reporting of data required for effective HR management, including employee names, addresses, job types, salary grades, employment history, and educational background. \nInsurance Services.\n \nADP’s Insurance Services business, in conjunction with our licensed insurance agency, Automatic Data Processing Insurance Agency, Inc., facilitates access in the United States to workers’ compensation and group health insurance for over 260,000 small and mid-sized clients through a variety of insurance carriers. Our automated Pay-by-Pay® premium payment \n9\nprogram calculates and collects workers’ compensation premium payments each pay period, simplifying this task for employers.\nRetirement Services.\n \n ADP Retirement Services helps over 190,000 employers in the United States administer various types of retirement plans, such as traditional and Roth 401(k)s, profit sharing (including new comparability), SIMPLE and SEP IRAs, and executive deferred compensation plans. ADP Retirement Services offers a full service 401(k) plan program which provides recordkeeping and administrative services, combined with an investment \nplatform offered through ADP Broker-Dealer, Inc. that gives our clients’ employees access to a wide range of non-proprietary investment options and online tools to monitor the performance of their investments. In addition, ADP Retirement Services offers investment management services to retirement plans through ADP Strategic Plan Services, LLC, an SEC registered investment adviser under the Investment Advisers Act of 1940. ADP Retirement Services also offers trustee services through ADP Retirement Trust Services, LLC, a New Hampshire state-chartered affiliated trust company, as well as through a third party.\nHRO Solutions\nAs a leader in the growing HR Outsourcing market, we partner with clients from small, mid-sized and large enterprise organizations, offering a full range of premium services and seamless technology for HR, benefits, payroll, and talent management. We help organizations streamline processes, reduce the daily workload and reduce compliance risk while also gaining a partner to navigate HR challenges. Whether a client chooses our PEO or HRO/Managed Services, we offer solutions tailored to a client’s specific needs and provide day-to-day expertise, guidance and tools, all personalized to meet their unique needs. ADP’s HR Outsourcing solutions serve over three million client employees.\nProfessional Employer Organization.\n ADP TotalSource is enabled by ADP Workforce Now and offers small and mid-sized businesses a comprehensive HR outsourcing solution through a co-employment model. With a PEO, both ADP and the client have a co-employment relationship with the client’s employees. We assume certain employer responsibilities such as payroll processing and tax filings, and the client maintains control of its business and all management responsibilities. ADP TotalSource clients are able to offer their employees services and benefits on par with those of much larger enterprises, without the need to staff a full HR department. With our cloud-based HCM software at the core, we serve more than 18,000 clients and more than 750,000 worksite employees in all 50 U.S. states. ADP TotalSource is the largest PEO certified by the Internal Revenue Service as meeting the requirements to operate as a Certified Professional Employer Organization under the Internal Revenue Code. ADP TotalSource is also an Employer Services Assurance Corporation accredited PEO, which demonstrates that ADP meets the industry’s high standards and has the experience and financial stability to fulfill the needs of the businesses it serves. As a full-service PEO, ADP TotalSource provides a broad range of HR administrative services, including payroll and payroll tax, employer compliance, HR guidance, employee benefits and benefit administration, talent strategies, and workers’ compensation insurance including risk and claims management. \nADP Comprehensive Services. \n ADP Comprehensive Services combines personalized, high-touch support with our market-leading ADP Workforce Now platform to offer a one-stop suite of managed services solutions that are tailored to the specific needs of businesses of all sizes. Our committed team of professionals provides expertise, guidance, and tools across HR, talent management, payroll, and benefits administration through a combination of proven expertise, deep experience, and best practices. We take the time to understand our clients’ businesses to offer the right strategic support, enabling a flexible partnership that can cover one, some, or all areas of their HR and payroll processes.\n \nOur scalable solution is designed to act as an extension of our clients’ in-house resources, providing outsourced execution that effectively combines expertise, processes and technology.  \nADP Comprehensive Outsourcing Services (ADP COS).\n \n ADP COS is designed for large enterprises to outsource their payroll. With ADP COS, the day-to-day payroll process becomes our responsibility, freeing up clients to address critical issues like employee engagement and retention. The combination of technology, deep expertise and data-driven insights that ADP COS offers is powerful, allowing clients to focus on strategy and results.\nGlobal Solutions\nOur premier global solutions consist of multi-country and local in-country solutions for employers of any type or size. We partner with clients to help them navigate the most complex HR and payroll scenarios using tailored and scalable technology supported by our deep compliance expertise.\n10\nADP Global Payroll is a solution for multinational organizations of all sizes, empowering them to harmonize HCM strategies in over 140 countries and territories globally. This improves visibility, control and operational efficiency, giving organizations the insight and confidence to adapt to changing local needs, while helping to drive overall organizational agility and engagement.\nWe also offer comprehensive, country-specific HCM solutions that combine innovative technology with deep local expertise. By operating a flexible service model, we help clients manage various combinations of payroll services, HR management, time and attendance management, talent management and benefits management, depending on the country in which the solution is provided.\nWe pay over 16 million workers outside the United States with our in-country and multi-country solutions, such as ADP iHCM and ADP Global Payroll. As part of our global payroll services, we supply year-end regulatory and legislative tax statements and other forms to our clients’ employees. Our global talent management solutions elevate the employee experience, from recruitment to ongoing employee engagement and development. Our comprehensive HR solutions combined with our deep expertise make our clients’ global HR management strategies a reality. Our configurable, automated time and attendance tools help global clients understand the work being performed and the resources being used, and help ensure the right people are in the right place at the right time.\nMARKETS AND SALES\nOur HCM solutions are offered in over 140 countries and territories across North America, Latin America, Europe, Asia and Africa. The most material markets for HCM Solutions, Global Solutions and HRO Solutions (other than PEO) are the United States, Canada and Europe. In each market, we have both country-specific solutions and multi-country solutions, for employers of all sizes and complexities. The major components of our offerings throughout these geographies are payroll, HR outsourcing and workforce management. In addition, we offer wage and tax collection and/or remittance services in the United States, Canada, the United Kingdom, Australia, India, China, Hong Kong, Macau, Malaysia, and Taiwan. Our PEO business offers services exclusively in the United States.\nWe market our solutions primarily through our direct sales force. We also market HCM Solutions, Global Solutions and HRO Solutions through indirect sales channels, such as marketing relationships with certified public accountants and banks, among others. None of our major business units has a single homogeneous client base or market. While concentrations of clients exist in specific industries, no one client, industry or industry group is material to our overall \nrevenues. We are a leader in each of our major service offerings and do not believe any of our major services or business units is subject to unique market risk.\nCOMPETITION\nThe industries in which we operate are highly competitive. We know of no reliable statistics by which we can determine the number of our competitors, but we believe that we are one of the largest providers of HCM solutions in the world. HCM Solutions, Global Solutions and HRO Solutions (other than PEO) compete with other business outsourcing companies, companies providing ERP services, providers of cloud-based HCM solutions and financial institutions. Our PEO business competes with other PEOs providing similar services, as well as business outsourcing companies, companies providing ERP services and providers of cloud-based HCM solutions. We also face ongoing competition from companies’ in-house functions, whereby companies install and operate their own HCM system.\nCompetition for business outsourcing solutions is primarily based on product and service quality, reputation, ease of use and accessibility of technology, breadth of offerings, and price. We believe that we are competitive in each of these areas and that our leading-edge technology (together with our data) and commitment to service excellence, distinguishes us from our competitors.\nINDUSTRY REGULATION\nOur business is subject to a wide range of complex U.S. and foreign laws and regulations. In addition, many of our solutions are designed to assist clients with their compliance with certain U.S. and foreign laws and regulations that apply to them. We have, and continue to enhance, compliance programs and policies to monitor and address the legal and regulatory requirements applicable to our operations and client solutions, including dedicated compliance personnel and training programs.\n11\nAs a global leader in HR and payroll solutions, our systems contain a significant amount of data related to clients, employees of our clients, vendors and our employees. We are, therefore, subject to compliance obligations under federal, state and foreign privacy, data protection, AI and cybersecurity-related laws, including federal, state and foreign security breach notification laws with respect to both client employee data and our own employee data. The changing nature of these comprehensive laws in the United States, Europe and elsewhere, including the European Union’s (the “EU”) General Data Protection Regulation (the “GDPR”),  the California Privacy Rights Act of 2020 (the “CPRA”), and the Department of Justice’s (the “DOJ”) Data Security Program established under Executive Order 14117, impact our processing of personal information of our employees and on behalf of our clients. The GDPR imposes strict and comprehensive requirements on us as both a data controller and a data processor. As part of our overall data protection compliance program, including with respect to data protection laws in the EU, we are one of the few companies in the world to have implemented Binding Corporate Rules (“BCRs”). Compliance with our BCRs permits us to process and transfer personal data across borders in accordance with the GDPR and other data protection laws in the EU. The\n \nCPRA requires companies to provide data disclosure, access, deletion and opt-out rights to consumers in California. The DOJ’s Data Security Program requires us to ensure that there is not access to sensitive personal data of U.S. persons by countries of concern in excess of certain thresholds. In the area of AI, some states and localities in the U.S., the EU and elsewhere have proposed or already enacted legislation that imposes obligations on how we develop and market AI-based products and solutions. Specifically, the EU Artificial Intelligence Act imposes requirements on providers of certain types of AI services. Additionally, self-regulatory frameworks like the National Institute of Standards and Technology AI Risk Management Framework are being promulgated and adherence to these may become an industry standard or client expectation. In the United States, the Health Insurance Portability and Accountability Act of 1996 applies to our insurance services businesses and ADP TotalSource.\nAs part of our payroll and payroll tax management services, we move client funds to our clients’ employees, tax authorities and other payees via electronic transfer, direct deposit, prepaid access and ADPCheck. In 2019, the Office of the Comptroller of Currency (the “OCC”) authorized us to open ADP Trust Company, National Association (the “ADP Trust Bank”), via a national trust bank charter pursuant to the National Bank Act. The ADP Trust Bank is the sole trustee of ADP Client Trust, our grantor trust which holds U.S. client funds, and is responsible for the oversight and management of those client funds. The ADP Trust Bank, and all of its fiduciary activities including the U.S. money movement it oversees and manages via ADP Client Trust, is subject to comprehensive ongoing oversight and regulation by the OCC. In addition, our U.S. money movement managed by the ADP Trust Bank and our U.S. prepaid access offering \nare subject to the anti-money laundering and reporting provisions of The Bank Secrecy Act of 1970, as amended by the USA PATRIOT Act of 2001 (the “BSA”). Our prepaid access offerings are subject to consumer protection laws and regulations, including the Electronic Funds Transfer Act and Regulation E issued by the Consumer Financial Protection Bureau as well as prohibitions on unfair, deceptive, or abusive acts or practices. Consumer protections for prepaid accounts under Regulation E include requirements related to pre-acquisition fee and other disclosures, error resolution and investigation, and account access. Elements of our money movement activities outside of the United States are subject to licensing and similar anti-money laundering and reporting laws and requirements in certain countries in which we provide such services. In February 2024, ADP Canada Co. became a registered entity with the Financial Transactions and Reports Analysis Centre of Canada (“FINTRAC”), Canada’s anti-money laundering and anti-terrorist financing supervisor, as a Money Service Business as a result of a change in policy guidance from FINTRAC related to the Canadian Proceeds of Crime (Money Laundering) and Terrorist Financing Act. In November 2024, ADP Canada Co. filed its application for registration with the Bank of Canada as a Payment Services Provider, as defined and required under the Retail Payment Activities Act.\nOur employee background screening services business offers background checking services that are subject to the Fair Credit Reporting Act. ADP TotalSource is subject to various state licensing requirements and, as a Certified PEO, maintains certifications with the Internal Revenue Service. Because ADP TotalSource is a co-employer with respect to its clients’ worksite employees, we may be subject to certain obligations, responsibilities and liabilities of an employer under federal and state tax, insurance and employment laws, including worksite employee payroll obligations and with respect to claimed employee retention and other tax credits. ADP Strategic Plan Services, LLC, our registered investment adviser, provides certain investment management and advisory services to retirement plan administrators under a heightened “fiduciary” standard and is regulated by the SEC and the U.S. Department of Labor. ADP Broker-Dealer, Inc., which supports our Retirement Services business, is a registered broker-dealer regulated by the SEC and the Financial Industry Regulatory Authority. ADP Retirement Trust Services, LLC supports our Retirement Services business as a New Hampshire state-chartered trust company. ADP Retirement Trust Services, LLC is a directed-fiduciary trustee with responsibility for oversight of the retirement plan assets of our clients and regulated by the Department of Labor under the Employee Retirement Income Security Act of 1974, as amended, and is also subject to the oversight of the New Hampshire Banking Department.\nOur current and future offerings in the payments and/or consumer space may also subject us to additional laws and regulations, which could also require corresponding compliance programs and policies and dedicated resources.\n12\nIn addition, many of our businesses offer solutions that assist our clients in complying with certain U.S. and foreign laws and regulations that apply to them. Although these laws and regulations apply to our clients and not to ADP, changes in such laws or regulations may affect our operations, products and services. For example, our payroll services are designed to facilitate compliance with state laws and regulations applicable to the payment of wages. In addition, our HCM solutions help clients manage their compliance with certain requirements of the Affordable Care Act in the United States. Similarly, our Tax Credit Services business, which helps clients in the United States realize tax credit opportunities in connection with the hiring of new employees and certain other activities, is based on federal, state or local tax laws and regulations allowing for tax credits, which are subject to renewal, amendment or rescission.\nWe believe that key components of our compliance programs provide real competitive differentiators. For instance, our BCRs have enabled ADP to apply a global standard of data protection, simplifying data transfer processes and assisting our clients in meeting the demanding standards of data protection expected in Europe – a solution that most competitors cannot provide. Similarly, the ADP Client Trust and ADP Trust Bank provide client funds with a level of protection that most competitors cannot offer. \nThe foregoing description does not include an exhaustive list of the laws and regulations governing or impacting our business. See the discussion contained in the “Risk Factors” section in Part I,",
    "item1a": "Item 1A. Risk Factors” of this Annual Report on Form 10-K.\n \nGovernance\nA cross-functional, enterprise-wide management program operates to evaluate our global cybersecurity program’s effectiveness and members of the Company’s executive committee, through an executive security council, routinely review strategy, policy, program effectiveness, standards enforcement and cyber issue management. \nOur chief information security officer (“CISO”) leads our global cybersecurity program and oversees the global cybersecurity services team, which is responsible for monitoring, identifying, assessing and managing cybersecurity threats across ADP. Our CISO reports to our \nchief security officer (“CSO”)\n, who leads our global security organization and is responsible for cybersecurity, fraud prevention, operational risk management, client security management, and workforce protection. \nOur CSO has over 25 years of experience in a range of security roles, including serving as a chief security officer at another public company, and participates in various cyber security organizations. The current CISO has served in various roles in cybersecurity and information technology for over 25 years and has attained the professional certification of Certified Information Security Manager.\nOur board of directors is actively engaged in the oversight of our global cybersecurity program.\n \nOur \nboard of directors\n receives regular, quarterly reports on these matters from our CSO and leadership from our global product and technology organization, including on the status of projects to strengthen the Company’s cybersecurity systems and improve cyber readiness, as well as on existing and emerging threat landscapes. In addition, the corporate development & technology committee of our board of directors receives regular, quarterly reports on our global product security and resiliency program led by leadership from our global product and technology organization with assistance from our CSO. Concurrent and in addition to these reports, our chief administrative officer (“CAO”) (who oversees legal, security and compliance matters) provides a legal, regulatory and ethics update at each meeting of the audit committee of our board of directors, which includes matters of cybersecurity, as appropriate. In addition, important actual or emerging cybersecurity events are communicated to the board of directors by our CAO and Chief Legal Officer, even if immaterial to us.\n \nOur global cybersecurity program is subject to an annual third-party assessment overseen by our board of directors and this assessment reviews all aspects of our cyber program. Findings are reported to our board of directors and, in response, ADP develops initiatives to improve our maturity across each of the pillars of the NIST Cybersecurity Framework. The status of these initiatives is then reviewed with our board of directors during its quarterly meetings. This governance process encourages an environment of continuous improvement.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nRisk management and strategy\nAt ADP, security is integral to our products, our business processes and infrastructure. We have an enterprise-wide approach to security with the objectives of protecting client data and funds, and preventing security incidents that could adversely affect the confidentiality, integrity, or availability of our information systems and data that resides in those systems, while also improving our system resilience with the aim of minimizing the impact to our business when incidents do occur.\nIn connection with our business, we collect, host, store, transfer, process, disclose, use, secure, retain and dispose of large amounts of personal and business information about our clients, employees of our clients, our vendors, our partners, and our employees, contractors and temporary staff. We also collect significant amounts of funds from the accounts of our clients and transmit them to their employees, tax authorities and other payees. As the global environment continues to grow increasingly hostile and attacks on information technology systems continue to grow in frequency, complexity and sophistication, we are regularly targeted by unauthorized parties using malicious tactics, code and viruses. Although this is a global problem, it may affect our businesses more than other businesses because unauthorized parties may focus on the amount and type of personal and business information that our businesses collect, host, store, transfer, process, disclose, use, secure, retain and dispose of, and the client funds that we collect and transmit.\nADP has implemented a cybersecurity program designed to assess, identify, and manage risks from cybersecurity threats.\n Our cybersecurity policies, processes, and standards are informed by industry practices and by industry frameworks and standards such as the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework and the International Organization for Standardization information security standards, including those standards for which we do not have a certification, but we do exercise judgment in selecting applicable controls from such framework or standards.\n Our cybersecurity program includes: \n•\nTechnical Safeguards.\n We have implemented a layered approach to defend against cybersecurity threats. We periodically evaluate technical controls through application security assessments, vulnerability management, penetration testing, and security audits.\n•\nIncident Management and Response. \nA global team monitors our key applications and systems 24/7/365 to detect, investigate and respond to anomalies and incidents. This team addresses reported or detected issues by following a defined incident lifecycle and uses an incident management system to record facts, impact and remedial actions taken. We have established a cybersecurity incident response plan and escalation process, outlining processes for responding to incidents from identification to mitigation and notifying members of senior leadership, the board of directors and external advisors, as appropriate. We test our plans and processes through simulation exercises, scenario planning and tabletop exercises, using findings to improve processes. \n•\nExternal and Internal Assessments. \nWe periodically engage assessors, consultants, auditors, and other third parties to evaluate our technology, security, and related controls and benchmark against industry practices.\n \nWe engage in both internal and external assurance and audit activities across the company multiple times a year including an annual third-party review of our overall cybersecurity program. \n•\nThreat Intelligence.\n We maintain affiliations with cybercrime task forces and other third-party monitoring organizations. In addition, we collaborate with professional security organizations, law enforcement and technology companies to proactively identify malicious activity.\n•\nBusiness Resiliency Program.  \nWe have established a global, integrated business resiliency program designed to manage the impacts of technological, environmental, process and health risks on service delivery. This program uses an integrated framework that lays out our mitigation, preparedness, response and recovery process.  \n•\nThird-Party Risk Management. \nWe maintain a \nthird-party risk management process\n, designed to identify and manage risks associated with our vendors, our partners and other third parties, that includes conducting security assessments prior to engagement and periodically during the engagement. We also seek to include security and privacy terms, where appropriate, in our contracts with third-party service providers that require third parties to maintain security controls to protect our data and notify us in the event of a cybersecurity incident.\n•\nSecurity Awareness and Training Program\n.  Our security training and awareness program is a continuous, dynamic initiative, designed to develop and maintain a security-focused culture and empower our associates to make responsible, secure decisions. As part of this awareness program, we communicate to our associates on a regular basis regarding key security topics and current events, best practices for addressing such cybersecurity threats, and \n24\ngamification to reinforce effective behaviors. All associates are also required to take an annual, interactive security training program that includes an overview of key security topics, policies and responsibilities. \nWe have also integrated cybersecurity related risks into our enterprise risk management program, which is designed to identify, prioritize, assess, monitor and mitigate the various risks confronting ADP, including cybersecurity risks. Our enterprise risk management team conducts a range of activities, including an annual enterprise risk management assessment.\nWe have been, and continue to be, the subject of cybersecurity attacks, including unauthorized intrusion, malicious software infiltration, network disruption, and denial of service. \nAlthough we believe that we maintain a robust program of information security and controls and none of the cybersecurity incidents that we have identified to date have materially affected us, including our business strategy, results of operations, or financial condition, we cannot provide assurances that a cybersecurity incident will not materially affect us, or our business strategy, results of operations or financial condition in the future.\n For additional information on cybersecurity related risks, see “"
  }
}