{
  "ticker": "ADSK",
  "cik": "0000769397",
  "company_name": "Autodesk, Inc.",
  "filing_date": "2025-03-06",
  "accession": "0000769397-25-000019",
  "primary_doc": "adsk-20250131.htm",
  "item_sections": {
    "item1": "Item 1, “Business”.\nThe following table outlines our recurring revenue metric for the fiscal years ended January 31, 2025, 2024, and 2023:\nFiscal Year Ended January 31, 2025\nChange compared to\nprior fiscal year end\nFiscal Year Ended January 31, 2024\nChange compared to\nprior fiscal year end\nFiscal Year Ended January 31, 2023\n$\n%    \n$\n%    \nRecurring Revenue\n (in millions)\n (1)\n$\n5,974 \n$\n597 \n11 \n%\n$\n5,377 \n$\n470 \n10 \n%\n$\n4,907 \nAs a percentage of net revenue\n97 \n%\nN/A\nN/A\n98 \n%\nN/A\nN/A\n98 \n%\n ________________\n(1)     The acquisition of a business may cause variability in the comparison of recurring revenue in this table above and recurring revenue derived from the revenue reported in the Consolidated Statements of Operations.\n \nNR3 was within the range of 100% and 110%, on a constant currency basis, as of both January 31, 2025 and 2024.\nForeign Currency Analysis\nWe generate a significant amount of our revenue in the United States, Germany, Japan, the United Kingdom, and Canada.\nThe following table shows the impact of foreign exchange rate changes on our net revenue and total spend: \nFiscal Year Ended January 31, 2025\nPercent change compared to\nprior fiscal year (as reported)\nConstant currency percent change compared to\nprior fiscal year (1)\nPositive/negative/neutral impact from foreign exchange rate changes\nNet revenue\n12 \n%\n13 \n%\nNegative\nTotal spend \n9 \n%\n10 \n%\nPositive\n ________________\n(1)\nPlease refer to the “Glossary of Terms” in Part I, Item 1, “Business” for the definitions of our constant currency growth rates. \nChanges in the value of the U.S. dollar may have a significant effect on net revenue, total spend, income from operations, and cash flow in future periods. We use foreign currency contracts to reduce the exchange rate effect on a portion of the net revenue of certain anticipated transactions but do not attempt to completely mitigate the impact of fluctuations of such foreign currency against the U.S. dollar.\n47\nTable of Contents \nRemaining Performance Obligations \n \nRPO represents deferred revenue and contractually stated or committed orders under early renewal and multi-year billing plans for subscription, services, license, and maintenance for which the associated deferred revenue has not yet been recognized. Unbilled deferred revenue is not included as a receivable or deferred revenue on our Consolidated Balance Sheets. See Part II, Item 8, Note 2, “Revenue Recognition” for more details on Autodesk's performance obligations. \n(in millions)\nJanuary 31, 2025\nJanuary 31, 2024\nDeferred revenue\n$\n4,128 \n$\n4,264 \nUnbilled deferred revenue\n2,810 \n1,844 \nRPO\n$\n6,938 \n$\n6,108 \n \nRPO consisted of the following:\n(in millions)\nJanuary 31, 2025\nJanuary 31, 2024\nCurrent RPO\n$\n4,457 \n$\n3,976 \nNon-current RPO\n2,481 \n2,132 \nRPO\n$\n6,938 \n$\n6,108 \nWe expect that the amount of RPO will change from quarter to quarter for several reasons, including the specific timing, duration, and size of customer subscription and support agreements, the specific timing of customer renewals, and foreign currency fluctuations. Historically, we have had increased EBA sales activity in our fourth fiscal quarter and this seasonality may affect the relative value of our billings, RPO, and cash collections in the fourth and first fiscal quarters. As customers transition from multi-year subscription contracts billed upfront to annual billing installments, some customers may choose annual contracts instead. If this were to occur, we would expect it to proportionately reduce the unbilled portion of our total remaining performance obligations and would expect it to impact total RPO growth rates negatively. Deferred revenue, billings, current RPO, revenue, Non-GAAP operating margin, and free cash flow would remain broadly unchanged in this scenario.\nBalance Sheet and Cash Flow Items\nAt January 31, 2025, we had $2.15 billion in cash, cash equivalents, and marketable securities. Our cash flow from operations increased to $1.61 billion for the fiscal year ended January 31, 2025, from $1.31 billion for the fiscal year ended January 31, 2024. We repurchased 3 million shares of our common stock for $858 million during fiscal 2025. Comparatively, we repurchased 4 million shares of our common stock for $795 million during fiscal 2024. Further discussion regarding the balance sheet and cash flow activities are discussed below under the heading “Liquidity and Capital Resources.” \n48\nTable of Contents \nRESULTS OF OPERATIONS\nOverview\nWe believe our investment in cloud products and a subscription business model, backed by a strong balance sheet, give us a robust foundation to successfully navigate complex geopolitical and global macro-economic challenges. However, material scarcity, supply chain disruption and resulting inflationary pressures, higher interest rates, a global labor shortage, ongoing geopolitical conflicts, and foreign exchange rate fluctuations, may impact our outlook. We also expect our transition to annual billings for multi-year contracts to impact the timing of our billings and cash collections. The extent of the impact of these risks on our business in fiscal 2026 and beyond will depend on several factors, some of which are out of our control. Further discussion of the potential impacts of these risks on our business can be found in Part I,",
    "item1a": "Item 1A,“Risk Factors.”  Based on our current business plan and revenue prospects, we believe that our existing cash and cash equivalents, our anticipated cash flows from operations, and our available revolving credit facility will be sufficient to meet our working capital and operating resource expenditure requirements for at least the next 12 months from the date of this Annual Report.\nOur revenue, earnings, cash flows, receivables, and payables are subject to fluctuations due to changes in foreign currency exchange rates, for which we have put in place foreign currency contracts as part of our risk management strategy. See Part II, Item 7A, “Quantitative and Qualitative Disclosures about Market Risk” for further discussion.\nFiscal year ended January 31,\n(in millions)\n2025\n2024\n2023\nNet cash provided by operating activities\n$\n1,607 \n$\n1,313 \n$\n2,071 \nNet cash used in investing activities\n(903)\n(502)\n(143)\nNet cash used in financing activities\n(987)\n(852)\n(1,487)\nNet cash provided by operating activities of $1.61 billion for fiscal 2025, primarily consisted of $1.11 billion of our net income adjusted for $953 million non-cash items such as stock-based compensation expense, amortization of costs to obtain a contract with a customer, depreciation, amortization, and accretion expense, and deferred income tax. Net cash provided by working capital remained flat primarily due to an increase in accounts payable and other accrued liabilities due to the timing of payments related to employee compensation and related costs partially offset by a decrease in deferred revenue driven by the transition of  multi-year subscription contracts billed upfront to annual billing installments, a change in accounts receivable due to the growth in billings and more billings in the fourth fiscal quarter of the current year  as compared to the prior period, and a change in prepaid expenses and other assets.\nNet cash provided by operating activities of $1.31 billion for fiscal 2024, primarily consisted of $906 million of our net income adjusted for $858 million non-cash items such as stock-based compensation expense, amortization of costs to obtain a contract with a customer, depreciation, amortization, and accretion expense, and deferred income tax. The decrease in cash provided by working capital was primarily due to a decrease in deferred revenue of $316 million driven by the transition of multi-year subscription contracts billed upfront to annual billing installments.\nNet cash used in investing activities was $903 million for fiscal 2025 and was primarily due to business combinations, net of cash acquired, and purchases of marketable securities partially offset by sales and maturities of marketable securities.  \nNet cash used in investing activities was $502 million for fiscal 2024 and was primarily due to purchases of marketable securities partially offset by sales and maturities of marketable securities.\nNet cash used in financing activities was $987 million in fiscal 2025 and was primarily due to repurchases of our common stock.\nNet cash used in financing activities was $852 million in fiscal 2024 and was primarily due to repurchases of our common stock.\n63\nTable of Contents \nCONTRACTUAL OBLIGATIONS\nThe following table summarizes our significant financial contractual obligations at January 31, 2025, and the effect such obligations are expected to have on our liquidity and cash flows in future periods.\n(in millions)\nTotal\nFiscal year 2026\nFiscal years 2027-2028\nFiscal years 2029-2030\nThereafter\nManagement Comments\nNotes payable\n$\n2,583 \n$\n361 \n$\n601 \n$\n576 \n$\n1,045 \nNotes payable consist of the notes issued in June 2015, June 2017, January 2020, and October 2021 including interest. See Part II, Item 8, Note 8, “Borrowing Arrangements,” in the Notes to Consolidated Financial Statements for further discussion.\nOperating leases \n295 \n65 \n108 \n68 \n54 \nOperating lease obligations consist primarily of obligations for real estate, vehicles, and certain equipment. See Part II, Item 8, Note 9, “Leases,” in the Notes to Consolidated Financial Statements for further discussion.\nPurchase obligations\n843 \n289 \n422 \n125 \n7 \nPurchase obligations are contractual obligations for purchase of goods or services and are defined as agreements that are enforceable and legally binding to Autodesk and that specify all significant terms, including: fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the transaction. Purchase obligations relate primarily to acquisition of cloud services,  marketing and commitments related to our investment agreements with limited liability partnership funds.\nDeferred compensation obligations\n118 \n12 \n22 \n23 \n61 \nDeferred compensation obligations relate to amounts held in a rabbi trust under our non-qualified deferred compensation plan. See Part II, Item 8, Note 7, “Deferred Compensation,” in our Notes to Consolidated Financial Statements for further information regarding this plan.\nPension obligations\n40 \n4 \n7 \n8 \n21 \nPension obligations relate to our obligations for pension plans outside of the United States. See Part II, Item 8, Note 16, “Retirement Benefit Plans,” in our Notes to Consolidated Financial Statements for further information regarding these obligations.\nAsset retirement obligations\n11 \n4 \n3 \n1 \n3 \nAsset retirement obligations represent the estimated costs to bring certain office buildings that we lease back to their original condition after the termination of the lease.\nTotal (1)\n$\n3,890 \n$\n735 \n$\n1,163 \n$\n801 \n$\n1,191 \n____________________ \n(1)\nThis table generally excludes amounts already recorded on the balance sheet as current liabilities, certain purchase obligations as discussed below, long term deferred revenue, and amounts related to income tax accruals for uncertain tax positions, since we cannot predict with reasonable reliability the timing of cash settlements to the respective taxing authorities (see Part II, Item 8, Note 5, “Income Taxes” in the Notes to Consolidated Financial Statements).\nPurchase orders or contracts for the purchase of supplies and other goods and services are not included in the table above. We are not able to determine the aggregate amount of such purchase orders that represent contractual obligations, as purchase orders may represent authorizations to purchase rather than binding agreements. Our purchase orders are based on our current procurement or development needs and are fulfilled by our vendors within short time horizons. We do not have significant agreements for the purchase of supplies or other goods specifying minimum quantities or set prices that exceed our expected requirements for three months. In addition, we have certain software royalty commitments associated with the shipment and licensing of certain products. \nThe expected timing of payment of the obligations discussed above is estimated based on current information. Timing of payments and actual amounts paid may be different depending on the time of receipt of goods or services or changes to agreed-upon amounts for some obligations.\n64\nTable of Contents \nWe provide indemnifications of varying scopes and certain guarantees, including limited product warranties. Historically, costs related to these warranties and indemnifications have not been significant, but because potential future costs are highly variable, we are unable to estimate the maximum potential impact of these guarantees on our future results of operations.\nISSUER PURCHASES OF EQUITY SECURITIES\nOur stock repurchase programs provide us with the ability to offset the dilution from the issuance of stock under our employee stock plans and reduce shares outstanding over time and has the effect of returning excess cash generated from our business to stockholders. Under the share repurchase programs, we may repurchase shares from time to time in open market transactions, privately negotiated transactions, accelerated share repurchase programs, tender offers, or by other means. The share repurchase programs do not have an expiration date and the pace and timing of repurchases will depend on factors such as cash generation from operations, available surplus, the volume of employee stock plan activity, remaining shares available in the authorized pool, cash requirements for acquisitions, economic and market conditions, stock price, and legal and regulatory requirements.\nIn November 2024, our Board of Directors authorized the repurchase of $5 billion of our common stock, in addition to the $3.88 billion remaining under previously announced share repurchase programs.\nDuring the three and 12 months ended January 31, 2025, we repurchased 1 million and 3 million shares of our common stock, respectively. At January 31, 2025, $3.88 billion and $5 billion remained available for repurchase under the November 2022 and November 2024 repurchase programs approved by the Board of Directors. The plans do not have a fixed expiration dat\ne. \n See Part II, Item 8, Note 12, “Stock Repurchase Program,” in the Notes to Consolidated Financial Statements for further discussion.\n65\nTable of Contents \nITEM 7A. \nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nFOREIGN CURRENCY EXCHANGE RISK\nOur revenue, earnings, cash flows, receivables, and payables are subject to fluctuations due to changes in foreign currency exchange rates. Our risk management strategy utilizes foreign currency contracts to manage our exposure to foreign currency volatility that exists as part of our ongoing business operations. We utilize cash flow hedge contracts to reduce the exchange rate impact on a portion of the net revenue or operating expense of certain anticipated transactions. In addition, we use balance sheet hedge contracts to reduce the exchange rate risk associated primarily with foreign currency denominated receivables and payables. As of January 31, 2025 and 2024, we had open cash flow and balance sheet hedge contracts with future settlements generally within one to 12 months. Contracts were primarily denominated in Euros, British pounds, Japanese yen, Canadian dollars, Singapore dollars, Australian dollars, Swiss francs, Norwegian krone, and Swedish Krona. We do not enter into foreign exchange derivative instruments for trading or speculative purposes. \nOur option and foreign exchange forward contracts outstanding as of the respective period-ends are summarized in U.S. dollar equivalents as follows (in millions):\nJanuary 31, 2025\nJanuary 31, 2024\nNotional Amount\nFair Value\nNotional Amount\nFair Value\nForward Contracts:\nPurchased \n$\n1,152 \n$\n(20)\n$\n1,430 \n$\n(5)\nSold\n1,894 \n8 \n1,789 \n11 \nOption Contracts:\nPurchased \n1,269 \n24 \n1,048 \n8 \nSold\n1,349 \n(5)\n1,118 \n(8)\nWe use foreign currency contracts to reduce the exchange rate impact on the net revenue and operating expenses of certain anticipated transactions. A sensitivity analysis performed on our hedging portfolio as of January 31, 2025, indicated that a hypothetical 10% appreciation of the U.S. dollar from its value at January 31, 2025 and 2024, would increase the fair value of our foreign currency contracts by $209 million and $121 million, respectively. A hypothetical 10% depreciation of the dollar from its value at January 31, 2025 and 2024, would decrease the fair value of our foreign currency contracts by $116 million and $99 million, respectively.\nINTEREST RATE RISK\nInterest rate movements affect both the interest income we earn on our short-term investments and the market value of certain longer term securities. At January 31, 2025, we had $1.32 billion of cash equivalents and marketable securities, including $287 million classified as short-term marketable securities and $267 million classified as long-term marketable securities. If interest rates were to move up by 50 or 100 basis points over a 12-month period, the market value change of these securities would not have a material impact on our results of operations. \nOTHER MARKET RISK\nFrom time to time we make direct investments in privately held companies. Privately held company investments generally are considered inherently risky. The technologies and products these companies have under development are typically in the early stages and may never materialize, which could result in a loss of all or a substantial part of our initial investment in these companies. The evaluation of privately held companies is based on information that we request from these companies, which is not subject to the same disclosure regulations as U.S. publicly traded companies, and as such, the basis for these evaluations is subject to the timing and accuracy of the data received from these companies. See Part II, Item 8, Note 3, “Financial Instruments” in the Notes to Consolidated Financial Statements for further discussion regarding these strategic investments.  \nFor information about exposure to counter-party credit-related losses, see Part II, Item 8, Note 1, “Business and Summary of Significant Accounting Policies - Concentration of Credit Risk.\"\n66\nTable of Contents \nITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAUTODESK, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In millions, except per share data)\n \n \nFiscal year ended January 31,\n2025\n2024\n2023\nNet revenue:\nSubscription\n$\n5,717\n \n$\n5,116\n \n$\n4,651\n \nMaintenance\n41\n \n54\n \n65\n \nTotal subscription and maintenance revenue\n5,758\n \n5,170\n \n4,716\n \nOther \n373\n \n327\n \n289\n \nTotal net revenue\n6,131\n \n5,497\n \n5,005\n \nCost of revenue:\nCost of subscription and maintenance revenue\n413\n \n381\n \n343\n \nCost of other revenue \n80\n \n82\n \n79\n \nAmortization of developed technologies\n85\n \n48\n \n58\n \nTotal cost of revenue\n578\n \n511\n \n480\n \nGross profit\n5,553\n \n4,986\n \n4,525\n \nOperating expenses:\nMarketing and sales\n2,000\n \n1,823\n \n1,745\n \nResearch and development\n1,485\n \n1,373\n \n1,219\n \nGeneral and administrative\n650\n \n620\n \n532\n \nAmortization of purchased intangibles\n49\n \n42\n \n40\n \nRestructuring, other exit costs, and facility reductions\n15\n \n—\n \n—\n \nTotal operating expenses\n4,199\n \n3,858\n \n3,536\n \nIncome from operations\n1,354\n \n1,128\n \n989\n \nInterest and other income (expense), net\n30\n \n8\n \n(\n43\n)\nIncome before income taxes\n1,384\n \n1,136\n \n946\n \nProvision for income taxes\n(\n272\n)\n(\n230\n)\n(\n123\n)\nNet income\n$\n1,112\n \n$\n906\n \n$\n823\n \nBasic net income per share\n$\n5.17\n \n$\n4.23\n \n$\n3.81\n \nDiluted net income per share\n$\n5.12\n \n$\n4.19\n \n$\n3.78\n \nWeighted average shares used in computing basic net income per share\n215\n \n214\n \n216\n \nWeighted average shares used in computing diluted net income per share\n217\n \n216\n \n218\n \nSee accompanying Notes to Consolidated Financial Statements.\n67\nTable of Contents \nAUTODESK, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \n(In millions)\nFiscal year ended January 31,\n2025\n2024\n2023\nNet income\n$\n1,112\n \n$\n906\n \n$\n823\n \nOther comprehensive (loss) income, net of reclassifications:\nNet gain (loss) on derivative instruments (net of tax effect of $\n2\n, $\n6\n, and $(\n7\n))\n1\n \n(\n41\n)\n40\n \nChange in net unrealized gain on available-for-sale securities (net of tax effect of \nzero\n for all periods presented)\n—\n \n2\n \n—\n \nChange in defined benefit pension items (net of tax effect of \nzero\n, $\n1\n, and $\n1\n)\n(\n1\n)\n(\n5\n)\n(\n3\n)\nNet change in cumulative foreign currency translation loss (net of tax effect of $(\n1\n), $\n4\n, and \nzero\n)\n(\n51\n)\n(\n5\n)\n(\n98\n)\nTotal other comprehensive loss\n(\n51\n)\n(\n49\n)\n(\n61\n)\nTotal comprehensive income \n$\n1,061\n \n$\n857\n \n$\n762\n \nSee accompanying Notes to Consolidated Financial Statements.\n68\nTable of Contents \nAUTODESK, INC.\nCONSOLIDATED BALANCE SHEETS\n(In millions, except per share data)\n \nJanuary 31,\n2025\nJanuary 31,\n2024\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n1,599\n \n$\n1,892\n \nMarketable securities\n287\n \n354\n \nAccounts receivable, net\n1,008\n \n876\n \nPrepaid expenses and other current assets\n588\n \n457\n \nTotal current assets\n3,482\n \n3,579\n \nLong-term marketable securities\n267\n \n234\n \nComputer equipment, software, furniture, and leasehold improvements, net\n117\n \n121\n \nOperating lease right-of-use assets\n169\n \n224\n \nIntangible assets, net\n574\n \n406\n \nGoodwill\n4,242\n \n3,653\n \nDeferred income taxes, net\n1,205\n \n1,093\n \nLong-term other assets\n777\n \n602\n \nTotal assets\n$\n10,833\n \n$\n9,912\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY \nCurrent liabilities:\nAccounts payable\n$\n242\n \n$\n100\n \nAccrued compensation\n506\n \n476\n \nAccrued income taxes\n62\n \n36\n \nDeferred revenue\n3,787\n \n3,500\n \nOperating lease liabilities\n58\n67\n \nCurrent portion of long-term notes payable, net\n300\n \n—\n \nOther accrued liabilities\n196\n \n172\n \nTotal current liabilities\n5,151\n \n4,351\n \nLong-term deferred revenue\n341\n \n764\n \nLong-term operating lease liabilities\n214\n \n275\n \nLong-term income taxes payable\n200\n \n168\n \nLong-term deferred income taxes\n32\n \n25\n \nLong-term notes payable, net\n1,987\n \n2,284\n \nLong-term other liabilities\n287\n \n190\n \nCommitments and contingencies\nStockholders’ equity:\nPreferred stock, $\n0.01\n par value; shares authorized \n2\n; \nnone\n issued or outstanding at January 31, 2025 and 2024\n—\n \n—\n \nCommon stock and additional paid-in capital, $\n0.01\n par value; shares authorized \n750\n; \n214\n issued and outstanding at January 31, 2025 and 2024\n4,239\n \n3,802\n \nAccumulated other comprehensive loss\n(\n285\n)\n(\n234\n)\nAccumulated deficit\n(\n1,333\n)\n(\n1,713\n)\nTotal stockholders’ equity \n2,621\n \n1,855\n \nTotal liabilities and stockholders' equity \n$\n10,833\n \n$\n9,912\n \nSee accompanying Notes to Consolidated Financial Statements.\n69\nTable of Contents \nAUTODESK, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n \nFiscal year ended January 31,\n \n2025\n2024\n2023\nOperating activities:\nNet income\n$\n1,112\n \n$\n906\n \n$\n823\n \nAdjustments to reconcile net income to net cash provided by operating activities: \nDepreciation, amortization, and accretion\n180\n \n139\n \n150\n \nStock-based compensation expense\n683\n \n703\n \n657\n \nAmortization of costs to obtain a contract with a customer\n212\n \n140\n \n138\n \nDeferred income taxes\n(\n121\n)\n(\n86\n)\n(\n277\n)\nLease-related asset impairments\n—\n \n14\n \n34\n \nRestructuring, other exit costs, and facility reductions\n15\n \n—\n \n—\n \n     Other operating activities\n(\n16\n)\n(\n52\n)\n(\n8\n)\nChanges in operating assets and liabilities, net of business combinations:\nAccounts receivable\n(\n132\n)\n86\n \n(\n247\n)\nPrepaid expenses and other assets \n(\n488\n)\n(\n256\n)\n(\n182\n)\nAccounts payable and other liabilities \n238\n \n27\n \n36\n \nDeferred revenue\n(\n134\n)\n(\n316\n)\n798\n \nAccrued income taxes\n58\n \n8\n \n149\n \nNet cash provided by operating activities\n1,607\n \n1,313\n \n2,071\n \nInvesting activities:\nPurchases of marketable securities\n(\n815\n)\n(\n1,110\n)\n(\n397\n)\nSales of marketable securities\n223\n \n277\n \n152\n \nMaturities of marketable securities\n638\n \n487\n \n298\n \nPurchases of intangible assets \n(\n62\n)\n(\n30\n)\n(\n6\n)\nBusiness combinations, net of cash acquired\n(\n825\n)\n(\n70\n)\n(\n96\n)\nCapital expenditures\n(\n40\n)\n(\n31\n)\n(\n40\n)\nOther investing activities\n(\n22\n)\n(\n25\n)\n(\n54\n)\nNet cash used in investing activities\n(\n903\n)\n(\n502\n)\n(\n143\n)\nFinancing activities:\nProceeds from issuance of common stock, net of issuance costs\n121\n \n130\n \n124\n \nTaxes paid related to net share settlement of equity awards\n(\n256\n)\n(\n187\n)\n(\n160\n)\nRepurchase and retirement of common stock\n(\n852\n)\n(\n795\n)\n(\n1,101\n)\nRepayments of debt\n—\n \n—\n \n(\n350\n)\nNet cash used in financing activities\n(\n987\n)\n(\n852\n)\n(\n1,487\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n10\n)\n(\n14\n)\n(\n22\n)\nNet (decrease) increase in cash and cash equivalents\n(\n293\n)\n(\n55\n)\n419\n \nCash and cash equivalents at beginning of fiscal year\n1,892\n \n1,947\n \n1,528\n \nCash and cash equivalents at end of fiscal year\n$\n1,599\n \n$\n1,892\n \n$\n1,947\n \nSupplemental cash flow disclosure:\nCash paid for interest\n$\n69\n \n$\n69\n \n$\n86\n \nCash paid for income taxes, net of tax refunds\n$\n281\n \n$\n321\n \n$\n241\n \nNon-cash investing and financing activities:\nFair value of common stock issued to settle liability-classified restricted stock units\n$\n4\n \n$\n15\n \n$\n11\n \nFair value of common stock issued related to business combination (See Note 6)\n$\n—\n \n$\n—\n \n$\n10\n \nSee accompanying Notes to Consolidated Financial Statements.\n70\nTable of Contents \nAUTODESK, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(In millions)\n \nCommon stock and additional paid-in capital\nAccumulated other comprehensive loss\nAccumulated deficit\nTotal stockholders'  equity\nShares\nAmount\nBalances, January 31, 2022\n218\n \n$\n2,923\n \n$\n(\n124\n)\n$\n(\n1,950\n)\n$\n849\n \nCommon shares issued under stock plans\n2\n \n(\n38\n)\n— \n— \n(\n38\n)\nStock-based compensation expense\n— \n633\n \n— \n— \n633\n \nSettlement of liability-classified restricted common shares\n— \n11\n \n— \n— \n11\n \nNet income\n— \n— \n— \n823\n \n823\n \nOther comprehensive loss\n— \n— \n(\n61\n)\n— \n(\n61\n)\nShares issued as consideration for business combination\n— \n10\n \n— \n— \n10\n \nRepurchase and retirement of common shares\n(\n5\n)\n(\n214\n)\n— \n(\n868\n)\n(\n1,082\n)\nBalances, January 31, 2023\n215\n \n3,325\n \n(\n185\n)\n(\n1,995\n)\n1,145\n \nCommon shares issued under stock plans\n3\n \n(\n60\n)\n— \n— \n(\n60\n)\nStock-based compensation expense\n— \n693\n \n— \n— \n693\n \nSettlement of liability-classified restricted common shares\n— \n15\n \n— \n— \n15\n \nNet income \n— \n— \n— \n906\n \n906\n \nOther comprehensive loss\n— \n— \n(\n49\n)\n— \n(\n49\n)\nRepurchase and retirement of common shares\n(\n4\n)\n(\n171\n)\n— \n(\n624\n)\n(\n795\n)\nBalances, January 31, 2024\n214\n \n3,802\n \n(\n234\n)\n(\n1,713\n)\n1,855\n \nCommon shares issued under stock plans\n3\n \n(\n135\n)\n— \n— \n(\n135\n)\nStock-based compensation expense\n— \n694\n \n— \n— \n694\n \nSettlement of liability-classified restricted common shares\n— \n4\n \n— \n— \n4\n \nNet income\n— \n— \n— \n1,112\n \n1,112\n \nOther comprehensive loss\n— \n— \n(\n51\n)\n— \n(\n51\n)\nRepurchase and retirement of common shares\n(\n3\n)\n(\n126\n)\n— \n(\n732\n)\n(\n858\n)\nBalances, January 31, 2025\n214\n \n$\n4,239\n \n$\n(\n285\n)\n$\n(\n1,333\n)\n$\n2,621\n \nSee accompanying Notes to Consolidated Financial Statements.\n71\nTable of Contents \nAUTODESK, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJanuary 31, 2025 \n(Tables in millions of dollars, except per share data, unless otherwise indicated)\n1.     \nBusiness and Summary of Significant Accounting Policies\n \nBusiness\nAutodesk, Inc. (“Autodesk” or the “Company”) is a global leader in 3D design, engineering and entertainment technology solutions, spanning architecture, engineering, construction, product design, manufacturing, media, and entertainment. The Company’s sophisticated software products, offered through a hybrid of desktop and cloud functionality, enable its customers to design, fabricate, manufacture, and build anything by visualizing, simulating, and analyzing real-world performance early in the design process. These capabilities allow our customers to foster innovation, optimize their designs, streamline their manufacturing and construction processes, save time and money, improve quality, deliver more sustainable outcomes, communicate plans, and collaborate with others. Autodesk software products are sold globally through a combination of direct and indirect channels. \nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of Autodesk and its wholly owned subsidiaries. All intercompany accounts and transactions have been eliminated.\n \nUse of Estimates\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the amounts reported in Autodesk’s consolidated financial statements and notes thereto. These estimates are based on information available as of the date of the consolidated financial statements. On a regular basis, management evaluates these estimates and assumptions. Actual results may differ materially from these estimates.  \nExamples of significant estimates and assumptions made by management involve revenue recognition for product subscriptions and enterprise business arrangements (“EBAs”), the determination of the fair value of acquired intangible assets and goodwill, the realizability of deferred tax assets, and the fair value of stock awards. The Company also makes assumptions, judgments, and estimates in determining the accruals for uncertain tax positions, variable compensation, partner incentive programs, loss contingencies, and operating lease liabilities.\n  \nChange in presentation\nDuring the fiscal year ended January 31, 2025, the Company changed its presentation of the amortization of costs capitalized to obtain a contract with a customer in our Consolidated Statements of Cash Flows. Amortization of costs capitalized to obtain a contract with a customer were previously presented in “Changes in operating assets and liabilities, net of business combinations” and are now presented in “Adjustments to reconcile net income to net cash provided by operating activities.” Accordingly, prior period amounts have been reclassified to conform to the current period presentation. The effect of the change on the Consolidated Statement of Cash Flows for the fiscal years ended January 31, 2024 and January 31, 2023 was $\n140\n million and $\n138\n million, respectively. These reclassifications did not impact total net cash provided by operating activities.\n \n72\nTable of Contents \nSegments\nAutodesk operates in \none\n operating and reportable segment, the Company as a whole. Autodesk is a global leader in 3D design, engineering and entertainment technology solutions, spanning architecture, engineering, construction, product design, manufacturing, media, and entertainment. Autodesk’s software products are offered through a hybrid of desktop and cloud functionality. The chief operating decision maker (“CODM”) assesses performance and decides how to allocate resources based on consolidated net income as reported on the Consolidated Statements of Operations. Operating segments are defined as components of an enterprise for which separate financial information is evaluated regularly by the CODM in deciding how to allocate resources and assess performance. Autodesk reports segment information based on the “management” approach. The management approach designates the internal reporting used by management for making decisions, allocating resources, and assessing performance as the source of the Company’s reportable segments. The description of Autodesk’s products and offerings and accounting policies are described in  Note 1, “Business and Summary of Significant Accounting Policies”.  The measure of Autodesk’s segment assets is reported on the Consolidated Balance Sheets as total assets. Autodesk determined that the Company’s Chief Executive Officer, serves as the CODM. \n \nThe CODM reviews financial information presented on a consolidated basis for purposes of allocating resources, evaluating financial performance, and making operating decisions of Autodesk. Consolidated net income is indicative of financial performance and is monitored by the CODM. The CODM considers budget to actual comparisons of total net revenue and consolidated net income on a regular basis when assessing the operating results and making resource decisions to improve profitability. The CODM also uses the budget to actual comparisons of total net revenue and consolidated net income to make decisions aligned with Autodesk’s strategic initiatives and go-to market strategies and capital allocation priorities.\nThe following table presents information about Autodesk’s reported segment total net revenue, segment profit, and significant segment expenses:\nFiscal Year ended January 31,\n2025\n2024\n2023\nTotal net revenue\n$\n6,131\n \n$\n5,497\n \n$\n5,005\n \nLess (1):\nCost of subscription and maintenance revenue (2)\n376\n \n344\n \n309\n \nCost of other revenue (2)\n67\n \n68\n \n67\n \nAmortization of developed technologies\n85\n \n48\n \n58\n \nMarketing and sales (2)\n1,670\n \n1,548\n \n1,477\n \nResearch and development (2)\n1,181\n \n1,065\n \n953\n \nGeneral and administrative (2)\n541\n \n524\n \n443\n \nAmortization of purchased intangibles\n49\n \n42\n \n40\n \nRestructuring, other exit costs, and facility reductions\n15\n \n—\n \n—\n \nNew transaction model (3)\n107\n \n27\n \n9\n \nStock-based compensation \n686\n \n703\n \n660\n \nInterest and other (income) expense, net\n(\n30\n)\n(\n8\n)\n43\n \nProvision for income taxes\n272\n \n230\n \n123\n \nConsolidated net income\n$\n1,112\n \n$\n906\n \n$\n823\n \n____________________\n(1)\nSignificant expense categories and amounts align with the segment-level information that is regularly provided to the CODM. \n(2)\nThe amounts of new transaction model and stock-based compensation are excluded from this line and presented separately within this table. \n(3)\nNew transaction model costs include sales incentives to solution providers, transaction fees, and internal operating costs.\n73\nTable of Contents \nThe following table presents information about Autodesk’s other segment disclosures: \nFiscal Year ended January 31,\n2025\n2024\n2023\nInterest income\n$\n85\n \n$\n91\n \n$\n21\n \nInterest expense\n71\n \n71\n \n83\n \nDepreciation, amortization, and accretion expense \n180\n \n139\n \n150\n \nAmortization of costs to obtain a contract with a customer\n212\n \n140\n \n138\n \nOther significant non-cash items include stock-based compensation. See disclosure in table above.\nInformation regarding Autodesk's long-lived assets by geographic area were as follows:\n \nJanuary 31,\n \n2025\n2024\nLong-lived assets (1):\nAmericas\nU.S.\n$\n170\n \n$\n221\n \nOther Americas \n13\n \n15\n \nTotal Americas\n183\n \n236\n \nEurope, Middle East, and Africa\n64\n \n63\n \nAsia Pacific\n39\n \n46\n \nTotal long-lived assets\n$\n286\n \n$\n345\n \n____________________\n(1)\nLong-lived assets exclude deferred tax assets, marketable securities, goodwill, and intangible assets\n.\n \nRevenue Recognition\nAutodesk’s revenue is divided into \nthree\n categories: subscription revenue, maintenance revenue, and other revenue.  Subscription revenue consists of our term-based product subscriptions, cloud service offerings, and flexible enterprise business agreements (“EBAs”).  Maintenance revenue consists of renewal fees for existing maintenance plan agreements that were initially purchased with a perpetual software license. Under our maintenance plan, customers are eligible to receive unspecified upgrades, when and if available, and technical support. Other revenue consists of revenue from consulting and other products and services. Revenue is recognized when control for these offerings is transferred to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for products and services.\nAutodesk’s contracts with customers may include promises to transfer multiple products and services to a customer. Determining whether the products and services are considered distinct performance obligations that should be accounted for separately or as a single performance obligation may require significant judgment. Judgment is required to determine the level of integration and interdependency between individual components of desktop software applications and cloud functionalities. This determination influences whether the desktop software is considered distinct and accounted for separately as a license performance obligation recognized at the time of delivery, or not distinct and accounted for together with the cloud functionalities as a single subscription performance obligation recognized over time.\nFor product subscriptions and flexible EBA subscriptions in which the desktop software and related cloud functionalities are highly interrelated, the single performance obligation is recognized ratably over the contract term as the subscription is delivered. For subscriptions involving distinct desktop software licenses, the license performance obligation is satisfied when delivered to our customers. For standalone maintenance subscriptions and cloud subscriptions, the performance obligation is satisfied ratably over the contract term as those services are delivered. For consulting services, the performance obligation is satisfied over a period of time as those services are delivered.\nWhen an arrangement includes multiple performance obligations which are concurrently delivered and have the same pattern of transfer to the customer (the services transfer to the customer over the contract period), we account for those performance obligations as a single performance obligation.\n74\nTable of Contents \nFor contracts with more than one performance obligation, the transaction price is allocated among the performance obligations in an amount that depicts the relative standalone selling price (“SSP”) of each obligation. We establish SSP for most of our products and services based on observable prices when sold separately in similar circumstances or to similar customers. When products or services are not sold separately, we establish SSP based on other observable inputs.\nOur indirect channel model includes both a two-tiered distribution structure, where Autodesk sells to distributors that subsequently sell to resellers, and a one-tiered structure where Autodesk sells directly to resellers. For these arrangements, transfer of control begins at the time access to our subscriptions is made available electronically to our customer, provided all other criteria for revenue recognition are met. Judgment is required to determine whether our distributors and resellers have the ability to honor their commitment to pay, regardless of whether they collect payment from their customers. If we were to change this assessment, it could cause a material increase or decrease in the amount of revenue that we report in a particular period.\nCosts to Obtain a Contract with a Customer\nSales commissions earned by our internal sales personnel and our solution providers are considered incremental and recoverable costs of obtaining a contract with a customer. The commission costs are capitalized and included in “Prepaid expenses and other current assets” and “Long-term other assets” on our Consolidated Balance Sheets. The deferred costs are then amortized over the period of benefit. Autodesk determined that sales commissions earned by internal sales personnel that are related to contract renewals are commensurate with sales commissions earned on the initial contracts, and we determined the period of benefit to be the term of the respective customer contract. Commissions paid to our solution providers that are related to contract renewals may either be commensurate or non-commensurate with commissions earned on the initial contract, depending on the commissions program. Costs for initial contracts that are non-commensurate with commissions on renewal contracts are amortized on a straight-line basis over the period of benefit. For non-commensurate commissions, we determined the estimated period of benefit by taking into consideration customer retention data, customer contracts, our technology, and other factors. Costs for initial contracts that are commensurate with commissions on renewal contracts are amortized based on the contract term, which ranges from \n1\n to \n3\n years. Deferred costs are periodically reviewed for impairment. Amortization expense is included in marketing and sales expenses in the Consolidated Statements of Operations.\nFair Value Measurement \nFair value is defined as the price that would be received from the sale of an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. In determining the fair value of our investments, we are sometimes required to use various alternative valuation techniques. Inputs to valuation techniques are either observable or unobservable. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect our market assumptions. These two types of inputs have created the following fair value hierarchy:\nLevel 1 - Quoted prices for identical instruments in active markets;\nLevel 2 - Quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets; and\nLevel 3 - Unobservable inputs for which there is little or no market data, which require Autodesk to develop its own assumptions.\nThis hierarchy requires us to minimize the use of unobservable inputs and to use observable market data, if available, when determining fair value. This is generally true for our cash and cash equivalents and the majority of our marketable securities, which we consider to be Level 1 and Level 2 assets. \nKey inputs for currency derivatives are spot rates, forward rates, interest rates, volatility, and credit default rates. The spot rate for each currency is the same spot rate used for all balance sheet translations at the measurement date. Autodesk reviews for any potential changes on a quarterly basis, in conjunction with our fiscal quarter-end close. It is Autodesk’s assessment that the leveling best reflects current market activity when observing the pricing information for these assets. Autodesk’s Level 2 securities and derivatives are valued primarily using observable inputs other than quoted prices in active markets for identical assets and liabilities. The Company has elected to use the income approach to value derivatives using the observable Level 2 \n75\nTable of Contents \nmarket expectations at measurement date and standard valuation techniques to convert future amounts to a single present amount (discounted). Mid-market pricing is used as a practical expedient and when required, rates are interpolated from commonly quoted intervals published by market sources. See Note 3, “Financial Instruments” for more information.\nCash and Cash Equivalents\nAutodesk considers all highly liquid investments with insignificant interest rate risk and remaining maturities of three months or less at the date of purchase to be cash equivalents. Cash equivalents are stated at estimated fair value.\nMarketable Securities and Strategic Investments\nAutodesk classifies its marketable securities as either short-term or long-term generally based on each instrument’s underlying contractual maturity date. Generally, marketable securities with remaining maturities of less than 12 months are classified as short-term and marketable securities with remaining maturities greater than 12 months are classified as long-term. Autodesk may sell certain of its marketable securities prior to their stated maturities for strategic purposes or in anticipation of credit deterioration. \nMarketable securities are stated at fair value. Marketable securities maturing within one year that are not restricted are classified as current assets. \nAutodesk determines the appropriate classification of its marketable securities at the time of purchase and re-evaluates such classification as of each balance sheet date. Autodesk carries all “available-for-sale securities” at fair value, with unrealized gains and losses, net of tax, reported in stockholders’ equity until disposition or maturity. Autodesk carries all “trading securities” at fair value, with unrealized gains and losses, recorded in “Interest and other expense, net” in the Company’s Consolidated Statements of Operations. The cost of securities sold is based on the specific-identification method.\nThe company's strategic investments consist of privately held debt and equity securities.  \nUnder the measurement alternative method, strategic investments in equity securities are measured at cost, less any impairments, plus or minus changes resulting from observable price changes in orderly transactions for the identical or similar investment of the same issuer in the current period. The carrying value is not adjusted for the Company’s strategic investments in equity securities if there are no observable price changes in a same or similar security from the same issuer or if there are no identified events or changes in circumstances that may indicate impairment, as discussed below. To determine if a transaction is deemed a similar investment, Autodesk considers the rights and obligations between the investments and the extent to which those differences would affect the fair values of those investments with additional consideration for the stage of development of the investee company. The fair value would then be adjusted positively or negatively based on available information such as pricing in recent rounds of financing.  \nThe company’s strategic investments in debt and equity securities (Level 3) are valued using significant unobservable inputs or data in an inactive market and the valuation requires the Company’s judgment due to the absence of market prices and inherent lack of liquidity. These assumptions are inherently subjective and involve significant management judgment. Whenever possible, we use observable market data and rely on unobservable inputs only when observable market data is not available, when determining fair value. \nIn determining the estimated fair value of its strategic investments, the Company utilizes the most recent data available to the Company. In addition, the determination of whether an orderly transaction is for a same or similar investment requires significant management judgment including: the rights and obligations of the investments, the extent to which those differences would affect the fair values of those investments, and the impact of any differences based on the stage of operational development of the investee.\nAll of Autodesk’s marketable securities and strategic investments are subject to a periodic impairment review. Strategic investments in equity securities are assessed based on available information such as current cash positions, earnings, earnings and cash flow forecasts, recent operational performance and any other readily available market data. For any available-for-sale debt securities, if Autodesk does not intend to sell and it is not more likely than not that Autodesk will be required to sell the available-for-sale debt security prior to recovery of its amortized cost basis, Autodesk will determine whether a decline in fair value below the amortized cost basis is due to credit-related factors. The credit loss is measured as the amount by which the debt security’s amortized cost basis exceeds the estimate of the present value of cash flows expected to be collected, up to the \n76\nTable of Contents \ndifference between the amortized cost basis and the fair value. Impairment will be assessed at the individual security level. Credit-related impairment is recognized as an allowance on the Consolidated Balance Sheets with a corresponding adjustment to “Interest and other expense, net” on the Company’s Consolidated Statements of Operations. Any impairment that is not credit-related is recognized in “Accumulated other comprehensive loss” on the Consolidated Balance Sheets.\nAutodesk does not measure an allowance for credit losses on accrued interest receivables on available-for-sale debt securities separately. Autodesk writes off accrued interest receivables by reversing interest income in the period deemed uncollectible in “Interest and other expense, net” on the Company’s Consolidated Statements of Operations. Any accrued interest receivable on available-for-sale debt securities is recorded in “Prepaid expenses and other current assets,” in the accompanying Consolidated Balance Sheets, as applicable.\nFor Autodesk’s quarterly impairment assessment of privately held debt and equity securities strategic investment portfolio, the analysis encompasses an assessment of the severity and duration of the impairment and qualitative and quantitative analysis of other key factors including: the investee’s financial metrics, the investee’s products and technologies meeting or exceeding predefined milestones, market acceptance of the product or technology, other competitive products or technology in the market, general market conditions, management and governance structure of the investee, the investee’s liquidity, debt ratios, and the rate at which the investee is using its cash.\n \n For additional information, see “Concentration of Credit Risk” within this Note 1, “Business and Summary of Significant Accounting Policies” and Note 3, “Financial Instruments.”\nDerivative Financial Instruments\nUnder its risk management strategy, Autodesk uses derivative instruments to manage its short-term exposures to fluctuations in foreign currency exchange rates that exist as part of ongoing business operations. Autodesk’s general practice is to hedge a portion of transaction exposures primarily denominated in Australian dollars, British pounds, Canadian dollars, Euros, Japanese yen, Norwegian krone, Singapore dollars, Swedish krona, and Swiss francs. These instruments generally have maturities between \none\n and \n12\n months in the future. Autodesk uses foreign currency contracts not designated as hedging instruments and foreign currency contracts designated as cash flow hedges but Autodesk does not enter into derivative instrument transactions for trading or speculative purposes. \nThe bank counterparties to the derivative contracts potentially expose Autodesk to credit-related losses in the event of their nonperformance. However, to mitigate that risk, Autodesk only contracts with counterparties who meet the Company’s minimum requirements under its counterparty risk assessment process. Autodesk monitors counterparty risk on at least a quarterly basis and will adjust its exposure to various counterparties as necessary. Autodesk generally enters into master netting arrangements, which reduce credit risk by permitting net settlement of transactions with the same counterparty. Autodesk does not have any master netting arrangements in place with collateral features.\nAutodesk accounts for these derivative instruments as either assets or liabilities on the balance sheet and carries them at fair value. Gains and losses resulting from changes in fair value are accounted for depending on the use of the derivative and whether it is designated and qualifies for hedge accounting. Derivatives that do not qualify for hedge accounting are adjusted to fair value through earnings.\nIn addition to these foreign currency contracts, Autodesk holds derivative instruments issued by privately held companies, which are not designated as hedging instruments. These derivatives consist of certain conversion options on the convertible debt securities held by Autodesk or options to acquire equity securities in a privately held company. These derivatives are recorded at fair value as of each balance sheet date and are recorded in “Long-term other assets.” Changes in the fair values of these instruments are recognized in “\nInterest and other income (expense), net\n.”\nForeign Currency Translation and Transactions\nThe assets and liabilities of Autodesk’s foreign subsidiaries are translated from their respective functional currencies into U.S. dollars at the rates in effect at the balance sheet date, and revenue and expense amounts are translated at exchange rates that approximate those rates in effect during the period in which the underlying transactions occur. Foreign currency translation adjustments are recorded in other comprehensive income (loss).\n77\nTable of Contents \nGains and losses realized from foreign currency transactions, those transactions denominated in currencies other than the foreign subsidiary’s functional currency, are included in “\nInterest and other income (expense), net\n.” Monetary assets and liabilities are remeasured using foreign currency exchange rates at the end of the period, and non-monetary assets and liabilities are remeasured based on historical exchange rates.\nForeign Currency Contracts Designated as Cash Flow Hedges \nAutodesk uses foreign currency contracts to reduce the exchange rate impact on a portion of the net revenue or operating expense of certain anticipated transactions. These currency collars and forward contracts are designated and documented as cash flow hedges. The effectiveness of the cash flow hedge contracts is assessed quantitatively using regression at inception and thereafter. To receive cash flow hedge accounting treatment, all hedging relationships are formally documented at the inception of the hedge relationship and the hedges are expected to be highly effective in offsetting changes to future cash flows on hedged transactions. The gains and losses on these hedges are included in “Accumulated other comprehensive loss” and are reclassified into earnings at the time the forecasted revenue or expense is recognized. In the event the underlying forecasted transaction does not occur, or it becomes probable that it will not occur, Autodesk reclassifies and discloses the gain or loss on the related cash flow hedge from “Accumulated other comprehensive loss” to “\nInterest and other income (expense), net\n” in the Company’s Consolidated Financial Statements at that time. Derivative contracts and related gain (loss) are presented within “Net cash provided by operating activities” in the Company’s Consolidated Statements of Cash Flow. See Note 3, “Financial Instruments” for additional information.\nDerivatives Not Designated as Hedging Instruments\nAutodesk uses foreign currency contracts that are not designated as hedging instruments to reduce the exchange rate risk associated primarily with foreign currency denominated receivables, payables, and cash. These forward contracts are marked-to-market at the end of each fiscal quarter with gains and losses recognized as “\nInterest and other income (expense), net\n.” These derivative instruments do not subject the Company to material balance sheet risk due to exchange rate movements because gains and losses on these derivative instruments are intended to offset the gains or losses resulting from the revaluation and settlement of the underlying foreign currency denominated receivables, payables, and cash.\n \nAccounts Receivable, Net\nAccounts receivable, net, consisted of the following as of January 31:\n2025\n2024\nTrade accounts receivable\n$\n1,086\n \n$\n979\n \nLess: Allowance for credit losses\n(\n3\n)\n(\n4\n)\nProduct returns reserve\n(\n8\n)\n(\n1\n)\nPartner programs and other obligations\n(\n67\n)\n(\n98\n)\nAccounts receivable, net \n$\n1,008\n \n$\n876\n \nAllowances for uncollectible trade receivables and contract assets are subject to impairment using the expected credit loss model. Allowances for expected credit losses are measured based upon the lifetime expected credit loss which is based on historical experience, the number of days that billings are past due, reasonable economic forecast, including revised forecast data for the current economic environment, customer payment behavior, credit reports, and other customer-specific information.   Allowances for credit losses on trade receivables and contract assets were not material as of January 31, 2025.\nAs part of the indirect channel model, Autodesk has a partner incentive program that uses quarterly attainment of monetary rewards to motivate distributors and resellers to achieve mutually agreed upon business goals in a specified time period. The majority of these incentives are recorded as a reduction to accounts receivable and deferred revenue in the period the transaction is billed. The portion recorded as deferred revenue is subsequently recognized as a reduction to subscription revenue over the contract period. The remainder reduces subscription or other revenue in the current period.\nThese incentive balances do not require significant assumptions or judgments. Depending on how the payments are made, the reserves associated with the partner incentive program are recognized on the balance sheet as either a reduction to accounts receivable or recorded as accounts payable.\n78\nTable of Contents \nConcentration of Credit Risk\nAutodesk places its cash, cash equivalents, and marketable securities in highly liquid instruments with, and in the custody of, multiple diversified financial institutions globally with high credit ratings and limits the amounts invested with any one institution, type of security, and issuer. Autodesk’s primary commercial banking relationship is with Citigroup Inc. and its global affiliates. Citibank, N.A., an affiliate of Citigroup, is one of the lead lenders and an agent in the syndicate of Autodesk’s $\n1.5\n billion revolving credit facility.\nThe bank counterparties to the derivative contracts potentially expose Autodesk to credit-related losses in the event of their nonperformance. However, to mitigate that risk, Autodesk only contracts with counterparties who meet the Company's minimum requirements under its counterparty risk assessment process. Autodesk monitors counterparty risk on at least a quarterly basis and will adjust its exposure to various counterparties as necessary. Autodesk generally enters into master netting arrangements, which reduce credit risk by permitting net settlement of transactions with the same counterparty. However, Autodesk does not have any master netting arrangements in place with collateral features.\nAutodesk’s accounts receivable are derived from sales to a large number of resellers, distributors, and direct customers in the Americas, Europe, Middle East and Africa (“EMEA”), and Asia Pacific (“APAC”) geographies. Autodesk performs ongoing evaluations of these partners’ and customers’ financial condition and limits the amount of credit extended when deemed necessary, but generally does not require collateral from such parties.\n Total revenue from the Company’s largest distributor TD Synnex Corporation, and its global affiliates (“TD Synnex”), accounted for \n33\n%, \n39\n%, and \n37\n% of Autodesk's net revenue for fiscal years ended January 31, 2025, 2024 and 2023, respectively. The majority of the net revenue from sales to TD Synnex is from sales made outside of the United States. In addition, TD Synnex accounted for \n5\n% and \n18\n% of trade accounts receivable as of January 31, 2025 and 2024, respectively. No other customer accounted for more than 10% of Autodesk’s total net revenue or trade accounts receivable for each of the respective periods.\nIntangible Assets, Net\nIntangible assets include customer relationships, developed technologies, trade names and patents, and other, and the related accumulated amortization. These assets are presented as “Intangible assets, net” in the Consolidated Balance Sheets. The majority of Autodesk’s intangible assets are amortized to expense over the estimated economic life, which ranges from \n3\n to \n15\n years.\n Amortization expense for intangible assets was $\n134\n million in fiscal 2025, $\n89\n million in fiscal 2024, and $\n98\n million in fiscal 2023.  \nIntangible assets and related accumulated amortization at January 31, 2025 were as follows:\nGross Carrying Amount (1)\nAccumulated Amortization\nNet\nCustomer relationships\n$\n735\n \n$\n(\n480\n)\n$\n255\n \nDeveloped technologies\n1,154\n \n(\n849\n)\n305\n \nTrade names and patents\n122\n \n(\n115\n)\n7\n \nOther\n7\n \n—\n \n7\n \nTotal intangible assets\n$\n2,018\n \n$\n(\n1,444\n)\n$\n574\n \n_______________ \n(1)\nIncludes the effects of foreign currency translation. \n79\nTable of Contents \nIntangible assets and related accumulated amortization at January 31, 2024 were as follows:\nGross Carrying Amount (1)\nAccumulated Amortization\nNet\nCustomer relationships\n$\n664\n \n$\n(\n436\n)\n$\n228\n \nDeveloped technologies\n933\n \n(\n765\n)\n168\n \nTrade names and patents\n116\n \n(\n113\n)\n3\n \nOther\n8\n \n(\n1\n)\n7\n \nTotal intangible assets\n$\n1,721\n \n$\n(\n1,315\n)\n$\n406\n \n_______________ \n(1)\nIncludes the effects of foreign currency translation.\n \nThe weighted average amortization period for intangible assets during fiscal 2025 was \n7.2\n years. \nExpected future amortization expense for intangible assets for each of the fiscal years ended thereafter is as follows:\n \nFiscal Year ended January 31,\n2026\n$\n150\n \n2027\n140\n \n2028\n93\n \n2029\n65\n \n2030\n31\n \nThereafter\n95\n \nTotal\n$\n574\n \nComputer Equipment, Software, Furniture, and Leasehold Improvements, Net\nComputer equipment, software, and furniture are depreciated using the straight-line method over the estimated useful lives of the assets, which range from \nthree\n to \nfive years\n. Leasehold improvements are amortized on a straight-line basis over the shorter of their estimated useful lives or the lease term.\n Depreciation expense was $\n43\n million in fiscal 2025, $\n47\n million in fiscal 2024, and $\n50\n million in fiscal 2023.  Impairment losses were \nno\nt material in fiscal years ended January 31, 2025, 2024, and 2023.   \nComputer equipment, software, furniture, leasehold improvements, and the related accumulated depreciation at January 31 were as follows:\n2025\n2024\nComputer hardware, at cost\n$\n103\n \n$\n117\n \nComputer software, at cost\n42\n \n48\n \nFurniture and equipment, at cost\n100\n \n100\n \nLeasehold improvements, land and buildings, at cost\n333\n \n357\n \n578\n \n622\n \nLess: Accumulated depreciation\n(\n461\n)\n(\n501\n)\nComputer equipment, software, furniture, and leasehold improvements, net\n$\n117\n \n$\n121\n \nCosts incurred for computer software developed or obtained for internal use are capitalized for application development activities, if material, and immediately expensed for preliminary project activities and post-implementation activities. These capitalized costs are amortized straight-line over the software’s expected useful life, which is generally \nthree years\n. Autodesk had \nno\n material capitalized internal use software development costs at January 31, 2025 and 2024.\n \n80\nTable of Contents \nSoftware Development Costs\nSoftware development costs for external use incurred prior to the establishment of technological feasibility are included in research and development expenses. Autodesk defines establishment of technological feasibility as the completion of a working model. Software development costs incurred subsequent to the establishment of technological feasibility through the period of general market availability of the products are capitalized and generally amortized over a \ntwo-year\n period, if material.\n Autodesk had \nno\n material capitalized software development costs at January 31, 2025 and 2024. \nCloud Computing Arrangements\nAutodesk enters into certain cloud-based software hosting arrangements that are accounted for as service contracts. Costs incurred for these arrangements are capitalized for application development activities, if material, and immediately expensed for preliminary project activities and post-implementation activities. Autodesk amortizes the capitalized development costs straight-line over the fixed, non-cancellable term of the associated hosting arrangement plus any reasonably certain renewal periods. The capitalized costs are included in “Prepaid expenses and other current assets” and “Long-term other assets” on our Consolidated Balance Sheets. Capitalized costs were $\n327\n million and $\n254\n million at January 31, 2025, and January 31, 2024, respectively. Accumulated amortization was $\n136\n million and $\n83\n million at January 31, 2025, and January 31, 2024, respectively. Amortization expense was $\n53\n million, $\n42\n million, and $\n24\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively.\nLeases\nAutodesk determines if an arrangement is a lease at inception. Operating leases are included in “Operating lease right-of-use assets,” “Operating lease liabilities,” and “Long-term operating lease liabilities” in the Consolidated Balance Sheets.\nOperating lease right-of-use assets represent Autodesk’s right to use an underlying asset for the lease term and operating lease liabilities represent the Company’s obligation to make lease payments arising from the lease. Operating lease right-of-use assets and operating lease liabilities are recognized at commencement date based on the present value of lease payments over the lease term. The operating lease right-of-use assets also include any lease payments made and are reduced by any lease incentives.  Autodesk uses its incremental borrowing rate, if the Company’s leases do not provide an implicit rate, adjusted for local country-specific borrowing rates as applicable, based on the information available at commencement date in determining the present value of lease payments. Options to extend or terminate the lease are considered in determining the lease term when it is reasonably certain that the option will be exercised. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nAutodesk has lease agreements with lease and non-lease components. Autodesk accounts for the lease and non-lease components as a single lease component.\nBusiness Combinations\nAutodesk records the tangible and intangible assets acquired and liabilities assumed in a business combination based on their estimated fair values at the date of the respective acquisition, with the exception of contract assets and contract liabilities (i.e., deferred revenue) which are recognized and measured on the acquisition date in accordance with Autodesk’s “Revenue Recognition” policy in Note 1 “Business and Summary of Significant Accounting Policies”. The fair values assigned to the identifiable intangible assets acquired are based on estimates and assumptions determined by management. Autodesk records the excess of consideration transferred over the aggregate fair values as goodwill. During the measurement period, which may be up to one year from the acquisition date, Autodesk may record adjustments to these tangible and intangible assets acquired and liabilities assumed, with the corresponding offset to goodwill.\n \n81\nTable of Contents \nImpairment of Long-Lived Assets\nAt least annually or more frequently as circumstances dictate, Autodesk reviews its long-lived assets for impairment whenever impairment indicators exist. Autodesk continually monitors events and changes in circumstances that could indicate the carrying amounts of its long-lived assets may not be recoverable. When such events or changes in circumstances occur, Autodesk assesses the recoverability of these assets.  Recoverability is measured by comparison of the carrying amounts of the assets to the future undiscounted cash flow the assets are expected to generate generally using Level 3 inputs. If the long-lived assets are impaired, the impairment to be recognized is equal to the amount by which the carrying value of the assets exceeds its fair market value. See Note 9, “Leases” for further discussion on impairment charges of lease related right-of-assets. \nIn addition to the recoverability assessments, Autodesk routinely reviews the remaining estimated useful lives of its long-lived assets. Any reduction in the useful life assumption will result in increased depreciation and amortization expense in the quarter when such determinations are made, as well as in subsequent quarters.\nGoodwill\nGoodwill consists of the excess of the consideration transferred over the fair value of net assets acquired in business combinations. Autodesk tests goodwill for impairment annually in its fourth fiscal quarter or more often if circumstances indicate a potential impairment may exist, or if events have affected the composition of its reporting unit.  \nAutodesk tests goodwill for impairment by performing a quantitative assessment of whether fair value of the reporting unit is greater than its carrying value. In situations in which an entity’s reporting unit is publicly traded, the fair value of the company may be approximated by its market capitalization, in performing the quantitative impairment test. \nGoodwill impairment exists when the estimated fair value of goodwill is less than its carrying value. If impairment exists, the carrying value of the goodwill is reduced to fair value through an impairment charge recorded in the Company’s consolidated statements of operations. The process of evaluating the potential impairment of goodwill is subjective and requires significant judgment at many points during the analysis. The value of Autodesk’s goodwill could also be impacted by future adverse changes such as: (i) declines in Autodesk’s actual financial results, (ii) a sustained decline in Autodesk’s market capitalization, (iii) a significant slowdown in the worldwide economy or the industries Autodesk serves, or (iv) changes in Autodesk’s business strategy.\nFor the annual impairment test, Autodesk’s market capitalization was substantially in excess of the carrying value of the Company as of January 31, 2025. Accordingly, Autodesk has determined there was \nno\n goodwill impairment of our reporting unit during the fiscal year ended January 31, 2025. In addition, Autodesk did \nno\nt recognize any goodwill impairment losses in fiscal 2024 or 2023.\nThe following table summarizes the changes in the carrying amount of goodwill during the fiscal years ended January 31, 2025 and 2024:\nJanuary 31, 2025\nJanuary 31, 2024\nGoodwill beginning of the year (1)\n$\n3,653\n \n$\n3,625\n \nAdditions arising from acquisitions during the year\n619\n \n25\n \nEffect of foreign currency translation and measurement period adjustments (2)\n(\n30\n)\n3\n \nGoodwill, end of the year (1)\n$\n4,242\n \n$\n3,653\n \n_______________ \n(1)\nAccumulated impairment losses as of both \nJanuary 31, 2025 and 2024, were $\n149\n million.\n(2)\nMeasurement period adjustments reflect revisions made to the Company's preliminary determination of estimated fair value of assets and liabilities assumed.\nDeferred Tax Assets\nDeferred tax assets arise primarily from tax credits, net operating losses, and timing differences for reserves, accrued liabilities, stock options, deferred revenue, purchased technologies, and capitalized intangibles, partially offset by U.S. deferred tax liabilities on acquired intangibles, and valuation allowances against Portugal, New Zealand, California, Michigan and Massachusetts deferred tax assets, and deferred tax assets relating to capital losses and assets that will convert into capital loss upon reversal in Australia and the U.S. Autodesk performs a quarterly assessment of the recoverability of these net deferred tax \n82\nTable of Contents \nassets and believes it will generate sufficient future taxable income in appropriate tax jurisdictions to realize the net deferred tax assets. They are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to reverse. Valuation allowances are established when necessary to reduce gross deferred tax assets to the amount that is more likely than not to be realized.\nStock-based Compensation Expense\nThe following table summarizes stock-based compensation expense for fiscal 2025, 2024, and 2023, as follows:\n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\nCost of subscription and maintenance revenue\n$\n37\n \n$\n37\n \n$\n34\n \nCost of other revenue\n13\n \n14\n \n12\n \nMarketing and sales\n244\n \n258\n \n263\n \nResearch and development\n304\n \n308\n \n266\n \nGeneral and administrative\n88\n \n86\n \n85\n \nStock-based compensation expense related to stock awards and Employee Qualified Stock Purchase Plan (\"ESPP\") purchases\n686\n \n703\n \n660\n \nTax (benefit) expense\n(\n35\n)\n2\n \n13\n \nStock-based compensation expense related to stock awards and ESPP purchases, net\n$\n651\n \n$\n705\n \n$\n673\n \n    \nAutodesk measures stock-based compensation cost at the grant date fair value of the award, and recognizes expense ratably over the requisite service period, which is generally the vesting period. Autodesk determines the grant date fair value of its stock-based payment awards for grants of employee stock purchases related to the employee stock purchase plan using the Black-Scholes-Merton (“BSM”) option-pricing model. To determine the grant-date fair value of our stock-based payment awards for restricted stock units and performance stock units, we use the quoted stock price on the date of grant unless the awards are subject to market conditions, in which case we use the Monte Carlo simulation model. The Monte Carlo simulation model utilizes multiple input variables to estimate the probability that market conditions will be achieved. These variables include our expected stock price volatility over the expected term of the award, actual and projected employee stock option exercise behaviors, the risk-free interest rate for the expected term of the award, and expected dividends. The variables used in these models are reviewed when awards are granted and adjusted as needed. Stock-based compensation cost for restricted stock is measured on the closing fair market value of our common stock on the date of grant.\n \nAutodesk uses the following assumptions to estimate the fair value of stock-based awards:\nFiscal Year Ended\nFiscal Year Ended\nFiscal Year Ended\n \nJanuary 31, 2025\nJanuary 31, 2024\nJanuary 31, 2023\n \nPerformance Stock Unit\nESPP\nPerformance Stock Unit\nESPP\nPerformance Stock Unit\nESPP\nRange of expected volatilities\n29.4\n - \n31.4\n%\n28.7\n - \n34.5\n%\n40.9\n - \n42.5\n%\n29.4\n - \n42.4\n%\n39.4\n - \n40.7\n%\n38.3\n - \n44.9\n%\nRange of expected lives (in years)\nN/A\n0.5\n - \n2.0\nN/A\n0.5\n - \n2.0\nN/A\n0.5\n - \n2.0\nExpected dividends\n—\n%\n—\n%\n—\n%\n—\n%\n—\n%\n—\n%\nRange of risk-free interest rates\n5.2\n%\n3.6\n - \n5.4\n%\n4.3\n - \n4.7\n%\n4.3\n - \n5.5\n%\n1.2\n - \n1.6\n%\n0.9\n - \n3.9\n%\nAutodesk estimates expected volatility for stock-based awards based on the average of the following two measures: (1) a measure of historical volatility in the trading market for the Company’s common stock, and (2) the implied volatility of traded options to purchase shares of the Company’s common stock. The expected volatility for performance stock units subject to market conditions includes the expected volatility of companies within the S&P North American Technology Software Index with a market capitalization over $\n2.0\n billion, depending on the award type.\nThe range of expected lives of ESPP awards are based upon the \nfour\n \nsix-month\n exercise periods within a \n24\n-month offering period.\n83\nTable of Contents \nAutodesk did \nno\nt pay cash dividends in fiscal 2025, 2024, or 2023 and does not anticipate paying any cash dividends in the foreseeable future. Consequently, an expected dividend yield of \nzero\n is used in the BSM option pricing model and the Monte Carlo simulation model.\nThe risk-free interest rate used in the BSM option pricing model and the Monte Carlo simulation model for stock-based awards is the historical yield on U.S. Treasury securities with equivalent remaining lives.\nAutodesk recognizes expense only for the stock-based awards that ultimately vest. Autodesk accounts for forfeitures of stock-based awards as those forfeitures occur.\nAdvertising Expenses\nAdvertising costs are expensed as incurred.\n Total advertising expenses incurred were $\n54\n million in fiscal 2025, $\n64\n million in fiscal 2024, and $\n69\n million in fiscal 2023.\nNet Income Per Share\nBasic net income per share is computed using the weighted average number of shares of common stock outstanding during the period. Diluted net income per share is computed using the weighted average shares of common stock outstanding during the period and potentially dilutive common shares, including the effect of restricted stock units, performance share awards, and stock options using the treasury stock method.\nDefined Benefit Pension Plans\nThe funded status of Autodesk’s defined benefit pension plans is recognized in the Consolidated Balance Sheets. The funded status is measured as the difference between the fair value of plan assets and the projected benefit obligation for the fiscal years presented. The projected benefit obligation represents the actuarial present value of benefits expected to be paid upon retirement based on employee services already rendered and estimated future compensation levels. The fair value of plan assets represents the current market value of Autodesk’s cumulative company and participant contributions made to the various plans in effect.\nNet periodic benefit cost is recorded in the Consolidated Statements of Operations and includes service cost, interest cost, expected return on plan assets, amortization of prior service costs, and gains or losses previously recognized as a component of other comprehensive income (loss). Certain events, such as changes in the employee base, plan amendments, and changes in actuarial assumptions may result in a change in the defined benefit obligation and the corresponding change to other comprehensive loss. \nGains and losses and prior service costs not recognized as a component of net periodic benefit cost in the Consolidated Statements of Operations as they arise are recognized as a component of other comprehensive income (loss) in the Consolidated Statements of Comprehensive Income. Those gains and losses and prior service costs are subsequently amortized as a component of net periodic benefit cost over the average remaining service lives of the plan participants using a corridor approach to determine the portion of gain or loss subject to amortization.\nThe measurement of projected benefit obligations and net periodic benefit cost is based on estimates and assumptions that reflect the terms of the plans and use participant-specific information such as compensation, age and years of services, as well as certain assumptions, including estimates of discount rates, expected return of plan assets, rate of compensation increases, interest rates, and mortality rates.\n84\nTable of Contents \nAccounting Standards in Fiscal 2025\nWith the exception of those discussed below, there have been no recent changes in accounting pronouncements issued by FASB or adopted by the Company during the fiscal year ended January 31, 2025, that are applicable to the Company. \nAccounting Standards Adopted\nIn November 2023, the FASB issued ASU No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures” (“ASU 2023-07”), which are intended to improve reportable segment disclosure requirements. ASU 2023-07 expands public entities’ segment disclosures by requiring disclosure of significant segment expenses that are regularly provided to the chief operating decision maker and included within each reported measure of segment profit or loss, an amount and description of its composition for other segment items, and interim disclosures of a reportable segment’s profit or loss and assets. All disclosure requirements of ASU 2023-07 are required for entities with a single reportable segment. Autodesk adopted the annual disclosures of ASU 2023-07 for our fiscal year ended January 31, 2025. ASU 2023-07 is effective for interim periods for Autodesk’s fiscal year beginning February 1, 2025, and should be applied on a retrospective basis.\nRecently issued accounting standards not yet adopted\nIn November 2024, the FASB issued ASU No. 2024-03, “Income Statement-Reporting Comprehensive Income-Expense Disaggregation Disclosures” (“ASU 2024-03”), which requires disaggregated disclosures, in the notes to the financial statements, of certain categories of expenses that are included in expense line items on the face of the income statement. ASU 2024-03 also requires a qualitative description of the amounts remaining in relevant expense captions that are not separately disaggregated quantitatively and disclosure of the total amount of selling expenses, and in annual reporting periods, Autodesk’s definition of selling expenses. In addition, the FASB issued ASU No. 2025-01 to clarify the requirement to adopt the guidance in annual reporting periods beginning after December 15, 2026, and interim periods within annual reporting periods beginning after December 15, 2027. ASU 2024-03 is effective for Autodesk’s fiscal year beginning February 1, 2027, and interim periods for Autodesk’s fiscal year beginning February 1, 2028.  Early adoption is permitted. Autodesk is currently evaluating the effect of adopting ASU 2024-03 on its disclosures. \n In December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvement to Income Tax Disclosures” (“ASU 2023-09”), to enhance the transparency and decision usefulness of income tax disclosures. ASU 2023-09  requires disaggregated information about a reporting entity's effective tax rate reconciliation as well as information on income taxes paid. The standard is intended to benefit investors by providing more detailed income tax disclosures that would be useful in making capital allocation decisions and applies to all entities subject to income taxes. ASU 2023-09 is effective for Autodesk’s fiscal year beginning February 1, 2025 on a prospective basis. Autodesk is currently evaluating the effect of adopting ASU 2023-09 on its disclosures.\n \n 2.     \nRevenue Recognition \nRevenue Disaggregation\nAutodesk recognizes revenue from the sale of (1) product subscriptions, cloud service offerings, and EBAs, (2) renewal fees for existing maintenance plan agreements that were initially purchased with a perpetual software license, and (3) consulting and other products and services. The \nthree\n categories are presented as line items on Autodesk’s Consolidated Statements of Operations. \n85\nTable of Contents \nInformation regarding the components of Autodesk’s net revenue from contracts with customers by product family,  geographic location, sales channel, and product type was as follows:\n \n \nFiscal Year ended January 31,\n \n2025\n2024\n2023\nNet revenue by product family:\nArchitecture, Engineering, Construction and Operations\n$\n2,937\n \n$\n2,580\n \n$\n2,278\n \nAutoCAD and AutoCAD LT\n1,572\n \n1,462\n \n1,387\n \nManufacturing\n1,189\n \n1,063\n \n978\n \nMedia and Entertainment\n315\n \n295\n \n291\n \nOther \n118\n \n97\n \n71\n \nTotal net revenue\n$\n6,131\n \n$\n5,497\n \n$\n5,005\n \nNet revenue by geographic area:\nAmericas\nU.S.\n$\n2,228\n \n$\n1,978\n \n$\n1,720\n \nOther Americas\n488\n \n460\n \n372\n \nTotal Americas\n2,716\n \n2,438\n \n2,092\n \nEurope, Middle East and Africa\n2,307\n \n2,042\n \n1,906\n \nAsia Pacific\n1,108\n \n1,017\n \n1,007\n \nTotal net revenue\n$\n6,131\n \n$\n5,497\n \n$\n5,005\n \nNet revenue by sales channel:\nIndirect\n$\n3,568\n \n$\n3,444\n \n$\n3,250\n \nDirect\n2,563\n \n2,053\n \n1,755\n \nTotal net revenue\n$\n6,131\n \n$\n5,497\n \n$\n5,005\n \nNet revenue by product type:\nDesign\n$\n5,104\n \n$\n4,647\n \n$\n4,264\n \nMake\n654\n \n523\n \n452\n \nOther\n373\n \n327\n \n289\n \nTotal net revenue\n$\n6,131\n \n$\n5,497\n \n$\n5,005\n \n.\nPayments for product subscriptions, cloud subscriptions, and maintenance subscriptions are typically due in annual installments or up front with payment terms of \n30\n to \n45\n days.  Payments on EBAs are typically due up front or in annual installments over the contract term with payment terms of \n30\n to \n60\n days. Autodesk does not have any material variable consideration, such as obligations for returns, refunds, warranties, or amounts due to customers for which significant estimation or judgment is required as of the reporting date.\nRemaining performance obligations consist of total short-term, long-term, and unbilled deferred revenue. As of January 31, 2025, Autodesk had remaining performance obligations of $\n6.94\n billion, which represents the total transaction price allocated to remaining performance obligations, which are generally recognized over the next \nthree years\n. We expect to recognize $\n4.46\n billion or \n64\n% of our remaining performance obligations as revenue during the next \n12\n months. We expect to recognize the remaining $\n2.48\n billion or \n36\n% of our remaining performance obligations as revenue thereafter.\nThe amount of remaining performance obligations may be impacted by the specific timing, duration, and size of customer subscription and support agreements, the specific timing of customer renewals, and foreign currency fluctuations.\n86\nTable of Contents \nContract Balances\n \nWe receive payments from customers based on a billing schedule as established in our contracts. Contract assets relate to performance completed in advance of scheduled billings. Contract assets were not material as of January 31, 2025. Deferred revenue relates to billings in advance of performance under the contract. The primary changes in our contract assets and deferred revenues are due to our performance under the contracts and billings. \nRevenue recognized during the fiscal years ended January 31, 2025 and 2024, that was included in the deferred revenue balances at January 31, 2024 and 2023, was $\n3.49\n billion and $\n3.20\n billion, respectively. The satisfaction of performance obligations typically lags behind billings under revenue contracts from customers.\n    \n3.     \nFinancial Instruments \nThe following tables summarize the Company’s financial instruments by significant investment category as of January 31, 2025 and 2024. \nJanuary 31, 2025\nAmortized Cost\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nCash equivalents (1):\nMoney market funds\n$\n618\n \n$\n— \n$\n— \n$\n618\n \nCommercial paper\n85\n \n— \n— \n85\n \nCertificates of deposit\n38\n \n— \n— \n38\n \nU.S. government securities\n19\n \n— \n— \n19\n \nOther (2)\n4\n \n— \n— \n4\n \nMarketable securities:\nShort-term\nCommercial paper\n96\n \n— \n— \n96\n \nCorporate debt securities\n79\n \n— \n79\n \nU.S. government securities\n74\n \n— \n— \n74\n \nAsset backed securities\n19\n \n— \n— \n19\n \nOther (3)\n19\n \n— \n19\n \nLong-term\nCorporate debt securities\n96\n \n1\n \n—\n \n97\n \nAsset backed securities\n71\n \n—\n \n—\n \n71\n \nU.S. government securities\n52\n \n—\n \n(\n1\n)\n51\n \nAgency mortgage-backed securities\n40\n \n—\n \n—\n \n40\n \nOther (4)\n8\n \n—\n \n—\n \n8\n \nMutual funds (5) (6)\n106\n \n12\n \n—\n \n118\n \nTotal\n$\n1,424\n \n$\n13\n \n$\n(\n1\n)\n$\n1,436\n \n____________________ \n(1)\nIncluded in “Cash and cash equivalents” in the accompanying Consolidated Balance Sheets. These investments are classified as debt securities.\n(2)\nConsists primarily of corporate debt securities.   \n(3)\nConsists primarily of agency discount bonds, agency mortgage-backed securities, mortgage-backed securities, and US treasury bonds.\n(4)\nConsists primarily of agency collateralized mortgage obligations and supranational bonds.\n(5)\nSee Note 7, \"Deferred Compensation\" for more information.\n(6)\nIncluded in “Prepaid expenses and other current assets” or “Long-term other assets” in the accompanying Consolidated Balance Sheets.\n87\nTable of Contents \n \n \nJanuary 31, 2024\nAmortized Cost\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nCash equivalents (1):\nMoney market funds\n$\n693\n \n$\n— \n$\n— \n$\n693\n \nCommercial paper\n250\n \n— \n— \n250\n \nCertificates of deposit\n80\n \n— \n— \n80\n \nU.S. government securities\n92\n \n— \n— \n92\n \nOther (2)\n6\n \n— \n— \n6\n \nMarketable securities:\nShort-term\nCorporate debt securities\nCommercial paper\n159\n \n— \n— \n159\n \nCorporate debt securities\n75\n \n— \n75\n \nU.S. government securities\n70\n \n— \n— \n70\n \nAsset backed securities\n28\n \n— \n— \n28\n \nOther (3)\n22\n \n— \n22\n \nLong-term\nCorporate debt securities\n103\n \n1\n \n—\n \n104\n \nAsset backed securities\n59\n \n—\n \n—\n \n59\n \nAgency mortgage-backed securities\n36\n \n—\n \n—\n \n36\n \nU.S. government securities\n24\n \n—\n \n—\n \n24\n \nOther (4)\n11\n \n—\n \n—\n \n11\n \nMutual Funds (5) (6)\n89\n \n12\n \n(\n1\n)\n100\n \nTotal\n$\n1,797\n \n$\n13\n \n$\n(\n1\n)\n$\n1,809\n \n____________________ \n(1)\nIncluded in “Cash and cash equivalents” in the accompanying Consolidated Balance Sheets. These investments are classified as debt securities.\n(2)\nConsists primarily of mortgage-backed securities and corporate debt securities.\n(3)\nConsists primarily of agency discount bonds, U.S. government securities, mortgage-backed securities, certificates of deposit, and agency bonds.\n(4)\nConsists primarily of agency bonds, agency collateralized mortgage obligations, and mortgage-backed securities.\n(5)\nSee Note 7, \"Deferred Compensation\" for more information.  \n(6)\nIncluded in “Prepaid expenses and other current assets” or “Long-term other assets” in the accompanying Consolidated Balance Sheets.\nThe following table summarizes the fair values of investments classified as marketable debt securities by contractual maturity date as of January 31, 2025: \nFair Value\nDue within 1 year\n$\n254\n \nDue in 1 year through 5 years\n267\nDue in 5 years through 10 years\n15\nDue after 10 years\n18\nTotal\n$\n554\n \nAs of both January 31, 2025 and 2024, Autodesk had \nno\n material unrealized losses, individually and in the aggregate, for marketable debt securities that are in a continuous unrealized loss position for greater than 12 months. Total unrealized gains for securities with net gains in accumulated other comprehensive income were not material for fiscal 2025.\n88\nTable of Contents \nAutodesk monitors all marketable debt securities for potential credit losses by reviewing indicators such as, but not limited to, current credit rating, change in credit rating, credit outlook, and default risk. There were \nno\n allowances for credit losses as of both January 31, 2025 and 2024. There were \nno\n write offs of accrued interest receivables for both fiscal 2025 and 2024. \nThere were \nno\n material realized gain or loss for the sales or redemptions of debt securities during fiscal 2025, 2024, and 2023.  Realized gains and losses from the sale or redemption of marketable securities are recorded in “\nInterest and other income (expense), net\n” on the Company’s Consolidated Statements of Operations.\nProceeds from the sale and maturity of marketable debt securities were as follows: \n \nFiscal Year Ended\n2025\n2024\n2023\nMarketable debt securities \n$\n861\n \n$\n764\n \n$\n450\n \nStrategic investments in equity securities\n    \nAs of January 31, 2025 and 2024, Autodesk had $\n168\n million and $\n162\n million, respectively, in direct investments in privately held companies. These strategic investments in equity securities do not have readily determined fair values and Autodesk uses the measurement alternative to account for the adjustment to these investments in a given quarter. If Autodesk determines that an impairment has occurred, Autodesk writes down the investment to its fair value. These strategic investments in equity securities are generally subject to a security-specific restriction which limits the sale or transfer of the respective equity security during the holding period.\nAdjustments to the carrying value of our strategic investments in equity securities with no readily determined fair values measured using the measurement alternative are included in Interest and Other Income (Expense), net on the Company’s Consolidated Statements of Operations. These adjustments were as follows:\n \nFiscal Year Ended\nCumulative Amount as of \n2025\n2024\n2023\nJanuary 31, 2025\nUpward adjustments\n$\n—\n \n$\n—\n \n$\n6\n \n$\n29\n \nNegative adjustments, including impairments\n(\n8\n)\n(\n28\n)\n(\n9\n)\n(\n122\n)\nNet adjustments\n$\n(\n8\n)\n$\n(\n28\n)\n$\n(\n3\n)\n$\n(\n93\n)\nAutodesk does not consider the remaining investments to be impaired as of January 31, 2025.\nFair Value\nAutodesk applies fair value accounting for certain financial assets and liabilities, which consist of cash equivalents, marketable securities, and other financial instruments, on a recurring basis. The Company defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. \nThe following tables summarize the Company's financial instruments measured at fair value on a recurring basis by significant investment category as of January 31, 2025 and 2024:   \n89\nTable of Contents \nJanuary 31, 2025\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash equivalents (1):\nMoney market funds\n$\n618\n \n$\n—\n \n$\n—\n \n$\n618\n \nCommercial paper\n—\n \n85\n \n—\n \n85\n \nCertificates of deposit\n—\n \n38\n \n—\n \n38\n \nU.S. government securities\n—\n \n19\n \n—\n \n19\n \nOther (2)\n—\n \n4\n \n—\n \n4\n \nMarketable securities:\nShort-term\nCommercial paper\n—\n \n96\n \n—\n \n96\n \nCorporate debt securities\n—\n \n79\n \n—\n \n79\n \nU.S. government securities\n—\n \n74\n \n—\n \n74\n \nAsset backed securities\n—\n \n19\n \n—\n \n19\n \nOther (3)\n—\n \n19\n \n—\n \n19\n \nLong-term\nCorporate debt securities\n—\n \n97\n \n—\n \n97\n \nAsset backed securities\n—\n \n71\n \n—\n \n71\n \nU.S. government securities\n—\n \n51\n \n—\n \n51\n \nAgency bonds\n—\n \n40\n \n—\n \n40\n \nOther (4)\n—\n \n8\n \n—\n \n8\n \nLong-term other assets:\nMutual funds (5) (6)\n118\n \n—\n \n—\n \n118\n \nDerivative assets:\nDerivative contract assets (6)\n—\n \n28\n \n—\n \n28\n \nDerivative liabilities:\nDerivative contract liabilities (7)\n—\n \n(\n22\n)\n—\n \n(\n22\n)\nTotal\n$\n736\n \n$\n706\n \n$\n—\n \n$\n1,442\n \n____________________ \n(1)\nIncluded in “Cash and cash equivalents” in the accompanying Consolidated Balance Sheets. These investments are classified as debt securities.\n(2)\nConsists primarily of corporate debt securities.    \n(3)\nConsists primarily of agency discount bonds, agency mortgage-backed securities, mortgage-backed securities, and US treasury bonds.\n(4)\nConsists primarily of agency collateralized mortgage obligations and supranational bonds.\n(5)\nSee Note 7, \"Deferred Compensation\" for more information.\n(6)\nIncluded in “Prepaid expenses and other current assets” or “Long-term other assets” in the accompanying Consolidated Balance Sheets.\n(7)\nIncluded in “Other accrued liabilities” in the accompanying Consolidated Balance Sheets.\n90\nTable of Contents \n \n \n \n \nJanuary 31, 2024\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash equivalents (1):\nMoney market funds\n$\n693\n \n$\n—\n \n$\n—\n \n$\n693\n \nCommercial paper\n—\n \n250\n \n—\n \n250\nCertificates of deposit\n—\n \n80\n \n—\n \n80\nU.S. government securities\n—\n \n92\n \n—\n \n92\nOther (2)\n—\n \n6\n \n—\n \n6\nMarketable securities:\nShort-term\nCorporate debt securities\n—\n \n75\n \n—\n \n75\nCommercial paper\n—\n \n159\n \n—\n \n159\nAsset backed securities\n—\n \n28\n \n—\n \n28\nU.S. government securities\n—\n \n70\n \n—\n \n70\nOther (3)\n—\n \n22\n \n—\n \n22\nLong-term\nAgency bonds\n—\n \n36\n \n—\n \n36\nCorporate debt securities\n—\n \n104\n \n—\n \n104\nU.S. government securities\n—\n \n24\n \n—\n \n24\nAsset backed securities\n—\n \n59\n \n—\n \n59\nOther (4)\n—\n \n11\n \n—\n \n11\nLong-term other assets:\nMutual Funds (5) (6)\n100\n \n—\n \n—\n \n100\nDerivative assets\nDerivative contract assets (6)\n—\n \n21\n \n—\n \n21\nDerivative liabilities\nDerivative contract liabilities (7)\n—\n \n(\n15\n)\n—\n \n(\n15\n)\nTotal\n$\n793\n \n$\n1,022\n \n$\n—\n \n$\n1,815\n \n____________________ \n(1)\nIncluded in “Cash and cash equivalents” in the accompanying Consolidated Balance Sheets. These investments are classified as debt securities.\n(2)\nConsists primarily of mortgage-backed securities and corporate debt securities.\n(3)\nConsists primarily of agency discount bonds, U.S. government securities, mortgage-backed securities, certificates of deposit, and agency bonds.\n(4)\nConsists primarily of agency bonds, agency collateralized mortgage obligations, and mortgage-backed securities.\n(5)\nSee Note 7, \"Deferred Compensation\" for more information.  \n(6)\nIncluded in “Prepaid expenses and other current assets” or “Long-term other assets” in the accompanying Consolidated Balance Sheets.\n(7)\nIncluded in “Other accrued liabilities” in the accompanying Consolidated Balance Sheets.\n91\nTable of Contents \n4.     \nEquity Compensation  \nStock Plans\nThe 2022 Equity Incentive Plan (the “2022 Plan”) was approved by Autodesk’s stockholders and became effective on June 16, 2022.  The 2022 Plan replaced the 2012 Employee Stock Plan, as amended, and the 2012 Outside Directors’ Stock Plan, as amended (collectively, the “Prior Plans”), and no further equity awards may be granted under the Prior Plans. The 2022 Plan reserves up to \n23\n million shares. The 2022 Plan permits the grant of stock options, restricted stock units, and restricted stock awards to employees and non-employee members of the Board of Directors. Each restricted stock unit or restricted stock award granted will be counted against the shares authorized for issuance under the 2022 Plan as \n2.08\n shares. If a granted option, restricted stock unit, or restricted stock award expires or becomes unexercisable for any reason, the unpurchased or forfeited shares that were granted may be returned to the 2022 Plan and may become available for future grant under the 2022 Plan. As of January 31, 2025, \n16\n million shares subject to restricted stock units and restricted stock awards have been granted under the 2022 Plan. Restricted stock units that were granted under the 2022 Plan vest over \none\n to \nthree years\n  from the date of grant. The 2022 Plan will expire on March 17, 2032. At January 31, 2025, approximately \n8\n million shares were available for future issuance under the 2022 Plan.\nThe following sections summarize activity under Autodesk’s stock plans.\nRestricted Stock Units:\nA summary of restricted stock activity for the fiscal year ended January 31, 2025, was as follows:\nUnreleased Restricted Stock Units (in thousands)\nWeighted average grant date fair value per share\nUnvested restricted stock at January 31, 2024\n5,371\n \n$\n203.87\n \nGranted\n3,229\n \n245.32\n \nVested\n(\n3,027\n)\n205.74\n \nCanceled/Forfeited \n(\n352\n)\n215.80\n \nPerformance Adjustment (1)\n(\n33\n)\n193.79\n \nUnvested restricted stock at January 31, 2025\n5,188\n \n$\n229.09\n \n_______________\n(1)\nBased on Autodesk’s financial results and relative total stockholder return for the fiscal 2024 performance period. The performance stock units were attained at rates ranging from \n75\n% to \n96\n% of the target award.\nFor the restricted stock granted during fiscal years ended January 31, 2025, 2024, and 2023, the weighted average grant date fair values were $\n245.32\n, $\n200.53\n, and $\n198.89\n, respectively. The fair value of the shares vested during fiscal years ended January 31, 2025, 2024, and 2023 were $\n785\n million, $\n580\n million, and $\n490\n million, respectively. \nDuring the fiscal year ended January 31, 2025, Autodesk granted \n3\n million restricted stock units. Restricted stock units vest over periods ranging from immediately upon grant to a pre-determined date that is typically within \nthree years\n from the date of grant. Restricted stock units are not considered outstanding stock at the time of grant, as the holders of these units are not entitled to any of the rights of a stockholder, including voting rights. The fair value of the restricted stock units is expensed ratably over the vesting period.  \nDuring the fiscal years ended January 31, 2025 and 2024, Autodesk settled liability-classified awards of $\n4\n million and $\n15\n million, respectively. As these awards were settled in a fixed dollar amount of shares, the awards were accounted for as a liability-classified award and were expensed using the straight-line method over the vesting period.\n Autodesk recorded stock-based compensation expense related to restricted stock units of $\n584\n million, $\n580\n million, and $\n510\n million during fiscal years ended January 31, 2025, 2024, and 2023, respectively. As of January 31, 2025, total compensation cost not yet recognized of $\n795\n million related to unvested awards is expected to be recognized over a weighted average period of \n1.71\n years. At January 31, 2025, the number of restricted stock units granted but unvested was \n5\n million.\n92\nTable of Contents \nDuring the fiscal year ended January 31, 2025, Autodesk granted \n279\n thousand performance stock units for which the ultimate number of shares earned is determined based on the achievement of performance criteria at the end of the stated service and performance period. The performance criteria for the majority of the performance stock units are primarily based on revenue and free cash flow goals adopted by the Compensation and Human Resource Committee and total stockholder return compared against companies in the S&P North American Technology Software Index with a market capitalization over $\n2.0\n billion (“Relative TSR”). The fair value of the performance stock units is expensed using the accelerated attribution method over the \nthree-year\n vesting period and the performance stock units have the following vesting schedule: \n•\nUp to one third of the performance stock units may vest following year one, depending upon the achievement of the performance criteria for fiscal 2025 as well as one-year Relative TSR (covering year one).\n•\nUp to one third of the performance stock units may vest following year two, depending upon the achievement of the performance criteria for year two as well as two-year Relative TSR (covering years one and two).\n•\nUp to one third of the performance stock units may vest following year three, depending upon the achievement of the performance criteria for year three as well as three-year Relative TSR (covering years one, two and three).\n \nThe performance criteria for the performance stock units vested during fiscal year ended January 31, 2025, was based on revenue and free cash flow goals adopted by the Compensation and Human Resource Committee.\nPerformance stock units are not considered outstanding stock at the time of grant, as the holders of these units are not entitled to any of the rights of a stockholder, including voting rights. The fair value of the performance stock units is expensed using the accelerated attribution over the vesting period.\n Autodesk recorded stock-based compensation expense related to performance stock units of $\n57\n million, $\n42\n million, and $\n54\n million during fiscal years ended January 31, 2025, 2024, and 2023, respectively. As of January 31, 2025, total compensation cost not yet recognized of $\n13\n million related to unvested performance stock units, is expected to be recognized over a weighted average period of \n0.83\n years. At January 31, 2025, the number of performance stock units granted but unvested was \n541\n thousand.\nCommon Stock \nAutodesk recorded stock-based compensation expense related to common stock shares of $\n4\n million, $\n19\n million, and $\n32\n million during the fiscal years ended January 31, 2025, 2024, and 2023, respectively.\n1998 Employee Qualified Stock Purchase Plan (“ESPP”)\nUnder Autodesk’s ESPP, which was approved by stockholders in 1998, eligible employees may purchase shares of Autodesk’s common stock at their discretion using up to \n15\n% of their eligible compensation, subject to certain limitations, at \n85\n% of the lower of Autodesk's closing price (fair market value) on the offering date or the exercise date. The offering period for ESPP awards consists of \nfour\n \nsix-month\n exercise periods within a \n24\n-month offering period. \nAt January 31, 2025, a total of \n3\n million shares were available for future issuance. Under the ESPP, the Company issues shares on the first trading day following March 31 and September 30 of each fiscal year. The ESPP does not have an expiration date.\nA summary of the ESPP activity for the fiscal years ended January 31, 2025, 2024, and 2023 was as follows:\nFiscal year ended January 31,\n2025\n2024\n2023\nIssued shares (in thousands)\n732\n \n791\n \n740\n \nAverage price of issued shares\n$\n165.89\n \n$\n163.91\n \n$\n166.44\n \nWeighted average grant date fair value of awards granted under the ESPP\n$\n78.93\n \n$\n68.70\n \n$\n67.77\n \nAutodesk recorded $\n41\n million, $\n63\n million, and $\n62\n million of compensation expense associated with the ESPP in fiscal 2025, 2024, and 2023, respectively.\n93\nTable of Contents \nEquity Compensation Plan Information\nThe following table summarizes the number of outstanding options and awards granted to employees and directors, as well as the number of securities remaining available for future issuance under these plans as of January 31, 2025:\n(a)\n(b)\n(c)\nPlan category\nNumber of securities  to be issued upon exercise or vesting of outstanding options and awards (in millions)\nWeighted-average exercise price of outstanding options\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a)) (in millions) (1)\nEquity compensation plans approved by security holders\n5\n \n$\n21.43\n \n11\n \nTotal\n5\n \n$\n21.43\n \n11\n \n____________________ \n(1)\nIncluded in this amount are \n3\n million securities available for future issuance under Autodesk’s ESPP.\n5.     \nIncome Taxes\nThe provision for income taxes consists of the following:\n \nFiscal year ended January 31,\n2025\n2024\n2023\nFederal:\nCurrent\n$\n138\n \n$\n86\n \n$\n219\n \nDeferred\n(\n87\n)\n(\n97\n)\n(\n222\n)\nState:\nCurrent\n19\n \n21\n \n28\n \nDeferred\n(\n5\n)\n3\n \n(\n19\n)\nForeign:\nCurrent\n229\n \n206\n \n151\n \nDeferred\n(\n22\n)\n11\n \n(\n34\n)\nIncome tax provision \n$\n272\n \n$\n230\n \n$\n123\n \nForeign pretax income was $\n992\n million in fiscal 2025, $\n730\n million in fiscal 2024, and $\n755\n million in fiscal 2023.\n94\nTable of Contents \nThe differences between the U.S. statutory rate and the aggregate income tax provision are as follows:\n \nFiscal year ended January 31,\n2025\n2024\n2023\nIncome tax provision at U.S. Federal statutory rate\n$\n291\n \n$\n239\n \n$\n199\n \nState income tax benefit, net of the U.S. Federal benefit\n10\n \n24\n \n(\n3\n)\nForeign income taxed at rates different from the U.S. statutory rate\n(\n34\n)\n(\n12\n)\n22\n \nValuation allowance adjustment\n(\n15\n)\n1\n \n(\n38\n)\nTax effect of non-deductible stock-based compensation\n25\n \n38\n \n34\n \nStock compensation (windfall) / shortfall\n(\n28\n)\n2\n \n10\n \nResearch and development tax credit benefit\n(\n18\n)\n(\n17\n)\n(\n12\n)\nClosure of income tax audits and changes in uncertain tax positions\n52\n \n13\n \n11\n \nTax effect of officer compensation in excess of $\n1\n million\n9\n \n8\n \n10\n \nNon-deductible expenses\n5\n \n2\n \n1\n \nGlobal intangible low-taxed income, foreign derived intangible income\n(\n30\n)\n(\n39\n)\n(\n106\n)\nAcquisition-related integrations\n1\n \n(\n29\n)\n(\n2\n)\nOther\n4\n \n—\n \n(\n3\n)\nIncome tax provision \n$\n272\n \n$\n230\n \n$\n123\n \n    \nAutodesk’s fiscal 2025 tax expense is primarily driven by the U.S. and foreign tax expense, including withholding taxes on payments made to the United States or to Singapore from foreign sources, a partial audit settlement with the IRS, and related increase in reserves, offset by a decrease in tax expense relating to stock-based compensation and the tax benefit from the valuation allowance release in Australia.\n95\nTable of Contents \nSignificant components of Autodesk’s deferred tax assets and liabilities are as follows:\n \nJanuary 31,\n2025\n2024\nStock-based compensation\n$\n55\n \n$\n53\n \nResearch and development tax credit carryforwards\n109\n \n118\n \nForeign tax credit carryforwards\n20\n \n4\n \nAccrued compensation and benefits\n19\n \n11\n \nOther accruals not currently deductible for tax\n15\n \n15\n \nCapitalized research and development\n696\n \n514\n \nFixed assets\n18\n \n21\n \nLease liability\n61\n \n80\n \nTax loss carryforwards\n14\n \n10\n \nDeferred revenue\n427\n \n538\n \nPurchased technology \n38\n \n33\n \nOther\n40\n \n31\n \nTotal deferred tax assets\n1,512\n \n1,428\n \nLess: valuation allowance\n(\n131\n)\n(\n149\n)\nNet deferred tax assets\n1,381\n \n1,279\n \nIndefinite lived intangibles\n(\n143\n)\n(\n128\n)\nRight-of-use assets\n(\n37\n)\n(\n52\n)\nDeferred taxes on foreign earnings\n(\n28\n)\n(\n29\n)\nTotal deferred tax liabilities\n(\n208\n)\n(\n209\n)\nNet deferred tax assets\n$\n1,173\n \n$\n1,070\n \nAutodesk regularly assesses the need for a valuation allowance against its deferred tax assets. In making that assessment, Autodesk evaluates whether it is more likely than not that some or all of the deferred tax assets will not be realized based on all available positive and negative evidence. \nThe Company continues to retain a valuation allowance against Portugal, New Zealand, California, Massachusetts and Michigan deferred tax assets and deferred tax assets relating to capital losses or assets that will convert into a capital loss upon reversal in Australia and U.S., as we do not have sufficient income of the appropriate character to benefit these deferred tax assets. In fiscal 2025, the Company established a valuation allowance through goodwill in Australia related to negative evidence at the time of the Payapps Limited acquisition; however, due to positive evidence supporting the realization of its deferred tax assets the valuation allowance was released. In fiscal 2024, the Company established a valuation allowance in Massachusetts on the basis that it is more likely than not that some or all of the deferred tax assets will not be realized. The impact of this establishment was offset by a decrease in the valuation allowance in the Netherlands due to the elimination of the deferred tax assets in that jurisdiction in fiscal 2024.\nThe valuation allowance decreased by $\n18\n million in fiscal 2025, primarily due to the reduction of California deferred tax assets. The valuation allowance increased by $\n1\n million in fiscal 2024, due to the establishment of valuation allowance in Massachusetts offset with the release of the valuation allowance in the Netherlands due to the elimination of the deferred tax assets.\nThe Company has elected to recognize any potential GILTI obligations as an expense in the period it is incurred. \nAs of January 31, 2025, Autodesk had $\n7\n million of cumulative U.S. federal tax loss carryforwards and $\n316\n million of cumulative U.S. state tax loss carryforwards, which may be available to reduce future income tax liabilities in federal and state jurisdictions. The U.S. federal losses generated beginning in fiscal 2019 are carried forward indefinitely. The U.S. state tax loss carryforward will expire beginning fiscal 2025 through fiscal 2045. In addition to U.S. federal and state tax loss carryforwards, Portugal, Norway, New Zealand and other foreign jurisdictions incurred tax losses totaling $\n24\n million, which may be available to reduce future income tax liabilities. Our Portugal, Norway, and New Zealand losses of $\n8\n million, $\n9\n million, and $\n3\n million, \n96\nTable of Contents \nrespectively, have an indefinite expiration period. Portugal and New Zealand losses have a full valuation allowance against them on our balance sheet as the Company has determined it is more likely than not that these losses will not be utilized. \nAs of January 31, 2025, Autodesk had $\n130\n million of cumulative California state research tax credit carryforwards, $\n13\n million of cumulative Massachusetts state research tax credit carryforwards, and $\n42\n million of cumulative Canadian federal research, which may be available to reduce future income tax liabilities in the respective jurisdictions. The state research tax credit carryforwards in California and Massachusetts may reduce future California and Massachusetts income tax liabilities indefinitely in those respective states, and the Canadian research tax credit carryforwards will expire beginning fiscal 2031 through fiscal 2045. Autodesk also has $\n20\n million of cumulative U.S. federal foreign tax credit carryforwards, which may be available to reduce future U.S. tax liabilities. These foreign tax credits will expire beginning fiscal 2032 through fiscal 2035. As discussed above, the California and Massachusetts cumulative assets have full valuation allowance against them on our balance sheet as the Company has determined it is more likely than not that these losses and credits will not be utilized.\nUtilization of net operating losses and tax credits may be subject to an annual limitation due to ownership change limitations provided in the Internal Revenue Code and similar state provisions. This annual limitation may result in the expiration of net operating losses and credits before utilization. No ownership change has occurred through the balance sheet date that would result in permanent losses of the U.S. federal and state tax attributes.\nAs of January 31, 2025, the Company had $\n312\n million of gross unrecognized tax benefits, of which $\n47\n million would reduce our valuation allowance, if recognized.  The remaining $\n265\n million would impact the effective tax rate. The amount of unrecognized tax benefits will immaterially decrease in the next twelve months for statute lapses.\nA reconciliation of the beginning and ending amount of the gross unrecognized tax benefits is as follows:\nFiscal Year Ended January 31,\n2025\n2024\n2023\nGross unrecognized tax benefits at the beginning of the fiscal year (1)\n$\n261\n \n$\n238\n \n$\n217\n \nIncreases for tax positions of prior years (1)\n31\n \n23\n \n9\n \nDecreases for tax positions of prior years (1)\n—\n \n(\n11\n)\n(\n3\n)\nIncreases for tax positions related to the current year (1)\n29\n \n13\n \n21\n \nDecreases relating to settlements with taxing authorities\n(\n9\n)\n—\n \n(\n5\n)\nReductions as a result of lapse of the statute of limitations\n—\n \n(\n2\n)\n(\n1\n)\nGross unrecognized tax benefits at the end of the fiscal year\n$\n312\n \n$\n261\n \n$\n238\n \n  _______________\n(1)\nDuring the year ended January 31, 2024, the Company corrected its presentation to remove correlative benefits related to certain transfer pricing matters. The above comparatives for fiscal 2023 has been corrected to conform to the current period presentation. The effect of the change on the ending gross unrecognized tax benefits was $\n15\n million in fiscal 2023.\n    \nIt is the Company’s continuing practice to recognize interest and/or penalties related to income tax matters in income tax expense. Autodesk had $\n15\n million, $\n7\n million, and $\n5\n million, net of tax benefit, accrued for interest and penalties related to unrecognized tax benefits as of January 31, 2025, 2024, and 2023, respectively. There was $\n9\n million, $\n2\n million, and $(\n2\n) million of net expense for interest and penalties related to tax matters recorded through the consolidated statements of operations for the years ended January 31, 2025, 2024, and 2023, respectively.\nAutodesk’s U.S. and state income tax returns for fiscal 2002 through fiscal 2025 remain open to examination due to either net operating loss or credit carryforward. The Internal Revenue Service notified the Company of examination of the Company’s consolidated federal income tax returns for fiscal 2020 and 2021. This audit commenced in February 2022 and remains in progress. As of fiscal 2025, Autodesk settled on a partial disallowance of research and development credits and consequently the reserve on such credits for years not under audit has increased.\nAutodesk files tax returns in multiple foreign taxing jurisdictions with open tax years ranging from fiscal 2005 to 2025.\n \n97\nTable of Contents \n6.     \nAcquisitions \nFiscal 2025 Acquisitions\nThe results of operations for the following acquisitions are included in the accompanying Consolidated Statements of Operations since their respective acquisition dates. Pro forma results of operations have not been presented because the effects of these acquisitions were not material to Autodesk’s Consolidated Financial Statements.\nOn May 20, 2024, Autodesk acquired \n100\n% of Aether Media, Inc. (“Aether”), a provider of a cloud-based artificial intelligence pipeline for creating computer-generated 3D characters into live-action scenes, for total consideration of $\n131\n million in cash. Of the total consideration transferred, $\n122\n million is considered purchase consideration. The remaining amount of $\n9\n million was primarily recorded in “Prepaid expenses and other current assets” and “Long-term other assets” on our Consolidated Balance Sheets and will be amortized to compensation expense using the straight-line method over the vesting period. Autodesk expects to enhance artificial intelligence capabilities for Autodesk’s visual effects (“VFX”) creation tools and democratize high end VFX work on Autodesk’s Flow platform.\nOn March 15, 2024, Autodesk acquired \n100\n% of the PIX business of X2X, LLC (“PIX”), a production management solution for secure review and content collaboration in the media and entertainment industry for total consideration of $\n266\n million in cash. The acquisition is expected to foster broader collaboration and communication, as well as help drive greater efficiencies, in the production process.\nOn February 20, 2024, Autodesk acquired \n100\n% of the outstanding stock of Payapps Limited (“Payapps”), a leading cloud-based software platform for managing construction-related payments, for total consideration of $\n387\n million in cash. Of the total consideration transferred, $\n381\n million is considered purchase consideration. The remaining amount of $\n6\n million was recorded in “Prepaid expenses and other current assets” and “Long-term other assets” on our Consolidated Balance Sheets and will be amortized to compensation expense using the straight-line method over the vesting period. Autodesk expects to deepen Autodesk Construction Cloud’s footprint and provide a robust payment management offering to serve the needs of general contractors and trade contractors. Through automating the application of the payment process, Payapps’ solution provides greater transparency, reduces risk and helps accelerate time-to-payment. \nPurchase Price Allocation\nThe acquisitions during fiscal 2025 were accounted for as business combinations, and Autodesk recorded the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values at the date of each respective acquisition. The fair values assigned to the identifiable intangible assets acquired were based on estimates and assumptions determined by management. Autodesk recorded the excess of consideration transferred over the aggregate fair values as goodwill. The goodwill recorded was primarily attributable to synergies expected to arise after the respective acquisition. Goodwill of $\n159\n million and $\n185\n million is expected to be deductible for U.S. income tax purposes for Payapps and PIX, respectively. \nNo\n goodwill is deductible for U.S. income tax purposes for Aether. The transaction costs related to the acquisitions were not material.\nThe following table summarizes the fair value of the assets acquired and liabilities assumed by major class for the significant business combinations that were completed during the fiscal year ended January 31, 2025:\nPayapps\nPIX\nAether\nTotal\nDeveloped technologies\n$\n53\n \n$\n37\n \n$\n47\n \n$\n137\n \nCustomer relationships\n34\n \n33\n \n3\n \n70\n \nTrade name\n5\n \n—\n \n—\n \n5\n \nGoodwill\n300\n \n191\n \n81\n \n572\n \nDeferred revenue and long-term deferred revenue\n(\n4\n)\n(\n2\n)\n—\n \n(\n6\n)\nLong-term deferred income taxes\n(\n12\n)\n—\n \n—\n \n(\n12\n)\nNet tangible assets \n5\n \n7\n \n(\n9\n)\n3\n \nTotal\n$\n381\n \n$\n266\n \n$\n122\n \n$\n769\n \nFor the business combinations, the allocation of purchase price consideration to certain assets and liabilities as well as the final amount of purchase consideration are not yet finalized. For the items not yet finalized, Autodesk's estimates and assumptions are subject to change within the measurement period (up to one year from the acquisition date). The primary areas \n98\nTable of Contents \nof the preliminary purchase price allocation that are not yet finalized are amounts for tax assets and liabilities, deferred revenue, and residual goodwill.\nFiscal 2024 Acquisitions\nDuring the fiscal year ended January 31, 2024, Autodesk completed \nthree\n business combinations. The acquisition-date fair value of the consideration transferred totaled $\n85\n million in cash. Of the total consideration transferred, $\n71\n million was considered purchase consideration.\nThe results of operations for fiscal 2024 acquisitions were included in the accompanying Consolidated Statement of Operations from the dates of the respective acquisitions.  Goodwill of $\n35\n million  is deductible for U.S. income tax purposes.\nFiscal 2023 Acquisitions\nDuring the fiscal year ended January 31, 2023, Autodesk completed \ntwo\n business combinations. The acquisition-date fair value of the consideration transferred totaled $\n114\n million, which consisted of $\n96\n million of cash, \n40\n thousand shares of Autodesk’s restricted common stock at an aggregate fair value of $\n10\n million, and Autodesk issued a fixed amount of $\n5\n million in common stock at future dates to certain employees. Of the total consideration transferred, $\n97\n million was considered purchase consideration. Of the remaining amount, $\n10\n million was recorded in “Prepaid expenses and other current assets” and “Long-term other assets” on our Consolidated Balance Sheets and is amortized to stock-based compensation expense using the straight-line method over the vesting period, $\n5\n million was accounted for as liability-classified awards and is recognized as compensation expense using the straight-line method over the vesting period and $\n2\n million was recorded as stock-based compensation expense on the date of acquisition. \nThe results of operations for fiscal 2023 acquisitions were included in the accompanying Consolidated Statement of Operations from the dates of the respective acquisitions.  \nNo\n goodwill is deductible for U.S. income tax purposes.\n \n7.     \nDeferred Compensation \nAt January 31, 2025, Autodesk had investments in debt and equity securities that are held in a rabbi trust under non-qualified deferred compensation plans and a corresponding deferred compensation liability totaling $\n118\n million. Of this amount, $\n12\n million was classified as current and $\n106\n million was classified as non-current in the Consolidated Balance Sheet. Of the $\n100\n million related to investments and deferred compensation liability in a rabbi trust as of January 31, 2024, $\n10\n million was classified as current and $\n90\n million was classified as non-current. The current and non-current asset portions of the investments in debt and equity securities that are held in a rabbi trust under non-qualified deferred compensation plans are recorded in the Consolidated Balance Sheets under “Prepaid expenses and other current assets” and “Long-term other assets,” respectively.  The current and non-current portions of the deferred compensation liability are recorded in the Consolidated Balance Sheets under “Accrued compensation” and “Long-term other liabilities,” respectively. \nCosts to obtain a contract with a customer\nSales commissions earned by our internal sales personnel and our solution providers are considered incremental and recoverable costs of obtaining a contract with a customer. The ending balance of assets recognized from costs to obtain a contract with a customer was $\n467\n million and $\n210\n million as of January 31, 2025 and January 31, 2024, respectively.  These assets are recorded in “Prepaid expenses and other current assets” and  “Long-term other assets” in the Consolidated Balance Sheet. Amortization expense related to assets recognized from costs to obtain a contract with a customer was $\n212\n million, $\n140\n million, and $\n138\n million during fiscal years ended January 31, 2025, 2024, and 2023, respectively. Autodesk did \nno\nt recognize any contract cost impairment losses during the fiscal years ended January 31, 2025, 2024, or 2023.\n \n8.     \nBorrowing Arrangements \nIn November 2022, the Company entered into an Amended and Restated Credit Agreement, (the “Credit Agreement”) by and among the Company, the lenders party thereto and Citibank, N.A. (“Citibank”), as administrative agent, which provides for an unsecured revolving loan facility in the aggregate principal amount of $\n1.50\n billion, with an option to be increased up to $\n2.0\n billion. The revolving credit facility is available for working capital or other business needs. The Credit Agreement contains customary covenants that could, among other things, restrict the imposition of liens on Autodesk’s assets, and restrict Autodesk’s ability to incur additional indebtedness or make dispositions of assets if Autodesk fails to maintain compliance with \n99\nTable of Contents \nthe financial covenants. The Credit Agreement requires the Company to maintain a maximum leverage ratio of Consolidated Covenant Debt to Consolidated EBITDA (each as defined in the Credit Agreement) no greater than \n3.50\n:1.00 during the term of the credit facility, subject to adjustment following the consummation of certain acquisitions up to \n4.00\n:1.00 for up to \nfour\n consecutive fiscal quarters. At January 31, 2025, Autodesk was in compliance with the Credit Agreement covenants. Revolving loans under the Credit Agreement will bear interest, at the Company’s option, at either (i) a per annum rate equal to the Base Rate (as defined in the Credit Agreement) plus a margin of between \n0.000\n% and \n0.375\n%, depending on the Company’s Public Debt Rating (as defined in the Credit Agreement), or (ii) a per annum rate equal to the rate at which dollar deposits are offered in the Secured Overnight Financing Rate, plus a margin of between \n0.785\n% and \n1.375\n%, depending on Company’s Public Debt Rating. The interest rates for the revolving credit facility are subject to upward or downward adjustments, on an annual basis, if the Company achieves, or fails to achieve, certain sustainability-linked targets based on \ntwo\n key performance indicator metrics: (i) the amount of scope 1 and 2 greenhouse gas emissions from the global operations of the Company and its subsidiaries during a fiscal year less qualified emissions reduction instruments and (ii) the percentage of employees of the Company and its subsidiaries identifying as female working in technical roles. The maturity date on the Credit Agreement is September 30, 2026. At January 31, 2025, Autodesk had \nno\n outstanding borrowings under the Credit Agreement.\nIn October 2021, Autodesk issued $\n1.0\n billion aggregate principal amount of \n2.4\n% notes due December 15, 2031 (“2021 Notes”).  Net of a discount of $\n3\n million and issuance costs of $\n9\n million, Autodesk received net proceeds of $\n988\n million from issuance of the 2021 Notes.  Both the discount and issuance costs are being amortized to interest expense over the term of the 2021 Notes using the effective interest method. The 2021 Notes were designated as sustainability bonds, the net proceeds of which are used to fund environmentally and socially responsible projects in the following areas: eco-efficient products, production technologies, and processes, sustainable water and wastewater management, renewable energy & energy efficiency, green buildings, pollution prevention and control, and socioeconomic advancement and empowerment.\nIn January 2020, Autodesk issued $\n500\n million aggregate principal amount of \n2.85\n% notes due January 15, 2030 (“2020 Notes”). Net of a discount of $\n1\n million and issuance costs of $\n5\n million, Autodesk received net proceeds of $\n494\n million from issuance of the 2020 Notes. Both the discount and issuance costs are being amortized to interest expense over the term of the 2020 Notes using the effective interest method. The proceeds of the 2020 Notes were used for the repayment of $\n450\n million of debt due June 15, 2020, and the remainder is available for general corporate purposes. \nIn June 2017, Autodesk issued $\n500\n million aggregate principal amount of \n3.5\n% notes due June 15, 2027 (the “2017 Notes”). Net of a discount of $\n3\n million and issuance costs of $\n5\n million, Autodesk received net proceeds of $\n492\n million from issuance of the 2017 Notes. Both the discount and issuance costs are being amortized to interest expense over the term of the 2017 Notes using the effective interest method. The proceeds of the 2017 Notes have been used for the repayment of $\n400\n million of debt due December 15, 2017, and the remainder is available for general corporate purposes. \nIn June 2015, Autodesk issued $\n300\n million aggregate principal amount of \n4.375\n% notes due June 15, 2025 (“ 2015 Notes”). Net of a discount of $\n1\n million, and issuance costs of $\n3\n million, Autodesk received net proceeds of $\n296\n million from issuance of the 2015 Notes. Both the discount and issuance costs are being amortized to interest expense over the respective terms of the 2015 Notes using the effective interest method. The proceeds of the 2015 Notes are available for general corporate purposes. \nThe 2021 Notes, 2020 Notes, 2017 Notes, and the 2015 Notes may all be redeemed at any time, subject to a make whole premium. In addition, upon the occurrence of certain change of control triggering events, Autodesk may be required to repurchase all the Notes, at a price equal to \n101\n% of their principal amount, plus accrued and unpaid interest to the date of repurchase. All Notes contain restrictive covenants that limit Autodesk’s ability to create certain liens, to enter into certain sale and leaseback transactions and to consolidate or merge with, or convey, transfer, or lease all or substantially all of its assets, subject to important qualifications and exceptions. \n100\nTable of Contents \nBased on the quoted market prices, the approximate fair value of the notes as of January 31, 2025, were as follows:\n \nAggregate Principal Amount\nFair value\n2015 Notes\n$\n300\n \n$\n299\n \n2017 Notes\n500\n \n487\n \n2020 Notes\n500\n \n455\n \n2021 Notes\n1,000\n \n847\n \n        \nThe expected future principal payments for all borrowings as of January 31, 2025, were as follows:\nFiscal year ending\n2026\n$\n300\n \n2027\n—\n \n2028\n500\n \n2029\n—\n \n2030\n500\n \nThereafter\n1,000\n \nTotal principal outstanding\n$\n2,300\n \n9.     \nLeases \nAutodesk has operating leases for real estate, vehicles and certain equipment. Leases have remaining lease terms of less than \n1\n year to \n65\n years, some of which include options to extend the lease with renewal terms from \n1\n year to \n8\n years\n \nand some of which include options to terminate the leases from less than \n1\n year to \n5\n years. Options to extend the lease are included in the lease liability if they are reasonably certain of being exercised. Options to terminate are considered in determining the lease liability if they are reasonably certain of being exercised. Payments under our lease arrangements are primarily fixed, however, certain lease agreements contain variable payments, which are expensed as incurred and not included in the operating lease assets and liabilities. These amounts include payments affected by the Consumer Price Index, payments for common area maintenance that are subject to annual reconciliation, and payments for maintenance and utilities. The Company’s leases do not contain residual value guarantees or material restrictive covenants. Short-term leases are recognized in the Consolidated Statement of Operations on a straight-line basis over the lease term. Short-term lease expense was not material for the periods presented. Changes in operating lease right-of-use assets and operating lease liabilities are presented net in the “accounts payable and other liabilities” line in the Consolidated Statements of Cash Flows with the exception of “Lease-related asset impairments” which is presented in “Adjustments to reconcile net income to net cash provided by operating activities”.\nAutodesk recorded \nno\n operating lease right-of-use assets impairment charges during the fiscal year ended January 31, 2025. During the fiscal years ended January 31, 2024 and 2023, Autodesk recorded total operating lease right-of-use assets impairment charges of $\n9\n million and $\n29\n million, respectively. Autodesk assessed the asset groupings for disaggregation based on the proposed changes in use of the facilities.  For asset groups where impairment was triggered, Autodesk utilized an income approach to value the asset groups by developing discounted cash flow models. The significant assumptions used in the discounted cash flow models for each of the asset groups included projected sublease income over the remaining lease terms, expected downtime prior to the commencement of future subleases, expected lease incentives offered to future tenants, and discount rates that reflected the level of risk associated with these future cash flows. These significant assumptions are considered Level 1 and Level 2 inputs in accordance with the fair value hierarchy described in Note 1, “Business and Summary of Significant Accounting Policies.” The operating lease right-of-use assets and other lease-related assets charges are included in “general and administrative” in the Company’s Consolidated Statements of Operations.  \n101\nTable of Contents \nThe components of lease cost were as follows: \nFiscal Year Ended January 31, 2025\nCost of subscription and maintenance revenue\nCost of other revenue\nMarketing and sales\nResearch and development\nGeneral and administrative\nTotal\nOperating lease cost\n$\n6\n \n$\n2\n \n$\n25\n \n$\n22\n \n$\n11\n \n$\n66\n \nVariable lease cost\n1\n \n—\n \n5\n \n5\n \n2\n \n13\n \nFiscal Year Ended January 31, 2024\nCost of subscription and maintenance revenue\nCost of other revenue\nMarketing and sales\nResearch and development\nGeneral and administrative\nTotal\nOperating lease cost\n$\n7\n \n$\n2\n \n$\n28\n \n$\n23\n \n$\n11\n \n$\n71\n \nVariable lease cost\n1\n \n1\n \n6\n \n5\n \n3\n \n16\n \nFiscal Year Ended January 31, 2023\nCost of subscription and maintenance revenue\nCost of other revenue\nMarketing and sales\nResearch and development\nGeneral and administrative\nTotal\nOperating lease cost\n$\n8\n \n$\n3\n \n$\n36\n \n$\n27\n \n$\n11\n \n$\n85\n \nVariable lease cost\n1\n \n—\n \n6\n \n5\n \n2\n \n14\n \n \nSupplemental operating cash flow information related to leases was as follows:\nFiscal Year Ended January 31, 2025\nFiscal Year Ended January 31, 2024\nFiscal Year Ended January 31, 2023\nCash paid for operating leases included in operating cash flows (1)\n$\n93\n \n$\n112\n \n$\n115\n \nNon-cash operating lease liabilities arising from obtaining operating right-of-use assets\n3\n \n48\n \n48\n \n  _______________\n(1)    Includes $\n13\n million, $\n16\n million, and $\n14\n million in variable lease payments not included in “Operating lease liabilities” and “Long-term operating lease liabilities” on the Consolidated Balance Sheet for fiscal years ended January 31, 2025,  2024, and 2023, respectively.\nThe weighted average remaining lease term for operating leases is \n5.8\n years and \n6.2\n years at January 31, 2025 and 2024, respectively. The weighted average discount rate was \n2.90\n% and \n2.86\n% at January 31, 2025 and 2024, respectively,\n102\nTable of Contents \nMaturities of operating lease liabilities were as follows:\nFiscal year ending\n2026\n$\n65\n \n2027\n59\n \n2028\n49\n \n2029\n41\n \n2030\n27\n \nThereafter\n54\n \n295\n \nLess imputed interest\n23\n \nPresent value of operating lease liabilities\n$\n272\n \nAutodesk has subleased certain office space to a third party and has classified the sublease as an operating lease. The sublease has a remaining lease term of \n7.1\n years. Sublease income was $\n8\n million, $\n8\n million, and $\n5\n million during the fiscal years ended January 31, 2025, 2024, and 2023, respectively. Sublease income is recorded as a reduction of lease expense in the Company’s Consolidated Statements of Operations.\nOperating lease amounts in the table above do not include sublease income payments of $\n64\n million. Autodesk expects to receive sublease income payments of approximately $\n34\n million for fiscal 2026 through fiscal 2030 and $\n30\n million thereafter.\nAs of January 31, 2025, Autodesk had \nno\n operating lease minimum lease payments for executed leases that have not yet commenced.\n10. \nDerivative Instruments\nThe effects of derivatives designated as hedging instruments on Autodesk’s Consolidated Statements of Operations were as follows for the fiscal years ended January 31, 2025, 2024, and 2023, (amounts presented include any income tax effects):\n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\nAmount of gain (loss) recognized in accumulated other comprehensive loss, net of tax, (effective portion)\n$\n1\n \n$\n(\n41\n)\n$\n40\n \nAmount and location of gain (loss) reclassified from accumulated other comprehensive loss into income (effective portion)\nNet revenue\n$\n19\n \n$\n57\n \n$\n60\n \nCost of revenue\n—\n \n—\n \n(\n3\n)\nOperating expenses\n(\n5\n)\n—\n \n(\n21\n)\nTotal\n$\n14\n \n$\n57\n \n$\n36\n \nThe amount and location of gain (loss) recognized in net income of derivatives not designated as hedging instruments on Autodesk’s Consolidated Statements of Operations were as follows for the fiscal years ended January 31, 2025, 2024, and 2023, (amounts presented include any income tax effects):\n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\nInterest and other income (expense), net\n$\n22\n \n$\n9\n \n$\n7\n \n See Note 3, “Financial Instruments” for the fair values of derivative instruments in Autodesk’s Consolidated Balance Sheets as of January 31, 2025, and 2024. \nForeign currency contracts designated as cash flow hedges \n103\nTable of Contents \nAutodesk uses foreign currency contracts to reduce the exchange rate impact on a portion of the net revenue or operating expense of certain anticipated transactions. These currency collars and forward contracts are designated and documented as cash flow hedges. The notional amounts of these contracts are presented net settled and were $\n1.52\n billion at January 31, 2025, and $\n1.25\n billion at January 31, 2024. Outstanding contracts are recognized as either assets or liabilities on the Company’s Consolidated Balance Sheets at fair value. The majority of the net gain of $\n24\n million remaining in “Accumulated other comprehensive loss” as of January 31, 2025, is expected to be recognized into earnings within the next 24 months.\nDerivatives not designated as hedging instruments \nAutodesk uses foreign currency contracts that are not designated as hedging instruments to reduce the exchange rate risk associated primarily with foreign currency denominated receivables, payables, and cash. The notional amounts of these foreign currency contracts are presented net settled and were $\n1.14\n billion at January 31, 2025, and $\n455\n million at January 31, 2024.\n \n11.     \nCommitments and Contingencies \nPurchase Commitments\nIn the normal course of business, Autodesk enters into various purchase commitments for goods or services. Total non-cancellable purchase commitments as of January 31, 2025, were approximately $\n843\n million for periods through fiscal 2033. These purchase commitments primarily result from contracts entered into for the acquisition of cloud services, marketing, and commitments related to our investment agreements with limited liability partnership funds. \nAutodesk has certain royalty commitments associated with the sale and licensing of certain products. Royalty expense is generally based on a fixed rate over a specified period, dollar amount per unit sold or a percentage of the underlying revenue. Royalty expense, which was recorded under cost of subscription and maintenance revenue and cost of other revenue on Autodesk’s Consolidated Statements of Operations, was $\n23\n million in fiscal 2025, $\n21\n million in fiscal 2024, and $\n18\n million in fiscal 2023.\nGuarantees and Indemnifications\nIn the normal course of business, Autodesk provides indemnifications of varying scopes, including limited product warranties and indemnification of customers against claims of intellectual property infringement made by third parties arising from the use of its products or services. Autodesk accrues for known indemnification issues if a loss is probable and can be reasonably estimated. Historically, costs related to these indemnifications have not been significant, and because potential future costs are highly variable, Autodesk is unable to estimate the maximum potential impact of these indemnifications on its future results of operations.\nIn connection with the purchase, sale, or license of assets or businesses with third parties, Autodesk has entered into or assumed customary indemnification agreements related to the assets or businesses purchased, sold, or licensed. Historically, costs related to these indemnifications have not been significant, and because potential future costs are highly variable, Autodesk is unable to estimate the maximum potential impact of these indemnifications on its future results of operations.\nAs permitted under Delaware law, Autodesk has agreements whereby it indemnifies its officers and directors for certain events or occurrences while the officer or director is, or was, serving at Autodesk’s request in such capacity. The maximum potential amount of future payments Autodesk could be required to make under these indemnification agreements is unlimited; however, Autodesk has directors’ and officers’ liability insurance coverage that is intended to reduce its financial exposure and may enable Autodesk to recover a portion of any future amounts paid. Autodesk believes the estimated fair value of these indemnification agreements in excess of applicable insurance coverage is minimal.\nLegal Proceedings\nAutodesk is involved in a variety of claims, suits, inquiries, investigations, and proceedings in the normal course of business including claims of alleged infringement of intellectual property rights, commercial, employment, tax, prosecution of unauthorized use, business practices, and other matters. Autodesk routinely reviews the status of each significant matter and assesses its potential financial exposure. If the potential loss from any matter is considered probable and the amount can be reasonably estimated, Autodesk records a liability for the estimated loss. Because of inherent uncertainties related to these legal matters, Autodesk bases its loss accruals on the best information available at the time. As additional information becomes \n104\nTable of Contents \navailable, Autodesk reassesses its potential liability and may revise its estimates. In the Company’s opinion, resolution of pending matters is not expected to have a material adverse impact on its consolidated results of operations, cash flows, or its financial position. Given the unpredictable nature of legal proceedings, there is a reasonable possibility that an unfavorable resolution of one or more such proceedings could in the future materially affect the Company’s results of operations, cash flows, or financial position in a particular period, however, based on the information known by the Company as of the date of this filing and the rules and regulations applicable to the preparation of the Company’s financial statements, any such amount is either immaterial or it is not possible to provide an estimated amount of any such potential loss.\nIn early March 2024, the Audit Committee of Autodesk’s Board of Directors commenced an internal investigation with the assistance of outside counsel and advisors regarding the Company’s free cash flow and non-GAAP operating margin practices (the “Internal Investigation”). On March 8, 2024, the Company voluntarily contacted the U.S. Securities and Exchange Commission (“SEC”) to inform it of the Internal Investigation. On April 3, 2024, the United States Attorney’s Office for the Northern District of California (“USAO”) contacted the Company regarding the Internal Investigation. The Company voluntarily provided the SEC and USAO with certain documents relating to the Internal Investigation and will continue to cooperate with the SEC and USAO. At this stage, the Company cannot reasonably estimate the amount of any possible financial loss that could result from this matter.\nOn April 24, 2024, Michael Barkasi filed a purported federal securities class action complaint in the Northern District of California against the Company, our Chief Executive Officer, Andrew Anagnost, and our former Chief Financial Officer, Deborah L. Clifford.  The complaint, which was filed shortly after the Company’s announcement of the Internal Investigation, generally alleges that the defendants made false and misleading statements in violation of Sections 10(b) and 20(a) of the Securities Exchange Act of 1934 (the “Exchange Act”), and Rule 10b-5 promulgated thereunder.  On July 10, 2024, the Court appointed a lead plaintiff in the action, and an amended complaint was filed on September 16, 2024. The action purports to be brought on behalf of those who purchased or otherwise acquired the Company’s securities between February 23, 2023 and April 16, 2024, and seeks unspecified damages and other relief. On November 25, 2024, defendants filed a motion to dismiss the complaint. At this stage, the Company cannot reasonably estimate the amount of any possible financial loss that could result from this matter.\n12.     \nStock Repurchase Program \nAutodesk has stock repurchase programs that are used to offset dilution from the issuance of stock under the Company’s employee stock plans and for such other purposes as may be in the interests of Autodesk and its stockholders, which has the effect of returning excess cash generated from the Company’s business to stockholders. Autodesk repurchased and retired \n3\n million shares in fiscal 2025 at an average repurchase price of $\n278.86\n per share, \n4\n million shares in fiscal 2024 at an average repurchase price of $\n201.54\n per share, and \n5\n million shares in fiscal 2023 at an average repurchase price of $\n198.51\n per share.\nAt January 31, 2025, $\n3.88\n billion and $\n5\n billion remained available for repurchase under the November 2022 and November 2024 repurchase programs approved by the Board of Directors, respectively. The share repurchase programs do not have an expiration date and the pace and timing of repurchases will depend on factors such as cash generation from operations, available surplus, the volume of employee stock plan activity, remaining shares available in the authorized pool, cash requirements for acquisitions, cash requirements to retire outstanding debt, economic and market conditions, stock price, and legal and regulatory requirements.\n13.     \nInterest and Other Income (Expense), net  \nInterest and other income (expense), net\n, consists of the following:\n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\nInterest and investment income (expense), net \n$\n28\n \n$\n26\n \n$\n(\n71\n)\nGain on foreign currency\n6\n \n10\n \n15\n \n(Loss) gain on strategic investments\n(\n10\n)\n(\n32\n)\n1\n \nOther income \n6\n \n4\n \n12\n \nInterest and other income (expense), net\n$\n30\n \n$\n8\n \n$\n(\n43\n)\n14.     \nAccumulated Other Comprehensive Loss \n105\nTable of Contents \nAccumulated other comprehensive loss, net of taxes, consisted of the following:\nNet Unrealized Gains (Losses) on Derivative Instruments\nNet Unrealized Gains (Losses) on Available for Sale Securities\nDefined Benefit Pension Components\nForeign Currency Translation Adjustments\nTotal\nBalances, January 31, 2023\n$\n64\n \n$\n18\n \n$\n(\n19\n)\n$\n(\n248\n)\n$\n(\n185\n)\nOther comprehensive income (loss) before reclassifications\n10\n \n1\n \n(\n10\n)\n(\n9\n)\n(\n8\n)\nPre-tax (gain) loss reclassified from accumulated other comprehensive income\n(\n57\n)\n1\n \n4\n \n—\n \n(\n52\n)\nTax effects\n6\n \n—\n \n1\n \n4\n \n11\n \nNet current period other comprehensive (loss) income\n(\n41\n)\n2\n \n(\n5\n)\n(\n5\n)\n(\n49\n)\nBalances, January 31, 2024\n23\n \n20\n \n(\n24\n)\n(\n253\n)\n(\n234\n)\nOther comprehensive income (loss) before reclassifications\n13\n \n1\n \n(\n2\n)\n(\n50\n)\n(\n38\n)\nPre-tax (gain) loss reclassified from accumulated other comprehensive income\n(\n14\n)\n(\n1\n)\n1\n \n—\n \n(\n14\n)\nTax effects\n2\n \n—\n \n—\n \n(\n1\n)\n1\n \nNet current period other comprehensive (loss) income \n1\n \n—\n \n(\n1\n)\n(\n51\n)\n(\n51\n)\nBalances, January 31, 2025\n$\n24\n \n$\n20\n \n$\n(\n25\n)\n$\n(\n304\n)\n$\n(\n285\n)\nReclassifications related to gains and losses on available-for-sale debt securities are included in “\nInterest and other income (expense), net\n.” Refer to Note 10, “Derivative Instruments” for the amount and location of reclassifications related to derivative instruments. Reclassifications of the defined benefit pension components of net periodic benefit cost are included in “\nInterest and other income (expense), net\n.”\n \n15.     \nNet Income Per Share \nBasic net income per share is computed using the weighted average number of shares of common stock outstanding during the period. Diluted net income per share is computed using the weighted average number of shares of common stock outstanding during the period and potentially dilutive common shares, including the effect of restricted stock units, performance share awards, and stock options using the treasury stock method.  \nThe following table sets forth the computation of the numerators and denominators used in the basic and diluted net income per share amounts:\n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\nNumerator:\nNet income\n$\n1,112\n \n$\n906\n \n$\n823\n \nDenominator:\nWeighted average shares for basic net income per share\n215\n \n214\n \n216\n \nEffect of dilutive securities\n2\n \n2\n \n2\n \nWeighted average shares for dilutive net income per share\n217\n \n216\n \n218\n \nBasic net income per share\n$\n5.17\n \n$\n4.23\n \n$\n3.81\n \nDiluted net income per share\n$\n5.12\n \n$\n4.19\n \n$\n3.78\n \nThe computation of diluted net income per share does not include shares that are anti-dilutive under the treasury stock method because their exercise prices are higher than the average market value of Autodesk’s stock during the fiscal year. The effect of \n92\n thousand, \n297\n thousand, and \n962\n thousand anti-dilutive shares were excluded from the computation of diluted net income per share for the fiscal years ended January 31, 2025, 2024, and 2023, respectively.\n \n106\nTable of Contents \n16.     \nRetirement Benefit Plans \nPretax Savings Plan\nAutodesk has a 401(k) plan that covers nearly all U.S. employees. Eligible employees may contribute up to \n75\n% of their pretax salary, subject to limitations mandated by the Internal Revenue Service. Autodesk makes voluntary cash contributions and matches a portion of employee contributions in cash. Autodesk’s contributions were $\n27\n million in fiscal 2025, $\n26\n million in fiscal 2024, and $\n26\n million in fiscal 2023. Autodesk does not allow participants to invest in Autodesk common stock through the 401(k) plan.\nDefined Benefit Pension Plans\nAutodesk provides certain defined benefit pension plans to employees located in countries outside of the United States, primarily the United Kingdom, Switzerland, and Japan. The Company deposits funds for specific plans, consistent with the requirements of local law, with insurance companies or third-party trustees, or into government-managed accounts, and accrues for the unfunded portion of the obligation, where material.\nThe projected benefit obligation was $\n78\n million and $\n81\n million as of January 31, 2025, and January 31, 2024, respectively. The accumulated benefit obligation was $\n70\n million and $\n73\n million as of January 31, 2025, and January 31, 2024, respectively. The related fair value of plan assets was $\n74\n million and $\n77\n million as of January 31, 2025, and January 31, 2024, respectively. Our defined pension plan assets are measured at fair value and consist primarily of insurance contracts categorized as level 2 in the fair value hierarchy and an investment fund valued using net asset value. The insurance contracts represent the immediate cash surrender value of assets managed by qualified insurance companies. The assets held in the investment fund are invested in a diversified growth fund actively managed by a third party.\nAutodesk recognized an aggregate pension liability for the funded status of $\n9\n million and $\n6\n million in “Long-term other liabilities” on the Consolidated Balance Sheet as of January 31, 2025, and January 31, 2024, respectively. Our total net periodic pension plan cost was $\n3\n million, $\n2\n million and $\n3\n million for fiscal years 2025, 2024, and 2023, respectively. \nOur expected funding for the plans during fiscal 2026 is approximately $\n4\n million.  \nEstimated Future Benefit Payments\nEstimated benefit payments over the next 10 fiscal years are as follows:\nPension Benefits\n2026\n$\n4\n \n2027\n4\n \n2028\n3\n \n2029\n4\n \n2030\n4\n \n2031-2035\n21\n \nTotal\n$\n40\n \nDefined Contribution Plans\nAutodesk also provides defined contribution plans in certain foreign countries where required by statute. Autodesk’s funding policy for foreign defined contribution plans is consistent with the local requirements in each country. Autodesk’s contributions to these plans were $\n47\n million in fiscal 2025, $\n43\n million in fiscal 2024, and $\n39\n million in fiscal 2023.\nCash Balance Plans\nAutodesk provides a cash balance plan that insures the risks of disability, death, and longevity, in which the vested pension capital is reinvested and provides a 100% capital and interest guarantee. The weighted-average guaranteed interest crediting rate for cash balance plans was \n1\n%, \n1\n%, and \n1\n% for mandatory retirement savings and \n0.5\n%, \n0.3\n%, and \n0.3\n% for supplementary retirement savings for fiscal 2025, 2024, and 2023, respectively. \n107\nTable of Contents \nOther Plans\nIn addition, Autodesk offers a non-qualified deferred compensation plan to certain key employees whereby they may defer a portion (or all) of their annual compensation until retirement or a different date specified by the employee in accordance with terms of the plan. See Note 7, “Deferred Compensation,” for further discussion.\n17.     \nSubsequent Events\nDuring fiscal 2026, Autodesk initiated a restructuring plan (“2026 Plan”) to support Autodesk's initiatives to optimize its go-to-market organization and, at the same time, to reallocate resources to Autodesk’s strategic priorities of investments in cloud, platform and artificial intelligence. With this restructuring plan, Autodesk is realigning roles to maximize talent investments and to distribute critical expertise globally. \nThe 2026 Plan includes a gross reduction in force that will result in the aggregate termination of approximately \n9\n% of the Company’s workforce, or approximately \n1,350\n employees, other exit costs and facility reductions. Total \npre-tax restructuring charges\n are estimated to be approximately $\n135\n million to $\n150\n million. Autodesk expects to complete the 2026 Plan by the end of its fourth quarter of fiscal 2026 (ending January 31, 2026). Under the 2026 Plan, Autodesk recorded restructuring charges of $\n15\n million for the fiscal year ended January 31, 2025, in accordance with applicable accounting guidance.\n \n108\nTable of Contents \nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Autodesk, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Autodesk, Inc. (the Company) as of January 31, 2025 and 2024, the related consolidated statements of operations, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended January 31, 2025, and the related notes and financial statement schedule listed in the Index at Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at January 31, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended January 31, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of January 31, 2025, based on criteria established in Internal Control\n—\nIntegrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated March 6, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates. \n109\nTable of Contents \nRevenue Recognition\nDescription of the Matter\nAs discussed in Note 1 to the consolidated financial statements, revenue is recognized when the Company's offerings are delivered to its customers, in an amount that reflects the consideration expected in exchange for the products and services. \nThe Company enters into contracts with its customers that may include promises to transfer term-based product subscriptions, cloud service offerings, and support services.  Auditing the Company’s revenue recognition was challenging and complex due to the effort required to analyze the accounting treatment for the Company’s various product and service offerings in accordance with ASC 606, Revenue from Contracts with Customers. This involved assessing the impact of terms and conditions in contracts with customers to determine whether products and services are considered distinct performance obligations and the related timing of revenue recognition.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of internal controls over the Company's identification and evaluation of distinct performance obligations and the determination of the timing of revenue recognition. \nAmong other procedures, to evaluate management’s identification and evaluation of the distinct performance obligations and timing of revenue recognition, we read executed contracts for a sample of sales transactions to understand the contract, identify the promised products and services in the contract, and identify the distinct performance obligations and related timing of revenue recognition. \n                                \n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 1983.\nSan Francisco, California\nMarch 6, 2025 \n \n110\nTable of Contents \nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Autodesk, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Autodesk, Inc.’s internal control over financial reporting as of January 31, 2025, based on criteria established in Internal Control\n—\nIntegrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Autodesk, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of January 31, 2025, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the accompanying consolidated balance sheets of the Company as of  January 31, 2025 and 2024, the related consolidated statements of operations, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended January 31, 2025, and the related notes and financial statement schedule listed in the Index at Item 15(a)(2) and our report dated March 6, 2025, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.  \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP                                \nSan Francisco, California\nMarch 6, 2025 \n111\nTable of Contents \nITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.\nCONTROLS AND PROCEDURES\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nWe maintain “disclosure controls and procedures,” as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Our disclosure controls and procedures are designed to ensure that information required to be disclosed in our Exchange Act reports is (i) recorded, processed, summarized, and reported within the time periods specified in the rules of the Securities and Exchange Commission (“SEC”), and (ii) accumulated and communicated to Autodesk management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. We conducted an evaluation, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Annual Report on Form 10-K. Based upon this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures are effective as of January 31, 2025. \nMANAGEMENT'S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended). Our management assessed the effectiveness of our internal control over financial reporting as of January 31, 2025. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in the 2013 Internal Control—Integrated Framework. Our management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal control over financial reporting will necessarily prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within Autodesk have been detected.\nOur management has concluded that, as of January 31, 2025, our internal control over financial reporting was effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our independent registered public accounting firm, Ernst & Young LLP, has issued an audit report on our internal control over financial reporting, which is included in Part II, Item 8 herein.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere were no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) during the three months ended January 31, 2025, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B.\nOTHER INFORMATION\nSECURITIES TRADING PLANS OF DIRECTORS AND EXECUTIVE OFFICERS\nDuring our last fiscal quarter, the following director(s) and officer(s), as defined in Rule 16a-1(f), adopted a “Rule 10b5-1 trading arrangement” as defined in Regulation S-K Item 408, as follows: \nOn \nDecember 4, 2024\n, \nDr. Ayanna Howard\n, one of our directors, \nadopted\n a Rule 10b5-1 trading arrangement providing for the sale from time to time of an aggregate of up to \n8,170\n shares of our common stock.  The trading arrangement is intended to satisfy the affirmative defense in Rule 10b5-1(c).  The duration of the trading arrangement is until \nDecember 4, 2026\n, or earlier if all transactions under the trading arrangement are completed.\n112\nTable of Contents \nNo other officers or directors, as defined in Rule 16a-1(f), \nadopted\n and/or \nterminated\n a “Rule 10b5-1 trading arrangement” or a \"non-10b5-1 trading arrangement” or a \"non-10b5-1 trading arrangement” as defined in Regulation S-K Item 408, during the last fiscal quarter.\nITEM 9C.     DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\n113\nTable of Contents \nPART III\nCertain information required by Part III is omitted from this Annual Report because we intend to file a definitive proxy statement pursuant to Regulation 14A for our Annual Meeting of Stockholders not later than 120 days after the end of the fiscal year covered by this Annual Report (the “Proxy Statement”) and certain information included therein is incorporated herein by reference. Only those sections of the Proxy Statement that specifically address the items set forth herein are incorporated by reference.\nITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item is incorporated herein by reference to the sections entitled “Proposal One: Election of Directors,” “Security Ownership of Certain Beneficial Owners and Management,”  “Governance and our Board of Directors,” and “Corporate Governance Guidelines” in our Proxy Statement.\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following sets forth certain information as of March 6, 2025, regarding our executive officers.\nName\nAge\nPosition\nAndrew Anagnost\n60\nPresident and Chief Executive Officer\nJanesh Moorjani\n52\nExecutive Vice President and Chief Financial Officer\nSteve M. Blum\n60\nExecutive Vice President and Chief Operating Officer\nRuth Ann Keene\n56\nExecutive Vice President, Corporate Affairs, Chief Legal Officer & Corporate Secretary\nRebecca Pearce\n47\nExecutive Vice President, Chief People Officer\nAndrew Anagnost\n joined Autodesk in September 1997 and has served as President and Chief Executive Officer since June 2017. He also served as Interim Chief Financial Officer from January 2021 to March 2021. Dr. Anagnost served as Co-CEO from February 2017 to June 2017, Chief Marketing Officer from December 2016 to June 2017 and as the Company’s Senior Vice President, Business Strategy & Marketing, from March 2012 to June 2017. From December 2009 to March 2012, Dr. Anagnost was Vice President, Product Suites and Web Services of the Company. Prior to this position, Dr. Anagnost served as Vice President of CAD/CAE products for the manufacturing division of the Company from March 2007 to December 2009. Previously, Dr. Anagnost held other senior management positions at the Company. Prior to joining the Company, Dr. Anagnost held various engineering, sales, marketing and product management positions at Lockheed Aeronautical Systems Company and EXA Corporation. He also served as an NRC post-doctoral fellow at NASA Ames Research Center.\nJanesh Moorjani \njoined Autodesk as Executive Vice President and Chief Financial Officer in December 2024. Mr. Moorjani previously served as Chief Financial Officer of Elastic NV (“Elastic”), a software company for search-powered solutions, since August 2017 and assumed the additional responsibilities of Chief Operations Officer in May 2022. Prior to joining Elastic, Mr. Moorjani served in various executive and senior leadership, finance and sales positions at Infoblox, VMware, Cisco, PTC, and Goldman Sachs. Mr. Moorjani holds a Bachelor of Commerce degree from the University of Mumbai and an M.B.A. from the Wharton School of the University of Pennsylvania.\nSteven M. Blum\n joined Autodesk in January 2003 and has served as Executive Vice President and Chief Operating Officer since November 1, 2022. He previously served as Executive Vice President and Chief Revenue Officer from December 2020 through January 2022 and as Vice President and Chief Revenue Officer from August 2020 to December 2020. Mr. Blum served as Executive Vice President, Worldwide Field Operations from December 2020 to November 2021 and as Senior Vice President, Worldwide Field Operations from September 2017 to December 2020. Mr. Blum served as Senior Vice President, Worldwide Sales and Services from February 2011 to September 2017. From January 2003 to February 2011, he served as Senior Vice President of Americas Sales. Prior to this position, Blum was Executive Vice President of Sales and Account Management for Parago, Inc. Blum also held positions at Mentor Graphics, most recently serving as Vice President of America's sales. Before joining Mentor Graphics, he held engineering and sales positions at NCR Corporation and Advanced Micro Devices.\nRuth Ann Keene \njoined Autodesk in January 2022 and has served as Executive Vice President, Corporate Affairs, Chief Legal Officer & Corporate Secretary since May 2022.  Ms. Keene previously served as Senior Vice President, Chief Legal Officer, General Counsel & Corporate Secretary of Unity Technologies (“Unity”) from September 2016 to January 2022.  Prior \n114\nTable of Contents \nto joining Unity, Ms. Keene served as Vice President, Assistant General Counsel and Assistant Secretary of Autodesk from 2012 to 2016, and had served in various legal positions at Autodesk since August 2005.  Before joining Autodesk, Ms. Keene was a technology transactions attorney at Morrison & Foerster, LLP.\nRebecca Pearce \njoined Autodesk in October 2015 and has served as Executive Vice President, Chief People Officer since January 2022.  Ms. Pearce previously served as Vice President, People & Places from June 2020 to December 2021 and as Senior HR Director - Digital Platforms and Corporate Functions from September 2018 through May 2020.  Ms. Pearce served as HR Director Global Territory Sales from February 2018 to September 2018 and as Asia Pacific and Japan HR Director from October 2015 through January 2018. Prior to joining Autodesk, Ms. Pearce was the HR Director Global Operations, R&D and Engineering for Dyson Limited from December 2011 to September 2015. Ms. Pearce also previously held leadership positions at Microsoft Corporation, including most recently as the Asia Pacific HR Leader for Microsoft Consumer and Online.\nThere is no family relationship among any of our directors or executive officers.\nITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by this Item is incorporated herein by reference to the sections entitled “Governance and our Board of Directors” and “Executive Compensation” in our Proxy Statement.\nITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated herein by reference to the sections entitled “Security Ownership of Certain Beneficial Owners and Management” and “Executive Compensation—Equity Compensation Plan Information” in our Proxy Statement.\nITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated herein by reference to the sections entitled “Certain Relationships and Related Party Transactions” and “Governance and our Board of Directors —Independence of the Board” in our Proxy Statement.\nITEM 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item is incorporated herein by reference to the sections entitled “Proposal Two—Ratification of the Appointment of Independent Registered Public Accounting Firm” in our Proxy Statement.\n115\nTable of Contents \nPART IV\n \nITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)     The following documents are filed as part of this Report:\n1.\nFinancial Statements\n: The information concerning Autodesk’s financial statements, and the Report of \nErnst & Young LLP\n, Independent Registered Public Accounting Firm (PCAOB ID: \n42\n), \nSan Francisco, California\n, required by this Item is incorporated by reference herein to the section of this Report in Part II, Item 8, entitled “Financial Statements and Supplementary Data.”\n2.\nFinancial Statement Schedule\n: The following financial statement schedule of Autodesk, Inc., for the fiscal years ended January 31, 2025, 2024, and 2023, is filed as part of this Report and should be read in conjunction with the Consolidated Financial Statements of Autodesk, Inc.:\nSchedule II    Valuation and Qualifying Accounts\nSchedules not listed above have been omitted because they are not applicable or are not required or the information required to be set forth therein is included in the Consolidated Financial Statements or Notes thereto.\n3.\nExhibits\n: See Item 15(b) below. We have filed, or incorporated into this Report by reference, the exhibits listed on the accompanying Index to Exhibits immediately prior to the signature page of this Form 10-K.\n(b)     Exhibits:\nWe have filed, or incorporated into this Report by reference, the exhibits listed on the accompanying Index to Exhibits immediately prior to the signature page of this Form 10-K.\n(c)     Financial Statement Schedules: See Item 15(a), above.\n \nITEM 15(A)(2)\nFINANCIAL STATEMENT SCHEDULE \nSCHEDULE II: VALUATION AND QUALIFYING ACCOUNTS\n(in millions)\n \nDescription\nBalance at\nBeginning\nof Fiscal Year\nAdditions\nCharged to\nCosts and\nExpenses or\nRevenues\nAdditions\nCharged to\nDeferred Revenue\nDeductions\nBalance at\nEnd of Fiscal Year\n \n(in millions)\nFiscal Year Ended January 31, 2025\nPartner program reserves (1)\n$\n103\n \n$\n91\n \n$\n908\n \n$\n1,028\n \n$\n74\n \nFiscal Year Ended January 31, 2024\nPartner program reserves (1)\n90\n \n91\n \n980\n1,058\n \n103\n \nFiscal Year Ended January 31, 2023\nPartner Program reserves (1)\n64\n \n67\n \n861\n902\n \n90\n \n \n____________________\n(1)\nThe partner program reserves balance impacts \"Accounts receivable, net\" and \"Accounts payable\" on the accompanying Consolidated Balance Sheets.\nITEM 16\nFORM 10-K SUMMARY\nNone.\n116\nTable of Contents \nIndex to Exhibits\n \nExhibit\nFiled\nIncorporated by Reference\nNumber\nDescription\nHerewith\nForm\nSEC File No.\nExhibit\nFiling Date\n3.1\nAmended and Restated Certificate of Incorporation of Registrant\n8-K\n000-14338\n3.1\n7/18/2024\n3.2\nAmended and Restated Bylaws of Registrant\n8-K\n000-14338\n3.2\n7/18/2024\n4.1\nIndenture dated December 13, 2012, by and between the Registrant and U.S. Bank National Association\n8-K\n000-14338\n4.1\n12/13/2012\n4.2\nFirst Supplemental Indenture (including Form of Notes) dated December 13, 2012, by and between the Registrant and U.S. Bank National Association\n8-K\n000-14338\n4.2\n12/13/2012\n4.3\nThird Supplemental Indenture (including Form of Notes) dated June 8, 2017, by and between the Registrant and U.S. Bank National Association\n8-K\n000-14338\n4.1\n6/8/2017\n4.4\nFourth Supplemental Indenture (including Form of Notes) dated January 14, 2020, by and between the Registrant and U.S. National Bank Association\n8-K\n000-14338\n4.1\n1/14/2020\n4.5\nFifth Supplemental Indenture, dated October 7, 2021, by and between Registrant and U.S. Bank National Association, including Form of Note for Autodesk, Inc.’s 2.400% Notes due 2031\n8-K\n000-14338\n4.1\n10/7/2021\n4.6\nDescription of Registrant's Capital Stock\n10-K\n000-14338\n4.6\n3/19/2020\n10.1*\nDescription of Registrant's Performance Stock Unit Program\n8-K\n000-14338\n4/15/2020\n10.2*\nRegistrant's 2012 Employee Stock Plan, as amended and restated effective as of June 12, 2018\n10-Q\n000-14338\n10.2\n8/30/2018\n10.3*\nRegistrant's 2012 Employee Stock Plan Form of Restricted Stock Unit Agreement, as amended and restated\n10-Q\n000-14338\n10.2\n8/30/2016\n10.4*\nRegistrant's 2012 Employee Stock Plan Form of Severance Restricted Stock Unit Agreement, as amended and restated\n10-Q\n000-14338\n10.3\n8/30/2016\n10.5*\nRegistrant's 2012 Employee Stock Plan Form of Stock Option Agreement\n8-K\n000-14338\n10.2\n3/13/2012\n10.6*\nRegistrant's 2012 Employee Stock Plan Form of Stock Option Agreement (non-U.S. Employees)\n8-K\n000-14338\n10.4\n3/13/2012\n10.7*\nPlanGrid, Inc. 2012 Equity Incentive Plan\nS-8\n333-228934\n99.1\n12/21/2018\n10.8*\nAmended and Restated BuildingConnected, Inc. 2013 Stock Plan\nS-8\n333-229346\n99.1\n1/24/2019\n10.9*\nRegistrant's 2012 Outside Directors' Stock Plan, as amended and restated\n10-K\n000-14338\n10.18\n3/21/2017\n10.10*\nRegistrant's 2012 Outside Directors' Stock Plan Form of Restricted Stock Unit Agreement\n8-K\n000-14338\n10.5\n3/13/2012\n10.11*\nRegistrant's 2012 Outside Directors' Stock Plan Form of Restricted Stock Unit Agreement\n10-Q\n000-14338\n10.1\n6/4/2019\n10.12*\nRegistrant’s Executive Incentive Plan, as amended and restated\n10-K\n000-14338\n10.23\n3/23/2016\n10.13*\nRegistrant’s 2005 Non-Qualified Deferred Compensation Plan, as amended and restated, effective as of January 1, 2010\n10-Q\n000-14338\n10.1\n12/8/2009\n10.14*\nExecutive Change in Control Program, as amended and restated\n8-K\n000-14338\n10.1\n4/27/2022\n10.15*\nForm of Indemnification Agreement executed by the Registrant and each of its officers and directors\n10-K\n000-14338\n10.8\n3/31/2005\n10.16\nForm of Qualified Retirement Agreement under the Registrant Amended and Restated Severance Plan and Summary Plan Description dated March 25, 2021\n10-Q\n000-14338\n10.1\n9/1/2021\n10.17.1*\nEmployment Agreement, dated as of June 19, 2017, by and between the Registrant and Andrew Anagnost\n8-K\n000-14338\n10.1\n6/19/2017\n10.17.2\nFirst Amendment to Andrew Anagnost Employment Agreement, dated as of April 27, 2022, by and between the Registrant and Andrew Anagnost\n8-K\n000-14338\n10.2\n4/27/2022\n10.18*\nDeborah Clifford Offer Letter dated February 12, 2021\n10-Q\n000-14338\n10.1\n6/3/2021\n10.19*\nRegistrant Amended and Restated Severance Plan and Summary Plan Description dated March 25, 2021\n10-Q\n000-14338\n10.2\n6/3/2021\n10.20*\nRegistrant's 2012 Employee Stock Plan Form of Retirement Restricted Stock Unit Agreement, as amended and restated\n10-K\n000-14338\n10.21\n3/19/2021\n10.21\nAmendment No. 1 to Amended and Restated Credit Agreement dated November 21, 2022\n10-Q\n000-14338\n10.1\n12/16/22\n10.22\nAutodesk, Inc. 2022 Equity Incentive Plan\n8-K\n 000-14338\n10.1\n06/21/2022\n117\nTable of Contents \nExhibit\nFiled\nIncorporated by Reference\nNumber\nDescription\nHerewith\nForm\nSEC File No.\nExhibit\nFiling Date\n10.23\nAutodesk, Inc. 2022 Equity Incentive Plan Form of Global RSU Agreement\n10-K\n000-14338\n10.23\n06/10/2024\n10.24\nAutodesk, Inc. 2022 Director Compensation Policy\n8-K\n000-14338\n99.1\n08/23/2022\n10.25\nAutodesk, Inc. 2022 Equity Incentive Plan Form of Director RSU Agreement\n8-K\n000-14338\n99.2\n08/23/2022\n10.26\nRegistrant’s 1998 Employee Qualified Stock Purchase Plan, as amended and restated effective as of December 14, 2022, its Forms of Subscription Agreement and International Sub-Plan \n10-K\n000-14338\n10.26\n03/14/2023\n10.27\nJanesh Moorjani Offer Letter dated November 18, 2024\nX\n10.28\nElizabeth Rafael Interim Offer Letter dated May 31, 2024\nX\n10.29\nElizabeth Rafael Addendum to Employment Agreement dated December 13, 2024\nX\n19.1\nAutodesk Insider Trading Policy\n10-K\n000-14338\n19.1\n06/10/2024\n21.1\nList of Subsidiaries\nX\n23.1\nConsent of Independent Registered Public Accounting Firm (Ernst & Young LLP) (filed herewith)\nX\n24.1\nPower of Attorney (contained in the signature page to this Annual Report on Form 10-K)\nX\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934\nX\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934\nX\n32.1†\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n97.1\nAutodesk, Inc. Clawback Policy\n10-K\n000-14338\n97.1\n06/10/2024\n101.INS ††\nXBRL Instance Document\n101.SCH ††\nXBRL Taxonomy Extension Schema\n101.CAL ††\nXBRL Taxonomy Extension Calculation Linkbase\n101.DEF ††\nXBRL Taxonomy Extension Definition Linkbase\n101.LAB ††\nXBRL Taxonomy Extension Label Linkbase\n101.PRE ††\nXBRL Taxonomy Extension Presentation Linkbase\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n ____________________\n*    Denotes a management contract or compensatory plan or arrangement.\n†    The certifications attached as Exhibit 32.1 that accompany this Annual Report on Form 10-K are not deemed filed with the Securities and Exchange Commission and are not to be incorporated by reference into any filing of Autodesk, Inc. under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, whether made before or after the date of this Form 10-K, irrespective of any general incorporation language contained in such filing.\n††     The financial information contained in these XBRL documents is unaudited.\n    \n118\nTable of Contents \nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nAUTODESK, INC.\nBy:\n/s/    ANDREW ANAGNOST       \nAndrew Anagnost\nPresident and Chief Executive Officer\nDated:\nMarch 6, 2025\n119\nTable of Contents \nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS\n, that each person whose signature appears below constitutes and appoints Andrew Anagnost and Janesh Moorjani each as his or her attorney-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities as of  March 6, 2025.\n \n120\nTable of Contents \nSignature\nTitle\n/s/    ANDREW ANAGNOST      \n  \nPresident and Chief Executive Officer, Director\n(Principal Executive Officer)\nAndrew Anagnost\n/s/    JANESH MOORJANI\n  \nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\nJanesh Moorjani\n/s/    STEPHEN W. HOPE\nSenior Vice President and Chief Accounting Officer\n(Principal Accounting Officer)\nStephen W. Hope\n/s/    STACY J. SMITH       \n  \nDirector\n(Non-executive Chairman of the Board)\nStacy J. Smith\n/s/    KAREN BLASING         \nDirector\nKaren Blasing\n/s/    JOHN T. CAHILL\nDirector\nJohn T. Cahill\n/s/    REID FRENCH\nDirector\nReid French\n/s/    AYANNA HOWARD\nDirector\nAyanna Howard\n/s/    BLAKE J. IRVING\nDirector\nBlake J. Irving\n/s/    RAM R. KRISHNAN\nDirector\nRam R. Krishnan\n/s/    MARY T. MCDOWELL        \nDirector\nMary T. McDowell\n/s/    STEPHEN D. MILLIGAN      \nDirector\nStephen D. Milligan \n/s/    LORRIE M. NORRINGTON        \nDirector\nLorrie M. Norrington\n/s/    ELIZABETH RAFAEL    \nDirector\nElizabeth Rafael\n/s/    RAMI RAHIM\nDirector\nRami Rahim\n121"
  }
}