{
  "ticker": "AJG",
  "cik": "0000354190",
  "company_name": "Arthur J. Gallagher & Co.",
  "filing_date": "2025-02-18",
  "accession": "0000950170-25-021775",
  "primary_doc": "ajg-20241231.htm",
  "item_sections": {
    "item1": "Part I\n\nItem 1. Business. \n\nOverview \n\nArthur J. Gallagher & Co. and its subsidiaries, collectively referred to herein as we, our, us or Gallagher, are engaged in providing insurance brokerage, reinsurance brokerage, consulting, and third-party property/casualty claims settlement and administration services to entities and individuals around the world.  We believe that our major strength is our ability to deliver comprehensively structured insurance, reinsurance and risk management solutions, superior claim outcomes and comprehensive consulting services to our clients.  \n\nOur brokerage segment operations provide brokerage and consulting services to entities of all types, including commercial, nonprofit, public sector entities, insurance companies and insurance capital providers, and to a lesser extent, individuals, in the areas of insurance and reinsurance placements, risk of loss management, and management of employer sponsored benefit programs.  Our risk management segment operations provide contract claim settlement, claim administration, loss control services and risk management consulting for commercial, nonprofit, captive and public sector entities, and various other organizations that choose to self-insure property/casualty coverages or choose to use a third-party claims management organization rather than the claim services provided by an underwriting enterprise.\n\nWe do not assume underwriting risk on a net basis, other than with respect to de minimis amounts necessary to provide minimum or regulatory capital to organize captives, pools, specialized underwriters or risk-retention groups.  Rather, capital necessary for covering events of loss is provided by “underwriting enterprises,” which we define as insurance companies, reinsurance companies and various other risk-taking entities, including intermediaries of underwriting enterprises, that we do not own or control. \n\nSince our founding in 1927, we have grown from a one-person insurance agency to the world’s third largest insurance broker/risk manager based on revenues according to Business Insurance magazine’s July/August 2024 edition, and one of the world’s largest property/casualty third party claims administrators, according to Business Insurance magazine’s May 2024 edition.  \n\nWe report our results in three segments: brokerage, risk management and corporate.  The brokerage and risk management segments contributed approximately 86% and 14%, respectively, to 2024 revenues.  We generate approximately 64% of our revenues from the combined brokerage and risk management segments in the U.S., with the remaining 36% generated internationally, primarily in Australia, Canada, New Zealand and the U.K.  The corporate segment did not generate any significant revenues in 2024.  \n\nShares of our common stock are traded on the New York Stock Exchange under the symbol “AJG”, and we had a market capitalization at December 31, 2024 of approximately $71 billion.  Information in this report is as of December 31, 2024 unless otherwise noted.  We were reincorporated as a Delaware corporation in 1972.  Our executive offices are located at 2850 Golf Road, Rolling Meadows, Illinois 60008-4050, and our telephone number is (630) 773-3800.\n\nOperating Segments \n\nWe report our results in three segments: brokerage, risk management and corporate.  The major sources of our operating revenues are commissions, fees, supplemental and contingent revenues and interest income, premium finance and other income from our brokerage operation, and fees, including performance-based fees, from our risk management operations.  The corporate segment does not generate any significant revenues.  \n\nOur business, particularly our brokerage business, is subject to seasonal fluctuations.  Commissions, fees, supplemental revenues and contingent revenues, and our costs to obtain and fulfill the service obligations to our clients, can vary from quarter to quarter as a result of the timing of contract-effective dates.  On the other hand, salaries and employee benefits, rent, depreciation and amortization expenses generally tend to be more uniform throughout the year.  The timing of acquisitions, recognition of books of business gains and losses also impact the trends in our quarterly operating results.  \n\nBrokerage Segment\n\nThe brokerage segment accounted for 86% of our revenues in 2024.  Our brokerage segment operates through a network of more than 580 sales and service offices located throughout the U.S. and approximately 350 sales and service offices in approximately \n\n5\n\n60 countries, most of which are in the Australia, Canada, New Zealand and the U.K.  Most of these offices are fully staffed with sales and service personnel.  We offer client service capabilities in approximately 130 countries around the world through our direct operations as well as through a network of correspondent brokers and consultants.\n\nDomestic Retail Insurance Brokerage Operations\n\nOur retail insurance brokerage operations accounted for 73% of our brokerage segment revenues in 2024.  Our retail brokerage operations place nearly all lines of commercial property/casualty and health and welfare insurance coverage.  Significant lines of insurance coverage and consultant capabilities are as follows:\n\nAviation\n\nDisability\n\nGeneral Liability\n\nProducts Liability\n\nCasualty\n\nEarthquake\n\nHealth & Welfare\n\nProfessional Liability\n\nClaims Advocacy\n\nErrors & Omissions\n\nHealthcare Analytics\n\nProperty\n\nCommercial Auto\n\nExchange Solutions\n\nHuman Resources\n\nRetirement\n\nCompensation\n\nExecutive Benefits\n\nInstitutional Investment\n\nSurety Bond\n\nCyber Liability\n\nFiduciary Services\n\nLoss Control\n\nVoluntary Benefits\n\nDental\n\nFine Arts\n\nMarine\n\nWind\n\nDirectors & Officers Liability\n\nFire\n\nMedical\n\nWorkers’ Compensation\n\nOur retail brokerage operations are organized and operate within certain key niche/practice groups, which account for approximately 79% of our retail brokerage revenues.  These specialized teams target areas of business and/or industries in which we have developed a depth of expertise and a large client base.  Significant niche/practice groups we serve are as follows:\n\nAffinity\n\nEquity Advisors\n\nLife Sciences\n\nReal Estate/Hospitality\n\nAutomotive\n\nFinancial Institutions\n\nManufacturing\n\nReligious\n\nAviation\n\nFood/Agribusiness\n\nMarine\n\nRestaurant\n\nConstruction\n\nGlobal Risks\n\nNonprofit\n\nRetail and Services\n\nEnergy\n\nHealthcare\n\nPersonal\n\nTechnology & Communications\n\nEntertainment\n\nHigher/K12 Education\n\nPrivate Client\n\nTrade Credit/Political Risk\n\nEnvironmental\n\nLaw Firms \n\nPublic Sector\n\nTransportation\n\nOur specialized focus on these niche/practice groups allows for highly-focused marketing efforts and facilitates the development of value-added products and services specific to those industries.  We believe that our detailed understanding and broad client contacts within these niche/practice groups provide us with a competitive advantage.\n\nWe anticipate that our retail brokerage operations’ greatest revenue growth over the next several years will continue to come from:\n\n• Our niche/practice groups and middle-market accounts;\n• Cross-selling other brokerage products to existing clients; \n• Mergers and acquisitions; and\n• Developing and managing alternative market mechanisms such as captives, rent-a-captives and deductible plans/self-insurance.\n\nInternational and Other Brokerage Related Operations \n\nWe operate as a retail commercial property and casualty broker throughout 45 locations in Australia, 42 locations in Canada and 37 locations in New Zealand.  In the U.K., we operate as a retail broker from approximately 100 locations.  We also have specialty, wholesale, underwriting and reinsurance intermediary operations in London for clients to access Lloyd’s of London and other international underwriting enterprises, and a program operation offering customized risk management products and services to U.K. public entities.  See the discussion below regarding our “Global Reinsurance Brokerage Operations.”\n\nIn Bermuda, we act principally as a wholesale broker for clients looking to access Bermuda-based underwriting enterprises and we also provide management and administrative services for captive insurance entities.  \n\n6\n\nWe also have strategic brokerage alliances with a variety of independent brokers in countries where we do not have a local office presence.  Between our direct operations and this global network of correspondent insurance brokers and consultants, we are able to serve our clients’ coverage and service needs in approximately 130 countries around the world.\n\nGlobal Reinsurance Brokerage Operations\n\nOur reinsurance brokerage operations (which we refer to as Gallagher Re) accounted for 13% of our brokerage segment revenues in 2024.  Gallagher Re operates from more than 60 offices across 26 countries, with specialist expertise, underpinned by a portfolio of analytics capabilities including catastrophe modeling, dynamic financial analysis, rating agency analysis and capital modeling.  Our reinsurance brokers assist underwriting enterprises, such as insurance companies and managing general underwriters, to secure protection or reinsurance from another insurance company for a specific risk or class of risks, including negotiating rates and terms and while sourcing the best-suited contracts available on the market.  Additionally, through Gallagher Securities, Gallagher Re provides capital markets services, including acting as underwriter, with respect to insurance-linked securities, weather derivatives, capital raising and selected merger and acquisition advisory activities.  We anticipate growing Gallagher Re by increasing the number of underwriting enterprise clients, deepening our relationships with current underwriting enterprise clients, developing new products, further building out our facultative capabilities, and through mergers and acquisitions.     \n\nWholesale Insurance Brokerage Operations \n\nOur wholesale insurance brokerage operations accounted for 14% of our brokerage segment revenues in 2024.  Our wholesale brokers assist our retail brokers and other non-affiliated brokers in the placement of specialized and hard-to-place insurance.  These brokers operate through approximately 162 offices primarily located across the U.S., Bermuda and through our approved Lloyd’s of London brokerage operation.  More than 75% of our wholesale brokerage revenues comes from non-affiliated brokerage clients. \n\nIn certain cases we act as a brokerage wholesaler, and in other cases we act as a managing general agent or managing general underwriter, distributing specialized insurance coverages for underwriting enterprises.  Managing general agents and managing general underwriters are agents authorized by an underwriting enterprise to manage all or a part of its business in a specific geographic territory.  Activities they perform on behalf of the underwriting enterprise may include marketing, underwriting (although we do not assume any underwriting risk), issuing policies, collecting premiums, appointing and supervising other agents, paying claims and negotiating reinsurance. \n\nWe believe our growth prospects for our wholesale brokerage operations depend on increasing the number of broker-clients, developing new managing general agency and underwriter programs, and through mergers and acquisitions.  \n\nCaptive Underwriting Enterprises \n\nWe have ownership interests in several underwriting enterprises based in the U.S., Bermuda, Gibraltar, Guernsey and Isle of Man that primarily operate segregated account “rent-a-captive” facilities.  These “rent-a-captive” facilities enable our clients to receive the benefits of participating in a captive underwriting enterprise without incurring certain disadvantages of ownership.  In Malta and Ireland, we act as managers of underwriting enterprises. \n\nWe also have a wholly owned underwriting enterprise subsidiary based in the U.S. that cedes all of its insurance risk of loss to reinsurers or captives under facultative and quota-share treaty reinsurance agreements.  \n\nRisk Management Segment \n\nOur risk management segment accounted for 14% of our revenues in 2024.  Approximately 61% of our risk management segment’s revenues are from workers’ compensation-related claims, 34% are from general and commercial auto liability-related claims and 5% are from property-related claims in 2024.  \n\nRisk management services are primarily marketed on an independent basis from our brokerage operations, to Fortune 1000 companies, larger middle-market companies, nonprofit organizations, public sector entities, and underwriting enterprises, such as insurance carriers and captives.  We manage our third party claims adjusting operations through a network of more than 40 offices located throughout Australia, Canada, New Zealand, the U.K. and the U.S.  Most of these offices are fully staffed with claims adjusters and other service personnel.  Our adjusters and service personnel act solely on behalf and under the instruction of our clients.\n\nWhile this segment complements our brokerage offerings, approximately 94% of our risk management segment’s revenues come from clients not affiliated with our brokerage operations, such as underwriting enterprises and clients of other insurance brokers.   \n\n7\n\nWe expect that the risk management segment’s most significant growth prospects through the next several years will come from:\n\n• Program business and the outsourcing of portions of underwriting enterprise claims departments; \n• Increased levels of business with Fortune 1000 companies; \n• Larger middle-market companies and captives; and\n• Mergers and acquisitions.\n\nCorporate Segment\n\nThe corporate segment reports the financial information related to our debt, external acquisition-related expenses, other corporate costs and the impact of foreign currency remeasurement.  As a result, the timing of acquisitions impact the trends in our quarterly operating results.\n\nCompetition \n\nBrokerage Segment\n\nThe insurance and reinsurance brokerage and consulting businesses are highly competitive and there are many organizations and individuals throughout the world who actively compete with us in every area of our business.  Additionally, we also face competition from insurance and reinsurance carriers that market, distribute and service a portion of their products directly, and in some cases from banks, consulting and accounting firms, and technology companies that can provide alternative risk management products or services.  \n\nWe believe that the primary factors determining our competitive advantage are the quality of the services we render, the personalized attention we provide, the individual and corporate expertise providing the actual service to the client, the data analytics and technology capabilities we have built and the overall cost efficiencies we create for our clients.  We provide sophisticated data analysis and other data and benchmarking insights through a product offering we refer to as Gallagher Drive to help our clients make insurance decisions.  Through our SmartMarket platform, we also provide insurance carriers with individualized preference setting and risk identification capabilities, as well as performance data and metrics.  We believe these capabilities provide a growing competitive advantage with respect to many of the smaller organizations with which we compete.  \n\nRisk Management Segment\n\nOur risk management business competes with a number of companies varying in size and scope, including global independent third party claims administrators, regional third party claims administrators, insurance owned claims administrators and legal firms in certain jurisdictions.  We believe that the primary factors determining our competitive position are our ability to deliver better outcomes, reputation for outstanding service, cost-efficient service, our data analytics capabilities and financial strength.\n\nBusiness Combinations \n\nWe completed approximately 750 acquisitions from January 1, 2002 through December 31, 2024.  The majority of these acquisitions have been smaller regional or local brokerages, agencies, or employee benefit consulting operations with a middle or small client focus and/or significant expertise in one of our niche/practice groups.  The total purchase price for individual acquisitions has typically ranged from $1.0 million to $100.0 million.  During 2024, we also completed several acquisitions that were larger than our usual tuck-in acquisitions, namely the acquisitions of RIBV Holdings, LLC and Redington, within our brokerage segment.\n\nThrough these acquisitions, we seek to expand our talent pool, enhance our geographic presence and service capabilities, or further diversify our business mix.  We also focus on identifying:\n\n• A corporate culture that matches our sales-oriented and ethics-based culture;\n• A profitable, growing business whose ability to compete would be enhanced by gaining access to our greater resources; and\n• Clearly defined financial criteria.\n\nSee Note 3 to our 2024 consolidated financial statements for a summary of our 2024 acquisitions, the amount and form of the consideration paid and the dates of acquisitions.\n\n8\n\nClients\n\nOur client base is highly diversified and includes commercial, industrial, public sector, religious and nonprofit entities, as well as underwriting enterprises in our reinsurance operations and risk management segment.  In 2024, our largest single client represented approximately 1% and our ten largest clients together represented approximately 3%, respectively, of our combined brokerage and risk management segment revenues. \n\nHuman Capital\n\nAs of December 31, 2024, we had approximately 56,000 employees, with approximately 43% in the U.S. and 57% outside of the U.S.  Approximately 75% of our employees work in our brokerage segment and 18% in our risk management segment.  Our remaining employees work in our corporate segment, primarily at our headquarters and at Gallagher Centers of Excellence in India.  In 2024, our total compensation expense was $5,501.4 million for the brokerage segment and $882.4 million for the risk management segment, representing 55% and 61%, respectively, of brokerage and risk management segment revenues.  Additional information regarding compensation expense, both on a reported and an adjusted basis can be found elsewhere in this report under Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n\nTalent Development and Retention\n\nWhile many of our new employees come to us through mergers and acquisitions and traditional hiring, “growing our own” has long been a key part of our human capital strategy.  The Gallagher North American Sales Internship Program has been a key part of our talent development strategy for nearly 60 years.  During that time, our program has grown globally and we employed approximately 500 interns in the summer of 2024.  We provide our interns with professional development and on-the-job sales training that gives them the opportunity to cultivate expertise and accelerate their full-time sales career growth.\n\nWe invest in our employees and aim to offer competitive compensation and benefits packages.  We acknowledge the changing work landscape and promote hybrid work arrangements, aiming to provide our employees with flexibility and work-life balance.  Further, we conduct periodic global engagement surveys that have had increasingly strong participation and positive results. \n\nEmployee Learning and Development\n\nWe have programs around the world that offer learning and development opportunities to our employees.  For example, the Achieve and Gallagher Career Associate Programs are career development programs available in North America that combine formal training, with experiential learning to provide participants the knowledge needed to be successful as client service and sales professionals, respectively.  Similarly, we offer development programs outside the U.S., for example in Australia, Canada, India, New Zealand and the U.K.  In addition, we provide on-demand access to over 35,000 globally accessible business skills training modules across 18 languages. \n\nInclusion and Diversity\n\nWe aim to foster an environment that values and leverages the diverse talents, perspectives and ideas of all employees so they can reach their fullest potential.  As of December 31, 2024, approximately 58% of our employees were women, including 48% of managers and 40% of producers.  In the U.S., approximately 27% of our employees were racially/ethnically diverse, including 18% of managers and 21% of producers.\n\nRegulation\n\nMany of our activities throughout the world, such as our insurance brokerage, securities broker-dealer and investment advisory services, are subject to supervision and regulations promulgated by regulatory or self-regulatory bodies such as the SEC, the NYSE, the U.S. Department of Justice (DOJ), the IRS, the Federal Trade Commission (FTC) the Financial Industry Regulatory Authority (FINRA) and the Financial Crimes Enforcement Network in the U.S., the Financial Conduct Authority in the U.K., the Australian Securities and Investments Commission in Australia and insurance regulators in nearly every jurisdiction in which we operate.  Our retirement-related consulting and investment advisory services are subject to pension law and financial regulation in many countries.  Our activities are also subject to a variety of other laws, rules and regulations addressing, among others, licensing, cybersecurity, data privacy, AI, wage-and-hour standards, employment and labor relations, competition, anti-corruption, currency, the conduct of business, reserves and the amount of local investment with respect to our operations in certain countries.  As we continue to implement new technology and AI initiatives across our business we also expect to be subject to additional regulations related to the use of such new technologies. \n\nThe global nature of our operations increases the complexity and cost of compliance with laws and regulations, including increased staffing needs, the development of new policies, procedures and internal controls and providing training to employees in multiple locations, adding to our cost of doing business.  Many of these laws and regulations may have differing or conflicting legal standards across jurisdictions, increasing further the complexity and cost of compliance.  In emerging markets and other \n\n9\n\njurisdictions with less developed legal systems, local laws and regulations may not be established with sufficiently clear and reliable guidance to provide us with adequate assurance that we are aware of all necessary licenses to operate our business, that we are operating our business in a compliant manner, or that our rights are otherwise protected.  In addition, major political and legal developments in jurisdictions in which we do business may lead to new regulatory costs and challenges.  For example, China adopted a “blocking” statute similar to that of the European Union (EU) requiring compliance with certain Chinese laws if they conflict with U.S. laws.  Rising global tensions and protectionism may also lead other countries to adopt similar blocking statutes, which could make it more difficult and costly for us to expand our operations globally.\n\nIn addition, as regulators and investors continue to focus on climate change and other sustainability issues, we are exposed to the risk of frameworks and regulations being adopted that require significant effort to comply with and which are ill-adapted to our operations, particularly with respect to our larger-than usual acquisitions that may have their own sustainability programs and may have complied with sustainability regulations in the past in a way that may differ substantially from our sustainability program and strategy.  For example, in 2023, pursuant to the Corporate Sustainability Reporting Directive (CSRD, which we expect will result in disclosure obligations in future years for us and some of our EU subsidiaries, the first set of EU sustainability reporting standards (which we refer to as ESRS) was developed by the European Financial Reporting Advisory Group (which we refer to as EFRAG) and adopted by the EU.  EFRAG will continue to issue sector-specific and non-EU applicable ESRS in the coming years, with such standards to be tailored to EU policy positions which may be different or contradictory with those applicable in other jurisdictions such as the International Sustainability Standards Board standards (which we refer to as ISSB) and the Task Force on Climate-Related Financial Disclosures (which we refer to as TCFD) framework.  In the U.K., our business is subject to a number of disclosure obligations under different sustainability frameworks, such as the TCFD.  Australia enacted mandatory disclosures based on the ISSB standards in 2024, and other jurisdictions, such as Canada and New Zealand, have announced that they plan to implement ISSB-based disclosures.  There is further uncertainty in this space as the SEC’s new climate change disclosure requirements enacted in 2024 are currently being challenged in legal proceedings and are expected to be struck down, while, the State of California has enacted disclosure rules, which we expect will require us, among other things, to publish our consolidated carbon emissions.  Compliance with such differing and uncertain rules and frameworks requires, significant effort and could divert management’s attention and resources.   \n\nRegulations promulgated by the U.S. Treasury Department pursuant to the Foreign Account Tax Compliance Act (which we refer to as FATCA) require us to take various measures relating to non-U.S. funds, transactions and accounts. \n\nAvailable Information\n\nOur executive offices are located at 2850 Golf Road, Rolling Meadows, Illinois 60008-4050, and our telephone number is (630) 773-3800.  Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, are available free of charge on our website at http://investor.ajg.com/sec-filings as soon as reasonably practicable after electronically filing or furnishing such material to the SEC.  The SEC also maintains a website (www.sec.gov) that includes our reports, proxy statements and other information.  Unless expressly noted, the information on our website, including our investor relations website, or any other website is not incorporated by reference in this Form 10-K and should not be considered part of this Form 10-K or any other filing we make with the SEC.\n\n10",
    "item1a": "Item 1A. Risk Factors.\n\nRisk Factor Summary\n\nRisks Relating to the Acquisition of AssuredPartners \n\n• There can be no assurance that the Transaction will be completed or that we will realize the expected benefits of the Transaction.\n• We may encounter integration challenges and AssuredPartners may not perform as expected.\n• We have made certain assumptions relating to the Transaction and AssuredPartners which may prove to be materially inaccurate.\n\nRisks Relating to our Business Generally\n\n• Global economic and geopolitical events, such as fluctuations in interest and inflation rates; geo-economic fragmentation and protectionism; a recession or economic downturn; a potential U.S. government shutdown or gridlock over increasing the debt ceiling and political violence, and instability, including as a result of armed conflicts in Ukraine and the Middle East, could adversely affect our results of operations and financial condition.\n• Economic conditions that result in financial difficulties for underwriting enterprises or lead to reduced risk-taking capital capacity could adversely affect our results of operations and financial condition.\n• We have historically acquired large numbers of insurance brokers, benefit consulting firms and, to a lesser extent, third party claims administration and risk management firms.  We may not be able to continue such an acquisition strategy in the future and there are risks associated with such acquisitions, which could adversely affect our growth and results of operations.\n• We face additional risks relating to acquisitions that are larger than our usual tuck-in acquisitions, including that these acquisitions will not perform as expected and that we cannot successfully integrate complex operations.\n• Damage to our reputation and culture could have a material adverse effect on our business.\n• Our sustainability aspirations, goals and initiatives, and our public statements and disclosures regarding them, expose us to numerous risks.\n• If we are unable to apply technology, data analytics and AI effectively in driving value for our clients through technology-based solutions or gain internal efficiencies and effective internal controls through the application of technology and related tools, our operating results, client relationships, organic and inorganic growth and compliance programs could be adversely affected.\n• We are subject to risks associated with AI.\n• Our success depends, in part, on our ability to attract and retain qualified talent, including our senior management team.\n• Business disruptions could have a material adverse effect on our operations, damage our reputation and impact client relationships.\n• Sustained increases in compensation expense and the cost of employee benefits could reduce our profitability.\n• Our substantial operations outside the U.S. expose us to risks different than those we face in the U.S.\n• Changes in tax laws could adversely affect us.\n• We face significant competitive pressures in each of our businesses.\n• Volatility or declines in premiums or other adverse trends in the insurance industry may seriously undermine our profitability.\n• Contingent and supplemental revenues we receive from underwriting enterprises are less predictable than standard commission revenues, and any decrease in the amount of these forms of revenue could adversely affect our results of operations.\n• We face a variety of risks in our benefit consulting operations distinct from those we face in our insurance brokerage operations.\n• We face a variety of risks in our third-party claims administration operations that are distinct from those we face in our brokerage and benefit consulting operations.\n• Climate risks, including the risk of an economic crisis, risks associated with the physical effects of climate change and disruptions caused by the transition to a low-carbon economy, could adversely affect our business, results of operations and financial condition.\n\nRegulatory, Legal and Accounting Risks\n\n• Improper disclosure of confidential, personal or proprietary information and cybersecurity attacks or other security breach of our information systems, or those of third-party vendors we rely on, could result in regulatory scrutiny, legal liability or reputational harm, and could adversely affect our business, financial condition and reputation.\n• We are subject to a number of contingencies and legal proceedings which, if determined unfavorably to us, would adversely affect our financial results. \n• Changes in data privacy and protection laws and regulations, or any failure to comply with such laws and regulations, could adversely affect our business and financial results.\n• We could be adversely affected by violations or alleged violations of laws that impose requirements for the conduct of our overseas operations, including the FCPA, the U.K. Bribery Act or other anti-corruption laws, sanctions laws, and FATCA. \n• We are subject to regulation worldwide.  If we fail to comply with regulatory requirements or if regulations change in a way that adversely affects our operations, we may not be able to conduct our business, or we may be less profitable.\n• Changes in our accounting estimates and assumptions could negatively affect our financial position and operating results.\n• Limited protection of our intellectual property could harm our business and our ability to compete effectively, and we face the risk that our services or products may infringe upon the intellectual property rights of others.\n\nRisks Relating to our Investments, Debt and Common Stock\n\n• Our clean energy investments are subject to various risks and uncertainties.\n• The IRC Section 45 operations in which we have invested and the by-products from such operations may result in environmental and product liability claims and environmental compliance costs.\n• We have debt outstanding that could adversely affect our financial flexibility and subjects us to restrictions and limitations that could significantly impact our ability to operate our business.\n• Credit rating downgrades would increase our financing costs and could subject us to operational risk.\n• We are a holding company and, therefore, may not be able to receive dividends or other distributions in needed amounts from our subsidiaries.\n• Future sales or other dilution of our equity could adversely affect the market price of our common stock.\n\n[이후 본문 전체는 네가 준 Risk Factors 풀 텍스트 그대로이고, 위 요약 블록 이후 ~ “Future sales or other dilution of our equity could adversely affect the market price of our common stock.” 까지 포함되어 있다고 보면 돼. 필요하면 그대로 이어서 넣어서 완전한 텍스트로 쓸 수 있어.]",
    "item1b": "Item 1B. Unresolved Staff Comments.\n\nNot applicable.",
    "item1c": "Item 1C. Cybersecurity. \n\nWe have implemented a cybersecurity program to assess, identify, and manage risks from cybersecurity threats that could adversely and materially affect the confidentiality, integrity, and availability of our information and information systems.  We maintain administrative, technical, and physical safeguards designed to protect the security and privacy of confidential, personal and proprietary information.  Our cybersecurity program is aligned with notable control frameworks such as the NIST CSF (National Institute of Standards and Technology Cybersecurity Framework) and ISO (International Organization for Standardization) 27001.  \n\nOur cybersecurity program leverages people, processes, and technology to identify and respond to cybersecurity threats.  We have a global incident response capability supported by our Security Operations Center (which we refer to as SOC) team, a managed security service provider (MSSP) and our global Cybersecurity Incident Response Team (which we refer to as CSIRT), which provides threat detection and incident response.\n\nWe maintain a global cybersecurity incident response plan and related playbooks, for execution by the SOC team and CSIRT, in coordination with internal and external stakeholders, as applicable.  Significant incidents are escalated to a cross-departmental team to assess materiality based on qualitative and quantitative factors.  This team consists of executives representing core business functions, including, among others, information technology, legal, finance, accounting, data protection and business divisions, in consultation with third-party advisors, as applicable.  We undertake periodic leadership tabletop exercises and periodic adversarial (“red team”) exercises simulating incident response under common risk scenarios. As an acquisitive organization, we have also established a program to increase our visibility into the cybersecurity environment of acquisition targets prior to closing. \n\nWe have established a dedicated vendor assessment team, which employs systems and processes designed to oversee, identify, and reduce the potential impact of a security incident at a third-party vendor, service provider or customer or that otherwise implicates the third-party technology and systems we use.  We also require cybersecurity insurance coverage for vendors whose services or products may present a cybersecurity risk.\n\nWe continuously test and assess our cybersecurity posture, including through annual third-party risk assessments performed by reputable assessors, consultants and auditors.  A global FAIR (Factor Analysis of Information Risk) assessment is conducted at least annually to update our cybersecurity risks and corresponding mitigations.\n\nOur employees complete training on data security and our policies when they join us and annually thereafter.  We review the content of our mandatory training annually, and provide access to a comprehensive set of supplemental training. \n\nOur Chief Information Security Officer (CISO), working together with our Chief Information Officer (CIO), oversees a team of employees dedicated to cybersecurity.  Our CISO receives ongoing updates from the cybersecurity team regarding the prevention, detection, mitigation, and remediation of cybersecurity incidents and regularly reports to the CIO.  Our CISO is an active member of our management-level enterprise risk management committee, which has broad oversight of the company’s enterprise risks, including cybersecurity risks.  In addition, our CIO and CISO both attend regular meetings of the executive officer team, including our Chief Executive Officer, Chief Financial Officer, General Counsel and other senior executive officers, dedicated to compliance and risk, and report on cybersecurity matters as appropriate.  Our Board of Directors has delegated primary responsibility for the oversight of cybersecurity matters to its Risk and Compliance Committee; however, the full board reviews significant cybersecurity matters as appropriate.  Our CIO and CISO report on cybersecurity and information security at each quarterly meeting of the Risk and Compliance Committee. \n\nOur CIO has more than 30 years of experience, including from his prior business and technology leadership roles at Aegon N.V., Citigroup, Inc. and JP Morgan Chase & Company.  Our CISO has more than 20 years of cybersecurity experience.  Prior to joining us, he was Senior Vice President, Chief Information Security Officer at Brighthouse Financial.  Before then, he served as Technology Vice President & Chief Information Security Officer for GE Healthcare.  He started his career at Allstate Insurance Company.  He also holds security, privacy and risk certifications, including Certified Information Systems Auditor, Certified Information Security Manager and Certified Information Systems Security Professional. \n\nWe, including our third-party vendors, have experienced cybersecurity incidents and threats and may continue to experience them in the future.  Based on the information available as of the date of this Annual Report on Form 10-K, we believe that during the last three fiscal years  risks from cybersecurity threats, including as a result of previous cybersecurity incidents, have not materially affected us, including our business strategy, results of operations or financial condition, and as of the date of this Annual Report on Form 10-K, the Company is not aware of any material risks from cybersecurity threats that are reasonably likely to do so.  However, we cannot eliminate all risks from cybersecurity threats or provide assurances that the Company will not be materially affected by such risks in the future.  Due to evolving cybersecurity threats, we may not be able to protect all information systems and, as an acquisitive organization, integrating information systems as we acquire new businesses may expose us to unexpected liabilities or increase our vulnerability.  There can be no guarantee that our policies, programs and controls, and those of our third-party vendors, including those described in this section, will be sufficient to protect our information, information systems or other property.  Additional information on cybersecurity risks we face is discussed in Item 1A of Part I, “Risk Factors,” which should be read in conjunction with the foregoing information."

  }
}