{
  "ticker": "ALGN",
  "cik": "0001097149",
  "company_name": "ALIGN TECHNOLOGY INC",
  "filing_date": "2025-02-28",
  "accession": "0001097149-25-000012",
  "primary_doc": "algn-20241231.htm",
  "item_sections": {
    "item1": "Item 1.  Business. \nOur Company \nAlign Technology, Inc. (“we,” “us,” “our,” “Align” or the “Company”) is a global medical device company primarily engaged in the design, manufacture and marketing of Invisalign\n®\n clear aligners for the treatment of malocclusions, or the misalignment of teeth, by orthodontists and general dental practitioners (“GPs”), Vivera\nTM\n retainers for retention, iTero\nTM\n intraoral scanners and services for dentistry, and exocad\nTM\n computer-aided design and computer-aided manufacturing (“CAD/CAM”) software for dental laboratories and dental practitioners. Our vision and strategy is to revolutionize orthodontic and restorative dentistry through digital treatment planning and implementation using the Align\nTM \nDigital Platform, an integrated suite of proprietary technologies and services designed to deliver a seamless, end-to-end solution for patients, consumers, orthodontists, GPs and lab partners. We strive to achieve our vision and strategy through key objectives made possible with the proprietary technologies and services of the Align\nTM\n Digital Platform to establish: clear aligners as the principal solution for the treatment of malocclusions with the Invisalign System as the treatment solution of choice by orthodontists, GPs and patients globally, our iTero intraoral scanners as the preferred scanning technology for digital dental scans and our exocad CAD/CAM software as the dental restorative solution of choice for dental labs. \n3\nOur corporate headquarters are located at 410 North Scottsdale Road, Suite 1300, Tempe, Arizona 85288. Our telephone number is 602-742-2000. Our internet address is www.aligntech.com. Our Americas regional headquarters is located in Raleigh, North Carolina, U.S.A.; our European, Middle East and Africa (“EMEA”) regional headquarters is located in Rotkreuz, Switzerland; and our Asia Pacific (“APAC”) regional headquarters is located in Singapore.\nWe have two operating segments: (1) Clear Aligner and (2) Imaging Systems and CAD/CAM Services (“Systems and Services”). For the year ended December 31, 2024, Clear Aligner net revenues represented approximately 81% of worldwide net revenues, while Systems and Services net revenues represented the remaining 19%. We sell the majority of our products and services directly through a dedicated and specialized sales force to our customers: orthodontists, GPs, including prosthodontists, periodontists, oral surgeons and dental laboratories. We also sell through sales agents and distributors in certain countries. In addition, we sell directly to Dental Support Organizations (“DSOs”) who contract with dental practices to provide critical business management and support including non-clinical operations. We also sell our products to dental laboratories who use our products to manufacture or customize their own products for licensed dentists. We furthermore market and sell doctor and consumer accessory products complementary to our doctor-prescribed principal products under the Invisalign® and other brands, including retainers, dental supplies, clear aligner cases (clamshells), ultrasonic and UV electronic cleaning devices, teeth whitening products and cleaning solutions (collectively, “Invisalign Accessory Products”). Depending on the product, our Invisalign Accessory Products are sold through a variety of channels, including online through large e-commerce websites, our doctor portal and in-store through large retailers and pharmacy stores.\nOur clear aligners are sold under the Invisalign\n®\n brand name. Our Invisalign System is intended mainly for the treatment of malocclusions and is designed to help dental professionals achieve the clinical outcomes they expect and the results patients desire. To date, over 19 million people worldwide have been treated with the Invisalign System. In order to provide Invisalign treatment to their patients, orthodontists and GPs must initially complete an Invisalign training course. Our iTero intraoral scanners are used by dental professionals, labs, and service providers for restorative and orthodontic digital procedures as well as Invisalign case submissions. Our exocad CAD/CAM software products provide restorative dentistry, implantology, guided surgery and smile design to dental labs and dental practices through fully integrated workflows, with the goal to provide cross-disciplinary dentistry in labs and at chairside. \nOur Products, Services and Technologies\nAlign\nTM\n Digital Platform\nWe strive to be at the forefront of innovation in digital orthodontics and dentistry, helping doctors transform their practices using digital tools and technology to deliver exceptional, modern treatment experiences and outcomes to patients worldwide. The Align\nTM\n Digital Platform is the foundation of our goal to revolutionize the practice of dentistry, delivering interconnected, interdisciplinary workflows and treatment solutions designed to improve all aspects of treatment, from initial consultations to final smiles with our doctor-centered treatment model. The Align\nTM\n Digital Platform is an end-to-end digital platform that combines software, systems and services to seamlessly integrate and connect those critical to successful treatment outcomes – \n4\ndoctors, labs, patients and consumers. At the center of the Align\nTM\n Digital Platform are Invisalign clear aligners, iTero intraoral scanners and exocad CAD/CAM software.\nThe Align\nTM\n Digital Platform utilizes the Align\nTM\n Digital Workflow to enable an end-to-end digital treatment experience and generate interconnected workflows and treatment solutions, that includes the following key components:\n•\nConnect:\n The initial stage of the platform drives consumer demand and connects potential patients to our websites and the websites of Invisalign providers. Some of the tools that support this stage are Invisalign.com, the Invisalign SmileView\nTM\n tool, My Invisalign app, Doctor Locator, Invisalign\n®\n Practice App, and Invisalign\n®\n Virtual Appointment.\n•\nScan:\n During this stage, patient data is captured through intraoral scanning. Doctors and their staffs use intraoral scanning tools designed to support diagnosis of a patient’s oral conditions and health and support doctors to develop appropriate treatment pathways. Visualization of their potential smiles helps patients understand the benefits of treatment and increase patient conversion. The tools that support this stage, include, iTero intraoral scanners and exocad CAD/CAM imaging systems, Invisalign\n®\n Outcome Simulator Pro, Invisalign Photo Uploader, Invisalign SmileView\nTM\n tool, iTero Element\nTM \n5D auto-upload feature, iTero\nTM\n Scan Report and iTero\n-\nexocad Connector\nTM\n.\n•\nDiagnose\n: Doctors can access and use tools that support diagnosis of a patient’s oral health and develop an appropriate treatment pathway. The Align\nTM\n Digital Platform facilitates the doctor-patient conversation, through education regarding clinical needs and setting expectations. Some of the tools that support this stage include Align\nTM\n Oral Health Suite, iTero\nTM\n intraoral scanners, including those with NIRI technology (Near Infra-Red Imaging), iTero\nTM\n TimeLapse technology and iTero Occlusogram.\n•\nPlan:\n Doctors digitally visualize and plan orthodontic and restorative treatments. Orthodontists and GPs can use our products to design, build and share their vision for treatment planning and agree on a customized plan with their patients to reach the desired outcomes. Some of the tools that support this stage are ClinCheck\n®\n Pro 6.0,ClinCheck\n®\n Plan Editor, ClinCheck\n®\n In-Face Visualization, ClinCheck\n®\n Live Update, Invisalign\n®\n Practice App, Invisalign\n®\n Personalized Plan, CBCT Integration for ClinCheck\n® \nsoftware, Clincheck\n®\n Smile Video, Invisalign Smile Architect\nTM\n, iTero\nTM\n Design Suite, exocad Dental CAD\nTM\n software and exocad Dental CAD™ 3.2 Elefsina software.\n•\nTreat:\n During this stage, doctors treat their patients with our Invisalign\n®\n clear aligners and may offer teeth whitening using the Invisalign\nTM\n Professional Whitening System. The Invisalign\n®\n Palatal Expander System and the Invisalign\n®\n System with mandibular advancement featuring enhanced precision wings are additional products that support patient treatment.\n•\nMonitor:\n Doctors can remotely track their patients’ treatment between visits, and orthodontists and GPs can more easily track treatment progress and communicate issues, results and recommendations to their patients. Some of the tools that support this stage include Invisalign\n®\n Virtual Care AI, My Invisalign\nTM\n app, Invisalign Doctor Site, Invisalign\n®\n Practice App, Invisalign\n®\n Progress Assessment and iTero\nTM\n scanners.\n•\nRetain:\n Following completion of their orthodontic treatment, patients can retain the final position of their teeth using Vivera\nTM\n retainers.\nAs we further evolve the treatment planning experience for doctors through new technological research and development innovations, we expect to introduce new technologies, features and functionality that improve personalization of treatment planning, predictability, clinical preferences, and 2D/3D imaging, including digital tools for faster and more accurate final tooth positions. In 2024, we launched several new products and technologies that further enhance the Align\nTM\n Digital Platform, including the iTero Lumina\nTM\n intraoral scanner, iTero Multi-Direct Capture\nTM\n technology, Clincheck\n®\n Smile Video, iTero\nTM\n Design Suite, Invisalign Smile Architect\nTM \nwith treatment planning software with Multiple Treatment Plans, Invisalign\n®\n Outcome Simulator with Multiple Treatment Simulation and Align\nTM\n Oral Health Suite with new comparison tools.\nClear Aligner Segment\nMalocclusion and Traditional Orthodontic Treatment\n5\nMalocclusion is one of the most prevalent clinical dental conditions in the world, affecting approximately 60% to 75% of the global population. We estimate that there are approximately 600 million people globally with malocclusion who could benefit from straightening their teeth. However, most people afflicted by malocclusion do not seek orthodontic treatment for various reasons, including negative perceptions of traditional metal wires and brackets, affordability of treatment, and accessibility to doctors. Annually, only approximately 22 million people globally elect treatment by orthodontists. Today, most orthodontic patients continue to have their malocclusions treated with the use of traditional corrective methods such as metal arch wires and brackets, referred to as braces, augmented with elastics, metal expanders, headgear or functional appliances, and other ancillary devices as needed. Upon completion of a patient’s treatment, their dental professional may recommend the patient use a retainer appliance to preserve the benefits of their treatment. Of the 22 million cases started each year, we estimate that almost all can be treated using our Invisalign System, yet our share of the 22 million case starts through orthodontists is approximately 10% globally. Our business strategy remains focused on increasing our share of the existing market of orthodontic case starts compared to brackets and wires, especially among teens, and expand the market for digital orthodontics, especially among adults. By training more doctors, including GPs as well as orthodontists, increasing utilization of existing doctors using our products, educating more consumers about the benefits of straighter teeth using the Invisalign System and connecting consumers with an Invisalign-trained doctor of their choice, we are helping drive adoption of digital orthodontics and restorative dentistry globally.\nThe Invisalign System\nThe Invisalign System is a proprietary method for treating malocclusion based on a proprietary computer-simulated virtual treatment plan and a series of doctor-prescribed, custom manufactured, clear polymer removable aligners. We received 510(k) clearance from the U.S. Food and Drug Administration (“FDA”) to market the Invisalign System in 1998. The Invisalign System offers a range of treatment options, specialized services and access to proprietary software for treatment visualization and is comprised of the following phases:\nDiagnosis and transmission of treatment data\n. As part of the Align™ Digital Workflow, we have developed solutions to enable doctors to diagnosis and drive patient conversion from considering treatment to starting treatment – providing tools to support diagnosis of patients’ oral health and support to identify an appropriate treatment pathway, facilitating the doctor-patient conversation, education and clinical needs and expectations. An Invisalign trained dental professional prepares an online prescription form on our Invisalign Doctor Site and securely submits the patient’s records, which include a digital intraoral scan or a polyvinyl-siloxane (“PVS”) impression of the relevant dental arches, photographs of the patient and, at the dental professional’s election, x-rays of the patient’s dentition. Intraoral digital scans may be submitted through Align’s iTero scanner or certain third-party scanners capable of accurately interfacing with our systems and processes. Globally, approximately 94% of prescription orders for our Invisalign System are now submitted via digital scan, increasing the accuracy of treatment plans, reducing the time from when a doctor submits a prescription to the time a patient receives the clear aligners, and helping to decrease the carbon footprint resulting from elimination of the initial or upfront shipment of a patient’s PVS impressions to the doctors and shipping those PVS impressions back to us. \nComputer-simulated treatment plan\n. Our ClinCheck\n®\n Pro cloud-based treatment planning software is the cornerstone of the Align\nTM\n Digital Platform. ClinCheck Pro leverages proprietary algorithms based on the insights from data from over\n \n19 million patients treated worldwide. Using the digital scans or PVS impressions, any specific doctor preferences and digital data provided, we generate a proposed custom, three-dimensional ClinCheck\n®\n treatment plan using proprietary software developed through significant, ongoing research and development investments spanning over two decades. A patient’s ClinCheck treatment plan simulates desired tooth movement in stages and details the timing and placement of any features or attachments to be used during treatment. Attachments are tooth-colored shapes that can be affixed to a patient’s teeth to increase the biomechanical force on a specific tooth or teeth in order to affect the desired movement(s).\nTreatment plan review and approval by an Invisalign-trained doctor.\n The patient’s proposed ClinCheck treatment plan is then made available to the prescribing dental professional via our Invisalign Doctor Site, enabling the dental professional to evaluate projected tooth movement as it progresses from initial to final position and compare treatment plan options to best meet the dental professional’s treatment objectives. By reviewing, modifying as needed and approving an acceptable treatment plan, the dental professional retains control of the patient’s treatment.\nManufacture of custom clear aligners. \nFollowing the dental professional’s approval of a ClinCheck treatment plan, we use the data underlying the simulation as input for stereolithography technology (a form of 3D printing technology) to construct a series of molds. Each mold is a replica of the patient’s teeth at each stage of the simulated course of treatment. From these molds, clear aligners are fabricated by pressure-forming polymeric sheets over each mold. Clear aligners are thin, clear polymer, removable dental appliances that are custom manufactured in a series designed to correspond to each stage of a patient’s ClinCheck treatment plan.\n6\nShipment to the dental professional and patient clear aligner wear.\n Once manufactured, each clear aligner for a patient’s doctor-approved treatment plan is typically shipped directly to the dental professional. The majority of doctors then distribute each clear aligner to their patients. Each set of clear aligners (one clear aligner for the lower and a second for the upper jaw) are generally worn for one week or for a short period of time corresponding to the stages of the patient’s approved ClinCheck treatment plan and their doctor’s discretion. The patient replaces their current set of clear aligners with the next pair in the series as and when prescribed, advancing tooth movement through each stage. At various points in each patient’s treatment, their doctor may place attachments or use other auxiliaries to achieve desired tooth movements, per their doctor’s original prescription and the approved ClinCheck treatment plan. Additionally, for patients treated using many of our Invisalign System products, doctors have the option to order additional clear aligners for doctor-approved treatment plan refinements.\nClear Aligner Products\nWe offer our Invisalign System in a variety of treatment packages designed to correspond with the case-by-case treatment needs of our doctors and their patients and also designed on nonclinical needs. The table below provides a general description of the categories of products in our Invisalign System offered in various regions as they typically correspond to the severity of malocclusion and length of anticipated treatment.\nMalocclusion\nVery Mild \nModerate\nSevere\nProduct\nInvisalign® Express Package\nInvisalign® Lite Package\nInvisalign Go™ (GP)\nInvisalign® Moderate Packages (& Invisalign Go™ Plus)\nInvisalign® Comprehensive Packages\nTreatment Stages*\n7\n14\n20\n20-26\nAs many as required\nClinical Scope\nRelapse and minor movement, anterior esthetic alignment\nUp to 2mm AP correction, crowding/spacing, lower incisor extraction, pre-restorative\nNo AP correction, mild to moderate crowding, spacing, lower incisor extraction, pre-restorative tooth movement from 2nd premolar to 2nd premolar (5x5)\nClass I, mild AP correction, moderate crowding/spacing, mild anterior / posterior and vertical discrepancies, pre-restorative, (Go Plus tooth movement from 1st molar to 1st molar (6X6))\nClass I, II, III, moderate to severe crowding/spacing, anterior / posterior and vertical discrepancies, extractions, complex pre-restorative\n* The number of stages can vary by product and region.\nMost of our Invisalign System products described above provide dental professionals with the option to order additional clear aligners if the patient’s treatment progress or needs deviate from the original treatment plan. The number and timing of additional clear aligner orders are subject to certain requirements noted in our terms and conditions. \nComprehensive Products - Invisalign Treatment Options\nInvisalign Comprehensive Packages\n. The Invisalign Comprehensive Package is used to treat adults and teens over a wide spectrum of mild to severe malocclusion and contains a broad variety of features to address the desired treatment goals. It also addresses the frequently complex orthodontic needs of teenage or younger patients with advanced features such as mandibular advancement, compliance indicators and compensation for tooth eruption. These packages include Invisalign Comprehensive, Invisalign First\nTM\n Phase 1 and Invisalign First\nTM\n Comprehensive Phase 2. \nInvisalign First Phase 1 and Invisalign First Comprehensive Phase 2 Packages\n. Invisalign First Phase 1 Package is designed specifically for younger patients generally between the ages of six and ten, who frequently have a mixture of primary/baby and permanent teeth. Invisalign First Phase 1 treatment provides early interceptive orthodontic treatment, traditionally done through arch expansion, or partial metal braces, before all permanent teeth have erupted. Invisalign First Phase 1 clear aligners are designed specifically to address a wide range of younger patients’ malocclusions, including shorter clinical crowns, management of erupting dentition and predictable dental arch expansion. Our Invisalign First Comprehensive Phase 2 Package complements Invisalign First Phase 1 and is generally consistent with our Invisalign Comprehensive Package. After a patient completes Invisalign First Phase 1, doctors have the option to purchase a Comprehensive Phase 2 Package for that same patient. \nIn the first quarter of 2023, we launched the Invisalign Comprehensive 3in3 product. The 3in3 configuration offers doctors Invisalign Comprehensive treatment with a three-year treatment expiration date and three sets of additional clear aligners included prior to the treatment expiration date, rather than the five-year treatment expiration date with unlimited additional clear aligner sets prior to the treatment end date offered under the Invisalign Comprehensive Package. \n7\nNon-Comprehensive Products - Invisalign Treatment Options:\nInvisalign Non-comprehensive Packages. \nWe offer a variety of lower-priced treatment packages for less complex orthodontic cases, non-comprehensive relapse cases, or teeth straightening prior to restorative or cosmetic treatments, such as veneers. These treatment packages include Invisalign Express, Invisalign Lite, and Invisalign\n®\n Moderate. These packages may be offered in select countries and/or may differ from region to region. \nInvisalign Doctor Subscription Program (“DSP”) is our monthly subscription-based clear aligner program which includes retainers and low-stage “touch-up” clear aligner treatment. DSP is currently available in North America, Latin America, and certain countries in Europe. \nInvisalign Go Packages. \nIn various markets we also offer Invisalign Go\nTM\n, Invisalign Go\nTM\n Express and Invisalign Go Plus, which are streamlined non-comprehensive packages designed for GPs to more easily identify and treat patients with mild-to-moderate malocclusion cases, expand arch width, align anterior teeth prior to restorative treatment, and move teeth from second pre-molar to second pre-molar. These packages include case assessment support, simplified ClinCheck treatment plans and a progress assessment feature for case monitoring. \nNon-Case Products:\nThe Comprehensive and Non-Comprehensive clear aligner packages described above are distributed in cases, meaning that all the sets of clear aligners required for all the stages of a doctor-approved treatment plan are delivered in a case. We also sell non-case products. Clear aligner non-case products include retention products, Invisalign training, adjusting tools used by dental professionals during the course of treatment, ancillary Invisalign Accessory Products and other oral health products available in certain e-commerce and retail channels in the United States.\nRetention\n. We offer up to four sets of custom clear aligners called Vivera retainers made with proprietary material strong enough to maintain tooth position and correct minor relapse, if necessary, as well as Invisalign retainers. Retainers are generally available for doctors to offer to any of their patients, whether they use the Invisalign System or other products, including wires and brackets. In select markets, we also offer single set retainers. \nInvisalign Professional Whitening System.\n Additionally, we offer a professional whitening system using Ultradent’s Opalescence PF whitening system with Invisalign\n®\n clear aligners or Vivera retainers.\nNew Products/Feature Enhancement\nInvisalign® Palatal Expander System.\n In December 2023, we received 510(k) clearance in the United States for the Invisalign Palatal Expanders. Invisalign Palatal Expanders are intended for use in rapid expansion and subsequent holding of skeletal and/or dental narrow maxilla (upper jaw) with primary, mixed, or permanent dentition. The Invisalign Palatal Expander System consists of a series of removable devices staged in small increments of movement to expand a patient’s narrow maxilla to a position determined by their treating doctor. Each direct 3D printed device is customized to the patient’s unique anatomy based on an iTero™ intraoral digital scan. A palatal expansion treatment plan and device design are then developed using our proprietary orthodontic software. The Invisalign Palatal Expander is our first direct 3D printed orthodontic device. Combined with Invisalign First™ Phase 1 clear aligners, Invisalign Palatal Expanders provide doctors with a full early intervention treatment solution such as Phase 1, an early interceptive orthodontic treatment for young patients. The Invisalign Palatal Expander System is currently available in the United States, Canada, Australia, New Zealand, Hong Kong, Singapore, Japan and certain countries in EMEA. The Invisalign Palatal Expander System is expected to be commercially available in additional markets, pending regulatory approvals. \nIn January 2024, we completed the acquisition of Cubicure GmbH (“Cubicure”), a company that develops, produces and distributes innovative materials, equipment and processes for novel 3D printing solutions. We believe the acquisition of Cubicure will support our long-term growth strategy by enabling us to scale our 3D printing operations to eventually direct print millions of custom appliances per day. We expect the acquisition of Cubicure will ultimately extend and scale our printing, materials and manufacturing capabilities for our 3D printed products while concurrently materially reducing the amount of resin used in our manufacturing process. Direct fabrication offers the transformative potential of design flexibility that goes beyond what the current thermoforming technology allows. This will potentially allow us to design unique appliances \n8\nthat may perform even better than our existing ones and address unmet market needs. We expect to pilot our first devices on this platform with 3D printed retainers in the first half of 2025.\nSmart Technology: SmartTrack\nTM\n, SmartForce\nTM \nand SmartStage\nTM\nSmart technology is applied in the development of Invisalign treatments and leads to more precise control of individual and multiple tooth movements. We use a force driven system in our Invisalign clear aligners such that the next clear aligner is shaped so that when inserted, the clear aligner stretches and applies the desired force to the surface of the tooth, resulting in the desired tooth movement. Smart technology allows us to find the right thickness, the right elasticity, and the right force application over a period of time. Smart technology includes the use of SmartTrack, SmartForce and SmartStage Technology.\nSmartTrack Material\n. SmartTrack clear aligner material is a patented, custom-engineered Invisalign clear aligner material that provides gentle, more constant force to improve control of tooth movements. Conventional clear aligner materials relax and lose a substantial percentage of the force applied in the initial days of wear. SmartTrack material maintains more constant force over a longer period of time. The flexible SmartTrack material also more precisely conforms to tooth morphology, attachments and interproximal spaces to improve control of tooth movement throughout treatment.\nSmartForce Attachments\n. SmartForce attachments are small tooth-colored shapes that attach to teeth before or during Invisalign treatment. Invisalign clear aligners fit smoothly and tightly around the attachments and give the clear aligners something to gently push on. SmartForce attachments make complex tooth movements possible without braces by helping clear aligners apply the right amount of force in the right direction.\nSmartStage Technology\n. SmartStage is an advanced algorithm that determines the optimal path of tooth movement and the shape of the clear aligner at every stage of an Invisalign treatment. The programming determines tooth movement in a certain sequence, at the right time to achieve optimal outcomes with greater predictability and fewer undesirable interferences.\nSystems and Services Segment \nIntraoral scanning is a rapidly evolving technology substantially impacting the practice of dentistry. By enabling the dental practitioner to create a 3D image (digital scan) of a patient’s teeth using a handheld intraoral scanner, digital scanning is faster, more efficient, precise and comfortable for patients. Beginning patient care with the early use of our iTero intraoral scanners and combining the results with digital workflows designed to assist doctors and patients visualize and evaluate various treatment options with detailed imagery and CAD/CAM solutions helps patients decide to undergo treatment and improve treatment outcomes and satisfaction. The accuracy of digitally scanned models substantially reduces the rate of restoration “remakes,” which results in patients being recalled to dental offices less often and experiencing shorter treatment times for the restoration work because fewer procedures are required after teeth are aligned and spaced optimally, increasing overall patient satisfaction. Digital models also reduce the carbon footprint associated with the shipping of the materials used to create PVS impressions, the shipping of those impressions and their disposal. Moreover, the digital model file can be used for various procedures and services including fabrication of physical dental models for use by labs to create restorative units such as veneers, inlays, onlays, crowns, bridges and implant abutments; digital records storage; aid to caries detection; orthodontic diagnosis; orthodontic retainers and appliances; and Invisalign digital impression submission. \niTero Scanner\n. The iTero Element™ portfolio of intraoral scanners includes the iTero Element™ 2, the iTero Element™ Flex, iTero Element™ 5D Imaging System, iTero Element™ Plus Series and the iTero Lumina™ intraoral scanner which are each available in select regions and countries. These products build on the existing high precision, full-color imaging and fast scan times of the iTero Element portfolio and are available with software options for orthodontic and restorative procedures. The iTero scanner is interoperable with our Invisalign System such that a full arch or full mouth digital scan can be submitted as part of the Invisalign System prescription order submission process.\nOur iTero Element 5D Imaging System is the first integrated dental imaging system that simultaneously records 3D, intraoral color camera images, near infrared imaging (“NIRI”) technology and enables comparison over time using the iTero™ TimeLapse technology. NIRI technology, included in our iTero Element 5D and 5D Plus Imaging Systems, aids in detection and monitoring of interproximal caries above the gingiva in real time, without using harmful radiation. In October 2021, the findings of a clinical study we sponsored were published in the peer-reviewed Journal of Dentistry which demonstrated that the NIRI technology of the iTero Element 5D imaging system was 66% more sensitive than bitewing x-ray radiography for detection of interproximal lesions, without the use of harmful radiation. We received 510(k) clearance in the United States for the caries detection feature of the iTero Element 5D in 2020. The iTero Element Plus Series of intraoral scanners and imaging systems offers restorative and orthodontic digital workflows that include enhanced visualization for optimized patient \n9\nexperience, including a fully integrated 3D intraoral camera in certain models, seamless scanning with reduced processing time, artificial intelligence (“AI”)-based features, and, in certain models, NIRI technology.\nOur iTero Element scanners are offered in a number of software configurations such as Ortho Comprehensive, Restorative Comprehensive and Restorative Foundation. These software packages are included in the price of the scanner and have a service period of 1 to 5 years. They enable various orthodontic and restorative workflows as well as provide other applications, including Invisalign\n®\n Outcome Simulator, Invisalign Case Assessment tool, Invisalign Progress Assessment tool, and iTero TimeLapse technology. Our iTero software is designed for orthodontists for digital records storage, orthodontic diagnosis, and for the fabrication of printed models and retainers. Our restorative software is designed for GPs, prosthodontists, periodontists and oral surgeons and includes restorative workflows providing the ability to send digital impressions to the lab of their choice and communicate seamlessly with external treatment planning, custom implant abutment, chairside milling and laboratory CAD/CAM systems such as through our iTero-exocad Connector\nTM\n. \nIn January 2024, we launched the iTero Lumina intraoral scanner. The iTero Lumina intraoral scanner is designed with iTero Multi-Direct Capture\nTM\n technology that we believe quickly, easily and accurately captures more data while delivering exceptional scan quality and photorealistic images that remove the need for intraoral photos. iTero Multi-Direct Capture replaces the confocal imaging technology in earlier intraoral scanner models. It has a wider field of capture and multi-angled scanning that enables simultaneous capture from multiple angles. Additionally, the iTero Lumina scanner has a capture distance of up to 25mm, making it easier to scan complex oral regions such as narrow or deep palates, edentulous spaces, and partially erupted teeth with minimal maneuvering. It has a 50% smaller and 45% lighter wand (as compared to iTero Element™ 5D imaging system wand, excluding the wand cable), which is expected to be especially beneficial for kids and teen patients. The iTero Lumina scanner has photorealistic scans which enables high quality clinical decisions the same way intraoral photos do, and its advanced software enables scanning at two times the speed. We expect to launch the restorative software on the iTero Lumina intraoral scanner by the end of the first quarter of 2025.\nInvisalign® Outcome Simulator\n. The Invisalign Outcome Simulator is an exclusive chair-side and cloud-based application for the iTero scanner that allows doctors to help patients visualize how their teeth may look at the end of Invisalign treatment. This is achieved through a dual view layout that shows a prospective patient an image of their own current dentition next to a simulated final position after Invisalign treatment.\nInvisalign® Progress Assessment Tool. \nThe Invisalign Progress Assessment tool provides the ability to compare a patient’s new scan with a specific stage of their ClinCheck\n®\n treatment plan, allowing doctors to visually assess and communicate Invisalign treatment progress with an easy-to-read, color-coded, tooth movement report.\niTero\nTM\n TimeLapse Technology\n. Our iTero\nTM\n TimeLapse technology allows doctors or practitioners to compare a patient’s historic 3D scans to the present-day scan, enabling clinicians to identify and measure orthodontic movement, tooth wear, and gingival recession. This highlights areas of diagnostic interest to dental professionals and helps foster a proactive conversation with the patient regarding potential restorative or orthodontic solutions.\nAlign\nTM\n Oral Health Suite\n. The Align™ Oral Health Suite is a digital interface designed to enhance dental consultations and drive patient acceptance of dental treatment. It offers a modern approach to dental examinations, featuring an innovative clinical framework designed to empower doctors and their clinic staff to conduct comprehensive oral health assessments via a single scan using patient-friendly terminology, and providing a highly engaging patient-centric experience. It integrates iTero diagnostic aid and visualization tools, such as iTero NIRI, iTero Occlusogram, iTero TimeLapse and Invisalign Outcome Simulator Pro into a single interface chairside on the iTero scanner.\nCAD/CAM Service\ns. Our exocad CAD/CAM software platform addresses restorative needs in an end-to-end digital platform workflow to facilitate ortho-restorative and comprehensive dentistry. The platform provides doctors and dental labs with digital clinical solutions that aid GPs and dental labs in planning and delivering restorative dental treatments, adding restorative functionality to our comprehensive digital platform to deliver digital ortho-restorative workflows and interdisciplinary dentistry. Our exocad software is licensed and sold separately.\nOther proprietary software mentioned in this Annual Report on Form 10-K, such as software embedded in our iTero intraoral scanners, ClinCheck and ClinCheck Pro software, the Invisalign Doctor Site, Align X-Ray Insights and feature enhancements included as part of the Invisalign System are not sold separately, nor do they contribute as individual items to revenues. \n10\nBusiness Strategy\nOver the past 27 years, Align has helped doctors treat over 19 million patients with the Invisalign System and is driving the evolution in digital dentistry through the Align\nTM\n Digital Platform. Our technology and innovations are designed to meet the demands of today’s patients with convenient, comfortable and affordable treatment options, while improving overall oral health. We strive to help doctors and lab technicians move their businesses forward by connecting them with new patients, providing digital solutions that increase operational speed and efficiency and provide solutions that allow them to deliver exceptional treatment outcomes and experiences to millions of people around the world. We achieve this by focusing on and executing our strategic growth drivers: \n•\nInternational Expansion. \nWe continue increasing our presence globally by increasing awareness of our products and by making them available in more countries to more customers and consumers. We continue expansion of our sales and marketing by reaching into new countries and regions, including new areas in Africa and Latin America. As of the end of 2024, we are selling directly or through authorized distributors in more than 100 countries. As our business continues to grow in both number of new Invisalign-trained doctors and customer utilization, we support that growth through targeted investments such as clinical support, product improvements, technological innovations, clinical education and advertising. In addition, we are scaling and expanding our operations and facilities to better support the growing numbers of global customers. As of the end of 2024, we have 13 fabrication and treatment planning locations throughout the world. We have a manufacturing facility in each of our three key regions: Americas (Mexico), APAC (China), and EMEA (Poland).\n \nEach of these three facilities form the foundation of our manufacturing strategy, which continues to evolve to increase flexibility and optimize our capacity and cost structure. We also perform digital treatment planning and interpretation for restorative cases worldwide, including in Costa Rica, China, Germany, Spain, Poland, and Japan, among others. By establishing and expanding our key operational activities in locations closer to our customers, we are creating an infrastructure that allows us to be responsive to local and regional needs, while providing global operational flexibility and scale needed for variations in global and regional demand. We expect to continue expanding our business in 2025 by investing in resources, infrastructure and initiatives that help drive Invisalign treatment growth, position our iTero intraoral scanners as the preferred scanning technology for digital dental scans, and establish our exocad CAD/CAM software as the solution of choice for dental labs in existing and new international markets.\n•\nGP Dentist Treatment\n. We strive to enable GPs, who have the potential to treat the general patient population, to more easily identify potential cases they can treat with the Invisalign System, monitor patient progress or, if needed, help refer cases to an orthodontist while providing high-quality restorative, orthodontic and dental hygiene care. We believe success with GPs can be achieved through doctor training and clinical education, by offering digital tools such as the iTero intraoral scanner and products like Invisalign Go™ treatment that address the distinctive needs of GP patients, all delivered by sales and marketing personnel specifically focused on the unique needs of this customer category. We encourage GPs to scan every patient with intraoral scanners as a means to diagnose and treat patients over time and as an opportunity to drive future demand for their services and the Invisalign System. DSOs represent a large and growing opportunity to help drive adoption of digital technology across the dental industry. We have well established relationships with many DSOs globally that recognize the benefits of digital workflows enabled by our portfolio of products and services that make up the Align\nTM\n Digital Platform, including increased practice efficiency and profitability, as well as delivering a better patient experience from shorter cycle times and customer proximity. We have and may continue to financially invest in or explore collaborations with key ecosystem partners, including DSOs, whose missions and visions align with our own vision, strategy, business model and goals.\n•\nPatient Demand.\n Our goal is to make the Invisalign brand a highly recognized name brand worldwide by creating awareness for Invisalign treatment among consumers and motivating the potential 600 million patients who can benefit from treatment of malocclusion to seek treatment using the Invisalign System. We accomplish this through an integrated consumer marketing strategy that includes television, media, social networking and event marketing and strategic alliances with professional sports teams, as well as educating patients on treatment options and directing them to high volume Invisalign trained doctors. To further drive consumer awareness, we continue to offer additional dental-related Invisalign Accessory Products under the Invisalign brand name available in certain e-commerce channels in the United States. The initial stage of the Align\nTM\n Digital Platform drives consumer demand and connects potential patients to our websites and the websites of Invisalign providers. Some of the tools that support this stage are Invisalign.com, the Invisalign SmileViewTM tool, My Invisalign app, Doctor Locator, Invisalign® Practice App, and Invisalign® Virtual Appointment. The Align\nTM\n Digital Platform also facilitates the doctor-patient conversation, through education regarding clinical needs and setting expectations. Some of the tools that support this stage include \n11\nAlign™ Oral Health Suite, that integrates iTero diagnostic aid and visualization tools, such as iTero NIRI, iTero Occlusogram, iTero TimeLapse and Invisalign Outcome Simulator Pro with multiple treatment plans.\n•\nOrthodontist Utilization.\n We continue to innovate and increase product applicability and predictability to address a wide range of cases, from simple to complex, thereby enabling doctors to confidently diagnose and treat children and adults with the Invisalign System. This is especially important to treating teenage patients who make up the largest portion of the 22 million annual orthodontic case starts. We also continue to make improvements to our Invisalign treatment software, ClinCheck Pro, designed to deliver an exceptional user experience and increase treatment control to help doctors achieve their treatment goals. In combination with the new Invisalign System innovations that are part of the Align\nTM\n Digital Platform, we are enhancing the digital treatment planning experience for orthodontics by providing doctors with greater flexibility, consistency of treatment preferences and real-time treatment plan access and modification capabilities. \nManufacturing and Suppliers\nWe have regional fabrication facilities in our main markets for clear aligners, which are located in Juarez, Mexico; Ziyang, China; and Wroclaw, Poland. We believe this allows us to better serve our global customer base by being closer to our doctor customers and driving efficiencies in the business. We produce our handheld intraoral scanner wand, perform final scanner assembly and repair our scanners at our facilities in Ziyang, China and Petah Tikva, Israel and also perform final scanner assembly in Blonie, Poland and Juarez, Mexico; as well as service and repair certain scanners in Juarez, Mexico. \nWe also perform digital treatment planning and interpretation for restorative cases based on digital scans generated by our iTero intraoral scanners. Our digital treatment planning facilities are located worldwide, including in Costa Rica, China, Germany, Spain, Poland and Japan, among other international locations.\nOur quality system is required to be in compliance with the Quality System regulations enforced by the FDA, and similar regulations of other worldwide regulatory authorities. We are certified to ISO 13485:2016, an internationally recognized standard for medical device quality. We are routinely audited by third-party certification bodies as well as global health authorities for compliance to this standard and other international regulations. We maintain a formal, documented quality system by which quality objectives are defined, understood and achieved. Systems, processes and procedures are implemented to ensure high levels of product and service quality. We monitor the effectiveness of the quality system based on internal data and direct customer feedback and strive to continually improve our systems and processes, taking corrective action, as needed.\nSince the mass-customized treatment planning and manufacturing processes of our products requires substantial and varied technical expertise, we believe our manufacturing capacity and capabilities are important to our success. In order to produce our highly-customized, highly-precise, medical quality products in volume, we have developed a number of proprietary processes and technologies. These include complex software algorithms and solutions, including AI and machine-learning based CAD/CAM software, vision systems, CT scanning, stereolithography and automated custom clear aligner fabrication equipment. To increase the efficiency and yield of our manufacturing processes, we continue to focus our efforts on software development, equipment development and the improvement of rate-limiting processes or bottlenecks. In addition, we have invested in developing technologies that will allow us to directly print the devices that may help us improve and streamline the processes as well as the performance of devices. We continuously upgrade our proprietary, three-dimensional treatment planning software to enhance computer analysis of treatment data and to reduce time spent on manual and judgmental tasks for each case, thereby increasing the efficiency of our technicians. Moreover, to improve efficiency and increase the scale of our operations, we continue to invest in the development of automated systems for the fabrication and packaging of clear aligners.\nIn addition, predictable and consistent production is essential to our commitment to timely deliver products to our customers efficiently and profitably. Our production can be disrupted by such things as supply chain and shipping issues, production manufacturing software system issues, quality and safety issues, and production equipment downtime. Accordingly, as we have grown our operations, we have included flexibility and resiliency in our overall manufacturing design to mitigate the risks of production downtime. Our manufacturing facilities include backup generators and systems and each facility has an emergency response plan that is part of ongoing employee training and testing through recurring cross functional scenario-based simulation exercises. Likewise, having manufacturing facilities in key regions provides us with greater flexibility and capacity to adjust and redirect production to one or more of our production facilities as needed.\nAs part of our manufacturing resiliency design efforts, we have also considered climate change and climate-related risks such as higher average global temperatures, rising sea levels and more frequent and severe wildfires, hurricanes, floods, winter storms, heat waves and other events and natural disasters (collectively, “climate-related risks”). We view climate-related risks to be one of many operational challenges we face and factor them into our business continuity planning and strategic risk mitigation efforts. \n12\nFor instance, our manufacturing plants and operations may be impacted by extreme temperatures and weather, subjecting us to potential brownouts and blackouts, increased energy costs and capital investments needed to maintain ideal operating temperatures. Our manufacturing facility in Juarez, Mexico is located in an area classified as high-water stress and our operations could be impacted by water shortages, rationing and droughts. Our California, Costa Rica, Mexico and North Carolina operations are located in areas that have historically been impacted by extreme weather events such as hurricanes, tornados, wildfires or flooding. \nIn part to help mitigate risks to our manufacturing operations, we have strategically located our clear aligner production facilities in three facilities on different continents. This allows us to both respond more quickly to customer demand while also offering redundancy in the event natural disasters or climate-related events affect operations at one or more facilities. Moreover, each of our three key clear aligner manufacturing facilities are located at elevations less likely to be impacted by rising sea levels and at least two hundred miles inland.\nMoreover, we are highly dependent on manufacturers of specialized scanning equipment, rapid prototyping machines, resin and other advanced materials for our clear aligners, as well as the optics, electronic and other mechanical components of our intraoral scanners. We maintain single or sole source supplier relationships for many of these machines and materials technologies. In particular, our CT scanning and stereolithography equipment used in our clear aligner manufacturing and many of the critical components for the optics of our intraoral scanners are provided by single or sole source suppliers. We also currently purchase our resin and polymer, the primary raw materials used in our manufacturing process for clear aligners, from a single source. A discussion of the risks of our supply and manufacturing operations, including foreign operations, may be found in",
    "item1a": "Item 1A of this Annual Report on Form 10-K under the heading \n“Risk Factors.”\nGovernance\nRole of Management\nTo more effectively assess and manage cybersecurity threats, we have a dedicated \nChief Information Security Officer (“CISO”)\n who is responsible for leading enterprise-wide information security strategy, policy, process, and technology.\n \nOur current CISO has 20+ years of information security and risk management experience and holds a Certified Information Systems Security Professional (CISSP) certification.\n \nOur CISO regularly briefs our Audit Committee on our cybersecurity and information security program and cybersecurity incidents deemed to pose a risk of a critical business impact or reputational harm.\nOur information security team, comprised of employees with an expertise in cybersecurity and information technology, regularly assesses the threat landscape and takes a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection and response. Our information security team annually performs a cybersecurity enterprise risk assessment and presents the results to management and the Audit Committee. In addition, our internal audit team conducts periodic audits of the Company’s systems and cybersecurity processes, with findings reported to the Audit Committee and senior management.\nRole of the Board of Directors and the Audit Committee\nOur Audit Committee has responsibility for overseeing and reviewing our cybersecurity, data privacy, and other information technology risks, controls and procedures, including our plans to mitigate cybersecurity risks and to respond to data breaches. Our Audit Committee also reviews with management any specific cybersecurity issues that could affect the adequacy of our internal controls and disclosure procedures and any public disclosures about our cybersecurity controls and procedures, the Board of Directors’ cybersecurity expertise, and its oversight of cybersecurity risk. \nThe Audit Committee periodically reports on its review of cybersecurity risks and our cybersecurity program to our \nBoard of Directors\n.  In 2024, our CISO or his team met with the Audit Committee four times to discuss cybersecurity risks and threats.\n36",
    "item1b": "Item 1B.  Unresolved Staff Comments.\nNone.",
    "item1c": "Item 1C.  Cybersecurity. \nOverview\nWe have \nimplemented\n a cross-functional information security program to assess, identify and manage material risks from cybersecurity risk, which includes seeking input from our employees, management, third-party vendors, the Audit Committee of the Board of Directors (“Audit Committee”) and the Board of Directors.\n \nOur information security program’s ultimate goal is preventing cybersecurity incidents to the extent feasible, while simultaneously increasing our system resilience to minimize the business impact should an incident occur. In the event of an identified cybersecurity incident, we have developed a detailed cybersecurity incident response process, which outlines the steps to be followed from incident detection, analysis, containment, eradication, recovery and notification, including notifying functional areas (e.g. information technology, legal, finance, operations, privacy), as well as senior leadership and the Audit Committee, as appropriate. In certain instances, incidents are escalated to certain members of our legal team who are responsible for, among other things, the accurate and timely disclosure of material cybersecurity incidents required under federal securities laws, including making the materiality determination and approving related securities disclosures.\nRisk Management and Strategy\nOur information security program devotes significant resources to cybersecurity and risk management processes to adapt to the changing cybersecurity landscape and respond to emerging threats in a timely and effective manner. We regularly assess the threat landscape and take a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection and response. Our information security program leverages the National Institute of Standards and Technology (NIST) and International Organization for Standardization (ISO) 27001 frameworks choosing to organize our cybersecurity risks into five categories: identify, protect, detect, respond and recover. This does not imply that we meet any particular technical standards, specifications, or requirements, only that we use the NIST and ISO frameworks as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business.\nOur information security program is integrated into our overall enterprise risk management program. Our information security program includes, among other things: \n•\ncybersecurity incident response;\n•\nvulnerability management;\n35\n•\nantivirus and malware protection;\n•\ntechnology compliance and risk management; \n•\nencryption; \n•\nidentity and access management; \n•\napplication security; and\n•\nsecurity monitoring. \nOur information security program also includes an information security awareness program, which includes annual training regarding our acceptable use and information classification and handling policies, regular phishing campaigns complemented by additional employee training as appropriate, and communications and companion trainings to keep users informed on current events. \nOur information security team engages third-party services to conduct evaluations of our security controls, including penetration testing and independent audits.\n Annually, an external auditor conducts a System and Organization Controls (“SOC”) type 2 audit covering the security principle for systems supporting our products. \nOur assessment of risks associated with the use of third-party vendors is part of our overall cybersecurity risk management framework.\n If a third-party vendor is unable to provide a SOC 1 or SOC 2 report, our information security team takes additional steps to assess its cybersecurity preparedness and our initiation or continued engagement with it. Additionally, third-party vendors are required to include security and privacy addenda to our contracts where determined applicable and are reassessed periodically as necessary depending on the risk level that has been assigned to the third-party vendor. Our legal team also requires that our third-party vendors report cybersecurity incidents to us so the impact of the incident on us can be assessed. \nAs of the date of this Annual Report on Form 10-K, we have \nnot identified\n any risks from known cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations or financial condition. Notwithstanding the approach we take to cybersecurity, we may not successfully prevent or mitigate cybersecurity incidents that could have a material adverse effect on us. While we maintain cybersecurity insurance, the costs related to cybersecurity threats or disruptions may not be covered or, if covered, fully insured. \nFor a discussion of our cybersecurity-related risks, see Part I,"
  }
}