{
  "ticker": "AMGN",
  "cik": "0000318154",
  "company_name": "AMGEN INC",
  "filing_date": "2025-02-14",
  "accession": "0000318154-25-000010",
  "primary_doc": "amgn-20241231.htm",
  "item_sections": {
    "item1a": "tem 1A. Risk Factors—\nOur business may be affected by litigation and government investigations. \nWe describe our legal proceedings and other matters that are significant or that we believe could become significant in this footnote.\nWe record accruals for loss contingencies to the extent that we conclude it is probable that a liability has been incurred and the amount of the related loss can be reasonably estimated. We evaluate, on a quarterly basis, developments in legal proceedings and other matters that could cause an increase or decrease in the amount of the liability that has been accrued previously.\nOur legal proceedings involve various aspects of our business and a variety of claims, some of which present novel factual allegations and/or unique legal theories. In each of the matters described in this filing, in which we could incur a liability, our opponents seek an award of a not-yet-quantified amount of damages or an amount that is not material. In addition, a number of the matters pending against us are at very early stages of the legal process, which in complex proceedings of the sort we face often extend for several years. As a result, none of the matters described in this filing, in which we could incur a liability, have progressed sufficiently through discovery and/or the development of important factual information and legal issues to enable us to estimate a range of possible loss, if any, or such amounts are not material. While it is not possible to accurately predict or determine the eventual outcomes of these matters, an adverse determination in one or more of these matters currently pending could have a material adverse effect on our consolidated results of operations, financial position or cash flows.\nCertain recent developments concerning our legal proceedings and other matters are discussed below.\nRepatha Patent Litigation\nPatent Disputes in the International Region\nWe are involved in and expect future involvement in additional disputes regarding our PCSK9 patents in other jurisdictions and regions. This includes matters filed against us and that we have filed in Germany and Japan.\nGermany\nIn February 2016, the EPO granted European Patent No. 2,215,124 (the EP’124 Patent) to Amgen. This patent describes and claims monoclonal antibodies to PCSK9 and methods of treatment and Sanofi filed an opposition to the patent in the EPO seeking to invalidate it. In November 2016, Sanofi-Aventis Deutschland GmbH, Sanofi-Aventis Groupe S.A. and Sanofi Winthrop Industrie S.A. filed a joint opposition against Amgen’s patent, and each of Lilly, Regeneron Pharmaceuticals, Inc. (Regeneron) and Strawman Ltd. also filed oppositions to Amgen’s patent. In November 2018, the EPO confirmed the validity of Amgen’s EP’124 Patent, which was appealed to the Technical Board of Appeal (TBA). On October 29, 2020, the TBA upheld the validity of certain claims, including claims that protect Repatha, but ruled that broader claims encompassing PRALUENT were invalid. As a result of the TBA’s decision, national litigations regarding PRALUENT in Germany are in the process of being resolved.\nIn Germany, Sanofi-Aventis Deutschland GmbH and Regeneron filed actions in the Regional Court of Munich seeking damages arising from the provisional enforcement of an injunction against PRALUENT that was lifted after the TBA’s October 2020 ruling. On May 8, 2024, the Regional Court of Munich issued a preliminary decision and scheduled a further oral hearing on January 15, 2025. On November 13, 2024, the Regional Court of Munich scheduled the next hearing in the matter for May 21, 2025.\nOn July 21, 2022, Sanofi Biotechnology SAS filed an action against Amgen GmbH and Amgen (Europe) B.V. before the Regional Court of Dusseldorf alleging that the marketing and sale of Repatha infringes European Patent No. 2,756,004 (the EP’004 Patent), which Sanofi Biotechnology SAS licensed from Regeneron. Sanofi Biotechnology SAS is seeking \nF-49\ninfringement damages and injunctive relief. On May 13, 2024, the Regional Court of Dusseldorf stayed the hearing on Sanofi Biotechnology SAS’ infringement action pending the outcome of Amgen’s Nullity Action against the EP’004 Patent before the German Federal Patent Court.\nOn August 3, 2023, Amgen GmbH filed a Nullity Action before the German Federal Patent Court seeking invalidation of Regeneron’s EP’004 Patent. Regeneron filed a Statement of Defense on November 20, 2023. On February 29, 2024, the German Federal Patent Court scheduled the main hearing for November 25, 2025.\nUnified Patent Court of the European Union\nOn June 1, 2023, Amgen filed an action before the Munich Local Division of the Unified Patent Court (UPC) against Sanofi-Aventis Deutschland GmbH, Sanofi-Aventis Groupe S.A., Sanofi Winthrop Industrie S.A. (collectively, Sanofi-Aventis), and Regeneron alleging that the importation, marketing, sale and use of PRALUENT infringes European Patent 3,666,797 (the EP’797 Patent) seeking an injunction and damages for past infringement. Regeneron filed counterclaims for revocation, but on February 5, 2024, the court transferred the counterclaims to the Central Division of the UPC that is presiding over Sanofi’s revocation action. The Munich Local Division of the UPC scheduled the hearing on our EP’797 Patent infringement action to begin on October 16, 2024.\nOn June 29, 2023, the Central Division of the UPC served Amgen with an action that was filed by Sanofi-Aventis that seeks revocation of the EP’797 Patent. The Central Division of the UPC scheduled a hearing on the revocation action and on July 16, 2024, the Central Division of the UPC rendered its decision, concluding that the patent claims are invalid and revoked the EP’797 Patent. Subsequently, on July 29, 2024, the Munich Local Division of the UPC stayed Amgen’s action against Sanofi-Aventis alleging that the importation, marketing, sale and use of PRALUENT infringes the EP’797 Patent. On September 13, 2024, Amgen filed a Statement of Appeal with the Court of Appeals to the UPC to set aside the Central Division of the UPC’s decision to revoke the EP’797 Patent. The Court of Appeals scheduled oral arguments to take place on May 22, 2025.\nOn January 10, 2024, Sanofi Biotechnologies SAS and Regeneron filed an action against Amgen Inc., Amgen Europe B.V., Amgen N.V., Amgen GmbH, Amgen B.V., Amgen SAS, and Amgen S.R.L before the Dusseldorf Local Division of the UPC, alleging infringement of EP 3,536,712 (the EP’712 Patent), which Sanofi Biotechnology SAS licensed from Regeneron. Sanofi and Regeneron are seeking an injunction against the sale, marketing, use, importation, or storage of Repatha for certain specified uses in Belgium, France, Germany, Italy and the Netherlands. Amgen filed counterclaims for invalidity and non-infringement. On September 25, 2024, Sanofi Biotechnologies SAS and Regeneron filed a brief seeking to expand the ongoing action before the Dusseldorf Local Division of the UPC, alleging that Amgen’s Repatha infringes a newly-issued patent, European Patent No. 4,252,857 (the EP’857 Patent), seeking an injunction against the marketing, use, or importation of Repatha in 18 countries (Austria, Belgium, Bulgaria, Denmark, Estonia, Finland, France, Germany, Italy, Latvia, Lithuania, Luxembourg, Malta, the Netherlands, Portugal, Romania, Slovenia and Sweden) and damages for past infringement. On December 13, 2024, the Dusseldorf Local Division of the UPC denied Sanofi and Regeneron’s request to extend the complaint and ordered that only the issues of infringement and validity of the EP’712 Patent are to be addressed at an oral hearing scheduled for February 25, 2025. On February 4, 2025, the Dusseldorf Local Division of the UPC formally ordered separation of the EP’857 Patent from the ongoing litigation and ordered Sanofi and Regeneron to file a new Statement of Case by February 28, 2025.\nEuropean Patent Office\nOn November 16, 2023 and February 29, 2024, Sanofi-Aventis and Regeneron each filed a notice of opposition against Amgen’s EP’797 Patent before the EPO’s Opposition Division. An oral hearing has been scheduled for March 31 to April 4, 2025.\nOn February 29, 2024, Amgen filed a Notice of Opposition and Grounds of Opposition before the EPO against Regeneron’s EP’712 Patent. On March 15, 2024, the EPO notified the parties that the opposition will be accelerated in view of the infringement action pending against Amgen on the EP’712 Patent in the Dusseldorf Local Division of the UPC. An oral hearing has been scheduled for March 11 to 12, 2025.\nJapan\nOn April 24, 2020, the Supreme Court of Japan declined to hear Sanofi K.K.’s appeals making final the High Court’s decisions that PRALUENT infringes Amgen’s valid patent rights in Japan. On June 24, 2020, Amgen filed written answers to the invalidity trials initiated by Regeneron on February 12, 2020 before the Japan Patent Office seeking to invalidate Amgen’s Japanese patents that were previously held infringed by PRALUENT and valid over challenges filed by Sanofi K.K. On April 15, 2021, the Japan Patent Office dismissed Regeneron’s invalidity trials, and in August 2021 Regeneron appealed the decisions to the High Court. On January 26, 2023, the High Court found Amgen’s patent claims invalid for lacking adequate support and \nF-50\nAmgen appealed to the Supreme Court of Japan on March 13, 2023. On September 15, 2023, the Supreme Court of Japan declined to hear Amgen’s appeal. The case was remanded to the Japan Patent Office for further proceedings.\nDamages proceedings against Sanofi K.K. are ongoing before the Tokyo District Court, where Sanofi K.K. has initiated new validity challenges to Amgen patents in Japan. On September 27, 2023, the Tokyo District Court found Amgen’s patent claims invalid and dismissed Amgen’s lawsuit for damages. Amgen appealed the Tokyo District Court’s decision to the Intellectual Property High Court on December 28, 2023. The Intellectual Property High Court rejected Amgen’s appeal and remanded the case to the Japan Patent Office. Amgen sought amended patent claims before the Japan Patent Office. The Japan Patent Office rejected Amgen’s amended patent claims, and Amgen filed an appeal brief with the Intellectual Property High Court on September 16, 2024 seeking to overturn the Japan Patent Office’s decision.\nProlia/XGEVA Biologics Price Competition and Innovation Act (BPCIA) Litigation\nAmgen Inc. et al. v. Celltrion Inc., et al.\nOn May 28, 2024, Amgen Inc. and Amgen Manufacturing Limited LLC filed a lawsuit in the U.S. District Court for the District of New Jersey (New Jersey District Court) against Celltrion Inc. and Celltrion USA, Inc. (collectively, Celltrion) based on the submission to the FDA of a BLA seeking approval to market and sell a biosimilar version of Amgen’s Prolia and XGEVA products. The complaint asserts infringement of the following \n29\n patents: U.S. Patent Nos. 7,364,736; 7,427,659; 7,928,205; 8,053,236; 8,460,896; 8,680,248; 9,012,178; 9,228,168; 9,320,816; 9,328,134; 9,359,435; 10,106,829; 10,167,492; 10,227,627; 10,513,723; 10,583,397; 10,822,630; 10,894,972; 11,077,404; 11,098,079; 11,130,980; 11,254,963; 11,299,760; 11,319,568; 11,434,514; 11,459,595; 11,486,883; 11,946,085; and 11,952,605 (collectively, the Asserted Patents against Celltrion). Amgen seeks a judgment from the New Jersey District Court that Celltrion has infringed or will infringe one or more claims of each of the Asserted Patents against Celltrion and based on that judgment, a permanent injunction prohibiting the commercial manufacture, use, offer to sell, or sale within the United States or importation into the United States of Celltrion’s proposed denosumab biosimilar before expiration of each of the Asserted Patents against Celltrion found infringed. Amgen also seeks monetary remedies for any past acts of infringement. Celltrion responded to the complaint on July 11, 2024, denying infringement and asserting affirmative defenses including invalidity and non-infringement. On November 25, 2024, the New Jersey District Court issued a Scheduling Order including a hearing on claim construction scheduled for February 14, 2025 and trial beginning on April 7, 2025. On January 23, 2025, the New Jersey District Court issued a consent judgment and injunction finding the Asserted Patents against Celltrion valid, enforceable and infringed by the Celltrion biosimilar denosumab products in the United States. The injunction prohibits Celltrion, its affiliates and any third party acting on behalf of or in active concert with Celltrion from making using, offering to sell, selling or importing Celltrion’s denosumab biosimilar products into the United States before June 1, 2025, except as specifically authorized by a confidential binding settlement term sheet and 35 U.S.C. 271. Specific financial terms remain confidential. The parties’ remaining claims and counterclaims were dismissed with prejudice.\nAmgen Inc. et al. v. Samsung Bioepis Co. Ltd., et al.\nOn August 12, 2024, Amgen Inc. and Amgen Manufacturing Limited LLC filed a lawsuit in the New Jersey District Court against Samsung Bioepis Co. Ltd. (Bioepis) and Samsung Biologics Co., Ltd., (Biologics, and collectively with Bioepis, Samsung) based on the submission to the FDA of a BLA seeking approval to market and sell a biosimilar version of Amgen’s Prolia and XGEVA products. The complaint asserts infringement of the following \n34\n patents: U.S. Patent Nos. 7,364,736; 7,888,101; 7,928,205; 8,058,418; 8,247,210; 8,460,896; 8,680,248; 9,012,178; 9,320,816; 9,328,134; 9,359,435; 9,481,901; 10,106,829; 10,167,492; 10,227,627; 10,421,987; 10,513,723; 10,583,397; 10,655,156; 10,822,630; 10,894,972; 10,907,186; 11,098,079; 11,130,980; 11,254,963; 11,292,829; 11,299,760; 11,384,378; 11,427,848; 11,434,514; 11,634,476; 11,685,772; 11,744,950; and 11,946,085 (collectively, the Asserted Patents against Samsung). Amgen seeks a judgment from the New Jersey District Court that Samsung has infringed or will infringe one or more claims of each of the Asserted Patents against Samsung and, based on that judgment, a permanent injunction prohibiting the commercial manufacture, use, offer to sell, or sale within the United States or importation into the United States of Samsung’s proposed denosumab biosimilar before expiration of each of the Asserted Patents against Samsung found infringed. Amgen also seeks monetary remedies for any past acts of infringement. Bioepis filed its Answer and Counterclaims in response to the Complaint on October 1, 2024. On November 12, 2024, Bioepis filed an Amended Answer and Counterclaims, and Amgen responded to the Amended Counterclaims on November 26, 2024. Biologics’ response to the Complaint was submitted on October 28, 2024. A trial date has not yet been set.\nAmgen Inc. et al. v. Fresenius Kabi USA, LLC et al.\nOn October 4, 2024, Amgen Inc. and Amgen Manufacturing Limited LLC filed a lawsuit in the U.S. District Court for the Northern District of Illinois (Illinois District Court) against Fresenius Kabi USA, LLC, Fresenius SwissBiosim GmbH, Fresenius Kabi Deutschland, GmbH, and Fresenius Kabi Austria GmbH (collectively Fresenius) based on the submission to the \nF-51\nFDA of a BLA seeking approval to market and sell a biosimilar version of Amgen’s Prolia and XGEVA products. The complaint asserts infringement of the following \n33\n patents: U.S. Patent Nos. 7,364,736; 7,888,101; 7,928,205; 8,053,236; 8,058,418; 8,460,896; 8,680,248; 9,012,178; 9,228,168; 9,320,816; 9,328,134; 9,359,435; 10,106,829; 10,167,492; 10,227,627; 10,513,723; 10,583,397; 10,655,156; 10,822,630; 10,894,972; 11,077,404; 11,098,079; 11,130,980; 11,254,963; 11,299,760; 11,319,568; 11,434,514; 11,459,595; 11,744,950; 11,786,866; 11,946,085; 11,952,605; and 12,084,686 (collectively, the Asserted Patents against Fresenius). Amgen seeks a judgment from the Illinois District Court that Fresenius has infringed or will infringe one or more claims of each of the Asserted Patents against Fresenius and based on that judgment, a permanent injunction prohibiting the commercial manufacture, use, offer to sell, or sale within the United States or importation into the United States of Fresenius’s proposed denosumab biosimilar before expiration of each of the Asserted Patents against Fresenius found infringed. Amgen also seeks monetary remedies for any past acts of infringement. Fresenius responded to the complaint on December 4, 2024, denying infringement and asserting affirmative defenses including invalidity and non-infringement.\nOn February 6, 2025, the Judicial Panel on Multidistrict Litigation granted Amgen’s November 15, 2024 motion to transfer this case from the Illinois District Court to the New Jersey District Court for coordinated and consolidated pretrial proceedings with the other cases involving Prolia/XGEVA biosimilars pending in the district.\nAmgen Inc. et al. v. Accord et al. \nOn November 13, 2024, Amgen Inc. and Amgen Manufacturing Limited LLC filed a lawsuit in the U.S. District Court for the Eastern District of North Carolina (North Carolina District Court) against Accord Biopharma, Inc., Accord Healthcare, Inc. and Intas Pharmaceuticals, Ltd. (collectively Accord) based on the submission to the FDA of a BLA seeking approval to market and sell a biosimilar version of Amgen’s Prolia and XGEVA products. The complaint asserts infringement of the following \n34\n patents: U.S. Patent Nos. 7,364,736; 7,662,930; 7,888,101; 7,928,205; 8,053,236; 8,058,418; 8,460,896; 8,680,248; 9,012,178; 9,133,493; 9,228,168; 9,320,816; 9,328,134; 9,359,435; 9,388,447; 10,106,829; 10,167,492; 10,227,627; 10,513,723; 10,583,397; 10,655,156; 10,822,630; 10,894,972; 11,077,404; 11,098,079; 11,130,980; 11,254,963; 11,299,760; 11,319,568; 11,434,514; 11,459,595; 11,946,085; 11,952,605; and 12,084,686 (collectively, the Asserted Patents against Accord). Amgen seeks a judgment from the North Carolina District Court that Accord has infringed or will infringe one or more claims of each of the Asserted Patents against Accord and based on that judgment, a permanent injunction prohibiting the commercial manufacture, use, offer to sell, or sale within the United States or importation into the United States of Accord’s proposed denosumab biosimilar before expiration of each of the Asserted Patents against Accord found infringed. Amgen also seeks monetary remedies for any past acts of infringement. Accord responded to the complaint on January 10, 2025, denying infringement and asserting affirmative defenses including invalidity and non-infringement.\nOn February 6, 2025, the Judicial Panel on Multidistrict Litigation granted Amgen’s November 15, 2024 motion to transfer this case from the North Carolina District Court to the New Jersey District Court for coordinated and consolidated pretrial proceedings with the other cases involving Prolia/XGEVA biosimilars pending in the district.\nOn December 30, 2024, the parties jointly filed a stipulation agreeing to a consent injunction, which was subsequently entered by the North Carolina District Court, providing that that the Accord biosimilar products at issue will not be made, used, sold, offered for sale or imported into the United States before October 1, 2025, except as permitted by 35 U.S.C. § 271(e)(1).\nPAVBLU\n™\n (aflibercept-ayyh) Patent Litigation\nOn January 10, 2024, Regeneron filed a lawsuit in the U.S. District Court for the Central District of California (California Central District Court) against Amgen alleging infringement of \n32\n patents listed by Regeneron in the BPCIA exchange. The lawsuit stems from Amgen’s submission of an application under the BPCIA for FDA licensure of PAVBLU as biosimilar to Regeneron’s EYLEA. By its complaint, Regeneron seeks, among other remedies, an injunction prohibiting the commercial manufacture, use, offer for sale or sale in the United States or import into the United States of PAVBLU before the expiration of each of the patents found to be infringed. On January 11, 2024, Regeneron filed a motion with the Judicial Panel on Multidistrict Litigation to transfer this case from the California Central District Court to the U.S. District Court for the Northern District of West Virginia (West Virginia District Court). Amgen responded to Regeneron’s complaint on February 2, 2024, denying infringement and asserting counterclaims seeking a declaratory judgment that the asserted patents are not infringed, invalid, and/or unenforceable.\nOn April 11, 2024, the Judicial Panel on Multidistrict Litigation granted Regeneron’s motion to transfer Regeneron’s patent infringement lawsuit pending against Amgen in the California Central District Court to the West Virginia District Court for coordinated and consolidated pretrial proceedings with the \nfive\n other cases involving EYLEA biosimilars pending in that district.\nOn June 7, 2024, Regeneron filed a motion for a preliminary injunction to prohibit Amgen from engaging in the manufacture, use, offer for sell or sale within the United States, or importation into the United States, of PAVBLU\n \nuntil resolution of this lawsuit or the entry of a permanent injunction, whichever comes first. Regeneron’s motion focused on U.S. \nF-52\nPatent No. 11,084,865, a formulation patent. On September 23, 2024, the West Virginia District Court denied Regeneron’s motion for a preliminary injunction, and Regeneron filed a notice of appeal, a motion to expedite the appeal, and an emergency motion for an injunction pending resolution of the appeal and for an administrative stay with the U.S. Court of Appeals for the Federal Circuit (Federal Circuit Court). On September 25, 2024, the Federal Circuit Court issued an order temporarily enjoining the launch of PAVBLU on an administrative basis while it considered Regeneron’s motion for an injunction pending appeal. On October 22, 2024, the Federal Circuit Court denied Regeneron’s motion for an injunction pending appeal and lifted the temporary injunction that was entered on September 25, 2024. Oral arguments for the appeal were held on January 14, 2025.\nAntitrust Class Action\nSensipar Antitrust Class Actions\nFrom February to April 2019, \nfour\n plaintiffs filed putative class action lawsuits against Amgen and various entities affiliated with Teva Pharmaceuticals USA, Inc. (Teva) alleging anticompetitive conduct in connection with settlements between Amgen and manufacturers of generic cinacalcet product. \nTwo\n of those actions were brought in the U.S. District Court for the District of Delaware (Delaware District Court), captioned \nUFCW Local 1500 Welfare Fund v. Amgen Inc., et al.\n (February 21, 2019) (Local 1500) and \nCesar Castillo, Inc. v. Amgen Inc., et al.\n (February 26, 2019) (Castillo). The third action was brought in the New Jersey District Court, captioned \nTeamsters Local 237 Welfare Fund, et al. v. Amgen Inc., et al.\n (March 14, 2019) (Local 237) and the fourth action was brought in the U.S. District Court for the Eastern District of Pennsylvania (Eastern Pennsylvania District Court), captioned \nKPH Healthcare Services, Inc. a/k/a Kinney Drugs, Inc. v. Amgen Inc., et al\n (April 10, 2019) (KPH). Each of the lawsuits is brought on behalf of a putative class of direct or indirect purchasers of Sensipar and alleges that the plaintiffs have overpaid for Sensipar as a result of Amgen’s conduct that allegedly improperly delayed market entry by manufacturers of generic cinacalcet products. The lawsuits focus predominantly on the settlement among Amgen, Watson Laboratories, Inc. (Watson) and Teva of the parties’ patent infringement litigation. Each of the lawsuits seeks, among other things, treble damages, equitable relief and attorneys’ fees and costs. On April 10, 2019, the plaintiff in the KPH lawsuit filed a motion seeking to have the \nfour\n lawsuits consolidated and designated as a multidistrict litigation (MDL) in the Eastern Pennsylvania District Court, and the plaintiff in the Local 1500 lawsuit filed a motion seeking to have the \nfour\n lawsuits, along with \nCipla Ltd. v. Amgen Inc.\n, consolidated and designated as an MDL in the Delaware District Court.\nOn July 31, 2019, the MDL panel entered an order consolidating in the Delaware District Court the \nfour\n class action lawsuits. On September 13, 2019, the plaintiffs filed amended complaints, and on October 15, 2019, Amgen filed its motion to dismiss both the direct purchaser plaintiffs’ consolidated class action complaint and the indirect purchaser end payer plaintiffs’ complaint. On December 6, 2019, the plaintiffs responded to Amgen’s motion to dismiss and, on January 10, 2020, Amgen filed its response. On February 6, 2020, the motions in the class action lawsuits were transferred to the U.S. Magistrate Judge for the District of Delaware (Magistrate Judge) for a recommendation. The MDL panel certified its conditional transfer order on February 6, 2020 transferring the additional class action lawsuit brought in the U.S. District Court for the Southern District of Florida, captioned \nMSP Recovery Claims v. Amgen Inc., et al.\n,\n \nto the Delaware District Court.\nOn July 22, 2020, the Magistrate Judge issued a recommendation to the Delaware District Court that the claims against Amgen be dismissed but leave be given to plaintiffs to amend their complaints. On August 5, 2020, the plaintiffs filed objections to the Magistrate Judge’s report and recommendation. On August 19, 2020, Amgen filed a response to the plaintiffs’ objections. On November 30, 2020, the Delaware District Court adopted the Magistrate Judge’s recommendation in part and denied it in part, denying Amgen’s motion to dismiss on the grounds that plaintiffs adequately alleged reverse payment claims but granted Amgen’s motion to dismiss with respect to the other Federal antitrust claims. On December 23, 2020, Teva, Watson and Actavis filed a motion for interlocutory appeal and for a stay pending appeal and Amgen filed its joinder (the 1292 Motion). On January 5, 2021, a joint status report was filed advising the Delaware District Court that the defendants are still considering whether to withdraw the 1292 Motion and plaintiffs’ offer to stay discovery, pending further rulings on motions to dismiss the amended complaints. On January 19, 2021, a joint status report was filed pursuant to the Delaware District Court’s January 6, 2021 order along with a stipulation to defer the 1292 Motion until after rulings on the amended complaints.\nOn February 16, 2021, the plaintiffs in the antitrust class action lawsuit brought on behalf of putative classes of direct or indirect purchasers of Sensipar filed their amended complaints. On March 4, 2021, a stipulation and order regarding the filing of a second amended complaint were filed to add another plaintiff: Teamsters Western Region & Local 177 Health Care Fund. On March 17, 2021, a defendant, MSP Recovery Claims, Series LLC, filed its notice of voluntary dismissal. On March 30, 2021, the remaining defendants, including Amgen, filed their motions to dismiss the second amended complaint.\nOn April 27, 2021, plaintiffs filed their oppositions to defendants’ (including Amgen’s) motion to dismiss, and defendants’ reply was filed on May 25, 2021. A hearing on defendants’ motion to dismiss was held in the Delaware District Court on July 13, 2021.\nF-53\nOn March 11, 2022, the Delaware District Court granted defendants’ (including Amgen’s) motion to dismiss except as to the reverse payment claim and various state law claims from \nten\n of the states in which plaintiffs reside. On May 11, 2022, the parties filed motions asking permission to seek interlocutory appeal. The plaintiffs did not oppose Amgen’s motion and instead argued all issues should be appealed at this time. Amgen filed its opposition to plaintiffs’ motion on June 10, 2022, and reply briefs were filed on June 24, 2022.\nOn February 16, 2023, the Delaware District Court denied Amgen’s motion for interlocutory appeal. On March 2, 2023, Amgen filed a motion for reargument, which the Delaware District Court denied while also certifying a question regarding whether the current judge has the authority to certify a question decided by a predecessor judge. On April 17, 2023, Amgen filed a petition with the U.S. Court of Appeals for the Third Circuit (Third Circuit Court), seeking a grant of our request for interlocutory appeal of the certified question as well as the Delaware District Court’s denial of our motion to dismiss the reverse payment claim. Amgen’s response to the class action complaints is due \n30\n days after resolution or denial of the interlocutory appeal.\n On June 26, 2023, the Third Circuit Court entered an order granting defendants’ (including Amgen’s) petition for interlocutory appeal and denying plaintiffs’ cross-petition. The questions certified are whether (1) the statute for interlocutory decisions authorizes a district court judge to certify for interlocutory appeal an order issued in the same case by a predecessor district court judge; and (2) the settlement of a patent infringement claim that involves the forgiveness of damages associated with that patent’s alleged infringement, on its own or combined with an acceleration clause, constitutes a reverse payment. On July 3, 2023, Amgen and Teva Pharmaceuticals USA, Inc. filed a notice of appeal, and on October 17, 2023, Amgen submitted its initial brief in its appeal before the Third Circuit Court.\nOn January 12, 2024, Amgen reached an agreement in principle to settle with the putative class of indirect purchasers of Sensipar.\nOn February 17, 2024, Amgen and the indirect purchasers filed a stipulation in the Delaware District Court to dismiss the indirect purchasers’ claims. On February 22, 2024, Amgen and the indirect purchasers filed a stipulation in the Third Circuit Court dismissing the portion of the Third Circuit Court’s appeal relating to the claims of the indirect purchasers. Amgen and the direct purchasers filed a stipulation on April 12, 2024 in the Delaware District Court, dismissing with prejudice the direct purchasers’ claims that were at issue in the appeal and seeking entry of final judgment in Amgen’s favor. On April 15, 2024, the Delaware District Court entered an order pursuant to the stipulation and closed the case.\nOn May 14, 2024, the putative class of direct purchasers of Sensipar appealed the claims that were dismissed with prejudice by the Delaware District Court.\nOn November 12, 2024, Amgen settled with the putative class of direct purchasers of Sensipar, and the remaining claims were dismissed on November 29, 2024.\nRegeneron Pharmaceuticals, Inc. Antitrust Action\nOn May 27, 2022, Regeneron filed suit against Amgen in the Delaware District Court for federal and state antitrust and unfair competition violations and tortious interference with prospective business relations. Regeneron alleges that Amgen’s sales contracting practices for Repatha, ENBREL and Otezla with key insurers, third-party payers and PBMs have harmed the sales of its product PRALUENT and focuses on two primary arguments: that Amgen improperly bundled sales of Repatha with ENBREL, Otezla and potentially other products and sought exclusive or de facto exclusive formulary positioning for Repatha. Amgen’s initial responsive pleading, a motion to dismiss, was filed on August 1, 2022.\nOn August 11, 2022, Amgen moved to stay the case pending the ultimate decision on the merits of the ongoing patent litigation between Amgen and Regeneron in Amgen Inc., et al. v. Sanofi, et al. On January 6, 2023, the Delaware District Court heard oral argument on the motion to stay and the motion to dismiss. On February 10, 2023, the Delaware District Court denied Amgen’s motion to stay this action, and on March 21, 2023, the Delaware District Court denied Amgen’s motion to dismiss the complaint.\nOn August 28, 2023, Regeneron filed its amended complaint, and on September 20, 2023, Amgen filed a counterclaim, alleging Regeneron’s own anticompetitive conduct with respect to formulary position for Regeneron’s drug, PRALUENT, at CVS.\nTrial was originally scheduled to begin on November 12, 2024, but has been rescheduled for May 2, 2025. On November 20, 2024 the Delaware District Court heard Amgen’s motion for summary judgment and the parties’ motions to exclude expert testimony, and the motions are currently under submission.\nF-54\nCareFirst of Maryland Antitrust Class Action\nOn August 6, 2024, CareFirst of Maryland, Inc., Group Hospitalization and Medical Services, Inc., and CareFirst BlueChoice, Inc. (collectively, CareFirst), filed a class action antitrust lawsuit against Amgen Inc., Amgen Manufacturing, Limited (corrected to Amgen Manufacturing Limited LLC in CareFirst’s amended complaint on October 11, 2024), and Immunex Corporation in the U.S. District Court for the Eastern District of Virginia, alleging federal and state antitrust claims and state consumer protection claims. The plaintiffs allege that, in 2004, Amgen entered into an anticompetitive agreement with certain F. Hoffman-La Roche AG entities (Roche) and other parties that provided Amgen with rights to Roche’s patents in a manner that enabled Amgen to allegedly unlawfully extend the life of patents applicable to ENBREL and, thereby, delay biosimilar entry. On November 4, 2024, Amgen filed a motion to dismiss, and plaintiffs thereafter filed an amended complaint on November 25, 2024. On January 8, 2025, Amgen filed a motion to dismiss the amended complaint.\nU.S. Tax Litigation and Related Matters\nAmgen Inc. & Subsidiaries v. Commissioner of Internal Revenue\nSee Note 7, Income taxes, for discussion of the IRS tax dispute and the Company’s petitions in the U.S. Tax Court.\nSecurities Class Action Litigation (Roofers Local No. 149 Pension Fund)\nOn March 13, 2023, Roofers Local No. 149 Pension Fund filed a purported class action against Amgen, Robert Bradway and Peter Griffith in the U.S. District Court for the Southern District of New York (Southern District Court of New York). The action was brought on behalf of an alleged class of Amgen shareholders who owned stock between July 29, 2020 and April 27, 2022 (the alleged class period). Plaintiffs allege that the defendants made a series of materially false and misleading statements and omissions during the alleged class period regarding the failure to timely disclose the potential tax liability claimed by the IRS. Plaintiffs further allege that they and other purported class members suffered losses and damages resulting from declines in the market value of Amgen’s common stock after the potential tax liability claimed by the IRS was disclosed.\nOn August 31, 2023, plaintiff filed an amended complaint and Amgen filed a motion to dismiss on November 6, 2023, which the Southern District Court of New York denied on September 30, 2024. On November 20, 2024, Amgen filed an answer to the amended complaint.\nA Case Management Plan and Scheduling Order was entered on January 16, 2025. Class certification briefing will be completed by December 23, 2025 and the last day to file summary judgment motions is August 12, 2025 but no briefing schedule has been set.\nShareholder Derivative Actions (Martin, Clearwater and DM Cohen)\nOn August 2, 2023, Leon Martin filed a derivative action (the Martin Derivative Action) captioned \nLeon Martin v. Robert A. Bradway, et al., No. 1:23-cv-06754\n (S.D.N.Y. Aug. 2, 2023), purportedly on behalf of Amgen, against Amgen, Robert Bradway, Peter Griffith and Amgen’s independent Board members. The action was filed in the Southern District Court of New York as related to the pending federal securities class action filed by Roofers Local No. 149 Pension Fund on March 13, 2023 (the Roofers securities class action). The complaint in this matter alleges claims for violations of the Securities Exchange Act of 1934, breach of fiduciary duty, aiding and abetting breach of fiduciary duty, unjust enrichment and waste of corporate assets.\nOn December 7, 2023, Plaintiff filed a Notice of Voluntary Dismissal as to Board member Michael Drake.\nOn December 1, 2023, a second derivative action (the Clearwater Derivative Action) was filed, captioned \nCheri Clearwater v. Robert A. Bradway, et al., No. 1:23-cv-10538\n (S.D.N.Y. Dec. 1, 2023), in the same court as the earlier-filed Martin Derivative Action. The second action is largely duplicative of the Martin Derivative Action, asserting the same claims purportedly on behalf of the Company against the individual directors that sat on Amgen’s Board during the relevant time period (July 29, 2020 through April 27, 2022). The complaint asserts claims for breach of fiduciary duty, unjust enrichment, waste of corporate assets, abuse of control, gross mismanagement, and violations of Section 10(b) of the Exchange Act arising out of Amgen’s disclosures with respect to its transfer pricing dispute with the IRS. However, the Clearwater Derivative Action complaint adds (1) \ntwo\n additional claims for violations of Sections 14(a) and 20(a) of the Exchange Act; (2) allegations that Amgen repurchased its own stock at artificially inflated prices during the relevant period; and (3) more detailed allegations as to why first making a demand on the Board would have been futile.\nOn January 16, 2024, the Southern District Court of New York consolidated the Martin Derivative Action and Clearwater Derivative Action (the Consolidated Action). The Southern District Court of New York entered an Order staying the Consolidated Action until a final judgment is entered in the federal securities class action.\nF-55\nOn February 12, 2025, DM Cohen, Inc. filed a third derivative action (the DM Cohen Derivative Action) captioned \nDM Cohen, Inc. v. Robert A. Bradway, et al, No. 1:25-mc-00062 \n(S.D.N.Y. Feb. 12, 2025), purportedly on behalf of Amgen, against Amgen, Robert Bradway, Peter Griffith and Amgen’s independent Board members. The DM Cohen Derivative Action was filed in the same court as the earlier filed Roofers securities class action and the Consolidated Action. The complaint asserts claims for violations of the Securities Exchange Act of 1934, breach of fiduciary duty, waste of corporate assets and unjust enrichment.\nThe factual allegations that form the basis for the claims in the Consolidated Action and the DM Cohen Derivative Action are essentially the same as the allegations asserted in the Roofers securities class action regarding purportedly false and misleading statements and omissions made from July 29, 2020 through April 27, 2022 relating to Amgen’s tax liabilities, business and finances, and the adequacy and maintenance of its internal controls.\nShareholder Derivative Actions (Hamilton, Blackburn, Bryla)\nOn October 16, 2024, David Hamilton filed a derivative action in the Delaware Court of Chancery purportedly on behalf of Amgen, against nominal defendant Amgen, Robert Bradway, Peter Griffith and Amgen’s Board members during the relevant time period (the Hamilton Derivative Action). The complaint in this matter alleges claims for breach of fiduciary duty and unjust enrichment.\nOn November 7, 2024, Charles Blackburn filed a derivative action in the Delaware Court of Chancery purportedly on behalf of Amgen, against nominal defendant Amgen, Robert Bradway, Peter Griffith and Amgen’s Board members during the relevant time period (the Blackburn Derivative Action). The complaint alleges a claim for breach of fiduciary duty.\nOn December 6, 2024, Robert Bryla filed a derivative action in the Delaware Court of Chancery purportedly on behalf of Amgen, against nominal defendant Amgen, Robert Bradway, Peter Griffith and Amgen’s Board members during the relevant time period (the Bryla Derivative Action). The complaint alleges claims for breach of fiduciary duty and unjust enrichment.\nThe factual allegations that form the basis for the claims in the Hamilton Derivative Action, Blackburn Derivative Action and Bryla Derivative Action are fundamentally the same as those asserted by the Roofers Local No. 149 Pension Fund on March 13, 2023 (alleging false and misleading statements and omissions made from July 29, 2020 through April 27, 2022 relating to Amgen’s tax liabilities, business and finances, and the adequacy and maintenance of its internal controls).\nChemoCentryx, Inc. Securities Matters\nOn May 5 and June 8 of 2021, ChemoCentryx and its Chief Executive Officer were named as defendants in \ntwo\n putative shareholder class actions filed in the U.S. District Court for the Northern District of California (Northern District Court of California). These cases were consolidated into \nHomyk v. ChemoCentryx, Inc.\n in which the plaintiffs allege violations of Sections 10(b) and 20(a) of the Securities Exchange Act in connection with statements regarding the New Drug Application for TAVNEOS and the underlying Phase 3 clinical trial, seeking an award of damages, interest and attorneys’ fees. On March 28, 2022, the plaintiffs filed their consolidated amended complaint, and on May 19, 2022, ChemoCentryx moved to dismiss these claims.\nOn February 23, 2023, the Northern District Court of California substantially denied ChemoCentryx’s motion to dismiss the matter in its entirety, while granting the motion to dismiss with respect to certain allegations of the plaintiffs. On April 4, 2023, the parties submitted a case management statement to the Northern District Court of California, and on April 10, 2023, the Northern District Court of California entered an order setting dates for amendment of pleadings and briefing on class certification. On April 27, 2023, ChemoCentryx submitted its answer to the complaint.\nOn August 25, 2023, the lead plaintiff moved to certify a class composed of all purchasers of ChemoCentryx stock between November 25, 2019 and May 6, 2021.\nOn March 6, 2024, the Northern District Court of California certified a class of all persons who purchased or otherwise acquired the common stock of ChemoCentryx between November 26, 2019 and May 6, 2021.\nOn March 20, 2024, ChemoCentryx filed a petition with the U.S. Court of Appeals for the Ninth Circuit (Ninth Circuit Court), seeking permission to have the district court’s order on class certification heard on appeal. The lead plaintiff’s response to ChemoCentryx’s petition was submitted on April 2, 2024, and on May 24, 2024, the Ninth Circuit Court denied ChemoCentryx’s petition to appeal the class certification order. Under the current schedule for the class action in the district court, the parties’ motions to exclude experts will be fully briefed by March 20, 2025, and summary judgment will be fully briefed by May 9, 2025. Trial is set for September 22, 2025. The deadline for class members to opt out of the class action was January 14, 2025.\nF-56\nPrior to the opt-out deadline, on May 2, 2024, RA Capital Healthcare Fund, LP filed \ntwo\n securities cases (which are similar to the class action), in the California Superior Court in Ventura County and in the Northern District Court of California, against ChemoCentryx and its former Chief Executive Officer, Dr. Thomas Schall. On July 2, 2024, the state court stayed the case pending an order on summary judgment in the federal class action. Under the current schedule in the federal case, briefing on the defendants’ motion to dismiss the complaint will be complete by March 11, 2025, and a hearing on that motion is set for May 1, 2025.\nCommitments – U.S. repatriation tax\nUnder the 2017 Tax Act, we elected to pay in \neight\n annual installments the repatriation tax related primarily to prior indefinitely invested earnings of our foreign operations. The final U.S. repatriation tax payment of $\n1.8\n billion will be made in 2025.\nF-57\nSCHEDULE II\nAMGEN INC.\nVALUATION AND QUALIFYING ACCOUNTS\nYears ended December 31, 2024, 2023 and 2022 \n(In millions)\nAllowance for doubtful accounts\nBalance\nat beginning\nof period\nAdditions\ncharged to\ncosts and\nexpenses\nOther\nadditions\nDeductions\nBalance\nat end\nof period\n2024\n$\n28\n \n$\n13\n \n$\n—\n \n$\n(\n3\n)\n$\n38\n \n2023\n$\n22\n \n$\n6\n \n$\n—\n \n$\n—\n \n$\n28\n \n2022\n$\n26\n \n$\n—\n \n$\n—\n \n$\n(\n4\n)\n$\n22\n \nF-58",
    "item1": "Item 1. Business—Marketing, Distribution and Selected Marketed Products.\nOur strategy is the integrated set of actions we take to improve our competitive position in the industry. In 2024, we advanced our innovative pipeline; generated strong sales growth across our product portfolio and regions; and expanded our world-class manufacturing network. We accomplished these objectives while maintaining a strategic and disciplined approach to capital allocation.\nWe received regulatory approvals for BLINCYTO in CD19-positive Philadelphia chromosome-negative B-ALL and IMDELLTRA in extensive-stage small cell lung cancer (ES-SCLC) and reported five Phase 3 data readouts, including for BLINCYTO, UPLIZNA, rocatinlimab and TEZSPIRE, as well as MariTide Phase 2 top-line results. For more information on our pipeline and clinical development updates, see Part I, Item 1. Business—Research and Development and Selected Product Candidates, and Part I, Item 1. Business—Significant Developments.\nTotal product sales increased in 2024, primarily driven by volume growth of 23%, partially offset by declines in net selling price of 2%. Product sales from acquired Horizon products contributed $4.2 billion in 2024 compared to $954 million in 2023, with volume growth from our other brands of 11%.\nCash flows from operating activities in 2024 totaled $11.5 billion, which supported investment in our business, including capital expenditures of $1.1 billion to enhance and expand our manufacturing network, and allowed us to both reduce our debt outstanding and return capital to shareholders through the payment of cash dividends. For 2024, we increased our quarterly cash dividend by 6% to $2.25 per share of common stock. In December 2024, the Board of Directors declared a cash dividend of \n61\n$2.38 per share of common stock for the first quarter of 2025, an increase of 6% over the same period in the prior year, to be paid in March 2025.\nAmgen’s approach to and investment in human capital resource management is directed at attracting, motivating, developing and retaining talent to tackle the challenges of running an enterprise focused on the discovery, development and commercialization of innovative medicines. Our compensation, benefits and development programs are designed to encourage performance, promote accountability and adherence to Company values, and align with the interests of the Company’s shareholders. In our effort to attract and retain the best talent, we seek out and support talent across the globe. Further, we believe that an inclusive culture helps attract and retain a strong and engaged workforce informed by the varied backgrounds and experiences represented, which fosters innovation, collaboration and productivity as we execute on our mission to serve patients. For further information on these and other efforts, see Part I, Item 1. Business—Human Capital Resources.\nWe have a long-standing ambition to be environmentally responsible, and we regularly set targets to challenge ourselves to deliver further improvements. To continue on our path to greater environmental sustainability, in January 2021 we announced a new set of long-term environmental targets to achieve by 2027, including achieving carbon neutrality, reducing water consumption by 40% and reducing waste disposed by 75%.\n2,3\nOur long-term success depends, to a great extent, on our ability to continue to discover, develop and commercialize innovative products and acquire or collaborate on therapies currently in development by other companies. We must grow sales from existing and new products to achieve revenue growth and to offset revenue losses caused by products’ loss of their exclusivity or launches of competing products. For example, our patents for RANKL antibodies, including sequences, for Prolia and XGEVA expire in February 2025 in the United States and in November 2025 in select countries in Europe. Certain of our products face increasing pressure from competition, including biosimilars and generics. For additional information, including information on the expirations of patents for various products, see Part I, Item 1. Business—Marketing, Distribution and Selected Marketed Products—Patents, and Part I, Item 1. Business—Marketing, Distribution and Selected Marketed Products—Competition. We devote considerable resources to R&D activities, but successful product development in the biotechnology industry is highly uncertain. We also face increasing regulatory scrutiny of safety and efficacy both before and after products launch.\nMacroeconomic and other challenges\nUncertain macroeconomic conditions, including the risk of inflation, tariffs or trade protection measures, higher interest rates and instability in the financial system, as well as rising healthcare costs, continue to pose challenges to our business. Further, ongoing geopolitical conflicts continue to create additional uncertainty in global macroeconomic conditions. Additionally, with public and private healthcare-provider focus, the industry continues to be subject to cost containment measures and significant pricing pressures, resulting in net price declines.\n \nMoreover, provisions of the IRA, as well as the 340B Program, have affected, and are likely to continue to affect, our business. For example, ENBREL and Otezla have been selected by CMS for Medicare price setting beginning in 2026 and 2027, respectively. Finally, wholesale and end-user buying patterns can affect our product sales. These buying patterns can cause fluctuations in quarterly product sales, but have generally not been significant to date when comparing full-year product performance to the prior year. See Part I, Item 1. Business—Marketing, Distribution and Selected Marketed Products, and Part I,"
  }
}