{
  "ticker": "AOS",
  "cik": "0000091142",
  "company_name": "SMITH A O CORP",
  "filing_date": "2025-02-11",
  "accession": "0000091142-25-000036",
  "primary_doc": "aos-20241231.htm",
  "item_sections": {
    "item1": "Item 15.\nExhibits, Financial Statement Schedules\n64\n2\nTable of Contents\nPART 1 \nITEM 1 – BUSINESS\nAs used in this annual report on Form 10-K, references to the “Company,” “A. O. Smith,” “AOS,” “we,” “us,” and “our” refer to A. O. Smith and its consolidated subsidiaries. The following discussion should be read in conjunction with our consolidated financial statements and notes thereto under “Item 8 Financial Statements and Supplementary Data” in this annual report on Form 10-K. Our company is comprised of two reporting segments: North America and Rest of World. Both segments manufacture and market comprehensive lines of residential and commercial gas and electric water heaters, boilers, heat pumps, tanks and water treatment products. Both segments primarily manufacture and market in their respective regions of the world. Our Rest of World segment is primarily comprised of China, Europe and India.\nNORTH AMERICA \nSales in our North America segment accounted for approximately 77 percent of our total sales in 2024. This segment serves residential and commercial end markets with a broad range of products including: \nWater heaters\n. Our residential and commercial water heaters primarily come in sizes ranging from 40 to 80 gallon models, however, we also offer sizes as low as 2.5 gallon (point-of-use) and as high as 2,500 gallon products with varying efficiency ranges. We offer electric, natural gas and liquid propane tank-type models as well as tankless (gas and electric), heat pump and solar tank units. Typical applications for our water heaters include residences, restaurants, hotels, office buildings, laundries, car washes, schools and small businesses. \nBoilers. \nOur residential and commercial boilers range in size from 45,000 British Thermal Units (BTUs) to 6.0 million BTUs. Boilers are closed loop water heating systems used primarily for space heating or hydronic heating. Our boilers are primarily used in applications in commercial settings for hospitals, schools, hotels and other large commercial buildings while residential boilers are used in homes, apartments and condominiums.\nWater treatment products. \nWith the acquisition of Aquasana, Inc. (Aquasana) in 2016 we entered the water treatment market. We expanded our product offerings and geographic footprint with the acquisitions of Hague Quality Water International (Hague) in 2017, Water-Right, Inc. (Water-Right) in 2019, Master Water Conditioning Corporation (Master Water) in 2021, Atlantic Filter Corporation (Atlantic Filter) in 2022, Water Tec of Tucson, Inc (Water Tec) in 2023 and Impact Water Products (Impact) in 2024. Our water treatment products range from point-of-entry water softeners, solutions for problem well water, whole-home water filtration products and point-of-use carbon and reverse osmosis products. We also offer a comprehensive line of commercial water treatment and filtration products. Typical applications for our water treatment products include residences, restaurants, schools and offices. \nOther. \nIn our North America segment, we also manufacture expansion tanks, commercial solar water heating systems, swimming pool and spa heaters, related products and parts.\nA significant portion of our North America sales is derived from the replacement of existing products. \nWe believe we are the largest manufacturer and marketer of water heaters in North America with a leading share in both the residential and commercial portions of the market. We expanded our presence in North America with our acquisition of Giant Factories, Inc. (Giant), a Canada-based manufacturer of residential and commercial water heaters, which we acquired in late 2021. In the commercial segments of the market for both water heating and space heating, we believe our comprehensive product lines and our high-efficiency products give us a competitive advantage. Our wholesale distribution channel, where we sell our products primarily under the A. O. Smith and State brands, includes approximately 900 independent wholesale plumbing distributors serving residential and commercial end markets. We also sell our residential water heaters through the retail and maintenance, repair and operations (MRO) channels. In the retail channel, our customers include four of the six largest national hardware and home center chains, including a long-standing exclusive relationship with Lowe’s where we sell A. O. Smith branded products. \nOur Lochinvar brand is one of the leading residential and commercial boiler brands in North America. Approximately 45 percent of Lochinvar branded sales consist of residential and commercial water heaters while the remaining 55 percent of Lochinvar branded sales consist primarily of boilers and related parts. Our commercial boiler distribution channel is primarily comprised of manufacturer representative firms with the remainder of our Lochinvar branded products being distributed through wholesale channels. \nIn our water treatment business we sell through a variety of channels. We sell our A. O. Smith branded water treatment products primarily through our water quality, dealer network and Amazon. Our Aquasana branded products are primarily sold directly to consumers through e-commerce channels. Our water softener products and problem well water solutions, which \n3\nTable of Contents\ninclude the Hague, Water-Right, Master Water, Atlantic Filter, Impact, and Water Tec brands, are sold through water quality dealers and contractors. Our water softener products are also sold through home center retail chains.\nOur energy-efficient product offerings continue to be a sales driver for our business. Our condensing commercial water heaters and boilers continue to be an option for commercial customers looking for high-efficiency water and space heating with a short payback period through energy savings. We offer residential heat pumps, condensing tank-type and tankless water heaters in North America, as well as other higher efficiency water heating solutions to round out our energy-efficient product offerings. We recently launched our newly designed ADAPT condensing gas tankless water heater and VERITUS air source commercial heat pump water heater to align with greenhouse gas emission reduction trends across the U.S.\nWe sell our products in highly competitive markets. We compete in each of our targeted market segments based on product design, reliability, quality of products and services, advanced technologies, energy efficiency, maintenance costs and price. Our principal water heating and boiler competitors in North America include Rheem, Bradford White, Rinnai, Aerco and Navien. Numerous other manufacturing companies also compete. Our principal water treatment competitors in the U.S. are Culligan, Kinetico, Pentair, Franklin Electric and Ecowater as well as numerous regional assemblers. \nREST OF WORLD \nSales in our Rest of World segment accounted for approximately 23 percent of our total sales in 2024, a majority of which were in China. We have operated in China for nearly 30 years. In that time, we have established A. O. Smith brand recognition in the residential and commercial markets. We manufacture and market residential water heater and water treatment products, primarily incorporating reverse osmosis technology, and commercial dispensing water treatment products. The Chinese water heater market is predominantly comprised of electric wall-hung, gas tankless, combi-boiler, heat pump and solar water heaters. We believe we are one of the market leaders of water heaters and reverse osmosis water treatment products to the residential market in China in dollar terms. We also design and market kitchen products (range hoods, cooktops, steam ovens, and dishwashers) and connected product technology in China. \nWe sell our products in approximately 9,400 points of sale in China, of which approximately 4,400 are retail outlets in tier one through tier three cities and approximately 1,600 exclusively sell our products. We also sell our products through e-commerce channels. Our primary competitors in China in the water heater market segment are Haier/Casarte, Midea/COLMO, and Rinnai. Our principal competitors in the water treatment market are Angel, Haier/Casarte, Midea/COLMO, Truliva, and Xiaomi.\nIn 2008, we established a sales office in India and began importing products specifically designed for India. We began manufacturing water heaters in India in 2010 and water treatment products in 2015. In 2024, we expanded our product offerings and geographic footprint with the acquisition of Pureit, a Unilever PLC business. Pureit offers a broad range of residential water purification solutions in India and other South Asian markets. We continue to increase our product offerings and sales in this country, primarily through wholesale, e-commerce and retail channels. Our primary competitors in India are Racold, Bajaj and Havells in the water heater market and Eureka Forbes and Kent in the water treatment market.\nWe also sell water heaters in the European, Middle East, and Far East markets and water treatment products in Vietnam, all of which combined comprised less than 14 percent of total Rest of World sales in 2024.\nRAW MATERIALS \nRaw materials for our manufacturing operations, primarily consisting of steel, are generally available in adequate quantities. A portion of our customers are contractually obligated to accept price changes based on fluctuations in steel prices. There has been volatility in steel costs over the last several years. In addition tariffs could potentially increase volatility in steel and other input materials.\nRESEARCH AND DEVELOPMENT \nTo improve our competitiveness by generating new products and processes, we conduct research and development at our Corporate Technology Center in Milwaukee, Wisconsin, our Global Engineering Center in Nanjing, China, and our operating locations. Our total expenditures for research and development in 2024, 2023 and 2022 were $101.7 million, $97.5 million and $89.0 million, respectively.\nPATENTS AND TRADEMARKS \nWe invest, own and use in our businesses various trademarks, trade names, patents, trade secrets and licenses. We monitor our intellectual property for infringements. Although we believe our trademarks, trade names, patents, trade secrets, and licenses to constitute a valuable asset in the aggregate, we do not regard our business as being materially dependent on any \n4\nTable of Contents\nsingle trademark, trade name, patent, trade secret, license or any group of related such rights. Our trade name is important with respect to our products, particularly in China, India, and North America. \nHUMAN CAPITAL \nWe employed approximately 12,700 employees as of December 31, 2024 with approximately 7,200 in North America and 5,500 in Rest of World. A small portion of our workforce in the U.S. is represented by a labor union, while outside the U.S., we have employees in certain countries that are represented by employee representative organizations, such as an employee association, union, or works council.\nOur Guiding Principles and Values\n.\n \nThe foundation of how we conduct business and interact with our employees is outlined in A. O. Smith Corporation’s Guiding Principles and our Statement of Values. These principles and values help to shape how we hire, train and treat our employees, emphasizing teamwork and promoting diversity in seeking our objectives. We believe that our Guiding Principles and Values shape the critical elements of our effort to attract, retain and develop talent. In 2024, we were named by Ethisphere on the list of the World’s Most Ethical Companies. The annual list recognizes global companies dedicated to integrity, sustainability, governance, and community with a commitment to ethical behavior, accountability, and driving positive change.\nCulture and Employee Engagement.\n \nWe conduct a Global Employee Engagement Survey on a biannual basis. This third party managed survey measures employees’ level of engagement against external norms and provides us with actionable feedback that drives improvement priorities. Participation in our most recent survey in 2024 was 93 percent, which we believe reflects our employees’ desire to share their perspectives and a commitment to continuous improvement. Survey results help shape action plans to further improve our culture and we will conduct the survey again in 2026.\nDiversity and Inclusion.\n \nAs reflected in our Guiding Principles, we strive to create a workplace where people from all backgrounds can thrive and achieve their fullest potential. Our commitment to this objective starts at the top with our Board of Directors, which is 40 percent diverse from either a gender or ethnic/racial perspective.\nCompensation and Benefits.\n \nWe provide what we believe is a robust total compensation program designed to be market-competitive and internally equitable to attract, retain, motivate and reward a high-performance workforce. Regular internal and external analysis is performed to ensure this market alignment. In addition to salaries, these programs, which vary by country, can include annual performance-based bonuses, stock-based compensation awards, retirement plans with employee matching opportunities, health benefits, health savings and flexible spending accounts, paid time off, family leave, and tuition assistance, among others.\nTraining and Development.\n \nWe provide all employees with a wide range of professional development experiences, both formal and informal, to help them achieve their full potential. All of our salaried employees are given formal development plans. Some of the formal development programs that employees have access to include early-career leadership development programs, front-line leadership development programs, continuous improvement skill-building programs, core process technology councils and tuition reimbursement for degree programs or trade schools. To maintain our focus on career development all our salaried employees worldwide are required to have career conversations with their manager. Globally, all office and professional employees also have formal performance reviews and development plans with a focus on learning by doing. We expect our managers to work closely with their employees to ensure performance feedback and to conduct development discussions on a regular basis.\nSafety.\n \nThe safety of our people is always at the forefront of what we do. We provide safety training in our production facilities, designed to empower our employees with the knowledge and tools they need to make safe choices and mitigate risks. In addition to traditional training, we use standardized signage and visual management throughout our facilities. Since 1954, we have annually awarded the Lloyd B. Smith President's Safety Award, which acknowledges an A. O. Smith facility that demonstrates the most improvement over one year in the area of workplace safety.\nBACKLOG \nDue to the short-cycle nature of our businesses, our operations do not normally sustain significant backlogs. \n5\nTable of Contents\nGOVERNMENT REGULATIONS AND ENVIRONMENTAL MATTERS  \nOur operations, including the manufacture, packaging, labeling, storage, distribution, advertising and sale of our products, are subject to various federal, state, local and foreign laws and regulations. In the U.S., many of our products are regulated by the Department of Energy, the Consumer Product Safety Commission, and the Federal Trade Commission. State and local governments, through laws, regulations, and building codes, also regulate our water heating and water treatment products.  Whether at the federal, state, or local level, these laws are intended to improve energy efficiency and product safety, and protect public health and the environment. In recent years, a number of states and local authorities have proposed or implemented bans on gas-fired products in new construction in an effort to address greenhouse gas emissions. Similar laws and regulations have been adopted by government authorities in other countries in which we manufacture, distribute, and sell our products. We offer a complete line of water and hydronic heating products, including electric-powered water heaters and boilers, and we believe that any reduction in fossil fuel-powered products would be counterbalanced by a corresponding increase in demand for our non-fossil fuel powered products. We are confident that our continued emphasis on product design and innovation, including energy efficiency, will keep us well positioned to deliver products demanded by customers, regardless of fuel source.\nIn addition, our operations are subject to federal, state and local environmental laws. We are subject to regulations of the U.S. Environmental Protection Agency and the Occupational Health and Safety Administration and their counterpart state agencies. Compliance with government regulations and environmental laws has not had and is not expected to have a material effect upon the capital expenditures, earnings, or competitive position of our company. See Item 3.\nAVAILABLE INFORMATION \nWe maintain a website with the address www.aosmith.com. The information contained on our website is not included as a part of, or incorporated by reference into, this Annual Report on Form 10-K. We make available free of charge through our website our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to these reports as soon as reasonably practical after we have electronically filed such material with, or furnished such material to, the Securities and Exchange Commission (SEC). All reports we file with the SEC are also available free of charge via EDGAR through the SEC’s website at www.sec.gov.\nWe are committed to sound corporate governance and have documented our corporate governance practices by adopting the A. O. Smith Corporate Governance Guidelines. The Corporate Governance Guidelines, Criteria for Selection of Directors, Financial Code of Ethics, the A. O. Smith Guiding Principles, as well as the charters for the Audit, Personnel and Compensation, Nominating and Governance and the Investment Policy Committees of the Board of Directors and other corporate governance materials, may be viewed on the Company’s website. Any waiver of or amendments to the Financial Code of Conduct or the A. O. Smith Guiding Principles would be posted on this website; to date there have been none. Copies of these documents will be sent to stockholders free of charge upon written request of the corporate secretary at the address shown on the cover page of this Annual Report on Form 10-K. \nWe are also committed to growing our business in a sustainable and socially responsible manner consistent with our Guiding Principles. This commitment has driven us to design, engineer and manufacture highly innovative and efficient products in an environmentally responsible manner that helps reduce energy consumption, conserve water and improve drinking water quality and public health. Consistent with this commitment, we issued our sustainability report biennially detailing our company’s historical and current efforts. We issued our fourth report, the 2024 sustainability report, in November 2024, documenting our environmental, social, and governance (ESG) activities over the past two years. This report details the positive impact of our highly efficient products, highlights our company’s commitment to employees and the communities in which we operate, reports on our progress toward our greenhouse gas emissions intensity reduction goal of 10 percent by 2025 (2019 baseline) and announced a new water goal to achieve an annual water savings of 40 million gallons by 2030 (2023 baseline). We have made significant progress toward our emission reduction goal and prevented over 560,000 metric tons of carbon emissions in 2023 through the sale of our high efficiency water heaters and boilers. Our ESG Scorecard (scorecard) reflecting our progress is available on our website. Our scorecard also provides information on our employee diversity, product stewardship, and recordable incident rate, among other items. Our Sustainability Report and scorecard are available on our website and not included as part of, or incorporated by reference into, this Annual Report on Form 10-K. \n6\nTable of Contents",
    "item1a": "Item 1A - Risk Factors\n.\n13\nTable of Contents",
    "item1b": "ITEM 1B – UNRESOLVED STAFF COMMENTS\nNone. \n12\nTable of Contents",
    "item1c": "ITEM 1C – CYBERSECURITY \nCybersecurity Governance\nWe recognize the importance of maintaining the safety and security of our systems and data and have a holistic process for overseeing and managing cybersecurity and related risks. This process is supported by both our management and our Board of Directors.\nOur \nChief Information Officer (CIO)\n oversees our information systems and cybersecurity function and reports to our Chief Operating Officer (COO).  She has over 30 years of experience in leading information systems management, strategy, and operational execution, including incident management, prevention, and response.  Our Senior Director of Global Information Security (ISD) reports to our CIO and is responsible for the protection and defense of our networks and systems and managing cybersecurity risk. He has over 20 years of experience in managing cybersecurity and related risks, including threat identification, incident response, and defense strategies. Our CIO and ISD are supported by a direct and cross-functional team of professionals with broad experience and expertise in threat assessment and detection, mitigation technologies, training, incident response, and regulatory compliance.\nOur Board of Directors is responsible for overseeing our enterprise risk management activities in general, which includes our management of information and cybersecurity risk. The full Board receives an update on our cyber risk management process and trends related to cybersecurity at least annually, or real-time if a material event occurs. \nThe \nAudit Committee\n of the Board assists the full Board in its oversight of cybersecurity risks. As part of its oversight, the Audit Committee receives regular reports from management on information systems and security, including metrics and controls at each meeting, and other items at least annually including risk assessments, security software, incident response plans, and key updates to the cybersecurity program and its effectiveness.\nWe have also established a committee of our executive leadership team to consider cybersecurity risks and to consider mitigation strategies in managing the risk. Our CIO and ISD participate on this committee, which meets regularly. We have an established incident response plan led by our CIO and ISD to assess, respond, and report in the event of a cybersecurity incident. Depending on the nature and severity of the incident, the plan requires escalating notifications up to our CEO, Audit Committee and our Board.\n \nCybersecurity Risk Management\nOur cybersecurity risk management program is integrated into our overall enterprise risk management program, and shares common methodologies, reporting channels and governance processes that apply across the enterprise risk management program consistent with other legal, compliance, strategic, operational, and financial risk areas.\n Our program is guided by cybersecurity frameworks, such as the National Institute of Standards and Technology Cybersecurity Framework (NIST CSF), although we also look to other standards to help us identify, assess, and manage cybersecurity risks relevant to our business.\nThe Company has a robust cybersecurity program to assess, identify and manage material risk from cybersecurity threats and to prevent, detect and respond to cybersecurity threats, including those associated with the use of \nthird-party service providers\n.\n Our approach to cybersecurity risk management includes:\n•\nCybersecurity awareness training, including interactive simulations and tabletop exercises for our employees, incident response personnel, senior management, and our Board;\n•\nPeriodic risk assessments designed to help identify significant or potentially material cybersecurity risks to our critical systems, information, and our broader enterprise information technology (IT) environment;\n•\nThe use of external service providers, where appropriate, to assess, test or otherwise assist with aspects of our security controls;\n•\nA multi-layered defense and continuous monitoring strategy employing various tools and testing, and incorporating lessons learned from our defense and monitoring efforts to help prevent future attacks;\n•\nRegular testing by our Internal Audit function of controls related to our financial information systems; and\n•\nInformation security assessments conducted on third parties with whom we share sensitive electronic data against established cybersecurity frameworks;\nWhile we have experienced cybersecurity incidents in the past, to-date none have materially affected the Company or our financial position, results of operations and/or cash flows.\n We continue to invest in cybersecurity and the resiliency of our networks, including our controls and processes, all of which are designed in an effort to protect our IT systems and infrastructure, and the information they contain. For more information regarding the risks we face from cybersecurity threats, please see"
  }
}