{
  "ticker": "APH",
  "cik": "0000820313",
  "company_name": "AMPHENOL CORP /DE/",
  "filing_date": "2025-02-07",
  "accession": "0001558370-25-000714",
  "primary_doc": "aph-20241231x10k.htm",
  "item_sections": {
    "item1": "Item 1A. \nRisk Factors\n herein.\n​\nForeign Currency Exchange Rates\n​\nThe Company conducts business in many foreign currencies through its worldwide operations, and as a result, is subject to foreign exchange exposure due to changes in exchange rates of the various currencies, including possible currency devaluations.  Changes in exchange rates can positively or negatively affect the Company’s sales, operating margins and equity.  The Company attempts to mitigate currency risk in a number of ways, such as locating factories in the same country or region in which products are sold, hedging contracts, cost reduction and pricing actions or working capital management.  However, there can be no assurance that any or all such actions taken by the Company will be fully effective in successfully managing currency risk, including in the event of a significant and sudden decline in the value of any of the foreign currencies of the Company’s worldwide operations.  For further discussion of foreign exchange exposures, risks and uncertainties, refer to the risk factor titled “\nThe Company’s results can be positively or negatively affected by changes in foreign currency exchange rates\n” in Part I,",
    "item1a": "Item 1A. \nRisk Factors\n herein.\n​\nNon-GAAP Financial Measures\n​\nIn addition to assessing the Company’s financial condition, results of operations, liquidity and cash flows in accordance with U.S. GAAP, management utilizes certain non-GAAP financial measures, defined below, as part of its internal reviews for purposes of monitoring, evaluating and forecasting the Company’s financial performance, communicating operating results to the Board and assessing related employee compensation measures.  Management believes that these non-GAAP financial measures may be helpful to investors in assessing the Company’s overall financial performance, trends and year-over-year comparative results, in addition to the reasons noted below.  Non-GAAP financial measures related to operating income, operating margin, net income attributable to Amphenol Corporation, effective tax rate and diluted EPS exclude income and expenses that are not directly related to the Company’s operating performance during the years presented.  Items excluded in the presentation of such non-GAAP financial measures in any period may consist of, without limitation, acquisition-related expenses, refinancing-related costs, gains associated with bargain purchase acquisitions, and certain discrete tax items including, but not limited to, (i) the excess tax benefits related to stock-based compensation and (ii) the impact of significant changes in tax law.  Non-GAAP financial measures related to net sales exclude the impact of foreign currency exchange rates and acquisitions.  The non-GAAP financial information contained herein is included for supplemental purposes only and should not be considered in isolation or as a substitute for or superior to the related U.S. GAAP financial measures.  In addition, these non-GAAP financial measures are not necessarily the same or comparable to similar measures presented by other companies as such measures may be calculated differently or may exclude different items.  \n​\n​\n45\n\n\nTable of Contents\nThe non-GAAP financial measures defined below should be read in conjunction with the Company’s financial statements presented in accordance with U.S. GAAP.  The reconciliations of these non-GAAP financial measures to the most directly comparable U.S. GAAP financial measures for the years ended December 31, 2024, 2023 and 2022 are included in “Results of Operations” and “Liquidity and Capital Resources” within this Item 7: \n​\n●\nAdjusted Diluted EPS\n is defined as diluted earnings per share (as reported in accordance with U.S. GAAP), excluding income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the years presented.  Adjusted Diluted EPS is calculated as Adjusted Net Income attributable to Amphenol Corporation, as defined below, divided by the weighted average outstanding diluted shares as reported in the Consolidated Statements of Income.\n​\n●\nAdjusted Effective Tax Rate\n is defined as Provision for income taxes, as reported in the Consolidated Statements of Income, expressed as a percentage of Income before income taxes, as reported in the Consolidated Statements of Income, each excluding income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the years presented.\n​\n●\nAdjusted Net Income attributable to Amphenol Corporation \nis defined as Net income attributable to Amphenol Corporation, as reported in the Consolidated Statements of Income, excluding income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the years presented.\n​\n●\nAdjusted Operating Income\n is defined as Operating income, as reported in the Consolidated Statements of Income, excluding income and expenses that are not directly related to the Company’s operating performance during the years presented.\n​\n●\nAdjusted Operating Margin\n is defined as Adjusted Operating Income (as defined above) expressed as a percentage of Net sales (as reported in the Consolidated Statements of Income).\n​\n●\nConstant Currency Net Sales Growth\n is defined as the year-over-year percentage change in net sales growth, excluding the impact of changes in foreign currency exchange rates.  The Company’s results are subject to volatility related to foreign currency translation fluctuations.  As such, management evaluates the Company’s sales performance based on actual \nsales growth in U.S. dollars, as well as Organic Net Sales Growth (as defined below) and Constant Currency Net Sales Growth, and believes that such information is useful to investors to assess the underlying sales trends.\n​\n●\nFree Cash Flow\n is defined as (i) Net cash provided by operating activities (“Operating Cash Flow” - as reported in accordance with U.S. GAAP) less (ii) capital expenditures (as reported in accordance with U.S. GAAP), net of proceeds from disposals of property, plant and equipment (as reported in accordance with U.S. GAAP), all of which are derived from the Consolidated Statements of Cash Flow.  Free Cash Flow is an important liquidity measure for the Company, as we believe it is useful for management and investors to assess our ability to generate cash, as well as to assess how much cash can be used to reinvest in the growth of the Company or to return to stockholders through either stock repurchases or dividends.\n​\n●\nOrganic Net Sales Growth\n is defined as the year-over-year percentage change in net sales growth resulting from operating volume and pricing changes and excludes the impact of (i) changes in foreign currency exchange rates (described above), which is outside the control of the Company, and (ii) acquisitions, both of which are taken as a percentage of the respective prior year period(s) net sales.  The acquisition impact represents the percentage impact on net sales resulting from acquisitions that have not been included in the Company’s consolidated results for the full current year(s) and/or prior comparable year(s) presented.  Such net sales related to these acquisitions do not reflect the underlying growth of the Company on a comparative basis.  Management evaluates the Company’s sales performance based on actual sales growth in U.S. dollars, as well as Constant Currency Net Sales Growth (as defined above) and Organic Net Sales Growth, and believes that such information is useful to investors to assess the underlying sales trends. \n​\nRecent Accounting Pronouncements\n​\nRefer to Note 1 of the Notes to Consolidated Financial Statements for a discussion of recently issued accounting pronouncements, including those adopted by the Company.\n​\n46\n\n\nTable of Contents\nCritical Accounting Estimates\n​\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period.  Management bases its estimates on historical experience along with other assumptions that we believe are reasonable in formulating our bases for making judgements regarding the carrying amounts of assets and liabilities that are not readily apparent elsewhere.  Estimates are adjusted as new information becomes available.  Actual results could differ from those estimates.  The Company believes that the following accounting policies and estimates are most critical since they require significant assumptions and judgments that inherently are subject to risks and uncertainties.  The significant accounting policies are more fully described in Note 1 of the Notes to Consolidated Financial Statements.\n​\nRevenue Recognition\n \n​\nThe\n Company’s primary source of revenues consist of product sales to either end customers and their appointed contract manufacturers (including original equipment manufacturers) or to distributors.  Our revenues are derived from contracts with customers, which in most cases are customer purchase orders that may be governed by master sales agreements.  For each contract, the promise to transfer the control of the products, each of which is individually distinct, is considered to be the identified performance obligation. As part of the consideration promised in each contract, the Company evaluates the customer’s credit risk.  Our contracts do not have any significant financing components, as payment terms are generally due net 30 to 120 days after delivery.  Although products are almost always sold at fixed prices, in determining the transaction price, we evaluate whether the price is subject to refund (due to returns) or adjustment (due to volume discounts, rebates, or price concessions) to determine the net consideration we expect to be entitled to. We allocate the transaction price to each distinct product based on its relative standalone selling price. Taxes assessed by governmental authorities and collected from the customer, including but not limited to sales and use taxes and value-added taxes, are not included in the transaction price.\n​\nThe vast majority of our sales are recognized at a point-in-time under the core principle of recognizing revenue when control transfers to the customer, which generally occurs when we ship or deliver the product from our manufacturing facility to our customers, when our customer accepts and has legal title of the goods, and where the Company has a present right to payment for such goods.  Based on the respective contract terms, most of our contracts’ revenues are recognized either (i) upon shipment based on free on board (“FOB”) shipping point or (ii) when the product arrives at its destination.  For the years ended December 31, 2024, 2023 and 2022, less than 5% of our net sales were recognized over time, where the associated contracts relate to the sale of goods with no alternative use as they are only sold to a single customer and whose underlying contract terms provide the Company with an enforceable right to payment, including a reasonable profit margin, for performance completed to date, in the event of customer termination. For the contracts recognized over time, we typically record revenue using the input method, based on the materials and labor costs incurred to date relative to the contract’s total estimated costs.  This method reasonably depicts when and as control of the goods transfers to the customer, since it measures our progress in producing the goods which is generally commensurate with this transfer of control.  Since we typically invoice our customers at the same time that we satisfy our performance obligations, contract assets and contract liabilities related to our contracts with customers recorded in the Consolidated Balance Sheets were not material as of December 31, 2024 and 2023.  \n​\nStandard product warranty coverage, which provides assurance that our products will conform to the contractually agreed-upon specifications for a limited period from the date of shipment, is typically offered, while extended or separately priced warranty coverage is typically not offered. The warranty claim is generally limited to a credit equal to the purchase price or a promise to repair or replace the product for a specified period of time at no additional charge.  We estimate our warranty liability based on historical experience, product history, and current trends.  \n​\nIncome Taxes\n​\nDeferred income taxes are provided for revenue and expenses which are recognized in different periods for income tax and financial statement reporting purposes.  The Company recognizes the effects of changes in tax laws and rates on deferred income taxes in the period in which legislation is enacted.  Deferred income taxes are provided on undistributed earnings of foreign subsidiaries in the period in which the Company determines it no longer intends to permanently reinvest such earnings outside the United States. As of December 31, 2024, the Company has not provided for deferred income taxes on undistributed foreign earnings of approximately $1,550 related to certain geographies, as it is the \n47\n\n\nTable of Contents\nCompany’s intention to permanently reinvest such earnings outside the United States.  It is impracticable to calculate the amount of taxes that would be payable if these undistributed foreign earnings were to be repatriated.  In addition, the Company remains indefinitely reinvested with respect to its financial statement basis in excess of tax basis of its investments in foreign subsidiaries.  It is not practicable to determine the deferred tax liability with respect to such basis differences.  Deferred tax assets are regularly assessed for recoverability based on both historical and anticipated earnings levels and a valuation allowance is recorded when it is more likely than not that these amounts will not be recovered. \n​\nThe tax effects of an uncertain tax position taken or expected to be taken in income tax returns are recognized only if it is “more likely than not” to be sustained on examination by the taxing authorities, based on its technical merits as of the reporting date.  The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement.  The Company includes estimated interest and penalties related to unrecognized tax benefits in the provision for income taxes.\n​\nAs a result of the Tax Act, the global intangible low-taxed income (“GILTI”) provision imposed a tax on certain earnings o\nf foreign subsidiaries.  The Company elected an accounting policy to account for GILTI as a period cost.  The U.S. Treasury Department has issued final interpretive guidance relating to certain provisions of the Tax Act and proposed additional guidance related to the same provisions.  The Company will account for the impact of additional guidance in the period in which any new guidance is released, if appropriate.\n​\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\n(\namounts in millions\n)\n​\nThe Company, in the normal course of doing business, is exposed to a variety of risks, including market risks associated with foreign currency exchange rates and changes in interest rates.  The Company does not have any significant concentration with any one counterparty.\n​\nForeign Currency Exchange Rate Risk\n​\nThe Company conducts business in many foreign currencies through its worldwide operations, and as a result, is subject to foreign exchange exposure due to changes in exchange rates of the various currencies. Changes in exchange rates can positively or negatively affect the Company’s sales, operating margins and equity.  The Company attempts to mitigate currency risk in a number of ways, such as locating factories in the same country or region in which products are sold, hedging contracts, cost reduction and pricing actions or working capital management.  However, there can be no assurance that any or all such actions taken by the Company will be fully effective in successfully managing currency risk, including in the event of a significant and sudden decline in the value of any of the foreign currencies of the Company’s worldwide operations.  \n​\nOne of the Company\n’s wholly owned European subsidiaries (the “Euro Issuer”) has two outstanding unsecured senior notes issued in Europe (collectively, the “Euro Notes”), each of which was issued with a principal amount of €500.0.  The 0.750% Euro Senior Notes, which were issued in May 2020, mature on May 4, 2026, while the 2.000% Euro Senior Notes, which were issued in October 2018, mature on October 8, 2028.  The Company and the Euro Issuer also have \na commercial paper program (the “Euro Commercial Paper Program” and, together with the U.S. Commercial Paper Program, the “Commercial Paper Programs”), pursuant to which the Euro Issuer may issue, outside of the United States, short-term unsecured commercial paper notes.\n \nIn addition to the Euro Notes, which are denominated in Euros, the Company may borrow, from time to time, under the Company’s $3,000.0 unsecured revolving credit facility (the “Revolving Credit Facility”) and Euro Commercial Paper Program, and such borrowings have been and may continue to be denominated in various foreign currencies, including the Euro.  When borrowing in foreign currencies, there can be no assurance that the Company can successfully manage changes in exchange rates, including in the event of a significant and sudden decline in the value of any of the foreign currencies in which such borrowings are made.  Refer to Note 4 of the Notes to Consolidated Financial Statements for a discussion of the Company’s debt.\n​\nThe Company also utilizes foreign exchange forward contracts to hedge foreign currency exchange rate fluctuations for exposures associated with (i) certain transactions denominated in foreign currencies and (ii) net investments in certain foreign subsidiaries from which we expect to repatriate earnings to the United States.  As of December 31, 2024, the fair value of such foreign exchange forward contracts\n was not material.  A 10% change in foreign currency exchange rates would not have a material effect on the value of the hedges as of December 31, 2024 and 2023.  The Company does \n48\n\n\nTable of Contents\nnot engage in purchasing forward contracts for trading or speculative purposes, and our derivative financial instruments are with large financial institutions with strong credit ratings.  As of December 31, 2024, the Company does not have any significant concentration of exposure with any one counterparty.  Refer to Note 1 and Note 5 of the Notes to Consolidated Financial Statements for a discussion of derivative financial instruments.\n​\nInterest Rate Risk\n​\nThe Company is subject to market risk from exposure to changes in interest rates based on the Company’s financing activities.  The Company manages its exposure to interest rate risk through a mix of fixed and variable rate debt.  The Company currently has various fixed rate senior notes outstanding, in both the United States and Europe, with various maturity dates, the most recent of which were issued in 2024.  In April 2024, the Company issued the April Senior Notes:  (i) $450.0 aggregate principal amount of the Original 2027 Senior Notes, (ii) $450.0 aggregate principal amount of the 2029 Senior Notes and (iii) $600.0 aggregate principal amount of the 2034 Senior Notes.  Then, in October 2024, the Company issued the October Senior Notes:  (i) $250.0 aggregate principal amount of the Additional 2027 Senior Notes, (ii) $750.0 aggregate principal amount of the 2035 Senior Notes and (iii) $500.0 aggregate principal amount of the 2054 Senior Notes.  Refer to Note 4 of the accompanying Notes to Consolidated Financial Statements herein for further discussion related to these debt instruments.\n​\nAny borrowings under the Revolving Credit Facility bear interest at rates that fluctuate with a spread that varies, based on the Company’s debt rating, over certain currency-specific benchmark rates, which benchmark rates in the case of U.S. dollar borrowings are either the base rate or the adjusted term Secured Overnight Financing Rate (“SOFR”).  Any borrowings under the Commercial Paper Programs are subject to floating interest rates.  Therefore, when the Company borrows under these debt instruments, the Company is exposed to market risk related to changes in interest rates.  \nAs of December 31, 2024 and 2023, the Company had no borrowings outstanding under the Revolving Credit Facility, U.S. Commercial Paper Program and Euro Commercial Paper Pro\ngram.  However\n, the Company borrowed under the U.S. Commercial Paper Program throughout much of 2024, the proceeds of which were used for general corporate purposes, including, but not limited to, partially funding the acquisition of Carlisle Interconnect Technologies (“CIT”) in May 2024, as discussed further in Note 11 of the Notes to Consolidated Financial Statements. Although all such borrowings were repaid before the end of 2024, the Company may make additional borrowings under any of its debt instruments from time to time in the future.  As of December 31, 2024\n, less than 1% of the Company’s outstanding borrowings were subject to floating interest rates.\n​\nTo the extent that interest rates change related to floating rate debt and the Company borrows under any of our floating rate debt instruments in the future (Commercial Paper Programs as well as our Revolving Credit Facility), our interest expense and interest payments will be impacted accordingly.  A 10% change in the interest rate at December 31, 2024 and 2023 under our Revolving Credit Facility or Commercial Paper Programs would not have a material effect on interest expense.  Although the Company does not expect changes in interest rates to have a material effect on income or cash flows in 2025, there can be no assurance that interest rates will not change significantly from current levels.\n​\n49\n\n\nTable of Contents\nItem 8. Financial Statements and Supplementary Data\n​\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n​\nTo the stockholders and the Board of Directors of Amphenol Corporation\n \n​\nOpinions on the Financial Statements and Internal Control over Financial Reporting\n​\nWe have audited the accompanying consolidated balance sheets of Amphenol Corporation and subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, changes in equity, and cash flow, for each of the three years in the period ended December 31, 2024, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the “financial statements”).  We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). \n​\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America (generally accepted accounting principles). Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\n​\nBasis for Opinions\n​\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management Report on Internal Control. Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n​\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\n​\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions. \n​\nDefinition and Limitations of Internal Control over Financial Reporting \n​\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \n​\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n​\n50\n\n\nTable of Contents\nCritical Audit Matter\n​\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.  The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n​\nIncome Taxes — Unrecognized Tax Benefits — Refer to Notes 1 and 6 to the financial statements\n​\nCritical Audit Matter Description\n​\nThe Company operates in the U.S. and numerous foreign taxable jurisdictions, and at any point in time has numerous audits underway at various stages of completion. The Company evaluates its tax positions and establishes liabilities for uncertain tax positions that may be challenged by tax authorities and may not be fully sustained, despite the Company’s belief that the underlying tax positions are fully supportable. The tax effects of an uncertain tax position taken or expected to be taken in income tax returns are recognized only if it is “more likely than not” to be sustained on examination by the taxing authorities, based on its technical merits as of the reporting date. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement. \n​\nManagement judgment is required to identify and evaluate each unrecognized tax benefit to determine whether the more likely than not recognition threshold has been met. Further, the evaluation of each unrecognized tax benefit requires management to apply specialized skill and knowledge related to the identified position. The Company has unrecognized tax benefits of $214.5 million, including penalties and interest, as of December 31, 2024.\n​\nWe identified the liabilities for uncertain tax positions as a critical audit matter because of the complexity created by the multiple jurisdictions in which the Company files its tax returns, each of which may have differing and complex tax laws and regulations. This required a high degree of auditor judgment and an increased extent of effort, including the need to involve our income tax specialists, when performing audit procedures to evaluate management’s recognition and measurement of identified unrecognized tax benefits, and whether it is more likely than not that the tax position will be sustained.\n​\nHow the Critical Audit Matter Was Addressed in the Audit\n​\nOur audit procedures related to uncertain tax positions included the following, among others: \n​\n●\nWe tested the effectiveness of controls over the unrecognized tax benefits for income taxes, including management’s controls over the identification of uncertain tax positions, determination of whether it is more likely than not that the tax positions will be sustained, and recording of unrecognized tax benefits.\n​\n●\nWith the assistance of our income tax specialists, we evaluated management’s significant judgements regarding unrecognized tax benefits including:\n​\no\nAssessing the reasonableness of the methods and processes used by management to identify uncertain tax positions including but not limited to:\n​\n◾\nEvaluating former and ongoing tax audits by tax authorities\n​\n◾\nEvaluating transactions for which third-party tax advice or tax opinions were received\n​\n◾\nReviewing other available relevant information\n​\no\nAssessing the technical merits of a sample of positions identified and the reasonableness of the methodology used to determine the unrecognized tax benefit.\n​\no\nEvaluating management’s conclusion with respect to whether a sample of unrecognized tax benefits accounted for in prior periods have been effectively settled and/or whether the statute of limitations has expired and, if so, whether the resolution of the tax position has been appropriately accounted for in the financial statements.\n​\no\nEvaluating a sample of tax positions that have not yet settled or are within statute to determine whether any new information regarding the sustainability of these tax positions or measurement of tax benefit is present and has been appropriately accounted for in the financial statements.\n​\n/s/ \nDeloitte & Touche LLP\n​\nHartford, Connecticut\nFebruary 7, 2025\n​\nWe have served as the Company’s auditor since 1997.\n51\n\n\nTable of Contents\nAMPHENOL CORPORATION\nConsolidated Statements of Income\n(dollars and shares in millions, except per share data)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n​\n \n2024\n    \n2023\n    \n2022\n \nNet sales\n​\n$\n \n15,222.7\n​\n$\n \n12,554.7\n​\n$\n \n12,623.0\n​\nCost of sales\n​\n \n \n10,083.0\n​\n \n \n8,470.6\n​\n \n \n8,594.8\n​\nGross profit\n​\n \n \n5,139.7\n​\n \n \n4,084.1\n​\n \n \n4,028.2\n​\nAcquisition-related expenses\n​\n \n \n127.4\n​\n \n \n34.6\n​\n \n \n21.5\n​\nSelling, general and administrative expenses\n​\n \n \n1,855.4\n​\n \n \n1,489.9\n​\n \n \n1,420.9\n​\nOperating income\n​\n \n \n3,156.9\n​\n \n \n2,559.6\n​\n \n \n2,585.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nInterest expense\n​\n \n (\n217.0\n)\n​\n \n (\n139.5\n)\n​\n \n (\n128.4\n)\n​\nGain on bargain purchase acquisition\n​\n \n \n—\n​\n \n \n5.4\n​\n \n \n—\n​\nOther income (expense), net\n​\n \n \n72.0\n​\n \n \n29.3\n​\n \n \n10.0\n​\nIncome before income taxes\n​\n \n \n3,011.9\n​\n \n \n2,454.8\n​\n \n \n2,467.4\n​\nProvision for income taxes\n​\n \n (\n570.3\n)\n​\n​\n (\n509.3\n)\n​\n \n (\n550.6\n)\n​\nNet income\n​\n​\n \n2,441.6\n​\n​\n \n1,945.5\n​\n​\n \n1,916.8\n​\nLess: Net income attributable to noncontrolling interests\n​\n \n (\n17.6\n)\n​\n \n (\n17.5\n)\n​\n \n (\n14.5\n)\n​\nNet income attributable to Amphenol Corporation\n​\n$\n \n2,424.0\n​\n$\n \n1,928.0\n​\n$\n \n1,902.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet income attributable to Amphenol Corporation per common share — Basic\n​\n$\n \n2.01\n​\n$\n \n1.62\n​\n$\n \n1.60\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average common shares outstanding — Basic\n​\n \n \n1,203.8\n​\n \n \n1,193.0\n​\n \n \n1,192.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet income attributable to Amphenol Corporation per common share — Diluted\n​\n$\n \n1.92\n​\n$\n \n1.55\n​\n$\n \n1.53\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average common shares outstanding — Diluted\n​\n \n \n1,263.6\n​\n \n \n1,241.2\n​\n \n \n1,242.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDividends declared per common share \n​\n$\n \n0.55\n​\n$\n \n0.425\n​\n$\n \n0.405\n​\n​\n​\n​\nSee accompanying notes to consolidated financial statements.\n​\n52\n\n\nTable of Contents\nAMPHENOL CORPORATION\nConsolidated Statements of Comprehensive Income\n(dollars in millions)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n​\n \n2024\n    \n2023\n    \n2022\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet income\n​\n$\n \n2,441.6\n​\n$\n \n1,945.5\n​\n$\n \n1,916.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal other comprehensive (loss) income, net of tax:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nForeign currency translation adjustments\n​\n \n (\n201.1\n)\n​\n \n (\n0.9\n)\n​\n \n (\n265.2\n)\n​\nUnrealized loss on hedging activities\n​\n \n \n—\n​\n \n \n—\n​\n \n (\n0.1\n)\n​\nPension and postretirement benefit plan adjustment\n​\n​\n \n16.6\n​\n​\n \n1.1\n​\n​\n \n11.8\n​\nTotal other comprehensive (loss) income, net of tax\n​\n \n (\n184.5\n)\n​\n \n \n0.2\n​\n \n (\n253.5\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal comprehensive income\n​\n \n \n2,257.1\n​\n \n \n1,945.7\n​\n \n \n1,663.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLess: Comprehensive income attributable to noncontrolling interests\n​\n \n (\n15.8\n)\n​\n \n (\n16.3\n)\n​\n \n (\n9.5\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nComprehensive income attributable to Amphenol Corporation\n​\n$\n \n2,241.3\n​\n$\n \n1,929.4\n​\n$\n \n1,653.8\n​\n​\n​\nSee accompanying notes to consolidated financial statements.\n​\n​\n​\n53\n\n\nTable of Contents\n​\nAMPHENOL CORPORATION\nConsolidated Balance Sheets\n(dollars and shares in millions, except per share data)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\n​\n \n2024\n  \n2023\n \nASSETS\n​\n​\n​\n​\n​\n​\n​\nCurrent Assets:\n​\n​\n​\n​\n​\n​\n​\nCash and cash equivalents\n​\n$\n \n3,317.0\n​\n$\n \n1,475.0\n​\nShort-term investments\n​\n \n \n18.4\n​\n \n \n185.2\n​\nTotal cash, cash equivalents and short-term investments\n​\n \n \n3,335.4\n​\n \n \n1,660.2\n​\nAccounts receivable, less allowance for doubtful accounts of $\n66.5\n and $\n68.4\n, respectively\n​\n \n \n3,287.9\n​\n \n \n2,618.4\n​\nInventories\n​\n \n \n2,545.7\n​\n \n \n2,167.1\n​\nPrepaid expenses and other current assets\n​\n \n \n517.0\n​\n \n \n389.6\n​\nTotal current assets\n​\n \n \n9,686.0\n​\n \n \n6,835.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\nProperty, plant and equipment, net\n​\n \n \n1,711.8\n​\n \n \n1,314.7\n​\nGoodwill\n​\n​\n \n8,236.2\n​\n​\n \n7,092.4\n​\nOther intangible assets, net\n​\n \n \n1,225.1\n​\n \n \n834.8\n​\nOther long-term assets\n​\n​\n \n581.1\n​\n​\n \n449.2\n​\nTotal Assets\n​\n$\n \n21,440.2\n​\n$\n \n16,526.4\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLIABILITIES, REDEEMABLE NONCONTROLLING INTERESTS AND EQUITY\n​\n​\n​\n​\n​\n​\n​\nCurrent Liabilities:\n​\n​\n​\n​\n​\n​\n​\nAccounts payable\n​\n$\n \n1,819.4\n​\n$\n \n1,350.9\n​\nAccrued salaries, wages and employee benefits\n​\n \n \n529.8\n​\n \n \n412.8\n​\nAccrued income taxes\n​\n \n \n199.0\n​\n \n \n166.0\n​\nAccrued dividends\n​\n​\n \n199.5\n​\n​\n \n131.7\n​\nOther accrued expenses\n​\n \n \n934.4\n​\n \n \n737.5\n​\nCurrent portion of long-term debt\n​\n \n \n401.7\n​\n \n \n353.8\n​\nTotal current liabilities\n​\n \n \n4,083.8\n​\n \n \n3,152.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLong-term debt, less current portion\n​\n \n \n6,484.4\n​\n \n \n3,983.5\n​\nAccrued pension and postretirement benefit obligations\n​\n \n \n129.8\n​\n \n \n143.0\n​\nDeferred income taxes\n​\n​\n \n376.7\n​\n​\n \n367.0\n​\nOther long-term liabilities\n​\n \n \n509.4\n​\n \n \n453.7\n​\nTotal Liabilities\n​\n​\n \n11,584.1\n​\n​\n \n8,099.9\n​\nCommitments and contingent liabilities (Note 14)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nRedeemable noncontrolling interests\n​\n​\n \n8.7\n​\n​\n \n30.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEquity:\n​\n​\n​\n​\n​\n​\n​\nClass A Common Stock, $\n0.001\n par value, \n2,000.0\n shares authorized; \n1,212.9\n shares issued and \n1,209.3\n shares outstanding at December 31, 2024; \n1,201.3\n shares issued and \n1,197.8\n shares outstanding at December 31, 2023\n​\n \n \n1.2\n​\n​\n \n1.2\n​\nAdditional paid-in capital\n​\n \n \n3,601.8\n​\n \n \n3,100.6\n​\nRetained earnings\n​\n \n \n7,105.0\n​\n \n \n5,921.1\n​\nTreasury stock, at cost; \n3.6\n shares and \n3.5\n shares as of December 31, 2024 and 2023, respectively\n​\n​\n (\n199.7\n)\n​\n​\n (\n142.8\n)\n​\nAccumulated other comprehensive loss\n​\n \n (\n716.3\n)\n​\n \n (\n533.6\n)\n​\nTotal stockholders’ equity attributable to Amphenol Corporation\n​\n \n \n9,792.0\n​\n \n \n8,346.5\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNoncontrolling interests\n​\n \n \n55.4\n​\n \n \n49.3\n​\nTotal Equity\n​\n \n \n9,847.4\n​\n \n \n8,395.8\n​\nTotal Liabilities, Redeemable Noncontrolling Interests and Equity\n​\n$\n \n21,440.2\n​\n$\n \n16,526.4\n​\n​\n​\nSee accompanying notes to consolidated financial statements.\n​\n​\n54\n\n\nTable of Contents\nAMPHENOL CORPORATION\nConsolidated Statements of Changes in Equity\n(dollars and shares in millions, except per share data)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nStockholders’ equity attributable to Amphenol Corporation \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAccumulated\n​\n​\n​\n​\n​\n​\n​\nRedeemable\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdditional\n​\n​\n​\n​\nOther\n​\nNon-\n​\n​\n​\n​\nNon-\n​\n​\n​\nCommon Stock\n  \nTreasury Stock\n​\nPaid-in\n​\nRetained\n​\nComprehensive\n​\ncontrolling\n​\nTotal\n​\ncontrolling\n​\n​\n​\nShares\n​\nAmount\n  \nShares\n  \nAmount\n   \nCapital\n \n​\nEarnings\n \n​\nLoss\n \n​\nInterests\n \n(1)\n \n​\nEquity\n​\nInterests\n​\nBalance as of January 1, 2022\n \n \n1,201.4\n​\n$\n \n1.2\n​\n (\n3.2\n)\n​\n$\n (\n100.0\n)\n​\n$\n \n2,408.4\n​\n$\n \n4,278.9\n​\n$\n (\n286.5\n)\n​\n$\n \n58.1\n​\n$\n \n6,360.1\n​\n$\n \n19.0\n​\nNet income \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n1,902.3\n​\n​\n​\n​\n \n \n12.9\n​\n \n \n1,915.2\n​\n \n \n1.6\n​\nOther comprehensive income (loss)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n248.5\n)\n​\n \n (\n5.0\n)\n​\n \n (\n253.5\n)\n​\n \n \n—\n​\nPurchase of noncontrolling interests\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n (\n1.8\n)\n​\n​\n​\n​\n​\n​\n​\n​\n (\n2.8\n)\n​\n​\n (\n4.6\n)\n​\n​\n​\n​\nDistributions to shareholders of noncontrolling interests \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n5.3\n)\n​\n \n (\n5.3\n)\n​\n \n​\n​\nPurchase of treasury stock \n​\n​\n​\n​\n​\n​\n (\n19.8\n)\n​\n \n (\n730.5\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n730.5\n)\n​\n​\n​\n​\nRetirement of treasury stock \n \n (\n18.7\n)\n​\n \n \n—\n​\n \n18.7\n​\n \n \n689.7\n​\n​\n​\n​\n \n (\n689.7\n)\n​\n​\n​\n​\n​\n​\n​\n \n \n—\n​\n​\n​\n​\nStock options exercised \n \n \n9.3\n​\n \n \n—\n​\n \n1.9\n​\n​\n \n61.0\n​\n \n \n153.7\n​\n​\n (\n29.5\n)\n​\n​\n​\n​\n​\n​\n​\n \n \n185.2\n​\n​\n​\n​\nDividends declared (\n$\n0.405\n per common share) \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n482.6\n)\n​\n​\n​\n​\n​\n​\n​\n \n (\n482.6\n)\n​\n​\n​\n​\nStock-based compensation expense\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n89.5\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n89.5\n​\n​\n​\n​\nBalance as of December 31, 2022\n \n \n1,192.0\n​\n​\n \n1.2\n​\n (\n2.4\n)\n​\n​\n (\n79.8\n)\n​\n​\n \n2,649.8\n​\n​\n \n4,979.4\n​\n​\n (\n535.0\n)\n​\n​\n \n57.9\n​\n​\n \n7,073.5\n​\n​\n \n20.6\n​\nNet income \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n1,928.0\n​\n​\n​\n​\n \n \n15.6\n​\n \n \n1,943.6\n​\n \n \n1.9\n​\nOther comprehensive income (loss)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n1.4\n​\n \n (\n1.2\n)\n​\n \n \n0.2\n​\n \n \n—\n​\nAcquisitions resulting in noncontrolling interests \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n1.0\n​\n \n \n1.0\n​\n \n \n8.2\n​\nDistributions to shareholders of noncontrolling interests \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n24.0\n)\n​\n \n (\n24.0\n)\n​\n \n​\n​\nPurchase of treasury stock \n​\n​\n​\n​\n​\n​\n (\n14.4\n)\n​\n \n (\n585.1\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n585.1\n)\n​\n​\n​\n​\nRetirement of treasury stock \n \n (\n10.9\n)\n​\n \n \n—\n​\n \n10.9\n​\n \n \n435.8\n​\n​\n​\n​\n \n (\n435.8\n)\n​\n​\n​\n​\n​\n​\n​\n \n \n—\n​\n​\n​\n​\nStock options exercised\n \n \n20.2\n​\n \n \n—\n​\n \n2.4\n​\n​\n \n86.3\n​\n \n \n351.8\n​\n​\n (\n43.1\n)\n​\n​\n​\n​\n​\n​\n​\n \n \n395.0\n​\n​\n​\n​\nDividends declared (\n$\n0.425\n per common share) \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n507.4\n)\n​\n​\n​\n​\n​\n​\n​\n \n (\n507.4\n)\n​\n​\n​\n​\nStock-based compensation expense\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n99.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n99.0\n​\n​\n​\n​\nBalance as of December 31, 2023\n \n \n1,201.3\n​\n​\n \n1.2\n​\n (\n3.5\n)\n​\n​\n (\n142.8\n)\n​\n​\n \n3,100.6\n​\n​\n \n5,921.1\n​\n​\n (\n533.6\n)\n​\n​\n \n49.3\n​\n​\n \n8,395.8\n​\n​\n \n30.7\n​\nNet income \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n2,424.0\n​\n​\n​\n​\n \n \n16.0\n​\n \n \n2,440.0\n​\n \n \n1.6\n​\nOther comprehensive income (loss)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n182.7\n)\n​\n \n (\n1.3\n)\n​\n \n (\n184.0\n)\n​\n \n (\n0.5\n)\n​\nCapital contributions from noncontrolling interests\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n1.5\n​\n​\n \n1.5\n​\n​\n​\n​\nPurchase of noncontrolling interests\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n0.2\n​\n​\n​\n​\n​\n​\n​\n​\n (\n0.1\n)\n​\n​\n \n0.1\n​\n​\n (\n23.1\n)\n​\nDistributions to shareholders of noncontrolling interests \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n10.0\n)\n​\n \n (\n10.0\n)\n​\n \n​\n​\nPurchase of treasury stock \n​\n​\n​\n​\n​\n​\n (\n11.1\n)\n​\n \n (\n689.3\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n689.3\n)\n​\n​\n​\n​\nRetirement of treasury stock \n \n (\n8.3\n)\n​\n \n \n—\n​\n \n8.3\n​\n \n \n513.1\n​\n​\n​\n​\n \n (\n513.1\n)\n​\n​\n​\n​\n​\n​\n​\n \n \n—\n​\n​\n​\n​\nStock options exercised\n \n \n19.9\n​\n \n \n—\n​\n \n2.7\n​\n​\n \n119.3\n​\n \n \n391.5\n​\n​\n (\n64.1\n)\n​\n​\n​\n​\n​\n​\n​\n \n \n446.7\n​\n​\n​\n​\nDividends declared (\n$\n0.55\n per common share) \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n (\n662.9\n)\n​\n​\n​\n​\n​\n​\n​\n \n (\n662.9\n)\n​\n​\n​\n​\nStock-based compensation expense\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n109.5\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n \n109.5\n​\n​\n​\n​\nBalance as of December 31, 2024\n \n \n1,212.9\n​\n$\n \n1.2\n​\n (\n3.6\n)\n​\n$\n (\n199.7\n)\n​\n$\n \n3,601.8\n​\n$\n \n7,105.0\n​\n$\n (\n716.3\n)\n​\n$\n \n55.4\n​\n$\n \n9,847.4\n​\n$\n \n8.7\n​\n(1)\nExcludes redeemable noncontrolling interests.\n​\nSee accompanying notes to consolidated financial statements.\n​\n55\n\n\nTable of Contents\nAMPHENOL CORPORATION\nConsolidated Statements of Cash Flow\n(dollars in millions)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n​\n    \n2024\n    \n2023\n    \n2022\n \nCash from operating activities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet income\n​\n$\n \n2,441.6\n​\n$\n \n1,945.5\n​\n$\n \n1,916.8\n​\nAdjustments to reconcile net income to net cash provided by operating activities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDepreciation and amortization\n​\n \n \n572.5\n​\n \n \n406.4\n​\n \n \n392.9\n​\nStock-based compensation expense\n​\n \n \n109.5\n​\n \n \n99.0\n​\n \n \n89.5\n​\nDeferred income tax benefit\n​\n \n (\n82.8\n)\n​\n​\n (\n58.8\n)\n​\n​\n (\n4.7\n)\n​\nGain on bargain purchase acquisition\n​\n \n \n—\n​\n \n (\n5.4\n)\n​\n \n \n—\n​\nNet change in operating assets and liabilities, excluding effects of acquisitions:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAccounts receivable, net \n​\n \n (\n586.8\n)\n​\n​\n \n146.4\n​\n​\n (\n273.1\n)\n​\nInventories \n​\n \n (\n200.1\n)\n​\n​\n \n71.4\n​\n​\n (\n278.5\n)\n​\nPrepaid expenses and other current assets \n​\n \n (\n106.8\n)\n​\n​\n (\n34.1\n)\n​\n​\n \n49.7\n​\nAccounts payable \n​\n \n \n423.1\n​\n​\n (\n34.6\n)\n​\n​\n \n62.5\n​\nAccrued income taxes \n​\n \n \n3.1\n​\n​\n \n7.7\n​\n​\n \n77.6\n​\nOther accrued liabilities \n​\n \n \n257.0\n​\n​\n (\n7.0\n)\n​\n​\n \n168.7\n​\nAccrued pension and postretirement benefits \n​\n \n (\n2.4\n)\n​\n​\n (\n0.3\n)\n​\n​\n (\n0.4\n)\n​\nOther long-term assets and liabilities\n​\n \n (\n13.2\n)\n​\n​\n (\n7.5\n)\n​\n​\n (\n26.4\n)\n​\nNet cash provided by operating activities\n​\n \n \n2,814.7\n​\n \n \n2,528.7\n​\n \n \n2,174.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCash from investing activities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCapital expenditures\n​\n \n (\n665.4\n)\n​\n \n (\n372.8\n)\n​\n \n (\n383.8\n)\n​\nProceeds from disposals of property, plant and equipment\n​\n \n \n7.8\n​\n \n \n4.0\n​\n \n \n5.6\n​\nPurchases of investments\n​\n \n (\n26.2\n)\n​\n \n (\n305.7\n)\n​\n \n (\n309.4\n)\n​\nSales and maturities of investments\n​\n \n \n189.7\n​\n \n \n246.3\n​\n \n \n228.2\n​\nAcquisitions, net of cash acquired\n​\n \n (\n2,156.4\n)\n​\n \n (\n970.4\n)\n​\n \n (\n288.2\n)\n​\nOther, net\n​\n​\n \n1.9\n​\n​\n \n4.9\n​\n​\n \n16.5\n​\nNet cash used in investing activities\n​\n \n (\n2,648.6\n)\n​\n \n (\n1,393.7\n)\n​\n \n (\n731.1\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCash from financing activities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nProceeds from issuance of senior notes and other long-term debt\n​\n \n \n2,991.3\n​\n \n \n354.9\n​\n \n \n5.8\n​\nRepayments of senior notes and other long-term debt\n​\n \n (\n364.4\n)\n​\n​\n (\n15.7\n)\n​\n​\n (\n10.3\n)\n​\nProceeds from short-term borrowings\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n44.9\n​\nRepayments of short-term borrowings\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n (\n44.9\n)\n​\n(Repayments) borrowings under commercial paper programs, net\n​\n​\n \n—\n​\n​\n (\n632.6\n)\n​\n​\n (\n159.3\n)\n​\nPayment of costs related to debt financing\n​\n \n (\n28.4\n)\n​\n \n (\n2.3\n)\n​\n \n (\n0.4\n)\n​\nPayment of deferred purchase price related to acquisitions\n​\n​\n \n—\n​\n \n (\n1.5\n)\n​\n​\n \n—\n​\nPurchase of treasury stock\n​\n \n (\n689.3\n)\n​\n \n (\n585.1\n)\n​\n \n (\n730.5\n)\n​\nProceeds from exercise of stock options\n​\n​\n \n447.4\n​\n​\n \n394.5\n​\n​\n \n185.3\n​\nDistributions to and purchases of noncontrolling interests\n​\n​\n (\n33.0\n)\n​\n​\n (\n24.0\n)\n​\n​\n (\n9.9\n)\n​\nDividend payments\n​\n \n (\n595.1\n)\n​\n \n (\n500.6\n)\n​\n \n (\n477.4\n)\n​\nOther, net\n​\n​\n \n1.4\n​\n​\n \n—\n​\n​\n \n—\n​\nNet cash provided by (used in) financing activities\n​\n \n \n1,729.9\n​\n \n (\n1,012.4\n)\n​\n \n (\n1,196.7\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEffect of exchange rate changes on cash and cash equivalents\n​\n \n (\n54.0\n)\n​\n \n (\n20.7\n)\n​\n \n (\n70.8\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet increase in cash and cash equivalents\n​\n \n \n1,842.0\n​\n \n \n101.9\n​\n \n \n176.0\n​\nCash and cash equivalents balance, beginning of year\n​\n \n \n1,475.0\n​\n \n \n1,373.1\n​\n \n \n1,197.1\n​\nCash and cash equivalents balance, end of year\n​\n$\n \n3,317.0\n​\n$\n \n1,475.0\n​\n$\n \n1,373.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCash paid during the year for:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nInterest\n​\n$\n \n179.5\n​\n$\n \n129.2\n​\n$\n \n123.7\n​\nIncome taxes, net\n​\n \n \n650.0\n​\n \n \n560.4\n​\n \n \n477.7\n​\n​\nSee accompanying notes to consolidated financial statements.\n​\n56\n\n\nTable of Contents\nAMPHENOL CORPORATION\nNotes to Consolidated Financial Statements\n​\n(All amounts included in the following Notes to Consolidated Financial Statements are presented in millions, except share and per share data, unless otherwise noted)\n​\n​\nNote 1—Summary of Significant Accounting Policies\n​\nBusiness\n​\nAmphenol Corporation (together with its subsidiaries, “Amphenol,” the “Company,” “we,” “our” or “us”) is one of the world’s largest designers, manufacturers and marketers of electrical, electronic and fiber optic connectors and interconnect systems, antennas, sensors and sensor-based products and coaxial, high-speed and specialty cable.  The Company sells its products to customers worldwide.\n​\nThe Company aligns its businesses into the following \nthree\n reportable business segments: \n​\n●\nHarsh Environment Solutions\n – the Harsh Environment Solutions segment designs, manufactures and markets a broad range of ruggedized interconnect products, including connectors and interconnect systems, specialty cable, printed circuits and printed circuit assemblies and other products for use in the industrial, defense, commercial aerospace, automotive, mobile networks and information technology and data communications end markets.\n​\n●\nCommunications Solutions\n – the Communications Solutions segment designs, manufactures and markets a broad range of connector and interconnect systems, including high speed, radio frequency, power, fiber optic and other products, coaxial and high-speed cable, as well as antennas, for use in the information technology and data communications, mobile devices, industrial, mobile networks, broadband communications, automotive, commercial aerospace and defense end markets.\n​\n●\nInterconnect and Sensor Systems \n– the Interconnect and Sensor Systems segment designs, manufactures and markets a broad range of sensors, sensor-based systems, connectors and value-add interconnect systems used in the automotive, industrial, information technology and data communications, mobile networks, defense and commercial aerospace end markets.\n​\nAll segment information throughout the Consolidated Financial Statements and Notes to Consolidated Financial Statements is presented in accordance with the \nthree\n reportable business segments.  Refer to Note 13 herein for further details related to the Company’s reportable business segments.\n​\nUse of Estimates\n​\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (“U.S. GAAP” or “GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period.  The Company’s management evaluates these significant estimates and assumptions that affect the consolidated financial statements and related disclosures.  Estimates used in calculating certain accounts, including but not limited to, the allowance for doubtful accounts, provisions for slow-moving or obsolete inventory, revenue recognition, income taxes and related valuation allowances, goodwill and intangible assets from acquisitions, and pensions, are developed based on historical experience or other assumptions that the Company believes to be reasonable.  Actual results could differ from those estimates.\n​\nPrinciples of Consolidation\n​\nThe consolidated financial statements are prepared in U.S. dollars and include the accounts of the Company and its wholly owned and majority-owned subsidiaries. Intercompany account balances and transactions have been eliminated in consolidation.  The results of companies acquired are included in the Consolidated Financial Statements from the effective date of acquisition.  The Company’s results of operations for each of the three years ended December 31, 2024 \n57\n\n\nTable of Contents\nmay not necessarily be indicative of its future operating results.  The accompanying Financial Statements and Notes herein reflect all adjustments, including normal recurring adjustments considered necessary for a fair presentation of the results, in conformity with U.S. GAAP.\n​\nStock Split\n​\nOn May 20, 2024, the Company announced that its Board of Directors (the “Board”) approved a \ntwo\n-for-one split of the Company’s Class A Common Stock (“Common Stock”).  The stock split was effected in the form of a stock dividend paid to stockholders of record as of the close of business on May 31, 2024.  The additional shares were distributed on June 11, 2024, and the Common Stock began trading on a split-adjusted basis on June 12, 2024.  The shares of Common Stock retain a par value of \n$\n0.001\n per share.  As a result of the stock split, stockholders received \none\n additional share of Common Stock for each share held as of the record date.  There was \nno\n change in the number of authorized shares of common stock of the Company as a result of the stock split.  \n​\nAll current and prior year data impacted by the stock split and presented in the accompanying Consolidated Financial Statements and notes thereto, including, but not limited to, number of shares and per share information, stock-based compensation data, including stock options and restricted shares and related per share data, basic and diluted earnings per share, and dividends per share amounts, among others, have been adjusted to reflect the effect of the stock split and to conform to the current year presentation.  The impact to the Consolidated Balance Sheets and Consolidated Statements of Changes in Equity herein was an increase of \n$\n0.6\n to Common stock, with an offsetting decrease in Additional paid-in capital, which has been retroactively adjusted for all periods presented.\n​\nCash and Cash Equivalents\n​\nCash and cash equivalents consist of cash and liquid investments with an original maturity of three months or less. The carrying amounts approximate fair values of those instruments, the majority of which are typically in non-U.S. bank accounts.  However, as of December 31, 2024, more than \nhalf \nof the Company’s cash and cash equivalents on hand was located in the United States, primarily as a result of the proceeds from the issuance of the October Senior Notes, as discussed in more detail in Note 4 herein.\n​\nShort-term and Long-term Investments\n​\nShort-term investments primarily consist of certificates of deposit with original or remaining maturities of 12 months or less.  Long-term investments primarily consist of certificates of deposit with original and remaining maturities of more than 12 months.  The carrying amounts of these short-term and long-term investments approximate their respective fair values, the vast majority of which are in non-U.S. bank accounts.  Short-term investments are presented separately as its own line item on the Consolidated Balance Sheets.  Long-term investments are recorded in Other long-term assets on the Consolidated Balance Sheets.\n​\nAccounts Receivable\n​\nAccounts receivable is stated at net realizable value.  The Company regularly reviews accounts receivable balances and adjusts the receivable reserves as necessary whenever events or circumstances indicate the carrying value may not be recoverable.  The Company assesses and records an allowance for expected credit losses on accounts receivable.\n​\nInventories\n​\nInventories are stated at the lower of cost or net realizable value. The principal components of cost included in inventories are materials, direct labor and manufacturing overhead. The Company regularly reviews inventory quantities on hand, evaluates the realizability of inventories and adjusts the carrying value as necessary based on forecasted product demand.  \nProvisions for slow-moving and obsolete inventory are made based on historical experience and product demand.\n​\nDepreciable Assets\n​\nProperty, plant and equipment are carried at cost less accumulated depreciation. Depreciation is recorded on a straight-line basis over the respective asset lives determined on a composite basis by asset group or on a specific item basis using the estimated useful lives of such assets, which generally range from \n3\n to \n12 years\n for machinery and \n58\n\n\nTable of Contents\nequipment and office equipment and \n20\n to \n40 years\n \nfor buildings.  Leasehold building improvements are amortized over the shorter of the remaining lease term or estimated useful life of such improvements.  The Company periodically reviews fixed asset lives.  Depreciation expense is included in both Cost of sales and Selling, general and administrative expenses in the Consolidated Statements of Income, dependent upon the specific categorization and use of the underlying asset being depreciated.  The Company assesses the impairment of property, plant and equipment subject to depreciation, whenever events or changes in circumstances indicate the carrying value may not be recoverable. Factors the Company considers important, which could trigger an impairment review, include significant changes in the manner of the use of the asset, significant changes in historical trends in operating performance, significant changes in projected operating performance, and significant negative economic trends.  There have been \nno\n impairments recorded in 2024, 2023 or 2022 as a result of such reviews.\n​\nLeases\n​\nAmphenol is a lessee of buildings, office space, automobiles and equipment throughout the world, nearly all of which are classified as operating leases expiring at various dates.  The Company determines if an arrangement qualifies as a lease at lease inception.  Lease right-of-use (“ROU”) assets and lease liabilities for existing operating leases are recognized on the Consolidated Balance Sheets.  Operating lease liabilities are recorded based on the present value of the future lease payments over the lease term, assessed as of the commencement date.  The Company’s real estate leases, which are comprised primarily of manufacturing facilities, warehouses and sales offices, represent the vast majority of our operating lease liabilities and generally have a lease term between \n1\n and \n10 years\n.  The remaining leases primarily consist of machinery and equipment used in production, office equipment and vehicles, each with various lease terms.  The vast majority of our leases are comprised of fixed lease payments, with a small percentage of the Company’s real estate leases including lease payments tied to a rate or index which may be subject to variability.  Certain real estate leases also include executory costs such as common area maintenance (non-lease component), as well as property insurance and property taxes (non-components).  \nWe account for the lease and non-lease components as a single lease component for our real estate leases.\n  Lease payments, which may include lease components, non-lease components and non-components, are included in the measurement of the Company’s lease liabilities to the extent that such payments are either fixed amounts or variable amounts based on a rate or index (fixed in substance) as stipulated in the lease contract.  Any actual costs in excess of such amounts are expensed as incurred as variable lease cost.\n​\nSubstantially all of our lease agreements do not specify an implicit borrowing rate, and as such, the Company utilizes its incremental borrowing rate by lease term, in order to calculate the present value of our future lease payments.  The discount rate represents a risk-adjusted rate on a secured basis, and is the rate at which the Company would borrow funds to satisfy the scheduled lease liability payment streams commensurate with the lease term.  For new or renewed leases, the discount rate is determined using available data at lease commencement and based on the lease term including any reasonably certain renewal periods. \n​\nSome of our lease agreements, primarily related to real estate, include options for the Company to either renew (extend) or early terminate the lease.  Leases with renewal options allow the Company to extend the lease term typically between \n1\n and \n6 years\n.  Renewal options are reviewed at lease commencement to determine if such options are reasonably certain of being exercised, which could impact the lease term.  When determining if a renewal option is reasonably certain of being exercised, the Company considers several factors, including but not limited to, the significance of leasehold improvements incurred on the property, whether the asset is difficult to replace, or specific characteristics unique to the particular lease that would make it reasonably certain that we would exercise such option.  In most cases and unless there is an economic, financial or business reason to do so, the Company has concluded that renewal and early termination options are not reasonably certain of being exercised by the Company (and thus not included in our ROU asset and lease liability).\n​\nRefer to Note 10 herein for further information related to our lease portfolio. \n​\nGoodwill\n​\nGoodwill represents the excess purchase cost over the fair value of net assets acquired in business combinations.  The Company performs its evaluation for the impairment of goodwill associated with the Company’s reporting units on an annual basis as of each July 1, or more frequently if an event occurs or circumstances change that would indicate that a reporting unit’s carrying amount may be impaired.  The Company reviews its reporting unit structure each year, or more frequently based on changes in our organization.  The Company continues to define its reporting \nunits as the \nthree\n reportable business segments.\n59\n\n\nTable of Contents\n​\nAnnually, the Company performs its goodwill impairment assessment on its \nthree\n reporting units.  In the third quarter of 2024 and 2023, as part of our annual evaluations, the Company utilized the option to first assess qualitative factors to determine whether it was necessary to perform the quantitative goodwill impairment assessment.  As part of these assessments, the Company reviews qualitative factors, which include, but are not limited to, economic, market and industry conditions, as well as the financial performance of each reporting unit.  In accordance with applicable guidance, an entity is not required to calculate the fair value of a reporting unit if, after assessing these qualitative factors, the Company determines that it is more likely than not that the fair value of each of its reporting units is greater than its respective carrying amount.  As of July 1, 2024 and 2023, the Company determined that it was more likely than not that the fair value of each of its reporting units exceeded its respective carrying amount and, therefore, a quantitative assessment was not required.  As a result, \nno\n goodwill impairment resulted from the assessments as of July 1, 2024 and 2023.\n​\nThe Company has \nno\nt recognized any goodwill impairment in 2024, 2023 or 2022 in connection with its annual impairment assessments.  Refer to Note 12 herein for further details related to the carrying amount of goodwill by segment.\n​\nIntangible Assets\n​\nOther than goodwill, intangible assets primarily consist of customer relationships, proprietary technology, acquired backlog and license agreements and are generally amortized over the estimated periods of benefit.  The fair value associated with acquired identifiable intangible assets are generally valued based on discounted cash flow analyses, independent appraisals and certain estimates made by management.  The Company assesses and reviews its identifiable intangible assets, subject to amortization, for potential impairment whenever events or changes in circumstances indicate the intangible asset’s carrying amount may not be recoverable.  Factors the Company considers important, which could trigger an impairment review, include significant changes in the manner of the use of the asset, changes in historical trends in operating performance, significant changes in projected operating performance, anticipated future cash flows and significant negative economic trends.  Any indefinite-lived intangible assets that are not subject to amortization, which are comprised of certain trade names, are reviewed at least annually for impairment.  In the third quarter of 2024, the Company performed its annual assessment of these identifiable indefinite-lived intangible assets. \n Based on its assessment, the Company determined that it was more likely than not that the fair value of the indefinite-lived intangible assets exceeded their respective carrying amounts.  There has been \nno\n impairment associated with the Company’s intangible assets in 2024, 2023 or 2022 as a result of such reviews.\n​\nAcquisitions\n​\nThe Company accounts for acquisitions using the acquisition method of accounting, which requires that assets acquired and liabilities assumed be recognized at fair value as of the acquisition date.  The purchase price of acquisitions is allocated to the tangible and identifiable intangible assets acquired and liabilities and noncontrolling interests assumed based on estimated fair values, and any excess purchase price over the identifiable assets acquired and liabilities assumed is recorded as goodwill.  Any subsequent adjustments to the purchase price allocation prior to the completion of the measurement period will be reflected as an adjustment to goodwill in the period in which the adjustments are identified.  The Company may use independent valuation specialists to assist in determining the estimated fair values of assets acquired and liabilities assumed, which could require certain significant management assumptions and estimates.\n​\nRevenue Recognition\n​\nThe Company recognizes revenue upon the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for such goods or services.  The vast majority of our sales are recognized when products are shipped from our facilities or delivered to our customers, depending on the respective contractual terms.  A nominal portion of our contracts have revenue recognized over time as control of the goods transfers, rather than when the goods are delivered, and title, risk and reward of ownership are passed to the customer, since they have no alternative use and for which the Company has an enforceable right to payment, including a reasonable profit margin, from the customer for performance completed to date.  Refer to Note 13 herein for further discussion regarding the Company’s disaggregation of net sales.\n​\nThe Company’s primary source of revenues consist of product sales to either end customers and their appointed contract manufacturers (including original equipment manufacturers) or to distributors, and the vast majority of our sales \n60\n\n\nTable of Contents\nare recognized at a point-in-time under the core principle of recognizing revenue when control transfers to the customer.  Revenues are derived from contracts with customers, which in most cases are customer purchase orders that may be governed by master sales agreements.  For each contract, the promise to transfer the control of the products, each of which is individually distinct, is considered to be the identified performance obligation. As part of the consideration promised in each contract, the Company evaluates the customer’s credit risk.  Our contracts do not have any significant financing components, as payment terms are generally due net \n30\n to \n120 days\n after delivery. Although products are almost always sold at fixed prices, in determining the transaction price, we evaluate whether the price is subject to refund (due to returns) or adjustment (due to volume discounts, rebates, or price concessions) to determine the net consideration we expect to be entitled to. We allocate the transaction price to each distinct product based on its relative standalone selling price. Taxes assessed by governmental authorities and collected from the customer, including but not limited to sales and use taxes and value-added taxes, are not included in the transaction price.  \n​\nThe vast majority of our sales are recognized at a point-in-time under the core principle of recognizing revenue when control transfers to the customer.  \nWith limited exceptions, the Company recognizes revenue at the point in time when we ship or deliver the product from our manufacturing facility to our customer, when our customer accepts and has legal title of the goods, and where the Company has a present right to payment for such goods.  Based on the respective contract terms, most of our contracts’ revenues are recognized either (i) upon shipment based on free on board (“FOB”) shipping point or (ii) when the product arrives at its destination.  For the years ended December 31, 2024, 2023 and 2022, less than \n5\n%\n of our net sales were recognized over time, where the associated contracts relate to the sale of goods with no alternative use as they are only sold to a single customer and whose underlying contract terms provide the Company with an enforceable right to payment, including a reasonable profit margin, for performance completed to date, in the event of customer termination. For the contracts recognized over time, we typically record revenue using the input method, based on the materials and labor costs incurred to date relative to the contract’s total estimated costs.  This method reasonably depicts when and as control of the goods transfers to the customer, since it measures our progress in producing the goods, which is generally commensurate with this transfer of control.  Since we typically invoice our customers at the same time that we satisfy our performance obligations, contract assets and contract liabilities related to our contracts with customers recorded in the Consolidated Balance Sheets were not material as of December 31, 2024 and 2023.\n​\nThe Company receives customer orders negotiated with multiple delivery dates that may extend across more than \none\n reporting period until the contract is fulfilled, the end of the order period is reached, or a pre-determined maximum order value has been reached.  Orders typically fluctuate from quarter to quarter based on customer demand and general business conditions.  It is generally expected that a substantial portion of our remaining performance obligations will be fulfilled within \nthree months\n.  Nearly all of our performance obligations are fulfilled within \none year\n.  Since our performance obligations are part of contracts that generally have original durations of \none\n year or less, we have not disclosed the aggregate amount of transaction prices associated with unsatisfied or partially unsatisfied performance obligations as of December 31, 2024 and 2023.  \n​\nSales to Distributors and Resellers\n​\nSales to certain distributors and resellers are made under terms allowing certain price adjustments and limited rights of return of the Company’s products held in their inventory or upon sale to their end customers.  The Company maintains a reserve for unprocessed and estimated future price adjustment claims and returns as a refund liability. The reserve is recorded as a reduction to revenue in the same period that the related revenue is recorded and is calculated based on an analysis of historical claims and returns over a period of time to appropriately account for current pricing and business trends. Similarly, sales returns and allowances are recorded based on historical return rates, as a reduction to revenue with a corresponding reduction to cost of sales for the estimated cost of inventory that is expected to be returned.  These reserves were not material to the Consolidated Balance Sheets as of December 31, 2024 and 2023. \n​\nWarranty\n​\nStandard product warranty coverage, which provides assurance that our products will conform to the contractually agreed-upon specifications for a limited period from the date of shipment, is typically offered, while extended or separately priced warranty coverage is typically not offered. The warranty claim is generally limited to a credit equal to the purchase price or a promise to repair or replace the product for a specified period of time at no additional charge. We estimate our warranty liability based on historical experience, product history, and current trends, and record warranty expense in Cost of sales in the Consolidated Statements of Income.  Warranty liabilities and related warranty expense have not been and were not material in the accompanying Consolidated Financial Statements as of and for the years ended December 31, 2024, 2023 and 2022.\n61\n\n\nTable of Contents\n​\nShipping and Handling Costs\n​\nThe Company accounts for shipping and handling activities related to contracts with customers as a cost to fulfill our promise to transfer control of the related product, including any such costs incurred after the customer has obtained control of the goods.  Shipping and handling costs are generally charged to and paid by the majority of our customers as part of the contract.  For a nominal portion of our customer contracts, primarily for certain customers in the broadband communications market (a market primarily in the Communications Solutions segment), such costs are not separately charged to the customers.  Shipping and handling costs are included in Cost of sales in the accompanying Consolidated Statements of Income. \n​\nContract Assets and Contract Liabilities\n​\nThe Company records contract assets or contract liabilities depending on the timing of revenue recognition, billings and cash collections on a contract-by-contract basis.  Contract assets represent unbilled receivables, which generally arise when revenue recognized over time exceed amounts billed to customers.  Contract liabilities represent billings or advanced consideration received from customers in excess of revenue recognized to date.  As the Company’s performance obligations are typically less than \none year\n, these amounts are generally recorded as current in the accompanying Consolidated Balance Sheets within Prepaid expenses and other current assets or Other accrued expenses as of December 31, 2024 and 2023.  Contract assets and contract liabilities recorded in the Consolidated Balance Sheets were not material as of December 31, 2024 and 2023.\n​\nContract Costs\n​\nThe Company’s policy is to capitalize any incremental costs incurred to obtain a customer contract, only to the extent that such costs are explicitly chargeable to the customer and the benefit associated with the costs is expected to be longer than \none\n year.  Otherwise, such costs are expensed as incurred and recorded within Selling, general and administrative expenses in the accompanying Consolidated Statements of Income.  Incremental costs to fulfill customer orders, which are mostly comprised of pre-production and set-up costs, are generally capitalized to the extent such costs are contractually guaranteed to be reimbursed by the customer.  Otherwise, such costs are expensed as incurred.  Capitalized contract costs to obtain a contract or to fulfill a contract that are not accounted for under other existing accounting standards are recorded as either other current or long-term assets on the accompanying Consolidated Balance Sheets, depending on the timing of when the Company expects to recognize the expense, and are generally amortized consistent with the timing of when transfer of control of the related goods occurs.  Such capitalized contract costs were not material as of December 31, 2024 and 2023, and the related amortization expense was not material for the years ended December 31, 2024, 2023 and 2022.\n​\nRetirement Pension Plans\n​\nCosts for retirement pension plans include current service costs and amortization of prior service costs over the average working life expectancy.  It is the Company’s policy to fund current pension costs taking into consideration minimum funding requirements and maximum tax deductible limitations. The expense of retiree medical benefit programs is recognized during the employees’ service with the Company.  The recognition of expense and the related obligation for retirement pension plans and medical benefit programs is significantly impacted by estimates and assumptions made by management such as discount rates used to value certain liabilities, expected return on assets, mortality projections and future health care costs.  The Company uses third-party specialists such as actuaries and investment advisors to assist management in appropriately measuring the expense and obligations associated with pension and other postretirement plan benefits.\n​\nStock-Based Compensation\n​\nThe Company accounts for its stock option, restricted share and phantom stock awards based on the fair value of the award at the date of grant and recognizes compensation expense over the service period that the awards are expected to vest.  The Company recognizes expense for stock-based compensation with graded vesting on a straight-line basis over the vesting period of the entire award.  Stock-based compensation expense includes the estimated effects of forfeitures, which are adjusted over the requisite service period to the extent actual forfeitures differ or are expected to differ from such estimates.  Changes in estimated forfeitures are recognized in the period of change and impact the amount of expense to be recognized in future periods.  The expense incurred for stock-based compensation plans is included in Selling, general and administrative expenses in the accompanying Consolidated Statements of Income\n.\n62\n\n\nTable of Contents\n​\nIncome Taxes\n​\nDeferred income taxes are provided for revenue and expenses which are recognized in different periods for income tax and financial statement reporting purposes.  The Company recognizes the effects of changes in tax laws and rates on deferred income taxes in the period in which legislation is enacted.  Deferred income taxes are provided on undistributed earnings of foreign subsidiaries in the period in which the Company determines it no longer intends to permanently reinvest such earnings outside the United States.  As of December 31, 2024, the Company has not provided for deferred income taxes on undistributed foreign earnings of approximately $\n1,550\n related to certain geographies, as it is the Company’s intention to permanently reinvest such earnings outside the United States.  It is impracticable to calculate the amount of taxes that would be payable if these undistributed foreign earnings were to be repatriated.  In addition, the Company remains indefinitely reinvested with respect to its financial statement basis in excess of tax basis of its investments in foreign subsidiaries.  It is not practicable to determine the deferred tax liability with respect to such basis differences.  Deferred tax assets are regularly assessed for recoverability based on both historical and anticipated earnings levels and a valuation allowance is recorded when it is more likely than not that these amounts will not be recovered. \n​\nThe tax effects of an uncertain tax position taken or expected to be taken in income tax returns are recognized only if it is “more likely than not” to be sustained on examination by the taxing authorities, based on its technical merits as of the reporting date.  The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement.  The Company includes estimated interest and penalties related to unrecognized tax benefits in the provision for income taxes.\n \n​\nAs a result of the U.S. Tax Cuts and Jobs Act of 2017 (the “Tax Act”), the global intangible low-taxed income (“GILTI”) provision imposed a tax on certain earnings of foreign subsidiaries.  The Company \nelected\n an accounting policy to account for GILTI as a period cost.  The U.S. Treasury Department has issued final interpretive guidance relating to certain provisions of the Tax Act and proposed additional guidance related to the same provisions.  The Company will account for the impact of additional guidance in the period in which any new guidance is released, if appropriate.\n​\nForeign Currency Translation\n​\nThe financial position and results of operations of the Company’s foreign subsidiaries are measured, in most cases, using local currency as the functional currency. Assets and liabilities of such subsidiaries have been translated into U.S. dollars at current exchange rates and related revenues and expenses have been translated at weighted average exchange rates. The aggregate effect of translation adjustments is included as a component of Accumulated other comprehensive income (loss) within equity.  Transaction gains and losses related to operating assets and liabilities are included in Cost of sales in the accompanying Consolidated Statements of Income.\n​\nResearch and Development\n​\nCosts incurred in connection with the development of new products and applications are expensed as incurred.  Research and development expenses for the creation of new and improved products and processes were \n$\n453.0\n, $\n342.2\n, and $\n323.6\n for the years ended December 31, 2024, 2023 and 2022, respectively, and are included in Selling, general and administrative expenses in the accompanying Consolidated Statements of Income.\n​\nEnvironmental Obligations\n​\nThe Company recognizes the potential cost for environmental remediation activities when site assessments are made, remediation efforts are probable and related amounts can be reasonably estimated.  The Company assesses its environmental liabilities as necessary and appropriate through regular reviews of contractual commitments, site assessments, feasibility studies and formal remedial design and action plans.\n​\nNet Income per Common Share\n​\nBasic earnings per common share is computed by dividing net income attributable to Amphenol Corporation by the weighted average number of common shares outstanding.  Diluted earnings per common share is computed by dividing net income attributable to Amphenol Corporation by the weighted average number of outstanding common shares, \n63\n\n\nTable of Contents\nincluding dilutive common shares, the dilutive effect of which relates to stock options.  Diluted earnings per common share assumes the exercise of outstanding dilutive stock options using the treasury stock method.  Refer to Note 8 of the Notes to Consolidated Financial Statements for a reconciliation of the basic weighted average common shares outstanding to diluted weighted average common shares outstanding, used in the calculation of earnings per share (basic and diluted) for Amphenol Corporation. \n​\nTreasury Stock\n​\nTreasury stock purchases are recorded at cost.  Any issuances from treasury shares are recorded using the weighted average cost method.\n​\nNoncontrolling Interests \n​\nThe Company presents equity attributable to noncontrolling interests in consolidated entities as its own caption within equity, separate from the Company’s equity attributable to Amphenol Corporation stockholders\n, to the extent that such noncontrolling interests do not have redemption features that would otherwise result in such noncontrolling interests being considered redeemable, as discussed below.  \nNet income attributable to noncontrolling interests is classified below net income.  Earnings per share is determined after the impact of the noncontrolling interests’ share in net income of the Company.\n​\nRedeemable Noncontrolling Interests\n​\nThe Company reports noncontrolling interests in the mezzanine (“temporary equity”) section, between liabilities and equity, of the Consolidated Balance Sheets, to the extent that such noncontrolling interests have redemption features, such as a put option, that is redeemable at a fixed or determinable price on a fixed or determinable date at the option of the holder, or upon the occurrence of an event that is not solely within the control of the Company.  Due to its redeemable features that are outside the control of the Company, the redeemable noncontrolling interest is and will continue to be reported in the mezzanine section in the Consolidated Balance Sheets for as long as the put option is exercisable by the option holder.  The carrying amount of the redeemable noncontrolling interest, initially valued at fair value as part of acquisition accounting, is adjusted each reporting period to equal the greater of the (i) redemption value or (ii) carrying value of the noncontrolling interest, adjusted each reporting period for income or loss attributable to the noncontrolling interest and any distributions made to date.  The redemption value is generally calculated based on a multiple of earnings.  Any measurement adjustments, if applicable, to the redeemable noncontrolling interest are recognized in Additional paid-in capital in the Consolidated Balance Sheets.  Net income attributable to redeemable noncontrolling interests is classified below net income.  Earnings per share is determined after the impact of the redeemable noncontrolling interests’ share in net income of the Company.  Refer to Note 5 herein for further details related to the redeemable noncontrolling interests.\n​\nDerivative Financial Instruments\n​\nThe Company records each of its derivatives at fair value within the accompanying Consolidated Balance Sheets, and the respective accounting treatment for each derivative is based on its hedge designation.  We do not enter into derivative financial instruments for trading or speculative purposes\n, and our derivative financial instruments are with large financial institutions with strong credit ratings.  As of December 31, 2024, the Company does not have any significant concentration of exposure with any one counterparty.  \nRefer to Note 5 herein for further discussion of our derivative financial instruments.\n​\nCash Flow Hedges\n​\nFrom time to time, the Company utilizes derivative financial instruments in the management of interest rate and foreign currency exposures.  Such cash flow hedges include foreign exchange forward contracts to hedge exposure to foreign currency exchange rate fluctuations for certain transactions denominated in foreign currencies.  As of December 31, 2024 and 2023, there were \nno\n outstanding cash flow hedge contracts.  Gains and losses on derivatives designated as cash flow hedges resulting from changes in fair value are recorded in Accumulated other comprehensive income (loss), and subsequently reflected in Cost of sales in the Consolidated Statements of Income in a manner that matches the timing of the actual income or expense of such instruments with that of the hedged transaction.  Any ineffective portion of the change in the fair value of designated hedging instruments is included in the Consolidated Statements of Income.  \n64\n\n\nTable of Contents\nCash flows associated with cash flow hedges are classified and reported consistent with the cash flows associated with the underlying hedged item.\n​\nNet Investment Hedges\n​\nThe Company is exposed to variability in the U.S. dollar equivalent of the net investments in our foreign subsidiaries and, by extension, the U.S. dollar equivalent of any foreign earnings repatriated to the U.S. due to potential changes in foreign currency exchange rates.  As a result, from time to time, the Company enters into foreign exchange forward contracts to hedge the net investments in certain foreign subsidiaries from which we expect to repatriate earnings to the United States.  As of December 31, 2024 and 2023, there were \nno\n outstanding net investment hedge contracts, and, as such, the aggregate notional value of our outstanding net investment hedge contracts was \nnil\n.  For such instruments that are designated and qualify as a net investment hedge, the effective portion of the hedging instrument’s gain or loss is reported as a component of other comprehensive income (loss) and recorded in Accumulated other comprehensive income (loss) on the Consolidated Balance Sheets. The gain or loss will be subsequently reclassified into net earnings if the net investment in the hedged foreign operation is either sold or substantially liquidated.  Cash flows associated with net investment hedges are classified and reported within investing activities in the Consolidated Statements of Cash Flow.  Cash flows associated with net investment hedges were not material for the years ended December 31, 2024, 2023 and 2022.\n​\nNon-Designated Derivatives\n​\nThe Company enters into certain derivative financial instruments, from time to time, that are not designated as hedging instruments.  The Company enters into such foreign exchange forward contracts to reduce and minimize the impact of foreign currency fluctuations arising from the change in fair value of certain foreign currency denominated assets and liabilities.  These non-designated derivative instruments are adjusted to fair value each period through earnings, within the financial statement line item to which the derivative instrument relates.  For each of the three years ended December 31, 2024, such non-designated derivative instruments, including their impact to the Consolidated Statements of Income, were not material to the Company.  Cash flows associated with non-designated hedges are classified and reported consistent with the cash flows associated with the underlying hedged item.\n​\nRecent Accounting Pronouncements\n​\nIn November 2023, the Financial Accounting Standards Board (the “FASB”) issued Accounting Standards Update (“ASU”) No. 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n (“ASU 2023-07”), which amends ASC 280.  The intent of ASU 2023-07 is to improve the disclosures around a public entity’s reportable segments and address requests from investors for additional, more detailed information about a reportable segment’s expenses by requiring entities to disclose on an annual and interim basis: (i) significant segment expenses that are regularly provided to the Chief Operating Decision Maker (“CODM”) and included within each reported measure of segment profit or loss and (ii) an amount for other segment items by reportable segment and a description of its composition, which represents the difference between segment revenue less segment expenses disclosed under the significant expense principle and each reported measure of segment profit or loss.  Furthermore, entities will be required to: (i) provide all annual disclosures about a segment’s profit or loss and assets currently required under ASC 280 on an interim basis as well, (ii) clarify that an entity is not precluded from reporting additional measures of a segment’s profit or loss that are used by the CODM in assessing segment performance and deciding how to allocate resources, and (iii) disclose the title and position of the CODM and an explanation of how the CODM uses the reported measures of segment profit or loss in assessing segment performance and deciding how to allocate resources.  ASU 2023-07 is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted.  As part of this Annual Report, the Company adopted ASU 2023-07, which was applied retrospectively to all prior periods presented.  Refer to Note 13 herein for further details regarding this adoption.\n​\nIn December 2023, the FASB issued ASU No. 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n (“ASU 2023-09”).  The intent of ASU 2023-09 is to improve the disclosures around a company’s rate reconciliation information and certain types of income taxes companies are required to pay.  Specifically, these new disclosure requirements will provide more transparency regarding income taxes companies pay in the United States and other countries, along with more disclosure around a company’s rate reconciliation, among other new disclosure requirements, such that users of financial statements can get better information about how the operations, related tax risks, tax planning and operational opportunities of companies affect their effective tax rates and future cash flow \n65\n\n\nTable of Contents\nprospects.  ASU 2023-09 is effective for annual fiscal years beginning after December 15, 2024, with early adoption permitted for annual financial statements that have not yet been issued or made available for issuance.  The amendments under ASU 2023-09 should be applied on a prospective basis, although retrospective application is permitted.  The Company continues to evaluate ASU 2023-09 and its disclosure requirements, and will adopt this standard in our upcoming Annual Report on Form 10-K for the year ended December 31, 2025.\n​\nIn November 2024, the FASB issued ASU No. 2024-03, \nIncome Statement-Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n (“ASU 2024-03”).  The intent of ASU 2024-03 is to improve financial statement disclosures regarding information about certain costs and expenses.  Specifically, ASU 2024-03 requires the disaggregation of significant expenses within the income statement expense line items, including, but not limited to, purchases of inventory, employee compensation, depreciation, intangible asset amortization, and selling expenses, among others, as well as a qualitative description of the remaining amounts not separately disaggregated quantitatively.  ASU 2024-03 is effective for annual fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027, with early adoption permitted.  The amendments under ASU 2024-03 should be applied on a prospective basis, although retrospective application is permitted.  The Company is currently evaluating the potential impact of ASU 2024-03 on its consolidated financial statements and disclosures.\n​\n​\nNote 2—Inventories\n​\nThe components of Inventories are comprised of:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\n​\n2024\n    \n2023\nRaw materials and supplies \n​\n$\n \n1,102.5\n​\n$\n \n964.7\nWork in process \n​\n \n \n703.5\n​\n \n \n562.3\nFinished goods \n​\n \n \n739.7\n​\n \n \n640.1\n​\n​\n$\n \n2,545.7\n​\n$\n \n2,167.1\n​\n​\nNote 3—Property, Plant and Equipment, Net\n​\nThe components of Property, plant and equipment, net are summarized as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\n​\n2024\n    \n2023\nLand and improvements\n​\n$\n \n47.7\n​\n$\n \n33.9\nBuildings and improvements \n​\n \n \n543.0\n​\n \n \n483.9\nMachinery and equipment \n​\n \n \n3,042.8\n​\n \n \n2,628.4\nOffice equipment and other\n​\n \n \n542.6\n​\n \n \n430.3\n​\n​\n \n \n4,176.1\n​\n \n \n3,576.5\nAccumulated depreciation\n​\n \n (\n2,464.3\n)\n​\n \n (\n2,261.8\n)\n​\n​\n$\n \n1,711.8\n​\n$\n \n1,314.7\n​\nDepreciation expense for the years ended December 31, 2024, 2023 and 2022 was $\n390.6\n, $\n313.7\n and $\n306.1\n, respectively.\n​\n66\n\n\nTable of Contents\nNote 4—Debt\n​\nThe Company’s debt consists of the following:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\nDecember 31, 2023\n \n​\n \n​\n    \nCarrying\n    \nApproximate\n    \nCarrying\n    \nApproximate\n \n​\n  \nMaturity\n \n​\nAmount\n \n​\nFair Value\n \n(1)\n \n​\nAmount\n \n​\nFair Value\n \n(1)\n​\nRevolving Credit Facility\n \nMarch 2029\n    \n$\n \n—\n​\n$\n \n—\n​\n$\n \n—\n​\n$\n \n—\n​\nU.S. Commercial Paper Program (less unamortized discount of \nnil\n at December 31, 2024 and 2023)\n \nMarch 2029\n    \n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\nEuro Commercial Paper Program\n \nMarch 2029\n    \n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\nTerm Loan Credit Facility\n \nApril 2024\n    \n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\n3.20\n% Senior Notes (less unamortized discount of \nnil\n at December 31, 2023)\n \nApril 2024\n    \n​\n \n—\n​\n​\n \n—\n​\n​\n \n350.0\n​\n​\n \n348.4\n​\n2.050\n% Senior Notes (less unamortized discount of \nnil\n and $\n0.2\n at December 31, 2024 and 2023, respectively)\n \nMarch 2025\n    \n​\n \n400.0\n​\n​\n \n398.0\n​\n​\n \n399.8\n​\n​\n \n386.8\n​\n4.750\n% Senior Notes (less unamortized discount of $\n0.5\n and $\n0.9\n at December 31, 2024 and 2023, respectively)\n​\nMarch 2026\n​\n​\n \n349.5\n​\n​\n \n350.0\n​\n​\n \n349.1\n​\n​\n \n350.6\n​\n0.750\n% Euro Senior Notes (less unamortized discount of $\n0.5\n and $\n0.9\n at December 31, 2024 and 2023, respectively)\n \nMay 2026\n    \n​\n \n518.6\n​\n​\n \n505.8\n​\n​\n \n551.7\n​\n​\n \n523.4\n​\n5.050\n% Senior Notes (plus unamortized premium of $\n2.2\n at December 31, 2024)\n​\nApril 2027\n​\n​\n \n702.2\n​\n​\n \n706.1\n​\n​\n \n—\n​\n​\n \n—\n​\n2.000\n% Euro Senior Notes (less unamortized discount of $\n1.1\n and $\n1.3\n at December 31, 2024 and 2023, respectively)\n \nOctober 2028\n    \n​\n \n518.2\n​\n​\n \n505.9\n​\n​\n \n551.4\n​\n​\n \n531.4\n​\n5.050\n% Senior Notes (less unamortized discount of $\n0.4\n at December 31, 2024)\n​\nApril 2029\n​\n​\n \n449.6\n​\n​\n \n452.4\n​\n​\n \n—\n​\n​\n \n—\n​\n4.350\n% Senior Notes (less unamortized discount of $\n0.2\n and $\n0.2\n at December 31, 2024 and 2023, respectively)\n \nJune 2029\n    \n​\n \n499.8\n​\n​\n \n489.1\n​\n​\n \n499.8\n​\n​\n \n497.2\n​\n2.800\n% Senior Notes (less unamortized discount of $\n0.4\n and $\n0.4\n at December 31, 2024 and 2023, respectively)\n \nFebruary 2030\n    \n​\n \n899.6\n​\n​\n \n814.1\n​\n​\n \n899.6\n​\n​\n \n817.6\n​\n2.200\n% Senior Notes (less unamortized discount of $\n1.8\n and $\n2.1\n at December 31, 2024 and 2023, respectively)\n \nSeptember 2031\n    \n​\n \n748.2\n​\n​\n \n624.9\n​\n​\n \n747.9\n​\n​\n \n629.9\n​\n5.250\n% Senior Notes (less unamortized discount of $\n0.6\n at December 31, 2024)\n​\nApril 2034\n​\n​\n \n599.4\n​\n​\n \n601.0\n​\n​\n \n—\n​\n​\n \n—\n​\n5.000\n% Senior Notes (less unamortized discount of $\n3.7\n at December 31, 2024)\n​\nJanuary 2035\n​\n​\n \n746.3\n​\n​\n \n731.3\n​\n​\n \n—\n​\n​\n \n—\n​\n5.375\n% Senior Notes (less unamortized discount of $\n7.8\n at December 31, 2024)\n​\nNovember 2054\n​\n​\n \n492.2\n​\n​\n \n476.1\n​\n​\n \n—\n​\n​\n \n—\n​\nOther debt\n \n2025-2031\n    \n​\n \n4.3\n​\n​\n \n4.3\n​\n \n \n9.5\n​\n​\n \n9.5\n​\nLess: unamortized deferred debt issuance costs\n \n​\n    \n​\n (\n41.8\n)\n​\n​\n —\n​\n​\n (\n21.5\n)\n​\n​\n —\n​\nTotal debt\n \n​\n    \n​\n \n6,886.1\n​\n​\n \n6,659.0\n​\n \n \n4,337.3\n​\n \n \n4,094.8\n​\nLess: current portion \n \n​\n    \n​\n \n401.7\n​\n \n \n399.7\n​\n \n \n353.8\n​\n \n \n352.2\n​\nTotal long-term debt \n \n​\n    \n$\n \n6,484.4\n​\n$\n \n6,259.3\n​\n$\n \n3,983.5\n​\n$\n \n3,742.6\n​\n(1)\nThe fair value of each series of the Company’s Senior Notes is based on recent bid prices in an active market and is therefore classified as Level 1 in the fair value hierarchy (Note 5).\n​\nRevolving Credit Facility\n​\nOn March 21, 2024, the Company entered into a third amended and restated credit agreement, which amended and restated its $\n2,500.0\n unsecured revolving credit facility, increasing the lenders’ aggregate unsecured revolving commitments under the facility by $\n500.0\n to $\n3,000.0\n (the “Revolving Credit Facility”).  The Revolving Credit Facility matures in March 2029 and gives the Company and certain of its subsidiaries the ability to borrow, in various currencies, at a spread that varies, based on the Company’s debt rating, over certain currency-specific benchmark rates, which benchmark rates, in the case of U.S. dollar borrowings, are either the base rate or the adjusted term Secured Overnight \n67\n\n\nTable of Contents\nFinancing Rate (“SOFR”).  The Revolving Credit Facility was undrawn on the date it was amended and restated.  The Company may utilize the Revolving Credit Facility for general corporate purposes.  \nAs of December 31, 2024 and 2023, there were \nno\n outstanding borrowings under the revolving credit facility then in effect.  The carrying value of any borrowings under the Revolving Credit Facility would approximate their fair value, primarily due to their market interest rates, and would be classified as Level 2 in the fair value hierarchy (Note 5).  Any outstanding borrowings under the Revolving Credit Facility are classified as long-term debt in the accompanying Consolidated Balance Sheets.  The Revolving Credit Facility requires payment of certain annual agency and commitment fees and requires that the Company satisfy certain financial covenants.\n​\nTerm Loan Credit Facility\n​\nOn April 19, 2022, the Company entered into a \ntwo-year\n, $\n750.0\n unsecured delayed draw term loan credit agreement (the “Term Loan”).  The Term Loan matured on \nApril 19, 2024\n \nwithout\n the Company drawing upon it throughout its term.\n​\nCommercial Paper Programs\n​\nThe Company has a commercial paper program (the “U.S. Commercial Paper Program”) pursuant to which the Company may issue short-term unsecured commercial paper notes (the “USCP Notes” or “U.S. Commercial Paper”) in one or more private placements in the United States.  The maturities of the USCP Notes vary but may not exceed \n397 days\n from the date of issue.  The USCP Notes are sold under customary terms in the commercial paper market and may be issued at par or a discount therefrom, and bear varying interest rates on a fixed or floating basis.  On March 21, 2024, in conjunction with the increase in the capacity of the Revolving Credit Facility, the Company increased the borrowings available under its U.S. Commercial Paper Program by \n$\n500.0\n.  As of December 31, 2024, the maximum aggregate principal amount outstanding of USCP Notes at any time is \n$\n3,000.0\n.  The Company utilizes borrowings under the U.S. Commercial Paper Program for general corporate purposes, which, in recent years, have included fully or partially funding acquisitions, as well as repaying certain outstanding senior notes.  The Company borrowed under the U.S. Commercial Paper Program throughout much of 2024 and 2023, the proceeds of which were used for general corporate purposes, including, but not limited to, partially funding the acquisition of Carlisle Interconnect Technologies (“CIT”) in May 2024, as discussed further in Note 11 herein.  Before the end of the fourth quarter of 2024 and 2023, the Company repaid all of its USCP Notes then outstanding.  As of December 31, 2024 and 2023, there were \nno\n USCP Notes outstanding. \n​\nThe Company and \none\n of its wholly owned European subsidiaries (the “Euro Issuer”) also have a commercial paper program (the “Euro Commercial Paper Program” and, together with the U.S. Commercial Paper Program, the “Commercial Paper Programs”), pursuant to which the Euro Issuer may issue short-term unsecured commercial paper notes (the “ECP Notes” and, together with the USCP Notes, the “Commercial Paper”), which are guaranteed by the Company and are to be issued outside of the United States.  The maturities of the ECP Notes will vary but may not exceed \n183 days\n from the date of issue.  The ECP Notes are sold under customary terms in the commercial paper market and may be issued at par or a discount therefrom or a premium thereto and bear varying interest rates on a fixed or floating basis.  \nThe ECP Notes may be issued in Euros, Sterling, U.S. dollars or other currencies.  The maximum aggregate principal amount outstanding of ECP Notes at any time is \n$\n2,000.0\n.  The Company utilizes borrowings under the Euro Commercial Paper Program for general corporate purposes, which may include, for example, fully or partially funding acquisitions, as was the case in the first quarter of 2023 when the Company used borrowings under its Euro Commercial Paper Program, along with cash on hand, to fund an acquisition.  These borrowings were repaid in their entirety by the end of the first quarter of 2023.  The Company did \nno\nt borrow under the Euro Commercial Paper Program during 2024.  As of December 31, 2024 and 2023, there were \nno\n ECP Notes outstanding.\n​\nAmounts available under the Commercial Paper Programs may be borrowed, repaid and re-borrowed from time to time.  In conjunction with the Revolving Credit Facility, as of December 31, 2024, the authorization from the Board limits the maximum aggregate principal amount outstanding of USCP Notes, ECP Notes, and any other commercial paper or similar programs, along with outstanding amounts under the Revolving Credit Facility, at any time to \n$\n3,000.0\n.  The Commercial Paper Programs are rated A-2 by Standard & Poor’s and P-2 by Moody’s and, based on the Board’s authorization described above, are currently backstopped by the Revolving Credit Facility, as amounts undrawn under the Revolving Credit Facility are available to repay Commercial Paper, if necessary.  Net proceeds of the issuances of Commercial Paper are expected to be used for general corporate purposes.  \nAny outstanding Commercial Paper is classified as long-term debt in the accompanying Consolidated Balance Sheets since the Company has the intent and ability to refinance the Commercial Paper on a long-term basis using the Company’s Revolving Credit Facility.  The \n68\n\n\nTable of Contents\ncarrying value of Commercial Paper approximates its fair value, primarily due to its market interest rates, and is classified as Level 2 in the fair value hierarchy (Note 5).  \n​\nU.S. Senior Notes\n​\nOn April 1, 2024, the Company used cash on hand to repay the $\n350.0\n aggregate principal amount of unsecured \n3.20\n% Senior Notes due \nApril 1, 2024\n upon maturity.\n​\nOn April 5, 2024, the Company issued \nthree\n series of unsecured senior notes (collectively, the “April Senior Notes”):  (i) \n$\n450.0\n aggregate principal amount of unsecured \n5.050\n% Senior Notes due \nApril 5, 2027\n at \n99.887\n% of face value (the “Original 2027 Senior Notes”), (ii) $\n450.0\n aggregate principal amount of unsecured \n5.050\n% Senior Notes due \nApril 5, 2029\n at \n99.900\n% of face value (the “2029 Senior Notes”) and (iii) $\n600.0\n aggregate principal amount of unsecured \n5.250\n% Senior Notes due \nApril 5, 2034\n at \n99.900\n%\n of face value (the “2034 Senior Notes”). The April Senior Notes are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Euro Notes.  Interest on the April Senior Notes is payable semiannually on April 5 and October 5 of each year, which commenced on October 5, 2024.  Prior to March 5, 2027, the Company may redeem, from time to time, some or all of the Original 2027 Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  Prior to March 5, 2029, the Company may redeem, from time to time, some or all of the 2029 Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  Prior to January 5, 2034, the Company may redeem, from time to time, some or all of the 2034 Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  On or after such dates, the Company may redeem, from time to time, some or all of the respective series of the April Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption.  The Company used net proceeds from the April Senior Notes, together with a combination of cash on hand and borrowings under the U.S. Commercial Paper Program, to fund the cash consideration for the CIT acquisition in May 2024, along with the fees and expenses related thereto.  During the year ended December 31, 2024, the Company incurred \n$\n11.7\n of debt financing costs associated with the issuance of the April Senior Notes.\n​\nOn October 31, 2024, the Company issued \nthree\n series of unsecured senior notes (collectively, the “October Senior Notes”):  (i) \n$\n250.0\n aggregate principal amount of unsecured \n5.050\n% Senior Notes due \nApril 5, 2027\n at \n101.107\n% of face value (the “Additional 2027 Senior Notes”), which constituted a further issuance of the Company’s Original 2027 Senior Notes issued in April 2024, thus forming a single series with, and having the same terms (other than the issue date, issue price and the first interest payment date) as, the Original 2027 Senior Notes, and thus having a total aggregate principal amount of $\n700.0\n of unsecured \n5.050\n% Senior Notes due \nApril 5, 2027\n outstanding (the Original 2027 Senior Notes, together with the Additional 2027 Senior Notes collectively referred to as the “2027 Senior Notes”), (ii) $\n750.0\n aggregate principal amount of unsecured \n5.000\n% Senior Notes due \nJanuary 15, 2035\n at \n99.502\n% of face value (the “2035 Senior Notes”) and (iii) $\n500.0\n aggregate principal amount of unsecured \n5.375\n% Senior Notes due \nNovember 15, 2054\n at \n98.429\n%\n of face value (the “2054 Senior Notes”).  The October Senior Notes are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Euro Notes.  Consistent with the Original 2027 Senior Notes, interest on the Additional 2027 Senior Notes is payable semiannually on April 5 and October 5 of each year, commencing on April 5, 2025, commensurate with the timing of the remaining interest payments of the Original 2027 Senior Notes.  Interest on the 2035 Senior Notes is payable semiannually on January 15 and July 15 of each year, commencing on January 15, 2025.  Interest on the 2054 Senior Notes is payable semiannually on May 15 and November 15 of each year, commencing on May 15, 2025.  Prior to March 5, 2027, the Company may redeem, from time to time, some or all of the 2027 Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  Prior to October 15, 2034, the Company may redeem, from time to time, some or all of the 2035 Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  Prior to May 15, 2054, the Company may redeem, from time to time, some or all of the 2054 Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  On or after such dates, the Company may redeem, from time to time, some or all of the respective series of the October Senior Notes at a redemption price equal to \n100\n%\n of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption.  On January 31, 2025, the Company used the \n69\n\n\nTable of Contents\nnet proceeds from the October Senior Notes, together with borrowings under the U.S. Commercial Paper Program and cash on hand, to fund the cash consideration for the Company’s acquisition of CommScope’s Mobile Networks Business, along with the fees and expenses related thereto.  During the year ended December 31, 2024, the Company incurred \n$\n13.7\n of debt financing costs associated with the issuance of the October Senior Notes.\n​\nOn March 30, 2023, the Company issued $\n350.0\n aggregate principal amount of unsecured \n4.750\n% Senior Notes due \nMarch 30, 2026\n at \n99.658\n%\n of face value (the “2026 Senior Notes”).  The 2026 Senior Notes are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Euro Notes.  Interest on the 2026 Senior Notes is payable semiannually on March 30 and September 30 of each year.  The Company may redeem, from time to time at its option, some or all of the 2026 Senior Notes at a redemption price equal to \n100\n% of the principal amount thereof, plus accrued and unpaid interest, if any, to, but not including, the date of redemption, plus a make-whole premium.  The Company used the net proceeds from the 2026 Senior Notes to repay certain outstanding borrowings under the U.S. Commercial Paper Program.\n​\nAll of the Company’s outstanding senior notes in the United States (the “U.S. Senior Notes”) are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Euro Notes.  Interest on each series of U.S. Senior Notes is payable semiannually.  The Company may, at its option, redeem some or all of any series of U.S. Senior Notes at any time, subject to certain terms and conditions, which include paying \n100\n% of the principal amount, plus accrued and unpaid interest, if any, to the date of redemption, and, with certain exceptions, a make-whole premium.\n​\nEuro Senior Notes\n​\nThe Euro Issuer has \ntwo\n outstanding unsecured senior notes issued in Europe.  The Euro Issuer has \n€\n500.0\n (approximately $\n545.4\n at date of issuance) aggregate principal amount of unsecured \n0.750\n% Senior Notes due \nMay 4, 2026\n, which were issued in May 2020 at \n99.563\n% of face value (the “2026 Euro Notes” or the “\n0.750\n%\n Euro Senior Notes”).  The net proceeds of the 2026 Euro Notes were used to repay amounts outstanding under the then existing revolving credit facility.  The Euro Issuer also has\n €\n500.0\n (approximately $\n574.6\n at date of issuance) aggregate principal amount of unsecured \n2.000\n% Senior Notes due \nOctober 8, 2028\n, which were issued in October 2018 at \n99.498\n% of face value (the “2028 Euro Notes” or the “\n2.000\n% Euro Senior Notes”, \ntogether with the 2026 Euro Notes, the “Euro Notes”, and the Euro Notes, together with the U.S. Senior Notes, the “Senior Notes”).  The net proceeds of the 2028 Euro Notes were used to repay a portion of the outstanding amounts under our Commercial Paper Programs, with the remainder of the net proceeds being used for general corporate purposes.  The Euro Notes are unsecured and rank equally in right of payment with all of the Euro Issuer’s senior unsecured and unsubordinated indebtedness and are fully and unconditionally guaranteed on a senior unsecured basis by the Company.  Interest on each series of Euro Notes is payable annually on May 4 and October 8 of each year, respectively.  The Company may, at its option, redeem some or all of \neither\n series of Euro Notes at any time, subject to certain terms and conditions, which include paying \n100\n% of the principal amount, plus accrued and unpaid interest, if any, to, but not including, the date of redemption, and, with certain exceptions, a make-whole premium.\n​\nThe fair value of each series of Senior Notes is based on recent bid prices in an active market and is therefore classified as Level 1 in the fair value hierarchy (Note 5).  The Senior Notes impose certain obligations on the Company and prohibit various actions by the Company unless it satisfies certain financial requirements.\n​\nThe maturity of the Company’s debt (exclusive of unamortized deferred debt issuance costs as of December 31, 2024) over each of the next five years ending December 31 and thereafter, is as follows:\n​\n​\n​\n​\n​\n​\n2025\n​\n$\n \n401.9\n \n2026\n​\n \n \n869.4\n​\n2027\n​\n \n \n702.8\n​\n2028\n​\n \n \n518.5\n​\n2029\n​\n \n \n949.5\n​\nThereafter \n​\n \n \n3,485.8\n​\n​\n​\n$\n \n6,927.9\n​\n​\nAs of December 31, 2024, the Company had approximately $\n122.2\n of uncommitted standby letter of credit facilities, of which $\n47.0\n were issued.\n70\n\n\nTable of Contents\n​\nNote 5—Fair Value Measurements\n​\nFair value is determined based on the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants. These requirements establish market or observable inputs as the preferred source of values. Assumptions based on hypothetical transactions are used in the absence of market inputs. The Company does not have any non-financial instruments accounted for at fair value on a recurring basis.\n​\nThe valuation techniques required are based upon observable and unobservable inputs. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect the Company’s market assumptions. These two types of inputs create the following fair value hierarchy:\n​\nLevel 1         Quoted prices for identical instruments in active markets.\n​\nLevel 2         Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable.\n​\nLevel 3         Significant inputs to the valuation model are unobservable.\n​\nThe Company believes that the assets and liabilities currently subject to such standards with fair value disclosure requirements are primarily (i) debt instruments, (ii) pension plan assets, and (iii) assets acquired and liabilities and noncontrolling interests assumed as part of acquisition accounting, which are discussed in Note 4, Note 9 and Note 11, respectively, herein, along with short- and long-term investments and derivative instruments, discussed below.  Substantially all of the Company’s short- and long-term investments consist of certificates of deposit, which are considered as Level 2 in the fair value hierarchy.  The Company’s existing long-term investments have original maturities of approximately \nthree years\n.  Long-term investments are recorded in Other long-term assets in the accompanying Consolidated Balance Sheets.  The carrying amounts of these short- and long-term instruments, the vast majority of which are in non-U.S. bank accounts, approximate their respective fair values.  The Company’s derivative instruments primarily consist of foreign exchange forward contracts, which are valued using bank quotations based on market observable inputs, such as forward and spot rates, and are therefore classified as Level 2 in the fair value hierarchy.  The impact of the credit risk related to these derivative financial assets is immaterial.  \n​\n71\n\n\nTable of Contents\nThe Company reviews the fair value hierarchy classifications on a quarterly basis and determines the appropriate classification of such assets and liabilities subject to the fair value hierarchy standards based on, among other things, the ability to observe valuation inputs.  The fair values of the Company’s financial and non-financial assets and liabilities subject to such standards at December 31, 2024 and December 31, 2023 are as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFair Value Measurements\n \n​\n​\n​\n​\n    \nQuoted Prices in\n    \nSignificant\n    \nSignificant\n \n​\n​\n​\n​\n​\nActive Markets\n​\nObservable\n​\nUnobservable\n \n​\n​\n​\n​\n​\nfor Identical\n​\nInputs\n​\nInputs\n \n2024\n​\nTotal\n​\nAssets (Level 1)\n​\n(Level 2)\n​\n(Level 3)\n \nShort-term investments\n​\n$\n \n18.4\n​\n$\n \n—\n​\n$\n \n18.4\n​\n$\n \n—\n​\nLong-term investments\n​\n​\n \n0.3\n​\n​\n \n—\n​\n​\n \n0.3\n​\n​\n \n—\n​\nForward contracts \n​\n​\n (\n1.1\n)\n​\n​\n \n—\n​\n​\n (\n1.1\n)\n​\n​\n \n—\n​\nRedeemable noncontrolling interests\n​\n​\n (\n8.7\n)\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n (\n8.7\n)\n​\nTotal \n​\n$\n \n8.9\n​\n$\n \n—\n​\n$\n \n17.6\n​\n$\n (\n8.7\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \nShort-term investments\n​\n$\n \n185.2\n​\n$\n \n—\n​\n$\n \n185.2\n​\n$\n \n—\n​\nLong-term investments\n​\n​\n \n0.4\n​\n​\n \n—\n​\n​\n \n0.4\n​\n​\n \n—\n​\nForward contracts \n​\n​\n (\n0.5\n)\n​\n​\n \n—\n​\n​\n (\n0.5\n)\n​\n​\n \n—\n​\nRedeemable noncontrolling interests\n​\n​\n (\n30.7\n)\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n (\n30.7\n)\n​\nTotal \n​\n$\n \n154.4\n​\n$\n \n—\n​\n$\n \n185.1\n​\n$\n (\n30.7\n)\n​\n​\nThe Company utilizes foreign exchange forward contracts, hedging instruments accounted for as cash flow hedges, in the management of foreign currency exposures.  In addition, the Company also enters into foreign exchange forward contracts, accounted for as net investment hedges, to hedge our exposure to variability in the U.S. dollar equivalent of the net investments in certain foreign subsidiaries.  As of December 31, 2024 and 2023, the Company had \nno\n outstanding foreign exchange forward contracts accounted for as either net investment hedges or \ncash flow\n \nhedges\n.  As of December 31, 2024 and 2023, the fair value of such foreign exchange forward contracts in the table above consisted of various outstanding foreign exchange forward contracts that are not designated as hedging instruments.  The fair value of the Company’s forward contracts are recorded within Prepaid expenses and other current assets, Other long-term assets, Other accrued expenses and Other long-term liabilities in the accompanying Consolidated Balance Sheets, depending on their value and remaining contractual period.\n​\nCertain acquisitions may result in noncontrolling interest holders who, in certain cases, are entitled to a put option, giving them the ability to put some or all of their redeemable interest in the shares of the acquiree to the Company.  Specifically, if exercised by the noncontrolling interest holder, Amphenol would be required to purchase some or all of the option holder’s redeemable interest, at a redemption price during specified time period(s) stipulated in the respective acquisition agreement.  The redeemable noncontrolling interests recorded on the accompanying Consolidated Balance Sheets relate to recent acquisitions, which, based on the terms of the respective acquisition agreements, will remain in temporary equity until the applicable put option is either fully exercised or expires.  In 2024, in accordance with the terms of the agreement, the noncontrolling option holders of \none\n of our acquisitions exercised their put option, requiring the Company to acquire its entire redeemable noncontrolling interests then outstanding.  The redemption value of the redeemable noncontrolling interests is generally calculated using Level 3 unobservable inputs based on a multiple of earnings, which, for the redeemable noncontrolling interests currently outstanding, approximate fair value.  As such, the redemption value is classified as Level 3 in the fair value hierarchy and is recorded as Redeemable noncontrolling interests on the Consolidated Balance Sheets as of December 31, 2024 and 2023.  A rollforward of the Redeemable noncontrolling interests for the years ended December 31, 2024, 2023 and 2022 is included in the accompanying Consolidated Statements of Changes in Equity. \n​\nWith the exception of the fair value of the assets acquired and liabilities assumed in connection with acquisition accounting, the Company does not have any other significant financial or non-financial assets and liabilities that are measured at fair value on a non-recurring basis.  For further discussion and related policies regarding the Company’s short- and long-term investments, derivative financial instruments, and redeemable noncontrolling interests, refer to Note 1 herein.\n​\n72\n\n\nTable of Contents\nNote 6—Income Taxes\n​\nThe components of income before income taxes and the provision for income taxes are as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n \n​\n    \n2024\n    \n2023\n    \n2022\n \nIncome before income taxes:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States \n​\n$\n \n462.0\n​\n$\n \n521.9\n​\n$\n \n442.3\n​\nForeign \n​\n \n \n2,549.9\n​\n \n \n1,932.9\n​\n \n \n2,025.1\n​\n​\n​\n$\n \n3,011.9\n​\n$\n \n2,454.8\n​\n$\n \n2,467.4\n​\nCurrent tax provision (benefit):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States \n​\n$\n \n19.0\n​\n$\n \n55.1\n​\n$\n \n97.7\n​\nForeign \n​\n \n \n634.1\n​\n \n \n513.0\n​\n \n \n457.6\n​\n​\n​\n​\n \n653.1\n​\n​\n \n568.1\n​\n​\n \n555.3\n​\nDeferred tax provision (benefit):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States \n​\n​\n (\n56.2\n)\n​\n​\n (\n10.0\n)\n​\n​\n (\n31.5\n)\n​\nForeign \n​\n \n (\n26.6\n)\n​\n \n (\n48.8\n)\n​\n​\n \n26.8\n​\n​\n​\n \n (\n82.8\n)\n​\n \n (\n58.8\n)\n​\n \n (\n4.7\n)\n​\nTotal provision for income taxes \n​\n$\n \n570.3\n​\n$\n \n509.3\n​\n$\n \n550.6\n​\n​\nThe United States federal government enacted the Tax Cuts and Jobs Act (“Tax Act”) in December 2017.  \nAs a result, in 2017,\n the Company recorded a transition tax (“Transition Tax”) related to the deemed repatriation of the accumulated unremitted earnings and profits of the Company’s foreign subsidiaries.  \nIn the second quarter of 2024, the Company paid its seventh annual installment of the Transition Tax, net of applicable tax credits and deductions, and will pay the balance of the Transition Tax, net of applicable tax credits and deductions, in 2025, as permitted under the Tax Act.  The current and long-term portions of the Transition Tax are recorded in Accrued income taxes and Other long-term liabilities, respectively, on the Consolidated Balance Sheets as of December 31, 2024 and 2023.  In addition, as a result of the Tax Act, the Company also recorded a tax \ncharge, in 2017, related to changes in the Company’s permanent reinvestment assertion, due to our intention to repatriate prior accumulated unremitted earnings from certain foreign subsidiaries over time.  We will pay such taxes when those respective earnings are repatriated.\n​\nAt December 31, 2024, the Company had $\n246.8\n of foreign tax loss carryforwards, $\n151.9\n of U.S. state tax loss carryforwards and $\n35.7\n of U.S. federal tax loss carryforwards, of which $\n40.2\n, $\n151.9\n and $\n1.6\n, respectively, will expire at various dates through 2044 and the balance can be carried forward indefinitely.  At December 31, 2024, the Company had $\n19.5\n of U.S. state tax credit carryforwards and $\n16.4\n of U.S. federal tax credit carryforwards, of which $\n12.1\n and $\n16.4\n, respectively, will expire at various dates through 2044 and the balance can be carried forward indefinitely.\n​\nA valuation allowance of $\n73.6\n and $\n46.6\n at December 31, 2024 and 2023, respectively, has been recorded which relates primarily to the U.S. state and foreign net operating loss carryforwards and U.S. federal and state tax credit carryforwards.  The valuation allowance for deferred tax assets increased by \n$\n27.0\n in 2024, which was primarily driven by U.S. state and foreign net operating loss carryforwards and U.S. federal tax credit carryforwards.  The valuation allowance for deferred tax assets increased by \n$\n4.4\n in 2023, which was primarily driven by U.S. state and foreign net operating loss carryforwards.\n​\n73\n\n\nTable of Contents\nDifferences between the U.S. statutory federal tax rate and the Company’s effective income tax rate are analyzed below:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n \n​\n​\n2024\n  \n2023\n  \n2022\n \nU.S. statutory federal tax rate \n​\n \n21.0\n%\n \n21.0\n%\n \n21.0\n%\nState and local taxes, net\n​\n \n0.6\n​\n \n0.6\n​\n \n0.6\n​\nForeign earnings and dividends taxed at different rates \n​\n \n1.9\n​\n \n2.2\n​\n \n2.3\n​\nU.S. tax on foreign income\n​\n (\n0.1\n)\n​\n \n—\n​\n \n0.5\n​\nExcess tax benefits related to stock-based compensation\n​\n (\n4.7\n)\n​\n (\n3.4\n)\n​\n (\n2.3\n)\n​\nOther, net\n​\n \n0.2\n​\n \n0.3\n​\n \n0.2\n​\nEffective tax rate \n​\n \n18.9\n%\n \n20.7\n%\n \n22.3\n%\n​\nFor the years ended December 31, 2024, 2023 and 2022, stock option exercise activity had the impact of decreasing our Provision for income taxes by $\n142.6\n, $\n82.4\n and $\n56.0\n, respectively, and decreasing our effective tax rate by the basis points in the table above.  Total acquisition-related expenses, as discussed in further detail in Note 11 herein, had the aggregate impact of increasing our effective tax rate by approximately \n30\n basis points, \n20\n basis points and \n10\n basis points for the years ended December 31, 2024, 2023 and 2022, respectively.  For the year ended December 31, 2024, a discrete tax benefit of \n$\n18.6\n, related to the settlement of tax audits and associated lapses of statutes of limitation, along with a difference in a non-U.S. tax filing position, had the effect of decreasing our effective tax rate by approximately \n60\n basis points, and, for the year ended December 31, 2023, the gain associated with the bargain purchase acquisition that closed in the second quarter of 2023, as discussed in Note 11 herein, had the effect of decreasing our effective tax rate by approximately \n10\n basis points.\n​\nThe components of the Company’s deferred tax assets and liabilities are comprised of the following:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\n   \n2024\n   \n2023\nDeferred tax assets relating to:\n​\n​\n​\n​\n​\n​\nAccrued liabilities and reserves \n​\n$\n \n115.7\n​\n$\n \n78.0\nOperating lease liabilities\n​\n​\n \n86.2\n​\n​\n \n70.7\nOperating loss, interest, and tax credit carryforwards \n​\n \n \n114.8\n​\n \n \n76.9\nPensions\n​\n \n \n10.2\n​\n \n \n16.7\nInventories \n​\n \n \n112.0\n​\n \n \n86.0\nEmployee benefits \n​\n \n \n49.5\n​\n \n \n45.1\nTotal deferred tax assets \n​\n​\n \n488.4\n​\n​\n \n373.4\nValuation allowance \n​\n​\n (\n73.6\n)\n​\n​\n (\n46.6\n)\nTotal deferred tax assets, net of valuation allowances \n​\n​\n \n414.8\n​\n​\n \n326.8\n​\n​\n​\n​\n​\n​\n​\nDeferred tax liabilities relating to:\n​\n​\n​\n​\n​\n​\nGoodwill \n​\n​\n \n307.2\n​\n​\n \n270.5\nDepreciation and amortization\n​\n \n \n144.1\n​\n \n \n130.9\nOperating lease right-of-use assets\n​\n​\n \n86.2\n​\n​\n \n70.7\nUnremitted foreign earnings \n​\n​\n \n125.3\n​\n \n \n123.2\nTotal deferred tax liabilities \n​\n​\n \n662.8\n​\n​\n \n595.3\n​\n​\n​\n​\n​\n​\n​\nNet deferred tax liability \n​\n$\n \n248.0\n​\n$\n \n268.5\n​\n​\n​\n​\n​\n​\n​\nClassification of deferred tax assets and liabilities, as reflected on the Consolidated Balance Sheets:\n​\n​\n​\n​\n​\n​\nOther long-term assets\n​\n$\n \n128.7\n​\n$\n \n98.5\nDeferred income taxes\n​\n \n \n376.7\n​\n \n \n367.0\nNet deferred tax liability, long-term\n​\n$\n \n248.0\n​\n$\n \n268.5\n​\n​\n74\n\n\nTable of Contents\nA tabular reconciliation of the gross amounts of unrecognized tax benefits excluding interest and penalties at the beginning and end of the year for 2024, 2023 and 2022 is shown below. \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\n \nUnrecognized tax benefits as of January 1 \n​\n$\n \n174.2\n​\n$\n \n164.1\n​\n$\n \n147.7\n​\nGross increases for tax positions in prior periods \n​\n \n \n15.2\n​\n \n \n3.8\n​\n \n \n12.8\n​\nGross increases for tax positions in current period \n​\n \n \n21.1\n​\n \n \n8.4\n​\n \n \n4.9\n​\nSettlements \n​\n \n (\n6.1\n)\n​\n \n (\n1.0\n)\n​\n \n (\n0.4\n)\n​\nLapse of statutes of limitations\n​\n \n (\n27.6\n)\n​\n \n (\n1.1\n)\n​\n \n (\n0.9\n)\n​\nUnrecognized tax benefits as of December 31 \n​\n$\n \n176.8\n​\n$\n \n174.2\n​\n$\n \n164.1\n​\n​\nThe Company includes estimated interest and penalties related to unrecognized tax benefits in the provision for income taxes.  During the years ended December 31, 2024, 2023 and 2022, the provision for income taxes included a net (benefit) expense of \n($\n4.2\n), $\n5.8\n and $\n0.8\n, respectively, in estimated interest and penalties.  As of December 31, 2024, 2023 and 2022, the liability for unrecognized tax benefits included \n$\n37.7\n, $\n41.8\n and $\n35.8\n, respectively, for tax-related interest and penalties.\n​\nThe Company operates in the U.S. and numerous foreign taxable jurisdictions, and at any point in time has numerous audits underway at various stages of completion.  With few exceptions, the Company is subject to income tax examinations by tax authorities for the years 2017 and after.  The Company is generally not able to precisely estimate the ultimate settlement amounts or timing until the close of an audit.  The Company evaluates its tax positions and establishes liabilities for uncertain tax positions that may be challenged by tax authorities and may not be fully sustained, despite the Company’s belief that the underlying tax positions are fully supportable.  As of December 31, 2024 and 2023, the amount of unrecognized tax benefits, including penalties and interest, which if recognized would impact the effective tax rate, was approximately \n$\n209.7\n and $\n208.6\n, respectively.  Unrecognized tax benefits are reviewed on an ongoing basis and are adjusted for changing facts and circumstances, including the progress of tax audits and the closing of statutes of limitations.  Based on information currently available, management anticipates that over the next 12-month period, audit activity could be completed and statutes of limitations may close relating to existing unrecognized tax benefits of approximately \n$\n13.0\n.\n​\nInflation Reduction Act of 2022\n​\nThe Inflation Reduction Act of 2022 (the “IRA”), a tax and spending package that introduced several tax-related provisions, including a 15% corporate alternative minimum tax (“CAMT”) on certain large corporations and a 1% excise tax on certain corporate stock repurchases, was enacted into law in 2022.  Companies were required to reassess their valuation allowances for certain affected deferred tax assets in the period of enactment but did not need to remeasure deferred tax balances for the related tax accounting implications of the CAMT.  The IRA provisions, which became effective for Amphenol beginning on January 1, 2023, did not have a material impact on the Company during the years ended December 31, 2024 and 2023.  While the full impact of these provisions in the future depends on several factors, including interpretive regulatory guidance, which has not yet been released, the Company does not currently believe that the provisions of the IRA, including several other non-tax related provisions, will have a material impact on its financial condition, results of operations, liquidity and cash flows.\n​\nNote 7—Equity\n​\nStock-Based Compensation:\n​\nFor the years ended December 31, 2024, 2023 and 2022, the Company’s Income before income taxes was reduced by stock-based compensation expense of $\n109.5\n, $\n99.0\n and $\n89.5\n, respectively, the expense of which is included in Selling, general and administrative expenses in the accompanying Consolidated Statements of Income.  In addition, for the years ended December 31, 2024, 2023 and 2022, the Company recognized aggregate income tax benefits (associated with stock-based compensation) of \n$\n154.1\n, $\n92.4\n and $\n64.8\n, respectively, in Provision for income taxes in the accompanying Consolidated Statements of Income.  These aggregate income tax benefits during the years ended December 31, 2024, 2023 and 2022 include excess tax benefits of \n$\n142.6\n, $\n82.4\n and $\n56.0\n, respectively, from option exercises.   The impact associated with recognizing excess tax benefits from option exercises in the provision for income taxes on our consolidated financial statements could result in significant fluctuations in our effective tax rate in the future, since the provision for income taxes will be impacted by the timing and intrinsic value of future stock-based compensation award exercises.\n75\n\n\nTable of Contents\n​\nStock Options\n​\nIn May 2017, the Company adopted the 2017 Stock Purchase and Option Plan for Key Employees of Amphenol and Subsidiaries (the “2017 Employee Option Plan”), which provided for the issuance of \n120,000,000\n shares.  In March 2021, the Board authorized and approved the Amended and Restated 2017 Stock Purchase and Option Plan for Key Employees of Amphenol and Subsidiaries (the “Amended 2017 Employee Option Plan” and, together with the 2017 Employee Option Plan, the “2017 Option Plan”), which among other things, increased the number of shares reserved for issuance under the plan by \n80,000,000\n shares.  The Amended 2017 Employee Option Plan was approved by the Company’s stockholders and became effective on May 19, 2021.  As of December 31, 2024, there were \n55,113,594\n shares of Common Stock available for the granting of additional stock options under the 2017 Option Plan.  Prior to the approval of the 2017 Employee Option Plan, the Company issued stock options under the 2009 Stock Purchase and Option Plan for Key Employees of Amphenol and Subsidiaries, and its amendment (the “2009 Employee Option Plan”).  \nNo\n additional stock options will be granted under the 2009 Employee Option Plan.  Options granted under the \n2017\n Option Plan and the \n2009\n Employee Option Plan generally vest ratably over a period of \nfive years\n from the date of grant and are generally exercisable over a period of \n10 years\n from the date of grant.  \n​\nStock option activity for 2022, 2023 and 2024 was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\n​\n​\n​\nWeighted\n​\n​\n​\n \n​\n \n​\n​\n​\n​\nAverage\n​\nAggregate\n \n​\n \n​\n​\nWeighted\n​\nRemaining\n​\nIntrinsic\n \n​\n \n​\n​\nAverage\n​\nContractual\n​\nValue\n​\n​\n \nOptions\n    \nExercise Price\n    \nTerm (in years)\n    \n(in millions)\n \nOptions outstanding at January 1, 2022\n \n \n130,601,496\n​\n$\n \n21.00\n \n 6.47\n​\n​\n​\n​\nOptions granted\n \n \n14,181,596\n​\n \n \n34.47\n​\n​\n​\n​\n​\n​\nOptions exercised\n \n (\n11,254,778\n)\n​\n \n \n16.44\n​\n​\n​\n​\n​\n​\nOptions forfeited\n \n (\n1,258,240\n)\n​\n \n \n25.91\n​\n​\n​\n​\n​\n​\nOptions outstanding at December 31, 2022\n \n \n132,270,074\n​\n \n \n22.78\n​\n 6.03\n​\n​\n​\n​\nOptions granted\n \n \n12,131,028\n​\n \n \n37.99\n​\n​\n​\n​\n​\n​\nOptions exercised\n \n (\n22,506,662\n)\n​\n \n \n17.55\n​\n​\n​\n​\n​\n​\nOptions forfeited\n \n (\n1,114,116\n)\n​\n \n \n29.16\n​\n​\n​\n​\n​\n​\nOptions outstanding at December 31, 2023\n \n \n120,780,324\n​\n​\n \n25.23\n​\n 5.81\n​\n​\n​\n​\nOptions granted\n \n \n8,075,819\n​\n \n \n65.67\n​\n​\n​\n​\n​\n​\nOptions exercised\n \n (\n22,523,753\n)\n​\n \n \n19.83\n​\n​\n​\n​\n​\n​\nOptions forfeited\n \n (\n628,199\n)\n​\n \n \n36.21\n​\n​\n​\n​\n​\n​\nOptions outstanding at December 31, 2024\n \n \n105,704,191\n​\n$\n \n29.40\n​\n 5.53\n​\n$\n \n4,233.2\n​\nVested and non-vested options expected to vest at December 31, 2024\n \n \n103,031,174\n​\n$\n \n29.05\n​\n 5.47\n​\n$\n \n4,162.6\n​\nExercisable options at December 31, 2024\n \n \n70,156,937\n​\n$\n \n23.65\n​\n 4.45\n​\n$\n \n3,213.5\n​\n​\nA summary of the status of the Company’s non-vested options as of December 31, 2024 and changes during the year then ended was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n    \nWeighted Average\n \n​\n​\n​\n​\nFair Value\n​\n​\n​\nOptions\n​\nat Grant Date\n \nNon-vested options at January 1, 2024\n \n \n45,047,962\n​\n$\n \n7.28\n​\nOptions granted \n \n \n8,075,819\n​\n \n \n19.33\n​\nOptions vested \n \n (\n16,961,552\n)\n​\n \n \n5.88\n​\nOptions forfeited \n \n (\n614,975\n)\n​\n \n \n9.23\n​\nNon-vested options at December 31, 2024\n \n \n35,547,254\n​\n$\n \n10.66\n​\n​\nThe weighted average fair value at the grant date of options granted during 2023 and 2022 was $\n10.71\n and $\n8.39\n, respectively.\n​\n76\n\n\nTable of Contents\nDuring the years ended December 31, 2024, 2023 and 2022, the following activity occurred under the Company’s option plans:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n    \n2023\n    \n2022\nTotal intrinsic value of stock options exercised\n$\n \n980.3\n​\n$\n \n559.6\n​\n$\n \n245.1\nTotal fair value of stock options vested\n \n \n99.7\n​\n \n \n90.0\n​\n \n \n79.9\n​\nAs of December 31, 2024, the total compensation cost related to non-vested options not yet recognized was approximately $\n287.3\n with a weighted average expected amortization period of \n3.39\n years.\n​\nThe grant-date fair value of each option grant under the 2009 Employee Option Plan and the 2017 Option Plan is estimated using the Black-Scholes option pricing model. The grant-date fair value of each share grant is determined based on the closing share price of the Company’s Common Stock on the date of the grant. The fair value is then amortized on a straight-line basis over the requisite service period of the awards, which is generally the vesting period. Use of a valuation model for option grants requires management to make certain assumptions with respect to selected model inputs. Expected share price volatility is calculated based on the historical volatility of the Common Stock and implied volatility derived from related exchange traded options.  The average expected life is based on the contractual term of the option and expected exercise and historical experience.  The risk-free interest rate is based on U.S. Treasury zero-coupon issuances with a remaining term equal to the expected life assumed at the date of grant. The expected annual dividend per share is based on the Company’s dividend rate.\n​\nThe fair value of stock options has been estimated at the date of grant using the Black-Scholes option-pricing model with the following weighted average assumptions:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n​\n2023\n​\n2022\n​\n​\nRisk free interest rate \n​\n \n4.4\n%  \n \n3.8\n%  \n \n2.7\n%  \n​\nExpected life \n \n 4.9\nyears\n 4.9\nyears\n 4.8\nyears\n​\nExpected volatility \n \n \n28.0\n%  \n \n28.0\n%  \n \n25.9\n%  \n​\nExpected dividend yield \n \n \n1.0\n%  \n \n1.0\n%  \n \n1.0\n%  \n​\n​\nRestricted Stock\n​\nOn May 16, 2024, the Company’s stockholders approved the 2024 Restricted Stock Plan for Directors of Amphenol Corporation (the “2024 Directors Restricted Stock Plan”), which is administered by the Compensation Committee of the Board and reserves \n500,000\n shares of the Company’s Common Stock for future issuance pursuant to the plan.  As of December 31, 2024, the number of restricted shares available for grant under the 2024 Directors Restricted Stock Plan was \n478,160\n.  Restricted shares granted under the 2024 Directors Restricted Stock Plan vest on the earlier of the first anniversary of the date of grant or the day immediately prior to the date of the next regular annual meeting of the Company’s stockholders following such date of grant.  Grants under the 2024 Directors Restricted Stock Plan entitle the holder to receive shares of the Company’s Common Stock without payment.  The 2024 Directors Restricted Stock Plan will expire on \nMay 15, 2034\n, after which date no awards may be granted under the plan.\n​\nIn 2012, the Company’s stockholders approved the 2012 Restricted Stock Plan for Directors of Amphenol Corporation (the “2012 Directors Restricted Stock Plan”), which was administered by the Nominating / Corporate Governance Committee of the Board.  The 2012 Directors Restricted Stock Plan expired on \nMay 22, 2022\n.  Grants under the 2012 Directors Restricted Stock Plan entitled the holder to receive shares of the Company’s Common Stock without payment.  Restricted shares granted under the 2012 Directors Restricted Stock Plan vested on the earlier of the first anniversary of the date of grant or the day immediately prior to the date of the next regular annual meeting of the Company’s stockholders following such date of grant.  On May 17, 2023, \n42,624\n shares of restricted stock previously granted to non-employee directors vested in accordance with their terms.  \nNo\n additional shares of restricted stock are outstanding under the 2012 Directors Restricted Stock Plan and, given that the 2012 Directors Restricted Stock Plan has expired, \nno\n additional shares of restricted stock will be granted thereunder.\n​\n77\n\n\nTable of Contents\nRestricted share activity for 2022, 2023 and 2024 was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted Average\n​\n​\n​\n​\n​\nFair Value\n​\nRemaining\n​\n​\n​\nRestricted\n​\nat Grant\n​\nAmortization\n​\n​\n    \nShares\n    \nDate\n    \nTerm (in years)\n \nRestricted shares outstanding at January 1, 2022\n \n \n42,122\n​\n$\n \n33.46\n \n 0.38\n​\nRestricted shares granted\n \n \n42,624\n​\n \n \n33.80\n​\n​\n​\nShares vested and issued\n \n (\n42,122\n)\n​\n \n \n33.46\n​\n​\n​\nRestricted shares outstanding at December 31, 2022\n \n \n42,624\n​\n \n \n33.80\n    \n 0.37\n​\nRestricted shares granted\n \n \n—\n​\n \n \n—\n​\n​\n​\nShares vested and issued\n \n (\n42,624\n)\n​\n \n \n33.80\n​\n​\n​\nRestricted shares outstanding at December 31, 2023\n    \n \n—\n​\n​\n \n—\n    \n​\n​\nRestricted shares granted\n \n \n21,840\n​\n \n \n65.96\n​\n​\n​\nShares vested and issued\n \n \n—\n​\n \n \n—\n​\n​\n​\nRestricted shares outstanding at December 31, 2024\n    \n \n21,840\n    \n$\n \n65.96\n    \n 0.36\n​\n​\nThe total fair value of restricted share awards that vested during 2024, 2023, and 2022 was \nnil\n, $\n1.4\n and $\n1.4\n, respectively.  As of December 31, 2024, the total compensation cost related to non-vested restricted shares not yet recognized was approximately $\n0.5\n (with a weighted average expected amortization period of \n0.36\n years).\n​\nPhantom Stock\n​\nOn June 5, 2023, the Company granted \n4,750\n shares of phantom stock to each then-current non-employee director (\n38,000\n shares in the aggregate), \nall\n of which converted into unrestricted shares of the Company’s Common Stock on May 15, 2024.  The total compensation cost associated with these vested shares of phantom stock was \n$\n1.5\n.  As of December 31, 2024, \nno\n additional shares of phantom stock are outstanding, and the Company does \nno\nt expect to grant any additional shares of phantom stock.\n​\nStock Repurchase Programs:\n​\nOn April 23, 2024, the Board authorized a new stock repurchase program under which the Company may purchase up to $\n2,000.0\n of its Common Stock during the \nthree-year\n period ending on the close of business on April 28, 2027 (the “2024 Stock Repurchase Program”).  The 2024 Stock Repurchase Program became effective on April 29, 2024.  During the year ended December 31, 2024, the Company repurchased \n7.0\n million shares of its Common Stock for $\n463.7\n under the 2024 Stock Repurchase Program.  Of the total repurchases made in 2024 under the 2024 Stock Repurchase Program, \n4.2\n million shares, or $\n287.5\n, have been retired by the Company, with the remainder of the repurchased shares retained in Treasury stock at the time of repurchase.  From January 1, 2025 to January 31, 2025, the Company repurchased \n0.7\n million additional shares of its Common Stock for $\n50.7\n, and, as of February 1, 2025, the Company has remaining authorization to purchase up to $\n1,485.6\n of its Common Stock under the 2024 Stock Repurchase Program.  The timing and amount of any future repurchases will depend on a number of factors, such as the levels of cash generation from operations, the volume of stock options exercised by employees, cash requirements for acquisitions, dividends paid, economic and market conditions and the price of the Common Stock.\n​\nOn April 27, 2021, the Board authorized a stock repurchase program under which the Company could purchase up to $\n2,000.0\n of its Common Stock during the \nthree-year\n period \nending April 27, 2024 (the “2021 Stock Repurchase Program”).  During the year ended December 31, 2024, the Company repurchased \n4.1\n million shares of its Common Stock for $\n225.6\n under the 2021 Stock Repurchase Program.  \nAll\n of the repurchased \nshares\n under the 2021 Stock Repurchase Program during 2024 have been retired by the Company.  As a result of these repurchases, the Company completed all repurchases authorized under the 2021 Stock Repurchase Program, and, therefore, the 2021 Stock Repurchase Program has terminated.  During the year ended December 31, 2023, the Company repurchased \n14.4\n million shares of its Common Stock for $\n585.1\n, of which \n10.9\n million shares, or $\n435.8\n, were retired by the Company, with the remainder of the repurchased shares retained in Treasury stock at the time of repurchase.  During the year ended December 31, 2022, the Company repurchased \n19.8\n million shares of its Common Stock for $\n730.5\n, of which \n18.7\n million shares, or $\n689.7\n, were retired by the Company, with the remainder of the repurchased shares retained in Treasury stock at the time of repurchase.  \n​\n78\n\n\nTable of Contents\nDividends:\n​\nContingent upon declaration by the Board, the Company pays a quarterly dividend on shares of its Common Stock.  On October 24, 2023, the Board approved an increase to the Company’s quarterly dividend rate from \n$\n0.105\n per share to $\n0.11\n per share, effective with dividends declared in the fourth quarter of 2023, and on July 23, 2024, the Board approved an additional increase to the Company’s quarterly dividend rate from $\n0.11\n per share to $\n0.165\n per share, effective with dividends declared in the third quarter of 2024, contingent upon declaration by the Board.  \nThe following table summarizes the declared quarterly dividends per share during each of the three years ended December 31, 2024, 2023 and 2022:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n2024\n \n​\n2023\n \n​\n2022\nFirst Quarter\n​\n$\n \n0.11\n​\n$\n \n0.105\n​\n$\n \n0.10\nSecond Quarter\n​\n​\n \n0.11\n​\n​\n \n0.105\n​\n​\n \n0.10\nThird Quarter\n​\n​\n \n0.165\n​\n​\n \n0.105\n​\n​\n \n0.10\nFourth Quarter\n​\n​\n \n0.165\n​\n​\n \n0.11\n​\n​\n \n0.105\nTotal\n​\n$\n \n0.55\n​\n$\n \n0.425\n​\n$\n \n0.405\n​\nDividends declared and paid for the years ended December 31, 2024, 2023 and 2022 were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n \n​\n2023\n \n​\n2022\nDividends declared\n​\n$\n \n662.9\n​\n$\n \n507.4\n​\n$\n \n482.6\nDividends paid (including those declared in the prior year)\n​\n \n \n595.1\n​\n \n \n500.6\n​\n \n \n477.4\n​\nAccumulated Other Comprehensive Income (Loss):\n​\nBalances of related after-tax components comprising Accumulated other comprehensive income (loss) included in equity at December 31, 2024, 2023 and 2022 are as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nForeign\n​\nUnrealized\n​\nPension and\n​\nAccumulated\n \n​\n​\nCurrency\n​\nGain (Loss)\n​\nPostretirement\n​\nOther\n​\n​\n​\nTranslation\n​\non Hedging\n​\nBenefit Plan\n​\nComprehensive\n \n​\n  \nAdjustments\n    \nActivities\n    \nAdjustment\n    \n(Loss) Income\n \nBalance at January 1, 2022\n​\n$\n (\n152.8\n)\n​\n$\n \n0.1\n​\n$\n (\n133.8\n)\n​\n$\n (\n286.5\n)\n​\nOther comprehensive income (loss) before reclassifications, net of tax of \nnil\n, \nnil\n and ($\n0.4\n), respectively\n​\n​\n (\n260.2\n)\n​\n​\n (\n0.1\n)\n​\n​\n (\n1.4\n)\n​\n​\n (\n261.7\n)\n​\nAmounts reclassified from Accumulated other comprehensive income (loss) to earnings, net of tax of ($\n4.3\n)\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n13.2\n​\n​\n \n13.2\n​\nBalance at December 31, 2022\n​\n \n (\n413.0\n)\n​\n \n \n—\n​\n \n (\n122.0\n)\n​\n \n (\n535.0\n)\n​\nOther comprehensive income (loss) before reclassifications, net of tax of \nnil\n, \nnil\n and $\n1.1\n, respectively\n​\n​\n \n0.3\n​\n​\n \n—\n​\n​\n (\n2.0\n)\n​\n​\n (\n1.7\n)\n​\nAmounts reclassified from Accumulated other comprehensive income (loss) to earnings, net of tax of ($\n1.0\n)\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n3.1\n​\n​\n \n3.1\n​\nBalance at December 31, 2023\n​\n \n (\n412.7\n)\n​\n \n \n—\n​\n \n (\n120.9\n)\n​\n \n (\n533.6\n)\n​\nOther comprehensive income (loss) before reclassifications, net of tax of \nnil\n, \nnil\n and ($\n5.2\n), respectively\n​\n​\n (\n199.3\n)\n​\n​\n \n—\n​\n​\n \n13.1\n​\n​\n (\n186.2\n)\n​\nAmounts reclassified from Accumulated other comprehensive income (loss) to earnings, net of tax of ($\n1.1\n)\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n3.5\n​\n​\n \n3.5\n​\nBalance at December 31, 2024\n​\n$\n (\n612.0\n)\n​\n$\n \n—\n​\n$\n (\n104.3\n)\n​\n$\n (\n716.3\n)\n​\n​\n79\n\n\nTable of Contents\nFor the years ended December 31, 2024, 2023 and 2022, as it relates to the Company’s cash flow hedges, which is comprised of foreign exchange forward contracts, the amounts recognized in Accumulated other comprehensive income (loss) associated with foreign exchange forward contracts, as well as the amounts reclassified from Accumulated other comprehensive income (loss) to foreign exchange gain (loss), included in Cost of sales in the accompanying Consolidated Statements of Income, were not material. There were \nno\n reclassifications associated with net investment hedges from Accumulated other comprehensive income (loss) to earnings during the years presented in the table above.   While there were \nno\n outstanding cash flow hedges as of December 31, 2024 and 2023, any amounts included in Accumulated other comprehensive income (loss) associated with cash flow hedges are generally expected to be reclassified into earnings within the following 12 months.  The amounts reclassified from Accumulated other comprehensive income (loss) to earnings, related to pension and other postretirement benefit plans in the table above, are reported within Other income (expense), net in the Consolidated Statements of Income, the vast majority of which is related to the amortization of actuarial losses associated with our defined benefit plans.  The amortization of actuarial losses is included in the computation of net pension expense discussed in more detail within Note 9 herein.\n​\nNote 8—Earnings Per Share\n​\nThe following is a reconciliation of the basic weighted average common shares outstanding to diluted weighted average common shares outstanding, which were used to calculate the earnings per share (basic and diluted) for the years ended December 31, 2024, 2023 and 2022:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(dollars and shares in millions, except per share data)\n   \n2024\n   \n2023\n   \n2022\nNet income attributable to Amphenol Corporation stockholders\n​\n$\n \n2,424.0\n​\n$\n \n1,928.0\n​\n$\n \n1,902.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average common shares outstanding — Basic\n​\n \n \n1,203.8\n​\n \n \n1,193.0\n​\n \n \n1,192.3\nEffect of dilutive stock options\n​\n \n \n59.8\n​\n \n \n48.2\n​\n \n \n49.7\nWeighted average common shares outstanding — Diluted\n​\n \n \n1,263.6\n​\n \n \n1,241.2\n​\n \n \n1,242.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet income attributable to Amphenol Corporation per common share — Basic\n​\n$\n \n2.01\n​\n$\n \n1.62\n​\n$\n \n1.60\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet income attributable to Amphenol Corporation per common share — Diluted\n​\n$\n \n1.92\n​\n$\n \n1.55\n​\n$\n \n1.53\n​\nExcluded from the computations above were anti-dilutive common shares (primarily related to outstanding stock options) of \n4.8\n million, \n14.4\n million and \n18.0\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n​\nNote 9—Benefit Plans and Other Postretirement Benefits\n​\nDefined Benefit Plans\n​\nThe Company and certain of its domestic subsidiaries have defined benefit pension plans (the “U.S. Pension Plans”), which cover certain U.S. employees and which represent the majority of the plan assets and benefit obligations of the aggregate defined benefit plans of the Company. The U.S. Pension Plans’ benefits are generally based on years of service and compensation and are generally noncontributory.  The majority of U.S. employees are not covered by the U.S. Pension Plans and are instead covered by various defined contribution plans.  The Company also has an unfunded Supplemental Employee Retirement Plan (“SERP”, and together with the U.S. Pension Plans, “U.S. Plans”), which provides for the payment of the portion of annual pension that cannot be paid from the retirement plan as a result of regulatory limitations on average compensation for purposes of the benefit computation.  Certain foreign subsidiaries have defined benefit plans covering their employees (the “Foreign Plans” and, together with the U.S. Plans, the “Plans”).  The largest foreign pension plan, in accordance with local regulations, is \nunfunded and had a projected benefit obligation of approximately $\n72.2\n and $\n81.7\n at December 31, 2024 and 2023, respectively.  Total required contributions to be made during 2025 for the unfunded Foreign Plans are included in Other accrued expenses in the accompanying Consolidated Balance Sheets and in the tables below.\n​\n80\n\n\nTable of Contents\nThe following is a summary of the Company’s defined benefit plans’ funded status as of the most recent actuarial valuations as of December 31 of each year.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nU.S. Plans\n​\nForeign Plans\n​\nTotal\n​\n​\n​\n2024\n​\n​\n2023\n​\n​\n2024\n​\n​\n2023\n​\n​\n2024\n​\n​\n2023\nChange in projected benefit obligation\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nProjected benefit obligation at beginning of year \n​\n$\n \n388.5\n​\n$\n \n388.2\n​\n$\n \n173.3\n​\n$\n \n175.6\n​\n$\n \n561.8\n​\n$\n \n563.8\nService cost \n​\n \n \n2.2\n​\n \n \n2.5\n​\n \n \n1.5\n​\n \n \n1.3\n​\n \n \n3.7\n​\n \n \n3.8\nInterest cost \n​\n \n \n17.8\n​\n \n \n18.6\n​\n \n \n6.3\n​\n \n \n6.8\n​\n \n \n24.1\n​\n \n \n25.4\nPlan amendments \n​\n \n \n0.2\n​\n \n \n—\n​\n \n \n—\n​\n \n \n—\n​\n \n \n0.2\n​\n \n \n—\nActuarial loss (gain)\n​\n \n (\n20.8\n)\n​\n \n \n8.8\n​\n \n (\n11.3\n)\n​\n \n \n5.7\n​\n \n (\n32.1\n)\n​\n \n \n14.5\nForeign exchange translation and other\n​\n \n \n—\n​\n \n \n—\n​\n \n (\n8.8\n)\n​\n \n (\n9.5\n)\n​\n \n (\n8.8\n)\n​\n \n (\n9.5\n)\nBenefits paid \n​\n \n (\n46.5\n)\n​\n \n (\n29.6\n)\n​\n \n (\n7.0\n)\n​\n \n (\n6.6\n)\n​\n \n (\n53.5\n)\n​\n \n (\n36.2\n)\nProjected benefit obligation at end of year \n​\n \n \n341.4\n​\n \n \n388.5\n​\n \n \n154.0\n​\n \n \n173.3\n​\n \n \n495.4\n​\n \n \n561.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nChange in plan assets\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFair value of plan assets at beginning of year \n​\n \n \n395.6\n​\n \n \n387.0\n​\n \n \n86.0\n​\n \n \n83.6\n​\n \n \n481.6\n​\n \n \n470.6\nActual return on plan assets \n​\n \n \n8.9\n​\n \n \n37.1\n​\n \n \n6.8\n​\n \n \n7.7\n​\n \n \n15.7\n​\n \n \n44.8\nEmployer contributions \n​\n \n \n1.1\n​\n \n \n1.1\n​\n \n \n3.8\n​\n \n \n4.3\n​\n \n \n4.9\n​\n \n \n5.4\nForeign exchange translation and other\n​\n \n \n—\n​\n \n \n—\n​\n \n (\n4.2\n)\n​\n \n (\n3.0\n)\n​\n \n (\n4.2\n)\n​\n \n (\n3.0\n)\nBenefits paid \n​\n \n (\n46.5\n)\n​\n \n (\n29.6\n)\n​\n \n (\n7.0\n)\n​\n \n (\n6.6\n)\n​\n \n (\n53.5\n)\n​\n \n (\n36.2\n)\nFair value of plan assets at end of year \n​\n \n \n359.1\n​\n \n \n395.6\n​\n \n \n85.4\n​\n \n \n86.0\n​\n \n \n444.5\n​\n \n \n481.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOver (under) funded status at end of year\n​\n$\n \n17.7\n​\n$\n \n7.1\n​\n$\n (\n68.6\n)\n​\n$\n (\n87.3\n)\n​\n$\n (\n50.9\n)\n​\n$\n (\n80.2\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAmounts recognized on the balance sheet as of December 31:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOther long-term assets\n​\n$\n \n31.2\n​\n$\n \n21.2\n​\n$\n \n3.6\n​\n$\n \n0.7\n​\n$\n \n34.8\n​\n$\n \n21.9\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOther accrued expenses\n​\n​\n \n1.2\n​\n​\n \n1.2\n​\n​\n \n2.7\n​\n​\n \n2.9\n​\n​\n \n3.9\n​\n​\n \n4.1\nAccrued pension and postretirement benefit obligations\n​\n​\n \n12.3\n​\n​\n \n12.9\n​\n​\n \n69.5\n​\n​\n \n85.1\n​\n​\n \n81.8\n​\n​\n \n98.0\nOver (under) funded status at end of year\n​\n$\n \n17.7\n​\n$\n \n7.1\n​\n$\n (\n68.6\n)\n​\n$\n (\n87.3\n)\n​\n$\n (\n50.9\n)\n​\n$\n (\n80.2\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAccumulated other comprehensive loss, net\n​\n$\n (\n96.8\n)\n​\n$\n (\n104.0\n)\n​\n$\n (\n9.6\n)\n​\n$\n (\n18.9\n)\n​\n$\n (\n106.4\n)\n​\n$\n (\n122.9\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average assumptions used to determine projected benefit obligations:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDiscount rate\n \n​\n \n5.53\n%\n​\n \n4.97\n%\n​\n \n4.13\n%\n​\n \n3.72\n%\n​\n​\n​\n​\n​\nRate of compensation increase\n \n​\n \n2.40\n%\n​\n \n2.40\n%\n​\n \n1.91\n%\n​\n \n1.89\n%\n​\n​\n​\n​\n​\n​\nThe projected benefit obligation decreased in 2024, primarily due to benefits paid and actuarial gains resulting from the impact of higher discount rates on our projected benefit obligation, partially offset by interest cost.  The projected benefit obligation decreased slightly in 2023 compared to 2022, primarily due to benefits paid during the year, which were largely offset by interest cost. \n The accumulated benefit obligation for the Company’s defined benefit pension plans was $\n492.5\n and $\n557.0\n at December 31, 2024 and 2023, respectively.  As of December 31, 2024 and 2023, the accumulated benefit obligation for the U.S. Plans was \n$\n341.3\n and $\n388.2\n, respectively, and for the Foreign Plans was $\n151.2\n and $\n168.8\n, respectively.\n​\n​\n81\n\n\nTable of Contents\n​\nThe following summarizes information for defined benefit plans with an accumulated benefit obligation in excess of plan assets as of December 31, 2024 and 2023:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. Plans\n​\nForeign Plans\n​\n​\n​\n2024\n​\n  \n2023\n​\n  \n2024\n​\n​\n2023\nAccumulated benefit obligation\n​\n$\n \n22.1\n​\n$\n \n23.1\n​\n$\n \n88.3\n​\n$\n \n142.3\nFair value of plan assets\n​\n​\n \n8.6\n​\n​\n \n9.1\n​\n​\n \n17.7\n​\n​\n \n57.0\n​\nThe following summarizes information for defined benefit plans with a projected benefit obligation in excess of plan assets as of December 31, 2024 and 2023:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. Plans\n​\nForeign Plans\n​\n​\n​\n2024\n​\n  \n2023\n​\n  \n2024\n​\n​\n2023\nProjected benefit obligation\n​\n$\n \n22.1\n​\n$\n \n23.2\n​\n$\n \n90.0\n​\n$\n \n169.3\nFair value of plan assets\n​\n​\n \n8.6\n​\n​\n \n9.1\n​\n​\n \n17.7\n​\n​\n \n81.2\n​\nThe amounts, before tax, included in Accumulated other comprehensive loss at December 31, 2024 and 2023 that have not yet been recognized as expense were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nU.S. Plans\n​\nForeign Plans\n​\nTotal\n​\n​\n​\n2024\n \n​\n​\n2023\n \n​\n​\n2024\n \n​\n​\n2023\n \n​\n​\n2024\n \n​\n​\n2023\nActuarial losses, net\n​\n$\n \n122.7\n   \n$\n \n131.0\n     \n$\n \n1.4\n   \n$\n \n15.7\n     \n$\n \n124.1\n   \n$\n \n146.7\nPrior service cost\n​\n​\n \n3.7\n \n​\n​\n \n4.8\n \n​\n​\n \n0.4\n \n​\n​\n \n0.5\n \n​\n​\n \n4.1\n \n​\n​\n \n5.3\n​\nThe following is a summary of the components of net pension expense for the Company’s defined benefit plans for the years ended December 31, 2024, 2023 and 2022:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. Plans\n​\nForeign Plans\n​\nTotal\n​\n  \n2024\n  \n2023\n  \n2022\n \n​\n2024\n  \n2023\n  \n2022\n \n​\n2024\n  \n2023\n  \n2022\nComponents of net pension expense\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\nService cost \n​\n$\n \n2.2\n​\n$\n \n2.5\n​\n$\n \n3.5\n \n​\n$\n \n1.5\n​\n$\n \n1.3\n​\n$\n \n2.5\n \n​\n$\n \n3.7\n​\n$\n \n3.8\n​\n$\n \n6.0\nInterest cost \n​\n \n \n17.8\n​\n \n \n18.6\n​\n \n \n10.6\n \n​\n \n \n6.3\n​\n \n \n6.8\n​\n \n \n3.4\n \n​\n \n \n24.1\n​\n \n \n25.4\n​\n \n \n14.0\nExpected return on plan assets \n​\n \n (\n24.1\n)\n​\n \n (\n24.6\n)\n​\n \n (\n26.5\n)\n \n​\n \n (\n4.6\n)\n​\n \n (\n4.5\n)\n​\n \n (\n3.4\n)\n \n​\n \n (\n28.7\n)\n​\n \n (\n29.1\n)\n​\n \n (\n29.9\n)\nAmortization of prior service cost\n​\n​\n \n1.3\n​\n​\n \n1.7\n​\n​\n \n1.4\n \n​\n​\n \n—\n​\n​\n \n0.1\n​\n​\n \n—\n \n​\n​\n \n1.3\n​\n​\n \n1.8\n​\n​\n \n1.4\nAmortization of actuarial losses \n​\n \n \n2.7\n​\n \n \n1.6\n​\n \n \n11.9\n \n​\n \n \n0.5\n​\n \n \n0.7\n​\n \n \n4.2\n \n​\n \n \n3.2\n​\n \n \n2.3\n​\n \n \n16.1\nNet pension (income) expense\n​\n$\n (\n0.1\n)\n​\n$\n (\n0.2\n)\n​\n$\n \n0.9\n \n​\n$\n \n3.7\n​\n$\n \n4.4\n​\n$\n \n6.7\n \n​\n$\n \n3.6\n​\n$\n \n4.2\n​\n$\n \n7.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average assumptions used to determine net periodic benefit cost:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDiscount rate\n \n​\n \n4.97\n%\n​\n \n5.18\n%\n​\n \n2.69\n%\n​\n \n3.72\n%\n​\n \n4.20\n%\n​\n \n1.58\n%\n​\n​\n​\n​\n​\n​\n​\n​\nExpected long-term return on assets\n \n​\n \n5.50\n%\n​\n \n5.50\n%\n​\n \n5.50\n%\n​\n \n5.45\n%\n​\n \n5.45\n%\n​\n \n3.35\n%\n​\n​\n​\n​\n​\n​\n​\n​\nRate of compensation increase\n \n​\n \n2.40\n%\n​\n \n2.40\n%\n​\n \n2.40\n%\n​\n \n1.89\n%\n​\n \n1.93\n%\n​\n \n1.75\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThe pension expense for the Plans is calculated based upon a number of actuarial assumptions established on January \n1 of the applicable year, including mortality projections as well as a weighted average discount rate, rate of increase in future compensation levels and an expected long-term rate of return on the respective Plans’ assets which are detailed in the table above.  The Company records service costs in the same line item as the respective employee compensation costs and within operating income, while all non-service costs are reported separately within Other income (expense), net in the Consolidated Statements of Income. \n​\n​\n82\n\n\nTable of Contents\nThe discount rate used by the Company for valuing pension liabilities is based on a review of high quality corporate bond yields with maturities approximating the remaining life of the projected benefit obligations.  The weighted average discount rate for the U.S. Plans on this basis was \n5.53\n% and \n4.97\n%\n at December 31, 2024 and 2023, respectively.  The increase in the discount rate for the U.S. Plans resulted in a decrease in the benefit obligation of approximately \n$\n17\n at December 31, 2024.  The weighted average discount rate for the Foreign Plans was \n4.13\n% and \n3.72\n%\n at December 31, 2024 and 2023, respectively.  The increase in the discount rate for the Foreign Plans did not have a material effect on the benefit obligation at December 31, 2024\n.  T\nhe Company calculates its service and interest costs by applying a split discount rate approach under which specific spot rates along the selected yield curve are applied to the relevant projected cash flows as the Company believes this method more precisely measures its obligations. The mortality assumptions used by the Company reflect commonly used mortality tables and improvement scales for each plan and increased life expectancies for plan participants.\n​\nThe primary investment objective of the Plans is to ensure an adequate pool of assets to support the benefit obligations to participants, retirees and beneficiaries.  Over time, the Plans have aimed to earn a rate of return on assets greater than the liability discount rate, with a prudent level of risk and diversification.  For the U.S. Plans, this has resulted in assets exceeding benefit obligations.  The target asset allocations for the U.S. Plans were \n15\n% equities and \n85\n%\n fixed income as of December 31, 2024 and 2023, and the Company expects to maintain these target asset allocations for the U.S. Plans for 2025.  Short-term strategic ranges for investments will continue to be established within these new long-term target percentages.  The Company regularly reviews the actual asset allocation and periodically rebalances investments to its targeted allocation when considered appropriate. \n​\nThe Company invests in a diversified investment portfolio through various investment managers and evaluates its plan assets for the existence of concentration risks.  As of December 31, 2024, there were no significant concentrations of risks in the Company’s defined benefit plan assets.  The Company does not invest nor instruct investment managers to invest pension assets in Amphenol securities.  The Plans may indirectly hold the Company’s securities as a result of external investment management in certain commingled funds.  Such holdings would not be material relative to the Plans’ total assets.  The Company’s Foreign Plans primarily invest in equity and debt securities and insurance contracts, as determined by each Plans’ Trustees or investment managers.\n​\nIn developing the expected long-term rate of return assumption for the U.S. Plans, the Company relies primarily on projected long-term asset returns by asset class prepared annually by our investment consultants.  For 2024, the expected long-term rate of return on the U.S. Plans’ assets was based on an asset allocation assumption of approximately \n15\n% with equity managers (with an expected long-term rate of return of approximately \n6.0\n%) and \n85\n% with fixed income managers (with an expected long-term rate of return of approximately \n5.4\n%).\n​\n83\n\n\nTable of Contents\nThe Company’s Plan assets, the vast majority of which relate to the U.S. Plans, are reported at fair value and classified in their entirety based on the lowest level of input that is significant to the fair value measurement.  The process requires judgment and may have an effect on the placement of the Plan assets within the fair value measurement hierarchy. The fair values of the Company’s pension Plans’ assets at December 31, 2024 and 2023 by asset category are as follows (refer to Note 5 for definitions of Level 1, 2 and 3 inputs):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAssets Measured at\nAsset Category\n​\nTotal\n​\nLevel 1\n​\nLevel 2\n​\nLevel 3\n​\nNet Asset Value (1)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEquity securities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. equities — large cap \n​\n$\n \n26.8\n​\n$\n \n—\n​\n$\n \n26.8\n​\n$\n \n—\n​\n$\n \n—\nU.S. equities — small/mid cap and other \n​\n \n \n7.2\n​\n \n \n—\n​\n \n \n7.2\n​\n \n \n—\n​\n \n \n—\nInternational equities — growth \n​\n \n \n10.3\n​\n \n \n10.3\n​\n \n \n—\n​\n \n \n—\n​\n \n \n—\nInternational equities — other \n​\n \n \n40.9\n​\n \n \n—\n​\n \n \n40.9\n​\n \n \n—\n​\n \n \n—\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAlternative investment funds \n​\n​\n \n1.1\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n1.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFixed income securities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. fixed income securities — intermediate term \n​\n \n \n131.1\n​\n \n \n—\n​\n \n \n131.1\n​\n \n \n—\n​\n \n \n—\nU.S. fixed income securities — long-term \n​\n​\n \n170.6\n​\n \n \n—\n​\n \n \n170.6\n​\n \n \n—\n​\n \n \n—\nInternational fixed income securities — other \n​\n \n \n36.0\n​\n​\n \n—\n​\n \n \n36.0\n​\n \n \n—\n​\n \n \n—\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nInsurance contracts\n​\n \n \n17.8\n​\n \n \n—\n​\n \n \n—\n​\n \n \n17.8\n​\n \n \n—\nCash and cash equivalents\n​\n \n \n2.7\n​\n \n \n2.7\n​\n \n \n—\n​\n \n \n—\n​\n \n \n—\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal \n​\n$\n \n444.5\n​\n$\n \n13.0\n​\n$\n \n412.6\n​\n$\n \n17.8\n​\n$\n \n1.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEquity securities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. equities — large cap \n​\n$\n \n29.0\n​\n$\n \n—\n​\n$\n \n29.0\n​\n$\n \n—\n​\n$\n \n—\nU.S. equities — small/mid cap and other \n​\n \n \n8.7\n​\n \n \n—\n​\n \n \n8.7\n​\n \n \n—\n​\n \n \n—\nInternational equities — growth \n​\n \n \n22.1\n​\n \n \n12.3\n​\n \n \n9.8\n​\n \n \n—\n​\n \n \n—\nInternational equities — other \n​\n \n \n25.7\n​\n \n \n—\n​\n \n \n25.7\n​\n \n \n—\n​\n \n \n—\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAlternative investment funds \n​\n​\n \n5.6\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n—\n​\n​\n \n5.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFixed income securities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. fixed income securities — intermediate term \n​\n \n \n113.5\n​\n \n \n—\n​\n \n \n113.5\n​\n \n \n—\n​\n \n \n—\nU.S. fixed income securities — long-term \n​\n​\n \n210.9\n​\n \n \n—\n​\n \n \n210.9\n​\n \n \n—\n​\n \n \n—\nInternational fixed income securities — other \n​\n \n \n39.7\n​\n​\n \n—\n​\n \n \n39.7\n​\n \n \n—\n​\n \n \n—\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nInsurance contracts\n​\n​\n \n19.5\n​\n \n \n—\n​\n \n \n—\n​\n \n \n19.5\n​\n \n \n—\nCash and cash equivalents\n​\n​\n \n6.9\n​\n \n \n6.9\n​\n \n \n—\n​\n \n \n—\n​\n \n \n—\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal \n​\n$\n \n481.6\n​\n$\n \n19.2\n​\n$\n \n437.3\n​\n$\n \n19.5\n​\n$\n \n5.6\n(1)  Certain investments measured at fair value using the net asset value practical expedient have been removed from the fair value hierarchy but included in the table above in order to permit the reconciliation of the fair value hierarchy to total plan assets\n.\n​\nEquity securities primarily consist of publicly traded U.S. and non-U.S. equities.  Publicly traded securities are valued at the last trade or closing price reported in the active market in which the individual securities are traded.  Certain equity securities held in commingled funds are valued at unitized net asset value (“NAV”) based on the fair value of the underlying net assets owned by the funds.  Alternative investment funds include investments in hedge funds including fund of fund products.\n​\nFixed income securities primarily consist of government securities and corporate bonds.  They are valued at the closing price in the active market or at quotes obtained from brokers/dealers or pricing services.  Certain fixed income securities held within commingled funds are valued based on the fair value of the underlying net assets of the funds, as determined by the custodian of the funds. \n​\nThe Level 2 pension plan assets are comprised primarily of pooled funds valued using published prices based off of observable market data.\n​\nThe Level 3 pension plan assets as of December 31, 2024 and 2023 included in the table above primarily consist of contracts with insurance companies related to certain foreign plans.  The insurance contracts generally include \n84\n\n\nTable of Contents\nguarantees in accordance with the policy purchased.  Our valuation of Level 3 assets is based on insurance company or third-party actuarial valuations, representing an estimation of the surrender or market values of the insurance contract between the Company and the insurance companies.  The following table sets forth a summary of changes of the fair value of the Level 3 pension plan assets for the years ended December 31, 2024 and 2023:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n​\n2023\nBalance on January 1\n​\n$\n \n19.5\n​\n$\n \n24.3\n     Unrealized gains (losses), net\n​\n​\n \n0.6\n​\n​\n \n1.6\n     Purchases, sales and settlements, net\n​\n​\n (\n1.1\n)\n​\n​\n (\n7.2\n)\n     Foreign currency translation\n​\n​\n (\n1.2\n)\n​\n​\n \n0.8\nBalance on December 31\n​\n$\n \n17.8\n​\n$\n \n19.5\n​\nThe Company made cash contributions to the Plans of $\n4.9\n, $\n5.4\n, and $\n6.3\n in 2024, 2023, and 2022, respectively.  \nThere is no current requirement for cash contributions to any of the U.S. Plans, and the Company plans to evaluate annually, based on actuarial calculations and the investment performance of the Plans’ assets, the timing and amount of cash contributions in the future, if any.\n \n​\nBenefit payments related to the Plans above, including those amounts to be paid out of Company assets and reflecting future expected service as appropriate, are expected to be as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nU.S.\n​\nForeign\n​\n​\n \nYear\n​\nPlans\n​\nPlans\n​\nTotal\n \n2025\n    \n$\n \n33.3\n \n$\n \n7.3\n \n$\n \n40.6\n \n2026\n​\n \n \n28.4\n​\n \n \n7.4\n​\n \n \n35.8\n​\n2027\n​\n \n \n28.4\n​\n \n \n7.8\n​\n \n \n36.2\n​\n2028\n​\n \n \n28.3\n​\n \n \n8.1\n​\n \n \n36.4\n​\n2029\n​\n \n \n28.0\n​\n \n \n8.4\n​\n \n \n36.4\n​\n2030-2034\n​\n \n \n132.5\n​\n \n \n45.0\n​\n \n \n177.5\n​\n​\nCertain foreign subsidiaries of the Company offer certain benefits under local statutory plans which are excluded from the tables above.  The net liability for such plans was \n$\n30.0\n and $\n30.9\n as of December 31, 2024 and 2023, respectively, the majority of which is included within Accrued pension and postretirement benefit obligations in the accompanying Consolidated Balance Sheets.\n​\nOther Postretirement Benefit Plans\n​\nThe Company maintains self-insurance programs for that portion of its health care and workers compensation costs not covered by insurance. The Company also provides certain health care and life insurance benefits to certain eligible retirees in the U.S. through postretirement benefit (“OPEB”) programs. The Company’s share of the cost of such plans for most participants is fixed, and any increase in the cost of such plans will be the responsibility of the retirees. The Company funds the benefit costs for such plans on a pay-as-you-go basis.  As of December 31, 2024 and 2023, t\nhe total liability associated with postretirement benefit obligations was approximately $\n3.5\n and $\n3.9\n, respectively, the majority of which is included in Accrued pension and postretirement benefit obligations on the accompanying Consolidated Balance Sheets.  The weighted average discount rate used to determine the projected benefit obligation as of December 31, 2024 and 2023 was \n5.58\n% and \n5.00\n%\n, respectively.  Net postretirement benefit expense on the accompanying Consolidated Statements of Income was not material for each of the years ended December 31, 2024, 2023 and 2022.  Since the Company’s obligation for postretirement medical plans is fixed and since the benefit obligation and the net postretirement benefit expense are not material in relation to the Company’s financial condition or results of operations, the Company believes any change in medical costs from that estimated will not have a significant impact on the Company.\n​\nDefined Contribution Plans\n​\nThe Company offers various defined contribution plans for certain U.S. and foreign employees. Participation in these plans is based on certain eligibility requirements. Through December 31, 2022, the Company matched employee contributions to the U.S. defined contribution plans up to a maximum of \n6\n% of eligible compensation. Effective January 1, 2023, the Company increased its matching of employee contributions to the U.S. defined contribution plans \n85\n\n\nTable of Contents\nup to a maximum of \n7\n%\n of eligible compensation.  The Company provided matching contributions to the U.S. defined contribution plans of approximately \n$\n24.7\n, $\n24.0\n and $\n18.0\n in 2024, 2023 and 2022, respectively.  \n​\nNote 10—Leases\n​\nOperating Leases\n​\nFor the years ended December 31, 2024, 2023 and 2022, total operating lease cost was $\n156.2\n, $\n127.1\n, and $\n121.4\n, respectively, which include an immaterial amount of variable lease cost, and is recorded in Cost of sales and Selling, general and administrative expenses, dependent on the nature of the leased asset.  Other than variable lease cost, operating lease cost is recognized on a straight-line basis over the lease term. The following summarizes (i) the future minimum undiscounted lease payments under non-cancelable operating leases for each of the next five years and thereafter, incorporating the practical expedient to account for lease and non-lease components as a single lease component for our existing real estate leases and (ii) a reconciliation of the undiscounted lease payments to the present value of the lease liabilities recognized, all as of December 31, 2024:\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ending December 31,\n​\n​\n2025\n​\n$\n \n121.1\n2026\n​\n​\n \n90.2\n2027\n​\n​\n \n65.4\n2028\n​\n​\n \n47.7\n2029\n​\n​\n \n31.4\nThereafter\n​\n​\n \n93.1\nTotal future minimum lease payments\n​\n$\n \n448.9\nLess imputed interest\n​\n​\n (\n54.8\n)\nTotal present value of future minimum lease payments\n​\n$\n \n394.1\n​\nThe following summarizes the operating lease-related account balances on our Consolidated Balance Sheets, as of December 31, 2024 and 2023:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\nOperating lease right-of-use assets (included in Other long-term assets)\n​\n$\n \n384.4\n​\n$\n \n301.5\n​\n​\n​\n​\n​\n​\n​\nOther accrued expenses\n​\n$\n \n108.5\n​\n$\n \n91.6\nOther long-term liabilities\n​\n​\n \n285.6\n​\n​\n \n212.1\n     Total operating lease liabilities\n​\n$\n \n394.1\n​\n$\n \n303.7\n​\nThe following summarizes additional supplemental data related to our operating leases:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31\n:\n​\n2024\n​\n2023\n​\n2022\n​\nSupplemental Cash Flow Information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCash paid for amounts included in the measurement of lease liabilities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOperating cash flows from operating leases\n​\n$\n \n141.0\n​\n$\n \n114.3\n​\n$\n \n109.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nRight-of-use assets obtained in exchange for lease liabilities\n​\n$\n \n227.6\n​\n$\n \n115.2\n​\n$\n \n164.5\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAs of December 31\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted Average Remaining Lease Term\n​\n​\n6 years\n​\n​\n5 years\n​\n5 years\n​\nWeighted Average Discount Rate\n​\n​\n \n4.3\n%\n​\n \n3.6\n%\n​\n \n2.7\n%\n​\nLease contracts that we have executed but which have not yet commenced as of December 31, 2024 were not material, and are excluded from the tables above.  The Company does not generally enter into leases involving the construction or design of the underlying asset, and nearly all of the assets we lease are not specialized in nature.  Our lease agreements generally do not include residual value guarantees nor do we enter into sublease arrangements with external parties.\n86\n\n\nTable of Contents\n​\nFinance Leases\n​\nIn rare circumstances, the Company may enter into finance leases for specific equipment used in manufacturing, in which the Company takes ownership of the asset upon the end of the lease.  The Company records its finance leases within Property, plant and equipment, net, Current portion of long-term debt and Long-term debt on the accompanying Consolidated Balance Sheets.  The Company’s finance leases and related depreciation and interest expense, cash flows and impact on the Company’s consolidated financial statements were not material individually or in the aggregate as of and for the years ended December 31, 2024, 2023 and 2022.\n​\n​\nNote 11—Acquisitions\n​\n2024 Acquisitions\n​\nDuring the year ended December 31, 2024, the Company completed \ntwo\n acquisitions (the “2024 Acquisitions”), including the acquisition of Carlisle Interconnect Technologies (“CIT”), for approximately $\n2,156.4\n, net of cash acquired.  \nBoth\n acquisitions have been included in the Harsh Environment Solutions segment.  The 2024 Acquisitions were each funded using cash on hand, proceeds from the April Senior Notes or borrowings under the U.S. Commercial Paper Program, or a combination thereof.  The Company is in the process of analyzing and completing the allocation of the fair value of assets acquired and liabilities assumed for the 2024 Acquisitions.  Since the current purchase price allocations for the 2024 Acquisitions are based on preliminary assessments made by management as of December 31, 2024, the acquisition accounting is subject to final adjustments, and it is possible that the final assessments of values may differ from the Company’s preliminary assessments.  The operating results of the 2024 Acquisitions have been included in the Consolidated Statements of Income since their respective dates of acquisition.  Pro forma financial information, as well as further details regarding the purchase price allocations related to these acquisitions, have not been presented, since the 2024 Acquisitions are not material, either individually or in the aggregate, to the Company’s financial results.\n​\nAcquisition of Carlisle Interconnect Technologies (“CIT”)\n​\nOn \nMay 21, 2024\n, pursuant to a definitive stock purchase agreement by and between the Company and Carlisle Companies Incorporated dated \nJanuary 30, 2024\n, the Company completed the acquisition of CIT for approximately $\n1,995.3\n, net of cash acquired and subject to customary post-closing adjustments.  The Company funded the CIT acquisition through a combination of net proceeds from the April Senior Notes, as discussed in Note 4 herein, together with borrowings under the U.S. Commercial Paper Program and cash on hand.  CIT, headquartered in St. Augustine, FL, is a leading global supplier of harsh environment interconnect solutions, primarily to the commercial aerospace, defense and industrial end markets.  CIT’s wide range of products include wire and cable, cable assemblies, contacts, connectors and sensors, which management believes are highly complementary to Amphenol’s existing interconnect and sensor solutions.\n​\nAs of December 31, 2024, the CIT acquisition resulted in the recognition of $\n1,113.7\n of goodwill and $\n543.0\n of definite-lived intangible assets, with the remainder of the purchase price being allocated to other identifiable assets acquired and liabilities assumed.  Of the acquired definite-lived intangible assets, approximately \n$\n488.0\n and $\n55.0\n were assigned to customer relationships and acquired backlog, respectively.  The acquired customer relationships and acquired backlog have a weighted average useful life of approximately \n15 years\n and \n0.4\n years, respectively.  These definite-lived intangible assets are being amortized based upon the underlying pattern of economic benefit as reflected by the future net cash inflows.  The excess purchase price over the fair value of the underlying assets acquired (net of liabilities assumed) was allocated to goodwill, which primarily represents the value of the assembled workforce along with other intangible assets acquired that do not qualify for separate recognition.  The Company expects that \nnone\n of the goodwill recognized from the CIT acquisition will be deductible for tax purposes.\n​\n2023 Acquisitions\n​\nDuring the year ended December 31, 2023, the Company completed \n10\n acquisitions (the “2023 Acquisitions”) for approximately $\n970.4\n, net of cash acquired.  \nFive\n of the acquisitions were included in the Harsh Environment Solutions segment, \nthree\n acquisitions were included in the Interconnect and Sensor Systems segment, and \ntwo\n acquisitions were included in the Communications Solutions segment.  The 2023 Acquisitions were each funded using cash on hand or borrowings under our Commercial Paper Programs, or a combination thereof.  \nOne\n of the 2023 Acquisitions, which \n87\n\n\nTable of Contents\nclosed in the second quarter of 2023, represented a bargain purchase, where the estimated fair value of assets acquired, net of liabilities assumed, exceeded the purchase price.  The Company recognized a non-cash gain of \n$\n5.4\n on the bargain purchase acquisition during the year ended December 31, 2023, which was recorded separately in the Company’s Consolidated Statements of Income.\n​\nAs of December 31, 2024, the 2023 Acquisitions resulted in the recognition of $\n667.4\n of goodwill and $\n153.2\n of definite-lived intangible assets, comprised of customer relationships, proprietary technology and acquired backlog, with the remainder of the purchase price being allocated to other identifiable assets acquired and liabilities and noncontrolling interests assumed.  These definite-lived intangible assets are being amortized based upon the underlying pattern of economic benefit as reflected by the future net cash inflows, with the acquired customer relationships and \nproprietary\n \ntechnology\n having useful lives ranging from \n6\n to \n12 years\n and the acquired backlog having a useful life of approximately \n0.25\n years.  The excess purchase price over the fair value of the underlying assets acquired (net of liabilities and noncontrolling interests assumed) was allocated to goodwill, which primarily represents the value of the assembled workforce along with other intangible assets acquired that do not qualify for separate recognition.  The Company expects that approximately \n$\n151\n of the goodwill recognized from the 2023 Acquisitions will be deductible for tax purposes.  \n​\nIn 2024, the Company completed the acquisition accounting, including the analyses of the fair value of assets acquired and liabilities assumed, for \nall\n of the 2023 Acquisitions, and each of the final assessments of values did not differ materially from their previous preliminary assessments.  The operating results of the 2023 Acquisitions were included in the Consolidated Statements of Income since their respective dates of acquisition.  Pro forma financial information, as well as further details regarding the purchase price allocations related to these acquisitions, were not presented, since the 2023 Acquisitions were not material, either individually or in the aggregate, to the Company’s financial results.\n​\n2022 Acquisitions\n​\nDuring the year ended December 31, 2022, the Company completed \ntwo\n acquisitions (the “2022 Acquisitions”) for approximately $\n288.2\n, net of cash acquired.  The 2022 Acquisitions were funded through a combination of borrowings under the U.S. Commercial Paper Program and cash on hand.  \nOne\n acquisition was included in the Harsh Environment Solutions segment, while the \nother\n acquisition was included in the Interconnect and Sensor Systems segment.  The Company completed the acquisition accounting, including the analyses of the fair value of assets acquired and liabilities assumed, associated with the 2022 Acquisitions, and each of the final assessments of values did not differ materially from their previous preliminary assessments.  The operating results of the 2022 Acquisitions were included in the Consolidated Statements of Income since their respective dates of acquisition.  Pro forma financial information, as well as further details regarding the purchase price allocations related to these acquisitions, were not presented, since the 2022 Acquisitions were not material, either individually or in the aggregate, to the Company’s financial results.\n​\nAcquisition-related Expenses\n​\nIn 2024, the Company incurred $\n145.6\n ($\n119.3\n after-tax) of acquisition-related expenses, comprised primarily of (i) external transaction costs associated with acquisitions and the amortization of $\n55.0\n related to the value associated with acquired backlog resulting from the CIT acquisition (such acquisition-related expenses aggregating $\n127.4\n are presented separately in the accompanying Consolidated Statements of Income) and (ii) the amortization of acquisition-related inventory step-up costs of $\n18.2\n associated with the CIT acquisition (such costs are recorded in Cost of sales in the accompanying Consolidated Statements of Income).  In 2023, the Company incurred \n$\n34.6\n ($\n30.2\n after-tax) of acquisition-related expenses, comprised primarily of external transaction costs associated with the 2023 Acquisitions, as well as the amortization of $\n12.4\n related to the value associated with acquired backlog resulting from \nthree\n of the 2023 Acquisitions\n.  In 2022, the Company incurred \n$\n21.5\n ($\n18.4\n after-tax) of acquisition-related expenses, comprised primarily of the amortization of $\n12.0\n related to the value associated with acquired backlog resulting from the 2022 Acquisitions, along with external transaction costs.  Such acquisition-related expenses incurred in 2023 and 2022 were presented separately in the accompanying Consolidated Statements of Income\n.\n​\n​\n88\n\n\nTable of Contents\nNote 12—Goodwill and Other Intangible Assets\n​\nThe changes in the carrying amount of goodwill by segment were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nHarsh\n    \n​\n​\nInterconnect\n    \n​\n​\n \n​\n​\nEnvironment\n​\nCommunications\n​\nand Sensor\n​\n​\n​\n \n​\n​\nSolutions\n​\nSolutions\n​\nSystems\n​\nTotal\n \nGoodwill at December 31, 2022\n​\n$\n \n1,667.1\n​\n$\n \n2,908.1\n​\n$\n \n1,870.9\n​\n$\n \n6,446.1\n​\nAcquisition-related\n​\n \n \n334.9\n​\n \n \n68.8\n​\n \n \n208.7\n​\n \n \n612.4\n​\nForeign currency translation\n​\n \n \n7.3\n​\n \n \n0.6\n​\n \n \n26.0\n​\n \n \n33.9\n​\nGoodwill at December 31, 2023\n​\n​\n \n2,009.3\n​\n​\n \n2,977.5\n​\n​\n \n2,105.6\n​\n​\n \n7,092.4\n​\nAcquisition-related\n​\n \n \n1,192.3\n​\n \n (\n4.5\n)\n​\n \n \n58.9\n​\n \n \n1,246.7\n​\nForeign currency translation\n​\n \n (\n21.6\n)\n​\n \n (\n21.5\n)\n​\n \n (\n59.8\n)\n​\n \n (\n102.9\n)\n​\nGoodwill at December 31, 2024\n​\n$\n \n3,180.0\n​\n$\n \n2,951.5\n​\n$\n \n2,104.7\n​\n$\n \n8,236.2\n​\n​\nThe increase in goodwill during 2024 was primarily driven by goodwill recognized from the 2024 Acquisitions, in particular, the CIT acquisition, partially offset by foreign currency translation.  The increase in goodwill during 2023 was primarily driven by goodwill recognized from the 2023 Acquisitions.  \n​\nOther than goodwill noted above, the Company’s intangible assets as of December 31, 2024 and 2023 were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\nDecember 31, 2023\n​\nWeighted\n​\nGross\n    \n​\n    \nNet\n    \nGross\n    \n​\n    \nNet\n​\nAverage\n​\nCarrying\n​\nAccumulated\n​\nCarrying\n​\nCarrying\n​\nAccumulated\n​\nCarrying\n​\nLife (years)\n​\nAmount\n​\nAmortization\n​\nAmount\n​\nAmount\n​\nAmortization\n​\nAmount\nCustomer relationships\n12\n​\n$\n \n1,296.4\n​\n$\n \n519.8\n​\n$\n \n776.6\n​\n$\n \n782.6\n​\n$\n \n450.6\n​\n$\n \n332.0\nProprietary technology\n13\n​\n \n \n350.3\n​\n \n \n170.9\n​\n​\n \n179.4\n​\n \n \n365.1\n​\n \n \n146.1\n​\n​\n \n219.0\nBacklog and other\n1\n​\n \n \n154.1\n​\n \n \n154.1\n​\n​\n \n—\n​\n \n \n114.1\n​\n \n \n99.4\n​\n​\n \n14.7\nTotal intangible assets (definite-lived)\n11\n​\n​\n \n1,800.8\n​\n​\n \n844.8\n​\n​\n \n956.0\n​\n​\n \n1,261.8\n​\n​\n \n696.1\n​\n​\n \n565.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTrade names (indefinite-lived)\n​\n​\n​\n \n269.1\n​\n​\n​\n​\n​\n \n269.1\n​\n​\n \n269.1\n​\n​\n​\n​\n​\n \n269.1\nTotal\n​\n​\n$\n \n2,069.9\n​\n$\n \n844.8\n​\n$\n \n1,225.1\n​\n$\n \n1,530.9\n​\n$\n \n696.1\n​\n$\n \n834.8\n​\nThe increase in the gross carrying amount of intangible assets in 2024 was primarily driven by certain customer relationships and acquired backlog recognized as a result of the acquisition accounting associated with the 2024 Acquisitions, in particular, the CIT acquisition, partially offset by measurement period adjustments related to certain intangible assets associated with certain of the 2023 Acquisitions that closed late in 2023.  Amortization expense for the years ended December 31, 2024, 2023 and 2022 was approximately \n$\n154.7\n, $\n86.0\n and $\n81.0\n, respectively, which included the amortization of acquired backlog of $\n55.0\n, $\n12.4\n, and $\n12.0\n, respectively, resulting from acquisitions in each respective year.  The amortization of acquired backlog in 2024 resulted from the CIT acquisition.  As of December 31, 2024, amortization expense relating to the Company’s current intangible assets estimated for each of the next five fiscal years is approximately \n$\n104.0\n in 2025, $\n102.4\n in 2026, $\n95.7\n in 2027, $\n88.4\n in 2028, and $\n77.7\n in 2029.\n​\nNote 13—Reportable Business Segments and International Operations\n​\nThe Company aligns its businesses into \nthree\n reportable business segments: \n(i) \nHarsh Environment Solutions\n, \n(ii) \nCommunications Solutions\n and \n(iii) \nInterconnect and Sensor Systems\n.  This segment structure reflects (i) the manner in which the Chief Operating Decision Maker (“CODM”), who is the Company’s Chief Executive Officer, regularly assesses information for decision-making purposes, including the allocation of resources, and (ii) how the Company operates its businesses, assesses performance, and communicates results and strategy, among other items, to the Board and its stockholders.  The Company has \nthree\n segment managers to lead their respective reportable business segments, each reporting directly to the Chief Executive Officer.  The Company organizes its reportable business segments based on the manner in which management evaluates the performance of the Company, combined with the nature of the individual business activities and the product-based solutions offered.\n​\n89\n\n\nTable of Contents\nThe Company aligns its businesses into the following \nthree\n reportable business segments: \n​\n●\nHarsh Environment Solutions\n – the Harsh Environment Solutions segment designs, manufactures and markets a broad range of ruggedized interconnect products, including connectors and interconnect systems, specialty cable, printed circuits and printed circuit assemblies and other products for use in the industrial, defense, commercial aerospace, automotive, mobile networks and information technology and data communications end markets.\n​\n●\nCommunications Solutions\n – the Communications Solutions segment designs, manufactures and markets a broad range of connector and interconnect systems, including high speed, radio frequency, power, fiber optic and other products, coaxial and high-speed cable, as well as antennas, for use in the information technology and data communications, mobile devices, industrial, mobile networks, broadband communications, automotive, commercial aerospace and defense end markets.\n​\n●\nInterconnect and Sensor Systems\n – the Interconnect and Sensor Systems segment designs, manufactures and markets a broad range of sensors, sensor-based systems, connectors and value-add interconnect systems used in the automotive, industrial, information technology and data communications, mobile networks, defense and commercial aerospace end markets.\n​\nThe accounting policies of the segments are the same as those for the Company as a whole, as described in Note \n1 herein.  The Company’s CODM assesses each segment’s performance and allocates resources to each of them based on a single measure of profit and loss, which is operating income as adjusted for certain corporate and other related items and before interest, stock-based compensation expense, income taxes, amortization related to certain intangible assets and other non-cash purchase accounting costs, and nonrecurring gains and losses, as outlined in the table below (we refer to this measure as segment operating income).  Intersegment net sales and operating expenses have been eliminated in the computation of consolidated net sales and operating income.\n​\nThe CODM considers budget-to-actual variances in net sales and segment operating income on a quarterly basis and uses that information when making decisions about the allocation of operating and capital resources to each segment. Other than segment operating expenses (which is easily computable from the difference between net sales and segment operating income), our CODM is not regularly provided disaggregated segment level expense information as such information is not used in our CODM’s decision-making related to the allocation of operating and capital resources to our segments.  The Company also incurs general corporate expenses and costs which are not allocated to the reportable business segments but have been included in “Corporate / Other” in the following tables for reconciliation purposes.  Assets are reviewed by the CODM on a consolidated basis and therefore are not presented by reportable business segment.\n​\n90\n\n\nTable of Contents\nThe following tables (i) summarize, by segment, total sales, intersegment sales and external net sales and (ii) reconcile each segment’s external net sales to their respective segment operating income, including segment operating expenses, for each of the years ended December 31, 2024, 2023 and 2022:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\nHarsh Environment Solutions\n \n​\nCommunications Solutions\n \n​\nInterconnect and Sensor Systems\n \n​\nTotal\n2024\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal sales\n​\n$\n \n4,508.6\n​\n$\n \n6,375.6\n​\n$\n \n4,510.6\n​\n$\n \n15,394.8\nLess: Intersegment sales\n​\n​\n \n91.2\n​\n​\n \n51.8\n​\n​\n \n29.1\n​\n​\n \n172.1\nExternal net sales\n​\n​\n \n4,417.4\n​\n​\n \n6,323.8\n​\n​\n \n4,481.5\n​\n​\n \n15,222.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLess: Segment operating expenses\n (1)\n​\n​\n \n3,324.2\n​\n​\n \n4,754.2\n​\n​\n \n3,655.6\n​\n​\n \n11,734.0\nSegment operating income\n​\n$\n \n1,093.2\n​\n$\n \n1,569.6\n​\n$\n \n825.9\n​\n$\n \n3,488.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal sales\n​\n$\n \n3,621.6\n​\n$\n \n4,963.0\n​\n$\n \n4,129.3\n​\n$\n \n12,713.9\nLess: Intersegment sales\n​\n​\n \n90.8\n​\n​\n \n50.2\n​\n​\n \n18.2\n​\n​\n \n159.2\nExternal net sales\n​\n​\n \n3,530.8\n​\n​\n \n4,912.8\n​\n​\n \n4,111.1\n​\n​\n \n12,554.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLess: Segment operating expenses\n (1)\n​\n​\n \n2,586.9\n​\n​\n \n3,849.3\n​\n​\n \n3,357.4\n​\n​\n \n9,793.6\nSegment operating income\n​\n$\n \n943.9\n​\n$\n \n1,063.5\n​\n$\n \n753.7\n​\n$\n \n2,761.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2022\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal sales\n​\n$\n \n3,185.3\n​\n$\n \n5,731.8\n​\n$\n \n3,880.6\n​\n$\n \n12,797.7\nLess: Intersegment sales\n​\n​\n \n78.1\n​\n​\n \n79.4\n​\n​\n \n17.2\n​\n​\n \n174.7\nExternal net sales\n​\n​\n \n3,107.2\n​\n​\n \n5,652.4\n​\n​\n \n3,863.4\n​\n​\n \n12,623.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLess: Segment operating expenses\n (1)\n​\n​\n \n2,305.6\n​\n​\n \n4,406.7\n​\n​\n \n3,146.9\n​\n​\n \n9,859.2\nSegment operating income\n​\n$\n \n801.6\n​\n$\n \n1,245.7\n​\n$\n \n716.5\n​\n$\n \n2,763.8\n​\n(1)\nThe aggregated amount is comprised of cost of sales, selling, general and administrative expenses, and other segment related expenses.\n​\nSegment operating income and the reconciliation of segment operating income to consolidated income before income taxes for the years ended December 31, 2024, 2023 and 2022 are as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n2022\nTotal segment operating income\n​\n$\n \n3,488.7\n​\n$\n \n2,761.1\n​\n$\n \n2,763.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCorporate / Other:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nStock-based compensation expense\n​\n​\n (\n109.5\n)\n​\n​\n (\n99.0\n)\n​\n​\n (\n89.5\n)\nAmortization of acquisition-related inventory step-up costs\n​\n​\n (\n18.2\n)\n​\n​\n \n—\n​\n​\n \n—\nAcquisition-related expenses\n​\n​\n (\n127.4\n)\n​\n​\n (\n34.6\n)\n​\n​\n (\n21.5\n)\nOther operating expenses\n​\n​\n (\n76.7\n)\n​\n​\n (\n67.9\n)\n​\n​\n (\n67.0\n)\nOperating income\n​\n​\n \n3,156.9\n​\n​\n \n2,559.6\n​\n​\n \n2,585.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nInterest expense\n​\n​\n (\n217.0\n)\n​\n​\n (\n139.5\n)\n​\n​\n (\n128.4\n)\nGain on bargain purchase acquisition\n​\n​\n \n—\n​\n​\n \n5.4\n​\n​\n \n—\nOther income (expense), net\n​\n​\n \n72.0\n​\n​\n \n29.3\n​\n​\n \n10.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nIncome before income taxes\n​\n$\n \n3,011.9\n​\n$\n \n2,454.8\n​\n$\n \n2,467.4\n​\n91\n\n\nTable of Contents\nDepreciation and amortization expense by segment for the years ended December 31, 2024, 2023 and 2022 is as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n2022\nHarsh Environment Solutions\n \n$\n \n126.7\n​\n$\n \n91.0\n​\n$\n \n78.2\nCommunications Solutions\n​\n​\n \n226.5\n​\n​\n \n177.0\n​\n​\n \n183.7\nInterconnect and Sensor Systems\n​\n​\n \n136.6\n​\n​\n \n131.1\n​\n​\n \n124.5\nCorporate / Other \n(1)\n​\n​\n \n82.7\n​\n​\n \n7.3\n​\n​\n \n6.5\nTotal\n​\n$\n \n572.5\n​\n$\n \n406.4\n​\n$\n \n392.9\n​\n(1)\nAmortization of acquired backlog associated with acquisitions for the year ended December 31, 2024 is reported under “Corporate / Other”.\n​\nFor the year ended December 31, 2024, depreciation and amortization expense in Corporate / Other includes (i) $\n55.0\n related to the amortization of acquired backlog resulting from the CIT acquisition, which is included in Acquisition-related expenses in the Consolidated Statements of Income, and (ii) $\n18.2\n of amortization of acquisition-related inventory step-up costs associated with the CIT acquisition, which is included in Cost of sales in the Consolidated Statements of Income, as discussed in Note 11 herein.  These expenses are reported in Corporate / Other, since they are not components in the determination of segment operating income.\nNet sales by geographic area for the years ended December 31, 2024, 2023 and 2022 and long-lived assets by geographic area as of December 31 were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\nNet sales\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States \n​\n$\n \n5,272.3\n​\n$\n \n4,405.4\n​\n$\n \n4,155.2\nChina \n​\n \n \n3,399.9\n​\n \n \n2,884.0\n​\n \n \n3,265.0\nOther foreign locations \n​\n \n \n6,550.5\n​\n \n \n5,265.3\n​\n \n \n5,202.8\nTotal \n​\n$\n \n15,222.7\n​\n$\n \n12,554.7\n​\n$\n \n12,623.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLong-lived assets\n(1)\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States \n​\n$\n \n576.4\n​\n$\n \n442.6\n​\n$\n \n386.1\nChina \n​\n \n \n617.9\n​\n \n \n455.5\n​\n \n \n470.1\nOther foreign locations \n​\n \n \n901.9\n​\n \n \n718.1\n​\n \n \n637.6\nTotal \n​\n$\n \n2,096.2\n​\n$\n \n1,616.2\n​\n$\n \n1,493.8\n​\n(1)\nLong-lived assets included in this table are comprised of property, plant and equipment, net, and operating lease right-of-use assets for all years presented.\n​\n92\n\n\nTable of Contents\nDisaggregation of Net Sales\n​\nThe following tables show our net sales disaggregated into categories the Company considers meaningful to depict how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors for the years ended December 31, 2024, 2023 and 2022:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales by sales channel\n:\n​\n2024\n​\n2023\n​\n2022\nEnd customers and contract manufacturers\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n$\n \n3,172.6\n​\n$\n \n2,581.6\n​\n$\n \n2,176.4\nCommunications Solutions\n​\n​\n \n4,960.9\n​\n​\n \n3,933.2\n​\n​\n \n4,469.0\nInterconnect and Sensor Systems\n​\n \n \n4,311.0\n​\n \n \n3,947.4\n​\n \n \n3,724.6\n​\n​\n​\n \n12,444.5\n​\n​\n \n10,462.2\n​\n​\n \n10,370.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDistributors and resellers\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n​\n \n1,244.8\n​\n​\n \n949.2\n​\n​\n \n930.8\nCommunications Solutions\n​\n​\n \n1,362.9\n​\n​\n \n979.6\n​\n​\n \n1,183.4\nInterconnect and Sensor Systems\n​\n​\n \n170.5\n​\n​\n \n163.7\n​\n​\n \n138.8\n​\n​\n​\n \n2,778.2\n​\n​\n \n2,092.5\n​\n​\n \n2,253.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal Net sales\n​\n$\n \n15,222.7\n​\n$\n \n12,554.7\n​\n$\n \n12,623.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales by geography\n:\n​\n2024\n​\n2023\n​\n2022\nUnited States\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n$\n \n2,384.7\n​\n$\n \n1,790.5\n​\n$\n \n1,558.2\nCommunications Solutions\n​\n​\n \n1,582.3\n​\n​\n \n1,395.8\n​\n​\n \n1,495.3\nInterconnect and Sensor Systems\n​\n \n \n1,305.3\n​\n \n \n1,219.1\n​\n \n \n1,101.7\n​\n​\n​\n \n5,272.3\n​\n​\n \n4,405.4\n​\n​\n \n4,155.2\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nChina\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n​\n \n402.3\n​\n​\n \n351.2\n​\n​\n \n437.5\nCommunications Solutions\n​\n​\n \n2,011.6\n​\n​\n \n1,669.4\n​\n​\n \n1,939.6\nInterconnect and Sensor Systems\n​\n​\n \n986.0\n​\n​\n \n863.4\n​\n​\n \n887.9\n​\n​\n​\n \n3,399.9\n​\n​\n \n2,884.0\n​\n​\n \n3,265.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOther foreign locations\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n​\n \n1,630.4\n​\n​\n \n1,389.1\n​\n​\n \n1,111.5\nCommunications Solutions\n​\n​\n \n2,729.9\n​\n​\n \n1,847.6\n​\n​\n \n2,217.5\nInterconnect and Sensor Systems\n​\n​\n \n2,190.2\n​\n​\n \n2,028.6\n​\n​\n \n1,873.8\n​\n​\n​\n \n6,550.5\n​\n​\n \n5,265.3\n​\n​\n \n5,202.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal Net sales\n​\n$\n \n15,222.7\n​\n$\n \n12,554.7\n​\n$\n \n12,623.0\n​\nNet sales by geographic area are based on the customer location to which the product is shipped.  \nNo\n single customer accounted for 10% or more of the Company’s net sales during the years ended December 31, 2024, 2023 and 2022.  As the Company is not organized by product or group of products, it is impracticable to disclose net sales by product or group of products.  For further discussion related to the Company’s policies surrounding revenue recognition, refer to Note 1 herein. \n​\nNote 14—Commitments and Contingencies\n​\nThe Company is party to a number of legal and/or regulatory actions arising out of the normal course of its business.  The Company records a loss contingency liability when, in the opinion of management after seeking legal advice, a loss is considered probable and the amount can be reasonably estimated.  Based on information currently available and management’s evaluation of such information, the Company does not believe that the resolution of any existing legal or regulatory action is expected to have a material adverse effect on the Company’s financial condition, results of operations or cash flows.  The Company’s legal costs associated with defending itself are recorded to expense as incurred.\n​\nCertain operations of the Company are subject to environmental laws and regulations that govern the discharge of pollutants into the air and water, as well as the handling and disposal of solid and hazardous wastes.  The Company believes that its operations are currently in substantial compliance with applicable environmental laws and regulations \n93\n\n\nTable of Contents\nand that the costs of continuing compliance will not have a material adverse effect on the Company’s financial condition, results of operations or cash flows.\n​\nThe Company also has purchase obligations related to commitments to purchase certain goods and services.  At December 31, 2024, the Company had purchase commitments of \n$\n1,321.8\n in 2025, $\n63.7\n in 2026 and 2027, combined, and $\n5.6\n beyond 2027.\n​\nN\note 15—Subsequent Events\n​\nAcquisitions of CommScope’s Mobile Networks Business and LifeSync Corporation\n​\nOn \nJanuary 31, 2025\n, pursuant to a purchase agreement (the “CommScope Purchase Agreement”) with CommScope Holding Company, Inc. (“CommScope”) dated \nJuly 18, 2024\n, the Company completed the acquisition of CommScope’s mobile networks-related businesses, specifically the Outdoor Wireless Networks segment and the Distributed Antenna Systems business (collectively, the “Mobile Networks Business”) for an aggregate purchase price of approximately $\n2,100\n in cash, subject to customary post-closing adjustments.  The Company funded the acquisition of the Mobile Networks Business through a combination of net proceeds from the October Senior Notes, as discussed in Note 4 herein, together with borrowings under the U.S. Commercial Paper Program and cash on hand.  The Mobile Networks Business provides mobile networks solutions, with advanced technologies in the areas of base station antennas and related interconnect solutions, as well as distributed antenna systems.  The Mobile Networks Business’s wide range of products add advanced antenna and associated interconnect products, technologies and capabilities, which management believes are highly complementary to Amphenol’s existing product portfolio for next-generation wireless networks.  The Mobile Networks Business will be included in the Communications Solutions segment.  Also, on \nJanuary 31, 2025\n, the Company completed the acquisition of LifeSync Corporation (“LifeSync”), a high-technology provider of interconnect products for medical applications, which will be included in the Harsh Environment Solutions segment.  The operating results for these acquisitions will be included in the Consolidated Statements of Income from their respective dates of acquisition.  The Company is in the process of commencing the analysis of the purchase price allocation of the fair value of assets acquired and liabilities assumed as part of the acquisition accounting associated with these acquisitions.\n \n​\n​\n94\n\n\nTable of Contents\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\n​\nNone.\n​\nItem 9A. Controls and Procedures\n​\nThe Company’s management, with the participation of the Company’s Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) or 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), as of December 31, 2024.  These disclosure controls and procedures are designed to provide reasonable assurance that information \nrequired to be disclosed by the Company in reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms, and such information \nis accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.  Based on their evaluation, the Chief Executive Officer and Chief Financial Officer have concluded that the Company’s disclosure controls and procedures were effective at the reasonable assurance level as of December 31, 2024.\n​\nThere has been no change in our internal control over financial reporting during the Company’s most recent fiscal quarter ended December 31, 2024 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\n​\nManagement Report on Internal Control\n​\nInternal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with accounting principles generally accepted in the United States of America.  Due to its inherent limitations, i\nnternal control over financial reporting may not prevent or detect misstatements.  \nManagement is responsible for establishing and maintaining adequate internal control over financial reporting of Amphenol Corporation and its subsidiaries (the “Company”), as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act.  Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, the Company conducted an evaluation of the effectiveness of the internal control over financial reporting based on criteria established in the \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  Based on that evaluation, management concluded that the Company’s internal control over financial reporting was effective as of December 31, 2024.\n​\nDeloitte & Touche LLP, an independent registered public accounting firm, has audited the Company’s internal control over financial reporting as of December \n31, 2024 in accordance with the standards of the Public Company Accounting Oversight Board (PCAOB).  Those standards require that Deloitte & \nTouche LLP plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.  Deloitte & Touche LLP has issued an attestation report on the Company’s internal control over financial reporting as of December 31, 2024, which is included in Item 8 of this Annual Report.\n​\nItem 9B. Other Information\n​\nTrading Arrangements\n​\nDuring the three months ended December 31, 2024, \nno\n director or officer of the Company \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “\nno\nn-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408 of Regulation S-K.\n​\nItem 9C. \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\n​\nNot applicable.\n​\n​\n95\n\n\nTable of Contents\nPART III\n​\nThe Company intends to file a definitive proxy statement (the “Proxy Statement”) pursuant to Regulation 14A under the Securities Exchange Act within 120 days following the end of the fiscal year ended December 31, 2024, and certain information included therein is incorporated herein by reference.\n​\nItem 10.  Directors, Executive Officers and Corporate Governance\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 10 with respect to the Directors of the Registrant is incorporated herein by reference to the Proxy Statement.\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 10 with respect to the Executive Officers of the Registrant is incorporated herein by reference to the Proxy Statement.\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 10 with respect to corporate governance is incorporated herein by reference to the Proxy Statement.\n​\nTo the extent disclosure for delinquent reports is being made, it can be found under the caption “Delinquent Section 16(a) Reports” in the Proxy Statement and is incorporated herein by reference to the Proxy Statement.\n​\nThe Company’s Code of Business Conduct and Ethics, which is applicable to all directors, officers and employees of the Company, including the principal executive officer, principal financial officer and principal accounting officer, is available on the Company’s website at \nwww.amphenol.com\n.  The Company intends to post amendments to or waivers from its Code of Business Conduct and Ethics (to the extent applicable to the Company’s principal executive officer, principal financial officer, principal accounting officer or persons performing similar functions) on its website.  In addition, a current copy may be requested by writing to the Company’s World Headquarters at:\n​\n358 Hall Avenue\nP.O. Box 5030\nWallingford, CT 06492\nAttention: Investor Relations\n​\nThe Company has \nadopted\n an Insider Trading Compliance Policy that governs the purchase, sale and other dispositions of its securities by directors, officers and employees of the Company that it believes is reasonably designed to promote compliance with insider trading laws, rules, and regulations, and any listing standards applicable to the Company.  A copy of the Company’s Insider Trading Compliance Policy is filed as Exhibit 19.1 to this Annual Report.\n​\nItem 11.  Executive Compensation\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 11 is incorporated herein by reference to the Proxy Statement.\n​\nItem 12.  Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 12 is incorporated herein by reference to the Proxy Statement, other than the “Equity Compensation Plan Information” provided below.\n​\n96\n\n\nTable of Contents\nEquity Compensation Plan Information\n​\nThe following table summarizes the Company’s equity compensation plan information as of December 31, 2024:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEquity Compensation Plan Information\n​\n​\n    \nNumber of\n    \nWeighted\n    \nNumber of securities remaining\n​\n​\n    \nsecurities to be issued\n​\naverage exercise\n​\navailable for future issuance\n​\n​\n    \nupon exercise of\n​\nprice of outstanding\n​\nunder equity compensation\n​\n​\n​\noutstanding options,\n​\noptions, warrants\n​\nplans (excluding shares\n​\nPlan category\n    \nwarrants and rights\n​\nand rights\n​\nreflected in column (a))\n​\n​\n​\n(a)\n​\n(b)\n​\n(c)\n​\nEquity compensation plans approved by security holders\n    \n 105,704,191\n​\n$\n 29.40\n \n 55,113,594\n​\nEquity compensation plans not approved by security holders\n    \n —\n​\n \n —\n \n —\n​\nTotal\n    \n 105,704,191\n​\n$\n 29.40\n \n 55,113,594\n​\n​\n​\n​\nItem 13.  Certain Relationships and Related Transactions, and Director Independence\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 13 is incorporated herein by reference to the Proxy Statement.\n​\nItem 14.  Principal Accountant Fees and Services\n​\nPursuant to Instruction G(3) to Form 10-K, the information required by Item 14 is incorporated herein by reference to the Proxy Statement.\n​\n97\n\n\nTable of Contents\nPART IV\n​\nItem 15.  Exhibits and Financial Statement Schedules\n​\n(a)(1) Consolidated Financial Statements\n​\n​\n​\nPage\n​\n​\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID No. \n34\n)\n50\n​\n​\nConsolidated Statements of Income—Years Ended December 31, 2024, 2023 and 2022\n52\n​\n​\nConsolidated Statements of Comprehensive Income—Years Ended December 31, 2024, 2023 and 2022\n53\n​\n​\nConsolidated Balance Sheets—December 31, 2024 and 2023\n54\n​\n​\nConsolidated Statements of Changes in Equity—Years Ended December 31, 2024, 2023 and 2022\n55\n​\n​\nConsolidated Statements of Cash Flow—Years Ended December 31, 2024, 2023 and 2022\n56\n​\n​\nNotes to Consolidated Financial Statements\n57\n​\n​\nManagement Report on Internal Control\n95\n​\n​\n(a)(2) Financial Statement Schedules for the Three Years Ended December 31, 2024\n​\n​\n​\nSchedule\n​\n​\n​\nII—Valuation and Qualifying Accounts for the years ended December 31, 2024, 2023 and 2022\n102\n​\nSchedules other than the above have been omitted because they are either not applicable or the required information has been included in the Consolidated Financial Statements or the notes thereto.\n​\n98\n\n\nTable of Contents\n​\n(a)(3) Listing of Exhibits\n​\nThe following exhibits are filed as part of, or incorporated by reference into, this Annual Report:\n​\n​\n3.1\nRestated Certificate of Incorporation of Amphenol Corporation, dated May 19, 2021 (filed as Exhibit 3.1 to the June 30, 2021 Form 10-Q).*\n3.2\nCertificate of Amendment to the Restated Certificate of Incorporation of Amphenol Corporation, dated May 16, 2024 (filed as Exhibit 3.1 to the Form 8-K filed on May 16, 2024).*\n3.3\nAmphenol Corporation, Fifth Amended and Restated By-laws dated August 3, 2023 (filed as Exhibit 3.1 to the Form 8-K filed on August 4, 2023).*\n4.1\nIndenture, dated as of November 5, 2009, between Amphenol Corporation and The Bank of New York Mellon, as trustee (filed as Exhibit 4.1 to the Form 8-K filed on November 5, 2009).*\n4.2\nIndenture, dated as of October 8, 2018, between Amphenol Technologies Holding GmbH, Amphenol Corporation and The Bank of New York Mellon, as trustee (filed as Exhibit 4.1 to the Form 8-K filed on October 9, 2018).*\n4.3\nIndenture, dated as of May 4, 2020, between Amphenol Technologies Holding GmbH, Amphenol Corporation and The Bank of New York Mellon, as trustee (filed as Exhibit 4.1 to the Form 8-K filed on May 5, 2020).*\n4.4\nIndenture, dated as of March 16, 2023, between Amphenol Corporation and U.S. Bank Trust Company, National Association, as trustee (filed as Exhibit 4.1 to the Company’s Registration Statement on Form S-3 filed on March 16, 2023).*\n4.5\nOfficer’s Certificate, dated April 5, 2017, establishing both the 2.200% Senior Notes due 2020 and the 3.200% Senior Notes due 2024 pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on April 5, 2017).*\n4.6\nOfficer’s Certificate, dated January 9, 2019, establishing the 4.350% Senior Notes due 2029 pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on January 10, 2019).*\n4.7\nOfficer’s Certificate, dated September 10, 2019, establishing the 2.800% Senior Notes due 2030 pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on September 10, 2019).*\n4.8\nOfficer’s Certificate, dated February 20, 2020, establishing the 2.050% Senior Notes due 2025 pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on February 20, 2020).*\n4.9\nOfficer’s Certificate, dated September 14, 2021, establishing the 2.200% Senior Notes due 2031 pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on September 14, 2021).*\n4.10\nOfficer’s Certificate, dated March 30, 2023, establishing the 4.750% Senior Notes due 2026 pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on March 30, 2023).*\n4.11\nOfficer’s Certificate, dated April 5, 2024, establishing the 5.050% Senior Notes due 2027, 5.050% Senior Notes due 2029, and 5.250% Senior Notes due 2034, pursuant to the Indenture (filed as Exhibit 4.2 to the Form 8-K filed on April 5, 2024).*\n \n4.12\nOfficer’s Certificate, dated October 31, 2024, establishing the 5.000% Senior Notes due 2035 and 5.375% Senior Notes due 2054, pursuant to the Indenture (filed as Exhibit 4.3 to the Form 8-K filed on October 31, 2024).*\n4.13\nDescription of the Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (filed as Exhibit 4.11 to the December 31, 2023 Form 10-K).*\n10.1\nAmended and Restated 2017 Stock Purchase and Option Plan for Key Employees of Amphenol and Subsidiaries (filed as Annex A to the Company’s Definitive Proxy Statement on Schedule 14A for its 2021 Annual Meeting of Stockholders, filed on April 12, 2021).\n†\n*\n10.2\nForm of 2017 Stock Option Agreement (filed as Exhibit 10.1 to the Form 8-K filed on May 19, 2017).\n†\n*\n10.3\n2009 Stock Purchase and Option Plan for Key Employees of Amphenol and Subsidiaries (filed as Exhibit 10.7 to the June 30, 2009 Form 10-Q).\n†\n*\n10.4\nThe First Amendment to the 2009 Stock Purchase and Option Plan for Key Employees of Amphenol and Subsidiaries (filed as Exhibit 10.2 to the Form 8-K filed on May 23, 2014).\n†\n*\n10.5\nForm of 2009 Non-Qualified Stock Option Grant Agreement dated as of May 20, 2009 (filed as Exhibit 10.8 to the June 30, 2009 Form 10-Q).\n†\n*\n10.6\nForm of 2009 Management Stockholders’ Agreement dated as of May 20, 2009 (filed as Exhibit 10.9 to the June 30, 2009 Form 10-Q).\n†\n*\n10.7\nPension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016 (filed as Exhibit 10.6 to the December 31, 2016 Form 10-K).\n†\n*\n10.8\nFirst Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated November 10, 2016 (filed as Exhibit 10.7 to the December 31, 2016 Form 10-K).\n†\n*\n10.9\nSecond Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated October 1, 2016 (filed as Exhibit 10.8 to the December 31, 2016 Form 10-K).\n†\n*\n99\n\n\nTable of Contents\n10.10\nThird Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated December 13, 2016 (filed as Exhibit 10.9 to the December 31, 2016 Form 10-K).\n†\n*\n10.11\nFourth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated May 2, 2017 (filed as Exhibit 10.12 to the June 30, 2017 Form 10-Q).\n†\n*\n10.12\nFifth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated October 29, 2018 (filed as Exhibit 10.12 to the December 31, 2018 Form 10-K).\n†\n*\n10.13\nSixth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated October 4, 2019 (filed as Exhibit 10.13 to the December 31, 2019 Form 10-K).\n†\n*\n10.14\nSeventh Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated December 2, 2019 (filed as Exhibit 10.14 to the December 31, 2019 Form 10-K).\n†\n*\n10.15\nEighth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated December 9, 2021 (filed as Exhibit 10.15 to the December 31, 2021 Form 10-K).\n†*\n10.16\nNinth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated December 1, 2022 (filed as Exhibit 10.16 to the December 31, 2022 Form 10-K).†*\n10.17\nTenth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated August 28, 2023 (filed as Exhibit 10.17 to the September 30, 2023 Form 10-Q).†*\n10.18\nEleventh Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated December 19, 2024.†**\n10.19\nTwelfth Amendment to Pension Plan for Employees of Amphenol Corporation, as amended and restated effective January 1, 2016, dated December 19, 2024.†**\n10.20\nAmended and Restated Amphenol Corporation Supplemental Employee Retirement Plan (filed as Exhibit 10.24 to the December 31, 2008 Form 10-K).\n†\n*\n10.21\nFirst Amendment to the Amended and Restated Amphenol Corporation Supplemental Employee Retirement Plan, dated October 29, 2018 (filed as Exhibit 10.14 to the December 31, 2018 Form 10-K).\n†\n*\n10.22\nThe 2024 Restricted Stock Plan for Directors of Amphenol Corporation (filed as Annex A to the Company’s Definitive Proxy Statement on Schedule 14A for its 2024 Annual Meeting of Stockholders, filed on April 8, 2024).†*\n10.23\n2024 Restricted Stock Plan for Directors of Amphenol Corporation Restricted Share Award Agreement (filed as Exhibit A of Annex A to the Company’s Definitive Proxy Statement on Schedule 14A for its 2024 Annual Meeting of Stockholders, filed on April 8, 2024).†*\n10.24\n2025 Amphenol Corporation Management Incentive Plan.\n†\n**\n10.25\nThird Amended and Restated Credit Agreement, dated March 21, 2024, among the Company, certain subsidiaries of the Company, a syndicate of financial institutions and JPMorgan Chase Bank, N.A., acting as the administrative agent (filed as Exhibit 10.1 to the Form 8-K filed on March 22, 2024).*\n10.26\nThe Amphenol Corporation Employee Savings/401(K) Plan Adoption Agreement as amended and restated effective April 5, 2022, dated April 18, 2022 (filed as Exhibit 10.23 to the June 30, 2022 Form 10-Q).\n†*\n10.27\nAmendment to The Amphenol Corporation Employee Savings/401(K) Plan Adoption Agreement, effective January 1, 2023, dated December 19, 2022 (filed as Exhibit 10.25 to the December 31, 2022 Form 10-K).†*\n10.28\nAmendment to The Amphenol Corporation Employee Savings/401(K) Plan Adoption Agreement, effective January 1, 2024, dated November 30, 2023 (filed as Exhibit 10.28 to the December 31, 2023 Form 10-K).†*\n10.29\nAmendment to The Amphenol Corporation Employee Savings/401(K) Plan Adoption Agreement, effective January 1, 2025, dated November 21, 2024.†**\n10.30\nAmended and Restated Amphenol Corporation Supplemental Defined Contribution Plan (filed as Exhibit 10.30 to the September 30, 2011 Form 10-Q).\n†\n*\n10.31\nAmphenol Corporation Supplemental Defined Contribution Plan as amended effective January 1, 2012 (filed as Exhibit 10.34 to the December 31, 2011 Form 10-K).\n†\n*\n10.32\nAmphenol Corporation Supplemental Defined Contribution Plan as amended effective January 1, 2019 (filed as Exhibit 10.28 to the December 31, 2018 Form 10-K).\n†\n*\n10.33\nCommercial Paper Program form of Dealer Agreement dated as of August 29, 2014 between the Company, Citibank Global Markets and JP Morgan Securities LLC (filed as Exhibit 10.1 to the Form 8-K filed on September 5, 2014).*\n10.34\nCommercial Paper Program Dealer Agreement dated as of July 10, 2018 between Amphenol Technologies Holding GmbH (as issuer), Amphenol Corporation (as guarantor), Barclays Bank PLC (as Arranger), and Barclays Bank PLC and Commerzbank Aktiengesellschaft (as Original Dealers) (filed as Exhibit 10.1 to the Form 8-K filed on July 11, 2018).*\n10.35\nForm of Indemnification Agreement for Directors and Executive Officers (filed as Exhibit 10.27 to the December 31, 2016 Form 10-K).\n†\n*\n100\n\n\nTable of Contents\n19.1\nAmphenol Corporation Insider Trading Compliance Policy.**\n21.1\nSubsidiaries of the Company.**\n23.1\nConsent of Deloitte & Touche LLP.**\n31.1\nCertification pursuant to Exchange Act Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.**\n31.2\nCertification pursuant to Exchange Act Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.**\n32.1\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.***\n32.2\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.***\n97.1\nAmphenol Corporation Policy for Recovery of Erroneously Awarded Compensation (filed as Exhibit 97.1 to the December 31, 2023 Form 10-K).*\n101.INS\nInline XBRL Instance Document – the Instance Document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.**\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.**\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.**\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.**\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.**\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.**\n104\nCover Page Interactive Data File – the cover page XBRL tags are embedded within the Inline XBRL document (included in Exhibit 101).**\n†\n       Management contract or compensatory plan or arrangement.\n*       Incorporated herein by reference as stated.\n**     Filed herewith.\n***   Furnished herewith.\n​\nItem 16.  Form 10-K Summary\n​\nNot applicable.\n​\n​\n101\n\n\nTable of Contents\n​\nSCHEDULE II\nAMPHENOL CORPORATION AND SUBSIDIARIES\nVALUATION AND QUALIFYING ACCOUNTS\nFor the years ended December 31, 2024, 2023 and 2022\n(Dollars in millions)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nBalance at\n    \nCharged to\n    \n​\n​\n    \nBalance at\n \n​\n​\nbeginning\n​\ncost and\n​\nAdditions\n​\nend of\n \n​\n​\nof period\n​\nexpenses\n​\n(Deductions)\n​\nperiod\n \nAllowance for doubtful accounts:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear ended December 31, 2024\n​\n$\n \n68.4\n​\n$\n \n2.6\n​\n$\n (\n4.5\n)\n​\n$\n \n66.5\n​\nYear ended December 31, 2023\n​\n \n \n63.9\n​\n​\n \n13.4\n​\n​\n (\n8.9\n)\n​\n​\n \n68.4\n​\nYear ended December 31, 2022\n​\n \n \n43.5\n​\n​\n \n20.2\n​\n​\n \n0.2\n​\n \n \n63.9\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nValuation allowance on deferred tax assets:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear ended December 31, 2024\n​\n$\n \n46.6\n​\n$\n \n10.8\n​\n$\n \n16.2\n​\n$\n \n73.6\n​\nYear ended December 31, 2023\n​\n​\n \n42.2\n​\n​\n \n3.4\n​\n​\n \n1.0\n​\n​\n \n46.6\n​\nYear ended December 31, 2022\n​\n \n \n44.9\n​\n​\n (\n1.1\n)\n​\n​\n (\n1.6\n)\n​\n​\n \n42.2\n​\n​\n​\n​\n​\n102\n\n\nTable of Contents\n​\n​\nSignatures\n​\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized in the Town of Wallingford, State of Connecticut on the 7th day of February, 2025.\n​\n​\n​\nAMPHENOL CORPORATION\n​\n​\n​\n​\n​\n/s/ R. Adam Norwitt\n​\nR. Adam Norwitt\n​\nPresident and Chief Executive Officer\n​\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n​\n​\n​\nSignature\n​\nTitle\n​\nDate\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ R. Adam Norwitt\n​\nPresident, Chief Executive Officer and Director\n​\nFebruary 7, 2025\nR. Adam Norwitt\n​\n(Principal Executive Officer)\n​\n​\n​\n​\n​\n​\n​\n/s/ Craig A. Lampo\n​\nSenior Vice President and Chief Financial Officer\n​\nFebruary 7, 2025\nCraig A. Lampo\n​\n(Principal Financial Officer and Principal Accounting Officer)\n​\n​\n​\n​\n​\n​\n​\n/s/ Martin H. Loeffler\n​\nChairman of the Board of Directors\n​\nFebruary 7, 2025\nMartin H. Loeffler\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ David P. Falck\n​\nPresiding Director\n​\nFebruary 7, 2025\nDavid P. Falck\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ Nancy A. Altobello\n​\nDirector\n​\nFebruary 7, 2025\nNancy A. Altobello\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ Edward G. Jepsen\n​\nDirector\n​\nFebruary 7, 2025\nEdward G. Jepsen\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ Rita S. Lane\n​\nDirector\n​\nFebruary 7, 2025\nRita S. Lane\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ Robert A. Livingston\n​\nDirector\n​\nFebruary 7, 2025\nRobert A. Livingston\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ Prahlad Singh\n​\nDirector\n​\nFebruary 7, 2025\nPrahlad Singh\n​\n​\n​\n​\n​\n​\n​\n​\n​\n/s/ Anne Clarke Wolff\n​\nDirector\n​\nFebruary 7, 2025\nAnne Clarke Wolff\n​\n​\n​\n​\n​\n​\n​\n103"
  }
}