{
  "ticker": "APP",
  "cik": "0001751008",
  "company_name": "AppLovin Corp",
  "filing_date": "2025-02-27",
  "accession": "0001751008-25-000018",
  "primary_doc": "app-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nOur mission is to create meaningful connections between companies and their ideal customers. We provide end-to-end artificial intelligence-powered (\"AI\") advertising solutions for businesses to reach, monetize and grow their global audience (\"Advertising\"). We also operate a portfolio of owned mobile apps (“Apps”). Our scaled business model is intricately linked to the advertising ecosystem, providing a durable competitive advantage. We generate revenue when our advertisers achieve their return on spend targets with our Advertising solutions, ensuring that their success directly fuels our growth.\nAppLovin is critical to the success of advertisers and publishers seeking to solve marketing and monetization challenges. Through our technologies and scaled distribution, advertisers are able to better place content so that it is discovered by the right audience, manage, optimize, and analyze their marketing investments, and improve the monetization of their content, and publishers are able to better monetize their gaming apps. Our Advertising solutions include a comprehensive suite of tools including: \n•\nAppDiscovery, our user acquisition solution, is the cornerstone of our Advertising solutions. AppDiscovery is powered by AXON, our AI-powered advertising engine, and matches advertiser demand with publisher supply through auctions at vast scale and at microsecond-level speeds.\n•\nMAX is our monetization solution, utilizing an advanced in-app bidding technology that optimizes the value of a publisher’s advertising inventory by running a real-time competitive auction, driving more competition, and higher returns for publishers.\n•\nAdjust is our measurement and analytics marketing platform which provides marketers with the visibility, insights, and data needed to scale their apps marketing and drive more informed results. \n•\nWurl is our connected TV (\"CTV\") platform that both distributes streaming video for content companies and provides advanced advertising and publishing solutions to attract viewers and maximize revenue.\nWe generate our revenue from Advertising and our Apps. As more advertisers use our Advertising solutions to market and monetize their content, we gain access to more data regarding users and user engagement\n1\n, further strengthening our scaled distribution. As our distribution grows, we gain better insights for our AXON recommendation engine, which then further enhances the efficiency and effectiveness of our Advertising solutions. Our Apps consist of a globally diversified portfolio of over 200 free-to-play mobile games across five genres, run by ten studios, some of which we own and others that we partner with. Our studios generally focus on the development of easy to learn and play games, which appeal to a broad range of demographics, but our portfolio also includes several games for other genres.\nWe report our operating results through two reportable segments: Advertising and Apps. These segments align with how our Chief Operating Decision Maker (\"CODM\") allocates resources, makes operating decisions, and manages and assesses the performance of our business. For the amount of revenue derived from our two segments and other relevant data for the years ended December 31, 2024, 2023, and 2022, as well as other additional information, see Note 14 of our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nAppLovin Advertising\nOur comprehensive, end-to-end Advertising solutions deliver value by helping companies scale their businesses and maximize their revenue. Specifically, our solutions enable advertisers to automate their marketing, engagement, and monetization efforts in three core ways. First, we provide marketing technology that allows advertisers to reach more of the most suitable users with personalized content in order to increase the number of users who download and engage with their content. Second, we provide advertisers with monetization and analytics technology to maximize the value of their advertising inventory \n1\n \nAdjust’s marketing platform is operated by our wholly-owned subsidiary and data generated by Adjust's services is not shared with AppLovin or incorporated into or used to optimize its recommendation engine or other technologies. \n2\nTable\n of \nContents\nby obtaining a high price for each impression. Third, we provide developers, who are often also advertisers, a set of capabilities to optimize their apps and help streamline their businesses. Additionally, we have entered the CTV advertising market with the integration of Wurl.\nOur Advertising solutions also enable publishers to leverage real-time auctions that optimize the value for each impression, while simultaneously enabling them to attain an attractive value for each of the impressions from their advertising inventory. When these mutually reinforcing elements are combined, it creates a robust and successful marketing and monetization engine that both sells attractive advertising inventory to advertisers while monetizing it for publishers. \nOur Advertising solutions are delivered through an integrated and seamless user interface, which provides the following benefits to advertisers: \n•\nReach and attract users at scale: \nWe provide advertisers with access to approximately 1.6 billion daily active users\n2\n, enabling developers to target and find the right users for their content worldwide. Advertisers are able to set their user acquisition and revenue goals to target the most relevant, highest value users.\n•\nMaximize monetization of engagement: \nAdvertisers use MAX to generate incremental revenue by maximizing the monetization of their ad inventory. Our tools operate at microsecond-level speeds and at vast scale to enhance monetization for developers while preserving the end user experience.\n•\nLeverage proprietary data and insights: \nAdvertisers benefit from accessing comprehensive real-time insights through our customized user dashboards, helping them optimize campaigns, improve user engagement, and manage their return on investment.\n•\nAutomate time consuming and manual processes: \nOur Advertising solutions automate marketing and monetization, allowing advertisers to focus on improving their content rather than managing complex go-to-market processes manually.\n•\nSeamlessly adapt to industry innovation: \nOur technology is regularly updated as the advertising ecosystem evolves. Advertisers benefit from this ongoing advancement and optimization and are able to rapidly adapt to industry changes in marketing and monetization without losing focus on content creation.\nOur Advertising solutions are primarily made up of four key products: AppDiscovery, MAX, Adjust, and Wurl.\nAppDiscovery \nAppDiscovery is a suite of marketing solutions that enables developers to automate, optimize, and manage their marketing efforts. AppDiscovery is powered by AXON's predictive algorithms to enable advertisers to match their apps to users that are more likely to download them. This form of personalized advertising focuses on the end user, enabling the advertisers to find the right users and delivering to users more of what they are likely to be interested in. Advertisers set return goals for their campaigns and AppDiscovery targets users to match those goals. Return on advertising spend is measured based on third-party attribution, Advertisers are charged for advertising dynamically based on the revenue they receive from acquired users, rather than a simple fixed price per impression or per action (click or installation). Advertisers are not only able to attract users that download, but also find a high volume of users that stay and engage with their apps for greater retention and ultimately, increased opportunities for better monetization. Revenue from AppDiscovery comprises a vast majority of our Advertising Revenue.\nWith AppDiscovery, advertisers can define the framework of their campaigns in the following ways:\n•\nReach:\n Advertisers identify what they are willing to pay to acquire their target users. Our technology finds the users at that value who are most likely to download and engage with the app.\n•\nGlobal scale:\n Advertisers can choose to connect with users in different regions around the world, and our technology suggests the best locations based on their parameters.\n2\n \nWe calculate daily active users as the average number of unique device identities that open a mobile app (whether that mobile app our own or a third party’s) which has our software development kit (SDK) on each day in a period. We measure this figure through our SDK. An individual who uses an app in more than one country on a particular day will be counted as more than one unique device identity; however, if an individual uses more than one app in the same day, such individual is only counted once. This figure does not include any users who have opted out of allowing apps to track on their mobile phone\n.\n3\nTable\n of \nContents\n•\nRetain and engage:\n Our system is built around optimizing to the advertisers revenue so our algorithms automatically adjust based on the likelihood users will engage. Our clients can analyze by retention periods from initial app download onwards, so that advertisers understand the effectiveness of their marketing investments.\n•\nTargeted returns:\n Advertisers set their goals and target return on ad sales and our algorithms adjust cost and campaign specifics to meet them.\nAppDiscovery includes the following features:\n•\nAdvanced campaign management:\n An interface to create, manage, and automatically optimize campaigns based on return on ad sales goals.\n•\nReal-time analytics:\n An interface to see results and optimize against them with our ROI-based analytics environment.\n•\nLifetime Value (\"LTV\") reporting:\n A tool that breaks down campaign results by source and location, allowing advertisers to make real-time, informed decisions about the value and longevity of their campaigns.\n•\nHigh quality and quantity creatives:\n Advertisers can make and test as many creatives as needed. They also have access to our in-house creative team, SparkLabs, for expert ad creation and testing strategies.\nMAX \nMAX is our in-app bidding solution that optimizes the value of publishers' advertising inventory by running a single unbiased, real-time competitive auction, driving more competition and higher returns for publishers. MAX auctions are more effective than historical tools and approaches because MAX yields more targeted users for advertisers and enables publishers to achieve better competitive prices for each impression. Many developers who integrate MAX have experienced a measurable increase in their average revenue per daily active user (\"ARPDAU\") over traditional monetization tools and save countless hours because they are able to automate manual monetization work through its advanced feature set. As a result, MAX has become the preferred in-app bidding solution for many publishers worldwide, helping drive meaningful growth and momentum for AppLovin.\nMAX includes the following features:\n•\nAdvanced in-app bidding technology: \nMAX’s competitive auctions happen in real time with most bidding platforms in the industry bidding simultaneously for developers’ inventory at high volume. The competitive global demand helps maximize average revenue per user on each impression with many developers experiencing a measurable increase when moving to MAX.\n•\nAutomated monetization: \nMAX saves developers time through its extensive suite of APIs for automation.\n•\nAd quality assurance and review: \nMAX drives superior user experience with exclusive features that automatically flag risky content to keep developers’ brands safe.\n•\nPowerful insights: \nMAX helps developers better understand the LTV for each user and increase revenue to maximize yield for each ad opportunity.\nAdjust\nAdjust is our measurement and analytics marketing platform which provides the visibility, insights, and tools marketers need to grow their apps from early stage to maturity. Our software-as-a-service (\"SaaS\") platform is an end-to-end solution for optimizing ad performance and maximizing returns, powered by accurate attribution data and in-depth reporting that are essential for meeting business goals. Adjust allows clients to better understand their users’ journey while allowing marketers to make smarter decisions through measurement, attribution, and fraud prevention.\nThe Adjust product solutions allow customers to benefit from the following key features: \n•\nImpact through measurement:\n Drive results faster with accurate, timely measurement on marketing and ad spend across channels.\n•\nInsights through real-time data and reports: \nEasily share timely, actionable insights with stakeholders to drive their business forward.\n•\nStrategic growth with automated attribution solutions: \nScale profits with automated solutions that attribute sources and help customers work smarter and accomplish more.\nWurl\nWurl is our connected TV (\"CTV\") platform which distributes streaming video for content companies and provides advertising and publishing solutions to maximize Advertising Revenue, grow their CTV viewership, and strengthen their brand value. Wurl focuses on driving the streaming industry forward with market-leading solutions that help connect the right viewers to the right content. It brings data-driven advertising and measurement to Connected TV. The technology helps companies engage with the highest-value viewers, and ultimately increase their revenue.\n4\nTable\n of \nContents\nWurl has built the following products to meet their customers’ needs:\n•\nAdPool: \nis a monetization solution that connects CTV supply with top advertisers and access to exclusive demand.\n•\nTVBits:\n is an AI-powered interactive, personalized, short-form CTV application that allows viewers to discover content and content companies and streamers the ability to increase viewership, engagement, and revenue.\n•\nBrandDiscovery:\n is an AI-powered CTV advertising tool that identifies contextual segments based on genre, brand safety, and the emotion of each scene to help advertisers deliver the right ad at the right time.\n•\nContentDiscovery:\n is an AI-powered advertising solution that grows audiences, increases engagement, and reduces churn for streaming platforms and apps.\n•\nGlobal FAST Pass (GFP):\n is a distribution solution that makes it easy to launch Free Ad-supported CTV channels, monetize them instantly, and access data to grow and retain audiences.\nAppLovin Apps\nToday, our Apps consist of a globally diversified portfolio of over 200 free-to-play mobile games across five genres, run by ten studios located worldwide with a deep bench of talented developers. Our studios have developed and published games across a number of genres including: casual, match-three, card/casino, mid-core, and hyper-casual. A large portion of our portfolio are casual, match-three and card/casino games that have a lower risk of development and generally have more predictable revenue streams and return. These games can be played a few minutes at a time and appeal to a wide range of users across many highly attractive demographics. Our studios leverage live ops to quickly iterate and increase in-game monetization by optimizing app economies and improving in-game conversion on items and offers. The studios operating our portfolio of Apps utilize our Advertising solutions to market, scale, and monetize our Apps.\nOn February 12, 2025, we announced that we had entered into a term sheet for the sale of our mobile gaming business to a privately held company for total consideration of $900.0 million, consisting of $400.0 million in shares of the acquirer’s common equity and $500.0 million in cash, subject to customary purchase price adjustments. For additional information, refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations—Recent Developments\".\nOur Strategy for Growth\nWe have a comprehensive strategy to continue our growth and further enhance our market position in the advertising ecosystem:\n•\nExisting market expansion: \nWe continue to have an attractive market opportunity within our current mobile app segment, which we intend to address through the optimization of our Advertising solutions.\n•\nEnhance and extend AI-based technologies: \nAs we increase our scale and reach, our customers benefit from compounding improvements to AXON, our AI-powered advertising engine, which in turn improves the efficacy and growth of our Advertising solutions.\n•\nNew market expansion: \nWe are confident our technology and expertise are applicable to other market segments and geographies we have not historically addressed, including:\n◦\nNon-gaming mobile app segments and industries:\n One of our long-term objectives is to provide critical tools to mobile app developers across multiple verticals, including, for example, e-commerce and social media. We have made our Advertising solutions available to e-commerce advertisers, and while we are early in this market expansion, our e-commerce customers to date have experienced positive results, demonstrating the flexibility and future growth potential of our Advertising solutions.\n◦\nOther content industries: \nWe believe our deep expertise and capabilities will allow us to successfully apply our solutions to tangential sectors, including with mobile OEMs and carriers through our Array product initiative, as well as the growing CTV industry through Wurl. We continue to expand our CTV business through the addition of new content advertisers and supply channels as well as through the application of AXON to CTV. \n◦\nIndustry partnerships:\n We plan to further invest in our sales and marketing teams to increase penetration among new and existing clients, including in expansion markets we are targeting. \n•\nAttracting and retaining the best talent:\n Our employees are at the core of our technology and success. We intend to continue to invest in attracting and retaining exceptional talent who share our values and will drive our future growth.\n•\nPursue strategic investments and partnerships: \nGiven our proven track record in strategic transactions, and our long-standing relationships with key industry players, we have earned a reputation as a partner of choice, and will continue to consider and leverage strategic acquisitions, partnerships, and investment opportunities to accelerate our growth.\n5\nTable\n of \nContents\nOur Customers and Developer Community\nOur globally diverse customers range from the largest enterprises to small and independent businesses and individuals across a variety of industries. Our customers comprise multiple groups within the advertising ecosystem including advertisers leveraging our platform to find users and advertising networks using our mediation solution to purchase advertising inventory. Our Apps also work with advertising networks who purchase advertising inventory and consumers who purchase in-app products. We also work with the mobile app publisher community who leverage our mediation solution to monetize their advertising inventory. The scale and breadth of our customers in terms of size and industry provides us with a competitive advantage.\nCompetition\nWe operate in a fragmented advertising ecosystem composed of divisions of large, well-established companies as well as privately-held companies. The large companies in our advertising and mobile app ecosystems may play multiple different roles given the breadth of their businesses.\n•\nAdvertisers typically engage with several advertising platforms and networks to purchase advertisements on mobile apps, devices, and on CTV, looking to optimize their marketing investments. Such advertising companies vary in size and include Facebook, Google, Amazon, and Unity Software, as well as various private companies, several of which are also our partners and clients.\n•\nThere are many companies that develop online and mobile games and other mobile apps. The larger gaming companies in our gaming ecosystem include Activision Blizzard (Microsoft), Tencent, and Zynga (Take-Two Interactive), as well as other public and private companies, many of which are also our partners and clients. We also expect new developers to enter the market and existing companies to allocate more resources to develop and market more mobile games and apps.\nWe believe that the principal competitive factors in our market are:\n•\nthe ability to enhance and improve technologies and offerings;\n•\nknowledge, expertise, and experience in the advertising ecosystem;\n•\nrelationships with third parties in the advertising ecosystem;\n•\nthe ability to reach and target a large number of users;\n•\nthe ability to identify and execute on strategic transactions;\n•\nthe ability to successfully launch and monetize mobile apps;\n•\nthe pricing and perceived value of offerings;\n•\nbrand and reputation; and\n•\nability to expand into new offerings and geographies.\nWe believe we compete favorably with respect to these factors.\nSeasonality\nThe revenue we generate from our Advertising solutions may experience seasonality in the fourth quarter of the year due in part to seasonal holiday demand. As the breadth of advertisers using our Advertising solutions increases, the impact of this seasonality may become more pronounced over time. \nResearch and Development\nContinued investment in research and development is important to advancing our Advertising solutions, and Apps. The continued development of our AI-powered AXON advertising engine is critical to our future growth and competitive advantage. These AI advancements are also key to attaining our strategic objectives and meeting the evolving needs of our customers. The underlying elastic architecture of our solutions allows us to create, test, and deploy new features rapidly while distributing them globally. \nOur research and development team is working on cutting edge technologies, which allows us to attract top talent globally. As of December 31, 2024, we had approximately 788 employees, or 50% of our total headcount, involved in research and development and related activities. Our research and development organization is based in Palo Alto, California with additional resources around the world.\nIntellectual Property\nOur success depends in part upon our ability to protect our intellectual property rights with respect to our Advertising solutions and Apps, and to operate without infringing, misappropriating or otherwise violating valid and enforceable third-party intellectual property. We seek to accomplish that objective by establishing intellectual property rights in and protecting those assets through a combination of registered and unregistered trademarks, copyrights, trade secrets, license agreements, confidentiality procedures, non-disclosure agreements with third parties, and other contractual measures. Though we rely in part \n6\nTable\n of \nContents\nupon these legal and contractual protections, we believe that factors, such as our unique position in the advertising ecosystem, our expertise and determination of our employees, the speed of our technological development and the functionality and flexibility of our Advertising solutions in an ever-evolving industry, are critical contributors to our success.\nAs of December 31, 2024, we owned the following trademarks related to the business: 58 registered trademarks in the United States, 16 pending trademark applications in the United States, as well as 400 registered trademarks in non-U.S. jurisdictions, and 31 pending trademark applications in various non-U.S. jurisdictions. We also have registered domain names for websites that we use in our business, such as www.applovin.com. As of December 31, 2024, we owned seven patents related to our Advertising solutions and four related to our Apps business. \nWe intend to pursue additional intellectual property protection to the extent we believe it would advance our business objectives and maintain our competitive position. Notwithstanding these efforts, there can be no assurance that we will adequately protect our intellectual property or that it will provide any competitive advantage. We take steps to protect our proprietary information, in part, by entering into confidentiality agreements with our employees, consultants, developers, and vendors, and generally limiting access to and distribution of our proprietary information. However, we cannot assure you that the steps taken by us will prevent misappropriation of our proprietary rights. Despite our efforts to protect our intellectual property rights, unauthorized parties may attempt to copy aspects of our Advertising solutions or Apps or obtain and use information that we regard as proprietary. Policing unauthorized use of our proprietary rights is difficult and time consuming. Further, our intellectual property rights may be invalidated, circumvented, or challenged. In addition, the laws of some foreign countries do not protect our proprietary rights to the same extent as the laws of the United States, and many foreign countries do not enforce these laws as diligently as government agencies and private parties in the United States. See the section titled “Risk Factors—Risks Related to Intellectual Property” for more information regarding risks related to intellectual property.\nEmployees and Human Capital Resources\nAs of December 31, 2024, we had a total of 1,563 employees, comprised of 1,533 full-time and 30 part-time/intern employees, located in 17 countries. As a result of our historical strategic acquisition and partnership activity, we also have access to approximately 2,000 additional team members, a majority of whom are research and development resources and all of whom are located outside of the United States. Our geographic diversification enhances our ability to retain and attract highly skilled talent as well as manage our headcount costs. As of December 31, 2024, approximately 54% of our global employees were located outside of the U.S. and 46% in the U.S. Approximately 45% of our U.S. employees are from one or more diverse groups, including Asian, Hispanic or Latino, Black or African American, Native Hawaiian or Other Pacific Islander, American Indian or Alaska Native, or Two or More Races and approximately 34% of our U.S. employees are female. None of our employees are represented by a labor union. In certain countries in which we operate, we are subject to, and comply with, local labor law requirements, which may automatically make our employees subject to industry-wide collective bargaining agreements. We have not experienced any work stoppages and we consider our relations with our employees as positive. \nOur employees are a key reason for our success and essential for our continued growth. We benefit from a distributed global workforce and plan to continue investing in our employees. We provide competitive compensation packages designed to attract and retain talent, as informed by market compensation surveys and data. We have multiple incentive programs throughout the organization designed to provide short-term and long-term incentives, including base cash, equity and/or performance cash awards. \nCompliance with Government Regulation\nWe are subject to various federal, state, and international laws and regulations that affect companies conducting business on mobile platforms, including those relating to privacy, data protection, and the use and protection of data from employees, users and others (including minors), the internet, behavioral advertising, mobile apps, content, advertising and marketing activities, sweepstakes and giveaways, e-commerce and anti-corruption. Additional laws and regulations relating to these areas likely will be passed in the future, and these or existing laws and regulations may be interpreted or enforced in new or expanded manners, each of which could result in significant limitations on ways we can collect and process data of users, employees and others, communicate with users, and operate our business. New and evolving laws and regulations, and changes in their enforcement and interpretation, may require changes to our Advertising solutions, Apps, or business practices, and may significantly increase our compliance costs and otherwise adversely affect our business and results of operations. As our business expands to further scale our Advertising solutions and include additional Apps, as we continue to operate our AI-powered advertising engine AXON, and as our operations continue to expand internationally, our compliance requirements and costs may increase and we may be subject to increased regulatory scrutiny.\nData Privacy and Security Laws\nThe data we collect and otherwise process is integral to our Advertising solutions and Apps, providing us with insights to improve our AI-powered advertising engine AXON and our developer tools, to optimize app discovery and monetization and to improve our Apps. Our collection, use, receipt, and other processing of data in our business subjects us to numerous U.S. state and federal laws and regulations, and foreign laws and regulations, addressing privacy, data protection and the collection, storing, sharing, use, transfer, disclosure, protection and processing of certain types of data. Such regulations include, for example, the European Union General Data Protection Regulation, the Children’s Online Privacy Protection Act, Section 5(a) of the Federal Trade Commission Act, and the California Consumer Privacy Act and similar U.S. state laws. We work to comply with, and to help allow developers and advertising ecosystem partners to comply with, applicable laws and regulations relating to privacy, data protection and information security. This helps underpin our strategy of building trust and providing a strong \n7\nTable\n of \nContents\nexperience to advertising ecosystem partners and clients. See the section titled “Risk Factors—Risks Related to Legal and Regulatory Matters—We are subject to laws and regulations concerning privacy, information security, data protection, consumer protection, advertising, tracking, targeting, and protection of minors, and these laws and regulations are continually evolving. Our actual or perceived failure to comply with these laws and regulations could adversely affect our business, financial condition, and results of operations” for additional information about our approach to laws and regulations relating to privacy, data protection, and information security.\nCorporate Information\nWe were incorporated under the laws of the state of Delaware in July 2011. Our principal executive offices are located at 1100 Page Mill Road, Palo Alto, California 94304, and our telephone number is (800) 839-9646. Our website address is www.applovin.com. Information contained on, or that can be accessed through, our website does not constitute part of this Annual Report on Form 10-K and inclusions of our website address in this Annual Report on Form 10-K are inactive textual references only. You should not consider information contained on our website to be part of this Annual Report on Form 10-K or in deciding whether to purchase shares of our Class A common stock.\n“AppLovin,” our logo, and our other registered or common law trademarks, service marks, or trade names appearing in this Annual Report on Form 10-K are the property of AppLovin Corporation. Other trademarks and trade names referred to in this Annual Report on Form 10-K are the property of their respective owners.\nAvailable Information\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, or the Exchange Act, are filed with the SEC. Such reports and other information filed by us with the SEC are available free of charge on our website at www.investors.applovin.com when such reports are available on the SEC’s website. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at www.sec.gov. The information contained on the websites referenced in this Annual Report on Form 10-K is not incorporated by reference into this filing. Further, our references to website URLs are intended to be inactive textual references only.\nWe announce material information to the public through filings with the SEC, the investor relations page on our website, press releases, public conference calls, webcasts, and our corporate blog at blog.applovin.com in order to achieve broad, non-exclusionary distribution of information to the public and for complying with our disclosure obligations under Regulation FD. We encourage investors, the media, and others to follow the channels listed above and to review the information disclosed through such channels. Any updates to the list of disclosure channels through which we will announce information will be posted on the investor relations page on our website.\n8\nTable\n of \nContents",
    "item1a": "Item 1A, “Risk Factors” in this Annual Report on Form 10-K, including the risk factor entitled “Security breaches, improper access to or disclosure of our data or user data, other hacking and phishing attacks on our systems, or other cyber incidents could harm our reputation and adversely affect our business.”\nGovernance\nOne of the key functions of our Board of Directors is informed oversight of our risk management process, including risks from cybersecurity threats\n. \nOur Board of Directors is responsible for monitoring and assessing strategic risk exposure, and our executive officers are responsible for the day-to-day management of the material risks we face\n. \nOur Board of Directors administers its cybersecurity risk oversight function directly as a whole, as well as through the Audit Committee\n.\n40\nTable\n of \nContents\nOur \nHead of Information Security and Compliance\n and our \nInfoSec management team\n are primarily responsible for assessing and managing our material risks from cybersecurity threats. \nOur Head of Information Security and Compliance has over two decades of experience leading cybersecurity, data privacy and risk management programs for large, multi-national organizations and Fortune 500 companies, and CISSP and CRISC certifications\n. Our InfoSec management team is comprised of qualified cybersecurity professionals whose collective expertise includes penetration testing, cyber threat intelligence, data privacy, information security, and risk and compliance in the healthcare, financial, and technology industries, with certifications such as CISA, CRISC, CISSP, CCSP, CIPP, GIAC, and OSCP.\nOur Head of Information Security and Compliance and our InfoSec management team, in partnership with our legal privacy team, oversee our cybersecurity policies and processes, including those described in “Risk Management and Strategy” above. \nOur Head of Information Security and Compliance and our InfoSec management team are informed about and monitor the prevention, detection, mitigation, and remediation of cybersecurity incidents through their implementation and oversight of safeguards, including through the use of automated tools and manual processes, like security event monitoring, vulnerability scanning, threat analytics, security awareness and training, endpoint security, bug bounty program, offensive security testing, and third-party risk and monitoring\n.\nOur Head of Information Security and Compliance provides quarterly and as needed briefings to the Audit Committee\n regarding our company’s cybersecurity program and information security risks, including any recent AppLovin-related cybersecurity incidents and possible responses, internal and third-party cybersecurity systems testing, third-party risk management, and other topics related to cybersecurity. The Audit Committee provides updates to the Board on such reports. The Company has adopted an escalation process for review of cybersecurity incidents, based on severity level, by an internal cyber task force with oversight by the Audit Committee. In addition, our Head of Information Security and Compliance provides annual briefings to the Board on our cybersecurity program and risks.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNot applicable.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy.\nWe have established policies and processes for assessing, identifying, and managing material risk from cybersecurity threats, and have integrated these processes into our overall risk management systems and processes\n. We routinely assess material risks from cybersecurity threats, including any potential unauthorized occurrence on, or conducted through, our information systems, that may result in adverse effects on the confidentiality, integrity, or availability of our information systems or any information residing therein.\nWe conduct periodic risk assessments to identify potential cybersecurity threats, as well as assessments in the event of a material change in our business practices that may affect information systems that are vulnerable to such cybersecurity threats. The frequency of these risk assessments is based on the potential risk and criticality to our business systems. The risk assessments include identification of reasonably foreseeable internal and external risks, the likelihood and potential impact and damage that could result from such risks, and the sufficiency of existing policies, procedures, systems, and safeguards in place to manage such risks.\nFollowing these risk assessments, we evaluate how to reasonably address identified gaps in existing safeguards to minimize identified risks and regularly monitor the effectiveness of our safeguards. We devote significant resources and designate high level personnel, including our Head of Information Security and Compliance, to manage the risk assessment and mitigation process.\nAs part of our overall risk management system, we monitor and test our safeguards, in collaboration with human resources, IT, and management. Personnel at all levels and departments are made aware of our cybersecurity policies and educated about cybersecurity best practices through annual company-wide cybersecurity training, regular phishing simulations and cybersecurity reminders, and role-based training, as appropriate.\nOur cybersecurity risk management program is closely based upon recognized frameworks established by the National Institute of Standards and Technology, the International Organization for Standardization and certain other applicable industry standards. In 2024, we obtained our ISO/IEC27001 certification. \nWe engage consultants and third parties in connection with our risk assessment processes\n. These providers assist us in evaluating our cybersecurity program, provide support for threat monitoring and detection, and scan for vulnerabilities and other related security events which may pose a risk to the company.\nWe utilize our third-party risk management program to evaluate the cybersecurity posture of our third-party service providers based on risk, including data and systems access. These processes assist us in identifying and mitigating risks from cybersecurity threats associated with our use of third-party service providers. \nWhere appropriate, we contractually require third-party service providers to implement and maintain appropriate and reasonable security measures in connection with their work with us and consistent with applicable laws, and to promptly report any breach of their security measures or systems that may affect our company\n.\nTo date, we have not identified any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect our company, including our business strategy, results of operations, or financial condition\n. However, despite our efforts, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced cybersecurity incidents. For information about these risks, see Part I,"
  }
}