{
  "ticker": "APTV",
  "cik": "0001521332",
  "company_name": "Aptiv PLC",
  "filing_date": "2025-02-07",
  "accession": "0001521332-25-000010",
  "primary_doc": "aptv-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nIn December 2024, Old Aptiv (as defined below), a public limited company formed under the laws of Jersey on May 19, 2011, completed its previously announced reorganization transaction (the “Transaction,” or the “reorganization transaction”), in which Old Aptiv established a new publicly-listed Jersey parent company, Aptiv Holdings Limited (“New Aptiv”), which is resident for tax purposes in Switzerland. As a result of the Transaction, all issued and outstanding ordinary shares of Old Aptiv were exchanged on a one-for-one basis for newly issued ordinary shares of New Aptiv. Following consummation of the Transaction, holders of Old Aptiv shares became ordinary shareholders of New Aptiv, Old Aptiv became a wholly-owned subsidiary of New Aptiv and New Aptiv was renamed “Aptiv PLC.” The previous publicly-listed Jersey parent company, which was an Irish tax resident, is referred to as “Old Aptiv” throughout this Annual Report on Form 10-K. New Aptiv’s ordinary shares are publicly traded on the New York Stock Exchange (“NYSE”) under the symbol “APTV,” the same symbol under which the Old Aptiv shares were previously listed. Aptiv PLC remains a public limited company incorporated under the laws of Jersey, and continues to be subject to U.S. Securities and Exchange Commission reporting requirements.\nIn December 2024, following the completion of the Transaction, Old Aptiv merged with and into Aptiv Swiss Holdings Limited (“Aptiv Swiss Holdings”), a newly formed Jersey incorporated private limited company, and a direct, wholly-owned subsidiary of New Aptiv, with Aptiv Swiss Holdings surviving as a direct, wholly owned subsidiary of New Aptiv, and Old Aptiv ceasing to exist. Except as otherwise noted, all property, rights, privileges, powers and franchises of Old Aptiv vested in Aptiv Swiss Holdings, and all debts, liabilities and duties of Old Aptiv became debts, liabilities and duties of Aptiv Swiss Holdings.\nIn connection with the Transaction, New Aptiv assumed Old Aptiv’s Long-Term Incentive Plans and its existing obligations in connection with awards granted thereunder, and Aptiv Swiss Holdings (i) entered into a supplemental indenture to each indenture in which Aptiv Swiss Holdings assumed all of Old Aptiv’s obligations under each series of Old Aptiv’s outstanding Notes and (ii) entered into an assumption and/or supplement agreement relating to each Credit Agreement in which New Aptiv assumed all of Old Aptiv’s obligations under each Credit Agreement as the “parent entity” thereunder. In addition, New Aptiv (i) entered into a supplemental indenture to each indenture in which New Aptiv guaranteed the outstanding Notes and (ii) entered into a guarantee joinder relating to each Credit Agreement in which New Aptiv guaranteed the obligations under each Credit Agreement. Following the reorganization transaction, Aptiv Swiss Holdings replaced Old Aptiv as an obligor under the Credit Agreements, the senior notes and the junior notes, and New Aptiv became a guarantor under the Credit Agreements (and will act as the “parent entity” thereunder) and the indentures.\nAs a result of the Transaction described above, there were no material changes in Aptiv PLC’s operations or governance. The consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”).\nReferences in this Annual Report on Form 10-K, including the exhibits being filed as part of this report, to “Aptiv PLC,” “Aptiv,” the “Company,” “we,” “us” and “our” refers to Old Aptiv (Aptiv PLC before the Transaction in December 2024) and to New Aptiv (Aptiv PLC after the Transaction in December 2024).\nAptiv is a global technology company focused on making the world safer, greener and more connected. We deliver end-to-end mobility solutions, enabling our customers’ transition to a more electrified, software-defined future. We design and manufacture vehicle components and provide electrical, electronic and active safety technology to the global automotive and commercial vehicle markets, creating the software and hardware foundation for vehicle features and functionality. Our Advanced Safety and User Experience segment is focused on providing the necessary software and advanced computing platforms, and our Signal and Power Solutions segment is focused on providing the requisite networking architecture required to support the integrated systems in today’s complex vehicles. Together, our businesses develop the ‘brain’ and the ‘nervous system’ of increasingly complex vehicles, providing integration of the vehicle into its operating environment.\nWe are one of the largest vehicle technology suppliers and our customers include the 25 largest automotive original equipment manufacturers (“OEMs”) in the world. We operate 140 major manufacturing facilities and 11 major technical centers utilizing a regional service model that enables us to efficiently and effectively serve our global customers from best cost countries. We have a presence in 49 countries and have approximately 21,200 scientists, engineers and technicians focused on developing market relevant product solutions for our customers.\nWe are focused on growing and improving the profitability of our businesses, and have implemented a strategy designed to position the Company to deliver industry-leading long-term shareholder returns. This strategy includes disciplined investing in our business to grow and enhance our product offerings, strategically focusing our portfolio in high-technology, high-growth spaces in order to meet consumer preferences and leveraging an industry-leading cost structure to expand our operating margins.\n5\nTable of Contents\nPlanned Spin-off of Electrical Distribution Systems Business\nOn January 22, 2025, we announced our intention to pursue a separation of our Electrical Distribution Systems business through a transaction expected to be treated as a tax-free spin-off to Aptiv’s shareholders. The Company plans to complete the separation by March 31, 2026, subject to customary closing conditions.\nWebsite Access to Company’s Reports\nAptiv’s website address is \naptiv.com\n. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the “Exchange Act”) are available free of charge through our website as soon as reasonably practicable after they are electronically filed with, or furnished to, the Securities and Exchange Commission (“SEC”).\nOur Company\nWe believe the automotive industry is being shaped by rapidly increasing consumer demand for new mobility solutions, advanced technologies, including software-defined vehicles, and vehicle connectivity, as well as government regulation related to vehicle safety, fuel efficiency and emissions control. More broadly, the “Safe,” “Green” and “Connected” mega-trends are expected to drive higher growth for our products than the underlying markets they serve. We have organized our business into two diversified segments, which enable us to develop technology solutions and manufacture highly-engineered products that enable our customers to respond to these mega-trends:\n•\nAdvanced Safety and User Experience\n—This segment, which includes our Active Safety, User Experience and Smart Vehicle Compute and Software businesses, provides critical technologies and services to enhance vehicle safety, security, comfort and convenience, including sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, cloud-native software platforms, application software, autonomous driving technologies and end-to-end DevOps tools. \n•\nSignal and Power Solutions\n—This segment, which includes our Engineered Components Group and Electrical Distribution Systems businesses, provides complete design, manufacture and assembly of the vehicle’s electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management, electrical centers and high voltage power and safety-critical data distribution systems. Our products provide the signal distribution and computing power backbone that supports increased vehicle content and electrification, reduced emissions, higher fuel economy and off-vehicle connectivity.\nRefer to Results of Operations by Segment in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 22. Segment Reporting to the audited consolidated financial statements for financial information about our business segments.\nOur business is diversified across end-markets, regions, customers, vehicle platforms and products. Our customer base includes the 25 largest automotive OEMs in the world, and in 2024, 29% of our net sales came from the Asia Pacific region, which we have identified as a key market likely to experience substantial long-term growth. Our ten largest platforms in 2024 were with seven different OEMs. In addition, in 2024 our products were found in 17 of the 20 top-selling vehicle models in the United States (“U.S.”), 17 of the 20 top-selling vehicle models in Europe and 12 of the 20 top-selling vehicle models in China.\nWe have established a worldwide design and manufacturing footprint with a regional service model that enables us to efficiently and effectively serve our global customers from best cost countries. This regional model is structured primarily to service the North American market from Mexico, the South American market from Brazil, the European market from Eastern Europe and North Africa, and the Asia Pacific market from China. Our global scale and regional service model enables us to engineer globally and execute regionally to serve the largest OEMs, which are seeking suppliers that can serve them on a worldwide basis. Our footprint also enables us to adapt to the regional design variations the global OEMs require while also serving key growth market OEMs.\nOur Industry\nThe automotive technology and components industry provides critical technologies, components, systems, subsystems and modules to OEMs for the manufacture of new vehicles, as well as to the aftermarket for use as replacement parts for current production and older vehicles. In addition, the industry is increasingly progressing towards software-defined vehicles becoming critical elements of the overall automotive ecosystem. Overall, we expect long-term growth of global vehicle sales and production in the OEM market. In 2024, the industry experienced decreased global customer sales and production schedules, and increased inventory levels, primarily driven by various global uncertainties and global inflationary pressures. Global automotive vehicle production decreased 1% (3% on an Aptiv weighted market basis, which represents global vehicle production weighted to the geographic regions in which the Company generates its revenue) from 2023 to 2024, reflecting \n6\nTable of Contents\nvehicle production declines of 5% in Europe and 2% in North America, partially offset by increased production of 4% in China and 3% in South America, our smallest region. Demand for automotive components in the OEM market is generally a function of the number of new vehicles produced in response to consumer demand, which is primarily driven by macro-economic factors such as credit availability, interest rates, fuel prices, consumer confidence, employment and other trends. Although OEM demand is tied to actual vehicle production, participants in the automotive technology and components industry also have the opportunity to grow through increasing product content per vehicle by further penetrating business with existing customers and in existing markets, gaining new customers and increasing their presence in global markets. We believe that evolving entrants into the global transportation industry such as mobility providers, electric vehicle developers and smart cities will provide additional markets for our advanced technologies. We believe that as a company with a global presence and advanced technology, engineering, manufacturing and customer support capabilities, we are well-positioned to benefit from these opportunities.\nWe believe that continuously increasing societal demands have created the three “mega-trends” that serve as the basis for the next wave of market-driven automotive technology advancement. We aim to continue developing leading edge technology focused on addressing these mega-trends, and apply that technology toward products with sustainable margins that enable our customers, both OEMs and others, to produce distinctive market-leading products. We have identified a core portfolio of products that draw on our technical strengths and align with these mega-trends where we believe we can provide differentiation to our customers.\nSafe\n.\n The first mega-trend, “Safe,” represents technologies aimed not just at protecting vehicle occupants when a crash occurs, but those that actually proactively reduce the risk of a crash occurring. OEMs continue to focus on improving occupant and pedestrian safety in order to meet increasingly stringent regulatory requirements in various markets. As a result, suppliers are focused on developing technologies aimed at protecting vehicle occupants when a crash occurs, as well as advanced driver assistance systems that reduce driver distractions and automated safety features that proactively mitigate the risk of a crash occurring. Examples of new and alternative technologies that incorporate sophisticated detection and advanced software for collision avoidance include lane departure warning and centering systems, adaptive cruise control and traffic jam assist, and driver and cabin monitoring systems.\nGreen\n.\n The second mega-trend, “Green,” represents technologies designed to help reduce emissions, increase fuel economy and minimize the environmental impact of vehicles. Green is a key mega-trend today because of the convergence of several issues: climate change, volatility in oil prices, an increasing number of vehicles in use worldwide and recent and pending regulation in every region regarding fuel economy and greenhouse gas (“GHG”) emissions. OEMs continue to focus on improving fuel efficiency and reducing emissions in order to meet increasingly stringent regulatory requirements in various markets. On a worldwide basis, the relevant authorities in the largest markets in which we operate have already instituted regulations requiring reductions in emissions and/or increased fuel economy. In many cases, other authorities have initiated legislation or regulation that would further tighten the standards through 2025 and beyond. Based on the current regulatory environment, we believe that OEMs, including those in the U.S., the European Union (the “E.U.”) and China, will be subject to requirements for even greater reductions in carbon dioxide (“CO\n2\n”) emissions over the next ten years. For example, in the U.S., the Environmental Protection Agency (the “EPA”) proposed new rules in 2023 that could require as much as 67% of all light-duty vehicles and 46% of medium-duty vehicles sold in the U.S. by model year 2032 to be all-electric, and the California Air Resources Board approved rules in 2022, which require that all new passenger cars and light trucks sold in California be electric vehicles or other zero-emission models by 2035. In 2023, the E.U. amended regulations, which require that all new passenger cars and vans sold in the E.U. to have zero CO\n2\n emissions by 2035. These and other standards will require meaningful innovation as OEMs and suppliers are challenged to find ways to improve engine management, electrical power consumption, vehicle weight and integration of electric vehicles and alternative technologies. As a result, suppliers are developing innovations that result in significant improvements in fuel economy, emissions and performance for internal combustion engine vehicles. At the same time, suppliers are also developing and marketing new and alternative technologies that support electric vehicles, hybrid vehicles and fuel cell products to improve fuel economy and emissions. We are developing key enabling technologies in the areas of vehicle charging and vehicle power distribution and control that are essential to the introduction of our customers’ electrified vehicle platforms. We are also enabling the trend towards vehicle electrification with high voltage electrification solutions that reduce CO\n2\n emissions and increase fuel economy, helping to make the world greener.\nConnected\n.\n The third mega-trend, “Connected,” represents technologies designed to seamlessly integrate today’s highly complex vehicles into the electronic operating environment, and provide drivers with connectivity to the global information network. The technology content of vehicles continues to increase as consumers demand greater safety, personalization, infotainment, productivity and convenience while driving, which in turn leads to increasing demand for electrical architecture as a foundation for this content. Also, with increased smart device usage in vehicles, driver distractions can be dramatically increased, which in turn results in greater risk of \n7\nTable of Contents\naccidents. We are pioneering vehicle-to-vehicle (V2V) and vehicle-to-infrastructure (V2I) communication technologies which enable vehicles to detect and signal danger, reducing vehicle collisions and improving driver safety, while also maintaining connectivity to an increasing number of devices inside and outside of vehicles. We also utilize advanced connectivity solutions such as over-the-air (OTA) technology that enable vehicles to receive software updates remotely and collect market-relevant data from connected vehicles.\nWe expect these mega-trends to continue to create growth and opportunity for us. We believe we are well-positioned to provide solutions and products to OEMs to expand the electronic and technological content of their vehicles. We also believe electronics integration, which generally refers to products and systems that combine integrated circuits, software algorithms, sensor technologies and mechanical components within the vehicle will allow OEMs to achieve substantial reductions in weight and mechanical complexity, resulting in easier assembly, enhanced fuel economy, improved emissions control and better vehicle performance.\nConvergence of Safe, Green and Connected Solutions\nThe combination of advanced technologies being developed within these mega-trends is contributing to the digital transformation across mission-critical industries. Intelligent, software-defined solutions, such as increasingly capable automated driving technologies, will provide strong societal benefit as well as the opportunity for long-term growth for our product offerings, including new potential customers such as mobility providers, telecommunications network operators and smart cities. Societal benefits of increased vehicle automation include enhanced safety (resulting from collision avoidance and improved vehicle control), environmental improvements (a reduction in CO\n2\n emissions resulting from optimized driving behavior), labor cost savings and improved productivity (as a result of alternate uses for drive time) and unlocking new software and data-driven services. Growth opportunities in this space result from increased content, additional computing power and software requirements, solutions to enhance lifecycle management and connectivity, increased electrification and high-speed data interconnects. We believe the complexity of these systems will also require ongoing software support services, as these vehicle systems will be continuously upgraded with new features and performance enhancements \nAs part of our strategy to harness the full potential of connected intelligent systems across industries, strengthen our capabilities in software-defined mobility and to enable advanced smart vehicle architecture changes, we acquired Wind River Systems, Inc. (“Wind River”) in December 2022. Wind River is a global leader in delivering software for the intelligent edge for multiple industries, including automotive, by leveraging mixed-criticality software products and solutions enabling customers to develop in the cloud, deploy over the air and run and manage software at the vehicle edge. \nWe are also continuing to develop market-leading automated driving solutions such as automated driving software, sensing and perception technologies enhanced through artificial intelligence and machine learning, as well as the underlying architecture technologies capable of supporting safety-critical applications. We believe we are well-aligned with industry technology trends that will help to support sustainable future growth in this space and have partnered with leaders in their respective fields to advance the pace of development and commercialization of these emerging technologies.\nIn March 2020, we completed a transaction with Hyundai Motor Group (“Hyundai”) to form Motional AD LLC (“Motional”), a joint venture focused on the design, development and commercialization of autonomous driving technologies. Although we believe our strategic partnerships have us well-aligned with industry technology mega-trends in these evolving areas, the timeline necessary to produce commercially viable autonomous vehicles has been extended and is still subject to significant uncertainty, which resulted in additional funding requirements for Motional. In April 2024, Aptiv and Hyundai entered into an agreement to restructure Aptiv’s ownership interest in Motional and for Hyundai to provide additional funding to Motional, which also eliminated any requirements for additional future funding from Aptiv. These transactions, which were completed in May 2024, resulted in the reduction of our common equity interest in Motional from 50% as of December 31, 2023 to approximately 15%. The total gain recorded as a result of these transactions was approximately $641 million ($2.50 per diluted share) during the year ended December 31, 2024, within net gain on equity method transactions in the consolidated statements of operations. Refer to Note 5. Investments in Affiliates to the audited consolidated financial statements contained herein for further information on these transactions.\nStandardization of Sourcing by OEMs\nMany OEMs are continuing to adopt global vehicle platforms to increase standardization, reduce per unit cost and increase capital efficiency and profitability. As a result, OEMs are selecting suppliers that have the capability to manufacture products on a worldwide basis as well as the flexibility to adapt to regional variations. Suppliers with global scale and strong design, engineering and manufacturing capabilities, are best positioned to benefit from this trend. OEMs are also increasingly looking to their suppliers to simplify vehicle design and assembly processes to reduce costs and weight. As a result, suppliers that sell vehicle components directly to manufacturers (Tier I suppliers) have assumed many of the design, engineering, research and development and assembly functions traditionally performed by vehicle manufacturers. Suppliers that can provide fully engineered solutions, systems and pre-assembled combinations of component parts are positioned to leverage the trend toward system sourcing.\n8\nTable of Contents\nShorter Product Development Cycles\nAs a result of government regulations and customer preferences, OEMs are requiring suppliers to respond faster with new designs and product innovations. While these trends are more prevalent in mature markets, certain key growth markets are advancing rapidly towards the regulatory standards and consumer preferences of the more mature markets. Suppliers with strong technologies, robust global engineering and development capabilities will be best positioned to meet OEM demands for rapid innovation.\nProducts\nOur organizational structure and management reporting support the management of these core product lines:\nAdvanced Safety and User Experience\n. This segment provides critical technologies and services to enhance vehicle safety, security, comfort and convenience, including sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, cloud-native software platforms, application software, autonomous driving technologies and end-to-end DevOps tools.\n•\nAdvanced Safety primarily consists of solutions that enable advanced safety features and vehicle automation, as well as radar, vision and other sensing technologies.\n•\nUser Experience primarily enables in-cabin solutions around infotainment, driver interface and interior sensing solutions.\n•\nSmart Vehicle Compute and Software primarily consists of zone control and centralized computing platforms, as well as edge-to-cloud tools.\nSignal and Power Solutions\n. This segment provides complete design, manufacture and assembly of the vehicle’s electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management, electrical centers and high voltage and safety-critical distribution systems. Our products provide the signal distribution and computing power backbone that supports increased vehicle content and electrification, reduced emissions, higher fuel economy and off-vehicle connectivity.\n•\nEngineered Components Group consists of high quality connectors engineered primarily for use in automotive and related markets, which also have applications in the industrial, telematics, aerospace, defense and medical sectors, as well as Electrical Centers, which provide centralized electrical power and signal distribution and all of the associated circuit protection and switching devices needed to support the optimization of the overall vehicle electrical system.\n•\nElectrical Distribution Systems, including 48-volt hybrid and high voltage systems, are integrated into one optimized vehicle electrical system that can utilize smaller cable and gauge sizes and ultra-thin wall insulation (this product line makes up approximately 42%, 43% and 44% of our total revenue for the years ended December 31, 2024, 2023 and 2022, respectively).\nCompetition\nAlthough the overall number of our top competitors has decreased due to ongoing industry consolidation, the automotive technology and components industry remains extremely competitive. Furthermore, the rapidly evolving nature of the markets in which we compete has attracted, and may continue to attract, new entrants, particularly in best cost countries such as China and in areas of evolving vehicle technologies such as intelligent systems software, automated driving and mobility solutions, which has attracted competitors from outside the traditional automotive industry. OEMs rigorously evaluate suppliers on the basis of product quality, price, reliability and timeliness of delivery, product design capability, technical expertise and development capability, new product innovation, financial viability, application of lean principles, operational flexibility, customer service and overall management. In addition, our customers generally require that we demonstrate improved efficiencies, through cost reductions and/or price improvement, on a year-over-year basis.\n9\nTable of Contents\nOur key competitors in each of our operating segments include but are not limited to:\nSegment\nCompetitors\nSignal and Power Solutions\n•  Amphenol Corporation\n•  Draexlmaier Group\n•  Lear Corporation\n•  Luxshare Precision Industry Co., Ltd.\n•  Molex, LLC (a subsidiary of Koch, Inc.)\n•  Sumitomo Electric Industries, Ltd.\n•  TE Connectivity plc\n•  Yazaki Corporation\nAdvanced Safety and User Experience\n•  Bosch Group\n•  Continental AG\n•  Denso Corporation\n•  Harman International (a subsidiary of Samsung Electronics)\n•  Hyundai Mobis\n•  LG Electronics\n•  Magna International, Inc.\n•  Panasonic Corporation\n•  Valeo\n•  Visteon Corporation\n•  ZF Friedrichshafen AG\nCustomers\nWe sell our products and services to the major global OEMs in every region of the world. Our ten largest customers accounted for approximately 55% of our total net sales for the year ended December 31, 2024, none of which individually exceeded 10%.\nSupply Relationships with Our Customers\nWe typically supply products to our OEM customers through purchase orders, which are generally governed by general terms and conditions established by each OEM. Although the terms and conditions vary from customer to customer, they typically contemplate a relationship under which our customers place orders for their requirements of specific components supplied for particular vehicles but are not required to purchase any minimum amount of products from us. These relationships typically extend over the life of the related vehicle. Prices are negotiated with respect to each business award, which may be subject to adjustments under certain circumstances, such as commodity or foreign exchange escalation/de-escalation clauses or for cost reductions achieved by us. The terms and conditions typically provide that we are subject to a warranty on the products supplied; in most cases, the duration of such warranty is coterminous with the warranty offered by the OEM to the end-user of the vehicle. We may also be obligated to share in all or a part of recall costs if the OEM recalls its vehicles for defects attributable to our products.\nIndividual purchase orders are terminable for cause or non-performance and, in most cases, upon our insolvency and certain change of control events. In addition, many of our OEM customers have the option to terminate for convenience on certain programs, which permits our customers to impose pressure on pricing during the life of the vehicle program, and issue purchase contracts for less than the duration of the vehicle program, which potentially reduces our profit margins and increases the risk of our losing future sales under those purchase contracts. We manufacture and ship based on customer release schedules, normally provided on a weekly basis, which can vary due to cyclical automobile production or dealer inventory levels.\nAlthough customer programs typically extend to future periods, and although there is an expectation that we will supply certain levels of OEM production during such future periods, customer agreements including applicable terms and conditions do not necessarily constitute firm orders. Firm orders are generally limited to specific and authorized customer purchase order releases placed with our manufacturing and distribution centers for actual production and order fulfillment. Firm orders are typically fulfilled as promptly as possible from the conversion of available raw materials, sub-components and work-in-process inventory for OEM orders and from current on-hand finished goods inventory for aftermarket orders. The dollar amount of such purchase order releases on hand and not processed at any point in time is not believed to be significant based upon the time frame involved.\n10\nTable of Contents\nMaterials\nWe procure our raw materials from a variety of suppliers around the world. Generally, we seek to obtain materials in the region in which our products are manufactured in order to minimize transportation and other costs. The most significant raw materials we use to manufacture our products include copper and resins. As of December 31, 2024, we have not experienced any significant shortages of raw materials, however, as a result of our customers’ recent production volatility and cancellations, our balance of productive, raw and component material inventories has increased substantially from customary levels. These changes to the production environment were primarily driven by the global supply chain disruptions that impacted the automotive industry at times during previous years. We continue to actively monitor and manage inventory levels across all inventory types in order to maximize both supply continuity and the efficient use of working capital. Normally we do not carry inventories of such raw materials in excess of those reasonably required to meet our production and shipping schedules. \nCommodity cost volatility, most notably related to copper, petroleum-based resin products and fuel, is a challenge for us and our industry. Recently, the industry has been subjected to increased pricing pressures, specifically in relation to these commodities, which have experienced significant volatility in price. We have also been impacted globally by increased overall inflation as a result of a variety of global trends. We are continually seeking to manage these and other material-related cost pressures using a combination of strategies, including working with our suppliers to mitigate costs, seeking alternative product designs and material specifications, combining our purchase requirements with our customers and/or suppliers, changing suppliers, hedging of certain commodities and other means. In the case of copper, which primarily affects our Signal and Power Solutions segment, contract clauses have enabled us to pass on some of the price increases to our customers and thereby partially offset the impact of increased commodity costs on operating income for the related products. Other than in the case of copper, our overall success in passing commodity cost increases on to our customers has been limited. However, we have negotiated, and will continue to negotiate as necessary, price increases with our customers in response to global inflationary pressures and the aforementioned global supply chain disruptions. We will continue our efforts to pass market-driven commodity cost increases to our customers in an effort to mitigate all or some of the adverse earnings impacts, including by seeking to renegotiate terms as contracts with our customers expire.\nSeasonality\nIn general, our business is moderately seasonal, as our primary North American customers historically reduce production during the month of July and halt operations for approximately one week in December. Our European customers generally reduce production during the months of July and August and for one week in December. Our Chinese customers generally halt operations for one week during the months of February and October. Shut-down periods in the rest of the world generally vary by country. In addition, automotive production is traditionally reduced in the months of July, August and September due to the launch of component production for new vehicle models.\nPeople\nAs of December 31, 2024, we employed approximately 141,000 people; 31,000 salaried employees and 110,000 hourly employees. In addition, we maintain a contingent workforce of approximately 50,000 to accommodate fluctuations in customer demand. We are a global company serving every major worldwide market. As of December 31, 2024 our workforce is distributed as follows:\n•\n51% in North America, with our largest presence in Mexico;\n•\n31% in the Europe, Middle East and Africa region, with our largest presence in Morocco and Serbia;\n•\n14% in the Asia Pacific region, with our largest presence in China and India; and\n•\n4% in South America, with our largest presence in Brazil.\nAs of December 31, 2024, approximately 50% of our total workforce were women, and approximately 25% of management roles were held by women. \nCertain of our employees are represented worldwide by numerous unions and works councils, including the International Union of Electronic, Electrical, Salaried, Machine and Furniture Workers - Communications Workers of America, IG Metall and the Confederacion De Trabajadores Mexicanos. We maintain collaborative and constructive labor relationships with our employee representatives in order to foster positive employee relations.\nOur Board of Directors reviews Aptiv’s talent strategy, and our Compensation & Human Resources Committee (“CHRC”) reviews employee retention, attrition and pay equity on a continual basis. A key accomplishment in 2024 included sustaining pay equity by race in the United States and gender pay equity among comparable roles globally.\n11\nTable of Contents\nTalent Development\nOur people are central to our mission of developing safer, greener and more connected solutions. We continually strive to create and maintain an environment where innovation thrives and our employees are empowered to think and act like owners. To this end, we continually provide training, coaching and mentoring to our employees at all levels, as well as internal job opportunities including global rotations and stretch assignments to help our employees develop and grow their careers. This dedication to employee growth and development was demonstrated by approximately 70% of our management role openings being filled through internal promotions in 2024. We manage succession planning as part of our monthly operating cadence and segment, technical, and senior executive leadership succession plans are reviewed with the CHRC, Innovation and Technology Committees, and our Board of Directors annually.\nAptiv is committed to talent development and growing the next generation of leaders. Our established career and leadership programs provide our leaders with the tools to be effective today while preparing them for future challenges. Our people consistently complete formal leadership and management training to enhance their abilities. We also leverage Aptiv Academy, our online learning management system, across the business, using in-person, online and virtual reality learning opportunities. We continue to focus on developing great people in order to maximize organizational effectiveness.\nCulture\nAptiv’s culture is a key advantage to how we do business. Our culture is based on a set of distinct values and behaviors that guide us to always do the right thing, the right way. At Aptiv, we value each individual’s perspective and we foster an environment of respect and inclusion. Aptiv participates in, and sponsors numerous outreach programs around the world, which seek to promote and recruit the next generation of talent into science, technology, engineering and mathematical (STEM) fields. Leveraging our employees’ diverse backgrounds and experiences allows us to make better decisions and supports stronger performance. Aptiv is continuing to drive innovation through an inclusive workforce for all, where every individual feels a sense of belonging within the organization.\nCulture is a central pillar in our business and helps to drive consistent leadership behavior across our businesses. We routinely provide training to provide managers and employees with the skills and capabilities that will lead Aptiv into the future. Additionally, we conduct regular employee feedback surveys to ensure our employees have the opportunity to be heard and to measure engagement, which includes assessing each employee’s commitment to our company’s goals and the overall employee experience. In December 2024, 83% of our salaried employees responded to this survey. Aptiv saw a higher participation rate and moved closer to the industry benchmark of 7.9 with a score of 7.7. Aptiv’s score has been consistently in the middle range of the Technology and Manufacturing benchmarks. Our management team actively utilizes feedback at all levels of our organization to continually improve how we engage with our people and improve our operations.\nWe recognize that sustaining a leadership culture requires continual focus and attention. Accordingly, senior executives and leaders throughout the Company commit time, resources and attention to ensure our culture continues to differentiate Aptiv as a great place to work.\nHealth and Safety\nWe prioritize the health, safety and well-being of all our employees by focusing on prevention, training, auditing and risk mitigation in our manufacturing plants, technical centers and offices. We routinely assess occupational health and safety risks, define controls and perform internal audits for all manufacturing sites, assessing, among other things, legal compliance, controls and key workplace safety metrics. We are a leader in workplace safety as reflected in our lost time injury frequency rate of 0.132 cases per million hours worked and our lost workday case rate per 100 employees of 0.026 for the year ended December 31, 2024. Our standard safety management system is aligned with ISO 45001 and we are committed to ensuring all of our manufacturing sites are ISO 45001 certified by 2025. As of December 31, 2024, 85% of our sites are certified under this standard.\nCommitment to Environmental Sustainability\nSustainability has always been core to Aptiv’s business, values and culture. We believe this strong, foundational focus on sustainability makes Aptiv a partner of choice for our customers, a desirable place to work for our employees and a valued contributor to the communities in which we operate. While a key part of our business is to design solutions that help transition the world’s vehicles to cleaner sources of power, we are also committed to reducing our environmental footprint throughout our operations around the globe. We aim to reduce our environmental impact by decreasing our carbon footprint, reducing waste generated and consuming less water in our operations. Expenditures required to meet our environmental sustainability goals, which are described below, are included in our normal budgeting process.\n12\nTable of Contents\nDecreasing our Carbon Footprint\nAptiv has committed to the Science-Based Targets initiative (the “SBTi”) Business Ambition for 1.5℃ campaign, which requires greenhouse gas emissions to be net-zero across Aptiv’s value chain by 2050 at the latest. Our target is to reach net-zero by 2040. Aptiv’s targets were validated by the SBTi in November 2023. To achieve these commitments, we are targeting:\n•\nReducing Scope 1 and 2 absolute CO2e emissions by 100% between the baseline year (2021) and 2030;\n•\nReducing Scope 3 absolute CO2e emissions by 47% between the baseline year and 2030, and achieving 100% reduction by 2040;\n•\nMaintaining annual certification of all major manufacturing sites to the ISO 14001 standard;\n•\nCertifying ten of the most energy-intensive sites to the ISO 50001 certification by 2025;\n•\nSourcing 100% of electricity for operations from renewable sources by 2030; and\n•\nDelivering only carbon-neutral products by 2039, from sourcing to disposal.\nKey to achieving these goals is our global Environmental, Health and Safety and Sustainability management system, which helps to keep us aligned with stringent environmental, health and safety regulations and provides a structure for continuous improvement. This system applies to all Aptiv sites, which means that in some countries our procedures go beyond local regulations and requirements. This system is continuously updated to ensure that our procedures remain up to date.\nReducing our Water Usage and Waste Generated\nWhile our operations are not water intensive, we include water in our environmental risk management approach. We identify locations where we operate that are water-scarce and take action to reduce our water consumption accordingly, while also striving to comply with best practices in lower-risk locations. Our goal is to reduce water consumption in high-risk (water-scarce) locations by 2% per year through 2025.\nWe are also committed to reducing waste, with a waste recycled target (volume of recycled waste divided by total waste volume) of 80%. We continue to strive to actively reduce and manage waste across our manufacturing operations, as well as in our offices. We are creating packaging that uses less material and we continue to strive to increase the share of waste and excess materials we divert to recycling.\nAdditional Sustainability Information\nAdditional information regarding our environmental sustainability and human capital initiatives, as well as information on our progress towards our commitments, is available in our annual Sustainability Report located on our website at \nwww.aptiv.com/about/sustainability\n. Nothing on our website, including the aforementioned Sustainability Report, shall be deemed incorporated by reference into this Annual Report.\n13\nTable of Contents\nSUPPLEMENTARY ITEM. EXECUTIVE OFFICERS OF THE REGISTRANT\nThe name, age (as of February 1, 2025), current positions and description of business experience of each of our executive officers are listed below. Our executive officers are elected annually by the Board of Directors and hold office until their successors are elected and qualified or until the officer’s resignation or removal. Positions noted below reflect current service to Aptiv PLC and prior service to Delphi Automotive PLC and Delphi Automotive LLP.\nKevin P.\n \nClark\n, 62, is chairman of Aptiv’s board of directors and chief executive officer (CEO) of the company. Mr. Clark was named president and CEO and became a member of the board in March 2015. Previously, Mr. Clark was chief operating officer (COO) from October 2014 to March 2015. Prior to the COO position, Mr. Clark was chief financial officer and executive vice president from February 2013. He was appointed vice president and chief financial officer in July 2010. Previously, Mr. Clark was a founding partner of Liberty Lane Partners, LLC, a private-equity investment firm focused on building and improving middle-market companies. Prior to Liberty Lane Partners, Mr. Clark served as the chief financial officer of Fisher-Scientific International Inc., a manufacturer, distributor and service provider to the global healthcare market. Mr. Clark served as Fisher-Scientific’s chief financial officer from the company’s initial public offering in 2001 through the completion of its merger with Thermo Electron Corporation in 2006. Prior to becoming chief financial officer, Mr. Clark served as Fisher-Scientific’s corporate controller and treasurer.\nVarun Laroyia\n, 53,\n \nis Aptiv’s executive vice president and chief financial officer, effective November 2024. He joined Aptiv from LKQ Corporation, a leading provider of alternative and specialty parts to repair and accessorize automobiles and other vehicles, where he most recently served as senior advisor, following roles as chief executive officer, LKQ Europe from 2022 to 2023 and executive vice president and chief financial officer from 2017 to 2022. Prior to serving at LKQ, Mr. Laroyia served as chief financial officer, Global Workplace Solutions for CBRE Group, Inc. from 2015 to 2017 and, prior to that, in a variety of roles of increasing responsibility at Johnson Controls, Gateway, General Electric and KPMG in Europe and North America.\nAllan J. Brazier\n, 58, is vice president and chief accounting officer of Aptiv, a position he has held since February 2011. Mr. Brazier joined the Company in June 2005 as senior manager of technical accounting and reporting, and prior to his current role served as assistant controller of technical accounting and reporting. Prior to joining Aptiv, Mr. Brazier was employed for seventeen years in financial roles of increasing responsibility at various companies. Mr. Brazier is a Certified Public Accountant and began his career with the international public accounting firm of KPMG.\nJaved Khan\n, 52, is president of Software and Advanced Safety and User Experience, a position he has held since August 2024. Before joining Aptiv, he served as senior vice president and general manager of Cisco Collaboration, and prior to his tenure at Cisco, Mr. Khan was the vice president of Enterprise and Consumer Security products at Symantec. He began his career as an engineer at Novell, before moving to leadership roles at Symantec.\nJoseph T. Liotine\n, 52, is executive vice president, Electrical Distribution Systems, a position he has held since November 2024. Mr. Liotine joined Aptiv in April 2024 as president, Signal and Power Solutions. Prior to joining Aptiv, Mr. Liotine served as chief executive officer at Briggs & Stratton, and previously, he spent nearly 20 years in senior executive roles at Whirlpool Corporation, most recently as president and chief operating officer, where he led the global appliance business. Mr. Liotine began his career at PepsiCo, where he held several positions within sales and procurement.\nObed D. Louissaint\n, 45, is Aptiv’s executive vice president and chief people officer. He joined Aptiv as senior vice president in January 2023 and was elevated to executive vice president in March 2024. He joined Aptiv from IBM, where he was senior vice president, Transformation and Culture from August 2020 through December 2022. He previously served as vice president, Talent, Watson Health & Employee Experience from 2019 to 2020 and vice president, Human Resources, IBM Watson, Watson Health, Research, Technical Talent & Corporate from 2015 to 2020. He began his IBM career in 2001 and held several human resources positions of increasing responsibility. Before joining IBM, Mr. Louissaint was president at Student Agencies, Inc.\nBenjamin Lyon\n, 45, is senior vice president and chief technology officer of Aptiv, effective December 2022. He joined Aptiv from Astra Space, Inc., a provider of space products and launch services to the global space industry, where he was chief engineer and executive vice president, Operations and Engineering from February 2021 through December 2022. Prior to joining Astra, Mr. Lyon served as senior director – Special Projects Group at Apple Inc. from April 2014 to February 2021. Mr. Lyon joined Apple in 1999, and while there, held several positions of increasing responsibility.\n14\nTable of Contents\nJoseph R. Massaro\n, 55, is Aptiv’s vice chairman, Engineered Components Group, a position he has held from November 2024. Mr. Massaro joined the Company in October 2013 as vice president, Internal Audit, and in September 2014 was appointed to the position of vice president, corporate controller. In March 2016, he was named senior vice president and chief financial officer. In September 2020, he also assumed the role of senior vice president, business operations, and in 2024, was elevated to vice chairman, business operations and chief financial officer. Previously, Mr. Massaro was a managing director at Liberty Lane Partners from 2008 to 2010. He also served as chief financial officer of inVentiv Health Inc. from 2010 to 2013, a Liberty Lane portfolio company. Prior to Liberty Lane, he served in a variety of finance and operational roles at Thermo Fisher Scientific from 2002 to 2007, including senior vice president of Global Business Services where his responsibilities included the global sourcing and information technology functions. Prior to the merger with Thermo Electron, he also served as vice president and corporate controller of Fisher Scientific and held several other senior finance positions.\nKatherine H. Ramundo\n, 57, is executive vice president, chief legal officer, chief compliance officer and secretary of Aptiv. She joined Aptiv as senior vice president, chief legal officer, chief compliance officer and secretary of Aptiv in March 2021, and was elevated to executive vice president in March 2024. Prior to joining Aptiv, Ms. Ramundo was executive vice president, chief legal officer and secretary of Howmet Aerospace Inc. (formerly Arconic Inc.), a leading global provider of advanced engineered solutions for the aerospace and transportation industries, a role she held from November 2016 to February 2021. Prior to joining Howmet Aerospace, Ms. Ramundo was executive vice president, general counsel and secretary of ANN, Inc., the owner of the Ann Taylor and LOFT brands. Previously, Ms. Ramundo served as vice president, deputy general counsel and assistant secretary of Colgate-Palmolive. Among her other positions during her 15-year tenure at Colgate, she served as general counsel of the Europe/South Pacific division, and later managed global specialty legal activities. She began her career as a litigator, practicing at major New York-based law firms, including Cravath, Swaine & Moore and Sidley Austin.\n15\nTable of Contents",
    "item1a": "Item 1A. Risk Factors of this Annual Report on Form 10-K — “We face risks related to cybersecurity for both our infrastructure and products and any cybersecurity breach or failure of one or more key information technology systems, or those of third-parties with which we do business could have a material adverse impact on our business or reputation.”",
    "item1c": "ITEM 1C. CYBERSECURITY\nAptiv has a risk-based cybersecurity program, dedicated to protecting our data, products and information technology systems as well as data belonging to our customers, suppliers and employees. Our ability to keep our business operating effectively depends on the functional and efficient operation of information technology capabilities, both internally and externally. Our capabilities, as well as those of our customers, suppliers, partners and service providers, are crucial to our operations and may contain confidential personal information, sensitive business-related information or intellectual property. These capabilities are also susceptible to interruptions (including those caused by systems failures, cyber-attacks and other natural or man-made incidents or disasters), which may be prolonged or go undetected.\nRisk Management and Strategy\nOur cross-functional cybersecurity teams are responsible for addressing both enterprise and product cybersecurity risks. These teams, which are comprised of experts both within the organization and externally, utilize a defensive cybersecurity strategy with multiple layers of cybersecurity controls to protect our data (and data of others in our possession), systems and products.\nEnterprise and product cybersecurity are incorporated into the Company’s overall risk management process. On a monthly basis, the Company’s cross-functional Enterprise Risk Management Committee meets to discuss short-term and long-term enterprise-wide risks and necessary action plans to mitigate those risks. The Chief Information Security Officer (the “CISO”) regularly presents to the Company’s Enterprise Risk Management Committee on key cybersecurity risks, threats and developments, as well as the Company’s strategies to mitigate those risks.\nEnterprise Cybersecurity\nThe Company’s Enterprise Cybersecurity team, led by the Chief Information Officer (“CIO”), is responsible for identifying, assessing the severity of, managing and remediating cybersecurity risks to the Company’s information technology infrastructure. Risks are identified through vulnerability hunting, infrastructure penetration testing, threat intelligence activities and other processes defined by the infrastructure Governance, Risk and Compliance (“GRC”) assessment program utilized by the Company. Furthermore, this team seeks to reduce cybersecurity risks through a number of activities, including annual cybersecurity training for the majority of the Company’s employees, phishing tests, compliance assessments, vulnerability and noncompliance remediation and the implementation and maintenance of new cybersecurity technology.\n Third-party service providers are also utilized by the Enterprise Cybersecurity team to play a supporting role in incident response, threat intelligence, firewall management, vulnerability management and endpoint management and detection. \n29\nTable of Contents\nAptiv is also exposed to cybersecurity risks at third-parties, such as suppliers, customers, service providers and consultants. Third-party risk to the Company is identified through an internal third-party risk management process, which involves analyzing third parties for cybersecurity risk at onboarding and throughout the duration of their relationship with the Company. For third-parties with a high cyber risk, we also utilize external firms to monitor such third-parties for threats and to provide remediation support as needed.\nProduct Cybersecurity\nThe Company’s Product Cybersecurity team, led by the Chief Technology Officer (the “CTO”), is responsible for assessing and managing the Company’s cybersecurity risk as it relates to Aptiv’s product portfolio. Risks are identified through threat intelligence, security testing, including penetration testing, audits and other processes defined by the Company’s product cybersecurity GRC program. The processes by which the Product Cybersecurity team manages automotive product security risks have been audited, assessed and certified as compliant with various applicable international regulatory standards by independent third-party auditors.\nGovernance\nEnterprise Cybersecurity\nThe Company’s Enterprise Cybersecurity Security Operation’s Center (“SOC”), which is supervised by the CIO, is responsible for identifying, assessing and managing the Company’s risks from cybersecurity threats, as well as for responding to cybersecurity incidents. The SOC management team carries a diverse array of applicable cybersecurity and information technology credentials and generally has over twenty years of experience in cybersecurity. When an infrastructure cybersecurity incident occurs, the SOC initiates communications to the appropriate groups within the Company, which may include various members of the Company’s management, including the Chief Executive Officer, Chief Financial Officer, Chief Legal Officer and Chief Operating Officer.\nDepending on the severity and the nature of the incident, an investigation and impact mitigation protocols may be triggered. External experts or agencies may also be engaged in accordance with the Company’s policies and procedures. Upon conclusion of the active investigation of an incident, the SOC is required to identify the cause of the incident, formally report to Company leadership, and initiate changes to protect against a recurrence of the incident, among other procedures.\nTable top exercises are also held annually and are designed to practice and validate existing incident response plans, as well as to identify the plans’ respective strengths and weaknesses. These exercises test the response capabilities of both technical and executive level resources, including key vice presidents, senior company leaders and cross-functional capabilities, such as with the Product Cybersecurity team as well as with the Legal, Privacy and Sales teams.\nProduct Cybersecurity\nThe Product Security Incident Response Team (the “PSIRT”), which is supervised by the CTO, is responsible for responding to product related cybersecurity incidents, which at times involve collaborating with the Enterprise Cybersecurity SOC. The PSIRT team regularly analyzes vulnerabilities reported by threat intelligence and public vulnerability reporting databases and determines whether any of those vulnerabilities are present in the Company’s products. Vulnerabilities identified are reviewed by the Vice President of Product Security on a weekly basis with involvement from the CTO and the Company’s legal staff as necessary. For all vulnerabilities identified, the PSIRT reviews whether adequate mitigations are already in place. In situations where adequate mitigations are not present, the PSIRT works with the customer to address the concern which may involve adding additional mitigations to the product.\nBoard of Directors Oversight\nThe Company’s Board of Directors (the “Board”) takes an active role in risk oversight related to cybersecurity matters, primarily through the Audit Committee (the “AC”), which covers enterprise cybersecurity risk, and the Innovation and Technology Committee (the “ITC”), which covers product cybersecurity risk. The Board, individually and through the AC and ITC, regularly reviews relevant information technology and cybersecurity matters and receives periodic updates from information technology and cybersecurity subject matter experts as part of its risk assessment procedures, including analysis of existing and emerging risks, as well as plans and strategies to address those risks. In connection with the Board’s risk management oversight responsibility, the entire Board receives a full briefing from management annually on cybersecurity matters, as well as periodic briefings based on specific requests or current events. On a regular basis, the Board also reviews the Company’s enterprise risk management program, within which the Company’s cybersecurity processes have been integrated, as described above.\n30\nTable of Contents\nThe Board and AC regularly review the identification and management of enterprise cybersecurity risks and review regular reports from management on system vulnerabilities and security measures in effect to deter or mitigate breaches or hacking activities. The AC also reviews our guidelines and policies with respect to risk assessment and management of our major financial and information technology risk exposures, including enterprise cybersecurity, along with the monitoring and mitigation of identified exposures. \nThe Board and ITC regularly review the identification and management of product cybersecurity risks and review regular reports from management on risks and mitigation strategies in effect to reduce product cybersecurity risk. The ITC also reviews our guidelines and policies with respect to risk assessment and management of product security risks, including both our approach toward a secure systems development lifecycle and product security incident response.\nIn 2024, we did not identify any cybersecurity threats that have materially affected or are reasonably likely to materially affect our business strategy, results of operations, or financial condition. However, despite our efforts, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced an undetected cybersecurity incident. For more information about these risks, please refer to",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe have no unresolved SEC staff comments to report."
  }
}